{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 437,
        "data": [
            {
                "id": 11189,
                "hadithNumber": "3625",
                "englishNarrator": "Umm Salama (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married her, and he (the narrator) made mention of so many things in this connection (and one of them was this) that he said: If you desire that I spend a week with you, I shall have to spend a week with my (other) wives, and if spend a week with you, I shall have to spend a week with my (other) wives.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ان ( ام سلمہ رضی اللہ عنہا ) سے شادی کی ، اور بہت سی باتوں کا ذکر کیا ، ان میں یہ بات بھی تھی : آپ نے فرمایا : \" اگر تم چاہو کہ میں تمہارے ہاں سات سات دن قیام کروں ( تو ہو سکتا ہے ) اور اگر میں نے تمہارے ہاں سات دن قیام کیا تو اپنی ساری بیویوں کے ہاں سات سات دن قیام کروں گا.",
                "urduNarrator": "مجھ سے ابو کریب محمد بن اعلا نے بیان کیا، ہم سے حفص یعنی ابن غیث نے بیان کیا, عبدالواحد بن ایمن نے ابوبکر بن عبدالرحمٰن سے ، انہوں نے ام سلمہ رضی اللہ عنہا سے روایت کی ، انہوں ( عبدالواحد ) نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، حَدَّثَنَا حَفْصٌ يَعْنِي ابْنَ غِيَاثٍ، عَنْ عَبْدِ الْوَاحِدِ بْنِ أَيْمَنَ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أُمِّ سَلَمَةَ، ذَكَرَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تَزَوَّجَهَا، وَذَكَرَ أَشْيَاءَ هَذَا فِيهِ، قَالَ: «إِنْ شِئْتِ أَنْ أُسَبِّعَ لَكِ، وَأُسَبِّعَ لِنِسَائِي، وَإِنْ سَبَّعْتُ لَكِ، سَبَّعْتُ لِنِسَائِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11190,
                "hadithNumber": "3626",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "When anyone who has already a wife marries virgin, he should stay with her for seven nights (and then turn to his other wife), but when anyone having a virgin with him (as his wife) marries a woman who has been previously married he should stay with her for three nights. Khalid (one of the narrators) said. If I were to say that it could be directly traced to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). I would have told the truth, but he (Hadrat Anas) said: Such is the tradition.",
                "hadithUrdu": "جب کوئی دوہاجو جو ( ثیبہ ) کے بعد باکرہ سے شادی کرے تو اس کے ہاں سات دن قیام کرے اور جب باکرہ کے بعد کسی ثیبہ سے شادی کرے تو اس کے ہاں تین دن قیام کرے ۔ خالد نے کہا : اگر میں کہوں کہ انہوں نے اسے مرفوعا بیان کیا ہے ، تو میں سچ کہوں گا لیکن انہوں نے کہا تھا : سنت اسی طرح ہے ۔ ( یہ حدیث کو مرفوع کرنے کے مترادف ہے)",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا ہشیم نے ہمیں خالد سے خبر دی ، انہوں نے ابوقلابہ سے ، انہوں نے انس بن مالک رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ خَالِدٍ، عَنْ أَبِي قِلَابَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: «إِذَا تَزَوَّجَ الْبِكْرَ عَلَى الثَّيِّبِ، أَقَامَ عِنْدَهَا سَبْعًا، وَإِذَا تَزَوَّجَ الثَّيِّبَ عَلَى الْبِكْرِ، أَقَامَ عِنْدَهَا ثَلَاثًا»، قَالَ خَالِدٌ: وَلَوْ قُلْتُ إِنَّهُ رَفَعَهُ لَصَدَقْتُ، وَلَكِنَّهُ قَالَ: السُّنَّةُ كَذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11191,
                "hadithNumber": "3627",
                "englishNarrator": "Abu Qilaba reported on the authority of Anas رضی اللہ عنہ :",
                "hadithEnglish": "It is the Sunnah to stay with a virgin (after having married her) for a week. Khalid (one of the narrators) said: If wish I can say that it can be traced up to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "سنت میں سے ہے کہ ( دلہا ) باکرہ کے ہاں سات راتیں قیام کرے ۔ خالد نے کہا : اگر میں چاہوں تو کہہ سکتا ہوں : انہوں نے اسے نبی صلی اللہ علیہ وسلم سے مرفوعا بیان کیا ہے.",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، انہوں نے بیان کیاسفیان نے ایوب اور خالد حذاء سے خبر دی ، انہوں نے ابوقلابہ سے ، انہوں نے حضرت انس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَيُّوبَ، وَخَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلَابَةَ، عَنْ أَنَسٍ، قَالَ: «مِنَ السُّنَّةِ أَنْ يُقِيمَ عِنْدَ الْبِكْرِ سَبْعًا» قَالَ خَالِدٌ: وَلَوْ شِئْتُ قُلْتُ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11192,
                "hadithNumber": "3628",
                "englishNarrator": "Anas ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had nine wives. So when he divided (his stay) with them, the turn of the first wife did not come but on the ninth (day). They (all the wives) used to gather every night in the house of one where he had to come (and stay that night). It was (the night when he had to stay) in the house of 'A'isha (رضی اللہ عنہا ), when Zainab رضی اللہ عنہا came there. He (the Holy Prophet) stretched his hand towards her (Zainab), whereupon she ('A'isha رضی اللہ عنہا ) said: It is Zainab. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) withdrew his hand. There was an altercation between the two until their voices became loud (and it was at that time) when Iqama was pronounced for prayer. There happened to come Abu Bakr رضی اللہ عنہ and he heard their voices and said: Messenger of Allah, (kindly) come for prayer, and throw dust in their mouths. So the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went out. 'A'isha رضی اللہ عنہا said: When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) would finish his prayer there would also come Abu Bakr رضی اللہ عنہ and he would do as he does (on such occasions, i.e. reprimanding). When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had finished his prayer, there came to her Abu Bakr رضی اللہ عنہ , and spoke to her ('A'isha رضی اللہ عنہا) in stern words and said: Do you behave like this?",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کی نو بیویاں تھیں ، جب آپ ان میں باری تقسیم فرماتے تو پہلی باری والی بیوی کے پاس نویں رات ہی پہنچتے ۔ وہ سب ہر رات اس ( بیوی کے ) گھر میں جمع ہو جاتی تھیں جہاں نبی صلی اللہ علیہ وسلم تشریف فرما ہوتے ، حضرت زینب رضی اللہ عنہا آئیں تو آپ نے اپنا ہاتھ ان کی طرف پھیلایا ۔ انہوں ( عائشہ رضی اللہ عنہا ) نے کہا : یہ زینب ہیں آپ نے اپنا ہاتھ روک لیا ، اس پر ان دونوں میں تکرار ہو گئی حتی کہ ان کی آوازیں بلند ہو گئیں ، اور ( اسی دوران میں ) نماز کی اامت ہو گئی ، حضرت ابوبکر رضی اللہ عنہ کا وہاں سے گزر ہوا ، انہوں نے ان کی آوازیں سنیں تو کہا : اے اللہ کے رسول! آپ نماز کے لیے تشریف لائیے اور ان کے منہ میں مٹی ڈالیے ۔ نبی صلی اللہ علیہ وسلم باہر تشریف لائے تو حضرت عائشہ رضی اللہ عنہا نے کہا : ابھی نبی صلی اللہ علیہ وسلم اپنی نماز پوری کریں گے تو ابوبکر رضی اللہ عنہ آئیں گے وہ مجھے ایسے ایسے ( ڈانٹ ڈپٹ ) کریں گے ۔ جب نبی صلی اللہ علیہ وسلم نے نماز مکمل کی ، ابوبکر رضی اللہ عنہ ان ( حضرت عائشہ رضی اللہ عنہا ) کے پاس آئے اور انہیں سخت سرزنش کی ۔ اور کہا : کیا تم ایسا کرتی ہو؟",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے شبابہ بن سو ار نے بیان کیا، ہم سے سلیمان بن المغیرہ نے بیان کیا، ثابت کی سند سے، انہوں نے انس رضی اللہ عنہ سے بیان کیا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ: كَانَ لِلنَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تِسْعُ نِسْوَةٍ، فَكَانَ إِذَا قَسَمَ بَيْنَهُنَّ، لَا يَنْتَهِي إِلَى الْمَرْأَةِ الْأُولَى إِلَّا فِي تِسْعٍ، فَكُنَّ يَجْتَمِعْنَ كُلَّ لَيْلَةٍ فِي بَيْتِ الَّتِي يَأْتِيهَا، فَكَانَ فِي بَيْتِ عَائِشَةَ، فَجَاءَتْ زَيْنَبُ، فَمَدَّ يَدَهُ إِلَيْهَا، فَقَالَتْ: هَذِهِ زَيْنَبُ، فَكَفَّ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَهُ، فَتَقَاوَلَتَا حَتَّى اسْتَخَبَتَا، وَأُقِيمَتِ الصَّلَاةُ، فَمَرَّ أَبُو بَكْرٍ عَلَى ذَلِكَ، فَسَمِعَ أَصْوَاتَهُمَا، فَقَالَ: اخْرُجْ يَا رَسُولَ اللهِ إِلَى الصَّلَاةِ، وَاحْثُ فِي أَفْوَاهِهِنَّ التُّرَابَ، فَخَرَجَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ عَائِشَةُ: الْآنَ يَقْضِي النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَلَاتَهُ، فَيَجِيءُ أَبُو بَكْرٍ فَيَفْعَلُ بِي وَيَفْعَلُ، فَلَمَّا قَضَى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَلَاتَهُ، أَتَاهَا أَبُو بَكْرٍ، فَقَالَ لَهَا قَوْلًا شَدِيدًا، وَقَالَ: أَتَصْنَعِينَ هَذَا.",
                "headingArabic": "الْقَسْمِ بَيْنَ الزَّوْجَاتِ وَبَيَانِ أَنَّ السُّنَّةَ أَنْ تَكُونَ لِكُلِّ وَاحِدَةٍ لَيْلَةٌ مَعَ يَوْمِهَا",
                "headingUrdu": "شریک بیویوں میں وقت کی تقسیم؛ سنت ہے ہر ایک کے لیے ایک رات اور ایک دن",
                "headingEnglish": "Dividing one's time among co-wives; The Sunnah is for each one to have one night and one day",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11193,
                "hadithNumber": "3629",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Never did I find any woman more loving to me than Sauda bint Zam'a رضی اللہ عنہا . I wished I could be exactly like her who was passionate. As she became old, she had made over her day (which she had to spend) with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to 'A'isha رضی اللہ عنہا . She said: I have made over my day with you to 'A'isha رضی اللہ عنہا. So Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) allotted two days to 'A'isha رضی اللہ عنہا, her own day (when it was her turn) and that of Sauda رضی اللہ عنہا .",
                "hadithUrdu": "میں نے کوئی عورت نہیں دیکھی جو مجھے سودہ بنت زمعہ رضی اللہ عنہا کی نسبت زیادہ پسندیدہ ہو کہ میں اس کے پیکر میں ہوں ( اس جیسی بن جاؤں ) ایک ایسی خاتون کی نسبت جن میں کچھ گرم مزاجی ( بھی ) تھی ، کہا : جب وہ بوڑھی ہو گئیں تو انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اپنی باری کا دن حضرت عائشہ رضی اللہ عنہا کو دے دیا ۔ انہوں نے کہا : اے اللہ کے رسول! میں نے آپ کے ساتھ اپنی باری کا دن حضرت عائشہ رضی اللہ عنہا کو دے دیا ہے ۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم عائشہ رضی اللہ عنہا کو دو دن دیتے ، ایک ان کا دن اور ایک حضرت سودہ رضی اللہ عنہا کا دن.",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، انہوں نے بیان کیا جریر نے ہمیں ہشام بن عروہ سے حدیث بیان کی ، انہوں نے اپنے والد ( عروہ بن زبیر ) سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: مَا رَأَيْتُ امْرَأَةً أَحَبَّ إِلَيَّ أَنْ أَكُونَ فِي مِسْلَاخِهَا مِنْ سَوْدَةَ بِنْتِ زَمْعَةَ، مِنِ امْرَأَةٍ فِيهَا حِدَّةٌ، قَالَتْ: فَلَمَّا كَبِرَتْ، جَعَلَتْ يَوْمَهَا مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِعَائِشَةَ، قَالَتْ: يَا رَسُولَ اللهِ، قَدْ جَعَلْتُ يَوْمِي مِنْكَ لِعَائِشَةَ، «فَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقْسِمُ لِعَائِشَةَ يَوْمَيْنِ، يَوْمَهَا وَيَوْمَ سَوْدَةَ».",
                "headingArabic": "جَوَازِ هِبَتِهَا نَوْبَتَهَا لِضَرَّتِهَا ‏‏",
                "headingUrdu": "بیوی کے لیے اپنی باری شریک بیوی کو دینا جائز ہے۔",
                "headingEnglish": "It is permissible for a wife to give her turn to a co-wife",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11194,
                "hadithNumber": "3630",
                "englishNarrator": "A hadith like this has been transmitted on the authority of Hisham with the same chain of narrators (and the words are):",
                "hadithEnglish": "When Sauda رضی اللہ عنہا became old (the rest of the hadith is the same) and in the narration of Sharik there is an addition (of these words: She was the first woman whom he (Allah's Apostle ﷺ) married after me.",
                "hadithUrdu": "حضرت سودہ رضی اللہ عنہا جب بوڑھی ہو گئیں ۔ ۔ ۔ آگے جریر کی حدیث کے ہم معنی ہے اور شریک کی حدیث میں یہ اضافہ ہے : وہ پہلی خاتون تھیں جن سے آپ صلی اللہ علیہ وسلم نے میرے بعد نکاح کیا.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عقبہ بن خالد نے بیان کیا، کہا ہم سے عمرو نا قد نے بیان کیا، ہم سے اسود بن عامر نے بیان کیا، انہوں نے کہا ہم سے زہیر، مجاہد بن موسیٰ نے بیان کیا، ہم سے یونس بن محمد نے بیان کیا، ہم سے شاریک نے بیان کیا، یہ سب ہشام کی سند سے اس سند کے ساتھ ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا عقبہ بن خالد ، زہیر اور شریک ، ان سب نے ہشام سے اسی سند کے ساتھ روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ، ح وحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا زُهَيْرٌ، ح وحَدَّثَنَا مُجَاهِدُ بْنُ مُوسَى، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَرِيكٌ، كُلُّهُمْ عَنْ هِشَامٍ، بِهَذَا الْإِسْنَادِ، أَنَّ سَوْدَةَ لَمَّا كَبِرَتْ بِمَعْنَى حَدِيثِ جَرِيرٍ، وَزَادَ فِي حَدِيثِ شَرِيكٍ، قَالَتْ: وَكَانَتْ أَوَّلَ امْرَأَةٍ تَزَوَّجَهَا بَعْدِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11195,
                "hadithNumber": "3631",
                "englishNarrator": "A'isha ( رضی اللہ عنہا) reported:",
                "hadithEnglish": "I felt jealous of the women who offered themselves to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Then when Allah, the Exalted and Glorious, revealed this: You may defer any one of them you wish, and take to yourself any you wish; and if you desire any you have set aside (no sin is chargeable to you) (xxxiii. 51), I ('A'isha رضی اللہ عنہا) said: It seems to me that your Lord hastens to satisfy your desire.",
                "hadithUrdu": "میں ان عورتوں پر غیرت کرتی تھی جو اپنے آپ کو رسول اللہ صلی اللہ علیہ وسلم کے سامنے بطور ہبہ پیش کرتی تھیں ، میں کہتی : کیا کوئی عورت بھی خود کو ہبہ کر سکتی ہے؟ جب اللہ تعالیٰ نے نازل فرمایا : \" آپ ان عورتوں میں سے جسے چاہیں پیچھے کر دیں اور جسے چاہیں اپنے پاس جگہ دیں اور جسے آپ نے الگ کر دیا تھا ان میں سے بھی جسے آپ کا دل چاہے لائیں ۔ \" کہا : تو میں نے کہا : اللہ کی قسم! میں آپ کے رب کو نہیں دیکھتی مگر وہ آپ کے لیے آپ کی خواہش ( کو پورا کرنے ) میں جلدی کرتا ہے.",
                "urduNarrator": "ہم سے ابو کریب محمد بن علاء نے بیان کیا، انہوں نے کہا ابواسامہ نے ہمیں ہشام سے حدیث بیان کی ، انہوں نے اپنے والد ( عروہ ) سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: كُنْتُ أَغَارُ عَلَى اللَّاتِي وَهَبْنَ أَنْفُسَهُنَّ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَقُولُ: وَتَهَبُ الْمَرْأَةُ نَفْسَهَا، فَلَمَّا أَنْزَلَ اللهُ عَزَّ وَجَلَّ: {تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ وَمَنِ ابْتَغَيْتَ مِمَّنْ عَزَلْتَ} [الأحزاب: 51] قَالَتْ: قُلْتُ: «وَاللهِ، مَا أَرَى رَبَّكَ إِلَّا يُسَارِعُ لَكَ فِي هَوَاكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11196,
                "hadithNumber": "3632",
                "englishNarrator": "Hisham reported on the authority of his father:",
                "hadithEnglish": "'A'isha (رضی اللہ عنہا) used to say: Does the woman not feel shy of offering herself to a man? Then Allah the Exalted and Glorious revealed this verse: You may defer any of them you wish and take to yourself any you wish. I ('A'isha رضی اللہ عنہا said): It seems to me that your Lord hastens to satisfy your desire.",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا سےروایت کی ، وہ کہاکرتی تھیں  کیا اس عورت کو حیا محسوس نہیں ہوتی جو خود کو کسی مرد کے لیے ہبہ کرتی ہے ۔ یہاں تک کہ اللہ تعالیٰ نے یہ نازل فرمایا : \" آپ ان عورتوں میں سے جسے چاہیں پیچھے کریں اور جسے چاہیں اپنے پاس جگہ دیں ۔ \" تو میں نے کہا : بلاشبہ آپ کا رب آپ کی خواہش ( کو پورا کرنے ) میں جلدی کرتا ہے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا عبدہ بن سلیمان نے ہشام سے حدیث بیان کی ، انہوں نے اپنے والد ( عروہ ) سے ، انہوں نے",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا كَانَتْ تَقُولُ: أَمَا تَسْتَحِي امْرَأَةٌ تَهَبُ نَفْسَهَا لِرَجُلٍ، حَتَّى أَنْزَلَ اللهُ عَزَّ وَجَلَّ: {تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ} [الأحزاب: 51] ، فَقُلْتُ: «إِنَّ رَبَّكَ لَيُسَارِعُ لَكَ فِي هَوَاكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11197,
                "hadithNumber": "3633",
                "englishNarrator": "Ata related that when they were with Ibn 'Abbas (رضی اللہ عنہ) at the funeral of Maimuna In Sarif, Ibn 'Abbas (رضی اللہ عنہ) said:",
                "hadithEnglish": "This is the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) ; so when you lift her bier, do not shake her or disturb her, but be gentle, for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had nine wives, with eight of whom he shared his time, but to one of them, he did not allot a share. 'Ati said: The one to whom he did not allot a share of time was Safiyya, daughter of Huyayy bin Akhtab رضی اللہ عنہا.",
                "hadithUrdu": "یہ نبی صلی اللہ علیہ وسلم کی اہلیہ ہیں ۔ جب تم ان کی چارپائی اٹھاؤ تو اس کو ادھر اُدھر حرکت دینا نہ ہلانا ، نرمی ( اور احترام ) سے کام لینا ، امر واقع یہ ہے کہ رسول اللہ صلی اللہ علیہ وسلم کی نو بیویاں تھیں ، آپ آٹھ کے لیے باری تقسیم کرتے اور ایک کے لیے تقسیم نہ کرتے تھے ۔ عطاء نے کہا : جن کو آپ باری نہیں دیتے تھے وہ حضرت صفیہ بنت حیی بن اخطب رضی اللہ عنہا تھیں.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم اور محمد بن حاتم نے بیان کیا کہ محمد بن حاتم نے کہا, محمد بن بکر نے ہمیں حدیث بیان کی ، کہا : ہمیں ابن جریج نے خبر دی ، کہا : مجھے عطاء نے خبر دی ، کہا : سرف کے مقام پر ہم حضرت ابن عباس رضی اللہ عنہ کے ساتھ نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت میمونہ رضی اللہ عنہا کے جنازے میں حاضر ہوئے تو ابن عباس رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ حَاتِمٍ، قَالَ مُحَمَّدُ بْنُ حَاتِمٍ: حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَطَاءٌ، قَالَ: حَضَرْنَا مَعَ ابْنِ عَبَّاسٍ جَنَازَةَ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِسَرِفَ، فَقَالَ ابْنُ عَبَّاسٍ: «هَذِهِ زَوْجُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَإِذَا رَفَعْتُمْ نَعْشَهَا، فَلَا تُزَعْزِعُوا، وَلَا تُزَلْزِلُوا، وَارْفُقُوا، فَإِنَّهُ كَانَ عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تِسْعٌ، فَكَانَ يَقْسِمُ لِثَمَانٍ، وَلَا يَقْسِمُ لِوَاحِدَةٍ». قَالَ عَطَاءٌ: الَّتِي لَا يَقْسِمُ لَهَا: صَفِيَّةُ بِنْتُ حُيَيِّ بْنِ أَخْطَبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11198,
                "hadithNumber": "3634",
                "englishNarrator": "It was narrated from Ibn Juraij with chain (a Hadith similar to no. 3633), and he added: Ata said:",
                "hadithEnglish": "She was the last of them to die, and she died in Al-Madinah.",
                "hadithUrdu": "وہ ان سب میں سے ، آخر میں فوت ہونے والی ( میمونہ رضی اللہ عنہا ) تھیں ، وہ مدینہ میں فوت ہوئیں.",
                "urduNarrator": "ہم سب سے محمد بن رافع اور عبد بن حمید نے بیان کیا, عبدالرزاق نے ابن جریج سے اسی سند کے ساتھ روایت کی اور یہ اضافہ کیا کہ عطاء نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، بِهَذَا الْإِسْنَادِ وَزَادَ، قَالَ عَطَاءٌ: كَانَتْ آخِرَهُنَّ مَوْتًا مَاتَتْ بِالْمَدِينَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11199,
                "hadithNumber": "3635",
                "englishNarrator": "Abu Huraira ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A woman may be married for four reasons: for her property, her status. her beauty and her religion, so try to get one who is religious, may your hand be besmeared with dust.",
                "hadithUrdu": "آپ نے فرمایا : \" عورت کے ساتھ چار باتوں کی بنا پر شادی کی جاتی ہے : اس کے مال کی وجہ سے ، اس کے حسب ( ونسب ) کی وجہ سے ، اس کی خوبصورتی کی وجہ سے اور اس کے دین کی وجہ سے ۔ تم دین والی کے ساتھ ( شادی کر کے ) ظفر مند بنو ( کامیابی حاصل کرو ) تمہارے ہاتھ خاک آلود ہوں ۔ \" ( یہ اس بات سے کنایہ ہے کہ تم ہمیشہ کام کرتے رہو).",
                "urduNarrator": "ہم سے زہیر بن حرب، محمد بن المثنی اور عبید اللہ بن سعید نے بیان کیا، انہوں نے کہا کہ ہم سے یحییٰ بن سعید نے بیان کیا، عبید اللہ سے سعید نے بیان کیا۔ ابن ابی سعید اپنے والد کی سند سے,حضرت ابوہریرہ رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ، قَالُوا: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللهِ، أَخْبَرَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: تُنْكَحُ الْمَرْأَةُ لِأَرْبَعٍ: لِمَالِهَا، وَلِحَسَبِهَا، وَلِجَمَالِهَا، وَلِدِينِهَا، فَاظْفَرْ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ.",
                "headingArabic": "اسْتِحْبَابِ نِكَاحِ ذَاتِ الدِّينِ ‏‏",
                "headingUrdu": "اس سے شادی کرنے کی سفارش کی جاتی ہے جو مذہبی طور پر پابند ہو۔",
                "headingEnglish": "It is recommended to marry one who is religiously committed",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11200,
                "hadithNumber": "3636",
                "englishNarrator": "Jabir bin 'Abdullah ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "I married a woman during the lifetime of Allah's Messenger (ﷺ). I met the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon he said: Jabir, have you married? I said: Yes. He said: A virgin or one previously marrried? I said: With due previously married, whereupon he said: Why did you not marry a virgin with whom you could sport? I said: Allah's Messenger, I have sisters; I was afraid that she might intervene between me and them, whereupon he said: Well and good, if it is so. A woman is married for four reasons, for her religion, her property, her status, her beauty, so you should choose one with religion. May your hands cleave to dust.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک عورت سے شادی کی ، میری ملاقات نبی صلی اللہ علیہ وسلم سے ہوئی تو آپ نے پوچھا : \" جابر! تم نے نکاح کر لیا ہے؟ \" میں نے عرض کی : جی ہاں ۔ آپ نے فرمایا : \" کنواری ہے یا دوہاجو ( شوہر دیدہ ) ؟ \" میں نے عرض کی : دوہاجو ۔ آپ نے فرمایا : \" باکرہ سے کیوں نہ کی ، تم اس سے دل لگی کرتے؟ \" میں نے عرض کی : اے اللہ کے رسول! میری بہنیں ہیں تو میں ڈرا کہ وہ میرے اور ان کے درمیان حائل ہو جائے گی ، آپ نے فرمایا : \" پھر ٹھیک ہے ، بلاشبہ کسی عورت سے شادی ( میں رغبت ) اس کے دین ، مال اور خوبصورتی کی وجہ سے کی جاتی ہے ، تم دین والی کو چنو تمہارے ہاتھ خاک آلود ہوں.",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، ہم سے عبدالملک بن ابی سلیمان نے بیان کیا, عطاء سے روایت ہے ، کہا : مجھے جابر بن عبداللہ رضی اللہ عنہ نے خبر دی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللهِ، قَالَ: تَزَوَّجْتُ امْرَأَةً فِي عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَلَقِيتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «يَا جَابِرُ تَزَوَّجْتَ؟» قُلْتُ: نَعَمْ، قَالَ: «بِكْرٌ، أَمْ ثَيِّبٌ؟» قُلْتُ: ثَيِّبٌ، قَالَ: «فَهَلَّا بِكْرًا تُلَاعِبُهَا؟» قُلْتُ: يَا رَسُولَ اللهِ: إِنَّ لِي أَخَوَاتٍ، فَخَشِيتُ أَنْ تَدْخُلَ بَيْنِي وَبَيْنَهُنَّ، قَالَ: «فَذَاكَ إِذَنْ، إِنَّ الْمَرْأَةَ تُنْكَحُ عَلَى دِينِهَا، وَمَالِهَا، وَجَمَالِهَا، فَعَلَيْكَ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11201,
                "hadithNumber": "3637",
                "englishNarrator": "Jabir bin 'Abdullah ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "I married a woman, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to me: Have you married? I said: Yes. He said: Is it a virgin or a previously married one (widow or divorced)? I said: With a previously married one, whereupon he said: Where had you been (away) from the amusements of virgins? Shu'ba said: I made a mention of it to 'Amr bin Dinar and he said: I too heard from Jabir رضی اللہ عنہ making mention of that (that Allah's Apostle ﷺ) said: Why didn't you marry a girl, so that you might sport with her and she might sport with you?",
                "hadithUrdu": "میں نے ایک عورت سے شادی کی تو رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے پوچھا : \"\" کیا تم نے نکاح کیا ہے؟ \"\" میں نے عرض کی : جی ہاں ۔ آپ نے پوچھا : \"\" کنواری سے یا دوہاجو ( ثیبہ ) سے؟ \"\" میں نے عرض کی : دوہاجو سے ۔ آپ نے فرمایا : \"\" تم کنواریوں اور ان کی ملاعبت ( باہم کھیل کود ) سے ( دور ) کہاں رہ گئے؟ \"\" شعبہ نے کہا : میں نے یہ حدیث عمرو بن دینار کے سامنے بیان کی تو انہوں نے کہا : میں نے یہ حدیث حضرت جابر رضی اللہ عنہ سے سنی تھی اور انہوں نے کہا تھا : \"\" تم نے کنواری سے ( شادی ) کیوں نہ کی؟ تم اس کے ساتھ کھیلتے وہ تمہارے ساتھ کھیلتی.",
                "urduNarrator": "ہم سے عبید اللہ بن معاذ نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، انہوں نے کہا شعبہ نے ہمیں محارب سے حدیث بیان کی ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَارِبٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: تَزَوَّجْتُ امْرَأَةً، فَقَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هَلْ تَزَوَّجْتَ؟» قُلْتُ: نَعَمْ، قَالَ: «أَبِكْرًا، أَمْ ثَيِّبًا؟» قُلْتُ: ثَيِّبًا، قَالَ: «فَأَيْنَ أَنْتَ مِنَ الْعَذَارَى، وَلِعَابِهَا»، قَالَ شُعْبَةُ: فَذَكَرْتُهُ لِعَمْرِو بْنِ دِينَارٍ، فَقَالَ: قَدْ سَمِعْتَهُ مِنْ جَابِرٍ، وَإِنَّمَا قَالَ: «فَهَلَّا جَارِيَةً تُلَاعِبُهَا وَتُلَاعِبُكَ».",
                "headingArabic": "اسْتِحْبَابِ نِكَاحِ ذَاتِ الدِّينِ ‏‏",
                "headingUrdu": "اس سے شادی کرنے کی سفارش کی جاتی ہے جو مذہبی طور پر پابند ہو۔",
                "headingEnglish": "It is recommended to marry one who is religiously committed",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11202,
                "hadithNumber": "3638",
                "englishNarrator": "Jabir bin 'Abdullah (رضی اللہ عنہ) reported:",
                "hadithEnglish": "'Abdullah رضی اللہ عنہ died and he left (behind him) nine or seven daughters. I married a woman who had been previously married. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to me: Jabir رضی اللہ عنہ, have you married? I said: Yes. He (again) said: A virgin or one previously married? I said: Messenger of Allah ﷺ, with one who was previously married, whereupon he said: Why didn't you marry a young girl so that you could sport with her and she could sport with you, or you could amuse with her and she could amuse with you? I said to him: 'Abdullah رضی اللہ عنہ died (he fell as martyr in Uhud) and left nine or seven daughters behind him; I, therefore, did not approve of the idea that I should bring a (girl) like them, but I preferred to bring a woman who should look after them and teach them good manners, whereupon he (Allah's Messenger) said: May Allah bless you, or he supplicated (for the) good (to be) conferred on me (by Allah).",
                "hadithUrdu": "( میرے والد ) عبداللہ رضی اللہ عنہ نے وفات پائی اور پیچھے نو بیٹیاں ۔ ۔ یا کہا : سات بیٹیاں ۔ ۔ چھوڑیں تو میں نے ایک ثیبہ ( دوہاجو ) عورت سے نکاح کر لیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے پوچھا : \"\" جابر! نکاح کر لیا ہے؟ \"\" میں نے عرض کی : جی ہاں ۔ آپ نے پوچھا : \"\" کنواری ہے یا دوہاجو؟ \"\" میں نے عرض کی : اللہ کے رسول! دوہاجو ہے ۔ آپ نے فرمایا : \"\" کنواری کیوں نہیں ، تم اس سے دل لگی کرتے ، وہ تم سے دل لگی کرتی ۔ ۔ یا فرمایا : تم اس کے ساتھ ہنستے کھیلتے ، وہ تمہارے ساتھ ہنستی کھیلتی ۔ ۔ \"\" میں نے آپ صلی اللہ علیہ وسلم سے عرض کی : ( میرے والد ) عبداللہ رضی اللہ عنہ نے وفات پائی اور پیچھے نو ۔ ۔ یا سات ۔ ۔ بیٹیاں چھوڑیں ، تو میں نے اچھا نہ سمجھا کہ میں ان کے پاس انہی جیسی ( کم عمر ) لے آؤں ۔ میں نے چاہا کہ ایسی عورت لاؤں جو ان کی نگہداشت کرے اور ان کی اصلاح کرے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ تمہیں برکت دے! \"\" یا آپ نے میرے لیے خیر اور بھلائی کی دعا فرمائی ۔ اور ابوربیع کی روایت میں ہے : \"\" تم اس کے ساتھ دل لگی کرتے وہ تمہارے ساتھ دل لگی کرتی اور تم اس کے ساتھ ہنستے کھیلتے ، وہ تمہارے ساتھ ہنستی کھیلتی.",
                "urduNarrator": "یحییٰ بن یحییٰ اور ابو ربیع زہرانی نے ہمیں حدیث بیان کی ، یحییٰ نے کہا : حماد بن زید نے ہمیں عمرو بن دینار سے خبر دی ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، قَالَ يَحْيَى: أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، أَنَّ عَبْدَ اللهِ هَلَكَ، وَتَرَكَ تِسْعَ بَنَاتٍ - أَوْ قَالَ سَبْعَ - فَتَزَوَّجْتُ امْرَأَةً ثَيِّبًا، فَقَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَا جَابِرُ، تَزَوَّجْتَ؟» قَالَ: قُلْتُ: نَعَمْ، قَالَ: «فَبِكْرٌ، أَمْ ثَيِّبٌ؟» قَالَ: قُلْتُ: بَلْ ثَيِّبٌ يَا رَسُولَ اللهِ، قَالَ: «فَهَلَّا جَارِيَةً تُلَاعِبُهَا وَتُلَاعِبُكَ»، أَوْ قَالَ: «تُضَاحِكُهَا وَتُضَاحِكُكَ»، قَالَ: قُلْتُ لَهُ: إِنَّ عَبْدَ اللهِ هَلَكَ، وَتَرَكَ تِسْعَ بَنَاتٍ - أَوْ سَبْعَ -، وَإِنِّي كَرِهْتُ أَنْ آتِيَهُنَّ أَوْ أَجِيئَهُنَّ بِمِثْلِهِنَّ، فَأَحْبَبْتُ أَنْ أَجِيءَ بِامْرَأَةٍ تَقُومُ عَلَيْهِنَّ، وَتُصْلِحُهُنَّ، قَالَ: «فَبَارَكَ اللهُ لَكَ» أَوْ قَالَ لِي خَيْرًا، وَفِي رِوَايَةِ أَبِي الرَّبِيعِ: «تُلَاعِبُهَا وَتُلَاعِبُكَ، وَتُضَاحِكُهَا وَتُضَاحِكُكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11203,
                "hadithNumber": "3639",
                "englishNarrator": "Jabir bin 'Abdullah ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to me: Jabir, have you married? The rest of the hadith is the same up to (the words): The woman would look after them and comb them. He (Allah's Messenger), said: You did well. But no mention is made of the subsequent portion.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے پوچھا : \" جابر! کیا تم نے نکاح کر لیا ہے؟ \" اور آگے یہاں تک بیان کیا : ایسی عورت جو اُن کی نگہداشت کرے اور ان کی کنگھی کرے ، آپ نے فرمایا : \" تم نے ٹھیک کیا ۔ \" اور انہوں نے اس کے بعد والا حصہ بیان نہیں کیا.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا,سفیان نے ہمیں عمرو سے حدیث بیان کی ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: قَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هَلْ نَكَحْتَ يَا جَابِرُ؟» وَسَاقَ الْحَدِيثَ إِلَى قَوْلِهِ: امْرَأَةً تَقُومُ عَلَيْهِنَّ وَتَمْشُطُهُنَّ، قَالَ: «أَصَبْتَ» وَلَمْ يَذْكُرْ مَا بَعْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11204,
                "hadithNumber": "3640",
                "englishNarrator": "Jabir bin 'Abdullah ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "We were with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in an expedition. When we returned I urged my camel to move quickly as it was slow. There met me a rider from behind me and he goaded it with an iron-tipped stick which he had with him. My camel moved forward like the best that you have ever seen. As I turned (my face) I found him to be Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) He said: Jabir, what hastens you? I said: Messenger of Allah, I am newly wedded. whereupon he said: Is it a virgin that you have married or one previously married? I said: With one previously married. He said: Why not a young girl so that you could play with her and she could play with you? Then when we arrived at and were about to enter Medina he said: Wait, so that we may enter by night (i.e. in the evening) in order that the woman with dishevelled hair may comb it, and the woman whose husband had been away may get herself clean; and when you enter (then you have the) enjoyment (of tho wife's company).",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک غزوے میں شریک تھے ۔ جب ہم واپس ہوئے تو میں نے اپنے سست رفتار اونٹ کو تھوڑا سا تیز کیا ، میرے ساتھ پیچھے سے ایک سوار آ کر ملا انہوں نے لوہے کی نوک والی چھڑی سے جو ان کے ساتھ تھی ، میرے اونٹ کو کچوکا لگایا ، تو وہ اتنا تیز چلنے لگا جتنا آپ نے کسی بہترین اونٹ کو ( تیز چلتے ہوئے ) دیکھا ، آپ نے پوچھا : \"\" جابر! تمہیں کس چیز نے جلدی میں ڈال رکھا ہے؟ \"\" میں نے عرض کی : اللہ کے رسول! میں نے نئی نئی شادی کی ہے ۔ آپ نے پوچھا : \"\" باکرہ سے شادی کی ہے یا ثیبہ ( دوہاجو ) سے؟ \"\" انہوں نے عرض کی : ثیبہ سے ۔ آپ نے فرمایا : \"\" تم نے کسی ( کنواری ) لڑکی سے کیوں نہ کی ، تم اس کے ساتھ دل لگی کرتے ، وہ تمہارے ساتھ دل لگی کرتی؟ \"\" کہا : جب ہم مدینہ آئے ، ( اس میں ) داخل ہونے لگے تو آپ نے فرمایا : \"\" ٹھہر جاؤ ، ہم رات ۔ ۔ یعنی عشاء ۔ ۔ کے وقت داخل ہوں ، تاکہ پراگندہ بالوں والی بال سنوار لے اور جس جس کا شوہر غائب رہا ، وہ بال ( وغیرہ ) صاف کر لے ۔ \"\" اور فرمایا : \"\" جب گھر پہنچنا تو عقل و تحمل سے کام لینا ( حالت حیض میں جماع نہ کرنا).",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، سیار سے,شعبی نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ سَيَّارٍ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ قَالَ: كُنَّا مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي غَزَاةٍ، فَلَمَّا أَقْبَلْنَا تَعَجَّلْتُ عَلَى بَعِيرٍ لِي قَطُوفٍ، فَلَحِقَنِي رَاكِبٌ خَلْفِي، فَنَخَسَ بَعِيرِي بِعَنَزَةٍ كَانَتْ مَعَهُ، فَانْطَلَقَ بَعِيرِي كَأَجْوَدِ مَا أَنْتَ رَاءٍ مِنَ الْإِبِلِ، فَالْتَفَتُّ، فَإِذَا أَنَا بِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «مَا يُعْجِلُكَ يَا جَابِرُ؟» قُلْتُ: يَا رَسُولَ اللهِ، إِنِّي حَدِيثُ عَهْدٍ بِعُرْسٍ، فَقَالَ: «أَبِكْرًا تَزَوَّجْتَهَا، أَمْ ثَيِّبًا؟» قَالَ: قُلْتُ: بَلْ ثَيِّبًا، قَالَ: «هَلَّا جَارِيَةً تُلَاعِبُهَا وَتُلَاعِبُكَ» قَالَ: فَلَمَّا قَدِمْنَا الْمَدِينَةَ، ذَهَبْنَا لِنَدْخُلَ، فَقَالَ: «أَمْهِلُوا حَتَّى نَدْخُلَ لَيْلًا - أَيْ عِشَاءً - كَيْ تَمْتَشِطَ الشَّعِثَةُ، وَتَسْتَحِدَّ الْمُغِيبَةُ» قَالَ: وَقَالَ: «إِذَا قَدِمْتَ فَالْكَيْسَ الْكَيْسَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11205,
                "hadithNumber": "3641",
                "englishNarrator": "Jabir bin  'Abdullah (رضی اللہ عنہ) reported:",
                "hadithEnglish": "I went out with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on an expedition, but my camel delayed me. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to me and said to me: Jabir, I said: Yes. Allah's Messenger, (here I am at your beck and call) He said: What is the matter with you? I said: My camel has delayed me and is tired, so I have lagged behind. He (the Holy Prophet ﷺ) got down and goaded it with a crooked stick and then said: Mount it. So I mounted and (to my great surprise) I saw it (moving so quickly that) I had to restrain it (from going ahead of) Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He (the Holy Prophet ﷺ) (in the course of journey said to me): Have you married? I said: Yes. He (again) said: Is it with a virgin or one previously married? I said. With one previously married, whereupon he (again) said: Why not with a young girl with whom you could sport and she could have sported with you? I said: I have sisters, so I preferred to marry a woman who could keep them together (as one family). who could comb them and look after them. He said: You are about to go (to your house), and there you have the enjoyment (of the wife's company). He again said: Do you want to sell your camel? I said: Yes. So he bought it from me for one u'qiya (of silver), Then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) arrived (at Medina) and I arrived in the evening. I went to the mosque and found him at the door of the mosque, and said: Is it now that you have arrived? I said: Yes, He said: Leave your camel, and enter (the mosque) and offer two rak'ahs. So I entered and offered two rak'ahs of prayer, and then returned. He (the Holy Prophet ﷺ) then commanded Bilal رضی اللہ عنہ to weigh out one 'uqiya (of silver) tor me. Bilal رضی اللہ عنہ weighed that out for me (lowering the scale of) balance. So I proceeded and as I turned my back he said: Call for me, Jabir رضی اللہ عنہ . So I was called back, and I said (to myself): He would return me the camel, and nothing was more displeasing to me than this (that after having received the price I should also get the camel). He said: Take your camel and keep its price with you, (also).",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک غزوے میں نکلا تھا ، میرے اونٹ نے میری رفتار سست کر دی تو رسول اللہ صلی اللہ علیہ وسلم میرے پاس تشریف لے آئے اور فرمایا : \" جابر! \" میں نے عرض کی : جی ۔ آپ نے پوچھا : \" کیا معاملہ ہے؟ \" میں نے عرض کی : میرے لیے میرا اونٹ سست پڑ چکا ہے اور تھک گیاہے ، اس لیے میں پیچھے رہ گیا ہوں ۔ آپ ( اپنی سواری سے ) اترے اور اپنی مڑے ہوئے سرے والی چھڑی سے اسے کچوکا لگایا ، پھر فرمایا : \" سوار ہو جاؤ ۔ \" میں سوار ہو گیا ۔ اس کے بعد میں نے خود کو دیکھا کہ میں اس کو رسول اللہ صلی اللہ علیہ وسلم ( کی اونٹنی ) سے ( آگے بڑھنے سے ) روک رہا ہوں ۔ پھر آپ نے پوچھا : \" کیا تم نے شادی کر لی؟ \" میں نے عرض کی : جی ہاں ۔ آپ نے پوچھا : \" کنواری سے یا دوہاجو سے؟ \" میں نے عرض کی : دوہاجو ہے ۔ آپ نے فرمایا : \" ( کنواری ) لڑکی سے کیوں نہ کی ، تم اس کے ساتھ دل لگی کرتے ، وہ تمہارے ساتھ دل لگی کرتی ۔ \" میں نے عرض کی : میری ( چھوٹی ) بہنیں ہیں ۔ میں نے چاہا کہ ایسی عورت سے شادی کروں جو ان کی ڈھارس بندھائے ، ان کی کنگھی کرے اور ان کی نگہداشت کرے ۔ آپ نے فرمایا : \" تم ( گھر ) پہنچنے والے ہو ، جب پہنچ جاؤ تو احتیاط اور عقل مندی سے کام لینا ۔ \" پھر پوچھا : \" کیا تم اپنا اونٹ بیچو گے؟ \" میں نے عرض کی : جی ہاں ، چنانچہ آپ نے وہ ( اونٹ ) مجھ سے ایک اوقیہ ( چاندی کی قیمت ) میں خرید لیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم پہنچ گئے اور میں صبح کے وقت پہنچا ، مسجد میں آیا تو آپ کو مسجد کے دروازے پر پایا ۔ آپ صلی اللہ علیہ وسلم نے پوچھا : \" ابھی پہنچے ہو؟ \" میں نے عرض کی : جی ہاں ۔ آپ نے فرمایا : \" اپنا اونٹ چھوڑو اور مسجد میں جا کر دو رکعت نماز ادا کرو ۔ \" میں مسجد میں داخل ہوا ، نماز پڑھی ، پھر ( آپ کے پاس ) واپس آیا تو آپ نے بلال رضی اللہ عنہ کو حکم دیا کہ میرے لیے ایک اوقیہ ( چاندی ) تول دیں ، چنانچہ حضرت بلال رضی اللہ عنہ نے وزن کیا ، اورترازو کو جھکایا ( اوقیہ سے زیادہ تولا ۔ ) کہا : اس کے بعد میں چل پڑا ، جب میں نے پیٹھ پھیری تو آپ نے فرمایا : \" جابر کو میرے پاس بلاؤ ۔ \" مجھے بلایا گیا ۔ میں نے ( دل میں ) کہا : اب آپ میرا اونٹ ( بھی ) مجھے واپس کر دیں گے ۔ اور مجھے کوئی چیز اس سے زیادہ ناپسند نہ تھی ( کہ میں قیامت وصول کرنے کے بعد آپ صلی اللہ علیہ وسلم سے اپنا اونٹ بھی واپس لے لوں ۔ ) آپ نے فرمایا : \" اپنا اونٹ لے لو اور اس کی قیمت بھی تمہاری ہے.",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، کہا ہم سے عبدالوہاب نے بیان کیا، یعنی ابن عبدالمجید ثقفی نے، کہا ہم سے عبید اللہ نے بیان کیا,وہب بن کیسان نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي ابْنَ عَبْدِ الْمَجِيدِ الثَّقَفِيَّ، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: خَرَجْتُ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي غَزَاةٍ، فَأَبْطَأَ بِي جَمَلِي، فَأَتَى عَلَيَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ لِي: «يَا جَابِرُ»، قُلْتُ: نَعَمْ، قَالَ: «مَا شَأْنُكَ؟» قُلْتُ: أَبْطَأَ بِي جَمَلِي، وَأَعْيَا فَتَخَلَّفْتُ، فَنَزَلَ فَحَجَنَهُ بِمِحْجَنِهِ، ثُمَّ قَالَ: «ارْكَبْ»، فَرَكِبْتُ، فَلَقَدْ رَأَيْتُنِي أَكُفُّهُ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «أَتَزَوَّجْتَ؟» فَقُلْتُ: نَعَمْ، فَقَالَ: «أَبِكْرًا، أَمْ ثَيِّبًا؟» فَقُلْتُ: بَلْ ثَيِّبٌ، قَالَ: «فَهَلَّا جَارِيَةً تُلَاعِبُهَا وَتُلَاعِبُكَ» قُلْتُ: إِنَّ لِي أَخَوَاتٍ، فَأَحْبَبْتُ أَنْ أَتَزَوَّجَ امْرَأَةً تَجْمَعُهُنَّ، وَتَمْشُطُهُنَّ، وَتَقُومُ عَلَيْهِنَّ، قَالَ: «أَمَا إِنَّكَ قَادِمٌ، فَإِذَا قَدِمْتَ فَالْكَيْسَ الْكَيْسَ»، ثُمَّ قَالَ: «أَتَبِيعُ جَمَلَكَ؟» قُلْتُ: نَعَمْ، فَاشْتَرَاهُ مِنِّي بِأُوقِيَّةٍ، ثُمَّ قَدِمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَقَدِمْتُ بِالْغَدَاةِ، فَجِئْتُ الْمَسْجِدَ، فَوَجَدْتُهُ عَلَى بَابِ الْمَسْجِدِ، فَقَالَ: «الْآنَ حِينَ قَدِمْتَ» قُلْتُ: نَعَمْ، قَالَ: فَدَعْ جَمَلَكَ، وَادْخُلْ فَصَلِّ رَكْعَتَيْنِ، قَالَ: فَدَخَلْتُ فَصَلَّيْتُ، ثُمَّ رَجَعْتُ، فَأَمَرَ بِلَالًا أَنْ يَزِنَ لِي أُوقِيَّةً، فَوَزَنَ لِي بِلَالٌ، فَأَرْجَحَ فِي الْمِيزَانِ، قَالَ: فَانْطَلَقْتُ، فَلَمَّا وَلَّيْتُ، قَالَ: «ادْعُ لِي جَابِرًا»، فَدُعِيتُ، فَقُلْتُ: الْآنَ يَرُدُّ عَلَيَّ الْجَمَلَ، وَلَمْ يَكُنْ شَيْءٌ أَبْغَضَ إِلَيَّ مِنْهُ، فَقَالَ: «خُذْ جَمَلَكَ وَلَكَ ثَمَنُهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11206,
                "hadithNumber": "3642",
                "englishNarrator": "Jabir bin 'Abdullah ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "We were with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in a journey, and I was riding a camel meant for carrying water and it lagged behind all persons. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) hit it or goaded it (I think) with something he had with him. And after it (it moved so quickly) that it went ahead of all persons and it struggled with me (to move faster than I permitted It) and I had to restrain it. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Do you sell it at such and such (price)? May Allah grant you pardon. I said: Allah's Apostle, it is yours. He (again) said: Do you sell it at such and such (price)? May Allah grant you pardon. ' I said: Allah's Apostle, it is yours. He said to me: Have you married after the death of your father? I said: Yes. He (again) said: With one previously married or a virgin? I said: With one previously married. He said: Why didn't you marry a virgin who might amuse you and you might amuse her, and she might sport with you and you might sport with her? Abu Nadra said: That was the common phrase which the Muslims spoke: You do such and such (thing) and Allah may grant you pardon.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے ، اور میں ایک پانی ڈھونے والے اونٹ پر ( سوار ) تھا ۔ اور وہ پیچھے رہ جانے والے لوگوں کے ساتھ تھا ۔ کہا : آپ نے اسے ۔ ۔ میرا خیال ہے ، انہوں نے کہا : اپنے پاس موجود کسی چیز سے ۔ ۔ مارا ، یا کہا : کچوکا لگایا ، کہا : اس کے بعد وہ لوگوں ( کے اونٹوں ) سے آگے نکلنے لگا ، وہ مجھ سے کھینچا تانی کرنے لگا حتیٰ کہ مجھے اس کو روکنا پڑتا تھا ۔ کہا : اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" کیا تم مجھے یہ اتنے اتنے میں بیچو گے؟ اللہ تمہیں معاف فرمائے! \"\" کہا : میں نے عرض کی ۔ اللہ کے نبی! وہ آپ ہی کا ہے ۔ آپ نے ( دوبارہ ) پوچھا : \"\" کیا تم مجھے وہ اتنے اتنے میں بیچو گے؟ اللہ تمہارے گناہ معاف فرمائے! \"\" کہا : میں نے عرض کی : اللہ کے نبی! وہ آپ کا ہے ۔ کہا : اور آپ نے مجھ سے ( یہ بھی ) پوچھا : \"\" کیا اپنے والد ( کی وفات ) کے بعد تم نے نکاح کر لیا ہے؟ \"\" میں نے عرض کی : جی ہاں ۔ آپ نے پوچھا : \"\" دوہاجو ( شوہر دیدہ ) سے یا دوشیزہ سے؟ \"\" میں نے عرض کی : دوہاجو سے ۔ آپ نے فرمایا : \"\" تم نے کنواری سے کیوں نہ شادی کی ، وہ تمہارے ساتھ ہنستی کھیلتی اور تم اس کے ساتھ ہنستے کھیلتے اور وہ تمہارے ساتھ دل لگی کرتی ، تم اس کے ساتھ دل لگی کرتے؟ \"\" ابونضرہ نے کہا : یہ ایسا کلمہ تھا جسے مسلمان ( محاورتا ) کہتے تھے کہ ایسے ایسے کرو ، اللہ تمہارے گناہ بخش دے.",
                "urduNarrator": "ہم سے محمد بن عبد العلا نے بیان کیا، کہا ہم سے المطمیر نے بیان کیا، انہوں نے کہا: میں نے اپنے والد سے سنا، انہوں نے ہم سے بیان کیا ابونضرہ نے ہمیں حضرت جابر بن عبداللہ رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، قَالَ: سَمِعْتُ أَبِي، حَدَّثَنَا أَبُو نَضْرَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: كُنَّا فِي مَسِيرٍ مَعَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَنَا عَلَى نَاضِحٍ، إِنَّمَا هُوَ فِي أُخْرَيَاتِ النَّاسِ، قَالَ: فَضَرَبَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ - أَوْ قَالَ: نَخَسَهُ، أُرَاهُ قَالَ: بِشَيْءٍ كَانَ مَعَهُ - قَالَ: فَجَعَلَ بَعْدَ ذَلِكَ يَتَقَدَّمُ النَّاسَ يُنَازِعُنِي، حَتَّى إِنِّي لِأَكُفُّهُ، قَالَ: فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَتَبِيعُنِيهِ بِكَذَا وَكَذَا وَاللهُ يَغْفِرُ لَكَ؟» قَالَ: قُلْتُ: هُوَ لَكَ يَا نَبِيَّ اللهِ، قَالَ: «أَتَبِيعُنِيهِ بِكَذَا وَكَذَا، وَاللهُ يَغْفِرُ لَكَ؟» قَالَ: قُلْتُ: هُوَ لَكَ، يَا نَبِيَّ اللهِ، قَالَ: وَقَالَ لِي: «أَتَزَوَّجْتَ بَعْدَ أَبِيكَ؟» قُلْتُ: نَعَمْ، قَالَ: «ثَيِّبًا، أَمْ بِكْرًا؟» قَالَ: قُلْتُ: ثَيِّبًا، قَالَ: «فَهَلَّا تَزَوَّجْتَ بِكْرًا تُضَاحِكُكَ وَتُضَاحِكُهَا، وَتُلَاعِبُكَ وَتُلَاعِبُهَا»، قَالَ أَبُو نَضْرَةَ: «فَكَانَتْ كَلِمَةً يَقُولُهَا الْمُسْلِمُونَ افْعَلْ كَذَا وَكَذَا وَاللهُ يَغْفِرُ لَكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11207,
                "hadithNumber": "3643",
                "englishNarrator": "It was narrated that Abu Hurairah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Woman was created from a rib, it will never become straight for you in any way. If you wish to benefit from her, then you may  benefit from her, along with her crookedness, but if you try to straighten her you will break her, and  breaking her is divorcing her.'\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" عورت کو پسلی سے پیدا کیا گیا ہے ، وہ تمہارے لیے کسی ایک طریقے پر ہرگز سیدھی نہیں رہ سکتی ، اگر تم اس سے فائدہ اٹھانا چاہو تو ( اسی طرح ) فائدہ اٹھا لو گے کہ اس میں کجی رہے گی اور اگر تم اسے سیدھا کرنے چلو گے تو اسے توڑ ڈالو گے ، اور اسے توڑنا اس کی طلاق ہے.",
                "urduNarrator": "ہم سے عمرو ناقد اور ابن ابی عمر نے بیان کیا، اور یہ قول ابن ابی عمر کا ہے، انہوں نے کہا: ہم سے سفیان نے ابو الزناد سے روایت کی ہے, اعرج نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْمَرْأَةَ خُلِقَتْ مِنْ ضِلَعٍ لَنْ تَسْتَقِيمَ لَكَ عَلَى طَرِيقَةٍ، فَإِنِ اسْتَمْتَعْتَ بِهَا اسْتَمْتَعْتَ بِهَا وَبِهَا عِوَجٌ، وَإِنْ ذَهَبْتَ تُقِيمُهَا، كَسَرْتَهَا وَكَسْرُهَا طَلَاقُهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11208,
                "hadithNumber": "3644",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who believes in Allah and the Hereafter, if he witnesses any matter he should talk in good terms about it or keep quiet. Act kindly towards woman, for woman is created from a rib, and the most crooked part of the rib is its top. If you attempt to straighten it, you will break it, and if you leave it, its crookedness will remain there. So act kindly towards women.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" جو اللہ اور قیامت کے دن پر ایمان رکھتا ہے جب ( اپنی بیوی میں ) کوئی ( پسند نہ آنے والا ) معاملہ دیکھے تو اچھی طرح سے بات کہے یا خاموش رہے ۔ اور عورتوں کے ساتھ اچھے سلوک کی نصیحت قبول کرو کیونکہ عورت پسلی سے پیدا کی گئی ہے ۔ اور پسلیوں میں سب سے زیادہ ٹیڑھ اس کے اوپر والے حصے میں ہے ۔ اگر تم اسے سیدھا کرنے لگ جاؤ گے تو اسے توڑ دو گے اور اگر چھوڑ دو گے تو وہ ٹیڑھی ہی رہے گی ، عورتوں کے ساتھ اچھے سلوک کی نصیحت قبول کرو.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے حسین بن علی نے بیان کیا، انہوں نے زیدہ سے، میسرہ رضی اللہ عنہ کی سند سے, ابوحازم نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ مَيْسَرَةَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ، فَإِذَا شَهِدَ أَمْرًا فَلْيَتَكَلَّمْ بِخَيْرٍ أَوْ لِيَسْكُتْ، وَاسْتَوْصُوا بِالنِّسَاءِ، فَإِنَّ الْمَرْأَةَ خُلِقَتْ مِنْ ضِلَعٍ، وَإِنَّ أَعْوَجَ شَيْءٍ فِي الضِّلَعِ أَعْلَاهُ، إِنْ ذَهَبْتَ تُقِيمُهُ كَسَرْتَهُ، وَإِنْ تَرَكْتَهُ لَمْ يَزَلْ أَعْوَجَ، اسْتَوْصُوا بِالنِّسَاءِ خَيْرًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11209,
                "hadithNumber": "3645",
                "englishNarrator": "Abu Huraira ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A believing man should not hate a believing woman; if he dislikes one of her characteristics, he will be pleased with another.",
                "hadithUrdu": "اللہ کے رسول صلی اللہ علیہ وسلم نے فرمایا : \" کوئی مومن مرد کسی مومنہ عورت سے بغض نہ رکھے ۔ اگر اسے اس کی کوئی عادت ناپسند ہے تو دوسری پسند ہو گی ۔ \" یا آپ نے غيره ( اس کے سوا کوئی اور ) فرمایا.",
                "urduNarrator": "مجھ سے ابراہیم بن موسیٰ رازی نے بیان کیا، انہوں نے ہم سے بیان کیا عیسیٰ بن یونس نے ہمیں حدیث بیان کی ، کہا : ہمیں عبدالحمید بن جعفر نے عمران بن ابی انس سے حدیث سنائی ، انہوں نے عمر بن حکم سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، حَدَّثَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ، عَنْ عُمَرَ بْنِ الْحَكَمِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَفْرَكْ مُؤْمِنٌ مُؤْمِنَةً، إِنْ كَرِهَ مِنْهَا خُلُقًا رَضِيَ مِنْهَا آخَرَ» أَوْ قَالَ: «غَيْرَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11210,
                "hadithNumber": "3646",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of Abu Huraira ( رضی اللہ عنہ).",
                "hadithUrdu": "ہم سے محمد بن المثنی نے بیان کیا, ابوعاصم نے ہمیں حدیث بیان کی ، کہا : ہمیں عبدالحمید بن جعفر نے سابقہ سند کے ساتھ حضرت ابوہریرہ رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔ ۔ ۔ اسی کے مانند.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، حَدَّثَنَا عِمْرَانُ بْنُ أَبِي أَنَسٍ، عَنْ عُمَرَ بْنِ الْحَكَمِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11211,
                "hadithNumber": "3647",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Had it not been for Eve, woman would have never acted unfaithfully towards her husband.",
                "hadithUrdu": "آپ نے فرمایا : \" اگر حواء ( علیہا السلام ) نہ ہوتیں تو کوئی عورت اپنے شوہر سے کبھی خیانت نہ کرتی.",
                "urduNarrator": "ہم سے ہارون بن معروف نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھ سے عمرو بن حارث نے بیان کیا کہ ابو یونس ,ابوہریرہ رضی اللہ عنہ کے آزاد کردہ غلام ابو یونس نے حضرت ابوہریرہ رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ أَبَا يُونُسَ، مَوْلَى أَبِي هُرَيْرَةَ، حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ:«لَوْلَا حَوَّاءُ، لَمْ تَخُنْ أُنْثَى زَوْجَهَا الدَّهْرَ.",
                "headingArabic": "لَوْلاَ حَوَّاءُ لَمْ تَخُنْ أُنْثَى زَوْجَهَا الدَّهْرَ ‏‏",
                "headingUrdu": "اگر حوا نہ ہوتی تو کوئی عورت اپنے شوہر سے خیانت نہ کرتی",
                "headingEnglish": "Were it not for Hawa', no female would ever betray her husband",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11212,
                "hadithNumber": "3648",
                "englishNarrator": "Hammam bin Munabbih said:",
                "hadithEnglish": "These are some of the ahadith which Abu Huraira (رضی اللہ عنہ) narrated to us from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and one of these (this one): Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Had it not been for Bani Isra'il, food would not have become stale, and meal would not have gone bad; and had it not been for Eve, a woman would never have acted unfaithfully toward her husband.",
                "hadithUrdu": "یہ احادیث ہیں جو حضرت ابوہریرہ رضی اللہ عنہ نے ہمیں رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، پھر انہوں نے متعدد احادیث بیان کیں ، ان میں ایک یہ تھی : اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر بنی اسرائیل نہ ہوتے تو کھانا خراب نہ ہوتا اور گوشت بدبودار نہ ہوتا اور اگر حواء علیہا السلام نہ ہوتیں تو کوئی عورت اپنے شوہر سے خیانت نہ کرتی.",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا, ہمام بن منبہ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا، وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَوْلَا بَنُو إِسْرَائِيلَ، لَمْ يَخْبُثِ الطَّعَامُ، وَلَمْ يَخْنَزِ اللَّحْمُ، وَلَوْلَا حَوَّاءُ لَمْ تَخُنْ أُنْثَى زَوْجَهَا الدَّهْرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11213,
                "hadithNumber": "3649",
                "englishNarrator": "It was narrated from Abdullah bin 'Amr رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ﷺ said: \"This word is no more than temporary joys, and there is no temporary joys of this world that is better than the righteous wife.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دنیا متاع ( کچھ وقت تک کے لیے فائدہ اٹھانے کی چیز ) ہے اور دنیا کی بہترین متاع نیک عورت ہے.",
                "urduNarrator": "مجھ سے محمد بن عبداللہ بن نمیر الحمدانی نے بیان کیا، کہا ہم سے عبداللہ بن یزید نے بیان کیا، کہا ہم سے حیوہ نے بیان کیا، مجھ سے شرحبیل بن شریک نے بیان کیا۔ اس نے ابو عبدالرحمٰن حبلی کو بولتے ہوئے سنا, حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ الْهَمْدَانِيُّ، حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، حَدَّثَنَا حَيْوَةُ، أَخْبَرَنِي شُرَحْبِيلُ بْنُ شَرِيكٍ، أَنَّهُ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ، يُحَدِّثُ عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «الدُّنْيَا مَتَاعٌ، وَخَيْرُ مَتَاعِ الدُّنْيَا الْمَرْأَةُ الصَّالِحَةُ».",
                "headingArabic": "خَيْرُ مَتَاعِ الدُّنْيَا الْمَرْأَةُ الصَّالِحَةُ ‏‏",
                "headingUrdu": "دنیا کی بہترین عارضی خوشی نیک عورت ہے۔",
                "headingEnglish": "The best temporary joy of this world is a righteous woman",
                "chapterId": "18",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 118,
                    "chapterNumber": "18",
                    "chapterEnglish": "The Book of Suckling",
                    "chapterUrdu": "رضاعت کے احکام و مسائل",
                    "chapterArabic": "كتاب الرِّضَاعِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10901,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=436",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=434",
                "label": "434",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=435",
                "label": "435",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=436",
                "label": "436",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=437",
                "label": "437",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=438",
                "label": "438",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=439",
                "label": "439",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=440",
                "label": "440",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=438",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=438",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=436",
        "to": 10925,
        "total": 40465
    }
}