{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 581,
        "data": [
            {
                "id": 14789,
                "hadithNumber": "7228",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: \"Whoever examined thoroughly reckoning will be doomed.\" Then he mentioned a hadith like that of Abu Yunus (no. 7227).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" جس سے حساب میں پوچھ گچھ شروع ہوگئی وہ بلاک ہوجائے گا ۔ \" پھر ابو یونس کی حدیث کے مانند بیان کیا ۔",
                "urduNarrator": "اور مجھ سے عبدالرحمٰن بن بشر نے بیان کیا، مجھ سے یحییٰ نے جو القطان ہیں، بیان کیا:عثمان بن اسود نے ابن ابی ملیکہ سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ حَدَّثَنِي يَحْيَى وَهُوَ الْقَطَّانُ عَنْ عُثْمَانَ بْنِ الْأَسْوَدِ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ نُوقِشَ الْحِسَابَ هَلَكَ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ أَبِي يُونُسَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14790,
                "hadithNumber": "7229",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying three days before his death: None of you should court death but only hoping good from Allah",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو آپ کی وفات سے تین دن پہلے یہ فرماتے ہوئے سنا : \" تم میں سے ہر شخص کو اسی حالت میں موت آئے کہ وہ اللہ کے متعلق حسن ظن رکھتا ہو ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, یحییٰ بن زکریا نے اعمش سے ، انھوں نےابو سفیان سے اور انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، انھوں نےکہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا يَحْيَى بْنُ زَكَرِيَّاءَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ وَفَاتِهِ بِثَلَاثٍ يَقُولُ لَا يَمُوتَنَّ أَحَدُكُمْ إِلَّا وَهُوَ يُحْسِنُ بِاللَّهِ الظَّنَّ.",
                "headingArabic": "الأَمْرِ بِحُسْنِ الظَّنِّ بِاللَّهِ تَعَالَى عِنْدَ الْمَوْتِ",
                "headingUrdu": "موت کے وقت اللہ کے بارے میں مثبت سوچنے کا حکم",
                "headingEnglish": "The Command To Think Positively Of Allah At The Time Of Death",
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14791,
                "hadithNumber": "7230",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters.",
                "hadithUrdu": "اور ہم سے عثمان بن ابی شیبہ نے بیان کیا, جریر ، ابو معاویہ اورعیسیٰ بن یونس نے اعمش سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ وَأَبُو مُعَاوِيَةَ كُلُّهُمْ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14792,
                "hadithNumber": "7231",
                "englishNarrator": "Jabir bin 'Abdullah al-Ansari رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say three days before his death: None of you should die but hoping only good from Allah, the Exalted and Glorious.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو آپ کی وفات سے تین دن پہلے یہ فرماتے ہوئے سنا : \" تم میں سے کسی پر بھی موت نہ آئے مگر اس حالت میں کہ وہ اللہ عزوجل کے متعلق اچھا گمان رکھتا ہو ۔ \"",
                "urduNarrator": "مجھ سے ابوداؤد سلیمان بن معبد نے بیان کیا، کہا ہم سے ابو النعمان ارم نے بیان کیا، کہا ہم سے مہدی بن میمون نے بیان کیا، ہم سے واصل نے بیان کیا, ابوزبیر نے حضرت جابر بن عبداللہ انصاری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنِي أَبُو دَاوُدَ سُلَيْمَانُ بْنُ مَعْبَدٍ حَدَّثَنَا أَبُو النُّعْمَانِ عَارِمٌ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ حَدَّثَنَا وَاصِلٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ مَوْتِهِ بِثَلَاثَةِ أَيَّامٍ يَقُولُ لَا يَمُوتَنَّ أَحَدُكُمْ إِلَّا وَهُوَ يُحْسِنُ الظَّنَّ بِاللَّهِ عَزَّ وَجَلَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14793,
                "hadithNumber": "7232",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying. Every servant would be raised (in the same very state) in which he dies.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" ہر شخص کو ( ایمان اور امید کی ) اسی کیفیت میں اٹھایا جائے گا جس پر اس کو موت آئی تھی ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید اور عثمان بن ابی شیبہ نے بیان کیا, جریر نے اعمش سے ، انھوں نے ابو سفیان سے اور انھوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُبْعَثُ كُلُّ عَبْدٍ عَلَى مَا مَاتَ عَلَيْهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14794,
                "hadithNumber": "7233",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as hadith no. 7232) was narrated from Al-A'mash with this chain of narrators, and he said: The prophet ﷺ said, but he did not say: \"I heard.\"",
                "hadithUrdu": "ہم سے ابوبکر بن نافع نے بیان کیا، ہم سے عبدالرحمٰن بن مہدی نے بیان کیا, سفیان نے اعمش سے اسی سند کے ساتھ ، اسی کے مانند روایت کی اور کہا : \" نبی کریم صلی اللہ علیہ وسلم سے روایت ہے \" اوریہ نہیں کہا : میں نے ( آپ صلی اللہ علیہ وسلم سے ) سنا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ نَافِعٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ مِثْلَهُ وَقَالَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَقُلْ سَمِعْتُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14795,
                "hadithNumber": "7234",
                "englishNarrator": "Abdullah bin Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When Allah intends to chastise a people, He chastises all of them then they would be raised according to their deeds.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئےسنا؛ \" جب اللہ تعالیٰ کسی قوم کو عذاب دینے کا ارادہ کرتاہے تو ہر شخص پر جو ان میں تھا ، عذاب آتا ہے ، اس کے بعد وہ اپنے اپنے اعمال کے مطابق اٹھائے جائیں گے ۔ \"",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ التجیبی نے بیان کیا: ہم سے ابن وہب نے بیان کیا: مجھ سے یونس نے ابن شہاب کی سند سے بیان کیا, حمزہ بن عبداللہ بن عمر نے بتایا کہ حضرت عبداللہ بن عمر رضی اللہ عنہ نے کہا",
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا أَرَادَ اللَّهُ بِقَوْمٍ عَذَابًا أَصَابَ الْعَذَابُ مَنْ كَانَ فِيهِمْ ثُمَّ بُعِثُوا عَلَى أَعْمَالِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "52",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 152,
                    "chapterNumber": "52",
                    "chapterEnglish": "The Book of Paradise, its Description, its Bounties and its Inhabitants",
                    "chapterUrdu": "جنت اس کی نعمتیں اور اہل جنت",
                    "chapterArabic": "كتاب الْجَنَّةِ وَصِفَةِ نَعِيمِهَا وَأَهْلِهَا",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14796,
                "hadithNumber": "7235",
                "englishNarrator": "Zainab bint Jahsh رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) got up from sleep saying: There is no being worthy of worship except Allah; there is a destruction in store for Arabia because of turmoil which is at hand, the barrier of Gog and Magog has opened so much. And Sufyan made a sign of ten with the help of his hand (in order to indicate the width of the gap) and I said: Allah's Messenger, would we be perished in spite of the fact that there would be good people amongst us? Thereupon he said: Of course, but only when the evil predominates.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم اپنی نیند سے بیدار ہوئے جبکہ آپ فرمارہے تھے : \"\" اللہ کے سواکوئی سچا معبود نہیں ، عرب اس شر کی وجہ سے ہلاک ہوگئے جو قریب آپہنچا ہے ۔ آج یاجوج ماجوج کی دیوار میں سے اس قدر جگہ کھل گئی ہے ۔ \"\" اور سفیان نے اپنے ہاتھ سے دس کا اشارہ بنایا ۔ ( حضرت زینب رضی اللہ عنہا نے ) کہا : میں نے عرض کی : ہم میں نیک لوگ موجود ہوں گے ، پھر بھی ہم ہلاک ہوجائیں گے؟فرمایا؛ \"\" ہاں جب شر اور گندگی زیادہ ہوجائے گی ۔ \"\"",
                "urduNarrator": "عمرو ناقد نے ہمیں حدیث بیان کی ، کہا : ہمیں سفیان بن عینیہ نے زہری سے حدیث بیان کی ، انھوں ن ے عروہ سے ، انھوں نے زینب بنت ام سلمہ رضی اللہ عنہا سے ، انھوں نے حضرت ام حبیبہ رضی اللہ عنہا سے اور انھوں نے حضرت زینب بنت جحش رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ حَبِيبَةَ عَنْ زَيْنَبَ بِنْتِ جَحْشٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَيْقَظَ مِنْ نَوْمِهِ وَهُوَ يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدْ اقْتَرَبَ فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ وَعَقَدَ سُفْيَانُ بِيَدِهِ عَشَرَةً قُلْتُ يَا رَسُولَ اللَّهِ أَنَهْلِكُ وَفِينَا الصَّالِحُونَ قَالَ نَعَمْ إِذَا كَثُرَ الْخَبَثُ.",
                "headingArabic": "اقْتِرَابِ الْفِتَنِ وَفَتْحِ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ",
                "headingUrdu": "فتنوں کا نقطہ نظر اور یاجوج و ماجوج کی رکاوٹ کا کھلنا",
                "headingEnglish": "The Approach Of Tribulations And The Opening Of The Barrier Of Ya'juj And Ma'juj",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14797,
                "hadithNumber": "7236",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zainab bint Jahsh رضی اللہ عنہا with a slight variation in the chain of transmitters.",
                "hadithUrdu": "ابو بکر بن ابی شیبہ ، سعید بن عمرو اشعشی ، زہیر بن حرب اور ابن ابی عمر نے ہمیں حدیث بیان کی ، انھوں نے کہا : ہمیں سفیان نے زہری سے اسی سند کے ساتھ حدیث بیان کی اور انھوں نے سفیان سے بیان کردہ روایت کی سند میں مزید کہا : زینب بنت ابو سلمہ رضی اللہ عنہا نے حبیبہ سے ، انھوں نے ام حبیبہ رضی اللہ تعالیٰ عنہا سے اور انھوں نے زینب بنت جحش رضی اللہ تعالیٰ عنہا سے روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَسَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ أَبِي عُمَرَ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ وَزَادُوا فِي الْإِسْنَادِ عَنْ سُفْيَانَ فَقَالُوا عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ عَنْ حَبِيبَةَ عَنْ أُمِّ حَبِيبَةَ عَنْ زَيْنَبَ بِنْتِ جَحْشٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14798,
                "hadithNumber": "7237",
                "englishNarrator": "Zainab bint Jahsh رضی اللہ عنہا, the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) reported:",
                "hadithEnglish": "One day Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came out in a state of excitement with his face quite red. And he was saying: There is no god but Allah; there is a destruction in store for Arabia because of the turmoil which is near at hand as the barrier of Gog and Magog has been opened like it, and he (in order to explain it) made a ring with the help of his thumb and forefinger. I said: Allah's Messenger, would we be destroyed despite the fact that there would be pious people amongst us? He said: Yes, when evil would be predominant.",
                "hadithUrdu": "ایک دن رسول اللہ صلی اللہ علیہ وسلم گھبراہٹ کے عالم میں سرخ چہرے کے ساتھ ( خواب گاہ سے ) نکلے ۔ آپ فرمارہے تھے : \"\" اللہ کے سوا کوئی سچا معبود نہیں عرب اسی شر کی وجہ سے ہلاک ہوگئے جو اب قریب آپہنچا ہے ۔ آج یاجوج ماجوج کی دیوار اس قدر کھل گئی ہے ۔ \"\" اور آپ نے شہادت کی انگلی اور انگوٹھے کو ملا کر حلقہ بنایا ۔ ( حضرت زینب رضی اللہ تعالیٰ عنہا نے ) کہا : تو میں نے عرض کی ہم میں نیک لوگ موجود ہوں ، یا پھر بھی ہم ہلاک ہوجائیں گے \"\" آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" ہاں ، جب شر اورگندگی زیادہ ہوجائے گی ۔ \"\"",
                "urduNarrator": "یونس نے ابن شہاب سے روایت کی ، کہا : مجھے عروہ بن زبیر نے بتایا کہ انھیں زینب بنت ابو سلمہ رضی اللہ عنہا نے خبر دی کہ حضرت ام حبیبہ رضی اللہ عنہا بنت ابی سفیان رضی اللہ تعالیٰ عنہ نے ان سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کی اہلیہ حضرت زینب بنت جحش رضی اللہ عنہا نے کہا",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ أَخْبَرَتْهُ أَنَّ أُمَّ حَبِيبَةَ بِنْتَ أَبِي سُفْيَانَ أَخْبَرَتْهَا أَنَّ زَيْنَبَ بِنْتَ جَحْشٍ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَزِعًا مُحْمَرًّا وَجْهُهُ يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدْ اقْتَرَبَ فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ وَحَلَّقَ بِإِصْبَعِهِ الْإِبْهَامِ وَالَّتِي تَلِيهَا قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ أَنَهْلِكُ وَفِينَا الصَّالِحُونَ قَالَ نَعَمْ إِذَا كَثُرَ الْخَبَثُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14799,
                "hadithNumber": "7238",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zuhri with a different chain of transmitters.",
                "hadithUrdu": "اور مجھ سے عبد الملک بن شعیب بن لیث نے بیان کیا، میرے والد نے مجھ سے میرے دادا کی سند سے بیان کیا, عقیل بن خالد اور صالح دونوں نے ابن شہاب ( زہری ) سے یونس کی زہری سے حدیث کے مطابق اور اسی کی سند سے بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِي أَبِي عَنْ جَدِّي حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ و حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ كِلَاهُمَا عَنْ ابْنِ شِهَابٍ بِمِثْلِ حَدِيثِ يُونُسَ عَنْ الزُّهْرِيِّ بِإِسْنَادِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14800,
                "hadithNumber": "7239",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Today the wall (barrier) of Gog and Magog has been opened so much, and Wuhaib (in order to explain it) made the figure of ninety with the help of his hand.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" آج یاجوج ماجوج کی دیوار اتنی کھل گئی ہے ۔ \" وہیب نے اپنی انگلی سے نوے کا نشان بنایا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا , احمد بن اسحاق نے کہا : ہمیں وہیب نے حدیث بیان کی ، انھوں نے کہا : ہمیں عبداللہ بن طاوس نے ا پنے والد سے حدیث بیان کی ، انھوں نے حضرت ابو ہریر رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَقَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ وَعَقَدَ وُهَيْبٌ بِيَدِهِ تِسْعِينَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14801,
                "hadithNumber": "7240",
                "englishNarrator": "It was narrated that 'Ubaidullah bin Al-Qibtiyyah said:",
                "hadithEnglish": "Harith bin Abi Rabi'a and 'Abdullah bin Safwan both went to Umm Salama رضی اللہ عنہا, the Mother of the Faithful, and they asked her about the army which would be sunk in the earth, and this relates to the time when Ibn Zubair رضی اللہ عنہ (was the governor of Mecca). She reported that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) had said that a seeker of refuge would seek refuge in the Sacred House and an army would be sent to him (in order to kill him) and when it would enter a plain ground, it would be made to sink. I said: Allah's Messenger, what about him who would be made to accompany this army willy nilly? Thereupon he said: He would be made to sink along with them but he would be raised on the Day of Resurrection on the basis of his intention. Abu Ja'far said. ' This plain, ground means the plain ground of Medina.",
                "hadithUrdu": "حارث بن ابی ربیعہ ، عبداللہ بن صفوان اور میں بھی ان کے ساتھ تھا ۔ ہم ام المومنین حضرت ام سلمہ رضی اللہ عنہا کی خدمت میں حاضر ہوئے ، ان دونوں نے اُن سے اس لشکر کےمتعلق سوال کیا جس کو زمین میں دھنسا دیاجائے گا ، یہ حضرت عبداللہ بن زبیر رضی اللہ عنہ ( کی خلافت ) کا زمانہ تھا ۔ ( ام المومنین رضی اللہ تعالیٰ عنہا نے ٓ ) نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \"\" ایک پناہ لینے والا بیت اللہ میں پناہ لے گا ، اس کی طرف ایک لشکر بھیجاجائےگا ، جب وہ لوگ زمین کے بنجر ہموارحصے میں ہوں گے تو ان کو زمین میں دھنسا دیا جائے گا ۔ \"\" میں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !جو مجبور ان کے ساتھ ( شامل ) ہوگا اس کا کیا بنے گا؟آپ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" اسے بھی ان کے ساتھ دھنسا دیا جائے گاالبتہ قیامت کے دن اس کو اس کی نیت کے مطابق اٹھایا جائے گا ۔ \"\" اور ابو جعفر نے کہا : یہ مدینہ ( کے قریب ) کا چٹیل حصہ ہوگا ( جہاں ان کو دھنسا یا جائے گا ۔ )",
                "urduNarrator": "ہم سے قتیبہ بن سعید، ابوبکر بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا، اور قول قتیبہ کا ہے۔ اسحاق نے کہا: ہمیں اسحاق نے خبر دی، اور باقی دو نے کہا, جریر نے عبدالعزیز بن رفیع سے اور انھوں نے عبداللہ بن قبطیہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِقُتَيْبَةَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا جَرِيرٌ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ عُبَيْدِ اللَّهِ ابْنِ الْقِبْطِيَّةِ قَالَ دَخَلَ الْحَارِثُ بْنُ أَبِي رَبِيعَةَ وَعَبْدُ اللَّهِ بْنُ صَفْوَانَ وَأَنَا مَعَهُمَا عَلَى أُمِّ سَلَمَةَ أُمِّ الْمُؤْمِنِينَ فَسَأَلَاهَا عَنْ الْجَيْشِ الَّذِي يُخْسَفُ بِهِ وَكَانَ ذَلِكَ فِي أَيَّامِ ابْنِ الزُّبَيْرِ فَقَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُوذُ عَائِذٌ بِالْبَيْتِ فَيُبْعَثُ إِلَيْهِ بَعْثٌ فَإِذَا كَانُوا بِبَيْدَاءَ مِنْ الْأَرْضِ خُسِفَ بِهِمْ فَقُلْتُ يَا رَسُولَ اللَّهِ فَكَيْفَ بِمَنْ كَانَ كَارِهًا قَالَ يُخْسَفُ بِهِ مَعَهُمْ وَلَكِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ عَلَى نِيَّتِهِ وَقَالَ أَبُو جَعْفَرٍ هِيَ بَيْدَاءُ الْمَدِينَةِ.",
                "headingArabic": "الْخَسْفِ بِالْجَيْشِ الَّذِي يَؤُمُّ الْبَيْتَ",
                "headingUrdu": "زمین نگل رہی فوج جس کا مقصد کعبہ پر حملہ کرنا ہے۔",
                "headingEnglish": "The Earth Swallowing Up The Army That Aims To Attack The Ka'bah",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14802,
                "hadithNumber": "7241",
                "englishNarrator": "This hadith has been narrated on the authority of 'Abdullah bin Rufai, with the same chain of transmitters (but with the addition of these words):",
                "hadithEnglish": "When I met Abu Ja'far I told him that she (simply) meant the plain ground. Thereupon Abu Ja'far said: No, by God, she meant the plain ground of Medina.",
                "hadithUrdu": "تو میں ابو جعفر سے ملا ، میں نے کہا : انھوں ( ام المومنین رضی اللہ عنہا ) نے تو زمین کا ایک چٹیل میدان کہا تھا ۔ توابو جعفر نے کہا : ہرگز نہیں ، اللہ کی قسم! وہ مدینہ کا چٹیل حصہ ہے ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، ہم سے زہیر نے بیان کیا, عبدالعزیز بن رفیع نے ہمیں اسی سند کےساتھ حدیث بیان کی اور ان کی حدیث میں ہے : ( ابن قبطیہ نے ) کہا",
                "hadithArabic": "حَدَّثَنَاه أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ رُفَيْعٍ بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِهِ قَالَ فَلَقِيتُ أَبَا جَعْفَرٍ فَقُلْتُ إِنَّهَا إِنَّمَا قَالَتْ بِبَيْدَاءَ مِنْ الْأَرْضِ فَقَالَ أَبُو جَعْفَرٍ كَلَّا وَاللَّهِ إِنَّهَا لَبَيْدَاءُ الْمَدِينَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14803,
                "hadithNumber": "7242",
                "englishNarrator": "Abdullah bin Safwan reported:",
                "hadithEnglish": "Hafsa رضی اللہ عنہا told him that she had heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: An army would attack this House in order to fight against the inhabitants of this House and when it would be at the plain ground the ranks in the centre of the army would be sunk and the vanguard would call the rear flanks of the army and they would also be sunk and no flank would be left except some people who would go to inform them (their kith and kin). A person (who had been listening to this hadith from Abdullah b. Safwan) said: I bear testimony in regard to you that you are not imputing a lie to Hafsa رضی اللہ عنہا . And I bear testimony to the fact that Hafsa is not telling a lie about Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "مجھے حضرت حفصہ رضی اللہ عنہا نے بیان کیا اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \"\" ایک لشکر ( اللہ کے ) اس گھر کے خلاف جنگ کرنے کے لئے اس کا رخ کرےگا یہاں تک کہ جب وہ زمین کے چٹیل حصے میں ہوں گے تو ان کے درمیان والے حصے کو ( زمین میں ) دھنسا دیا جائے گا ان میں سے ایک علیحدہ رہ جانے والے شخص کےسوا ، جو ان کے بارے میں خبر دے گا اور کوئی ( زندہ ) باقی نہیں بچے گا ۔ \"\" تو ایک شخص نے ( ان کی بات سن کر ) کہا : میں تمہارے بارے میں گواہی دیتا ہوں کہ تم نے حضرت حفصہ رضی اللہ تعالیٰ عنہا پر جھوٹ نہیں باندھا اور میں ( یہ بھی ) گواہی دیتاہوں کہ حضرت حفصہ رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم کے بارے میں جھوٹ نہیں کہا ۔",
                "urduNarrator": "ہم سے عمرو ناقد اور ابن ابی عمر نے بیان کیا اور لفظ عمرو کا ہے۔ انہوں نے کہا: ہم سے سفیان بن عیینہ نے بیان کیا, امیہ بن صفوان سے روایت ہے ، انھوں نے اپنے داداعبداللہ بن صفوان کو کہتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَابْنُ أَبِي عُمَرَ وَاللَّفْظُ لِعَمْرٍو قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أُمَيَّةَ بْنِ صَفْوَانَ سَمِعَ جَدَّهُ عَبْدَ اللَّهِ بْنَ صَفْوَانَ يَقُولُ أَخْبَرَتْنِي حَفْصَةُ أَنَّهَا سَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيَؤُمَّنَّ هَذَا الْبَيْتَ جَيْشٌ يَغْزُونَهُ حَتَّى إِذَا كَانُوا بِبَيْدَاءَ مِنْ الْأَرْضِ يُخْسَفُ بِأَوْسَطِهِمْ وَيُنَادِي أَوَّلُهُمْ آخِرَهُمْ ثُمَّ يُخْسَفُ بِهِمْ فَلَا يَبْقَى إِلَّا الشَّرِيدُ الَّذِي يُخْبِرُ عَنْهُمْ فَقَالَ رَجُلٌ أَشْهَدُ عَلَيْكَ أَنَّكَ لَمْ تَكْذِبْ عَلَى حَفْصَةَ وَأَشْهَدُ عَلَى حَفْصَةَ أَنَّهَا لَمْ تَكْذِبْ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14804,
                "hadithNumber": "7243",
                "englishNarrator": "Abdullah bin Safwan reported:",
                "hadithEnglish": "The Mother of the Faithful as saying that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: They would soon seek protection in this House, viz. Ka'ba (the defenceless), people who would have nothing to protect themselves in the shape of weapons or the strength of the people. An army would be sent to fight (and kill) them and when they would enter a plain ground the army would be sunk in it. Yusuf (one of the narrators) said: It was a people of Syria (hordes of Hajjaj) who had been on that day coming towards Mecca for an attack (on 'Abdulllah bin Zubair) and Abdullah bin Safwan said: By God, it does not imply this army.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" ایک قوم اس گھر ۔ ۔ ۔ یعنی کعبہ ۔ ۔ ۔ میں پناہ لے گی ، ا ن کے پاس نہ اپنا دفاع کرنے کےلیے کوئی ذریعہ ہوگا ، نہ عدوی قوت ہوگی اور نہ سامان جنگ ہی ہوگا ، ان کی طرف ایک لشکر روانہ کیا جائے گا ۔ یہاں تک کہ جب وہ ( لشکر کے ) لوگ زمین کے ایک چٹیل حصے میں ہوں گے تو ان کو ( زمین میں ) دھنسا دیا جائےگا ۔ \"\" یوسف ( بن مابک ) نے کہا : ان دونوں اہل شام مکہ کی طرف بڑھے آرہے تھے ، تو عبداللہ بن صفوان نے کہا : دیکھو ، اللہ کی قسم!یہ وہ لشکر نہیں ہے ۔ زید ( بن ابی انیسہ ) نے کہا : اور مجھے عبدالملک عامری نے عبدالرحمن بن سابط سے ، انھوں نے حارث بن ابی ربیعہ سے ، انھوں نے ام المومنین رضی اللہ عنہا سے ، یوسف بن مابک کی حدیث کے مانند روایت کی ، مگر انھوں نے اس میں اس لشکر کی بات نہیں کی جس کا عبداللہ بن صفوان نے ذکر کیا ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم بن میمون نے بیان کیا: ہم سے ولید بن صالح نے بیان کیا, عبیداللہ بن عمرو نے کہا ,  ہمی زید بن ابی اُنیسہ نے عبدالملک عامری سے خبر دی ، انھوں نے یوسف بن مالک سے روایت کی ، کہا : مجھے عبداللہ بن صفوان نے ام المومنین رضی اللہ عنہا سے خبر دی کہ",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ حَدَّثَنَا الْوَلِيدُ بْنُ صَالِحٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو حَدَّثَنَا زَيْدُ بْنُ أَبِي أُنَيْسَةَ عَنْ عَبْدِ الْمَلِكِ الْعَامِرِيِّ عَنْ يُوسُفَ بْنِ مَاهَكَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ صَفْوَانَ عَنْ أُمِّ الْمُؤْمِنِينَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَيَعُوذُ بِهَذَا الْبَيْتِ يَعْنِي الْكَعْبَةَ قَوْمٌ لَيْسَتْ لَهُمْ مَنَعَةٌ وَلَا عَدَدٌ وَلَا عُدَّةٌ يُبْعَثُ إِلَيْهِمْ جَيْشٌ حَتَّى إِذَا كَانُوا بِبَيْدَاءَ مِنْ الْأَرْضِ خُسِفَ بِهِمْ قَالَ يُوسُفُ وَأَهْلُ الشَّأْمِ يَوْمَئِذٍ يَسِيرُونَ إِلَى مَكَّةَ فَقَالَ عَبْدُ اللَّهِ بْنُ صَفْوَانَ أَمَا وَاللَّهِ مَا هُوَ بِهَذَا الْجَيْشِ قَالَ زَيْدٌ وَحَدَّثَنِي عَبْدُ الْمَلِكِ الْعَامِرِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَابِطٍ عَنْ الْحَارِثِ بْنِ أَبِي رَبِيعَةَ عَنْ أُمِّ الْمُؤْمِنِينَ بِمِثْلِ حَدِيثِ يُوسُفَ بْنِ مَاهَكَ غَيْرَ أَنَّهُ لَمْ يَذْكُرْ فِيهِ الْجَيْشَ الَّذِي ذَكَرَهُ عَبْدُ اللَّهِ بْنُ صَفْوَانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14805,
                "hadithNumber": "7244",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was startled in the state of sleep. We said: Allah's Messenger, you have done something in the state of your sleep which you never did before, Thereupon he said: Strange it is that some people of my Ummah would attack the House (Ka'ba) (for killing) a person who would belong to the tribe of the Quraish and he would try to seek protection in the House. And when they would reach the plain ground they would be sunk. We said: Allah's Messenger, all sorts of people throng the path. Thereupon he said: Yes, there would be amongst them people who would come with definite designs and those who would come under duress and there would be travellers also, but they would all be destroyed through one (stroke) of destruction. though they would be raised in different states (on the Day of Resurrection). Allah would, however, raise them according to their intention.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے نیند کے دوران ( اضطراب کے عالم ) میں اپنے ہاتھ کو حرکت دی تو ہم نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم ! آپ نے نیند میں کچھ ایسا کیا جو پہلےآپ نہیں کیا کر تے تھے تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" یہ عجیب بات ہے کہ ( آخری زمانےمیں ) میری امت میں سے کچ لوگ بیت اللہ کی پناہ لینے والے قریش کے ایک آدمی کے خلاف ( کاروائی کرنے کے لیے ) بیت اللہ کا رخ کریں گے یہاں تک کہ جب وہ چٹیل میدان حصے میں ہوں گے تو انھیں ( زمین میں ) دھنسا دیا جائے گا ۔ \" ہم نے عرض کی ، اللہ کے رسول صلی اللہ علیہ وسلم ! راستہ تو ہرطرح کے لوگوں کے لیے ہوتا ہے ۔ آپ نے فرمایا : \" ہاں ، ان میں سے کوئی اپنی مہم سے آگاہ ہوگا ، کوئی مجبور اور کوئی مسافر ہوگا ۔ وہ سب اکھٹے ہلاک ہوں گے اور ( قیامت کے روز ) واپسی کے مختلف راستوں پر نکلیں گے اللہ انھیں ان کی نیتوں کے مطابق اٹھائے گا ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یونس بن محمد نے بیان کیا، کہا ہم سے قاسم بن الفضل الہدانی نے بیان کیا، وہ محمد بن زیاد کی سند سے, عبداللہ بن زبیر رضی اللہ عنہ سے روایت ہے کہ حضرت عائشہ رضی اللہ عنہا نے کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا الْقَاسِمُ بْنُ الْفَضْلِ الْحُدَّانِيُّ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ أَنَّ عَائِشَةَ قَالَتْ عَبَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَنَامِهِ فَقُلْنَا يَا رَسُولَ اللَّهِ صَنَعْتَ شَيْئًا فِي مَنَامِكَ لَمْ تَكُنْ تَفْعَلُهُ فَقَالَ الْعَجَبُ إِنَّ نَاسًا مِنْ أُمَّتِي يَؤُمُّونَ بِالْبَيْتِ بِرَجُلٍ مِنْ قُرَيْشٍ قَدْ لَجَأَ بِالْبَيْتِ حَتَّى إِذَا كَانُوا بِالْبَيْدَاءِ خُسِفَ بِهِمْ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّ الطَّرِيقَ قَدْ يَجْمَعُ النَّاسَ قَالَ نَعَمْ فِيهِمْ الْمُسْتَبْصِرُ وَالْمَجْبُورُ وَابْنُ السَّبِيلِ يَهْلِكُونَ مَهْلَكًا وَاحِدًا وَيَصْدُرُونَ مَصَادِرَ شَتَّى يَبْعَثُهُمْ اللَّهُ عَلَى نِيَّاتِهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14806,
                "hadithNumber": "7245",
                "englishNarrator": "Usama رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) climbed up a battlement amongst the battlements of Medina and then said: You do not see what I am seeing and I am seeing the places of turmoil between your houses as the places of rainfall.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم مدینہ منورہ کے قلعوں میں سے ایک قلعے ( اونچی محفوظ عمارت ) پر چڑھے ، پھر فرمایا : \" کیا تم ( بھی ) دیکھتے ہو جو میں دیکھ رہا ہوں؟میں تمہارے گھروں میں فتنوں کے واقع ہونے کے مقامات بارش ٹپکنے کے نشانات کی طرح ( بکثرت اور واضح ) دیکھ رہا ہوں ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو ناقد، اسحاق بن ابراہیم اور ابن ابی عمر نے بیان کیا، اور قول ابن ابی شیبہ کا ہے۔ اسحاق نے کہا: ہمیں اسحاق نے خبر دی، اور دوسروں نے کہا:سفیان بن عینیہ نے زہری سے ، انھوں نے عروہ سے اور انھوں نے حضرت اسامہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِي عُمَرَ وَاللَّفْظُ لِابْنِ أَبِي شَيْبَةَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ أُسَامَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشْرَفَ عَلَى أُطُمٍ مِنْ آطَامِ الْمَدِينَةِ ثُمَّ قَالَ هَلْ تَرَوْنَ مَا أَرَى إِنِّي لَأَرَى مَوَاقِعَ الْفِتَنِ خِلَالَ بُيُوتِكُمْ كَمَوَاقِعِ الْقَطْرِ.",
                "headingArabic": "نُزُولِ الْفِتَنِ كَمَوَاقِعِ الْقَطْرِ",
                "headingUrdu": "بارش کی طرح فتنوں کا آغاز",
                "headingEnglish": "Onset Of Tribulations Like Rainfall",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14807,
                "hadithNumber": "7246",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
                "hadithUrdu": "اور ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبد الرزاق نے بیان کیا, معمر نے زہری سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14808,
                "hadithNumber": "7247",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There will be soon a period of turmoil in which the one who sits will be better than one who stands and the one who stands will be better than one who walks and the one who walks will be better than one who runs. He who would watch them will be drawn by them. So he who finds a refuge or shelter against it should make it as his resort.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" عنقریب فتنے ہوں گے ، ان میں بیٹھا رہنے والا کھڑے رہنے والے سے بہتر ہوگا اور ان میں کھڑا ہونے والا چلنے و الے سے بہتر ہوگااور ان میں چلنے والا دوڑنے والے سے بہتر ہوگا جو ان کی طرف جھانکے گا بھی وہ اسے اوندھا کردیں گے اور جس کو ان ( کے دوران ) میں کوئی پناہ گاہ مل جائے وہ اس کی پناہ حاصل کرلے ۔ \"",
                "urduNarrator": "مجھے عمرو ناقد، حسن الحلوانی اور عبد بن حمید نے بیان کیا۔ عبد نے کہا, مجھے عبد نے بتایا، اور باقی دو نے کہا: یعقوب نے جو ابراہیم بن سعد کے بیٹے ہیں، بیان کیا۔ میرے والد نے ہم سے صالح کی سند سے اور ابن شہاب کی سند سے بیان کیا, ابن مسیب اور ابو سلمہ بن عبدالرحمان نے حدیث بیان کی کہ حضرت ابو ہریرۃ رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ وَالْحَسَنُ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ أَخْبَرَنِي و قَالَ الْآخَرَانِ حَدَّثَنَا يَعْقُوبُ وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي ابْنُ الْمُسَيَّبِ وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَتَكُونُ فِتَنٌ الْقَاعِدُ فِيهَا خَيْرٌ مِنْ الْقَائِمِ وَالْقَائِمُ فِيهَا خَيْرٌ مِنْ الْمَاشِي وَالْمَاشِي فِيهَا خَيْرٌ مِنْ السَّاعِي مَنْ تَشَرَّفَ لَهَا تَسْتَشْرِفُهُ وَمَنْ وَجَدَ فِيهَا مَلْجَأً فَلْيَعُذْ بِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14809,
                "hadithNumber": "7248",
                "englishNarrator": "This hadith has been transmitted on the authority of Abu Huraira رضی اللہ عنہ but with this variation of wording that in the hadith transmitted on the authority of Abu Bakr رضی اللہ عنہ, there is an addition of these words:",
                "hadithEnglish": "There is a prayer among prayers ('Asr) and one who misses it is as if his family and property have been ruined.",
                "hadithUrdu": "\" نمازوں میں ایک نماز ایسی ہے جس کی وہ ( نماز ) فوت ہوگئی تو گویا اس کا اہل اور مال ( سب کچھ ) تباہ ہوگیا ۔ \"",
                "urduNarrator": "ہم سے عمرو نا قد، حسن الحلوانی اور عبد بن حمید نے بیان کیا, عبد نے کہا: مجھے عبد نے خبر دی، اور دوسرے دو نے کہا: ہم سے یعقوب نے بیان کیا، ہمارے والد نے، صالح کی سند سے، ابن شہاب کی سند سے, ابو بکر بن عبدالرحمن نے عبدالرحمن بن مطیع بن اسودسے ، انھوں نے نوفل بن معاویہ سے حضرت ابو ہریرہ رضی اللہ عنہ کی اسی حدیث کے مانند حدیث بیان کی ، البتہ ابو بکر نے مزید کہا ہے",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَالْحَسَنُ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ أَخْبَرَنِي و قَالَ الْآخَرَانِ حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُطِيعِ بْنِ الْأَسْوَدِ عَنْ نَوْفَلِ بْنِ مُعَاوِيَةَ مِثْلَ حَدِيثِ أَبِي هُرَيْرَةَ هَذَا إِلَّا أَنَّ أَبَا بَكْرٍ يَزِيدُ مِنْ الصَّلَاةِ صَلَاةٌ مَنْ فَاتَتْهُ فَكَأَنَّمَا وُتِرَ أَهْلَهُ وَمَالَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14810,
                "hadithNumber": "7249",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There would be turmoil and the one who would sleep would be better than who would be awake and the one who would be awake would be better than one who would stand and one who would stand would be better than one who would run. So he who finds refuge or shelter should take that refuge or shelter.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" ایسا فتنہ ( برپا ہوگا ) جس میں سونے والا جاگنے والےسے بہتر ہوگا اور اس میں جاگنے والے سے بہتر ہوگا اور اس میں جاگنے والا ( اٹھ ) کھڑے ہو جانے والے سے بہتر ہوگا اور اس میں کھڑا ہوجانے والا دوڑنے والے سےبہتر ہوگا جس کو بچنے کی جگہ یاکوئی پناہ گاہ مل جائے تو وہ ( اس کی ) پناہ حاصل کرے ۔ \"",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا، کہا ہم سے ابوداؤد طیالسی نے بیان کیا, ابراہیم بن سعد کے والد نے ابو سلمہ سے انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا  کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ أَبِيهِ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَكُونُ فِتْنَةٌ النَّائِمُ فِيهَا خَيْرٌ مِنْ الْيَقْظَانِ وَالْيَقْظَانُ فِيهَا خَيْرٌ مِنْ الْقَائِمِ وَالْقَائِمُ فِيهَا خَيْرٌ مِنْ السَّاعِي فَمَنْ وَجَدَ مَلْجَأً أَوْ مَعَاذًا فَلْيَسْتَعِذْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14811,
                "hadithNumber": "7250",
                "englishNarrator": "Uthman bin Ash-Shah-ham said:",
                "hadithEnglish": "Farqad As-Sabakhi and I went to Muslim bin Abi Bakra رضی اللہ عنہ reported: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: There would soon be turmoil. Behold! there would be turmoil in which the one who would be seated would be better than one who would stand and the one who would stand would be better than one who would run. Behold! when the turmoil comes or it appears, the one who has camel should stick to his camel and he who has sheep or goat should stick to his sheep and goat and he who has land should stick to the land. A person said: 'Allah's Messenger, what is your opinion about one who has neither camel nor sheep nor land? Thereupon, he said: He should take hold of his sword and beat its edge with the help of stone and then try to find a way of escape. O Allah, I have conveyed (Thy Message); O Allah, I have conveyed (Thy Message); O Allah, I have conveyed (Thy Message). A person said: Allah's Messenger, what is your opinion if I am drawn to a rank in spite of myself, or in one of the groups and made to march and a man strikes with his sword or there comes an arrow and kills me? Thereupon he said: He will bear the punishment of his sin and that of yours and he would be one amongst the denizens of Hell.",
                "hadithUrdu": "میں اور فرقد سبخی مسلم بن ابی بکرہ کے ہاں گئے ، وہ اپنی زمین میں تھے ہم ان کے ہاں اندر داخل ہوئے اور کہا : کیا آپ نے اپنےوالد کو فتنوں کے بارے میں کوئی حدیث بیان کرتے ہوئے سنا؟انھوں نے کہا : ہاں ، میں نے ( اپنے والد ) حضرت ابو بکرۃ رضی اللہ عنہ وحدیث بیان کرتے ہوئے سنا ، انھوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم ! نے فرمایا : \" عنقریب فتنے برپا ہوں گے سن لو!پھر ( اور ) فتنے برپا ہوں گے ، ان ( کےدوران ) میں بیٹھا رہنے و الا چلے والے سے بہتر ہوگا ، اور ان میں چلنے والا دوڑنے والے سے بہتر ہوگایاد رکھو!جب وہ نازل ہوگا یا واقع ہوں گے تو جس کے ( پاس ) اونٹ ہوں وہ اپنے اونٹوں کے پاس چلا جائے ، جس کے پاس بکریاں ہوں وہ بکریوں کے پاس چلاجائے اور جس کی زمین وہ زمین میں چلاجائے ۔ \" ( حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے ) کہا : تو ایک شخص نے عرض کی اللہ کے رسول صلی اللہ علیہ وسلم !اس کےبارے میں کیا خیال ہے جس کے پاس یہ اونٹ ہوں ، نہ بکریاں ، نہ زمین؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ اپنی تلوار لے ، اس کی دھار کو پتھر سے کوٹے ( کندکردے ) اورپھر اگر بچ سکےتو بچ نکلے!اے اللہ!کیا میں نے ( حق ) پہنچا دیا؟اے اللہ! کیا میں نے ( حق ) پہنچا دیا ۔ اے اللہ! کیا میں نے پہنچا دیا ۔ کہا : تو ایک شخص نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !اگر مجھے مجبور کردیا جائے اور لے جاکر ایک صف میں یا ایک فریق کے ساتھ کھڑا کردیاجائے اور کوئی آدمی مجھے اپنی تلوار کا نشانہ بنادے یا کوئی تیر آئے اور مجھے مار ڈالے تو؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" ( اگر تم نے وار نہ کیا ہوا ) تو وہ اپنے اور تمہارے گناہ سمیٹ لے جائے گا اور اہل جہنم میں سے ہوجائے گا ۔ \"",
                "urduNarrator": "مجھ سے ابو کامل الجہدری فضیل بن حسین نے بیان کیا, حمادبن زید نے کہا , ہمیں عثمان الشحام نے حدیث بیان کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ فُضَيْلُ بْنُ حُسَيْنٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا عُثْمَانُ الشَّحَّامُ قَالَ انْطَلَقْتُ أَنَا وَفَرْقَدٌ السَّبَخِيُّ إِلَى مُسْلِمِ بْنِ أَبِي بَكْرَةَ وَهُوَ فِي أَرْضِهِ فَدَخَلْنَا عَلَيْهِ فَقُلْنَا هَلْ سَمِعْتَ أَبَاكَ يُحَدِّثُ فِي الْفِتَنِ حَدِيثًا قَالَ نَعَمْ سَمِعْتُ أَبَا بَكْرَةَ يُحَدِّثُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا سَتَكُونُ فِتَنٌ أَلَا ثُمَّ تَكُونُ فِتْنَةٌ الْقَاعِدُ فِيهَا خَيْرٌ مِنْ الْمَاشِي فِيهَا وَالْمَاشِي فِيهَا خَيْرٌ مِنْ السَّاعِي إِلَيْهَا أَلَا فَإِذَا نَزَلَتْ أَوْ وَقَعَتْ فَمَنْ كَانَ لَهُ إِبِلٌ فَلْيَلْحَقْ بِإِبِلِهِ وَمَنْ كَانَتْ لَهُ غَنَمٌ فَلْيَلْحَقْ بِغَنَمِهِ وَمَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَلْحَقْ بِأَرْضِهِ قَالَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَرَأَيْتَ مَنْ لَمْ يَكُنْ لَهُ إِبِلٌ وَلَا غَنَمٌ وَلَا أَرْضٌ قَالَ يَعْمِدُ إِلَى سَيْفِهِ فَيَدُقُّ عَلَى حَدِّهِ بِحَجَرٍ ثُمَّ لِيَنْجُ إِنْ اسْتَطَاعَ النَّجَاءَ اللَّهُمَّ هَلْ بَلَّغْتُ اللَّهُمَّ هَلْ بَلَّغْتُ اللَّهُمَّ هَلْ بَلَّغْتُ قَالَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ أُكْرِهْتُ حَتَّى يُنْطَلَقَ بِي إِلَى أَحَدِ الصَّفَّيْنِ أَوْ إِحْدَى الْفِئَتَيْنِ فَضَرَبَنِي رَجُلٌ بِسَيْفِهِ أَوْ يَجِيءُ سَهْمٌ فَيَقْتُلُنِي قَالَ يَبُوءُ بِإِثْمِهِ وَإِثْمِكَ وَيَكُونُ مِنْ أَصْحَابِ النَّارِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14812,
                "hadithNumber": "7251",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Waki' with a slight variation of wording.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا, وکیع اور ا بن ابی عدی نے عثمان شحام سے اسی سند کے ساتھ ابن عدی کی حدیث کو حماد کی حدیث کے مانند آخر تک بیان کیا اور وکیع کی حدیث اس بات پر ختم ہوگئی؛ \" اگر وہ بچ سکے ( تو بچ جائے ۔ ) \" اور بعد والا حصہ بیان نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا وَكِيعٌ و حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ كِلَاهُمَا عَنْ عُثْمَانَ الشَّحَّامِ بِهَذَا الْإِسْنَادِ حَدِيثُ ابْنِ أَبِي عَدِيٍّ نَحْوَ حَدِيثِ حَمَّادٍ إِلَى آخِرِهِ وَانْتَهَى حَدِيثُ وَكِيعٍ عِنْدَ قَوْلِهِ إِنْ اسْتَطَاعَ النَّجَاءَ وَلَمْ يَذْكُرْ مَا بَعْدَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14813,
                "hadithNumber": "7252",
                "englishNarrator": "Ahnaf bin Qais reported:",
                "hadithEnglish": "I set out with the intention of helping this person (Hadrat 'Ali) when Abu Bakra رضی اللہ عنہ met me. He said: Ahnaf, where do you intend to go? I said: I intend to help the cousin of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), viz. 'Ali. Thereupon he said to me: Ahnaf, go back, for I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) as saying: When two Muslims confront one another with swords (in hand) both the slayer and the slain would be in Fire. He (Ahnaf) said: I said, or it was said: Allah's Messenger, it may be the case of one who kills. but what about the slain (why he would be put in Hell-Fire)? Thereupon he said: He also intended to kill his companion.",
                "hadithUrdu": "میں ( گھر سے ) اس شخص ( حضرت علی رضی اللہ عنہ کے ساتھ شامل ہونے ) کے ارادے سے نکلا تو مجھے حضرت ابو بکر رضی اللہ عنہ ملے ۔ انھوں نے پوچھا : احنف! کہاں کاارداہ ہے؟کہا : میں نے کہ میں رسول اللہ صلی اللہ علیہ وسلم کے عم زادیعنی حضرت علی رضی اللہ عنہ کی نصرت کرنا چاہتا ہوں ۔ کہا تو انھوں نے مجھ سے کہا : احنف !لوٹ جاؤ کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سناتھا آپ فرمارہے تھے \" جب دومسلمان اپنی اپنی تلواروں کے ساتھ آمنے سامنے آجائیں تو قاتل اور مقتول دونوں ( جہنم کی ) آگ میں ہوں گے ۔ \" کہا : تو میں نے عرض کی ۔ یا کہاگیا ۔ اللہ کے رسول اللہ صلی اللہ علیہ وسلم !یہ تو قاتل ہوا ( لیکن ) مقتول کا یہ حال کیوں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" اس نے ( بھی ) اپنے ساتھی کو قتل کرنے کا ارداہ کر لیاتھا ۔",
                "urduNarrator": "ابو کامل فضیل بن حسین جحدری نے مجھے حدیث بیان کی کہا : ہمیں حماد بن زید نے ایوب اور یونس سے حدیث بیان کی انھوں نے احنف بن قیس سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ وَيُونُسَ عَنْ الْحَسَنِ عَنْ الْأَحْنَفِ بْنِ قَيْسٍ قَالَ خَرَجْتُ وَأَنَا أُرِيدُ هَذَا الرَّجُلَ فَلَقِيَنِي أَبُو بَكْرَةَ فَقَالَ أَيْنَ تُرِيدُ يَا أَحْنَفُ قَالَ قُلْتُ أُرِيدُ نَصْرَ ابْنِ عَمِّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي عَلِيًّا قَالَ فَقَالَ لِي يَا أَحْنَفُ ارْجِعْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا تَوَاجَهَ الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ قَالَ فَقُلْتُ أَوْ قِيلَ يَا رَسُولَ اللَّهِ هَذَا الْقَاتِلُ فَمَا بَالُ الْمَقْتُولِ قَالَ إِنَّهُ قَدْ أَرَادَ قَتْلَ صَاحِبِهِ.",
                "headingArabic": "إِذَا تَوَاجَهَ الْمُسْلِمَانِ بِسَيْفَيْهِمَا",
                "headingUrdu": "اگر دو مسلمان اپنی تلواریں لے کر ایک دوسرے کا مقابلہ کریں۔",
                "headingEnglish": "If Two Muslims Confront One Another With Their Swords",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14501,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=580",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=578",
                "label": "578",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=579",
                "label": "579",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=580",
                "label": "580",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=581",
                "label": "581",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=582",
                "label": "582",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=583",
                "label": "583",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=584",
                "label": "584",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=582",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=582",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=580",
        "to": 14525,
        "total": 40465
    }
}