{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 301,
        "data": [
            {
                "id": 7789,
                "hadithNumber": "225",
                "englishNarrator": "It is narrated on the authority of Abdullah bin Umar ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Apostle (ﷺ) observed on the occasion of the Farewell Pilgrimage Woe unto you distress unto you! Don't turn back as unbelievers after me by striking the necks of one another.",
                "hadithUrdu": "آپ ﷺ نے حجۃ الوداع کے موقع پر فرمایا : ’’ تم پر افسوس ہوتا ہے ( یا فرمایا : تمہارے لیے تباہی ہو گی ) تم میرے بعد کافر نہ ہو جانا کہ ایک دوسرے کی گردنیں مارنے لگو ۔ ‘ ‘",
                "urduNarrator": "ابوبکر بن ابی شیبہ اور ابوبکر بن خلاد الباہلی نے مجھ سے بات کی اور کہا,محمد بن جعفر نے کہا ,ہم سے شعبہ نے واقد بن محمد بن زید سے حدیث بیان کی کہ انہوں نے اپنے والد سے سنا ، وہ حضرت عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث بیان کرتے تھے ، انہوں نے نبی ﷺ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ، قَالَا: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ وَاقِدِ بْنِ مُحَمَّدِ بْنِ زَيْدٍ، أَنَّهُ سَمِعَ أَبَاهُ، يُحَدِّثُ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ فِي حَجَّةِ الْوَدَاعِ: وَيْحَكُمْ - أَوْ قَالَ: وَيْلَكُمْ - لَا تَرْجِعُوا بَعْدِي كُفَّارًا، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7790,
                "hadithNumber": "226",
                "englishNarrator": null,
                "hadithEnglish": "Harmala bin Yahya, Abdullah bin Wahb, Umar bin Muhammad, Ibn Umar narrated like the hadith reported by Shu'ba on the authority of Waqid.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے یہ کیوں کیا؟ کیا وہ شعبی کی حدیث سے ملتا جلتا کچھ ذکر کرتے ہیں، واقد کی سند میں؟",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، انہوں نے کہا: مجھ سے عمر بن محمد نے بیان کیا، کہ ان سے ان کے والد نے ابن عمر رضی اللہ عنہما سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، قَالَ: حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، أَنَّ أَبَاهُ، حَدَّثَهُ عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ شُعْبَةَ، عَنْ وَاقِدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7791,
                "hadithNumber": "227",
                "englishNarrator": "It is narrated on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) observed: Two (things) are found among men which are tantamount to unbelief: slandering one's lineage and lamentation on the dead.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ لوگوں میں دو باتیں ہیں ، وہ دونوں ان میں کفر ( کی بقیہ عادتیں ) ہیں : ( کسی کے ) نسب پر طعن کرنا اور میت پر نوحہ کرنا ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو معاویہ نے بیان کیا اور ہم سے ابن نمیر نے بیان کیا , ان کا قول ہے , ہم سے میرے والد اور محمد بن عبید نے ابو صالح کی سند سے بیان کیا,حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ - اللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، وَمُحَمَّدُ بْنُ عُبَيْدٍ كُلُّهُمْ عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: اثْنَتَانِ فِي النَّاسِ هُمَا بِهِمْ كُفْرٌ: الطَّعْنُ فِي النَّسَبِ وَالنِّيَاحَةُ عَلَى الْمَيِّتِ.",
                "headingArabic": "إِطْلاَقِ اسْمِ الْكُفْرِ عَلَى الطَّعْنِ فِي النَّسَبِ وَالنِّيَاحَةِ عَلَى الْمَيِّتِ ‏‏",
                "headingUrdu": "لوگوں کے نسب پر بہتان لگانے اور نوحہ خوانی کے لیے لفظ کفر کا استعمال",
                "headingEnglish": "Use of the word Kufr with regard to slandering people's lineage and wailing",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7792,
                "hadithNumber": "228",
                "englishNarrator": "It is narrated on the authority of Jarir that he heard Ash-shabi say:",
                "hadithEnglish": "The slave who fled from his master committed an act of infidelity as long as he would not return to him. Mansur observed: By God, this hadith was narrated from the Apostle (may peace and blessings be upon him), but I do not like that this should be narrated on my authority here in Basra.",
                "hadithUrdu": "’’ جو غلام اپنے مالکوں سے بھاگ گیا ، اس نےکفر کا ارتکاب کیا یہاں تک کہ ان کی طرف لوٹ آئے ۔ ‘ ‘ ( نہ یہ کہ دوبارہ مسلمان ہو ۔ ) منصور نے کہا : اللہ کی قسم ! یہ حدیث نبی اکرمﷺ سے روایت کی گئی ہے لیکن میں ناپسند کرتا ہوں کہ یہاں ( بصرہ میں ) مجھ سےیہ ( اس طرح مرفوعاً ) روایت کی جائے ۔ ( کیونکہ بصرہ کےخارجی اس سے مطلق کفر کا استدلال کریں گے ۔ )",
                "urduNarrator": "ہم سے علی بن حجر السعدی نے بیان کیا، کہا ہم سے اسماعیل نے بیان کیا، یعنی ابن عالیہ نے، کہا ہم سے منصور بن عبدالرحمٰن نے، وہ شعبی کی سند سے، وہ جریر کی سند سے کہ انہوں نے اسے سنا، وہ فرماتے ہیں:منصور بن عبدالرحمٰن نے شعبی سےروایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عُلَيَّةَ، عَنْ مَنْصُورِ بْنِ عَبْدِ الرَّحْمَنِ، عَنِ الشَّعْبِيِّ، عَنْ جَرِيرٍ أَنَّهُ سَمِعَهُ يَقُولُ: «أَيُّمَا عَبْدٍ أَبَقَ مِنْ مَوَالِيهِ فَقَدْ كَفَرَ حَتَّى يَرْجِعَ إِلَيْهِمْ» قَالَ مَنْصُورٌ: «قَدْ وَاللهِ رُوِيَ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَلَكِنِّي أَكْرَهُ أَنْ يُرْوَى عَنِّي هَاهُنَا بِالْبَصْرَةِ»",
                "headingArabic": "تَسْمِيَةِ الْعَبْدِ الآبِقِ كَافِرًا ‏‏",
                "headingUrdu": "بھاگے ہوئے غلام کو کافر کہنا",
                "headingEnglish": "Calling a runaway slave a kafirg",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7793,
                "hadithNumber": "229",
                "englishNarrator": "It is narrated on the authority of Jarir رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah (ﷺ) observed: The slave who fled from his master, responsibility with regard to him was absolved.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ جو غلام بھگوڑا ہو گیا تو اس ( کے تحفظ ) سے ( اسلامی معاشرے اور حکومت کی ) ذمہ داری ختم ہو گئی ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے حفص بن غیث نے بیان کیا،داؤد نے شعبی سے ، انہوں نے حضرت جریر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ دَاوُدَ، عَنِ الشَّعْبِيِّ، عَنْ جَرِيرٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا عَبْدٍ أَبَقَ فَقَدْ بَرِئَتْ مِنْهُ الذِّمَّةُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7794,
                "hadithNumber": "230",
                "englishNarrator": "It was narrated that Jarir bin Abdullah رضی ‌اللہ ‌عنہ ‌said:",
                "hadithEnglish": "The Holy Prophet said: When the slave runs away from his master, his prayer is not accepted.",
                "hadithUrdu": "نبی ﷺبیان کیا کرتے تھے : ’’ جب غلام بھاگ جائے تو اس کی نماز قبول نہیں ہوتی ۔ ‘ ‘ ( جس طرح حرام کھانے والے کی نماز قبول نہیں ہوتی ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے جریر نے بیان کیا,مغیرہ نے شعبی سے روایت کی ، انہوں نے کہا : حضرت جریر بن عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، عَنِ الشَّعْبِيِّ، قَالَ: كَانَ جَرِيرُ بْنُ عَبْدِ اللهِ، يُحَدِّثُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَبَقَ الْعَبْدُ لَمْ تُقْبَلْ لَهُ صَلَاةٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7795,
                "hadithNumber": "231",
                "englishNarrator": "It is narrated on the authority of Zaid bin Khalid al-Juhani ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah (may peace and blessings be upon him) led the morning prayer at Hudaybiya. There were some marks of the rainfall during the night. At the conclusion of prayer he turned towards people and observed: Do you know what your Lord has said? They replied: Allah and His Messenger know best. Upon this he (the Holy Prophet) remarked: He (Allah) said: Some of My bondsmen entered the morning as My believers and some as unbelievers. He who said: We have had a rainfall due to the Blessing and Mercy of Allah, he is My believer and a disbeliever of stars, and who said: We have had a rainfall due to the rising of such and such (star) disbelieved Me and affirmed his faith in the stars.",
                "hadithUrdu": "رسول اللہ ﷺ نے حدیبیہ کے مقام پر رات کو ہونے والی بارش کے بعد ، ہمیں صبح کی نماز پڑھائی ۔ جب آپ نے سلام پھیرا تو لوگوں کی طرف متوجہ ہوئے اور فرمایا : ’’کیا تم جانتے ہو تمہارے رب نے کیا فرمایا؟ ‘ ‘ انہوں نےجواب دیا اللہ اور اس کا رسول بہتر جانتے ہیں ۔ آپ نے فرمایا : ’’ اللہ تعالیٰ نے فرمایا : ( آج ) میرے بندوں میں سے کوئی مجھ پر ایمان لانےو الا اور ( کوئی میرےساتھ ) کفر کرنے والا ہو گیا ۔ جس نے یہ کہا ہے کہ ہم پر اللہ تعالیٰ کےفضل اور رحمت سےبارش ہوئی ہے تو وہ مجھ پر ایمان رکھنے والا اور ستارے کے ساتھ کفر کرنے والا ہے اور جس نے کہا کہ ہم پر فلاں فلاں ستارے ( کےغروب و طلوع ہونے ) کی وجہ سے بارش ہوئی ہے تو وہ میرے ساتھ کفر کرنے والا اور ستارے پر ایمان رکھنے والا ہے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک کو صالح بن کیسان سے اور عبید اللہ بن عبداللہ بن عتبہ رضی اللہ عنہ سے,حضرت زید بن جہنی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ عُتْبَةَ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، قَالَ: صَلَّى بِنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ بِالْحُدَيْبِيَةِ فِي إِثْرِ السَّمَاءِ كَانَتْ مِنَ اللَّيْلِ، فَلَمَّا انْصَرَفَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ: «هَلْ تَدْرُونَ مَاذَا قَالَ رَبُّكُمْ؟» قَالُوا: اللهُ وَرَسُولُهُ أَعْلَمُ، قَالَ: قَالَ: أَصْبَحَ مِنْ عِبَادِي مُؤْمِنٌ بِي وَكَافِرٌ، فَأَمَّا مَنْ قَالَ: مُطِرْنَا بِفَضْلِ اللهِ وَرَحْمَتِهِ فَذَلِكَ مُؤْمِنٌ بِي كَافِرٌ بِالْكَوْكَبِ، وَأَمَّا مَنْ قَالَ: مُطِرْنَا بِنَوْءِ كَذَا وَكَذَا فَذَلِكَ كَافِرٌ بِي مُؤْمِنٌ بِالْكَوْكَبِ.",
                "headingArabic": "بَيَانِ كُفْرِ مَنْ قَالَ مُطِرْنَا بِالنَّوْءِ ‏",
                "headingUrdu": "اس شخص کے کفر کو واضح کرنا جو کہتا ہے: ’’ہم پر ستاروں کی وجہ سے بارش ہوئی‘‘۔",
                "headingEnglish": "Clarifying the Kufr of one who says: \"We got rain because of the stars.\"",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7796,
                "hadithNumber": "232",
                "englishNarrator": "It is reported on the authority of Abu Huraira رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: Don't you know what your Lord said? He observed: I have never endowed My bondsmen with a favor, but a section amongst them disbelieved it and said: Stars, it was due to the stars.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ کیا تمہیں معلوم نہیں کہ تمہارے رب عز وجل نے کیا فرمایا ؟ اس نے فرمایا : جو نعمت بھی میں بندوں کو دیتا ہوں تو ان میں سے ایک گروہ ( سے تعلق رکھنے والے لوگ ) اس ( نعمت ) کے سبب سے کفرکرنے والےہو جاتے ہیں اور کہتے ہیں : فلاں ستارے ( نے یہ نعمت دی ہے ) یا فلاں فلاں ستاروں کے سبب سے ( ملی ہے ۔ ) ‘ ‘",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ، عمرو بن سواد العمیری اور محمد بن سلمہ المرادی نے بیان کیا، کہا: ہم سے عبداللہ بن وہب نے بیان کیا، انہوں نے یونس سے، اور انہوں نے کہا, ہم سے ابن وہب نے بیان کیا۔ انہوں نے کہا, مجھ سے یونس نے بیان کیا، ابن شہاب کی سند سے، انہوں نے کہا,عبید اللہ بن عبد اللہ بن عتبہ نےحدیث بیان کی کہ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےکہا",
                "hadithArabic": "دَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، وَعَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ، وَمُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، قَالَ الْمُرَادِيُّ: حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، عَنْ يُونُسَ، وَقَالَ الْآخَرَانِ: أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ: أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ: حَدَّثَنِي عُبَيْدُ اللهِ بْنُ عَبْدِ اللهِ بْنِ عُتْبَةَ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَلَمْ تَرَوْا إِلَى مَا قَالَ رَبُّكُمْ؟ قَالَ: مَا أَنْعَمْتُ عَلَى عِبَادِي مِنْ نِعْمَةٍ إِلَّا أَصْبَحَ فَرِيقٌ مِنْهُمْ بِهَا كَافِرِينَ. يَقُولُونَ الْكَوَاكِبُ وَبِالْكَوَاكِبِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7797,
                "hadithNumber": "233",
                "englishNarrator": "It is reported on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah (may peace and blessing be upon him) observed: Allah does not shower His blessings from the heaven that in the morning a group of men disbelieve it (to be a blessing from Allah). Allah sends down rain, but they (the disbelievers) say: Such and such star (is responsible for that).",
                "hadithUrdu": "آپ ﷺ نے فرمایا : ’’اللہ تعالیٰ آسمان سے برکت ( بارش ) نازل نہیں کرتا مگر لوگوں کا ایک گروہ ، اس کے سبب سے کافر ہو جاتا ہے ، بارش اللہ تعالیٰ اتارتا ہے ( لیکن ) یہ لوگ کہتے ہیں : فلاں فلاں ستارے کے باعث ( اتری ہے ۔ ) ‘ ‘ اور مرادی کی روایت کے یہ ا لفاظ ہیں : ’’فلاں فلاں ستارے کے باعث ( اتری ہے ۔",
                "urduNarrator": "مجھ سے محمد بن سلمہ مرادی نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا، کہا ہم سے عمرو بن الحارث نے، کہا ہم سے عمرو بن سواد نے، کہا ہم سے عبداللہ بن وہب نے، کہا ہم سے عمرو بن الحارث نے بیان کیا کہ ابو یونس، موکل, حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، ح وَحَدَّثَنِي عَمْرُو بْنُ سَوَّادٍ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ أَنَّ أَبَا يُونُسَ مَوْلَى أَبِي هُرَيْرَةَ حَدَّثَهُ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَا أَنْزَلَ اللهُ مِنَ السَّمَاءِ مِنْ بَرَكَةٍ إِلَّا أَصْبَحَ فَرِيقٌ مِنَ النَّاسِ بِهَا كَافِرِينَ، يُنْزِلُ اللهُ الْغَيْثَ فَيَقُولُونَ: الْكَوْكَبُ كَذَا وَكَذَا وَفِي حَدِيثِ الْمُرَادِيِّ: «بِكَوْكَبِ كَذَا وَكَذَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7798,
                "hadithNumber": "234",
                "englishNarrator": "It is reported on the authority of Ibn 'Abbas رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "There was (once) a downpour during the life of the Apostle ﷺ Upon this the Apostle (ﷺ) observed: Some people entered the morning with gratitude and some with ingratitude (to Allah). Those who entered with gratitude said: This is the blessing of Allah, and those who entered with ingratitude said: Such and such asterism was right. It was upon this that the verse was revealed: I swear by the setting of the stars to the end and make your provision that you should disbelieve it.",
                "hadithUrdu": "رسول اللہ ﷺ نے دور میں لوگوں کو بارش سے نوازا گیا تو نبی اکرم ﷺ نے فرمایا : ’’ لوگوں میں سے کچھ شکر گزار ہو گئے ہیں اور کچھ کافر ( ناشکرے ) ، ( بعض ) لوگوں نے کہا : یہ اللہ کی رحمت ہے اور بعض نے کہا : فلاں فلاں نوء ( ایک ستارے کا غروب اور اس کے سبب سے دوسرے کی بلندی ) سچی نکلی ۔ ‘ ‘ ( ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) فرماتے ہیں ، اس پر یہ آیت نازل ہوئی : ’’میں ستاروں کے گرنے کی جگہوں کی قسم کھاتا ہوں ۔ ‘ ‘ ( سے لے کر ) اس آیت تک : ’’ اور تم اپنا حصہ یہ رکھتے ہو کہ تم اس کی تکذیب کرتے ہو ۔ ‘ ‘",
                "urduNarrator": "ہم سے عباس بن عبدالعظیم الانباری نے بیان کیا، کہا ہم سے النذر بن محمد نے بیان کیا، کہا ہم سے عکرمہ نے جو ابن عمار ہیں، انہوں نے بیان کیا، کہا ہم سے ابو زمیل نے بیان کیا، انہوں نے کہا,حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "وَحَدَّثَنِي عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عِكْرِمَةُ وَهُوَ ابْنُ عَمَّارٍ، حَدَّثَنَا أَبُو زُمَيْلٍ، قَالَ: حَدَّثَنِي ابْنُ عَبَّاسٍ، قَالَ: مُطِرَ النَّاسُ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: أَصْبَحَ مِنَ النَّاسِ شَاكِرٌ وَمِنْهُمْ كَافِرٌ، قَالُوا: هَذِهِ رَحْمَةُ اللهِ، وَقَالَ بَعْضُهُمْ: لَقَدْ صَدَقَ نَوْءُ كَذَا وَكَذَا قَالَ: فَنَزَلَتْ هَذِهِ الْآيَةُ: {فَلَا أُقْسِمُ بِمَوَاقِعِ النُّجُومِ} [الواقعة: 75]، حَتَّى بَلَغَ: {وَتَجْعَلُونَ رِزْقَكُمْ أَنَّكُمْ تُكَذِّبُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7799,
                "hadithNumber": "235",
                "englishNarrator": null,
                "hadithEnglish": "It is reported on the authority of Anas that the Messenger of Allah (may peace and blessings Be upon him) observed:",
                "hadithUrdu": "انس ‌سے ‌روایت ‌ہے ‌رسول ‌اللہ ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌نے ‌فرمایا ‌منافق ‌كی ‌نشانی ‌یہ ‌ہے ‌كہ ‌انصار ‌سے ‌دشمنی ‌ركھے ‌اور ‌مومن ‌كی ‌نشانی ‌یہ ‌ہے ‌كہ ‌انصار ‌سے ‌محبت ‌ركھے ‌. ‌",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ شُعْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ جَبْرٍ، قَالَ سَمِعْتُ أَنَسًا، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏  ‏ آيَةُ الْمُنَافِقِ بُغْضُ الأَنْصَارِ وَآيَةُ الْمُؤْمِنِ حُبُّ الأَنْصَارِ ‏ ‏ ",
                "headingArabic": "الدَّلِيلِ عَلَى أَنَّ حُبَّ الأَنْصَارِ وَعَلِيٍّ رَضِيَ اللَّهُ عَنْهُمْ مِنَ الإِيمَانِ وَعَلاَمَاتِهِ وَبُغْضَهُمْ مِنْ عَلاَمَاتِ النِّفَاقِ",
                "headingUrdu": "اس بات کا ثبوت کہ انصار اور علی رضی اللہ عنہ کی محبت ایمان کا حصہ اور اس کی نشانی ہے۔ ان سے نفرت کرنا منافقت کی نشانی ہے۔",
                "headingEnglish": "Evidence that love of the Ansar and Ali (r.a.) is a part of faith and a sign thereof; Hating them is a sign of hypocrisy",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7800,
                "hadithNumber": "236",
                "englishNarrator": "It was narrated from Anas رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The prophet ﷺ said: The sign of a hypocrite is the hatred against the Ansar and the sign of a believer is the love for the Ansar.",
                "hadithUrdu": "نبی اکرمﷺ نے فرمایا : ’’انصار سے محبت کرنا ایمان کی نشانی ہے او ران سے بغض رکھنا نفاق کی علامت ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن حبیب الحارثی نے بیان کیا، انہوں نے بیان کیا,خالد بن حارث نے کا : ہمیں شعبہ نے حدیث سنائی ، انہوں نے عبد اللہ بن عبد اللہ سے ، انہوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللهِ بْنِ عَبْدِ اللهِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «حُبُّ الْأَنْصَارِ آيَةُ الْإِيمَانِ، وَبُغْضُهُمْ آيَةُ النِّفَاقِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7801,
                "hadithNumber": "237",
                "englishNarrator": "Al-Bara رضی ‌اللہ ‌عنہ reported from the Messenger (ﷺ) :",
                "hadithEnglish": "He remarked with regard to the Ansar: None but the believer loves them, none but the hypocrite hates them. He who loves them loves Allah and he who hates them hates Allah. I (the narrator) said: Did you hear this hadith from al-Bara' رضی ‌اللہ ‌عنہ ? He said: He narrated it to me.",
                "hadithUrdu": "آپ نے انصار کے بارے میں فرمایا : ’’ ان سے محبت نہیں کرتا مگر وہی جو مومن ہےاور ان سے بغض نہیں رکھتا مگر وہی جو منافق ہے ۔ جس سے ان سے محبت کی ، اللہ اس سے محبت کرتا ہے او رجس نے ان سے بغض رکھا اللہ اس سے بغض رکھتا ہے ۔ ‘ ‘ شعبہ نے کہا : میں عدی سے پوچھا : کیا تم نے یہ روایت براء ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنی ہے ؟ توانہوں نے جواب دیا : انہوں نے یہ حدیث مجھی کو سنائی تھی ۔",
                "urduNarrator": "شعبہ نے عدی بن ثابت سے روایت کی ، انہوں نے کہا : میں نے حضرت براء ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو نبی اکرم ﷺ سے حدیث بیان کرتے ہوئے سنا کہ",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، قَالَ: حَدَّثَنِي مُعَاذُ بْنُ مُعَاذٍ، ح وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ، وَاللَّفْظُ لَهُ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، قَالَ: سَمِعْتُ الْبَرَاءَ يُحَدِّثُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ فِي الْأَنْصَارِ: «لَا يُحِبُّهُمْ إِلَّا مُؤْمِنٌ، وَلَا يُبْغِضُهُمْ إِلَّا مُنَافِقٌ، مَنْ أَحَبَّهُمْ أَحَبَّهُ اللهُ وَمَنْ أَبْغَضَهُمْ أَبْغَضَهُ اللهُ» قَالَ شُعْبَةُ: قُلْتُ لِعَدِيٍّ: سَمِعْتَهُ مِنَ الْبَرَاءِ؟، قَالَ: إِيَّايَ حَدَّثَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7802,
                "hadithNumber": "238",
                "englishNarrator": "It is reported on the authority of Abu Huraira رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: A person who believes in Allah and the Last Day never nurses a grudge against the Ansar.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ کوئی ایسا آدمی انصار سے بغض نہیں رکھے گا جو اللہ تعالیٰ اور قیامت پر ایمان رکھتا ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے یعقوب نے، یعنی ابن عبدالرحمٰن القاری نے، ہم سے سہیل کی سند سے، وہ اپنے والد سے، وہ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يُبْغِضُ الْأَنْصَارَ رَجُلٌ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7803,
                "hadithNumber": "239",
                "englishNarrator": "It is narrated on the authority of Abu Sa'id Khudri ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah observed: The person who believes in Allah and the Last Day never nurses a grudge against the Ansar.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ کوئی شخص انصار سے بغض نہیں رکھ سکتا جو اللہ تعالیٰ اورآخرت کےدن پر ایمان رکھتا ہو.",
                "urduNarrator": "ہم سے عثمان بن محمد بن ابی شیبہ نے بیان کیا، ان سے جریر، ایچ، نے بیان کیا، ان سے ابوبکر بن ابی شیبہ نے بیان کیا، ان سے ابو اسامہ نے بیان کیا، ان دونوں نے الاعضاء کی سند سے بیان کیا، وہ ابو کی سند سےصالح،حضرت ابو سعید ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "وَحَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، كِلَاهُمَا عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يُبْغِضُ الْأَنْصَارَ رَجُلٌ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7804,
                "hadithNumber": "240",
                "englishNarrator": "It was narrated that Zirr reported:",
                "hadithEnglish": "'Ali observed: By Him Who split up the seed and created something living, the Apostle (may peace and blessings be upon him) gave me a promise that no one but a believer would love me, and none but a hypocrite would nurse grudge against me.",
                "hadithUrdu": "حضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : اس ذات کی قسم جس نے دانے کو پھاڑ اور روح کو تخلیق کیا ! نبی امی ﷺنے مجھے بتا دیا تھا کہ ’’ میرے ساتھ مومن کے سوا کوئی محبت نہیں کرے گا اور منافق کے سوا کوئی بغض نہیں رکھے گا ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، وکیع نے اور ہم سے ابو معاویہ نے بیان کیا، انہیں الاعمش کی سند سے، ہم سے یحییٰ بن یحییٰ نے بیان کیا، اور اس کا تلفظ یہ ہے کہ ہم سے احب ابو معاویہ نے بیان کیا, الاعمش نے عدی بن ثابت سے زر کی سند سے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَاللَّفْظُ لَهُ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ زِرٍّ، قَالَ: قَالَ عَلِيٌّ: وَالَّذِي فَلَقَ الْحَبَّةَ، وَبَرَأَ النَّسَمَةَ، إِنَّهُ لَعَهْدُ النَّبِيِّ الْأُمِّيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ إِلَيَّ: «أَنْ لَا يُحِبَّنِي إِلَّا مُؤْمِنٌ، وَلَا يُبْغِضَنِي إِلَّا مُنَافِقٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7805,
                "hadithNumber": "241",
                "englishNarrator": "It is narrated on the authority of 'Abdullah bin Umar ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah observed: O womenfolk, you should give charity and ask much forgiveness for I saw you in bulk amongst the dwellers of Hell. A wise lady among them said: Why is it, Messenger of Allah, that our folk is in bulk in Hell? Upon this the Prophet observed: You curse too much and are ungrateful to your spouses. I have seen none lacking in common sense and failing in religion but (at the same time) robbing the wisdom of the wise, besides you. Upon this the woman remarked: What is wrong with our common sense and with religion? He (the Holy Prophet) observed: Your lack of common sense (can be well judged from the fact) that the evidence of two women is equal to one man, that is a proof of the lack of common sense, and you spend some nights (and days) in which you do not offer prayer and in the month of Ramadan (during the days) you do not observe fast, that is a failing in religion.",
                "hadithUrdu": "آپ نے فرمایا : ’’اے عورتوں کی جماعت ! تم صدقہ کیا کرو ، اور زیادہ سے زیادہ استغفار کیا کرو ، کیونکہ میں نے دوزخیوں میں اکثریت تمہاری دیکھی ہے ۔ ‘ ‘ ان میں سے ایک دلیر اورسمجھ دار عورت نے کہا : اللہ کے رسول! ہمیں کیا ہے ، دوزخ میں جانے والوں کی اکثریت ہماری ( کیوں ) ہے ؟ آپ نے فرمایا : ’’ تم لعنت بہت بھیجتی ہو اور خاوند کا کفران ( نعمت ) کرتی ہو ، میں نے عقل و دین میں کم ہونے کے باوجود ، عقل مند شخص پر غالب آنے میں تم سے بڑھ کر کسی کو نہیں دیکھا ۔ ‘ ‘ اس نے پوچھا؟ اے اللہ کے رسول ! عقل و دین میں کمی کیا ہے ؟ آپ نےفرمایا : ’’ عقل میں کمی یہ ہے کہ دوعورتوں کی شہادت ایک مرد کے برابر ہے ، یہ توہوئی عقل کی کمی اور وہ ( حیض کے دوران میں ) کئی راتیں ( اور دن ) گزارتی ہے کہ نماز نہیں پڑھتی اور رمضان میں بے روزہ رہتی ہے تویہ دین میں کمی ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے محمد بن رومہ بن المہاجر المصری نے بیان کیا,لیث نے ابن ہادلیثی سے خبر دی کہ عبد اللہ بن دینار نےحضرت عبداللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے رسول اللہ ﷺ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ الْمِصْرِيُّ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ الْهَادِ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «يَا مَعْشَرَ النِّسَاءِ، تَصَدَّقْنَ وَأَكْثِرْنَ الِاسْتِغْفَارَ، فَإِنِّي رَأَيْتُكُنَّ أَكْثَرَ أَهْلِ النَّارِ» فَقَالَتِ امْرَأَةٌ مِنْهُنَّ جَزْلَةٌ: وَمَا لَنَا يَا رَسُولَ اللهِ أَكْثَرُ أَهْلِ النَّارِ؟ قَالَ: «تُكْثِرْنَ اللَّعْنَ، وَتَكْفُرْنَ الْعَشِيرَ، وَمَا رَأَيْتُ مِنْ نَاقِصَاتِ عَقْلٍ وَدِينٍ أَغْلَبَ لِذِي لُبٍّ مِنْكُنَّ» قَالَتْ: يَا رَسُولَ اللهِ، وَمَا نُقْصَانُ الْعَقْلِ وَالدِّينِ؟ قَالَ: أَمَّا نُقْصَانُ الْعَقْلِ: فَشَهَادَةُ امْرَأَتَيْنِ تَعْدِلُ شَهَادَةَ رَجُلٍ فَهَذَا نُقْصَانُ الْعَقْلِ، وَتَمْكُثُ اللَّيَالِيَ مَا تُصَلِّي، وَتُفْطِرُ فِي رَمَضَانَ فَهَذَا نُقْصَانُ الدِّينِ.",
                "headingArabic": "بَيَانِ نُقْصَانِ الإِيمَانِ بِنَقْصِ الطَّاعَاتِ وَبَيَانِ إِطْلاَقِ لَفْظِ الْكُفْرِ عَلَى غَيْرِ الْكُفْرِ بِاللَّهِ كَكُفْرِ النِّعْمَةِ وَالْحُقُوقِ",
                "headingUrdu": "یہ واضح کرنا کہ اطاعت میں کوتاہی سے ایمان میں کمی آتی ہے، اور کفر کا لفظ اللہ پر ایمان کے علاوہ دیگر امور کے لیے بھی استعمال کیا جا سکتا ہے، جیسے نعمتوں کی ناشکری اور اپنے فرائض کی ادائیگی نہ کرنا۔",
                "headingEnglish": "Clarifying that faith decreases with shortcoming in obedience, and the word Kufr may be used with regard to matters other than dsbelief in Allah, such as ingratitude for blessings and not fulfilling one's duties",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7806,
                "hadithNumber": "242",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Abu Tahir with this chain of transmitters.",
                "hadithUrdu": "مجھے ابو الطاہر نے ابن وہب نے بکر بن مدر سے اور ابن الحاد کی سند سے اس روایت سے روایت کیا ہے۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنِيهِ أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ بَكْرِ بْنِ مُضَرَ، عَنِ ابْنِ الْهَادِ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7807,
                "hadithNumber": "243",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this as narrated by Ibn 'Umar has also been transmitted by Abu Sa'id al-Khudri. A hadith like this as narrated by Ibn 'Umar has also been transmitted by Abu Huraira.",
                "hadithUrdu": "عیاض بن عبد اللہ نےحضرت ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اورانہوں نے نبی اکرمﷺ سے اور ( سعید ) مقبری نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے نبی ﷺ سے اسی طرح روایت کی جس طرح حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی روایت ہے ۔ باب : 35 ۔ نماز چھوڑنے والے پر لفظ کفر کا اطلاق کرنا نمازاسلام کا رکن ہے ۔ اس کا ترک پچھلی احادیث میں ذکر کیے گئے متعدد گناہوں سے زیادہ سنگین ہے ۔ اس پر جس کفر کا اطلاق کیا گیا وہ ان کے کفر سے بڑا کفر ہے ، پھر بھی اس سے توبہ اور آیندہ نماز کی پابندی سے انسان اچھا مسلمان بن جاتا ہے ، اسے دوبارہ اسلام لانے کی ضرورت نہیں ہوتی ۔ جو نماز کا منکر ہے اسے ازسرنو اسلام لانے کی ضرورت ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ، قَالَا: حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ: أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ عِيَاضِ بْنِ عَبْدِ اللهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. ح وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ مَعْنَى حَدِيثِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7808,
                "hadithNumber": "244",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The messenger of Allah ﷺ said: When, the son of Adam recites the Ayat of Sajdah (prostration) and then falls down in prostration, the Satan goes into seclusion and weeps and says: Alas, and in the narration of Abu Kuraib the words are: Woe unto me, the son of Adam was commanded to prostrate, and he prostrated and Paradise was entitled to him and I was commanded to prostrate, but I refused and am doomed to Hell.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ جب ابن آدم سجدے کی آیت تلاوت کر کے سجدہ کرتا ہے تو شیطان روتے ہوئے وہاں سے ہٹ جاتا ہے ، وہ کہتا ہے : ہائے اس کی ہلاکت ! ( اور ابوکریب کی روایت میں ہے ، ہائے میری ہلاکت! ) ابن آدم کو سجدے کا حکم ملا تو اس نے سجدہ کیا ، اس پر اسے جنت مل گئی اور مجھے سجدے کا حکم ملا تو میں نے انکار کیا ، سو میرے لیے آگ ہے ۔ ‘ ‘",
                "urduNarrator": "حضرت ابوبکر بن ابی شیبہ اور ابو کریب نے کہا : ہمیں ابو معاویہ نے اعمش سے حدیث سنائی ، انہو ں نے ابو صالح سے اور انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: إِذَا قَرَأَ ابْنُ آدَمَ السَّجْدَةَ فَسَجَدَ اعْتَزَلَ الشَّيْطَانُ يَبْكِي، يَقُولُ: يَا وَيْلَهُ - وَفِي رِوَايَةِ أَبِي كُرَيْبٍ: يَا وَيْلِي - أُمِرَ ابْنُ آدَمَ بِالسُّجُودِ فَسَجَدَ فَلَهُ الْجَنَّةُ، وَأُمِرْتُ بِالسُّجُودِ فَأَبَيْتُ فَلِيَ النَّارُ.",
                "headingArabic": "بَيَانِ إِطْلاَقِ اسْمِ الْكُفْرِ عَلَى مَنْ تَرَكَ الصَّلاَةَ ‏‏",
                "headingUrdu": "نماز ترک کرنے والے کے لیے لفظ کافر کے استعمال کی وضاحت",
                "headingEnglish": "Clarifying the usage of the word Kafir for one who abandons Salat",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7809,
                "hadithNumber": "245",
                "englishNarrator": "A'mash narrated this hadith with the same chain of transmitters, with this change of words:",
                "hadithEnglish": "He (the Satan) said: I disobeyed and I am doomed to Hell.",
                "hadithUrdu": "وکیع نے ( فأبيت..... ’’ میں نے انکار کیا ‘ ‘ کے بجائے ) فعصيت فعلي النار ’’ میں نے نافرمانی کی تو میرے لیے جہنم ( مقدر ) ہوئی ‘ ‘ کہا ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، انہوں نے ہم سے بیان کیا,وکیع نے اعمش سے اسی سند کے ساتھ یہی حدیث بیان کی ۔ فرق یہ ہے کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الْأَعْمَشُ بِهَذَا الْإِسْنَادِ، مِثْلَهُ غَيْرَ أَنَّهُ قَالَ: فَعَصَيْتُ فَلِيَ النَّارُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7810,
                "hadithNumber": "246",
                "englishNarrator": "It is narrated on the authority of Jabir رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "He heard the Apostle (may peace and blessings be upon him) saying. Verily between man and between polytheism and unbelief is the negligence of prayer.",
                "hadithUrdu": "میں نے رسول اللہﷺ کو یہ فرماتے ہوئے سنا : ’’ بے شک آدمی اورشرک و کفر کے درمیان ( فاصلہ مٹانے والا عمل ) نماز کا ترک ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی اور عثمان بن ابی شیبہ نے بیان کیا، ان دونوں نے جریر کی سند سے کہا: ہم سے جریر نے الاعمش کی سند سے بیان کیا,ابو سفیان سےروایت ہے ، انہوں نے کہا : میں نے حضرت جابر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو یہ کہتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، كِلَاهُمَا عَنْ جَرِيرٍ، قَالَ يَحْيَى: أَخْبَرَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، قَالَ: سَمِعْتُ جَابِرًا، يَقُولُ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ بَيْنَ الرَّجُلِ وَبَيْنَ الشِّرْكِ وَالْكُفْرِ تَرْكَ الصَّلَاةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7811,
                "hadithNumber": "247",
                "englishNarrator": "It is narrated on the authority of Abu Zubair that he heard Jabir b. 'Abdullah saying.",
                "hadithEnglish": "I heard the Messenger of Allah (ﷺ) observing this: Between man and polytheism and unbelief is the abandonment of salat.",
                "hadithUrdu": "میں نے رسول اللہ ﷺ کویہ فرماتے ہوئے سنا : ’’ آدمی اور شرک و کفر کے درمیان ( فاصلہ مٹانے والا عمل ) نماز چھوڑنا ہے ۔ ‘ ‘ ( اس روایت میں إن’’بےشک ‘ ‘ کا لفظ نہیں ، باقی وہی ہے ۔ )",
                "urduNarrator": "ہم سے ابو غسان مسمعی نے بیان کیا، کہا ہم سے ضحاک بن مخلد نے بیان کیا، انہوں نے ابن جریج کی سند سے کہا: مجھ سےابو زبیر نے خبر دی کہ انہوں نے حضرت جابر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، انہوں نے کہا",
                "hadithArabic": ") حَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ: أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «بَيْنَ الرَّجُلِ وَبَيْنَ الشِّرْكِ وَالْكُفْرِ تَرْكُ الصَّلَاةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7812,
                "hadithNumber": "248",
                "englishNarrator": "It was narrated that Abu Huraira رضی ‌اللہ ‌عنہ ‌said:",
                "hadithEnglish": "The Messenger of Allah  ﷺ was asked about the best of deeds. He observed: Belief in Allah. He (the inquirer) said: What next? He (the Holy Prophet  ﷺ) replied: Jihad (struggle to the utmost) in the cause of Allah. He (the inquirer) again said: What next? He (the Holy Prophet  ﷺ) replied: Pilgrimage accepted into the grace of the Lord. In the. tradition narrated on the authority of Muhammad b. Ja'far (the words are) that he (the Holy Prophet) said: Belief in Allah and His Messenger.",
                "hadithUrdu": "رسول اللہ ﷺ سے پوچھا گیا : کون ساعمل سب سے افضل ہے ؟ آپ نے فرمایا : ’’ اللہ عز وجل پر ایمان لانا ۔ ‘ ‘ پوچھا گیا : پھر اس کے بعد کون سا ؟ آپ نے فرمایا : ’’ اللہ کے راستے میں جہاد کرنا ۔ ‘ ‘ پوچھا گیا : پھر کو ن سا ؟ فرمایا : ’’حج مبرور ( ایسا حج جو سراسرنیکی اور تقوے پر مبنی اور مکمل ہو ۔ ) ‘ ‘ محمد بن جعفر کی روایت میں ’’ اللہ اور اس کے رسول پر ایمان ‘ ‘ کے الفاظ ہیں ۔",
                "urduNarrator": "منصور بن ابی مزاحم اور محمد بن جعفر بن زیاد نے کہا : ہمیں ابراہیم بن سعد نے ابن شہاب سے حدیث سنائی ، انہوں نے سعید بن مسیب سے اور انہوں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا کہ",
                "hadithArabic": "وَحَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ ح، وَحَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ، أَخْبَرَنَا إِبْرَاهِيمُ، يَعْنِي ابْنَ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: سُئِلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْأَعْمَالِ أَفْضَلُ؟ قَالَ: «إِيمَانٌ بِاللهِ»، قَالَ: ثُمَّ مَاذَا؟ قَالَ: «الْجِهَادُ فِي سَبِيلِ اللهِ» قَالَ: ثُمَّ مَاذَا؟ قَالَ: «حَجٌّ مَبْرُورٌ»، وَفِي رِوَايَةِ مُحَمَّدِ بْنِ جَعْفَرٍ قَالَ: «إِيمَانٌ بِاللهِ وَرَسُولِهِ.",
                "headingArabic": "بَيَانِ كَوْنِ الإِيمَانِ بِاللَّهِ تَعَالَى أَفْضَلَ الأَعْمَالِ ‏‏",
                "headingUrdu": "یہ واضح کرنا کہ اللہ پر ایمان سب سے افضل عمل ہے۔",
                "headingEnglish": "Clarifying that faith in Allah most high is the best of deeds",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7813,
                "hadithNumber": "249",
                "englishNarrator": null,
                "hadithEnglish": "Muhammad bin Rafi and 'Abd bin Humaid, 'Abdur-Razzaq and Ma'mar and Zuhri have narrated a hadith like this on the authority of the same chain of transmitters.",
                "hadithUrdu": "مجھ سے محمد بن رافع اور عبد بن حمید نے عبد الرزاق کی سند سے ہمیں  زہری سے اسی سند کے ساتھ یہی روایت بیان کی۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7501,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=300",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=298",
                "label": "298",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=299",
                "label": "299",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=300",
                "label": "300",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=301",
                "label": "301",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=302",
                "label": "302",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=303",
                "label": "303",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=304",
                "label": "304",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=302",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=302",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=300",
        "to": 7525,
        "total": 40465
    }
}