{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 432,
        "data": [
            {
                "id": 11064,
                "hadithNumber": "3500",
                "englishNarrator": "Anas (رضی اللہ عنہ ) reported:",
                "hadithEnglish": "I was sitting behind Abu Talha رضی اللہ عنہ on the Day of Khaibar and my feet touched the foot of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and we came (to the people of Khaibar) when the sun had risen and they had driven out their cattle, and had themselves come out with their axes, large baskets and hatchets, and they said: (Here come) Muhammad and the army. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Khaibar is ruined. Verily when we get down in the valley of a people, evil is the morning of the warned ones (al-Qur'an, xxxvii. 177). Allah, the Majestic and the Glorious, defeated them (the inhabitants of Khaibar), and there fell to the lot of Dihya a beautiful girl, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) got her in exchange of seven heads, and then entrusted her to Umm Sulaim so that she might embellish her and prepare her (for marriage) with him. He (the narrator) said: He had been under the impression that he had said that so that she might spend her period of 'Iddah in her (Umm Sulaim's) house. (The woman) was Safiyya daughter of Huyayy. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) arranged the wedding feast consisting of dates, cheese, and refined butter, and pits were dug and tiers were set in them dining cloths, and there was brought cheese and refined butter, and these were placed there. And the people ate to their fill, and they said: We do not know whether he (the Holy Prophet) had married her (as a free woman), or as a slave woman. They said: If he (the Holy Prophet) would make her wear the veil, then she would be a (free married) woman, and if he would not make her wear the veil, then she should be a slave woman. When he intended to ride, he made her wear the veil and she sat on the hind part of the camel; so they came to know that he had married her. As they approached Medina, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) drove (his ride) quickly and so we did. 'Adba' (the name of Allah's Apostle's camel) stumbled and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) fell down and she (Radrat Safiyya: also fell down. He (the Holy Prophet) stood up and covered her. Women looked towards her and said: May Allah keep away the Jewess! He (the narrator) said: I said: Aba Hamza, did Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) really fall down? He said: Yes, by Allah, he in fact fell down.",
                "hadithUrdu": "میں خیبر کے دن ابوطلحہ رضی اللہ عنہ کے ساتھ سوار تھا ، اور میرا پاؤں رسول اللہ صلی اللہ علیہ وسلم کے قدم مبارک کو چھو رہا تھا ۔ کہا : ہم ( صفحہ نمبر 67 پی ڈی ایف فائل میں نہیں ہے ) رفتار تیز کر لی ، کہا : اونٹنی عضباء ٹھوکر کھا کر گر گئی اور رسول اللہ صلی اللہ علیہ وسلم ( پالان سے ) نکل گئے اور وہ ( سیدہ صفیہ رضی اللہ عنہا ) بھی نکل کر گر گئیں ، آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور ان کو پردے میں کیا ، عورتیں اوپر سے جھانک رہی تھیں ، کہنے لگیں : اللہ یہودی عورت کو دور کرے ۔ ( ثابت نے ) کہا : میں نے کہا : اے ابوحمزہ! کیا رسول اللہ صلی اللہ علیہ وسلم گر پڑے تھے؟ انہوں نے جواب دیا : ہاں اللہ کی قسم! آپ گر پڑے تھے ۔ حضرت انس رضی اللہ عنہ نے کہا : اور میں نے حضرت زینب رضی اللہ عنہا کے ولیمے میں بھی شرکت کی تھی ۔ آپ نے لوگوں کو پیٹ بھر کر روٹی اور گوشت کھلایا تھا ، آپ مجھے بھتیجے تھے میں لوگوں کو ( کھانے کے لیے ) بلاتا تھا ۔ جب آپ فارغ ہوئے ، تو کھڑے ہو گئے اور میں نے بھی آپ کی پیروی کی ، پیچھے دو آدمی رہ گئے ، باہمی گفتگو نے ان دونوں کو ساتھ لگائے رکھا ۔ وہ دونوں نہ نکلے ۔ آپ نے ( چلتے ہوئے ) اپنی ازواج مطہرات کے پاس جانا شروع کیا ۔ آپ ان میں سے ہر ایک کو سلام کرتے ، ( فرماتے ) \"\" تم پر سلامتی ہو ، گھر والو! آپ کیسے ہو؟ \"\" وہ جواب دیتے : اللہ کے رسول! خیریت سے ہیں ۔ آپ نے اپنے اہل ( نئی اہلیہ ) کو کیسا پایا؟ رسول اللہ صلی اللہ علیہ وسلم جواب دیتے : \"\" خیر و ( عافیت ) کے ساتھ ۔ \"\" جب آپ صلی اللہ علیہ وسلم فارغ ہوئے تو واپس ہوئے ، میں بھی آپ کے ساتھ لوٹ آیا ، جب آاپ دروازے پر پہنچے تو آپ نے اُن دو آدمیوں کو دیکھا ( کہ ) باہمی گفتگو نے ان دونوں کو ساتھ لگا رکھا ہے ، جب ان دونوں نے آپ کو دیکھا کہ آپ واپس آ رہے ہیں تو وہ دونوں اٹھے اور چلے گئے ۔ اللہ کی قسم! ( اب ) مجھے معلوم نہیں کہ میں نے آپ کو بتایا یا آپ پر وحی نازل کی گئی کہ وہ دونوں چلے گئے ہیں ۔ آپ واپس آئے اور میں بھی آپ کے ساتھ واپس آیا ۔ پھر آپ نے اپنا پاؤں دروازے کی چوکھٹ پر رکھا تو میرے اور اپنے درمیان پردہ لٹکا دیا ۔ اور اللہ تعالیٰ نے یہ آیت نازل فرمائی : \"\" تم لوگ نبی صلی اللہ علیہ وسلم کے گھروں میں مت داخل ہو اِلا یہ کہ تمہیں ( اس کی ) اجازت دی جائے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عفان نے بیان کیا، حماد بن سلمہ نے ہمیں حدیث بیان کی ، کہا : ثابت نے ہمیں حضرت انس رضی اللہ عنہ سے حدیث سنائی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ: كُنْتُ رِدْفَ أَبِي طَلْحَةَ يَوْمَ خَيْبَرَ، وَقَدَمِي تَمَسُّ قَدَمَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: فَأَتَيْنَاهُمْ حِينَ بَزَغَتِ الشَّمْسُ وَقَدْ أَخْرَجُوا مَوَاشِيَهُمْ، وَخَرَجُوا بِفُئُوسِهِمْ، وَمَكَاتِلِهِمْ، وَمُرُورِهِمْ، فَقَالُوا: مُحَمَّدٌ، وَالْخَمِيسُ، قَالَ: وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ {فَسَاءَ صَبَاحُ الْمُنْذَرِينَ} [الصافات: 177] ، قَالَ: وَهَزَمَهُمُ اللهُ عَزَّ وَجَلَّ، وَوَقَعَتْ فِي سَهْمِ دِحْيَةَ جَارِيَةٌ جَمِيلَةٌ، فَاشْتَرَاهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِسَبْعَةِ أَرْؤُسٍ، ثُمَّ دَفَعَهَا إِلَى أُمِّ سُلَيْمٍ تُصَنِّعُهَا لَهُ وَتُهَيِّئُهَا - قَالَ: وَأَحْسِبُهُ قَالَ - وَتَعْتَدُّ فِي بَيْتِهَا، وَهِيَ صَفِيَّةُ بِنْتُ حُيَيٍّ، قَالَ: وَجَعَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَلِيمَتَهَا التَّمْرَ وَالْأَقِطَ وَالسَّمْنَ، فُحِصَتِ الْأَرْضُ أَفَاحِيصَ، وَجِيءَ بِالْأَنْطَاعِ، فَوُضِعَتْ فِيهَا، وَجِيءَ بِالْأَقِطِ وَالسَّمْنِ فَشَبِعَ النَّاسُ، قَالَ: وَقَالَ النَّاسُ: لَا نَدْرِي أَتَزَوَّجَهَا، أَمِ اتَّخَذَهَا أُمَّ وَلَدٍ؟ قَالُوا: إِنْ حَجَبَهَا فَهِيَ امْرَأَتُهُ، وَإِنْ لَمْ يَحْجُبْهَا فَهِيَ أُمُّ وَلَدٍ، فَلَمَّا أَرَادَ أَنْ يَرْكَبَ حَجَبَهَا، فَقَعَدَتْ عَلَى عَجُزِ الْبَعِيرِ، فَعَرَفُوا أَنَّهُ قَدْ تَزَوَّجَهَا، فَلَمَّا دَنَوْا مِنَ الْمَدِينَةِ، دَفَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَدَفَعْنَا، قَالَ: فَعَثَرَتِ النَّاقَةُ الْعَضْبَاءُ، وَنَدَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَنَدَرَتْ، فَقَامَ فَسَتَرَهَا، وَقَدْ أَشْرَفَتِ النِّسَاءُ، فَقُلْنَ: أَبْعَدَ اللهُ الْيَهُودِيَّةَ، قَالَ: قُلْتُ: يَا أَبَا حَمْزَةَ، أَوَقَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: إِي وَاللهِ، لَقَدْ وَقَعَ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ: كُنْتُ رِدْفَ أَبِي طَلْحَةَ يَوْمَ خَيْبَرَ، وَقَدَمِي تَمَسُّ قَدَمَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: فَأَتَيْنَاهُمْ حِينَ بَزَغَتِ الشَّمْسُ وَقَدْ أَخْرَجُوا مَوَاشِيَهُمْ، وَخَرَجُوا بِفُئُوسِهِمْ، وَمَكَاتِلِهِمْ، وَمُرُورِهِمْ، فَقَالُوا: مُحَمَّدٌ، وَالْخَمِيسُ، قَالَ: وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ {فَسَاءَ صَبَاحُ الْمُنْذَرِينَ} [الصافات: 177] ، قَالَ: وَهَزَمَهُمُ اللهُ عَزَّ وَجَلَّ، وَوَقَعَتْ فِي سَهْمِ دِحْيَةَ جَارِيَةٌ جَمِيلَةٌ، فَاشْتَرَاهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِسَبْعَةِ أَرْؤُسٍ، ثُمَّ دَفَعَهَا إِلَى أُمِّ سُلَيْمٍ تُصَنِّعُهَا لَهُ وَتُهَيِّئُهَا - قَالَ: وَأَحْسِبُهُ قَالَ - وَتَعْتَدُّ فِي بَيْتِهَا، وَهِيَ صَفِيَّةُ بِنْتُ حُيَيٍّ، قَالَ: وَجَعَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَلِيمَتَهَا التَّمْرَ وَالْأَقِطَ وَالسَّمْنَ، فُحِصَتِ الْأَرْضُ أَفَاحِيصَ، وَجِيءَ بِالْأَنْطَاعِ، فَوُضِعَتْ فِيهَا، وَجِيءَ بِالْأَقِطِ وَالسَّمْنِ فَشَبِعَ النَّاسُ، قَالَ: وَقَالَ النَّاسُ: لَا نَدْرِي أَتَزَوَّجَهَا، أَمِ اتَّخَذَهَا أُمَّ وَلَدٍ؟ قَالُوا: إِنْ حَجَبَهَا فَهِيَ امْرَأَتُهُ، وَإِنْ لَمْ يَحْجُبْهَا فَهِيَ أُمُّ وَلَدٍ، فَلَمَّا أَرَادَ أَنْ يَرْكَبَ حَجَبَهَا، فَقَعَدَتْ عَلَى عَجُزِ الْبَعِيرِ، فَعَرَفُوا أَنَّهُ قَدْ تَزَوَّجَهَا، فَلَمَّا دَنَوْا مِنَ الْمَدِينَةِ، دَفَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَدَفَعْنَا، قَالَ: فَعَثَرَتِ النَّاقَةُ الْعَضْبَاءُ، وَنَدَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَنَدَرَتْ، فَقَامَ فَسَتَرَهَا، وَقَدْ أَشْرَفَتِ النِّسَاءُ، فَقُلْنَ: أَبْعَدَ اللهُ الْيَهُودِيَّةَ، قَالَ: قُلْتُ: يَا أَبَا حَمْزَةَ، أَوَقَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: إِي وَاللهِ، لَقَدْ وَقَعَ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ: كُنْتُ رِدْفَ أَبِي طَلْحَةَ يَوْمَ خَيْبَرَ، وَقَدَمِي تَمَسُّ قَدَمَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: فَأَتَيْنَاهُمْ حِينَ بَزَغَتِ الشَّمْسُ وَقَدْ أَخْرَجُوا مَوَاشِيَهُمْ، وَخَرَجُوا بِفُئُوسِهِمْ، وَمَكَاتِلِهِمْ، وَمُرُورِهِمْ، فَقَالُوا: مُحَمَّدٌ، وَالْخَمِيسُ، قَالَ: وَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ {فَسَاءَ صَبَاحُ الْمُنْذَرِينَ} [الصافات: 177] ، قَالَ: وَهَزَمَهُمُ اللهُ عَزَّ وَجَلَّ، وَوَقَعَتْ فِي سَهْمِ دِحْيَةَ جَارِيَةٌ جَمِيلَةٌ، فَاشْتَرَاهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِسَبْعَةِ أَرْؤُسٍ، ثُمَّ دَفَعَهَا إِلَى أُمِّ سُلَيْمٍ تُصَنِّعُهَا لَهُ وَتُهَيِّئُهَا - قَالَ: وَأَحْسِبُهُ قَالَ - وَتَعْتَدُّ فِي بَيْتِهَا، وَهِيَ صَفِيَّةُ بِنْتُ حُيَيٍّ، قَالَ: وَجَعَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَلِيمَتَهَا التَّمْرَ وَالْأَقِطَ وَالسَّمْنَ، فُحِصَتِ الْأَرْضُ أَفَاحِيصَ، وَجِيءَ بِالْأَنْطَاعِ، فَوُضِعَتْ فِيهَا، وَجِيءَ بِالْأَقِطِ وَالسَّمْنِ فَشَبِعَ النَّاسُ، قَالَ: وَقَالَ النَّاسُ: لَا نَدْرِي أَتَزَوَّجَهَا، أَمِ اتَّخَذَهَا أُمَّ وَلَدٍ؟ قَالُوا: إِنْ حَجَبَهَا فَهِيَ امْرَأَتُهُ، وَإِنْ لَمْ يَحْجُبْهَا فَهِيَ أُمُّ وَلَدٍ، فَلَمَّا أَرَادَ أَنْ يَرْكَبَ حَجَبَهَا، فَقَعَدَتْ عَلَى عَجُزِ الْبَعِيرِ، فَعَرَفُوا أَنَّهُ قَدْ تَزَوَّجَهَا، فَلَمَّا دَنَوْا مِنَ الْمَدِينَةِ، دَفَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَدَفَعْنَا، قَالَ: فَعَثَرَتِ النَّاقَةُ الْعَضْبَاءُ، وَنَدَرَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَنَدَرَتْ، فَقَامَ فَسَتَرَهَا، وَقَدْ أَشْرَفَتِ النِّسَاءُ، فَقُلْنَ: أَبْعَدَ اللهُ الْيَهُودِيَّةَ، قَالَ: قُلْتُ: يَا أَبَا حَمْزَةَ، أَوَقَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: إِي وَاللهِ، لَقَدْ وَقَعَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11065,
                "hadithNumber": "3501",
                "englishNarrator": "Anas, (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Safiyya (رضی اللہ عنہا) fell to the lot of Dihya رضی اللہ عنہا in the spoils of war, and they praised her in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: We have not seen the like of her among the captives of war. He sent (a messenger) to Dihya رضی اللہ عنہا and he gave him whatever he demanded. He then sent her to my mother and asked her to embellish her. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then got out of Khaibar until when he was on the other side of it, he halted, and a tent was pitched for him. When it was morning Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: He who has surplus of provision with him should bring that to us. Some persons would bring the surplus of dates, and the other surplus of mush of barley until there became a heap of bals. They began to eat the hais and began to drink out of the pond which had the water of rainfall in it and which was situated by their side. Anas رضی اللہ عنہ said that that constituted the wedding feast of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He (further) said: We proceeded until we saw the walls of Medina, and we were delighted. We made our mounts run quickly and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) also made his mount run quickly. And Safiyya (رضی اللہ عنہا) was at his back, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had seated her behind him. The camel of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) stumbled and he (the Holy Prophet ﷺ) fell down and she also fell down. And none among the people was seeing him and her, until Allah's Messeuger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) stood up and he covered her, and we came to him and he said: We have received no injury. We entered Medina and there came out the young ladies of the household. They saw her (hadrat Safiyya رضی اللہ عنہا) and blamed her for falling down.",
                "hadithUrdu": "حضرت صفیہ حضرت دحیہ رضی اللہ عنہا کے حصے میں آ گئیں ، ( آپ صلی اللہ علیہ وسلم نے دحیہ رضی اللہ عنہا کو اپنے حصے کی ایک کنیز لینے کی اجازت دے کر غیر رسمی طور پر تقسیم کا آغاز فرما دیا تھا ۔ ) لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس ان کی تعریف کرنے لگے ، وہ کہہ رہے تھے : ہم نے قیدیوں میں ان جیسی عورت نہیں دیکھی ۔ تو آپ نے دحیہ رضی اللہ عنہ کی طرف پیغام بھیجا ، اور ان کے بدلے میں جو انہوں نے چاہا ، آپ صلی اللہ علیہ وسلم نے دیا ، پھر آپ نے اسے میری والدہ کے سپرد کیا اور فرمایا : \" اسے بنا سنوار دو ۔ \" پھر رسول اللہ صلی اللہ علیہ وسلم خیبر سے نکلے حتیٰ کہ جب آپ نے اسے پشت کی طرف کر لیا ، ( خیبر پیچھے رہ گیا ) تو آپ نے پڑاؤ ڈالا ، پھر ان ( حضرت صفیہ رضی اللہ عنہا ) کے لیے خیمہ لگوایا ، جب صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس کے پاس زادِ راہ سے زائد کچھ ہو وہ اسے ہمارے پاس لے آئے ۔ \" کہا : اس پر کوئی آدمی زائد کھجوریں لے کر آنے لگا اور ( کوئی ) زائد ستو ، حتیٰ کہ لوگوں نے ان چیزوں سے ایک ڈھیر مخلوط کھانے ( حَیس ) کا بنا لیا ، پھر وہ اس حیس میں سے تناول کرنےلگے اور بارش کے پانی کے حوضوں سے جو ان کے قریب تھے پانی پینے لگے ۔ کہا : حضرت انس رضی اللہ عنہ نے کہا : یہ تھا ان ( صفیہ رضی اللہ عنہا ) کے لیے رسول اللہ صلی اللہ علیہ وسلم کا ولیمہ ۔ کہا : اس کے بعد ہم چل پڑے ، جب ہم نے مدینہ کی دیواریں دیکھیں تو ہم شدتِ شوق سے اس کی طرف لپک پڑے ، ہم نے اپنی ساریاں اٹھا دیں ( تیز کر دیں ) اور رسول اللہ صلی اللہ علیہ وسلم نے بھی اپنی سواری اٹھا دی ۔ کہا : صفیہ رضی اللہ عنہا آپ کے پیچھے تھیں ، رسول اللہ صلی اللہ علیہ وسلم نے انہیں اپنے ساتھ سوار کر لیا تھا ، کہا : ( اچانک ) رسول اللہ کی سواری کو ٹھوکر لگی تو آپ زمین پر آ رہے اور وہ ( حضرت صفیہ رضی اللہ عنہا ) بھی زمین پر آ رہیں ، کہا : لوگوں میں سے کوئی بھی نہ آپ صلی اللہ علیہ وسلم کی طرف دیکھ رہا تھا اور نہ ان کی طرف ، کہا : حتیٰ کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے اور حضرت صفیہ رضی اللہ عنہا کے آگے پردہ کیا ، پھر ہم آپ کی خدمت میں حاضر ہوئے ، تو آپ نے فرمایا : \" ہمیں کوئی نقصان نہیں پہنچا ۔ \" پھر ہم مدینہ کے اندر داخل ہوئے تو آپ کی ازواج کی باندیاں باہر نکل آئیں ، وہ ایک دوسری کو وہ ( صفیہ رضی اللہ عنہا ) دکھا رہی تھیں ، اور ان کے گرنے پر دل ہی دل میں خوش ہو رہی تھیں.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے شبابہ نے بیان کیا, سلیمان بن مغیرہ نے ہمیں ثابت سے حدیث بیان کی کہا : حضرت انس رضی اللہ عنہ نے ہمیں حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا سُلَيْمَانُ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، ح وحَدَّثَنِي بِهِ عَبْدُ اللهِ بْنُ هَاشِمِ بْنِ حَيَّانَ، وَاللَّفْظُ لَهُ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، حَدَّثَنَا أَنَسٌ قَالَ: صَارَتْ صَفِيَّةُ لِدِحْيَةَ فِي مَقْسَمِهِ، وَجَعَلُوا يَمْدَحُونَهَا عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: وَيَقُولُونَ: مَا رَأَيْنَا فِي السَّبْيِ مِثْلَهَا، قَالَ: فَبَعَثَ إِلَى دِحْيَةَ، فَأَعْطَاهُ بِهَا مَا أَرَادَ، ثُمَّ دَفَعَهَا إِلَى أُمِّي، فَقَالَ: «أَصْلِحِيهَا»، قَالَ: ثُمَّ خَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنْ خَيْبَرَ، حَتَّى إِذَا جَعَلَهَا فِي ظَهْرِهِ نَزَلَ، ثُمَّ ضَرَبَ عَلَيْهَا الْقُبَّةَ، فَلَمَّا أَصْبَحَ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ عِنْدَهُ فَضْلُ زَادٍ، فَلْيَأْتِنَا بِهِ»، قَالَ: فَجَعَلَ الرَّجُلُ يَجِيءُ بِفَضْلِ التَّمْرِ، وَفَضْلِ السَّوِيقِ، حَتَّى جَعَلُوا مِنْ ذَلِكَ سَوَادًا حَيْسًا، فَجَعَلُوا يَأْكُلُونَ مِنْ ذَلِكَ الْحَيْسِ، وَيَشْرَبُونَ مِنْ حِيَاضٍ إِلَى جَنْبِهِمْ مِنْ مَاءِ السَّمَاءِ، قَالَ: فَقَالَ أَنَسٌ: فَكَانَتْ تِلْكَ وَلِيمَةَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَيْهَا، قَالَ: فَانْطَلَقْنَا، حَتَّى إِذَا رَأَيْنَا جُدُرَ الْمَدِينَةِ هَشِشْنَا إِلَيْهَا، فَرَفَعْنَا مَطِيَّنَا، وَرَفَعَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَطِيَّتَهُ، قَالَ: وَصَفِيَّةُ خَلْفَهُ، قَدْ أَرْدَفَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. قَالَ: فَعَثَرَتْ مَطِيَّةُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. فَصُرِعَ وَصُرِعَتْ، قَالَ: فَلَيْسَ أَحَدٌ مِنَ النَّاسِ يَنْظُرُ إِلَيْهِ، وَلَا إِلَيْهَا، حَتَّى قَامَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَتَرَهَا، قَالَ: فَأَتَيْنَاهُ، فَقَالَ: «لَمْ نُضَرَّ»، قَالَ: فَدَخَلْنَا الْمَدِينَةَ، فَخَرَجَ جَوَارِي نِسَائِهِ يَتَرَاءَيْنَهَا وَيَشْمَتْنَ بِصَرْعَتِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11066,
                "hadithNumber": "3502",
                "englishNarrator": "Anas ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "When the 'Iddah of Zainab رضی اللہ عنہا was over, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to Zaid to make a mention to her about him. Zaid رضی اللہ عنہ went on until he came to her and she was fermenting her flour. He (Zaid) said: As I saw her I felt in my heart an idea of her greatness so much so that I could not see towards her (simply for the fact) that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had made a mention of her. So I turned my back towards her. and I turned upon my heels, and said: Zainab, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) has sent (me) with a message to you. She said: I do not do anything until I solicit the will of my Lord. So she stood at her place of worship and the (verse of) the Qur'an (pertaining to her marriage) were revealed, and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to her without permission. He (the narrator) said: I saw that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) served us bread and meat until it was broad day light and the people went away, but some persons who were busy in con- versation stayed on in the house after the meal. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) also went out and I also followed him, and he began to visit the apartments of his wives greeting them (with the words): As-Salamu 'alaikum, and they would say: Allah's Messenger ﷺ, how did you find your family (hadrat Zainab رضی اللہ عنہا)? He (the narrator) stated: I do not know whether I had informed him that the people had gone out or he (the Holy Prophet ﷺ) informed me (about that). He moved on until he entered the apartment, and I also went and wanted to enter (the apartment) along with him, but he threw a curtain between me and him, as (the verfes pertaining to seclusion) had been revealed, and people were instructed in what they had been instructed. Ibn Rafii had made this addition in his narration: O you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished... to the words ... Allah forbears not from the truth.",
                "hadithUrdu": "جب حضرت زینب رضی اللہ عنہا کی عدت گزری تو رسول اللہ صلی اللہ علیہ وسلم نے حضرت زید رضی اللہ عنہ سے فرمایا : \"\" اِن ( زینب رضی اللہ عنہا ) کے سامنے ان کی میرے ساتھ شادی کا ذکر کرو ۔ \"\" کہا : تو حضرت زید رضی اللہ عنہ چلے حتیٰ کہ ان کے پاس پہنچے تو وہ اپنے آٹے میں خمیر ملا رہی تھیں ، کہا : جب میں نے ان کو دیکھا تو میرے دل میں ان کی عظمت بیٹھ گئی حتیٰ کہ میں ان کی طرف نظر بھی نہ اٹھا سکتا تھا کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے ان ( کے ساتھ شادی ) کا ذکر کیا تھا ، میں نے ان کی طرف اپنی پیٹھ کی اور ایڑیوں کے بل مڑا اور کہا : زینب! رسول اللہ صلی اللہ علیہ وسلم نے تمہارا ذکر کرتے ہوئے پیغام بھیجا ہے ۔ انہوں نے کہا : میں کچھ کرنے والی نہیں یہاں تک کہ اپنے رب سے مشورہ ( استخارہ ) کر لوں ، اور وہ اٹھ کر اپنی نماز کی جگہ کی طرف چلی گئیں اور ( ادھر ) قرآن نازل ہو گیا ، رسول اللہ صلی اللہ علیہ وسلم بغیر اجازت لیے ان کے پاس تشریف لے آئے ۔ ( سلیمان بن مغیرہ نے ) کہا : ( انس رضی اللہ عنہ نے ) کہا : میں نے اپنے آپ سمیت سب لوگوں کو دیکھا کہ جب دن کا اجالا پھیل گیا تو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں روٹی اور گوشت کھلایا ۔ اس کے بعد ( اکثر ) لوگ نکل گئے ، چند باقی رہ گئے وہ کھانے کے بعد ( آپ کے ) گھر میں ہی باتیں کرنے لگے ۔ رسول اللہ صلی اللہ علیہ وسلم ( وہاں سے ) نکلے ، میں بھی آپ کے پیچھے ہو لیا ، آپ یکے بعد دیگرے اپنی ازواج کے حجروں کی طرف جا کر انہیں سلام کہنے لگے ۔ وہ ( جواب دے کر ) کہتیں : اللہ کے رسول! آپ صلی اللہ علیہ وسلم نے اپنی ( نئی ) اہلیہ کو کیسا پایا؟ ( انس رضی اللہ عنہ نے ) کہا : میں نہیں جانتا میں نے آپ کو بتایا کہ لوگ جا چکے ہیں یا آپ نے مجھے بتایا ۔ پھر آپ چل پڑے حتیٰ کہ گھر میں داخل ہو گئے ۔ میں بھی آپ کے ساتھ داخل ہونے لگا تو آپ نے میرے اور اپنے درمیان پردہ لٹکا دیا اور ( اس وقت ) حجاب ( کا حکم ) نازل ہوا ، کہا : اور لوگوں کو ( اس مناسبت سے ) جو نصیحت کی جانی تھی کر دی گئی ۔ ابن رافع نے اپنی حدیث میں یہ اضافہ کیا : \"\" اے ایمان والو! تم نبی صلی اللہ علیہ وسلم کے گھروں میں داخل نہ ہوا کرو مگر یہ کہ تمہیں کھانے کے لیے ( آنے کی ) اجازت دی جائے ، اس حال میں ( آؤ ) کہ اس کے پکنے کا انتظار نہ کر رہے ہو ( کھانے کے وقت آؤ پہلے نہ آؤ ) \"\" سے لے کر اس فرمان تک : \"\" اور اللہ کا حق سے شرم نہیں کرتا.",
                "urduNarrator": "محمد بن حاتم بن میمون نے مجھے حدیث بیان کی ، کہا : ہمیں بہز نے حدیث سنائی ، نیز محمد بن رافع نے مجھے حدیث بیان کی ، کہا : ہمیں ابونضر ہاشم بن قاسم نے حدیث سنائی ، ان دونوں ( بہز اور ابونضر ) نے کہا : ہمیں سلیمان بن مغیرہ نے ثابت سے حدیث بیان کی ، انہوں نے حضرت انس رضی اللہ عنہ سے روایت کی ۔ یہ بہز کی حدیث ہے ۔ کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا بَهْزٌ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو النَّضْرِ هَاشِمُ بْنُ الْقَاسِمِ، قَالَا جَمِيعًا: حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، وَهَذَا حَدِيثُ بَهْزٍ، قَالَ: لَمَّا انْقَضَتْ عِدَّةُ زَيْنَبَ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِزَيْدٍ: «فَاذْكُرْهَا عَلَيَّ»، قَالَ: فَانْطَلَقَ زَيْدٌ حَتَّى أَتَاهَا وَهِيَ تُخَمِّرُ عَجِينَهَا، قَالَ: فَلَمَّا رَأَيْتُهَا عَظُمَتْ فِي صَدْرِي، حَتَّى مَا أَسْتَطِيعُ أَنْ أَنْظُرَ إِلَيْهَا، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَكَرَهَا، فَوَلَّيْتُهَا ظَهْرِي، وَنَكَصْتُ عَلَى عَقِبِي، فَقُلْتُ: يَا زَيْنَبُ: أَرْسَلَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُكِ، قَالَتْ: مَا أَنَا بِصَانِعَةٍ شَيْئًا حَتَّى أُوَامِرَ رَبِّي، فَقَامَتْ إِلَى مَسْجِدِهَا، وَنَزَلَ الْقُرْآنُ، وَجَاءَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَدَخَلَ عَلَيْهَا بِغَيْرِ إِذْنٍ، قَالَ، فَقَالَ: وَلَقَدْ رَأَيْتُنَا أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَطْعَمَنَا الْخُبْزَ وَاللَّحْمَ حِينَ امْتَدَّ النَّهَارُ، فَخَرَجَ النَّاسُ وَبَقِيَ رِجَالٌ يَتَحَدَّثُونَ فِي الْبَيْتِ بَعْدَ الطَّعَامِ، فَخَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَاتَّبَعْتُهُ، فَجَعَلَ يَتَتَبَّعُ حُجَرَ نِسَائِهِ يُسَلِّمُ عَلَيْهِنَّ، وَيَقُلْنَ: يَا رَسُولَ اللهِ، كَيْفَ وَجَدْتَ أَهْلَكَ؟ قَالَ: فَمَا أَدْرِي أَنَا أَخْبَرْتُهُ أَنَّ الْقَوْمَ قَدْ خَرَجُوا أَوْ أَخْبَرَنِي، قَالَ: فَانْطَلَقَ حَتَّى دَخَلَ الْبَيْتَ، فَذَهَبْتُ أَدْخُلُ مَعَهُ، فَأَلْقَى السِّتْرَ بَيْنِي وَبَيْنَهُ، وَنَزَلَ الْحِجَابُ، قَالَ: وَوُعِظَ الْقَوْمُ بِمَا وُعِظُوا بِهِ زَادَ ابْنُ رَافِعٍ فِي حَدِيثِهِ: {لَا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ} [الأحزاب: 53] إِلَى قَوْلِهِ {وَاللهُ لَا يَسْتَحْيِي مِنَ الْحَقِّ}.",
                "headingArabic": "زَوَاجِ زَيْنَبَ بِنْتِ جَحْشٍ وَنُزُولِ الْحِجَابِ وَإِثْبَاتِ وَلِيمَةِ الْعُرْسِ ‏",
                "headingUrdu": "زینب بنت جحش کی شادی، حجاب کی آیت کا نزول، اور عشائیے کی اہمیت کی تصدیق۔",
                "headingEnglish": "The Marriage of Zainab Bint Jahsh, The Revelation of (the verse of) Hijab, and confirmation of the importance of the wedding feast.",
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11067,
                "hadithNumber": "3503",
                "englishNarrator": "Anas (رضی اللہ عنہ) reported:",
                "hadithEnglish": "I did not see Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) giving a wedding feast (on the marriage) of any one (of his wives) as he did in the case of (his marriage with) Zainab, for then he sacrificed a goat (on this occasion).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو نہیں دیکھا کہ آپ نے کسی بیوی کا ۔ ۔ ابوکامل نے کہا : اپنی بیویوں میں سے کسی بیوی کی کسی چیز ( خوشی ) پر ۔ اس جیسا ولیمہ کیا ہو جیسا حضرت زینب رضی اللہ عنہا ( کے ساتھ نکاح ) پر کیا ۔ آپ صلی اللہ علیہ وسلم نے ( اس موقع پر ) بکری ذبح کی.",
                "urduNarrator": "ابوربیع زہرانی ، ابو کامل فُضَیل بن حسین اور قتیبہ بن سعید نے ہمیں حدیث بیان کی ، کہا : ہمیں حماد نے ، وہ ( جو ) زید کے بیٹے ہیں ، ثابت نے حدیث بیان کی ، انہوں نے حضرت انس رضی اللہ عنہ سے روایت کی ۔ ابو کامل کی روایت میں ہے : میں نے حضرت انس رضی اللہ عنہ سے سنا ۔ انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالُوا: حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، وَفِي رِوَايَةِ أَبِي كَامِلٍ: سَمِعْتُ أَنَسًا، قَالَ: مَا رَأَيْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَوْلَمَ عَلَى امْرَأَةٍ - وَقَالَ أَبُو كَامِلٍ: عَلَى شَيْءٍ مِنْ نِسَائِهِ - مَا أَوْلَمَ عَلَى زَيْنَبَ، فَإِنَّهُ ذَبَحَ شَاةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11068,
                "hadithNumber": "3504",
                "englishNarrator": "Anas bin Malik ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) gave no better wedding feast than the one he did (on the occasion of his marriage with) Zainab رضی اللہ عنہا. Thabit al-Bunani (one of the narrators) said: What did he serve in the wedding feast? He (Anas رضی اللہ عنہ) said: He fed them bread and meat (so lavishly) that they (the guests) abandoned it (of their own accord after having taken them to their hearts' content).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں میں سے کسی بیوی کا اس سے بڑھ کر یااس سے بہتر ولیمہ نہیں کیا جیسا ولیمہ حضرت زینب رضی اللہ عنہا کا کیا ۔ ثابت بنانی نے پوچھا : آپ نے کس چیز سے ولیمہ کیا تھا؟ انہوں نے جواب دیا : آپ نے انہیں روٹی اور گوشت کھلایا حتیٰ کہ انہوں نے ( سیر ہو کر کھانا ) چھوڑ دیا.",
                "urduNarrator": "ہم سے محمد بن عمرو بن عباد بن جبلہ بن ابی رواد اور محمد بن بشار نے بیان کیا، کہا: ہم سے محمد بن جعفر نے بیان کیا۔ شعبہ نے ہمیں بتایا, عبدالعزیز بن صہیب سے روایت ہے ، انہوں نے کہا : میں نے حضرت انس رضی اللہ عنہ سے سنا وہ کہہ رہے تھے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَبَّادِ بْنِ جَبَلَةَ بْنِ أَبِي رَوَّادٍ، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالَا: حَدَّثَنَا مُحَمَّدٌ وَهُوَ ابْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ: «مَا أَوْلَمَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى امْرَأَةٍ مِنْ نِسَائِهِ أَكْثَرَ - أَوْ أَفْضَلَ - مِمَّا أَوْلَمَ عَلَى زَيْنَبَ»، فَقَالَ ثَابِتٌ الْبُنَانِيُّ: بِمَا أَوْلَمَ؟ قَالَ: «أَطْعَمَهُمْ خُبْزًا وَلَحْمًا حَتَّى تَرَكُوهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11069,
                "hadithNumber": "3505",
                "englishNarrator": "Anas bin Malik ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married Zainab bint jahsh رضی اللہ عنہا , he invited people (to the wedding feast) and they ate food. They then sat there and entered into conversation. He (the Holy Prophet ﷺ) made a stir as if he was preparing to stand up, but (the persons busy in talking) did not stand up. When he (the Holy Prophet ﷺ) saw it, he stood up and when he did so, some other persons stood up. 'Asim and Abdul-A'la in their narrations made this addition: Three (persons) sat there, and Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) came there to enter (the apartment) but he found the people sitting there. Then they stood up and went away. He said: Then I came and informed Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that they had gone away. He (the Holy Prophet ﷺ) then came there until he entered (the apartment). I also went and was about to enter, when he hung a curtain between me and him (and it was on this occasion that) Allah, the Exalted and Majestic, revealed this verse: O you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished to the (words) Surely this is serious in the sight of Allah (xxxiii. 53).",
                "hadithUrdu": "جب نبی صلی اللہ علیہ وسلم نے زینب بنت حجش رضی اللہ عنہا سے نکاح کیا تو آپ نے لوگوں کو ( کھانے کی ) دعوت دی ، انہوں نے کھانا کھایا ، پھر بیٹھ کر باتیں کرنے لگے ۔ کہا : آپ نے ایسا انداز اختیار فرمایا گویا کہ کھڑے ہونے لگے ہوں اس پر بھی وہ نہ اٹھے ، جب آپ نے یہ صورت حال دیکھی تو آپ کھڑے ہو گئے ، جب آپ کھڑے ہوئے تو لوگوں میں سے بھی جو کھڑے ہوئے ، وہ ہو گئے ۔ عاصم اور ابن عبدالاعلیٰ نے اپنی حدیث میں اضافہ کیا : کہا \"\" تین آدمی بیٹھے رہے ، نبی صلی اللہ علیہ وسلم ( حجرے میں ) داخل ہونے کے لیے تشریف لے آئے ، تو ( اس وقت بھی ) وہ لوگ بیٹھے ہوئے تھے ، پھر ( کچھ دیر بعد ) وہ اٹھے اور چلے گئے ۔ ( انس رضی اللہ عنہ نے ) کہا : میں نے آ کر نبی صلی اللہ علیہ وسلم کو خبر دی کہ وہ جا چکے ہیں ۔ آپ تشریف لائے اور اندر داخل ہوئے ، میں بھی داخل ہونے لگا تو آپ نے میرے اور اپنے درمیان پردہ لٹکا دیا ۔ کہا : اور ( اس موقع پر ) اللہ عزوجل نے ( یہ آیت ) نازل فرمائی : \"\" اے ایمان والو! تم نبی صلی اللہ علیہ وسلم کے گھروں میں داخل نہ ہوا کرو ، الا یہ کہ تمہیں کھانے کے لیے اجازت دی جائے ، ایسے ( وقت میں ) آؤ کہ ( آ کر ) اس کے پکنے کا انتظار کرنے والے نہ ہو ( کھانا رکھ دیا جائے تو آؤ ) \"\" اس فرمان تک : \"\" بلاشبہ یہ بات اللہ کے نزدیک بہت بڑی تھی.",
                "urduNarrator": "یحییٰ بن حبیب حارثی ، عاصم بن نضر تیمی اور محمد بن عبدالاعلیٰ نے ہمیں حدیث بیان کی ، سب نے معتمر سے روایت کی ۔ لفظ ( یحییٰ ) بن حبیب کے ہیں ۔ کہا : ہم سے معتمر بن سلیمان نے حدیث بیان کی ، انہوں نے کہا : میں نے اپنے والد سے سنا ، انہوں نے کہا : ہمیں ابومجلز نے سیدنا انس بن مالک رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، وَعَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى، كُلُّهُمْ عَنْ مُعْتَمِرٍ، وَاللَّفْظُ لِابْنِ حَبِيبٍ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ: سَمِعْتُ أَبِي، حَدَّثَنَا أَبُو مِجْلَزٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: «لَمَّا تَزَوَّجَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ زَيْنَبَ بِنْتَ جَحْشٍ، دَعَا الْقَوْمَ فَطَعِمُوا، ثُمَّ جَلَسُوا يَتَحَدَّثُونَ»، قَالَ: «فَأَخَذَ كَأَنَّهُ يَتَهَيَّأُ لِلْقِيَامِ، فَلَمْ يَقُومُوا، فَلَمَّا رَأَى ذَلِكَ قَامَ، فَلَمَّا قَامَ قَامَ مَنْ قَامَ مِنَ الْقَوْمِ» - زَادَ عَاصِمٌ، وَابْنُ عَبْدِ الْأَعْلَى فِي حَدِيثِهِمَا، قَالَ: فَقَعَدَ ثَلَاثَةٌ - «وَإِنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جَاءَ لِيَدْخُلَ فَإِذَا الْقَوْمُ جُلُوسٌ، ثُمَّ إِنَّهُمْ قَامُوا فَانْطَلَقُوا»، قَالَ: «فَجِئْتُ فَأَخْبَرْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّهُمْ قَدِ انْطَلَقُوا»، قَالَ: فَجَاءَ حَتَّى دَخَلَ، فَذَهَبْتُ أَدْخُلُ، فَأَلْقَى الْحِجَابَ بَيْنِي وَبَيْنَهُ، قَالَ: وَأَنْزَلَ اللهُ عَزَّ وَجَلَّ {يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ} [الأحزاب: 53] إِلَى قَوْلِهِ {إِنَّ ذَلِكُمْ كَانَ عِنْدَ اللهِ عَظِيمًا} [الأحزاب: 53",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11070,
                "hadithNumber": "3506",
                "englishNarrator": "Anas bin Malik (رضی اللہ عنہ) reported:",
                "hadithEnglish": "I was the best informed among the people pertaining to Hijab (veil and seclusion). Ubayy bin Ka'b رضی اللہ عنہ used to ask me about it. Anas (رضی اللہ عنہ) thus narrated: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) got up in the morning as a bridegroom of Zainab bint jahsh ( رضی اللہ عنہا) as he had married her at Medina. He invited people to the wedding feast after the day had well risen. There sat Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and there kept sitting along with him some persons after the people had stood up (for departure); then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) stood up and walked on and I also walked along with him until he reached the door of the apartment of 'A'isha (رضی اللہ عنہا). He then thought that they (those who had been sitting there after meal) had gone away. So he returned and I also returned with him, but they were still sitting at their places. So he returned for the second time and I also returned until he reached the apartment of 'A'isha رضی اللہ عنہا. He again returned and I also returned and they had (by that time) stood up, and he hung a curtain between me and him (at the door of the apartment of Hadrat Zainab رضی اللہ عنہا, where he had to stay), and Allah revealed the verse pertaining to veil.",
                "hadithUrdu": "پردے ( کے احکام ) کو سب لوگوں سے زیادہ جاننے والا میں ہوں ۔ حضرت ابی بن کعب رضی اللہ عنہ بھی اس کے بارے میں مجھ سے پوچھا کرتے تھے ۔ انس رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے حضرت زینب بنت حجش رضی اللہ عنہا کے دلہا کی حیثیت سے صبح کی ، آپ نے ( اسی رات ) مدینہ میں ان سے شادی کی تھی ، دن چڑھنے کے بعد آپ نے لوگوں کو کھانے کے لیے بلایا ، رسول اللہ صلی اللہ علیہ وسلم تشریف فرما ہوئے تو کچھ افراد لوگوں کے چلے جانے کے بعد بھی آپ کے ساتھ بیٹھے رہے ، یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہو گئے ۔ آپ چلے تو میں بھی آپ کے ساتھ چل پڑا حتیٰ کہ آپ ( سب حجروں سے ہوتے ہوئے ) حجرہ عائشہ رضی اللہ عنہا کے دروازے پر پہنچے ۔ پھر آپ نے سوچا کہ وہ لوگ جا چکے ہوں گے ، آپ واپس ہوئے ، میں بھی آپ کے ساتھ واپس آیا ، تو تب بھی وہ اپنی جگہوں پر بیٹھے ہوئے تھے ۔ آپ لوٹ گئے اور میں بھی دوبارہ لوٹ گیا ، حتیٰ کہ آپ حضرت عائشہ رضی اللہ عنہا کے حجرے تک پہنچے تو پھر سے واپس آئے ، میں بھی آپ کے ساتھ واپس آیا ، تو دیکھا کہ وہ لوگ اٹھ ( کر جا ) چکے تھے ، اس کے بعد آپ نے میرے اور اپنے درمیان پردہ لٹکا دیا ، اور ( اس وقت ) پردے کی آیت نازل کی گئی.",
                "urduNarrator": "مجھ سے عمرو الناقد نے بیان کیا، کہا ہم سے یعقوب بن ابراہیم بن سعد نے بیان کیا، ہم سے میرے والد نے صالح کی سند سے بیان کیا, ابن شہاب نے کہا : حضرت انس بن مالک رضی اللہ عنہ نے فرمایا",
                "hadithArabic": "وحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِح، قَالَ ابْنُ شِهَابٍ: إِنَّ أَنَسَ بْنَ مَالِكٍ قَالَ: أَنَا أَعْلَمُ النَّاسِ بِالْحِجَابِ، لَقَدْ كَانَ أُبَيُّ بْنُ كَعْبٍ يَسْأَلُنِي عَنْهُ، قَالَ أَنَسٌ: «أَصْبَحَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَرُوسًا بِزَيْنَبَ بِنْتِ جَحْشٍ»، قَالَ: «وَكَانَ تَزَوَّجَهَا بِالْمَدِينَةِ، فَدَعَا النَّاسَ لِلطَّعَامِ بَعْدَ ارْتِفَاعِ النَّهَارِ، فَجَلَسَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَجَلَسَ مَعَهُ رِجَالٌ بَعْدَ مَا قَامَ الْقَوْمُ، حَتَّى قَامَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَمَشَى، فَمَشَيْتُ مَعَهُ حَتَّى بَلَغَ بَابَ حُجْرَةِ عَائِشَةَ، ثُمَّ ظَنَّ أَنَّهُمْ قَدْ خَرَجُوا، فَرَجَعَ وَرَجَعْتُ مَعَهُ، فَإِذَا هُمْ جُلُوسٌ مَكَانَهُمْ، فَرَجَعَ فَرَجَعْتُ الثَّانِيَةَ، حَتَّى بَلَغَ حُجْرَةَ عَائِشَةَ، فَرَجَعَ فَرَجَعَتْ، فَإِذَا هُمْ قَدْ قَامُوا، فَضَرَبَ بَيْنِي وَبَيْنَهُ بِالسِّتْرِ، وَأَنْزَلَ اللهُ آيَةَ الْحِجَابِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11071,
                "hadithNumber": "3507",
                "englishNarrator": "Anas bin Malik ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) contracted marriage and he went to his wife. My mother Umm Sulaim رضی اللہ عنہا prepared hais and placed it in an earthen vessel and said: Anas رضی اللہ عنہا , take it to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and say: My mother has sent that to you and she offers greetings to you, and says that it is a humble gift for you on our behalf, Messenger of Allah ﷺ. So I went along with it to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) and said: My mother offers you salutations, and says that it is a humble gift for you on our behalf. He said: Place it here, and then said: Go and invite on my behalf so and so and anyone whom you meet, and he even named some persons. He (Anas رضی اللہ عنہ) said: I invited whom he had named and whom I met. I (one of the narrators) said: I said to Anas رضی اللہ عنہ: How many (persons) were there? He (Anas رضی اللہ عنہ) said: They were about three hundred persons. Then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) (said to me): Anas رضی اللہ عنہ, bring that earthen vessel. They (the guests) then began to enter until the courtyard and the apartment were fully packed. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Make a circle of ten (guests), and every person should eat from that nearest to him. They began to eat, until they ate to their fill. A group went out (after eating the food), and another group came in until all of them had eaten. He (the Holy Prophet) said to me: Anas رضی اللہ عنہ, lift it (the earthen vessel), so I lifted it, but I could not assess whether it had more (food) when I placed it (before Allah's Messenger) or when I lifted it (after the people had been served out of it). A group among them (the guests) began to talk in the house of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was sitting and his wife had been sitting with her face turned towards the wall. It was troublesome for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), so Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went out and greeted his wives. He then returned. When they (the guests) saw that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had returned they thought that it (their overstay) was something troublesome for him. He (the narrator) said: They hastened towards the door and all of them went out. And there came Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he hung a curtain and went in, and I was sitting in his apartment and he did not stay but for a short while. He then came to me and these verses were revealed. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came out and recited them to the people: O you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished-but when you are invited, enter, and when you have taken food, disperse not seeking to listen to talk. Surely this gives the Prophet trouble , to the end of verse (xxxiii. 53). (Al-Ja'd said that Anas bin Malik  رضی اللہ عنہ] stated: I am the first amongst the people to hear these verses), and henceforth the wives of the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) began to observe seclusion (al-hijab).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے شادی کی اور اپنی اہلیہ کے پاس تشریف لے گئے ۔ میری والدہ ام سُلَیم رضی اللہ عنہا نے حَیس تیار کیا ، اسے ایک پیالہ نما بڑے برتن میں ڈالا ، اور کہا : انس! یہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے جاؤ اور عرض کرو : یہ میری والدہ نے آپ کی خدمت میں بھیجا ہے ، اور وہ آپ کو سلام عرض کرتی ہیں اور کہتی ہیں : اللہ کے رسول! یہ ہماری طرف سے آپ کے لیے تھوڑی سی چیز ہے ۔ کہا : میں اسے لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی : میری والدہ آپ کو سلام پیش کرتی ہیں اور کہتی ہیں : اللہ کے رسول! یہ آپ کے لیے ہماری طرف سے تھوڑی سی چیز ہے ۔ آپ نے فرمایا : \"\" اسے رکھ دو \"\" ( آپ نے اسے بھی ولیمے کے کھانے کے ساتھ شامل کر لیا ) پھر فرمایا : \"\" جاؤ ، فلاں ، فلاں اور فلاں اور جو لوگ تمہیں ملیں انہیں بلا لاؤ ۔ \"\" آپ نے چند آدمیوں کے نام لیے ۔ کہا : میں ان لوگوں کو جن کے آپ نے نام لیے اور وہ جو مجھے ملے ، ان کو لے آیا ۔ کہا : میں نے انس رضی اللہ عنہ سے پوچھا : وہ ( سب ) تعداد میں کتنے تھے؟ انہوں نے جواب دیا : تین سو کے لگ بھگ ۔ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \"\" انس! برتن لے اؤ \"\" کہا : لوگ اندر داخل ہوئے حتیٰ کہ صفہ ( چبوترہ ) اور حجرہ بھر گیا ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" دس دس افراد حلقہ بنا لیں ، اور ہر انسان اپنے سامنے سے کھائے ۔ \"\" ان سب نے کھایا حتیٰ کہ سیر ہو گئے ، ایک گروہ نکلا تو دوسرا داخل ہوا ( اس طرح ہوتا رہا ) حتیٰ کہ ان سب نے کھانا کھا لیا ، تو آپ صلی اللہ علیہ وسلم نے مجھے حکم دیا : \"\" انس! اٹھا لو \"\" تو میں نے ( برتن ) اٹھا لیے ، مجھے معلوم نہیں کہ جب میں نے ( کھانا ) رکھا تھا اس وقت زیادہ تھا یا جب میں نے اٹھایا اُس وقت ۔ کہا : ان میں سے کچھ ٹولیاں رسول اللہ صلی اللہ علیہ وسلم کے گھر میں ہی بیٹھ کر باتیں کرنے لگیں ، جبکہ رسول اللہ صلی اللہ علیہ وسلم بیٹھے ہوئے تھے ، اور آپ کی اہلیہ دیوار کی طرف رخ کیے بیٹھی تھیں ، یہ لوگ رسول اللہ صلی اللہ علیہ وسلم پر گراں گزرنے لگے تو رسول اللہ صلی اللہ علیہ وسلم ( گھر سے ) نکلے ، ( یکے بعد دیگرے ) اپنی ازواج کو سلام کیا ، پھر واپس ہوئے ۔ جب انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ واپس ہو گئے ہیں ، تو انہوں نے محسوس کیا کہ وہ آپ پر گراں گزر رہے ہیں ۔ کہا : تو وہ جلدی سے دروازے کی طرف لپکے اور سب کے سب نکل گئے ، رسول اللہ صلی اللہ علیہ وسلم ( آگے ) تشریف لائے ، حتیٰ کہ آپ نے پردہ لٹکایا اور اندر داخل ہو گئے اور میں حجرہ ( نما صفے ) میں بیٹھا ہوا تھا ، آپ تھوڑی ہی دیر ٹھہرے حتی کہ ( دوبارہ ) باہر میرے پاس آئے ، اور ( آپ پر ) یہ آیت نازل کی گئی ۔ رسول اللہ صلی اللہ علیہ وسلم باہر تشریف لائے اور لوگوں کے سامنے انہیں ( آیتِ کریمہ کے جملہ کلمات کو ) تلاوت فرمایا : \"\" اے ایمان والو! تم نبی صلی اللہ علیہ وسلم کے گھروں میں داخل نہ ہوا کرو الا یہ کہ تمہیں کھانے کے لیے اجازت دی جائے ، کھانا پکنے کا انتظار کرتے ہوئے نہیں ، بلکہ جب تمہیں دعوت دی جائے تب تم اندر جاؤ ، پھر جب کھانا کھا چلو تو منشتر ہو جاؤ ، اور ( وہیں ) باتوں میں دل لگاتے ہوئے نہیں ( بیٹھے رہو ۔ ) بلاشبہ یہ بات نبی صلی اللہ علیہ وسلم کو تکلیف دیتی ہے \"\" آیت کے آخر تک ۔ جعد نے کہا : حضرت انس بن مالک رضی اللہ عنہ نے کہا : ان آیات کے ساتھ ( جو ایک ہی طویل آیت میں سمو دی گئیں ) میرا تعلق سب سے زیادہ قریب کا ہے ، اور ( ان کے نزول ہوتے ہی ) نبی صلی اللہ علیہ وسلم کی ازواج رضی اللہ عنھن کو پردہ کرا دیا گیا.",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے بیان کیا جعفر بن سلیمان نے ہمیں ابوعثمان جعد سے حدیث بیان کی ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ سُلَيْمَانَ، عَنِ الْجَعْدِ أَبِي عُثْمَانَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: تَزَوَّجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَدَخَلَ بِأَهْلِهِ، قَالَ: فَصَنَعَتْ أُمِّي أُمُّ سُلَيْمٍ حَيْسًا، فَجَعَلَتْهُ فِي تَوْرٍ، فَقَالَتْ: يَا أَنَسُ، اذْهَبْ بِهَذَا إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْ: بَعَثَتْ بِهَذَا إِلَيْكَ أُمِّي وَهِيَ تُقْرِئُكَ السَّلَامَ، وَتَقُولُ: إِنَّ هَذَا لَكَ مِنَّا قَلِيلٌ يَا رَسُولَ اللهِ، قَالَ: فَذَهَبْتُ بِهَا إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقُلْتُ: إِنَّ أُمِّي تُقْرِئُكَ السَّلَامَ، وَتَقُولُ: إِنَّ هَذَا لَكَ مِنَّا قَلِيلٌ يَا رَسُولَ اللهِ، فَقَالَ: «ضَعْهُ»، ثُمَّ قَالَ: «اذْهَبْ، فَادْعُ لِي فُلَانًا وَفُلَانًا وَفُلَانًا، وَمَنْ لَقِيتَ»، وَسَمَّى رِجَالًا، قَالَ: فَدَعَوْتُ مَنْ سَمَّى، وَمَنْ لَقِيتُ، قَالَ: قُلْتُ لِأَنَسٍ: عَدَدَ كَمْ كَانُوا؟ قَالَ: زُهَاءَ ثَلَاثِمِائَةٍ، وَقَالَ لِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَا أَنَسُ، هَاتِ التَّوْرَ»، قَالَ: فَدَخَلُوا حَتَّى امْتَلَأَتِ الصُّفَّةُ وَالْحُجْرَةُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لِيَتَحَلَّقْ عَشَرَةٌ عَشَرَةٌ، وَلْيَأْكُلْ كُلُّ إِنْسَانٍ مِمَّا يَلِيهِ»، قَالَ: فَأَكَلُوا حَتَّى شَبِعُوا، قَالَ: فَخَرَجَتْ طَائِفَةٌ، وَدَخَلَتْ طَائِفَةٌ، حَتَّى أَكَلُوا كُلُّهُمْ، فَقَالَ لِي: «يَا أَنَسُ، ارْفَعْ»، قَالَ: فَرَفَعْتُ، فَمَا أَدْرِي حِينَ وَضَعْتُ كَانَ أَكْثَرَ، أَمْ حِينَ رَفَعْتُ، قَالَ: وَجَلَسَ طَوَائِفُ مِنْهُمْ يَتَحَدَّثُونَ فِي بَيْتِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جَالِسٌ وَزَوْجَتُهُ مُوَلِّيَةٌ وَجْهَهَا إِلَى الْحَائِطِ، فَثَقُلُوا عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَخَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَلَّمَ عَلَى نِسَائِهِ، ثُمَّ رَجَعَ، فَلَمَّا رَأَوْا رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ رَجَعَ، ظَنُّوا أَنَّهُمْ قَدْ ثَقُلُوا عَلَيْهِ، قَالَ: فَابْتَدَرُوا الْبَابَ، فَخَرَجُوا كُلُّهُمْ، وَجَاءَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، حَتَّى أَرْخَى السِّتْرَ، وَدَخَلَ وَأَنَا جَالِسٌ فِي الْحُجْرَةِ، فَلَمْ يَلْبَثْ إِلَّا يَسِيرًا حَتَّى خَرَجَ عَلَيَّ، وَأُنْزِلَتْ هَذِهِ الْآيَةُ، فَخَرَجَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَقَرَأَهُنَّ عَلَى النَّاسِ: {يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ وَلَكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا فَإِذَا طَعِمْتُمْ فَانْتَشِرُوا وَلَا مُسْتَأْنِسِينَ لِحَدِيثٍ إِنَّ ذَلِكُمْ كَانَ يُؤْذِي النَّبِيَّ} [الأحزاب: 53] إِلَى آخِرِ الْآيَةِ قَالَ الْجَعْدُ: قَالَ أَنَسُ بْنُ مَالِكٍ: أَنَا أَحْدَثُ النَّاسِ عَهْدًا بِهَذِهِ الْآيَاتِ. وَحُجِبْنَ نِسَاءُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11072,
                "hadithNumber": "3508",
                "englishNarrator": "Anas (رضی اللہ عنہ) reported:",
                "hadithEnglish": "When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) contracted marriage with Zainab (رضی اللہ عنہا), Umm Sulaim رضی اللہ عنہا sent him hats in a vessel of stone as a gift. Anas رضی اللہ عنہ stated that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: Go and invite on my behalf all the Muslims whom you meet. So I invited on his behalf everyone whom I met. They entered (his house) and they ate and went out. And Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had kept his hand on the food, and he invoked blessing on that, and said whatever Allah wished him to say, and none whom I met was left uninvited. They ate to their fill and went out, but a group among them remained there and was engaged in lengthy discussion. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) felt shy of saying them anything. So he went out and left them in his house and Allah the Great and Majestic revealed this verse: 0 you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished. Qatada (instead of using the word Ghaira Nazirina) used the word Ghaira Mutahayyinina (i. e. not waiting for the time of the food). But when you are invited, enter... up to this verse. This is purer for your hearts and their hearts.",
                "hadithUrdu": "جب نبی صلی اللہ علیہ وسلم نے حضرت زینب رضی اللہ عنہا سے نکاح کیا تو ام سلیم رضی اللہ عنہا نے ایک بڑے برتن میں حیس بھی آپ کی خدمت میں بطور ہدیہ پیش کیا ۔ انس رضی اللہ عنہ نے کہا : نبی صلی اللہ علیہ وسلم نے فرمایا : \" جاؤ اور مسلمانوں میں سے جو بھی تمہیں ملے اسے میرے پاس بلا لاؤ \" تو میں جس سے ملا اسے آپ کی طرف دعوت دی ، لوگ آپ کی خدمت میں حاضر ہوتے ، کھانا کھاتے اور نکل جاتے ۔ نبی اکرم صلی اللہ علیہ وسلم نے کھانے پر اپنا ہاتھ رکھا اور اس میں ( برکت کی ) دعا کی ، اس کے بارے میں جو اللہ نے چاہا کہ آپ کہیں ، آپ نے کہا ۔ اور میں جس کو بھی ملا ، ان میں سے کسی ایک کو بھی نہیں چھوڑا مگر اسے دعوت دی ، لوگوں نے کھایا ، حتی کہ سیر ہو گئے اور نکل گئے ، ان میں سے ایک گروہ ( وہیں ) رہ گیا ، انہوں نے آپ کی موجودگی میں طویل گفتگو کی ، نبی صلی اللہ علیہ وسلم حیا محسوس کرنے لگے کہ ان سے کچھ کہیں ، چنانچہ آپ نکلے اور انہیں گھر میں ہی چھوڑ دیا ، تو اللہ تعالیٰ نے ( یہ آیات ) نازل فرمائیں : \" اے ایمان والو! تم نبی صلی اللہ علیہ وسلم کے گھروں میں داخل نہ ہوا کرو ، الا یہ کہ تمہیں کھانے کے لیے ( اندر آنے کی ) اجازت دی جائے ، کھانا پکنے کا انتظار کرتے ہوئے نہیں ۔ \" ۔ ۔ قتادہ نے کہا : کھانے کے وقت کا انتظار کرتے ہوئے نہیں ۔ ۔ \" لیکن جب تمہیں بلایا جائے تب تم اندر جاؤ ۔ \" حتی کہ آپ نے یہاں تک تلاوت کی : \" یہ تمہارے اور ان کے دلوں کے لیے اور یادہ پاکیزگی ( کا طریقہ ) ہے.",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، انہوں نے بیان کیا معمر نے ہمیں ابوعثمان ( جعد ) سے حدیث بیان کی ، انہوں نے حضرت انس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ أَبِي عُثْمَانَ، عَنْ أَنَسٍ قَالَ: لَمَّا تَزَوَّجَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ زَيْنَبَ أَهْدَتْ لَهُ أُمُّ سُلَيْمٍ حَيْسًا فِي تَوْرٍ مِنْ حِجَارَةٍ، فَقَالَ أَنَسٌ: فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «اذْهَبْ، فَادْعُ لِي مَنْ لَقِيتَ مِنَ الْمُسْلِمِينَ»، فَدَعَوْتُ لَهُ مَنْ لَقِيتُ، فَجَعَلُوا يَدْخُلُونَ عَلَيْهِ فَيَأْكُلُونَ وَيَخْرُجُونَ، وَوَضَعَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَدَهُ عَلَى الطَّعَامِ، فَدَعَا فِيهِ، وَقَالَ فِيهِ مَا شَاءَ اللهُ أَنْ يَقُولَ، وَلَمْ أَدَعْ أَحَدًا لَقِيتُهُ إِلَّا دَعَوْتُهُ، فَأَكَلُوا حَتَّى شَبِعُوا، وَخَرَجُوا وَبَقِيَ طَائِفَةٌ مِنْهُمْ، فَأَطَالُوا عَلَيْهِ الْحَدِيثَ، فَجَعَلَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَسْتَحْيِي مِنْهُمْ أَنْ يَقُولَ لَهُمْ شَيْئًا، فَخَرَجَ وَتَرَكَهُمْ فِي الْبَيْتِ، فَأَنْزَلَ اللهُ عَزَّ وَجَلَّ: {يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ} [الأحزاب: 53]- قَالَ قَتَادَةُ: غَيْرَ مُتَحَيِّنِينَ طَعَامًا {وَلَكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا} [الأحزاب: 53] حَتَّى بَلَغَ {ذَلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ} [الأحزاب: 53",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11073,
                "hadithNumber": "3509",
                "englishNarrator": "Ibn Umar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When any one of you is invited to a feast, he should attend it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کسی کو ولیمے کی دعوت دی جائے تو وہ اس میں ضرور آئے.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے پڑھا امام مالک نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دُعِيَ أَحَدُكُمْ إِلَى الْوَلِيمَةِ فَلْيَأْتِهَا.",
                "headingArabic": "الأَمْرِ بِإِجَابَةِ الدَّاعِي إِلَى دَعْوَةٍ ‏",
                "headingUrdu": "دعوت قبول کرنے کا حکم",
                "headingEnglish": "The command to accept invitations",
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11074,
                "hadithNumber": "3510",
                "englishNarrator": "Ibn 'Umar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When any one of you is invited to a feast, he should accept. 'Ubaidallah took this feast to be a wedding feast.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" جب تم میں سے کسی کو ولیمے کی دعوت دی جائے تو وہ قبول کرے ۔ \"\" خالد نے کہا : عبیداللہ اسے شادی ( کی دعوتِ ولیمہ ) پر محمول کرتے تھے.",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا, خالد بن حارث نے ہمیں عبیداللہ ( بن عمر بن حفص مدنی ) سے حدیث بیان کی ، انہوں نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی",
                "hadithArabic": ") وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا دُعِيَ أَحَدُكُمْ إِلَى الْوَلِيمَةِ، فَلْيُجِبْ»، قَالَ خَالِدٌ: فَإِذَا عُبَيْدُ اللهِ يُنَزِّلُهُ عَلَى الْعُرْسِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11075,
                "hadithNumber": "3511",
                "englishNarrator": "Ibn Umar ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) having said this: When any one of you is invited to a wedding feast, he should accept that.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کسی کو شادی کے ولیمے کی دعوت دی جائے تو وہ قبول کرے.",
                "urduNarrator": "محمد بن عبداللہ بن نمیر کے والد نے کہا : ہمیں عبیداللہ نے نافع سے حدیث بیان کی ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا دُعِيَ أَحَدُكُمْ إِلَى وَلِيمَةِ عُرْسٍ، فَلْيُجِبْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11076,
                "hadithNumber": "3512",
                "englishNarrator": "Ibn Umar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) having said this: Accept the feast, when you are invited.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تمہیں بلایا جائے تو دعوت میں آؤ.",
                "urduNarrator": "مجھ سے ابو الربیع نے بیان کیا، اور مجھ سے ابو کامل نے بیان کیا، انہوں نے کہا: ہم سے بیان کیا حماد نے ہمیں ایوب سے حدیث بیان کی ، انہوں نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ، قَالَ: حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، ح وحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ائْتُوا الدَّعْوَةَ إِذَا دُعِيتُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11077,
                "hadithNumber": "3513",
                "englishNarrator": "Ibn Umar ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When any one of you invites his brother, he (the latter) should accept his wedding feast, or any other like it.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم سے ( حدیث بیان کرتے ہوئے ) کہا کرتے تھے : \" جب تم میں سے کوئی اپنے بھائی کو دعوت دے تو وہ قبول کرے شادی ہو یا اس جیسی ( کوئی اور ) تقریب.",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، انہوں نے بیان کیا معمر نے ہمیں ایوب سے خبر دی ، انہوں نے نافع سے روایت کی کہ حضرت ابن عمر رضی اللہ عنہ",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ يَقُولُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دَعَا أَحَدُكُمْ أَخَاهُ، فَلْيُجِبْ عُرْسًا كَانَ أَوْ نَحْوَهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11078,
                "hadithNumber": "3514",
                "englishNarrator": "Ibn 'Umar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: He who is invited to a wedding feast or like it, he should accept it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص کو شادی یا اس جیسی کسی تقریب میں بلایا جائے تو وہ قبول کرے.",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا، مجھ سے عیسیٰ بن المنذر نے بیان کیا، ہم سے بقیہ نے بیان کیا، ہم سے بیان کیا زُبیدی نے ہمیں نافع سے حدیث بیان کی ، انہوں نے ابن عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنِي عِيسَى بْنُ الْمُنْذِرِ، حَدَّثَنَا بَقِيَّةُ، حَدَّثَنَا الزُّبَيْدِيُّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ دُعِيَ إِلَى عُرْسٍ أَوْ نَحْوِهِ، فَلْيُجِبْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11079,
                "hadithNumber": "3515",
                "englishNarrator": "Abdullah bin Umar (Allah be pleased with them) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Come to the feast, when you are invited.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تمہیں بلایا جائے تو دعوت میں آؤ.",
                "urduNarrator": "مجھ سے حمید بن مسعدہ الباہلی نے بیان کیا، کہا ہم سے بشر بن المفضل نے بیان کیا، انہوں نے کہا اسماعیل بن اُمیہ نے ہمیں نافع سے حدیث بیان کی ، انہوں نے عبداللہ بن عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي حُمَيْدُ بْنُ مَسْعَدَةَ الْبَاهِلِيُّ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أُمَيَّةَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «ائْتُوا الدَّعْوَةَ إِذَا دُعِيتُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11080,
                "hadithNumber": "3516",
                "englishNarrator": "Nafi reported:",
                "hadithEnglish": "I heard Abdullah bin Umar ( رضی اللہ عنہ) narrating that Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Accept the feast when you are invited to it. And Abdullah (bin Umar رضی اللہ عنہ ) used to come to the feast, whether it was a wedding feast or other than that, and he would come there even in the state of fasting.",
                "hadithUrdu": "میں نے عبداللہ بن عمر رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" ( مسلمان بھائیوں کی طرف سے دی جانے والی ) اس دعوت کو ، جب تمہیں اس کے لیے بلایا جائے ، قبول کرو ۔ \"\" کہا : عبداللہ بن عمر رضی اللہ عنہ دعوت میں شریک ہوتے خواہ وہ شادی کی ہو یا شادی کے بغیر ، اور وہ روزے کی حالت میں بھی اس میں آتے تھے.",
                "urduNarrator": "مجھ سے ہارون بن عبداللہ نے بیان کیا، کہا ہم سے حجاج بن محمد نے بیان کیا، انہوں نے ابن جریج کی سند سے بیان کیا, موسیٰ بن عقبہ نے نافع سے خبر دی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، قَالَ: سَمِعْتُ عَبْدَ اللهِ بْنَ عُمَرَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَجِيبُوا هَذِهِ الدَّعْوَةَ إِذَا دُعِيتُمْ لَهَا»، قَالَ: «وَكَانَ عَبْدُ اللهِ بْنُ عُمَرَ يَأْتِي الدَّعْوَةَ فِي الْعُرْسِ، وَغَيْرِ الْعُرْسِ، وَيَأْتِيهَا وَهُوَ صَائِمٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11081,
                "hadithNumber": "3517",
                "englishNarrator": "Ibn Umar (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: When you are invited to a feast (even though it is) the leg of the sheep, you should accept it.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" جب تمہیں ( بکری کے ) پائے کی بھی دعوت دی جائے تو قبول کرو.",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، انہوں نے کہاعمر بن محمد نے مجھے نافع سے حدیث بیان کی ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «إِذَا دُعِيتُمْ إِلَى كُرَاعٍ، فَأَجِيبُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11082,
                "hadithNumber": "3518",
                "englishNarrator": "Jabir (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said: When any one of you is invited to a feast, he should accept it. He may eat if he likes, or he may abandon (eating) if he likes. Ibn Mathanni did not make mention of the word feast .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کسی کو کھانے کی دعوت دی جائے تو وہ اس مین آئے ، پھر اگر اور چاہے تو کھا لے ، چاہے تو نہ کھائے ۔ \" ابن مثنیٰ نے \" کھانے کی دعوت \" کے الفاظ ذکر نہیں کیے.",
                "urduNarrator": "محمد بن مثنیٰ نے ہمیں حدیث بیان کی ، کہا : ہمیں عبدالرحمٰن بن مہدی نے حدیث سنائی ، نیز ہمیں محمد بن عبداللہ بن نمیر نے حدیث سنائی ، انہوں نے کہا : ہمیں میرے والد نے حدیث بیان کی ، دونوں ( ابن مہدی اور عبداللہ بن نمیر ) نے کہا : ہمیں سفیان اور ابوزبیر سے حدیث بیان کی ، انہوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ، فَلْيُجِبْ، فَإِنْ شَاءَ طَعِمَ، وَإِنْ شَاءَ تَرَكَ»، وَلَمْ يَذْكُرِ ابْنُ الْمُثَنَّى: «إِلَى طَعَامٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11083,
                "hadithNumber": "3519",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of Abu Zubair with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابن نمیر نے بیان کیا، کہا ہم سے ابو عاصم نے بیان کیا, ابن جُریج نے ابوزبیر سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ بِهَذَا الْإِسْنَادِ، بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11084,
                "hadithNumber": "3520",
                "englishNarrator": "Abu Haraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: If any one of you is invited, he should accept (the invitation). In case he is fasting, he should pray (in order to bless the inmates of the house), and if he is not fasting he should eat.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کسی کو دعوت دی جائے تو وہ قبول کرے ۔ اگر وہ روزہ دار ہے تو دعا کرے اور اگر روزے کے بغیر ہے تو کھانا کھائے.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے حفص بن غیث نے بیان کیا، وہ ہشام کی سند سے,ابن سیرین نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دُعِيَ أَحَدُكُمْ، فَلْيُجِبْ، فَإِنْ كَانَ صَائِمًا، فَلْيُصَلِّ، وَإِنْ كَانَ مُفْطِرًا، فَلْيَطْعَمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11085,
                "hadithNumber": "3521",
                "englishNarrator": "Abu Huraira ( رضی اللہ عنہ) used to say:",
                "hadithEnglish": "The worst kind of food is the wedding feast to which the rich are invited and the poor are ignored. He who does not come to the feast, he in fact disobeys Allah and His Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "اُس ولیمے کا کھانا بُرا کھانا ہے جس میں امیروں کو بلایا جائے اور مسکینوں کو چھوڑ دیا جائے اور جس نے ( بلانے کے باوجود ) دعوت میں شرکت نہ کی ، اس نے اللہ اور اس کے رسول کی نافرمانی کی.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے پڑھا امام مالک نے ابن شہاب سے ، انہوں نے اعرج سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، وہ کہا کرتے تھے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ: «بِئْسَ الطَّعَامُ طَعَامُ الْوَلِيمَةِ، يُدْعَى إِلَيْهِ الْأَغْنِيَاءُ وَيُتْرَكُ الْمَسَاكِينُ، فَمَنْ لَمْ يَأْتِ الدَّعْوَةَ، فَقَدْ عَصَى اللهَ وَرَسُولَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11086,
                "hadithNumber": "3522",
                "englishNarrator": "Sufyan reported:",
                "hadithEnglish": "I said to Zuhri: Abu Bakr, what does this hadith mean: The worst kind of food is at a wedding feast of the rich ? He laughed and said: The food served in the feast given by the rich is not worst (in itself). Sufyan said: My father was rich, so I felt disturbed when I heard this hadith, so I asked Zuhri who said: I heard from 'Abdul-Rahman al-Alraj that he heard Abu Huraira (رضی اللہ عنہ) say: The worst kind of food is that served at the wedding feast. The rest of the hadith is the same.",
                "hadithUrdu": "میں نے امام زہری سے پوچھا : جنابِ ابوبکر! یہ حدیث کس طرح ہے : \"\" بدترین کھانا امیروں کا کھانا ہے \"\" ؟ وہ ہنسے ، اور جواب دیا : یہ ( حدیث ) اس طرح نہیں ہے کہ بدترین کھانا امیروں کا کھانا ہے ۔ سفیان نے کہا : میرے والد غنی تھے ، جب میں نے یہ حدیث سنی تھی تو اس نے مجھے گھبراہٹ میں ڈال دیا ، اس لیے میں نے اس کے بارے میں امام زہری سے دریافت کیا ، انہوں نے کہا : مجھے عبدالرحمٰن اعرج نے حدیث بیان کی کہ انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : بدترین کھانا اُس ولیمے کا کھانا ہے ۔ آگے امام مالک رحمۃ اللہ علیہ کی حدیث کی طرح بیان کیا.",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، انہوں نے کہا: میں نے زہری سے کہا: اے ابوبکر رضی اللہ عنہ یہ حدیث کیسی ہے: امیروں کا کھانا بدترین کھانا ہے؟ اس نے ہنس کر کہا: یہ بدترین کھانا نہیں، امیروں کا کھانا ہے, سفیان ( بن عیینہ ) نے ہمیں حدیث بیان کی ، کہا",
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، قَالَ: قُلْتُ لِلزُّهْرِيِّ: يَا أَبَا بَكْرٍ، كَيْفَ هَذَا الْحَدِيثُ: شَرُّ الطَّعَامِ طَعَامُ الْأَغْنِيَاءِ؟ فَضَحِكَ، فَقَالَ: لَيْسَ هُوَ شَرُّ الطَّعَامِ طَعَامُ الْأَغْنِيَاءِ، قَالَ سُفْيَانُ: وَكَانَ أَبِي غَنِيًّا، فَأَفْزَعَنِي هَذَا الْحَدِيثُ حِينَ سَمِعْتُ بِهِ، فَسَأَلْتُ عَنْهُ الزُّهْرِيَّ، فَقَالَ: حَدَّثَنِي عَبْدُ الرَّحْمَنِ الْأَعْرَجُ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ: شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ، ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ مَالِكٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11087,
                "hadithNumber": "3523",
                "englishNarrator": "It was narrated that Abu Huraira ( رضی اللہ عنہ) said:",
                "hadithEnglish": "The worst of food is the food of a (wedding) feast..\" a hadith like that of Malik.",
                "hadithUrdu": "بدترین کھانا اُس ولیمے کا کھانا ہے ، ( آگے ) امام مالک رحمۃ اللہ علیہ کی حدیث کی طرح ہے.",
                "urduNarrator": "مجھ سے محمد بن رافع اور عبد بن حمید نے بیان کیا، انہوں نے عبد الرزاق کی سند سے بیان کیا, معمر نے زہری سے خبر دی ، انہوں نے سعید بن مسیب سے اور اعرج سے ، اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، وَعَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ نَحْوَ حَدِيثِ مَالِكٍ، وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، نَحْوَ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11088,
                "hadithNumber": "3524",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated by Abu Huraira (رضی اللہ عنہ) through another chain of transmitters.",
                "hadithUrdu": "ہم سے ابن ابی عمر نے بیان کیا، کہا ہم سے سفیان نے بیان کیا, ابوزناد نے اعرج سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اسی کے مانند حدیث روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، نَحْوَ ذَلِكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10776,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=431",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=429",
                "label": "429",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=430",
                "label": "430",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=431",
                "label": "431",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=432",
                "label": "432",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=433",
                "label": "433",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=434",
                "label": "434",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=435",
                "label": "435",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=433",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=433",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=431",
        "to": 10800,
        "total": 40465
    }
}