{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 431,
        "data": [
            {
                "id": 11039,
                "hadithNumber": "3475",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "I asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about a virgin whose marriage is solemnised by her guardian, whether it was necessary or not to consult her. Allah's Messerger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Yes, she must be consulted. 'A'isha رضی اللہ عنہا reported: I told him that she feels shy, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Her silence implies her consent.",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں : میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس لڑکی کے بارے میں پوچھا جس کے گھر والے اس کا نکاح ( کرنے کا ارادہ ) کریں ، کیا اس سے اس کی مرضی معلوم کی جائے گی یا نہیں؟ تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : \" ہاں ، اس کی مرضی معلوم کی جائے گی ۔ \" حضرت عائشہ رضی اللہ عنہا نے کہا : میں نے آپ سے عرض کی : وہ تو یقینا حیا محسوس کرے گی ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب وہ خاموش رہی تو یہی اس کی اجازت ہو گی.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبداللہ بن ادریس نے بیان کیا، ان سے ابن جریج نے، اسحٰق بن ابراہیم اور محمد بن عبداللہ نے رافع، سب عبد الرزاق سے مروی ہے، اور یہ الفاظ ہم سے ابن رافع نے بیان کیے، ہم سے ابن جریج نے بیان کیا، انہوں نے کہا: میں نے ابن ابی ملیکہ سے سنا۔ وہ کہتے ہیں: ذکوان نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ إِدْرِيسَ، عَنِ ابْنِ جُرَيْجٍ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، وَاللَّفْظُ لِابْنِ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ: سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، يَقُولُ: قَالَ ذَكْوَانُ، مَوْلَى عَائِشَةَ، سَمِعْتُ عَائِشَةَ تَقُولُ: سَأَلْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَنِ الْجَارِيَةِ يُنْكِحُهَا أَهْلُهَا، أَتُسْتَأْمَرُ أَمْ لَا؟ فَقَالَ لَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «نَعَمْ، تُسْتَأْمَرُ»، فَقَالَتْ عَائِشَةُ: فَقُلْتُ لَهُ: فَإِنَّهَا تَسْتَحِي، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَذَلِكَ إِذْنُهَا، إِذَا هِيَ سَكَتَتْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11040,
                "hadithNumber": "3476",
                "englishNarrator": "Ibn 'Abbas ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A woman without a husband has more right to her person than her guardian, and a virgin's consent must be asked from her, and her silence implies her consent.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" جس عورت کا شوہر نہ رہا ہو وہ اپنے ولی کی نسبت اپنے بارے میں زیادہ حق رکھتی ہے ، اور کنواری سے اس کے ( نکاح کے ) بارے میں اجازت لی جائے اور اس کا خاموش رہنا اس کی اجازت ہے \" ؟ تو امام مالک نے جواب دیا : ہاں.",
                "urduNarrator": "سعید بن منصور اور قتیبہ بن سعید نے کہا : ہم سے امام مالک نے حدیث بیان کی ۔ یحییٰ بن یحییٰ نے کہا : میں نے امام مالک رحمۃ اللہ علیہ سے پوچھا : کیا آپ کو عبداللہ بن فضل نے نافع بن جبیر کے واسطے سے حضرت ابن عباس رضی اللہ عنہ سے یہ حدیث بیان کی ہے کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالَا: حَدَّثَنَا مَالِكٌ، ح وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَاللَّفْظُ لَهُ، قَالَ: قُلْتُ لِمَالِكٍ: حَدَّثَكَ عَبْدُ اللهِ بْنُ الْفَضْلِ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا، وَالْبِكْرُ تُسْتَأْذَنُ فِي نَفْسِهَا، وَإِذْنُهَا صُمَاتُهَا»؟ قَالَ: نَعَمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11041,
                "hadithNumber": "3477",
                "englishNarrator": "Ibn Abbas ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: A woman who has been previously married (Thayyib) has more right to her person than her guardian. And a virgin should also be consulted, and her silence implies her consent.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" جس نے شادی شدہ زندگی گزاری ہو وہ اپنے بارے میں اپنے والی کی نسبت زیادہ حق رکھتی ہے ، اور کنواری سے اس کی مرضی پوچھی جائے اور اس کی خاموشی اس کی اجازت ہے.",
                "urduNarrator": "قتیبہ بن سعید نے کہا : ہمیں سفیان نے زیاد بن سعد سے حدیث بیان کی ، انہوں نے عبداللہ بن فضل سے روایت کی ، انہوں نے نافع بن جبیر کو حضرت ابن عباس رضی اللہ عنہ سے خبر دیتے ہوئے سنا کہ",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَنْ عَبْدِ اللهِ بْنِ الْفَضْلِ، سَمِعَ نَافِعَ بْنَ جُبَيْرٍ، يُخْبِرُ عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا، وَالْبِكْرُ تُسْتَأْمَرُ، وَإِذْنُهَا سُكُوتُهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11042,
                "hadithNumber": "3478",
                "englishNarrator": "Sufyan reported on the basis of the same chain of transmitters (and the words are):",
                "hadithEnglish": "A woman who has been previously married (Thayyib) has more right to her person than her guardian; and a virgin's father must ask her consent from her, her consent being her silence, At times he said: Her silence is her affirmation.",
                "hadithUrdu": "\" جس عورت نے شادی شدہ زندگی گزاری ہو وہ اپنے بارے میں اپنے ولی کی نسبت زیادہ حق رکھتی ہے ، اور کنواری سے اس کا والد اس کے ( نکاح کے ) بارے میں اجازت لے گا ، اس کی خاموشی اس کی اجازت ہے ۔ \" اور کبھی انہوں نے کہا : \" اور اس کی خاموشی اس کا اقرار ہے.",
                "urduNarrator": "ابن ابی عمر نے ہمیں حدیث بیان کی ، کہا : ہمیں سفیان نے اسی سند کے ساتھ حدیث بیان کی اور کہا",
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، بِهَذَا الْإِسْنَادِ، وَقَالَ: «الثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا، وَالْبِكْرُ يَسْتَأْذِنُهَا أَبُوهَا فِي نَفْسِهَا، وَإِذْنُهَا صُمَاتُهَا»، وَرُبَّمَا قَالَ: «وَصَمْتُهَا إِقْرَارُهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11043,
                "hadithNumber": "3479",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married me when I was six years old, and I was admitted to his house at the age of nine. She further said: We went to Medina and I had an attack of fever for a month, and my hair had come down to the earlobes. Umm Ruman رضی اللہ عنہ (my mother) came to me and I was at that time on a swing along with my playmates. She called me loudly and I went to her and I did not know what she had wanted of me. She took hold of my hand and took me to the door, and I was saying: Ha, ha (as if I was gasping), until the agitation of my heart was over. She took me to a house, where had gathered the women of the Ansar. They all blessed me and wished me good luck and said: May you have share in good. She (my mother) entrusted me to them. They washed my head and embellished me and nothing frightened me. Allah's Messenger (, may peace be upon him) came there in the morning, and I was entrusted to him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے میرے ساتھ چھ برس کی عمر میں نکاح کیا اور جب میں نو برس کی تھی تو میرے ساتھ گھر بسایا ۔ کہا : ہم ( ہجرت کے بعد ) مدینہ آئے تو میں ایک مہینہ بخار میں مبتلا رہی ۔ ( اور میرے سر کے بال جھڑ گئے ، جب صحت یاب ہوئی تو ) پھر میرے بال ( اچھی طرح سے اگ آئے حتیٰ کہ ) گردن سے نیچے تک کی چٹیا بن گئی ۔ ( ان دنوں ایک روز میری والدہ ) ام رومان رضی اللہ عنہ میرے پاس آئیں جبکہ میں جھولے پر ( جھول رہی ) تھی اور میرے ساتھ میری سہیلیاں بھی تھیں ، انہوں نے مجھے زور سے آواز دی ، میں ان کے پاس گئی ، مجھے معلوم نہ تھا کہ وہ مجھ سے کیا چاہتی ہیں ۔ انہوں نے میرا ہاتھ تھاما اور مجھے دروازے پر لاکھڑا کیا ، ( سانس پھولنے کی وجہ سے ) میرے منہ سے ھہ ھہ کی آواز نکل رہی تھی ، حتیٰ کہ جب میری سانس ( چڑھنے کی کیفیت ) چلی گئی تو وہ مجھے ایک گھر کے اندر لے آئیں تو ( غیر متوقع طور پر ) وہاں انصار کی عورتیں ( جمع ) تھیں ، وہ کہنے لگیں ، خیر وبرکت پر اور اچھے نصیب پر ( آئی ہو ۔ ) تو انہوں ( میری والدہ ) نے مجھے ان کے سپرد کر دیا ۔ انہوں نے میرا سر دھویا ، اور مجھے بنایا سنوارا ، پھر میں اس کے سوا کسی بات پر نہ چونکی کہ اچانک چاشت کے وقت رسول اللہ صلی اللہ علیہ وسلم تشریف لے آئے ۔ اور ان عورتوں نے مجھے آپ صلی اللہ علیہ وسلم کے سپرد کر دیا.",
                "urduNarrator": "ہم سے ابو کریب محمد بن علاء نے بیان کیا، انہوں نے کہا ابو اسامہ نے ہشام سے ، انہوں نے اپنے والد ( عروہ ) سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَ: وَجَدْتُ فِي كِتَابِي عَنْ أَبِي أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: «تَزَوَّجَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِسِتِّ سِنِينَ، وَبَنَى بِي وَأَنَا بِنْتُ تِسْعِ سِنِينَ»، قَالَتْ: فَقَدِمْنَا الْمَدِينَةَ، فَوُعِكْتُ شَهْرًا، فَوَفَى شَعْرِي جُمَيْمَةً، فَأَتَتْنِي أُمُّ رُومَانَ، وَأَنَا عَلَى أُرْجُوحَةٍ، وَمَعِي صَوَاحِبِي، فَصَرَخَتْ بِي فَأَتَيْتُهَا، وَمَا أَدْرِي مَا تُرِيدُ بِي فَأَخَذَتْ بِيَدِي، فَأَوْقَفَتْنِي عَلَى الْبَابِ، فَقُلْتُ: هَهْ هَهْ، حَتَّى ذَهَبَ نَفَسِي، فَأَدْخَلَتْنِي بَيْتًا، فَإِذَا نِسْوَةٌ مِنَ الْأَنْصَارِ، فَقُلْنَ: عَلَى الْخَيْرِ وَالْبَرَكَةِ، وَعَلَى خَيْرِ طَائِرٍ، فَأَسْلَمَتْنِي إِلَيْهِنَّ، فَغَسَلْنَ رَأْسِي وَأَصْلَحْنَنِي، فَلَمْ يَرُعْنِي إِلَّا وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ضُحًى، فَأَسْلَمْنَنِي إِلَيْهِ.",
                "headingArabic": "تَزْوِيجِ الأَبِ الْبِكْرَ الصَّغِيرَةَ ‏",
                "headingUrdu": "کنواری لڑکی کا نکاح باپ کے لیے جائز ہے۔",
                "headingEnglish": "It is permissible for a father to arrange the marriage of a young virgin",
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11044,
                "hadithNumber": "3480",
                "englishNarrator": "A'isha ( رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married me when I was six years old, and I was admitted to his house when I was nine years old.",
                "hadithUrdu": "رسول اللہ ﷺ نے میرے ساتھ نکاح کیا جب میں چھ سال کی تھی اور میرے ساتھ گھر بسایا جب میں نو سال کی تھی.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا ابو معاویہ اور عبدہ بن سلیمان نے ہشام سے انھوں نے اپنے والد ( عروہ ) سے انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت می انہوں نے کہا کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، وَاللَّفْظُ لَهُ، حَدَّثَنَا عَبْدَةُ هُوَ ابْنُ سُلَيْمَانَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ: «تَزَوَّجَنِي النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بِنْتُ سِتِّ سِنِينَ، وَبَنَى بِي وَأَنَا بِنْتُ تِسْعِ سِنِينَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11045,
                "hadithNumber": "3481",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married her when she was seven years old, and he was taken to his house as a bride when she was nine, and her dolls were with her; and when he (the Holy Prophet ﷺ) died she was eighteen years old.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ان سے نکاح کیا جب وہ سات سال کی تھیں ، اور گھر بسایا جب وہ نو سال کی تھیں اور ان کے کھلونے ان کے ساتھ تھے ۔ آپ صلی اللہ علیہ وسلم انہیں چھوڑ کر فوت ہوئے جب وہ اٹھارہ سال کی تھیں.",
                "urduNarrator": "ہم سے عبد بن حمید نے بیان کیا، کہا ہم سے عبد الرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا, زہری نے عروہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، «أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ تَزَوَّجَهَا وَهِيَ بِنْتُ سَبْعِ سِنِينَ، وَزُفَّتْ إِلَيْهِ وَهِيَ بِنْتُ تِسْعِ سِنِينَ، وَلُعَبُهَا مَعَهَا، وَمَاتَ عَنْهَا وَهِيَ بِنْتُ ثَمَانَ عَشْرَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11046,
                "hadithNumber": "3482",
                "englishNarrator": "Narrated 'A'isha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) married her when she was six years old, and he (the Holy Prophet ﷺ) took her to his house when she was nine, and when he (the Holy Prophet ﷺ) died she was eighteen years old.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ان سے نکاح کیا جبکہ وہ چھ برس کی تھیں اور ان کی رخصتی ہوئی جبکہ وہ نو برس کی تھیں اور آپ فوت ہوئے جبکہ وہ اٹھارہ برس کی تھیں.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، اسحاق بن ابراہیم، ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا کہ یحییٰ اور اسحاق نے کہا: اس نے ہم سے بیان کیا اور باقی دو نے کہا: ہم سے ابو معاویہ نے الاعمش کی سند سے اور ابراہیم کی سند سے بیان کیا,اسود نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَ يَحْيَى، وَإِسْحَاقُ: أَخْبَرَنَا، وقَالَ الْآخَرَانِ: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ: «تَزَوَّجَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهِيَ بِنْتُ سِتٍّ، وَبَنَى بِهَا وَهِيَ بِنْتُ تِسْعٍ، وَمَاتَ عَنْهَا وَهِيَ بِنْتُ ثَمَانَ عَشْرَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11047,
                "hadithNumber": "3483",
                "englishNarrator": "A'isha (رضی اللہ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) contracted marriage with me in Shawwal and took me to his house as a bride during Shawwal. And who among the wives of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was dearer to him than I, and  'A'isha رضی اللہ عنہا liked that the women (of her family) should enter the houses as brides during the month of Shawwal.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے شوال میں میرے ساتھ نکاح کیا ، اور شوال ہی میں میرے ساتھ گھر بسایا ، تو رسول اللہ صلی اللہ علیہ وسلم کی بیویوں میں سے کون سی بیوی آپ کے ہاں مجھ سے زیادہ خوش نصیب تھی؟ ( عروہ نے ) کہا : حضرت عائشہ رضی اللہ عنہا پسند کرتی تھیں کہ اپنی ( رشتہ دار اور زیر کفالت ) عورتوں کی رخصتی شوال میں کریں ۔ ( جبکہ عربوں میں پرانا تصور یہ تھا کہ شوال میں نکاح اور رخصتی شادی کے لئے ٹھیک نہیں.",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا اور یہ لفظ زہیر کا ہے، انہوں نے کہا  وکیع نے ہمیں حدیث بیان کی ، کہا : ہمیں سفیان نے اسماعیل بن امیہ سے حدیث بیان کی ، انہوں نے عبداللہ بن عروہ سے ، انہوں نے عروہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَاللَّفْظُ لِزُهَيْرٍ، قَالَا: حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ عَبْدِ اللهِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ: «تَزَوَّجَنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي شَوَّالٍ، وَبَنَى بِي فِي شَوَّالٍ، فَأَيُّ نِسَاءِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ أَحْظَى عِنْدَهُ مِنِّي؟»، قَالَ: «وَكَانَتْ عَائِشَةُ تَسْتَحِبُّ أَنْ تُدْخِلَ نِسَاءَهَا فِي شَوَّالٍ.",
                "headingArabic": "اسْتِحْبَابِ التَّزَوُّجِ وَالتَّزْوِيجِ فِي شَوَّالٍ وَاسْتِحْبَابِ الدُّخُولِ فِيهِ ‏",
                "headingUrdu": "شوال میں نکاح کرنا اور نکاح کرنا مستحب ہے اور اسی مہینے میں نکاح کرنا مستحب ہے۔",
                "headingEnglish": "It is recommended to get married and arrange marriages in Shawwal, and it is recommended to consummate the marriage in that month",
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11048,
                "hadithNumber": "3484",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Sufyan with the same chain of transmitters, but he made no mention of the act of 'A'isha رضی اللہ عنہا (being admitted as a wife in the house of the Holy Prophet ﷺ).",
                "hadithUrdu": "عبداللہ بن نمیر نے کہا : ہمیں سفیان نے اسی سند کے ساتھ ( یہ ) حدیث بیان کی اور انہوں نے حضرت عائشہ رضی اللہ عنہا کے عمل ( خاندان کی بچیوں کا شوال میں شادی کرانے ) کا تذکرہ نہیں کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، بِهَذَا الْإِسْنَادِ، وَلَمْ يَذْكُرْ فِعْلَ عَائِشَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11049,
                "hadithNumber": "3485",
                "englishNarrator": "Abu Huraira ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "I was in the company of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) when there came a man and informed him that he had contracted to marry a woman of the Ansar. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Did you cast a glance at her? He said: No. He said: Go and cast a glance at her, for there is something in the eyes of the Ansar.",
                "hadithUrdu": "میں نبی اکرم صلی اللہ علیہ وسلم کے پاس حاضر تھا ، آپ کے پاس ایک آدمی آیا اور بتایا کہ اس نے انصار کی ایک عورت سے نکاح ( طے ) کیا ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے اس سےفرمایا : \" کیا تم نے اسے دیکھا ہے؟ \" اس نے جواب دیا : نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" جاؤ اور اسے دیکھ لو کیونکہ انصار کی آنکھوں میں کچھ ہے ۔ \"",
                "urduNarrator": "ہم سے ابن ابی عمر نے بیان کیا,سفیان نے ہمیں یزید بن کیسان سے حدیث بیان کی ، انہوں نے ابوحازم سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ يَزِيدَ بْنِ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: كُنْتُ عِنْدَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَتَاهُ رَجُلٌ فَأَخْبَرَهُ أَنَّهُ تَزَوَّجَ امْرَأَةً مِنَ الْأَنْصَارِ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَنَظَرْتَ إِلَيْهَا؟»، قَالَ: لَا، قَالَ: «فَاذْهَبْ فَانْظُرْ إِلَيْهَا، فَإِنَّ فِي أَعْيُنِ الْأَنْصَارِ شَيْئًا».",
                "headingArabic": "نَدْبِ النَّظَرِ إِلَى وَجْهِ الْمَرْأَةِ وَكَفَّيْهَا لِمَنْ يُرِيدُ تَزَوُّجَهَا ‏",
                "headingUrdu": "جو شخص کسی عورت سے شادی کرنا چاہتا ہے اس کے لیے مستحب ہے کہ اسے شادی کی پیشکش کرنے سے پہلے اس کا چہرہ اور ہاتھ دیکھے۔",
                "headingEnglish": "It is recommended for the one who wants to marry a woman to look at her face and hands before proposing marriage to her",
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11050,
                "hadithNumber": "3486",
                "englishNarrator": "Abu Huraira (رضی اللہ عنہ) reported:",
                "hadithEnglish": "A man came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: I have contracted marriage with a woman of the Ansar, whereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Did you cast a glance at her, for there is something in the eyes of the Ansar? He said: I did cast a glance at her, whereupon he said: For what (dower) did you marry her? He said: For four 'uqiyas. Thereupon Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: For four 'uqiyas; it seems as if you dig out silver from the side of this mountain (and that is why you are prepared to pay such a large amount of dower). We have nothing which we should give you. There is a possibility that we may send you to an (expedition) where you may get (booty). So he sent that man (in the expedition) which was despatched to Banu 'Abs.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں ایک آدمی حاضر ہوا اور کہا : میں نے انصار کی ایک عورت سے نکاح کیا ہے ۔ نبی اکرم صلی اللہ علیہ وسلم نے اس سے پوچھا : \" کیا تم نے اسے دیکھا ہے؟ کیونکہ انصار کی آنکھوں میں کچھ ہے ۔ \" اس نے جواب دیا : میں نے اسے دیکھا ہے ۔ آپ نے پوچھا : \" کتنے مہر پر تم نے اِس سے نکاح کیا ہے؟ \" اس نے جواب دیا : چار اوقیہ پر ۔ تو نبی اکرم صلی اللہ علیہ وسلم نے اس سے فرمایا : \" چار اوقیہ چاندی پر؟ گویا تم اس پہاڑ کے پہلو سے چاندی تراشتے ہو! تمہیں دینے کے لیے ہمارے پاس کچھ موجود نہیں ، البتہ جلد ہی ہم تمہیں ایک لشکر میں بھیج دیں گے تمہیں اس سے ( غنیمت کا حصہ ) مل جائے گا ۔ \" کہا : اس کے بعد آپ صلی اللہ علیہ وسلم نے بنو عبس کی جانب ایک لشکر روانہ کیا ( تو ) اس آدمی کو بھی اس میں بھیج دیا.",
                "urduNarrator": "مجھ سے یحییٰ بن معین نے بیان کیا، انہوں نے ہم سے بیان کیا مروان بن معاویہ فزاری نے حدیث بیان کی ، کہا : ہمیں یزید بن کیسان نے ابوحازم سے حدیث بیان کی ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي يَحْيَى بْنُ مَعِينٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: إِنِّي تَزَوَّجْتُ امْرَأَةً مِنَ الْأَنْصَارِ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «هَلْ نَظَرْتَ إِلَيْهَا؟ فَإِنَّ فِي عُيُونِ الْأَنْصَارِ شَيْئًا» قَالَ: قَدْ نَظَرْتُ إِلَيْهَا، قَالَ: «عَلَى كَمْ تَزَوَّجْتَهَا؟» قَالَ: عَلَى أَرْبَعِ أَوَاقٍ، فَقَالَ لَهُ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «عَلَى أَرْبَعِ أَوَاقٍ؟ كَأَنَّمَا تَنْحِتُونَ الْفِضَّةَ مِنْ عُرْضِ هَذَا الْجَبَلِ، مَا عِنْدَنَا مَا نُعْطِيكَ، وَلَكِنْ عَسَى أَنْ نَبْعَثَكَ فِي بَعْثٍ تُصِيبُ مِنْهُ»، قَالَ: فَبَعَثَ بَعْثًا إِلَى بَنِي عَبْسٍ بَعَثَ ذَلِكَ الرَّجُلَ فِيهِمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11051,
                "hadithNumber": "3487",
                "englishNarrator": "Sahl bin Sa'd al-Sa'idi (رضی اللہ عنہ) reported:",
                "hadithEnglish": "A woman came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Messenger of Allah, I have come to you to entrust myself to you (you may contract my marriage with anyone at your discretion). Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saw her and cast a glance at her from head to foot. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then lowered his head. When the woman saw that he had made no decision in regard to her, she sat down. There stood up a person from amongst his companions and said: Messenger of Allah, marry her to me if you have no need of her. He (the Prophet) said: is there anything with you (which you con give as a dower)? He said: No, Messenger of Allah, by Allah I have nothing. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Go to your people (family) and see if you can find something. He returned and said: I have found nothing. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: See even if it is an iron ring. He went and returned and said: No, by Allah, not even an iron ring, but only this lower garment of mine (Sahl said that he had no upper garment), half of which (I am prepared to part with) for her. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: How can your lower garment serve your purpose, for it you wear it, she would not be able to make any use of it and if she wears it there would not be anything on you? The man sat down and as the sitting prolonged he stood up (in disappointment) and as he was going back Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded (him) to be called back, and as he came, he said to him: Do you know any part of the Qur'an? He said: I know such and such surahs (and he counted them), whereupon he ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Can you recite them from heart (from your memory)? He said: Yes, whereupon he (Allah's Messenger) said: Go, I have given her to you in marriage for the part of the Qur'an which you know. This is the Hadith of Ibn Abi Hazim (a narrator) is very similar in wording.",
                "hadithUrdu": "ایک خاتون رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی ، اور عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم! میں اپنی ذات آپ کو ہبہ کرنے کے لیے حاضر ہوئی ہوں ، آپ صلی اللہ علیہ وسلم نے اس کی طرف نظر کی ، آپ اپنی نظر نیچے سے اوپر اور اوپر سے نیچے تک لے گئے ۔ پھررسول اللہ صلی اللہ علیہ وسلم نے اپنا سر مبارک جھکا لیا ۔ جب عورت نے دیکھا کہ آپ نے اس کے بارے میں کوئی فیصلہ نہیں کیا تو وہ بیٹھ گئی ۔ اس پر آپ کے صحابہ میں سے ایک آدمی کھڑا ہوا اور عرض کی : اے اللہ کے رسول ( صلی اللہ علیہ وسلم ) ! اگر آپ کو اس ( کے ساتھ شادی ) کی ضرورت نہیں تو اس کی شادی میرے ساتھ کر دیں ۔ آپ صلی اللہ علیہ وسلم نے پوچھا : کیا تمہارے پاس ( حق مہر میں دینے کے لیے ) کوئی چیز ہے؟ \" اس نے جواب دیا : اللہ کی قسم! اللہ کے رسول! ( کچھ ) نہیں ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اپنے گھر والوں کے پاس جاؤ ، دیکھو تمہیں کچھ ملتا ہے؟ \" وہ گیا پھر واپس آیا اور عرض کی : نہیں ، اللہ کی قسم! مجھے کچھ نہیں ملا ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دیکھو! چاہے لوہے کی انگوٹھی ہو ۔ \" وہ گیا پھر واپس آیا ، اور عرض کی ، نہیں ، اللہ کی قسم! اللہ کے رسول! لوہے کی انگوٹھی بھی نہیں ہے ، البتہ میری یہ تہبند ہے ۔ سہل نے کہا : اس کے پاس ( کندھے کی ) چادر بھی نہیں تھی ۔ اس میں سے آدھی ( بطور مہر ) اِس کے لیے ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" وہ تمہارے تہبند کا کیا کرے گی ، اگر تم اسے پہنو گے تو اس ( کے جسم ) پر اس میں سے کچھ نہیں ہو گا اور اگر وہ پہنے گی تو تم پر اس میں سے کچھ نہیں ہو گا ۔ \" اس پر وہ آدمی بیٹھ گیا ۔ اسے بیٹھے ہوئے لمبا وقت ہو گیا تو وہ کھڑا ہو گیا ( اور چل دیا ۔ ) رسول اللہ صلی اللہ علیہ وسلم نے اسے پیٹھ پھیر کر جاتے ہوئے دیکھ لیا ۔ آپ نے اس کے بارے میں حکم دیا تو اسے آپ صلی اللہ علیہ وسلم کی خاطر بلا لیا گیا ، جب وہ آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" تمہارے پاس قرآن کتنا ہے؟ \" ( تمہیں کتنا قرآن یاد ہے؟ ) اس نے عرض کی : میرے پاس فلاں سورت اور فلاں سورت ہے ۔ اس نے وہ سورتیں شمار کیں ۔ تو آپ نے پوچھا : \" تم انہیں زبانی پڑھتے ہو؟ \" اس نے عرض کی ، جی ہاں! آپ صلی اللہ علیہ وسلم نے فرمایا : \" جاؤ ، تمہیں جتنا قرآن یاد ہے اس کے عوض ( نکاح کے لیے ) تمہیں اس کا مالک ( خاوند ) بنا دیا گیا ہے ۔ \" یہ ابن ابوحازم کی حدیث ہے ، یعقوب کی حدیث بھی الفاظ میں اسی کے قریب ہے.",
                "urduNarrator": "ہم سے قتیبہ بن سعید ثقفی نے بیان کیا، انہوں نے بیان کیا یعقوب بن عبدالرحمٰن القاری اور عبدالعزیز بن ابی حازم نے ابوحازم سے ، انہوں نے حضرت سہل بن سعد ساعدی رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ، حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، ح وَحَدَّثَنَاهُ قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ: جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَتْ: يَا رَسُولَ اللهِ، جِئْتُ أَهَبُ لَكَ نَفْسِي، فَنَظَرَ إِلَيْهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَصَعَّدَ النَّظَرَ فِيهَا وَصَوَّبَهُ، ثُمَّ طَأْطَأَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَأْسَهُ، فَلَمَّا رَأَتِ الْمَرْأَةُ أَنَّهُ لَمْ يَقْضِ فِيهَا شَيْئًا جَلَسَتْ، فَقَامَ رَجُلٌ مِنْ أَصْحَابِهِ، فَقَالَ: يَا رَسُولَ اللهِ، إِنْ لَمْ يَكُنْ لَكَ بِهَا حَاجَةٌ فَزَوِّجْنِيهَا، فَقَالَ: «فَهَلْ عِنْدَكَ مِنْ شَيْءٍ؟» فَقَالَ: لَا، وَاللهِ يَا رَسُولَ اللهِ، فَقَالَ: «اذْهَبْ إِلَى أَهْلِكَ فَانْظُرْ هَلْ تَجِدُ شَيْئًا؟» فَذَهَبَ ثُمَّ رَجَعَ، فَقَالَ: لَا، وَاللهِ، مَا وَجَدْتُ شَيْئًا، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «انْظُرْ وَلَوْ خَاتِمًا مِنْ حَدِيدٍ»، فَذَهَبَ ثُمَّ رَجَعَ، فَقَالَ: لَا، وَاللهِ، يَا رَسُولَ اللهِ، وَلَا خَاتِمًا مِنْ حَدِيدٍ، وَلَكِنْ هَذَا إِزَارِي - قَالَ سَهْلٌ: مَا لَهُ رِدَاءٌ - فَلَهَا نِصْفُهُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا تَصْنَعُ بِإِزَارِكَ؟ إِنْ لَبِسْتَهُ لَمْ يَكُنْ عَلَيْهَا مِنْهُ شَيْءٌ، وَإِنْ لَبِسَتْهُ لَمْ يَكُنْ عَلَيْكَ مِنْهُ شَيْءٌ»، فَجَلَسَ الرَّجُلُ، حَتَّى إِذَا طَالَ مَجْلِسُهُ قَامَ، فَرَآهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُوَلِّيًا، فَأَمَرَ بِهِ فَدُعِيَ، فَلَمَّا جَاءَ قَالَ: «مَاذَا مَعَكَ مِنَ الْقُرْآنِ؟» قَالَ: مَعِي سُورَةُ كَذَا وَسُورَةُ كَذَا - عَدَّدَهَا - فَقَالَ: «تَقْرَؤُهُنَّ عَنْ ظَهْرِ قَلْبِكَ؟» قَالَ: نَعَمْ، قَالَ: «اذْهَبْ فَقَدْ مُلِّكْتَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ»، هَذَا حَدِيثُ ابْنِ أَبِي حَازِمٍ، وَحَدِيثُ يَعْقُوبَ يُقَارِبُهُ فِي اللَّفْظِ.",
                "headingArabic": "الصَّدَاقِ وَجَوَازِ كَوْنِهِ تَعْلِيمَ قُرْآنٍ وَخَاتَمَ حَدِيدٍ وَغَيْرَ ذَلِكَ مِنْ قَلِيلٍ وَكَثِيرٍ وَاسْتِحْبَابِ كَوْنِهِ خَمْسَمِائَةِ دِرْهَمٍ لِمَنْ لاَ يُجْحَفُ بِهِ",
                "headingUrdu": "جہیز۔ جہیز میں قرآن پڑھانا، لوہے کی انگوٹھی یا کوئی اور چیز، چھوٹی یا بڑی رقم جائز ہے، اور اس کے لیے پانچ سو درہم مستحب ہے۔",
                "headingEnglish": "The Dowry. It is permissible for the dowry to be teaching Quran, a ring of iron or anything else, a small or large amount, And it is recommended for it to be Five Hundred Dirham",
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11052,
                "hadithNumber": "3488",
                "englishNarrator": "This hadith has been narrated on the authority of Sahl bin Sa'd رضی اللہ عنہ with a minor alteration of words, but the hadith transmitted through Za'idah (the words are that the Holy Prophet) said:",
                "hadithEnglish": "Go, I have married her to you, and you teach her something of the Qur'an.",
                "hadithUrdu": "\" جاؤ ، میں نے اس سے تمہاری شادی کر دی ہے ، اس لیے ( اب ) تم اسے قرآن کی تعلیم دو.\"",
                "urduNarrator": "حماد بن زید ، سفیان بن عیینہ ، دراوردی اور زائدہ سب نے ابوحازم سے ، انہوں نے سہل بن سعد رضی اللہ عنہ سے یہی حدیث بیان کی ، ان میں سے کچھ راوی دوسروں پر اضافہ کرتے ہیں ۔ مگر زائدہ کی حدیث میں ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا",
                "hadithArabic": "وَحَدَّثَنَاهُ خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنِ الدَّرَاوَرْدِيِّ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، كُلُّهُمْ عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، بِهَذَا الْحَدِيثِ، يَزِيدُ بَعْضُهُمْ عَلَى بَعْضٍ، غَيْرَ أَنَّ فِي حَدِيثِ زَائِدَةَ، قَالَ: «انْطَلِقْ فَقَدْ زَوَّجْتُكَهَا فَعَلِّمْهَا مِنَ الْقُرْآنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11053,
                "hadithNumber": "3489",
                "englishNarrator": "Abu Salama bin 'Abdul-Rahman reported:",
                "hadithEnglish": "I asked 'A'isha رضی اللہ عنہا , the wife of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌): What is the amount of dower of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)? She said: It was twelve 'uqiyas and one nash. She said: Do you know what is al-nash? I said: No. She said: It is half of uqiya, and it amounts to five hundred dirhams, and that was the dower given by Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to his wives.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کی اہلیہ ، ( ام المومنین ) حضرت عائشہ رضی اللہ عنہا سے پوچھا : رسول اللہ صلی اللہ علیہ وسلم ( کی بیویوں ) کا مہر کتنا ( ہوتا ) تھا؟ انہوں نے جواب دیا : اپنی بیویوں کے لیے آپ کا مہر بارہ اوقیہ اور ایک نَش تھا ۔ ( پھر ) انہوں نے پوچھا : جانتے ہو نش کیا ہے؟ میں نے عرض کی : نہیں ، انہوں نے کہا : آدھا اوقیہ ، یہ کل 500 درہم بنتے ہیں اور یہی اپنی بیویوں کے لیے رسول اللہ صلی اللہ علیہ وسلم کا مہر تھا.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے عبدالعزیز بن محمد نے بیان کیا، کہا کہ مجھ سے یزید بن عبداللہ بن اسامہ بن الحاد نے بیان کیا اور مجھ سے محمد نے بیان کیا۔ ابن ابی عمر المکی اور ان کا تلفظ عبد العزیز نے یزید کی سند سے اور محمد بن ابراہیم کی سند سے بیان کیا, ابوسلمہ بن عبدالرحمٰن سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللهِ بْنِ أُسَامَةَ بْنِ الْهَادِ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، وَاللَّفْظُ لَهُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ يَزِيدَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ: سَأَلْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: كَمْ كَانَ صَدَاقُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَتْ: «كَانَ صَدَاقُهُ لِأَزْوَاجِهِ ثِنْتَيْ عَشْرَةَ أُوقِيَّةً وَنَشًّا»، قَالَتْ: «أَتَدْرِي مَا النَّشُّ؟» قَالَ: قُلْتُ: لَا، قَالَتْ: «نِصْفُ أُوقِيَّةٍ، فَتِلْكَ خَمْسُمِائَةِ دِرْهَمٍ، فَهَذَا صَدَاقُ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِأَزْوَاجِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11054,
                "hadithNumber": "3490",
                "englishNarrator": "It was narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saw the trace of yellowness on 'Abdul-Rahman bin 'Auf  رضی اللہ عنہ and said: What is this? Thereupon he said: Allah's Messenger, I have married a woman for a date-stone's weight of gold. He said: God bless you! Hold a wedding feast, even if only with a sheep.",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ ( کے لباس ) پر زرد ( زعفران کی خوشبو کا ) نشان دیکھا تو فرمایا : \" یہ کیا ہے؟ \" انہوں نے جواب دیا : اللہ کے رسول ( صلی اللہ علیہ وسلم ) ! میں نے سونے کی ایک گٹھلی کے وزن پر ایک عورت سےشادی کی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تمہیں برکت دے ۔ ولیمہ کرو ، خواہ ایک بکری سے کرو.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی، ابو الربیع سلیمان بن داؤد العتاقی اور قتیبہ بن سعید نے بیان کیا اور تلفظ یحییٰ نے کہا: ہم سے انہوں نے بیان کیا اور باقی دو نے کہا : ہم سے حماد بن زید نے بیان کیا , ثابت نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَاللَّفْظُ لِيَحْيَى، قَالَ يَحْيَى: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَأَى عَلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَثَرَ صُفْرَةٍ، فَقَالَ: «مَا هَذَا؟» قَالَ: يَا رَسُولَ اللهِ، إِنِّي تَزَوَّجْتُ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ، قَالَ: «فَبَارَكَ اللهُ لَكَ، أَوْلِمْ وَلَوْ بِشَاةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11055,
                "hadithNumber": "3491",
                "englishNarrator": "Anas bin Malik (رضی اللہ عنہ) reported:",
                "hadithEnglish": "'Abdul-Rahman bin 'Auf (رضی اللہ عنہ) married during the lifetime of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) for a nawat weight of gold and the messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to him: Give a feast even with a sheep.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے سونے کی گھٹلی کے وزن کے برابر سونے کے عوض نکاح کیا تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : \" ولیمہ کرو خواہ ایک بکری سے کرو ۔ \"",
                "urduNarrator": "ہم سے محمد بن عبید الغبری نے بیان کیا، انہوں نے بیان کیا ابو عوانہ نے ہمیں قتادہ سے حدیث بیان کی ، انہوں نے انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، تَزَوَّجَ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَوْلِمْ وَلَوْ بِشَاةٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11056,
                "hadithNumber": "3492",
                "englishNarrator": "Anas bin Malik (رضی اللہ عنہ) reported:",
                "hadithEnglish": "'Abdul-Rahman bin 'Auf (رضی اللہ عنہ) married a woman for a date-stone's weight of gold and Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said to him: Hold a wedding feast, even if only with a sheep.",
                "hadithUrdu": "حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے سونے کی ایک گٹھلی کے وزن کے برابر سونے کے عوض نکاح کیا اور یہ کہ نبی اکرم صلی اللہ علیہ وسلم نے ان سے فرمایا : \" ولیمہ کرو خواہ ایک بکری سے کرو.",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، انہوں نے بیان کیا وکیع نے ہمیں خبر دی ، کہا : ہمیں شعبہ نے قتادہ اور حُمید سے حدیث بیان کی ، انہوں نے حضرت انس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا وَكِيعٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، وَحُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ تَزَوَّجَ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ، وَأَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ: «أَوْلِمْ وَلَوْ بِشَاةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11057,
                "hadithNumber": "3493",
                "englishNarrator": "This hadith has been narrated on the authority of Humaid with the same chain of transmitters except (with this minor alteration of words):",
                "hadithEnglish": "'Abdul-Rahman رضی اللہ عنہ said: I married a woman.",
                "hadithUrdu": "حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے کہا : میں نے ایک عورت سے شادی کی ہے.",
                "urduNarrator": "ہم سے محمد بن المثنیٰ نے بیان کیا، انہوں نے ہم سے بیان کیا ابوداود ، وہب بن جریر اور شبابہ سب نے شعبہ سے حدیث بیان کی ، انہوں نے حمید سے اسی سند کے ساتھ روایت کی ، البتہ وہب کی حدیث میں یوں ہے : \" انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَهَارُونُ بْنُ عَبْدِ اللهِ، قَالَا: حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، ح وحَدَّثَنَا أَحْمَدُ بْنُ خِرَاشٍ، حَدَّثَنَا شَبَابَةُ، كُلُّهُمْ عَنْ شُعْبَةَ، عَنْ حُمَيْدٍ، بِهَذَا الْإِسْنَادِ، غَيْرَ أَنَّ فِي حَدِيثِ وَهْبٍ، قَالَ: قَالَ عَبْدُ الرَّحْمَنِ: تَزَوَّجْتُ امْرَأَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11058,
                "hadithNumber": "3494",
                "englishNarrator": "Abdul-Rahman bin 'Auf ( رضی اللہ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saw the signs of the happiness of wedding in me, and I said: I have married a woman of the Ansar. He said: How much Mahr have you paid? I said: For a date-stone weight of gold. And in the hadith transmitted by Ishaq (it is): (nawat weight) of gold.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھے دیکھا جبکہ مجھ پر شادی کی بشاشت ( خوشی ) نمایاں تھی ، میں نے عرض کی : میں نے انصار کی ایک عورت سے شادی کی ہے ، آپ نے پوچھا : \" تم نے اسے کتنا مہر دیا ہے؟ \" میں نے عرض کی : ایک گٹھلی ۔ اور اسحاق کی حدیث میں ہے : سونے کی.",
                "urduNarrator": "اسحاق بن ابراہیم اور محمد بن قدامہ نے کہا : ہمیں نضر بن شُمَیل نے خبر دی ، کہا : ہمیں شعبہ نے حدیث بیان کی ، کہا : ہمیں عبدالعزیز بن صُہَیب نے حدیث بیان کی ، کہا : میں نے حضرت انس رضی اللہ عنہ سے سنا وہ کہہ رہے تھے : حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ قُدَامَةَ، قَالَا: أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، قَالَ: سَمِعْتُ أَنَسًا، يَقُولُ: قَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ: رَآنِي رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَعَلَيَّ بَشَاشَةُ الْعُرْسِ، فَقُلْتُ: تَزَوَّجْتُ امْرَأَةً مِنَ الْأَنْصَارِ، فَقَالَ: «كَمْ أَصْدَقْتَهَا؟» فَقُلْتُ: نَوَاةً، وَفِي حَدِيثِ إِسْحَاقَ: مِنْ ذَهَبٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11059,
                "hadithNumber": "3495",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "'Abdul-Rahman رضی اللہ عنہ married a woman for a datestone weight of gold.",
                "hadithUrdu": "حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے سونے کی گٹھلی کے وزن کے برابر ( سونے ) کے عوض ایک عورت سے شادی کی.",
                "urduNarrator": "ہم سے ابن المثنی نے بیان کیا، انہوں نے کہا ابوداود نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے ابوحمزہ سے حدیث بیان کی ۔ شعبہ نے کہا : ان کا نام عبدالرحمٰن بن ابی عبداللہ ( کیسان ) ہے ۔ انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي حَمْزَةَ، - قَالَ شُعْبَةُ وَاسْمُهُ عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَبْدِ اللَّهِ - عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ عَبْدَ الرَّحْمَنِ، تَزَوَّجَ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11060,
                "hadithNumber": "3496",
                "englishNarrator": "Shu'ba has narrattd this hadith with the same chain of transmitters except for (this alteration) that he said:",
                "hadithEnglish": "A person from among the sons of 'Abdul Rahman رضی اللہ عنہ said:",
                "hadithUrdu": "حضرت عبدالرحمن بن عوف رضی اللہ عنہ کے بیٹوں میں سے ایک نے کہا : سونے کی ( ایک گٹھلی.",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا, وہب نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ یہ حدیث بیان کی ، مگر انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا وَهْبٌ، أَخْبَرَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ فَقَالَ رَجُلٌ مِنْ وَلَدِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ مِنْ ذَهَبٍ ‏.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11061,
                "hadithNumber": "3497",
                "englishNarrator": "It was narrated from Anas bin Malik:",
                "hadithEnglish": "The Messenger of Allah launched a compaign against Khabar. \"We prayed Al-Ghndah (Fajr) there when it was still dark, then the prophet of Allah ﷺ rode and Talhah rode, and I was seated behind Abu Talhah (on his mount). The prophet let ﷺ let his mount run through the narrow street of Khaibar, and my knee was touching the thigh of the prophet of Allah ﷺ. The Izar slipped from the thigh of the prophet of Allah ﷺ and I could see the whiteness of the thigh of the prophet of Allah ﷺ. When he entered the town, he said: Allahu Akbar (Allah is the Greatest). Khaibar is ruined. And when we get down in the valley of a people evil is the morning of the warned ones. He repeated it thrice. In the meanwhile the people went out for their work, and said: By Allah, Muhammad (has come). Abdul-'Aziz or some of our companions said: Muhammad and the army (have come). He said: We took it (the territory of Khaibar) by force, and there were gathered the prisoners of war. There came Dihya and he said: Messenger of Allah, bestow upon me a girl from among the prisoners. He said: Go and get any girl. He made a choice for Safiyya daughter of Huyayy (bin Akhtab). There came a person to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and said: Apostle of Allah, you have bestowed Safiyya bint Huyayy, the chief of Quraiza and al-Nadir, upon Dihya and she is worthy of you only. He said: Call him along with her. So he came along with her. When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saw her he said: Take any other woman from among the prisoners. He (the narrator) said: He (the Holy Prophet) then granted her emancipation and married her. Thabit said to him: Abu Hamza, how much dower did he (the Holy Prophet) give to her? He said: He granted her freedom and then married her. On the way Umm Sulaim embellished her and then sent her to him (the Holy Prophet) at night. Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) appeared as a bridegroom in the morning. He (the Holy Prophet) said: He who has anything (to eat) should bring that. Then the cloth was spread. A person came with cheese, another came with dates, and still another came with refined butter, and they prepared hais and that was the wedding feast of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ )",
                "hadithUrdu": "رسول اﷲ ﷺ نے جہاد کیا خیبر پر او رہم لوگوں نے وہاں نماز پڑھی صبح کی بہت اندھریے میں اور سوار ہوئے نبی ﷺ او رسوار ہوئے ابوطلحہٰ ؓ اور میں ردیف تھا ابوطلحہ کا اور روانہ ہوئے نبی ﷺ گلیوں میں خیبر کی اور میرا زانو نبیﷺ کے ران سے لگ لگ جاتا تھا اور تہبند رسول اﷲ ﷺ کی آپ کی ران سے کھسک گئی تھی او رمیں دیکھتا سفیدی آپ کی ران کی پھر جب شہر کے اندر گئے آپ نے فرمایا \r\n اکبر خراب ہوا خیبر ہم جب اترتے ہیں کسی قوم کے انگن میں تو برا ہوتا ہے حال ڈرائے گئے لوگوں کا ۔ اس آیت کو آپ نے تین بار پڑھا یعنی انا اذا نزلنا بساحۃ قوم سے اخیر تک اور اتنے میں وہاں کے لوگ اپنے اپنے کاموں میں نکلے اور انہوں نے کہا کہ محمد ﷺ آچکے ۔ اور عبدالعزیز نے کہا کہ ہمارے لوگوں نے یہ بھی کہا کہ لشکر بھی آگیا ۔ کہا راوی نے کہ غرض ہم نے لے لیا خیبر کو جبراً قہراً اور قیدی لوگ جمع کیے گئے اور دحیہ آئے اور عرص کی کہ یا رسول اﷲؐ! ایک لونڈی مجھے عنایت کیجیے ان قیدیوںمیںسے ۔ آپ نے فرمایا کہ جاؤ ایک لونڈی لے لو ۔ انہوں نے صفیہ بنت حیی کو لے لیا اور ایک شخص نے آکے کہا کہ اے نبی اﷲ تعالیٰ کے آپ نے دحیہ کو حیی کی بیٹی دیدی جو سردار ہے بنی قریظہ اور بنی نضیر کا اور وہ کسی کے لائق نہیں سوا آپ کے تو فرمایا کہ بلاؤ ان کو مع اس لونڈی کے ۔ کہا راوی نے کہ پھر وہ اسے لے کر آئے پھر جب آپ نے اس کو دیکھا تو دحیہ سے فرمایا کہ تم کوئی اور لونڈی لے لو قیدیوں میں سے اس کے سوا ۔ کہا راوی نے کہ پھر آپ نے آزاد کیا صفیہؓ کو اور ان سے نکاح کرلیا سو ثابت نے ان سے کہا کہ اے ابوحمزہ! ان کا مہر کیا باندھا انہوں نے؟ کہا یہی مرہ تھا کہ ان کو آزاد کردیا اور نکاح کرلیا یہاں تک کہ پھر جب وہ را میں تھے تو سنگار کردیا ان کا ام سلیمؓ نے اور پیش کردیا آپ پر ان کو رات میں اور صبح کو رسول اﷲﷺ نوشہ بنے ہوئے تھے ۔ پھر فرمایا اپ نے جس کے پاس جو کچھ ہو ( یعنی کھانے کی قسم سے ) وہ لائے او رایک دستر خوان چمڑے کا بچھا دیا اور کوئی اقط لانے لگا ( دہی سکھا کر بناتے ہیں ) اور کوئی کھجور او رکوئی گھی ان سب کو توڑ تاڑ کر خوب ملایا اور یہ ولیمہ ہوا رسول اﷲ ﷺ کا ۔",
                "urduNarrator": "مجھ سے زہیر بن حرب نے بیان کیا، اسمٰعیل یعنی ابن اُلیہ نے عبدالعزیز کی سند سے بیان کیا, حضرت انسؓ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عُلَيَّةَ - عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم غَزَا خَيْبَرَ قَالَ فَصَلَّيْنَا عِنْدَهَا صَلاَةَ الْغَدَاةِ بِغَلَسٍ فَرَكِبَ نَبِيُّ اللَّهِ صلى الله عليه وسلم وَرَكِبَ أَبُو طَلْحَةَ وَأَنَا رَدِيفُ أَبِي طَلْحَةَ فَأَجْرَى نَبِيُّ اللَّهِ صلى الله عليه وسلم فِي زُقَاقِ خَيْبَرَ وَإِنَّ رُكْبَتِي لَتَمَسُّ فَخِذَ نَبِيِّ اللَّهِ صلى الله عليه وسلم وَانْحَسَرَ الإِزَارُ عَنْ فَخِذِ نَبِيِّ اللَّهِ صلى الله عليه وسلم فَإِنِّي لأَرَى بَيَاضَ فَخِذِ نَبِيِّ اللَّهِ صلى الله عليه وسلم فَلَمَّا دَخَلَ الْقَرْيَةَ قَالَ ‏ ‏ اللَّهُ أَكْبَرُ خَرِبَتْ خَيْبَرُ إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏ ‏ ‏.‏ قَالَهَا ثَلاَثَ مَرَّاتٍ قَالَ وَقَدْ خَرَجَ الْقَوْمُ إِلَى أَعْمَالِهِمْ فَقَالُوا مُحَمَّدٌ وَاللَّهِ ‏.‏ قَالَ عَبْدُ الْعَزِيزِ وَقَالَ بَعْضُ أَصْحَابِنَا مُحَمَّدٌ وَالْخَمِيسُ ‏.‏ قَالَ وَأَصَبْنَاهَا عَنْوَةً وَجُمِعَ السَّبْىُ فَجَاءَهُ دِحْيَةُ فَقَالَ يَا رَسُولَ اللَّهِ أَعْطِنِي جَارِيَةً مِنَ السَّبْىِ ‏.‏ فَقَالَ ‏ ‏ اذْهَبْ فَخُذْ جَارِيَةً ‏ ‏ ‏.‏ فَأَخَذَ صَفِيَّةَ بِنْتَ حُيَىٍّ فَجَاءَ رَجُلٌ إِلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا نَبِيَّ اللَّهِ أَعْطَيْتَ دِحْيَةَ صَفِيَّةَ بِنْتَ حُيَىٍّ سَيِّدِ قُرَيْظَةَ وَالنَّضِيرِ مَا تَصْلُحُ إِلاَّ لَكَ ‏.‏ قَالَ ‏ ‏ ادْعُوهُ بِهَا ‏ ‏ ‏.‏ قَالَ فَجَاءَ بِهَا فَلَمَّا نَظَرَ إِلَيْهَا النَّبِيُّ صلى الله عليه وسلم قَالَ ‏ ‏ خُذْ جَارِيَةً مِنَ السَّبْىِ غَيْرَهَا ‏ ‏ ‏.‏ قَالَ وَأَعْتَقَهَا وَتَزَوَّجَهَا ‏.‏ فَقَالَ لَهُ ثَابِتٌ يَا أَبَا حَمْزَةَ مَا أَصْدَقَهَا قَالَ نَفْسَهَا أَعْتَقَهَا وَتَزَوَّجَهَا حَتَّى إِذَا كَانَ بِالطَّرِيقِ جَهَّزَتْهَا لَهُ أُمُّ سُلَيْمٍ فَأَهْدَتْهَا لَهُ مِنَ اللَّيْلِ فَأَصْبَحَ النَّبِيُّ صلى الله عليه وسلم عَرُوسًا فَقَالَ ‏ ‏ مَنْ كَانَ عِنْدَهُ شَىْءٌ فَلْيَجِئْ بِهِ ‏ ‏ قَالَ وَبَسَطَ نِطَعًا قَالَ فَجَعَلَ الرَّجُلُ يَجِيءُ بِالأَقِطِ وَجَعَلَ الرَّجُلُ يَجِيءُ بِالتَّمْرِ وَجَعَلَ الرَّجُلُ يَجِيءُ بِالسَّمْنِ فَحَاسُوا حَيْسًا ‏.‏ فَكَانَتْ وَلِيمَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
                "headingArabic": "فَضِيلَةِ إِعْتَاقِهِ أَمَتَهُ ثُمَّ يَتَزَوَّجُهَا ‏",
                "headingUrdu": "اپنی لونڈی کو آزاد کرنا، پھر اس سے شادی کرنا",
                "headingEnglish": "The virute of manumitting one's slave girl, then marrying her",
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11062,
                "hadithNumber": "3498",
                "englishNarrator": "This hadith has been narrated through another chain of transmitters on the authority of Anas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) emancipated Safiyya رضی اللہ عنہا, and her emancipation was treated as her wedding gift, and in the hadith transmitted by Mu'adh on the authority of his father (the words are): He (the Holy Prophet) married Safiyya رضی اللہ عنہا and bestowed her emancipation as her wedding gift.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے حضرت صفیہ رضی اللہ عنہا کو آزاد کیا اور ان کو آزادی کو ان کا مہر مقرر کیا ۔ معاذ کی اپنے والد ( ہشام ) سے روایت کردہ حدیث میں ہے : آپ صلی اللہ علیہ وسلم نے صفیہ رضی اللہ عنہا سے نکاح فرمایا اور ان کی آزادی ، ان کو مہر میں دی.",
                "urduNarrator": "مجھ سے ابو الربیع الزہرانی نے بیان کیا، انہوں نے ہم سے بیان کیا حماد ، یعنی ابن زید نے ثابت اور عبدالعزیز بن صہیب سے ، انہوں نے حضرت انس رضی اللہ عنہ سے ۔ حماد نے ثابت اور شعیب بن حَبحَاب سے ، انہوں نے حضرت انس رضی اللہ عنہ سے ۔ اسی طرح ابوعوانہ نے قتادہ اور عبدالعزیز سے ، انہوں نے حضرت انس رضی اللہ عنہ سے ۔ ابوعوانہ ( ہی ) نے ابوعثمان سے ، انہوں نے حضرت انس رضی اللہ عنہ سے ۔ معاذ بن ہشام نے اپنے والد سے ، انہوں نے شعیب بن حبحاب سے ، انہوں نے حضرت انس رضی اللہ عنہ سے اور اسی طرح یونس بن عبید نے شعیب بن حبحاب سے ، انہوں نے حضرت انس رضی اللہ عنہ سے اور ان سب نے ( کہا : انہوں نے )",
                "hadithArabic": "وحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، عَنْ ثَابِتٍ، وَعَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، ح وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، عَنْ ثَابِتٍ، وَشُعَيْبِ بْنِ حَبْحَابٍ، عَنْ أَنَسٍ، ح وحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، وَعَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي عُثْمَانَ، عَنْ أَنَسٍ، ح وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ شُعَيْبِ بْنِ الْحَبْحَابِ، عَنْ أَنَسٍ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، وَعُمَرُ بْنُ سَعْدٍ، وَعَبْدُ الرَّزَّاقِ، جَمِيعًا عَنْ سُفْيَانَ، عَنْ يُونُسَ بْنِ عُبَيْدٍ، عَنْ شُعَيْبِ بْنِ الْحَبْحَابِ، عَنْ أَنَسٍ، كُلُّهُمْ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، «أَنَّهُ أَعْتَقَ صَفِيَّةَ، وَجَعَلَ عِتْقَهَا صَدَاقَهَا»، وَفِي حَدِيثِ مُعَاذٍ، عَنْ أَبِيهِ تَزَوَّجَ صَفِيَّةَ وَأَصْدَقَهَا عِتْقَهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 11063,
                "hadithNumber": "3499",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said about one who emancipated a slave woman, and then married her, that for him there are two rewards.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اس شخص کے بارے میں ، جو اپنی لونڈی کو آزاد کرتا ہے ، پھر اس سے شادی کرتا ہے ، فرمایا : \" اس کے لیے دو اجر ہیں ۔ \" ( آزاد کرنے کا اجر اور اس کے بعد شادی کے ذریعے اسے عزت کا مقام دینے کا اجر.",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے خالد بن عبداللہ نے بیان کیا، انہوں نے مطرف کی سند سے، وہ عامر کے واسطہ سے، وہ ابو بردہ کے واسطہ سے, حضرت ابوموسیٰ رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنْ مُطَرِّفٍ، عَنْ عَامِرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الَّذِي يُعْتِقُ جَارِيَتَهُ، ثُمَّ يَتَزَوَّجُهَا: «لَهُ أَجْرَانِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-muslim",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 117,
                    "chapterNumber": "17",
                    "chapterEnglish": "The Book of Marriage",
                    "chapterUrdu": "نکاح کے احکام و مسائل",
                    "chapterArabic": "كتاب النِّكَاحِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10751,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=430",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=428",
                "label": "428",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=429",
                "label": "429",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=430",
                "label": "430",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=431",
                "label": "431",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=432",
                "label": "432",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=433",
                "label": "433",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=434",
                "label": "434",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=432",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=432",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=430",
        "to": 10775,
        "total": 40465
    }
}