{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 420,
        "data": [
            {
                "id": 10764,
                "hadithNumber": "3200",
                "englishNarrator": "Al-Qasim reported the Mother of the Faithful (Hadrat 'A'isha Siddiqa) (رضی اللہ تعالیٰ عنہا) as saying:",
                "hadithEnglish": "I used to weave these garlands from the multicoloured wool which was with us. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was in the state of non Muhrim among us, and he would do all that was lawful for a lion-Muhrim with his wife.",
                "hadithUrdu": "میں نے یہ ہار اس اون سے بٹے جو ہمارے پا س تھی اس کے بعد رسول اللہ صلی اللہ علیہ وسلم ہم میں غیر محرم ہی رہے آپ ( اپنی ازواج کے پاس ) آتے جیسے غیر محرم اپنی بیوی کے پاس آتا ہے یا آپ آتے جیسے ایک ( عام آدمی اپنی بیوی کے پا س آتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے حسین بن الحسن نے بیان کیا، ہمیں ابن عون نے قاسم سے حدیث بیان کی انھوں نے ام المومنین ( حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا حُسَيْنُ بْنُ الْحَسَنِ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ الْقَاسِمِ، عَنْ أُمِّ الْمُؤْمِنِينَ، قَالَتْ: «أَنَا فَتَلْتُ تِلْكَ الْقَلَائِدَ مِنْ عِهْنٍ كَانَ عِنْدَنَا، فَأَصْبَحَ فِينَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَلَالًا، يَأْتِي مَا يَأْتِي الْحَلَالُ مِنْ أَهْلِهِ، أَوْ يَأْتِي مَا يَأْتِي الرَّجُلُ مِنْ أَهْلِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10765,
                "hadithNumber": "3201",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "I recall how I wove garlands for the sacrificial animals (the goats) of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). He sent them and then stayed with us as a non-Muhrim.",
                "hadithUrdu": "میں نے خود دیکھا کہ میں رسول اللہ صلی اللہ علیہ وسلم کی ہدی ( قر بانی ) کے لیے بکریوں کے ہار بٹ رہی ہوں اس کے بعد آپ انھیں ( مکہ ) بھیجتے پھر ہمارے درمیان احرا م کے بغیر ہی رہتے ۔",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا، کہا ہم سے جریر نے بیان کیا, منصور نے ابرا ہیم سے انھوں نے اسود سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ: «لَقَدْ رَأَيْتُنِي أَفْتِلُ الْقَلَائِدَ لِهَدْيِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِنَ الْغَنَمِ، فَيَبْعَثُ بِهِ، ثُمَّ يُقِيمُ فِينَا حَلَالًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10766,
                "hadithNumber": "3202",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "I often wove garlands for the sacrificial animals of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and he garlanded his sacrificial animals, and then he sent them and stayed in the ouse) avoiding nothing which a Muhrim avoids.",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کی ہدی ( قربانی کے لیے بیت اللہ بھیجے جا نے والے جا نور ) کے لیے ہار تیار کرتی آپ وہ ( ہار ) ان جانوروں کو ڈالتے پھر انھیں ( مکہ ) بھیجتے پھر آپ ( مدینہ ہی میں ) ٹھہرتے آپ ان میں سے کسی چیز سے اجتناب نہ فر ما تے جن سے احرام باندھنے والا شخص اجتناب کرتا ہے ۔",
                "urduNarrator": "یحییٰ بن یحییٰ ابو بکر بن ابی شیبہ اور بو کریب میں یحییٰ نے کہا : ابو معاویہ نے ہمیں خبردی اور دوسرے دونوں نے کہا ہمیں حدیث بیان کی ، انھوں نے اعمش سے انھوں نے ابرا ہیم سے انھوں نے اسود سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں کہا : ایسا ہوا کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَ يَحْيَى: أَخْبَرَنَا، وقَالَ الْآخَرَانِ: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ: «رُبَّمَا فَتَلْتُ الْقَلَائِدَ لِهَدْيِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَيُقَلِّدُ هَدْيَهُ، ثُمَّ يَبْعَثُ بِهِ، ثُمَّ يُقِيمُ لَا يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُ الْمُحْرِمُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10767,
                "hadithNumber": "3203",
                "englishNarrator": "A'isha (رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent some goats as sacrificial animals to the House and He garlanded them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک بار بیت اللہ کی طرف ہدی ( قر بانی ) کی بکریاں بھیجیں تو آپ نے انھیں ہار ڈالے ۔",
                "urduNarrator": "یحییٰ بن یحییٰ ابو بکر بن ابی شیبہ اور ابو کریب نے باقی ماندہ اسی سند کے ساتھ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَ يَحْيَى: أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ: «أَهْدَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مَرَّةً إِلَى الْبَيْتِ غَنَمًا، فَقَلَّدَهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10768,
                "hadithNumber": "3204",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "We used to garland the goats and send them (to Mecca), and Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) stayed back in Medina as a non-Muhrim ard nothing was forbidden for him (which is forbidden for a Muhrim).",
                "hadithUrdu": "ہم بکریوں کو ہار پہناتے پھر انھیں ( بیت اللہ کی طرف ) بھیجتے اور رسول اللہ صلی اللہ علیہ وسلم غیر محرم رہتے اس سے کوئی چیز ( جو پہلے آپ پر حلا ل تھی ) حرام نہ ہو تی تھی ۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے عبدالصمد نے بیان کیا، کہا کہ مجھ سے میرے والد نے بیان کیا، مجھ سے محمد بن جحاد ہ نے بیان کیا, حکم نے ابرا ہیم سے انھوں نے اسود سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنِي أَبِي، حَدَّثَنِي مُحَمَّدُ بْنُ جُحَادَةَ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ: «كُنَّا نُقَلِّدُ الشَّاءَ، فَنُرْسِلُ بِهَا وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَلَالٌ، لَمْ يَحْرُمْ عَلَيْهِ مِنْهُ شَيْءٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10769,
                "hadithNumber": "3205",
                "englishNarrator": "Amra daughter of Abdul-Rahman رضی اللہ تعالیٰ عنہا reported:",
                "hadithEnglish": "Ibn Ziyad had written to 'A'isha (رضی اللہ تعالیٰ عنہا) that 'Abdullah bin Abbas ( رضی اللہ تعالیٰ عنہ) bad said that he who sent a sacrificial animal (to Mecca) for him was forbidden what is forbidden for a pilgrim (in the state of Ihram) until the animal is sacrificed I have myself sent my sacrificial animal (to Mecca), so write to me your opinion. Amra reported 'A'isha (رضی اللہ تعالیٰ عنہا) as saying: It is not as Ibn 'Abbas ( رضی اللہ تعالیٰ عنہا) had asserted, for I wove the garlands for the sacrificial animals of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with my own hands. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) then garlanded them with his own hands, and then sent them with my father, and nothing was forbidden for Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) which had been made lawful for him by Allah until the animals were sacrificed.",
                "hadithUrdu": "ابن زیاد نے حضرت عائشہ رضی اللہ تعالیٰ عنہا کو لکھا کہ حضرت عبد اللہ بن عباس رضی اللہ تعالیٰ عنہ نے کہا ہے جس نے ہدی ( بیت اللہ کے لیے قربانی ) بھیجی اس پر وہ سب کچھ حرا م ہو جا ئے گا جو حج کرنے والے کے لیے حرا م ہو تا ہے یہاں تک کہ ہدی کو ذبح کر دیا جا ئے ۔ اور میں نے اپنی ہدی بھیجی ہے تو مجھے ( اس بارے میں ) اپنا حکم لکھ بھیجیے عمرہ نے کہا حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : ( بات ) اس طرح نہیں جیسے ابن عباس رضی اللہ تعالیٰ عنہ نے کہا ہے میں نے خود اپنے ہاتھوں سے رسول اللہ صلی اللہ علیہ وسلم کی قر بانیوں کے ہار بٹے پھر رسول اللہ صلی اللہ علیہ وسلم نے اپنے ہاتھ سے وہ ( ہار ) انھیں پہنائے پھر انھیں میرے والد کے ساتھ ( مکہ ) بھیجا اس کے بعد ہدی نحر ( قر بان ) ہو نے تک رسول اللہ صلی اللہ علیہ وسلم پر ( ایسی ) کو ئی چیز حرا م نہ ہو ئی جو اللہ نے آپ کے لیے حلا ل کی تھی ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے عبداللہ بن ابی بکر رضی اللہ عنہ کی روایت سے مالک کو پڑھا, عمرہ بنت عبد الرحمن رضی اللہ تعالیٰ عنہا نے خبردی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي بَكْرٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّهَا أَخْبَرَتْهُ أَنَّ ابْنَ زِيَادٍ كَتَبَ إِلَى عَائِشَةَ، أَنَّ عَبْدَ اللهِ بْنَ عَبَّاسٍ، قَالَ: مَنْ أَهْدَى هَدْيًا حَرُمَ عَلَيْهِ مَا يَحْرُمُ عَلَى الْحَاجِّ، حَتَّى يُنْحَرَ الْهَدْيُ، وَقَدْ بَعَثْتُ بِهَدْيِي، فَاكْتُبِي إِلَيَّ بِأَمْرِكِ، قَالَتْ عَمْرَةُ: قَالَتْ عَائِشَةُ لَيْسَ كَمَا قَالَ ابْنُ عَبَّاسٍ: «أَنَا فَتَلْتُ قَلَائِدَ هَدْيِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِيَدَيَّ، ثُمَّ قَلَّدَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ، ثُمَّ بَعَثَ بِهَا مَعَ أَبِي، فَلَمْ يَحْرُمْ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ أَحَلَّهُ اللهُ لَهُ، حَتَّى نُحِرَ الْهَدْيُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10770,
                "hadithNumber": "3206",
                "englishNarrator": "Masruq reported:",
                "hadithEnglish": "I heard 'A'isha (رضی اللہ تعالیٰ عنہا) clapping her hands behind the curtain and saying: I used to weave garlands for the sacrificial animals of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) with my own hands, and then he (the Holy Prophet) sent them (to Mecca), and he did not avoid doing anything which a Muhritn avoids until his animal was sacrificed.",
                "hadithUrdu": "میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے سنا وہ پردے کی اوٹ سے ہاتھ پر ہا تھ مار رہی تھیں اور کہہ رہی تھیں میں اپنے ہاتھوں سے رسول اللہ صلی اللہ علیہ وسلم کی قر با نیوں کے ہار بٹا کرتی تھی ، پھر آپ انھیں ( مکہ ) بھیجتے اور ہدی کو ذبح کرنے ( کے وقت ) تک آپ ان میں سے کسی چیز سے بھی اجتناب نہ فر ما تے جس سے احرام والا شخص اجتناب کرتا ہے",
                "urduNarrator": "ہم سے سعید بن منصور نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا, اسما عیل بن ابی خالد نے ہمیں خبردی انھوں نے شعبی سے اور انھوں نے مسروق سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، قَالَ: سَمِعْتُ عَائِشَةَ، وَهِيَ مِنْ وَرَاءِ الْحِجَابِ تُصَفِّقُ، وَتَقُولُ: «كُنْتُ أَفْتِلُ قَلَائِدَ هَدْيِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِيَدَيَّ، ثُمَّ يَبْعَثُ بِهَا وَمَا يُمْسِكُ عَنْ شَيْءٍ، مِمَّا يُمْسِكُ عَنْهُ الْمُحْرِمُ، حَتَّى يُنْحَرَ هَدْيُهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10771,
                "hadithNumber": "3207",
                "englishNarrator": null,
                "hadithEnglish": "A hadith like this has been narrated on the authority of 'A'isha ( رضی اللہ تعالیٰ عنہا) through another chain of transmitters.",
                "hadithUrdu": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے عبدالوہاب نے بیان کیا، داوداور زکریا دونوں نے شعبی سے حدیث بیان کی انھوں نے مسروق سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے اور انھوں نے اسی سند ( حدیث ) کے مطا بق نبی صلی اللہ علیہ وسلم سے روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا دَاوُدُ، ح وحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا زَكَرِيَّاءُ، كِلَاهُمَا عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ بِمِثْلِهِ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10772,
                "hadithNumber": "3208",
                "englishNarrator": "Abu Huraira (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) saw a person who was driving a sacrificial camel (and told him to ride on it. Thereupon he said: Messenger of Allah, it is a sacrificial camel. He told him again to ride on it; (when he received the same reply) he said: Woe to you, (he uttered these words on the second or the third reply).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی کو دیکھا وہ قربانی کا اونٹ ہانک رہا ہے تو آپ نے فر ما یا : \" اس پر سوار ہو جا ؤ اس نے کہا : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! یہ قر بانی کا اونٹ ہے آپ نے فر ما یا : \" تمھا ری ہلا کت !اس پر سوار ہو جاؤ ۔ دوسری یا تیسری مرتبہ ( یہ الفاظ کہے ).",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا امام مالک نے ابو زناد سے انھوں نے اعرج سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَسُوقُ بَدَنَةً، فَقَالَ: «ارْكَبْهَا»، قَالَ: يَا رَسُولَ اللهِ، إِنَّهَا بَدَنَةٌ، فَقَالَ: «ارْكَبْهَا، وَيْلَكَ» فِي الثَّانِيَةِ أَوْ فِي الثَّالِثَةِ.",
                "headingArabic": "جَوَازِ رُكُوبِ الْبَدَنَةِ الْمُهْدَاةِ لِمَنِ احْتَاجَ إِلَيْهَا ‏‏",
                "headingUrdu": "اگر ضروری ہو تو قربانی کے جانور کی سواری جائز ہے۔",
                "headingEnglish": "It is permissible to ride the sacrificial animal if necessary",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10773,
                "hadithNumber": "3209",
                "englishNarrator": "This hadith has been narrated by A'raj with the same chain of transmitters (and the words are):",
                "hadithEnglish": "Whereas the person was driving a sacrificial camel which was garlanded.",
                "hadithUrdu": "ایک آدمی ہار ڈالے گئے اونٹ کو ہانک رہاتھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, مغیرہ بن عبد الرحمٰن حزامی نے ابو زناد سے اور انھوں نے اعرج سے اسی سند کے ساتھ روایت کی اور کہا اس اثنا میں کہ",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ الْحِزَامِيُّ، عَنْ أَبِي الزِّنَادِ، عَنِ الْأَعْرَجِ، بِهَذَا الْإِسْنَادِ، وَقَالَ: بَيْنَمَا رَجُلٌ يَسُوقُ بَدَنَةً مُقَلَّدَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10774,
                "hadithNumber": "3210",
                "englishNarrator": "Hammam bin Munabbih reported:",
                "hadithEnglish": "It is one out of these (narrations) that Abu Huraira (رضی اللہ تعالیٰ عنہ) narrated to us from Muhammad the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), and he narrated to us traditions out of which is that he said: When there was a person who was driving a garlanded sacrificial camel, Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: Woe to you; ride on it. He said: Messenger of Allah, it is a sacrificial animal, whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Woe to you, ride on it; woe to you, ride on it.",
                "hadithUrdu": "یہ احا دیث ہیں جو ہمیں حضرت ابو ہر یرہ رضی اللہ تعالیٰ عنہ نے محمد رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، پھر انھوں نے چند احادیث ذکر کیں ان میں سے ایک یہ ہے اور کہا اس اثنا میں کہ ایک شخص ہار والے قربانی کے اونٹ کو ہانک رہاتھا رسول اللہ صلی اللہ علیہ وسلم نے اس سے فر ما یا : \" تمھا ری ہلا کت ! اس پر سوار ہو جا ؤ ۔ اس نے کہا اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !یہ قر بانی کا اونٹ ہے آپ نے فر ما یا : \" تمھاری ہلاکت ! اس پر سوار ہو جاؤ ۔ تمھاری ہلا کت ! اس پر سوار ہو جاؤ ۔",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم سے معمر نے بیان کیا, ہمام بن منبہ سے روایت ہے انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ مُحَمَّدٍ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ: بَيْنَمَا رَجُلٌ يَسُوقُ بَدَنَةً مُقَلَّدَةً قَالَ لَهُ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «وَيْلَكَ، ارْكَبْهَا» فَقَالَ: بَدَنَةٌ يَا رَسُولَ اللهِ، قَالَ: «وَيْلَكَ، ارْكَبْهَا، وَيْلَكَ، ارْكَبْهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10775,
                "hadithNumber": "3211",
                "englishNarrator": "Anas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Allah's Messenger (صلی ‌اللہ ‌علیہ ‌وسلم ) happened to pass by a person who was driving a sacrificial camel, whereupon he (the Holy Prophet) said: Ride on It. He said: It is a sacrificial camel. Thereupon he (the Holy Prophet) said twice or thrice: Ride on it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ایک آدمی کے پاس سے گزرے جو قربانی کا اونٹ ہانک کر لے جا رہا تھا تو آپ نے فر ما یا : \" اس پر سوار ہو جاؤ ۔ اس نے جواب دیا یہ قر بانی کا اونٹ ہے آپ صلی اللہ علیہ وسلم نے فر ما یا : اس پر سوار ہو جا ؤ ۔ دویا تین مرتبہ ( فر ما یا )",
                "urduNarrator": "مجھ سے عمرو ناقد اور سریج بن یونس نے بیان کیا، کہا کہ ہم سے ہشیم نے بیان کیا، ہم سے حمید نے بیان کیا, ثابت بنا نی نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "وحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَسُرَيْجُ بْنُ يُونُسَ، قَالَا: حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا حُمَيْدٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ: وَأَظُنُّنِي قَدْ سَمِعْتُهُ مِنْ أَنَسٍ، ح وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا هُشَيْمٌ، عَنْ حُمَيْدٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسٍ، قَالَ: مَرَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ يَسُوقُ بَدَنَةً فَقَالَ: «ارْكَبْهَا» فَقَالَ: إِنَّهَا بَدَنَةٌ، قَالَ: «ارْكَبْهَا» مَرَّتَيْنِ أَوْ ثَلَاثًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10776,
                "hadithNumber": "3212",
                "englishNarrator": "Anas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "Someone happened to pass by Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with a sacrificial camel, or a sacrificial animal, whereupon he said: Ride on it. He said: It is a sacrificial camel, or animal, whereupon he said: (Ride) even if (it is a sacrificial camel).",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کے پاس سے قر با نی کے ایک اونٹ یا ( حرم کے لیے ) ہدیہ کیے جا نے والے ایک جا نور کا گزر ہوا تو آپ صلی اللہ علیہ وسلم نے فر ما یا : \" اس پر سوار ہو جا ؤ اس نے کہا : یہ قر بانی کا اونٹ یا ہدی کا جا نور ہے آپ نے فر ما یا : \" چا ہے ( ایسا ہی ہے ) \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، انہوں نے کہا ہمیں وکیع نے مسعر سے حدیث بیان کی انھوں نے بکیر بن اخنس سے اور انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا میں نے ان ( انس رضی اللہ تعالیٰ عنہ ) سے سنا کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ، عَنْ أَنَسٍ، قَالَ: سَمِعْتُهُ يَقُولُ: مُرَّ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِبَدَنَةٍ أَوْ هَدِيَّةٍ، فَقَالَ: «ارْكَبْهَا» قَالَ: إِنَّهَا بَدَنَةٌ أَوْ هَدِيَّةٌ، فَقَالَ: «وَإِنْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10777,
                "hadithNumber": "3213",
                "englishNarrator": "Anas ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "There happened to pass (a person) with a sacrificial camel by Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and the rest of the hadith is the same.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کے پاس سے قر با نی کا ایک اونٹ گزارا گیا آگے اسی کے مانند بیان کیا ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا، انہوں نے کہا ہمیں ابن بشر نے مسعر سے حدیث بیان کی ، ( کہا ) مجھے بکیر بن اخنس نے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت انس رضی اللہ تعالیٰ عنہ سے سنا وہ کہہ رہے تھے",
                "hadithArabic": "وحَدَّثَنَاه أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ بِشْرٍ، عَنْ مِسْعَرٍ، حَدَّثَنِي بُكَيْرُ بْنُ الْأَخْنَسِ، قَالَ: سَمِعْتُ أَنَسًا، يَقُولُ: مُرَّ عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِبَدَنَةٍ فَذَكَرَ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10778,
                "hadithNumber": "3214",
                "englishNarrator": "Jabir bin 'Abdullah ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "He was asked about riding on a sacrificial animal, and he said: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Ride on it gently, when you have need for it, until you find (another) mount.",
                "hadithUrdu": "ان سے ہدی پر سواری کرنے کے بارے میں پوچھا گیا تو انھوں نے کہا میں نے نبی صلی اللہ علیہ وسلم سے سنا فر ما رہے تھے \" جب اس ( پر سوار ہو نے ) کی ضرورت ہو تو اور سواری ملنے تک معروف ( قابل قبول ) طریقے سے اس پر سواری کرو ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا, ابن جریج سے روایت ہے ( انھوں نے کہا ) مجھے زبیر نے خبر دی کہا میں نے جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے سنا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، قَالَ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ، سُئِلَ عَنْ رُكُوبِ الْهَدْيِ، فَقَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: «ارْكَبْهَا بِالْمَعْرُوفِ، إِذَا أُلْجِئْتَ إِلَيْهَا حَتَّى تَجِدَ ظَهْرًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10779,
                "hadithNumber": "3215",
                "englishNarrator": "Abu Zubair reported:",
                "hadithEnglish": "I asked Jabir (رضی اللہ تعالیٰ عنہ) about riding on the sacrificial animal, to which he replied: I heard Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Ride on them gently until you find another mount.",
                "hadithUrdu": "میں نے حضرت جا بر رضی اللہ تعالیٰ عنہ سے ہدی ( بیت اللہ کی طرف بھیجے گئے ہدیہ قر بانی ) پر سواری کے بارے میں پو چھا تو انھوں نے کہا : میں نے نبی صلی اللہ علیہ وسلم کو فر ما تے ہو ئے سنا : \" دوسری سواری ملنے تک اس پر معروف طریقے سے سوار ہو جاؤ.",
                "urduNarrator": "مجھ سے سلمہ بن شبیب نے بیان کیا، کہا ہم سے حسن بن عیان نے بیان کیا، انہوں نے بیان کیا ہمیں معقل نے ابو زبیر سے حدیث بیان کی کہا",
                "hadithArabic": "وحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، قَالَ: سَأَلْتُ جَابِرًا، عَنْ رُكُوبِ الْهَدْيِ، فَقَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «ارْكَبْهَا بِالْمَعْرُوفِ، حَتَّى تَجِدَ ظَهْرًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10780,
                "hadithNumber": "3216",
                "englishNarrator": "Musa bin Salama al-Hudhali reported:",
                "hadithEnglish": "I and Sinan bin Salama proceeded (to Mecca to perform Umra. Sinan had a sacrificial camel with him which he was driving. The camel stopped in the way being completely exhausted and this state of it made him (Sinan) helpless. (He thought) if it stops proceeding further how he would be able to take it, along with him and said: I would definitely find out (the religious verdict) about it. I moved on in the morning and as we encamped at al-Batha', (Sinan) said: Come (along with me) to Ibn 'Abbas ( رضی اللہ تعالیٰ عنہ) so that we should narrate to him (this incident), and he (Sinan) reported to him the incident of the sacrificial camel. He (Ibn Abbas) said: You have referred (the matter) to the well informed person. (Now listen) Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) sent sixteen sacrificial camels with a man whom he put in change of them. He set out and came back and said: Messenger of Allah, what should I do with those who are completely exhausted and become powerless to move on, whereupon he said: Slaughter them, and dye their hoofs in their blood, and put them on the sides of their humps, but neither you nor anyone among those who are with you must eat any part of them.",
                "hadithUrdu": "میں اور سنان بن سلمہ عمرہ ادا کرنے کے لیے نکلے اور سنان اپنے ساتھ قر بانی کا اونٹ لے کر چلے وہ اسے ہانک رہے تھے تو راستے ہی میں تھک کر رک گیا وہ اس کی حالت کے سبب سے ( یہ سمجھنے سے ) عاجز آگئے کہ اگر وہ بالکل ہی رہ گیا تو اسے مکہ ) کیسے لا ئیں ۔ انھوں نے کہا : اگر میں بلد ( امین مکہ ) پہنچ گیا تو میں ہر صورت اس کے بارے میں اچھی طرح پو چھوں گا ۔ ( موسیٰ نے ) کہا تو مجھے دن چڑھ گیا جب ہم نے بطحاء میں قیام کیا تو انھوں نے کہا بن عباس رضی اللہ تعالیٰ عنہ کے پاس چلیں تا کہ ہم ان سے بات کریں ۔ کہا انھوں نے ان کو اپنی قر بانی کے جانور کا حال بتا یا تو انھوں نے کہا تم جاننے والے کے پاس آپہنچے ہو ۔ رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی کے ساتھ بیت اللہ کے پا س قر بانی کے لیے سولہ اونٹ روانہ کیے اور اسے ان کا نگران بنا یا ۔ کہا وہ تھوڑی دور ) گیا پھر واپس آیا اور کہنے لگا اے اللہ کے رسول صلی اللہ علیہ وسلم !ان میں سے کو ئی تھک کر رک جا ئے اس کے ساتھ میں کیا کروں ؟آپ نے فر مایا : \" اسے نحر کر دینا پھر اس کے ( گلے میں ڈالے گئے ) دونوں جوتے اس کے خون سے رنگ دینا پھر انھیں ( بطور نشانی ) اس کے پہلو پر رکھ دینا ۔ اور ( احرام کی حالت میں ) تم اور تمھا رے ساتھ جا نے والوں میں سے کو ئی اس ( کے گو شت میں ) سے کچھ نہ کھا ئے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے بیان کیا ہمیں عبد الوارث بن سعید نے ابو تیاح ضبعی سے خبر دی ( کہا ) مجھ سے موسیٰ بن سلمہ ہذلی نے حدیث بیان کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ أَبِي التَّيَّاحِ الضُّبَعِيِّ، حَدَّثَنِي مُوسَى بْنُ سَلَمَةَ الْهُذَلِيُّ، قَالَ: انْطَلَقْتُ أَنَا وَسِنَانُ بْنُ سَلَمَةَ، مُعْتَمِرَيْنِ قَالَ: وَانْطَلَقَ سِنَانٌ مَعَهُ بِبَدَنَةٍ يَسُوقُهَا، فَأَزْحَفَتْ عَلَيْهِ بِالطَّرِيقِ، فَعَيِيَ بِشَأْنِهَا إِنْ هِيَ أُبْدِعَتْ كَيْفَ، يَأْتِي بِهَا فَقَالَ: لَئِنْ قَدِمْتُ الْبَلَدَ لَأَسْتَحْفِيَنَّ عَنْ ذَلِكَ، قَالَ: فَأَضْحَيْتُ، فَلَمَّا نَزَلْنَا الْبَطْحَاءَ، قَالَ: انْطَلِقْ إِلَى ابْنِ عَبَّاسٍ نَتَحَدَّثْ إِلَيْهِ، قَالَ: فَذَكَرَ لَهُ شَأْنَ بَدَنَتِهِ فَقَالَ: عَلَى الْخَبِيرِ سَقَطْتَ بَعَثَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِسِتَّ عَشْرَةَ بَدَنَةً مَعَ رَجُلٍ وَأَمَّرَهُ فِيهَا، قَالَ: فَمَضَى ثُمَّ رَجَعَ، فَقَالَ: يَا رَسُولَ اللهِ، كَيْفَ أَصْنَعُ بِمَا أُبْدِعَ عَلَيَّ مِنْهَا، قَالَ: «انْحَرْهَا، ثُمَّ اصْبُغْ نَعْلَيْهَا فِي دَمِهَا، ثُمَّ اجْعَلْهُ عَلَى صَفْحَتِهَا، وَلَا تَأْكُلْ مِنْهَا أَنْتَ وَلَا أَحَدٌ مِنْ أَهْلِ رُفْقَتِكَ».",
                "headingArabic": "مَا يُفْعَلُ بِالْهَدْىِ إِذَا عَطِبَ فِي الطَّرِيقِ ‏‏",
                "headingUrdu": "قربانی کا جانور راستے میں زخمی ہو جائے تو اس کا کیا کیا جائے؟",
                "headingEnglish": "What should be done with the sacrificial animal if it gets injured on the way?",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10781,
                "hadithNumber": "3217",
                "englishNarrator": "Ibn Abbas (رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent eighteen sacrificial camels with a person. The rest of the hadith is the same, and the first part (of the above-mentioned hadith) is not mentioned.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے قر بانی کے اٹھارہ اونٹ ایک آدمی کے ساتھ روانہ کیے ۔ ۔ ۔ پھر عبد الوارث کی حدیث کے مانند حدیث بیان کی ، اور انھوں نے حدیث کا ابتدا ئی حصہ بیان نہیں کیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ، ابوبکر بن ابی شیبہ اور علی بن حجر نے بیان کیا، کہا: ہم سے انہوں نے بیان کیا اور باقی دو نے کہا: ہم سے بیان کیا اسماعیل بن علیہ نے ابو تیاح سے حدیث بیان کی انھوں نے موسیٰ بن سلمہ سے اور انھوں نے ابن عبا س رضی اللہ تعالیٰ عنہ سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَاه يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ حُجْرٍ، قَالَ يَحْيَى: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ أَبِي التَّيَّاحِ، عَنْ مُوسَى بْنِ سَلَمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعَثَ بِثَمَانَ عَشْرَةَ بَدَنَةً مَعَ رَجُلٍ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ عَبْدِ الْوَارِثِ وَلَمْ يَذْكُرْ أَوَّلَ الْحَدِيثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10782,
                "hadithNumber": "3218",
                "englishNarrator": "Dhuwaib, father of Qabisa ( رضی اللہ عنہ) narrated to him:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent under his charge the sacrificial camels, and said: If any of these is completely exhausted and you apprehend its death, then slaughter it, then dip its hoofs in its blood and imprint it on its hump; but neither you nor any one of your comrades should eat it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ان کے ساتھ قر بانی کے اونٹ بھیجتے پھر فر ما تے اگر ان میں سے کو ئی تھک کر رک جا ئے اور تمھیں اس کے مر جا نے کا خدشہ ہو تو اسے نحر کر دینا پھر اس کے ( گلے میں لٹکا ئے گئے ) جوتے کو اس کے خون میں ڈبونا پھر اسے اس کے پہلو پر ڈال دینا پھر تم اس میں سے ( کچھ ) کھا نا نہ تمھا رے ساتھیوں میں سے کو ئی ( اس میں کھا ئے ۔ )",
                "urduNarrator": "مجھ سے ابو غسان المسماعی نے بیان کیا، ہم سے عبد الاعلٰی نے بیان کیا، ہم سے سعید نے، قتادہ کی سند سے، سنان بن سلمہ سے، ابن عباس رضی اللہ عنہما سے بیان کیا کہ ایک بھیڑیا , ابو قبیصہ ذؤیب نے حدیث بیان کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا عَبْدُ الْأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ سِنَانِ بْنِ سَلَمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ ذُؤَيْبًا أَبَا قَبِيصَةَ، حَدَّثَهُ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَبْعَثُ مَعَهُ بِالْبُدْنِ ثُمَّ يَقُولُ: «إِنْ عَطِبَ مِنْهَا شَيْءٌ، فَخَشِيتَ عَلَيْهِ مَوْتًا فَانْحَرْهَا، ثُمَّ اغْمِسْ نَعْلَهَا فِي دَمِهَا، ثُمَّ اضْرِبْ بِهِ صَفْحَتَهَا، وَلَا تَطْعَمْهَا أَنْتَ وَلَا أَحَدٌ مِنْ أَهْلِ رُفْقَتِكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10783,
                "hadithNumber": "3219",
                "englishNarrator": "Ibn 'Abbas ( رضی اللہ تعالیٰ عنہ) reported:",
                "hadithEnglish": "The people used to return through every path, whereupon Allah's Messenger (way peace be upon him) said: None amongst you should depart until he performs the last circumambulation round the House. Zuhair said (the words are): [ARABIC: YANSWARIFUWN KULLA WAJH] and the word [arabic: FIY] was not mentioned.",
                "hadithUrdu": "لوگ ( حج کے بعد ) ہر سمت میں نکل ( کر چلے ) جا تے تھے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" کو ئی بھی شخص ہر گز روانہ ہو یہاں تک کہ اس کی آخری حاضری ( بطور طواف ) بیت اللہ کی ہو زہیر نے کہا : ہر سمت \" اور \" ( ہر سمت ) میں نہیں کہا ۔",
                "urduNarrator": "سعید بن منصور اور زہیر بن حرب نے ہمیں حدیث بیان کی دونوں نے کہا : ہمیں سفیان نے سلیما ن احول سے حدیث بیان کی انھوں نے طا ؤس سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنْ سُلَيْمَانَ الْأَحْوَلِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: كَانَ النَّاسُ يَنْصَرِفُونَ فِي كُلِّ وَجْهٍ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا يَنْفِرَنَّ أَحَدٌ حَتَّى يَكُونَ آخِرُ عَهْدِهِ بِالْبَيْتِ»، قَالَ زُهَيْرٌ: يَنْصَرِفُونَ كُلَّ وَجْهٍ، وَلَمْ يَقُلْ: فِي.",
                "headingArabic": "وُجُوبِ طَوَافِ الْوَدَاعِ وَسُقُوطِهِ عَنِ الْحَائِضِ",
                "headingUrdu": "طواف وداع واجب ہے لیکن حیض والی عورتوں کی صورت میں ساقط ہے۔",
                "headingEnglish": "The farewell Tawaf is obligatory, but it is waived in the case of menstruating women",
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10784,
                "hadithNumber": "3220",
                "englishNarrator": "Ibn Abbas رضی اللہ تعالیٰ عنہ reported:",
                "hadithEnglish": "The people were commanded (by the Holy Prophet) to perform the last circumambulation round the House, but menstruating women were exempted.",
                "hadithUrdu": "لوگوں کو حکم دیا گیا کہ ان کی آخری حاضر ی بیت اللہ کی ہو مگر اس میں حائضہ عورت کے لیے تخفیف کی گئی ہے ( وہآخری طواف سے مستثنیٰ ہے )",
                "urduNarrator": "ہم سے سعید بن منصور اور ابوبکر بن ابی شیبہ نے بیان کیا، اور سعید کا قول ہے کہ ہم سے سفیان نے بیان کیا، طاؤس کے بیٹے ( عبد اللہ ) نے اپنے والد سے انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَاللَّفْظُ لِسَعِيدٍ، قَالَا: حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: «أُمِرَ النَّاسُ أَنْ يَكُونَ آخِرُ عَهْدِهِمْ بِالْبَيْتِ، إِلَّا أَنَّهُ خُفِّفَ عَنِ الْمَرْأَةِ الْحَائِضِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10785,
                "hadithNumber": "3221",
                "englishNarrator": "Tawus reported:",
                "hadithEnglish": "I was in the company of Ibn Abbas ( رضی اللہ تعالیٰ عنہ) when Zaid bin Thabit رضی اللہ تعالیٰ عنہ said: Do you give religious verdict that the woman who is in menses is allowed to go without performing the last circumambulation of the House? Ibn 'Abbas (رضی اللہ تعالیٰ عنہ) said to him: Ask such and such رضی اللہ تعالیٰ عنہ woman of the Ansar, if you do not (believe my religious verdict) whether Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had commanded her this. Zaid b Thabit (went to that lady and after getting this verdict attested by her) came back to Ibn Abbas ( رضی اللہ تعالیٰ عنہ) smilingly and said: I did not find you but telling the truth.",
                "hadithUrdu": "میں حضرت ابن عبا س رضی اللہ تعالیٰ عنہ کے ساتھ تھا کہ زید بن ثابت رضی اللہ تعالیٰ عنہ نے کہا : آپ فتویٰ دیتے ہیں کہ حائضہ عورت آخری وقت میں بیت اللہ کی حاضری ( طواف ) سے پہلے ( اس کے بغیر ) لو ٹ سکتی ہے ؟ تو حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے ان سے کہا : اگر ( آپ کو یقین ) نہیں تو فلاں انصار یہ سے پو چھ لیں کیا رسول صلی اللہ علیہ وسلم نے انھیں اس بات کا حکم دیا تھا ؟ کہا : اس کے بعد زید بن ثابت رضی اللہ تعالیٰ عنہ واپس آئے وہ ہنس رہے تھے اور کہہ رہے تھے میں سمجھتا ہوں کہ آپ نے سچ ہی کہا ہے ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، کہا ہم سے یحییٰ بن سعید نے بیان کیا، انہوں نے ابن جریج کی سند سے بیان کیا, حسن بن مسلم نے طاؤس سے خبر دی انھوں نے کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ، عَنْ طَاوُسٍ. قَالَ: كُنْتُ مَعَ ابْنِ عَبَّاسٍ إِذْ قَالَ زَيْدُ بْنُ ثَابِتٍ: «تُفْتِي أَنْ تَصْدُرَ الْحَائِضُ، قَبْلَ أَنْ يَكُونَ آخِرُ عَهْدِهَا بِالْبَيْتِ»، فَقَالَ لَهُ ابْنُ عَبَّاسٍ: إِمَّا لَا، فَسَلْ فُلَانَةَ الْأَنْصَارِيَّةَ، هَلْ أَمَرَهَا بِذَلِكَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: فَرَجَعَ زَيْدُ بْنُ ثَابِتٍ إِلَى ابْنِ عَبَّاسٍ يَضْحَكُ وَهُوَ يَقُولُ: مَا أَرَاكَ إِلَّا قَدْ صَدَقْتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10786,
                "hadithNumber": "3222",
                "englishNarrator": "A'isha ( رضی اللہ تعالیٰ عنہا) reported:",
                "hadithEnglish": "Safiyyah bint Huyayy رضی اللہ تعالیٰ عنہا entered the period of menses after performing Tawaf Ifada. I made a mention of her menses to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), whereupon Allah's. Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) remarked: Well, then she will detain us. I said: Messenger of Allah. she has performed Tawif Ifada and circumambulated the House, and it was after this that she entered the period of menses. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: (If it is so), then proceed forth.",
                "hadithUrdu": "صفیہ بنت حیی رضی اللہ تعالیٰ عنہا طواف افاضہ کرنے کے بعد حائضہ ہو گئیں حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کے سامنے ان کے حیض کا تذکرہ کیا تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" کیا وہ ہمیں ( واپسی سے ) روکنے والی ہیں ؟ ( عائشہ رضی اللہ تعالیٰ عنہا نے کہا : میں نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم ! وہ ( طواف افاضہ کے لیے ) گئی تھیں اور بیت اللہ کا طواف کیا تھا پھر ( طواف ) افاضہ کرنے کے بعد حائضہ ہو ئی ہیں تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تو ( پھر ہمارے ساتھ ہی ) کو چ کریں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا,  ہمیں لیث نے ابن شہاب سے حدیث بیان کی ، انھوں نے ابو سلمہ اور عروہ سے روایت کی کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْح، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَعُرْوَةَ، أَنَّ عَائِشَةَ قَالَتْ: حَاضَتْ صَفِيَّةُ بِنْتُ حُيَيٍّ بَعْدَ مَا أَفَاضَتْ، قَالَتْ عَائِشَةُ: فَذَكَرْتُ حِيضَتَهَا لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «أَحَابِسَتُنَا هِيَ؟» قَالَتْ: فَقُلْتُ: يَا رَسُولَ اللهِ، إِنَّهَا قَدْ كَانَتْ أَفَاضَتْ وَطَافَتْ بِالْبَيْتِ، ثُمَّ حَاضَتْ بَعْدَ الْإِفَاضَةِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «فَلْتَنْفِرْ»،",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10787,
                "hadithNumber": "3223",
                "englishNarrator": "This hadith is narrated (from 'A'isha رضی اللہ تعالیٰ عنہا ) on the authority of Ibn Shihab with the same chain of transmitters (and the words are):",
                "hadithEnglish": "Safiyyah bint Huyayy رضی اللہ تعالیٰ عنہا , the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), entered the period of menses at the occasion of the Farewell Pilgrimage after she had performed Tawaf Ifada in the state of cleanliness; the rest of the hadith is the same.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم کی زوجہ صفیہ بنت حیی رضی اللہ تعالیٰ عنہا حجۃالوداع کے موقع پر طہارت کی حالت میں طواف افاضہ کر لینے کے بعد حائضہ ہو گئیں ۔ ۔ ۔ آگے لیث کی حدیث کے مانند ہے ۔",
                "urduNarrator": "مجھ سے ابو الطاہر، حرملہ بن یحییٰ اور احمد بن عیسی نے بیان کیا، احمد نے کہا: ہم سے انہوں نے بیان کیا، اور باقی دو نے کہا: ہم سے ابن وہب نے بیان کیا۔ بتاؤ یونس نے ابن شہاب سے اسی سند کے ساتھ خبردی ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، وَأَحْمَدُ بْنُ عِيسَى، قَالَ أَحْمَدُ: حَدَّثَنَا، وَقَالَ الْآخَرَانِ: أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الْإِسْنَادِ. قَالَتْ: طَمِثَتْ صَفِيَّةُ بِنْتُ حُيَيٍّ، زَوْجُ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فِي حَجَّةِ الْوَدَاعِ بَعْدَمَا أَفَاضَتْ طَاهِرًا، بِمِثْلِ حَدِيثِ اللَّيْثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 10788,
                "hadithNumber": "3224",
                "englishNarrator": "Abdul-Rahman bin al Qasim narrated on the authority of 'A'isha (رضی اللہ تعالیٰ عنہا):",
                "hadithEnglish": "She made a mention to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that Safiyyah رضی اللہ تعالیٰ عنہا had entered the period of menses. The rest of the hadith is the same.",
                "hadithUrdu": "انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے سامنے ذکر کیا کہ صفیہ رضی اللہ تعالیٰ عنہا حائضہ ہو گئی ہیں آگے زہری کی حدیث کے ہم معنی ( الفاظ ہیں ).",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا، ہم سے زہیر بن حرب نے بیان کیا، ہم سے سفیان نے بیان کیا، ہم سے عبد نے بیان کیا۔ الوہاب، ایوب نے ہمیں بتایا، یہ سب کے اختیار پر ہیں ,عبد الرحمٰن بن قاسم نے اپنے والد ( قاسم بن محمد بن ابی بکر ) سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ يَعْنِي ابْنَ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ، ح وحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، كُلُّهُمْ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا ذَكَرَتْ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنَّ صَفِيَّةَ قَدْ حَاضَتْ بِمَعْنَى حَدِيثِ الزُّهْرِيِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "16",
                "bookSlug": "sahih-muslim",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 116,
                    "chapterNumber": "16",
                    "chapterEnglish": "The Book of Pilgrimage",
                    "chapterUrdu": "حج کے احکام و مسائل",
                    "chapterArabic": "كتاب الْحَجِّ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 10476,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=419",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=417",
                "label": "417",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=418",
                "label": "418",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=419",
                "label": "419",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=420",
                "label": "420",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=421",
                "label": "421",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=422",
                "label": "422",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=423",
                "label": "423",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=421",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=421",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=419",
        "to": 10500,
        "total": 40465
    }
}