{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 489,
        "data": [
            {
                "id": 12489,
                "hadithNumber": "4926",
                "englishNarrator": "It was narrated that Abdullah bin Amr رضی اللہ عنہ said:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: A troop of soldiers, large or small, who fight (in the way of Allah), get their share of the booty and return safe and sound, receive in advance two-thirds of their reward (only one-third remaining to their credit to be received in the Hereafter) ; and a troop of soldiers, large or small, who return empty-handed and are afflicted or wounded, will receive their full reward (in the Hereafter).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو بھی غازہ جماعت یا لشکر جہاد کرے ، غنیمت حاصل کرے اور سلامت رہے تو انہوں نے اپنے دو تہائی اجر فورا ( یہیں ) حاصل کر لیے اور جو بھی غازی جماعت یا لشکر خالی ہاتھ لوٹے اور زخم کھائے تو ان لوگوں کے اجر مکمل ہوں گے ۔ \"",
                "urduNarrator": "مجھ سے محمد بن سہل تمیمی نے بیان کیا، کہا ہم سے ابن ابی مریم نے بیان کیا, نافع بن یزید نے کہا : مجھے ابوہانی نے حدیث بیان کی ، کہا : مجھے ابوعبدالرحمٰن حبلی نے حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا نَافِعُ بْنُ يَزِيدَ، حَدَّثَنِي أَبُو هَانِئٍ، حَدَّثَنِي أَبُو عَبْدِ الرَّحْمَنِ الْحُبُلِيُّ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ غَازِيَةٍ، أَوْ سَرِيَّةٍ، تَغْزُو فَتَغْنَمُ وَتَسْلَمُ، إِلَّا كَانُوا قَدْ تَعَجَّلُوا ثُلُثَيْ أُجُورِهِمْ، وَمَا مِنْ غَازِيَةٍ، أَوْ سَرِيَّةٍ، تُخْفِقُ وَتُصَابُ، إِلَّا تَمَّ أُجُورُهُمْ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12490,
                "hadithNumber": "4927",
                "englishNarrator": "It has been narrated on the authority of Umar bin al-Khattab رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: (The value of) an action depends on the intention behind it. A man will be rewarded only for what he intended. The emigration of one who emigrates for the sake of Allah and His Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) is for the sake of Allah and His Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌); and the emigration of one who emigrates for gaining a worldly advantage or for marrying a woman is for what he has emigrated.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اعمال کا مدار نیت پر ہی ہے ، اور آدمی کے لیے وہی ( اجر ) ہے جس کی اس نے نیت کی ۔ جس شخص کی ہجرت اللہ اور اس کے رسول کی طرف تھی تو اس کی ہجرت اللہ اور اس کے رسول کی طرف ہے اور جس شخص کی ہجرت دنیا حاصل کرنے کے لیے یا کسی عورت سے نکاح کرنے کے لیے تھی تو اس کی ہجرت اسی چیز کی طرف ہے جس کی طرف اس نے ہجرت کی تھی ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب نے بیان کیا, امام مالک نے یحییٰ بن سعید سے ، انہوں نے محمد بن ابراہیم سے ، انہوں نے علقمہ بن وقاص سے ، انہوں نے حضرت عمر بن خطاب رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا الْأَعْمَالُ بِالنِّيَّةِ، وَإِنَّمَا لِامْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللهِ وَرَسُولِهِ، فَهِجْرَتُهُ إِلَى اللهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَتَزَوَّجُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ».",
                "headingArabic": "قَوْلِهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا الأَعْمَالُ بِالنِّيَّةِ.‏\"‏ وَأَنَّهُ يَدْخُلُ فِيهِ الْغَزْوُ وَغَيْرُهُ مِنَ الأَعْمَالِ",
                "headingUrdu": "انبیاء کرام علیہم السلام کے الفاظ: \"اعمال صرف نیتوں کے ہیں\" جس میں لڑائی اور دوسرے اعمال شامل ہیں۔",
                "headingEnglish": "The words of the prophets saws: \"Deeds are but with intentions\" which includes fighting and other deeds",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12491,
                "hadithNumber": "4928",
                "englishNarrator": null,
                "hadithEnglish": "It has been narrated through a different chain of transmitters on the authority of Sufyan who said: He heard 'Umar bin al-Khattab رضی اللہ عنہ relate (this tradition) from the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) while he was delivering a sermon from the pulpit.",
                "hadithUrdu": "ہم سے محمد بن رومح بن المہاجر نے بیان کیا, لیث ، حماد بن زید ، عبدالوہاب ثقفی ، سلیمان بن حیان ، حفص بن غیاث ، یزید بن ہارون ، ابن مبارک اور سفیان سب نے یحییٰ بن سعید سے ، مالک کی سند اور ان کی حدیث کے ہم معنی روایت کی ۔ سفیان کی حدیث میں ہے : میں نے حضرت عمر رضی اللہ عنہ کو منبر پر رسول اللہ صلی اللہ علیہ وسلم سے یہ حدیث بیان کرتے ہوئے سنا ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، ح وحَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادُ ابْنُ زَيْدٍ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو خَالِدٍ الْأَحْمَرُ سُلَيْمَانُ بْنُ حَيَّانَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا حَفْصٌ يَعْنِي ابْنَ غِيَاثٍ، وَيَزِيدُ بْنُ هَارُونَ، ح وحَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، ح وحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، كُلُّهُمْ عَنْ يَحْيَى بْنِ سَعِيدٍ، بِإِسْنَادِ مَالِكٍ وَمَعْنَى حَدِيثِهِ، وَفِي حَدِيثِ سُفْيَانَ: سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ عَلَى الْمِنْبَرِ يُخْبِرُ عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12492,
                "hadithNumber": "4929",
                "englishNarrator": "It has been narrated on the authority of Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: Who seeks martyrdom with sincerity shall get its reward, though he may not achieve it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے سچے دل سے شہادت طلب کی ، اسے عطا کر دی جاتی ہے ( اجر عطا کر دیا جاتا ہے ) چاہے وہ اسے ( عملا ) حاصل نہ ہو سکے ۔ \"",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا، کہا ہم سے حماد بن سلمہ نے بیان کیا، کہا ہم سے ثابت نے بیان کیا, حضرت انس رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ طَلَبَ الشَّهَادَةَ صَادِقًا، أُعْطِيَهَا، وَلَوْ لَمْ تُصِبْهُ».",
                "headingArabic": "اسْتِحْبَابِ طَلَبِ الشَّهَادَةِ فِي سَبِيلِ اللَّهِ تَعَالَى ‏‏",
                "headingUrdu": "اللہ کی راہ میں شہادت مانگنا مستحب ہے۔",
                "headingEnglish": "It is recommended to seek Martyrdom in the Cause of Allah, Exalted is He.",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12493,
                "hadithNumber": "4930",
                "englishNarrator": "It has been reported on the authority of Sahl bin Aba Umama bin Sahl bin Hunaif who learned the tradition from his father who (in turn) learned it from his grandfather:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Who sought martyrdom with sincerity will be ranked by Allah among the martyrs even if he died on his bed. In his version of the tradition Abu Tahir did not mention the words: with sincerity .",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص سچے دل سے اللہ کی شہادت مانگے ، اللہ اسے شہداء کے مراتب تک پہنچا دیتا ہے ، چاہے وہ اپنے بستر ہی پر کیوں نہ فوت ہو ۔ \" ابوطاہر نے اپنی حدیث میں \" سچے ( دل ) سے \" کے الفاظ بیان نہیں کیے ۔",
                "urduNarrator": "ابوطاہر اور حرملہ بن یحییٰ نے مجھے حدیث بیان کی ۔ ۔ الفاظ حرملہ کے ہیں ۔ ۔ ابوطاہر نے کہا : ہمیں عبداللہ بن وہب نے خبر دی ، حرملہ نے کہا : حدیث بیان کی ، کہا : مجھے ابوشریح نے حدیث بیان کی کہ سہل بن ابی امامہ بن سہل بن حنیف نے اپنے والد کے واسطے سے اپنے دادا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، وَاللَّفْظُ لِحَرْمَلَةَ، قَالَ أَبُو الطَّاهِرِ: أَخْبَرَنَا، وقَالَ حَرْمَلَةُ: حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، حَدَّثَنِي أَبُو شُرَيْحٍ، أَنَّ سَهْلَ بْنَ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، حَدَّثَهُ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ سَأَلَ اللهَ الشَّهَادَةَ بِصِدْقٍ، بَلَّغَهُ اللهُ مَنَازِلَ الشُّهَدَاءِ، وَإِنْ مَاتَ عَلَى فِرَاشِهِ»، وَلَمْ يَذْكُرْ أَبُو الطَّاهِرِ فِي حَدِيثِهِ: «بِصِدْقٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12494,
                "hadithNumber": "4931",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: One who died but did not fight in the way of Allah nor did he express any desire (or determination) for Jihad died the death of a hypocrite. 'Abdullah b. Mubarak said: We think the hadith pertained to the time of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جو شخص مر گیا اور جہاد کیا نہ دل میں جہاد کا ارادہ ہی کیا ، وہ نفاق کی ایک قسم میں مرا ۔ \"\" ابن سہم نے کہا : عبداللہ بن مبارک کا قول ہے : ہمیں یہ سمجھ میں آتا ہے کہ یہ ( حکم ) رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں تھا ( جب جہاد کی سنگین ضرورت تھی ۔ بہت بڑے ممالک اسلام میں داخل ہونے اور دشمنوں سے مامون ہو جانے کے بعد اب ہر کسی کی جہاد میں شمولیت کی اتنی شدید ضرورت نہیں رہی ۔ )",
                "urduNarrator": "محمد بن عبدالرحمٰن بن سہم انطاکی نے کہا : ہمیں عبداللہ بن مبارک نے وہیب مکی سے خبر دی ، انہوں نے عمر بن محمد بن منکدر سے ، انہوں نے سمی سے ، انہوں نے ابوصالح سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ سَهْمٍ الْأَنْطَاكِيُّ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ الْمُبَارَكِ، عَنْ وُهَيْبٍ الْمَكِّيِّ، عَنْ عُمَرَ بْنِ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ سُمَيٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ مَاتَ وَلَمْ يَغْزُ، وَلَمْ يُحَدِّثْ بِهِ نَفْسَهُ، مَاتَ عَلَى شُعْبَةٍ مِنْ نِفَاقٍ»، قَالَ ابْنُ سَهْمٍ: قَالَ عَبْدُ اللهِ بْنُ الْمُبَارَكِ: فَنُرَى أَنَّ ذَلِكَ كَانَ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": "ذَمِّ مَنْ مَاتَ وَلَمْ يَغْزُ وَلَمْ يُحَدِّثْ نَفْسَهُ بِالْغَزْوِ ‏‏",
                "headingUrdu": "اس شخص کی تنقید جو بغیر لڑے (جہاد میں) مر جائے یا لڑنے کا سوچے ہی نہ ہو۔",
                "headingEnglish": "Criticism of one who dies without having fought (in Jihad) or having thought of fighting",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12495,
                "hadithNumber": "4932",
                "englishNarrator": "It was narrated that Jabir رضی اللہ عنہ said:",
                "hadithEnglish": "We were with the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) on an expedition. He said: There are some people in Medina. They are with you whenever you cover a distance or cross a valley. They have been detained by illness.",
                "hadithUrdu": "ہم ایک غزوے میں نبی صلی اللہ علیہ وسلم کے ساتھ تھے ، آپ نے فرمایا : \" مدینہ میں ایسے لوگ بھی ہیں کہ تم کسی راستے پر نہیں چلتے یا کسی وادی کو طے نہیں کرتے مگر وہ تمہارے ساتھ ہوتے ہیں ، انہیں بیماری نے روک رکھا ہے ۔ \"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا, جریر نے اعمش سے ، انہوں نے ابوسفیان سے ، انہوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الْأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ: كُنَّا مَعَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي غَزَاةٍ، فَقَالَ: «إِنَّ بِالْمَدِينَةِ لَرِجَالًا مَا سِرْتُمْ مَسِيرًا، وَلَا قَطَعْتُمْ وَادِيًا، إِلَّا كَانُوا مَعَكُمْ، حَبَسَهُمُ الْمَرَضُ.",
                "headingArabic": "ثَوَابِ مَنْ حَبَسَهُ عَنِ الْغَزْوِ، مَرَضٌ أَوْ عُذْرٌ آخَرُ",
                "headingUrdu": "اس کا ثواب جو بیماری یا کسی اور عذر سے لڑنے سے روک دیا جائے۔",
                "headingEnglish": "The reward of one who is kept from fighting by sickness or any other excuse",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12496,
                "hadithNumber": "4933",
                "englishNarrator": "It was narrated from Al-Amash with this chain of narration (a similar hadith to no. 4932), except that in the hadith of Waki (it says):",
                "hadithEnglish": "\"But they shared the reward with you.",
                "hadithUrdu": "\" مگر وہ تمہارے ساتھ اجر میں شریک ہوتے ہیں \" ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا, ابومعاویہ ، وکیع اور عیسیٰ بن یونس سب نے اعمش سے اسی سند کے ساتھ روایت کی ، مگر وکیع کی حدیث میں ( \" مگر وہ تمہارے ساتھ ہوتے ہیں \" کے بجائے )",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، ح وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو سَعِيدٍ الْأَشَجُّ، قَالَا: حَدَّثَنَا وَكِيعٌ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كُلُّهُمْ عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ، غَيْرَ أَنَّ فِي حَدِيثِ وَكِيعٍ: «إِلَّا شَرِكُوكُمْ فِي الْأَجْرِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12497,
                "hadithNumber": "4934",
                "englishNarrator": "It has been reported on the authority of Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to visit Umm Haram daughter of Milhan (who was the sister of his foster-mother or his father's aunt). She was the wife of 'Ubada bin Samit رضی اللہ عنہ , One day the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) paid her a visit. She entertained him with food and then sat down to rub his head. The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) dozed off and when he woke up (after a while), he was laughing. She asked: What made you laugh. Messenger of Allah? He said: Some people from my Umma were presented to me who were fighters in the way of Allah and were sailing in this sea. (Gliding smoothly on the water), they appeared to be kings or like kings (sitting) on thrones (the narrator has a doubt about the actual expression used by the Holy Prophet). She said: Messenger of Allah, pray to Allah that He may include me among these warriors. He prayed for her. Then he placed his head (down) and dozed off (again). He woke up laughing, as before. (She said) I said: Messenger of Allah ﷺ, what makes you laugh? He replied: A people from my Umma were presented to me. They were fighters in Allah's way. (He described them in the same words as he had described the first warriors.) She said: Messenger of Allah, pray to God that He may include me among these warriors. He said: You are among the first ones. Umm Haram daughter of Milhan رضی اللہ عنہا sailed in the aea in the time of Mu'awiya رضی اللہ عنہ. When she came out of the sea and (was going to mount a riding animal) she fell down and died.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم حضرت ام حرام بنت ملحان رضی اللہ عنہا ( جو حضور کی رضاعی خالہ لگتی تھیں ) کے پاس تشریف لے جاتے اور وہ آپ کو کھانا پیش کرتی تھیں ، ( بعد ازاں ) وہ حضرت عبادہ بن صامت رضی اللہ عنہ کے نکاح میں ( آ گئی ) تھیں ، ایک دن رسول اللہ صلی اللہ علیہ وسلم ان کے ہاں گئے ، انہوں نے آپ کو کھانا پیش کیا اور پھر بیٹھ کر آپ کے سر میں جوئیں تلاش کرنے لگیں ۔ رسول اللہ صلی اللہ علیہ وسلم سو گئے ، پھر آپ ہنستے ہوئے بیدار ہوئے ، حضرت ام حرام رضی اللہ عنہا نے کہا ، میں نے عرض کی : اللہ کے رسول! آپ کیوں ہنس رہے ہیں؟ آپ نے فرمایا : \"\" میری امت کے کچھ لوگ ، اللہ کی راہ میں جہاد کرتے ہوئے میرے سامنے پیش کیے گئے ، وہ اس سمندر کی پشت پر سوار ہوں گے ۔ وہ تخت پر بیٹھے ہوئے بادشاہ ہوں گے ، یا اپنے اپنے تخت پر بیٹھے ہوئے بادشاہ ہوں گے ، یا اپنے اپنے تخت پر بیٹھے ہوئے بادشاہوں کی طرح ہوں گے ۔ \"\" انہٰں شک تھا کہ آپ صلی اللہ علیہ وسلم نے کیا فرمایا؟ کہا : تو ام حرام رضی اللہ عنہا نے کہا : میں نے عرض کی : اللہ کے رسول! اللہ سے دعا کیجئے کہ وہ مجھے بھی ان مجاہدین میں شامل کر دے ۔ آپ نے ان کے لیے دعا کی اور پھر اپنا سر ( تکیے پر ) رکھ کر سو گئے ، پھر آپ ہنستے ہوئے بیدار ہوئے ، میں نے عرض کی : اللہ کے رسول! آپ کیوں ہنس رہے ہیں؟ آپ نے فرمایا : \"\" مجھے ( خواب میں ) میری امت کے کچھ لوگ اللہ کی راہ میں جہاد کرتے ہوئے دکھائے گئے ۔ \"\" جس طرح پہلی مرتبہ فرمایا تھا ، میں نے عرض کی : اللہ کے رسول! آپ اللہ سے دعا کیجئے کہ وہ مجھے بھی ان میں شامل کر دے ۔ آپ نے فرمایا : \"\" تم اولین لوگوں میں سے ہو ۔ \"\" پھر حضرت ام حرام بنت ملحان رضی اللہ عنہا حضرت معاویہ رضی اللہ عنہ کے زمانے میں سمندر میں ( بحری بیڑے پر ) سوار ہوئیں اور جب سمندر سے باہر نکلیں تو اپنی سواری کے جانور سے گر کر شہید ہو گئیں ۔ ( اس طرح شہادت پائی ۔ )",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے پڑھا, اسحٰق بن عبداللہ بن ابی طلحہ نے انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْخُلُ عَلَى أُمِّ حَرَامٍ بِنْتِ مِلْحَانَ فَتُطْعِمُهُ، وَكَانَتْ أُمُّ حَرَامٍ تَحْتَ عُبَادَةَ بْنِ الصَّامِتِ، فَدَخَلَ عَلَيْهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمًا، فَأَطْعَمَتْهُ، ثُمَّ جَلَسَتْ تَفْلِي رَأْسَهُ، فَنَامَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ اسْتَيْقَظَ وَهُوَ يَضْحَكُ، قَالَتْ: فَقُلْتُ: مَا يُضْحِكُكَ يَا رَسُولَ اللهِ؟ قَالَ: «نَاسٌ مِنْ أُمَّتِي عُرِضُوا عَلَيَّ، غُزَاةً فِي سَبِيلِ اللهِ، يَرْكَبُونَ ثَبَجَ هَذَا الْبَحْرِ، مُلُوكًا عَلَى الْأَسِرَّةِ»، أَوْ «مِثْلَ الْمُلُوكِ عَلَى الْأَسِرَّةِ» - يَشُكُّ أَيَّهُمَا - قَالَ: قَالَتْ: فَقُلْتُ: يَا رَسُولَ اللهِ، ادْعُ اللهَ أَنْ يَجْعَلَنِي مِنْهُمْ، فَدَعَا لَهَا، ثُمَّ وَضَعَ رَأْسَهُ، فَنَامَ، ثُمَّ اسْتَيْقَظَ وَهُوَ يَضْحَكُ، قَالَتْ: فَقُلْتُ: مَا يُضْحِكُكَ يَا رَسُولَ اللهِ؟ قَالَ: «نَاسٌ مِنْ أُمَّتِي عُرِضُوا عَلَيَّ، غُزَاةً فِي سَبِيلِ اللهِ»، كَمَا قَالَ فِي الْأُولَى، قَالَتْ: فَقُلْتُ: يَا رَسُولَ اللهِ، ادْعُ اللهَ أَنْ يَجْعَلَنِي مِنْهُمْ، قَالَ: «أَنْتِ مِنَ الْأَوَّلِينَ»، فَرَكِبَتْ أُمُّ حَرَامٍ بِنْتُ مِلْحَانَ الْبَحْرَ فِي زَمَنِ مُعَاوِيَةَ، فَصُرِعَتْ عَنْ دَابَّتِهَا حِينَ خَرَجَتْ مِنَ الْبَحْرِ، فَهَلَكَتْ.",
                "headingArabic": "فَضْلِ الْغَزْوِ فِي الْبَحْرِ ‏‏",
                "headingUrdu": "سمندر کے ذریعے مہم چلانے کی فضیلت",
                "headingEnglish": "The virtue of campaigning by sea",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12498,
                "hadithNumber": "4935",
                "englishNarrator": "It has been narrated on the authority of Umm Haram رضی اللہ عنہا (and she was the aunt of Anas رضی اللہ عنہ) who said:",
                "hadithEnglish": "The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) came to us one day and had a nap in our house. When he woke up, he was laughing. I said: Messenger of Allah, what made you laugh? He said: I saw a people from my followers sailing on the surface of the sea (looking) like kings (sitting) on their thrones. I said: Pray to Allah that He may include me among them. He said: You will be among them. He had a (second) nap, woke up and was laughing. I asked him (the reason for his laughter). He gave the same reply. I said: Pray to Allah that He may include me among them. He said: You are among the first ones. Anas رضی اللہ عنہ said: 'Ubada bin Samit رضی اللہ عنہ married her. He joined a naval expedition and took her along with him. When she returned, a mule was brought for her. While mounting it she fell down, broke her neck (and died).",
                "hadithUrdu": "ایک دن رسول اللہ صلی اللہ علیہ وسلم ہمارے ہاں تشریف لائے اور ہمارے ہاں قیلولہ فرمایا، پھر آپ ہنستے ہوئے بیدار ہوئے، میں نے عرض کی: اللہ کے رسول! آپ پر میرے ماں باپ قربان! آپ کے ہنسنے کا سبب کیا ہے؟ آپ نے فرمایا: مجھے میری امت کا ایک گروہ دکھایا گیا جو سمندر کی پیٹھ پر سوار ہیں، جیسے بادشاہ اپنے اپنے تخت پر بیٹھے ہوں۔ میں نے عرض کی: آپ اللہ تعالیٰ سے دعا کیجئے کہ اللہ تعالیٰ مجھے بھی ان میں شامل کر دے۔ آپ نے فرمایا: تم انہی میں ہو۔ حضرت ام حرام رضی اللہ عنہ نے کہا: آپ پھر سو گئے اور آپ دوبارہ جاگے تو بھی آپ ہنس رہے تھے۔ میں نے (پھر) آپ سے سوال کیا تو آپ نے اسی طرح فرمایا۔ میں نے عرض کی: آپ اللہ تعالیٰ سے دعا کیجئے کہ وہ مجھے بھی ان میں شامل کر دے۔ آپ نے فرمایا: تم اولین لوگوں میں سے ہو۔ کہا: پھر اس کے بعد حضرت عبادہ بن صامت رضی اللہ عنہ نے ان سے نکاح کر لیا، انہوں نے سمندر کے راستے جہاد کیا اور حضرت ام حرام رضی اللہ عنہا کو اپنے ساتھ لے گئے، جب وہ پہنچیں تو ان کے پاس ایک خچر لائی گئی، وہ اس پر سوار ہوئیں لیکن اس نے ان کو گرا دیا جس سے ان کی گردن ٹوٹ گئی۔ (اور اس طرح انہوں نے شہادت پائی۔)",
                "urduNarrator": "ہم سے خلف بن ہشام نے بیان کیا,  حماد بن زید نے ہمیں یحییٰ بن سعید سے ، انہوں نے ابن حبان سے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے ، انہوں نے اپنی خالہ ام حرام بنت ملحان رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ أُمِّ حَرَامٍ، وَهِيَ خَالَةُ أَنَسٍ، قَالَتْ: أَتَانَا النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمًا، فَقَالَ عِنْدَنَا، فَاسْتَيْقَظَ وَهُوَ يَضْحَكُ، فَقُلْتُ: مَا يُضْحِكُكَ يَا رَسُولَ اللهِ؟ بِأَبِي أَنْتَ وَأُمِّي، قَالَ: «أُرِيتُ قَوْمًا مِنْ أُمَّتِي يَرْكَبُونَ ظَهْرَ الْبَحْرِ كَالْمُلُوكِ عَلَى الْأَسِرَّةِ»، فَقُلْتُ: ادْعُ اللهَ أَنْ يَجْعَلَنِي مِنْهُمْ، قَالَ: «فَإِنَّكِ مِنْهُمْ»، قَالَتْ: ثُمَّ نَامَ، فَاسْتَيْقَظَ أَيْضًا وَهُوَ يَضْحَكُ، فَسَأَلْتُهُ، فَقَالَ مِثْلَ مَقَالَتِهِ، فَقُلْتُ: ادْعُ اللهَ أَنْ يَجْعَلَنِي مِنْهُمْ، قَالَ: «أَنْتِ مِنَ الْأَوَّلِينَ»، قَالَ: فَتَزَوَّجَهَا عُبَادَةُ بْنُ الصَّامِتِ بَعْدُ، فَغَزَا فِي الْبَحْرِ فَحَمَلَهَا مَعَهُ، فَلَمَّا أَنْ جَاءَتْ قُرِّبَتْ لَهَا بَغْلَةٌ فَرَكِبَتْهَا فَصَرَعَتْهَا، فَانْدَقَّتْ عُنُقُهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12499,
                "hadithNumber": "4936",
                "englishNarrator": "It was narrated from Anas bin Malik, from his maternal aunt Umm Haram daughter of Milhan رضی اللہ عنہا, that she said:",
                "hadithEnglish": "One day the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) slept (at a place) near me. He woke up smiling. She said: Messenger of Allah. what made thee laugh? He said: A people from my followers were presented to me. They were sailing on the surface of this green sea... (here follows the tradition that has gone before).",
                "hadithUrdu": "ایک دن رسول اللہ صلی اللہ علیہ وسلم میرے قریب ہی سو گئے ، پھر آپ مسکراتے ہوئے بیدار ہوئے ، میں نے عرض کی : اللہ کے رسول! آپ کس بات پر ہنس رہے ہیں؟ آپ نے فرمایا : \" مجھے میری امت کے کچھ لوگ دکھائے گئے جو اس بحر اخضر پر سوار ہو کر جا رہے ہیں ۔ \" پھر حماد بن زید کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "ہم سے محمد بن روم بن المہاجر اور یحییٰ بن یحییٰ نے بیان کیا، کہا: لیث نے یحییٰ بن سعید سے ، انہوں نے ابن حبان سے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے ، انہوں نے اپنی خالہ ام حرام بنت ملحان رضی اللہ عنہا سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، وَيَحْيَى بْنُ يَحْيَى، قَالَا: أَخْبَرَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ ابْنِ حَبَّانَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ خَالَتِهِ أُمِّ حَرَامٍ بِنْتِ مِلْحَانَ، أَنَّهَا قَالَتْ: نَامَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمًا قَرِيبًا مِنِّي، ثُمَّ اسْتَيْقَظَ يَتَبَسَّمُ، قَالَتْ: فَقُلْتُ يَا رَسُولَ اللهِ، مَا أَضْحَكَكَ؟ قَالَ: نَاسٌ مِنْ أُمَّتِي عُرِضُوا عَلَيَّ، يَرْكَبُونَ ظَهْرَ هَذَا الْبَحْرِ الْأَخْضَرِ، ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ حَمَّادِ بْنِ زَيْدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12500,
                "hadithNumber": "4937",
                "englishNarrator": "It has been reported by 'Abdullah bin 'Abdul-Rahman that he heard Anas bin Malik رضی اللہ عنہ say:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) paid a visit to Milhan's daughter رضی اللہ عنہا , maternal aunt of Anas رضی اللہ عنہ (and the sister of the Holy Prophet's foster-mother). He placed his head near her (from this point onward, the narrator carried on the previous tradition to its end).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ان کی خالہ ، بنت ملحان رضی اللہ عنہا کے پاس تشریف لائے اور ان کے ہاں ( تکیے پر ) سر رکھ کر سو گئے ، اس کے بعد اسحاق بن ابی طلحہ اور محمد بن یحییٰ بن حبان کی حدیث کے ہم معنی حدیث بیان کی ۔",
                "urduNarrator": "مجھ سے یحییٰ بن ایوب، قتیبہ اور ابن حجر نے بیان کیا، انہوں نے کہا: ہم سے اسماعیل نے جو ابن جعفر ہیں، بیان کیا, عبداللہ بن عبدالرحمٰن نے کہا کہ انہوں نے انس بن مالک رضی اللہ عنہ کو کہتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ حُجْرٍ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ وَهُوَ ابْنُ جَعْفَرٍ، عَنْ عَبْدِ اللهِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ: أَتَى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ابْنَةَ مِلْحَانَ، خَالَةَ أَنَسٍ، فَوَضَعَ رَأْسَهُ عِنْدَهَا، وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ إِسْحَاقَ بْنِ أَبِي طَلْحَةَ، وَمُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12501,
                "hadithNumber": "4938",
                "englishNarrator": "It has been narrated on the authority of Salman رضی اللہ عنہ who said:",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: Keeping watch for a day and a night is better (in point of reward) than fasting for a whole month and standing in prayer every night. If a person dies (while, performing this duty), his (meritorious) activity will continue and he will go on receiving his reward for it perpetually and will be saved from the torture of the grave.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" ایک دن اور ایک رات سرحد پر پہرپ دینا ، ایک ماہ کے روزوں اور قیام سے بہتر ہے اور اگر ( پہرہ دینے والا ) فوت ہو گیا تو اس کا وہ عمل جو وہ کر رہا تھا ، ( آئندہ بھی ) جاری رہے گا ، اس کے لیے اس کا رزق جاری کیا جائے گا اور وہ ( قبر میں سوالات کر کے ) امتحان لینے والے سے محفوظ رہے گا ۔ \"",
                "urduNarrator": "ہم سے عبداللہ بن عبدالرحمٰن بن بہرام الدارمی نے بیان کیا، کہا ہم سے ابو الولید الطیالسی نے بیان کیا, لیث بن سعد نے ہمیں ایوب بن موسیٰ سے حدیث بیان کی ، انہوں نے مکحول سے ، انہوں نے شرجیل بن سمط سے ، انہوں نے سلمان رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ بَهْرَامَ الدَّارِمِيُّ، حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ، حَدَّثَنَا لَيْثٌ يَعْنِي ابْنَ سَعْدٍ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ مَكْحُولٍ، عَنْ شُرَحْبِيلَ بْنِ السِّمْطِ، عَنْ سَلْمَانَ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «رِبَاطُ يَوْمٍ وَلَيْلَةٍ خَيْرٌ مِنْ صِيَامِ شَهْرٍ وَقِيَامِهِ، وَإِنْ مَاتَ جَرَى عَلَيْهِ عَمَلُهُ الَّذِي كَانَ يَعْمَلُهُ، وَأُجْرِيَ عَلَيْهِ رِزْقُهُ، وَأَمِنَ الْفَتَّانَ».",
                "headingArabic": "فَضْلِ الرِّبَاطِ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ ‏‏",
                "headingUrdu": "اللہ کی راہ میں سرحدوں کی حفاظت کرنے کی فضیلت",
                "headingEnglish": "The virtue of guarding the frontier in the cause of Allah (Glorified and Exalted is He)",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12502,
                "hadithNumber": "4939",
                "englishNarrator": null,
                "hadithEnglish": "This tradition has been handed down on the authority of Salman al-Khair رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "مجھ سے ابو الطاہر نے بیان کیا، ہم سے ابن وہب نے، عبدالرحمٰن بن شریح کی سند سے، عبدالکریم بن حارث کی سند سے, ابوعبیدہ بن عقبہ نے شرجیل بن سمط سے ، انہوں نے سلمان خیر رضی اللہ عنہ سے ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے ، ایوب بن موسیٰ سے لیث کی حدیث کے ہم معنی روایت کی.",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ شُرَيْحٍ، عَنْ عَبْدِ الْكَرِيمِ بْنِ الْحَارِثِ، عَنْ أَبِي عُبَيْدَةَ بْنِ عُقْبَةَ، عَنْ شُرَحْبِيلَ بْنِ السِّمْطِ، عَنْ سَلْمَانَ الْخَيْرِ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ اللَّيْثِ، عَنْ أَيُّوبَ بْنِ مُوسَى.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12503,
                "hadithNumber": "4940",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The, Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: While a man walks along a path, finds a thorny twig lying on the way and puts it aside, Allah would appreciate it and forgive him The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: The martyrs are of five kinds: one who dies of plague; one who dies of diarrhoea (or cholera); one who is drowned; one who is buried under debris and one who dies fighting in the way of Allah.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ایک بار ایک شخص کسی راستے پر جا رہا تھا ، اس نے راستے میں ایک خاردار شاخ دیکھی تو اس کو ( راستے سے ) پیچھے کر دیا ، اللہ تعالیٰ نے اسے اس کے عمل کی جزا دی اور اس کو بخش دیا ۔ \" پھر آپ نے فرمایا : \" شہید پانچ ( قسم کے اشخاص ) ہیں : ( 1 ) طاعون کی بیماری میں مرنے والا ۔ ( 2 ) پیٹ کی بیماری میں مرنے والا ۔ ( 3 ) ڈوب کر مرنے والا ۔ ( 4 ) کسی چیز کے نیچے دب کر مرنے والا ۔ ( 5 ) اور جو شخص اللہ عزوجل کی راہ میں ( لڑتے ہوئے ) شہید ہوا ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک رضی اللہ عنہ سے پڑھا, سُمی نے ابوصالح سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: قَرَأْتُ عَلَى مَالِكٍ، عَنْ سُمَيٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، قَالَ: «بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ، وَجَدَ غُصْنَ شَوْكٍ عَلَى الطَّرِيقِ فَأَخَّرَهُ، فَشَكَرَ اللهُ لَهُ، فَغَفَرَ لَهُ» وَقَالَ: الشُّهَدَاءُ خَمْسَةٌ: الْمَطْعُونُ، وَالْمَبْطُونُ، وَالْغَرِقُ، وَصَاحِبُ الْهَدْمِ، وَالشَّهِيدُ فِي سَبِيلِ اللهِ عَزَّ وَجَلَّ.",
                "headingArabic": "بَيَانِ الشُّهَدَاءِ ‏‏",
                "headingUrdu": "شہداء کے بارے میں",
                "headingEnglish": "About the Martyrs",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12504,
                "hadithNumber": "4941",
                "englishNarrator": "It has been narrated on the authority of Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Whom do you consider to be a martyr among you? They (the Companions) said: Messenger, of Allah, one who is slain in the way of Allah is a martyr. He said: Then (if this is the definition of a martyr) the martyrs of my Umma will be small in number. They asked: Messenger of Allah, who are they? He said: One who is slain in the way of Allah is a martyr; one who dies in the way of Allah, is a martyr; one who dies of plague is a martyr; one who dies of cholera is a martyr. Ibn Miqsam said: I testify the truth of your father's statement (with regard to this tradition) that the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: One who is drowned is a martyr.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم آپس میں ( بات کرتے ہوئے ) شہید کس کو شمار کرتے ہو؟ \"\" صحابہ نے عرض کی : اللہ کے رسول! جو شخص اللہ کی راہ میں قتل کیا جائے وہ شہید ہے ۔ آپ نے فرمایا : \"\" پھر تو میری امت کے شہداء بہت کم ہوئے ۔ \"\" صحابہ نے عرض کی : یا رسول اللہ! پھر وہ کون ہیں؟ آپ نے فرمایا : \"\" جو شخص اللہ کی راہ میں مارا جائے وہ شہید ہے اور جو شخص اللہ کی راہ میں ( طلبِ علم ، سفرِ حج ، جہاد کے دوران میں اپنی موت ) مر جائے وہ شہید ہے ، جو شخص طاعون میں مرے وہ شہید ہے ، جو شخص پیٹ کی بیماری میں ( مبتلا ہو کر ) مر جائے وہ شہید ہے ۔ \"\" ( ابوصالح سے بیان کرنے والے ایک اور راوی عبیداللہ ) بن مقسم نے ( سہیل بن ابی صالح سے ) کہا : میں تمہارے والد کے بارے میں گواہی دیتا ہوں کہ انہوں نے ( حدیث بیان کرتے ہوئے یہ بھی ) کہا تھا : \"\" اور غرق ہونے والا شہید ہے ۔ \"\"",
                "urduNarrator": "مجھ سے زہیر بن حرب نے کہا, جریر نے سہیل سے ، انہوں نے اپنے والد ( ابوصالح ) سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا تَعُدُّونَ الشَّهِيدَ فِيكُمْ؟» قَالُوا: يَا رَسُولَ اللهِ، مَنْ قُتِلَ فِي سَبِيلِ اللهِ فَهُوَ شَهِيدٌ، قَالَ: «إِنَّ شُهَدَاءَ أُمَّتِي إِذًا لَقَلِيلٌ»، قَالُوا: فَمَنْ هُمْ يَا رَسُولَ اللهِ؟ قَالَ: «مَنْ قُتِلَ فِي سَبِيلِ اللهِ فَهُوَ شَهِيدٌ، وَمَنْ مَاتَ فِي سَبِيلِ اللهِ فَهُوَ شَهِيدٌ، وَمَنْ مَاتَ فِي الطَّاعُونِ فَهُوَ شَهِيدٌ، وَمَنْ مَاتَ فِي الْبَطْنِ فَهُوَ شَهِيدٌ»، قَالَ ابْنُ مِقْسَمٍ: أَشْهَدُ عَلَى أَبِيكَ فِي هَذَا الْحَدِيثِ أَنَّهُ قَالَ: «وَالْغَرِيقُ شَهِيدٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12505,
                "hadithNumber": "4942",
                "englishNarrator": "Suhail said:",
                "hadithEnglish": "Ubaidullah bin Muqsam said: I bear witness that your brother added in this hadith: \"And one who is drowned is a martyr.",
                "hadithUrdu": "عبیداللہ بن مقسم نے ( سہیل سے ) کہا کہ میں تمہارے بھائی کے بارے میں ( بھی ) گواہی دیتا ہوں کہ اس حدیث ( کو اپنے والد سے بیان کرتے ہوئے اس ) میں یہ اضافہ کیا تھا : \" اور جو غرق ہو جائے وہ شہید ہے ۔ \"",
                "urduNarrator": "مجھ سے عبد الحمید بن بیان الوسطی نے بیان کیا, خالد نے ہمیں سہیل سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ، البتہ ان کی حدیث میں ہے : سہیل نے کہا",
                "hadithArabic": "وحَدَّثَنِي عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدٌ، عَنْ سُهَيْلٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّ فِي حَدِيثِهِ، قَالَ سُهَيْلٌ: قَالَ عُبَيْدُ اللهِ بْنُ مِقْسَمٍ، أَشْهَدُ عَلَى أَخِيكَ أَنَّهُ زَادَ فِي هَذَا الْحَدِيثِ «وَمَنْ غَرِقَ فَهُوَ شَهِيدٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12506,
                "hadithNumber": "4943",
                "englishNarrator": "Suhail narration it with this chain of narration (a hadith similar to no. 4942), and in this Hadith:",
                "hadithEnglish": "A drowned person is a martyr.",
                "hadithUrdu": "\" غرق ہونے والا شہید ہے ۔ \"",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، انہوں نے کہا: وہیب نے کہا : ہمیں سہیل نے اسی سند کے ساتھ حدیث بیان کی ، ان کی حدیث میں ہے ، کہا : مجھے عبیداللہ بن مقسم نے ابوصالح سے خبر دی ، اور اس میں اضافہ کیا",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا سُهَيْلٌ، بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِهِ، قَالَ: أَخْبَرَنِي عُبَيْدُ اللهِ بْنُ مِقْسَمٍ، عَنْ أَبِي صَالِحٍ، وَزَادَ فِيهِ: «وَالْغَرِقُ شَهِيدٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12507,
                "hadithNumber": "4944",
                "englishNarrator": "It has been narrated on the authority of Hafsa daughter of Sirin who said:",
                "hadithEnglish": "Anas bin Malik رضی اللہ عنہ asked me the cause of death of Yahya bin 'Abu 'Amra. I said: (He died) of plague. He said: The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said that death by plague is martyrdom for a Muslim.",
                "hadithUrdu": "حضرت انس بن مالک رضی اللہ عنہ نے مجھ سے پوچھا : یحییٰ بن ابی عمرہ کس بیماری سے فوت ہوئے تھے؟ انہوں نے کہا : میں نے کہا : طاعون سے ۔ انہوں نے کہا : تو انہوں ( انس رضی اللہ عنہ ) نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" طاعون ( سے موت ) ہر مسلمان کے لیے شہادت ہے ۔ \"",
                "urduNarrator": "ہم سے حمید بن عمر البکراوی نے بیان کیا, عبدالواحد بن زیاد نے کہا , ہمیں عاصم نے حفصہ بنت سیرین سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ، حَدَّثَنَا عَاصِمٌ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، قَالَتْ: قَالَ لِي أَنَسُ بْنُ مَالِكٍ: بِمَ مَاتَ يَحْيَى بْنُ أَبِي عَمْرَةَ؟ قَالَتْ: قُلْتُ: بِالطَّاعُونِ، قَالَتْ: فَقَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الطَّاعُونُ شَهَادَةٌ لِكُلِّ مُسْلِمٍ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12508,
                "hadithNumber": "4945",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of 'Asim through the same chain of transmitters.",
                "hadithUrdu": "ہم سے ولید بن شجاع نے بیان کیا, علی بن مسہر نےعاصم سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ الْوَلِيدُ بْنُ شُجَاعٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عَاصِمٍ، فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12509,
                "hadithNumber": "4946",
                "englishNarrator": "It has been narrated on the authority of Ibn Amir رضی اللہ عنہ who said:",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say-and he was delivering a sermon from the pulpit: Prepare to meet them with as much strength as you can afford. Beware, strength consists in archery. Beware, strength consists in archery. Beware, strength consists in archery.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ منبر پر فرما رہے تھے : \" ( عربی ) \" تم ان کے مقابلے کے لیے جتنی کر سکو ، قوت تیار کرو ۔ \" ( الانفال 60 : 8 ) سن رکھو! قوت تیر اندازی ( کا نام ) ہے ، سن رکھو! قوت تیر اندازی ( کا نام ) ہے ، سن رکھو! قوت تیر اندازی ( کا نام ) ہے ۔ \"",
                "urduNarrator": "ہم سے ہارون بن معروف نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے عمرو بن حارث نے بیان کیا, ثمامہ بن شُفی سے روایت ہے ، انہوں نے حضرت عقبہ بن عامر رضی اللہ عنہ کو یہ کہتے ہوئے سنا",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ أَبِي عَلِيٍّ ثُمَامَةَ بْنِ شُفَيٍّ، أَنَّهُ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ، يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ، يَقُولُ: {وَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ} [الأنفال: 60]، أَلَا إِنَّ الْقُوَّةَ الرَّمْيُ، أَلَا إِنَّ الْقُوَّةَ الرَّمْيُ، أَلَا إِنَّ الْقُوَّةَ الرَّمْيُ.",
                "headingArabic": "فَضْلِ الرَّمْىِ وَالْحَثِّ عَلَيْهِ وَذَمِّ مَنْ عَلِمَهُ ثُمَّ نَسِيَهُ",
                "headingUrdu": "تیر اندازی کی فضیلت اور اسے سیکھنے کی ترغیب دینا، اور اس پر تنقید جو اسے سیکھتا ہے اور پھر بھول جاتا ہے۔",
                "headingEnglish": "The virtue of Shooting and Encouragement to learn it, and criticism of the one who learns it and then forgets it",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12510,
                "hadithNumber": "4947",
                "englishNarrator": "It has been narrated on the authority of Uqba bin Amir رضی اللہ عنہ who said:",
                "hadithEnglish": "I heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) say: Lands shall be thrown open to you and Allah will suffice you (against your enemies), but none of you should give up playing with his arrows.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" جلد ہی تمہارے لیے بہت سی زمینوں ( پر قبضے ) کے دروازے کھول دیے جائیں گے اور اللہ تمہارے لیے کافی ہو گا ، اس لیے تم میں سے کوئی اپنے تیروں کی مشق سے غافل نہ رہے ۔ \"",
                "urduNarrator": "ہم سے ہارون بن معروف نے بیان کیا, ابن وہب نے کہا : مجھے عمرو بن حارث نے ابوعلی ( ثمامہ بن شفی ) سے خبر دی ، انہوں نے حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "وَحَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ أَبِي عَلِيٍّ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «سَتُفْتَحُ عَلَيْكُمْ أَرَضُونَ، وَيَكْفِيكُمُ اللهُ، فَلَا يَعْجِزُ أَحَدُكُمْ أَنْ يَلْهُوَ بِأَسْهُمِهِ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12511,
                "hadithNumber": "4948",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated that Abu Ali Al-Hamdani said: \"I heard 'Uqbah bin Amir narrate from the prophet ﷺ...\" a similar report (as no. 4947).",
                "hadithUrdu": "ہم سے داؤد بن راشد نے بیان کیا، کہا ہم سے الولید نے بیان کیا، انہوں نے بکر بن مدر سے، وہ عمرو بن حارث سے، انہوں نے ابو علی ہمدانی سے، انہوں نے کہا: میں نے سنا۔ عقبہ بن عامر، رسول اللہ صلی اللہ علیہ وسلم کی سند سے، اسی طرح کی مثال کے ساتھ۔",
                "urduNarrator": null,
                "hadithArabic": "وحَدَّثَنَاهُ دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا الْوَلِيدُ، عَنْ بَكْرِ بْنِ مُضَرَ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ أَبِي عَلِيٍّ الْهَمْدَانِيِّ، قَالَ: سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12512,
                "hadithNumber": "4949",
                "englishNarrator": "It has been reported by 'Abdul-Rahman bin Shamasa that Fuqaim al-Lakhmi said to Uqba bin Amir رضی اللہ عنہ :",
                "hadithEnglish": "You frequent between these two targets and you are an old man, so you will be finding it very hard. 'Uqba رضی اللہ عنہ said: But for a thing I heard from the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), I would not strain myself. Harith (one of the narrators in the chain of transmitters) said: I asked Ibn Shamasa: What was that? He said that he (the Holy Prophet) said: Who learnt archery and then gave it up is not from us. or he has been guilty of disobedience (to Allah's Apostle).",
                "hadithUrdu": "آپ ( تیر چھوڑنے اور جا لگنے کے ) ان دو نشانوں کے درمیان چکر لگاتے ہیں جبکہ آپ بوڑھے ہیں اور یہ آپ کے لیے باعث مشقت بھی ہے ۔ حضرت عقبہ بن عامر رضی اللہ عنہ نے کہا : اگر میں نے رسول اللہ صلی اللہ علیہ وسلم سے ایک بات نہ سنی ہوتی تو میں یہ تکلیف نہ اٹھاتا ۔ حارث نے کہا : میں نے ابن شماسہ سے پوچھا : وہ بات کیا ہے؟ انہوں نے کہا : آپ صلی اللہ علیہ وسلم نے فرمایا تھا : \" جس شخص نے تیر اندازی سیکھی ، پھر اس کو ترک کر دیا ، وہ ہم میں سے نہیں ہے ۔ \" یا ( فرمایا : ) \" اس نے نافرمانی کی ۔ \"",
                "urduNarrator": "ہم سے محمد بن رومح بن المہاجر نے بیان کیا، کہا ہم سے لیث نے بیان کیا, حارث بن یعقوب نے عبدالرحمٰن بن شماسہ سے روایت کی کہ فُقَیم لخمی نے حضرت عقبہ بن عامر رضی اللہ عنہ سے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنِ الْحَارِثِ بْنِ يَعْقُوبَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِمَاسَةَ، أَنَّ فُقَيْمًا اللَّخْمِيَّ، قَالَ لِعُقْبَةَ بْنِ عَامِرٍ: تَخْتَلِفُ بَيْنَ هَذَيْنِ الْغَرَضَيْنِ وَأَنْتَ كَبِيرٌ يَشُقُّ عَلَيْكَ، قَالَ عُقْبَةُ: لَوْلَا كَلَامٌ سَمِعْتُهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَمْ أُعَانِيهِ، قَالَ الْحَارِثُ: فَقُلْتُ لِابْنِ شَمَاسَةَ: وَمَا ذَاكَ؟ قَالَ: إِنَّهُ قَالَ: «مَنْ عَلِمَ الرَّمْيَ، ثُمَّ تَرَكَهُ، فَلَيْسَ مِنَّا» أَوْ «قَدْ عَصَى».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12513,
                "hadithNumber": "4950",
                "englishNarrator": "It has been narrated on the authority of Thauban رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah (ﷺ) said: A group of people from my Umma will always remain triumphant on the right path and continue to be triumphant (against their opponents). He who deserts them shall not be able to do them any harm. They will remain in this position until Allah's Command is executed (i.e. Qiyamah is established). In Qutaiba's version of the tradition, we do not have the words: They will remain in this position.",
                "hadithUrdu": "رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا ہمیشہ میری امت کا ایک گروہ حق پر قائم رہے گا کوئی ان کا نقصان نہ پہنچا سکے گا یہاں تک کہ اﷲ تعالیٰ کا حکم آوے ( یعنی قیامت ) اور وہ اسی حال میں ہوں گے۔ اور قتیبہ کی حدیث میں وہ ایسے نہیں ہیں۔",
                "urduNarrator": "ہم سے سعید بن منصور، ابو الربیع العتکی اور قتیبہ بن سعید نے بیان کیا، انہوں نے کہا: ہم سے حماد نے جو ابن زید نے بیان کیا، انہوں نے ایوب کی سند سے بیان کیا۔ قلابہ، ابو اسماء کی سند سے، حضرت ثوبان رضی ‌اللہ ‌عنہ سے روایت ہے",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو الرَّبِيعِ الْعَتَكِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالُوا حَدَّثَنَا حَمَّادٌ، - وَهُوَ ابْنُ زَيْدٍ - عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ، عَنْ ثَوْبَانَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ ‏ لاَ تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي ظَاهِرِينَ عَلَى الْحَقِّ لاَ يَضُرُّهُمْ مَنْ خَذَلَهُمْ حَتَّى يَأْتِيَ أَمْرُ اللَّهِ وَهُمْ كَذَلِكَ ‏ ‏ ‏.‏ وَلَيْسَ فِي حَدِيثِ قُتَيْبَةَ ‏ ‏ وَهُمْ كَذَلِكَ.‏",
                "headingArabic": "قَوْلِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لاَ تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي ظَاهِرِينَ عَلَى الْحَقِّ لاَ يَضُرُّهُمْ مَنْ خَالَفَهُمْ»",
                "headingUrdu": "نبی صلی اللہ علیہ وسلم کا ارشاد ہے: \"میری امت کا ایک گروہ حق کی بنیاد پر غالب رہے گا اور ان کو ان کی مخالفت کرنے والوں سے کوئی نقصان نہیں پہنچے گا۔\"",
                "headingEnglish": "The words of the prophet saws: \"A Group of my Ummah will continue to Prevail on the basis of the Truth, and They will not be Harmed by those who oppose them.\"",
                "chapterId": "34",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 134,
                    "chapterNumber": "34",
                    "chapterEnglish": "The Book of Government",
                    "chapterUrdu": "امور حکومت کا بیان",
                    "chapterArabic": "كتاب الْإِمَارَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12201,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=488",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=486",
                "label": "486",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=487",
                "label": "487",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=488",
                "label": "488",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=489",
                "label": "489",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=490",
                "label": "490",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=491",
                "label": "491",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=492",
                "label": "492",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=490",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=490",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=488",
        "to": 12225,
        "total": 40465
    }
}