{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 502,
        "data": [
            {
                "id": 12814,
                "hadithNumber": "5251",
                "englishNarrator": "Amr bin Dinaar narrated that he heard Jabir bin Abdullah رضی اللہ عنہ say something similar to what 'Ata' narrated (no. 5250), but he did not say:",
                "hadithEnglish": "\"Mention the Name of Allah, Exalted and Glorified is He.\"",
                "hadithUrdu": "\" اللہ عزوجل کا نام لو ۔ \"",
                "urduNarrator": "اسحاق بن منصور نے کہا : ہمیں روح بن عبادہ نے خبر دی ، کہا : ہمیں ابن جریج نے حدیث بیان کی ، کہا مجھے عمرو بن دینار نے بتایا کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سےسنا ، وہ اس طرح کہہ رہے تھے جس طرح عطاء نے بتایا ، البتہ انھوں نے یہ نہیں کہا",
                "hadithArabic": "و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ نَحْوًا مِمَّا أَخْبَرَ عَطَاءٌ إِلَّا أَنَّهُ لَا يَقُولُ اذْكُرُوا اسْمَ اللَّهِ عَزَّ وَجَلَّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12815,
                "hadithNumber": "5252",
                "englishNarrator": null,
                "hadithEnglish": "A report like that of Rawh (no. 5251) was narrated from Ata and 'Amr bin Dinaar.",
                "hadithUrdu": "ہم سے احمد بن عثمان النوفلی نے بیان کیا, ابو عاصم نے کہا : ہمیں ابن جریج نے یہی حدیث عطاء اور عمرو بن دینار دے روح کی روایت کے مانند بیا ن کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ حَدَّثَنَا أَبُو عَاصِمٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ بِهَذَا الْحَدِيثِ عَنْ عَطَاءٍ وَعَمْرِو بْنِ دِينَارٍ كَرِوَايَةِ رَوْحٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12816,
                "hadithNumber": "5253",
                "englishNarrator": "Jabir رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Do not let your animals and children go out when the sun sets until the first and the darkest part of the night is over, for the Satan is let loose with the sinking of the sun until the darkest part of the night is over.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" سورج غروب ہونے لگے تو اپنے پھیل جانے والے جانوروں اور بچوں کو باہرنہ بھیجو یہاں تک کہ عشاء کی تک کی آمد جھٹپٹا رخصت ہوجائے ، کیونکہ سورج غروب ہونے کے بعد عشاء کی آمد کا جھٹپٹا ختم ہونے تک شیطانوں کو چھوڑا جاتا ہے ۔ \"",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، ہم سے زہیر نے بیان کیا، ہم سے ابو الزبیر نے جابر  کی سند سے بیان کیا، ہم سے یحییٰ بن یحییٰ نے بیان کیا, ابو خثیمہ ( زہیر ) نے ابو زبیر سے حدیث بیان کی ، انھوں نے جابر رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُرْسِلُوا فَوَاشِيَكُمْ وَصِبْيَانَكُمْ إِذَا غَابَتْ الشَّمْسُ حَتَّى تَذْهَبَ فَحْمَةُ الْعِشَاءِ فَإِنَّ الشَّيَاطِينَ تَنْبَعِثُ إِذَا غَابَتْ الشَّمْسُ حَتَّى تَذْهَبَ فَحْمَةُ الْعِشَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12817,
                "hadithNumber": "5254",
                "englishNarrator": null,
                "hadithEnglish": "A Hadith like that of Zubair was narrated from Jabir bin Abdullah رضی اللہ عنہ, from the prophet ﷺ.",
                "hadithUrdu": "مجھ سے محمد بن المثنیٰ نے بیان کیا، کہا ہم سے عبدالرحمٰن نے بیان کیا, سفیان بن ابو زبیر سے ، انھوں نے جابر رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے زہیر کی حدیث کے مانند بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِ زُهَيْرٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12818,
                "hadithNumber": "5255",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Cover the vessels and tie the water skin, for there is a night in a year when pestilence descends, and it does not pass an uncovered vessel or an untied water skin but some of that pestilence descending into it.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" برتن ڈھانک دو ، مشکیزے کامنہ باندھ دو ، کیونکہ سال میں ایک رات ایسی ہوتی ہے جس میں وبا نازل ہوتی ہے ۔ پھر جس بھی ان ڈھکے برتن اور منہ کھلے مشکیزے کے پاس سے گزرتی ہے ۔ تو اس وبا میں سے ( کچھ حصہ ) اس میں اُتر جاتا ہے ۔ \"",
                "urduNarrator": "عمرو الناقد نے ہمیں بتایا, ہاشم بن قاسم نے کہا : \" ہمیں لیث بن سعد نے حدیث بیان کی ، کہا : مجھے یزید بن عبداللہ بن اسامہ بن ہاد لیثی نے یحییٰ بن سعید سے ، انھوں نے جعفر بن عبداللہ بن حکم سے ، انھوں نے قعقاع بن حکیم سے ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ اللَّيْثِيُّ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ جَعْفَرِ بْنِ عَبْدِ اللَّهِ بْنِ الْحَكَمِ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ غَطُّوا الْإِنَاءَ وَأَوْكُوا السِّقَاءَ فَإِنَّ فِي السَّنَةِ لَيْلَةً يَنْزِلُ فِيهَا وَبَاءٌ لَا يَمُرُّ بِإِنَاءٍ لَيْسَ عَلَيْهِ غِطَاءٌ أَوْ سِقَاءٍ لَيْسَ عَلَيْهِ وِكَاءٌ إِلَّا نَزَلَ فِيهِ مِنْ ذَلِكَ الْوَبَاءِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12819,
                "hadithNumber": "5256",
                "englishNarrator": "This hadith is reported on the authority of Laith bin Sa'd with the same chain of transmitters, but with a slight variation in wording (and that is that) he (the Holy Prophet ﷺ) said:",
                "hadithEnglish": "There is a day in a year when descends the pestilence; at the end of the hadith Laith said that the non Arabs save themselves from it in Kanun Awwal (this is the month of December).",
                "hadithUrdu": "\" سال میں ایک ایسا دن ہے جس میں وبا نازل ہوتی ہے ۔ \" ( علی نے ) حدیث کے آخر میں یہ اضافہ کیا : لیث نے کہا : ہمارے ہاں کے عجمی لوگ کانون اول ( یعنی دسمبر ) میں اس وبا سے بچتے ہیں ( بچنے کے حیلے کرتے ہیں ۔ )",
                "urduNarrator": "نصر بن علی جہضمی نے کہا : ہمیں لیث بن سعد نے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی مگر انھوں نے اس ( حدیث ) میں یہ کہا",
                "hadithArabic": "و حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنِي أَبِي حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ بِهَذَا الْإِسْنَادِ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ فَإِنَّ فِي السَّنَةِ يَوْمًا يَنْزِلُ فِيهِ وَبَاءٌ وَزَادَ فِي آخِرِ الْحَدِيثِ قَالَ اللَّيْثُ فَالْأَعَاجِمُ عِنْدَنَا يَتَّقُونَ ذَلِكَ فِي كَانُونَ الْأَوَّلِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12820,
                "hadithNumber": "5257",
                "englishNarrator": "Salim, on the authority of his father, reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: Do not leave the fire burning in your houses when you go to sleep.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \" جب تم سونے لگو تواپنے گھروں میں ( جلتی ہوئی ) آگ نہ چھوڑا کرو ( اسے پوری طرح بجھا دیا کرو ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، عمرو ناقد اور زہیر بن حرب نے بیان کیا، انہوں نے کہا: ہم سے سفیان بن عیینہ نے زہری کی سند سے بیان کیا, سالم نے اپنے والد ( حضرت عبداللہ بن عمر رضی اللہ عنہ ) سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَتْرُكُوا النَّارَ فِي بُيُوتِكُمْ حِينَ تَنَامُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12821,
                "hadithNumber": "5258",
                "englishNarrator": "Abu Musa رضی اللہ عنہ reported:",
                "hadithEnglish": "A house was burnt down in Medina during the night over its inhabitants. When their matter was reported to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), he said; This fire is an enemy of yours. So when you go to sleep, extinguish it.",
                "hadithUrdu": "مدینہ میں ایک گھر اپنے رہنے والوں کے اوپر جل گرا ۔ جب رسول اللہ صلی اللہ علیہ وسلم کو ان کا حال سنایا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" یہ آگ جو ہے یہ تمہاری دشمن ہے ۔ جب تم سونے لگو تو اس کو خود سے ( ہٹانے کے لیے ) بجھا ہٹا دیاکرو ۔ \"",
                "urduNarrator": "سعید بن عمرو اشعثی، ابو بکر بن ابی شیبہ، محمد بن عبداللہ بن نمیر، ابو عامر اشعری اور ابو کریب، اور تلفظ ابو عامر کا ہے, حضرت ابو موسیٰ رضی اللہ عنہ سے ر وایت ہے ، کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو عَامِرٍ الْأَشْعَرِيُّ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِأَبِي عَامِرٍ قَالُوا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَ احْتَرَقَ بَيْتٌ عَلَى أَهْلِهِ بِالْمَدِينَةِ مِنْ اللَّيْلِ فَلَمَّا حُدِّثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَأْنِهِمْ قَالَ إِنَّ هَذِهِ النَّارَ إِنَّمَا هِيَ عَدُوٌّ لَكُمْ فَإِذَا نِمْتُمْ فَأَطْفِئُوهَا عَنْكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12822,
                "hadithNumber": "5259",
                "englishNarrator": "Hudhaifa رضی اللہ عنہ reported:",
                "hadithEnglish": "When we attended a dinner along with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) we did not lay our hands on the food until Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had laid his hand and commenced eating (the food). Once we went with him to a dinner when a girl came rushingly as it someone had been pursuing her. She was about to lay her hand on the food, when Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) caught her hand. Then a desert Arab came there (rushingly) as if someone had been pursuing him. He (the Holy Prophet) caught his hand; and then Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Satan considers that food lawful on which Allah's name is not mentioned. He had brought this girl so that the food might be made lawful for him and I caught her hand. And he had brought a desert Arab so that (the food) might be lawful for him. So I caught his hand. By Him, in Whose hand is my life, it was (Satan's) hand that was in my hand along with her hand.",
                "hadithUrdu": "جب ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ کھانا کھاتے تو اپنے ہاتھ نہ ڈالتے جب تک آپ صلی اللہ علیہ وسلم شروع نہ کرتے اور ہاتھ نہ ڈالتے ۔ ایک دفعہ ہم آپ صلی اللہ علیہ وسلم کے ساتھ کھانے پر موجود تھے اور ایک لڑکی دوڑتی ہوئی آئی جیسے کوئی اس کو ہانک رہا ہے اور اس نے اپنا ہاتھ کھانے میں ڈالنا چاہا تو آپ صلی اللہ علیہ وسلم نے اس کا ہاتھ پکڑ لیا ۔ پھر ایک دیہاتی دوڑتا ہوا آیا تو آپ صلی اللہ علیہ وسلم نے اس کا ہاتھ تھام لیا ۔ پھر فرمایا کہ شیطان اس کھانے پر قدرت پا لیتا ہے جس پر اللہ تعالیٰ کا نام نہ لیا جائے اور وہ ایک لڑکی کو اس کھانے پر قدرت حاصل کرنے کو لایا تو میں نے اس کا ہاتھ پکڑ لیا ، پھر اس دیہاتی کو اسی غرض سے لایا تو میں نے اس کا بھی ہاتھ پکڑ لیا ، قسم اس کی جس کے ہاتھ میں میری جان ہے!اس ( شیطان ) کا ہاتھ اس لڑکی کے ہاتھ کے ساتھ میرے ہاتھ میں ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا: ابو معاویہ نے اعمش سے ، انھوں نے خیثمہ سے ، انھوں ن ابوحذیفہ سے ، انھوں نے حضرت حذیفہ رضی اللہ عنہ سے روایت کی ، کہا : کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ خَيْثَمَةَ عَنْ أَبِي حُذَيْفَةَ عَنْ حُذَيْفَةَ قَالَ كُنَّا إِذَا حَضَرْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا لَمْ نَضَعْ أَيْدِيَنَا حَتَّى يَبْدَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَضَعَ يَدَهُ وَإِنَّا حَضَرْنَا مَعَهُ مَرَّةً طَعَامًا فَجَاءَتْ جَارِيَةٌ كَأَنَّهَا تُدْفَعُ فَذَهَبَتْ لِتَضَعَ يَدَهَا فِي الطَّعَامِ فَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهَا ثُمَّ جَاءَ أَعْرَابِيٌّ كَأَنَّمَا يُدْفَعُ فَأَخَذَ بِيَدِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الشَّيْطَانَ يَسْتَحِلُّ الطَّعَامَ أَنْ لَا يُذْكَرَ اسْمُ اللَّهِ عَلَيْهِ وَإِنَّهُ جَاءَ بِهَذِهِ الْجَارِيَةِ لِيَسْتَحِلَّ بِهَا فَأَخَذْتُ بِيَدِهَا فَجَاءَ بِهَذَا الْأَعْرَابِيِّ لِيَسْتَحِلَّ بِهِ فَأَخَذْتُ بِيَدِهِ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ يَدَهُ فِي يَدِي مَعَ يَدِهَا.",
                "headingArabic": "آدَابِ الطَّعَامِ وَالشَّرَابِ وَأَحْكَامِهِمَا ‏‏",
                "headingUrdu": "کھانے پینے کے آداب اور ان کے احکام",
                "headingEnglish": "The etiquette of eating and drinking, and rulings thereon",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12823,
                "hadithNumber": "5260",
                "englishNarrator": "Hudhaifa bin al-Yaman رضی اللہ عنہ reported:",
                "hadithEnglish": "When we were invited to a dinner with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) ; the rest of hadith is the same but there is a slight variation of wording (and the variation is) that in that hadith the desert Arab precedes the arrival of that girl, and at the conclusion there is an addition (to this effect): He (the Holy Prophet) then mentioned the name of Allah and ate.",
                "hadithUrdu": "جب ہمیں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ کھانے کی دعوت دی جاتی ، پھر ابومعاویہ کی حدیث کی طرح حدیث بیان کی ، اورکہا : جیسے اس ( بدو ) کو پیچھے سے زور سے دھکیلا جارہا ہو ۔ اورلڑکی کے بارے میں کہا : جیسے اسے پیچھے سے زور دے دھکیلا جارہا ہو ، انھوں نے ا پنی حدیث میں بدو کے آنے کا ذکرپہلے کیا اور لڑکی کے آنے کا بعد میں اور حدیث کے آخر میں اضافہ کیا : \" پھر آپ صلی اللہ علیہ وسلم نے بسم اللہ پڑھی اور تناول فرمایا ۔ \"",
                "urduNarrator": "اور ہم سے اسحاق بن ابراہیم الحنظلی نے بیان کیا, عیسیٰ بن یونس نے کہا : ہمیں اعمش نے خیثمہ بن عبدالرحمن سے خبر دی ، انھوں نے ابو حذیفہ ارحبی سے ، انھوں نے حضرت حذیفہ بن یمان رضی اللہ عنہ سےروایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ أَخْبَرَنَا الْأَعْمَشُ عَنْ خَيْثَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي حُذَيْفَةَ الْأَرْحَبِيِّ عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ قَالَ كُنَّا إِذَا دُعِينَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى طَعَامٍ فَذَكَرَ بِمَعْنَى حَدِيثِ أَبِي مُعَاوِيَةَ وَقَالَ كَأَنَّمَا يُطْرَدُ وَفِي الْجَارِيَةِ كَأَنَّمَا تُطْرَدُ وَقَدَّمَ مَجِيءَ الْأَعْرَابِيِّ فِي حَدِيثِهِ قَبْلَ مَجِيءِ الْجَارِيَةِ وَزَادَ فِي آخِرِ الْحَدِيثِ ثُمَّ ذَكَرَ اسْمَ اللَّهِ وَأَكَلَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12824,
                "hadithNumber": "5261",
                "englishNarrator": null,
                "hadithEnglish": "It was narrated from Al-A'mash with this chain of narrators (a Hadith similar to no. 5260), but he did not mentioned the girl arrival before that of the Bedouin.",
                "hadithUrdu": "مجھ سے ابوبکر بن نافع نے بیان کیا، ہم سے عبدالرحمٰن نے بیان کیا, سفیان نے اعمش سے اسی سند کے ساتھ حدیث بیان کی اور لڑکی کا آنا ، اعرابی کے آنے سے پہلے بیان کیا ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ أَبُو بَكْرِ بْنُ نَافِعٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ وَقَدَّمَ مَجِيءَ الْجَارِيَةِ قَبْلَ مَجِيءِ الْأَعْرَابِيِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12825,
                "hadithNumber": "5262",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When a person enters his house and mentions the name of Allah at the time of entering it and while eating the food, Satan says (addressing himself: You have no place to spend the night and no evening meal; but when he enters without mentioning the name of Allah, the Satan says: You have found a place to spend the night, and when he does not mention the name of Allah while eating food, he (the Satan) says: You have found a place to spend the night and evening meal.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \" کہ جب آدمی اپنے گھر میں جاتا ہے ، اور گھر میں داخل ہوتے وقت اور کھانا کھاتے وقت اللہ جل جلالہ کا نام لیتا ہے ، تو شیطان ( اپنے رفیقوں اور تابعداروں سے ) کہتا ہے کہ نہ تمہارے یہاں رہنے کا ٹھکانہ ہے ، نہ کھانا ہے اور جب گھر میں داخل ہوتے وقت اللہ تعالیٰ کا نام نہیں لیتا تو شیطان کہتا ہے کہ تمہیں رہنے کا ٹھکانہ تو مل گیا اور جب کھاتے وقت بھی اللہ تعالیٰ کا نام نہیں لیتا تو شیطان کہتا ہے کہ تمہارے رہنے کا ٹھکانہ بھی ہوا اور کھانا بھی ملا ۔",
                "urduNarrator": "ہم سے محمد بن المثنا الانازی نے بیان کیا، ہم سے الضحاک نے بیان کیا, ابو عاصم نے ابن جریج سے روایت کی ، کہا : مجھے ابو زبیر نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے خبر دی ، انھوں نے رسول ا للہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ حَدَّثَنَا الضَّحَّاكُ يَعْنِي أَبَا عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا دَخَلَ الرَّجُلُ بَيْتَهُ فَذَكَرَ اللَّهَ عِنْدَ دُخُولِهِ وَعِنْدَ طَعَامِهِ قَالَ الشَّيْطَانُ لَا مَبِيتَ لَكُمْ وَلَا عَشَاءَ وَإِذَا دَخَلَ فَلَمْ يَذْكُرْ اللَّهَ عِنْدَ دُخُولِهِ قَالَ الشَّيْطَانُ أَدْرَكْتُمْ الْمَبِيتَ وَإِذَا لَمْ يَذْكُرْ اللَّهَ عِنْدَ طَعَامِهِ قَالَ أَدْرَكْتُمْ الْمَبِيتَ وَالْعَشَاءَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12826,
                "hadithNumber": "5263",
                "englishNarrator": "Jabir bin Abdullah رضی اللہ عنہ said that he heard the prophet ﷺ say...  Hadith like that of Abu Asim (no. 5262) except that he said:",
                "hadithEnglish": "\"If he does not mention the name of Allah when he enters.\"",
                "hadithUrdu": "\" اور اگر اس نے اپنے کھانے کے وقت اللہ کا نام نہ لیا اور اگر اس نے داخل ہوتے وقت اللہ کا نام نہ لیا ۔ \"",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا, روح بن عبادہ نے کہا : ہمیں ابن جریج نے حدیث بیان کی ، کہا : مجھے ابو زبیر نے بتایا کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ کویہ کہتے ہوئےسنا ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئےسنا ۔ ابوعاصم کی حدیث کے مانند ، البتہ انھوں نے یہ کہا",
                "hadithArabic": "و حَدَّثَنِيهِ إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ إِنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِمِثْلِ حَدِيثِ أَبِي عَاصِمٍ إِلَّا أَنَّهُ قَالَ وَإِنْ لَمْ يَذْكُرْ اسْمَ اللَّهِ عِنْدَ طَعَامِهِ وَإِنْ لَمْ يَذْكُرْ اسْمَ اللَّهِ عِنْدَ دُخُولِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12827,
                "hadithNumber": "5264",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said: Do not eat with your left hand, for the Satan eats with his left hand.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" بائیں ہاتھ سے نہ کھاؤ کیونکہ شیطان بائیں ہاتھ سے کھاتاہے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے لیث نے بیان کیا، ہم سے محمد بن رومح نے بیان کیا، ہم سے لیث نے بیان کیا، ابو الزبیر رضی اللہ عنہ سے, حضرت جابر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَأْكُلُوا بِالشِّمَالِ فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِالشِّمَالِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12828,
                "hadithNumber": "5265",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When any one of you intends to eat (meal), he should eat with his right hand. and when he (intends) to drink he should drink with his right hand, for the Satan eats with his left hand and drinks with his left hand.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص کھاناکھائے تواپنے دائیں ہاتھ سے کھائے اور جب تم میں سے کوئی شخص پیےتواپنے دائیں ہاتھ سے پیے کیونکہ شیطان بائیں ہاتھ سے کھاتاہے اوربائیں ہاتھ سے پیتا ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، محمد بن عبداللہ بن نمیر، زہیر بن حرب اور ابن ابی عمر نے بیان کیا، اور یہ قول ابن نمیر سے ہے, سفیان نے زہری سے ، انھوں نے ابو بکر بن عبیداللہ بن عبداللہ بن عمر سے ، انھوں نے اپنے دادا حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ أَبِي عُمَرَ وَاللَّفْظُ لِابْنِ نُمَيْرٍ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي بَكْرِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ جَدِّهِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَكَلَ أَحَدُكُمْ فَلْيَأْكُلْ بِيَمِينِهِ وَإِذَا شَرِبَ فَلْيَشْرَبْ بِيَمِينِهِ فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ وَيَشْرَبُ بِشِمَالِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12829,
                "hadithNumber": "5266",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is reported by Zuhri on the authority of Sufyan with a different chain of transmitters.",
                "hadithUrdu": "ہم سے قتیبہ بن سعید نے مالک بن انس کی سند سے بیان کیا، ان سے جو کچھ پڑھا گیا، ان سے، ان سے ابن نمیر نے بیان کیا، ہم سے ابی ایچ نے بیان کیا اور ہم سے ابن المثنیٰ نے بیان کیا۔ یحییٰ اور وہ دونوں قطان ہیں, عبیداللہ نے زہری سے سفیان کی سند کے ساتھ ( حدیث بیان کی ۔ )",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ فِيمَا قُرِئَ عَلَيْهِ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ كِلَاهُمَا عَنْ عُبَيْدِ اللَّهِ جَمِيعًا عَنْ الزُّهْرِيِّ بِإِسْنَادِ سُفْيَانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12830,
                "hadithNumber": "5267",
                "englishNarrator": "Salim, on the authority of his father reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: None of you should eat with his left hand and drink with that (left hand), for the Satan eats with left hand and drinks with that (hand). Nafi' has made this addition in that: Do not take up anything with that (left hand) and do not give anything with that ; and in the narration transmitted on the authority of Abu Tahir there is a slight variation of wording.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نےفرمایا؛ \"\" تم میں سے کوئی شخص نہ بائیں ہاتھ سے کھائے نہ اس ہاتھ سے پیے کیونکہ شیطان بائیں ہاتھ سے کھاتاہے ۔ اور اسی سے پیتا ہے ۔ نافع اس روایت میں یہ اضافہ کرتے ہیں ؛ \"\" نہ اس ( بائیں ہاتھ ) سے لے اور نہ اس کے ذریعے سےدے ۔ \"\" اورابوطاہر کی روایت میں ہے : \"\" تم میں سےکوئی شخص ( بائیں ہاتھ سے ) ہر گز نہ کھائے ۔ \"\"",
                "urduNarrator": "ابوطاہر اورحرملہ نے کہا : ہمیں عبداللہ بن وہب نے حدیث بیان کی ، کہا : مجھے عمر بن محمد نے حدیث بیان کی ، کہا : مجھے قاسم بن عبیداللہ بن عبداللہ بن عمر نے حدیث بیان کی ، انھوں نے سالم سے ، انھوں نے اپنے والد ( حضرت عبداللہ بن عمر رضی اللہ عنہ ) سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَ أَبُو الطَّاهِرِ أَخْبَرَنَا و قَالَ حَرْمَلَةُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ حَدَّثَنِي الْقَاسِمُ بْنُ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ حَدَّثَهُ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَأْكُلَنَّ أَحَدٌ مِنْكُمْ بِشِمَالِهِ وَلَا يَشْرَبَنَّ بِهَا فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ وَيَشْرَبُ بِهَا قَالَ وَكَانَ نَافِعٌ يَزِيدُ فِيهَا وَلَا يَأْخُذُ بِهَا وَلَا يُعْطِي بِهَا وَفِي رِوَايَةِ أَبِي الطَّاهِرِ لَا يَأْكُلَنَّ أَحَدُكُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12831,
                "hadithNumber": "5268",
                "englishNarrator": "Salama bin Akwa' رضی اللہ عنہ reported on the authority of his father رضی اللہ عنہ :",
                "hadithEnglish": "A person ate in the presence of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with his left hand, whereupon he said: Eat with your right hand. He said: I cannot do that, whereupon he (the Holy Prophet) said: May you not be able to do that. It was vanity that prevented him from doing it, and he could not raise it (the right hand) up to his mouth.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک شخص نے بائیں ہاتھ سے کھایا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ دائیں ہاتھ سے کھا ۔ وہ بولا کہ میرے سے نہیں ہو سکتا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کرے تجھ سے نہ ہو سکے ۔ اس نے ایسا غرور کی راہ سے کیا تھا ۔ راوی کہتا ہے کہ وہ ساری زندگی اس ہاتھ کو منہ تک نہ اٹھا سکا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے زید بن الحباب نے بیان کیا، عکرمہ بن عمار سے,  سیدنا ایاس بن سلمہ بن اکوع رضی اللہ عنہ اپنے والد رضی اللہ عنہ سے روایت کرتے ہیں کہ انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ حَدَّثَنِي إِيَاسُ بْنُ سَلَمَةَ بْنِ الْأَكْوَعِ أَنَّ أَبَاهُ حَدَّثَهُ أَنَّ رَجُلًا أَكَلَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشِمَالِهِ فَقَالَ كُلْ بِيَمِينِكَ قَالَ لَا أَسْتَطِيعُ قَالَ لَا اسْتَطَعْتَ مَا مَنَعَهُ إِلَّا الْكِبْرُ قَالَ فَمَا رَفَعَهَا إِلَى فِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12832,
                "hadithNumber": "5269",
                "englishNarrator": "Umar bin Abu Salama رضی اللہ عنہ reported:",
                "hadithEnglish": "I was under the care of Allah's Messenger (way peace be upon him), and as my hand used to roam about in the dish he said to me: Boy, mention the name of Allah, and eat with your right hand and eat from what is near to you.",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کی گود میں تھا ( آپ صلی اللہ علیہ وسلم کے گھر میں پرورش پارہا تھا ) اور میرا ہاتھ پیالے میں سب طرف گھوم رہا تھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے لڑکے : بسم اللہ پڑھ کر داہنے ہاتھ سے کھا اور جو پاس ہو ادھر سے کھا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابن ابی عمر سب نے سفیان کی سند سے بیان کیا، ابوبکر نے کہا: ہم سے سفیان بن عیینہ نے بیان کیا, ولید بن کثیر نے وہب بن کیسان سے روایت کی ، انھوں نے حضرت عمر بن ابی سلمہ رضی اللہ عنہ سے سنا ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ أَبِي عُمَرَ جَمِيعًا عَنْ سُفْيَانَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الْوَلِيدِ بْنِ كَثِيرٍ عَنْ وَهْبِ بْنِ كَيْسَانَ سَمِعَهُ مِنْ عُمَرَ بْنِ أَبِي سَلَمَةَ قَالَ كُنْتُ فِي حَجْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَتْ يَدِي تَطِيشُ فِي الصَّحْفَةِ فَقَالَ لِي يَا غُلَامُ سَمِّ اللَّهَ وَكُلْ بِيَمِينِكَ وَكُلْ مِمَّا يَلِيكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12833,
                "hadithNumber": "5270",
                "englishNarrator": "Umar bin Abu Salama رضی اللہ عنہ reported:",
                "hadithEnglish": "I (had the opportunity) one day to dine with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), and I picked up flesh from around the dish. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Eat from that which is near to you.",
                "hadithUrdu": "ایک دن میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ کھاناکھایااورمیں نے پیالے کی ہر جانب سے گوشت لیناشروع کیا تورسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اپنے آگے سے کھاؤ ۔ \"",
                "urduNarrator": "ہم سے حسن بن علی الحلوانی اور ابوبکر بن اسحاق نے بیان کیا، کہا کہ ہم سے ابن ابی مریم نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا, محمد بن عمرو بن حلحلہ نے وہب بن کیسان سے ، انھوں نے حضرت عمر بن ابی سلمہ رضی اللہ عنہ سےروایت کی کہ انھوں نےکہا",
                "hadithArabic": "و حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَأَبُو بَكْرِ بْنُ إِسْحَقَ قَالَا حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ أَخْبَرَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ حَلْحَلَةَ عَنْ وَهْبِ بْنِ كَيْسَانَ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ أَنَّهُ قَالَ أَكَلْتُ يَوْمًا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلْتُ آخُذُ مِنْ لَحْمٍ حَوْلَ الصَّحْفَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلْ مِمَّا يَلِيكَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12834,
                "hadithNumber": "5271",
                "englishNarrator": "Abu Sa'id (Khudri) رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade from turning the water skins upside down and drinking from its mouth.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ( منہ لگا کر پینے کے لیے ) مشکوں کو الٹانے سے منع فرمایا ۔",
                "urduNarrator": "عمرو الناقد نے ہمیں بتایا, سفیان بن عینیہ نے زہری سے ، انھوں نے عبیداللہ سے ، انھوں نے حضرت ابوسعید رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ قَالَ نَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ اخْتِنَاثِ الْأَسْقِيَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12835,
                "hadithNumber": "5272",
                "englishNarrator": "Abu Sa'id Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's, Messenger (ﷺ) forbade from turning the waterskins upside down and drinking from their mouths.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مشکوں کوالٹنے سے ( یعنی براہ راست ) ان کے منہ سے پانی پینے سے منع فرمایا ہے ۔",
                "urduNarrator": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یونس نے ابن شہاب سے ، انھوں نے عبیداللہ بن عبداللہ بن عتبہ سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے روایت کی کہ انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّهُ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ اخْتِنَاثِ الْأَسْقِيَةِ أَنْ يُشْرَبَ مِنْ أَفْوَاهِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12836,
                "hadithNumber": "5273",
                "englishNarrator": "This hadith has been reported from Zuhri with the same chain of transmitters, but he also said that Ikhtinath means",
                "hadithEnglish": "Its head (i.e. of the water skin) be turned upside down and then (water) be drank from that.",
                "hadithUrdu": "مشک کا منہ الٹ کر اس میں سے ( براہ راست ) پانی پیا جائے ۔",
                "urduNarrator": "اور ہم سے عبد بن حمید نے بیان کیا , معمر نے زہری سے اسی سند کے ساتھ اسی کے مانند روایت کی ، البتہ انھوں نے کہا : ان ( مشکوں ) کا اختناث یہ ہے کہ",
                "hadithArabic": "و حَدَّثَنَاه عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّهُ قَالَ وَاخْتِنَاثُهَا أَنْ يُقْلَبَ رَأْسُهَا ثُمَّ يُشْرَبَ مِنْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12837,
                "hadithNumber": "5274",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) disapproved the drinking of water while standing.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے کھڑے ہوکرپانی پینے سے ڈانٹ کر منع فرمایا ۔",
                "urduNarrator": "ہم سے حداب بن خالد نے بیان کیا, ہمام نے کہا : ہمیں قتادہ نے حدیث بیان کی ، انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَجَرَ عَنْ الشُّرْبِ قَائِمًا.",
                "headingArabic": "كَرَاهِيَةِ الشُّرْبِ قَائِمًا ‏‏",
                "headingUrdu": "کھڑے ہو کر پینا",
                "headingEnglish": "Drinking while standing",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12838,
                "hadithNumber": "5275",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade that a person should drink while standing. Qatada reported: We said to him: What about eating? Thereupon he (Anas) said: That is even worse and more detestable (abominable).",
                "hadithUrdu": "آپ نے کھڑے ہوکر پانی پینے سے منع فرمایا ۔ قتادہ نے کہا : ہم نے پوچھا اور ( کھڑے ہوکر ) کھانا؟تو ( حضرت انس رضی اللہ عنہ نے ) کہا : یہ زیادہ برا اورگندا ( طریقہ ) ہے ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے عبد الاعلی نے بیان کیا, سعید نے قتادہ سے ، انھوں نے حضرت انس رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى أَنْ يَشْرَبَ الرَّجُلُ قَائِمًا قَالَ قَتَادَةُ فَقُلْنَا فَالْأَكْلُ فَقَالَ ذَاكَ أَشَرُّ أَوْ أَخْبَثُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12526,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=501",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=499",
                "label": "499",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=500",
                "label": "500",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=501",
                "label": "501",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=502",
                "label": "502",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=503",
                "label": "503",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=504",
                "label": "504",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=505",
                "label": "505",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=503",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=503",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=501",
        "to": 12550,
        "total": 40465
    }
}