{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 520,
        "data": [
            {
                "id": 13264,
                "hadithNumber": "5701",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported so many abidith from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) and he reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The influence of an evil eye is a fact.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" نظر حق ( ثابت شدہ بات ) ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا, ہمام بن منبہ نے کہا : یہ احادیث جو ہمیں حضرت ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے ر وایت کیں ، انھوں نے متعدد احادیث بیان کیں ، ان میں سے ایک یہ ہے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَيْنُ حَقٌّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13265,
                "hadithNumber": "5702",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The influence of an evil eye is a fact; if anything would precede the destiny it would be the influence of an evil eye, and when you are asked to take bath (as a cure) from the influence of an evil eye, you should take bath.",
                "hadithUrdu": "آ پ نے فرمایا : \" نظر حق ( ثابت شدہ بات ) ہے ، اگر کوئی ایسی چیز ہوتی جو تقدیر پر سبقت لے جاسکتی تو نظرسبقت ہے جاتی ۔ اور جب ( نظر بد کے علاج کےلیے ) تم سے غسل کرنے کے لئے کہا جائے تو غسل کرلو ۔ \"",
                "urduNarrator": "اور ہم سے عبداللہ بن عبدالرحمٰن دارمی، حجاج بن الشاعر اور احمد بن خراش نے بیان کیا، انہوں نے کہا کہ ہم سے اس نے بیان کیا اور باقی دو نے کہا کہ ہم سے بیان کیا۔ مسلم بن ابراہیم نے کہا: ہم سے وہیب نے ابن طاؤس کی سند سے، اپنے والد کی سند سے، ابن کی سند سے, حضرت ابن عباس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ وَحَجَّاجُ بْنُ الشَّاعِرِ وَأَحْمَدُ بْنُ خِرَاشٍ قَالَ عَبْدُ اللَّهِ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا وُهَيْبٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعَيْنُ حَقٌّ وَلَوْ كَانَ شَيْءٌ سَابَقَ الْقَدَرَ سَبَقَتْهُ الْعَيْنُ وَإِذَا اسْتُغْسِلْتُمْ فَاغْسِلُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13266,
                "hadithNumber": "5703",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "A Jew from among the Jews of Banu Zuraiq who was called Labid bin al-A'sam cast a spell upon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) with the result that he (under the influence of the spell) felt that he had been doing something whereas in fact he had not been doing that. (This state of affairs lasted) until one day or during one night Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) made supplication (to dispel its effects). He again made a supplication and he again did this and said to 'A'isha رضی اللہ عنہا : Do you know that Allah has told me what I had asked Him? There came to me two men and one amongst them sat near my head and the other one near my feet and he who sat near my head said to one who sat near my feet or one who sat near my feet said to one who sat near my head: What is the trouble with the man? He said: The spell has affected him. He said: Who has cast that? He (the other one) said: It was Labid b. A'sam (who has done it). He said: What is the thing by which he transmitted its effect? He said: By the comb and by the hair stuck to the comb and the spathe of the date-palm. He said: Where is that? He replied: In the well of Dhi Arwan. She said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) sent some of the persons from among his Companions there and then said: 'A'isha رضی اللہ عنہا , by Allah, its water was yellow like henna and its trees were like heads of the devils. She said that she asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as to why he did not burn that. He said: No, Allah has cured me and I do not like that I should induce people to commit any high-handedness in regard (to one another), but I only commanded that it should be buried.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم پر بنی زریق کے ایک یہودی لبید بن اعصم نے جادو کیا ۔ یہاں تک کہ آپ صلی اللہ علیہ وسلم کو خیال آتا کہ میں یہ کام کر رہا ہوں حالانکہ وہ کام کرتے نہ تھے ۔ ایک دن یا ایک رات آپ صلی اللہ علیہ وسلم نے دعا کی ، پھر دعا کی ، پھر فرمایا کہ اے عائشہ! تجھے معلوم ہوا کہ اللہ جل جلالہ نے مجھے وہ بتلا دیا جو میں نے اس سے پوچھا؟ ۔ میرے پاس دو آدمی آئے ، ایک میرے سر کے پاس بیٹھا اور دوسرا پاؤں کے پاس ( وہ دونوں فرشتے تھے ) جو سر کے پاس بیٹھا تھا ، اس نے دوسرے سے کہا جو پاؤں کے پاس بیٹھا تھا اس نے سر کے پاس بیٹھے ہوئے سے کہا کہ اس شخص کو کیا بیماری ہے؟ وہ بولا کہ اس پر جادو ہوا ہے ۔ اس نے کہا کہ کس نے جادو کیا ہے؟ وہ بولا کہ لبید بن اعصم نے ۔ پھر اس نے کہا کہ کس میں جادو کیا ہے؟ وہ بولا کہ کنگھی میں اور ان بالوں میں جو کنگھی سے جھڑے اور نر کھجور کے گابھے کے ریشے میں ۔ اس نے کہا کہ یہ کہاں رکھا ہے؟ وہ بولا کہ ذی اروان کے کنوئیں میں ۔ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہا کہ پھر رسول اللہ صلی اللہ علیہ وسلم اپنے چند اصحاب کے ساتھ اس کنوئیں پر گئے اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے عائشہ! اللہ کی قسم اس کنوئیں کا پانی ایسا تھا جیسے مہندی کا زلال اور وہاں کے کھجور کے درخت ایسے تھے جیسے شیطانوں کے سر ۔ میں نے عرض کیا کہ یا رسول اللہ! آپ صلی اللہ علیہ وسلم نے اس کو جلا کیوں نہیں دیا؟ ( یعنی وہ جو بال وغیرہ نکلے ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے تو اللہ نے ٹھیک کر دیا ، اب مجھے لوگوں میں فساد بھڑکانا برا معلوم ہوا ، پس میں نے حکم دیا اور وہ دفن کر دیا گیا ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا, ابن نمیر نے ہشام سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا : کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ سَحَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَهُودِيٌّ مِنْ يَهُودِ بَنِي زُرَيْقٍ يُقَالُ لَهُ لَبِيدُ بْنُ الْأَعْصَمِ قَالَتْ حَتَّى كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُخَيَّلُ إِلَيْهِ أَنَّهُ يَفْعَلُ الشَّيْءَ وَمَا يَفْعَلُهُ حَتَّى إِذَا كَانَ ذَاتَ يَوْمٍ أَوْ ذَاتَ لَيْلَةٍ دَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ دَعَا ثُمَّ دَعَا ثُمَّ قَالَ يَا عَائِشَةُ أَشَعَرْتِ أَنَّ اللَّهَ أَفْتَانِي فِيمَا اسْتَفْتَيْتُهُ فِيهِ جَاءَنِي رَجُلَانِ فَقَعَدَ أَحَدُهُمَا عِنْدَ رَأْسِي وَالْآخَرُ عِنْدَ رِجْلَيَّ فَقَالَ الَّذِي عِنْدَ رَأْسِي لِلَّذِي عِنْدَ رِجْلَيَّ أَوْ الَّذِي عِنْدَ رِجْلَيَّ لِلَّذِي عِنْدَ رَأْسِي مَا وَجَعُ الرَّجُلِ قَالَ مَطْبُوبٌ قَالَ مَنْ طَبَّهُ قَالَ لَبِيدُ بْنُ الْأَعْصَمِ قَالَ فِي أَيِّ شَيْءٍ قَالَ فِي مُشْطٍ وَمُشَاطَةٍ قَالَ وَجُفِّ طَلْعَةِ ذَكَرٍ قَالَ فَأَيْنَ هُوَ قَالَ فِي بِئْرِ ذِي أَرْوَانَ قَالَتْ فَأَتَاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أُنَاسٍ مِنْ أَصْحَابِهِ ثُمَّ قَالَ يَا عَائِشَةُ وَاللَّهِ لَكَأَنَّ مَاءَهَا نُقَاعَةُ الْحِنَّاءِ وَلَكَأَنَّ نَخْلَهَا رُءُوسُ الشَّيَاطِينِ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ أَفَلَا أَحْرَقْتَهُ قَالَ لَا أَمَّا أَنَا فَقَدْ عَافَانِي اللَّهُ وَكَرِهْتُ أَنْ أُثِيرَ عَلَى النَّاسِ شَرًّا فَأَمَرْتُ بِهَا فَدُفِنَتْ.",
                "headingArabic": "السِّحْرِ ‏‏",
                "headingUrdu": "جادو ٹونا، جادو",
                "headingEnglish": "Witchcraft, Magic",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13267,
                "hadithNumber": "5704",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) was affected with a spell, the rest of the hadith is the same but with this variation of wording: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) went to the well and looked towards it and there were trees of date-palm near it. I ('A'isha رضی اللہ عنہا) said: I asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) to bring it out, and 1 did not say: Why did not you burn it? And there is no mention of these words: I commanded (to bury them and they buried.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم پر جادو کیا گیا ۔ اسکے بعد ابو کریب نے واقعے کی تفصیلات سمیت ابن نمیر کی حدیث کی طرح حدیث بیان کی اور اس میں کہا : پھر رسول اللہ صلی اللہ علیہ وسلم کنویں کی طرف تشریف لئے گئے ، اسے دیکھا ، اس کنویں پر کھجور کے درخت تھے ( جنھیں کسی زمانے میں کنویں کے پانی سےسیراب کیاجاتا ہوگا ) انھوں ( حضرت عائشہ رضی اللہ عنہا ) نے کہا : میں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !اسے نکالیں ( اور جلادیں ) ابو کریب نے : \" آپ نے اسے جلا کیوں نہ دیا؟ \" کے الفاظ نہیں کہے اور یہ الفاظ ( بھی ) بیان نہیں کیے؛ \" میں نے اس کے بار ے میں حکم دیا تو اس کو پاٹ دیاگیا ۔ \"",
                "urduNarrator": "ابو کریب نے کہا , ہمیں ابو اسامہ نے حدیث بیان کی ، کہا ، ہمیں ہشام نے اپنے والد سے حدیث بیا ن کی ، انھوں نےحضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ سُحِرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَاقَ أَبُو كُرَيْبٍ الْحَدِيثَ بِقِصَّتِهِ نَحْوَ حَدِيثِ ابْنِ نُمَيْرٍ وَقَالَ فِيهِ فَذَهَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْبِئْرِ فَنَظَرَ إِلَيْهَا وَعَلَيْهَا نَخْلٌ وَقَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ فَأَخْرِجْهُ وَلَمْ يَقُلْ أَفَلَا أَحْرَقْتَهُ وَلَمْ يَذْكُرْ فَأَمَرْتُ بِهَا فَدُفِنَتْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13268,
                "hadithNumber": "5705",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "A Jewess came to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) with poisoned mutton and he took of that what had been brought to him (Allah's Messenger ﷺ). (When the effect of this poison were felt by him) he called for her and asked her about that, whereupon she said: I had determined to kill you. Thereupon he said: Allah will never give you the power to do it. He (the narrator) said that they (the Companion's of the Holy Prophet ﷺ) said: Should we not kill her? Thereupon he said: No. He (Anas رضی اللہ عنہ) said: I felt (the affects of this poison) on the uvula of Allah's Messenger.",
                "hadithUrdu": "ایک یہودی عورت رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک زہر آلود ( پکی ہوئی ) بکری لے کر آئی ، نبی کریم صلی اللہ علیہ وسلم نے اس میں سے کچھ ( گوشت کھایا ) ( آپ کو اس کے زہر آلود ہونے کاپتہ چل گیا ) تو اس عورت کو رسول اللہ صلی اللہ علیہ وسلم کے پاس لایاگیا ، آپ نے اس عورت سے اس ( زہر ) کے بارے میں پوچھا تو اس نے کہا : ( نعوذ باللہ! ) میں آپ کو قتل کرنا چاہتی تھی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ ایسا نہیں کرے گا کہ تمھیں اس بات پر تسلط ( اختیار ) دے دے ۔ \" انھوں ( انس رضی اللہ عنہ ) نےکہا : یا آپ صلی اللہ علیہ وسلم نے فرمایا : \" ( تمھیں ) مجھ پر ( تسلط دے دے ۔ ) \" انھوں ( انس رضی اللہ عنہ ) نے کہا : صحابہ رضوان اللہ عنھم اجمعین نے عرض کی : کیا ہم اسے قتل نہ کردیں؟آپ صلی اللہ علیہ وسلم نےفرمایا : \" نہیں ۔ \" انھوں ( انس  رضی اللہ عنہ ) نے کہا : تو میں اب بھی رسول اللہ صلی اللہ علیہ وسلم کےدہن مبارک کے اندرونی حصے میں اسکے اثرات کو پہچانتاہوں ۔",
                "urduNarrator": "ہم سے یحییٰ بن حبیب الحارثی نے بیان کیا, خالد بن حارث نے کہا : ہمیں شعبہ نے ہشام بن زید سے حدیث بیان کی ، انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا شُعْبَةُ عَنْ هِشَامِ بْنِ زَيْدٍ عَنْ أَنَسٍ أَنَّ امْرَأَةً يَهُودِيَّةً أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ مَسْمُومَةٍ فَأَكَلَ مِنْهَا فَجِيءَ بِهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهَا عَنْ ذَلِكَ فَقَالَتْ أَرَدْتُ لِأَقْتُلَكَ قَالَ مَا كَانَ اللَّهُ لِيُسَلِّطَكِ عَلَى ذَاكِ قَالَ أَوْ قَالَ عَلَيَّ قَالَ قَالُوا أَلَا نَقْتُلُهَا قَالَ لَا قَالَ فَمَا زِلْتُ أَعْرِفُهَا فِي لَهَوَاتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": "السَّمِّ ‏‏",
                "headingUrdu": "زہر",
                "headingEnglish": "Poison",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13269,
                "hadithNumber": "5706",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "A Jewess brought poisoned meat and then served it to Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌)",
                "hadithUrdu": "ایک یہودی عورت نے گوشت میں زہرملادیا اور پھر اس ( گوشت ) کو رسول اللہ صلی اللہ علیہ وسلم کے پا س لے آئی ، جس طرح خالد ( بن حارث ) کی حدیث ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن حبیب الحارثی نے بیان کیا, روح بن عبادہ نےکہا ,  ہمیں شعبہ نے حدیث بیان کی ، کہا : میں نے ہشام بن زید سے سنا ، انھوں نےکہا : میں نے حضرت انس رضی اللہ عنہ سے سنا ، وہ حدیث بیان کررہے تھے کہ",
                "hadithArabic": "و حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا شُعْبَةُ سَمِعْتُ هِشَامَ بْنَ زَيْدٍ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يُحَدِّثُ أَنَّ يَهُودِيَّةً جَعَلَتْ سَمًّا فِي لَحْمٍ ثُمَّ أَتَتْ بِهِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِ خَالِدٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13270,
                "hadithNumber": "5707",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "When any person amongst us fell ill, Allah's Messenger (may peace he upon him) used to rub him with his right band and then say: O Lord of the people, grant him health, heal him, for Thou art a Greet Healer. There is no healere, but with Thy healing Power one is healed and illness is removed. She further added: When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) fell ill, and his illness took a serious turn I took hold of hie hand to that I should do with it what he ward to do with that (i.e. I would rub his body with his sacred hand). But he withdrew his hand from my hand and then said: O Allah, pardon me and make me join the companion. ship on She said. I was gazing at him constantly whereas he had passed away.",
                "hadithUrdu": "جب ہم میں سے کوئی شخص بیمار ہوتا تو رسول اللہ صلی اللہ علیہ وسلم اس ( کےمتاثرہ حصے ) پر اپنا دایاں ہاتھ پھیرتے ، پھر فرماتے : \"\" تکلیف کو دور کردے ، اے تمام انسانوں کے پالنے والے!شفا دے ، تو ہی شفا دینے والا ہے ، تیری شفا کے سوا کوئی شفا نہیں ، ایسی شفا جو بیماری کو ( ذرہ برابر باقی ) نہیں چھوڑتی ۔ \"\" پھر جب رسول اللہ صلی اللہ علیہ وسلم بیمار ہوئے اورآپ کے لیے اعضاء کو حرکت دینا مشکل ہوگیا تو میں نے آپ کا دست مبارک تھاماتاکہ جس طرح خود آپ صلی اللہ علیہ وسلم کیاکرتے تھے ، میں بھی اسی طرح کروں تو آپ صلی اللہ علیہ وسلم نے اپنا ہاتھ میرے ہاتھ سے چھڑا لیا ، پھر فرمایا : \"\" اے میرے اللہ!مجھے بخش دے اور مجھے رفیق اعلیٰ کی معیت عطا کردے ۔ \"\" انھوں نے کہا : پھر میں دیکھنے لگی تو آپ رحلت فرماچکے تھے ۔",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا اور ہم سے اسحاق بن ابراہیم نے بیان کیا اور ان کا تلفظ ہے, جریر نے اعمش سے ، انھوں نے ابوضحیٰ سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ زُهَيْرٌ وَاللَّفْظُ لَهُ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اشْتَكَى مِنَّا إِنْسَانٌ مَسَحَهُ بِيَمِينِهِ ثُمَّ قَالَ أَذْهِبْ الْبَاسَ رَبَّ النَّاسِ وَاشْفِ أَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًا فَلَمَّا مَرِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَثَقُلَ أَخَذْتُ بِيَدِهِ لِأَصْنَعَ بِهِ نَحْوَ مَا كَانَ يَصْنَعُ فَانْتَزَعَ يَدَهُ مِنْ يَدِي ثُمَّ قَالَ اللَّهُمَّ اغْفِرْ لِي وَاجْعَلْنِي مَعَ الرَّفِيقِ الْأَعْلَى قَالَتْ فَذَهَبْتُ أَنْظُرُ فَإِذَا هُوَ قَدْ قَضَى.",
                "headingArabic": "اسْتِحْبَابِ رُقْيَةِ الْمَرِيضِ ‏‏",
                "headingUrdu": "بیمار کے لیے رقیہ پڑھنا مستحب ہے۔",
                "headingEnglish": "It Is Recommended To Recite Ruqyah For One Who Is Sick",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13271,
                "hadithNumber": "5708",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Shu'ba through another chain of transmitters (and the words are): He rubbed him with his hand and (in) the hadith transmitted on the authority of Thauri (the words are). He used to rub with his right hand. This hadith has been reported through another chain of transmitters.",
                "hadithUrdu": "یحییٰ بن یحییٰ نے کہا : ہمیں ہشیم نے خبر دی ، ابو بکر بن خلاد اور بو کریب نے کہا : ہمیں ابو معاویہ نے حدیث بیان کی ، بشر بن خالد نےکہا : ہمیں محمد بن جعفر نے حدیث سنائی ۔ ابن بشار نے کہا؛ \"\" ہمیں ابن عدی نے حدیث بیان کی ، ان دونوں ( محمد بن جعفر اور ابن ابی عدی ) نے شعبہ سے روایت کی ۔ ( اسی طرح ) ابو بکر بن ابی شیبہ اور ابو بکر بن خلاد نے بھی ہمیں یہ حدیث بیان کی ، دونوں نے کہا : ہمیں یحییٰ قطان نے سفیان سے حدیث بیان کی ، ان سب نے جریرکی سند کےساتھ اعمش سے روایت کی ۔ ہشیم اورشعبہ کی روایت میں ہے کہ آپ صلی اللہ علیہ وسلم اپنا ہاتھ اس ( متاثرہ حصے ) پر پھیرتے اور ( سفیان ) ثوری کی حدیث میں ہے : آپ اپنا دایاں ہاتھ اس پر پھیرتے ۔ اوراعمش سےسفیان اور ان سے یحییٰ کی روایت کردہ حدیث کے آخر میں ہے ، کہا : میں نے منصور کو یہ حدیث سنائی تو انھوں نے اسی کے مطابق حضرت عائشہ رضی اللہ تعالیٰ عنہا سے مسروق اور ان سے ابراہیم کی روایت کردہ حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ و حَدَّثَنِي بِشْرُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ و حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ كِلَاهُمَا عَنْ شُعْبَةَ و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو بَكْرِ بْنُ خَلَّادٍ قَالَا حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ عَنْ سُفْيَانَ كُلُّ هَؤُلَاءِ عَنْ الْأَعْمَشِ بِإِسْنَادِ جَرِيرٍ فِي حَدِيثِ هُشَيْمٍ وَشُعْبَةَ مَسَحَهُ بِيَدِهِ قَالَ وَفِي حَدِيثِ الثَّوْرِيِّ مَسَحَهُ بِيَمِينِهِ و قَالَ فِي عَقِبِ حَدِيثِ يَحْيَى عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ قَالَ فَحَدَّثْتُ بِهِ مَنْصُورًا فَحَدَّثَنِي عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ بِنَحْوِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13272,
                "hadithNumber": "5709",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) visited the sick he would say: Lord of the people. remove the disease, cure him, for Thou art the great Curer, there is no cure but through Thine healing Power, which leaves nothing of the disease.",
                "hadithUrdu": "بلا شبہ رسول ا للہ صلی اللہ علیہ وسلم جب کسی مریض کی عیادت کرتے تھے تو فرماتے : \" تکلیف دور کردے ، اے سب لوگوں کے پالنے والے!اس کو شفا عطا کر ، تو شفا دینے والا ہے ، تیری شفا کے سوا کوئی شفا نہیں ، ایسی شفا ( دے ) جو ( ذرہ برابر ) بیماری کو نہ چھوڑے ۔ \"",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا, ابوعوانہ نے منصور سے ، انھوں نےابراہیم سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا عَادَ مَرِيضًا يَقُولُ أَذْهِبْ الْبَاسَ رَبَّ النَّاسِ اشْفِهِ أَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13273,
                "hadithNumber": "5710",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) came to visit any sick he supplicated for him and said: Lord of the people, remove the malady, cure him for Thou art a great Curer. There is no cure but through Thine healing Power which leaves no trouble, and in the narration transmitted on the authority of Abu Bakr there is a slight variation of wording.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب کسی مریض کے پاس تشریف لاتے تواس کے لئے دعا فرماتے ہوئے کہتے : \" تکلیف دور کردے ، اے سب انسانوں کے پالنے والے! اور شفا عطا کرتو ہی شفا دینے والا ہے ، شفا عطا کر ، تیری شفا کے سوا ( کہیں ) کوئی شفا نہیں ، ایسی شفا سے جو بیماری کو ( باقی ) نہ چھوڑے ۔ \" ابوبکر ( ابن ابی شیبہ ) کی روایت میں ہے : آپ اس کے لئے دعا فرماتے اور کہتے : \" اور تو ہی شفا دینے والا ہے ۔ \"",
                "urduNarrator": "ابو بکر بن ابی شیبہ اور زہیر بن حرب نے کہا : ہمیں جریر نے منصور سے حدیث بیان کی ، انھوں نے ابو ضحیٰ سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَى الْمَرِيضَ يَدْعُو لَهُ قَالَ أَذْهِبْ الْبَاسَ رَبَّ النَّاسِ وَاشْفِ أَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًا وَفِي رِوَايَةِ أَبِي بَكْرٍ فَدَعَا لَهُ وَقَالَ وَأَنْتَ الشَّافِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13274,
                "hadithNumber": "5711",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of 'A'isha رضی اللہ عنہا through another chain of transmitters with a slight variation of wording.",
                "hadithUrdu": "اسرائیل نےمنصور سے ، انھوں نے ابراہیم اور مسلم بن صبیح سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم ( جب کسی مریض کی عیادت کرتے ) تھے ( آگے ) جس طرح ابوعوانہ اور جریر کی حدیث میں ہے ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ وَمُسْلِمُ بْنُ صُبَيْحٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ أَبِي عَوَانَةَ وَجَرِيرٍ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13275,
                "hadithNumber": "5712",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) used to recite (this supplication) as the words of incantation: Lord of the people, remove the trouble for in Thine Hand is the cure; none is there to relieve him (the burden of disease) but only you.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ان کلمات کے ساتھ دم کرتے تھے : \" تکلیف دور فرمادے ، اے سب انسانوں کے پالنے والے!شفا تیرے ہی ہاتھ میں ہے ، تیرے سوا اس تکلیف کو دور کرنے والا اور کوئی نہیں ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، اور انہوں نے کہا: ابن نمیر نے کہا : ہمیں ہشام نے اپنے والد سے حدیث بیان کی ، انھوں نے حضرت عائشہ رضی اللہ عنہا سےروایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِأَبِي كُرَيْبٍ قَالَا حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَرْقِي بِهَذِهِ الرُّقْيَةِ أَذْهِبْ الْبَاسَ رَبَّ النَّاسِ بِيَدِكَ الشِّفَاءُ لَا كَاشِفَ لَهُ إِلَّا أَنْتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13276,
                "hadithNumber": "5713",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been reported on the authority of Hisham with the same chain of transmitted.",
                "hadithUrdu": "ہم سے ابو کریب نے بیان کیا, ابواسامہ اور عیسیٰ بن یونس دونوں نے ہشام سے اسی سند کےساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ كِلَاهُمَا عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13277,
                "hadithNumber": "5714",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "When any of the members of the household fell ill Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) used to blow over him by reciting Mu'awwidhatan, and when he suffered from illness of which he died I used to blow over him and rubbed his body with his hand for his hand had greater healing power than my hand.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم کے گھروالوں میں سے کوئی بیمار ہوتا تو آپ پناہ دلوانے والے کلمات اس پر پھونکتے ۔ پھر جب آپ اس مرض میں مبتلا ہوئے جس میں آپ کی ر حلت ہوئی تو میں نے آپ پر پھونکنا اور آپ کا اپنا ہاتھ آپ کے جسم اطہر پر پھیرنا شروع کردیا کیونکہ آ پ کا ہاتھ میرے ہاتھ سےزیادہ بابرکت تھا ۔ یحییٰ بن ایوب کی روایت میں ( بِالْمَعَوِّذَاتِ ، کے بجائے ) \" بمَعَوِّذَاتِ \" ( پناہ دلوانے والے کچھ کلمات ) ہیں ۔",
                "urduNarrator": "سریج بن یونس اور یحییٰ بن ایوب نے کہا : ہمیں عباد بن عبادنے ہشام بن عروہ سے حدیث بیان کی ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ وَيَحْيَى بْنُ أَيُّوبَ قَالَا حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا مَرِضَ أَحَدٌ مِنْ أَهْلِهِ نَفَثَ عَلَيْهِ بِالْمُعَوِّذَاتِ فَلَمَّا مَرِضَ مَرَضَهُ الَّذِي مَاتَ فِيهِ جَعَلْتُ أَنْفُثُ عَلَيْهِ وَأَمْسَحُهُ بِيَدِ نَفْسِهِ لِأَنَّهَا كَانَتْ أَعْظَمَ بَرَكَةً مِنْ يَدِي وَفِي رِوَايَةِ يَحْيَى بْنِ أَيُّوبَ بِمُعَوِّذَاتٍ.",
                "headingArabic": "رُقْيَةِ الْمَرِيضِ بِالْمُعَوِّذَاتِ وَالنَّفْثِ ‏‏",
                "headingUrdu": "بیمار کے لیے معوذات کو رقیہ پڑھنا اور ان پر پھونک مارنا",
                "headingEnglish": "Reciting Al-Mu'awwidhat As Ruqyah For The Sick, And Blowing Over Them",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13278,
                "hadithNumber": "5715",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "When Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) fell ill, he recited over his body Mu'awwidhatan and blew over him and when his sickness was aggravated I used to recite over him and rub him with his band with the hope that it was more blessed.",
                "hadithUrdu": "جب نبی صلی اللہ علیہ وسلم بیما ر ہو تے تو آپ خود پر معواذات ( معواذتین اور دیگر پناہ دلوانے والی دعائیں اور آیات ) پڑھتے اور پھونک مارتے ۔ جب آپ کی تکلیف شدید ہو گئی تو میں آپ پر پڑھتی اور آپ کی طرف سے میں آپ کا اپنا ہاتھ اس کی برکت کی امید کے ساتھ ( آپ کے جسم اطہر پر ) پھیرتی ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا: میں نے پڑھا۔مالک نے ابن شہاب سے ، انھوں نے عروہ سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اشْتَكَى يَقْرَأُ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ وَيَنْفُثُ فَلَمَّا اشْتَدَّ وَجَعُهُ كُنْتُ أَقْرَأُ عَلَيْهِ وَأَمْسَحُ عَنْهُ بِيَدِهِ رَجَاءَ بَرَكَتِهَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13279,
                "hadithNumber": "5716",
                "englishNarrator": "This hadith has been narrated through some other chains of transmitters but with a slight variation of wording. In the hadith transmitted on the authority of Yanus and Ziyari (the words are):",
                "hadithEnglish": "When Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) fell ill, he blew over his body by reciting Mu'awwidhatan and rubbed him with his hand.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم جب بیمار ہو تے تو آپ خود اپنے آپ پر کلمات ( پڑھ کر ) پھونکتے اور اپنے جسم پر اپنا ہاتھ پھیرتے ۔",
                "urduNarrator": "مجھ سے ابو الطاہر اور حرملہ نے بیان کیا، کہا: ہم سے ابن وہب نے بیان کیا, یو نس معمر اور زیاد سب نے ابن شہاب سے ، امام مالک کی سند کے ساتھ ان کی حدیث کی طرح حدیث بیان کی ، مالک کے علاوہ اور کسی کی سند میں \" آپ کے ہاتھ کی برکت کی امید سے \" کے الفا ظ نہیں ۔ اور یو نس اور زیاد کی حدیث میں ہے کہ",
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ ح و حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا رَوْحٌ و حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ وَأَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ قَالَا حَدَّثَنَا أَبُو عَاصِمٍ كِلَاهُمَا عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي زِيَادٌ كُلُّهُمْ عَنْ ابْنِ شِهَابٍ بِإِسْنَادِ مَالِكٍ نَحْوَ حَدِيثِهِ وَلَيْسَ فِي حَدِيثِ أَحَدٍ مِنْهُمْ رَجَاءَ بَرَكَتِهَا إِلَّا فِي حَدِيثِ مَالِكٍ وَفِي حَدِيثِ يُونُسَ وَزِيَادٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اشْتَكَى نَفَثَ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ وَمَسَحَ عَنْهُ بِيَدِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13280,
                "hadithNumber": "5717",
                "englishNarrator": "Abdul-Rahman bin al-Aswad reported on the authority of his father:",
                "hadithEnglish": "I asked 'A'isha  رضی اللہ عنہا about incantation. She said: Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had granted its sanction to the members of a family of the Ansar for incantation in curing every type of poison.",
                "hadithUrdu": "میں نے حضرت عائشہ رضی اللہ عنہا سے دم کرنے کے بارے میں دریافت کیا تو انھوں نے بتا یا نبی صلی اللہ علیہ وسلم نے انصار کے ایک گھر کے لو گوں کو ہر زہریلے جا نور کے ڈنک سے ( شفا کے لیے ) دم کرنے کی اجازت عطا فر ما ئی ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے علی بن مسہر نے بیان کیا، شیبانی کی سند سے, عبد الرحمٰن بن اسود نے اپنے والد سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الشَّيْبَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ قَالَ سَأَلْتُ عَائِشَةَ عَنْ الرُّقْيَةِ فَقَالَتْ رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَهْلِ بَيْتٍ مِنْ الْأَنْصَارِ فِي الرُّقْيَةِ مِنْ كُلِّ ذِي حُمَةٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13281,
                "hadithNumber": "5718",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) granted sanction to the members of a family of the Ansar for incantation (for removing the effects) of the poison of the scorpion.",
                "hadithUrdu": "نبی صلی اللہ علیہ وسلم نے انصار کے ایک گھر کے لو گوں کو ہر زہریلے ڈنک کے علاج کے لیے دم کرنے کی اجازت دی تھی ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے ہشیم نے مغیرہ کی سند سے بیان کیا,ابرا ہیم نے سود سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَهْلِ بَيْتٍ مِنْ الْأَنْصَارِ فِي الرُّقْيَةِ مِنْ الْحُمَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13282,
                "hadithNumber": "5719",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "When any person fell ill with a disease or he had any ailment or he had any injury, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) placed his forefinger upon the ground and then lifted it by reciting the name of Allah. (and said): The dust of our ground with the saliva of any one of us would serve as a means whereby our illness would be cured with the sanction of Allah. This hadith has been transmitted on the authority of Ibn Abu Shaiba and Zuhair with a slight variation of wording.",
                "hadithUrdu": "جب کسی انسان کو اپنے جسم کے کسی حصے میں تکلیف ہو تی یا اسے کوئی پھوڑا نکلتا یا زخم لگتا تو رسول اللہ صلی اللہ علیہ وسلم اپنی انگشت مبارک سے اس طرح ( کرتے ) فر ما تے : ( یہ بیان کرتے ہو ئے ) سفیان نے اپنی شہادت کی انگلی زمین پر لگائی ، پھر اسے اٹھا یا : \" اللہ کے نام کے ساتھ ہماری زمین کی مٹی سے ہم میں سے ایک کے لعاب دہن کے ساتھ ہمارے رب کے اذن سے ہمارا بیمار شفایاب ہو ۔ \" ابن ابی شیبہ نے \" ہمارا بیمار شفایاب ہو \" کے الفا ظ اور زہیر نے \" تا کہ \" ہمارا بیمار شفایاب ہو \" کے الفاظ کہے ۔",
                "urduNarrator": "ابو بکر بن ابی شیبہ زہیر بن حرب اور ابن ابی عمرنے ,  الفاظ ابن ابی عمر کے ہیں ۔ کہا : ہمیں سفیان نے عبد ربہ بن سعیدسے حدیث بیان کی ، انھوں نے عمرہ سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ أَبِي عُمَرَ وَاللَّفْظُ لِابْنِ أَبِي عُمَرَ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اشْتَكَى الْإِنْسَانُ الشَّيْءَ مِنْهُ أَوْ كَانَتْ بِهِ قَرْحَةٌ أَوْ جُرْحٌ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِإِصْبَعِهِ هَكَذَا وَوَضَعَ سُفْيَانُ سَبَّابَتَهُ بِالْأَرْضِ ثُمَّ رَفَعَهَا بِاسْمِ اللَّهِ تُرْبَةُ أَرْضِنَا بِرِيقَةِ بَعْضِنَا لِيُشْفَى بِهِ سَقِيمُنَا بِإِذْنِ رَبِّنَا قَالَ ابْنُ أَبِي شَيْبَةَ يُشْفَى و قَالَ زُهَيْرٌ لِيُشْفَى سَقِيمُنَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13283,
                "hadithNumber": "5720",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) commanded the use of incantation for curing the influence of an evil eye.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم انھیں حکم دیتے تھے کہ وہ نظر بد سے ( شفا کے لیے دم کرالیں ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ، ابو کریب اور اسحاق بن ابراہیم نے بیان کیا، اور ہم سے ابوبکر اور ابو کریب نے بیان کیا۔ ان کے لیے کلام ہم سے بیان کیا گیا ہے, محمد بن بشر نے مسعر سے روایت کی ، کہا : ہمیں معبد بن خالد نے ابن شداد سے حدیث بیان کی ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ إِسْحَقُ أَخْبَرَنَا وَقَالَ أَبُو بَكْرٍ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لَهُمَا حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ عَنْ مِسْعَرٍ حَدَّثَنَا مَعْبَدُ بْنُ خَالِدٍ عَنْ ابْنِ شَدَّادٍ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُهَا أَنْ تَسْتَرْقِيَ مِنْ الْعَيْنِ.",
                "headingArabic": "اسْتِحْبَابِ الرُّقْيَةِ مِنَ الْعَيْنِ وَالنَّمْلَةِ وَالْحُمَةِ وَالنَّظْرَةِ ‏‏",
                "headingUrdu": "نظر بد، آبلوں اور ڈنک کے لیے رقیہ پڑھنا مستحب ہے",
                "headingEnglish": "It Is Recommended To Recite Ruqyah For The Evil Eye, Pustules, And Stings",
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13284,
                "hadithNumber": "5721",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Mis'ar with the same chain of transmitters.",
                "hadithUrdu": "عبد اللہ بن نمیر نے کہا : ہمیں مسعر نے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ حَدَّثَنَا أَبِي حَدَّثَنَا مِسْعَرٌ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13285,
                "hadithNumber": "5722",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Messenger (ﷺ) commanded me that I should make use of incantation for curing the influence of an evil eye.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم مجھے حکم دیتے تھے کہ وہ نظر بد سے دم کرالوں ۔",
                "urduNarrator": "ہم سے ابن نمیر نے بیان کیا، ہم سے میرے والد نے بیان کیا, سفیان نے معبد بن خالد سے ، انھوں نے عبد اللہ بن شداد سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا سُفْيَانُ عَنْ مَعْبَدِ بْنِ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنِي أَنْ أَسْتَرْقِيَ مِنْ الْعَيْنِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13286,
                "hadithNumber": "5723",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported in connection with incantation:",
                "hadithEnglish": "He had been granted sanction (to use incantation as a remedy) for the sting of the scorpion and for curing small pustules and dispelling the influence of an evil eye.",
                "hadithUrdu": "زہریلے ڈنگ جلد نکلنے والے دانوں اور نظر بد ( کے عوارض ) میں دم کرانے کی اجا زت دی گئی ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا , ابو خیثمہ نے عاصم احول سے ، انھوں نے یو سف بن عبد اللہ سے ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے دم جھا ڑ کے بارے میں روایت بیان کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ عَنْ أَنَسِ بْنِ مَالِكٍ فِي الرُّقَى قَالَ رُخِّصَ فِي الْحُمَةِ وَالنَّمْلَةِ وَالْعَيْنِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13287,
                "hadithNumber": "5724",
                "englishNarrator": "Anas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) granted him sanction to use incantation (as a cure) for the, influence of an evil eye, the sting of the scorpion and small pustules.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے نظر بد زہریلے ڈنگ جلد نکلنے والے دانوں میں دم کرنے کی اجا زت دی ۔( اور سفیا ن کی روایت میں یو سف بن عبد اللہ کے بجائے ) یو سف بن عبد اللہ بن حارث ( سے مروی ) ہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے یحییٰ بن آدم نے بیان کیا, سفیان اور حسن بن صالح دونوں نے عاصم انھوں نے یوسف بن عبد اللہ سے ، انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ سُفْيَانَ  و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا حَسَنٌ وَهُوَ ابْنُ صَالِحٍ كِلَاهُمَا عَنْ عَاصِمٍ عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ عَنْ أَنَسٍ قَالَ رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرُّقْيَةِ مِنْ الْعَيْنِ وَالْحُمَةِ وَالنَّمْلَةِ وَفِي حَدِيثِ سُفْيَانَ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 13288,
                "hadithNumber": "5725",
                "englishNarrator": "Umm Salama رضی اللہ عنہا the wife of Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ), reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to a small girl in the house of Umm Salama رضی اللہ عنہا that he had been seeing on her face black stains and told her that that was due to the infiluence of an evil eye, and he asked that she should be cured with the help of incantation (hoping) that her face should become spotles.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی زوجہ حضرت ام سلمہ رضی اللہ تعالیٰ عنہا کے گھر میں ایک لڑکی کے بارے میں جس کے چہرے ( کے ایک حصے ) کا رنگ بدلا ہوا دیکھا فرما یا : \" اس کو نظر لگ گئی ہے اس کو دم کراؤ ۔ \" آپ کی مراد اس کے چہرے کی پیلا ہٹ سے تھی ۔",
                "urduNarrator": "مجھ سے ابو الربیع سلیمان بن داؤد نے بیان کیا، مجھ سے محمد بن حرب نے بیان کیا، مجھ سے محمد بن الولید الزبیدی نے، الزہری کی سند سے، عروہ بن الزبیر کی سند سے بیان کیا, زینب بنت ام سلمہ رضی اللہ عنہا نے ام المومنین حضرت ام سلمہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ دَاوُدَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ حَدَّثَنِي مُحَمَّدُ بْنُ الْوَلِيدِ الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِجَارِيَةٍ فِي بَيْتِ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى بِوَجْهِهَا سَفْعَةً فَقَالَ بِهَا نَظْرَةٌ فَاسْتَرْقُوا لَهَا يَعْنِي بِوَجْهِهَا صُفْرَةً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "40",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 140,
                    "chapterNumber": "40",
                    "chapterEnglish": "The Book of Greetings",
                    "chapterUrdu": "سلامتی اور صحت کا بیان",
                    "chapterArabic": "كتاب السَّلَامِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12976,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=519",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=517",
                "label": "517",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=518",
                "label": "518",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=519",
                "label": "519",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=520",
                "label": "520",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=521",
                "label": "521",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=522",
                "label": "522",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=523",
                "label": "523",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=521",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=521",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=519",
        "to": 13000,
        "total": 40465
    }
}