{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 306,
        "data": [
            {
                "id": 7914,
                "hadithNumber": "350",
                "englishNarrator": "Yazid bin al-Asamm said:",
                "hadithEnglish": "I heard Abu Huraira رضی ‌اللہ ‌عنہ saying that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: people will certainly ask you about everything till they will propound: Allah created every thing, but who created Allah?",
                "hadithUrdu": "میں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہتے تھے : رسول اللہ ﷺ نے فرمایا : ’’ یقیناً لوگ تم سے ہر چیز کے بارے میں سوال کریں گے یہاں تک کہ کہیں گے : اللہ نے ہر چیز کو پیدا کیا ، پھر اس کو کس نے پیدا کیا؟ ‘ ‘",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، ہم سے کثیر بن ہشام نے بیان کیا، ہم سے جعفر بن برقان نے بیان کیا،یزید بن اصم نے کہا",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ، حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ، حَدَّثَنَا يَزِيدُ بْنُ الْأَصَمِّ، قَالَ: سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: لَيَسْأَلَنَّكُمُ النَّاسُ عَنْ كُلِّ شَيْءٍ حَتَّى يَقُولُوا: اللهُ خَلَقَ كُلَّ شَيْءٍ، فَمَنْ خَلَقَهُ؟",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7915,
                "hadithNumber": "351",
                "englishNarrator": "Anas bin Malik رضی ‌اللہ ‌عنہ ‌transmitted it from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ):",
                "hadithEnglish": "The Great and Glorious Allah said: Verily your people would constantly question about this and that till they would say: Well, it is Allah Who created the creation, but who created Allah?",
                "hadithUrdu": "آپ نے کہا : ’’ اللہ عز وجل نے فرمایا : ’’ آپ کی امت کے لوگ کہتے رہیں گے : یہ کیسے ہے ؟ وہ کیسے ہے؟ یہاں تک کہ کہیں گے : یہ اللہ ہے ، اس نے مخلوق کو پیدا کیا ، پھر اللہ تعالیٰ کو کس نے پیدا کیا ؟ ‘ ‘",
                "urduNarrator": "ہم سے عبداللہ بن عامر بن زرارہ الحدرمی نے بیان کیا,محمد بن فضیل نے مختار بن فلفل سے ، انہوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ، انہوں نے رسو ل اللہ ﷺ سے روایت کی",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ عَامِرِ بْنِ زُرَارَةَ الْحَضْرَمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ مُخْتَارِ بْنِ فُلْفُلٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: قَالَ اللهُ عَزَّ وَجَلَّ: إِنَّ أُمَّتَكَ لَا يَزَالُونَ يَقُولُونَ: مَا كَذَا؟ مَا كَذَا؟ حَتَّى يَقُولُوا: هَذَا اللهُ خَلَقَ الْخَلْقَ فَمَنْ خَلَقَ اللهَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7916,
                "hadithNumber": "352",
                "englishNarrator": "This hadith has been narrated by another chain of transmitters with the exception that Ishaq made no mention of this:",
                "hadithEnglish": "Allah said: Verily your people.",
                "hadithUrdu": "’’ اللہ عزوجل نے فرمایا : بے شک آپ کی امت ....... ‘ ‘",
                "urduNarrator": "اسحق بن ابراہیم نے کہا : ہمیں جریر نے خبر دی ، نیز ابو بکر بن ابی شیبہ نے کہا : ہمیں حسن بن علی نے زائدہ سے حدیث سنائی اور ان دونوں ( جریر اور زائدہ ) نے مختار سے ، انہوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے نبی ﷺ سے روایت کی ، تاہم اسحاق کی روایت میں یہ الفاظ نہیں ہیں",
                "hadithArabic": "حَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، ح، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ كِلَاهُمَا عَنِ الْمُخْتَارِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ، غَيْرَ أَنَّ إِسْحَاقَ لَمْ يَذْكُرْ قَالَ: «قَالَ اللهُ إِنَّ أُمَّتَكَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7917,
                "hadithNumber": "353",
                "englishNarrator": "It is narrated on the authority of Abu Umama ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: He who appropriated the right of a Muslim by (swearing a false) oath, Allah would make Hell-fire necessary for him and would declare Paradise forbidden for him. A person said to him: Messenger of Allah, even if it is something insignificant? He (the Holy Prophet) replied: (Yes) even if it is the twig of the arak tree.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’ جس نے اپنی قسم کے ذریعے سے کسی مسلمان کا حق مارا ، اللہ نے اس کے لیے آگ واجب کر دی اور اس پر جنت حرام ٹھہرائی ۔ ‘ ‘ ایک شخص نے آپ ﷺ سے عرض کی : اگرچہ وہ معمولی سی چیز ہو ، اے اللہ کے رسول ! آپ نے فرمایا : ’’ چاہے وہ پیلو کے درخت کی ایک شاخ ہو ۔ ‘ ‘",
                "urduNarrator": "ہم سے یحییٰ بن ایوب، قتیبہ بن سعید اور علی بن حجر نے اسماعیل بن جعفر کی سند سے بیان کیا، انہوں نے کہا: اسماعیل بن جعفر، انہوں نے کہا: العلا، جو عبدالرحمٰن کے بیٹے ہیں, الحرقہ کے مؤکل نے ہمیں مطلع کیا،معبد بن کعب سلمی نے اپنے بھائی عبد اللہ بن کعب سے ، انہوں نے حضرت ابو امامہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، قَالَ ابْنُ أَيُّوبَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، قَالَ: أَخْبَرَنَا الْعَلَاءُ وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ مَوْلَى الْحُرَقَةِ، عَنْ مَعْبَدِ بْنِ كَعْبٍ السَّلَمِيِّ، عَنْ أَخِيهِ عَبْدِ اللهِ بْنِ كَعْبٍ، عَنْ أَبِي أُمَامَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اقْتَطَعَ حَقَّ امْرِئٍ مُسْلِمٍ بِيَمِينِهِ، فَقَدْ أَوْجَبَ اللهُ لَهُ النَّارَ، وَحَرَّمَ عَلَيْهِ الْجَنَّةَ» فَقَالَ لَهُ رَجُلٌ: وَإِنْ كَانَ شَيْئًا يَسِيرًا يَا رَسُولَ اللهِ؟ قَالَ: «وَإِنْ قَضِيبًا مِنْ أَرَاكٍ.",
                "headingArabic": "وَعِيدِ مَنِ اقْتَطَعَ حَقَّ مُسْلِمٍ بِيَمِينٍ فَاجِرَةٍ بِالنَّارِ",
                "headingUrdu": "دوسرے مسلمان کا حق غصب کرنے کے لیے جھوٹی قسم کھانے والے کے لیے آگ کی تنبیہ",
                "headingEnglish": "Warning of the Fire for the one who swears a false oath in order to unlawfully take the right of another muslim",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7918,
                "hadithNumber": "354",
                "englishNarrator": "This hadith has been transmitted by another chain of narrators:",
                "hadithEnglish": "Abu Bakr bin Abi Shaiba, Ishaq bin Ibrahim, Harun bin Abdullah, Abi Usama, Walid bin Kathir, Muhammad bin Ka'b, his brother Abdullah bin Ka'b and Abi Usama ‌رضی ‌اللہ ‌عنہ ‌.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ، اسحاق بن ابراہیم اور ہارون بن عبداللہ نے بیان کیا، ان سب سے ابو اسامہ نے، وہ الولید بن کثیر کی سند سے، محمد بن کعب رضی اللہ عنہ نے کہا کہ میں نے ان کی حدیث سنی۔ بھائی عبداللہ بن کعب روایت کرتے ہیں کہ ابوامامہ الحارثی نے ان سے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو سنا، آپ صلی اللہ علیہ وسلم نے فرمایا:",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَهَارُونُ بْنُ عَبْدِ اللهِ، جَمِيعًا عَنْ أَبِي أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ أَنَّهُ سَمِعَ أَخَاهُ عَبْدَ اللهِ بْنَ كَعْبٍ، يُحَدِّثُ أَنَّ أَبَا أُمَامَةَ الْحَارِثِيَّ، حَدَّثَهُ أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7919,
                "hadithNumber": "355",
                "englishNarrator": "It is narrated on the authority of Abdullah (bin Umar) ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: He who perjured with a view to appropriating the property of a Muslim, and he is in fact a liar and would meet Allah in a state that He would be angry with him. He (the narrator) said: There came Ash'ath bin Qais رضی ‌اللہ ‌عنہ ‌and said (to the people): What does Abu Abdur-Rahman (the Kunya of Abdullah bin Umar) narrate to you? They replied: So and so. Upon this he remarked: Abu Abdur-Rahman told the truth. This (command) has been revealed in my case. There was a piece of land in Yemen over which I and another person had a claim. I brought the dispute with him to the Messenger of Allah (to decide) He (the Holy Prophet) said: Can you produce an evidence (in your support)? I said: No. He (the Holy Prophet) observed: (Then the decision would be made) on his oath. I said: He would readily take an oath. Upon this the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) remarked: He who perjured for appropriating the wealth of a Muslim, whereas he is a liar, would meet Allah while He would be angry with him. This verse was then revealed: Verily those who barter Allah's covenant and their oaths at a small price... (iii 77).",
                "hadithUrdu": "آپ نے فرمایا : ’’ جس نے مسلمان کا مال دبانے کے لیے ایسی قسم کھائی جس کے لیے عدالت نے اسے پابند کیا اور وہ اس میں جھوٹا ہے ، وہ اللہ کے سامنے اس حالت میں حاضر ہو گا کہ اللہ اس پر ناراض ہو گا ۔ ‘ ‘ انہوں ( وائل ) نے کہا : اس موقع پر حضرت اشعث بن قیس ‌رضی ‌اللہ ‌عنہ ‌ ‌ ( مجلس میں ) داخل ہوئے اور کہا : ابو عبد ا لرحمن ( عبد اللہ بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) تمہیں کیا حدیث بیان کر رہے ہیں ؟ لوگوں نے کہا : اس اس طرح ( بیان کر رہے ہیں ۔ ) انہوں نےکہا : ابو عبد الرحمن نے سچ کہا ، یہ آیت میرے ہی معاملے میں نازل ہوئی ۔ میرے اور ایک آدمی کے درمیان یمن کی ایک زمین کا معاملہ تھا ۔ میں اس کے ساتھ جھگڑا نبی ﷺ کےہاں لے گیا تو آپ نے پوچھا : ’’کیا تمہارے پاس کوئی دلیل ( یا ثبوت ) ہے ؟ میں نے عرض کی : نہیں ۔ آپ نے فرمایا : ’’ تو پھر اس کی قسم ( پر فیصلہ ہو گا ۔ ) ‘ ‘ میں نے کہا : تب وہ قسم کھا لے گا ۔ اس پر رسول اللہ ﷺ نے فرمایا : ’’جس نے کسی مسلمان کا مال دبانے کے لیے ایسی قسم کھائی جس کا فیصلہ کرنے والے نے اس سےمطالبہ کیا تھا اور وہ اس قسم میں جھوٹا ہے تو وہ اللہ کےسامنے اس حالت میں حاضر ہو گا کہ اللہ اس پر ناراض ہو گا ۔ ‘ ‘ اس پر یہ آیت اتری : ’’بلاشبہ جو لوگ اللہ کے ساتھ کیے گئے وعدے اور اپنی قسموں کا سودا تھوڑی قیمت پر کرتے ہیں ..... ‘ ‘ آیت کے آخر تک ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، ہم سے ابن نمیر نے بیان کیا، ان سے ابو معاویہ، وکیع، ایچ نے بیان کیا اور ہم سے اسحاق بن اول نے ابراہیم الحنثلی نے بیان کیا، اس کا تلفظ واکی نے ہمیں بتایا،اعمش نے ابو وائل سے ، انہوں نے حضرت عبد اللہ ( بن مسعود ) ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے رسول اللہ ﷺ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح، وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، ح، وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَاللَّفْظُ لَهُ، أَخْبَرَنَا وَكِيعٌ، حَدَّثَنَا الْأَعْمَشُ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللهِ، عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ حَلَفَ عَلَى يَمِينِ صَبْرٍ، يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ هُوَ فِيهَا فَاجِرٌ، لَقِيَ اللهَ وَهُوَ عَلَيْهِ غَضْبَانُ»، قَالَ: فَدَخَلَ الْأَشْعَثُ بْنُ قَيْسٍ، فَقَالَ: مَا يُحَدِّثُكُمْ أَبُو عَبْدِ الرَّحْمَنِ؟ قَالُوا: كَذَا وَكَذَا، قَالَ: صَدَقَ أَبُو عَبْدِ الرَّحْمَنِ، فِيَّ نَزَلَتْ، كَانَ بَيْنِي وَبَيْنَ رَجُلٍ أَرْضٌ بِالْيَمَنِ، فَخَاصَمْتُهُ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «هَلْ لَكَ بَيِّنَةٌ؟» فَقُلْتُ: لَا، قَالَ: «فَيَمِينُهُ»، قُلْتُ: إِذَنْ يَحْلِفُ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عِنْدَ ذَلِكَ: «مَنْ حَلَفَ عَلَى يَمِينِ صَبْرٍ، يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ هُوَ فِيهَا فَاجِرٌ، لَقِيَ اللهَ وَهُوَ عَلَيْهِ غَضْبَانُ» فَنَزَلَتْ: {إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا} [آل عمران: 77] إِلَى آخِرِ الْآيَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7920,
                "hadithNumber": "356",
                "englishNarrator": "It is narrated on the authority of Abdullah ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) saying: He who took an oath in order to entitle himself (to the possession) of a property, whereas he is a liar, would meet Allah in a state that He would be very much angry with him. Then the remaining part of the hadith was narrated as transmitted by A'mash but with the exception of these words: There was a dispute between me and another person in regard to a well. We referred this dispute to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). Upon this he remarked: Either (you should produce) two witnesses (to support your contention) or his oath (would be accepted as valid).",
                "hadithUrdu": "جو شخص ایسی قسم اٹھاتا ہے جس کی بنا پر وہ مال کا حق دار ٹھہرتا ہے او روہ اس قسم میں جھوٹا ہے تو وہ اللہ کو اس حالت میں ملے گا کہ اللہ تعالیٰ اس پر ناراض ہوگا ، پھر اعمش کی طرح روایت بیان کی البتہ ( اس میں ) انہوں نے کہا : میرے اور ایک آدمی کے درمیان کنویں کے بارے میں جھگڑا تھا ۔ ہم ہی جھگڑا رسول اللہ ﷺ کے پاس لے گئے تو آپ ﷺ نے فرمایا : ’’ تمہارے دو گواہ ہوں یا اس کی قسم ( کے ساتھ فیصلہ ہو گا ) ۔ ‘ ‘",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم سے جریر نے بیان کیا,( اعمش کے بجائے ) منصور نے ابووائل سے اور انہوں نے عبداللہ بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ۔ حضرت عبد اللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللهِ، قَالَ: «مَنْ حَلَفَ عَلَى يَمِينٍ يَسْتَحِقُّ بِهَا مَالًا، هُوَ فِيهَا فَاجِرٌ، لَقِيَ اللهَ وَهُوَ عَلَيْهِ غَضْبَانُ»، ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ الْأَعْمَشِ، غَيْرَ أَنَّهُ قَالَ: كَانَتْ بَيْنِي وَبَيْنَ رَجُلٍ خُصُومَةٌ فِي بِئْرٍ، فَاخْتَصَمْنَا إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: «شَاهِدَاكَ أَوْ يَمِينُهُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7921,
                "hadithNumber": "357",
                "englishNarrator": "Ibn Mas'ud says:",
                "hadithEnglish": "I heard the Messenger of Allah observing: He who took an oath on the property of a Muslim without legitimate right would meet Allah and He would be angry, with him. Then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) in support of his contention recited the verse: Verily those who barter Allah's covenant and their oaths at a small price.",
                "hadithUrdu": "میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا : ’’ جس ن کسی مسلمان شخص کے مال پر ، حق نہ ہوتے ہوئے ، قسم کھائی ، وہ اللہ سے اس حالت میں ملے گا کہ اللہ تعالیٰ اس سے ناراض ہو گا ۔ ‘ ‘ عبد اللہ نے کہا : پھر رسول اللہ ﷺ نے ہمارے سامنے کتاب اللہ سے اس کا مصداق ( جس سے بات کی تصدیق ہو جائے ) پڑھا : ’’ بلاشبہ جو لوگ اللہ کےساتھ کیے گئے عہد ( میثاق ) اور اپنی قسموں کا سودا تھوڑی سی قیمت پر کرتے ہیں ...... ‘ آخر آیت تک ۔",
                "urduNarrator": "ہم سے ابن ابی عمر مکی نے بیان کیا، کہا ہم سے سفیان نے بیان کیا,جامع بن ابی راشد اور عبد المالک بن اعین نے ( ابو وائل ) شقیق بن سلمہ سے سنا ، کہہ رہے تھے : میں نے حضرت عبد اللہ بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہتے تھے",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ جَامِعِ بْنِ أَبِي رَاشِدٍ، وَعَبْدِ الْمَلِكِ بْنِ أَعْيَنَ، سَمِعَا شَقِيقَ بْنَ سَلَمَةَ، يَقُولُ: سَمِعْتُ ابْنَ مَسْعُودٍ، يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ حَلَفَ عَلَى مَالِ امْرِئٍ مُسْلِمٍ بِغَيْرِ حَقِّهِ، لَقِيَ اللهَ وَهُوَ عَلَيْهِ غَضْبَانُ»، قَالَ عَبْدُ اللهِ: ثُمَّ قَرَأَ عَلَيْنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مِصْدَاقَهُ مِنْ كِتَابِ اللهِ: {إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا} [آل عمران: 77] إِلَى آخِرِ الْآيَةِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7922,
                "hadithNumber": "358",
                "englishNarrator": "It is narrated on the authority of Wa'il رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "There came a person from Hadramaut and another one from Kinda to the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ). One who had come from Hadramaut said: Messenger of Allah, only this man has appropriated my land which belonged to my father. The one who had came from Kinda contended. This is my land and is in my possession: I cultivate it. There is no right for him in it. The Messenger of Allah said to the Hadramite: Have you any evidence (to support you)? He replied in the negative. He (the Messenger of Allah) said: Then your case is to be decided on his oath. He (the Hadramite) said: Messenger of Allah, he is a liar and cares not what he swears and has no regard for anything. Upon this he (the Messenger of Allah) remarked: For you then there is no other help to it. He (the man from Kinda) set out to take an oath. When he turned his back the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: If he took an oath on his property with a view to usurping it, he would certainly meet his Lord in a state that He would turn away from him.",
                "hadithUrdu": "ایک آدمی حضر موت سے اور ایک کندہ سے نبی ﷺ کے پاس آیا ۔ حضرمی ( حضر موت کے باشندے ) نے کہا : اے اللہ کے رسول ! یہ میری زمین پر قبضہ کیے بیٹھا ہے جومیرے باپ کی تھی ۔ اور کندی نے کہا : یہ میری زمین ہے ، میرے قبضے میں ہے ، میں اسے کاشت کرتا ہوں ، اس کا اس ( زمین ) میں کوئی حق نہیں ۔ اس پر نبی کریم ﷺ نے حضرمی سے کہا : ’’کیا تمہاری کوئی دلیل ( گواہی وغیرہ ) ہے ؟ ‘ ‘ اس نے کہا : نہیں ۔ آپ نے فرمایا : ’’ پھر تمہارے لیے اس کی قسم ہے ۔ ‘ ‘ اس نے کہا : اے اللہ کے رسول ! بلاشبہ یہ آدمی بدکردار ہے ، اسے کوئی پرواہ نہیں کہ کس چیز پر قسم کھاتا ہے او ریہ کسی چیز سے پرہیز نہیں کرتا ۔ آپ نے فرمایا : ’’تمہیں اس سے اس ( قسم ) کے سوا کچھ نہیں مل سکتا ۔ ‘ ‘ وہ قسم کھانے چلا اور جب اس نے پیٹھ پھیری تو رسول اللہ ﷺ نے فرمایا : بات یہ ہے کہ اگر اس نے ظلم اور زیادتی سے اس شخص کا مال کھانے کے لیے قسم کھائی تو بلاشبہ یہ شخص اللہ سے اس حالت میں ملے گا کہ اللہ نے اس سے اپنا رخ پھیر لیا ہو گا ۔ ‘ ‘",
                "urduNarrator": "ہم سے قتیبہ بن سعید، ابوبکر بن ابی شیبہ، ہناد بن الساری اور ابو عاصم الحنفی نے بیان کیا اور ہم سے قتیبہ نے بیان کیا: ہم سے ابو الاحواس نے بیان کیا,سماک نے علقمہ بن وائل سے ، انہوں نے اپنے والد ( حضرت وائل بن حجر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهَنَّادُ بْنُ السَّرِيِّ، وَأَبُو عَاصِمٍ الْحَنَفِيُّ، وَاللَّفْظُ لِقُتَيْبَةَ، قَالُوا: حَدَّثَنَا أَبُو الْأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، عَنْ أَبِيهِ، قَالَ: جَاءَ رَجُلٌ مِنْ حَضْرَمَوْتَ وَرَجُلٌ مِنْ كِنْدَةَ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ الْحَضْرَمِيُّ: يَا رَسُولَ اللهِ، إِنَّ هَذَا قَدْ غَلَبَنِي عَلَى أَرْضٍ لِي كَانَتْ لِأَبِي، فَقَالَ الْكِنْدِيُّ: هِيَ أَرْضِي فِي يَدِي أَزْرَعُهَا لَيْسَ لَهُ فِيهَا حَقٌّ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِلْحَضْرَمِيِّ: «أَلَكَ بَيِّنَةٌ؟» قَالَ: لَا، قَالَ: «فَلَكَ يَمِينُهُ»، قَالَ: يَا رَسُولَ اللهِ، إِنَّ الرَّجُلَ فَاجِرٌ لَا يُبَالِي عَلَى مَا حَلَفَ عَلَيْهِ، وَلَيْسَ يَتَوَرَّعُ مِنْ شَيْءٍ، فَقَالَ: «لَيْسَ لَكَ مِنْهُ إِلَّا ذَلِكَ»، فَانْطَلَقَ لِيَحْلِفَ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لَمَّا أَدْبَرَ: «أَمَا لَئِنْ حَلَفَ عَلَى مَالِهِ لِيَأْكُلَهُ ظُلْمًا، لَيَلْقَيَنَّ اللهَ وَهُوَ عَنْهُ مُعْرِضٌ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7923,
                "hadithNumber": "359",
                "englishNarrator": "Wa'il reported it on the authority of his father Hujr:",
                "hadithEnglish": "I was with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that two men came there disputing over a piece of land. One of them said: Messenger of Allah, this man appropriated my land without justification in the days of ignorance. The (claimant) was Imru'l-Qais b. 'Abis al-Kindi and his opponent was Rabi'a b. 'Iban He (the Holy Prophet) said (to the claimant): Have you evidence (to substantiate your claim)? He replied: I have no evidence. Upon this he (the Messenger of Allah) remarked: Then his (that is of the defendant) is the oath. He (the claimant) said: In this case he (the defendant) would appropriate this (the property). He (the Holy Prophet) said: There is than no other way left for you but this. He (the narrator) said: When he (the defendant) stood up to take oath, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: He who appropriated the land wrongfully would meet Allah in a state that He would be angry with him. Ishaq in his narration mentions Rabi'a b. 'Aidan (instead of Rabi'a b. 'Ibdan).",
                "hadithUrdu": "میں رسول اللہ ﷺ کے پاس تھا ، آپ کے پاس دو آدمی ( ایک قطعہ ) زمین پرجھگڑتے آئے ، دونوں میں ایک نے کہا : اے اللہ کےرسول ! اس نے دور جاہلیت میں میر ی زمین پر قبضہ کیا تھا ، وہ امرؤ القیس بن عابس کندی تھا اور اس کا حریف ربیعہ بن عبدان تھا ۔ آپ نے فرمایا : ’’ ( سب سے پہلے ) تمہارا ثبوت ( شہادت ۔ ) ‘ ‘ اس نے کہا : میرے پاس ثبوت نہیں ہے ۔ آپ نے فرمایا : ’’ ( تب فیصلہ ) اس کی قسم ( پر ہو گا ) ‘ ‘ اس نے کہا : تب تو وہ زمین لے جائے گا ۔ آپ نے فرمایا : ’’ اس کے علاوہ کچھ نہیں ۔ ‘ ‘ حضرت وائل ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : جب وہ قسم کھانے کے لیے اٹھا تو رسول اللہ ﷺ نے فرمایا : ’’ جس نے ظلم کرتے ہوئے کوئی زمین چھینی ، وہ اس حالت میں اللہ سے ملے گا کہ اللہ اس پر ناراض ہو گا ۔ ‘ ‘ اسحاق نے اپنی روایت میں ( دوسرے فریق کا نام ) ربیعہ بن عیدان ( باء کے بجائے یاءکے ساتھ ) بتایا ہے ۔",
                "urduNarrator": "زہیر بن حرب اور اسحاق بن ابراہیم دونوں نے ابو ولید سے حدیث سنائی ( زہیر نے عن أبى الولید کے بجائے حدثنا هشام بن عبد الملك ہمیں ہشام بن عبدالملک نے حدیث سنائی ، کہا ) ہشام بن عبد الملک نے کہا : ہمیں ابو عوانہ نے عبد الملک بن عمیر سے حدیث سنائی ، انہوں نے علقمہ بن وائل سے اور انہوں نے ( اپنے والد ) حضرت وائل بن حجر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ أَبِي الْوَلِيدِ، قَالَ زُهَيْرٌ: حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، عَنْ وَائِلِ بْنِ حُجْرٍ، قَالَ: كُنْتُ عِنْدَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَتَاهُ رَجُلَانِ يَخْتَصِمَانِ فِي أَرْضٍ، فَقَالَ أَحَدُهُمَا: إِنَّ هَذَا انْتَزَى عَلَى أَرْضِي يَا رَسُولَ اللهِ فِي الْجَاهِلِيَّةِ - وَهُوَ امْرُؤُ الْقَيْسِ بْنُ عَابِسٍ الْكِنْدِيُّ، وَخَصْمُهُ رَبِيعَةُ بْنُ عِبْدَانَ - قَالَ: «بَيِّنَتُكَ» قَالَ: لَيْسَ لِي بَيِّنَةٌ، قَالَ: «يَمِينُهُ» قَالَ: إِذَنْ يَذْهَبُ بِهَا، قَالَ: «لَيْسَ لَكَ إِلَّا ذَاكَ»، قَالَ: فَلَمَّا قَامَ لِيَحْلِفَ، قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اقْتَطَعَ أَرْضًا ظَالِمًا، لَقِيَ اللهَ وَهُوَ عَلَيْهِ غَضْبَانُ»، قَالَ إِسْحَاقُ فِي رِوَايَتِهِ: رَبِيعَةُ بْنُ عَيْدَانَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7924,
                "hadithNumber": "360",
                "englishNarrator": "Abu Huraira رضی ‌اللہ ‌عنہ ‌reported:",
                "hadithEnglish": "A person came to the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said: Messenger of Allah, what do you think if a man comes to me in order to appropriate my possession? He (the Holy Prophet) said: Don't surrender your possession to him. He (the inquirer) said: If he fights me? He (the Holy Prophet) remarked: Then fight (with him). He (the inquirer) again said: What do you think if I am killed? He (the Holy Prophet) observed: You would be a martyr. He (the inquirer) said: What do you think of him (Messenger of Allah) If I kill him. He (the Holy Prophet) said: he would be in the Fire.",
                "hadithUrdu": "ایک آدمی رسول اللہ ﷺ کی خدمت میں حاضر ہوا اور عرض کی : اے اللہ کے رسول ! آپ کی کیا رائے ہے اگر کوئی آدمی آ کر میرا مال چھیننا چاہے ( تو میں کیا کروں؟ ) آپ نے فرمایا : ’’ اسے اپنا مال نہ دو ۔ ‘ ‘ اس ن کہا : آپ کی کیا رائے ہے اگر وہ میرے ساتھ لڑائی کرے تو ؟ فرمایا : ’’ تم اس سے لڑائی کرو ۔ ‘ ‘ اس نے پوچھا : آپ کی کیا رائے ہے اگر وہ مجھے قتل کر دے تو ؟ آپ نے فرمایا : ’’ تم شہید ہو گے ۔ ‘ ‘ اس نے پوچھا : آپ کی کیا رائے ہے اگر میں اسے قتل کر دوں ؟ فرمایا : ’’ وہ دوزخی ہو گا ۔ ‘ ‘",
                "urduNarrator": "مجھ سے ابو کریب محمد بن العلاء نے بیان کیا، ان سے خالد نے، یعنی ہم سے ابن مخلد نے بیان کیا، ہم سے محمد بن جعفر نے بیان کیا، ان سے علاء بن عبدالرحمٰن نے اپنے والد کی سند سے بیان کیا,حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنِي أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ مَخْلَدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنِ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: جَاءَ رَجُلٌ إِلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ: يَا رَسُولَ اللهِ، أَرَأَيْتَ إِنْ جَاءَ رَجُلٌ يُرِيدُ أَخْذَ مَالِي؟ قَالَ: «فَلَا تُعْطِهِ مَالَكَ» قَالَ: أَرَأَيْتَ إِنْ قَاتَلَنِي؟ قَالَ: «قَاتِلْهُ» قَالَ: أَرَأَيْتَ إِنْ قَتَلَنِي؟ قَالَ: «فَأَنْتَ شَهِيدٌ»، قَالَ: أَرَأَيْتَ إِنْ قَتَلْتُهُ؟ قَالَ: «هُوَ فِي النَّارِ».",
                "headingArabic": "الدَّلِيلِ عَلَى أَنَّ مَنْ قَصَدَ أَخْذَ مَالِ غَيْرِهِ بِغَيْرِ حَقٍّ كَانَ الْقَاصِدُ مُهْدَرَ الدَّمِ فِي حَقِّهِ وَإِنْ قُتِلَ كَانَ فِي النَّارِ وَأَنَّ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ",
                "headingUrdu": "اس بات کی دلیل ہے کہ جو شخص دوسرے لوگوں کے مال پر ناجائز قبضہ کرنا چاہتا ہے اس کا خون بہایا جا سکتا ہے، اگر وہ مارا گیا تو وہ آگ میں جائے گا، اور جو اپنے مال کی حفاظت کرتے ہوئے مارا جائے وہ شہید ہے۔",
                "headingEnglish": "The evidence that the blood of one who aims to seize other people's wealth without right may be shed, if he is killed he will be in the fire, and the one who is killed defending his property is a martyr",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7925,
                "hadithNumber": "361",
                "englishNarrator": "It is narrated on the authority of Thabit:",
                "hadithEnglish": "When 'Abdullah bin 'Amr ‌رضی ‌اللہ ‌عنہ and 'Anbasa bin Abi Sufyan were about to fight against each other, Khalid bin 'As rode to 'Abdullah bin 'Amr and persuaded him (not to do so). Upon this Abdullah bin 'Amr  ‌رضی ‌اللہ ‌عنہ ‌said: Are you not aware that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) had observed: He who died in protecting his property is a martyr.",
                "hadithUrdu": "عبد اللہ بن عمرو ( ابن عاص ) ‌رضی ‌اللہ ‌عنہ ‌ ‌ اور عنبسہ بن ابی سفیان ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے درمیان وہ ( جھگڑا ) ہوا جو ہوا تو وہ لڑائی کے لیے تیار ہو گئے ، اس وقت ( ان کے چچا ) خالد بن عاص ‌رضی ‌اللہ ‌عنہ ‌ ‌ سوار ہو کر عبد اللہ بن عمرو ( بن عاص ) ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس گئے اور انہیں نصیحت کی ۔ عبد اللہ بن عمرو ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے جواب دیا : کیا آب کو معلوم نہیں کہ رسول اللہ ﷺ نے فرمایا ہے : ’’ جو اپنے مال کی حفاظت میں قتل کر دیا گیا ، وہ شہید ہے ۔ ‘ ‘",
                "urduNarrator": "مجھ سے حسن بن علی الحلوانی، اسحاق بن منصور اور محمد بن رافع نے بیان کیا  اور ان کے الفاظ بھی اسی طرح ہیں - اسحاق نے کہا, اس نے ہم سے بیان کیا، اور اس نے کہا: دو اور,عبد الرزاق نے کہا : ہمیں ابن جریج نے خبر دی ، انہوں نے کہا , مجھے سلیمان احول نے خبر دی کہ عمر بن عبدالرحمن کے آزاد کردہ غلام ثابت نے انہیں بتایا کہ",
                "hadithArabic": "حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، وَمُحَمَّدُ بْنُ رَافِعٍ - وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ - قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ: أَخْبَرَنِي سُلَيْمَانُ الْأَحْوَلُ أَنَّ ثَابِتًا مَوْلَى عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ، أَنَّهُ لَمَّا كَانَ بَيْنَ عَبْدِ اللهِ بْنِ عَمْرٍو وَبَيْنَ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ مَا كَانَ تَيَسَّرُوا لِلْقِتَالِ، فَرَكِبَ خَالِدُ بْنُ الْعَاصِ إِلَى عَبْدِ اللهِ بْنِ عَمْرٍو فَوَعَظَهُ خَالِدٌ، فَقَالَ عَبْدُ اللهِ بْنُ عَمْرٍو: أَمَا عَلِمْتَ أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7926,
                "hadithNumber": "362",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated by Muhammad bin Hatim, Muhammad bin Bakr, Ahmad bin 'Uthman Naufali, Abu 'Asim, Ibn Juraij.",
                "hadithUrdu": "ہم سے محمد بن حاتم نے بیان کیا، ہم سے محمد بن بکر نے بیان کیا، اور ہم سے احمد بن عثمان النفالی نے بیان کیا، ہم سے ابو عاصم نے بیان کیا، ان دونوں نے ابن جریج کی سند سے اسی طرح روایت کی ہے.",
                "urduNarrator": "ہم سے محمد بن حاتم نے بیان کیا، ہم سے محمد بن بکر، ح، نے بیان کیا، اور ہم سے احمد بن عثمان النفالی نے بیان کیا، ہم سے ابو عاصم نے بیان کیا، ان دونوں نے ابن جریج کی سند سے اسی طرح روایت کی ہے",
                "hadithArabic": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، ح، وَحَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ كِلَاهُمَا عَنِ ابْنِ جُرَيْجٍ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7927,
                "hadithNumber": "363",
                "englishNarrator": "Hasan reported:",
                "hadithEnglish": "'Ubaidullah bin Ziyad paid a visit to Ma'qil bin Yasar Muzani رضی ‌اللہ ‌عنہ ‌in his illness of which he (later on) died. (At this juncture) Ma'qil said: I am going to narrate to you a hadith which I have heard from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and which I would not have transmitted if I knew that I would survive. Verily I have heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: There is none amongst the bondsmen who was entrusted with the affairs of his subjects and he died in such a state that he was dishonest in his dealings with those over whom he ruled that the Paradise is not forbidden for him.",
                "hadithUrdu": "عبید اللہ بن زیاد نےحضرت معقل بن یسار مزنی ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے مرض ا لموت میں ان کی عیادت کی تو معقل ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے اس سے کہا : میں تمہیں ایک حدیث سنانے لگاہوں جو میں نے رسو ل اللہ ﷺ سے سنی ۔ اگر میں جانتا کہ میں ا بھی اور زندہ رہوں گا تو تمہیں یہ حدیث نہ سناتا ۔ میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا : ’’ کوئی ایسا بندہ جسے اللہ کسی رعایا کا نگران بناتا ہے اور مرنے کے دن وہ اس حالت میں مرتا ہے کہ اپنی رعیت سے دھوکا کرنے والا ہے تو اللہ اس پر جنت حرام کر دیتا ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے شیبان بن فرخ نے بیان کیا,ابو اشہب نے حسن ( بصری ) سے حدیث بیان کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو الْأَشْهَبِ، عَنِ الْحَسَنِ، قَالَ: عَادَ عُبَيْدُ اللهِ بْنُ زِيَادٍ مَعْقِلَ بْنَ يَسَارٍ الْمُزَنِيَّ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ، قَالَ مَعْقِلٌ: إِنِّي مُحَدِّثُكَ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، لَوْ عَلِمْتُ أَنَّ لِي حَيَاةً مَا حَدَّثْتُكَ، إِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ عَبْدٍ يَسْتَرْعِيهِ اللهُ رَعِيَّةً، يَمُوتُ يَوْمَ يَمُوتُ وَهُوَ غَاشٌّ لِرَعِيَّتِهِ، إِلَّا حَرَّمَ اللهُ عَلَيْهِ الْجَنَّةَ.",
                "headingArabic": "اسْتِحْقَاقِ الْوَالِي الْغَاشِّ لِرَعِيَّتِهِ النَّارَ ‏‏",
                "headingUrdu": "ایک معاملے کا انچارج، جو اپنی رعایا کو دھوکہ دیتا ہے، آگ کا مستحق ہے۔",
                "headingEnglish": "One in charge of a matter, who cheats his subjects, deserves the fire",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7928,
                "hadithNumber": "364",
                "englishNarrator": "Hasan reported:",
                "hadithEnglish": "Ubaidullah bin Ziyad went to see Ma'qil bin Yasir ‌رضی ‌اللہ ‌عنہ ‌and he was ailing. He ('Ubaidullah) inquired (about his health) to which he (Ma'qil) replied: I am narrating to you a hadith which I avoided narrating to you (before). Verily the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: Allah does not entrust to his bondsman the responsibility of managing the affairs of his subjects and he dies as a dishonest (ruler) but Paradise is forbidden by Allah for such a (ruler). He (Ibn Ziyad) said: Why did you not narrate it to me before this day? He replied: I (in fact) did not narrate it to you as it was not (fit) for me to narrate that to you.",
                "hadithUrdu": "عبید اللہ بن زیاد حضرت معقل بن یسار ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے پاس آیا ، وہ اس وقت بیمارتھے او ران کا حال پوچھا ، تو وہ کہنے لگے : میں تمہیں ایک حدیث سنانے لگا ہوں جو میں نے پہلے تمہیں نہیں سنائی تھی ، بلا شبہ رسول اللہ ﷺ نے فرمایا : ’’ اللہ تعالیٰ کسی بندے کو کسی رعیت کا نگران بناتا ہے او رموت کے دن وہ اس حالت میں مرتا ہے کہ رعیت کے حقوق میں دھوکے بازی کرنے والا ہے تو اللہ اس پر جنت حرام کر دیتا ہے ۔ ‘ ‘ عبیداللہ نےکہا : کیا آپ نے پہلے مجھے یہ حدیث نہیں سنائی ؟ معقل ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : میں نے تمہیں نہیں سنائی یا میں تمہیں نہیں سنا سکتا تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، کہا ہم سے یزید بن زرعی نے بیان کیا،( ابو اشہب کے بجائے ) یونس نے حسن سے روایت کی ، انہوں نےکہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، قَالَ دَخَلَ عُبَيْدُ اللَّهِ بْنُ زِيَادٍ عَلَى مَعْقِلِ بْنِ يَسَارٍ وَهُوَ وَجِعٌ فَسَأَلَهُ فَقَالَ إِنِّي مُحَدِّثُكَ حَدِيثًا لَمْ أَكُنْ حَدَّثْتُكَهُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏  ‏ لاَ يَسْتَرْعِي اللَّهُ عَبْدًا رَعِيَّةً يَمُوتُ حِينَ يَمُوتُ وَهُوَ غَاشٌّ لَهَا إِلاَّ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ ‏.‏ قَالَ أَلاَّ كُنْتَ حَدَّثْتَنِي هَذَا قَبْلَ الْيَوْمِ قَالَ مَا حَدَّثْتُكَ أَوْ لَمْ أَكُنْ لأُحَدِّثَكَ ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7929,
                "hadithNumber": "365",
                "englishNarrator": "Hasan reported:",
                "hadithEnglish": "We were with Ma'qil bin Yasar رضی ‌اللہ ‌عنہ ‌inquiring about his health that Ubaidullah bin Ziyad came there. Ma'qil ‌رضی ‌اللہ ‌عنہ ‌said to him: Verily I am going to narrate to you a hadith which I heard from the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌). Then he narrated the hadith like those two (mentioned above).",
                "hadithUrdu": "ہم معقل بن یسار ‌رضی ‌اللہ ‌عنہ ‌ ‌ کےہاں ان کی عیادت کررہے تھے کہ عبید اللہ بن زیاد آ گیا ۔ معقل ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے اس سے کہا : میں تمہیں ایک حدیث سنانے لگا ہوں جو میں نے رسول اللہ ﷺ سے سنی تھی ...... پھر ہشام نے باقی حدیث ان دونوں ( ابو الاشہب اور یونس ) کی حدیث کے مفہوم کے مطابق بیان کی ۔",
                "urduNarrator": "مجھ سے القاسم بن زکریا نے بیان کیا، حسین نے، یعنی الجعفی نے، ہم سے زیدہ کی سند سے بیان کیا،( ایک اور سند سے ) ہشام سے روایت ہے ، انہوں نےکہا , حسن نے کہا",
                "hadithArabic": "وَحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا حُسَيْنٌ يَعْنِي الْجُعْفِيَّ، عَنْ زَائِدَةَ، عَنْ هِشَامٍ، قَالَ: قَالَ الْحَسَنُ: كُنَّا عِنْدَ مَعْقِلِ بْنِ يَسَارٍ نَعُودُهُ، فَجَاءَ عُبَيْدُ اللهِ بْنُ زِيَادٍ، فَقَالَ لَهُ مَعْقِلٌ: إِنِّي سَأُحَدِّثُكَ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ ذَكَرَ بِمَعْنَى حَدِيثِهِمَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7930,
                "hadithNumber": "366",
                "englishNarrator": "It is narrated on the authority of Abu Malih رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "Ubaidullah bin Ziyad visited Ma'qil bin Yasar رضی ‌اللہ ‌عنہ in his illness. Ma'qil رضی ‌اللہ ‌عنہ said to him: I am narrating to you a hadith which I would have never narrated to you had I not been in death-bed. I heard Allah's apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) say: A ruler who has been entrusted with the affairs of the Muslims but he makes no endeavors ( for the material and moral uplift) and does not sincerely mean (their welfare) would not enter Paradise along with them.",
                "hadithUrdu": "عبید اللہ بن زیاد نےمعقل بن یسار ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی بیماری میں ان کی عیادت کی تو معقل ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے اس سے کہا : میں موت ( کی راہ ) میں نہ ہوتا تو تمہیں یہ حدیث نہ سناتا ۔ میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا : ’’ کوئی امیر جو مسلمانوں کے معاملات کی ذمہ داری اٹھاتا ہے ، پھر وہ ان ( کی بہبود ) کے لیے کوشش اور خیر خواہی نہیں کرتا ، وہ ان کے ہمراہ جنت میں داخل نہ ہو گا ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابو غسان المسماعی، محمد بن المثنی اور اسحاق بن ابراہیم نے بیان کیا، کہا: ہم سے انہوں نے بیان کیا، اور دوسرے دو نے کہا: ہم سے معاذ بن ہشام نے بیان کیا، کہا: مجھ سے میرے والد نے بیان کیا۔ قتادہ، ابو ملیح ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "وَحَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ: حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ: حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَبِي الْمَلِيحِ أَنَّ عُبَيْدَ اللهِ بْنَ زِيَادٍ عَادَ مَعْقِلَ بْنَ يَسَارٍ فِي مَرَضِهِ، فَقَالَ لَهُ مَعْقِلٌ: إِنِّي مُحَدِّثُكَ بِحَدِيثٍ لَوْلَا أَنِّي فِي الْمَوْتِ لَمْ أُحَدِّثْكَ بِهِ، سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ أَمِيرٍ يَلِي أَمْرَ الْمُسْلِمِينَ، ثُمَّ لَا يَجْهَدُ لَهُمْ، وَيَنْصَحُ، إِلَّا لَمْ يَدْخُلْ مَعَهُمُ الْجَنَّةَ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7931,
                "hadithNumber": "367",
                "englishNarrator": "Hudhaifa رضی ‌اللہ ‌عنہ reported:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) narrated to us two ahadith. I have seen one (crystallized into reality), and I am waiting for the other. He told us: Trustworthiness descended in the innermost (root) of the hearts of people. Then the Qur'an was revealed and they learnt from the Qur'an and they learnt from the Sunnah. Then he (the Holy Prophet) told us about the removal of trustworthiness. He said: The man would have a wink of sleep and trustworthiness would be taken away from his heart leaving the impression of a faint mark. He would again sleep and trustworthiness would be taken away from his heart leaving an impression of a blister, as if you rolled down an ember on your foot and it was vesicled. He would see a swelling having nothing in it. He (the Holy Prophet) then took up a pebble and rolled it down over his foot and (said): The people would enter into transactions amongst one another and hardly a person would be left who would return (things) entrusted to him. (And there would be so much paucity of honest persons) till it would be said: There in such a such tribe is a trustworthy man. And they would also say about a person: How prudent he is, how broad-minded he is and how intelligent he is, whereas in his heart there would not be faith even to the weight of a mustard seed. I have passed through a time in which I did not care with whom amongst you I entered into a transaction, for if he were a Muslim his faith would compel him to discharge his obligations to me and it he were a Christian or a Jew, the ruler would compel him to discharge his obligations to me. But today I would not enter into a transaction with you except so and so.",
                "hadithUrdu": "رسو ل اللہ ﷺ نے ہمیں دو باتیں بتائیں ، ایک تو میں دیکھ چکا ہوں اور دوسری کا انتظار کر رہا ہوں ، آپ نے ہمیں بتایا : ’’امانت لوگوں کے دلوں کے نہاں خانے میں اتری ، پھر قرآن اترا ، انہوں نے قرآن سے سیکھا اور سنت سے جانا ۔ ‘ ‘ پھر آپﷺ نے ہمیں امانت اٹھالیے جانے کے بارے میں بتایا ، آپ نے فرمایا : ’’ آدمی ایک بار سوئے گا تو اس کے دل میں امانت سمیٹ لی جائے گی اور اس کا نشان پھیکے رنگ کی طرح رہ جائے گا ، پھر وہ ایک نیند لے گا تو ( بقیہ ) امانت اس کے دل سے سمیٹ لی جائے گی اور اس کا نشان ایک آبلے کی طرح رہ جائے گا جیسے تم انگارے کو اپنے پاؤں پر لڑھکاؤ تو ( وہ حصہ ) پھول جاتا ہے اور تم اسے ابھرا ہوا دیکھتے ہو ، حالانکہ اس کے اندر کچھ نہیں ہوتا ۔ ‘ ‘ پھر آپ نے ایک کنکری لی اور اسے اپنے پاؤں پر لڑھکایا ۔ ’’پھر لوگ خرید و فروخت کریں گے لیکن کوئی بھی پوری طرح امانت کی ادائیگی نہ کرے گا یہاں تک کہ جائے گا : ’’فلاں خاندان میں ایک آدمی امانت دار ہے ۔ نوبت یہاں تک پہنچے گی کہ کسی آدمی کے بارے میں کہا جائے گا ، وہ کس قدر مضبوط ہے ، کتنا لائق ہے ، کیسا عقل مند ہے ! جبکہ اس کے دل میں رائے کے دانے کے برابر ( بھی ) ایمان نہ ہو گا ۔ ‘ ‘ ( پھر حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : ) مجھ پر ایک دو گزرا ، مجھے پروا نہیں تھی کہ میں تم سے کس کے ساتھ لین دین کروں ، اگر وہ مسلمان ہے تو اس کا دین اس کو میرے پا س واپس لے آئے گا اور اگر وہ یہودی یا عیسائی ہے تو اس کا حاکم اس کو میرے پاس لے آئے گا لیکن آج میں فلاں اور فلاں کے سوا تم میں سے کسی کے ساتھ لین دین نہیں کر سکتا ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا,ابو معاویہ اور وکیع نے اعمش سے حدیث سنائی ، انہوں نے زید بن وہب سے اور انہوں نے حضرت حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، ح، وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ حُذَيْفَةَ، قَالَ: حَدَّثَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَدِيثَيْنِ قَدْ رَأَيْتُ أَحَدَهُمَا، وَأَنَا أَنْتَظِرُ الْآخَرَ حَدَّثَنَا: «أَنَّ الْأَمَانَةَ نَزَلَتْ فِي جَذْرِ قُلُوبِ الرِّجَالِ، ثُمَّ نَزَلَ الْقُرْآنُ، فَعَلِمُوا مِنَ الْقُرْآنِ، وَعَلِمُوا مِنَ السُّنَّةِ»، ثُمَّ حَدَّثَنَا عَنْ رَفْعِ الْأَمَانَةِ قَالَ: يَنَامُ الرَّجُلُ النَّوْمَةَ فَتُقْبَضُ الْأَمَانَةُ مِنْ قَلْبِهِ [ص:127]، فَيَظَلُّ أَثَرُهَا مِثْلَ الْوَكْتِ، ثُمَّ يَنَامُ النَّوْمَةَ فَتُقْبَضُ الْأَمَانَةُ مِنْ قَلْبِهِ، فَيَظَلُّ أَثَرُهَا مِثْلَ الْمَجْلِ كَجَمْرٍ دَحْرَجْتَهُ عَلَى رِجْلِكَ فَنَفِطَ، فَتَرَاهُ مُنْتَبِرًا وَلَيْسَ فِيهِ شَيْءٌ - ثُمَّ أَخَذَ حَصًى فَدَحْرَجَهُ عَلَى رِجْلِهِ - فَيُصْبِحُ النَّاسُ يَتَبَايَعُونَ لَا يَكَادُ أَحَدٌ يُؤَدِّي الْأَمَانَةَ حَتَّى يُقَالَ: إِنَّ فِي بَنِي فُلَانٍ رَجُلًا أَمِينًا، حَتَّى يُقَالَ لِلرَّجُلِ: مَا أَجْلَدَهُ مَا أَظْرَفَهُ مَا أَعْقَلَهُ وَمَا فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ وَلَقَدْ أَتَى عَلَيَّ زَمَانٌ وَمَا أُبَالِي أَيَّكُمْ بَايَعْتُ، لَئِنْ كَانَ مُسْلِمًا لَيَرُدَّنَّهُ عَلَيَّ دِينُهُ، وَلَئِنْ كَانَ نَصْرَانِيًّا أَوْ يَهُودِيًّا لَيَرُدَّنَّهُ عَلَيَّ سَاعِيهِ، وَأَمَّا الْيَوْمَ فَمَا كُنْتُ لِأُبَايِعَ مِنْكُمْ إِلَّا فُلَانًا وَفُلَانًا.",
                "headingArabic": "رَفْعِ الأَمَانَةِ وَالإِيمَانِ مِنْ بَعْضِ الْقُلُوبِ وَعَرْضِ الْفِتَنِ عَلَى الْقُلُوبِ ‏‏",
                "headingUrdu": "بعض دلوں سے دیانت اور ایمان کا غائب ہو جانا اور بعض دلوں میں فتنے کا نمودار ہونا",
                "headingEnglish": "The disappearance of honesty and faith from some hearts and the appearance of fitnah in some hearts",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7932,
                "hadithNumber": "368",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted by another chain of transmitters: Ibn Numair, Waki', Ishaq b. Ibrahim, 'Isa bin Yunus on the authority of A'mash.",
                "hadithUrdu": "( اعمش کےدوسرے شاگردوں ) عبد اللہ بن نمیر ، وکیع اور عیسیٰ بن یونس نے بھی اسی سند کے ساتھ مذکورہ بالا حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، وَوَكِيعٌ، ح، وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ جَمِيعًا عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7933,
                "hadithNumber": "369",
                "englishNarrator": "It is narrated on the authority of Hudhaifa:",
                "hadithEnglish": "We were sitting in the company of Umar ‌رضی ‌اللہ ‌عنہ ‌and he said: Who amongst you has heard the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) talking about the turmoil? Some people said: It is we who heard it. Upon this be remarked: Perhaps by turmoil you presume the unrest of man in regard to his household or neighbour, they replied: Yes. He ('Umar ‌رضی ‌اللہ ‌عنہ ) observed: Such (an unrest) would be done away with by prayer, fasting and charity. But who amongst you has heard from the Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) describing that turmoil which would come like the wave of the ocean. Hudhaifa said: The people hushed into silence, I replied: It is I. He ('Umar ‌رضی ‌اللہ ‌عنہ ) said: Ye, well, your father was also very pious. Hudhaifa ‌رضی ‌اللہ ‌عنہ ‌said: I heard the Messenger of Allah (may peace be, upon him ) observing: Temptations will be presented to men's hearts as reed mat is woven stick by stick and any heart which is impregnated by them will have a black mark put into it, but any heart which rejects them will have a white mark put in it. The result is that there will become two types of hearts: one white like a white stone which will not be harmed by any turmoil or temptation, so long as the heavens and the earth endure; and the other black and dust-coloured like a vessel which is upset, not recognizing what is good or rejecting what is abominable, but being impregnated with passion. Hudhaifa ‌رضی ‌اللہ ‌عنہ said: I narrated to him ('Umar ‌رضی ‌اللہ ‌عنہ ): There is between you and that (turmoil) a closed door, but there is every likelihood of its being broken. 'Umar ‌رضی ‌اللہ ‌عنہ said: Would it be broken? You have, been rendered fatherless. Had it been opened, it would have been perhaps closed also. I said: No, it would be broken, and I narrated to him: Verily that door implies a person who would be killed or die. There is no mistake in this hadith. Abu Khalid narrated: I said to Sa'd, O Abu Malik, what do you mean by the term Aswad Murbadda ? He replied: High degree of whiteness in blackness. I said: What is meant by Alkoozu Mujakhiyyan ? He replied: A vessel turned upside down.",
                "hadithUrdu": "ہم حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کےپاس تھے ، انہوں نے پوچھا : تم میں سے کس نے رسول اللہ ﷺ کو فتنوں کا ذکر کرتے ہوئے سنا؟ کچھ لوگوں نے جواب دیا : ہم نے یہ ذکر سنا ۔ حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے فرمایا : شاید تم و ہ آزمائش مراد لے رہے ہو جو آدمی کو اس کے اہل ، مال اور پڑوسی ( کے بارے ) میں پیش آتی ہے ؟ انہوں نے کہا : جی ہاں ۔ حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : اس فتنے ( اہل ، مال اور پڑوسی کے متعلق امور میں سرزد ہونے والی کوتاہیوں ) کا کفارہ نماز ، روزہ اور صدقہ بن جاتے ہیں ۔ لیکن تم میں سے کس نے رسول اللہ ﷺ سے اس فتنے کا ذکر سنا ے جو سمندر کی طرح موجزن ہو گا؟ حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : اس پر سب لوگ خاموش ہو گئے تو میں نے کہا : میں نے ( سنا ہے ۔ ) حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : تو نے ، تیرا باپ اللہ ہی کا ( بندہ ) ہے ( کہ اسے تم سا بیٹا عطا ہوا ۔ ) حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : میں نے رسول اللہ ﷺ سےسنا ، آپ فرما رہے تھے : ’’فتنے دلوں پر ڈالیں جائیں گے ، چٹائی ( کی بنتی ) کی طرح تنکا تنکا ( ایک ایک ) کر کے اور جو دل ان سے سیراب کر دیا گیا ( اس نے ان کو قبول کر لیا اور اپنے اندر بسا لیا ) ، اس میں ایک سیاہ نقطہ پڑ جائے گا اور جس دل میں ان کو رد کر دیا اس میں سفید نقطہ پڑ جائے گا یہاں تک کہ دل دو طرح کے ہو جائیں گے : ( ایک دل ) سفید ، چکنے پتھر کے مانند ہو جائے گا ، جب تک آسمان و زمین قائم رہیں گے ، کوئی فتنہ اس کو نقصان نہیں پہنچائے گا ۔ دوسرا کالا مٹیالے رنگ کا اوندھے لوٹے کے مانند ( جس پر پانی کی بوند بھی نہیں ٹکتی ) جو نہ کسی نیکی کو پہچانے کا اور نہ کسی برائی سے انکار کرے گا ، سوائے اس بات کے جس کی خواہش سے وہ ( دل ) لبریز ہو گا ۔ ‘ ‘ حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : میں نےعمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے بیان کیا کہ آپ کے اور ان فتنوں کے درمیان بند دروازے ہے ، قریب ہے کہ اسے توڑ دیا جائے گا؟ اگر اسے کھول دیا گیا تو ممکن ہے کہ اسے دوبارہ بند کیا جاسکے ۔ میں نے کہا : نہیں ! بلکہ توڑ دیا جائے گا ۔ اور میں نے انہیں بتا دیا : وہ دروازہ آدمی ہے جسے قتل کر دیا جائے گا یا فوت ہو جائے گا ۔ ( حذیفہ نے کہا : میں نے انہیں ) حدیث ( سنائی کوئی ) ، مغالطے میں ڈالنے والی باتیں نہیں ۔ ابو خالدنے کہا : میں نے سعد سے پوچھا : ابو مالک !أسودمرباداً سے کیا مراد ہے ؟ انہوں نے کہا : کالے رنگ میں شدید سفیدی ( مٹیالے رنگ ۔ ) کہا : میں نے پوچھا : الکوز مجخیاسے کیا مراد ہے ؟ انہوں نے کہا : الٹا کیا ہوا کوزہ ۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا,ابو خالد سلیمان بن حیان نے سعد بن طارق سے حدیث سنائی ، انہوں نے ربعی سے اور انہوں نے حضرت حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نےکہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو خَالِدٍ، يَعْنِي سُلَيْمَانَ بْنَ حَيَّانَ، عَنْ سَعْدِ بْنِ طَارِقٍ، عَنْ رِبْعِيٍّ، عَنْ حُذَيْفَةَ، قَالَ: كُنَّا عِنْدَ عُمَرَ، فَقَالَ: أَيُّكُمْ سَمِعَ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ الْفِتَنَ؟ فَقَالَ قوْمٌ: نَحْنُ سَمِعْنَاهُ، فَقَالَ: لَعَلَّكُمْ تَعْنُونَ فِتْنَةَ الرَّجُلِ فِي أَهْلِهِ وَجَارِهِ؟ قَالُوا: أَجَلْ، قَالَ: تِلْكَ تُكَفِّرُهَا الصَّلَاةُ وَالصِّيَامُ وَالصَّدَقَةُ، وَلَكِنْ أَيُّكُمْ سَمِعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ الَّتِي تَمُوجُ مَوْجَ الْبَحْرِ؟ قَالَ حُذَيْفَةُ: فَأَسْكَتَ الْقَوْمُ، فَقُلْتُ: أَنَا، قَالَ: أَنْتَ لِلَّهِ أَبُوكَ قَالَ حُذَيْفَةُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «تُعْرَضُ الْفِتَنُ عَلَى الْقُلُوبِ كَالْحَصِيرِ عُودًا عُودًا، فَأَيُّ قَلْبٍ أُشْرِبَهَا، نُكِتَ فِيهِ نُكْتَةٌ سَوْدَاءُ، وَأَيُّ قَلْبٍ أَنْكَرَهَا، نُكِتَ فِيهِ نُكْتَةٌ بَيْضَاءُ [ص:129]، حَتَّى تَصِيرَ عَلَى قَلْبَيْنِ، عَلَى أَبْيَضَ مِثْلِ الصَّفَا فَلَا تَضُرُّهُ فِتْنَةٌ مَا دَامَتِ السَّمَاوَاتُ وَالْأَرْضُ، وَالْآخَرُ أَسْوَدُ مُرْبَادًّا كَالْكُوزِ، مُجَخِّيًا لَا يَعْرِفُ مَعْرُوفًا، وَلَا يُنْكِرُ مُنْكَرًا، إِلَّا مَا أُشْرِبَ مِنْ هَوَاهُ»، قَالَ حُذَيْفَةُ: وَحَدَّثْتُهُ، «أَنَّ بَيْنَكَ وَبَيْنَهَا بَابًا مُغْلَقًا يُوشِكُ أَنْ يُكْسَرَ»، قَالَ عُمَرُ: أَكَسْرًا لَا أَبَا لَكَ؟ فَلَوْ أَنَّهُ فُتِحَ لَعَلَّهُ كَانَ يُعَادُ، قُلْتُ: «لَا بَلْ يُكْسَرُ»، وَحَدَّثْتُهُ «أَنَّ ذَلِكَ الْبَابَ رَجُلٌ يُقْتَلُ أَوْ يَمُوتُ حَدِيثًا لَيْسَ بِالْأَغَالِيطِ» قَالَ أَبُو خَالِدٍ: فَقُلْتُ لِسَعْدٍ: يَا أَبَا مَالِكٍ، مَا أَسْوَدُ مُرْبَادٌّ؟ قَالَ: «شِدَّةُ الْبَيَاضِ فِي سَوَادٍ»، قَالَ: قُلْتُ: فَمَا الْكُوزُ مُجَخِّيًا؟ قَالَ: «مَنْكُوسًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7934,
                "hadithNumber": "370",
                "englishNarrator": "It is narrated on the authority of Rib'i (bin Hirash):",
                "hadithEnglish": "When Hudhaifa رضی ‌اللہ ‌عنہ came from 'Umar رضی ‌اللہ ‌عنہ ‌he sat down to narrate to us and said: Verily yesterday when I was sitting with the Commander of the believers he asked his companions: When amongst you retains in his memory the utterance of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) with regard to the turmoil? -and he cited the hadith like the hadith narrated on the authority of Abu Khalid, but he did not mention the exposition of his words (Murbaddan) and (Mujakhiyyan).",
                "hadithUrdu": "جب حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی مجلس سے آئے تو بیٹھ کر ہمیں باتیں سنانے لگے اور کہا : کل جب میں امیر المومنین کی مجلس میں بیٹھا تو انہوں نے اپنے رفقاء سے پوچھا : تم میں سے کس نے فتنوں کے بارے میں رسو ل اللہ ﷺ کا فرمان یاد رکھا ہواہے ؟....... پھر ( مروان فزاری نے ) ابو خالد کی حدیث کی طرح حدیث بیان کی لیکن مرباداً مجخیاً سے متعلق ابو مالک کی تفسیر ذکر نہیں کی ۔",
                "urduNarrator": "ابن ابی عمر نے مجھ سے کہا,مروان فزاری نے کہا , ہمیں ابو مالک اشجعی نے حضرت ربعی سے حدیث سنائی ، انہوں نےکہا",
                "hadithArabic": "حَدَّثَنِي ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ الْفَزَارِيُّ، حَدَّثَنَا أَبُو مَالِكٍ الْأَشْجَعِيُّ، عَنْ رِبْعِيٍّ، قالَ: لَمَّا قَدِمَ حُذَيْفَةُ مِنْ عِنْدِ عُمَرَ جَلَسَ، فَحَدَّثَنَا، فَقَالَ: إِنَّ أَمِيرَ الْمُؤْمِنِينَ أَمْسِ لَمَّا جَلَسْتُ إِلَيْهِ سَأَلَ أَصْحَابَهُ، أَيُّكُمْ يَحْفَظُ قَوْلَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْفِتَنِ؟ وَسَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ أَبِي خَالِدٍ، وَلَمْ يَذْكُرْ تَفْسِيرَ أَبِي مَالِكٍ لِقَوْلِهِ: «مُرْبَادًّا مُجَخِّيًا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7935,
                "hadithNumber": "371",
                "englishNarrator": "It is transmitted by Rib'i bin Hirash. who narrated it on the authority of Hudhaifa ‌رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "Verily 'Umar ‌رضی ‌اللہ ‌عنہ said: Who would narrate to us or who amongst you would narrate to us (and Hudhaifa was one amongst them) what the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) had said about the turmoil? Hudhaifa said: I will, and recited the hadith like that transmitted by Abu Malik on the authority of Rib'i and he observed in connection with this hadith that Hudhaifa ‌رضی ‌اللہ ‌عنہ remarked: I am narrating to you a hadith and it has no mistake, and said: That it is transmitted from he Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ).",
                "hadithUrdu": "حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے فرمایا : تم میں کون ہمیں بتائے گا ( اور ان میں حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ موجود تھے ) جو رسول اللہ ﷺ نے فتنے کے بارے میں فرمایا تھا ؟ حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : میں ۔ آگے ابو مالک کی وہی روایت بیان کی ہے جو انہوں نے ربعی سے بیان کی اور اس میں حضرت حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کا یہ قول بھی بیان کیا کہ میں نے انہیں حدیث سنائی تھی ، مغالطے میں ڈالنے والی باتیں نہیں ، یعنی وہ حدیث رسو ل اللہ ﷺ کی جانب سے تھی ۔",
                "urduNarrator": "مجھ سے محمد بن المثنیٰ، عمرو بن علی اور عقبہ بن مکرم العمی نے بیان کیا، انہوں نے کہا: ہم سے محمد بن ابی عدی نے سلیمان تیمی کی روایت سے بیان کیا,نعیم بن ابی ہند نے ربعی بن حراش سے اور انہوں نےحضرت حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، وَعَمْرُو بْنُ عَلِيٍّ، وَعُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، قَالُوا: حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ نُعَيْمِ بْنِ أَبِي هِنْدَ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، أَنَّ عُمَرَ، قَالَ: مَنْ يُحَدِّثُنَا أَوْ قَالَ: أَيُّكُمْ يُحَدِّثُنَا - وَفِيهِمْ حُذَيْفَةُ - مَا قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي الْفِتْنَةِ؟ قَالَ حُذَيْفَةُ: أَنَا، وَسَاقَ الْحَدِيثَ كَنَحْوِ حَدِيثِ أَبِي مَالِكٍ، عَنْ رِبْعِيٍّ، وَقَالَ فِي الْحَدِيثِ: قَالَ حُذَيْفَةُ: حَدَّثْتُهُ حَدِيثًا لَيْسَ بِالْأَغَالِيطِ، وَقَالَ: يَعْنِي أَنَّهُ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7936,
                "hadithNumber": "372",
                "englishNarrator": "It is narrated on the authority of Abu Huraira ‌رضی ‌اللہ ‌عنہ :",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Islam initiated as something strange, and it would revert to its (old position) of being strange. so good tidings for the stranger.",
                "hadithUrdu": "رسو ل اللہ ﷺ نے فرمایا : ’’اسلام کے آغاز اجنبی کی حیثیت سے ہوا اور عنقریب پھر اسی طرح اجنبی ہو جائے گا جیسے شروع ہوا تھا ، خوش بختی ہے اجنبیوں کے لیے ۔ ‘ ‘",
                "urduNarrator": "محمد ابن عباد اور ابن ابی عمر نے مروان الفزاری کی سند سے ہم سب کو بیان کیا، ابن عباد نے کہا: ہم سے مروان نے بیان کیا، یزید کی سند سے، یعنی ابن کیسان نے، اے کی سند پر، میں پختہ ہوں,حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ مَرْوَانَ الْفَزَارِيِّ، قَالَ ابْنُ عَبَّادٍ: حَدَّثَنَا مَرْوَانُ، عَنْ يَزِيدَ يَعْنِي ابْنَ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «بَدَأَ الْإِسْلَامُ غَرِيبًا، وَسَيَعُودُ كَمَا بَدَأَ غَرِيبًا، فَطُوبَى لِلْغُرَبَاءِ».",
                "headingArabic": "بَيَانِ أَنَّ الْإِسْلَامَ بَدَأَ غَرِيبًا وَسَيَعُودُ غَرِيبًا وَأَنَّهُ يَأْرِزُ بَيْنَ الْمَسْجِدَيْنِ",
                "headingUrdu": "یہ واضح کرنا کہ اسلام ایک عجیب چیز کے طور پر شروع ہوا تھا، اور دوبارہ اجنبی ہو جائے گا، اور یہ دونوں مسجدوں کے درمیان پیچھے ہٹ جائے گا۔",
                "headingEnglish": "Clarifying that Islam started as something strange, and will revert to being something strange, and it will retreat between the two Masajid",
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7937,
                "hadithNumber": "373",
                "englishNarrator": "It is narrated on the authority of Ibn 'Umar ('Abdullah bin 'Umar):",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) observed: Verily Islam started as something strange and it would again revert (to its old position) of being strange just as it started, and it would recede between the two mosques just as the serpent crawls back into its hole.",
                "hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ” اسلام شروع ہوا غربت میں اور پھر غریب ہو جائے جیسے شروع ہوا تھا اور وہ سمٹ کر دونوں مسجدوں (مکے مدینے) کے بیچ میں آ جائے گا ، جیسے سانپ سمٹ کر اپنے سوراخ (بل) میں چلا جاتا ہے ۔ “",
                "urduNarrator": "مجھ سے محمد بن رافع اور فضل بن سہل العرج نے بیان کیا، کہا: ہم سے شبابہ بن سوار نے بیان کیا، جو محمد عمری کے بیٹے ہیں، نے بیان کیا,سیدنا عبداللہ بن عمر ؓ سے روایت ہے",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَالْفَضْلُ بْنُ سَهْلٍ الْأَعْرَجُ، قَالَا: حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، حَدَّثَنَا عَاصِمٌ وَهُوَ ابْنُ مُحَمَّدٍ الْعُمَرِيُّ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْإِسْلَامَ بَدَأَ غَرِيبًا وَسَيَعُودُ غَرِيبًا كَمَا بَدَأَ، وَهُوَ يَأْرِزُ بَيْنَ الْمَسْجِدَيْنِ، كَمَا تَأْرِزُ الْحَيَّةُ فِي جُحْرِهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 7938,
                "hadithNumber": "374",
                "englishNarrator": "It is narrated on the authority of Abu Huraira رضی ‌اللہ ‌عنہ ‌:",
                "hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Verily the faith would recede to Medina just as the serpent crawls back into its hole.",
                "hadithUrdu": "رسو ل اللہ ﷺ نے فرمایا : ’’ بلاشبہ ایمان مدینہ کی جانب یوں سمٹ آئے گا جیسے سانپ اپنے بل کی جانب سمٹ آتا ہے ۔ ‘ ‘",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے عبداللہ بن نمیر نے بیان کیا، اور کہا کہ ہم سے ابو اسامہ نے بیان کیا، وہ عبید اللہ بن عمر، ایچ، ابن نمیر نے بیان کیا، کہا کہ ہم سے میرے والد نے بیان کیا، کہا ہم سے عبید اللہ نے بیان کیا۔ خبیب بن عبدالرحمٰن، حفص بن عاصم کی سند سے،حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ، عَنْ عُبَيْدِ اللهِ بْنِ عُمَرَ، ح، وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْإِيمَانَ لَيَأْرِزُ إِلَى الْمَدِينَةِ، كَمَا تَأْرِزُ الْحَيَّةُ إِلَى جُحْرِهَا».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-muslim",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 101,
                    "chapterNumber": "1",
                    "chapterEnglish": "The Book of Faith",
                    "chapterUrdu": "ایمان کا بیان",
                    "chapterArabic": "كتاب الْإِيمَانِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7626,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=305",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=303",
                "label": "303",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=304",
                "label": "304",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=305",
                "label": "305",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=306",
                "label": "306",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=307",
                "label": "307",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=308",
                "label": "308",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=309",
                "label": "309",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=307",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=307",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=305",
        "to": 7650,
        "total": 40465
    }
}