{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 498,
        "data": [
            {
                "id": 12714,
                "hadithNumber": "5151",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated on the authority of Abi Maslama with the same chain of transmitters.",
                "hadithUrdu": "ہمیں نصر بن علی الجہدمی نے بیان کیا, بشر بن مفضل نے ابومسلمہ سے اسی سند کے ساتھ اسی کے مانندروایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ مُفَضَّلٍ عَنْ أَبِي مَسْلَمَةَ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12715,
                "hadithNumber": "5152",
                "englishNarrator": "Abu Sa'id al-Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: He who amongst you drinks Nabidh should drink that (prepared either from) grapes alone, or from dates alone, or from unripe dates alone (and not by mixing them with one another).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سےجو شخص نبیذ پیے وہ صرف کشمش کا نبیذ پیے یا صرف خشک کھجوروں کو نبیذ پیے یا صرف کچی کھجوروں کا نبیذ پیے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, وکیع نے اسماعیل بن مسلم عبدی سے ، انھوں نے ابو متوکل ناجی سے ، انھوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا وَكِيعٌ عَنْ إِسْمَعِيلَ بْنِ مُسْلِمٍ الْعَبْدِيِّ عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ شَرِبَ النَّبِيذَ مِنْكُمْ فَلْيَشْرَبْهُ زَبِيبًا فَرْدًا أَوْ تَمْرًا فَرْدًا أَوْ بُسْرًا فَرْدًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12716,
                "hadithNumber": "5153",
                "englishNarrator": "Isma'il bin Muslim al-'Abadi reported on the authority of the same chain of transmitters:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) prohibited us that we should mix dry dates with unripe dates or (mix) grapes with dry dates (and prepare Nabidh). He also said: He who amongst you drinks-the rest of the hadith is the same.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ( نبیذ میں ) کچی کھجوروں کو خشک کھجوروں کے ساتھ ملانے ، یا کشمش کوخشک کھجور کے ساتھ یا کشمش کو نیم پختہ کھجوروں کے سات ملانے سے منع کیا اور یہ فرمایا : \" تم میں سے جوشخص اسے پیے ۔ ۔ ۔ \" آگے وکیع کی حدیث ( 5152 ) کے مانند بیان کیا ۔",
                "urduNarrator": "اور مجھ سے ابوبکر بن اسحاق نے بیان کیا, روح بن عبادہ نے کہا : ہمیں اسماعیل بن مسلم عبدی نے اسی سند کے ساتھ حدیث بیان کی ، کہا",
                "hadithArabic": "و حَدَّثَنِيهِ أَبُو بَكْرِ بْنُ إِسْحَقَ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا إِسْمَعِيلُ بْنُ مُسْلِمٍ الْعَبْدِيُّ بِهَذَا الْإِسْنَادِ قَالَ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَخْلِطَ بُسْرًا بِتَمْرٍ أَوْ زَبِيبًا بِتَمْرٍ أَوْ زَبِيبًا بِبُسْرٍ وَقَالَ مَنْ شَرِبَهُ مِنْكُمْ فَذَكَرَ بِمِثْلِ حَدِيثِ وَكِيعٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12717,
                "hadithNumber": "5154",
                "englishNarrator": "Abu Qatada, on the authority of his father, reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) having said this: Do not prepare Nabidh by mixing nearly ripe dates and fresh dates together, and do not prepare Nabidh by mixing grapes and dates together, but prepare Nabidh from each (one of them) separately.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ادھ پکی کھجوروں اور پکی کھجوروں کو ملاکر نبیذ نہ بناؤ اور کشمش اور خشک کھجوروں کو ملا کر نبیذ نہ بناؤ اور دونوں میں سے ہر ایک کی الگ الگ نبیذ بناؤ ۔ \"",
                "urduNarrator": "ہم سے یحییٰ بن ایوب نے بیان کیا، کہا ہم سے ابن علیہ نے بیان کیا, ہشام دستوائی نے یحییٰ بن ابی کثیر سے ، انھوں نے عبداللہ بن ابی قتادہ سے ، انھوں نے اپنے والد سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنَا ابْنُ عُلَيَّةَ أَخْبَرَنَا هِشَامٌ الدَّسْتَوَائِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَنْتَبِذُوا الزَّهْوَ وَالرُّطَبَ جَمِيعًا وَلَا تَنْتَبِذُوا الزَّبِيبَ وَالتَّمْرَ جَمِيعًا وَانْتَبِذُوا كُلَّ وَاحِدٍ مِنْهُمَا عَلَى حِدَتِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12718,
                "hadithNumber": "5155",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been narrated on the authority of Yahya bin Abu Kathir with the same chain of transmitters.",
                "hadithUrdu": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے محمد بن بشر العبدی نے بیان کیا, حجاج بن ابی عثمان نے یحییٰ بن ابی کثیر سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ الْعَبْدِيُّ عَنْ حَجَّاجِ بْنِ أَبِي عُثْمَانَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12719,
                "hadithNumber": "5156",
                "englishNarrator": "Abu Qatada رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ) as saying: Do not prepare Nabidh by mixing nearly ripe and fresh dates and do not prepare Nabidh by mixing together fresh dates and grapes, but prepare Nabidh out of each (one of them) separately. Yahya stated that he had met 'Abdullah bin Abu Qatada رضی اللہ عنہ and he narrated it on the authority of his father that Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said this.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \"\" نیم پختہ اور پختہ کھجوروں کو ملا کر نبیذ نہ بنا ؤ اور تا زہ کھجوروں اور کشمش کو ملا کر نبیذ نہ بنا ؤ البتہ ہر جنس کی الگ الگ نبیذ بنا ؤ ۔ \"\" یحییٰ نے یہ بھی بتا یا کہ ان کی عبد اللہ بن ابی قتادہ رضی اللہ عنہ سے ملا قات ہو ئی تو انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
                "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا، کہا ہم سے عثمان بن عمر نے بیان کیا, علی بن مبار ک نے یحییٰ ( بن ابی کثیر ) سے انھوں نے ابو سلمہ سے انھوں نے حضرت ابو قتادہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا عَلِيٌّ وَهُوَ ابْنُ الْمُبَارَكِ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أِبِي قَتَادَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَنْتَبِذُوا الزَّهْوَ وَالرُّطَبَ جَمِيعًا وَلَا تَنْتَبِذُوا الرُّطَبَ وَالزَّبِيبَ جَمِيعًا وَلَكِنْ انْتَبِذُوا كُلَّ وَاحِدٍ عَلَى حِدَتِهِ وَزَعَمَ يَحْيَى أَنَّهُ لَقِيَ عَبْدَ اللَّهِ بْنَ أَبِي قَتَادَةَ فَحَدَّثَهُ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ هَذَا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12720,
                "hadithNumber": "5157",
                "englishNarrator": "Yahya bin Abu Kathir narrated it with two chain of narrators except that he said:",
                "hadithEnglish": "\"Fresh dates and Az-Zahw, and dries dates raisins.\"",
                "hadithUrdu": "\" تازہ کھجور اور رنگ بدلتی کھجور خشک کھجور اور کشمش کی ( نبیذنہ بنا ؤ ) \".",
                "urduNarrator": "مجھ سے ابوبکر بن اسحاق نے بیان کیا، ہم سے راو بن عبادہ نے بیان کیا, حسین معلم نے کہا : یحییٰ بن ابی کثیر نے ہمیں انھی دونوں سندوں سے حدیث بیان کی ، مگر انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِيهِ أَبُو بَكْرِ بْنُ إِسْحَقَ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ بِهَذَيْنِ الْإِسْنَادَيْنِ غَيْرَ أَنَّهُ قَالَ الرُّطَبَ وَالزَّهْوَ وَالتَّمْرَ وَالزَّبِيبَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12721,
                "hadithNumber": "5158",
                "englishNarrator": "Abdullah bin Abu Qatada رضی اللہ عنہ, on the authority of his father, reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbidding the preparation of the mixture of ripe dates and unripe dates, and the mixture of grapes and dates, and that of nearly ripe dates and fresh dates but the Prophet said: Prepare the Nabidh from each one of them separately.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ( نبیذبنا نے کے لیے ) خشک بدلتی اور گچی کھجوروں کو  ,کشمش اور خشک کھجوروں کو اور رنگ بدلتی اور تازہ کھجوروں کو ملا نے سے منع کیا اور فر ما یا : \" ہر جنس کی الگ الگ نبیذ بناؤ ۔",
                "urduNarrator": "مجھ سے ابوبکر بن اسحاق نے بیان کیا، ہم سے عفان بن مسلم نے بیان کیا,  ابان عطار نے کہا , ہمیں یحییٰ بن ابی کثیر نے حدیث بیان کی کہا : مجھے عبد اللہ بن ابی قتادہ رضی اللہ عنہ نے اپنے والد سے حدیث بیان کی کہ",
                "hadithArabic": "و حَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَقَ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا أَبَانُ الْعَطَّارُ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ عَنْ أَبِيهِ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ خَلِيطِ التَّمْرِ وَالْبُسْرِ وَعَنْ خَلِيطِ الزَّبِيبِ وَالتَّمْرِ وَعَنْ خَلِيطِ الزَّهْوِ وَالرُّطَبِ وَقَالَ انْتَبِذُوا كُلَّ وَاحِدٍ عَلَى حِدَتِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12722,
                "hadithNumber": "5159",
                "englishNarrator": null,
                "hadithEnglish": "This hadith is narrated on the authority of Abu Qatada رضی اللہ عنہ through another chain of transmitters.",
                "hadithUrdu": "ابو سلمہ بن عبد الرحمٰن نے ابو قتادہ رضی اللہ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے اسی سند کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي قَتَادَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ هَذَا الْحَدِيثِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12723,
                "hadithNumber": "5160",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade (the preparation of Nabidh) from grapes and dates, and unripe dates and dry dates (by mixing them together). He (the Prophet also) said: Prepare Nabidh from each one of them separately.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کشمش اور کھجوروں کچی اور خشک کھجوروں ( کو ملا کر نبیذ بنا نے ) سے منع کیا اور فر ما یا : \" ان دونوں میں سے ہر ایک کی الگ الگ نبیذ بنا ئی جا ئے ۔",
                "urduNarrator": "ہم سے زہیر بن حرب اور ابو کریب نے بیان کیا، اور انہوں نے کہا: وکیع نے عکرمہ بن عمار سے انھوں نے ابو کثیر حنفی سے انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِزُهَيْرٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ عَنْ أَبِي كَثِيرٍ الْحَنَفِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الزَّبِيبِ وَالتَّمْرِ وَالْبُسْرِ وَالتَّمْرِ وَقَالَ يُنْبَذُ كُلُّ وَاحِدٍ مِنْهُمَا عَلَى حِدَتِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12724,
                "hadithNumber": "5161",
                "englishNarrator": "It was narrated from Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Messenger of Allah ﷺ said: \"Travel is a kind of torment. It deprives one of you of his sleep, food and drink. When one of you has completed his business, let him him hasten back to his family. He said: Yes.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سفر عذاب کا ایک ٹکڑا ہے جو تم میں سے کسی کی نیند اور کھانے سے محروم ہو جاتا ہے۔ اور اس کا پینا، جب تم میں سے کوئی اپنی بھوک پوری کر لے تو وہ اپنے گھر والوں کے پاس پہنچ جائے، اس نے کہا: ہاں۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قناب، اسماعیل بن ابی اویس، ابو مصعب الزہری، منصور بن ابی مظہیم اور قتیبہ نے بیان کیا۔ بن سعید، انہوں نے کہا کہ ہم سے مالک نے بیان کیا، اور ہم سے یحییٰ بن یحییٰ تمیمی نے بیان کیا - اور قول ان کا ہے، انہوں نے کہا کہ میں نے مالک سے کہا، انہوں نے تم سے بیان کیا: اس کا نام ابو صالح، ابوہریرہ رضی اللہ عنہ سے ہے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، وَإِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، وَأَبُو مُصْعَبٍ الزُّهْرِيُّ وَمَنْصُورُ بْنُ أَبِي مُزَاحِمٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالُوا حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنَا يَحْيَى، بْنُ يَحْيَى التَّمِيمِيُّ - وَاللَّفْظُ لَهُ - قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ سُمَىٌّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ يَمْنَعُ أَحَدَكُمْ نَوْمَهُ وَطَعَامَهُ وَشَرَابَهُ فَإِذَا قَضَى أَحَدُكُمْ نَهْمَتَهُ مِنْ وَجْهِهِ فَلْيُعَجِّلْ إِلَى أَهْلِهِ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏",
                "headingArabic": "السَّفَرِ قِطْعَةٌ مِنَ الْعَذَابِ وَاسْتِحْبَابِ تَعْجِيلِ الْمُسَافِرِ إِلَى أَهْلِهِ بَعْدَ قَضَاءِ شُغْلِهِ",
                "headingUrdu": "سفر ایک قسم کا عذاب ہے، اور مسافر کے لیے مستحب ہے کہ وہ اپنا کاروبار ختم کرنے کے بعد اپنے گھر والوں کے پاس واپس چلے۔",
                "headingEnglish": "Travel is a kind of torment, and it is recommended for the traveler to hasten back to his family after finishing his business",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12725,
                "hadithNumber": "5162",
                "englishNarrator": "Ibn 'Abbas رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the mixing of dates and grapes together, and mixing of unripe dates and ripe dates together (for preparing Nabidh), and he wrote to the people of Jurash (in Yemen) forbidding them to prepare the mixture of dates and grapes.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ( نبیذ بنا نے کے لیے ) خشک کھجوروں اور کشمش کو باہم ملا نے اور کچی اور خشک کھجوروں کو باہم ملا نے سے منع فرما یا اور آپ نے اہل جرش کی طرف لکھا اور اس بات سے منع کیا کہ وہ خشک کھجوروں اورکشمش کو ملا کر مشروب بنائیں ۔",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, علی بن مسہر نے ہمیں شیبانی سے حدیث بیان کی ، انھوں نے حبیب سے انھوں نے سعید بن جبیر سے انھوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الشَّيْبَانِيِّ عَنْ حَبِيبٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ نَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُخْلَطَ التَّمْرُ وَالزَّبِيبُ جَمِيعًا وَأَنْ يُخْلَطَ الْبُسْرُ وَالتَّمْرُ جَمِيعًا وَكَتَبَ إِلَى أَهْلِ جُرَشَ يَنْهَاهُمْ عَنْ خَلِيطِ التَّمْرِ وَالزَّبِيبِ.",
                "headingArabic": "كَرَاهَةِ الطُّرُوقِ وَهُوَ الدُّخُولُ لَيْلاً لِمَنْ وَرَدَ مِنْ سَفَرٍ ‏‏",
                "headingUrdu": "سفر سے گھر آتے وقت رات کو داخل ہونا ناپسندیدہ ہے۔",
                "headingEnglish": "It is disliked to enter at night when coming home from a journey",
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12726,
                "hadithNumber": "5163",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 5162) was narrated from Anas bin Malik, from the prophet ﷺ, but he said: \"He did not enter upon...\"",
                "hadithUrdu": "مجھ سے وہب بن بقیہ نے بیان کیا، یعنی ملر نے ہمیں الشیبانی کی سند سے کھجور اور کشمش کی روایت کی، اور اس نے راز کا ذکر نہیں کیا۔ اور تاریخیں۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِيهِ وَهْبُ بْنُ بَقِيَّةَ أَخْبَرَنَا خَالِدٌ يَعْنِي الطَّحَّانَ عَنْ الشَّيْبَانِيِّ بِهَذَا الْإِسْنَادِ فِي التَّمْرِ وَالزَّبِيبِ وَلَمْ يَذْكُرْ الْبُسْرَ وَالتَّمْرَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12727,
                "hadithNumber": "5164",
                "englishNarrator": "Ibn Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "He was forbidden to prepare Nabidh by mixing unripe dates and fresh dates, and dates with grapes.",
                "hadithUrdu": "کچی اور تازہ کھجوروں کو ملا کر اور خشک کھجوروں اور کشمش کو ملا کر نبیذ بنا نے سے منع کر دیا گیا ۔",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا, عبد الرزاق نے کہا : ہمیں ابن جریج نے خبردی کہا : مجھے موسیٰ بن عقبہ نے بتا یا انھوں نے نافع سے انھوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہ وہ کہاکرتے تھے",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ كَانَ يَقُولُ قَدْ نُهِيَ أَنْ يُنْبَذَ الْبُسْرُ وَالرُّطَبُ جَمِيعًا وَالتَّمْرُ وَالزَّبِيبُ جَمِيعًا",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12728,
                "hadithNumber": "5165",
                "englishNarrator": "Ibn 'Umar رضی اللہ  عنہ reported:",
                "hadithEnglish": "They were forbidden to prepare Nabidh by mixing dry dates and fresh dates and dates and grapes together.",
                "hadithUrdu": "کچی اور تازہ کھجوروں کو اور ( اسی طرح ) خشک کھجوروں اور کشمش کو ملا کر نبیذ بنانے سے منع کیا گیا ہے ۔",
                "urduNarrator": "مجھ سے ابوبکر بن اسحاق نے بیان کیا, روح نے کہا : ہمیں ابن جریج نے حدیث بیان کی ، کہا : مجھے موسیٰ بن عقبہ نے نا فع سے خبر دی انھوں نے حضرت ابن عمر رضی اللہ  عنہ سے روایت کی ، انھوں نے کہا",
                "hadithArabic": "و حَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَقَ حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ قَالَ قَدْ نُهِيَ أَنْ يُنْبَذَ الْبُسْرُ وَالرُّطَبُ جَمِيعًا وَالتَّمْرُ وَالزَّبِيبُ جَمِيعًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12729,
                "hadithNumber": "5166",
                "englishNarrator": "Anas bin Malik رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade the preparation of Nabidh in gourd or varnished jar.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کدو ( کے بنے ہوئے ) اور روغن زفت ملے ہوئے برتنوں میں نبیذ بنانے سے منع فرمایا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, لیث نے ابن شہاب سے ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، انھوں نے ان کو بتایا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الدُّبَّاءِ وَالْمُزَفَّتِ أَنْ يُنْبَذَ فِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12730,
                "hadithNumber": "5167",
                "englishNarrator": "It was narrated that Jabir bin Abdullah رضی اللہ عنہ said:",
                "hadithEnglish": "\"The Messenger of Allah ﷺ forbade a man, if he had been away for a long time, to come to his family at night.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کدو ( کے بنے ہوئے ) اور روغن زفت ملے ہوئے برتنوں میں نبیذ بنانے سے منع فرمایا ۔",
                "urduNarrator": "مجھے عمرو الناقد نے بتایا,سفیان بن عینیہ نے زہری سے ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنِي عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الدُّبَّاءِ وَالْمُزَفَّتِ أَنْ يُنْتَبَذَ فِيهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12731,
                "hadithNumber": "5168",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: Do not prepare Nabidh in gourd or jar or in a pitcher besmeared with pitch (known as green pitcher).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کدو کے ( بنے ہوئے ) برتن میں نبیذ نہ بناؤ اور نہ روغن زفت ملے ہوئے برتن میں ۔ \" پھر حضرت ابو ہریرہ رضی اللہ عنہ یہ کہتے تھے : سبز گھڑوں سے اجتناب کرو ۔",
                "urduNarrator": "( گزشتہ سند سے روایت کرتے ہوئے سفیان بن عینیہ نے ) کہا : انھیں ابو سلمہ نے بتایا کہ انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے سنا ، کہا",
                "hadithArabic": "قَالَ وَأَخْبَرَهُ أَبُو سَلَمَةَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَنْتَبِذُوا فِي الدُّبَّاءِ وَلَا فِي الْمُزَفَّتِ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ وَاجْتَنِبُوا الْحَنَاتِمَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12732,
                "hadithNumber": "5169",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade (the preparation of Nabidh) in varnished jar, pitcher besmeared with green pitch and hollow stump. It was said to Abu Huraira رضی اللہ عنہ : What that Hantama was? He said: It is green pitcher (besmeared with pitch).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے روغن زفت ملے ہوئے برتنوں ، سبز گھڑوں اور کھوکھلی ( کی ہوئی ) لکڑی کے برتنوں سے منع فرمایا ۔ ( ابو صالح نے ) کہا : حضرت ابوہریرہ رضی اللہ عنہ سے کہاگیا کہ حنتم کیا ہے؟انھوں نے بتایا : سبز ( رنگ کے کپڑے ) گھڑے ۔",
                "urduNarrator": "مجھ سے محمد بن حاتم نے بیان کیا، کہا ہم سے بہز نے بیان کیا، کہا ہم سے وہیب نے بیان کیا, سہیل کے والد ( ابوصالح ) نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ الْمُزَفَّتِ وَالْحَنْتَمِ وَالنَّقِيرِ قَالَ قِيلَ لِأَبِي هُرَيْرَةَ مَا الْحَنْتَمُ قَالَ الْجِرَارُ الْخُضْرُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12733,
                "hadithNumber": "5170",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to the group of Abdul-Qais: I forbid you (to prepare Nabidh) in gourd. and green pitcher, hollow stump and varnished jar and the waterskin having its upper end cut, but (prepare it) in your small water skin, and tie its mouth",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے عبدالقیس کے وفدسےفرمایا : \" میں تم کو کدو کے ( بنے ہوئے ) برتنوں ، حنتم ، کھوکھلی لکڑی کے برتنوں ، روغن قارملے ہوئے برتنوں سےمنع کرتا ہوں ۔ حنتم وہ مشکیزے ہیں جن کے منہ کٹے ہوئے ہوں ۔ لیکن اپنے مشکیزوں سے پیو اور ان کا منہ باندھ دیاکرو ۔ \"",
                "urduNarrator": "ہم سے نصر بن علی الجہدمی نے بیان کیا، کہا ہم سے نوح بن قیس نے بیان کیا، کہا ہم سے ابن عون نے بیان کیا, محمد نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ أَخْبَرَنَا نُوحُ بْنُ قَيْسٍ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِوَفْدِ عَبْدِ الْقَيْسِ أَنْهَاكُمْ عَنْ الدُّبَّاءِ وَالْحَنْتَمِ وَالنَّقِيرِ وَالْمُقَيَّرِ وَالْحَنْتَمُ وَالْمَزَادَةُ الْمَجْبُوبَةُ وَلَكِنْ اشْرَبْ فِي سِقَائِكَ وَأَوْكِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12734,
                "hadithNumber": "5171",
                "englishNarrator": "Ali رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) forbade to prepare Nabidh in gourd and varnished jar. This hadith has been narrated through another chain of transmitters with a slight variation of wording.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کدو کے بنے ہوئے اور روغن زفت ملے ہوئے برتنوں میں نبیذ بنانے سے منع فرمایا ۔ یہ جریر کی روایت ہے ۔ عبثر اور شعبہ کی حدیث کے الفاظ یہ ہی کہ نبی کریم صلی اللہ علیہ وسلم نے کدو کے ( بنے ہوئے ) برتن اور روغن زفت ملے برتن سے منع فرمایا ہے ۔",
                "urduNarrator": "ہم سے سعید بن عمرو اشعثی نے بیان کیا,عبثر ، جریر اور شعبہ سب نے اعمش سے ، انھوں نے ابراہیم تیمی سے ، انھوں نے حارث بن سوید سے اور انھوں نے حضرت علی رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ أَخْبَرَنَا عَبْثَرٌ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنِي بِشْرُ بْنُ خَالِدٍ أَخْبَرَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ عَنْ شُعْبَةَ كُلُّهُمْ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ الْحَارِثِ بْنِ سُوَيْدٍ عَنْ عَلِيٍّ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُنْتَبَذَ فِي الدُّبَّاءِ وَالْمُزَفَّتِ هَذَا حَدِيثُ جَرِيرٍ وَفِي حَدِيثِ عَبْثَرٍ وَشُعْبَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الدُّبَّاءِ وَالْمُزَفَّتِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12735,
                "hadithNumber": "5172",
                "englishNarrator": "Ibrahim reported:",
                "hadithEnglish": "I said to Aswad if he had asked the Mother of the Believers (in which utensils) he (the Holy Prophet) disapproved the preparation of Nabidh. He (Aswad) said: Yes. I said: Mother of the Believers, inform me about the utensils in which) Allah's Apostle forbade to prepare Nabidh. She (Hadrat 'A'isha رضی اللہ عنہا ) said: He forbade us, the members of his family, to prepare Nabidh in gourd, or varnished jar. I said to him: Do you remember green pitcher, and pitcher? He said: I narrated to you what I have heard; should I narrate to you which I did not hear?",
                "hadithUrdu": "میں نے اسود سے کہا : کیا تم نے ام المومنین ( عائشہ صدیقہ رضی اللہ عنہا ) سے ان بر تنوں کے بارے میں پوچھا تھا جن میں نبیذ بنانا مکروہ ہے؟انھوں نے کہا : ہاں ، میں نے عرض کی تھی : ام المومنین! مجھے بتائیے کہ رسول اللہ صلی اللہ علیہ وسلم نے کن برتنوں میں نبیذ بنانے سے منع فرمایاتھا؟ ( حضرت عائشہ رضی اللہ عنہا نے ) فرمایا : آپ نے ہم اہل بیت کو کدو کے بنے ہوئے اور روغن زفت ملے ہوئے برتنوں میں نبیذ بنانے سے منع فرمایاتھا ۔ ( ابراہیم نے ) کہا : میں نے ( اسود سے ) پوچھا : انھوں نے حنتم اور گھڑوں کا ذکر نہیں کیا؟انھوں نےکہا : میں تم کو وہی حدیث بیان کرتاہوں جو میں نے سنی ہے ۔ کیا میں تمھیں وہ بات بیان کروں جو میں نے نہیں سنی؟",
                "urduNarrator": "ہم سے زہیر بن حرب اور اسحاق بن ابراہیم نے بیان کیا، ان دونوں نے جریر سے کہا کہ ہم سے جریر نے بیان کیا, منصور نے ابراہیم سے روایت کی ، کہا",
                "hadithArabic": "و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ كِلَاهُمَا عَنْ جَرِيرٍ قَالَ زُهَيْرٌ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ قَالَ قُلْتُ لِلْأَسْوَدِ هَلْ سَأَلْتَ أُمَّ الْمُؤْمِنِينَ عَمَّا يُكْرَهُ أَنْ يُنْتَبَذَ فِيهِ قَالَ نَعَمْ قُلْتُ يَا أُمَّ الْمُؤْمِنِينَ أَخْبِرِينِي عَمَّا نَهَى عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُنْتَبَذَ فِيهِ قَالَتْ نَهَانَا أَهْلَ الْبَيْتِ أَنْ نَنْتَبِذَ فِي الدُّبَّاءِ وَالْمُزَفَّتِ قَالَ قُلْتُ لَهُ أَمَا ذَكَرَتْ الْحَنْتَمَ وَالْجَرَّ قَالَ إِنَّمَا أُحَدِّثُكَ بِمَا سَمِعْتُ أَؤُحَدِّثُكَ مَا لَمْ أَسْمَعْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12736,
                "hadithNumber": "5173",
                "englishNarrator": "A'isha رضی اللہ عنہا reported:",
                "hadithEnglish": "Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) forbade (the preparation) of Nabidh in gourd and varnished jar.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کدو کے بنے ہوئے اورروغن زفت ملے ہوئے برتنوں سے منع فرمایا ۔",
                "urduNarrator": "ہم سے سعید بن عمرو اشعثی نے بیان کیا , اعمش نے ابراہیم سے انھوں نے اسود سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ أَخْبَرَنَا عَبْثَرٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الدُّبَّاءِ وَالْمُزَفَّتِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12737,
                "hadithNumber": "5174",
                "englishNarrator": null,
                "hadithEnglish": "A similar report (as no. 5173) was narrated 'Aishah رضی اللہ عنہا , from the prophet ﷺ.",
                "hadithUrdu": "منصور ، سلیمان اور حماد نے ابراہیم سے ، انھوں نے اسود سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ حَدَّثَنَا سُفْيَانُ وَشُعْبَةُ قَالَا حَدَّثَنَا مَنْصُورٌ وَسُلَيْمَانُ وَحَمَّادٌ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 12738,
                "hadithNumber": "5175",
                "englishNarrator": "Thumama bin Hazn Al-Qushairi reported:",
                "hadithEnglish": "I met 'A'isha رضی اللہ عنہا and asked her (about the utensils in which) Nabidh (may be prepared). She narrated to me that a group of 'Abdul-Qais came to Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and asked: Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about Nabidh. He (the Holy Prophet) forbade them to prepare Nabidh in varnished jar, hollow stumps and gourd and green pitcher.",
                "hadithUrdu": "میں نے حضرت عائشہ رضی اللہ عنہا کی خدمت میں حاضری دی تو میں نے ان سے نبیذ کے متعلق سوال کیا ، انھوں نے مجھے حدیث سنائی کہ ( بنو ) عبدالقیس کا وفد نبی کریم صلی اللہ علیہ وسلم کے پاس آیا اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے نبیذ کے متعلق سوال کیا ، آپ صلی اللہ علیہ وسلم نے ان کو کدوکے ( بنے ہوئے ) برتن ، کھوکھلی لکڑی کے برتنوں ، روغن زفت ملے ہوئے برتنوں اور سبز گھڑوں میں نبیذ بنانے سے منع فرمایا ۔",
                "urduNarrator": "ہم سے شیبان بن فروخ نے بیان کیا، کہا ہم سے القاسم یعنی ابن الفضل نے بیان کیا, ثمامہ بن حزن قشیری نے حدیث بیان کی ، کہا",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا الْقَاسِمُ يَعْنِي ابْنَ الْفَضْلِ حَدَّثَنَا ثُمَامَةُ بْنُ حَزْنٍ الْقُشَيْرِيُّ قَالَ لَقِيتُ عَائِشَةَ فَسَأَلْتُهَا عَنْ النَّبِيذِ فَحَدَّثَتْنِي أَنَّ وَفْدَ عَبْدِ الْقَيْسِ قَدِمُوا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلُوا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النَّبِيذِ فَنَهَاهُمْ أَنْ يَنْتَبِذُوا فِي الدُّبَّاءِ وَالنَّقِيرِ وَالْمُزَفَّتِ وَالْحَنْتَمِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "37",
                "bookSlug": "sahih-muslim",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 137,
                    "chapterNumber": "37",
                    "chapterEnglish": "The Book of Drink",
                    "chapterUrdu": "مشروبات کا بیان",
                    "chapterArabic": "كتاب الْأَشْرِبَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 12426,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=497",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=495",
                "label": "495",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=496",
                "label": "496",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=497",
                "label": "497",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=498",
                "label": "498",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=499",
                "label": "499",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=500",
                "label": "500",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=501",
                "label": "501",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=499",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=499",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=497",
        "to": 12450,
        "total": 40465
    }
}