{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 585,
        "data": [
            {
                "id": 14889,
                "hadithNumber": "7328",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Zuhri.",
                "hadithUrdu": "مجھ سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا, یونس اور معمر دونوں نے زہری سے سفیان کی سند کے ساتھ اسی کی حدیث کے ہم معنی روایت کی ۔",
                "urduNarrator": null,
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ و حَدَّثَنِي ابْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ عَنْ عَبْدِ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كِلَاهُمَا عَنْ الزُّهْرِيِّ بِإِسْنَادِ سُفْيَانَ وَمَعْنَى حَدِيثِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14890,
                "hadithNumber": "7329",
                "englishNarrator": "Hammam bin Munabbih said: This is what Abu Huraira رضی اللہ عنہ reported from Allah's messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and in this connection he reported so many hadith (and one of them was this):",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Kisra would die and then there would be no Kisra after him. Qaisar would die and there would be no Qaisar after him, but you will distribute their treasures in the cause of Allah.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \" کسریٰ ہلاک ہوگیا ، پھر اس کے بعد کسری نہیں ہوگا ، اورقیصر بھی ہلاک ہوجائے گا پھر اس کے بعد کوئی قیصر نہیں ہوگااور ان دونوں کے خزانے اللہ کی راہ میں تقسیم کیے جائیں گے ۔ \"",
                "urduNarrator": "ہم سے محمد بن رافع نے بیان کیا، ہم سے عبدالرزاق نے بیان کیا, معمر نے ہمیں ہمام بن منبہ سے حدیث بیان کی ، کہا : یہ احادیث ہیں جو حضرت ابوہریرۃ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کیں ، ان میں سے ( یہ حدیث بھی ) ہے : اور",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلَكَ كِسْرَى ثُمَّ لَا يَكُونُ كِسْرَى بَعْدَهُ وَقَيْصَرُ لَيَهْلِكَنَّ ثُمَّ لَا يَكُونُ قَيْصَرُ بَعْدَهُ وَلَتُقْسَمَنَّ كُنُوزُهُمَا فِي سَبِيلِ اللَّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14891,
                "hadithNumber": "7330",
                "englishNarrator": "Jabir bin Samura رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: When Kisra would die there would be no Kisra after him; the rest of the hadith is the same as Abu Huraira رضی اللہ عنہ reported.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب کسری ہلاک ہوجائے گا تو اس کے بعد کوئی کسری نہیں ہوگا ۔ \" ( آگے ) انھوں نے حضرت ابو ہریرۃ رضی اللہ عنہ کی حدیث کی مانند ذکر کیا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے جریر نے عبدالملک بن عمیر کی سند سے بیان کیا, حضرت جابر بن سمرہ رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا هَلَكَ كِسْرَى فَلَا كِسْرَى بَعْدَهُ فَذَكَرَ بِمِثْلِ حَدِيثِ أَبِي هُرَيْرَةَ سَوَاءً.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14892,
                "hadithNumber": "7331",
                "englishNarrator": "Jabir bin Samura رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: There would lie open for a group of Muslims, or for a group of believers, the treasures of the family of Kisra which would be in the white (palace). In a version of Qutaiba there is definitely the word Muslim .",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \"\" مسلمانوں یا ( فرمایا : ) مومنوں کی ایک جماعت آل کسری کے خزانے کو ، جو سفید ( عمارت ) میں ہے ضرور بالضرور فتح کرے گی ۔ \"\" قتیبہ نے \"\" مسلمانوں کی \"\" ( جماعت ) کہا اور کسی شک کا اظہار نہیں کیا ۔",
                "urduNarrator": "قتیبہ بن سعید اور ابو کامل جحدری نے کہا : ہمیں ابو عوانہ نے سماک بن حرب سے حدیث بیان کی ، انھوں نے حضرت جابر بن سمرہ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو كَامِلٍ الْجَحْدَرِيُّ قَالَا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَتَفْتَحَنَّ عِصَابَةٌ مِنْ الْمُسْلِمِينَ أَوْ مِنْ الْمُؤْمِنِينَ كَنْزَ آلِ كِسْرَى الَّذِي فِي الْأَبْيَضِ قَالَ قُتَيْبَةُ مِنْ الْمُسْلِمِينَ وَلَمْ يَشُكَّ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14893,
                "hadithNumber": "7332",
                "englishNarrator": null,
                "hadithEnglish": "Jabir bin Samura رضی اللہ عنہ reported: I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) a hadith like this.",
                "hadithUrdu": "ہم سے محمد بن المثنیٰ اور ابن بشار نے بیان کیا: ہم سے محمد بن جعفر نے بیان کیا,شعبہ نے سماک بن حرب سے روایت کی ، انھوں نے کہا : میں نے حضرت جابر بن سمرہ رضی اللہ عنہ سے سنا ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، ( آگے ) ابو عوانہ کی حدیث کے ہم معنی حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ قَالَ سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ أَبِي عَوَانَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14894,
                "hadithNumber": "7333",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Apostle (ﷺ) saying: You have heard about a city, one side of which is on land and the other is in the sea (Constantinople). They said: Allah's Messenger, yes. Thereupon he said: The Last Hour would not come unless seventy thousand persons from Bani lshaq would attack it. When they would land there, they will neither fight with weapons nor would shower arrows but would only say: There is no god but Allah and Allah is the Greatest, and one side of it would fall. Thaur (one of the narrators) said: I think that he said: The part by the side of the ocean. Then they would say for the second time: There is no god but Allah and Allah is the Greatest and the second side would also fall, and they would say: There is no god but Allah and Allah is the Greatest, and the gates would be opened for them and they would enter therein and, they would be collecting spoils of war and distributing them amongst themselves when a noise would be heard saying: Verily, Dajjal has come. And thus they would leave everything there and go back.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \"\" تم نے ایسے شہر کے بارے میں سنا ہے جس کی ایک جانب خشکی میں ہے اور دوسری جانب سمندر میں ہے؟ \"\" انھوں ( صحابہ رضوان اللہ عنھم اجمعین ) نے عرض کی ، جی ہاں ، اللہ کے رسول صلی اللہ علیہ وسلم !آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" قیامت قائم نہیں ہوگی یہاں تک کہ اس کے خلاف بنو اسحاق میں سے ستر ہزار لوگ جہاد کریں گے ، وہاں پہنچ کر وہ اتریں گے تو ہتھیار اس سے جنگ کریں گے نہ تیر اندازی کریں گے ، وہ کہیں گے ، لاالٰہ الا اللہ واللہ اکبر ، تو اس ( شہر ) کی ایک جانب گرجائےگی ۔ \"\" ثور نے کہا : میں ہی جانتا ہوں کہ انھوں ( ابوہریرۃ رضی اللہ تعالیٰ عنہ نے وہی ( کنارہ ) کیا ( آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" جو سمندر میں ہے ، پھر وہ دوسری بار لاالٰہ الا اللہ واللہ اکبر کہیں گے تو اس ( شہر ) کا دوسرا کنارابھی گرجائے گا ، پھر وہ تیسری بار لاالٰہ الا اللہ واللہ اکبر کہیں گے تو ان کے لیے راستہ کھل جائے گا اور وہ اس ( شہر ) میں داخل ہوجائیں گے اور غنائم حاصل کریں گے ۔ جب وہ مال غنیمت تقسیم کررہے ہوں گے تو ایک چیختی ہوئی آواز آئے گی جو کہےگی : دجال نمودار ہوگیا ۔ چنانچہ وہ ( مسلمان ) ہر چیز چھوڑدیں گے اور واپس پلٹ پڑیں گے ۔ \"\"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا, عبدالعزیز بن محمد نے ثور بن زید دیلی سے ، انھوں نے ابو الغیث سے اور انھوں نے حضرت ابوہریرۃ رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ ثَوْرٍ وَهُوَ ابْنُ زَيْدٍ الدِّيلِيُّ عَنْ أَبِي الْغَيْثِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَمِعْتُمْ بِمَدِينَةٍ جَانِبٌ مِنْهَا فِي الْبَرِّ وَجَانِبٌ مِنْهَا فِي الْبَحْرِ قَالُوا نَعَمْ يَا رَسُولَ اللَّهِ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يَغْزُوَهَا سَبْعُونَ أَلْفًا مِنْ بَنِي إِسْحَقَ فَإِذَا جَاءُوهَا نَزَلُوا فَلَمْ يُقَاتِلُوا بِسِلَاحٍ وَلَمْ يَرْمُوا بِسَهْمٍ قَالُوا لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ فَيَسْقُطُ أَحَدُ جَانِبَيْهَا قَالَ ثَوْرٌ لَا أَعْلَمُهُ إِلَّا قَالَ الَّذِي فِي الْبَحْرِ ثُمَّ يَقُولُوا الثَّانِيَةَ لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ فَيَسْقُطُ جَانِبُهَا الْآخَرُ ثُمَّ يَقُولُوا الثَّالِثَةَ لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ فَيُفَرَّجُ لَهُمْ فَيَدْخُلُوهَا فَيَغْنَمُوا فَبَيْنَمَا هُمْ يَقْتَسِمُونَ الْمَغَانِمَ إِذْ جَاءَهُمْ الصَّرِيخُ فَقَالَ إِنَّ الدَّجَّالَ قَدْ خَرَجَ فَيَتْرُكُونَ كُلَّ شَيْءٍ وَيَرْجِعُونَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14895,
                "hadithNumber": "7334",
                "englishNarrator": null,
                "hadithEnglish": "Thaur bin Zaid has narrated this hadith with the same chain of transmitters.",
                "hadithUrdu": "مجھ سے محمد بن مرزوق نے بیان کیا، ہم سے بشر بن عمر الزہرانی نے بیان کیا, سلیمان بن بلال نے کہا : ہمیں ثور بن زید دیلی نے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ مَرْزُوقٍ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ الزَّهْرَانِيُّ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلَالٍ حَدَّثَنَا ثَوْرُ بْنُ زَيْدٍ الدِّيلِيُّ فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14896,
                "hadithNumber": "7335",
                "englishNarrator": "Ibn 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: You will fight against the Jews and you will kill them until even a stone would say: Come here, Muslim, there is a Jew (hiding himself behind me); kill him.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" یہود تم سے جنگ کریں گے اور تم انھیں اچھی طرح قتل کروگے یہاں تک کہ پتھر کہے گا : اے مسلمان! یہ یہودی ہے ، آگے بڑھ ، اس کو قتل کر ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا, محمد بن بشیر نے کہا : ہمیں عبیداللہ نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَتُقَاتِلُنَّ الْيَهُودَ فَلَتَقْتُلُنَّهُمْ حَتَّى يَقُولَ الْحَجَرُ يَا مُسْلِمُ هَذَا يَهُودِيٌّ فَتَعَالَ فَاقْتُلْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14897,
                "hadithNumber": "7336",
                "englishNarrator": "Ubaidullah has reported this hadith with this chain of transmitters (and the Words are):",
                "hadithEnglish": "There is a Jew behind me.",
                "hadithUrdu": "\" یہ یہودی میرے پیچھے ہے ۔ \"",
                "urduNarrator": "ہم سے محمد بن مثنیٰ اور عبید اللہ بن سعید نے بیان کیا, یحییٰ نے ہمیں عبیداللہ سے اسی سند کے ساتھ ر وایت کی اور اپنی حدیث میں کہا",
                "hadithArabic": "و حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ بِهَذَا الْإِسْنَادِ وَقَالَ فِي حَدِيثِهِ هَذَا يَهُودِيٌّ وَرَائِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14898,
                "hadithNumber": "7337",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: You and the Jews would fight against one another until a stone would say: Muslim, here is a Jew behind me; come and kill him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم اور یہود آپس میں جنگ کروگے ، یہاں تک کہ پتھر کہے گا : \" اے مسلمان! یہ میرے پیچھے ایک یہودی ہے ، آگے بڑھ ، اسے قتل کردے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، ہم سے ابو اسامہ نے بیان کیا, عمر بن حمزہ نے کہا : میں نے سالم کو کہتے ہوئے سنا : ہمیں حضرت عبداللہ بن عمر رضی اللہ عنہ نے بتایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ أَخْبَرَنِي عُمَرُ بْنُ حَمْزَةَ قَالَ سَمِعْتُ سَالِمًا يَقُولُ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَقْتَتِلُونَ أَنْتُمْ وَيَهُودُ حَتَّى يَقُولَ الْحَجَرُ يَا مُسْلِمُ هَذَا يَهُودِيٌّ وَرَائِي تَعَالَ فَاقْتُلْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14899,
                "hadithNumber": "7338",
                "englishNarrator": "Abdullah bin 'Umar رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم) ‌  said: The Jews will fight against you and you will gain victory over them until the stone would say: Muslim, here is a Jew behind me; kill him.",
                "hadithUrdu": "ر سول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" یہودی تم سے جنگ کریں گے ( آخرکار ) تمھیں ان پر تسلط عطا کردیا جائے گا ، یہاں تک کہ پتھر ( بھی ) کہے گا : اے مسلمان! یہ یہودی میرے پیچھے ہے ، اس کو قتل کردو ۔ \"",
                "urduNarrator": "ہم سے حرملہ بن یحییٰ نے بیان کیا، کہا ہم سے ابن وہب نے بیان کیا، کہا کہ مجھ سے یونس نے بیان کیا, ابن شہاب نے کہا : مجھے سالم بن عبداللہ نے حدیث بیان کی کہ حضرت عبداللہ بن عمر رضی اللہ عنہ نے انھیں خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُقَاتِلُكُمْ الْيَهُودُ فَتُسَلَّطُونَ عَلَيْهِمْ حَتَّى يَقُولَ الْحَجَرُ يَا مُسْلِمُ هَذَا يَهُودِيٌّ وَرَائِي فَاقْتُلْهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14900,
                "hadithNumber": "7339",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: The last hour would not come unless the Muslims will fight against the Jews and the Muslims would kill them until the Jews would hide themselves behind a stone or a tree and a stone or a tree would say: Muslim, or the servant of Allah, there is a Jew behind me; come and kill him; but the tree Gharqad would not say, for it is the tree of the Jews.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت قائم نہیں ہوگی ، یہاں تک کہ مسلمان یہودیوں کے خلاف جنگ لڑیں گے اور مسلمان ان کو قتل کریں گے حتیٰ کہ یہودی درخت یا پتھر کے پیچھے پیچھے کا اور پتھر یا درخت کہے گا : اے مسلمان!اے اللہ کے بندے!میرے پیچھے یہ ایک یہودی ہےآگے بڑھ ، اس کوقتل کردے ، سوائے غرقد کے درخت کے ( وہ نہیں کہے گا ) کیونکہ وہ یہود کا درخت ہے ۔ \"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے یعقوب نے، یعنی ابن عبدالرحمٰن نے، ہم سے سہیل کے واسطہ سے اپنے والد سے بیان کیا, حضرت ابو ہریرۃ رضی اللہ عنہ سے روایت ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يُقَاتِلَ الْمُسْلِمُونَ الْيَهُودَ فَيَقْتُلُهُمْ الْمُسْلِمُونَ حَتَّى يَخْتَبِئَ الْيَهُودِيُّ مِنْ وَرَاءِ الْحَجَرِ وَالشَّجَرِ فَيَقُولُ الْحَجَرُ أَوْ الشَّجَرُ يَا مُسْلِمُ يَا عَبْدَ اللَّهِ هَذَا يَهُودِيٌّ خَلْفِي فَتَعَالَ فَاقْتُلْهُ إِلَّا الْغَرْقَدَ فَإِنَّهُ مِنْ شَجَرِ الْيَهُودِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14901,
                "hadithNumber": "7340",
                "englishNarrator": "Jabir bin Samura رضی اللہ عنہ reported:",
                "hadithEnglish": "I heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: Before the Last Hour there would be many liars, and there is an addition in the hadith transmitted on the authority of Abu Ahwas of these words: I said to him: Did you hear it from Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ )? He said: Yes.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \"\" قیامت سے پہلے کئی کذاب ہوں گے ۔ ابو الاحوص کی حدیث میں انھوں ( ابوبکر بن ابی شیبہ ) نے مزید کہا کہ میں نے ان سے پوچھا : کیا آپ نے یہ ( بات ) رسول اللہ صلی اللہ علیہ وسلم سے سنی؟انھوں نے کہا : ہاں ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ اور ابوبکر بن ابی شیبہ نے بیان کیا۔ ہم سے یحییٰ نے بیان کیا اور ابوبکر نے کہا, ابو الاحوص اور ابو عوانہ نے سماک سے اور انھوں نے ح ضرت جابر بن سمرۃ رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ أَبُو بَكْرٍ حَدَّثَنَا أَبُو الْأَحْوَصِ و حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ كِلَاهُمَا عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ بَيْنَ يَدَيْ السَّاعَةِ كَذَّابِينَ وَزَادَ فِي حَدِيثِ أَبِي الْأَحْوَصِ قَالَ فَقُلْتُ لَهُ آنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14902,
                "hadithNumber": "7341",
                "englishNarrator": "This hadith has been narrated on the authority of Simak with the same chain of transmitters. and Simak said:",
                "hadithEnglish": "I heard my brother say that jabir رضی اللہ عنہ had stated: Be on your guard against them.",
                "hadithUrdu": "میں نے اپنے بھائی کوکہتے ہوئے سنا کہ حضرت جابر رضی اللہ عنہ نے کہا : ان ( جھوٹوں ) سے بچ کررہو ۔",
                "urduNarrator": "اور ابن مثنیٰ اور ابن بشار نے مجھے حدیث بیان کی ، دونوں نے کہا : ہمیں محمد بن جعفر نے حدیث بیان کی ، کہا : ہمیں شعبہ نے سماک سے اسی سند کےساتھ اسی کے مانند روایت کی ۔ سماک نے کہا",
                "hadithArabic": "و حَدَّثَنِي ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ قَالَ سِمَاكٌ وَسَمِعْتُ أَخِي يَقُولُ قَالَ جَابِرٌ فَاحْذَرُوهُمْ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14903,
                "hadithNumber": "7342",
                "englishNarrator": "Abu Huraira رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) as saying: The Last Hour would not come until there would arise about thirty impostors, liars, and each one of them would claim that he is a messenger of Allah.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت قائم نہیں ہوگی ، یہاں تک کہ دجالوں اور کذابوں کو بھیجا جائے گا جو تیس کے قریب ہوں گے ۔ ان میں سے ہر ایک دعویٰ کرتا ہوگا کہ وہ اللہ کا رسول ہے ۔ \"",
                "urduNarrator": "مجھ سے زہیر بن حرب اور اسحاق بن منصور نے بیان کیا ,اسحاق نے بتایا ,  زہیر نے کہا, ہمیں عبدالرحمٰن نے بیان کیا، اور وہ ابن مہدی ہیں، مالک کی سند سے، ابو الزناد نے,اعرج نے حضر ت ابو ہریرہ رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ وَإِسْحَقُ بْنُ مَنْصُورٍ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ زُهَيْرٌ حَدَّثَنَا عَبْدُ الرَّحْمَنِ وَهُوَ ابْنُ مَهْدِيٍّ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يُبْعَثَ دَجَّالُونَ كَذَّابُونَ قَرِيبٌ مِنْ ثَلَاثِينَ كُلُّهُمْ يَزْعُمُ أَنَّهُ رَسُولُ اللَّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14904,
                "hadithNumber": "7343",
                "englishNarrator": null,
                "hadithEnglish": "This hadith has been transmitted on the authority of Abu Huraira رضی اللہ عنہ with a slight variation of wording.",
                "hadithUrdu": "ہم سے محمد بن رافع نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، ہم سے معمر نے بیان کیا, ہمام بن منبہ نے حضر ت ابوہریرۃ رضی اللہ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ، مگر انھوں نے کہا : یہا ں تک کہ وہ ( شیطان کی طرف سے ) مبعوث بن کر آئیں گے ۔",
                "urduNarrator": null,
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ يَنْبَعِثَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14905,
                "hadithNumber": "7344",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "We were along with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) that we happened to pass by children amongst whom there was Ibn Sayyad. The children made their way but Ibn Sayyad kept sitting there (and it seemed) as if Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) did not like it (his sitting with the children) and said to him: May your nose he besmeared with dust, don't you bear testimony to the fact that I am the Messenger of Allah? Thereupon he said: No, but you should bear testimony that I am the messenger of Allah. Thereupon 'Umar bin Khattab رضی اللہ عنہ said: Allah's Messenger, permit me that I should kill him. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: If he is that person who is in your mind (Dajjal ), you will not be able to kill him.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے کہ ہم چند لڑکوں کے پاس سے گزرے ، ان میں ابن صیاد بھی تھا ، سب بچے بھاگ گئے اور ابن صیاد بیٹھ گیا ، تو ایسا لگا کہ رسول اللہ صلی اللہ علیہ وسلم نے اس بات کو ناپسند کیا ہے ، نبی کریم صلی اللہ علیہ وسلم نے اس سے فرمایا : \" تیرے ہاتھ خاک آلودہوں!کیا تو گواہی دیتا ہے کہ میں اللہ کا رسول ہوں؟ \" اس نے کہا : نہیں ۔ بلکہ کیا آپ گواہی دیتے ہیں کہ میں اللہ کا رسول ہوں؟ \" حضرت عمر بن خطاب رضی اللہ عنہ نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم !مجھے اجازت دیجئے کہ میں اس کو قتل کردوں ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر یہ وہی ہے جو تمہارا گمان ہے تو تم اس کو قتل نہیں کرسکوگے ۔ \"",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور اسحاق بن ابراہیم نے بیان کیا اور لفظ عثمان کا ہے, ہم سے اسحاق نے بیان کیا، اور عثمان نے کہا, جریر نےاعمش سے ، انھوں نے ابو وائل سے اور انھوں نے حضرت عبداللہ ( ابن مسعود رضی اللہ عنہ ) سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِعُثْمَانَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَرَرْنَا بِصِبْيَانٍ فِيهِمْ ابْنُ صَيَّادٍ فَفَرَّ الصِّبْيَانُ وَجَلَسَ ابْنُ صَيَّادٍ فَكَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَرِهَ ذَلِكَ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَرِبَتْ يَدَاكَ أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ فَقَالَ لَا بَلْ تَشْهَدُ أَنِّي رَسُولُ اللَّهِ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ ذَرْنِي يَا رَسُولَ اللَّهِ حَتَّى أَقْتُلَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ يَكُنْ الَّذِي تَرَى فَلَنْ تَسْتَطِيعَ قَتْلَهُ.",
                "headingArabic": "ذِكْرِ ابْنِ صَيَّادٍ",
                "headingUrdu": "ابن صیاد کے بارے میں",
                "headingEnglish": "About Ibn Sayyad",
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14906,
                "hadithNumber": "7345",
                "englishNarrator": "Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "We were walking with Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) that Ibn Sayyad happened to pass by him. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: I have concealed for you (something to test you, so tell me that). He said: It is Dukh. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said to him: Be off. You cannot get farther than your rank, whereupon 'Umar رضی اللہ عنہ said: Allah's Messenger, permit me to strike his neck. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Leave him; if he is that one (Dajjal) whom you apprehend, you will not be able to kill him.",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ چل رہے تھے کہ ہم ابن صیاد کے پاس سے گزرے ، رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا : \" میں تمہارے لیے ( دل میں ) ایک بات چھپائی ہے ۔ \" وہ دُخَ ہے ۔ آ پ صلی اللہ علیہ وسلم نےفرمایا : \" دور دفع ہوجا!تو اپنی حیثیت سے کبھی نہیں بڑھ سکےگا ۔ \" حضرت عمر رضی اللہ عنہ نےکہا : اللہ کے رسول صلی اللہ علیہ وسلم !مجھے اجازت دیں تو میں اس کی گردن مار دوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اسے چھوڑ دو ، اگر یہ وہی ہے جس کا تمھیں خوف ہے تو تم اس کو قتل نہیں کرسکوگے ۔ \"",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر، اسحاق بن ابراہیم اور ابو کریب نے بیان کیا اور یہ الفاظ ابو کریب سے ہیں۔ ابن نمیر نے کہا: اس نے ہم سے بیان کیا، اور باقی دو نے کہا: ابو معاویہ نے ہمیں خبر دی ، کہا : ہمیں اعمش نے شقیق سے حدیث بیان کی ۔ انھوں نے حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِأَبِي كُرَيْبٍ قَالَ ابْنُ نُمَيْرٍ حَدَّثَنَا و قَالَ الْآخَرَانِ أَخْبَرَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ قَالَ كُنَّا نَمْشِي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَرَّ بِابْنِ صَيَّادٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ خَبَأْتُ لَكَ خَبِيئًا فَقَالَ دُخٌّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اخْسَأْ فَلَنْ تَعْدُوَ قَدْرَكَ فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ دَعْنِي فَأَضْرِبَ عُنُقَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعْهُ فَإِنْ يَكُنْ الَّذِي تَخَافُ لَنْ تَسْتَطِيعَ قَتْلَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14907,
                "hadithNumber": "7346",
                "englishNarrator": "Abu Sa'id رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) met him (Ibn Sayyad) and so did Abu Bakr  رضی اللہ عنہ and 'Umar رضی اللہ عنہ on some of the roads of Medina. Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Do you bear testimony to the fact that I am the Messenger of Allah? Thereupon he said: Do you bear testimony to the fact that I am the messenger of Allah? Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: I affirm my faith in Allah and in His Angels and in His Books, and what do you see? He said: I see the throne over water. Whereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: You see the throne of Iblis upon the water, and what else do you see? He said: I see two truthfuls and a liar or two liars and one truthful. Thereupon Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) said: Leave him He has been confounded.",
                "hadithUrdu": "مدینہ کے ایک راستے میں رسول اللہ صلی اللہ علیہ وسلم حضرت ابو بکر رضی اللہ عنہ اور حضرت عمر رضی اللہ عنہ کی اس ( ابن صیاد ) سے ملاقات ہوئی ، رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا : \" کیا تو یہ گواہی دیتا ہے کہ میں اللہ کا رسول ہوں؟ \" اس نے کہا : کیا آپ گواہی دیتے ہیں کہ میں اللہ کا رسول ہوں؟رسول اللہ صلی اللہ علیہ وسلم نے فر مایا؛ \" میں اللہ پر ، اس کےفرشتوں پر اور اس کی کتابوں پر ایمان لایا ہوں ، تجھے کیا نظر آتا ہے؟ \" اس نے کہا : مجھے پانی پر ایک تخت نظر آتا ہے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم سمندر پر ابلیس کا تخت دیکھ رہے ہو ، تجھے اور کیا نظر آتا ہے؟ \" اس نے کہا : میں دو سچوں اور ایک جھوٹے کویا دو جھوٹوں اور ایک سچے کو د یکھتا ہوں ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ( اس کا معاملہ خود ) اس کے سامنے گڈ مڈ کردیاگیا ہے ۔ اسے چھوڑ د و ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا، ہم سے سالم بن نوح نے بیان کیا, حریری نے ابو نضرہ سے اور انھوں نے حضرت ابو سعید رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا سَالِمُ بْنُ نُوحٍ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَ لَقِيَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ وَعُمَرُ فِي بَعْضِ طُرُقِ الْمَدِينَةِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ فَقَالَ هُوَ أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آمَنْتُ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ مَا تَرَى قَالَ أَرَى عَرْشًا عَلَى الْمَاءِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَرَى عَرْشَ إِبْلِيسَ عَلَى الْبَحْرِ وَمَا تَرَى قَالَ أَرَى صَادِقَيْنِ وَكَاذِبًا أَوْ كَاذِبَيْنِ وَصَادِقًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لُبِسَ عَلَيْهِ دَعُوهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14908,
                "hadithNumber": "7347",
                "englishNarrator": "Jabir bin 'Abdullah رضی اللہ عنہ reported:",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) met Ibn Sa'id (Sayyad) and there were with him Abu Bakr رضی اللہ عنہ and 'Umar رضی اللہ عنہ and Ibn Sayyad was in the company of children. The rest of the hadith is the same.",
                "hadithUrdu": "اللہ کے نبی کریم صلی اللہ علیہ وسلم کی ابن صائد سے ملاقات ہوئی اورآپ صلی اللہ علیہ وسلم کے ساتھ ابو بکر رضی اللہ عنہ اور حضرت عمر رضی اللہ عنہ تھے اور ابن صائد ( دوسرے ) لڑکوں کے ساتھ تھا ، پھر جریری کی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "یہ یحییٰ بن حبیب یا محمد بن عبد الاعلی کا قول ہے, معتمر کے والد ( سلیمان ) نے کہا : ہمیں ابو نضرہ نے حضر ت جابر بن عبداللہ رضی اللہ عنہ سے حدیث بیان کی ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَا حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ أَبِي قَالَ حَدَّثَنَا أَبُو نَضْرَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ لَقِيَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْنَ صَائِدٍ وَمَعَهُ أَبُو بَكْرٍ وَعُمَرُ وَابْنُ صَائِدٍ مَعَ الْغِلْمَانِ فَذَكَرَ نَحْوَ حَدِيثِ الْجُرَيْرِيِّ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14909,
                "hadithNumber": "7348",
                "englishNarrator": "Abu Sa'id رضی اللہ عنہ reported:",
                "hadithEnglish": "I accompanied Ibn Sayyad to Mecca and he said to me: What I have gathered from people is that they think that I am Dajjal. Have you not heard Allah's Messenger (may peace upon him) as saying: He will have no children, I said: Yes, of course. Thereupon he said: But I have children. Have you not heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying: He would not enter Mecca and Medina? I said: Yes, of course. Thereupon he said I have been once in Medina and now I intend to go to Mecca. And he said to me at the end of his talk: By Allah, I know his place of birth his abode where he is just now. He (Abu Sa'id) said: This caused confusion in my mind (in regard to his identity).",
                "hadithUrdu": "مکہ کی طرف جاتے ہوئے ( راستے میں ) میرا اور ابن صیاد کاساتھ ہوگیا ۔ اس نے مجھ سے کہا : میں کچھ ایسے لوگوں سے ملا ہوں جو سمجھتے ہیں کہ میں دجال ہوں ، کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے نہیں سناتھا : \" اس کے بچے نہیں ہوں گے \" ؟کہا : میں نے کہا : کیوں نہیں ! ( سناتھا ۔ ) اس نے کہا : میرے بچے ہوئے ہیں ۔ کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے ہوئے نہیں سنا تھا : \" وہ ( دجال ) مدینہ میں داخل ہوگا اور نہ مکہ میں \" ؟میں نے کہا : کیوں نہیں!اس نے کہا : میں مدینہ کے اندر پیدا ہوا ۔ اور اب مکہ کی طرف جارہا ہوں ۔ انھوں نے کہا : پھر اپنی بات کے آخر میں اس نے مجھ سے کہا : دیکھیں !اللہ کی قسم!میں اس ( دجال ) کی جائے پیدائش ، اس کے رہنے کی جگہ اور وہ کہاں ہے سب جانتا ہوں ۔ ( اس طرح ) اس نے ( اپنی حیثیت کے بارے میں ) مجھے الجھا دیا ۔",
                "urduNarrator": "مجھ سے عبید اللہ بن عمر القواری اور محمد بن المثنی نے بیان کیا: ہم سے عبد الاعلٰی نے بیان کیا, داود نے ابو نضرہ سے اور انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا دَاوُدُ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ صَحِبْتُ ابْنَ صَائِدٍ إِلَى مَكَّةَ فَقَالَ لِي أَمَا قَدْ لَقِيتُ مِنْ النَّاسِ يَزْعُمُونَ أَنِّي الدَّجَّالُ أَلَسْتَ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّهُ لَا يُولَدُ لَهُ قَالَ قُلْتُ بَلَى قَالَ فَقَدْ وُلِدَ لِي أَوَلَيْسَ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَدْخُلُ الْمَدِينَةَ وَلَا مَكَّةَ قُلْتُ بَلَى قَالَ فَقَدْ وُلِدْتُ بِالْمَدِينَةِ وَهَذَا أَنَا أُرِيدُ مَكَّةَ قَالَ ثُمَّ قَالَ لِي فِي آخِرِ قَوْلِهِ أَمَا وَاللَّهِ إِنِّي لَأَعْلَمُ مَوْلِدَهُ وَمَكَانَهُ وَأَيْنَ هُوَ قَالَ فَلَبَسَنِي.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14910,
                "hadithNumber": "7349",
                "englishNarrator": "Abu Sa'id Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "Ibn Sa'id said to me something for which I felt ashamed. He said: I can excuse others; but what has gone wrong with you, O Companions of Muhammad, that you take me as Dajjal? Has Allah's Apostle ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) not said that he would be a Jew whereas I am a Muslim and he also said that he would not have children, whereas I have children, and he also said: verily, Allah has prohibited him to enter Mecca whereas I have performed Pilgrimage, and he went on saying this that I was about to be impressed by his talk. He (however) said this also: I know where he (Dajjal) is and I know his father and mother, and it was said to him: Won't you feel pleased if you would be the same person? Thereupon he said: If this offer is made to me, I would not resent that.",
                "hadithUrdu": "مجھ سے ابن صائد نے ایک بات کہی تو مجھے اس کے سامنے شرمندگی محسوس ہوئی ۔ ( اس نے کہا : ) اس بات پر میں اور لوگوں کو معذور سمجھتا ہوں ، مکر اے اصحاب محمد! آپ لوگوں کا میرے ساتھ کیامعاملہ ہے ؟ \"\" کیا اللہ کے نبی کریم صلی اللہ علیہ وسلم نے یہ نہیں فرمایا تھا : \"\" دجال یہودی ہوگا ۔ \"\" اور میں مسلمان ہوچکا ہوں ۔ کہا : \"\" وہ لاولد ہوگا ۔ \"\" جبکہ میری اولاد ہوئی ہے اورآپ صلی اللہ علیہ وسلم نے فرمایا تھا : \"\" اللہ نے مکہ ( میں داخلہ ) اس پر حرام کردیا ہے ۔ \"\" اور میں حج کرچکا ہوں ۔ ( حضرت ابو سعید رضی اللہ تعالیٰ عنہ نے ) کہا : وہ ( ابن صائد ) مسلسل ایسی باتیں کرتا رہا جن سے امکان تھا کہ اس کی بات میرے دل میں بیٹھ جاتی ، کہا : پھر وہ کہنے لگا : اللہ کی قسم! اس وقت میں یہ بات جانتا ہوں کہ وہ کہاں ہے میں اس کے ماں باپ کو بھی جانتا ہوں ۔ کہااس سے پوچھا گیا کہ کیا تمھیں یہ بات ا چھی لگےگی کہ تمھی وہ ( دجال ) آدمی ہو؟اس نے کہا ، اگر مجھ کو اس کی پیش کش کی جائے تو میں اسے ناپسند نہیں کروں گا ۔",
                "urduNarrator": "ہمیں یحییٰ بن حبیب اور محمد بن عبد الاعلٰی نے بیان کیا, معتمر کے والد ( سلیمان ) ابونضرہ سے اور وہ حضرت ابو سعید خدری رضی اللہ عنہ سے حدیث بیان کرتے ہیں ، کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَا حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ لِي ابْنُ صَائِدٍ وَأَخَذَتْنِي مِنْهُ ذَمَامَةٌ هَذَا عَذَرْتُ النَّاسَ مَا لِي وَلَكُمْ يَا أَصْحَابَ مُحَمَّدٍ أَلَمْ يَقُلْ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ يَهُودِيٌّ وَقَدْ أَسْلَمْتُ قَالَ وَلَا يُولَدُ لَهُ وَقَدْ وُلِدَ لِي وَقَالَ إِنَّ اللَّهَ قَدْ حَرَّمَ عَلَيْهِ مَكَّةَ وَقَدْ حَجَجْتُ قَالَ فَمَا زَالَ حَتَّى كَادَ أَنْ يَأْخُذَ فِيَّ قَوْلُهُ قَالَ فَقَالَ لَهُ أَمَا وَاللَّهِ إِنِّي لَأَعْلَمُ الْآنَ حَيْثُ هُوَ وَأَعْرِفُ أَبَاهُ وَأُمَّهُ قَالَ وَقِيلَ لَهُ أَيَسُرُّكَ أَنَّكَ ذَاكَ الرَّجُلُ قَالَ فَقَالَ لَوْ عُرِضَ عَلَيَّ مَا كَرِهْتُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14911,
                "hadithNumber": "7350",
                "englishNarrator": "Abu Sa`id al-Khudri رضی اللہ عنہ reported:",
                "hadithEnglish": "We came back after having performed Pilgrimage or `Umra and lbn Sa'id was along with us. And we encamped at a place and the people dispersed and I and he were left behind. I felt terribly frightend from him as it was said about him that he was the Dajjal. He brought his goods and placed them by my luggage and I said: It is intense heat. Would you not place that under that tree? And he did that. Then there appeared before us a flock of sheep. He went and brought a cup of milk and said: Abu Sa`id رضی اللہ عنہ , drink that. I said it is intense heat and the milk is also hot (whereas the fact was) that I did not like to drink from his hands or to take it from his hand and he said: Abu Sa`id رضی اللہ عنہ , I think that I should take a rope and suspend it by the tree and then commit suicide because of the talks of the people, and he further said. Abu Sa`id رضی اللہ عنہ he who is ignorant of the saying of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) (he is to be pardoned), but O people of Ansar, is this hadith of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) concealed from you whereas you have the best knowledge of the hadith of Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) amongst people? Did Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) not say that he (Dajjal) would be a non believer whereas I am a believer? Did Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) not say he would be barren and no child would be born to him, whereas I have left my children in Medina? Did Allah's Messenger (ﷺ) not say: He would not get into Medina and Mecca whereas I have been coming from Medina and now I intend to go to Mecca? Abu Sa`id رضی اللہ عنہ said: I was about to accept the excuse put forward by him. Then he said: I know the place where he would be born and where he is now. So I said to him: May your whole day be spent.",
                "hadithUrdu": "ہم حج یا عمرہ کو نکلے اور ہمارے ساتھ ابن صائد بھی تھا ۔ ایک منزل میں ہم اترے ، لوگ ادھر ادھر چلے گئے اور میں اور ابن صائد دونوں رہ گئے ۔ مجھے اس وجہ سے اس سے سخت وحشت ہوئی کہ لوگ اس کے بارے میں جو کہا کرتے تھے ( کہ دجال ہے ) ابن صائد اپنا اسباب لے کر آیا اور میرے اسباب کے ساتھ رکھ دیا ( مجھے اور زیادہ وحشت ہوئی ) میں نے کہا کہ گرمی بہت ہے اگر تو اپنا اسباب اس درخت کے نیچے رکھے تو بہتر ہے ۔ اس نے ایسا ہی کیا ۔ پھر ہمیں بکریاں دکھلائی دیں ۔ ابن صائد گیا اور دودھ لے کر آیا اور کہنے لگا کہ ابوسعید! دودھ پی ۔ میں نے کہا کہ گرمی بہت ہے اور دودھ گرم ہے اور دودھ نہ پینے کی اس کے سوا کوئی وجہ نہ تھی کہ مجھے اس کے ہاتھ سے پینا برا معلوم ہوا ۔ ابن صائد نے کہا کہ اے ابوسعید! میں نے قصد کیا ہے کہ ایک رسی لوں اور درخت میں لٹکا کر اپنے آپ کو پھانسی دے لوں ان باتوں کی وجہ سے جو لوگ میرے حق میں کہتے ہیں ۔ اے ابوسعید! رسول اللہ صلی اللہ علیہ وسلم کی حدیث اتنی کس سے پوشیدہ ہے جتنی تم انصار کے لوگوں سے پوشیدہ ہے ۔ کیا تم سب لوگوں سے زیادہ رسول اللہ صلی اللہ علیہ وسلم کی حدیث کو نہیں جانتے؟ کیا آپ صلی اللہ علیہ وسلم نے نہیں فرمایا کہ دجال کافر ہو گا اور میں تو مسلمان ہوں ۔ آپ صلی اللہ علیہ وسلم نے یہ نہیں فرمایا کہ دجال لاولد ہو گا اور میری اولاد مدینہ میں موجود ہے ۔ کیا آپ صلی اللہ علیہ وسلم نے یہ نہیں فرمایا کہ دجال مدینہ میں اور مکہ میں نہ جائے گا اور میں مدینہ سے آ رہا ہوں اور مکہ کو جا رہا ہوں؟ سیدنا ابوسعید رضی اللہ عنہ نے کہا کہ ( اس کی ایسی باتوں کی وجہ سے ) قریب تھا کہ میں اس کا طرفدار بن جاؤں ( اور لوگوں کا اس کے بارے میں کہنا غلط سمجھوں ) کہ پھر کہنے لگا البتہ اللہ کی قسم! میں دجال کو پہچانتا ہوں اور اس کے پیدائش کا مقام جانتا ہوں اور یہ بھی جانتا ہوں کہ اب وہ کہاں ہے ۔ کہا : میں نے اس سے کہا : باقی سارا دن تیرے لئے تباہی اور ہلاکت ہو! ( تیرا اس سے اتنا قرب کیسے ہوا؟ )",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے سالم بن نوح نے بیان کیا, جریری نے ابو نضرہ سے اور انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے روایت کی ، کہا : کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا سَالِمُ بْنُ نُوحٍ أَخْبَرَنِي الْجُرَيْرِيُّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ خَرَجْنَا حُجَّاجًا أَوْ عُمَّارًا وَمَعَنَا ابْنُ صَائِدٍ قَالَ فَنَزَلْنَا مَنْزِلًا فَتَفَرَّقَ النَّاسُ وَبَقِيتُ أَنَا وَهُوَ فَاسْتَوْحَشْتُ مِنْهُ وَحْشَةً شَدِيدَةً مِمَّا يُقَالُ عَلَيْهِ قَالَ وَجَاءَ بِمَتَاعِهِ فَوَضَعَهُ مَعَ مَتَاعِي فَقُلْتُ إِنَّ الْحَرَّ شَدِيدٌ فَلَوْ وَضَعْتَهُ تَحْتَ تِلْكَ الشَّجَرَةِ قَالَ فَفَعَلَ قَالَ فَرُفِعَتْ لَنَا غَنَمٌ فَانْطَلَقَ فَجَاءَ بِعُسٍّ فَقَالَ اشْرَبْ أَبَا سَعِيدٍ فَقُلْتُ إِنَّ الْحَرَّ شَدِيدٌ وَاللَّبَنُ حَارٌّ مَا بِي إِلَّا أَنِّي أَكْرَهُ أَنْ أَشْرَبَ عَنْ يَدِهِ أَوْ قَالَ آخُذَ عَنْ يَدِهِ فَقَالَ أَبَا سَعِيدٍ لَقَدْ هَمَمْتُ أَنْ آخُذَ حَبْلًا فَأُعَلِّقَهُ بِشَجَرَةٍ ثُمَّ أَخْتَنِقَ مِمَّا يَقُولُ لِي النَّاسُ يَا أَبَا سَعِيدٍ مَنْ خَفِيَ عَلَيْهِ حَدِيثُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا خَفِيَ عَلَيْكُمْ مَعْشَرَ الْأَنْصَارِ أَلَسْتَ مِنْ أَعْلَمِ النَّاسِ بِحَدِيثِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَيْسَ قَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ كَافِرٌ وَأَنَا مُسْلِمٌ أَوَلَيْسَ قَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ عَقِيمٌ لَا يُولَدُ لَهُ وَقَدْ تَرَكْتُ وَلَدِي بِالْمَدِينَةِ أَوَلَيْسَ قَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدْخُلُ الْمَدِينَةَ وَلَا مَكَّةَ وَقَدْ أَقْبَلْتُ مِنْ الْمَدِينَةِ وَأَنَا أُرِيدُ مَكَّةَ قَالَ أَبُو سَعِيدٍ الْخُدْرِيُّ حَتَّى كِدْتُ أَنْ أَعْذِرَهُ ثُمَّ قَالَ أَمَا وَاللَّهِ إِنِّي لَأَعْرِفُهُ وَأَعْرِفُ مَوْلِدَهُ وَأَيْنَ هُوَ الْآنَ قَالَ قُلْتُ لَهُ تَبًّا لَكَ سَائِرَ الْيَوْمِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14912,
                "hadithNumber": "7351",
                "englishNarrator": "This hadith has transmitted on the authority of Abu Sa'id رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) asked Ibn Sa'id about the earth of Paradise. Thereupon he said: Abu'l-Qasim, It is like a fine white musk, whereupon he (the Holy Prophet) said: 'You have told the the truth.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ابن صائد سے فرمایا : \" جنت کی مٹی کیسی ہے؟ \" اس نے کہا : اے ابو القاسم ( صلی اللہ علیہ وسلم ) !باریک سفید ، کستوری ( جیسی ) ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" تو نے سچ کہا ۔ \"",
                "urduNarrator": "ہم سے نصر بن علی الجہضمی نے بیان کیا: بشر یعنی ابن مفضل نے بیان کیا, ابومسلمہ نے ابو نضر ہ سے اور انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے روایت کی ، کہا",
                "hadithArabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ مُفَضَّلٍ عَنْ أَبِي مَسْلَمَةَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِابْنِ صَائِدٍ مَا تُرْبَةُ الْجَنَّةِ قَالَ دَرْمَكَةٌ بَيْضَاءُ مِسْكٌ يَا أَبَا الْقَاسِمِ قَالَ صَدَقْتَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            },
            {
                "id": 14913,
                "hadithNumber": "7352",
                "englishNarrator": "Abu Sa'id رضی اللہ عنہ reported:",
                "hadithEnglish": "Ibn Sayyad asked Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) about the earth of Paradise. Whereupon he said: It is like white shining pure musk.",
                "hadithUrdu": "ابن صیاد نے نبی کریم صلی اللہ علیہ وسلم سے جنت کی مٹی کے متعلق سوال کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" باریک سفید ، خالص کستوری ( کی طرح ) ہے ۔ \"",
                "urduNarrator": "ہم سے ابوبکر بن ابی شیبہ نے بیان کیا، کہا ہم سے ابو اسامہ نے بیان کیا, جریری نے ابو نضرہ سے اور انھوں نے حضرت ابو سعید رضی اللہ عنہ سے روایت کی کہ",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ أَنَّ ابْنَ صَيَّادٍ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ تُرْبَةِ الْجَنَّةِ فَقَالَ دَرْمَكَةٌ بَيْضَاءُ مِسْكٌ خَالِصٌ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "53",
                "bookSlug": "sahih-muslim",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 2,
                    "bookName": "Sahih Muslim",
                    "writerName": "Imam Muslim",
                    "aboutWriter": null,
                    "writerDeath": "261 ھ",
                    "bookSlug": "sahih-muslim"
                },
                "chapter": {
                    "id": 153,
                    "chapterNumber": "53",
                    "chapterEnglish": "The Book of Tribulations and Portents of the Last Hour",
                    "chapterUrdu": "فتنے اور علامات قیامت",
                    "chapterArabic": "كتاب الْفِتَنِ وَأَشْرَاطِ السَّاعَةِ",
                    "bookSlug": "sahih-muslim"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 14601,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=584",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=582",
                "label": "582",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=583",
                "label": "583",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=584",
                "label": "584",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=585",
                "label": "585",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=586",
                "label": "586",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=587",
                "label": "587",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=588",
                "label": "588",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=586",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=586",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=584",
        "to": 14625,
        "total": 40465
    }
}