{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 207,
        "data": [
            {
                "id": 5153,
                "hadithNumber": "5388",
                "englishNarrator": "Narrated Wahb bin Kaisan:",
                "hadithEnglish": "The People of Sham taunted `Abdullah bin Az-Zubair رضی اللہ عنہما by calling him \"The son of Dhatin-Nataqain\" (the woman who has two waist-belts). (His mother) (Asma رضی اللہ عنہا , said to him, \"O my son! They taunt you with \"Nataqain\". Do you know what the Nataqain were? That was my waist-belt which I divided in two parts. I tied the water skin of Allah's Messenger (ﷺ) with one part, and with the other part I tied his food container.\" (So the prophet ﷺ styled me with it) The reporter says that henceforth when the Syrian taunted Hadrat Abdullah about the two drawstrings, he would say: By Allah! They are true but what they taunt me about me about is a matter of pride for me.",
                "hadithUrdu": "اہل شام ( حجاج بن یوسف کے فوجی ) شام کے لوگ حضرت عبداللہ بن زبیر رضی اللہ عنہما کو عار دلانے کے لیے کہنے لگے ” یا ابن ذات النطاقین “ ( اے دو کمربند والی کے بیٹے اور ان کی والدہ ) حضرت اسماء رضی اللہ عنہا نے کہا ، اے بیٹے ! یہ تمہیں دو کمربند والی کی عار دلاتے ہیں ، تمہیں معلوم ہے وہ کمربند کیا تھے ؟ وہ میرا کمربند تھا جس کے میں نے دو ٹکڑے کر دیئے تھے اور ایک ٹکڑے سے نبی کریم صلی اللہ علیہ وسلم کے بر تن کا منہ باندھا تھا اور دوسرے سے دسترخوان بنایا ( اس میں توشہ لپیٹا ) وہب نے بیان کیا کہ پھر جب حضرت عبداللہ بن زبیر رضی اللہ عنہما کو اہل شام دو کمربند والی کی عار دلاتے تھے ، تو وہ کہتے ہاں ۔ اللہ کی قسم ! یہ بیشک سچ ہے اور وہ یہ مصرعہ پڑھتے تلک شکاۃ ظاھر منک عارھا یہ تو ویسا طعنہ ہے جس میں کچھ عیب نہیں ہے ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو ابومعاویہ نے خبر دی ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد نے اور وہب بن کیسان نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، وَعَنْ وَهْبِ بْنِ كَيْسَانَ، قَالَ كَانَ أَهْلُ الشَّأْمِ يُعَيِّرُونَ ابْنَ الزُّبَيْرِ يَقُولُونَ يَا ابْنَ ذَاتِ النِّطَاقَيْنِ‏.‏ فَقَالَتْ لَهُ أَسْمَاءُ يَا بُنَىَّ إِنَّهُمْ يُعَيِّرُونَكَ بِالنِّطَاقَيْنِ، هَلْ تَدْرِي مَا كَانَ النِّطَاقَانِ إِنَّمَا كَانَ نِطَاقِي شَقَقْتُهُ نِصْفَيْنِ، فَأَوْكَيْتُ قِرْبَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِأَحَدِهِمَا، وَجَعَلْتُ فِي سُفْرَتِهِ آخَرَ، قَالَ فَكَانَ أَهْلُ الشَّأْمِ إِذَا عَيَّرُوهُ بِالنِّطَاقَيْنِ يَقُولُ إِيهًا وَالإِلَهْ‏.‏ تِلْكَ شَكَاةٌ ظَاهِرٌ عَنْكَ عَارُهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5154,
                "hadithNumber": "5389",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "His aunt, Um Hufaid bint Al-Harith bin Hazn رضی اللہ عنہا , presented to the Prophet (ﷺ) butter, dried yoghurt and mastigures. The Prophet (ﷺ) invited the people to those mastigures and they were eaten on his dining sheet, but the Prophet (ﷺ) did not eat of it, as if he disliked it. Nevertheless. if it was unlawful to eat that, the people would not have eaten it on the dining sheet of the Prophet (ﷺ) nor would he have ordered that they be eaten.",
                "hadithUrdu": "ابن عباس رضی اللہ عنہما کی خالہ ام حفید بنت حارث بن حزن رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم کو گھی ، پنیر اور ساہنہ ہدیہ کے طور پر بھیجی ۔ آنحضرت صلی اللہ علیہ وسلم نے عورتوں کو بلایا اور انہوں نے آپ کے دسترخوان پر ساہنہ کو کھایا لیکن آپ نے اسے ہاتھ بھی نہیں لگایا جیسے آپ اسے ناپسند کرتے ہیں لیکن اگر ساہنہ حرام ہوتا تو آپ کے دسترخوان پر کھایا نہ جاتا اور نہ آپ انہیں کھانے کے لیے فرماتے ۔",
                "urduNarrator": "ہم سے ابو نعمان نے بیان کیا ، انہوں نے کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے ابو بشر نے ، ان سے سعید بن جبیر نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ أُمَّ حُفَيْدٍ بِنْتَ الْحَارِثِ بْنِ حَزْن ٍ ـ خَالَةَ ابْنِ عَبَّاسٍ ـ أَهْدَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم سَمْنًا وَأَقِطًا وَأَضُبًّا، فَدَعَا بِهِنَّ فَأُكِلْنَ عَلَى مَائِدَتِهِ، وَتَرَكَهُنَّ النَّبِيُّ صلى الله عليه وسلم كَالْمُسْتَقْذِرِ لَهُنَّ، وَلَوْ كُنَّ حَرَامًا مَا أُكِلْنَ عَلَى مَائِدَةِ النَّبِيِّ صلى الله عليه وسلم وَلاَ أَمَرَ بِأَكْلِهِنَّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5155,
                "hadithNumber": "5390",
                "englishNarrator": "Narrated Suwaid bin An-Nu`man رضی اللہ عنہ :",
                "hadithEnglish": "While they were with the Prophet (ﷺ) at As-Sahba' which was at a distance of one day's journey from Khaibar the prayer became due, and the Prophet (ﷺ) asked the people for food but there was nothing with the people except Sawiq. He ate of it and we ate along with him, and then he asked for water and rinsed his mouth (with it), and then offered the (Maghrib) prayer and we too offered the prayer but the Prophet did not perform ablution (again after eating the Sawiq.).",
                "hadithUrdu": "وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ مقام صہبا میں تھے ۔ وہ خیبر سے ایک منزل پر ہے ۔ نماز کا وقت قریب تھا تو آنحضرت صلی اللہ علیہ وسلم نے کھانا طلب فرمایا لیکن ستو کے سوا اور کوئی چیز نہیں لائی گئی ۔ آخر آنحضرت صلی اللہ علیہ وسلم نے اس کو پھانک لیا اور ہم نے بھی پھانکا پھر آپ نے پانی طلب فرمایا اور کلی کی ۔ اس کے بعد آپ نے نماز پڑھائی اور ہم نے بھی آپ کے ساتھ نماز پڑھی اور آپ نے ( اس نماز کے لیے نیا ) وضو نہیں کیا ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد نے بیان کیا ، ان سے یحییٰ بن سعید انصاری نے ، ان سے بشیر بن یسار نے ، انہیں سوید بن نعمان رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ يَحْيَى، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سُوَيْدِ بْنِ النُّعْمَانِ، أَنَّهُ أَخْبَرَهُ أَنَّهُمْ، كَانُوا مَعَ النَّبِيِّ صلى الله عليه وسلم بِالصَّهْبَاءِ ـ وَهْىَ عَلَى رَوْحَةٍ مِنْ خَيْبَرَ ـ فَحَضَرَتِ الصَّلاَةُ، فَدَعَا بِطَعَامٍ فَلَمْ يَجِدْهُ إِلاَّ سَوِيقًا، فَلاَكَ مِنْهُ فَلُكْنَا مَعَهُ، ثُمَّ دَعَا بِمَاءٍ فَمَضْمَضَ، ثُمَّ صَلَّى وَصَلَّيْنَا، وَلَمْ يَتَوَضَّأْ‏.‏",
                "headingArabic": "السَّوِيقِ",
                "headingUrdu": "السویق",
                "headingEnglish": "As-Sawiq",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5156,
                "hadithNumber": "5391",
                "englishNarrator": "Narrated Khalid bin Al-Walid رضی اللہ عنہ :",
                "hadithEnglish": "He went with Allah's Messenger (ﷺ) to the house of Maimuna رضی اللہ عنہا , who was his and Ibn `Abbas' رضی اللہ عنہما aunt. He found with her a roasted mastigure which her sister Hufaida bint Al-Harith  رضی اللہ عنہا had brought from Najd. Maimuna presented the mastigure before Allah's Messenger (ﷺ) who rarely started eating any (unfamiliar) food before it was described and named for him. (But that time) Allah's Messenger (ﷺ) stretched his hand towards the (meat of the) mastigure whereupon a lady from among those who were present, said, \"You should inform Allah's Messenger (ﷺ) of what you have presented to him. O Allah's Messenger (ﷺ)! It is the meat of a mastigure.\" (On learning that) Allah's Messenger (ﷺ) withdrew his hand from the meat of the mastigure. Khalid bin Al-Walid رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! Is this unlawful to eat?\" Allah's Messenger (ﷺ) replied, \"No, but it is not found in the land of my people, so I do not like it.\" Khalid رضی اللہ عنہ said, \"Then I pulled the mastigure (meat) towards me and ate it while Allah's Messenger (ﷺ) was looking at me.",
                "hadithUrdu": "وہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ام المؤمنین حضرت میمونہ رضی اللہ عنہا کے گھر میں داخل ہوئے ۔ ام المؤمنین ان کی اور ابن عباس رضی اللہ عنہما کی خالہ ہیں ۔ ان کے یہاں بھنا ہوا ساہنہ موجود تھا جو ان کی بہن حفید ہ بنت الحارث رضی اللہ عنہا نجد سے لائی تھیں ۔ انہوں نے وہ بھنا ہوا ساہنہ حضور اکرم صلی اللہ علیہ وسلم کی خدمت میں پیش کیا ۔ ایسا بہت کم ہوتا تھا حضور اکرم صلی اللہ علیہ وسلم کسی کھانے کے لیے اس وقت تک ہاتھ بڑھائیں جب تک آپ کو اس کے متعلق بتانہ دیا جائے کہ یہ فلاں کھانا ہے لیکن اس دن آپ نے بھنے ہوئے ساہنے کے گوشت کی طرف ہاتھ بڑھایا ۔ اتنے میں وہاں موجود عورتوں میں سے ایک عورت نے کہا کہ آنحضرت صلی اللہ علیہ وسلم کو بتا کیوں نہیں دیتیں کہ اس وقت آپ کے سامنے جو تم نے پیش کیا ہے وہ ساہنہ ہے ، یا رسول اللہ ! ( یہ سن کر ) آپ نے اپنا ہاتھ ساہنہ سے ہٹا لیا ۔ حضرت خالد بن ولید رضی اللہ عنہ بولے کہ یا رسول اللہ ! کیا ساہنہ حرام ہے ؟ آپ نے فرمایا کہ نہیں لیکن یہ میرے ملک میں چونکہ نہیں پایا جاتا ، اس لیے طبیعت پسند نہیں کرتی ۔ حضرت خالد رضی اللہ عنہ نے بیان کیا کہ پھر میں نے اسے اپنی طرف کھینچ لیا اور اسے کھایا ۔ اس وقت حضور اکرم صلی اللہ علیہ وسلم مجھے دیکھ رہے تھے ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل ابوالحسن نے بیان کیا ، کہا ہم کو عبداللہ بن یعلیٰ نے خبر دی ، کہا ہم کو یونس نے خبر دی ، ان سے زہری نے بیان کیا کہ مجھے ابوامامہ بن سہل بن حنیف انصاری نے خبر دی ، انہیں حضرت ابن عباس رضی اللہ عنہما نے خبر دی اور انہیں حضرت خالد بن ولید رضی اللہ عنہ نے جو سیف اللہ ( اللہ کی تلوار ) کے لقب سے مشہور ہیں ، خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ الأَنْصَارِيُّ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ خَالِدَ بْنَ الْوَلِيدِ الَّذِي يُقَالُ لَهُ سَيْفُ اللَّهِ أَخْبَرَهُ أَنَّهُ، دَخَلَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى مَيْمُونَةَ ـ وَهْىَ خَالَتُهُ وَخَالَةُ ابْنِ عَبَّاسٍ ـ فَوَجَدَ عِنْدَهَا ضَبًّا مَحْنُوذًا، قَدِمَتْ بِهِ أُخْتُهَا حُفَيْدَةُ بِنْتُ الْحَارِثِ مِنْ نَجْدٍ، فَقَدَّمَتِ الضَّبَّ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ قَلَّمَا يُقَدِّمُ يَدَهُ لِطَعَامٍ حَتَّى يُحَدَّثَ بِهِ وَيُسَمَّى لَهُ، فَأَهْوَى رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ إِلَى الضَّبِّ، فَقَالَتِ امْرَأَةٌ مِنَ النِّسْوَةِ الْحُضُورِ أَخْبِرْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا قَدَّمْتُنَّ لَهُ، هُوَ الضَّبُّ يَا رَسُولَ اللَّهِ‏.‏ فَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ عَنِ الضَّبِّ، فَقَالَ خَالِدُ بْنُ الْوَلِيدِ أَحَرَامٌ الضَّبُّ يَا رَسُولَ اللَّهِ قَالَ ‏ \"‏ لاَ وَلَكِنْ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ ‏\"‏‏.‏ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ إِلَىَّ‏.‏",
                "headingArabic": "مَا كَانَ النَّبِيُّ صلى الله عليه وسلم لاَ يَأْكُلُ حَتَّى يُسَمَّى لَهُ فَيَعْلَمُ مَا هُوَ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کبھی کوئی چیز نہیں کھاتے تھے جب تک کہ اس کا نام نہ رکھا جائے تاکہ آپ جان سکیں کہ وہ کیا ہے۔",
                "headingEnglish": "The Prophet (saws) never used to eat anything unless it was named for him so that he might know what it was",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5157,
                "hadithNumber": "5392",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The food for two persons is sufficient for three, and the food of three persons is sufficient for four persons.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا دو آدمیوں کا کھانا تین کے لیے کافی ہے اور تین کا چار کے لیے کافی ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، ( دوسری سند ) امام بخاری نے کہا کہ ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، وَحَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ طَعَامُ الاِثْنَيْنِ كَافِي الثَّلاَثَةِ، وَطَعَامُ الثَّلاَثَةِ كَافِي الأَرْبَعَةِ ‏\"‏‏.‏",
                "headingArabic": "طَعَامُ الْوَاحِدِ يَكْفِي الاِثْنَيْنِ‏",
                "headingUrdu": "ایک آدمی کا کھانا دو آدمیوں کے لیے کافی ہے۔",
                "headingEnglish": "The food of one person is sufficient for two persons.",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5158,
                "hadithNumber": "5393",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "Ibn `Umar رضی اللہ عنہما never used to take his meal unless a poor man was called to eat with him. One day I brought a poor man to eat with him, the man ate too much, whereupon Ibn `Umar رضی اللہ عنہما said, \"O Nafi`! Don't let this man enter my house, for I heard the Prophet (ﷺ) saying, \"A believer eats in one intestine (is satisfied with a little food), and a kafir (unbeliever) eats in seven intestines (eats much food).",
                "hadithUrdu": "ابن عمر رضی اللہ عنہما اس وقت تک کھانا نہیں کھاتے تھے ، جب تک ان کے ساتھ کھانے کے لیے کوئی مسکین نہ لایا جاتا ۔ ایک مرتبہ میں ان کے ساتھ کھانے کے لیے ایک شخص کو لایا کہ اس نے بہت زیادہ کھانا کھایا ۔ بعد میں حضرت ابن عمر رضی اللہ عنہما نے کہا کہ آئندہ اس شخص کو میرے ساتھ کھانے کے لیے نہ لانا ۔ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے کہ مومن ایک آنت میں کھاتا اور کافر دو آنتیں بھر لیتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، ہم سے سے عبدالصمد بن عبدالوارث نے بیان کیا ، کہا ہم سے شعبہ بن حجاج نے بیان کیا ، ان سے واقد بن محمد نے ، ان سے نافع نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنْ وَاقِدِ بْنِ مُحَمَّدٍ، عَنْ نَافِعٍ، قَالَ كَانَ ابْنُ عُمَرَ لاَ يَأْكُلُ حَتَّى يُؤْتَى بِمِسْكِينٍ يَأْكُلُ مَعَهُ، فَأَدْخَلْتُ رَجُلاً يَأْكُلُ مَعَهُ فَأَكَلَ كَثِيرًا فَقَالَ يَا نَافِعُ لاَ تُدْخِلْ هَذَا عَلَىَّ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْمُؤْمِنُ يَأْكُلُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏",
                "headingArabic": "الْمُؤْمِنُ يَأْكُلُ فِي مِعًى وَاحِدٍ‏",
                "headingUrdu": "مومن ایک آنت میں کھاتا ہے۔",
                "headingEnglish": "A believer eats in one intestine",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5159,
                "hadithNumber": "5394",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"A believer eats in one intestine (is satisfied with a little food), and a kafir (unbeliever) or a hypocrite eats in seven intestines (eats too much). Ibn Bakir, the reporter, says that he has not remembered which of the words Obaidullah uttered. Uttered Ibn-e-Bokair, Maalik, Nafi'o, Hadrat Ibn-e-Umer رضی اللہ عنہما has reported from the prophet ﷺ the same.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مومن ایک آنت میں کھاتا ہے اور کافر یا منافق ( عبدہ نے کہا کہ ) مجھے یقین نہیں کہ ان میں سے کس کے متعلق عبیداللہ نے بیان کیا کہ وہ ساتوں آنتیں بھر لیتا ہے اور ابن بکیر نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہما اور ان سے نبی کریم صلی اللہ علیہ وسلم نے اسی حدیث کی طرح بیان فرمایا ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو عبدہ بن سلیمان نے خبر دی ، انہیں عبیداللہ عمری نے خبر دی ، انہیں نافع نے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ الْمُؤْمِنَ يَأْكُلُ فِي مِعًى وَاحِدٍ، وَإِنَّ الْكَافِرَ ـ أَوِ الْمُنَافِقَ فَلاَ أَدْرِي أَيَّهُمَا قَالَ عُبَيْدُ اللَّهِ ـ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏ وَقَالَ ابْنُ بُكَيْرٍ حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5160,
                "hadithNumber": "5395",
                "englishNarrator": "Narrated `Amr:",
                "hadithEnglish": "Abu Nahik was avaricious eater. Ibn `Umar رضی اللہ عنہما said to him, \"Allah's Messenger (ﷺ) said, \"A Kafir (unbeliever) eats in seven intestines (eats much).\" On that Abu Nahik said, \"But I believe in Allah and His Apostle .\"",
                "hadithUrdu": "ابو نہیک بڑے کھانے والے تھے ۔ ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ کافر ساتوں آنتوں میں کھاتا ہے ۔ ابو نہیک نے اس پر عرض کیا کہ میں اللہ اور اس کے رسول پر ایمان رکھتا ہوں ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ كَانَ أَبُو نَهِيكٍ رَجُلاً أَكُولاً فَقَالَ لَهُ ابْنُ عُمَرَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الْكَافِرَ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏ فَقَالَ فَأَنَا أُومِنُ بِاللَّهِ وَرَسُولِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5161,
                "hadithNumber": "5396",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"A Muslim eats in one intestine (i.e. he is satisfied with a little food) while a Kafir (unbeliever) eats in seven intestines (eats much).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، مسلمان ایک آنت میں کھاتا ہے اور کافر ساتوں آنتوں میں کھا تا ہے ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابوالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَأْكُلُ الْمُسْلِمُ فِي مِعًى وَاحِدٍ، وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5162,
                "hadithNumber": "5397",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "A man used to eat much, but when he embraced Islam, he started eating less. That was mentioned to the Prophet (ﷺ) who then said, \"A believer eats in one intestine (is satisfied with a little food) and a Kafir eats in seven intestines (eats much). \"",
                "hadithUrdu": "ایک صاحب بہت زیادہ کھانا کھایا کرتے تھے ، پھر وہ اسلام لائے تو کم کھانے لگے ۔ اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا گیا تو آپ نے فرمایا کہ مومن ایک آنت میں کھاتا ہے اور کافر ساتوں آنتوں میں کھاتا ہے ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے عدی بن ثابت نے بیان کیا ، ان سے ابوحازم نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، كَانَ يَأْكُلُ أَكْلاً كَثِيرًا، فَأَسْلَمَ فَكَانَ يَأْكُلُ أَكْلاً قَلِيلاً، فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ إِنَّ الْمُؤْمِنَ يَأْكُلُ فِي مِعًى وَاحِدٍ، وَالْكَافِرَ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5163,
                "hadithNumber": "5398",
                "englishNarrator": "Narrated Abu Juhaifa رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"I do not take my meals while leaning (against something).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، میں ٹیک لگا کر نہیں کھاتا ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا ہم سے مسعر نے بیان کیا ، ان سے علی ابن الاقمر نے کہ میں نے ابوجحیفہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مِسْعَرٌ، عَنْ عَلِيِّ بْنِ الأَقْمَرِ، سَمِعْتُ أَبَا جُحَيْفَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ آكُلُ مُتَّكِئًا ‏\"‏‏.‏",
                "headingArabic": "الأَكْلِ مُتَّكِئًا‏",
                "headingUrdu": "ٹیک لگا کر کھانا",
                "headingEnglish": "To eat while leaning",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5164,
                "hadithNumber": "5399",
                "englishNarrator": "Narrated Abu Juhaifa رضی اللہ عنہ :",
                "hadithEnglish": "While I was with the Prophet (ﷺ) he said to a man who was with him, \"I do not take my meals while leaning.\"",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا ۔ آپ نے ایک صحابی سے جو آپ کے پاس موجود تھے فرمایا کہ میں ٹیک لگا کر نہیں کھاتا ۔",
                "urduNarrator": "مجھ سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم کو جریر نے خبر دی ، انہیں منصور نے ، انہیں علی ابن الاقمر نے اور ان سے ابو جحیفہ رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ عَلِيِّ بْنِ الأَقْمَرِ، عَنْ أَبِي جُحَيْفَةَ، قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ لِرَجُلٍ عِنْدَهُ ‏ \"‏ لاَ آكُلُ وَأَنَا مُتَّكِئٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5165,
                "hadithNumber": "5400",
                "englishNarrator": "Narrated Khalid bin Al-Walid رضی اللہ عنہ :",
                "hadithEnglish": "\"A roasted mastigure was brought to the Prophet (ﷺ) who stretched his hand towards it to eat it. But it was said to him, \"It is a mastigure.\" So he withdrew his hand. Khalid رضی اللہ عنہ asked, \"Is it unlawful to eat?\" the Prophet said, \"No, but it is not found in the land of my people and that is why I do not like eating it.\" So Khalid رضی اللہ عنہ started eating (it) while Allah's Messenger (ﷺ) was looking at him. Imam Malik has reported '' بِضَبٍّ مَحْنُوذٍ‏'' from Ibn-e-Shihab.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے لیے بھنا ہوا ساہنہ پیش کیا گیاتو آپ اسے کھانے کے لیے متوجہ ہوئے ۔ اسی وقت آپ کو بتایا گیا کہ یہ ساہنہ ہے تو آپ نے اپنا ہاتھ روک لیا ۔ حضرت خالد رضی اللہ عنہ نے پوچھا کیا یہ حرام ہے ؟ فرمایا کہ نہیں لیکن چونکہ یہ میرے ملک میں نہیں ہوتا اس لیے طبیعت اسے گوارا نہیں کرتی ۔ پھر خالد رضی اللہ عنہ نے اسے کھایا اور نبی کریم صلی اللہ علیہ وسلم دیکھ رہے تھے ۔ امام مالک نے ابن شہاب سے ” ضب محنوذ “ ( یعنی بھنا ہوا ساہنہ ضب مشوی کی جگہ محنوذ نقل کیا ، دونوں لفظوں کا ایک معنی ہے )",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے ہشام بن یوسف نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں ابوامامہ بن سہل نے اور انہیں ابن عباس رضی اللہ عنہما نے کہ خالد بن ولید رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ خَالِدِ بْنِ الْوَلِيدِ، قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِضَبٍّ مَشْوِيٍّ، فَأَهْوَى إِلَيْهِ لِيَأْكُلَ فَقِيلَ لَهُ إِنَّهُ ضَبٌّ، فَأَمْسَكَ يَدَهُ، فَقَالَ خَالِدٌ أَحَرَامٌ هُوَ قَالَ ‏ \"‏ لاَ، وَلَكِنَّهُ لاَ يَكُونُ بِأَرْضِ قَوْمِي، فَأَجِدُنِي أَعَافُهُ ‏\"‏‏.‏ فَأَكَلَ خَالِدٌ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ‏.‏ قَالَ مَالِكٌ عَنِ ابْنِ شِهَابٍ بِضَبٍّ مَحْنُوذٍ‏.‏",
                "headingArabic": "الشِّوَاءِ",
                "headingUrdu": "بھنا ہوا (گوشت)۔",
                "headingEnglish": "Roasted (meat).",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5166,
                "hadithNumber": "5401",
                "englishNarrator": "Narrated 'Utban bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "who attended the Badr battle and was from the Ansar, that he came to the Prophet (ﷺ) and said, \"O Allah's Apostle! I have lost my eyesight and I lead my people in the prayer (as an Imam). When it rains, the valley which is between me and my people, flows with water, and then I cannot go to their mosque to lead them in the prayer. O Allah's Messenger (ﷺ)! I wish that you could come and pray in my house so that I may take it as a praying place. The Prophet (ﷺ) said, \"Allah willing, I will do that.\" The next morning, soon after the sun had risen, Allah's Messenger (ﷺ) came with Abu Bakr رضی اللہ عنہ . The Prophet (ﷺ) asked for the permission to enter and I admitted him. The Prophet (ﷺ) had not sat till he had entered the house and said to me, \"Where do you like me to pray in your house?\" I pointed at a place in my house whereupon he stood and said, \"Allahu Akbar.\" We lined behind him and he prayed two rak`at and finished it with Taslim. We then requested him to stay for a special meal of Khazira which we had prepared. A large number of men from the adjoining area gathered in the house. One of them said, \"Where is Malik bin Ad-Dukhshun رضی اللہ عنہ ?\" Another man said, \"He is a hypocrite and does not love Allah and His Apostle.\" The Prophet said, \"Do not say so. Do you not think that he has said: \"None has the right to be worshipped but Allah,\" seeking Allah's pleasure? The man said, \"Allah and His Apostle know better, but we have always seen him mixing with hypocrites and giving them advice.\" The Prophet (ﷺ) said, \"Allah has forbidden the (Hell) Fire for those who testify that none has the right to be worshipped but Allah, seeking Allah's pleasure. \" Ibn-e-Shihab states: I, then, inquired of Husain bin Muhammad Ansari, a member of Banu Salim and their chief, about this Hadith and he also testified it.",
                "hadithUrdu": "قبیلہ انصار کے ان لوگوں میں سے تھے جنہوں نے بدر کی لڑائی میں شرکت کی تھی ۔ آپ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ یا رسول اللہ ! میری آنکھ کی بصارت کمزور ہے اور میں اپنی قوم کو نماز پڑھاتا ہوں ۔ برسات میں وادی جو میرے اور ان کے درمیان حائل ہے ۔ بہنے لگتی ہے اور میرے لیے ان کی مسجد میں جانا اور ان میں نماز پڑھنا ممکن نہیں رہتا ۔ اس لیے یا رسول اللہ ! میری یہ خواہش ہے کہ آپ میرے گھر تشریف لے چلیں اور میرے گھر میں آپ نماز پڑھیں تاکہ میں اسی جگہ کو نماز پڑھنے کی جگہ بنا لوں ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ انشاءاللہ میں جلدی ہی ایسا کروں گا ۔ حضرت عتبان رضی اللہ عنہ نے بیان کیا کہ پھر حضور اکرم صلی اللہ علیہ وسلم حضرت ابوبکر رضی اللہ عنہ کے ساتھ چاشت کے وقت جب سورج کچھ بلند ہو گیا تشریف لائے اور آنحضرت صلی اللہ علیہ وسلم نے اندر آنے کی اجازت چاہی ۔ میں نے آپ کو اجازت دے دی ۔ آپ بیٹھے نہیں بلکہ گھر میں داخل ہو گئے اور دریافت فرمایا کہ اپنے گھر میں کس جگہ تم پسند کرتے ہو کہ میں نماز پڑھوں ؟ میں نے گھر کے ایک کونے کی طرف اشارہ کیا ۔ آنحضرت صلی اللہ علیہ وسلم وہاں کھڑے ہو گئے اور ( نماز کے لیے ) تکبیر کہی ۔ ہم نے بھی ( آپ کے پیچھے ) صف بنا لی ۔ آنحضرت صلی اللہ علیہ وسلم کوخزیرہ ( حریرہ کی ایک قسم ) کے لیے جو آپ کے لیے ہم نے بنایا تھا روک لیا ۔ گھر میں قبیلہ کے بہت سے لوگ آآ کر جمع ہو گئے ۔ ان میں سے ایک صاحب نے کہا مالک بن دخشن رضی اللہ عنہ کہاں ہیں ؟ اس پر کسی نے کہا کہ وہ تو منافق ہے اللہ اور اس کے رسول سے اسے محبت نہیں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، یہ نہ کہو ، کیا تم نہیں دیکھتے کہ انہوں نے اقرار کیا ہے کہ لا الہٰ الا اللہ یعنی اللہ کے سوا اور کوئی معبود نہیں اور اس سے ان کا مقصد صرف اللہ کی خوشنودی حاصل کرنا ہے ۔ ان صحابی نے کہا کہ اللہ اور اس کے رسول ہی زیادہ جانتے ہیں ۔ راوی نے بیان کیا کہ ہم نے عرض کیا ( یا رسول اللہ ! ) لیکن ہم ان کی توجہ اور ان کا لگاؤ منافقین کے ساتھ ہی دیکھتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا لیکن اللہ نے دوزخ کی آگ کو اس شخص پر حرام کر دیا ہے جس نے کلمہ لا الہٰ الا اللہ کا اقرار کر لیا ہو اور اس سے اس کا مقصد اللہ کی خوشنودی ہو ۔ ابن شہاب نے بیان کیا کہ پھر میں نے حصین بن محمد انصاری سے جو بنی سالم کے ایک فرد اور ان کے سردار تھے ۔ محمود کی حدیث کے متعلق پوچھا تو انہوں نے اس کی تصدیق کی ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، ان سے امام لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے بیان کیا ، انہیں محمود بن ربیع انصاری نے خبر دی کہ عتبان بن مالک رضی اللہ عنہ جو نبی کریم صلی اللہ علیہ وسلم کے صحابہ میں سے تھے اور",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ الأَنْصَارِيُّ، أَنَّ عِتْبَانَ بْنَ مَالِكٍ ـ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِمَّنْ شَهِدَ بَدْرًا مِنَ الأَنْصَارِ ـ أَنَّهُ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَنْكَرْتُ بَصَرِي وَأَنَا أُصَلِّي لِقَوْمِي، فَإِذَا كَانَتِ الأَمْطَارُ سَالَ الْوَادِي الَّذِي بَيْنِي وَبَيْنَهُمْ، لَمْ أَسْتَطِعْ أَنْ آتِيَ مَسْجِدَهُمْ فَأُصَلِّيَ لَهُمْ، فَوَدِدْتُ يَا رَسُولَ اللَّهِ أَنَّكَ تَأْتِي فَتُصَلِّي فِي بَيْتِي، فَأَتَّخِذُهُ مُصَلًّى‏.‏ فَقَالَ ‏\"‏ سَأَفْعَلُ إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ قَالَ عِتْبَانُ فَغَدَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ حِينَ ارْتَفَعَ النَّهَارُ، فَاسْتَأْذَنَ النَّبِيُّ صلى الله عليه وسلم فَأَذِنْتُ لَهُ فَلَمْ يَجْلِسْ حَتَّى دَخَلَ الْبَيْتَ، ثُمَّ قَالَ لِي ‏\"‏ أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ مِنْ بَيْتِكَ ‏\"‏‏.‏ فَأَشَرْتُ إِلَى نَاحِيَةٍ مِنَ الْبَيْتِ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَكَبَّرَ، فَصَفَفْنَا، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ سَلَّمَ وَحَبَسْنَاهُ عَلَى خَزِيرٍ صَنَعْنَاهُ، فَثَابَ فِي الْبَيْتِ رِجَالٌ مِنْ أَهْلِ الدَّارِ ذَوُو عَدَدٍ فَاجْتَمَعُوا، فَقَالَ قَائِلٌ مِنْهُمْ أَيْنَ مَالِكُ بْنُ الدُّخْشُنِ فَقَالَ بَعْضُهُمْ ذَلِكَ مُنَافِقٌ لاَ يُحِبُّ اللَّهَ وَرَسُولَهُ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تَقُلْ، أَلاَ تَرَاهُ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يُرِيدُ بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ قَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ قُلْنَا فَإِنَّا نَرَى وَجْهَهُ وَنَصِيحَتَهُ إِلَى الْمُنَافِقِينَ‏.‏ فَقَالَ ‏\"‏ فَإِنَّ اللَّهَ حَرَّمَ عَلَى النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يَبْتَغِي بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ قَالَ ابْنُ شِهَابٍ ثُمَّ سَأَلْتُ الْحُصَيْنَ بْنَ مُحَمَّدٍ الأَنْصَارِيَّ أَحَدَ بَنِي سَالِمٍ وَكَانَ مِنْ سَرَاتِهِمْ عَنْ حَدِيثِ مَحْمُودٍ فَصَدَّقَهُ‏.‏",
                "headingArabic": "الْخَزِيرَةِ",
                "headingUrdu": "الخزیرہ (آٹے اور چربی کے ساتھ تیار کردہ ڈش)",
                "headingEnglish": "Al-Khazira (dish prepared with while flour and fat)",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5167,
                "hadithNumber": "5402",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "My aunt presented (roasted) mastigures, Iqt and milk to the Prophet (ﷺ) . The mastigures were put on his dining sheet, and if it was unlawful to eat, it would not have been put there. The Prophet (ﷺ) drank the milk and ate the Iqt only.",
                "hadithUrdu": "میری خالہ نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ساہنہ کا گوشت ، پنیر اور دودھ ہدیتاً پیش کیا تو ساہنہ کا گوشت آپ کے دسترخوان پررکھاگیا اوراگرساہنہ حرام ہوتا تو آپ کے دسترخوان پر نہیں رکھا جا سکتا تھا لیکن آپ نے دودھ پیااور پنیر کھایا ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کی ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے ابو بشر نے ، ان سے سعید نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَهْدَتْ خَالَتِي إِلَى النَّبِيِّ صلى الله عليه وسلم ضِبَابًا وَأَقِطًا وَلَبَنًا، فَوُضِعَ الضَّبُّ عَلَى مَائِدَتِهِ، فَلَوْ كَانَ حَرَامًا لَمْ يُوضَعْ وَشَرِبَ اللَّبَنَ، وَأَكَلَ الأَقِطَ‏.‏",
                "headingArabic": "الأَقِطِ",
                "headingUrdu": "العقیط (خشک دہی)",
                "headingEnglish": "Al-Aqit (dried yoghourt)",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5168,
                "hadithNumber": "5403",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "We used to be happy on Fridays, for there was an old lady who used to pull out the roots of Silq and put it in a cooking pot with some barley. When we had finished the prayer, we would visit her and she would present that dish before us. So we used to be happy on Fridays because of that, and we never used to take our meals or have a mid-day nap except after the Friday prayer. By Allah, that meal contained no fat.",
                "hadithUrdu": "ہمیں جمعہ کے دن بڑی خوشی رہتی تھی ۔ ہماری ایک بوڑھی خاتون تھیں وہ چقندر کی جڑ یں لے کر اپنی ہانڈی میں پکاتی تھیں ، اوپر سے کچھ دانے جو کے اس میں ڈال دیتی تھی ۔ ہم جمعہ کی نماز پڑھ کر ان کی ملاقات کو جاتے تو وہ ہمارے سامنے یہ کھانا رکھتی تھی ۔ جمعہ کے دن ہمیں بڑی خوشی اسی وجہ سے رہتی تھی ۔ ہم نماز جمعہ کے بعد ہی کھانا کھایا کرتے تھے ۔ اللہ کی قسم نہ اس میں چربی ہوتی تھی نہ گھی اور جب بھی ہم مزے سے اس کو کھاتے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے ابوحازم نے اور ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ إِنْ كُنَّا لَنَفْرَحُ بِيَوْمِ الْجُمُعَةِ، كَانَتْ لَنَا عَجُوزٌ تَأْخُذُ أُصُولَ السِّلْقِ، فَتَجْعَلُهُ فِي قِدْرٍ لَهَا، فَتَجْعَلُ فِيهِ حَبَّاتٍ مِنْ شَعِيرٍ، إِذَا صَلَّيْنَا زُرْنَاهَا فَقَرَّبَتْهُ إِلَيْنَا، وَكُنَّا نَفْرَحُ بِيَوْمِ الْجُمُعَةِ مِنْ أَجْلِ ذَلِكَ، وَمَا كُنَّا نَتَغَدَّى وَلاَ نَقِيلُ إِلاَّ بَعْدَ الْجُمُعَةِ، وَاللَّهِ مَا فِيهِ شَحْمٌ وَلاَ وَدَكٌ‏.‏",
                "headingArabic": "السِّلْقِ وَالشَّعِيرِ",
                "headingUrdu": "سلق (چقندر کی ایک قسم) اور جو",
                "headingEnglish": "As-Salq (a kind of beet) and barley",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5169,
                "hadithNumber": "5404",
                "englishNarrator": "Narrated Ibn 'Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) ate of the meat of a shoulder (by cutting the meat with his teeth), and then got up and offered the prayer without performing the ablution anew.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے شانے کی ہڈی کا گوشت کھایا ، پھر کھڑے ہوئے اور نماز پڑھی ۔ آپ نے ( نماز کے لیے نیا ) وضو نہیں کیا اور ( اسی سند سے )",
                "urduNarrator": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، کہا ہم سے ایوب سختیانی نے بیان کیا ، ان سے محمد بن سیرین نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ تَعَرَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم كَتِفًا، ثُمَّ قَامَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
                "headingArabic": "النَّهْسِ وَانْتِشَالِ اللَّحْمِ",
                "headingUrdu": "(کھاتے وقت) دانتوں سے گوشت پکڑنا اور پکڑنا۔",
                "headingEnglish": "To seize and catch flesh with the teeth (while eating).",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5170,
                "hadithNumber": "5405",
                "englishNarrator": "Narrated Ibn 'Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) took out a bone with meat on it from a cooking pot and ate of it, and then offered the prayer without performing ablution anew.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے پکتی ہوئی ہنڈیا میں سے ادھی  کچی بوٹی نکالی اور اسے کھایا پھر نماز پڑھائی اور نیا وضو نہیں کیا ۔",
                "urduNarrator": "ایوب اورعاصم سے روایت ہے ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "وَعَنْ أَيُّوبَ، وَعَاصِمٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ انْتَشَلَ النَّبِيُّ صلى الله عليه وسلم عَرْقًا مِنْ قِدْرٍ فَأَكَلَ، ثُمَّ صَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5171,
                "hadithNumber": "5406",
                "englishNarrator": "Narrated Abu Qatada:",
                "hadithEnglish": "We went out towards Mecca with the Prophet ﷺ.",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ مکہ کی طرف نکلے ( صلح حدیبیہ کے موقع پر ) دوسری سند ( حدیث دیکھیں 5407 )",
                "urduNarrator": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ مجھ سے عثمان ابن عمر نے بیان کیا ، ان سے فلیح بن سلیمان نے بیان کیا ، ان سے ابوحازم سلمہ بن دینار مدنی نے ، کہا ہم سے عبداللہ بن ابی قتادہ نے اور ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا فُلَيْحٌ، حَدَّثَنَا أَبُو حَازِمٍ الْمَدَنِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم نَحْوَ مَكَّةَ‏.‏",
                "headingArabic": "تَعَرُّقِ الْعَضُدِ",
                "headingUrdu": "پیشانی کا گوشت کھانا (اس کے گوشت کی ہڈی کو دانتوں سے اکھاڑ کر)۔",
                "headingEnglish": "To eat the flesh of a foreleg (by stripping the bone of its meat with the teeth).",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5172,
                "hadithNumber": "5407",
                "englishNarrator": "Narrated Abu Qatada Salami رضی اللہ عنہ :",
                "hadithEnglish": "Once, while I was sitting with the companions of the Prophet (ﷺ) at a station on the road to Mecca and Allah's Messenger (ﷺ) was stationing ahead of us and all the people were assuming Ihram while I was not. My companion, saw an onager while I was busy Mending my shoes. They did not Inform me of the onager but they wished that I would see it Suddenly I looked and saw the onager Then I headed towards my horse, saddled it and rode, but I forgot to take the lash and the spear. So I said to them my companions), \"Give me the lash and the spear.\" But they said, \"No, by Allah we will not help you in any way to hunt it ' I got angry, dismounted, took it the spear and the lash), rode (the horse chased the onager and wounded it Then I brought it when it had dyed. My companions started eating of its (cooked) meat, but they suspected that it might be unlawful to eat of its meat while they were in a state of Ihram Then I proceeded further and I kept one of its forelegs with me. When we met Allah's Apostle we asked him about that. He said, \"Have you some of its meat with you?\" I gave him that foreleg and he ate the meat till he stripped the bone of its flesh although he was in a state of Ihram. Ataa bin Yasar has also reported similarly from Hadrat Abu Qatadah رضی اللہ عنہ .",
                "hadithUrdu": "میں ایک دن نبی کریم صلی اللہ علیہ وسلم کے چندصحابہ کے ساتھ مکہ کے راستہ میں ایک منزل پر بیٹھا ہوا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے ہمارے آگے پڑاؤ کیا تھا ۔ صحابہ کرام رضی اللہ عنہم احرام کی حالت میں تھے لیکن میں احرام میں نہیں تھا ۔ لوگوں نے ایک گور خر کو دیکھا ۔ میں اس وقت اپنا جوتا ٹانکنے میں مصروف تھا ۔ ان لوگوں نے مجھے اس گور خر کے متعلق بتایا کچھ نہیں لیکن چاہتے تھے کہ میں کسی طرح دیکھ لوں ۔ چنانچہ میں متوجہ ہوا اور میں نے اسے دیکھ لیا ، پھر میں گھوڑے کے پاس گیا اور اسے زین پہنا کر اس پر سوار ہو گیا لیکن کوڑا اور نیزہ بھول گیا تھا ۔ میں نے ان لوگوں سے کہا کہ کوڑا اور نیزہ مجھے دے دو ۔ انہوں نے کہا کہ نہیں خدا کی قسم ہم تمہاری شکار کے معاملہ میں کوئی مدد نہیں کریں گے ۔ ( کیونکہ ہم محرم ہیں ) میں غصہ ہو گیا اور میں نے اترکر خود یہ دونوں چیزیں اٹھائیں پھر سوار ہو کر اس پر حملہ کیا اور ذبح کر لیا ۔ جب وہ ٹھنڈا ہو گیا تو میں اسے ساتھ لایا پھر پکا کر میں نے اور سب نے کھایا لیکن بعد میں انہیں شبہ ہوا کہ احرام کی حالت میں اس ( شکار کا گوشت ) کھانا کیسا ہے ؟ پھر ہم روانہ ہوئے اور میں نے اس کا گوشت چھپا کر رکھا ۔ جب آنحضرت صلی اللہ علیہ وسلم کے پاس آئے تو ہم نے آپ سے اس کے متعلق پوچھا ۔ آپ نے دریافت فرمایا ، تمہارے پاس کچھ بچا ہوا بھی ہے ؟ میں نے وہی دست پیش کیا اور آپ نے بھی اسے کھایا ۔ یہاں تک کہ اس کا گوشت آپ نے اپنے دانتوں سے کھینچ کھینچ کر کھایا اور آپ احرام میں تھے ۔ محمد بن جعفر نے بیان کیا کہ مجھ سے زید بن اسلم نے یہ واقعہ بیان کیا ، ان سے عطاء بن یسار نے اور ان سے حضرت ابوقتادہ رضی اللہ عنہ نے اسی طرح سارا واقعہ بیان کیا ۔",
                "urduNarrator": "اور مجھ سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، کہا ہم سے محمد بن جعفر نے بیان کیا ، ان سے ابوحازم نے بیان کیا ، ان سے عبداللہ بن ابی قتادہ اسلمی نے ، ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ أَبِي حَازِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ السَّلَمِيِّ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كُنْتُ يَوْمًا جَالِسًا مَعَ رِجَالٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فِي مَنْزِلٍ فِي طَرِيقِ مَكَّةَ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم نَازِلٌ أَمَامَنَا، وَالْقَوْمُ مُحْرِمُونَ وَأَنَا غَيْرُ مُحْرِمٍ، فَأَبْصَرُوا حِمَارًا وَحْشِيًّا وَأَنَا مَشْغُولٌ أَخْصِفُ نَعْلِي، فَلَمْ يُؤْذِنُونِي لَهُ، وَأَحَبُّوا لَوْ أَنِّي أَبْصَرْتُهُ، فَالْتَفَتُّ فَأَبْصَرْتُهُ فَقُمْتُ إِلَى الْفَرَسِ فَأَسْرَجْتُهُ‏.‏ ثُمَّ رَكِبْتُ وَنَسِيتُ السَّوْطَ وَالرُّمْحَ فَقُلْتُ لَهُمْ نَاوِلُونِي السَّوْطَ وَالرُّمْحَ‏.‏ فَقَالُوا لاَ وَاللَّهِ لاَ نُعِينُكَ عَلَيْهِ بِشَىْءٍ‏.‏ فَغَضِبْتُ فَنَزَلْتُ فَأَخَذْتُهُمَا، ثُمَّ رَكِبْتُ فَشَدَدْتُ عَلَى الْحِمَارِ فَعَقَرْتُهُ، ثُمَّ جِئْتُ بِهِ وَقَدْ مَاتَ فَوَقَعُوا فِيهِ يَأْكُلُونَهُ، ثُمَّ إِنَّهُمْ شَكُّوا فِي أَكْلِهِمْ إِيَّاهُ وَهُمْ حُرُمٌ، فَرُحْنَا وَخَبَأْتُ الْعَضُدَ مَعِي، فَأَدْرَكْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَأَلْنَاهُ عَنْ ذَلِكَ فَقَالَ ‏ \"‏ مَعَكُمْ مِنْهُ شَىْءٌ ‏\"‏‏.‏ فَنَاوَلْتُهُ الْعَضُدَ فَأَكَلَهَا حَتَّى تَعَرَّقَهَا، وَهْوَ مُحْرِمٌ‏.‏ قَالَ ابْنُ جَعْفَرٍ وَحَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي قَتَادَةَ مِثْلَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5173,
                "hadithNumber": "5408",
                "englishNarrator": "Narrated `Amr bin Umaiyya رضی اللہ عنہ :",
                "hadithEnglish": "He saw the Prophet (ﷺ) holding a shoulder piece of mutton in his hand and cutting part of it with a knife. Then he was called for the prayer whereupon he put down the shoulder piece and the knife with which he was cutting it, and then stood for prayer without performing ablution again.",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا آپ اپنے ہاتھ سے بکری کے شانے کا گوشت کاٹ کر کھا رہے تھے ، پھر آپ کو نماز کے لیے بلایا گیا تو آپ نے گوشت اور وہ چھری جس سے گوشت کی بوٹی کاٹ رہے تھے ، ڈال دی اور نماز کے لیے کھڑے ہو گئے ، پھر آپ نے نماز پڑھی اور آپ نے نیا وضو نہیں کیا ( کیونکہ آپ پہلے ہی وضو کئے ہوئے تھے )",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں جعفر بن عمرو بن امیہ ضمری نے خبر دی ، انہیں ان کے والد عمرو بن امیہ رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ، أَنَّ أَبَاهُ، عَمْرَو بْنَ أُمَيَّةَ أَخْبَرَهُ أَنَّهُ، رَأَى النَّبِيَّ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ فِي يَدِهِ، فَدُعِيَ إِلَى الصَّلاَةِ فَأَلْقَاهَا وَالسِّكِّينَ الَّتِي يَحْتَزُّ بِهَا، ثُمَّ قَامَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
                "headingArabic": "قَطْعِ اللَّحْمِ بِالسِّكِّينِ",
                "headingUrdu": "چاقو سے گوشت کاٹنا",
                "headingEnglish": "To cut the meat with a knife",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5174,
                "hadithNumber": "5409",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) never criticized any food (he was invited to) but he used to eat if he liked the food, and leave it if he disliked it.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے کبھی کسی کھانے میں کوئی عیب نہیں نکالا ۔ اگر پسند ہوا تو کھا لیا اور اگر ناپسند ہوا تو چھوڑ دیا ۔",
                "urduNarrator": "ہم سے محمد بن کثیرنے بیان کیا ، کہا ہم کو سفیان نے خبر دی ، انہیں اعمش نے ، انہیں ابوحازم نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مَا عَابَ النَّبِيُّ صلى الله عليه وسلم طَعَامًا قَطُّ، إِنِ اشْتَهَاهُ أَكَلَهُ، وَإِنْ كَرِهَهُ تَرَكَهُ‏.‏",
                "headingArabic": "مَا عَابَ النَّبِيُّ صلى الله عليه وسلم طَعَامًا",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کبھی کسی کھانے پر تنقید نہیں کی۔",
                "headingEnglish": "The Prophet (saws) never criticized any food.",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5175,
                "hadithNumber": "5410",
                "englishNarrator": "Narrated Sahl رضی اللہ عنہ :",
                "hadithEnglish": "\"Did you use white flour during the lifetime of the Prophet (ﷺ) ?\" Sahl replied, \"No. Hazim asked, \"Did you use to sift barley flour?\" He said, \"No, but we used to blow off the husk (of the barley).",
                "hadithUrdu": "تم نے نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں میدہ دیکھا تھا ؟ انہوں نے کہا کہ نہیں ۔ میں نے پوچھا کیا تم جو کے آٹے کو چھانتے تھے ؟ کہا نہیں ، بلکہ ہم اسے صرف پھونک لیا کرتے تھے ۔",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابو غسان ( محمد بن مطرف لیثی ) نے بیان کیا ، کہا کہ مجھ سے ابوحازم سلمہ بن دینار نے بیان کیا ، انہوں نے سہل بن سعد ساعدی رضی اللہ عنہ سے پوچھا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، أَنَّهُ سَأَلَ سَهْلاً هَلْ رَأَيْتُمْ فِي زَمَانِ النَّبِيِّ صلى الله عليه وسلم النَّقِيَّ قَالَ لاَ‏.‏ فَقُلْتُ فَهَلْ كُنْتُمْ تَنْخُلُونَ الشَّعِيرَ قَالَ لاَ وَلَكِنْ كُنَّا نَنْفُخُهُ‏.‏",
                "headingArabic": "النَّفْخِ فِي الشَّعِيرِ",
                "headingUrdu": "جَو اُڑانا (بھوسی نکالنے کے لیے)۔",
                "headingEnglish": "To blow barley (to remove the husk).",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5176,
                "hadithNumber": "5411",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Once the Prophet (ﷺ) distributed dates among his companions and gave each one seven dates. He gave me seven dates too, one of which was dry and hard, but none of the other dates was more liked by me than that one, for it prolonged my chewing it.",
                "hadithUrdu": "ایک دن نبی کریم صلی اللہ علیہ وسلم نے اپنے صحابہ کو کھجور تقسیم کی اور ہر شخص کو سات کھجوریں دیں ۔ مجھے بھی سات کھجوریں عنایت فرمائیں ۔ ان میں ایک خراب تھی ( اور سخت تھی ) لیکن مجھے وہی سب سے زیادہ اچھی معلوم ہوئی کیونکہ اس کا چبانا مجھ کو مشکل ہو گیا ۔",
                "urduNarrator": "ہم سے ابو النعمان نے بیان کیا ، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا ، ان سے عباس جریری نے بیان کیا ، ان سے ابوعثمان نہدی نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَبَّاسٍ الْجُرَيْرِيِّ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَسَمَ النَّبِيُّ صلى الله عليه وسلم يَوْمًا بَيْنَ أَصْحَابِهِ تَمْرًا، فَأَعْطَى كُلَّ إِنْسَانٍ سَبْعَ تَمَرَاتٍ، فَأَعْطَانِي سَبْعَ تَمَرَاتٍ إِحْدَاهُنَّ حَشَفَةٌ، فَلَمْ يَكُنْ فِيهِنَّ تَمْرَةٌ أَعْجَبَ إِلَىَّ مِنْهَا، شَدَّتْ فِي مَضَاغِي‏.‏",
                "headingArabic": "مَا كَانَ النَّبِيُّ صلى الله عليه وسلم وَأَصْحَابُهُ يَأْكُلُونَ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم اور صحابہ کرام کیا کھاتے تھے۔",
                "headingEnglish": "What the Prophet (saws) and his Companions used to eat.",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5177,
                "hadithNumber": "5412",
                "englishNarrator": "Narrated Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "I was one of (the first) seven (who had embraced Islam) with Allah's Messenger (ﷺ) and we had nothing to eat then, except the leaves of the Habala or Hubula tree, so that our stool used to be similar to that of sheep. Now the tribe of Bani Asad wants to teach me Islam; I would be a loser and all my efforts would be in vain (if I learn Islam anew from them).",
                "hadithUrdu": "میں نے اپنے آپ کو نبی کریم صلی اللہ علیہ وسلم کے ساتھ ان سات آدمیوں میں سے ساتواں پایا ( جنہوں نے اسلام سب سے پہلے قبول کیا تھا ) اس وقت ہمارے پاس کھانے کے لیے یہی کیکر کے پھل یا پتے کے سوا اور کچھ نہیں ہوتا ۔ یہ کھاتے کھاتے ہم لوگوں کا پا ئخانہ بھی بکری کی مینگنیوں کی طرح ہو گیا تھا یا اب یہ زمانہ ہے کہ نبی اسد قبیلے کے لوگ مجھ کو شریعت کے احکام سکھلاتے ہیں ۔ اگر میں ابھی تک اس حال میں ہوں کہ نبی اسد کے لوگ مجھ کوشریعت کے احکام سکھلائیں تب تو میں تباہ ہی ہو گیا میری محنت برباد ہو \r\nجائیں گئی ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے وہب بن جریر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے اسماعیل بن ابی خالد نے ، ان سے قیس بن ابی حازم نے اور ان سے حضرت سعد بن ابی وقاص رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ سَعْدٍ، قَالَ رَأَيْتُنِي سَابِعَ سَبْعَةٍ مَعَ النَّبِيِّ صلى الله عليه وسلم مَا لَنَا طَعَامٌ إِلاَّ وَرَقُ الْحُبْلَةِ ـ أَوِ الْحَبَلَةِ ـ حَتَّى يَضَعَ أَحَدُنَا مَا تَضَعُ الشَّاةُ، ثُمَّ أَصْبَحَتْ بَنُو أَسَدٍ تُعَزِّرُنِي عَلَى الإِسْلاَمِ، خَسِرْتُ إِذًا وَضَلَّ سَعْيِي‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5151,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=206",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=204",
                "label": "204",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=205",
                "label": "205",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=206",
                "label": "206",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=207",
                "label": "207",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=208",
                "label": "208",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=209",
                "label": "209",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=210",
                "label": "210",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=208",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=208",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=206",
        "to": 5175,
        "total": 40465
    }
}