{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 34,
        "data": [
            {
                "id": 826,
                "hadithNumber": "849, 850",
                "englishNarrator": "Narrated Um Salama رضی اللہ عنہا :",
                "hadithEnglish": "\"The Prophet (ﷺ) after finishing the prayer with Taslim used to stay at his place for a while.\" Ibn Shihab said, \"I think (and Allah knows better), that he used to wait for the departure of the women who had prayed.\" Ibn Shihab wrote that he had heard it from Hind bint Al-Harith Al-Firasiya from Um Salama رضی اللہ عنہا , the wife of the Prophet (Hind was from the companions of Um Salama رضی اللہ عنہا ) who said, \"When the Prophet (ﷺ) finished the prayer with Taslim, the women would depart and enter their houses before Allah's Apostle departed.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب سلام پھیرتے تو کچھ دیر اپنی جگہ پر بیٹھے رہتے ۔ ابن شہاب نے کہا اللہ بہتر جانے ہم تو یہ سمجھتے ہیں کہ یہ آپ اس لیے کرتے تھے تاکہ عورتیں پہلے چلی جائیں۔اور ابوسعید بن ابی مریم نے کہا کہ ہمیں نافع بن یزید نے خبر دی انہوں نے کہا کہ مجھ سے جعفر بن ربیعہ نے بیان کیا کہ ابن شہاب زہری نے انہیں لکھ بھیجا کہ مجھ سے ہند بنت حارث فراسیہ نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم کی پاک بیوی ام سلمہ رضی اللہ عنہا نے ( ہندان کی صحبت میں رہتی تھیں ) انہوں نے فرمایا کہ جب نبی کریم صلی اللہ علیہ وسلم سلام پھیرتے تو عورتیں لوٹ کر جانے لگتیں اور نبی کریم صلی اللہ علیہ وسلم کے اٹھنے سے پہلے اپنے گھروں میں داخل ہو چکی ہوتیں ۔",
                "urduNarrator": "ہم سے ابوالولیدہشام بن عبدالملک نے بیان کیا ، انہوں نے کہا کہ ہم سے ابراہیم بن سعد نے بیان کیا انہوں نے کہا کہ ہم سے زہری نے ہند بنت حارث سے بیان کیا ان سے ام المؤمنین حضرت ام سلمہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ هِنْدٍ بِنْتِ الْحَارِثِ، عَنْ أُمِّ سَلَمَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا سَلَّمَ يَمْكُثُ فِي مَكَانِهِ يَسِيرًا‏.‏ قَالَ ابْنُ شِهَابٍ فَنُرَى ـ وَاللَّهُ أَعْلَمُ ـ لِكَىْ يَنْفُذَ مَنْ يَنْصَرِفُ مِنَ النِّسَاءِ‏.وَقَالَ ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا نَافِعُ بْنُ يَزِيدَ، قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ رَبِيعَةَ، أَنَّ ابْنَ شِهَابٍ، كَتَبَ إِلَيْهِ قَالَ حَدَّثَتْنِي هِنْدُ بِنْتُ الْحَارِثِ الْفِرَاسِيَّةُ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَكَانَتْ مِنْ صَوَاحِبَاتِهَا قَالَتْ كَانَ يُسَلِّمُ فَيَنْصَرِفُ النِّسَاءُ، فَيَدْخُلْنَ بُيُوتَهُنَّ مِنْ قَبْلِ أَنْ يَنْصَرِفَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ وَقَالَ ابْنُ وَهْبٍ عَنْ يُونُسَ عَنِ ابْنِ شِهَابٍ أَخْبَرَتْنِي هِنْدُ الْفِرَاسِيَّةُ‏.‏ وَقَالَ عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا يُونُسُ عَنِ الزُّهْرِيِّ حَدَّثَتْنِي هِنْدُ الْفِرَاسِيَّةُ‏.‏ وَقَالَ الزُّبَيْدِيُّ أَخْبَرَنِي الزُّهْرِيُّ أَنَّ هِنْدَ بِنْتَ الْحَارِثِ الْقُرَشِيَّةَ أَخْبَرَتْهُ، وَكَانَتْ تَحْتَ مَعْبَدِ بْنِ الْمِقْدَادِ ـ وَهْوَ حَلِيفُ بَنِي زُهْرَةَ ـ وَكَانَتْ تَدْخُلُ عَلَى أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ شُعَيْبٌ عَنِ الزُّهْرِيِّ حَدَّثَتْنِي هِنْدُ الْقُرَشِيَّةُ‏.‏ وَقَالَ ابْنُ أَبِي عَتِيقٍ عَنِ الزُّهْرِيِّ عَنْ هِنْدٍ الْفِرَاسِيَّةِ‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ حَدَّثَهُ عَنِ ابْنِ شِهَابٍ عَنِ امْرَأَةٍ مِنْ قُرَيْشٍ حَدَّثَتْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 827,
                "hadithNumber": "851",
                "englishNarrator": "Narrated `Uqba رضی اللہ عنہ :",
                "hadithEnglish": "I offered the `Asr prayer behind the Prophet (ﷺ) at Medina. When he had finished the prayer with Taslim, he got up hurriedly and went out by crossing the rows of the people to one of the dwellings of his wives. The people got scared at his speed . \r\nThe Prophet (ﷺ) came back and found the people surprised at his haste and said to them, \"I remembered a piece of gold Lying in my house and I did not like it to divert my attention from Allah's worship, so I have ordered it to be distributed (in charity).",
                "hadithUrdu": "میں نے مدینہ میں نبی کریم صلی اللہ علیہ وسلم کی اقتداء میں ایک مرتبہ عصر کی نماز پڑھی ۔ سلام پھیرنے کے بعد آپ صلی اللہ علیہ وسلم جلدی سے اٹھ کھڑے ہوئے اور صفوں کو چیرتے ہوئے آپ صلی اللہ علیہ وسلم اپنی کسی بیوی کے حجرہ میں گئے ۔ لوگ آپ صلی اللہ علیہ وسلم کی اس تیزی کی وجہ سے گھبرا گئے ۔ پھر جب آپ صلی اللہ علیہ وسلم باہر تشریف لائے اور جلدی کی وجہ سے لوگوں کے تعجب کو محسوس فرمایا تو فرمایا کہ ہمارے پاس ایک سونے کا ڈلا ( تقسیم کرنے سے ) بچ گیا تھا مجھے اس میں دل لگا رہنا برا معلوم ہوا ، میں نے اس کے بانٹ دینے کا حکم دے دیا ۔",
                "urduNarrator": "ہم سے محمد بن عبید نے بیان کیا ، کہا کہ ہم سے عیسیٰ بن یونس نے عمر بن سعید سے یہ حدیث بیان کی ، انہوں نے کہا کہ مجھے ابن ابی ملیکہ نے خبر دی ان سے عقبہ بن حارث رضی اللہ عنہ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُمَرَ بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ، قَالَ صَلَّيْتُ وَرَاءَ النَّبِيِّ صلى الله عليه وسلم بِالْمَدِينَةِ الْعَصْرَ فَسَلَّمَ ثُمَّ قَامَ مُسْرِعًا، فَتَخَطَّى رِقَابَ النَّاسِ إِلَى بَعْضِ حُجَرِ نِسَائِهِ، فَفَزِعَ النَّاسُ مِنْ سُرْعَتِهِ فَخَرَجَ عَلَيْهِمْ، فَرَأَى أَنَّهُمْ عَجِبُوا مِنْ سُرْعَتِهِ فَقَالَ ‏ \"‏ ذَكَرْتُ شَيْئًا مِنْ تِبْرٍ عِنْدَنَا فَكَرِهْتُ أَنْ يَحْبِسَنِي، فَأَمَرْتُ بِقِسْمَتِهِ ‏\"‏‏.‏",
                "headingArabic": "مَنْ صَلَّى بِالنَّاسِ فَذَكَرَ حَاجَةً فَتَخَطَّاهُمْ",
                "headingUrdu": "جس نے لوگوں کو نماز پڑھائی اور کرایہ کا معاملہ یا ضرورت یاد ہو اور اسے لوگوں کے اوپر سے گزرنا پڑا (اس کو پورا کرنے کے لیے)",
                "headingEnglish": "Whoever led the people in Salat (prayer) and remembered an rent matter or necessity and had to pass over the people (to carry out that)",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 828,
                "hadithNumber": "852",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "You should not give away a part of your prayer to Satan by thinking that it is necessary to depart (after finishing the prayer) from one's right side only; I have seen the Prophet (ﷺ) often leave from the left side.",
                "hadithUrdu": "کوئی شخص اپنی نماز میں سے کچھ بھی شیطان کا حصہ نہ لگائے اس طرح کہ داہنی طرف ہی لوٹنا اپنے لیے ضروری قرار دے لے ۔ میں نے نبی کریم صلی اللہ علیہ وسلم کو اکثر بائیں طرف سے لوٹتے دیکھا ۔",
                "urduNarrator": "ہم سے ابو الولید نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، انہوں نے سلیمان سے بیان کیا ، ان سے عمارہ بن عمیر نے ، ان سے اسود بن یزید نے بیان کیا کہ عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنِ الأَسْوَدِ، قَالَ قَالَ عَبْدُ اللَّهِ لاَ يَجْعَلْ أَحَدُكُمْ لِلشَّيْطَانِ شَيْئًا مِنْ صَلاَتِهِ، يَرَى أَنَّ حَقًّا عَلَيْهِ أَنْ لاَ يَنْصَرِفَ إِلاَّ عَنْ يَمِينِهِ، لَقَدْ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم كَثِيرًا يَنْصَرِفُ عَنْ يَسَارِهِ‏.‏",
                "headingArabic": "الاِنْفِتَالِ وَالاِنْصِرَافِ عَنِ الْيَمِينِ، وَالشِّمَالِ",
                "headingUrdu": "نماز سے فارغ ہو کر دائیں اور بائیں سے نکلنا یا نکلنا۔",
                "headingEnglish": "To leave or depart from the right and from the left after finishing from the Salat (prayers).",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 829,
                "hadithNumber": "853",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "During the holy battle of Khaibar the Prophet (ﷺ) said, \"Whoever ate from this plant (i.e. garlic) should not enter our mosque.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے جنگ خیبر کے موقع پر کہا تھا کہ جو شخص اس درخت یعنی لہسن کو کھائے ہوئے ہو اسے ہماری مسجد میں نہ آنا چاہیے ( کچا لہسن یا پیاز کھانا مراد ہے کہ اس سے منہ میں بو پیدا ہو جاتی ہے ) ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے ، عبیداللہ بکیری سے بیان کیا ، کہا کہ مجھ سے نافع نے ابن عمر رضی اللہ عنہما سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ فِي غَزْوَةِ خَيْبَرَ ‏ \"‏ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ ـ يَعْنِي الثُّومَ ـ فَلاَ يَقْرَبَنَّ مَسْجِدَنَا ‏\"‏‏.‏",
                "headingArabic": "مَا جَاءَ فِي الثُّومِ النَّىِّ وَالْبَصَلِ وَالْكُرَّاثِ",
                "headingUrdu": "بغیر پکے لہسن، پیاز اور لیک کے بارے میں کیا کہا گیا ہے۔",
                "headingEnglish": "What has been said about uncooked garlic, onion and leek.",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 830,
                "hadithNumber": "854",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "\"The Prophet (ﷺ) said, 'Whoever eats (from) this plant (he meant garlic) should keep away from our mosque.\" I said, \"What does he mean by that?\" He replied, \"I think he means only raw garlic.\"\r\nMakhlad bin Yazeed reported from Ibn-e-Juraj: It means its odour.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص یہ درخت کھائے ( آپ کی مراد لہسن سے تھی ) تو وہ ہماری مسجد میں نہ آئے عطاء نے کہا میں نے جابر سے پوچھا کہ آپ کی مراد اس سے کیا تھی ۔ انہوں نے جواب دیا کہ آپ کی مراد صرف کچے لہسن سے تھی ۔\r\n مخلد بن یزید نے ابن جریج کے واسطہ سے ( الانیہ کے بجائے ) الانتنہ نقل کیا ہے ( یعنی آپ صلی اللہ علیہ وسلم کی مراد صرف لہسن کی بدبو سے تھی ) ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا کہ ہم سے ابوعاصم ضحاک بن مخلد نے بیان کیا ، کہا کہ ہمیں ابن جریج نے خبر دی کہا کہ مجھے عطاء بن ابی رباح نے خبر دی کہا کہ میں نے جابر بن عبداللہ انصاری رضی اللہ عنہما سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا أَبُو عَاصِمٍ، قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ ـ يُرِيدُ الثُّومَ ـ فَلاَ يَغْشَانَا فِي مَسَاجِدِنَا ‏\"‏‏.‏ قُلْتُ مَا يَعْنِي بِهِ قَالَ مَا أُرَاهُ يَعْنِي إِلاَّ نِيئَهُ‏.‏ وَقَالَ مَخْلَدُ بْنُ يَزِيدَ عَنِ ابْنِ جُرَيْجٍ إِلاَّ نَتْنَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 831,
                "hadithNumber": "855",
                "englishNarrator": "Narrated Jabir bin `Abdullah:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever eats garlic or onion should keep away from our mosque or should remain in his house.\" (Jabir bin `Abdullah, in another narration said, \"Once a big pot containing cooked vegetables was brought. On finding unpleasant smell coming from it, the Prophet (ﷺ) asked, 'What is in it?' He was told all the names of the vegetables that were in it. The Prophet (ﷺ) ordered that it should be brought near to some of his companions who were with him. When the Prophet (ﷺ) saw it he disliked to eat it and said, 'Eat. (I don't eat) for I converse with those whom you don't converse with (i.e. the angels).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جو لہسن یا پیاز کھائے ہوئے ہو تو وہ ہم سے دور رہے یا ( یہ کہا کہ اسے ) ہماری مسجد سے دور رہنا چاہیے یا اسے اپنے گھر میں ہی بیٹھنا چاہیے ۔ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ایک ہانڈی لائی گئی جس میں کئی قسم کی ہری ترکاریاں تھیں ۔ ( پیاز یا گندنا بھی ) آپ صلی اللہ علیہ وسلم نے اس میں بو محسوس کی اور اس کے متعلق دریافت کیا ۔ اس سالن میں جتنی ترکاریاں ڈالیں گئی تھیں وہ آپ صلی اللہ علیہ وسلم کو بتا دی گئیں ۔ وہاں ایک صحابی موجود تھے آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی طرف یہ سالن بڑھا دو ۔ آپ صلی اللہ علیہ وسلم نے اسے کھانا پسند نہیں فرمایا اور فرمایا کہ تم لوگ کھا لو ۔ میری جن سے سرگوشی رہتی ہے تمہاری نہیں رہتی اور احمد بن صالح نے ابن وہب سے یوں نقل کیا کہ تھال آپ صلی اللہ علیہ وسلم کی خدمت میں لائی گئی تھی ۔ ابن وہب نے کہا کہ طبق جس میں ہری ترکاریاں تھیں اور لیث اور ابوصفوان نے یونس سے روایت میں ہانڈی کا قصہ نہیں بیان کیا ہے \r\n امام بخاری رحمہ اللہ نے ( یا سعید یا ابن وہب نے کہا ) میں نہیں کہہ سکتا کہ یہ خود زہری کا قول ہے یا حدیث میں داخل ہے ۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ ہم سے ابن وہب نے یونس سے بیان کیا ، ان سے ابن شہاب نے کہ عطاء جابر بن عبداللہ سے روایت کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، زَعَمَ عَطَاءٌ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ، زَعَمَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَكَلَ ثُومًا أَوْ بَصَلاً فَلْيَعْتَزِلْنَا ـ أَوْ قَالَ ـ فَلْيَعْتَزِلْ مَسْجِدَنَا، وَلْيَقْعُدْ فِي بَيْتِهِ ‏\"‏‏.‏ وَأَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِقِدْرٍ فِيهِ خَضِرَاتٌ مِنْ بُقُولٍ، فَوَجَدَ لَهَا رِيحًا فَسَأَلَ فَأُخْبِرَ بِمَا فِيهَا مِنَ الْبُقُولِ فَقَالَ ‏\"‏ قَرِّبُوهَا ‏\"‏ إِلَى بَعْضِ أَصْحَابِهِ كَانَ مَعَهُ، فَلَمَّا رَآهُ كَرِهَ أَكْلَهَا قَالَ ‏\"‏ كُلْ فَإِنِّي أُنَاجِي مَنْ لاَ تُنَاجِي ‏\"‏‏.‏ وَقَالَ أَحْمَدُ بْنُ صَالِحٍ عَنِ ابْنِ وَهْبٍ أُتِيَ بِبَدْرٍ‏.‏ قَالَ ابْنُ وَهْبٍ يَعْنِي طَبَقًا فِيهِ خُضَرَاتٌ‏.‏ وَلَمْ يَذْكُرِ اللَّيْثُ وَأَبُو صَفْوَانَ عَنْ يُونُسَ قِصَّةَ الْقِدْرِ، فَلاَ أَدْرِي هُوَ مِنْ قَوْلِ الزُّهْرِيِّ أَوْ فِي الْحَدِيثِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 832,
                "hadithNumber": "856",
                "englishNarrator": "Narrated `Abdul `Aziz:",
                "hadithEnglish": "A man asked Anas رضی اللہ عنہ , \"What did you hear from the Prophet (ﷺ) about garlic?\" He said, \"The Prophet (ﷺ) said, 'Whoever has eaten this plant should neither come near us nor pray with us.\"",
                "hadithUrdu": "حضرت انس بن مالک رضی اللہ عنہ سے ایک شخص نے پوچھا کہ آپ نے نبی کریم صلی اللہ علیہ وسلم سے لہسن کے بارے میں کیا سنا ہے ۔ انہوں نے بتایا کہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص اس درخت کو کھائے وہ ہمارے قریب نہ آئے ہمارے ساتھ نماز نہ پڑھے ۔",
                "urduNarrator": "ہم سے ابو معمر نے بیان کیا ، ان سے عبدالوارث بن سعید نے بیان کیا ، ان سے عبد العزیز بن صہیب نے بیان کیا ، کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، قَالَ سَأَلَ رَجُلٌ أَنَسًا مَا سَمِعْتَ نَبِيَّ اللَّهِ صلى الله عليه وسلم فِي الثُّومِ فَقَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ فَلاَ يَقْرَبْنَا، أَوْ لاَ يُصَلِّيَنَّ مَعَنَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 833,
                "hadithNumber": "857",
                "englishNarrator": "Narrated Sulaiman Ash-Shaibani:",
                "hadithEnglish": "I heard Ash-Shu`bi saying, \"A person who was accompanying the Prophet (ﷺ) passed by a grave that was separated from the other graves told me that the Prophet (ﷺ) once led the people in the (funeral) prayer and the people had aligned behind him. I said, \"O Aba `Amr! Who told you about it?\" He said, \"Ibn `Abbas.\"",
                "hadithUrdu": "جو ( ایک مرتبہ ) نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک اکیلی الگ تھلگ ٹوٹی ہوئی قبر پر سے گزر رہے تھے وہاں آنحضرت صلی اللہ علیہ وسلم نے نماز پڑھائی اور لوگ آپ صلی اللہ علیہ وسلم کے پیچھے صف باندھے ہوئے تھے ۔ سلیمان نے کہا کہ میں نے شعبی سے پوچھا کہ ابوعمرو آپ سے یہ کس نے بیان کیا تو انہوں نے کہا کہ ابن عباس رضی اللہ عنہما نے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ ہم سے غندر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، انہوں نے سلیمان شیبانی سے سنا ، انہوں نے شعبی سے ، انہوں نے بیان کیا کہ مجھے ایک ایسے شخص نے خبر دی",
                "hadithArabic": "حَدَّثَنَا ابْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ سُلَيْمَانَ الشَّيْبَانِيَّ، قَالَ سَمِعْتُ الشَّعْبِيَّ، قَالَ أَخْبَرَنِي مَنْ، مَرَّ مَعَ النَّبِيِّ صلى الله عليه وسلم عَلَى قَبْرٍ مَنْبُوذٍ، فَأَمَّهُمْ وَصَفُّوا عَلَيْهِ‏.‏ فَقُلْتُ يَا أَبَا عَمْرٍو مَنْ حَدَّثَكَ فَقَالَ ابْنُ عَبَّاسٍ‏.‏",
                "headingArabic": "وُضُوءِ الصِّبْيَانِ",
                "headingUrdu": "لڑکوں (نوجوانوں) کا وضو۔ جب وہ غسل کریں اور طہور کریں۔ باجماعت نمازوں میں ان کی حاضری اور نماز میں ان کی صفیں",
                "headingEnglish": "The ablution for boys (youngsters). When they should perform Ghusl (take a bath) and Tuhur (purification). Their attendance at congregational prayers and their rows in the prayers.",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 834,
                "hadithNumber": "858",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Ghusl (taking a bath) on Friday is compulsory for every Muslim reaching the age of puberty.\"",
                "hadithUrdu": "ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جمعہ کے دن ہر بالغ کے لیے غسل ضروری ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان نے بیان کیا ، انہوں نے کہا کہ مجھ سے صفوان بن سلیم نے عطاء سے بیان کیا ، ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي صَفْوَانُ بْنُ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْغُسْلُ يَوْمَ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 835,
                "hadithNumber": "859",
                "englishNarrator": "Narrated Ibn `Abbas:",
                "hadithEnglish": "One night I slept at the house of my aunt Maimuna رضی اللہ عنہا and the Prophet (ﷺ) slept (too). He got up (for prayer) in the last hours of the night and performed a light ablution from a hanging leather skin. (`Amr, the sub-narrator described that the ablution was very light). Then he stood up for prayer and I got up too and performed the ablution in the same way and joined him on his left side. He pulled me to the right and prayed as much as Allah will. Then he lay down and slept and I heard his breath sounds till the Mu'adh-dhin came to him to inform him about the (Fajr) prayer. He left with him for the prayer and prayed without repeating the ablution. (Sufyan the sub-narrator said: We said to `Amr, \"Some people say, 'The eyes of the Prophet (ﷺ) sleep but his heart never sleeps.' \" `Amr said, \"'Ubai bin `Umar said, 'The dreams of the Prophets are Divine Inspirations. Then he recited, '(O my son), I have seen in dream that I was slaughtering you (offering you in sacrifice).\") (37.102)",
                "hadithUrdu": "ایک رات میں اپنی خالہ میمونہ رضی اللہ عنہا کے یہاں سویا اور رسول کریم صلی اللہ علیہ وسلم بھی وہاں سو گئے ۔ پھر رات کا ایک حصہ جب گزر گیا آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور ایک لٹکی ہوئی مشک سے ہلکا سا وضو کیا ۔ عمرو ( راوی حدیث نے ) اس وضو کو بہت ہی ہلکا بتلایا ( یعنی اس میں آپ صلی اللہ علیہ وسلم نے بہت کم پانی استعمال فرمایا ) پھر آپ صلی اللہ علیہ وسلم نماز کے لیے کھڑے ہوئے اس کے بعد میں نے بھی اٹھ کر اسی طرح وضو کیا جیسے آپ صلی اللہ علیہ وسلم نے کیا تھا پھر میں آپ صلی اللہ علیہ وسلم کے بائیں طرف کھڑا ہو گیا ۔ لیکن آپ صلی اللہ علیہ وسلم نے مجھے داہنی طرف پھیر دیا پھر اللہ تعالیٰ نے جتنا چاہا آپ صلی اللہ علیہ وسلم نے نماز پڑھی پھر آپ صلی اللہ علیہ وسلم لیٹ رہے پھر سو گئے ۔ یہاں تک کہ آپ صلی اللہ علیہ وسلم خراٹے لینے لگے ۔ آخر مؤذن نے آ کر آپ صلی اللہ علیہ وسلم کو نماز کی خبر دی اور آپ صلی اللہ علیہ وسلم اس کے ساتھ نماز کے لیے تشریف لے گئے اور نماز پڑھائی مگر ( نیا ) وضو نہیں کیا سفیان نے کہا ۔ ہم نے عمرو بن دینار سے کہا کہ لوگ کہتے ہیں کہ ( سوتے وقت ) آپ صلی اللہ علیہ وسلم کی ( صرف ) آنکھیں سوتی تھیں لیکن دل نہیں سوتا تھا ۔ عمرو بن دینار نے جواب دیا کہ میں نے عبید بن عمیر سے سنا وہ کہتے تھے کہ انبیاء کا خواب بھی وحی ہوتا ہے پھر عبید نے اس آیت کی تلاوت کی «إني أرى في المنام أني أذبحك‏» ( ترجمہ ) میں نے خواب دیکھا ہے کہ تمہیں ذبح کر رہا ہوں ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہ کہا ہم سے سفیان بن عیینہ نے عمرو بن دینار سے بیان کیا ، کہا کہ مجھے کریب نے خبر دی ابن عباس سے ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ أَخْبَرَنِي كُرَيْبٌ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ لَيْلَةً، فَنَامَ النَّبِيُّ صلى الله عليه وسلم فَلَمَّا كَانَ فِي بَعْضِ اللَّيْلِ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَتَوَضَّأَ مِنْ شَنٍّ مُعَلَّقٍ وُضُوءًا خَفِيفًا ـ يُخَفِّفُهُ عَمْرٌو وَيُقَلِّلُهُ جِدًّا ـ ثُمَّ قَامَ يُصَلِّي، فَقُمْتُ فَتَوَضَّأْتُ نَحْوًا مِمَّا تَوَضَّأَ، ثُمَّ جِئْتُ فَقُمْتُ عَنْ يَسَارِهِ، فَحَوَّلَنِي فَجَعَلَنِي عَنْ يَمِينِهِ، ثُمَّ صَلَّى مَا شَاءَ اللَّهُ، ثُمَّ اضْطَجَعَ فَنَامَ حَتَّى نَفَخَ، فَأَتَاهُ الْمُنَادِي يُؤْذِنُهُ بِالصَّلاَةِ فَقَامَ مَعَهُ إِلَى الصَّلاَةِ، فَصَلَّى وَلَمْ يَتَوَضَّأْ‏.‏ قُلْنَا لِعَمْرٍو إِنَّ نَاسًا يَقُولُونَ إِنَّ النَّبِيَّ صلى الله عليه وسلم تَنَامُ عَيْنُهُ وَلاَ يَنَامُ قَلْبُهُ‏.‏ قَالَ عَمْرٌو سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ يَقُولُ إِنَّ رُؤْيَا الأَنْبِيَاءِ وَحْىٌ ثُمَّ قَرَأَ ‏{‏إِنِّي أَرَى فِي الْمَنَامِ أَنِّي أَذْبَحُكَ‏}‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 836,
                "hadithNumber": "860",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "My grandmother Mulaika رضی اللہ عنہا invited Allah's Messenger (ﷺ) for a meal which she had prepared specially for him. He ate some of it and said, \"Get up. I shall lead you in the prayer.\" I brought a mat that had become black owing to excessive use and I sprinkled water on it. Allah's Messenger (ﷺ) stood on it and prayed two rak`at; and the orphan was with me (in the first row), and the old lady stood behind us.",
                "hadithUrdu": "( ان کی ماں ) اسحاق کی دادی ملیکہ رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم کو کھانے پر بلایا جسے انہوں نے آپ صلی اللہ علیہ وسلم کے لیے بطور ضیافت تیار کیا تھا ۔ آپ صلی اللہ علیہ وسلم نے کھانا کھایا پھر فرمایا کہ چلو میں تمہیں نماز پڑھا دوں ۔ ہمارے یہاں ایک بوریا تھا جو پرانا ہونے کی وجہ سے سیاہ ہو گیا تھا ۔ میں نے اسے پانی سے صاف کیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے اور ( پیچھے ) میرے ساتھ یتیم لڑکا ( ضمیرہ بن سعد ) کھڑا ہوا ۔ میری بوڑھی دادی ( ملیکہ ام سلیم ) ہمارے پیچھے کھڑی ہوئیں پھر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں دو رکعت نماز پڑھائی ۔",
                "urduNarrator": "ہم سے اسماعیل بن اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک رحمہ اللہ نے اسحاق بن عبداللہ بن ابی طلحہ سے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ جَدَّتَهُ، مُلَيْكَةَ دَعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ صَنَعَتْهُ، فَأَكَلَ مِنْهُ فَقَالَ ‏ \"‏ قُومُوا فَلأُصَلِّيَ بِكُمْ ‏\"‏‏.‏ فَقُمْتُ إِلَى حَصِيرٍ لَنَا قَدِ اسْوَدَّ مِنْ طُولِ مَا لُبِسَ، فَنَضَحْتُهُ بِمَاءٍ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالْيَتِيمُ مَعِي، وَالْعَجُوزُ مِنْ وَرَائِنَا، فَصَلَّى بِنَا رَكْعَتَيْنِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 837,
                "hadithNumber": "861",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Once I came riding a she-ass and I, then, had just attained the age of puberty. Allah's Messenger (ﷺ) was leading the people in prayer at Mina facing no wall. I passed in front of the row and let loose the sheass for grazing and joined the row and no one objected to my deed.",
                "hadithUrdu": "میں ایک گدھی پر سوار ہو کر آیا ۔ ابھی میں جوانی کے قریب تھا ( لیکن بالغ نہ تھا ) اور آنحضرت صلی اللہ علیہ وسلم منیٰ میں لوگوں کو نماز پڑھا رہے تھے ۔ آپ صلی اللہ علیہ وسلم کے سامنے دیوار وغیرہ ( آڑ ) نہ تھی ۔ میں صف کے ایک حصے کے آگے سے گزر کر اترا ۔ گدھی چرنے کے لیے چھوڑ دی اور خود صف میں شامل ہو گیا ۔ کسی نے مجھ پر اعتراض نہیں کیا ( حالانکہ میں نابالغ تھا ) ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے ابن شہاب زہری نے بیان کیا ، ان سے عبیداللہ بن عبداللہ بن عتبہ نے بیان کیا ، ان سے عبداللہ بن عباس رضی اللہ عنہما نے ، آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ قَالَ أَقْبَلْتُ رَاكِبًا عَلَى حِمَارٍ أَتَانٍ وَأَنَا يَوْمَئِذٍ قَدْ نَاهَزْتُ الاِحْتِلاَمَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِالنَّاسِ بِمِنًى إِلَى غَيْرِ جِدَارٍ، فَمَرَرْتُ بَيْنَ يَدَىْ بَعْضِ الصَّفِّ، فَنَزَلْتُ وَأَرْسَلْتُ الأَتَانَ تَرْتَعُ وَدَخَلْتُ فِي الصَّفِّ، فَلَمْ يُنْكِرْ ذَلِكَ عَلَىَّ أَحَدٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 838,
                "hadithNumber": "862",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) delayed the 'Isha' prayer. Urwa (with another chain) reports that Hadrat Aisha said:  \r\nOnce Allah's Messenger (ﷺ) delayed the `Isha' prayer till `Umar informed him that the women and children had slept. Then Allah's Messenger (ﷺ) came out and said: \"None from amongst the dwellers of earth have prayed this prayer except you.\" In those days none but the people of Medina prayed.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک رات عشاء میں دیر کی اور عیاش نے ہم سے عبد الاعلیٰ سے بیان کیا ، انہوں نے کہا کہ ہم سے معمر نے زہری سے بیان کیا ، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے فرمایا کہ \r\nرسول اللہ صلی اللہ علیہ وسلم نے عشاء میں ایک مرتبہ دیر کی ۔ یہاں تک کہ حضرت عمر رضی اللہ عنہ نے آواز دی کہ عورتیں اور بچے سو گئے ۔ انہوں نے فرمایا کہ پھر نبی کریم صلی اللہ علیہ وسلم باہر آئے اور فرمایا کہ ( اس وقت ) روئے زمین پر تمہارے سوا اور کوئی اس نماز کو نہیں پڑھتا ، اس زمانہ میں مدینہ والوں کے سوا اور کوئی نماز نہیں پڑھتا تھا ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی ، انہوں نے کہا کہ مجھے عروہ بن زبیر نے خبر دی کہ ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، قَالَتْ أَعْتَمَ النَّبِيُّ صلى الله عليه وسلم‏.‏ وَقَالَ عَيَّاشٌ حَدَّثَنَا عَبْدُ الأَعْلَى حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ أَعْتَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْعِشَاءِ حَتَّى نَادَاهُ عُمَرُ قَدْ نَامَ النِّسَاءُ وَالصِّبْيَانُ‏.‏ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ إِنَّهُ لَيْسَ أَحَدٌ مِنْ أَهْلِ الأَرْضِ يُصَلِّي هَذِهِ الصَّلاَةَ غَيْرُكُمْ ‏\"‏‏.‏ وَلَمْ يَكُنْ أَحَدٌ يَوْمَئِذٍ يُصَلِّي غَيْرَ أَهْلِ الْمَدِينَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 839,
                "hadithNumber": "863",
                "englishNarrator": "Narrated A person asked Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"Have you ever presented yourself at the (`Id) prayer with Allah's Apostle (ﷺ) ?\" He replied, \"Yes.\" And had it not been for my kinship (position) with the Prophet (ﷺ) it would not have been possible for me to do so (for he was too young). The Prophet (ﷺ) went to the mark near the house of Kathir bin As-Salt and delivered a sermon. He then went towards the women. He advised and reminded them and asked them to give alms. So the woman would bring her hand near her neck and take off her necklace and put it in the garment of Bilal رضی اللہ عنہما . Then the Prophet (ﷺ) and Bilal رضی اللہ عنہما came to the house.\"",
                "hadithUrdu": "کیا تم نے ( عورتوں کا ) نکلنا عید کے دن آنحضرت صلی اللہ علیہ وسلم کے ساتھ دیکھا ہے ؟ انہوں نے کہا ہاں دیکھا ہے اگر میں آپ کا رشتہ دار عزیز نہ ہوتا تو کبھی نہ دیکھتا ( یعنی میری کم سنی اور قرابت کی وجہ سے آنحضرت صلی اللہ علیہ وسلم مجھ کو اپنے ساتھ رکھتے تھے ) کثیر بن صلت کے مکان کے پاس جو نشان ہے پہلے وہاں آپ صلی اللہ علیہ وسلم تشریف لائے وہاں آپ صلی اللہ علیہ وسلم نے خطبہ سنایا پھر آپ صلی اللہ علیہ وسلم عورتوں کے پاس تشریف لائے اور انہیں بھی وعظ و نصیحت کی ۔ آپ صلی اللہ علیہ وسلم نے ان سے خیرات کرنے کے لیے کہا ، چنانچہ عورتوں نے اپنے چھلے اور انگوٹھیاں اتار اتار کر بلال رضی اللہ عنہ کے کپڑے میں ڈالنی شروع کر دیے ۔ آخر آنحضور صلی اللہ علیہ وسلم بلال رضی اللہ عنہ کے ساتھ گھر تشریف لائے ۔",
                "urduNarrator": "ہم سے عمرو بن علی فلاس نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ، کہا کہ مجھ سے عبدالرحمٰن بن عابس نے بیان کیا ، کہا کہ میں نے ابن عباس رضی اللہ عنہما سے سنا اور ان سے ایک شخص نے یہ پوچھا تھا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَابِسٍ، سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَهُ رَجُلٌ شَهِدْتَ الْخُرُوجَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ، وَلَوْلاَ مَكَانِي مِنْهُ مَا شَهِدْتُهُ ـ يَعْنِي مِنْ صِغَرِهِ ـ أَتَى الْعَلَمَ الَّذِي عِنْدَ دَارِ كَثِيرِ بْنِ الصَّلْتِ، ثُمَّ خَطَبَ ثُمَّ أَتَى النِّسَاءَ فَوَعَظَهُنَّ وَذَكَّرَهُنَّ وَأَمَرَهُنَّ أَنْ يَتَصَدَّقْنَ فَجَعَلَتِ الْمَرْأَةُ تُهْوِي بِيَدِهَا إِلَى حَلْقِهَا تُلْقِي فِي ثَوْبِ بِلاَلٍ، ثُمَّ أَتَى هُوَ وَبِلاَلٌ الْبَيْتَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 840,
                "hadithNumber": "864",
                "englishNarrator": "Narrated `Aisha  رضی اللہ عنہا :",
                "hadithEnglish": "Once Allah's Messenger (ﷺ) delayed the `Isha' prayer till `Umar رضی اللہ عنہ informed him that the women and children had slept. The Prophet (ﷺ) came out and said, \"None except you from amongst the dwellers of earth is waiting for this prayer.\" In those days, there was no prayer except in Medina and they used to pray the `Isha' prayer between the disappearance of the twilight and the first third of the night.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک مرتبہ عشاء کی نماز میں اتنی دیر کی کہ عمر رضی اللہ عنہ کو کہنا پڑا کہ عورتیں اور بچے سو گئے ۔ پھر نبی کریم صلی اللہ علیہ وسلم ( حجرے سے ) تشریف لائے اور فرمایا کہ دیکھو روئے زمین پر اس نماز کا ( اس وقت ) تمہارے سوا اور کوئی انتظار نہیں کر رہا ہے ۔ ان دنوں مدینہ کے سوا اور کہیں نماز نہیں پڑھی جاتی تھی اور لوگ عشاء کی نماز شفق ڈوبنے کے بعد سے رات کی پہلی تہائی گزرنے تک پڑھا کرتے تھے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا کہ ہمیں شعیب نے زہری سے خبر دی ، انہوں نے کہا کہ مجھے عروہ بن زبیر نے عائشہ رضی اللہ عنہا سے بیان کیا ، آپ رضی اللہ عنہ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ أَعْتَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْعَتَمَةِ حَتَّى نَادَاهُ عُمَرُ نَامَ النِّسَاءُ وَالصِّبْيَانُ‏.‏ فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ مَا يَنْتَظِرُهَا أَحَدٌ غَيْرُكُمْ مِنْ أَهْلِ الأَرْضِ ‏\"‏‏.‏ وَلاَ يُصَلَّى يَوْمَئِذٍ إِلاَّ بِالْمَدِينَةِ، وَكَانُوا يُصَلُّونَ الْعَتَمَةَ فِيمَا بَيْنَ أَنْ يَغِيبَ الشَّفَقُ إِلَى ثُلُثِ اللَّيْلِ الأَوَّلِ‏.‏",
                "headingArabic": "خُرُوجِ النِّسَاءِ إِلَى الْمَسَاجِدِ بِاللَّيْلِ وَالْغَلَسِ",
                "headingUrdu": "عورتوں کا رات کے وقت اور اندھیرے میں مسجد جانا",
                "headingEnglish": "Going of women to the mosqu at night and in darkness",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 841,
                "hadithNumber": "865",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If your women ask permission to go to the mosque at night, allow them.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر تمہاری بیویاں تم سے رات میں مسجد آنے کی اجازت مانگیں تو تم لوگ انہیں اس کی اجازت دے دیا کرو ۔ \r\nعبیداللہ کے ساتھ اس حدیث کو شعبہ نے بھی اعمش سے روایت کیا ، انہوں نے مجاہد سے ، انہوں نے ابن عمر رضی اللہ عنہما سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ۔",
                "urduNarrator": "ہم سے عبیداللہ بن موسیٰ نے حنظلہ بن ابی سفیان سے بیان کیا ، ان سے سالم بن عبداللہ بن عمر نے ، ان سے ان کے باپ ابن عمر رضی اللہ عنہما نے ، وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ حَنْظَلَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا اسْتَأْذَنَكُمْ نِسَاؤُكُمْ بِاللَّيْلِ إِلَى الْمَسْجِدِ فَأْذَنُوا لَهُنَّ ‏\"‏‏.‏ تَابَعَهُ شُعْبَةُ عَنِ الأَعْمَشِ عَنْ مُجَاهِدٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 842,
                "hadithNumber": "866",
                "englishNarrator": "Narrated: Hadrat Hind bint Harith:",
                "hadithEnglish": "Um Salama (the wife of the Prophet) رضی اللہ عنہا In the lifetime of Allah's Messenger (ﷺ) the women used to get up when they finished their compulsory prayers with Taslim. The Prophet (ﷺ) and the men would stay on at their places as long as Allah will. When the Prophet (ﷺ) got up, the men would then get up.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا نے انہیں خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں عورتیں فرض نماز سے سلام پھیرنے کے فوراً بعد ( باہر آنے کے لیے ) اٹھ جاتی تھیں ۔ رسول اللہ صلی اللہ علیہ وسلم اور مرد نماز کے بعد اپنی جگہ بیٹھے رہتے ۔ جب تک اللہ کو منظور ہوتا ۔ پھر جب رسول اللہ صلی اللہ علیہ وسلم اٹھتے تو دوسرے مرد بھی کھڑے ہو جاتے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا کہ ہم سے عثمان بن عمر نے بیان کیا ، انہوں نے کہا ہمیں یونس بن یزید نے زہری سے خبر دی ، انہوں نے کہا کہ مجھے ہند بنت حارث نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَتْنِي هِنْدُ بِنْتُ الْحَارِثِ، أَنَّ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهَا أَنَّ النِّسَاءَ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم كُنَّ إِذَا سَلَّمْنَ مِنَ الْمَكْتُوبَةِ قُمْنَ، وَثَبَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَنْ صَلَّى مِنَ الرِّجَالِ مَا شَاءَ اللَّهُ، فَإِذَا قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَامَ الرِّجَالُ‏.‏",
                "headingArabic": "انْتِظَارِ النَّاسِ قِيَامَ الإِمَامِ الْعَالِمِ",
                "headingUrdu": "لوگوں کا عالم دین کے امام کے اٹھنے کا انتظار (نماز کے بعد روانگی)",
                "headingEnglish": "The waiting of the people for the religious learned Imam to get up (after the prayer to depart)",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 843,
                "hadithNumber": "867",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) finished the Fajr prayer, the women would leave covered in their sheets and were not recognized owing to the darkness.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم صبح کی نماز پڑھ لیتے پھر عورتیں چادریں لپیٹ کر ( اپنے گھروں کو ) واپس ہو جاتی تھیں ۔ اندھیرے سے ان کی پہچان نہ ہو سکتی ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، انہوں نے امام مالک رحمہ اللہ سے بیان کیا ، ( دوسری سند ) اور ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہیں امام مالک رحمہ اللہ نے یحییٰ بن سعید انصاری سے خبر دی ، انہیں عمرہ بنت عبدالرحمٰن نے ، ان سے حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، قَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيُصَلِّي الصُّبْحَ، فَيَنْصَرِفُ النِّسَاءُ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ، مَا يُعْرَفْنَ مِنَ الْغَلَسِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 844,
                "hadithNumber": "868",
                "englishNarrator": "Narrated `Abu Qatada:",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) said, \"Whenever I stand for prayer, I want to prolong it but on hearing the cries of a child, I would shorten it as I dislike to put its mother in trouble.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں نماز کے لیے کھڑا ہوتا ہوں ، میرا ارادہ یہ ہوتا ہے کہ نماز لمبی کروں لیکن کسی بچے کے رونے کی آواز سن کر نماز کو مختصر کر دیتا ہوں کہ مجھے اس کی ماں کو تکلیف دینا برا معلوم ہوتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن مسکین نے بیان کیا ، کہا کہ ہم سے بشر بن بکر نے بیان کیا ، کہا کہ ہمیں امام اوزاعی نے خبر دی ، کہا کہ مجھ سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے عبداللہ بن ابی قتادہ انصاری نے ، ان سے ان کے والد ابوقتادہ انصاری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِسْكِينٍ، قَالَ حَدَّثَنَا بِشْرٌ، أَخْبَرَنَا الأَوْزَاعِيُّ، حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ الأَنْصَارِيِّ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنِّي لأَقُومُ إِلَى الصَّلاَةِ وَأَنَا أُرِيدُ أَنْ أُطَوِّلَ فِيهَا، فَأَسْمَعُ بُكَاءَ الصَّبِيِّ، فَأَتَجَوَّزُ فِي صَلاَتِي كَرَاهِيَةَ أَنْ أَشُقَّ عَلَى أُمِّهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 845,
                "hadithNumber": "869",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Had Allah's Messenger (ﷺ) known what the women were doing, he would have forbidden them from going to the mosque as the women of Bani Israel had been forbidden. Yahya bin Sa`id (a sub-narrator) asked `Amra (another sub-narrator), \"Were the women of Bani Israel forbidden?\" She replied \"Yes.\"",
                "hadithUrdu": "آج عورتوں میں جو نئی باتیں پیدا ہو گئی ہیں اگر رسول کریم صلی اللہ علیہ وسلم انہیں دیکھ لیتے تو ان کو مسجد میں آنے سے روک دیتے جس طرح بنی اسرائیل کی عورتوں کو روک دیا گیا تھا ۔ میں نے پوچھا کہ کیا بنی اسرائیل کی عورتوں کو روک دیا گیا تھا ؟ آپ نے فرمایا کہ ہاں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک رحمہ اللہ نے یحییٰ بن سعید سے خبر دی ، ان سے عمرہ بنت عبدالرحمٰن نے ، ان سے حضرت عائشہ رضی اللہ عنہا نے ، انہوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَوْ أَدْرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا أَحْدَثَ النِّسَاءُ لَمَنَعَهُنَّ كَمَا مُنِعَتْ نِسَاءُ بَنِي إِسْرَائِيلَ‏.‏ قُلْتُ لِعَمْرَةَ أَوَ مُنِعْنَ قَالَتْ نَعَمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 846,
                "hadithNumber": "870",
                "englishNarrator": "Narrated Um Salama رضی اللہ عنہا :",
                "hadithEnglish": "Whenever Allah's Messenger (ﷺ) completed the prayer with Taslim, the women used to get up immediately and Allah's Messenger (ﷺ) would remain at his place for someone before getting up. (The sub-narrator (Az- Zuhri) said, \"We think, and Allah knows better, that he did so, so that the women might leave before men could get in touch with them).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب سلام پھیرتے تو آپ صلی اللہ علیہ وسلم کے سلام پھیرتے ہی عورتیں جانے کے لیے اٹھ جاتی تھیں اور آنحضور صلی اللہ علیہ وسلم تھوڑی دیر ٹھہرے رہتے کھٹرے نہ ہوتے ۔ زہری نے کہا کہ ہم یہ سمجھتے ہیں ، آگے اللہ جانے ، یہ اس لیے تھا تاکہ عورتیں مردوں سے پہلے نکل جائیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، انہوں نے کہا کہ ہم سے ابراہیم بن سعد نے بیان کیا ، انہوں نے زہری سے بیان کیا ، ان سے ہند بنت حارث نے بیان کیا ، اس سے ام سلمہ رضی اللہ عنہا نے ، انہوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ هِنْدٍ بِنْتِ الْحَارِثِ، عَنْ أُمِّ سَلَمَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا سَلَّمَ قَامَ النِّسَاءُ حِينَ يَقْضِي تَسْلِيمَهُ، وَيَمْكُثُ هُوَ فِي مَقَامِهِ يَسِيرًا قَبْلَ أَنْ يَقُومَ‏.‏ قَالَ نَرَى ـ وَاللَّهُ أَعْلَمُ ـ أَنَّ ذَلِكَ كَانَ لِكَىْ يَنْصَرِفَ النِّسَاءُ قَبْلَ أَنْ يُدْرِكَهُنَّ أَحَدٌ مِنَ الرِّجَالِ‏.‏",
                "headingArabic": "صَلاَةِ النِّسَاءِ خَلْفَ الرِّجَالِ",
                "headingUrdu": "مردوں کے پیچھے عورتوں کی نماز",
                "headingEnglish": "The Salat (prayer) of women behind men",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 847,
                "hadithNumber": "871",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) prayed in the house of Um Sulaim; and I, along with an orphan stood behind him while Um Sulaim رضی اللہ عنہا (stood) behind us.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ( میری ماں ) ام سلیم کے گھر میں نماز پڑھائی ۔ میں اور یتیم مل کر آپ صلی اللہ علیہ وسلم کے پیچھے کھڑے ہوئے اور ام سلیم رضی اللہ عنہا ہمارے پیچھے تھیں ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے ، ان سے حضرت انس رضی اللہ عنہ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ إِسْحَاقَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم فِي بَيْتِ أُمِّ سُلَيْمٍ، فَقُمْتُ وَيَتِيمٌ خَلْفَهُ، وَأُمُّ سُلَيْمٍ خَلْفَنَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 848,
                "hadithNumber": "872",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to offer the Fajr prayer when it was still dark and the believing women used to return (after finishing their prayer) and nobody could recognize them owing to darkness, or they could not recognize one another.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم صبح کی نماز منہ اندھیرے پڑھتے تھے ۔ مسلمانوں کی عورتیں جب ( نماز پڑھ کر ) واپس ہوتیں تو اندھیرے کی وجہ سے ان کی پہچان نہ ہوتی یا وہ ایک دوسری کو نہ پہچان سکتیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، کہا کہ ہم سے سعید بن منصور نے بیان کیا ، کہا کہ ہم سے فلیح بن سلیمان نے عبدالرحمٰن بن قاسم سے بیان کیا ، ان سے اس کے باپ ( قاسم بن محمد بن ابی بکر ) نے ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا فُلَيْحٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي الصُّبْحَ بِغَلَسٍ فَيَنْصَرِفْنَ نِسَاءُ الْمُؤْمِنِينَ، لاَ يُعْرَفْنَ مِنَ الْغَلَسِ، أَوْ لاَ يَعْرِفُ بَعْضُهُنَّ بَعْضًا‏.‏",
                "headingArabic": "سُرْعَةِ انْصِرَافِ النِّسَاءِ مِنَ الصُّبْحِ، وَقِلَّةِ مَقَامِهِنَّ فِي الْمَسْجِدِ",
                "headingUrdu": "فجر کی نماز کے فوراً بعد عورتوں کا واپس آنا اور ان کا مسجد میں تھوڑے وقت کے لیے ٹھہرنا",
                "headingEnglish": "Returning of the women immediately after the Fajr prayer and their staying in the mosque for a short period only",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 849,
                "hadithNumber": "873",
                "englishNarrator": "Narrated The father of Salim bin `Abdullah:",
                "hadithEnglish": "\"The Prophet (ﷺ) said, 'If the wife of any one of you asks permission (to go to the mosque) do not forbid her.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب تم میں سے کسی کی بیوی ( نماز پڑھنے کے لیے مسجد میں آنے کی ) اس سے اجازت مانگے تو شوہر کو چاہیے کہ اس کو نہ روکے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یزید بن زریع نے بیان کیا ، ان سے معمر نے ، ان سے زہری نے ، ان سے سالم بن عبداللہ بن عمر نے ، ان سے ان کے باپ نے ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ہے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ ‏ \"‏ إِذَا اسْتَأْذَنَتِ امْرَأَةُ أَحَدِكُمْ فَلاَ يَمْنَعْهَا ‏\"‏‏.‏",
                "headingArabic": "اسْتِئْذَانِ الْمَرْأَةِ زَوْجَهَا بِالْخُرُوجِ إِلَى الْمَسْجِدِ",
                "headingUrdu": "عورت اپنے شوہر سے مسجد جانے کی اجازت طلب کرے۔",
                "headingEnglish": "A women shall ask her husband's permission (on wishing) to go to the mosque.",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 850,
                "hadithNumber": "874",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) prayed in the house of Um Sulaim; and I, along with an orphan stood behind him while Um Sulaim  رضی اللہ عنہا (stood) behind us.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ( میری ماں ) ام سلیم کے گھر میں نماز پڑھائی ۔ میں اور یتیم مل کر آپ صلی اللہ علیہ وسلم کے پیچھے کھڑے ہوئے اور ام سلیم رضی اللہ عنہا ہمارے پیچھے تھیں ۔",
                "urduNarrator": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے ، ان سے حضرت انس رضی اللہ عنہ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ إِسْحَاقَ، عَنْ أَنَسٍ، قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم فِي بَيْتِ أُمِّ سُلَيْمٍ، فَقُمْتُ وَيَتِيمٌ خَلْفَهُ، وَأُمُّ سُلَيْمٍ خَلْفَنَا‏.‏",
                "headingArabic": "صَلاَةِ النِّسَاءِ خَلْفَ الرِّجَالِ",
                "headingUrdu": "عورتیں مردوں کے پیچھے نماز پڑھتی ہیں۔",
                "headingEnglish": "Women praying behind men",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 826,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=33",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=31",
                "label": "31",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=32",
                "label": "32",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=33",
                "label": "33",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=34",
                "label": "34",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=35",
                "label": "35",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=36",
                "label": "36",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=37",
                "label": "37",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=35",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=35",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=33",
        "to": 850,
        "total": 40465
    }
}