{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 270,
        "data": [
            {
                "id": 6731,
                "hadithNumber": "7015, 7016",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I saw in a dream a piece of silken cloth in my hand, and in whatever direction in Paradise I waved it, it flew, carrying me there. I narrated this (dream) to (my sister) Hafsa رضی اللہ عنہا  and she told it to the Prophet (ﷺ) who said, (to Hafsa رضی اللہ عنہا ), \"Indeed, your brother is a righteous man,\" or, \"Indeed, `Abdullah is a righteous man.\"",
                "hadithUrdu": "میں نے خواب میں دیکھا کہ گویا میرے ہاتھ میں ریشم کا ایک ٹکڑا ہے اور میں جنت میں جس جگہ جانا چاہتا ہوں وہ مجھے اڑا کر وہاں پہنچا دیتا ہے ۔ میں نے اس کا ذکر حضرت حفصہ رضی اللہ عنہا سے کیااور اس نے یہ بات رسول اللہ صلی اللہ علیہ وسلم سے کہی، آپ نے (حفصہ رضی اللہ عنہا سے) کہا، \"بے شک، تمہارا بھائی نیک آدمی ہے\" یا، \"بیشک عبداللہ صالح آدمی ہے۔\"",
                "urduNarrator": "ہم سے معلی بن اسد نے بیان کیا ‘ کہا ہم سے وہیب نے بیان کیا ‘ ان سے ایوب نے ‘ ان سے نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ فِي الْمَنَامِ كَأَنَّ فِي يَدِي سَرَقَةً مِنْ حَرِيرٍ لاَ أَهْوِي بِهَا إِلَى مَكَانٍ فِي الْجَنَّةِ إِلاَّ طَارَتْ بِي إِلَيْهِ، فَقَصَصْتُهَا عَلَى حَفْصَةَ‏. فَقَصَّتْهَا حَفْصَةُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ إِنَّ أَخَاكِ رَجُلٌ صَالِحٌ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ إِنَّ عَبْدَ اللَّهِ رَجُلٌ صَالِحٌ ‏\"‏‏.‏",
                "headingArabic": "الإِسْتَبْرَقِ وَدُخُولِ الْجَنَّةِ فِي الْمَنَامِ",
                "headingUrdu": "استبراق اور جنت میں داخل ہونا (خواب میں)",
                "headingEnglish": "Al-Istabraq and entering Paradise (in a dream)",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6732,
                "hadithNumber": "7017",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"When the Day of Resurrection approaches, the dreams of a believer will hardly fail to come true, and a dream of a believer is one of forty-six parts of prophetism, and whatever belongs to prothetism can never be false.\" Muhammad bin Seereen said, \"But I say this.\" He said, \"It used to be said, 'There are three types of dreams: The reflection of one's thoughts and experiences one has during wakefulness, what is suggested by Satan to frighten the dreamer, or glad tidings from Allah. So, if someone has a dream which he dislikes, he should not tell it to others, but get up and offer a prayer.\" He added, \"He (Abu Huraira رضی اللہ عنہ ) hated to see a Ghul (i.e., iron collar around his neck in a dream) and people liked to see fetters (on their feet in a dream). The fetters on the feet symbolizes one's constant and firm adherence to religion.\" And Abu `Abdullah said, \"Ghuls (iron collars) are used only for necks.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب قیامت قریب ہو گی تو مومن کا خواب جھوٹا نہیں ہو گا اور مومن کا خواب نبوت کے چھیالیس حصوں میں سے ایک حصہ ہے ۔ محمد بن سیرین رحمہ اللہ ( جو کہ علم تعبیر کے بہت بڑے عالم تھے ) نے کہا کہ نبوت کا حصہ جھوٹ نہیں ہو سکتا ۔ حضرت ابوہریرہ رضی اللہ عنہ کہتے تھے کہ خواب تین طرح کے ہیں ۔ دل کے خیالات ‘ شیطان کا ڈرانا اور اللہ کی طرف سے خوشخبری ۔ پس اگر کوئی شخص خواب میں بری چیز دیکھتا ہے تو اسے چاہئیے کہ اس کا ذکر کسی سے نہ کرے اور کھڑا ہو کر نماز پڑھنے لگے محمد بن سیرین نے کہا کہ حضرت ابوہریرہ رضی اللہ عنہ خواب میں طوق کو ناپسند کرتے تھے اور قید دیکھنے کو اچھا سمجھتے تھے اور کہا گیا ہے کہ قید سے مراد دین میں ثابت قدمی ہے ۔ اور قتادہ ‘ یونس ‘ ہشام اور ابوہلال نے ابن سیرین سے نقل کیا ہے ‘ انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ‘ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ۔ اور بعض نے یہ ساری روایت حدیث میں شمار کی ہے لیکن عوف کی روایت زیادہ واضح ہے اور یونس نے کہا کہ قید کے بارے میں روایت کو میں نبی کریم صلی اللہ علیہ وسلم کی حدیث ہی سمجھتا ہوں ۔ ابوعبداللہ حضرت امام بخاری نے کہا کہ طوق ہمیشہ گردنوں ہی میں ہوتے ہیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن صباح نے بیان کیا ‘ انہوں نے کہا ہم سے معتمر نے بیان کیا ‘ انہوں نے کہا میں نے عوف سے سنا ‘ ان سے محمد بن سیرین نے بیان کیا ‘ انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ‘ انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَبَّاحٍ، حَدَّثَنَا مُعْتَمِرٌ، سَمِعْتُ عَوْفًا، حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا اقْتَرَبَ الزَّمَانُ لَمْ تَكَدْ تَكْذِبُ رُؤْيَا الْمُؤْمِنِ، وَرُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ‏.‏ ‏\"‏ قَالَ مُحَمَّدٌ وَأَنَا أَقُولُ هَذِهِ قَالَ وَكَانَ يُقَالُ الرُّؤْيَا ثَلاَثٌ حَدِيثُ النَّفْسِ، وَتَخْوِيفُ الشَّيْطَانِ، وَبُشْرَى مِنَ اللَّهِ، فَمَنْ رَأَى شَيْئًا يَكْرَهُهُ فَلاَ يَقُصُّهُ عَلَى أَحَدٍ، وَلْيَقُمْ فَلْيُصَلِّ‏.‏ قَالَ وَكَانَ يُكْرَهُ الْغُلُّ فِي النَّوْمِ، وَكَانَ يُعْجِبُهُمُ الْقَيْدُ، وَيُقَالُ الْقَيْدُ ثَبَاتٌ فِي الدِّينِ‏.‏ وَرَوَى قَتَادَةُ وَيُونُسُ وَهِشَامٌ وَأَبُو هِلاَلٍ عَنِ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَأَدْرَجَهُ بَعْضُهُمْ كُلَّهُ فِي الْحَدِيثِ، وَحَدِيثُ عَوْفٍ أَبْيَنُ‏.‏ وَقَالَ يُونُسُ لاَ أَحْسِبُهُ إِلاَّ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الْقَيْدِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ لاَ تَكُونُ الأَغْلاَلُ إِلاَّ فِي الأَعْنَاقِ‏.‏",
                "headingArabic": "الْقَيْدِ فِي الْمَنَامِ",
                "headingUrdu": "(دیکھنا) اپنے آپ کو خواب میں قید کرنا",
                "headingEnglish": "(Seeing) oneself fettered in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6733,
                "hadithNumber": "7018",
                "englishNarrator": "Narrated Kharija bin Zaid bin Thabit:",
                "hadithEnglish": "Um Al-`Ala an Ansari رضی اللہ عنہا woman who had given the Pledge of allegiance to Allah's Messenger (ﷺ) said, \"`Uthman bin Maz'un رضی اللہ عنہا came in our share when the Ansars drew lots to distribute the emigrants (to dwell) among themselves, He became sick and we looked after (nursed) him till he died. Then we shrouded him in his clothes. Allah's Messenger (ﷺ) came to us, I (addressing the dead body) said, \"May Allah's Mercy be on you, O Aba As-Sa'ib! I testify that Allah has honored you.\" The Prophet (ﷺ) said, 'How do you know that?' I replied, 'I do not know, by Allah.' He said, 'As for him, death has come to him and I wish him all good from Allah. By Allah, though I am Allah's Messenger (ﷺ), I neither know what will happen to me, nor to you.'\" Um Al-`Ala said, \"By Allah, I will never attest the righteousness of anybody after that.\" She added, \"Later I saw in a dream, a flowing spring for `Uthman رضی اللہ عنہا `. So I went to Allah's Messenger (ﷺ) and mentioned that to him. He said, 'That is (the symbol of) his good deeds (the reward for) which is going on for him.' \"",
                "hadithUrdu": "حضرت ام علاء رضی اللہ عنہا نے بیان کیا جو انہیں کی ایک خاتون ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی تھی ۔ انہوں نے بیان کیا کہ جب انصار نے مہاجرین کے قیام کے لیے قرعہ اندازی کی تو حضرت عثمان بن مظعون رضی اللہ عنہ کا نام ہمارے یہاں ٹھہرنے کے لیے نکلا ۔ پھر وہ بیمار پڑ گئے ‘ ہم نے ان کی تیمارداری کی لیکن ا ن کی وفات ہو گئی ۔ پھر ہم نے انہیں ان کے کپڑوں میں لپیٹ دیا ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم ہمارے گھر تشریف لائے تو میں نے کہا ابو السائب ! تم پر اللہ کی رحمتیں ہوں ‘ میری گواہی ہے کہ تمہیں اللہ تعالیٰ نے عزت بخشی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تمہیں یہ کیسے معلوم ہوا ؟ میں نے عرض کیا اللہ کی قسم مجھے معلوم نہیں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس کے بعد فرمایا کہ جہاں تک ان کا تعلق ہے تو یقینی بات ( موت ) ان تک پہنچ چکی ہے اور میں اللہ سے ان کے لیے خیر کی امید رکھتا ہوں لیکن اللہ کی قسم میں رسول اللہ ہوں اور اس کے باوجود مجھے معلوم نہیں کہ میرے ساتھ کیا معاملہ کیا جائے گا ۔ ام العلاء نے کہا کہ واللہ ! اس کے بعد میں کسی انسان کی پاکی نہیں بیان کروں گی ۔ انہوں نے بیان کیا کہ میں نے حضرت عثمان رضی اللہ عنہ کے لیے خواب میں ایک جاری چشمہ دیکھا تھا ۔ چنانچہ میں نے حاضر ہو آنحضرت صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ نے فرمایا کہ یہ ان کا نیک عمل ہے جس کا ثواب ان کے لیے جاری ہے ۔",
                "urduNarrator": "ہم سے عبد ان نے بیان کیا ‘ کہا ہم کو عبداللہ نے خبر دی ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں زہری نے ‘ انہیں خارجہ بن زید بن ثابت نے اور ان سے",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ، عَنْ أُمِّ الْعَلاَء ِ ـ وَهْىَ امْرَأَةٌ مِنْ نِسَائِهِمْ بَايَعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم ـ قَالَتْ طَارَ لَنَا عُثْمَانُ بْنُ مَظْعُونٍ فِي السُّكْنَى حِينَ اقْتَرَعَتِ الأَنْصَارُ عَلَى سُكْنَى الْمُهَاجِرِينَ، فَاشْتَكَى فَمَرَّضْنَاهُ حَتَّى تُوُفِّيَ، ثُمَّ جَعَلْنَاهُ فِي أَثْوَابِهِ فَدَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ رَحْمَةُ اللَّهِ عَلَيْكَ أَبَا السَّائِبِ، فَشَهَادَتِي عَلَيْكَ لَقَدْ أَكْرَمَكَ اللَّهُ‏.‏ قَالَ ‏\"‏ وَمَا يُدْرِيكِ ‏\"‏‏.‏ قُلْتُ لاَ أَدْرِي وَاللَّهِ‏.‏ قَالَ ‏\"‏ أَمَّا هُوَ فَقَدْ جَاءَهُ الْيَقِينُ، إِنِّي لأَرْجُو لَهُ الْخَيْرَ مِنَ اللَّهِ، وَاللَّهِ مَا أَدْرِي وَأَنَا رَسُولُ اللَّهِ مَا يُفْعَلُ بِي وَلاَ بِكُمْ ‏\"‏‏.‏ قَالَتْ أُمُّ الْعَلاَءِ فَوَاللَّهِ لاَ أُزَكِّي أَحَدًا بَعْدَهُ‏.‏ قَالَتْ وَرَأَيْتُ لِعُثْمَانَ فِي النَّوْمِ عَيْنًا تَجْرِي، فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ ‏\"‏ ذَاكِ عَمَلُهُ يَجْرِي لَهُ ‏\"‏",
                "headingArabic": "الْعَيْنِ الْجَارِيَةِ فِي الْمَنَامِ",
                "headingUrdu": "(دیکھنا) خواب میں بہتا ہوا چشمہ",
                "headingEnglish": "(Seeing) a flowing spring in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6734,
                "hadithNumber": "7019",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"(I saw in a dream that) while I was standing at a well and drawing water therefrom, suddenly Abu Bakr and `Umar came to me. Abu Bakr took the bucket and drew one or two buckets (full of water), but there was weakness in his pulling, but Allah forgave him. Then Ibn Al- Khattab took the bucket from Abu Bakr's hand and the bucket turned into a very large one in his hand. I have never seen any strong man among the people doing such a hard job as `Umar did, till (the people drank to their satisfaction) and water their camels to their fill and they sat near the water.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ( خواب میں ) میں ایک کنویں سے پانی کھینچ رہا تھا کہ حضرت ابوبکر اور عمر بھی آ گئے ۔ اب ابوبکرنے ڈول لے لیا اور ایک یا دو ڈول پانی کھینچا ۔ ان کے کھینچنے میں کمزوری تھی ۔ اللہ تعالیٰ ان کی مغفرت کرے آمین ۔ اس کے بعد عمر بن الخطاب نے اسے ابوبکر کے ہاتھ سے لے لیا اور وہ ڈول ان کے ہاتھ میں بڑا ڈول بن گیا ۔ میں نے عمر جیسا پانی کھینچنے میں کسی کو ماہر نہیں دیکھا ۔ انہوں نے خوب پانی نکالا یہاں تک کہ لوگوں نے اونٹوں کے لیے پانی سے حوض بھرلیے ۔",
                "urduNarrator": "ہم سے یعقوب بن ابراہیم بن کثیر نے بیان کیا ، کہا ہم سے شعیب بن حرب نے بیان کیا ، کہا ہم سے صخربن جویریہ نے بیان کیا ، کہا ہم سے نافع نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ كَثِيرٍ، حَدَّثَنَا شُعَيْبُ بْنُ حَرْبٍ، حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، حَدَّثَنَا نَافِعٌ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ حَدَّثَهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بَيْنَا أَنَا عَلَى بِئْرٍ أَنْزِعُ مِنْهَا إِذْ جَاءَ أَبُو بَكْرٍ وَعُمَرُ، فَأَخَذَ أَبُو بَكْرٍ الدَّلْوَ، فَنَزَعَ ذَنُوبًا أَوْ ذَنُوبَيْنِ، وَفِي نَزْعِهِ ضَعْفٌ، فَغَفَرَ اللَّهُ لَهُ، ثُمَّ أَخَذَهَا ابْنُ الْخَطَّابِ مِنْ يَدِ أَبِي بَكْرٍ فَاسْتَحَالَتْ فِي يَدِهِ غَرْبًا، فَلَمْ أَرَ عَبْقَرِيًّا مِنَ النَّاسِ يَفْرِي فَرْيَهُ، حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ ‏\"‏‏.‏",
                "headingArabic": "نَزْعِ الْمَاءِ مِنَ الْبِئْرِ حَتَّى يَرْوَى النَّاسُ",
                "headingUrdu": "کنویں سے پانی نکالنا",
                "headingEnglish": "Drawing water from a well",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6735,
                "hadithNumber": "7020",
                "englishNarrator": "Narrated Salim's father:",
                "hadithEnglish": "Dream of the prophet which is about Hadrat Abu Bakr and Hadrat Umer رضی اللہ عنہما . The prophet ﷺ said: I saw the people assembled, so Hadrat Abu Bakr رضی اللہ عنہ got up and he drew one bucketful or two and there was a bit weakness in his drawing water for which Allah will pardon him. Ibn-e-Khattab رضی اللہ عنہ then got up and that bucket turned into a huge bucket in his hand. I have never seen any such a stout man amongst the people drawing water out as he did, until the people got their camels satiated and then made them kneel down at the place where they rest.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے حضرت ابوبکرو عمر رضی اللہ عنہما کے خواب کے سلسلے میں فرمایا کہ میں نے لوگوں کو دیکھا کہ جمع ہو گئے ہیں پھر حضرت ابوبکر رضی اللہ عنہ کھڑے ہوئے اور ایک یا دو ڈول پانی کھینچا اور ان کے کھینچنے میں کمزوری تھی ، اللہ ان کی مغفرت کرے ۔ پھر حضرت عمر بن خطاب رضی اللہ عنہ کھڑے ہوئے اور وہ بڑا ڈول بن گیا ۔ میں نے لوگوں میں سے کسی کو اتنی مہارت کے ساتھ پانی نکالتے نہیں دیکھا یہاں تک کہ لوگوں نے حوض بھرلیے ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، کہا ہم سے موسیٰ نے بیان کیا ، ان سے سالم نے ، ان سے ان کے والد نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مُوسَى، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنْ رُؤْيَا النَّبِيِّ، صلى الله عليه وسلم فِي أَبِي بَكْرٍ وَعُمَرَ قَالَ ‏ \"‏ رَأَيْتُ النَّاسَ اجْتَمَعُوا فَقَامَ أَبُو بَكْرٍ فَنَزَعَ ذَنُوبًا أَوْ ذَنُوبَيْنِ، وَفِي نَزْعِهِ ضَعْفٌ وَاللَّهُ يَغْفِرُ لَهُ، ثُمَّ قَامَ ابْنُ الْخَطَّابِ، فَاسْتَحَالَتْ غَرْبًا فَمَا رَأَيْتُ مِنَ النَّاسِ يَفْرِي فَرْيَهُ، حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ ‏\"‏‏.‏",
                "headingArabic": "نَزْعِ الذَّنُوبِ وَالذَّنُوبَيْنِ مِنَ الْبِئْرِ بِضَعْفٍ",
                "headingUrdu": "کنویں سے ایک یا دو بالٹیاں پانی نکالنا",
                "headingEnglish": "Drawing one or two buckets of water from a well",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6736,
                "hadithNumber": "7021",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"While I was sleeping, I saw myself standing at a well over which there was a bucket. I pulled out from it as many buckets of water as Allah wished, and then Ibn Abi Quhafa (Abu Bakr) took the bucket from me and pulled out one or two full buckets, and there was weakness in his pull--may Allah forgive him. Then the bucket turned into a very large one and `Umar bin Al-Khattab took it. I have never seen any strong man among the people, drawing water with such strength as `Umar did, till the people (drank to their satisfaction and) watered their camels to their fill; whereupon the camels sat beside the water.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میں سویا ہوا تھا کہ میں نے اپنے آپ کو ایک کنویں پر دیکھا ۔ اس پر ایک ڈول تھا ۔ جتنا اللہ نے چاہا میں نے اس میں سے پانی کھینچا ، پھر اس ڈول کو ابن ابی قحافہ نے لے لیا اور انہوں نے بھی ایک یا دو ڈول کھینچنے اور ان کے کھینچنے میں کمزوری تھی ، اللہ ان کی مغفرت کرے پھر وہ بڑا ڈول بن گیا اور اسے عمر بن خطاب نے اٹھا لیا ۔ میں نے کسی ماہر کو عمر بن خطاب کی طرح کھینچتے نہیں دیکھا یہاں تک کہ انہوں نے لوگوں کے لیے اونٹوں کے حوض بھر دئیے ۔ لوگوں نے اپنے اونٹوں کو سیراب کر کے اپنے تھانوں پر لے جا کر بیٹھا دیا ۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، کہا کہ مجھ سے عقیل نے بیان کیا ، ان سے ابن شہاب نے ، انہیں سعید نے خبر دی ، انہیں حضرت ابوہریرہ رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَعِيدٌ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي عَلَى قَلِيبٍ وَعَلَيْهَا دَلْوٌ، فَنَزَعْتُ مِنْهَا مَا شَاءَ اللَّهُ، ثُمَّ أَخَذَهَا ابْنُ أَبِي قُحَافَةَ فَنَزَعَ مِنْهَا ذَنُوبًا أَوْ ذَنُوبَيْنِ، وَفِي نَزْعِهِ ضَعْفٌ وَاللَّهُ يَغْفِرُ لَهُ، ثُمَّ اسْتَحَالَتْ غَرْبًا، فَأَخَذَهَا عُمَرُ بْنُ الْخَطَّابِ، فَلَمْ أَرَ عَبْقَرِيًّا مِنَ النَّاسِ يَنْزِعُ نَزْعَ عُمَرَ بْنِ الْخَطَّابِ، حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6737,
                "hadithNumber": "7022",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"While I was sleeping, I saw myself standing over a tank (well) giving water to the people to drink. Then Abu Bakr came to me and took the bucket from me in order to relieve me and he pulled out one or two full buckets, and there was weakness in his pulling --may Allah forgive him. Then Ibn Al-Khattab took it from him and went on drawing water till the people left (after being satisfied) while the tank was over flowing with water.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میں سویا ہوا تھا کہ میں نے خواب دیکھا کہ میں حوض پر ہوں اور لوگوں کو سیراب کر رہا ہوں پھر میرے پاس ابوبکر آئے اور مجھے آرام دینے کے لیے ڈول میرے ہاتھ سے لے لیا پھر انہوں نے دو ڈول کھینچے ان کے کھینچنے میں کمزوری تھی ، اللہ ان کی مغفرت کرے ۔ پھر عمر بن خطاب آئے اور ان سے ڈول لے لیا اور برابر کھینچے رہے یہاں تک کہ لوگ سیراب ہو کر چل دئیے اور حوض سے پانی لبالب ابل رہا تھا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، کہا ہمیں عبدالرزاق نے خبر دی ، ان سے معمر نے ، ان سے ہمام نے انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُ أَنِّي عَلَى حَوْضٍ أَسْقِي النَّاسَ، فَأَتَانِي أَبُو بَكْرٍ فَأَخَذَ الدَّلْوَ مِنْ يَدِي لِيُرِيحَنِي، فَنَزَعَ ذَنُوبَيْنِ وَفِي نَزْعِهِ ضَعْفٌ وَاللَّهُ يَغْفِرُ لَهُ، فَأَتَى ابْنُ الْخَطَّابِ فَأَخَذَ مِنْهُ، فَلَمْ يَزَلْ يَنْزِعُ، حَتَّى تَوَلَّى النَّاسُ وَالْحَوْضُ يَتَفَجَّرُ ‏\"‏‏.‏",
                "headingArabic": "الاِسْتِرَاحَةِ فِي الْمَنَامِ",
                "headingUrdu": "خواب میں آرام کرنا",
                "headingEnglish": "To take rest in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6738,
                "hadithNumber": "7023",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "We were sitting with Allah's Messenger (ﷺ), he said, \"While I was sleeping, I saw myself in Paradise. Suddenly I saw a woman performing ablution beside a palace. I asked, \"For whom is this palace?\" They (the angels) replied, \"It is for `Umar bin Al-Khattab رضی اللہ عنہ .\" Then I remembered `Umar's ghira and went back hurriedly.\" On hearing that, `Umar رضی اللہ عنہ started weeping and said, \" Let my father and mother be sacrificed for you. O Allah's Messenger (ﷺ)! How dare I think of my Ghira being offended by you?",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے تھے کہ آپ نے فرمایا میں سویا ہوا تھا کہ میں نے اپنے آپ کو جنت میں دیکھا ۔ میں نے دیکھا کہ جنت کے محل کے ایک کنارے ایک عورت وضو کر رہی ہے ۔ میں نے پوچھا ، یہ محل کس کا ہے ؟ بتایا کہ عمر بن خطاب رضی اللہ عنہ کا ۔ پھر میں نے ان کی غیرت کو یاد کی اور وہاں سے لوٹ گیا ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ حضرت عمر بن خطاب رضی اللہ عنہ اس پر روپڑے اور عرض کیا یا رسول اللہ ! میرے ماں باپ آپ صلی اللہ علیہ وسلم پر قربان ہوں ، کیا میں آپ پر غیرت کروں گا ؟",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، کہا مجھ سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا کہ مجھے سعید بن مسیب نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنِي اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ بَيْنَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي فِي الْجَنَّةِ، فَإِذَا امْرَأَةٌ تَتَوَضَّأُ إِلَى جَانِبِ قَصْرٍ، قُلْتُ لِمَنْ هَذَا الْقَصْرُ قَالُوا لِعُمَرَ بْنِ الْخَطَّابِ‏.‏ فَذَكَرْتُ غَيْرَتَهُ فَوَلَّيْتُ مُدْبِرًا ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَبَكَى عُمَرُ بْنُ الْخَطَّابِ ثُمَّ قَالَ أَعَلَيْكَ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ أَغَارُ",
                "headingArabic": "الْقَصْرِ فِي الْمَنَامِ",
                "headingUrdu": "خواب میں ایک جگہ",
                "headingEnglish": "A place in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6739,
                "hadithNumber": "7024",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said: (I saw in a dream that) I entered Paradise, and behold, there was a palace built of gold! I asked, 'For whom is this palace?' They (the angels) replied, 'For a man from the Quraish.' \" The Prophet added, \"O Ibn Al-Khattab! Nothing stopped me from entering it except your Ghira.\" `Umar رضی اللہ عنہ said, \"How dare I think of my Ghira being offended by you, O Allah's Messenger (ﷺ)?\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میں جنت میں داخل ہوا تو وہاں ایک سونے کا محل مجھے نظرآیا ۔ میں نے پوچھا یہ کس کا ہے ؟ کہا کہ قریش کے ایک شخص کا ۔ اے ابن الخطاب ! مجھے اس کے اندر جانے سے تمہاری غیرت نے روک دیا ہے جسے میں خوب جانتا ہوں ۔ حضرت عمر رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! کیا میں آپ پر غیرت کروں گا ۔",
                "urduNarrator": "ہم سے عمرو بن علی نے بیان کیا ، انہوں نے کہا ہم سے معتمر بن سلیمان نے بیان کیا ، ان سے عبیداللہ بن عمر نے بیان کیا ، ان سے محمد بن منکدر نے اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ دَخَلْتُ الْجَنَّةَ فَإِذَا أَنَا بِقَصْرٍ مِنْ ذَهَبٍ، فَقُلْتُ لِمَنْ هَذَا فَقَالُوا لِرَجُلٍ مِنْ قُرَيْشٍ‏.‏ فَمَا مَنَعَنِي أَنْ أَدْخُلَهُ يَا ابْنَ الْخَطَّابِ إِلاَّ مَا أَعْلَمُ مِنْ غَيْرَتِكَ ‏\"‏‏.‏ قَالَ وَعَلَيْكَ أَغَارُ يَا رَسُولَ اللَّهِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6740,
                "hadithNumber": "7025",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "We were sitting with Allah's Messenger (ﷺ) he said, \"While I was sleeping, I saw myself in Paradise, and behold, a woman was performing ablution by the side of a palace. I asked, 'For whom is this palace?' They replied, 'For `Umar' Then I remembered the Ghira of `Umar رضی اللہ عنہ and returned immediately.\" `Umar رضی اللہ عنہ wept (on hearing that) and said, \" Let my father and mother be sacrificed for you, O Allah's Messenger (ﷺ)! How dare I think of my Ghira being offended by you.'",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا میں سویا ہوا تھا کہ میں نے اپنے آپ کو جنت میں دیکھا وہاں ایک عورت ایک محل کے کنارے وضو کر رہی تھی ۔ میں نے پوچھا یہ محل کس کا ہے ؟ کہا عمر رضی اللہ عنہ کا ۔ پھر میں نے ان کی غیرت یاد کی اور وہاں سے لوٹ کر چلا آیا ۔ اس پر حضرت عمر رضی اللہ عنہ رو دئیے اور عرض کیا یا رسول اللہ ! میرے ماں باپ آپ پر فدا ہوں ، کیا آپ پر غیرت کروں گا ۔",
                "urduNarrator": "مجھ سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، انہیں سعید بن مسیب نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ بَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي فِي الْجَنَّةِ، فَإِذَا امْرَأَةٌ تَتَوَضَّأُ إِلَى جَانِبِ قَصْرٍ، فَقُلْتُ لِمَنْ هَذَا الْقَصْرُ فَقَالُوا لِعُمَرَ‏.‏ فَذَكَرْتُ غَيْرَتَهُ فَوَلَّيْتُ مُدْبِرًا ‏\"‏‏.‏ فَبَكَى عُمَرُ وَقَالَ عَلَيْكَ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ أَغَارُ",
                "headingArabic": "الْوُضُوءِ فِي الْمَنَامِ",
                "headingUrdu": "خواب میں وضو کرنا",
                "headingEnglish": "Performing ablution in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6741,
                "hadithNumber": "7026",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"While I was sleeping, I saw myself performing the Tawaf of the Ka`ba. Behold, there I saw a whitish-red lank-haired man (holding himself) between two men with water dropping from his hair. I asked, 'Who is this?' The people replied, 'He is the son of Mary.' Then I turned my face to see another man with red complexion, big body, curly hair, and blind in the right eye which looked like a protruding out grape. I asked, 'Who is he?' They replied, 'He is Ad-Dajjal.' Ibn Qatan resembles him more than anybody else among the people and Ibn Qatan was a man from Bani Al-Mustaliq from Khuza`a.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میں سویا ہوا تھا کہ میں نے اپنے آپ کو کعبہ کا طواف کرتے دیکھا ۔ اچانک ایک صاحب نظر آئے ، گندم گوں بال لٹکے ہوئے تھے اور دو آدمیوں کے درمیان ( سہارا لیے ہوئے تھے ) ان کے سر سے پانی ٹپک رہا تھا ۔ میں نے پوچھا یہ کون ہیں ؟ کہا کہ عیسیٰ ابن مریم علیہ السلام ، پھر میں مڑا تو ایک دوسرا شخص سرخ ، بھاری جسم والا ، گھنگریالے بال والا اور ایک آنکھ سے کانا جیسے اس کی آنکھ پر خشک انگور ہو نظر آیا ۔ میں نے پوچھا یہ کون ہیں ؟ کہا کہ یہ دجال ہے ۔ اس کی صورت عبدالعزیٰ بن قطن سے بہت ملتی تھی ۔ یہ عبدالعزیٰ بن قطن مطلق میں تھا جو خزاعہ قبیلہ کی ایک شاخ ہے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے خبر دی ، انہیں سالم بن عبداللہ ابن عمر نے خبر دی ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي أَطُوفُ بِالْكَعْبَةِ فَإِذَا رَجُلٌ آدَمُ سَبْطُ الشَّعَرِ بَيْنَ رَجُلَيْنٍ يَنْطِفُ رَأْسُهُ مَاءً، فَقُلْتُ مَنْ هَذَا قَالُوا ابْنُ مَرْيَمَ‏.‏ فَذَهَبْتُ أَلْتَفِتُ فَإِذَا رَجُلٌ أَحْمَرُ جَسِيمٌ جَعْدُ الرَّأْسِ أَعْوَرُ الْعَيْنِ الْيُمْنَى، كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ، قُلْتُ مَنْ هَذَا قَالُوا هَذَا الدَّجَّالُ‏.‏ أَقْرَبُ النَّاسِ بِهِ شَبَهًا ابْنُ قَطَنٍ ‏\"‏‏.‏ وَابْنُ قَطَنٍ رَجُلٌ مِنْ بَنِي الْمُصْطَلِقِ مِنْ خُزَاعَةَ‏.‏",
                "headingArabic": "الطَّوَافِ بِالْكَعْبَةِ فِي الْمَنَامِ",
                "headingUrdu": "خواب میں خانہ کعبہ کا طواف کرنا",
                "headingEnglish": "Tawaf around the Ka'bah in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6742,
                "hadithNumber": "7027",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"While I was sleeping, I saw a bowl full of milk was brought to me and I drank of it (to my fill) till I noticed its wetness flowing (in my body). Then I gave the remaining of it to `Umar.\" They asked, \"O Allah's Messenger (ﷺ)! What have you interpreted (about the dream)? He said, \"(It is Religious) knowledge.\" (See Hadith No. 134)",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے بیان کیا کہ میں سویا ہوا تھا کہ دودھ کا ایک پیالہ میرے پاس لایا گیا اور اس میں سے اتنا پیا کہ سیرابی کو میں نے ہر رگ وپے میں پایا ۔ پھر میں نے اپنا بچا ہوا دودھ عمر کو دے دیا ۔ لوگوں نے پوچھا کہ اے اللہ کے رسول ! آپ نے اس کی تعبیر کیا کی ؟ فرمایا کہ علم اس کی تعبیر ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، انہیں حمزہ بن عبداللہ بن عمر نے خبر دی کہ حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ فَشَرِبْتُ مِنْهُ، حَتَّى إِنِّي لأَرَى الرِّيَّ يَجْرِي، ثُمَّ أَعْطَيْتُ فَضْلَهُ عُمَرَ ‏\"‏‏.‏ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْعِلْمُ ‏\"‏‏.‏",
                "headingArabic": "جَرِّ الْقَمِيصِ فِي الْمَنَامِ",
                "headingUrdu": "خواب میں زمین پر گھسیٹنا",
                "headingEnglish": "Dragging on the ground in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6743,
                "hadithNumber": "7028, 7029",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Men from the companions of Allah's Messenger (ﷺ) used to see dreams during the lifetime of Allah's Messenger (ﷺ) and they used to narrate those dreams to Allah's Messenger (ﷺ). Allah's Messenger (ﷺ) would interpret them as Allah wished. I was a young man and used to stay in the mosque before my wedlock. I said to myself, \"If there were any good in myself, I too would see what these people see.\" So when I went to bed one night, I said, \"O Allah! If you see any good in me, show me a good dream.\" So while I was in that state, there came to me (in a dream) two angels. In the hand of each of them, there was a mace of iron, and both of them were taking me to Hell, and I was between them, invoking Allah, \"O Allah! I seek refuge with You from Hell.\" Then I saw myself being confronted by another angel holding a mace of iron in his hand. He said to me, \"Do not be afraid, you will be an excellent man if you only pray more often.\" So they took me till they stopped me at the edge of Hell, and behold, it was built inside like a well and it had side posts like those of a well, and beside each post there was an angel carrying an iron mace. I saw therein many people hanging upside down with iron chains, and I recognized therein some men from the Quraish. Then (the angels) took me to the right side.I narrated this dream to (my sister) Hafsa رضی اللہ عنہا and she told it to Allah's Messenger (ﷺ). Allah's Messenger (ﷺ) said, \"No doubt, `Abdullah is a good man.\" (Nafi` said, \"Since then `Abdullah bin `Umar رضی اللہ عنہما used to pray much.)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے صحابہ میں سے کچھ لوگ آنحضرت صلی اللہ علیہ وسلم کے عہد میں خواب دیکھتے تھے اور اسے آنحضرت صلی اللہ علیہ وسلم سے بیان کرتے تھے ، آنحضرت صلی اللہ علیہ وسلم اس کی تعبیر دیتے جیسا کہ اللہ چاہتا ۔ میں اس وقت نوعمر تھا اور میرا گھر مسجد تھی یہ میری شادی سے پہلے کی بات ہے ۔ میں نے اپنے دل میں سوچا کہ اگر تجھ میں کوئی خیرہوتی تو تو بھی ان لوگوں کی طرح خواب دیکھتا ۔ چنانچہ جب میں ایک رات لیٹا تو میں نے کہا اے اللہ ! اگر تو میرے اندر کوئی خیروبھلائی جانتا ہے تو مجھے کوئی خواب دکھا ۔ میں اسی حال میں ( سوگیا اور میں نے دیکھا کہ ) میرے پاس دو فرشتے آئے ، ان میں سے ہر ایک کے ہاتھ میں لوہے کا ہتھوڑا تھا اور وہ مجھے جہنم کی طرف لے چلے ۔ میں ان دونوں فرشتوں کے درمیان میں تھا اور اللہ سے دعا کرتا جا رہا تھا کہ اے اللہ ! میں جہنم سے تیری پناہ مانگتا ہوں پھر مجھے دکھایا گیا ( خواب ہی میں ) کہ مجھ سے ایک اور فرشتہ ملا جس کے ہاتھ میں لوہے کا ایک ہتھوڑا تھا اور اس نے کہا ڈرونہیں تم کتنے اچھے آدمی ہو اگر تم نماز زیادہ پڑھتے ۔ چنانچہ وہ مجھے لے کر چلے اور جہنم کے کنارے پر لے جا کر مجھے کھڑا کر دیا تو جہنم ایک گول کنویں کی طرح تھی اور کنویں کے مٹکوں کی طرح اس کے بھی مٹکے تھے اور ہر دو مٹکوں کے درمیان ایک فرشتہ تھا ۔ جس کے ہاتھ میں لوہے کا ایک ہتھوڑا تھا اور میں نے اس میں کچھ لوگ دیکھے جنہیں زنجیروں میں لٹکا دیا گیا تھا اور ان کے سر نیچے تھے ۔ ( اور پاؤں اوپر ) ان میں سے بعض قریش کے لوگوں کو میں نے پہچانا بھی ۔ پھر وہ مجھے دائیں طرف لے کر چلے ۔بعد میں میں نے اس کا ذکر اپنی بہن حفصہ رضی اللہ عنہا سے کیا اور انہوں نے آنحضرت صلی اللہ علیہ وسلم سے ، آنحضرت صلی اللہ علیہ وسلم نے یہ ( سن کر ) فرمایا ۔ عبداللہ مرد نیک ہے ۔ ( اگر رات کو تہجد پڑھتا ہوتا ) نافع کہتے ہیں کہ عبداللہ بن عمر رضی اللہ عنہما نے جب سے یہ خواب دیکھا وہ نفل نماز بہت پڑھا کرتے تھے ۔ مٹکے جن پر موٹھ کی لکڑیاں کھڑی کرتے ہیں ۔",
                "urduNarrator": "مجھ سے عبیداللہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے عفان بن مسلم نے بیان کیا ، انہوں نے کہا ہم سے صخر بن جویریہ نے بیان کیا ، انہوں نے کہا ہم سے نافع نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، حَدَّثَنَا نَافِعٌ، أَنَّ ابْنَ عُمَرَ، قَالَ إِنَّ رِجَالاً مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم كَانُوا يَرَوْنَ الرُّؤْيَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَقُصُّونَهَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَقُولُ فِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَا شَاءَ اللَّهُ، وَأَنَا غُلاَمٌ حَدِيثُ السِّنِّ وَبَيْتِي الْمَسْجِدُ قَبْلَ أَنْ أَنْكِحَ، فَقُلْتُ فِي نَفْسِي لَوْ كَانَ فِيكَ خَيْرٌ لَرَأَيْتَ مِثْلَ مَا يَرَى هَؤُلاَءِ‏.‏ فَلَمَّا اضْطَجَعْتُ لَيْلَةً قُلْتُ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ فِيَّ خَيْرًا فَأَرِنِي رُؤْيَا‏.‏ فَبَيْنَمَا أَنَا كَذَلِكَ إِذْ جَاءَنِي مَلَكَانِ فِي يَدِ كُلِّ وَاحِدٍ مِنْهُمَا مَقْمَعَةٌ مِنْ حَدِيدٍ، يُقْبِلاَ بِي إِلَى جَهَنَّمَ، وَأَنَا بَيْنَهُمَا أَدْعُو اللَّهَ اللَّهُمَّ أَعُوذُ بِكَ مِنْ جَهَنَّمَ‏.‏ ثُمَّ أُرَانِي لَقِيَنِي مَلَكٌ فِي يَدِهِ مِقْمَعَةٌ مِنْ حَدِيدٍ فَقَالَ لَنْ تُرَاعَ، نِعْمَ الرَّجُلُ أَنْتَ لَوْ تُكْثِرُ الصَّلاَةَ‏.‏ فَانْطَلَقُوا بِي حَتَّى وَقَفُوا بِي عَلَى شَفِيرِ جَهَنَّمَ فَإِذَا هِيَ مَطْوِيَّةٌ كَطَىِّ الْبِئْرِ، لَهُ قُرُونٌ كَقَرْنِ الْبِئْرِ، بَيْنَ كُلِّ قَرْنَيْنِ مَلَكٌ بِيَدِهِ مِقْمَعَةٌ مِنْ حَدِيدٍ، وَأَرَى فِيهَا رِجَالاً مُعَلَّقِينَ بِالسَّلاَسِلِ، رُءُوسُهُمْ أَسْفَلَهُمْ، عَرَفْتُ فِيهَا رِجَالاً مِنْ قُرَيْشٍ، فَانْصَرَفُوا بِي عَنْ ذَاتِ الْيَمِينِ‏.فَقَصَصْتُهَا عَلَى حَفْصَةَ فَقَصَّتْهَا حَفْصَةُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ عَبْدَ اللَّهِ رَجُلٌ صَالِحٌ ‏\"‏‏.‏ فَقَالَ نَافِعٌ لَمْ يَزَلْ بَعْدَ ذَلِكَ يُكْثِرُ الصَّلاَةَ‏.‏",
                "headingArabic": "الأَمْنِ وَذَهَابِ الرَّوْعِ فِي الْمَنَامِ",
                "headingUrdu": "تحفظ کا احساس اور خواب میں خوف کا غائب ہونا",
                "headingEnglish": "The feeling of security and the disappearance of fear in dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6744,
                "hadithNumber": "7030, 7031",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I was a young unmarried man during the lifetime of the Prophet. I used to sleep in the mosque. Anyone who had a dream, would narrate it to the Prophet. I said, \"O Allah! If there is any good for me with You, then show me a dream so that Allah's Messenger (ﷺ) may interpret it for me.\" So I slept and saw (in a dream) two angels came to me and took me along with them, and they met another angel who said to me, \"Don't be afraid, you are a good man.\" They took me towards the Fire, and behold, it was built inside like a well, and therein I saw people some of whom I recognized, and then the angels took me to the right side. In the morning, I mentioned that dream to Hafsa رضی اللہ عنہا . Hafsa رضی اللہ عنہا told me that she had mentioned it to the Prophet (ﷺ) and he said, \"`Abdullah is a righteous man if he only prays more at night.\" (Az-Zuhri said, \"After that, `Abdullah used to pray more at night.\")",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں نو جوان غیر شادی شدہ تھا تو مسجدنبوی میں سو تا تھا اور جو شخص بھی خواب دیکھتا وہ آنحضرت صلی اللہ علیہ وسلم سے اس کا تذکرہ کرتا ۔ میں نے سوچا ‘ اے اللہ ! اگر تیرے نزدیک مجھ میں کوئی خیر ہے تو مجھے بھی کوئی خواب دکھا جس کی آنحضرت صلی اللہ علیہ وسلم مجھے تعبیر دیں ۔ پھر میں سویا اور میں نے دو فرشتے دیکھے جو میرے پاس آئے اور مجھے لے چلے ۔ پھر ان دونوں سے تیسرا فرشتہ بھی آملا اور اس نے مجھ سے کہا کہ ڈرو نہیں تم نیک آدمی ہو ۔ پھر وہ دونوں فرشتے مجھے جہنم کی طرف لے گئے تو وہ کنویں کی طرح تہ بتہ تھی اور اس میں کچھ لوگ تھے جن میں سے بعض کو میں نے پہچانا بھی ۔ پھر وہ دونوں فرشتے مجھے دائیں طرف لے چلے ۔ جب صبح ہوئی تو میں نے اس تذکرہ اپنی بہن حضرت حفصہ رضی اللہ عنہا سے کیا ۔ ام المؤمنین حضرت حفصہ رضی اللہ عنہا نے جب آنحضرت صلی اللہ علیہ وسلم سے اس خواب کا ذکر کیا تو آپ نے فرمایا کہ عبداللہ نیک مرد ہے ۔ کاش وہ رات میں نماز زیادہ پڑھا کرتا ۔ زہری نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کے اس فرمان کے بعد وہ رات میں نفلی نماز زیادہ پڑھا کرتے تھے ۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد نے بیان کیا ‘ کہا ہم سے ہشام بن یوسف نے بیان کیا ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں زہری نے ‘ انہیں سالم نے ‘ ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ كُنْتُ غُلاَمًا شَابًّا عَزَبًا فِي عَهْدِ النَّبِيِّ صلى الله عليه وسلم وَكُنْتُ أَبِيتُ فِي الْمَسْجِدِ، وَكَانَ مَنْ رَأَى مَنَامًا قَصَّهُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقُلْتُ اللَّهُمَّ إِنْ كَانَ لِي عِنْدَكَ خَيْرٌ فَأَرِنِي مَنَامًا يُعَبِّرُهُ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم، فَنِمْتُ فَرَأَيْتُ مَلَكَيْنِ أَتَيَانِي فَانْطَلَقَا بِي، فَلَقِيَهُمَا مَلَكٌ آخَرُ فَقَالَ لِي لَنْ تُرَاعَ، إِنَّكَ رَجُلٌ صَالِحٌ، فَانْطَلَقَا بِي إِلَى النَّارِ، فَإِذَا هِيَ مَطْوِيَّةٌ كَطَىِّ الْبِئْرِ، وَإِذَا فِيهَا نَاسٌ قَدْ عَرَفْتُ بَعْضَهُمْ، فَأَخَذَا بِي ذَاتَ الْيَمِينِ، فَلَمَّا أَصْبَحْتُ ذَكَرْتُ ذَلِكَ لِحَفْصَةَ‏.فَزَعَمَتْ حَفْصَةُ أَنَّهَا قَصَّتْهَا عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ إِنَّ عَبْدَ اللَّهِ رَجُلٌ صَالِحٌ لَوْ كَانَ يُكْثِرُ الصَّلاَةَ مِنَ اللَّيْلِ ‏\"‏‏.‏ قَالَ الزُّهْرِيُّ وَكَانَ عَبْدُ اللَّهِ بَعْدَ ذَلِكَ يُكْثِرُ الصَّلاَةَ مِنَ اللَّيْلِ‏.‏",
                "headingArabic": "الأَخْذِ عَلَى الْيَمِينِ فِي النَّوْمِ",
                "headingUrdu": "خواب میں دائیں طرف لے جانا4",
                "headingEnglish": "To be taken to the right side in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6745,
                "hadithNumber": "7032",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"While I was sleeping, I saw that a cup full of milk was brought to me and I drank of it and gave the remaining of it to `Umar bin Al-Khattab.\" They asked. What have you interpreted (about the dream)? O Allah's Messenger (ﷺ)?\" The Prophet (ﷺ) said. \"(It is Religious) knowledge.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ نے فرمایا کہ میں سویا ہوا تھا کہ میرے پاس دودھ کا پیالہ لایا گیا ۔ میں نے اس میں سے پیا پھر میں نے اپنا بچا ہوا ۔ عمر بن خطاب کو دے دیا ۔ لوگوں نے پوچھا یا رسول اللہ ! آپ صلی اللہ علیہ وسلم نے اس کی تعبیر کیا لی ؟ آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ علم سے تعبیر لی ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے بیان کیا ‘ ان سے عقیل نے ‘ ان سے ابن شہاب نے ‘ ان سے حمزہ بن عبداللہ نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ فَشَرِبْتُ مِنْهُ، ثُمَّ أَعْطَيْتُ فَضْلِي عُمَرَ بْنَ الْخَطَّابِ ‏\"‏‏.‏ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْعِلْمَ ‏\"‏‏.‏",
                "headingArabic": "الْقَدَحِ فِي النَّوْمِ",
                "headingUrdu": "خواب میں ایک پیالہ",
                "headingEnglish": "A bowl in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6746,
                "hadithNumber": "7033",
                "englishNarrator": "Narated Ubaidullah bin Abdullah:",
                "hadithEnglish": "I asked Ibn Abbas رضی اللہ عنہما about the dream of Allah's Messenger which he mentioned. (see following hadith)",
                "hadithUrdu": "میں نے عبداللہ بن عباس رضی اللہ عنہما سے نبی کریم صلی اللہ علیہ وسلم کے اس خواب کے متعلق پوچھا جو انہوں نے بیان کیا تھا ۔",
                "urduNarrator": "مجھ سے سعید بن محمد نے بیان کیا ‘ انہوں نے کہا ہم سے یعقوب بن ابراہیم نے بیان کیا ‘ انہوں نے کہا ہم سے ہمارے والد نے بیان کیا ‘ ان سے صالح نے ‘ ان سے ابوعبیدہ بن نشیط نے بیان کیا ‘ان سے عبیداللہ بن عبداللہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي سَعِيدُ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ عُبَيْدَةَ بْنِ نَشِيطٍ، قَالَ قَالَ عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ عَنْ رُؤْيَا، رَسُولِ اللَّهِ صلى الله عليه وسلم الَّتِي ذَكَرَ‏.‏",
                "headingArabic": "إِذَا طَارَ الشَّىْءُ فِي الْمَنَامِ",
                "headingUrdu": "اگر خواب میں کوئی چیز اڑ جائے۔",
                "headingEnglish": "If something flies in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6747,
                "hadithNumber": "7034",
                "englishNarrator": "Narrated `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"While I was sleeping, two golden bangles were put in my two hands, so I got scared (frightened) and disliked it, but I was given permission to blow them off, and they flew away. I interpret it as a symbol of two liars who will appear.\" 'Ubaidullah said, \"One of them was Al-`Ansi who was killed by Fairuz at Yemen and the other was Musailama (at Najd) .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں نے خواب میں دیکھا کہ دو سونے کے کنگن میرے ہاتھ میں رکھے گئے ہیں تو مجھے اس سے تکلیف پہنچی اور ناگوار ہوئی پھر مجھے اجازت دی گئی اور میں نے ان پر پھونک ماری اور وہ دونوں اڑ گئے ۔ میں نے اس کی تعبیر لی کہ دو جھوٹے پیدا ہوں گے ۔ عبیداللہ نے بیان کیا کہ ان میں سے ایک تو العنسی تھا جسے یمن میں فیروز نے قتل کیا اور دوسرا مسیلمہ ۔",
                "urduNarrator": "تو حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہا کہ مجھ سے کہا گیا ہے کہ",
                "hadithArabic": "فَقَالَ ابْنُ عَبَّاسٍ ذُكِرَ لِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُ أَنَّهُ وُضِعَ فِي يَدَىَّ سِوَارَانِ مِنْ ذَهَبٍ، فَفُظِعْتُهُمَا وَكَرِهْتُهُمَا، فَأُذِنَ لِي، فَنَفَخْتُهُمَا فَطَارَا، فَأَوَّلْتُهُمَا كَذَّابَيْنِ يَخْرُجَانِ ‏\"‏‏.‏ فَقَالَ عُبَيْدُ اللَّهِ أَحَدُهُمَا الْعَنْسِيُّ الَّذِي قَتَلَهُ فَيْرُوزٌ بِالْيَمَنِ، وَالآخَرُ مُسَيْلِمَةُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6748,
                "hadithNumber": "7035",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said: I, in dream, beheld that I was emigrating from Makkah to a place where there were date-palms. So, I thought it would be Yamamah or Hajar but it was Madinah called Yathrab (then). So, I saw a cow and the goodness of Allah. The cow represents those Muslims who were martyred in the battle of Ohud and the goodness stands for the goodness that Allah conferred upon us, and the reward of the truth which Allah bestowed on us after ther battle of Badr.",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا میں نے خواب دیکھا کہ میں مکہ سے ایک ایسی زمین کی طرف ہجرت کر رہا ہوں جہاں کھجوریں ہیں ۔ میرا ذہن اس طرف گیا کہ یہ جگہ یمامہ ہے یا ہجر ۔ لیکن بعد میں معلوم ہوا کہ مدینہ یعنی یثرب ہے اور میں نے خواب میں گائے دیکھی ( زبح کی ہوئی ) اور یہ آواز سنی کہ کوئی کہہ رہا ہے کہ اور اللہ کے یہاں ہی خیر ہے تو اس کی تعبیر ان مسلمانوں کی صورت میں آئی جو جنگ احد میں شہید ہوئے اور خیروہ ہے جو اللہ تعالیٰ نے خیر اور سچائی کے ثواب کی صورت میں دیا یعنی وہ جو ہمیں اللہ تعالیٰ نے جنگ بدر کے بعد ( دوسری فتوحات کی صورت میں ) دی ۔",
                "urduNarrator": "مجھ سے محمد بن علاء نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ ان سے بریدہ نے ‘ ان سے ان کے دادا ابوبردہ نے ‘ ان سے حضرت ابوموسیٰ رضی اللہ عنہ نے میرا خیال ہے کہ نبی کریم صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ جَدِّهِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، أُرَاهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ رَأَيْتُ فِي الْمَنَامِ أَنِّي أُهَاجِرُ مِنْ مَكَّةَ إِلَى أَرْضٍ بِهَا نَخْلٌ، فَذَهَبَ وَهَلِي إِلَى أَنَّهَا الْيَمَامَةُ أَوْ هَجَرٌ، فَإِذَا هِيَ الْمَدِينَةُ يَثْرِبُ، وَرَأَيْتُ فِيهَا بَقَرًا وَاللَّهُ خَيْرٌ، فَإِذَا هُمُ الْمُؤْمِنُونَ يَوْمَ أُحُدٍ، وَإِذَا الْخَيْرُ مَا جَاءَ اللَّهُ مِنَ الْخَيْرِ وَثَوَابِ الصِّدْقِ الَّذِي أَتَانَا اللَّهُ بِهِ بَعْدَ يَوْمِ بَدْرٍ ‏\"‏‏.‏",
                "headingArabic": "إِذَا رَأَى بَقَرًا تُنْحَرُ",
                "headingUrdu": "اگر کوئی شخص (خواب میں) گائے کو ذبح ہوتے دیکھے۔",
                "headingEnglish": "If one sees (in a dream) cows being slaughtered",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6749,
                "hadithNumber": "7036, 7037",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"We (Muslims) are the last (to come) but (will be) the foremost (on the Day of Resurrection).\"\" Allah's Messenger (ﷺ) further said, ''While sleeping, I was given the treasures of the world and two golden bangles were put in my hands, but I felt much annoyed, and those two bangles distressed me very much, but I was inspired that I should blow them off, so I blew them and they flew away. Then I interpreted that those two bangles were the liars between whom I was (i.e., the one of San`a' and the one of Yamama).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہم سب امتوں سے آخری امت ( وقت کے اعتبار سے ) اور سب امتوں سے پہلی امت ( جنت میں داخلہ کے اعتبار سے ) ہیں ۔ اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا میں سویا ہوا تھا کہ زمین کے خزانے میرے پاس لائے گئے اور میرے ہاتھ میں دو سونے کے کنگن رکھ دئیے گئے جو مجھے بہت شاق گزرے ۔ پھر مجھے وحی کی گئی کہ میں ان پر پھونک ماروں میں نے پھونکا تو وہ اڑ گئے ۔ میں نے ان کی تعبیر دو جھوٹوں سے لی جن کے درمیان میں میں ہوں ایک صنعاء کا اور دوسرا یمامہ کا ۔",
                "urduNarrator": "مجھ سے اسحاق بن ابراہیم الحنظلی نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ کہا ہم کو معمر نے خبر دی ‘ ان سے ہما م بن منبہ نے بیان کیا کہ یہ وہ حدیث ہے جو ہم سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کی کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا بِهِ أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ ‏\"‏‏.‏‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَيْنَا أَنَا نَائِمٌ إِذْ أُوتِيتُ خَزَائِنَ الأَرْضِ، فَوُضِعَ فِي يَدَىَّ سِوَارَانِ مِنْ ذَهَبٍ، فَكَبُرَا عَلَىَّ وَأَهَمَّانِي، فَأُوحِيَ إِلَىَّ أَنِ انْفُخْهُمَا، فَنَفَخْتُهُمَا فَطَارَا، فَأَوَّلْتُهُمَا الْكَذَّابَيْنِ اللَّذَيْنِ أَنَا بَيْنَهُمَا صَاحِبَ صَنْعَاءَ وَصَاحِبَ الْيَمَامَةِ ‏\"‏‏.‏",
                "headingArabic": "النَّفْخِ فِي الْمَنَامِ",
                "headingUrdu": "خواب میں اڑا دینا",
                "headingEnglish": "To blow out in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6750,
                "hadithNumber": "7038",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I saw (in a dream) a black woman with unkempt hair going out of Medina and settling at Mahai'a, i.e., Al-Juhfa. I interpreted that as a symbol of epidemic of Medina being transferred to that place (Al-Juhfa).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں نے دیکھا جیسے ایک سیاہ عورت پر اگند ہ بال ‘ مدینہ سے نکلی اور مہیعہ میں جا کر کھڑی ہو گئی ۔ مہیعہ حجفہ کو کہتے ہیں ۔ میں نے اس کی یہ تعبیر لی کہ مدینہ کی وبا حجفہ نامی بستی میں چلی گئی ۔",
                "urduNarrator": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ‘ انہوں نے کہا مجھ سے میرے بھائی عبدالحمید نے بیان کیا ‘ ان سے سلیمان بن بلال نے بیان کیا ‘ ان سے موسیٰ بن عقبہ نے بیان کیا ان سے سالم بن عبداللہ نے بیان کیا ‘ انہوں نے اپنے والد حضرت عبداللہ بن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنِي أَخِي عَبْدُ الْحَمِيدِ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ رَأَيْتُ كَأَنَّ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الرَّأْسِ، خَرَجَتْ مِنَ الْمَدِينَةِ، حَتَّى قَامَتْ بِمَهْيَعَةَ ـ وَهْىَ الْجُحْفَةُ ـ فَأَوَّلْتُ أَنَّ وَبَاءَ الْمَدِينَةِ نُقِلَ إِلَيْهَا ‏\"‏‏.‏",
                "headingArabic": "إِذَا رَأَى أَنَّهُ أَخْرَجَ الشَّىْءَ مِنْ كُورَةٍ فَأَسْكَنَهُ مَوْضِعًا آخَرَ",
                "headingUrdu": "اگر کوئی خواب میں دیکھے کہ وہ کوئی چیز لے کر دوسری جگہ رکھتا ہے۔",
                "headingEnglish": "If one sees in a dream that he takes something and places it at another place",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6751,
                "hadithNumber": "7039",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "concerning the dream of the Prophet (ﷺ) in Medina: The Prophet (ﷺ) said, \"I saw (in a dream) a black woman with unkempt hair going out of Medina and settling at Mahai'a. I interpreted that as (a symbol of) the epidemic of Medina being transferred to Mahai'a, namely, Al-Juhfa.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے مدینہ میں خواب کے سلسلے میں کہ ( آنحضرت صلی اللہ علیہ وسلم نے فرمایا ) میں نے ایک پراگندہ بال ‘ سیاہ عورت دیکھی کہ وہ مدینہ سے نکل کر مہیعہ چلی گئی ۔ میں نے اس کی تعبیر لی کہ مدینہ کی وبا مهيعۃ منتقل ہو گئی ہے ۔ مهيعۃ یعنی الجحفۃ کو کہتے ہیں ۔",
                "urduNarrator": "ہم سے ابوبکر المقدمی نے بیان کیا ‘ انہوں نے کہا ہم سے فضیل بن سلیمان نے بیان کیا ‘ ان سے موسیٰ نے بیان کیا ‘ ان سے سالم بن عبداللہ نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مُوسَى، حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ فِي رُؤْيَا النَّبِيِّ صلى الله عليه وسلم فِي الْمَدِينَةِ ‏ \"‏ رَأَيْتُ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الرَّأْسِ، خَرَجَتْ مِنَ الْمَدِينَةِ، حَتَّى نَزَلَتْ بِمَهْيَعَةَ، فَتَأَوَّلْتُهَا أَنَّ وَبَاءَ الْمَدِينَةِ نُقِلَ إِلَى مَهْيَعَةَ، وَهْىَ الْجُحْفَةُ ‏\"‏‏.‏",
                "headingArabic": "الْمَرْأَةِ السَّوْدَاءِ",
                "headingUrdu": "ایک سیاہ عورت (خواب میں)",
                "headingEnglish": "A black woman (in a dream)",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6752,
                "hadithNumber": "7040",
                "englishNarrator": "Narrated Salim's father:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I saw (in a dream) a black woman with unkempt hair going out of Medina and settling in Mahai'a. I interpreted that as (a symbol of) epidemic of Medina being transferred to Mahai'a, namely, Al-Juhfa.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں نے ایک پراگندہ بال کالی عورت دیکھی جو مدینہ سے نکلی اور مہیعہ میں جا کر ٹھہر گئی ۔ میں نے اس کی تعبیر یہ لی کہ مدینہ کی وبا مہیعہ یعنی منتقل ہو گئی ۔",
                "urduNarrator": "مجھ سے ابراہیم بن المنذر نے بیان کیا ‘ انہوں نے کہا مجھ سے ابوبکر بن ابی اویس نے بیان کیا ‘ انہوں نے کہا مجھ سے سلیمان نے بیان کیا ‘ ان سے موسیٰ بن عقبہ نے بیان کیا ‘ ان سے سالم نے بیان کیا ‘ ان سے ان کے والد حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي سُلَيْمَانُ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ رَأَيْتُ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الرَّأْسِ، خَرَجَتْ مِنَ الْمَدِينَةِ، حَتَّى قَامَتْ بِمَهْيَعَةَ فَأَوَّلْتُ أَنَّ وَبَاءَ الْمَدِينَةِ نُقِلَ إِلَى مَهْيَعَةَ، وَهْىَ الْجُحْفَةُ ‏\"‏‏.‏",
                "headingArabic": "الْمَرْأَةِ الثَّائِرَةِ الرَّأْسِ",
                "headingUrdu": "گندے بالوں والی عورت (خواب میں)",
                "headingEnglish": "A lady with unkempt hair (in a dream)",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6753,
                "hadithNumber": "7041",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I saw in a dream that I waved a sword and it broke in the middle, and behold, that symbolized the casualties the believers suffered on the Day (of the battle) of Uhud. Then I waved the sword again, and it became better than it had ever been before, and behold, that symbolized the Conquest (of Mecca) which Allah brought about and the gathering of the believers. \"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے یوں فرمایا کہ میں نے ایک تلوار ہلائی تو وہ بیچ سے ٹوٹ گئی ۔ اس کی تعبیر احد کی جنگ میں مسلمانوں کے شہید ہونے کی صورت میں سامنے آئی پھر دوبارہ میں نے اسے ہلا یا تو وہ پہلے سے بھی اچھی شکل میں ہو گئی ۔ اس کی تعبیر فتح اور مسلمانوں کے اتفاق و اجتماع کی صورت میں سامنے آئی ۔",
                "urduNarrator": "ہم سے محمد بن علاء نے بیان کیا ‘ انہوں نے کہا ہم سے ابواسامہ نے بیان کیا ‘ ان سے برید بن عبداللہ ابن ابی بردہ نے بیان کیا ‘ ان سے ان کے دادا ابوبردہ نے اور ان سے حضرت ابوموسیٰ رضی اللہ عنہ نے ‘مجھ کو یقین ہے کہ نبی کریم صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ جَدِّهِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، أُرَاهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ رَأَيْتُ فِي رُؤْيَا أَنِّي هَزَزْتُ سَيْفًا فَانْقَطَعَ صَدْرُهُ، فَإِذَا هُوَ مَا أُصِيبَ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ، ثُمَّ هَزَزْتُهُ أُخْرَى، فَعَادَ أَحْسَنَ مَا كَانَ، فَإِذَا هُوَ مَا جَاءَ اللَّهُ بِهِ مِنَ الْفَتْحِ، وَاجْتِمَاعِ الْمُؤْمِنِينَ ‏\"‏‏.‏",
                "headingArabic": "إِذَا هَزَّ سَيْفًا فِي الْمَنَامِ",
                "headingUrdu": "اگر کوئی خواب میں تلوار لہرائے",
                "headingEnglish": "If someone waves a sword in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6754,
                "hadithNumber": "7042",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever claims to have seen a dream which he did not see, will be ordered to make a knot between two barley grains which he will not be able to do; and if somebody listens to the talk of some people who do not like him (to listen) or they run away from him, then molten lead will be poured into his ears on the Day of Resurrection; and whoever makes a picture, will be punished on the Day of Resurrection and will be ordered to put a soul in that picture, which he will not be able to do. Ayyoub has reported it with a connected chain. Ikrimah has reported from Hadrat Abu Hurairah  رضی اللہ عنہ: Whose makes a picture, whose narrates a false dream and whose eavesdrops on someone's conversation. Hadrat Ikrimah narrates that Hadrat Ibn-e-Abbas رضی اللہ عنہما said: Whose eavesdrops on somebody's conversation and whose narrates a false dream and whose makes a picture. Then as per former Hadith (it has been narrated). Ikrimah has also narrated from Hadrat Ibn-e-Abbas رضی اللہ عنہما the same",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے ایسا خواب بیان کیا جو اس نے دیکھا نہ ہو تو اسے دو جو کہ دو دانوں کو قیامت کے دن جوڑنے کے لیے کہا جائے گا اور وہ اسے ہرگز نہیں کر سکے گا ( اس لیے مار کھاتا رہے گا ) اور جو شخص دوسرے لوگوں کی بات سننے کے لیے کان لگائے جو اسے پسند نہیں کرتے یا اس سے بھاگتے ہیں تو قیامت کے دن اس کے کانوں میں سیسہ پگھلا کر ڈالا جائے گا اور جو کوئی تصویر بنائے گا اسے عذاب دیا جائے گا اور اس پر زور دیا جائے گا کہ اس میں روح بھی ڈالے جو وہ نہیں کر سکے گا ۔ اور سفیان نے کہا کہ ہم سے ایوب نے یہ حدیث موصولاً بیان کی اور قتیبہ بن سعید نے بیان کیا ‘ ہم سے ابوعوانہ نے ‘ ان سے قتادہ نے ‘ ان سے عکرمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ جو اپنے خواب کے سلسلے میں جھوٹ بولے ۔ اور شعبہ نے کہا ‘ ان سے ابوہاشم الرمانی نے ‘ انہوں نے عکرمہ سے سنا اور ان سے ابوہریرہ رضی اللہ عنہ نے ( کا قول موقوفاً ) جو شخص مورت بنائے ‘ جو شخص جھوٹا خواب بیان کرے ‘ جو شخص کان لگا کر دوسروں کی باتیں سنے ۔  ہم سے اسحاق واسطی نے بیان کیا ‘ کہا ہم سے خالد طحان نے بیان کیا ‘ ان سے خالد حذاء نے ‘ ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ جو کسی کی بات کان لگا کر سننے کے پیچھے لگا اور جس نے غلط خواب بیان کیا اور جس نے تصویر بنائی ( ایسی ہی حدیث نقل کی موقوفاً ابن عباس سے ) خالد حذاء کے ساتھ اس حدیث کو ہشام بن حسان فردوسی نے بھی عکرمہ سے ‘ انہوں نے ابن عباس رضی اللہ عنہما سے موقوفاً روایت کیا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ‘ کہا ہم سے سفیان نے ‘ ان سے ایوب نے ‘ ان سے عکرمہ نے ‘ ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ تَحَلَّمَ بِحُلُمٍ لَمْ يَرَهُ، كُلِّفَ أَنْ يَعْقِدَ بَيْنَ شَعِيرَتَيْنِ، وَلَنْ يَفْعَلَ، وَمَنِ اسْتَمَعَ إِلَى حَدِيثِ قَوْمٍ وَهُمْ لَهُ كَارِهُونَ أَوْ يَفِرُّونَ مِنْهُ، صُبَّ فِي أُذُنِهِ الآنُكُ يَوْمَ الْقِيَامَةِ، وَمَنْ صَوَّرَ صُورَةً، عُذِّبِ وَكُلِّفَ أَنْ يَنْفُخَ فِيهَا، وَلَيْسَ بِنَافِخٍ ‏\"‏‏.‏ قَالَ سُفْيَانُ وَصَلَهُ لَنَا أَيُّوبُ‏.‏ وَقَالَ قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَوْلَهُ مَنْ كَذَبَ فِي رُؤْيَاهُ‏.‏ وَقَالَ شُعْبَةُ عَنْ أَبِي هَاشِمٍ الرُّمَّانِيِّ سَمِعْتُ عِكْرِمَةَ قَالَ أَبُو هُرَيْرَةَ قَوْلَهُ مَنْ صَوَّرَ، وَمَنْ تَحَلَّمَ، وَمَنِ اسْتَمَعَ‏.‏ حَدَّثَنِي إِسْحَاقُ حَدَّثَنَا خَالِدٌ عَنْ خَالِدٍ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ قَالَ ‏\"‏ مَنِ اسْتَمَعَ، وَمَنْ تَحَلَّمَ، وَمَنْ صَوَّرَ ‏\"‏‏.‏ نَحْوَهُ‏.‏ تَابَعَهُ هِشَامٌ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ قَوْلَهُ‏.‏",
                "headingArabic": "مَنْ كَذَبَ فِي حُلُمِهِ",
                "headingUrdu": "ایسا خواب بیان کرنا جو کسی نے نہ دیکھا ہو۔",
                "headingEnglish": "Narrating a dream which one did not see",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6755,
                "hadithNumber": "7043",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The worst lie is that a person claims to have seen a dream which he has not seen.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا سب سے بدترین جھوٹ یہ ہے کہ انسان خواب میں ایسی چیز کو دیکھنے کا دعویٰ کرے جو اس کی آنکھوں نے نہ دیکھی ہو ۔",
                "urduNarrator": "ہم سے علی بن مسلم نے بیان کیا ‘ کہا ہم سے عبدالصمد نے بیان کیا ‘ کہا ہم سے ابن عمر رضی اللہ عنہما کے غلام عبدالرحمٰن بن عبداللہ بن دینار نے بیان کیا ‘ ان سے ان کے والد نے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ، مَوْلَى ابْنِ عُمَرَ عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مِنْ أَفْرَى الْفِرَى أَنْ يُرِيَ عَيْنَيْهِ مَا لَمْ تَرَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 6726,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=269",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=267",
                "label": "267",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=268",
                "label": "268",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=269",
                "label": "269",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=270",
                "label": "270",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=271",
                "label": "271",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=272",
                "label": "272",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=273",
                "label": "273",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=271",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=271",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=269",
        "to": 6750,
        "total": 40465
    }
}