{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 229,
        "data": [
            {
                "id": 5703,
                "hadithNumber": "5955",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) returned from a journey when I had hung a thick curtain having pictures (in front of a door). He ordered me to remove it and I removed it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سفر سے آئے اور میں نے پردہ لٹکا رکھا تھا جس میں تصویریں تھیں ، آنحضرت صلی اللہ علیہ وسلم نے مجھے اس کے اتار لینے کا حکم دیا تو میں نے اسے اتارلیا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے عبداللہ بن داؤد نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَدِمَ النَّبِيُّ صلى الله عليه وسلم مِنْ سَفَرٍ، وَعَلَّقْتُ دُرْنُوكًا فِيهِ تَمَاثِيلُ، فَأَمَرَنِي أَنْ أَنْزِعَهُ، فَنَزَعْتُهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5704,
                "hadithNumber": "5956",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) and I used to take a bath from one container (of water).",
                "hadithUrdu": "میں اور نبی کریم صلی اللہ علیہ وسلم ایک ہی برتن میں غسل جنابت کیا کرتے تھے ۔",
                "urduNarrator": "حضرت عائشہ رضی اللہ عنہا نے بیان کیا  کہ",
                "hadithArabic": "وَكُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5705,
                "hadithNumber": "5957",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I purchased a cushion with pictures on it. The Prophet (came and) stood at the door but did not enter. I said (to him), \"I repent to Allah for what (the guilt) I have done.\" He said, \"What is this cushion?\" I said, \"It is for you to sit on and recline on.\" He said, \"The makers of these pictures will be punished on the Day of Resurrection and it will be said to them, 'Make alive what you have created.' Moreover, the angels do not enter a house where there are pictures.'\"",
                "hadithUrdu": "انہوں نے ایک گدا خریدا جس پر تصویر یں تھیں ۔ رسول اللہ صلی اللہ علیہ وسلم ( اسے دیکھ کر ) دروازے پر کھڑے ہو گئے اور اندر نہیں تشریف لائے ۔ میں نے عرض کیا کہ یا رسول اللہ صلی اللہ علیہ وسلم میں نے جو غلطی کی ہے اس سے میں اللہ سے معافی مانگتی ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ گدا کس لیے ہے ؟ میں نے عرض کیا کہ آپ کے بیٹھنے اور اس پر ٹیک لگانے کے لیے ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ان مورت کے بنانے والوں کو قیامت کے دن عذاب دیا جائے گا اور ان سے کہا جائے گا کہ جو تم نے پیدا کیا ہے اسے زندہ بھی کر کے دکھاؤ اور فرشتے اس گھر میں نہیں داخل ہوتے جس میں مورت ہو ۔",
                "urduNarrator": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے جویریہ نے بیان کیا ، ان سے نافع نے ، ان سے قاسم بن محمد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا اشْتَرَتْ نُمْرُقَةً فِيهَا تَصَاوِيرُ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم بِالْبَابِ فَلَمْ يَدْخُلْ‏.‏ فَقُلْتُ أَتُوبُ إِلَى اللَّهِ مِمَّا أَذْنَبْتُ‏.‏ قَالَ ‏\"‏ مَا هَذِهِ النُّمْرُقَةُ ‏\"‏‏.‏ قُلْتُ لِتَجْلِسَ عَلَيْهَا وَتَوَسَّدَهَا‏.‏ قَالَ ‏\"‏ إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ، يُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ‏.‏ وَإِنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ الصُّورَةُ ‏\"‏‏.‏",
                "headingArabic": "مَنْ كَرِهَ الْقُعُودَ عَلَى الصُّورَةِ",
                "headingUrdu": "جس نے تصویروں پر بیٹھنا ناپسند کیا۔",
                "headingEnglish": "Whoever disliked to sit on pictures",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5706,
                "hadithNumber": "5958",
                "englishNarrator": "Narrated Abu Talha رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Angels (of mercy) do not enter a house where there are pictures.'\" The sub narrator Busr added: \"Then Zaid رضی اللہ عنہ fell ill and we paid him a visit. Behold! There was, hanging at his door, a curtain decorated with a picture. I said to 'Ubaidullah Al-Khaulani, the step son of Maimuna رضی اللہ عنہا , the wife of the Prophet (ﷺ) , \"Didn't Zaid tell us about the picture the day before yesterday?\" 'Ubaidullah said, \"Didn't you hear him saying: 'except a design in a garment'?\" Ibn-e-Wahab, Hadrat Abu Talha رضی اللہ عنہ reported likewise from the prophet ﷺ.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا فرشتے اس گھر میں نہیں داخل ہوتے جس میں تصویریں ہوں ۔ بسر نے بیان کیا کہ ( اس حدیث کو روایت کرنے کے بعد ) پھر زید رضی اللہ عنہ بیمار پڑے تو ہم ان کی مزاج پرسی کے لیے گئے ۔ ہم نے دیکھا کہ ان کے دروازہ پر ایک پردہ پڑا ہوا ہے جس پر تصویر ہے ۔ میں نے ام المؤمنین میمونہ رضی اللہ عنہا کے ربیب عبیداللہ بن اسود سے کہا کہ زید بن خالد رضی اللہ عنہ نے ہمیں اس سے پہلے ایک مرتبہ تصویروں کے متعلق حدیث سنائی تھی ۔ عبیداللہ نے کہا کہ کیا تم نے سنا نہیں تھا ، حدیث بیان کرتے ہوئے انہوں نے یہ بھی کہا تھا کہ جو مورت کپڑے میں ہو وہ جائز ہے ( بشر طیکہ غیر ذی روح کی ہو ) اور عبداللہ بن وہب نے کہا ، انہیں عمرو نے خبر دی وہ ابن حارث ہیں ، ان سے بکیر نے بیان کیا ، ان سے بسر نے بیان کیا ، ان سے زید نے بیان کیا ، ان سے حضرت ابوطلحہ رضی اللہ عنہ نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم نے بیان فرمایا جیسا کہ اوپر مذکور ہوا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے بکیر بن عبداللہ نے ، ان سے بسر بن سعید نے اور ان سے زید بن خالد رضی اللہ عنہ نے اور ان سے رسول اللہ صلی اللہ علیہ وسلم کے صحابی ابوطلحہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ بُكَيْرٍ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْدِ بْنِ خَالِدٍ، عَنْ أَبِي طَلْحَةَ، صَاحِبِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ الصُّورَةُ ‏\"‏‏.‏ قَالَ بُسْرٌ ثُمَّ اشْتَكَى زَيْدٌ فَعُدْنَاهُ، فَإِذَا عَلَى بَابِهِ سِتْرٌ فِيهِ صُورَةٌ فَقُلْتُ لِعُبَيْدِ اللَّهِ رَبِيبِ مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَلَمْ يُخْبِرْنَا زَيْدٌ عَنِ الصُّوَرِ يَوْمَ الأَوَّلِ‏.‏ فَقَالَ عُبَيْدُ اللَّهِ أَلَمْ تَسْمَعْهُ حِينَ قَالَ إِلاَّ رَقْمًا فِي ثَوْبٍ‏.‏ وَقَالَ ابْنُ وَهْبٍ أَخْبَرَنَا عَمْرٌو ـ هُوَ ابْنُ الْحَارِثِ ـ حَدَّثَهُ بُكَيْرٌ، حَدَّثَهُ بُسْرٌ، حَدَّثَهُ زَيْدٌ، حَدَّثَهُ أَبُو طَلْحَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5707,
                "hadithNumber": "5959",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Aisha رضی اللہ عنہا had a thick curtain (having pictures on it) and she screened the side of her i house with it. The Prophet (ﷺ) said to her, \"Remove it from my sight, for its pictures are still coming to my mind in my prayers.\"",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا کے پاس ایک پردہ تھا ۔ اسے انہوں نے گھر کے ایک کنارے پر لٹکا دیا تھا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ پردہ نکال ڈال ، اس کی مورت اس نماز میں میرے سامنے آتی ہیں ۔ اور دل اچاٹ ہوتا ہے ۔",
                "urduNarrator": "ہم سے عمران بن میسرہ نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، کہا ہم سے عبدالعزیز بن صہیب نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ قِرَاَمٌ لِعَائِشَةَ سَتَرَتْ بِهِ جَانِبَ بَيْتِهَا، فَقَالَ لَهَا النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَمِيطِي عَنِّي، فَإِنَّهُ لاَ تَزَالُ تَصَاوِيرُهُ تَعْرِضُ لِي فِي صَلاَتِي ‏\"‏‏.‏",
                "headingArabic": "كَرَاهِيَةِ الصَّلاَةِ فِي التَّصَاوِيرِ",
                "headingUrdu": "تصویر والے کپڑے پہن کر نماز پڑھنا ناپسندیدہ ہے۔",
                "headingEnglish": "It is disliked to offer Salat wearing clothes with pictures",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5708,
                "hadithNumber": "5960",
                "englishNarrator": "Narrated Salim's father:",
                "hadithEnglish": "Once Gabriel promised to visit the Prophet (ﷺ) but he delayed and the Prophet (ﷺ) got worried about that. At last he came out and found Gabriel and complained to him of his grief (for his delay). Gabriel said to him, \"We do not enter a place in which there is a picture or a dog.\"",
                "hadithUrdu": "ایک وقت پر جبرائیل علیہ السلام نے نبی کریم صلی اللہ علیہ وسلم کے یہاں آنے کا وعدہ کیا لیکن آنے میں دیر ہوئی ۔ اس وقت پر نہیں آئے تو آنحضرت صلی اللہ علیہ وسلم سخت پریشان ہوئے پھر آپ باہر نکلے تو جبرائیل علیہ السلام سے ملا قات ہوئی ۔ آنحضرت صلی اللہ علیہ وسلم ان سے شکایت کی تو انہوں نے کہا کہ ہم ( فرشتے ) کسی ایسے گھر میں نہیں جاتے جس میں مورت یا کتا ہو ۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن وہب نے ، کہا کہ مجھ سے عمر بن محمد نے بیان کیا ، ان سے سالم نے اور ان سے ان کے والد ( ابن عمر رضی اللہ عنہما ) نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي عُمَرُ ـ هُوَ ابْنُ مُحَمَّدٍ ـ عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ وَعَدَ النَّبِيَّ صلى الله عليه وسلم جِبْرِيلُ فَرَاثَ عَلَيْهِ حَتَّى اشْتَدَّ عَلَى النَّبِيِّ صلى الله عليه وسلم فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم فَلَقِيَهُ، فَشَكَا إِلَيْهِ مَا وَجَدَ، فَقَالَ لَهُ ‏ \"‏ إِنَّا لاَ نَدْخُلُ بَيْتًا فِيهِ صُورَةٌ وَلاَ كَلْبٌ ‏\"‏‏.‏",
                "headingArabic": "لاَ تَدْخُلُ الْمَلاَئِكَةُ بَيْتًا فِيهِ صُورَةٌ",
                "headingUrdu": "جس گھر میں تصویریں ہوں فرشتے داخل نہیں ہوتے",
                "headingEnglish": "Angels do not enter a house in which there are pictures",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5709,
                "hadithNumber": "5961",
                "englishNarrator": "Narrated `Aisha (the wife of the Prophet) رضی اللہ عنہا :",
                "hadithEnglish": "I bought a cushion having pictures on it. When Allah's Messenger (ﷺ) saw it, he stopped at the gate and did not enter. I noticed the signs of hatred (for that) on his face! I said, \"O Allah's Messenger (ﷺ)! I turn to Allah and His Apostle in repentance! What sin have I committed?\" He said, \"What about this cushion?\" I said, 'I bought it for you to sit on and recline on.\" Allah's Messenger (ﷺ) said, \"The makers of these pictures will be punished (severely) on the Day of Resurrection and it will be said to them, 'Make alive what you have created.'\" He added, \"Angels do not enter a house in which there are pictures.\"",
                "hadithUrdu": "انہوں نے ایک گدا خریدا جس میں مورتیں تھیں جب رسول اللہ صلی اللہ علیہ وسلم نے اسے دیکھا تو آپ دروازے پر کھڑے ہو گئے اور اندر نہیں آئے ۔ میں آپ کے چہرے سے ناراضگی پہچان گئی ۔ میں نے عرض کیا یا رسول اللہ ! میں اللہ سے اس کے رسول کے سامنے توبہ کرتی ہوں ، میں نے کیا غلطی کی ہے ؟ آپ نے فرمایا کہ گدا کیسا ہے ؟ میں نے عرض کیا کہ میں نے ہی اسے خریدا ہے تاکہ آپ اس پر بیٹھیں اور ٹیک لگائیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ان مورتوں کے بنانے والوں کو قیامت کے دن عذاب دیا جائے گا اور ان سے کہا جائے گا کہ جو تم نے پیدا کیا ہے اب ان میں جان بھی ڈالو اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جس گھر میں مورت ہوتی ہے اس میں ( رحمت کے ) فرشتے نہیں داخل ہوتے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے ، ان سے نافع نے ، ان سے قاسم بن محمد نے اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا أَخْبَرَتْهُ أَنَّهَا اشْتَرَتْ نُمْرُقَةً فِيهَا تَصَاوِيرُ، فَلَمَّا رَآهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَامَ عَلَى الْبَابِ فَلَمْ يَدْخُلْ، فَعَرَفَتْ فِي وَجْهِهِ الْكَرَاهِيَةَ قَالَتْ يَا رَسُولَ اللَّهِ أَتُوبُ إِلَى اللَّهِ وَإِلَى رَسُولِهِ، مَاذَا أَذْنَبْتُ قَالَ ‏\"‏ مَا بَالُ هَذِهِ النُّمْرُقَةِ ‏\"‏‏.‏ فَقَالَتِ اشْتَرَيْتُهَا لِتَقْعُدَ عَلَيْهَا وَتَوَسَّدَهَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ، وَيُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ ـ وَقَالَ ـ إِنَّ الْبَيْتَ الَّذِي فِيهِ الصُّوَرُ لاَ تَدْخُلُهُ الْمَلاَئِكَةُ ‏\"‏‏.‏",
                "headingArabic": "مَنْ لَمْ يَدْخُلْ بَيْتًا فِيهِ صُورَةٌ",
                "headingUrdu": "جو اس گھر میں داخل نہ ہو جس میں تصویر ہو۔",
                "headingEnglish": "Whoever does not enter a house having a picture in it",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5710,
                "hadithNumber": "5962",
                "englishNarrator": "Narrated Abu Juhaifa:",
                "hadithEnglish": "He had bought a slave whose profession was cupping. The Prophet (ﷺ) forbade taking the price of blood and the price of a dog and the earnings of a prostitute, and cursed the one who took or gave (Riba') usury, and the lady who tattooed others or got herself tattooed, and the picture-maker.",
                "hadithUrdu": "انہوں نے ایک غلام خریدا جو پچھنا لگا تا تھا پھر فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے خون نکالنے کی اجرت ، کتے کی قیمت اور رنڈی کی کمائی کھانے سے منع فرمایا ہے اور آپ نے سود لینے والے ، دینے والے ، گودنے والی ، گدوانے والی اور مورت بنانے والے پر لعنت بھیجی ہے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ مجھ سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عون بن ابی جحیفہ نے اور ان سے ان کے والد ( وہب بن عبداللہ ) نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، أَنَّهُ اشْتَرَى غُلاَمًا حَجَّامًا فَقَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الدَّمِ، وَثَمَنِ الْكَلْبِ، وَكَسْبِ الْبَغِيِّ، وَلَعَنَ آكِلَ الرِّبَا وَمُوكِلَهُ وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ وَالْمُصَوِّرَ‏.‏",
                "headingArabic": "مَنْ لَعَنَ الْمُصَوِّرَ",
                "headingUrdu": "جس نے تصویر بنانے والے پر لعنت بھیجی۔",
                "headingEnglish": "Whoever cursed a picture-maker",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5711,
                "hadithNumber": "5963",
                "englishNarrator": "Narrated Qatadah:",
                "hadithEnglish": "While he was in the company of Hadrat Ibn-e-Abbas رضی اللہ عنہما , the people were asking him questions and he was giving answers without mentioning the prophet ﷺ. He meanwhile was asked about the precept of pictures, he, thereupon, said: I heard Muhammad saying, \"Whoever makes a picture in this world will be asked to put life into it on the Day of Resurrection, but he will not be able to do so.\"",
                "hadithUrdu": "میں ابن عباس رضی اللہ عنہما کے پاس تھا لوگ ان سے مختلف مسائل پوچھ رہے تھے ۔ جب تک ان سے خاص طور سے پوچھا نہ جاتا وہ نبی کریم صلی اللہ علیہ وسلم کا حوالہ نہیں دیتے تھے پھر انہوں نے کہا کہ\r\n میں نے حضرت محمد صلی اللہ علیہ وسلم سے سنا ہے آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص دنیا میں مورت بنائے گا قیامت کے دن اس پر زور ڈالا جائے گا کہ اسے وہ زندہ بھی کرے حالانکہ وہ اسے زندہ نہیں کر سکتا ۔",
                "urduNarrator": "ہم سے عیاش بن ولید نے بیان کیا ، کہا ہم سے عبدالاعلیٰ نے بیان کیا ، کہا ہم سے سعید بن ابی عروبہ نے بیان کیا ، انہوں نے کہا کہ میں نے نضر بن مالک سے سنا ، وہ قتادہ سے بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، قَالَ سَمِعْتُ النَّضْرَ بْنَ أَنَسِ بْنِ مَالِكٍ، يُحَدِّثُ قَتَادَةَ قَالَ كُنْتُ عِنْدَ ابْنِ عَبَّاسٍ وَهُمْ يَسْأَلُونَهُ وَلاَ يَذْكُرُ النَّبِيَّ صلى الله عليه وسلم حَتَّى سُئِلَ فَقَالَ سَمِعْتُ مُحَمَّدًا صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ صَوَّرَ صُورَةً فِي الدُّنْيَا كُلِّفَ يَوْمَ الْقِيَامَةِ أَنْ يَنْفُخَ فِيهَا الرُّوحَ، وَلَيْسَ بِنَافِخٍ ‏\"‏‏.‏",
                "headingArabic": "مَنْ صَوَّرَ صُورَةً كُلِّفَ يَوْمَ الْقِيَامَةِ أَنْ يَنْفُخَ فِيهَا الرُّوحَ، وَلَيْسَ بِنَافِخٍ",
                "headingUrdu": "جس نے تصویر بنائی اس سے قیامت کے دن کہا جائے گا کہ اس میں جان ڈال دے۔",
                "headingEnglish": "Whoever makes a picture will be asked to put life into it on the Day of Resurrection",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5712,
                "hadithNumber": "5964",
                "englishNarrator": "Narrated Usama bin Zaid رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) rode a donkey saddled with a saddle covered with a Fadakiyya velvet sheet, and he made me ride behind him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ایک گدھے پر سوار ہوئے جس پر فدک کی بنی ہوئی کملی پڑی ہوئی تھی آپ نے حضرت اسامہ رضی اللہ عنہ کو اسی پر اپنے پیچھے بٹھا لیا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے ابوصفوان نے بیان کیا ، ان سے یونس بن یزید ایلی نے ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے حضرت اسامہ بن زید رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو صَفْوَانَ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَكِبَ عَلَى حِمَارٍ، عَلَى إِكَافٍ عَلَيْهِ قَطِيفَةٌ فَدَكِيَّةٌ، وَأَرْدَفَ أُسَامَةَ وَرَاءَهُ‏.‏",
                "headingArabic": "الاِرْتِدَافِ عَلَى الدَّابَّةِ",
                "headingUrdu": "کسی جانور پر ساتھی سوار کے طور پر سوار ہونا",
                "headingEnglish": "To ride as a companion-rider on an animal",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5713,
                "hadithNumber": "5965",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When the Prophet (ﷺ) arrived at Mecca, the children of Bani `Abdul Muttalib received him. He then mounted one of them in front of him and the other behind him.",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم مکہ مکرمہ تشریف لائے ( فتح کے موقع پر ) تو عبدالمطلب کی اولاد نے ( جو مکہ میں تھی ) آپ کا استقبال کیا ۔ ( یہ سب بچے ہی تھے ) آپ نے از راہ محبت ایک بچے کو اپنے سامنے اور ایک کو اپنے پیچھے بٹھا لیا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے خالد حذاء نے بیان کیا ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ اسْتَقْبَلَهُ أُغَيْلِمَةُ بَنِي عَبْدِ الْمُطَّلِبِ، فَحَمَلَ وَاحِدًا بَيْنَ يَدَيْهِ وَالآخَرَ خَلْفَهُ‏.‏",
                "headingArabic": "الثَّلاَثَةِ عَلَى الدَّابَّةِ",
                "headingUrdu": "ایک جانور پر تین (سوار)",
                "headingEnglish": "Three (riders) on one animal",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5714,
                "hadithNumber": "5966",
                "englishNarrator": "Narrated Aiyub:",
                "hadithEnglish": "The worst of three (persons riding one, animal) was mentioned in `Ikrima's presence `Ikrima said, \"Ibn `Abbas رضی اللہ عنہما said, '(In the year of the conquest of Mecca) the Prophet (ﷺ) came and mounted Qutham in front of him and Al-Fadl behind him, or Qutham behind him and Al-Fadl in front of him.' Now which of them was the worst off and which was the best?\"",
                "hadithUrdu": "عکرمہ کے سامنے یہ ذکر آیا کہ تین آدمی جو ایک جانور پر چڑھیں اس میں کون بہت برا ہے ۔ انہوں نے بیان کیا کہ ابن عباس رضی اللہ عنہما نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم ( مکہ مکرمہ ) تشریف لائے تو آپ قثم بن عباس کو اپنی سواری پر آگے اور فضل بن عباس کو پیچھے بٹھا ئے ہوئے تھے ۔ یا قثم پیچھے تھے اور فضل آگے تھے ( رضی اللہ عنہم ) اب تم ان میں سے کسے برا کہو گے اور کسے اچھا ۔",
                "urduNarrator": "مجھ سے محمدبن بشار نے بیان کیا ، کہا ہم سے عبدالوہاب نے ، کہا ہم سے ایوب سختیانی نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، ذُكِرَ الأَشَرُّ الثَّلاَثَةُ عِنْدَ عِكْرِمَةَ فَقَالَ قَالَ ابْنُ عَبَّاسٍ أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ حَمَلَ قُثَمَ بَيْنَ يَدَيْهِ، وَالْفَضْلَ خَلْفَهُ، أَوْ قُثَمَ خَلْفَهُ، وَالْفَضْلَ بَيْنَ يَدَيْهِ، فَأَيُّهُمْ شَرٌّ أَوْ أَيُّهُمْ خَيْرٌ‏.‏",
                "headingArabic": "حَمْلِ صَاحِبِ الدَّابَّةِ غَيْرَهُ بَيْنَ يَدَيْهِ",
                "headingUrdu": "جانور کے مالک کا چڑھنا اور اس کے سامنے کسی اور کا",
                "headingEnglish": "The mounting of the owner of animal and somebody else in front of him",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5715,
                "hadithNumber": "5967",
                "englishNarrator": "Narrated Mu`adh bin Jabal:",
                "hadithEnglish": "While I was riding behind the Prophet (ﷺ) and between me and him and between me and him there was only the back of the saddle, he said, \"0 Mu`adh!\" I replied, \"Labbaik, 0 Allah's Messenger (ﷺ), and Sa`daik!\" he said, \"Do you know what is Allah's right upon his slave?\" I said, \"Allah and His Apostle know best\" He said \"Allah's right upon his slaves is that they should worship Him alone and not worship anything else besides Him.\" Then he proceeded for a while and then said, \"O Mu`adh bin Jabal!\" I replied, \"Labbaik, O Allah's Messenger (ﷺ):, Sa`daik!' He said, \"Do you know what is the right of the slaves upon Allah if they do that?\" I replied, \"Allah and His Apostle know best.\" He said, \"The right of the slaves upon Allah is that He will not punish them (if they do that).",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کی سواری پر آپ کے پیچھے بیٹھا ہوا تھا اور میرے اور آنحضرت صلی اللہ علیہ وسلم کے درمیان کجاوہ کی پچھلی لکڑی کے سوا اور کوئی چیز حائل نہیں تھی اسی حالت میں آنحضرت صلی اللہ علیہ وسلم نے فرمایا یامعاذ ! میں بولا یا رسول اللہ صلی اللہ علیہ وسلم حاضر ہوں ، آپ کی اطاعت اور فرمابرداری کے لیے تیار ہوں ۔ پھر آپ نے تھوڑی دیر تک چلتے رہے ۔ اس کے بعد فرمایا یا معاذ ! میں بولا ، یا رسول اللہ ! حاضر ہوں آپ کی اطاعت کے لیے تیار ہوں ۔ پھر آپ تھوڑی دیر چلتے رہے اس کے بعد فرمایا ، یا معاذ ! میں نے عرض کیا حاضر ہوں ، یا رسول اللہ ! آپ کی اطاعت کے لیے تیار ہوں ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے فرمایا تمہیں معلوم ہے اللہ کے اپنے بندوں پر کیا حق ہیں ؟ میں نے عرض کیا اللہ اور اس کے رسول ہی کو زیادہ علم ہے حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ کے بندوں پرحق یہ ہیں کہ بندے خاص اس کی عبادت کریں اور اس کے ساتھ کسی کو شریک نہ بنائیں پھر آپ تھوڑی دیر چلتے رہے ۔ اس کے بعد فرمایا معاذ ! میں نے عرض کیا حاضر ہوں یا رسول اللہ ! آپ کی اطاعت کے لیے تیارہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تمہیں معلوم ہے بندوں کا اللہ پر کیا حق ہے ۔ جب کہ وہ یہ کام کر لیں ۔ میں نے عرض کیا اللہ اور اس کے رسول کو زیادہ علم ہے ۔ فرمایا کہ پھر بندوں کا اللہ پر حق ہے کہ وہ انہیں عذاب نہ کرے ۔",
                "urduNarrator": "ہم سے ہدبہ بن خالد نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، کہا ہم سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا ، ان سے حضرت معاذ بن جبل نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ ـ رضى الله عنه ـ قَالَ بَيْنَا أَنَا رَدِيفُ النَّبِيِّ، صلى الله عليه وسلم لَيْسَ بَيْنِي وَبَيْنَهُ إِلاَّ أَخِرَةُ الرَّحْلِ فَقَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ قَالَ ‏\"‏ هَلْ تَدْرِي مَا حَقُّ اللَّهِ عَلَى عِبَادِهِ ‏\"‏‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ حَقُّ اللَّهِ عَلَى عِبَادِهِ أَنْ يَعْبُدُوهُ وَلاَ يُشْرِكُوا بِهِ شَيْئًا ‏\"‏‏.‏ ثُمَّ سَارَ سَاعَةً ثُمَّ قَالَ ‏\"‏ يَا مُعَاذُ بْنَ جَبَلٍ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ‏.‏ فَقَالَ ‏\"‏ هَلْ تَدْرِي مَا حَقُّ الْعِبَادِ عَلَى اللَّهِ إِذَا فَعَلُوهُ ‏\"‏‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ حَقُّ الْعِبَادِ عَلَى اللَّهِ أَنْ لاَ يُعَذِّبَهُمْ ‏\"‏‏.‏",
                "headingArabic": "إِرْدَافِ الرَّجُلِ خَلْفَ الرَّجُلِ",
                "headingUrdu": "ایک آدمی کو دوسرے آدمی کے پیچھے جانور پر چڑھانا",
                "headingEnglish": "To mount a man behind another man on an animal",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5716,
                "hadithNumber": "5968",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "We were coming from Khaibar along with Allah's Messenger (ﷺ) while l was riding behind Abu Talha رضی اللہ عنہ and he was proceeding. While one of the wives of Allah's Messenger (ﷺ) was riding behind Allah's Messenger (ﷺ), suddenly the foot of the camel Slipped and I said, \"The woman!\" and alighted (hurriedly). Allah's Apostle said, \"She is your mother.\" Sol resaddled the she-camel and Allah's Messenger (ﷺ) mounted it. When he approached or saw Medina, he said, \"Ayibun, ta'ibun, 'abidun, li-Rabbina hami-dun.\"",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ خیبر سے واپس آ رہے تھے اور میں حضرت ابوطلحہ رضی اللہ عنہ کی سواری پر آپ کے پیچھے بیٹھا ہوا تھا اور چل رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم کی بعض بیوی حضرت صفیہ رضی اللہ عنہا آنحضرت صلی اللہ علیہ وسلم کی سواری پر آپ کے پیچھے تھیں کہ اچانک اونٹنی نے ٹھوکر کھائی ، میں نے کہا عورت کی خبرگیری کرو پھر میں اتر پڑا ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا یہ تمہاری ماں ہیں پھر میں نے کجاوہ مضبوط باندھا اور آنحضرت صلی اللہ علیہ وسلم سوار ہو گئے پھر جب مدینہ منورہ کے قریب ہوئے یا ( راوی نے بیان کیا کہ ) مدینہ منورہ دیکھا تو فرمایا ہم واپس ہونے والے ہیں اللہ تعالیٰ کی طرف رجوع ہونے والے ہیں ، اسی کو پوجنے والے ہیں ، اپنے مالک کی تعریف کرنے والے ہیں ۔",
                "urduNarrator": "ہم سے حسن بن محمد بن صباح نے بیان کیا ، کہا ہم سے یحییٰ بن عباد نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، انہیں یحییٰ بن ابی اسحاق نے خبر دی ، کہا کہ میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ صَبَّاحٍ، حَدَّثَنَا يَحْيَى بْنُ عَبَّادٍ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي يَحْيَى بْنُ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ قَالَ أَقْبَلْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ خَيْبَرَ، وَإِنِّي لَرَدِيفُ أَبِي طَلْحَةَ وَهْوَ يَسِيرُ وَبَعْضُ نِسَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم رَدِيفُ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ عَثَرَتِ النَّاقَةُ فَقُلْتُ الْمَرْأَةَ‏.‏ فَنَزَلْتُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهَا أُمُّكُمْ ‏\"‏‏.‏ فَشَدَدْتُ الرَّحْلَ وَرَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا دَنَا أَوْ رَأَى الْمَدِينَةَ قَالَ ‏\"‏ آيِبُونَ تَائِبُونَ، عَابِدُونَ لِرَبِّنَا، حَامِدُونَ ‏\"‏‏.‏",
                "headingArabic": "إِرْدَافِ الْمَرْأَةِ خَلْفَ الرَّجُلِ",
                "headingUrdu": "ذی محرم کے مرد کے پیچھے عورت کو سوار کرنا",
                "headingEnglish": "To mount a woman behind a man who is Dha-Mahram",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5717,
                "hadithNumber": "5969",
                "englishNarrator": "Narrated `Abbad bin Tamim's uncle:",
                "hadithEnglish": "I saw the Prophet (ﷺ) lying-down in the mosque and placing one leg on the other.",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو مسجد میں ( چت ) لیٹے ہوئے دیکھا کہ آپ ایک پاؤں کو دوسرے پاؤں پر اٹھا کر رکھے ہوئے تھے ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، کہا ہم سے ابن شہاب نے بیان کیا ، ان سے عبادہ بن تمیم نے ، ان سے ان کے چچا ( عبداللہ بن زید انصاری رضی اللہ عنہ ) نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، أَنَّهُ أَبْصَرَ النَّبِيَّ صلى الله عليه وسلم يَضْطَجِعُ فِي الْمَسْجِدِ، رَافِعًا إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى‏.‏",
                "headingArabic": "الاِسْتِلْقَاءِ وَوَضْعِ الرِّجْلِ عَلَى الأُخْرَى",
                "headingUrdu": "لیٹتے وقت ایک ٹانگ دوسری پر رکھنا",
                "headingEnglish": "To put one leg on the other while lying down",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5718,
                "hadithNumber": "5970",
                "englishNarrator": "Narrated Abi `Amr 'Ash-Shaibani:",
                "hadithEnglish": "\"The owner of this house.\" he pointed to `Abdullah's house, \"said, 'I asked the Prophet (ﷺ) 'Which deed is loved most by Allah?\" He replied, 'To offer prayers at their early (very first) stated times.' \" `Abdullah رضی اللہ عنہ  asked, \"What is the next (in goodness)?\" The Prophet (ﷺ) said, \"To be good and dutiful to one's parents,\" `Abdullah رضی اللہ عنہ asked, \"What is the next (in goodness)?\" The Prophet (ﷺ) said, \"To participate in Jihad for Allah's Cause.\" `Abdullah رضی اللہ عنہ added, \"The Prophet (ﷺ) narrated to me these three things, and if I had asked more, he would have told me more.\"",
                "hadithUrdu": "ہمیں اس گھر والے نے خبر دی اور انہوں نے اپنے ہاتھ سے عبداللہ بن مسعود رضی اللہ عنہما کے گھر کی طرف اشارہ کیا ، انہوں نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا اللہ تعالیٰ کے نزدیک کو ن سا عمل سب سے زیادہ پسند ہے ؟ آپ نے فرمایا کہ وقت پر نماز پڑھنا ۔ پوچھا کہ پھر کون سا ؟ فرمایا کہ والدین کے سا تھ اچھا سلوک کرنا ، پوچھا پھر کون سا ؟ فرمایا کہ اللہ کے راستے میں جہاد کرنا ۔ عبداللہ رضی اللہ عنہ نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے مجھ سے ان کاموں کے متعلق بیان کیا اور اگر میں اسی طرح سوال کرتا رہتا تو آپ جواب دیتے رہتے ۔",
                "urduNarrator": "ہم سے ابو الولید ہشام نے بیان کیا ، کہا ہم سے شعبہ نے ، انہوں نے کہا کہ مجھے ولید بن عیزار نے خبر دی ، کہا کہ میں نے ابوعمرو شیبانی سے سنا ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، قَالَ الْوَلِيدُ بْنُ عَيْزَارٍ أَخْبَرَنِي قَالَ سَمِعْتُ أَبَا عَمْرٍو الشَّيْبَانِيَّ، يَقُولُ أَخْبَرَنَا صَاحِبُ، هَذِهِ الدَّارِ ـ وَأَوْمَأَ بِيَدِهِ إِلَى دَارِ عَبْدِ اللَّهِ ـ قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم أَىُّ الْعَمَلِ أَحَبُّ إِلَى اللَّهِ قَالَ ‏\"‏ الصَّلاَةُ عَلَى وَقْتِهَا ‏\"‏‏.‏ قَالَ ثُمَّ أَىُّ قَالَ ‏\"‏ ثُمَّ بِرُّ الْوَالِدَيْنِ ‏\"‏‏.‏ قَالَ ثُمَّ أَىّ قَالَ ‏\"‏ الْجِهَادُ فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏ قَالَ حَدَّثَنِي بِهِنَّ وَلَوِ اسْتَزَدْتُهُ لَزَادَنِي‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏وَوَصَّيْنَا الإِنْسَانَ بِوَالِدَيْهِ‏}",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: {اور ہم نے انسانوں پر اس کے والدین کی ذمہ داری عائد کی ہے}",
                "headingEnglish": "Allah says: {And We have imposed on mankind the responsibility of his parents}",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5719,
                "hadithNumber": "5971",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "A man came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Who is more entitled to be treated with the best companionship by me?\" The Prophet (ﷺ) said, \"Your mother.\" The man said. \"Who is next?\" The Prophet said, \"Your mother.\" The man further said, \"Who is next?\" The Prophet (ﷺ) said, \"Your mother.\" The man asked for the fourth time, \"Who is next?\" The Prophet (ﷺ) said, \"Your father. \" Ibn-e-Shubrumah and Yahya bin Ayyub have reported.",
                "hadithUrdu": "ایک صحابی رسول کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ یا رسول اللہ ! میرے اچھے سلوک کا سب سے زیادہ حقدار کون ہے ؟ فرمایا کہ تمہاری ماں ہے ۔ پوچھااس کے بعد کون ہے ؟ فرمایا کہ تمہاری ماں ہے ۔ انہوں نے پھر پوچھا اس کے بعد کون ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تمہاری ماں ہے ۔ انہوں نے پوچھا اس کے بعد کون ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر تمہارا باپ ہے ۔ ابن شبرمہ اور یحییٰ بن ایوب نے بیان کیا ، کہا ہم سے ابو زرعہ نے اسی کے مطابق بیان کیا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے عمارہ بن قعقاع بن شبرمہ نے ، ان سے ابو زرعہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ بْنِ شُبْرُمَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ مَنْ أَحَقُّ بِحُسْنِ صَحَابَتِي قَالَ ‏\"‏ أُمُّكَ ‏\"‏‏.‏ قَالَ ثُمَّ مَنْ قَالَ ‏\"‏ أُمُّكَ ‏\"‏‏.‏ قَالَ ثُمَّ مَنْ قَالَ ‏\"‏ أُمُّكَ ‏\"‏‏.‏ قَالَ ثُمَّ مَنْ قَالَ ‏\"‏ ثُمَّ أَبُوكَ ‏\"‏‏.‏ وَقَالَ ابْنُ شُبْرُمَةَ وَيَحْيَى بْنُ أَيُّوبَ حَدَّثَنَا أَبُو زُرْعَةَ مِثْلَهُ‏.‏",
                "headingArabic": "مَنْ أَحَقُّ النَّاسِ بِحُسْنِ الصُّحْبَةِ",
                "headingUrdu": "بہترین صحبت کا زیادہ حقدار کون ہے؟",
                "headingEnglish": "Who is more entitled to the best companionship?",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5720,
                "hadithNumber": "5972",
                "englishNarrator": "Narrated `Abdullah bin `Amr:",
                "hadithEnglish": "A man said to the Prophet, \"Shall I participate in Jihad?\" The Prophet (ﷺ) said, \"Are your parents living?\" The man said, \"Yes.\" the Prophet (ﷺ) said, \"Do Jihad for their benefit.\"",
                "hadithUrdu": "ایک صحابی نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کیا میں بھی جہاد میں شریک ہو جاؤں ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا تمہارے ماں باپ موجود ہیں انہوں نے کہا کہ ہاں موجود ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر انہیں میں جہاد کرو ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے سفیان اور شعبہ نے بیان کیا کہ ہم سے حبیب نے بیان کیا ( دوسری سند ) امام بخاری نے کہا اور ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان نے خبر دی ، انہیں حبیب نے ، انہیں ابوعباس نے اور ان سے عبداللہ بن عمرو نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، وَشُعْبَةَ، قَالاَ حَدَّثَنَا حَبِيبٌ، ح قَالَ وَحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ حَبِيبٍ، عَنْ أَبِي الْعَبَّاسِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَجُلٌ لِلنَّبِيِّ صلى الله عليه وسلم أُجَاهِدُ‏.‏ قَالَ ‏\"‏ لَكَ أَبَوَانِ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَفِيهِمَا فَجَاهِدْ ‏\"‏‏.‏",
                "headingArabic": "لاَ يُجَاهِدُ إِلاَّ بِإِذْنِ الأَبَوَيْنِ",
                "headingUrdu": "والدین کی اجازت کے بغیر جہاد کے لیے نہیں جانا چاہیے۔",
                "headingEnglish": "One should not go for Jihad without the permission of the parents",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5721,
                "hadithNumber": "5973",
                "englishNarrator": "Narrated `Abdullah bin `Amr رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said. \"It is one of the greatest sins that a man should curse his parents.\" It was asked (by the people), \"O Allah's Messenger (ﷺ)! How does a man curse his parents?\" The Prophet (ﷺ) said, \"'The man abuses the father of another man and the latter abuses the father of the former and abuses his mother.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا یقیناً سب سے بڑے گناہوں میں سے یہ ہے کہ کوئی شخص اپنے والدین پر لعنت بھیجے ۔ پوچھا گیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! کوئی شخص اپنے ہی والدین پر کیسے لعنت بھیجے گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ شخص دوسرے کے باپ کو برا بھلا کہے گا تودوسرا بھی اس کے باپ کو اور اس کی ماں کو برا بھلا کہے گا ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والدنے ، ان سے حمید بن عبدالرحمٰن نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ أَكْبَرِ الْكَبَائِرِ أَنْ يَلْعَنَ الرَّجُلُ وَالِدَيْهِ ‏\"‏‏.‏ قِيلَ يَا رَسُولَ اللَّهِ وَكَيْفَ يَلْعَنُ الرَّجُلُ وَالِدَيْهِ قَالَ ‏\"‏ يَسُبُّ الرَّجُلُ أَبَا الرَّجُلِ، فَيَسُبُّ أَبَاهُ، وَيَسُبُّ أَمَّهُ ‏\"‏‏.‏",
                "headingArabic": "لاَ يَسُبُّ الرَّجُلُ وَالِدَيْهِ",
                "headingUrdu": "مرد کو اپنے ماں باپ کے ساتھ زیادتی نہیں کرنی چاہیے۔",
                "headingEnglish": "A man should not abuse his parents",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5722,
                "hadithNumber": "5974",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"While three persons were traveling, they were overtaken by rain and they took shelter in a cave in a mountain. A big rock fell from the mountain over the mouth of the cave and blocked it. They said to each other. 'Think of such good (righteous) deeds which, you did for Allah's sake only, and invoke Allah by giving reference to those deeds so that Allah may relieve you from your difficulty. one of them said, 'O Allah! I had my parents who were very old and I had small children for whose sake I used to work as a shepherd. When I returned to them at night and milked (the sheep), I used to start giving the milk to my parents first before giving to my children. And one day I went far away in search of a grazing place (for my sheep), and didn't return home till late at night and found that my parents had slept. I milked (my livestock) as usual and brought the milk vessel and stood at their heads, and I disliked to wake them up from their sleep, and I also disliked to give the milk to my children before my parents though my children were crying (from hunger) at my feet. So this state of mine and theirs continued till the day dawned. (O Allah!) If you considered that I had done that only for seeking Your pleasure, then please let there be an opening through which we can see the sky.' So Allah made for them an opening through which they could see the sky. Then the second person said, 'O Allah! I had a she-cousin whom I loved as much as a passionate man love a woman. I tried to seduce her but she refused till I paid her one-hundred Dinars So I worked hard till I collected one hundred Dinars and went to her with that But when I sat in between her legs (to have sexual intercourse with her), she said, 'O Allah's slave! Be afraid of Allah ! Do not deflower me except legally (by marriage contract). So I left her O Allah! If you considered that I had done that only for seeking Your pleasure then please let the rock move a little to have a (wider) opening.' So Allah shifted that rock to make the opening wider for them. And the last (third) person said 'O Allah ! I employed a laborer for wages equal to a Faraq (a certain measure: of rice, and when he had finished his job he demanded his wages, but when I presented his due to him, he gave it up and refused to take it. Then I kept on sowing that rice for him (several times) till managed to buy with the price of the yield, some cows and their shepherd Later on the laborer came to me an said. '(O Allah's slave!) Be afraid o Allah, and do not be unjust to me an give me my due.' I said (to him). 'Go and take those cows and their shepherd. So he took them and went away. (So, O Allah!) If You considered that I had done that for seeking Your pleasure, then please remove the remaining part of the rock.' And so Allah released them (from their difficulty).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تین آدمی چل رہے تھے کہ بارش نے انہیں آ لیا اور انہوں نے مڑ کر پہاڑی کی غار میں پناہ لی ۔ اس کے بعد ان کے غار کے منہ پر پہاڑ کی ایک چٹان گری اور اس کا منہ بند ہو گیا ۔ اب بعض نے بعض سے کہا کہ تم نے جو نیک کام کئے ہیں ان میں سے ایسے کام کو دھیان میں لاؤ جو تم نے خالص اللہ کے لیے کیا ہو تاکہ اللہ سے اس کے ذریعہ دعا کرو ممکن ہے وہ غار کو کھول دے ۔ اس پر ان میں سے ایک نے کہا اے اللہ ! میرے والدین تھے ان کے لیے بکریاں چراتا تھا اور واپس آ کر دودھ نکالتا تو سب سے پہلے اپنے والدین کو پلاتا تھا اپنے بچوں سے بھی پہلے ۔ ایک دن چار ے کے تلاش نے مجھے بہت دور لے جا ڈالا چنانچہ میں رات گئے واپس آیا ۔ میں نے دیکھا کہ میرے والدین سو چکے ہیں ۔ میں نے معمول کے مطابق دودھ نکالا پھر میں دوھا ہوا دودھ لے کر آیا اور ان کے سرہانے کھڑا ہو گیا میں گوارا نہیں کر سکتا تھا کہ انہیں سونے میں جگاؤں اور یہ بھی مجھ سے نہیں ہو سکتا تھا کہ والدین سے پہلے بچوں کو پلاؤں ۔ بچے بھوک سے میرے قدموں پر لوٹ رہے تھے اور اسی کشمکش میں صبح ہو گئی ۔ پس اے اللہ ! اگر تیرے علم میں بھی یہ کام میں نے صرف تیری رضا حاصل کرنے کے لیے کیا تھا تو ہمارے لیے کشادگی پیدا کر دے کہ ہم آسمان دیکھ سکیں ۔ اللہ تعالیٰ نے ( دعا قبول کی اور ) ان کے لیے اتنی کشادگی پیدا کر دی کہ وہ آسمان دیکھ سکتے تھے ۔ دوسرے شخص نے کہا اے اللہ ! میری ایک چچا زاد بہن تھی اور میں اس سے محبت کرتا تھا ، وہ انتہائی محبت جو ایک مرد ایک عورت سے کر سکتا ہے ۔ میں نے اس سے اسے مانگا تو اس نے انکار کیا اور صرف اس شرط پر راضی ہوئی کہ میں اسے سو دینار دوں ۔ میں نے دوڑ دھوپ کی اور سو دینار جمع کر لایا پھر اس کے پاس انہیں لے کر گیا پھر جب میں اس کے دونوں پاؤں کے درمیان میں بیٹھ گیا تو اس نے کہا کہ اے اللہ کے بندے ! اللہ سے ڈر اور مہر کو مت توڑ ۔ میں یہ سن کر کھڑا ہو گیا ( اور زنا سے باز رہا ) پس اگر تیرے علم میں بھی میں نے یہ کام تیری رضا وخوشنودی حاصل کرنے کے لیے کیا تھا تو ہمارے لیے کچھ اور کشادگی ( چٹان کو ہٹا کر ) پیدا کر دے ۔ چنانچہ ان کے لیے تھوڑی سی اور کشادگی ہو گئی ۔ تیسرے شخص نے کہا اے اللہ ! میں نے ایک مزدور ایک فرق چاول کی مزدوری پر رکھا تھا اس نے اپنا کام پورا کر کے کہا کہ میری مزدوری دو ۔ میں نے اس کی مزدوری دے دی لیکن وہ چھوڑ کر چلا گیا اور اس کے ساتھ بے تو جہی کی ۔ میں اس کے اس بچے ہوئے دھان کو بوتا رہا اور اس طرح میں نے اس سے ایک گائے اور اس کاچرواہا کر لیا ( پھر جب وہ آیا تو ) میں نے اس سے کہا کہ یہ گائے اور چرواہا لے جاؤ ۔ اس نے کہا اللہ سے ڈرو اور میرے ساتھ مذاق نہ کرو ۔ میں نے کہا کہ میں تمہارے ساتھ مذاق نہیں کرتا ۔ اس گائے اورچرواہے کو لے جاؤ ۔ چنانچہ وہ انہیں لے کر چلا گیا ۔ پس اگر تیرے علم میں بھی میں نے یہ کام تیری رضا وخوشنودی حاصل کرنے کے لیے کیا تھا تو ( چٹان کی وجہ سے غارسے نکلنے میں جو رکاوٹ باقی رہ گئی ہے اسے بھی کھول دے ۔ چنانچہ اللہ تعالیٰ نے ان کے لیےپوری طرح کشادگی کر دی جس سے وہ باہر آ گئے ۔",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے اسماعیل بن ابراہیم بن عقبہ نے بیان کیا ، کہا کہ مجھے نافع نے خبر دی ، انہیں حضرت ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ بْنِ عُقْبَةَ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَمَا ثَلاَثَةُ نَفَرٍ يَتَمَاشَوْنَ أَخَذَهُمُ الْمَطَرُ، فَمَالُوا إِلَى غَارٍ فِي الْجَبَلِ، فَانْحَطَّتْ عَلَى فَمِ غَارِهِمْ صَخْرَةٌ مِنَ الْجَبَلِ، فَأَطْبَقَتْ عَلَيْهِمْ، فَقَالَ بَعْضُهُمْ لِبَعْضٍ انْظُرُوا أَعْمَالاً عَمِلْتُمُوهَا لِلَّهِ صَالِحَةً، فَادْعُوا اللَّهَ بِهَا لَعَلَّهُ يَفْرُجُهَا‏.‏ فَقَالَ أَحَدُهُمُ اللَّهُمَّ إِنَّهُ كَانَ لِي وَالِدَانِ شَيْخَانِ كَبِيرَانِ، وَلِي صِبْيَةٌ صِغَارٌ كُنْتُ أَرْعَى عَلَيْهِمْ، فَإِذَا رُحْتُ عَلَيْهِمْ فَحَلَبْتُ بَدَأْتُ بِوَالِدَىَّ أَسْقِيهِمَا قَبْلَ وَلَدِي، وَإِنَّهُ نَاءَ بِيَ الشَّجَرُ فَمَا أَتَيْتُ حَتَّى أَمْسَيْتُ، فَوَجَدْتُهُمَا قَدْ نَامَا، فَحَلَبْتُ كَمَا كُنْتُ أَحْلُبُ، فَجِئْتُ بِالْحِلاَبِ فَقُمْتُ عِنْدَ رُءُوسِهِمَا، أَكْرَهُ أَنْ أُوقِظَهُمَا مِنْ نَوْمِهِمَا، وَأَكْرَهُ أَنْ أَبْدَأَ بِالصِّبْيَةِ قَبْلَهُمَا، وَالصِّبْيَةُ يَتَضَاغَوْنَ عِنْدَ قَدَمَىَّ، فَلَمْ يَزَلْ ذَلِكَ دَأْبِي وَدَأْبَهُمْ حَتَّى طَلَعَ الْفَجْرُ، فَإِنْ كُنْتَ تَعْلَمُ أَنِّي فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ، فَافْرُجْ لَنَا فُرْجَةً نَرَى مِنْهَا السَّمَاءَ، فَفَرَجَ اللَّهُ لَهُمْ فُرْجَةً حَتَّى يَرَوْنَ مِنْهَا السَّمَاءَ‏.‏ وَقَالَ الثَّانِي اللَّهُمَّ إِنَّهُ كَانَتْ لِي ابْنَةُ عَمٍّ، أُحِبُّهَا كَأَشَدِّ مَا يُحِبُّ الرِّجَالُ النِّسَاءَ، فَطَلَبْتُ إِلَيْهَا نَفْسَهَا، فَأَبَتْ حَتَّى آتِيَهَا بِمِائَةِ دِينَارٍ، فَسَعَيْتُ حَتَّى جَمَعْتُ مِائَةَ دِينَارٍ، فَلَقِيتُهَا بِهَا، فَلَمَّا قَعَدْتُ بَيْنَ رِجْلَيْهَا قَالَتْ يَا عَبْدَ اللَّهِ اتَّقِ اللَّهَ، وَلاَ تَفْتَحِ الْخَاتَمَ‏.‏ فَقُمْتُ عَنْهَا، اللَّهُمَّ فَإِنْ كُنْتَ تَعْلَمُ أَنِّي قَدْ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ لَنَا مِنْهَا فَفَرَجَ لَهُمْ فُرْجَةً‏.‏ وَقَالَ الآخَرُ اللَّهُمَّ إِنِّي كُنْتُ اسْتَأْجَرْتُ أَجِيرًا بِفَرَقِ أَرُزٍّ فَلَمَّا قَضَى عَمَلَهُ قَالَ أَعْطِنِي حَقِّي‏.‏ فَعَرَضْتُ عَلَيْهِ حَقَّهُ، فَتَرَكَهُ وَرَغِبَ عَنْهُ، فَلَمْ أَزَلْ أَزْرَعُهُ حَتَّى جَمَعْتُ مِنْهُ بَقَرًا وَرَاعِيَهَا، فَجَاءَنِي فَقَالَ اتَّقِ اللَّهَ وَلاَ تَظْلِمْنِي، وَأَعْطِنِي حَقِّي‏.‏ فَقُلْتُ اذْهَبْ إِلَى ذَلِكَ الْبَقَرِ وَرَاعِيهَا‏.‏ فَقَالَ اتَّقِ اللَّهَ وَلاَ تَهْزَأْ بِي‏.‏ فَقُلْتُ إِنِّي لاَ أَهْزَأُ بِكَ، فَخُذْ ذَلِكَ الْبَقَرَ وَرَاعِيَهَا‏.‏ فَأَخَذَهُ فَانْطَلَقَ بِهَا، فَإِنْ كُنْتَ تَعْلَمُ أَنِّي فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ، فَافْرُجْ مَا بَقِيَ، فَفَرَجَ اللَّهُ عَنْهُمْ ‏\"‏‏.‏",
                "headingArabic": "إِجَابَةِ دُعَاءِ مَنْ بَرَّ وَالِدَيْهِ",
                "headingUrdu": "اس شخص کی دعا جو اپنے والدین کے ساتھ فرض شناس ہو اگر پوری ہو۔",
                "headingEnglish": "The invocation of the person who is dutiful to his parents if fulfilled",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5723,
                "hadithNumber": "5975",
                "englishNarrator": "Narrated Al-Mughira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah has forbidden you ( 1 ) to be undutiful to your mothers (2) to withhold (what you should give) or (3) demand (what you do not deserve), and (4) to bury your daughters alive. And Allah has disliked that (A) you talk too much about others ( B), ask too many questions (in religion), or (C) waste your property.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ نے تم پر ماں کی نافرمانی حرام قرار دی ہے اور ( والدین کے حقوق ) نہ دینا اور ناحق ان سے مطالبات کرنا بھی حرام قرار دیا ہے ، لڑکیوں کو زندہ دفن کرنا ( بھی حرام قرار دیا ہے ) اور قیل وقال ( فضول باتیں ) کثرت سوال اور مال کی بربادی کو بھی ناپسند کیا ہے ۔",
                "urduNarrator": "ہم سے سعدبن حفص نے بیان کیا ، کہا ہم سے شیبان نے بیان کیا ، ان سے منصور نے ، ان سے مسیب نے ان سے وراد نے اور ان سے حضرت مغیرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ مَنْصُورٍ، عَنِ الْمُسَيَّبِ، عَنْ وَرَّادٍ، عَنِ الْمُغِيرَةِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ اللَّهَ حَرَّمَ عَلَيْكُمْ عُقُوقَ الأُمَّهَاتِ، وَمَنْعَ وَهَاتِ، وَوَأْدَ الْبَنَاتِ، وَكَرِهَ لَكُمْ قِيلَ وَقَالَ، وَكَثْرَةَ السُّؤَالِ، وَإِضَاعَةَ الْمَالِ ‏\"‏‏.‏",
                "headingArabic": "عُقُوقُ الْوَالِدَيْنِ مِنَ الْكَبَائِرِ",
                "headingUrdu": "والدین کی نافرمانی کبیرہ گناہوں میں سے ہے۔",
                "headingEnglish": "To be undutiful to parents is one of the greatest sins",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5724,
                "hadithNumber": "5976",
                "englishNarrator": "Narrated Abu Bakra رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said thrice, \"Shall I not inform you of the biggest of the great sins?\" We said, \"Yes, O Allah's Messenger (ﷺ)\" He said, \"To join partners in worship with Allah: to be undutiful to one's parents.\" The Prophet (ﷺ) sat up after he had been reclining and added, \"And I warn you against giving forged statement and a false witness; I warn you against giving a forged statement and a false witness.\" The Prophet kept on saying that warning till we thought that he would not stop.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، کیا میں تمہیں سب سے بڑا گناہ نہ بتاؤں ؟ ہم نے عرض کیا ضرور بتا یئے یا رسول اللہ ! آنحضر ت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے ساتھ شرک کرنا اور والدین کی نافرمانی کرنا ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت ٹیک لگائے ہوئے تھے اب آپ سیدھے بیٹھ گئے اور فرمایا آگاہ ہو جاؤ جھوٹی بات بھی اور جھوٹی گواہی بھی ( سب سے بڑے گناہ ہیں ) آگاہ ہو جاؤ جھوٹی بات بھی اور جھوٹی گواہی بھی ۔ آنحضرت صلی اللہ علیہ وسلم اسے مسلسل دہراتے رہے اور میں نے سوچا کہ آنحضرت صلی اللہ علیہ وسلم خاموش نہیں ہوں گے ۔",
                "urduNarrator": "مجھ سے اسحاق بن شاہین واسطی نے بیان کیا ، کہا ہم سے خالد واسطی نے بیان کیا ، ان سے جریری نے ، ان سے عبدالرحمٰن بن ابی بکرہ نے اور ان سے ان کے والد رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا خَالِدٌ الْوَاسِطِيُّ، عَنِ الْجُرَيْرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ أُنَبِّئُكُمْ بِأَكْبَرِ الْكَبَائِرِ ‏\"‏‏.‏ قُلْنَا بَلَى يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ الإِشْرَاكُ بِاللَّهِ، وَعُقُوقُ الْوَالِدَيْنِ ‏\"‏‏.‏ وَكَانَ مُتَّكِئًا فَجَلَسَ فَقَالَ ‏\"‏ أَلاَ وَقَوْلُ الزُّورِ وَشَهَادَةُ الزُّورِ، أَلاَ وَقَوْلُ الزُّورِ وَشَهَادَةُ الزُّورِ ‏\"‏‏.‏ فَمَا زَالَ يَقُولُهَا حَتَّى قُلْتُ لاَ يَسْكُتُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5725,
                "hadithNumber": "5977",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) mentioned the greatest sins or he was asked about the greatest sins. He said, \"To join partners in worship with Allah; to kill a soul which Allah has forbidden to kill; and to be undutiful or unkind to one's parents.\" The Prophet (ﷺ) added, \"Shall I inform you of the biggest of the great sins? That is the forged statement or the false witness.\" Shu`ba (the sub-narrator) states that most probably the Prophet said, \"the false witness.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کبائر کا ذکر کیا یا ( انہوں نے کہا کہ ) آنحضرت صلی اللہ علیہ وسلم سے کبائر کے متعلق پوچھا گیا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے ساتھ شرک کرنا ، کسی کی ( ناحق ) جان لینا ، والدین کی نافرمانی کرنا پھر فرمایا کیا میں تمہیں سب سے بڑا گناہ نہ بتادوں ؟ فرمایا کہ جھوٹی بات فرمایا کہ جھوٹی شہادت ( سب سے بڑا گناہ ہے ) شعبہ نے بیان کیا کہ میرا غالب گمان یہ ہے کہ آنحضرت صلی اللہ علیہ وسلم نے جھوٹی گواہی فرمایا تھا ۔",
                "urduNarrator": "مجھ سے محمد بن ولید نے بیان کیا ، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، انہوں نے کہا کہ مجھ سے عبیداللہ بن ابی بکر نے بیان کیا ، انہوں نے کہا کہ میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي بَكْرٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ قَالَ ذَكَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْكَبَائِرَ، أَوْ سُئِلَ عَنِ الْكَبَائِرِ فَقَالَ ‏\"‏ الشِّرْكُ بِاللَّهِ، وَقَتْلُ النَّفْسِ، وَعُقُوقُ الْوَالِدَيْنِ ‏\"‏‏.‏ فَقَالَ ‏\"‏ أَلاَ أُنَبِّئُكُمْ بِأَكْبَرِ الْكَبَائِرِ ـ قَالَ ـ قَوْلُ الزُّورِ ـ أَوْ قَالَ ـ شَهَادَةُ الزُّورِ ‏\"‏‏.‏ قَالَ شُعْبَةُ وَأَكْثَرُ ظَنِّي أَنَّهُ قَالَ ‏\"‏ شَهَادَةُ الزُّورِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5726,
                "hadithNumber": "5978",
                "englishNarrator": "Narrated Asma' bint Abu Bakr رضی اللہ عنہما :",
                "hadithEnglish": "My mother came to me, hoping (for my favor) during the lifetime of the Prophet. I asked the Prophet, \"May I treat her kindly?\" He replied, \"Yes.\" Ibn 'Uyaina said, \"Then Allah revealed: 'Allah forbids you not with regards to those who fought not against you because of religion, and drove you not out from your homes, that you should show them kindness and deal justly with them.'.......(60.8)",
                "hadithUrdu": "میری والدہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں میرے پاس آئیں ، وہ اسلام سے منکر تھیں ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے پوچھا کیا میں اس کے ساتھ صلہ رحمی کر سکتی ہوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ۔ اس کے بعد اللہ تعالیٰ نے یہ آیت نازل کی ” لا ینھا کم اللہ عن الذین لم یقاتلوکم فی الدین “ یعنی اللہ پاک تم کو ان لوگوں کے ساتھ نیک سلوک کرنے سے منع نہیں کرتا جو تم سے ہمارے دین کے متعلق کوئی لڑائی جھگڑا نہیں کرتے ۔",
                "urduNarrator": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، کہا مجھ کو میرے والد نے خبر دی ، انہیں اسماء بنت ابی بکر رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، أَخْبَرَنِي أَبِي، أَخْبَرَتْنِي أَسْمَاءُ ابْنَةُ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَتْ أَتَتْنِي أُمِّي رَاغِبَةً فِي عَهْدِ النَّبِيِّ صلى الله عليه وسلم فَسَأَلْتُ النَّبِيَّ صلى الله عليه وسلم آصِلُهَا قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ ابْنُ عُيَيْنَةَ فَأَنْزَلَ اللَّهُ تَعَالَى فِيهَا ‏{‏لاَ يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ لَمْ يُقَاتِلُوكُمْ فِي الدِّينِ‏}‏",
                "headingArabic": "صِلَةِ الْوَالِدِ الْمُشْرِكِ",
                "headingUrdu": "مشرک باپ کے ساتھ حسن سلوک کرنا",
                "headingEnglish": "To be good to a father who is a Mushrik",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5727,
                "hadithNumber": "5979",
                "englishNarrator": "Narrated Asma رضی اللہ عنہا :",
                "hadithEnglish": "\"My mother who was a Mushrikah (pagan, etc.), came with her father during the period of peace pact between the Muslims and the Quraish infidels. I went to seek the advice of the Prophet (ﷺ) saying, \"My mother has arrived and she is hoping (for my favor).\" The Prophet (ﷺ) said, \"Yes, be good to your mother.\"",
                "hadithUrdu": "میری والدہ مشرکہ تھیں وہ نبی کریم صلی اللہ علیہ وسلم کے قریش کے ساتھ صلح کے زمانہ میں اپنے والد کے ساتھ ( مدینہ منورہ ) آئیں ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے ان کے متعلق پوچھا کہ میری والدہ آئی ہیں اور وہ اسلام سے الگ ہیں ( کیا میں ان کے ساتھ صلہ رحمی کر سکتی ہوں ؟ ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اپنے والدہ کے ساتھ صلہ رحمی کرو ۔",
                "urduNarrator": "اور لیث نے بیان کیا کہ مجھ سے ہشام نے بیان کیا ، ان سے عروہ نے اور ان سے حضرت اسماء رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي هِشَامٌ، عَنْ عُرْوَةَ، عَنْ أَسْمَاءَ، قَالَتْ قَدِمَتْ أُمِّي وَهْىَ مُشْرِكَةٌ فِي عَهْدِ قُرَيْشٍ وَمُدَّتِهِمْ، إِذْ عَاهَدُوا النَّبِيَّ صلى الله عليه وسلم مَعَ أَبِيهَا، فَاسْتَفْتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ إِنَّ أُمِّي قَدِمَتْ وَهْىَ رَاغِبَةٌ ‏{‏أَفَأَصِلُهَا‏}‏ قَالَ ‏ \"‏ نَعَمْ صِلِي أُمَّكِ ‏\"‏‏.‏",
                "headingArabic": "صِلَةِ الْمَرْأَةِ أُمَّهَا وَلَهَا زَوْجٌ",
                "headingUrdu": "ایک عورت کی طرف سے جس کا شوہر ہو، اپنی ماں پر مہربانی",
                "headingEnglish": "Kindness by a lady who has a husband, to her mother",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5701,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=228",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=226",
                "label": "226",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=227",
                "label": "227",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=228",
                "label": "228",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=229",
                "label": "229",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=230",
                "label": "230",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=231",
                "label": "231",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=232",
                "label": "232",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=230",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=230",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=228",
        "to": 5725,
        "total": 40465
    }
}