{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 253,
        "data": [
            {
                "id": 6303,
                "hadithNumber": "6566",
                "englishNarrator": "Narrated `Imran bin Husain رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Some people will be taken out of the Fire through the intercession of Muhammad they will enter Paradise and will be called Al-Jahannamiyin (the Hell Fire people).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ایک جماعت جہنم سے ( حضرت ) محمد ( صلی اللہ علیہ وسلم ) کی شفاعت کی وجہ سے نکلے گی اور جنت میں داخل ہو گی جن کو جہنمین کے نام سے پکارا جائے گا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ نے بیان کیا ، ان سے حسن بن ذکوان نے بیان کیا ، انہوں نے کہا ہم سے ابو رجا ءنے بیان کیا ، انہوں نے کہا ہم سے عمران بن حصین رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ الْحَسَنِ بْنِ ذَكْوَانَ، حَدَّثَنَا أَبُو رَجَاءٍ، حَدَّثَنَا عِمْرَانُ بْنُ حُصَيْن ٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَخْرُجُ قَوْمٌ مِنَ النَّارِ بِشَفَاعَةِ مُحَمَّدٍ صلى الله عليه وسلم فَيَدْخُلُونَ الْجَنَّةَ، يُسَمَّوْنَ الْجَهَنَّمِيِّينَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6304,
                "hadithNumber": "6567, 6568",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Um (the mother of) Haritha رضی اللہ عنہ came to Allah's Messenger (ﷺ) after Haritha had been martyred on the Day (of the battle) of Badr by an arrow thrown by an unknown person. She said, \"O Allah's Messenger (ﷺ)! You know the position of Haritha in my heart (i.e. how dear to me he was), so if he is in Paradise, I will not weep for him, or otherwise, you will see what I will do.\" The Prophet (ﷺ) said, \"Are you mad? Is there only one Paradise? There are many Paradises, and he is in the highest Paradise of Firdaus.\"\r\nThe Prophet added, \"A forenoon journey or an after noon journey in Allah's Cause is better than the whole world and whatever is in it; and a place equal to an arrow bow of anyone of you, or a place equal to a foot in Paradise is better than the whole world and whatever is in it; and if one of the women of Paradise looked at the earth, she would fill the whole space between them (the earth and the heaven) with light, and would fill whatever is in between them, with perfume, and the veil of her face is better than the whole world and whatever is in it.\"",
                "hadithUrdu": "حارثہ بن سراقہ بن حارث رضی اللہ عنہ کی والدہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں ۔ حارثہ بدر کی لڑائی میں ایک نامعلوم تیر لگ جانے کی وجہ سے شہید ہو گئے تھے اور انہوں نے کہا ، یا رسول اللہ ! آپ کو معلوم ہے کہ حارثہ سے مجھے کتنی محبت تھی ، اگر وہ جنت میں ہے تو اس پر میں نہیں روؤں گی ، ورنہ آپ دیکھیں گے کہ میں کیا کرتی ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا ، بیوقوف ہوئی ہو ، کیا کوئی جنت ایک ہی ہے ، جنتیں تو بہت سی ہیں اور حارثہ ” فردوس اعلیٰ “ ( جنت کے اونچے درجے ) میں ہے ۔\r\n اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے راستے میں جہاد کے لیے ایک صبح یا ایک شام سفر کرنا دنیا اور جو کچھ اس میں ہے ، سے بڑھ کر ہے اور جنت میں تمہاری ایک کمان کے برابر جگہ یا ایک قدم کے فاصلے کے برابر جگہ دنیا اور جو کچھ اس میں ہے ،   اس سے بہتر ہے اور اگر جنت کی عورتوں میں سے کوئی عورت روئے زمین کی طرف جھانک کر دیکھ لے تو آسمان سے لے کر زمین تک منور کر دے اور ان تمام کو خوشبو سے بھردے اور اس کا دوپٹہ دنیا و مافیہا سے بڑھ کرہے ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ أُمَّ حَارِثَةَ، أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم وَقَدْ هَلَكَ حَارِثَةُ يَوْمَ بَدْرٍ، أَصَابَهُ غَرْبُ سَهْمٍ‏.‏ فَقَالَتْ يَا رَسُولَ اللَّهِ قَدْ عَلِمْتَ مَوْقِعَ حَارِثَةَ مِنْ قَلْبِي، فَإِنْ كَانَ فِي الْجَنَّةِ لَمْ أَبْكِ عَلَيْهِ، وَإِلاَّ سَوْفَ تَرَى مَا أَصْنَعُ‏.‏ فَقَالَ لَهَا ‏ \"‏ هَبِلْتِ، أَجَنَّةٌ وَاحِدَةٌ هِيَ إِنَّهَا جِنَانٌ كَثِيرَةٌ، وَإِنَّهُ فِي الْفِرْدَوْسِ الأَعْلَى ‏\"‏‏.\r\n (وَقَالَ ‏:‏غَدْوَةٌ فِي سَبِيلِ اللَّهِ أَوْ رَوْحَةٌ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا، وَلَقَابُ قَوْسِ أَحَدِكُمْ أَوْ مَوْضِعُ قَدَمٍ مِنَ الْجَنَّةِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا، وَلَوْ أَنَّ امْرَأَةً مِنْ نِسَاءِ أَهْلِ الْجَنَّةِ اطَّلَعَتْ إِلَى الأَرْضِ، لأَضَاءَتْ مَا بَيْنَهُمَا، وَلَمَلأَتْ مَا بَيْنَهُمَا رِيحًا، وَلَنَصِيفُهَا ـ يَعْنِي الْخِمَارَ ـ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا‏)‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6305,
                "hadithNumber": "6569",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"None will enter Paradise but will be shown the place he would have occupied in the (Hell) Fire if he had rejected faith, so that he may be more thankful; and none will enter the (Hell) Fire but will be shown the place he would have occupied in Paradise if he had faith, so that may be a cause of sorrow for him.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جنت میں جو بھی داخل ہو گا اسے اس کا جہنم کا ٹھکانا بھی دکھایا جائے گا کہ اگر نافرمانی کی ہوتی ( تو وہاں اسے جگہ ملتی ) تاکہ وہ اور زیادہ شکر کرے اور جو بھی جہنم میں داخل ہو گا اسے اس کا جنت کا ٹھکانا بھی دکھایا جائے گا کہ اگر اچھے عمل کئے ہوتے ( تو وہاں جگہ ملتی ) تاکہ اس کے لیے حسرت و افسوس کا باعث ہو ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَدْخُلُ أَحَدٌ الْجَنَّةَ إِلاَّ أُرِيَ مَقْعَدَهُ مِنَ النَّارِ، لَوْ أَسَاءَ، لِيَزْدَادَ شُكْرًا، وَلاَ يَدْخُلُ النَّارَ أَحَدٌ إِلاَّ أُرِيَ مَقْعَدَهُ مِنَ الْجَنَّةِ، لَوْ أَحْسَنَ، لِيَكُونَ عَلَيْهِ حَسْرَةً ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6306,
                "hadithNumber": "6570",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I said, \"O Allah's Messenger (ﷺ)! Who will be the luckiest person who will gain your intercession on the Day of Resurrection?\" The Prophet (ﷺ) said, \"O Abu Huraira! I have thought that none will ask me about this Hadith before you, as I know your longing for the (learning of) Hadiths. The luckiest person who will have my intercession on the Day of Resurrection will be the one who said, 'None has the right to be worshipped but Allah,' sincerely from the bottom of his heart.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا یا رسول اللہ ! قیامت کے دن آپ کی شفاعت کی سعادت سب سے زیادہ کون حاصل کرے گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اے ابوہریرہ ! میرا بھی خیال تھا کہ یہ حدیث تم سے پہلے اور کوئی مجھ سے نہیں پوچھے گا ، کیونکہ حدیث کے لینے کے لیے میں تمہاری بہت زیادہ حرص دیکھا کرتا ہوں ۔ قیامت کے دن میری شفاعت کی سعادت سب سے زیادہ اسے حاصل ہو گی جس نے کلمہ لا الہٰ الا اللہ خلوص دل سے کہا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے عمرو نے بیان کیا ، ان سے سعید بن ابی سعید مقبری نے بیان کیا ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَنْ أَسْعَدُ النَّاسِ بِشَفَاعَتِكَ يَوْمَ الْقِيَامَةِ فَقَالَ ‏ \"‏ لَقَدْ ظَنَنْتُ يَا أَبَا هُرَيْرَةَ أَنْ لاَ يَسْأَلَنِي عَنْ هَذَا الْحَدِيثِ أَحَدٌ أَوَّلُ مِنْكَ، لِمَا رَأَيْتُ مِنْ حِرْصِكَ عَلَى الْحَدِيثِ، أَسْعَدُ النَّاسِ بِشَفَاعَتِي يَوْمَ الْقِيَامَةِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ خَالِصًا مِنْ قِبَلِ نَفْسِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6307,
                "hadithNumber": "6571",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I know the person who will be the last to come out of the (Hell) Fire, and the last to enter Paradise. He will be a man who will come out of the (Hell) Fire crawling, and Allah will say to him, 'Go and enter Paradise.' He will go to it, but he will imagine that it had been filled, and then he will return and say, 'O Lord, I have found it full.' Allah will say, 'Go and enter Paradise, and you will have what equals the world and ten times as much (or, you will have as much as ten times the like of the world).' On that, the man will say, 'Do you mock at me (or laugh at me) though You are the King?\" I saw Allah's Messenger (ﷺ) (while saying that) smiling that his premolar teeth became visible. It is said that will be the lowest in degree amongst the people of Paradise.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں خوب جانتا ہوں کہ اہل جہنم میں سے کون سب سے آخر میں وہاں سے نکلے گا اور اہل جنت میں کون سب سے آخر میں اس میں داخل ہو گا ۔ ایک شخص جہنم سے گھٹنوں کے بل گھسٹتے ہوئے نکلے گا اور اللہ تعالیٰ اس سے کہے گا کہ جاؤ اور جنت میں داخل ہو جاؤ ، وہ جنت کے پاس آئے گا لیکن اسے ایسا معلوم ہو گا کہ جنت بھری ہوئی ہے ۔ چنانچہ وہ واپس آئے گا اور عرض کرے گا ، اے میرے رب ! میں نے جنت کو بھرا ہوا پایا ، اللہ تعالیٰ پھر اس سے کہے گا کہ جاؤ اور جنت میں داخل ہو جاؤ ۔ وہ پھر آئے گا لیکن اسے ایسا معلوم ہو گا کہ جنت بھری ہوئی ہے وہ واپس لوٹے گا اور عرض کرے گا کہ اے رب ! میں نے جنت کو بھرا ہوا پایا ۔ اللہ تعالیٰ فرمائے گا جاؤ اور جنت میں داخل ہو جاؤ تمہیں دنیا اور اس سے دس گنا دیا جاتا ہے یا ( اللہ تعالیٰ فرمائے گا کہ ) تمہیں دنیا کے دس گنا دیا جاتا ہے ۔ وہ شخص کہے گا تو میرا مذاق بناتا ہے حالانکہ تو شہنشاہ ہے ۔ میں نے دیکھا کہ اس بات پر رسول اللہ صلی اللہ علیہ وسلم ہنس دئیے اور آپ کے آگے کے دندان مبارک ظاہر ہو گئے اور کہا جاتا ہے کہ وہ جنت کا سب سے کم درجے والا شخص ہو گا ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے منصورنے ، ان سے ابراہیم نخعی نے ، ان سے عبیدہ سلمانی نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنِّي لأَعْلَمُ آخِرَ أَهْلِ النَّارِ خُرُوجًا مِنْهَا، وَآخِرَ أَهْلِ الْجَنَّةِ دُخُولاً رَجُلٌ يَخْرُجُ مِنَ النَّارِ كَبْوًا، فَيَقُولُ اللَّهُ اذْهَبْ فَادْخُلِ الْجَنَّةَ‏.‏ فَيَأْتِيهَا فَيُخَيَّلُ إِلَيْهِ أَنَّهَا مَلأَى، فَيَرْجِعُ فَيَقُولُ يَا رَبِّ وَجَدْتُهَا مَلأَى، فَيَقُولُ اذْهَبْ فَادْخُلِ الْجَنَّةَ‏.‏ فَيَأْتِيهَا فَيُخَيَّلُ إِلَيْهِ أَنَّهَا مَلأَى‏.‏ فَيَقُولُ يَا رَبِّ وَجَدْتُهَا مَلأَى، فَيَقُولُ اذْهَبْ فَادْخُلِ الْجَنَّةَ، فَإِنَّ لَكَ مِثْلَ الدُّنْيَا وَعَشَرَةَ أَمْثَالِهَا‏.‏ أَوْ إِنَّ لَكَ مِثْلَ عَشَرَةِ أَمْثَالِ الدُّنْيَا‏.‏ فَيَقُولُ تَسْخَرُ مِنِّي، أَوْ تَضْحَكُ مِنِّي وَأَنْتَ الْمَلِكُ ‏\"‏‏.‏ فَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ، وَكَانَ يُقَالُ ذَلِكَ أَدْنَى أَهْلِ الْجَنَّةِ مَنْزِلَةً‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6308,
                "hadithNumber": "6572",
                "englishNarrator": "Narrated `Abbas رضی اللہ عنہ :",
                "hadithEnglish": "He said to the Prophet (ﷺ) \"Did you benefit Abu Talib with anything?\"",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کیا آپ نے ابوطالب کو کوئی نفع پہنچایا ؟",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے عبدالملک نے بیان کیا ، ان سے عبداللہ بن حارث بن نوفل نے بیان کیا اور ان سے حضرت عباس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ، عَنِ الْعَبَّاسِ ـ رضى الله عنه ـ أَنَّهُ قَالَ لِلنَّبِيِّ صلى الله عليه وسلم هَلْ نَفَعْتَ أَبَا طَالِبٍ بِشَىْءٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6309,
                "hadithNumber": "6573",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Some people said, \"O Allah's Messenger (ﷺ)! Shall we see our Lord on the Day of Resurrection?\" He said, \"Do you crowd and squeeze each other on looking at the sun when it is not hidden by clouds?\" They replied, \"No, Allah's Messenger (ﷺ).\" He said, \"Do you crowd and squeeze each other on looking at the moon when it is full and not hidden by clouds?\" They replied, No, O Allah's Messenger (ﷺ)!\" He said, \"So you will see Him (your Lord) on the Day of Resurrection similarly Allah will gather all the people and say, 'Whoever used to worship anything should follow that thing. 'So, he who used to worship the sun, will follow it, and he who used to worship the moon will follow it, and he who used to worship false deities will follow them; and then only this nation (i.e., Muslims) will remain, including their hypocrites. Allah will come to them in a shape other than they know and will say, 'I am your Lord.' They will say, 'We seek refuge with Allah from you. This is our place; (we will not follow you) till our Lord comes to us, and when our Lord comes to us, we will recognize Him. Then Allah will come to then in a shape they know and will say, \"I am your Lord.' They will say, '(No doubt) You are our Lord,' and they will follow Him. Then a bridge will be laid over the (Hell) Fire.\" Allah's Messenger (ﷺ) added, \"I will be the first to cross it. And the invocation of the Apostles on that Day, will be 'Allahumma Sallim, Sallim (O Allah, save us, save us!),' and over that bridge there will be hooks Similar to the thorns of As Sa'dan (a thorny tree). Didn't you see the thorns of As-Sa'dan?\" The companions said, \"Yes, O Allah's Messenger (ﷺ).\" He added, \"So the hooks over that bridge will be like the thorns of As-Sa-dan except that their greatness in size is only known to Allah. These hooks will snatch the people according to their deeds. Some people will be ruined because of their evil deeds, and some will be cut into pieces and fall down in Hell, but will be saved afterwards, when Allah has finished the judgments among His slaves, and intends to take out of the Fire whoever He wishes to take out from among those who used to testify that none had the right to be worshipped but Allah. We will order the angels to take them out and the angels will know them by the mark of the traces of prostration (on their foreheads) for Allah banned the f ire to consume the traces of prostration on the body of Adam's son. So they will take them out, and by then they would have burnt (as coal), and then water, called Ma'ul Hayat (water of life) will be poured on them, and they will spring out like a seed springs out on the bank of a rainwater stream, and there will remain one man who will be facing the (Hell) Fire and will say, 'O Lord! It's (Hell's) vapor has Poisoned and smoked me and its flame has burnt me; please turn my face away from the Fire.' He will keep on invoking Allah till Allah says, 'Perhaps, if I give you what you want), you will ask for another thing?' The man will say, 'No, by Your Power, I will not ask You for anything else.' Then Allah will turn his face away from the Fire. The man will say after that, 'O Lord, bring me near the gate of Paradise.' Allah will say (to him), 'Didn't you promise not to ask for anything else? Woe to you, O son of Adam ! How treacherous you are!' The man will keep on invoking Allah till Allah will say, 'But if I give you that, you may ask me for something else.' The man will say, 'No, by Your Power. I will not ask for anything else.' He will give Allah his covenant and promise not to ask for anything else after that. So Allah will bring him near to the gate of Paradise, and when he sees what is in it, he will remain silent as long as Allah will, and then he will say, 'O Lord! Let me enter Paradise.' Allah will say, 'Didn't you promise that you would not ask Me for anything other than that? Woe to you, O son of Adam ! How treacherous you are!' On that, the man will say, 'O Lord! Do not make me the most wretched of Your creation,' and will keep on invoking Allah till Allah will smile and when Allah will smile because of him, then He will allow him to enter Paradise, and when he will enter Paradise, he will be addressed, 'Wish from so-and-so.' He will wish till all his wishes will be fulfilled, then Allah will say, All this (i.e. what you have wished for) and as much again therewith are for you.' \" Abu Huraira رضی اللہ عنہ added: That man will be the last of the people of Paradise to enter (Paradise).",
                "hadithUrdu": "کچھ لوگوں نے عرض کیا یا رسول اللہ ! کیا قیامت کے دن ہم اپنے رب کو دیکھ سکیں گے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیا سورج کو دیکھنے میں تمہیں کوئی دشواری ہوتی ہے جبکہ اس پر کوئی بادل ، ابر وغیرہ نہ ہو ۔ صحابہ نے عرض کیا نہیں یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، کیا جب کوئی بادل نہ ہو تو تمہیں چودہویں رات کے چاند کو دیکھنے میں کوئی دشواری ہوتی ہے ؟ صحابہ نے عرض کیا ، نہیں یا رسول اللہ ! آپ نے فرمایا کہ پھر تم اللہ تعالیٰ کو اسی طرح قیامت کے دن دیکھو گے ۔ اللہ تعالیٰ لوگوں کو جمع کرے گا اور کہے گا کہ تم میں سے جو شخص جس چیز کی پوجا پاٹ کیا کرتا تھا وہ اسی کے پیچھے لگ جائے ، چنانچہ جو لوگ سورج کی پرستش کیا کرتے تھے وہ اس کے پیچھے لگ جائیں گے اور جو لوگ چاند کی پوجا کرتے تھے وہ ان کے پیچھے ہو لیں گے ۔ جو لوگ بتوں کی پرستش کرتے تھے وہ ان کے پیچھے لگ جائیں گے اور آخر میں یہ امت باقی رہ جائے گی اور اس میں منافقین کی جماعت بھی ہو گی ، اس وقت اللہ تعالیٰ ان کے سامنے اس صورت میں آئے گا جس کو وہ پہچانتے نہ ہوں گے اور کہے گا کہ میں تمہارا رب ہوں ۔ لوگ کہیں گے تجھ سے اللہ کی پناہ ۔ ہم اپنی جگہ پر اس وقت تک رہیں گے جب تک کہ ہمارا پروردگار ہمارے سامنے نہ آئے ۔ جب ہمارا رب ہمارے پاس آئے گا تو ہم اسے پہچان لیں گے ( کیونکہ وہ حشر میں ایک بار اس کو پہلے دیکھ چکے ہوں گے ) پھر حق تعالیٰ اس صورت میں آئے گا جس کو وہ پہچانتے ہوں گے اور ان سے کہا جائے گا ( آؤ میرے ساتھ ہولو ) میں تمہارا رب ہوں ! لوگ کہیں گے کہ تو ہمارا رب ہے ، پھر اسی کے پیچھے ہو جائیں گے اور جہنم پر پل بنا دیا جائے گا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میں سب سے پہلا شخص ہوں گا جو اس پل کو پار کروں گا اور اس دن رسولوں کی دعا یہ ہو گی کہ اے اللہ ! مجھ کو سلامت رکھیو ۔ اے اللہ ! مجھ کو سلامت رکھیو اور وہاں سعدان کے کانٹوں کی طرح آنکڑے ہوں گے ۔ تم نے سعدان کے کانٹے دیکھے ہیں ؟ صحابہ کرام نے عرض کیا ہاں دیکھے ہیں یا رسول اللہ ! آپ صلی اللہ علیہ وسلم نے فرمایا وہ پھر سعدان کے کانٹوں کی طرح ہوں گے البتہ اس کی لمبائی چوڑائی اللہ کے سوا اور کوئی نہیں جانتا ۔ وہ لوگوں کو ان کے اعمال کے مطابق اچک لیں گے اور اس طرح ان میں سے بعض تو اپنے عمل کی وجہ سے ہلاک ہو جائیں گے اور بعض کا عمل رائی کے دانے کے برابر ہو گا ، پھر وہ نجات پاجائے گا ۔ آخر جب اللہ تعالیٰ اپنے بندوں کے درمیان فیصلے سے فارغ ہو جائے گا اور جہنم سے انہیں نکالنا چاہے گا جنہیں نکالنے کی اس کی مشیت ہو گی ۔ یعنی وہ جنہوں نے کلمہ لا الہٰ الا اللہ کی گواہی دی ہو گی اور اللہ تعالیٰ فرشتوں کو حکم دے گا کہ وہ ایسے لوگوں کو جہنم سے نکالیں ۔ فرشتے انہیں سجدوں کے نشانات سے پہچان لیں گے کیونکہ اللہ تعالیٰ نے آگ پر حرام کر دیا ہے کہ وہ ابن آدم کے جسم میں سجدوں کے نشان کو کھائے ۔ چنانچہ فرشتے ان لوگوں کو نکالیں گے ۔ یہ جل کر کوئلے ہو چکے ہوں گے پھر ان پر پانی چھڑکا جائے گا جسے ماء الحیاۃ ( زندگی بخشنے والا پانی ) کہتے ہیں ۔ اس وقت وہ اس طرح تروتازہ ہو جائے گے جیسے سیلاب کے بعد زرخیز زمین میں دانہ اگ آتا ہے ۔ ایک ایسا شخص باقی رہ جائے گا جس کے چہرہ جہنم کی طرف ہو گا اور وہ کہے گا اے میرے رب ! اس کی بدبوں نے مجھے پریشان کر دیا ہے اور اس کی لپٹ نے مجھے جھلسا دیا ہے اور اس کی تیزی نے مجھے جلا ڈالا ہے ، ذرا میرا منہ آگ کی طرف سے دوسری طرف پھیردے ۔ وہ اسی طرح اللہ سے دعا کرتا رہے گا ۔ آخر اللہ تعالیٰ فرمائے گا اگر میں تیرا یہ مطالبہ پورا کر دوں تو کہیں تو کوئی دوسری چیز مانگنی شروع نہ کر دے ۔ وہ شخص عرض کرے گا نہیں ، تیری عزت کی قسم ! میں اس کے سوا کوئی دوسری چیز نہیں مانگوں گا ۔ چنانچہ اس کا چہرہ جہنم کی طرف سے دوسری طرف پھیر دیا جائے گا ۔ اب اس کے بعد وہ کہے گا ۔ اے میرے رب ! مجھے جنت کے دروازے کے قریب کر دیجئیے ۔ اللہ تعالیٰ فرمائے گا کیا تو نے ابھی یقین نہیں دلایا تھا کہ اس کے سوا اور کوئی چیز نہیں مانگے گا ۔ افسوس ! اے ابن آدم ! تو بہت زیادہ وعدہ خلاف ہے ۔ پھر وہ برابر اسی طرح دعا کرتا رہے گا تو اللہ تعالیٰ فرمائے گا کہ اگر میں تیری یہ دعا قبول کر لوں تو تو پھر اس کے علاوہ کچھ اور چیز مانگنے لگے گا ۔ وہ شخص کہے گا نہیں ، تیری عزت کی قسم ! میں اس کے سوا اور کوئی چیز تجھ سے نہیں مانگوں گا اور وہ اللہ سے عہدوپیمان کرے گا کہ اس کے سوا اب کوئی اور چیز نہیں مانگے گا ۔ چنانچہ اللہ تعالیٰ اسے جنت کے دروازے کے قریب کر دے گا ۔ جب وہ جنت کے اندر کی نعمتوں کو دیکھے گا تو جتنی دیر تک اللہ تعالیٰ چاہے گا وہ شخص خاموش رہے گا ، پھر کہے گا اے میرے رب ! مجھے جنت میں داخل کر دے ۔ اللہ تعالیٰ فرمائے گا کہ کیا تو نے یہ یقین نہیں دلایا تھا کہ اب تو اس کے سوا کوئی چیز نہیں مانگے گا ۔ اے ابن آدم ! افسوس ، تو کتنا وعدہ خلاف ہے ۔ وہ شخص عرض کرے گا اے میرے رب ! مجھے اپنی مخلوق کا سب سے بدبخت بندہ نہ بنا ۔ وہ برابر دعا کرتا رہے گا یہاں تک کہ اللہ تعالیٰ ہنس دے گا ۔ جب اللہ ہنس دے گا تو اس شخص کو جنت میں داخل ہونے کی اجازت مل جائے گی ۔ جب وہ اندر چلا جائے گا تو اس سے کہا جائے گا کہ فلاں چیز کی خواہش کر چنانچہ وہ اس کی خواہش کرے گا ۔ پھر اس سے کہا جائے گا کہ فلاں چیز کی خواہش کرو ، چنانچہ وہ پھر خواہش کرے گا یہاں تک کہ اس کی خواہشات ختم ہو جائیں گی تو اللہ تعالیٰ کی طرف سے کہا جائے گا کہ تیری یہ ساری خواہشات پوری کی جاتی ہیں اور اتنی ہی زیادہ نعمتیں اور دی جاتی ہیں ۔ ابوہریرہ رضی اللہ عنہ نے اسی سند سے کہا کہ یہ شخص جنت میں سب سے آخر میں داخل ہونے والا ہو گا ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، کہا مجھ کو سعید اور عطا بن یزید نے خبر دی اور انہیں ابوہریرہ رضی اللہ عنہ نے اور انہیں نبی کریم صلی اللہ علیہ وسلم نے ( دوسری سند ) اور مجھ سے محمود بن غیلان نے بیان کیا ، کہا ہم سے عبدالرزاق بن ہمام نے ، کہا ہم کو معمر نے ، انہیں زہری نے ، انہیں عطا بن یزید لیثی نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَعِيدٌ، وَعَطَاءُ بْنُ يَزِيدَ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُمَا عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَحَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ أُنَاسٌ يَا رَسُولَ اللَّهِ هَلْ نَرَى رَبَّنَا يَوْمَ الْقِيَامَةِ فَقَالَ ‏\"‏ هَلْ تُضَارُّونَ فِي الشَّمْسِ، لَيْسَ دُونَهَا سَحَابٌ ‏\"‏‏.‏ قَالُوا لاَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ هَلْ تُضَارُّونَ فِي الْقَمَرِ لَيْلَةَ الْبَدْرِ، لَيْسَ دُونَهُ سَحَابٌ ‏\"‏‏.‏ قَالُوا لاَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَإِنَّكُمْ تَرَوْنَهُ يَوْمَ الْقِيَامَةِ كَذَلِكَ، يَجْمَعُ اللَّهُ النَّاسَ فَيَقُولُ مَنْ كَانَ يَعْبُدُ شَيْئًا فَلْيَتَّبِعْهُ، فَيَتْبَعُ مَنْ كَانَ يَعْبُدُ الشَّمْسَ، وَيَتْبَعُ مَنْ كَانَ يَعْبُدُ الْقَمَرَ، وَيَتْبَعُ مَنْ كَانَ يَعْبُدُ الطَّوَاغِيتَ، وَتَبْقَى هَذِهِ الأُمَّةُ فِيهَا مُنَافِقُوهَا، فَيَأْتِيهِمُ اللَّهُ فِي غَيْرِ الصُّورَةِ الَّتِي يَعْرِفُونَ فَيَقُولُ أَنَا رَبُّكُمْ‏.‏ فَيَقُولُونَ نَعُوذُ بِاللَّهِ مِنْكَ، هَذَا مَكَانُنَا حَتَّى يَأْتِيَنَا رَبُّنَا، فَإِذَا أَتَانَا رَبُّنَا عَرَفْنَاهُ فَيَأْتِيهِمُ اللَّهُ فِي الصُّورَةِ الَّتِي يَعْرِفُونَ فَيَقُولُ أَنَا رَبُّكُمْ‏.‏ فَيَقُولُونَ أَنْتَ رَبُّنَا، فَيَتْبَعُونَهُ وَيُضْرَبُ جِسْرُ جَهَنَّمَ ‏\"‏‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَأَكُونُ أَوَّلَ مَنْ يُجِيزُ، وَدُعَاءُ الرُّسُلِ يَوْمَئِذٍ اللَّهُمَّ سَلِّمْ سَلِّمْ، وَبِهِ كَلاَلِيبُ مِثْلُ شَوْكِ السَّعْدَانِ، أَمَا رَأَيْتُمْ شَوْكَ السَّعْدَانِ ‏\"‏‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَإِنَّهَا مِثْلُ شَوْكِ السَّعْدَانِ، غَيْرَ أَنَّهَا لاَ يَعْلَمُ قَدْرَ عِظَمِهَا إِلاَّ اللَّهُ، فَتَخْطَفُ النَّاسَ بِأَعْمَالِهِمْ، مِنْهُمُ الْمُوبَقُ، بِعَمَلِهِ وَمِنْهُمُ الْمُخَرْدَلُ، ثُمَّ يَنْجُو، حَتَّى إِذَا فَرَغَ اللَّهُ مِنَ الْقَضَاءِ بَيْنَ عِبَادِهِ، وَأَرَادَ أَنْ يُخْرِجَ مِنَ النَّارِ مَنْ أَرَادَ أَنْ يُخْرِجَ، مِمَّنْ كَانَ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، أَمَرَ الْمَلاَئِكَةَ أَنْ يُخْرِجُوهُمْ، فَيَعْرِفُونَهُمْ بِعَلاَمَةِ آثَارِ السُّجُودِ، وَحَرَّمَ اللَّهُ عَلَى النَّارِ أَنْ تَأْكُلَ مِنِ ابْنِ آدَمَ أَثَرَ السُّجُودِ، فَيُخْرِجُونَهُمْ قَدِ امْتُحِشُوا، فَيُصَبُّ عَلَيْهِمْ مَاءٌ يُقَالُ لَهُ مَاءُ الْحَيَاةِ، فَيَنْبُتُونَ نَبَاتَ الْحِبَّةِ فِي حَمِيلِ السَّيْلِ، وَيَبْقَى رَجُلٌ مُقْبِلٌ بِوَجْهِهِ عَلَى النَّارِ فَيَقُولُ يَا رَبِّ قَدْ قَشَبَنِي رِيحُهَا وَأَحْرَقَنِي ذَكَاؤُهَا، فَاصْرِفْ وَجْهِي عَنِ النَّارِ فَلاَ يَزَالُ يَدْعُو اللَّهَ‏.‏ فَيَقُولُ لَعَلَّكَ إِنْ أَعْطَيْتُكَ أَنْ تَسْأَلَنِي غَيْرَهُ‏.‏ فَيَقُولُ لاَ وَعِزَّتِكَ لاَ أَسْأَلُكَ غَيْرَهُ‏.‏ فَيَصْرِفُ وَجْهَهُ عَنِ النَّارِ، ثُمَّ يَقُولُ بَعْدَ ذَلِكَ يَا رَبِّ قَرِّبْنِي إِلَى باب الْجَنَّةِ‏.‏ فَيَقُولُ أَلَيْسَ قَدْ زَعَمْتَ أَنْ لاَ تَسْأَلْنِي غَيْرَهُ، وَيْلَكَ ابْنَ آدَمَ مَا أَغْدَرَكَ‏.‏ فَلاَ يَزَالُ يَدْعُو‏.‏ فَيَقُولُ لَعَلِّي إِنْ أَعْطَيْتُكَ ذَلِكَ تَسْأَلَنِي غَيْرَهُ‏.‏ فَيَقُولُ لاَ وَعِزَّتِكَ لاَ أَسْأَلُكَ غَيْرَهُ‏.‏ فَيُعْطِي اللَّهَ مِنْ عُهُودٍ وَمَوَاثِيقَ أَنْ لاَ يَسْأَلَهُ غَيْرَهُ، فَيُقَرِّبُهُ إِلَى باب الْجَنَّةِ، فَإِذَا رَأَى مَا فِيهَا سَكَتَ مَا شَاءَ اللَّهُ أَنْ يَسْكُتَ، ثُمَّ يَقُولُ رَبِّ أَدْخِلْنِي الْجَنَّةَ‏.‏ ثُمَّ يَقُولُ أَوَلَيْسَ قَدْ زَعَمْتَ أَنْ لاَ تَسْأَلَنِي غَيْرَهُ، وَيْلَكَ يَا ابْنَ آدَمَ مَا أَغْدَرَكَ فَيَقُولُ يَا رَبِّ لاَ تَجْعَلْنِي أَشْقَى خَلْقِكَ‏.‏ فَلاَ يَزَالُ يَدْعُو حَتَّى يَضْحَكَ، فَإِذَا ضَحِكَ مِنْهُ أَذِنَ لَهُ بِالدُّخُولِ فِيهَا، فَإِذَا دَخَلَ فِيهَا قِيلَ تَمَنَّ مِنْ كَذَا‏.‏ فَيَتَمَنَّى، ثُمَّ يُقَالُ لَهُ تَمَنَّ مِنْ كَذَا‏.‏ فَيَتَمَنَّى حَتَّى تَنْقَطِعَ بِهِ الأَمَانِيُّ فَيَقُولُ لَهُ هَذَا لَكَ وَمِثْلُهُ مَعَهُ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ وَذَلِكَ الرَّجُلُ آخِرُ أَهْلِ الْجَنَّةِ دُخُولاً‏.‏",
                "headingArabic": "الصِّرَاطُ جَسْرُ جَهَنَّمَ",
                "headingUrdu": "سیرت جہنم کے پار ایک پل ہے۔",
                "headingEnglish": "As-Sirat is a bridge across the Hell.",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6310,
                "hadithNumber": "6574",
                "englishNarrator": "Narrated 'Ata (while Abu Huraira was narrating (see previous hadith)):",
                "hadithEnglish": "Abu Sa`id رضی اللہ عنہ was sitting in the company of Abu Huraira رضی اللہ عنہ and he did not deny anything of his narration till he reached his saying: \"All this and as much again therewith are for you.\" Then Abu Sa`id رضی اللہ عنہ said, \"I heard Allah's Messenger (ﷺ) saying, 'This is for you and ten times as much.' \" Abu Huraira رضی اللہ عنہ said, \"In my memory it is 'as much again therewith.' \"",
                "hadithUrdu": "ابو سعید خدری رضی اللہ عنہ بھی اس وقت ابوہریرہ رضی اللہ عنہ کے ساتھ بیٹھے ہوئے تھے اور انہوں نے ان کی کسی بات پر اعتراض نہیں کیا لیکن جب ابوہریرہ رضی اللہ عنہ حدیث کے اس ٹکڑے تک پہنچے کہ تمہاری یہ ساری خواہشات پوری کی جاتی ہیں اور اتنی ہی اور زیادہ نعمتیں دی جاتی ہیں تو ابو سعید خدری رضی اللہ عنہ نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ” تمہاری یہ ساری خواہشات پوری کی جاتی ہیں اور اس سے دس گنا اور زیادہ نعمتیں دی جاتی ہیں ۔ اور ابوہریرہ رضی اللہ عنہ نے کہا کہ نہیں میں نے یوں ہی سنا ہے ۔ یہ سب چیزیں اور اتنی ہی اور ۔",
                "urduNarrator": "عطاء نے بیان کیا کہ",
                "hadithArabic": "قَالَ عَطَاءٌ وَأَبُو سَعِيدٍ الْخُدْرِيُّ جَالِسٌ مَعَ أَبِي هُرَيْرَةَ، لاَ يُغَيِّرُ عَلَيْهِ شَيْئًا مِنْ حَدِيثِهِ حَتَّى انْتَهَى إِلَى قَوْلِهِ ‏\"‏ هَذَا لَكَ وَمِثْلُهُ مَعَهُ ‏\"‏‏.‏ قَالَ أَبُو سَعِيدٍ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ هَذَا لَكَ وَعَشَرَةُ أَمْثَالِهِ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ حَفِظْتُ ‏\"‏ مِثْلُهُ مَعَهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6311,
                "hadithNumber": "6575",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I am your predecessor at the Lake-Fount.\"",
                "hadithUrdu": "ان سے نبی کریم صلی اللہ علیہ وسلم نے کہ میں تم سے پہلے ہی حوض پر موجود رہوں گا ۔",
                "urduNarrator": "مجھ سے یحییٰ بن حماد نے بیان کیا ، کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے سلیمان نے ، ان سے شقیق نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نےاور",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ حَمَّادٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سُلَيْمَانَ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ أَنَا فَرَطُكُمْ، عَلَى الْحَوْضِ ‏\"‏‏.‏",
                "headingArabic": "فِي الْحَوْضِ",
                "headingUrdu": "الحاد کے حوالے سے",
                "headingEnglish": "Regarding Al-Haud",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6312,
                "hadithNumber": "6576",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I am your predecessor at the Lake-Fount, and some of you will be brought in front of me till I will see them and then they will be taken away from me and I will say, 'O Lord, my companions!' It will be said, 'You do not know what they did after you had left.'  Similarly, Asim has reported from Abu Wail. Hadrat Hudhaifah رضی اللہ عنہ has reported it from the prophet ﷺ.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں اپنے حوض پر تم سے پہلے ہی موجود رہوں گا اور تم میں سے کچھ لوگ میرے سامنے لائے جائیں گے پھر انہیں میرے سامنے سے ہٹا دیا جائے گا تو میں کہوں گا کہ اے میرے رب ! یہ میرے ساتھی ہیں لیکن مجھ سے کہا جائے گا کہ آپ نہیں جانتے کہ انہوں نے آپ کے بعد دین میں کیا کیا نئی چیزیں ایجاد کر لی تھیں ۔ اس روایت کی متابعت عاصم نے ابووائل سے کی ، ان سے حذیفہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے بیان فرمایا ۔",
                "urduNarrator": "( دوسری سند ) اور مجھ سے عمرو بن علی نے بیان کیا ، کہا ہم سے محمد بن جعفر نے ، کہا ہم سے شعبہ نے ، ان سے مغیرہ نے ، کہا کہ میں نے ابووائل سے سنا اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَحَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْمُغِيرَةِ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏أَنَا فَرَطُكُمْ، عَلَى الْحَوْضِ، وَلَيُرْفَعَنَّ رِجَالٌ مِنْكُمْ ثُمَّ لَيُخْتَلَجُنَّ دُونِي فَأَقُولُ يَا رَبِّ أَصْحَابِي‏.‏ فَيُقَالُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ‏\"‏.‏ تَابَعَهُ عَاصِمٌ عَنْ أَبِي وَائِلٍ‏.‏ وَقَالَ حُصَيْنٌ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6313,
                "hadithNumber": "6577",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"There will be a tank (Lake-Fount) in front of you as large as the distance between Jarba and Adhruh (two towns in Sham).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” تمہارے سامنے ہی میرا حوض ہو گا وہ اتنا بڑا ہے جتنا جرباء اور اذرحاء کے درمیان فاصلہ ہے “ ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے عبیداللہ نے ، ان سے نافع نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَمَامَكُمْ حَوْضٌ كَمَا بَيْنَ جَرْبَاءَ وَأَذْرُحَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6314,
                "hadithNumber": "6578",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہ :",
                "hadithEnglish": "The word 'Al-Kauthar' means the abundant good which Allah gave to him (the Prophet (ﷺ) Muhammad). Abu Bishr said: I said to Sa`id, \"Some people claim that it (Al-Kauthar) is a river in Paradise.\" Sa`id replied, \"The river which is in Paradise is one item of that good which Allah has bestowed upon him (Muhammad).",
                "hadithUrdu": "کوثر سے مراد بہت زیادہ بھلائی ( خیرکثیر ) ہے جو اللہ تعالیٰ نے آنحضرت صلی اللہ علیہ وسلم کودی ہے ۔ ابوبشر نے بیان کیا کہ میں نے سعید بن جبیر سے کہا کہ بعض لوگوں کا خیال ہے کہ کوثر جنت میں ایک نہر ہے تو انہوں نے کہا کہ جو نہر جنت میں ہے وہ بھی اس خیر ( بھلائی ) کا ایک حصہ ہے جو اللہ تعالیٰ نے آنحضرت صلی اللہ علیہ وسلم کو دی ہے ۔",
                "urduNarrator": "مجھ سے عمرو بن محمد نے بیان کیا ، انہوں نے کہا ہم سے ہشیم نے بیان کیا ، انہوں نے کہا ہم کو ابوبشر اور عطاء بن سائب نے خبر دی ، انہیں سعید بن جبیر نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، وَعَطَاءُ بْنُ السَّائِبِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنه ـ قَالَ الْكَوْثَرُ الْخَيْرُ الْكَثِيرُ الَّذِي أَعْطَاهُ اللَّهُ إِيَّاهُ‏.‏ قَالَ أَبُو بِشْرٍ قُلْتُ لِسَعِيدٍ إِنَّ أُنَاسًا يَزْعُمُونَ أَنَّهُ نَهَرٌ فِي الْجَنَّةِ‏.‏ فَقَالَ سَعِيدٌ النَّهَرُ الَّذِي فِي الْجَنَّةِ مِنَ الْخَيْرِ الَّذِي أَعْطَاهُ اللَّهُ إِيَّاهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6315,
                "hadithNumber": "6579",
                "englishNarrator": "Narrated `Abdullah bin `Amr رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"My Lake-Fount is (so large that it takes) a month's journey to cross it. Its water is whiter than milk, and its smell is nicer than musk (a kind of Perfume), and its drinking cups are (as numerous) as the (number of) stars of the sky; and whoever drinks from it, will never be thirsty.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” میرا حوض ایک مہینے کی مسافت کے برابر ہو گا ۔ اس کا پانی دودھ سے زیادہ سفید اور اس کی خوشبو مشک سے زیادہ اچھی ہو گی اور اس کے کوزے آسمان کے ستاروں کی تعداد کے برابر ہوں گے ۔ جو شخص اس میں سے ایک مرتبہ پی لے گا وہ پھر کبھی بھی ( میدان محشرمیں ) پیاسا نہ ہو گا “ ۔",
                "urduNarrator": "ہم سے سعید بن مریم نے بیان کیا ، کہا ہم کو نافع بن عمر نے خبر دی ، ان سے ابن ابی ملیکہ نے بیان کیا ، ان سے عبداللہ بن عمرو رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍو قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ حَوْضِي مَسِيرَةُ شَهْرٍ، مَاؤُهُ أَبْيَضُ مِنَ اللَّبَنِ، وَرِيحُهُ أَطْيَبُ مِنَ الْمِسْكِ، وَكِيزَانُهُ كَنُجُومِ السَّمَاءِ، مَنْ شَرِبَ مِنْهَا فَلاَ يَظْمَأُ أَبَدًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6316,
                "hadithNumber": "6580",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The width of my Lake-Fount is equal to the distance between Aila (a town in Sham) and Sana' (the capital of Yemen) and it has as many (numerous) jugs as the number of stars of the sky.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” میرے حوض کی لمبائی اتنی ہو گی جتنی ایلہ اوریمن اور شہر صنعاء کے درمیان کی لمبائی ہے ۔ اور وہاں اتنی بڑی تعداد میں پیالے ہوں گے جتنی آسمان کے ستاروں کی تعداد ہے “ ۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابن وہب نے بیان کیا ، ان سے یونس نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، قَالَ ابْنُ شِهَابٍ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏(‏إِنَّ قَدْرَ حَوْضِي كَمَا بَيْنَ أَيْلَةَ وَصَنْعَاءَ مِنَ الْيَمَنِ، وَإِنَّ فِيهِ مِنَ الأَبَارِيقِ كَعَدَدِ نُجُومِ السَّمَاءِ‏)‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6317,
                "hadithNumber": "6581",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said: \"While I was walking in Paradise (on the night of Mi'raj), I saw a river, on the two banks of which there were tents made of hollow pearls. I asked, \"What is this, O Gabriel?' He said, 'That is the Kauthar which Your Lord has given to you.' Behold! Its scent or its mud was sharp smelling musk!\" (The sub-narrator, Hudba is in doubt as to the correct expression. )",
                "hadithUrdu": "ان سے نبی کریم صلی اللہ علیہ وسلم نے بیان کیا کہ میں جنت میں چل رہا تھا کہ میں ایک نہر پر پہنچا اس کے دونوں کناروں پر خولدار موتیوں کے گنبد بنے ہوئے تھے ۔ میں نے پوچھا جبرائیل ! یہ کیا ہے ؟ انہوں نے کہا یہ کوثر ہے جو آپ کے رب نے آپ کو دیا ہے ۔ میں نے دیکھا کہ اس کی خوشبو یا مٹی تیز مشک جیسی تھی ۔ راوی ہدبہ کو شک تھا ۔",
                "urduNarrator": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے ، ان سے انس رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ( دوسری سند ) اور ہم سے ہدبہ بن خالد نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، کہا ہم سے انس بن مالک رضی اللہ عنہ  نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَحَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَمَا أَنَا أَسِيرُ فِي الْجَنَّةِ إِذَا أَنَا بِنَهَرٍ حَافَتَاهُ قِبَابُ الدُّرِّ الْمُجَوَّفِ قُلْتُ مَا هَذَا يَا جِبْرِيلُ قَالَ هَذَا الْكَوْثَرُ الَّذِي أَعْطَاكَ رَبُّكَ‏.‏ فَإِذَا طِينُهُ ـ أَوْ طِيبُهُ ـ مِسْكٌ أَذْفَرُ ‏\"‏‏.‏ شَكَّ هُدْبَةُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6318,
                "hadithNumber": "6582",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Some of my companions will come to me at my Lake Fount, and after I recognize them, they will then be taken away from me, whereupon I will say, 'My companions!' Then it will be said, 'You do not know what they innovated (new things) in the religion after you.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” میرے کچھ ساتھی حوض پر میرے سامنے لائے جائیں گے اور میں انہیں پہچان لوں گا لیکن پھر وہ میرے سامنے سے ہٹادئیے جائیں گے ۔ میں اس پر کہوں گا کہ یہ تو میرے ساتھی ہیں ۔ لیکن مجھ سے کہا جائے گا کہ آپ کو معلوم نہیں کہ انہوں نے آپ کے بعد کیا کیا نئی چیزیں ایجاد کر لی تھیں “ ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے وہیب بن خالد نے بیان کیا ، کہا ہم سے عبدالعزیز نے بیان کیا ، ان سے انس رضی اللہ عنہ بیان کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيَرِدَنَّ عَلَىَّ نَاسٌ مِنْ أَصْحَابِي الْحَوْضَ، حَتَّى عَرَفْتُهُمُ اخْتُلِجُوا دُونِي، فَأَقُولُ أَصْحَابِي‏.‏ فَيَقُولُ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6319,
                "hadithNumber": "6583",
                "englishNarrator": "Narrated Abu Hazim from Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I am your predecessor (forerunner) at the Lake-Fount, and whoever will pass by there, he will drink from it and whoever will drink from it, he will never be thirsty. There will come to me some people whom I will recognize, and they will recognize me, but a barrier will be placed between me and them.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” میں اپنے حوض کوثر پر تم سے پہلے موجود رہوں گا ۔ جو شخص بھی میری طرف سے گزرے گا وہ اس کا پانی پئے گا اور جو اس کا پانی پئے گا وہ پھر کبھی پیاسا نہیں ہو گا اور وہاں کچھ ایسے لوگ بھی آئیں گے جنہیں میں پہچانوں گا اور وہ مجھے پہچانیں گےلیکن میرے اور ان کے درمیان ایک رکاوٹ حائل ہو جائے گی۔",
                "urduNarrator": "ہم سے سعید بن ابومریم نے بیان کیا ، کہا ہم سے محمد بن مطرف نے بیان کیا ، کہا کہ مجھ سے ابوحازم نے ، ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا مُحَمَّدُ بْنُ مُطَرِّفٍ، حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنِّي فَرَطُكُمْ عَلَى الْحَوْضِ، مَنْ مَرَّ عَلَىَّ شَرِبَ، وَمَنْ شَرِبَ لَمْ يَظْمَأْ أَبَدًا، لَيَرِدَنَّ عَلَىَّ أَقْوَامٌ أَعْرِفُهُمْ وَيَعْرِفُونِي، ثُمَّ يُحَالُ بَيْنِي وَبَيْنَهُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6320,
                "hadithNumber": "6584",
                "englishNarrator": "Narrated An-Nu`man bin Abi `Aiyash:",
                "hadithEnglish": "On hearing me, said. \"Did you hear this from Sahl?\" I said, \"Yes.\" He said, \" I bear witness that I heard Abu Sa`id Al-Khudri رضی اللہ عنہ saying the same, adding that the Prophet (ﷺ) said: 'I will say: They are of me (i.e. my followers). It will be said, 'You do not know what they innovated (new things) in the religion after you left'. I will say, 'Far removed, far removed (from mercy), those who changed (their religion) after me.\" Hadrat Ibn-e-Abbas says: ''سُحْقًا '' means: distance. ''سَحِيقٌ'' means faraway. ''أَسْحَقَهُ'' means: I kept him at a distance.",
                "hadithUrdu": "میری بات سن کر کہا۔ \"کیا تم نے سہل سے یہ سنا ہے؟\" میں نے کہا ہاں۔\" انہوں نے کہا کہ میں گواہی دیتا ہوں کہ میں نے ابو سعید خدری رضی اللہ عنہ سے یہ حدیث اسی طرح سنی تھی اور وہ اس حدیث میں کچھ زیادتی کے ساتھ بیان کرتے تھے ۔ ( یعنی یہ کہ آنحضرت صلی اللہ علیہ وسلم فرمائیں گے کہ ) میں کہوں گا کہ یہ تو مجھ میں سے ہیں ) آنحضرت صلی اللہ علیہ وسلم سے کہا جائے گا کہ آپ کو نہیں معلوم کہ انہوں نے آپ کے بعد دین میں کیا کیا نئی چیزیں ایجاد کر لی تھیں ۔ اس پر میں کہوں گا کہ دور ہو وہ شخص جس نے میرے بعد دین میں تبدیلی کر لی تھی ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ سحقاً بمعنی بعداً ہے ۔ سحیق یعنی بعید ، اسحقہ یعنی ابعدہ ۔",
                "urduNarrator": "ابوحازم نے بیان کیا کہ یہ حدیث مجھ سے نعمان بن ابی عیاش نے سنی اور کہا کہ",
                "hadithArabic": "قَالَ أَبُو حَازِمٍ فَسَمِعَنِي النُّعْمَانُ بْنُ أَبِي عَيَّاشٍ، فَقَالَ هَكَذَا سَمِعْتَ مِنْ، سَهْلٍ فَقُلْتُ نَعَمْ‏.‏ فَقَالَ أَشْهَدُ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ لَسَمِعْتُهُ وَهْوَ يَزِيدُ فِيهَا ‏ \"‏ فَأَقُولُ إِنَّهُمْ مِنِّي‏.‏ فَيُقَالُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ‏.‏ فَأَقُولُ سُحْقًا سُحْقًا لِمَنْ غَيَّرَ بَعْدِي ‏\"‏‏.‏ وَقَالَ ابْنُ عَبَّاسٍ سُحْقًا بُعْدًا، يُقَالُ سَحِيقٌ بَعِيدٌ، وَأَسْحَقَهُ أَبْعَدَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6321,
                "hadithNumber": "6585",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said\"On the Day of Resurrection a group of companions will come to me, but will be driven away from the Lake-Fount, and I will say, 'O Lord (those are) my companions!' It will be said, 'You have no knowledge as to what they innovated after you left; they turned apostate as renegades (reverted from Islam).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، قیامت کے دن میرے صحابہ میں سے ایک جماعت مجھ پر پیش کی جائے گی ۔ پھر وہ حوض سے دور کردےئے جائیں گے ۔ میں عرض کروں گا اے میرے رب ! یہ تو میرے صحابہ ہیں ۔ اللہ تعالیٰ فرمائے گا کہ تمہیں معلوم نہیں کہ انہوں نے تمہارے بعد کیا کیا نئی چیزیں گھڑلی تھیں ۔ یہ لوگ ( دین سے ) الٹے قدموں واپس لوٹ گئے تھے ۔",
                "urduNarrator": "احمد بن شبیب بن سعید حبطی نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، ان سے یونس نے ، ان سے ابنشہاب نے ، ان سے سعید بن مسیب نے ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ وہ بیان کرتے تھے کہ",
                "hadithArabic": "وَقَالَ أَحْمَدُ بْنُ شَبِيبِ بْنِ سَعِيدٍ الْحَبَطِيُّ حَدَّثَنَا أَبِي، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ يَرِدُ عَلَىَّ يَوْمَ الْقِيَامَةِ رَهْطٌ مِنْ أَصْحَابِي فَيُحَلَّئُونَ عَنِ الْحَوْضِ فَأَقُولُ يَا رَبِّ أَصْحَابِي‏.‏ فَيَقُولُ إِنَّكَ لاَ عِلْمَ لَكَ بِمَا أَحْدَثُوا بَعْدَكَ، إِنَّهُمُ ارْتَدُّوا عَلَى أَدْبَارِهِمُ الْقَهْقَرَى ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6322,
                "hadithNumber": "6586",
                "englishNarrator": "Narrated Ibn Al-Musaiyab:",
                "hadithEnglish": "The companions of the Prophet (ﷺ) said, \"Some men from my companions will come to my Lake-Fount and they will be driven away from it, and I will say, 'O Lord, my companions!' It will be said, 'You have no knowledge of what they innovated after you left: they turned apostate as renegades (reverted from Islam).",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، حوض پر میرے صحابہ کی ایک جماعت آئے گی ۔ پھر انہیں اس سے دور کر دیا جائے گا ۔ میں عرض کروں گا میرے رب ! یہ تو میرے صحابہ ہیں ۔ اللہ تعالیٰ فرمائے گا کہ تمہیں معلوم نہیں کہ انہوں نے تمہارے بعد کیا کیا نئی چیزیں ایجاد کر لی تھیں ، یہ الٹے پاؤس ( اسلام سے ) واپس لوٹ گئے تھے ۔",
                "urduNarrator": "ہم سے احمد بن صالح نے بیان کیا ، انہوں نے کہا ہم سے ابن وہب نے بیان کیا ، انہوں نے کہا کہ مجھ سے یونس نے خبر دی ، انہیں ابن شہاب نے ، انہیں ابن مسیب نے ، وہ نبی کریم صلی اللہ علیہ وسلم کے صحابہ سے روایت کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يُحَدِّثُ عَنْ أَصْحَابِ النَّبِيِّ، صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَرِدُ عَلَى الْحَوْضِ رِجَالٌ مِنْ أَصْحَابِي فَيُحَلَّئُونَ عَنْهُ فَأَقُولُ يَا رَبِّ أَصْحَابِي‏.‏ فَيَقُولُ إِنَّكَ لاَ عِلْمَ لَكَ بِمَا أَحْدَثُوا بَعْدَكَ، إِنَّهُمُ ارْتَدُّوا عَلَى أَدْبَارِهِمُ الْقَهْقَرَى ‏\"‏‏.‏ وَقَالَ شُعَيْبٌ عَنِ الزُّهْرِيِّ كَانَ أَبُو هُرَيْرَةَ يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم فَيُجْلَوْنَ‏.‏ وَقَالَ عُقَيْلٌ فَيُحَلَّئُونَ‏.‏ وَقَالَ الزُّبَيْدِيُّ عَنِ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6323,
                "hadithNumber": "6587",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"While I was sleeping, a group (of my followers were brought close to me), and when I recognized them, a man (an angel) came out from amongst (us) me and them, he said (to them), 'Come along.' I asked, 'Where?' He said, 'To the (Hell) Fire, by Allah' I asked, 'what is wrong with them' He said, 'They turned apostate as renegades after you left.' Then behold! (Another) group (of my followers) were brought close to me, and when I recognized them, a man (an angel) came out from (me and them) he said (to them); Come along.' I asked, \"Where?' He said, 'To the (Hell) Fire, by Allah.' I asked, What is wrong with them?' He said, 'They turned apostate as renegades after you left. So I did not see anyone of them escaping except a few who were like camels without a shepherd.\"",
                "hadithUrdu": "نبی کریم نے فرمایا میں ( حوض پر ) کھڑا ہوں گا کہ ایک جماعت میرے سامنے آئے گی اور جب میں انہیں پہچان لوں گا تو ایک شخص ( فرشتہ ) میرے اور ان کے درمیان سے نکلے گا اور ان سے کہے گا کہ ادھر آؤ ۔ میں کہوں گا کہ کدھر ؟ وہ کہے گا کہ واللہ جہنم کی طرف ۔ میں کہوں گا کہ ان کے حالات کیا ہیں ؟ وہ کہے گا کہ یہ لوگ آپ کے بعد الٹے پاؤں ( دین سے ) واپس لوٹ گئے تھے ۔ پھر ایک اور گروہ میرے سامنے آئے گا اور جب میں انہیں بھی پہچان لوں گا تو ایک شخص ( فرشتہ ) میرے اور ان کے درمیان میں سے نکلے گا اور ان سے کہے گا کہ ادھر آؤ ۔ میں پوچھوں گا کہ کہاں ؟ تو وہ کہے گا ، اللہ کی قسم جہنم کی طرف ۔ میں کہوں گا کہ ان کے حالات کیا ہیں ؟ فرشتہ کہے گا کہ یہ لوگ آپ کے بعد الٹے پاؤں واپس لوٹ گئے تھے ۔  پس میں نے ان میں سے کسی کو بھاگتے ہوئے نہیں دیکھا سوائے چند کے جو چرواہے کے بغیر اونٹوں کی طرح تھے۔\"",
                "urduNarrator": "ہم سے ابراہیم بن المنذر حزامی نے بیان کیا ، کہا ہم سے محمد بن فلیح نے بیان کیا ، کہا ہم سے ہمارے والد نے ، کہا کہ مجھ سے ہلال نے ، ان سے عطاء بن یسار نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ، حَدَّثَنَا أَبِي قَالَ، حَدَّثَنِي هِلاَلٌ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَا أَنَا قَائِمٌ إِذَا زُمْرَةٌ، حَتَّى إِذَا عَرَفْتُهُمْ خَرَجَ رَجُلٌ مِنْ بَيْنِي وَبَيْنِهِمْ فَقَالَ هَلُمَّ‏.‏ فَقُلْتُ أَيْنَ قَالَ إِلَى النَّارِ وَاللَّهِ‏.‏ قُلْتُ وَمَا شَأْنُهُمْ قَالَ إِنَّهُمُ ارْتَدُّوا بَعْدَكَ عَلَى أَدْبَارِهِمُ الْقَهْقَرَى‏.‏ ثُمَّ إِذَا زُمْرَةٌ حَتَّى إِذَا عَرَفْتُهُمْ خَرَجَ رَجُلٌ مِنْ بَيْنِي وَبَيْنِهِمْ فَقَالَ هَلُمَّ‏.‏ قُلْتُ أَيْنَ قَالَ إِلَى النَّارِ وَاللَّهِ‏.‏ قُلْتُ مَا شَأْنُهُمْ قَالَ إِنَّهُمُ ارْتَدُّوا بَعْدَكَ عَلَى أَدْبَارِهِمُ الْقَهْقَرَى‏.‏ فَلاَ أُرَاهُ يَخْلُصُ مِنْهُمْ إِلاَّ مِثْلُ هَمَلِ النَّعَمِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6324,
                "hadithNumber": "6588",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Between my house and my pulpit there is a garden from amongst the gardens of Paradise, and my pulpit is over my Lake-Fount.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میرے گھر اور میرے منبر کے درمیان کا جنت کے باغوں میں سے ایک باغ ہے اور میرا منبر میرے حوض پر ہے ۔",
                "urduNarrator": "مجھ سے ابراہیم بن المنذر نے بیان کیا ، انہوں نے کہا کہ ہم سے انس بن عیاض نے بیان کیا ، ان سے عبیداللہ نے بیان کیا ، ان سے خبیب بن عبدالرحمٰن نے ، ان سے حفص بن عاصم نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ خُبَيْبٍ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ، وَمِنْبَرِي عَلَى حَوْضِي ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6325,
                "hadithNumber": "6589",
                "englishNarrator": "Narrated Jundab رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet, saying, \"I am your predecessor at the Lake-Fount. (Al-Kauthar) .",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں حوض پر تم سے پہلے موجود ہوں گا ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، کہا مجھ کو میرے والد نے خبر دی ، انہیں شعبہ نے ، ان سے عبدالملک نے بیان کیا ، کہا کہ میں نے جندب رضی اللہ عنہ سے سنا ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ عَبْدِ الْمَلِكَ، قَالَ سَمِعْتُ جُنْدَبًا، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ أَنَا فَرَطُكُمْ، عَلَى الْحَوْضِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6326,
                "hadithNumber": "6590",
                "englishNarrator": "Narrated `Uqba bin 'Amir رضی اللہ عنہ :",
                "hadithEnglish": "Once the Prophet (ﷺ) went out and offered the funeral prayers for the martyrs of Uhud, and then went to the pulpit and said, \"I am a predecessor for you and I am a witness for you: and by Allah, I am looking at my Fount just now, and the keys of the treasures of the earth (or the keys of the earth) have been given to me: and by Allah, I am not afraid that you will worship others besides Allah after me, but I am afraid that you will strive and struggle against each other over these treasures of the world.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم باہر تشریف لائے اور شہداء احد کے لیے اس طرح دعا کی جس طرح میت کے لیے جنازہ میں دعا کی جاتی ہے ۔ پھر آپ منبر پر تشریف لائے اور فرمایا لوگو ! میں تم سے آگے جاؤں گا اور تم پر گواہ رہوں گا اور میں واللہ اپنے حوص کی طرف اس وقت بھی دیکھ رہا ہوں اور مجھے زمین کے خزانوں کی کنجیاں دی گئی ہیں یا فرمایا کہ زمین کی کنجیاں دی گئی ہیں ۔ خدا کی قسم میں تمہارے بارے میں اس بات سے نہیں ڈرتاکہ تم میرے بعد شرک کرو گے ، البتہ اس سے ڈرتا ہوں کہ تم دنیا کے لالچ میں پڑکر ایک دوسرے سے حسد کرنے لگوگے ۔",
                "urduNarrator": "ہم سے عمروبن خالد نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے یزید نے ، ان سے ابوالخیر مرثد بن عبداللہ نے اور ان سے عقبہ بن عامرص   رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلاَتَهُ عَلَى الْمَيِّتِ، ثُمَّ انْصَرَفَ عَلَى الْمِنْبَرِ فَقَالَ ‏ \"‏ إِنِّي فَرَطٌ لَكُمْ، وَأَنَا شَهِيدٌ عَلَيْكُمْ، وَإِنِّي وَاللَّهِ لأَنْظُرُ إِلَى حَوْضِي الآنَ، وَإِنِّي أُعْطِيتُ مَفَاتِيحَ خَزَائِنِ الأَرْضِ ـ أَوْ مَفَاتِيحَ الأَرْضِ ـ وَإِنِّي وَاللَّهِ مَا أَخَافُ عَلَيْكُمْ أَنْ تُشْرِكُوا بَعْدِي، وَلَكِنْ أَخَافُ عَلَيْكُمْ أَنْ تَنَافَسُوا فِيهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6327,
                "hadithNumber": "6591",
                "englishNarrator": "Narrated Haritha bin Wahb رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) mentioning the Lake-Fount (Al-Kauthar), saying, \"(The width of the Lake-Fount) is equal to the distance between Medina and Sana' (capital of Yemen).\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ۔ آنحضرت صلی اللہ علیہ وسلم نے حوض کا ذکر کیا اور فرمایا کہ ( وہ اتنا بڑا ہے ) جتنی مدینہ اور صنعاء کے درمیان دوری ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے حرمی بن عمارہ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے معبد بن خالد نے بیان کیا ، انہیں نے حارثہ بن وہب رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، أَنَّهُ سَمِعَ حَارِثَةَ بْنَ وَهْبٍ، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم وَذَكَرَ الْحَوْضَ فَقَالَ ‏ \"‏ كَمَا بَيْنَ الْمَدِينَةِ وَصَنْعَاءَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 6301,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=252",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=250",
                "label": "250",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=251",
                "label": "251",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=252",
                "label": "252",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=253",
                "label": "253",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=254",
                "label": "254",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=255",
                "label": "255",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=256",
                "label": "256",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=254",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=254",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=252",
        "to": 6325,
        "total": 40465
    }
}