{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 192,
        "data": [
            {
                "id": 4778,
                "hadithNumber": "5002",
                "englishNarrator": "Narrated `Abdullah (bin Mas`ud) رضی اللہ عنہما :",
                "hadithEnglish": "By Allah other than Whom none has the right to be worshipped! There is no Sura revealed in Allah's Book but I know at what place it was revealed; and there is no Verse revealed in Allah's Book but I know about whom it was revealed. And if I know that there is somebody who knows Allah's Book better than I, and he is at a place that camels can reach, I would go to him.",
                "hadithUrdu": "اس اللہ کی قسم جس کے سوا اور کوئی معبود نہیں کتاب اللہ کی جو سورت بھی نازل ہوئی ہے اس کے متعلق میں جانتا ہوں کہ کہاں نازل ہوئی اور کتاب اللہ کی جو آیت بھی نازل ہوئی اس کے متعلق میں جانتا ہوں کہ کس کے بارے میں نازل ہوئی ، اور اگر مجھے خبر ہو جائے کہ کوئی شخص مجھ سے زیادہ کتاب اللہ کا جاننے والا ہے اور اونٹ ہی اس کے پاس مجھے پہنچا سکتے ہیں ( یعنی ان کا گھر بہت دور ہے ) تب بھی میں سفر کر کے اس کے پاس جا کر اس سے اس علم کو حاصل کروں گا ۔",
                "urduNarrator": "ہم سے عمر بن حفص نے بیان کیا ، کہا مجھ سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا ہم سے مسلم نے بیان کیا ، ان سے مسروق نے بیان کیا کہ حضرت ابن مسعود رضی اللہ عنہما نے کہا ،",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا مُسْلِمٌ، عَنْ مَسْرُوقٍ، قَالَ قَالَ عَبْدُ اللَّهِ ـ رضى الله عنه ـ وَاللَّهِ الَّذِي لاَ إِلَهَ غَيْرُهُ مَا أُنْزِلَتْ سُورَةٌ مِنْ كِتَابِ اللَّهِ إِلاَّ أَنَا أَعْلَمُ أَيْنَ أُنْزِلَتْ وَلاَ أُنْزِلَتْ آيَةٌ مِنْ كِتَابِ اللَّهِ إِلاَّ أَنَا أَعْلَمُ فِيمَ أُنْزِلَتْ، وَلَوْ أَعْلَمُ أَحَدًا أَعْلَمَ مِنِّي بِكِتَابِ اللَّهِ تُبَلِّغُهُ الإِبِلُ لَرَكِبْتُ إِلَيْهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4779,
                "hadithNumber": "5003",
                "englishNarrator": "Narrated Qatada:",
                "hadithEnglish": "I asked Anas bin Malik رضی اللہ عنہ : \"Who collected the Qur'an at the time of the Prophet (ﷺ) ?\" He replied, \"Four, all of whom were from the Ansar: Ubai bin Ka`b, Mu`adh bin Jabal, Zaid bin Thabit and Abu Zaid.\" Fadl, Husain bin Waqid, Thumah reported likewise from Hdrat Anas  رضی اللہ عنہ .",
                "hadithUrdu": "میں نے حضرت انس بن مالک رضی اللہ عنہ سے پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں قرآن کو کن لوگوں نے جمع کیا تھا ، انہوں نے بتلایا کہ چار صحابیوں نے ، یہ چاروں قبیلہ انصار سے ہیں ۔ ابی بن کعب ، معاذبن جبل ، زید بن ثابت اور ابوزید ۔ اس روایت کی متابعت فضل نے حسین بن واقد سے کی ہے ۔ ان سے ثمامہ نے اور ان سے حضرت انس رضی اللہ عنہ نے ۔",
                "urduNarrator": "ہم سے حفص بن عمر بن غیاث نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ مَنْ جَمَعَ الْقُرْآنَ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم قَالَ أَرْبَعَةٌ كُلُّهُمْ مِنَ الأَنْصَارِ أُبَىُّ بْنُ كَعْبٍ وَمُعَاذُ بْنُ جَبَلٍ، وَزَيْدُ بْنُ ثَابِتٍ، وَأَبُو زَيْدٍ‏.‏ تَابَعَهُ الْفَضْلُ عَنْ حُسَيْنِ بْنِ وَاقِدٍ عَنْ ثُمَامَةَ عَنْ أَنَسٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4780,
                "hadithNumber": "5004",
                "englishNarrator": "Narrated Anas bin Malik:",
                "hadithEnglish": "When the Prophet (ﷺ) died, none had collected the Qur'an but four persons;: Abu Ad-Darda'. Mu`adh bin Jabal, Zaid bin Thabit and Abu Zaid. We were the inheritor (of Abu Zaid رضی اللہ عنہم ) as he had no offspring .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی وفات تک قرآن مجید کو چار صحابیوں کے سوا اور کسی نے جمع نہیں کیا تھا ۔ ابودرداء ‘ معاذ بن جبل ‘ زید بن ثابت اور ابوزید رضی اللہ عنہم ۔ حضرت انس نے کہا کہ حضرت ابوزید کے وارث ہم ہوئے ہیں ۔",
                "urduNarrator": "ہم سے معلی بن اسد نے بیان کیا ‘ کہا ہم سے عبداللہ بن مثنی نے بیان کیا ‘ کہا کہ مجھ سے ثابت بنانی اور ثمامہ نے بیان کیا اور ان سے حضرت انس نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي ثَابِتٌ الْبُنَانِيُّ، وَثُمَامَةُ، عَنْ أَنَسٍ، قَالَ مَاتَ النَّبِيُّ صلى الله عليه وسلم وَلَمْ يَجْمَعِ الْقُرْآنَ غَيْرُ أَرْبَعَةٍ أَبُو الدَّرْدَاءِ وَمُعَاذُ بْنُ جَبَلٍ وَزَيْدُ بْنُ ثَابِتٍ وَأَبُو زَيْدٍ‏.‏ قَالَ وَنَحْنُ وَرِثْنَاهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4781,
                "hadithNumber": "5005",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "`Umar رضی اللہ عنہ said, Ubai was the best of us in the recitation (of the Qur'an) yet we leave some of what he recites.' Ubai says, 'PI have taken it from the mouth of Allah's Messenger (ﷺ) and will not leave for anything whatever.\" But Allah said \"None of Our Revelations do We abrogate or cause to be forgotten but We substitute something better or similar.\" 2.106",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ نے کہا ، ابی بن کعب ہم میں سب سے اچھے قاری ہیں لیکن ابی جہاں غلطی کرتے ہیں اس کو ہم چھوڑ دیتے ہیں ( وہ بعض منسوخ التلاوۃ آیتوں کو بھی پڑھتے ہیں ) اور کہتے ہیں کہ میں نے تو اس آیت کو آنحضرت صلی اللہ علیہ وسلم کے منہ مبارک سے سنا ہے ، میں کسی کے کہنے سے اسے چھوڑنے والا نہیں اور اللہ نے خود فرمایا ہے کہ ماننسخ من آیۃ اوننسھا الآیۃ یعنی ہم جب کسی آیت کو منسوخ کر دیتے ہیں پھر یا تو اسے بھلا دیتے ہیں یا اس سے بہتر لاتے ہیں ۔",
                "urduNarrator": "ہم سے صدقہ بن فضل نے بیان کیا ، کہا ہم کو یحییٰ بن سعید قطان نے خبر دی ، انہیں سفیان ثوری نے ، انہیں حبیب بن ابی ثابت نے ، انہیں سعید بن جبیر نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا يَحْيَى، عَنْ سُفْيَانَ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ عُمَرُ أُبَىٌّ أَقْرَؤُنَا وَإِنَّا لَنَدَعُ مِنْ لَحَنِ أُبَىٍّ، وَأُبَىٌّ يَقُولُ أَخَذْتُهُ مِنْ فِي رَسُولِ اللَّهِ صلى الله عليه وسلم فَلاَ أَتْرُكُهُ لِشَىْءٍ قَالَ اللَّهُ تَعَالَى ‏{‏مَا نَنْسَخْ مِنْ آيَةٍ أَوْ نَنْسَأْهَا نَأْتِ بِخَيْرٍ مِنْهَا أَوْ مِثْلِهَا‏}‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4782,
                "hadithNumber": "5006",
                "englishNarrator": "Narrated Abu Sa`id Al-Mu'alla رضی اللہ عنہ :",
                "hadithEnglish": "While I was praying, the Prophet (ﷺ) called me but I did not respond to his call. Later I said, \"O Allah's Apostle! I was praying.\" He said, \"Didn't Allah say: 'O you who believe! Give your response to Allah (by obeying Him) and to His Apostle when he calls you'?\" (8.24) He then said, \"Shall I not teach you the most superior Surah in the Qur'an?\" He said, '(It is), 'Praise be to Allah, the Lord of the worlds. ' (i.e., Surat Al-Fatiha) which consists of seven repeatedly recited Verses and the Magnificent Qur'an which was given to me.\"",
                "hadithUrdu": "میں نماز میں مشغول تھا تو رسول کریم صلی اللہ علیہ وسلم نے مجھے بلایا اس لئے میں کوئی جواب نہیں دے سکا ، پھر میں نے ( آپ کی خدمت میں حاضر ہو کر ) عرض کیا ، یا رسول اللہ ! میں نماز پڑھ رہا تھا ۔ اس پر آنحضر ت نے فرمایا کیا اللہ تعالیٰ نے تمہیں حکم نہیں فرمایا ہے کہ اللہ کے رسول جب تمہیں پکاریں تو ان کی پکار پر فوراً اللہ کے رسول کے لئے لبیک کہا کرو ۔ “ پھر آپ نے فرمایا مسجد سے نکلنے سے پہلے قرآن کی سب سے بڑی سورت میں تمہیں کیوں نہ سکھا دوں ۔ پھر آپ نے میرا ہاتھ پکڑ لیا اور جب ہم مسجد سے باہر نکلنے لگے تو میں نے عرض کیا یا رسول اللہ ! آپ نے ابھی فرمایا تھا کہ مسجد کے باہر نکلنے سے پہلے آپ مجھے قرآن کی سب سے بڑی سورت بتائیں گے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں وہ سورت ” الحمدللہ رب العالمین “ ہے یہی وہ سات آیا ت ہیں جو ( ہر نماز میں ) باربار پڑھی جاتی ہیں اور یہی وہ ” قرآن عظیم “ ہے جو مجھے دیا گیا ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، کہا ہم سے شعبہ بن حجاج نے بیان کیا ، کہا مجھ سے حبیب بن عبدالرحمٰن نے بیان کیا ، ان سے حفص بن عاصم نے اور ان سے حضرت ابوسعید بن معلی رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي سَعِيدِ بْنِ الْمُعَلَّى، قَالَ كُنْتُ أُصَلِّي فَدَعَانِي النَّبِيُّ صلى الله عليه وسلم فَلَمْ أُجِبْهُ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ أُصَلِّي‏.‏ قَالَ ‏\"‏ أَلَمْ يَقُلِ اللَّهُ ‏{‏اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ‏}‏ ثُمَّ قَالَ أَلاَ أُعَلِّمُكَ أَعْظَمَ سُورَةٍ فِي الْقُرْآنِ قَبْلَ أَنْ تَخْرُجَ مِنَ الْمَسْجِدِ ‏\"‏‏.‏ فَأَخَذَ بِيَدِي فَلَمَّا أَرَدْنَا أَنْ نَخْرُجَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ قُلْتَ لأُعَلِّمَنَّكَ أَعْظَمَ سُورَةٍ مِنَ الْقُرْآنِ‏.‏ قَالَ ‏\"‏‏{‏الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏ هِيَ السَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُوتِيتُهُ ‏\"‏‏.‏",
                "headingArabic": "‏‏فَضْلِ‏‏ فَاتِحَةِ الْكِتَابِ",
                "headingUrdu": "فاتحہ تلکتاب کی فضیلت",
                "headingEnglish": "The superiority of Fatiha-til-Kitab",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4783,
                "hadithNumber": "5007",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "While we were on one of our journeys, we dismounted at a place where a slave girl came and said, \"The chief of this tribe has been stung by a scorpion and our men are not present; is there anybody among you who can treat him (by reciting something)?\" Then one of our men went along with her though we did not think that he knew any such treatment. But he treated the chief by reciting something, and the sick man recovered whereupon he gave him thirty sheep and gave us milk to drink (as a reward). When he returned, we asked our friend, \"Did you know how to treat with the recitation of something?\" He said, \"No, but I treated him only with the recitation of the Mother of the Book (i.e., Al-Fatiha).\" We said, \"Do not say anything (about it) till we reach or ask the Prophet (ﷺ) so when we reached Medina, we mentioned that to the Prophet (in order to know whether the sheep which we had taken were lawful to take or not). The Prophet (ﷺ) said, \"How did he come to know that it (Al-Fatiha) could be used for treatment? Distribute your reward and assign for me one share thereof as well.\" Mamar, Abdul Warith, Hisham, Mummad bin Sireen also reported it from Hadrat Abu Saeed Khudri رضی اللہ عنہ .",
                "hadithUrdu": "ہم ایک فوجی سفر میں تھے ( رات میں ) ہم نے ایک قبیلہ کے نزدیک پڑاؤ کیا ۔ پھر ایک لونڈی آئی اور کہا کہ قبیلہ کے سردار کو بچھو نے کاٹ لیا ہے اور ہمارے قبیلے کے مرد موجود نہیں ہیں ، کیا تم میں کوئی بچھو کا جھاڑ پھونک کرنے والا ہے ؟ ایک صحابی ( خود ابوسعید ) اس کے ساتھ کھڑے ہو گئے ، ہم کو معلوم تھا کہ وہ جھاڑ پھونک نہیں جانتے لیکن انہوں نے قبیلہ کے سردار کو جھاڑا تو اسے صحت ہو گئی ۔ اس نے اس کے شکر انے میں تیس بکریاں دینے کا حکم دیا اور ہمیں دودھ پلایا ۔ جب وہ جھاڑ پھونک کر کے واپس آئے تو ہم نے ان سے پوچھا کیا تم واقعی کوئی منتر جانتے ہو ؟ انہوں نے کہا کہ نہیں میں نے تو صرف سورۃ الفاتحہ پڑھ کراس پر دم کر دیا تھا ۔ ہم نے کہا کہ اچھا جب تک ہم رسول کریم صلی اللہ علیہ وسلم سے اس کے متعلق نہ پوچھ لیں ان بکریوں کے بارے میں اپنی طرف سے کچھ نہ کہو ۔ چنانچہ ہم نے مدینہ پہنچ کر آنحضور صلی اللہ علیہ وسلم سے ذکر کیا تو آپ نے فرمایا کہ انہوں نے کیسے جانا کہ سورۃ الفاتحہ منتر بھی ہے ۔ ( جاؤ یہ مال حلال ہے ) اسے تقسیم کر لو اور اس میں میرا بھی حصہ لگا نا ۔ اور معمر نے بیان کیا ہم سے عبدالوارث بن سعید نے بیان کیا ، کہا ہم سے ہشام بن حسان نے بیان کیا ، کہا ہم سے محمد بن سیرین نے بیان کیا ، کہا ہم سے معبد بن سیرین نے بیان کیا اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے یہی واقعہ بیان کیا ۔",
                "urduNarrator": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے وہب بن جریر نے بیان کیا ، کہا ہم سے ہشام بن حسان نے بیان کیا ، ان سے محمد بن سیرین نے ، ان سے معبد بن سیرین نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا وَهْبٌ، حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ مَعْبَدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ كُنَّا فِي مَسِيرٍ لَنَا فَنَزَلْنَا فَجَاءَتْ جَارِيَةٌ فَقَالَتْ إِنَّ سَيِّدَ الْحَىِّ سَلِيمٌ، وَإِنَّ نَفَرَنَا غُيَّبٌ فَهَلْ مِنْكُمْ رَاقٍ فَقَامَ مَعَهَا رَجُلٌ مَا كُنَّا نَأْبُنُهُ بِرُقْيَةٍ فَرَقَاهُ فَبَرَأَ فَأَمَرَ لَهُ بِثَلاَثِينَ شَاةً وَسَقَانَا لَبَنًا فَلَمَّا رَجَعَ قُلْنَا لَهُ أَكُنْتَ تُحْسِنُ رُقْيَةً أَوْ كُنْتَ تَرْقِي قَالَ لاَ مَا رَقَيْتُ إِلاَّ بِأُمِّ الْكِتَابِ‏.‏ قُلْنَا لاَ تُحْدِثُوا شَيْئًا حَتَّى نَأْتِيَ ـ أَوْ نَسْأَلَ ـ النَّبِيَّ صلى الله عليه وسلم فَلَمَّا قَدِمْنَا الْمَدِينَةَ ذَكَرْنَاهُ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ وَمَا كَانَ يُدْرِيهِ أَنَّهَا رُقْيَةٌ اقْسِمُوا وَاضْرِبُوا لِي بِسَهْمٍ ‏\"‏‏.‏ وَقَالَ أَبُو مَعْمَرٍ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا هِشَامٌ حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ حَدَّثَنِي مَعْبَدُ بْنُ سِيرِينَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ بِهَذَا",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4784,
                "hadithNumber": "5008",
                "englishNarrator": "Narrated Abu Mas'ud رضی اللہ عنہ :",
                "hadithEnglish": "The prophet ﷺ said, Whoever recites two verses ... (text as in the following hadith)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( سورۃ البقرہ میں سے ) جس نے بھی دو آخری آیتیں پڑھیں ۔ ( دوسری سند ) ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں سلیمان بن مہران نے ، انہیں ابراہیم نخعی نے ، انہیں عبدالرحمٰن بن یزید نے ، انہیں حضرت ابومسعود انصاری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ مَنْ قَرَأَ بِالآيَتَيْنِ‏.‏ ‏.‏‏.‏ ‏.‏",
                "headingArabic": "فَضْلُ سُورَةِ الْبَقَرَةِ",
                "headingUrdu": "سورۃ البقرہ کی فضیلت",
                "headingEnglish": "The superiority of Surat Al-Baqarah",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4785,
                "hadithNumber": "5009",
                "englishNarrator": "Narrated Abu Mas'ud رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If somebody recited the last two Verses of Surat Al-Baqara at night, that will be sufficient for him.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا جس نے سورۃ البقرہ کی دو آخری آیتیں رات میں پڑھ لیں وہ اسے ہر آفت سے بچانے کے لئے کافی ہو جائیں گی ۔",
                "urduNarrator": "اور ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے منصور بن معتمر نے ، ان سے ابراہیم نخعی نے ، ان سے عبدالرحمٰن بن یزید نے اور ان سے حضرت ابومسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ أَبِي مَسْعُودٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ قَرَأَ بِالآيَتَيْنِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ كَفَتَاهُ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4786,
                "hadithNumber": "5010",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) ordered me to guard the Zakat revenue of Ramadan. Then somebody came to me and started stealing from the foodstuff. I caught him and said, \"I will take you to Allah's Messenger (ﷺ)!\" Then Abu Huraira described the whole narration and said: That person said (to me), \"(Please don't take me to Allah's Messenger (ﷺ) and I will tell you a few words by which Allah will benefit you.) When you go to your bed, recite Ayat-al-Kursi, (2.255) for then there will be a guard from Allah who will protect you all night long, and Satan will not be able to come near you till dawn.\" (When the Prophet (ﷺ) heard the story) he said (to me), \"He (who came to you at night) told you the truth although he is a liar; and it was Satan.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے مجھے صدقہ فطر کی حفاظت پر مقرر فرمایا ۔ پھر ایک شخص آیا اور دونوں ہاتھوں سے ( کھجوریں ) سمیٹنے لگا ۔ میں نے اسے پکڑ لیا اور کہا کہ میں تجھے رسول کریم صلی اللہ علیہ وسلم کی خدمت میں پیش کروں گا ۔ پھر انہوں نے یہ پورا قصہ بیان کیا ( مفصل حدیث اس سے پہلے کتاب الوکالۃ میں گزر چکی ہے ) ( جو صدقہ فطر چرانے آیا تھا ) اس نے کہا کہ جب تم رات کو اپنے بستر پر سونے کے لئے جاؤ تو آیت الکرسی پڑھ لیا کرو ، پھر صبح تک اللہ تعالیٰ کی طرف سے تمہاری حفاظت کرنے والا ایک فرشتہ مقرر ہو جائے گا اور شیطان تمہارے پاس بھی نہ آ سکے گا ۔ ( حضرت ابوہریرہ رضی اللہ عنہ نے یہ بات آپ سے بیان کی تو ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا اس نے تمہیں یہ ٹھیک بات بتائی ہے اگرچہ وہ بڑا جھوٹا ہے ، وہ شیطان تھا ۔",
                "urduNarrator": "اور عثمان بن ہیثم نے کہا کہ ہم سے عوف بن ابی جمیلہ نے بیان کیا ، ان سے محمد بن سیرین نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ عُثْمَانُ بْنُ الْهَيْثَمِ حَدَّثَنَا عَوْفٌ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ وَكَّلَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم بِحِفْظِ زَكَاةِ رَمَضَانَ فَأَتَانِي آتٍ فَجَعَلَ يَحْثُو مِنَ الطَّعَامِ فَأَخَذْتُهُ فَقُلْتُ لأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَصَّ الْحَدِيثَ فَقَالَ إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَاقْرَأْ آيَةَ الْكُرْسِيِّ لَنْ يَزَالَ مَعَكَ مِنَ اللَّهِ حَافِظٌ وَلاَ يَقْرَبُكَ شَيْطَانٌ حَتَّى تُصْبِحَ‏.‏ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ صَدَقَكَ وَهْوَ كَذُوبٌ ذَاكَ شَيْطَانٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4787,
                "hadithNumber": "5011",
                "englishNarrator": "Narrated Al-Bara' رضی اللہ عنہ :",
                "hadithEnglish": "A man was reciting Surat Al-Kahf and his horse was tied with two ropes beside him. A cloud came down and spread over that man, and it kept on coming closer and closer to him till his horse started jumping (as if afraid of something). When it was morning, the man came to the Prophet, and told him of that experience. The Prophet (ﷺ) said, \"That was As-Sakina (tranquility) which descended because of (the recitation of) the Qur'an.\"",
                "hadithUrdu": "ایک صحابی ( اسید بن حضیر ) سورۃ الکہف پڑھ رہے تھے ۔ ان کے ایک طرف ایک گھوڑا دو رسوں سے بندھا ہوا تھا ۔ اس وقت ایک ابر اوپر سے آیا اور نزدیک سے نزدیک تر ہونے لگا ۔ ان کا گھوڑا اس کی وجہ سے بدکنے لگا ۔ پھر صبح کے وقت وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ سے اس کا ذکر کیا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ ( ابر کا ٹکڑا ) سکینہ تھا جو قرآن کی تلاوت کی وجہ سے اترا تھا ۔",
                "urduNarrator": "ہم سے عمرو بن خالد نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، کہا ہم سے ابواسحاق نے بیان کیا اور ان سے حضرت براء بن عازب رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ كَانَ رَجُلٌ يَقْرَأُ سُورَةَ الْكَهْفِ وَإِلَى جَانِبِهِ حِصَانٌ مَرْبُوطٌ بِشَطَنَيْنِ فَتَغَشَّتْهُ سَحَابَةٌ فَجَعَلَتْ تَدْنُو وَتَدْنُو وَجَعَلَ فَرَسُهُ يَنْفِرُ فَلَمَّا أَصْبَحَ أَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ فَقَالَ ‏ \"‏ تِلْكَ السَّكِينَةُ تَنَزَّلَتْ بِالْقُرْآنِ ‏\"‏‏.‏",
                "headingArabic": "فَضْلُ الْكَهْفِ",
                "headingUrdu": "سورہ کہف کی فضیلت",
                "headingEnglish": "The superiority of Surat Al-Kahf",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4788,
                "hadithNumber": "5012",
                "englishNarrator": "Narrated Aslam:",
                "hadithEnglish": "Allah's Messenger (ﷺ) was traveling on one of his journeys, and `Umar bin Al-Khattab رضی اللہ عنہ was traveling along with him at night. `Umar رضی اللہ عنہ asked him about something, but Allah's Messenger (ﷺ) did not answer him. He asked again, but he did not answer. He asked for the third time, but he did not answer. On that, `Umar رضی اللہ عنہ said to himself, \"May your mother lose you! You have asked Allah's Messenger (ﷺ) three times, but he did not answer at all!\" `Umar رضی اللہ عنہ said, \"So I made my camel go fast till I was ahead of the people, and I was afraid that something might be revealed about me. After a little while I heard a call maker calling me, I said, 'I was afraid that some Qur'anic Verse might be revealed about me.' So I went to Allah's Apostle and greeted him. He said, 'Tonight there has been revealed to me a Surah which is dearer to me than that on which the sun shines (i.e. the world).' Then he recited: 'Verily! We have given you (O Muhammad), a manifest victory.' \" (Surat al-Fath) No. (48.1).",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم رات کو ایک سفر میں جا رہے تھے ۔ حضرت عمر بن خطاب رضی اللہ عنہ بھی آپ کے ساتھ تھے ۔ حضرت عمر رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم سے کچھ پوچھا ۔ لیکن آنحضرت اس کا کوئی جواب نہ دیا ۔ حضرت عمر رضی اللہ عنہ نے پھر پوچھا آپ نے پھر کوئی جواب نہیں دیا ۔ تیسری مرتبہ پھر پوچھا اور جب اس مرتبہ بھی کوئی جواب نہیں دیا تو حضرت عمر رضی اللہ عنہ نے ( اپنے آپ کو ) کہا تیری ماں تجھ پر روئے تو نے آنحضرت صلی اللہ علیہ وسلم سے تین مرتبہ عاجزی سے سوال کیا اور آنحضرت نے کسی مرتبہ بھی جواب نہیں دیا ۔ حضرت عمر رضی اللہ عنہ نے بیان کیا کہ پھر میں نے اپنی اونٹنی کو دوڑایا اور لوگوں سے آگے ہو گیا ( آپ کے برابر چلنا چھوڑ دیا ) مجھے خوف تھا کہ کہیں اس حرکت پر میرے بارے میں کوئی آیت نازل نہ ہو جائے ابھی تھوڑا ہی وقت گزرا تھا کہ میں نے ایک پکارنے والے کو سنا جو پکار رہا تھا ۔ حضرت عمر رضی اللہ عنہ نے بیان کیا کہ میں نے سوچا مجھے تو خوف تھا ہی کہ میرے بارے میں کچھ وحی نازل ہو گی ۔ حضرت عمر رضی اللہ عنہ نے بیان کیا چنانچہ میں رسول کریم صلی اللہ علیہ وسلم کی خدمت میں آیا اور میں نے آپ کو سلام کیا ( سلام کے جواب کے بعد آنحضرت نے فرمایا کہ اے عمر ! آج رات مجھ پر ایسی سورت نازل ہوئی ہے جو مجھے ان سب چیزوں سے زیادہ پسند ہے جن پرسورج نکلتا ہے ۔ پھر آپ نے سورۃ انا فتحنا لک فتحاً مبیناً کی تلاوت فرمائی ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے زید بن اسلم نے اور ان سے ان کے والد اسلم نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَسِيرُ فِي بَعْضِ أَسْفَارِهِ وَعُمَرُ بْنُ الْخَطَّابِ يَسِيرُ مَعَهُ لَيْلاً فَسَأَلَهُ عُمَرُ عَنْ شَىْءٍ فَلَمْ يُجِبْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ سَأَلَهُ فَلَمْ يُجِبْهُ ثُمَّ سَأَلَهُ فَلَمْ يُجِبْهُ، فَقَالَ عُمَرُ ثَكِلَتْكَ أُمُّكَ نَزَرْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم ثَلاَثَ مَرَّاتٍ كُلَّ ذَلِكَ لاَ يُجِيبُكَ، قَالَ عُمَرُ فَحَرَّكْتُ بَعِيرِي حَتَّى كُنْتُ أَمَامَ النَّاسِ وَخَشِيتُ أَنْ يَنْزِلَ فِيَّ قُرْآنٌ فَمَا نَشِبْتُ أَنْ سَمِعْتُ صَارِخًا يَصْرُخُ ـ قَالَ ـ فَقُلْتُ لَقَدْ خَشِيتُ أَنْ يَكُونَ نَزَلَ فِيَّ قُرْآنٌ ـ قَالَ ـ فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَلَّمْتُ عَلَيْهِ فَقَالَ ‏\"‏ لَقَدْ أُنْزِلَتْ عَلَىَّ اللَّيْلَةَ سُورَةٌ لَهِيَ أَحَبُّ إِلَىَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ ‏\"‏‏.‏ ثُمَّ قَرَأَ ‏{‏إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا‏}‏",
                "headingArabic": "فَضْلُ سُورَةِ الْفَتْحِ",
                "headingUrdu": "سورۃ الفتح کی فضیلت",
                "headingEnglish": "The superiority of Surat Al-Fath",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4789,
                "hadithNumber": "5013",
                "englishNarrator": "Narrated Abu Said Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "A man heard another man reciting (Surat-Al-Ikhlas) 'Say He is Allah, (the) One.' (112. 1) repeatedly. The next morning he came to Allah's Messenger (ﷺ) and informed him about it as if he thought that it was not enough to recite. On that Allah's Messenger (ﷺ) said, \"By Him in Whose Hand my life is, this Surah is equal to one-third of the Qur'an!\"",
                "hadithUrdu": "ایک آدمی نے دوسرے آدمی کو (سورۃ اخلاص) پڑھتے ہوئے سنا کہ وہ رات کو سورۃ قل ھو اللہ باربار پڑھ رہے ہیں ۔ صبح ہوئی تو وہ صحابی ( ابوسعید رضی اللہ عنہ ) رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آنحضرت سے اس کا ذکر کیا گویا انہوں نے سمجھا کہ اس میں کوئی بڑا ثواب نہ ہو گا ۔ آنحضرت نے فرمایا کہ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ! یہ سورت قرآن مجید کے ایک تہائی حصہ کے برابر ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم کوامام مالک نے خبر دی ، انہیں عبدالرحمٰن بن عبداللہ بن عبدالرحمٰن بن ابی صعصعہ نے ، انہیں ان کے والد عبداللہ نے اور انہیں حضرت ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَجُلاً، سَمِعَ رَجُلاً، يَقْرَأُ ‏{‏قُلْ هُوَ اللَّهُ أَحَدٌ‏}‏ يُرَدِّدُهَا فَلَمَّا أَصْبَحَ جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ وَكَأَنَّ الرَّجُلَ يَتَقَالُّهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهَا لَتَعْدِلُ ثُلُثَ الْقُرْآنِ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ قُلْ هُوَ اللَّهُ أَحَدٌ",
                "headingUrdu": "قل ھو اللہ احد کی فضیلت (سورۃ اخلاص)",
                "headingEnglish": "The superiority of Qul-Huwa Allahu Ahad (Surat Al-Ikhlas)",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4790,
                "hadithNumber": "5014",
                "englishNarrator": "Narrated Abu Said Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "My brother, Qatada bin An-Nau'man رضی اللہ عنہ said, \"A man performed the night prayer late at night in the lifetime of the Prophet (ﷺ) and he read: 'Say: He is Allah, (the) One,' (112.1) and read nothing besides that. The next morning a man went to the Prophet (ﷺ) ,~ and told him about that . (The Prophet (ﷺ) replied the same as (in Hadith 532) above.)",
                "hadithUrdu": "مجھے میرے بھائی حضرت قتادہ بن نعمان رضی اللہ عنہ نے خبر دی کہ ایک صحابی نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں سحری کے وقت سے کھڑے قل ھو اللہ احد پڑھتے رہے ۔ ان کے سوا اور کچھ نہیں پڑھتے تھے ۔ پھر جب صبح ہوئی تو دوسرے صحابی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ( باقی حصہ ) پچھلی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "اور ابو معمر ( عبداللہ بن عمرو منقری ) نے اتنا زیادہ کیا کہ ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے امام مالک بن انس نے ، ان سے عبدالرحمٰن بن عبداللہ بن عبدالرحمٰن بن ابی صعصعہ نے ، ان سے ان کے والد نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "وَزَادَ أَبُو مَعْمَرٍ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَخْبَرَنِي أَخِي، قَتَادَةُ بْنُ النُّعْمَانِ أَنَّ رَجُلاً، قَامَ فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم يَقْرَأُ مِنَ السَّحَرِ ‏{‏قُلْ هُوَ اللَّهُ أَحَدٌ‏}‏ لاَ يَزِيدُ عَلَيْهَا، فَلَمَّا أَصْبَحْنَا أَتَى رَجُلٌ النَّبِيَّ صلى الله عليه وسلم نَحْوَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4791,
                "hadithNumber": "5015",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said to his companions, \"Is it difficult for any of you to recite one third of the Qur'an in one night?\" This suggestion was difficult for them so they said, \"Who among us has the power to do so, O Allah's Messenger (ﷺ)?\" Allah Apostle replied: \" Allah (the) One, the Self-Sufficient Master Whom all creatures need.' (Surat Al-Ikhlas 112.1--to the End) is equal to one third of the Qur'an.\" Imam Abu Abdullah (Imam Bukhari) has recorded it incompletely transmitted from Ibrahim and transmitted with complete chain from Dahhak Mashriqi.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اپنے صحابہ سے فرمایا کیا تم میں سے کسی کے لئے یہ ممکن نہیں کہ قرآن کا ایک تہائی حصہ ایک رات میں پڑھا کرے ۔ صحابہ کو یہ عمل بڑا مشکل معلوم ہوا اور انہوں نے عرض کیا یا رسول اللہ ! ہم میں سے کون اس کی طاقت رکھتا ہے ۔ آنحضرت نے اس پر فرمایا کہ قل ھو اللہ احد اللہ الصمد قرآن مجید کا ایک تہائی حصہ ہے ۔ محمد بن یوسف فربری نے بیان کیا کہ میں نے حضرت ابوعبداللہ امام بخاری کے کاتب ابو جعفر محمد بن ابی حاتم سے سنا ، وہ کہتے تھے کہ امام بخاری نے کہا ابراہیم نخعی کی روایت حضرت ابو سعید خدری رضی اللہ عنہ سے منقطع ہے ( ابراہیم نے ابوسعید سے نہیں سنا ) لیکن ضحاک مشرقی کی روایت ابوسعید سے متصل ہے ۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا مجھ سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا ہم سے ابراہیم نخعی اور ضحاک مشرقی نے بیان کیا اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا إِبْرَاهِيمُ، وَالضَّحَّاكُ الْمَشْرِقِيُّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، رضى الله عنه قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لأَصْحَابِهِ ‏\"‏ أَيَعْجِزُ أَحَدُكُمْ أَنْ يَقْرَأَ ثُلُثَ الْقُرْآنِ فِي لَيْلَةٍ ‏\"‏‏.‏ فَشَقَّ ذَلِكَ عَلَيْهِمْ وَقَالُوا أَيُّنَا يُطِيقُ ذَلِكَ يَا رَسُولَ اللَّهِ فَقَالَ ‏\"‏ اللَّهُ الْوَاحِدُ الصَّمَدُ ثُلُثُ الْقُرْآنِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ عَنْ إِبْرَاهِيمَ مُرْسَلٌ وَعَنِ الضَّحَّاكِ الْمَشْرِقِيِّ مُسْنَدٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4792,
                "hadithNumber": "5016",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Whenever Allah's Messenger (ﷺ) became sick, he would recite Mu'awwidhat (Surat Al-Falaq and Surat An- Nas) and then blow his breath over his body. When he became seriously ill, I used to recite (these two Suras) and rub his hands over his body hoping for its blessings.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم جب بیمار پڑتے تو معوذات کی سورتیں پڑھ کر اسے اپنے اوپر دم کرتے ( اس طرح کہ ہوا کے ساتھ کچھ تھوک بھی نکلتا ) پھر جب ( مرض الموت میں ) آپ کی تکلیف بڑھ گئی تو میں ان سورتوں کو پڑھ کر آنحضور صلی اللہ علیہ وسلم کے ہاتھوں سے برکت کی امید میں آپ کے جسم مبارک پر پھیر تی تھی ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم کو امام ما لک نے خبر دی ، انہیں ابن شہاب نے ، انہیں عروہ بن زبیر نے اور انہیں عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا اشْتَكَى يَقْرَأُ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ وَيَنْفُثُ، فَلَمَّا اشْتَدَّ وَجَعُهُ كُنْتُ أَقْرَأُ عَلَيْهِ وَأَمْسَحُ بِيَدِهِ رَجَاءَ بَرَكَتِهَا‏.‏",
                "headingArabic": "فَضْلِ‏‏ الْمُعَوِّذَاتِ",
                "headingUrdu": "المعوذات کی فضیلت (سورۃ الفلق اور سورۃ الناس) (نمبر 113 اور 114)",
                "headingEnglish": "The superiority of Al-Mu’awwidhat (Surat Al-Falaq and Surat An-Nas) (No.113 & 114)",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4793,
                "hadithNumber": "5017",
                "englishNarrator": "Narrated 'Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Whenever the Prophet (ﷺ) went to bed every night, he used to cup his hands together and blow over it after reciting Surat Al-Ikhlas, Surat Al-Falaq and Surat An-Nas, and then rub his hands over whatever parts of his body he was able to rub, starting with his head, face and front of his body. He used to do that three times.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ہر رات جب بستر پر آرام فرماتے تو اپنی دونوں ہتھیلیوں کو ملا کر قل ھو اللہ احد ، قل اعوذ برب الفلق اور قل اعوذ برب الناس ( تینوں سورتیں مکمل ) پڑھ کر ان پرپھونکتے اور پھر دونوں ہتھیلیوں کو جہا ں تک ممکن ہوتا اپنے جسم پر پھیرتے تھے ۔ پہلے سر اور چہرہ پر ہاتھ پھیرتے اور سامنے کے بدن پر ۔ یہ عمل آپ تین دفعہ کرتے تھے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے مفضل بن فضالہ نے بیان کیا ، انہوں نے کہا ہم سے عقیل بن خالد نے بیان کیا ، انہوں نے کہا ہم سے ابن شہاب نے بیان کیا ، ان سے عروہ نے بیان کیا ، اور ان سے ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُفَضَّلُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا أَوَى إِلَى فِرَاشِهِ كُلَّ لَيْلَةٍ جَمَعَ كَفَّيْهِ ثُمَّ نَفَثَ فِيهِمَا فَقَرَأَ فِيهِمَا ‏{‏قُلْ هُوَ اللَّهُ أَحَدٌ‏}‏ وَ‏{‏قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ‏}‏ وَ‏{‏قُلْ أَعُوذُ بِرَبِّ النَّاسِ‏}‏ ثُمَّ يَمْسَحُ بِهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِهِ وَمَا أَقْبَلَ مِنْ جَسَدِهِ يَفْعَلُ ذَلِكَ ثَلاَثَ مَرَّاتٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4794,
                "hadithNumber": "5018",
                "englishNarrator": "Narrated Usaid bin Hudair:",
                "hadithEnglish": "That while he was reciting Surat Al-Baqara (The Cow) at night, and his horse was tied beside him, the horse was suddenly startled and troubled. When he stopped reciting, the horse became quiet, and when he started again, the horse was startled again. Then he stopped reciting and the horse became quiet too. He started reciting again and the horse was startled and troubled once again. Then he stopped reciting and his son, Yahya was beside the horse. He was afraid that the horse might trample on him. When he took the boy away and looked towards the sky, he could not see it. The next morning he informed the Prophet who said, \"Recite, O Ibn Hudair! Recite, O Ibn Hudair!\" Ibn Hudair replied, \"O Allah's Messenger (ﷺ)! My son, Yahya was near the horse and I was afraid that it might trample on him, so I looked towards the sky, and went to him. When I looked at the sky, I saw something like a cloud containing what looked like lamps, so I went out in order not to see it.\" The Prophet (ﷺ) said, \"Do you know what that was?\" Ibn Hudair replied, \"No.\" The Prophet (ﷺ) said, \"Those were Angels who came near to you for your voice and if you had kept on reciting till dawn, it would have remained there till morning when people would have seen it as it would not have disappeared. Hadrat Ibn-e-Haad said: Abdullah bin Khabbab, from Abu Saeed Khudri, from Osaid bin Hodair narrated me this Hadith.",
                "hadithUrdu": "رات کے وقت وہ سورۃ البقرہ کی تلاوت کر رہے تھے اور ان کا گھوڑا ان کے پاس ہی بندھا ہوا تھا ۔ اتنے میں گھوڑا بدکنے لگا تو انہوں نے تلاوت بند کر دی تو گھوڑا بھی رک گیا ۔ پھر انہوں نے تلاوت شروع کی تو گھوڑا پھر بدکنے لگا ۔ اس مرتبہ بھی جب انہوں نے تلاوت بند کی توگھوڑا بھی خاموش ہو گیا ۔ تیسری مرتبہ انہوں نے تلاوت شروع کی تو پھر گھوڑا بدکا ۔ ان کے بیٹے یحیٰی چونکہ گھوڑے کے قریب ہی تھے اس لئے اس ڈر سے کہ کہیں انہیں کوئی تکلیف نہ پہنچ جائے ۔ انہوں نے تلاوت بند کر دی اور بچے کو وہاں سے ہٹا دیا پھر اوپر نظر اٹھائی تو کچھ نہ دکھائی دیا ۔ صبح کے وقت یہ واقعہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے بیان کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ابن حضیر ! تم پڑھتے رہتے تلاوت بند نہ کرتے ( تو بہتر تھا ) انہوں نے عرض کیا یا رسول اللہ ! مجھے ڈر لگا کہ کہیں گھوڑا میرے بچے یحیٰی کو نہ کچل ڈالے ‘ وہ اس سے بہت قریب تھا ۔ میں سر اوپر اٹھایا اور پھر یحیٰی کی طرف گیا ۔ پھر میں نے آسمان کی طرف سر اٹھایا تو ایک چھتری سی نظر آئی جس میں روشن چراغ تھے ۔ پھر جب میں دوبارہ باہر آیا تو میں نے اسے نہیں دیکھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تمہیں معلوم بھی ہے وہ کیا چیز تھی ؟ اسید نے عرض کیا کہ نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ فرشتے تھے تمہاری آواز سننے کے لئے قریب ہو رہے تھے اگر تم رات بھر پڑھتے رہتے تو صبح تک اور لوگ بھی انہیں دیکھتے وہ لوگوں سے چھپتے نہیں ۔ اور ابن الہاد نے بیان کیا ‘ کہا مجھ سے یہ حدیث عبداللہ بن خباب نے بیان کی ، ان سے ابو سعید خدری رضی اللہ عنہ نے اور ان سے اسید بن حضیر رضی اللہ عنہ نے ۔",
                "urduNarrator": "اورلیث بن سعد نے بیان کیا کہ مجھ سے یزید بن الہاد نے بیان کیا ‘ ان سے محمد بن ابراہیم نے کہ اسید بن حضیر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي يَزِيدُ بْنُ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أُسَيْدِ بْنِ حُضَيْرٍ، قَالَ بَيْنَمَا هُوَ يَقْرَأُ مِنَ اللَّيْلِ سُورَةَ الْبَقَرَةِ وَفَرَسُهُ مَرْبُوطٌ عِنْدَهُ إِذْ جَالَتِ الْفَرَسُ فَسَكَتَ فَسَكَتَتْ فَقَرَأَ فَجَالَتِ الْفَرَسُ، فَسَكَتَ وَسَكَتَتِ الْفَرَسُ ثُمَّ قَرَأَ فَجَالَتِ الْفَرَسُ، فَانْصَرَفَ وَكَانَ ابْنُهُ يَحْيَى قَرِيبًا مِنْهَا فَأَشْفَقَ أَنْ تُصِيبَهُ فَلَمَّا اجْتَرَّهُ رَفَعَ رَأْسَهُ إِلَى السَّمَاءِ حَتَّى مَا يَرَاهَا فَلَمَّا أَصْبَحَ حَدَّثَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ اقْرَأْ يَا ابْنَ حُضَيْرٍ اقْرَأْ يَا ابْنَ حُضَيْرٍ ‏\"‏‏.‏ قَالَ فَأَشْفَقْتُ يَا رَسُولَ اللَّهِ أَنْ تَطَأَ يَحْيَى وَكَانَ مِنْهَا قَرِيبًا فَرَفَعْتُ رَأْسِي فَانْصَرَفْتُ إِلَيْهِ فَرَفَعْتُ رَأْسِي إِلَى السَّمَاءِ فَإِذَا مِثْلُ الظُّلَّةِ فِيهَا أَمْثَالُ الْمَصَابِيحِ فَخَرَجَتْ حَتَّى لاَ أَرَاهَا‏.‏ قَالَ ‏\"‏ وَتَدْرِي مَا ذَاكَ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ تِلْكَ الْمَلاَئِكَةُ دَنَتْ لِصَوْتِكَ وَلَوْ قَرَأْتَ لأَصْبَحَتْ يَنْظُرُ النَّاسُ إِلَيْهَا لاَ تَتَوَارَى مِنْهُمْ ‏\"‏‏.‏ قَالَ ابْنُ الْهَادِ وَحَدَّثَنِي هَذَا الْحَدِيثَ عَبْدُ اللَّهِ بْنُ خَبَّابٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أُسَيْدِ بْنِ حُضَيْرٍ‏.‏",
                "headingArabic": "نُزُولِ السَّكِينَةِ وَالْمَلاَئِكَةِ عِنْدَ قِرَاءَةِ الْقُرْآنِ",
                "headingUrdu": "قرآن کی تلاوت کے وقت سکینہ اور فرشتوں کا نزول",
                "headingEnglish": "The descent of As-Sakinah and angels at the time of the recitation of the Qur'an",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4795,
                "hadithNumber": "5019",
                "englishNarrator": "Narrated `Abdul `Aziz bin Rufai':",
                "hadithEnglish": "Shaddad bin Ma'qil and I entered upon Ibn `Abbas رضی اللہ عنہما . Shaddad bin Ma'qil asked him, \"Did the Prophet (ﷺ) leave anything (besides the Qur'an)?\" He replied. \"He did not leave anything except what is Between the two bindings (of the Qur'an).\" Then we visited Muhammad bin Al-Hanafiyya and asked him (the same question). He replied, \"The Prophet (ﷺ) did not leave except what is between the bindings (of the Qur'an).",
                "hadithUrdu": "میں اور شداد بن معقل ابن عباس رضی اللہ عنہما کے پاس گئے ۔ شداد بن معقل نے ان سے پوچھا کیا نبی کریم صلی اللہ علیہ وسلم اس قرآن کے سوا کوئی اور بھی قرآن چھوڑا تھا ۔ حضرت ابن عباس رضی اللہ عنہما نے کہا حضور اکرم صلی اللہ علیہ وسلم نے ( وحی متلو ) جو کچھ بھی چھوڑی ہے وہ سب کی سب ان دو گتوں کے درمیان صحیفہ میں محفوظ ہے عبد العزیز بن ربیع کہتے ہیں کہ ہم محمد بن حنیفہ کی خدمت میں بھی حاضر ہوئے اور ان سے بھی پوچھا تو انہوں نے کہا کہ آنحضرت صلی اللہ علیہ وسلم نے جو بھی وحی متلو چھوڑی وہ سب دو دفتیوں کے درمیان ( قرآن مجید کی شکل میں ) محفوظ ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے عبد العزیز بن رفیع نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، قَالَ دَخَلْتُ أَنَا وَشَدَّادُ بْنُ مَعْقِلٍ، عَلَى ابْنِ عَبَّاسٍ رضى الله عنهما فَقَالَ لَهُ شَدَّادُ بْنُ مَعْقِلٍ أَتَرَكَ النَّبِيُّ صلى الله عليه وسلم مِنْ شَىْءٍ قَالَ مَا تَرَكَ إِلاَّ مَا بَيْنَ الدَّفَّتَيْنِ‏.‏ قَالَ وَدَخَلْنَا عَلَى مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ فَسَأَلْنَاهُ فَقَالَ مَا تَرَكَ إِلاَّ مَا بَيْنَ الدَّفَّتَيْنِ‏.‏",
                "headingArabic": "مَنْ قَالَ لَمْ يَتْرُكِ النَّبِيُّ صلى الله عليه وسلم إِلاَّ مَا بَيْنَ الدَّفَّتَيْنِ‏.‏",
                "headingUrdu": "جس نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی وفات کے بعد کچھ نہیں چھوڑا۔",
                "headingEnglish": "Whoever said that the Prophet (saws) did not leave anything after his death",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4796,
                "hadithNumber": "5020",
                "englishNarrator": "Narrated Abu Musa Al-Ash`ari رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The example of him (a believer) who recites the Qur'an is like that of a citron which tastes good and smells good. And he (a believer) who does not recite the Qur'an is like a date which is good in taste but has no smell. And the example of a dissolute wicked person who recites the Qur'an is like the Raihana (sweet basil) which smells good but tastes bitter. And the example of a dissolute wicked person who does not recite the Qur'an is like the colocynth which tastes bitter and has no smell.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس کی ( مومن کی ) مثال جو قرآن کی تلاوت کرتا ہے سنگترے کی سی ہے جس کا مزا بھی لذیذ ہوتا ہے اور جس کی خوشبو بھی بہترین ہوتی ہے اور جو مومن قرآن کی تلاوت نہیں کرتا اس کی مثال کھجور کی سی ہے اس کا مزہ تو عمدہ ہوتا ہے لیکن اس میں خوشبو نہیں ہوتی اور اس بدکار ( منا فق ) کی مثال جو قر آن کی تلاوت کرتا ہے ریحانہ کی سی ہے کہ اس کی خوشبو تو اچھی ہوتی لیکن مزا کڑوا ہوتا ہے اور اس بدکار کی مثال جو قر آن کی تلا وت بھی نہیں کرتا اندرائن کی سی ہے جس کا مزا بھی کڑوا ہوتا ہے اور اس میں کوئی خو شبو بھی نہیں ہوتی ۔",
                "urduNarrator": "ہم سے ابوخالد ہدبہ بن خالد نے بیان کیا ‘ کہا ہم سے ہمام بن یحی نے بیان کیا ‘ کہا ہم سے قتادہ نے بیان کیا ان سے انس بن مالک نے بیان کیا اور ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ أَبُو خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسٌ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَثَلُ الَّذِي يَقْرَأُ الْقُرْآنَ كَالأُتْرُجَّةِ طَعْمُهَا طَيِّبٌ وَرِيحُهَا طَيِّبٌ وَالَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَالتَّمْرَةِ طَعْمُهَا طَيِّبٌ وَلاَ رِيحَ لَهَا، وَمَثَلُ الْفَاجِرِ الَّذِي يَقْرَأُ الْقُرْآنَ كَمَثَلِ الرَّيْحَانَةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ، وَمَثَلُ الْفَاجِرِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ طَعْمُهَا مُرٌّ وَلاَ رِيحَ لَهَا ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ الْقُرْآنِ عَلَى سَائِرِ الْكَلاَمِ",
                "headingUrdu": "قرآن کی فضیلت دوسری قسم کی تقریروں پر",
                "headingEnglish": "The superiority of the Qur'an above other kinds of speech",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4797,
                "hadithNumber": "5021",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Your life in comparison to the lifetime of the past nations is like the period between the time of `Asr prayer and sunset. Your example and the example of the Jews and Christians is that of person who employed laborers and said to them, \"Who will work for me till the middle of the day for one Qirat (a special weight)?' The Jews did. He then said, \"Who will work for me from the middle of the day till the `Asr prayer for one Qirat each?\" The Christians worked accordingly. Then you (Muslims) are working from the `Asr prayer till the Maghrib prayer for two Qirats each. They (the Jews and the Christians) said, 'We did more labor but took less wages.' He (Allah) said, 'Have I wronged you in your rights?' They replied, 'No.' Then He said, 'This is My Blessing which I give to whom I wish.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مسلمانو ! گزری امتوں کی عمروں کے مقابلہ میں تمہاری عمر ایسی ہے جیسے عصر سے سورج ڈوبنے تک کا وقت ہوتا ہے اور تمہاری اور یہود و نصاریٰ کی مثا ل ایسی ہے کہ کسی شخص نے کچھ مزدور کام پر لگائے اور ان سے کہا کہ ایک قیراط مزدوری پر میرا کام صبح سے دوپہر تک کون کرے گا ؟ یہ کام یہودیوں نے کیا ۔ پھر اس نے کہا کہ اب میرا کام آدھے دن سے عصر تک ( ایک ہی قیراط مزدوری پر ) کون کرے گا ؟ یہ کام نصاریٰ نے کیا ۔ پھر تم نے عصر سے مغرب تک دو دو قیراط مزدوری پر کام کیا ۔ یہود و نصاریٰ قیامت کے دن کہیں گے ہم نے کام زیادہ کیا لیکن مزدوری کم پائی ؟ اللہ تعالیٰ فرمائے گا کیا تمہارا کچھ حق مارا گیا ، وہ کہیں گے کہ نہیں ۔ پھر اللہ تعالیٰ فرمائے گا کہ پھر یہ میرافضل ہے ، میں جسے چاہوں اور جتنا چاہوں عطا کروں ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، ان سے یحییٰ بن سعید انصاری نے بیان کیا ، ان سے سفیان ثوری نے کہا کہ مجھ سے عبداللہ بن دینا ر نے بیان کیا ، کہا کہ میں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ سُفْيَانَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا أَجَلُكُمْ فِي أَجَلِ مَنْ خَلاَ مِنَ الأُمَمِ كَمَا بَيْنَ صَلاَةِ الْعَصْرِ وَمَغْرِبِ الشَّمْسِ، وَمَثَلُكُمْ وَمَثَلُ الْيَهُودِ وَالنَّصَارَى كَمَثَلِ رَجُلٍ اسْتَعْمَلَ عُمَّالاً، فَقَالَ مَنْ يَعْمَلُ لِي إِلَى نِصْفِ النَّهَارِ عَلَى قِيرَاطٍ فَعَمِلَتِ الْيَهُودُ فَقَالَ مَنْ يَعْمَلُ لِي مِنْ نِصْفِ النَّهَارِ إِلَى الْعَصْرِ فَعَمِلَتِ النَّصَارَى، ثُمَّ أَنْتُمْ تَعْمَلُونَ مِنَ الْعَصْرِ إِلَى الْمَغْرِبِ بِقِيرَاطَيْنِ قِيرَاطَيْنِ، قَالُوا نَحْنُ أَكْثَرُ عَمَلاً وَأَقَلُّ عَطَاءً، قَالَ هَلْ ظَلَمْتُكُمْ مِنْ حَقِّكُمْ قَالُوا لاَ قَالَ فَذَاكَ فَضْلِي أُوتِيهِ مَنْ شِئْتُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4798,
                "hadithNumber": "5022",
                "englishNarrator": "Narrated Talha:",
                "hadithEnglish": "I asked `Abdullah bin Abi `Aufa رضی اللہ عنہ , \"Did the Prophet (ﷺ) make a will (to appoint his successor or bequeath wealth)?\" He replied, \"No.\" I said, \"How is it prescribed then for the people to make wills, and they are ordered to do so while the Prophet (ﷺ) did not make any will?\" He said, \"He made a will wherein he recommended Allah's Book.\"",
                "hadithUrdu": "میں نے عبداللہ بن ابی اوفی ٰ رضی اللہ عنہ سے سوال کیا کیا نبی کریم نے کوئی وصیت فرمائی تھی ؟ انہوں نے کہا کہ نہیں ۔ میں نے عرض کیا پھر لوگوں پر وصیت کیسے فرض کی گئی کہ مسلمانوں کو تو وصیت کا حکم ہے اور خود آنحضرت صلی اللہ علیہ وسلم نے کوئی وصیت نہیں فرمائی ۔ انہوں نے کہا کہ آنحضرت صلی اللہ علیہ وسلم نے کتاب اللہ کو مضبوطی سے تھامے رہنے کی وصیت فرمائی تھی ۔",
                "urduNarrator": "ہم سے محمد بن یوسف فریابی نے بیان کیا ، کہا ہم سے مالک بن مغول نے ، کہا ہم سے طلحہ بن مصرف نے بیان کیا ، کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، حَدَّثَنَا طَلْحَةُ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى أَوْصَى النَّبِيُّ صلى الله عليه وسلم فَقَالَ لاَ‏.‏ فَقُلْتُ كَيْفَ كُتِبَ عَلَى النَّاسِ الْوَصِيَّةُ، أُمِرُوا بِهَا وَلَمْ يُوصِ قَالَ أَوْصَى بِكِتَابِ اللَّهِ‏.‏",
                "headingArabic": "الْوَصَاةِ بِكِتَابِ اللَّهِ عَزَّ وَجَلَّ",
                "headingUrdu": "اللہ عزوجل کی کتاب کی سفارش کرنا",
                "headingEnglish": "To recommend the Book of Allah عز وجل",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4799,
                "hadithNumber": "5023",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Allah does not listen to a prophet as He listens to a prophet who recites the Qur'an in a pleasant tone.\" The companion of the sub-narrator (Abu Salama) said, \"It means, reciting it aloud.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا اللہ نے کوئی چیز اتنی توجہ سے نہیں سنی جتنی توجہ سے اس نے نبی کریم صلی اللہ علیہ وسلم کا قرآن بہترین آواز کے ساتھ پڑھتے ہوئے سنا ہے ۔ ابوسلمہ بن عبدالرحمٰن کا ایک دوست عبدالحمید بن عبدالرحمٰن کہتا تھا کہ اس حدیث میں یتغنیٰ بالقرآن سے یہ مراد ہے کہ اچھی آواز سے اسے پکار کر پڑھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ مجھ سے لیث بن سعد نے ، ان سے عقیل نے ، ان سے شہاب نے بیان کیا ، کہا کہ مجھ کو ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ كَانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَمْ يَأْذَنِ اللَّهُ لِشَىْءٍ مَا أَذِنَ لِلنَّبِيِّ صلى الله عليه وسلم يَتَغَنَّى بِالْقُرْآنِ ‏\"‏‏.‏ وَقَالَ صَاحِبٌ لَهُ يُرِيدُ يَجْهَرُ بِهِ‏.‏",
                "headingArabic": "مَنْ لَمْ يَتَغَنَّ بِالْقُرْآنِ",
                "headingUrdu": "جو شخص خوشگوار لہجے میں قرآن کی تلاوت نہیں کرتا",
                "headingEnglish": "Whoever does not recite the Qur'an in a pleasant tone",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4800,
                "hadithNumber": "5024",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) I said, \"Allah does not listen to a prophet as He listens to a prophet who recites the Qur'an in a loud and pleasant tone.\" Sufyan said, \"This saying means: a prophet who regards the Qur'an as something that makes him dispense with many worldly pleasures.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے کوئی چیز توجہ سے نہیں سنی جتنی توجہ سے اپنے نبی کریم صلی اللہ علیہ وسلم کو بہترین آواز کے ساتھ قرآن مجید پڑھتے سنا ہے ۔ سفیان بن عیینہ نے کہا یتغنی ٰ سے مراد ہے کہ قرآن پر قناعت کرے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ا ن سے زہری نے ، ان سے ابوسلمہ بن عبدالرحمٰن نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا أَذِنَ اللَّهُ لِشَىْءٍ مَا أَذِنَ لِلنَّبِيِّ أَنْ يَتَغَنَّى بِالْقُرْآنِ ‏\"‏‏.‏ قَالَ سُفْيَانُ تَفْسِيرُهُ يَسْتَغْنِي بِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4801,
                "hadithNumber": "5025",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Not to wish to be the like except of two men. A man whom Allah has given the knowledge of the Book and he recites it during the hours of the night, and a man whom Allah has given wealth, and he spends it in charity during the night and the hours of the day.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ۔ رشک تو بس دو ہی آدمیوں پر ہو سکتا ہے ایک تو اس پر جسے اللہ نے قرآن مجید کا علم دیا اور وہ اس کے ساتھ رات کی گھڑیوں میں کھڑا ہو کر نماز پڑھتا رہا اور دوسرا آدمی وہ جسے اللہ تعالیٰ نے مال دیا اور وہ اسے محتاجوں پر رات دن خیرات کرتا رہا ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ان سے زہری نے بیان کیا ‘ انہوں نے کہا مجھ سے سالم بن عبداللہ نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ حَسَدَ إِلاَّ عَلَى اثْنَتَيْنِ، رَجُلٌ آتَاهُ اللَّهُ الْكِتَابَ وَقَامَ بِهِ آنَاءَ اللَّيْلِ، وَرَجُلٌ أَعْطَاهُ اللَّهُ مَالاً فَهْوَ يَتَصَدَّقُ بِهِ آنَاءَ اللَّيْلِ وَالنَّهَارِ ‏\"‏‏.‏",
                "headingArabic": "اغْتِبَاطِ صَاحِبِ الْقُرْآنِ",
                "headingUrdu": "تم قرآن کی تلاوت کرنے والے جیسا بنو",
                "headingEnglish": "Wish to be the like of the one who recites the Qur'an",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4802,
                "hadithNumber": "5026",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) I said, \"Not to wish to be the like of except two men: A man whom Allah has taught the Qur'an and he recites it during the hours of the night and during the hours of the day, and his neighbor listens to him and says, 'I wish I had been given what has been given to so-and-so, so that I might do what he does; and a man whom Allah has given wealth and he spends it on what is just and right, whereupon an other man May say, 'I wish I had been given what so-and-so has been given, for then I would do what he does.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا رشک تو بس دو ہی آدمیوں پر ہونا چاہئے ایک اس پر جسے اللہ تعا لی نے قرآن کا علم دیا اور وہ رات دن اس کی تلاوت کرتا رہتا ہے کہ اس کا پڑوسی سن کر کہہ اٹھے کہ کاش مجھے بھی اس جیسا علم قرآن ہوتا اور میں بھی اس کی طرح عمل کرتا اور وہ دوسرا جسے اللہ نے مال دیا اور وہ اسے حق کے لئے لٹا رہا ہے ( اس کو دیکھ کر ) دوسرا شخص کہہ اٹھتا ہے کہ کاش میرے پاس بھی اس کے جتنا مال ہوتا اور میں بھی اس کی طرح خرچ کرتا ۔",
                "urduNarrator": "ہم سے علی بن ابراہیم نے بیان کیا ، انہوں نے کہا ہم سے روح بن عبادہ نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے سلیمان نے ، انہوں نے کہا میں نے ذکوان سے سنا اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، سَمِعْتُ ذَكْوَانَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ حَسَدَ إِلاَّ فِي اثْنَتَيْنِ رَجُلٌ عَلَّمَهُ اللَّهُ الْقُرْآنَ فَهُوَ يَتْلُوهُ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ فَسَمِعَهُ جَارٌ لَهُ فَقَالَ لَيْتَنِي أُوتِيتُ مِثْلَ مَا أُوتِيَ فُلاَنٌ فَعَمِلْتُ مِثْلَ مَا يَعْمَلُ، وَرَجُلٌ آتَاهُ اللَّهُ مَالاً فَهْوَ يُهْلِكُهُ فِي الْحَقِّ فَقَالَ رَجُلٌ لَيْتَنِي أُوتِيتُ مِثْلَ مَا أُوتِيَ فُلاَنٌ فَعَمِلْتُ مِثْلَ مَا يَعْمَلُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4776,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=191",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=189",
                "label": "189",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=190",
                "label": "190",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=191",
                "label": "191",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=192",
                "label": "192",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=193",
                "label": "193",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=194",
                "label": "194",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=195",
                "label": "195",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=193",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=193",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=191",
        "to": 4800,
        "total": 40465
    }
}