{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 255,
        "data": [
            {
                "id": 6353,
                "hadithNumber": "6618",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said to Ibn Saiyad, \"I have kept for you a secret.\" Ibn Saiyad said, \"Ad-Dukh.\" The Prophet said, \"Keep quiet, for you cannot go beyond your limits (or you cannot exceed what has been foreordained for you).\" On that, `Umar رضی اللہ عنہما said (to the Prophet (ﷺ) ), \"Allow me to chop off his neck!\" The Prophet said, \"Leave him, for if he is he (i.e., Ad-Dajjal), then you will not be able to overcome him, and if he is not, then you gain no good by killing him.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ابن صیاد سے فرمایا کہ میں نے تیرے لیے ایک بات دل میں چھپارکھی ہے ( بتا وہ کیا ہے ؟ ) اس نے کہا کہ ” دھواں “ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، بدبخت ! اپنی حیثیت سے آگے نہ بڑھ ۔ عمر رضی اللہ عنہ نے عرض کیا ، آپ مجھے اجازت دیں تو میں اس کی گردن مار دوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے چھوڑ دو ، اگر یہ وہی ( دجال ) ہوا تو تم اس پر قابو نہیں پا سکتے اور اگر یہ وہ نہ ہوا تو اسے قتل کرنے میں تمہارے لیے کوئی بھلائی نہیں ۔",
                "urduNarrator": "ہم سے علی بن حفص اور بشر بن محمد نے بیان کیا ، ان دونوں نے کہا کہ عبداللہ نے ہمیں خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں سالم نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ، وَبِشْرُ بْنُ مُحَمَّدٍ، قَالاَ أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لاِبْنِ صَيَّادٍ ‏\"‏ خَبَأْتُ لَكَ خَبِيئًا ‏\"‏‏.‏ قَالَ الدُّخُّ‏.‏ قَالَ ‏\"‏ اخْسَأْ فَلَنْ تَعْدُوَ قَدْرَكَ ‏\"‏‏.‏ قَالَ عُمَرُ ائْذَنْ لِي فَأَضْرِبَ عُنُقَهُ‏.‏ قَالَ ‏\"‏ دَعْهُ، إِنْ يَكُنْ هُوَ فَلاَ تُطِيقُهُ، وَإِنْ لَمْ يَكُنْ هُوَ فَلاَ خَيْرَ لَكَ فِي قَتْلِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "83",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 83,
                    "chapterNumber": "83",
                    "chapterEnglish": "Divine Will (Al-Qadar)",
                    "chapterUrdu": "تقدیر کے بیان میں",
                    "chapterArabic": "كتاب القدر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6354,
                "hadithNumber": "6619",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I asked Allah's Messenger (ﷺ) about the plague. He said, \"That was a means of torture which Allah used to send upon whom-so-ever He wished, but He made it a source of mercy for the believers, for anyone who is residing in a town in which this disease is present, and remains there and does not leave that town, but has patience and hopes for Allah's reward, and knows that nothing will befall him except what Allah has written for him, then he will get such reward as that of a martyr.\"",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے طاعون کے متعلق پوچھا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ عذاب تھا اور اللہ تعالیٰ جس پر چاہتا ہے اسے بھیجتا تھا ۔ پھر اللہ تعالیٰ نے اسے مومنوں کے لیے رحمت بنا دیا ، کوئی بھی بندہ اگر کسی ایسے شہرمیں ہے جس میں طاعون کی وبا پھوٹی ہوئی ہے اور اس میں ٹھہرا ہے اور اس شہر سے بھاگا نہیں صبر کئے ہوئے ہے اور اس پر اجر کا امیدوار ہے اور یقین رکھتا ہے کہ اس تک صرف وہی چیز پہنچ سکتی ہے جو اللہ نے اس کی تقدیر میں لکھ دی ہے تو اسے شہید کے برابر ثواب ملے گا ۔",
                "urduNarrator": "مجھ سے اسحاق بن ابراہیم حنظلی نے بیان کیا ، انہوں نے کہا مجھ کو نضر نے خبر دی ، انہوں نے کہا ہم سے داؤد بن ابی الفرات نے بیان کیا ، ان سے عبداللہ بن بریدہ نے بیان کیا ، ان سے یحییٰ بن یعمر نے بیان کیا اور انہیں عائشہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا النَّضْرُ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي الْفُرَاتِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّهَا، سَأَلَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الطَّاعُونِ فَقَالَ ‏ \"‏ كَانَ عَذَابًا يَبْعَثُهُ اللَّهُ عَلَى مَنْ يَشَاءُ، فَجَعَلَهُ اللَّهُ رَحْمَةً لِلْمُؤْمِنِينَ، مَا مِنْ عَبْدٍ يَكُونُ فِي بَلَدٍ يَكُونُ فِيهِ، وَيَمْكُثُ فِيهِ، لاَ يَخْرُجُ مِنَ الْبَلَدِ، صَابِرًا مُحْتَسِبًا، يَعْلَمُ أَنَّهُ لاَ يُصِيبُهُ إِلاَّ مَا كَتَبَ اللَّهُ لَهُ، إِلاَّ كَانَ لَهُ مِثْلُ أَجْرِ شَهِيدٍ ‏\"‏‏.‏",
                "headingArabic": "‏{‏قُلْ لَنْ يُصِيبَنَا إِلاَّ مَا كَتَبَ اللَّهُ لَنَا‏}‏ قضَى",
                "headingUrdu": "’’کہہ دو کہ ہم پر کچھ نہیں ہوگا مگر وہی جو اللہ نے ہمارے لیے لکھ دیا ہے‘‘۔",
                "headingEnglish": "\"Say: 'Nothing shall ever happen to us except what Allah has ordained for us ...'\"",
                "chapterId": "83",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 83,
                    "chapterNumber": "83",
                    "chapterEnglish": "Divine Will (Al-Qadar)",
                    "chapterUrdu": "تقدیر کے بیان میں",
                    "chapterArabic": "كتاب القدر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6355,
                "hadithNumber": "6620",
                "englishNarrator": "Narrated Al-Bara' bin `Azib رضی اللہ عنہ :",
                "hadithEnglish": "I saw the Prophet (ﷺ) on the Day of (the battle of) Al-Khandaq, carrying earth with us and saying, \"By Allah, without Allah we would not have been guided, neither would we have fasted, nor would we have prayed. O Allah! Send down Sakina (calmness) upon us and make our feet firm when we meet (the enemy). The pagans have rebelled against us, but if they want to put us in affliction (i.e., fight us) we refuse (to flee).\" (See Hadith No. 430, Vol. 5).",
                "hadithUrdu": "میں نے غزوہ خندق کے دن رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ ہمارے ساتھ مٹی اٹھا رہے تھے اور یہ کہتے جاتے تھے ۔ ” واللہ ، اگر اللہ نہ ہوتا تو ہم ہدایت نہ پا سکتے ۔ نہ روزہ رکھ سکتے اور نہ نماز پڑھ سکتے ۔ پس اے اللہ ! ہم پر سکینت نازل فرما ۔ اور جب سامنا ہو تو ہمیں ثابت قدم رکھ ۔ اور مشرکین نے ہم پر زیادتی کی ہے ۔ جب وہ کسی فتنہ کا ارادہ کرتے ہیں تو ہم انکار کرتے ہیں ۔ “",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، انہوں نے کہا کہ ہم کو جریر نے خبر دی جو ابن حازم ہیں ، انہیں ابواسحاق نے ، ان سے براء بن عازب رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، أَخْبَرَنَا جَرِيرٌ ـ هُوَ ابْنُ حَازِمٍ ـ عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَوْمَ الْخَنْدَقِ يَنْقُلُ مَعَنَا التُّرَابَ وَهْوَ يَقُولُ ‏ \"‏ وَاللَّهِ لَوْلاَ اللَّهُ مَا اهْتَدَيْنَا، وَلاَ صُمْنَا وَلاَ صَلَّيْنَا، فَأَنْزِلَنْ سَكِينَةً عَلَيْنَا، وَثَبِّتِ الأَقْدَامَ إِنْ لاَقَيْنَا، وَالْمُشْرِكُونَ قَدْ بَغَوْا عَلَيْنَا، إِذَا أَرَادُوا فِتْنَةً أَبَيْنَا‏\"‏‏.‏",
                "headingArabic": "{وَمَا كُنَّا لِنَهْتَدِيَ لَوْلاَ أَنْ هَدَانَا اللَّهُ}",
                "headingUrdu": "\"... ہم کبھی ہدایت نہ پا سکتے، اگر اللہ ہمیں ہدایت نہ دیتا۔\"",
                "headingEnglish": "\"... Never could we have found guidance, were it not that Allah had guided us ...\"",
                "chapterId": "83",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 83,
                    "chapterNumber": "83",
                    "chapterEnglish": "Divine Will (Al-Qadar)",
                    "chapterUrdu": "تقدیر کے بیان میں",
                    "chapterArabic": "كتاب القدر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6356,
                "hadithNumber": "6621",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Abu Bakr As-Siddiq رضی اللہ عنہ had never broken his oaths till Allah revealed the expiation for the oaths. Then he said, \"If I take an oath to do something and later on I find something else better than the first one, then I do what is better and make expiation for my oath.\"",
                "hadithUrdu": "ابوبکر رضی اللہ عنہ کبھی اپنی قسم نہیں توڑتے تھے ، یہاں تک کہ اللہ تعالیٰ نے قسم کاکفارہ اتارا ۔ اس وقت انہوں نے کہا کہ اب اگر میں کوئی قسم کھاؤں گا اور اس کے سوا کوئی چیز بھلائی کی ہو گی تو میں وہی کام کروں گا جس میں بھلائی ہو اور اپنی قسم کا کفارہ دے دوں گا ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل ابوالحسن مروزی نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں ان کے والد نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ لَمْ يَكُنْ يَحْنَثُ فِي يَمِينٍ قَطُّ، حَتَّى أَنْزَلَ اللَّهُ كَفَّارَةَ الْيَمِينِ وَقَالَ لاَ أَحْلِفُ عَلَى يَمِينٍ فَرَأَيْتُ غَيْرَهَا خَيْرًا مِنْهَا، إِلاَّ أَتَيْتُ الَّذِي هُوَ خَيْرٌ، وَكَفَّرْتُ عَنْ يَمِينِي‏.‏",
                "headingArabic": "قَوْلُ اللَّهِ تَعَالَى: {لاَ يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ وَلَكِنْ يُؤَاخِذُكُمْ بِمَا عَقَّدْتُمُ الأَيْمَانَ فَكَفَّارَتُهُ إِطْعَامُ عَشَرَةِ مَسَاكِينَ مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ أَوْ كِسْوَتُهُمْ أَوْ تَحْرِيرُ رَقَبَةٍ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلاَثَةِ أَيَّامٍ ذَلِكَ كَفَّارَةُ أَيْمَانِكُمْ إِذَا حَلَفْتُمْ وَاحْفَظُوا أَيْمَانَكُمْ كَذَلِكَ يُبَيِّنُ اللَّهُ لَكُمْ آيَاتِهِ لَعَلَّكُمْ تَشْكُرُونَ}",
                "headingUrdu": "\"اللہ تمہیں تمہاری غیر ارادی قسموں کی سزا نہیں دے گا، لیکن وہ تمہیں تمہاری جان بوجھ کر کھائی گئی قسموں کی سزا دے گا۔\"",
                "headingEnglish": "\"Allah will not punish you for what is unintentional in your oaths, but He will punish you for your deliberate oaths ...\"",
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6357,
                "hadithNumber": "6622",
                "englishNarrator": "Narrated `Abdur-Rahman bin Samura رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"O `Abdur-Rahman bin Samura! Do not seek to be a ruler, because if you are given authority for it, then you will be held responsible for it, but if you are given it without asking for it, then you will be helped in it (by Allah): and whenever you take an oath to do something and later you find that something else is better than the first, then do the better one and make expiation for your oath.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اے عبدالرحمٰن بن سمرہ ! کبھی کسی حکومت کے عہدہ کی درخواست نہ کرنا کیونکہ اگر تمہیں یہ مانگنے کے بعد ملے گا تو اللہ پاک اپنی مدد تجھ سے اٹھالے گا ۔ تو جان ، تیرا کام جانے اور اگر وہ عہدہ تمہیں بغیر مانگے مل گیا تو اس میں اللہ کی طرف سے تمہاری اعانت کی جائے گی اور جب تم کوئی قسم کھا لو اور اس کے سوا کسی اور چیز میں بھلائی دیکھو تو اپنی قسم کا کفارہ دے دو اور وہ کام کرو جو بھلائی کا ہو ۔",
                "urduNarrator": "ہم سے ابونعمان محمد بن فضل سدوسی نے بیان کیا ، کہا ہم سے جریر بن حازم نے بیان کیا ، کہا ہم سے امام حسن بصری نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن سمرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، مُحَمَّدُ بْنُ الْفَضْلِ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا الْحَسَنُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَا عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ لاَ تَسْأَلِ الإِمَارَةَ، فَإِنَّكَ إِنْ أُوتِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا، وَإِنْ أُوتِيتَهَا مِنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا، وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا، فَكَفِّرْ عَنْ يَمِينِكَ، وَأْتِ الَّذِي هُوَ خَيْرٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6358,
                "hadithNumber": "6623",
                "englishNarrator": "Narrated Abu Burdah's father (Hadrat Abu Musa Ashari) رضی اللہ عنہ :",
                "hadithEnglish": "I went to the Prophet (ﷺ) along with a group of Al-Ash`ariyin in order to request him to provide us with mounts. He said, \"By Allah, I will not provide you with mounts and I haven't got anything to mount you on.\" Then we stayed there as long as Allah wished us to stay, and then three very nice looking she-camels were brought to him and he made us ride them. When we left, we, or some of us, said, \"By Allah, we will not be blessed, as we came to the Prophet (ﷺ) asking him for mounts, and he swore that he would not give us any mounts but then he did give us. So let us go back to the Prophet (ﷺ) and remind him (of his oath).\" When we returned to him (and reminded him of the fact), he said, \"I did not give you mounts, but it is Allah Who gave you. By Allah, Allah willing, if I ever take an oath to do something and then I find something else than the first, I will make expiation for my oath and do the thing which is better (or do something which is better and give the expiation for my oath).",
                "hadithUrdu": "میں اشعری قبیلہ کی ایک جماعت کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ سے سواری مانگی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ واللہ ، میں تمہارے لئے سواری کا کوئی انتظام نہیں کر سکتا اور نہ میرے پاس کوئی سواری کا جانور ہے ۔ بیان کیا پھر جتنے دنوں اللہ نے چاہا ہم یونہی ٹھہرے رہے ۔ اس کے بعد تین اچھی قسم کی اونٹنیاں لائی گئیں اور آنحضرت صلی اللہ علیہ وسلم نے انہیں ہمیں سواری کے لئے عنایت فرمایا ۔ جب ہم روانہ ہوئے تو ہم نے کہا یا ہم میں سے بعض نے کہا ، واللہ ! ہمیں اس میں برکت نہیں حاصل ہو گی ۔ ہم آنحضرت صلی اللہ علیہ وسلم کی خدمت میں سواری مانگنے آئے تھے تو آپ نے قسم کھا لی تھی کہ آپ ہمارے لئے سواری کا انتظام نہیں کر سکتے ۔ اور اب آپ نے ہمیں سواری عنایت فرمائی ہے ہمیں آنحضرت صلی اللہ علیہ وسلم کے پاس جانا چاہئے اور آپ کو قسم یاد دلانی چاہئے ۔ چنانچہ ہم آپ کی خدمت میں حاضر ہوئے تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں نے تمہاری سواری کا کوئی انتظام نہیں کیا ہے بلکہ اللہ تعالیٰ نے یہ انتظام کیا ہے اور میں ، واللہ ! کوئی بھی اگر قسم کھا لوں گا اور اس کے سوا کسی اور چیز میں بھلائی دیکھوں گا تو اپنی قسم کا کفارہ دے دوں گا ۔ جس میں بھلائی ہو گی یا آنحضرت صلی اللہ علیہ وسلم نے یوں فرمایا کہ وہی کروں گا جس میں بھلائی ہو گی اور اپنی قسم کا کفارہ ادا کر دوں گا ۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے غیلان بن جریر نے ، ان سے ابوہریرہ رضی اللہ عنہ نے ، ان سےابو بردہ ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي رَهْطٍ مِنَ الأَشْعَرِيِّينَ أَسْتَحْمِلُهُ فَقَالَ ‏\"‏ وَاللَّهِ لاَ أَحْمِلُكُمْ، وَمَا عِنْدِي مَا أَحْمِلُكُمْ عَلَيْهِ ‏\"‏‏.‏ قَالَ ثُمَّ لَبِثْنَا مَا شَاءَ اللَّهُ أَنْ نَلْبَثَ، ثُمَّ أُتِيَ بِثَلاَثِ ذَوْدٍ غُرِّ الذُّرَى فَحَمَلَنَا عَلَيْهَا فَلَمَّا انْطَلَقْنَا قُلْنَا أَوْ قَالَ بَعْضُنَا وَاللَّهِ لاَ يُبَارَكُ لَنَا، أَتَيْنَا النَّبِيَّ صلى الله عليه وسلم نَسْتَحْمِلُهُ، فَحَلَفَ أَنْ لاَ يَحْمِلَنَا ثُمَّ حَمَلَنَا، فَارْجِعُوا بِنَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَنُذَكِّرُهُ، فَأَتَيْنَاهُ فَقَالَ ‏\"‏ مَا أَنَا حَمَلْتُكُمْ، بَلِ اللَّهُ حَمَلَكُمْ، وَإِنِّي وَاللَّهِ إِنْ شَاءَ اللَّهُ لاَ أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلاَّ كَفَّرْتُ عَنْ يَمِينِي، وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ ‏\"‏‏.‏ أَوْ ‏\"‏ أَتَيْتُ الَّذِي هُوَ خَيْرٌ وَكَفَّرْتُ عَنْ يَمِينِي ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6359,
                "hadithNumber": "6624, 6625",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"We (Muslims) are the last in the world, but will be foremost on the Day of Resurrection.\" Allah's Messenger (ﷺ) also said: \"By Allah, if anyone of you insists on fulfilling an oath by which he may harm his family, he commits a greater sin in Allah's sight than that of dissolving his oath and making expiation for it.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ” ہم آخری امت ہیں اور قیامت کے دن جنت میں سب سے پہلے داخل ہوں گے ۔پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ واللہ ( بسا اوقات ) اپنے گھر والوں کے معاملہ میں تمہارا اپنی قسموں پر اصرار کرتے رہنا اللہ کے نزدیک اس سے زیادہ گناہ کی بات ہوتی ہے کہ ( قسم توڑ کر ) اس کا وہ کفارہ ادا کر دیا جائے جو اللہ تعالیٰ نے اس پر فرض کیا ہے ۔",
                "urduNarrator": "مجھ سے اسحاق بن ابراہیم نے بیان کیا ، کہا ہم کو عبدالرزاق نے خبر دی ، کہا ہم کو معمر نے خبر دی ، ان سے ہمام بن منبہ نے بیان کیا کہ یہ وہ حدیث ہے جو ہم سے ابوہریرہ رضی اللہ عنہ نے بیان کی کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ وَاللَّهِ لأَنْ يَلِجَّ أَحَدُكُمْ بِيَمِينِهِ فِي أَهْلِهِ آثَمُ لَهُ عِنْدَ اللَّهِ مِنْ أَنْ يُعْطِيَ كَفَّارَتَهُ الَّتِي افْتَرَضَ اللَّهُ عَلَيْهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6361,
                "hadithNumber": "6626",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Anyone who takes an oath through which his family may be harmed, and insists on keeping it, he surely commits a sin greater (than that of dissolving his oath). He should rather compensate for that oath by making expiation.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، وہ شخص جو اپنے گھر والوں کے معاملہ میں قسم پر اڑا رہتا ہے وہ اس سے بڑا گناہ کرتا ہے کہ اس قسم کا کفارہ ادا کر دے ۔",
                "urduNarrator": "مجھ سے اسحاق یعنی ابن ابراہیم نے بیان کیا ، کہا ہم سے یحییٰ بن صالح نے بیان کیا ، انہوں نے کہا ہم سے معاویہ نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ نے ، ان سے عکرمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ يَعْنِي ابْنَ إِبْرَاهِيمَ، حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا مُعَاوِيَةُ، عَنْ يَحْيَى، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنِ اسْتَلَجَّ فِي أَهْلِهِ بِيَمِينٍ فَهْوَ أَعْظَمُ إِثْمًا، لِيَبَرَّ ‏\"‏‏.‏ يَعْنِي الْكَفَّارَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6362,
                "hadithNumber": "6627",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent an army detachment and made Usama bin Zaid its commander. Some people criticized (spoke badly of) Usama's leadership. So Allah's Messenger (ﷺ) got up saying, \"If you people are criticizing Usama's leadership, you have already criticized the leadership of his father before. But Waaimullah (i.e., By Allah), he (i.e. Zaid رضی اللہ عنہ ) deserved the leadership, and he was one of the most beloved persons to me; and now this (his son Usama رضی اللہ عنہ ) is one of the dearest persons to me after him.\" (See Hadith No. 765, Vol. 5)",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے ایک فوج بھیجی اور اس کا امیر اسامہ بن زید کو بنایا ۔ بعض لوگوں نے ان کے امیر بنائے جانے پر اعتراض کیا تو آنحضرت صلی اللہ علیہ وسلم کھڑے ہوئے اور فرمایا اگر تم لوگ اس کے امیر بنائے جانے پر اعتراض کرتے ہو تو تم اس سے پہلے اس کے والد زید کے امیربنائے جانے پر بھی اعتراض کر چکے ہو اور خدا کی قسم ( وایم اﷲ ) زید ( رضی اللہ عنہ ) امیر بنائے جانے کے قابل تھے اور مجھے سب لوگوں سے زیادہ عزیز تھے اور یہ ( اسامہ رضی اللہ عنہ ) ان کے بعد مجھے سب سے زیادہ عزیز تھے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے عبداللہ بن دینار نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْثًا وَأَمَّرَ عَلَيْهِمْ أُسَامَةَ بْنَ زَيْدٍ، فَطَعَنَ بَعْضُ النَّاسِ فِي إِمْرَتِهِ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ إِنْ كُنْتُمْ تَطْعَنُونَ فِي إِمْرَتِهِ فَقَدْ كُنْتُمْ تَطْعَنُونَ، فِي إِمْرَةِ أَبِيهِ مِنْ قَبْلُ، وَايْمُ اللَّهِ إِنْ كَانَ لَخَلِيقًا لِلإِمَارَةِ، وَإِنْ كَانَ لَمِنْ أَحَبِّ النَّاسِ إِلَىَّ، وَإِنَّ هَذَا لَمِنْ أَحَبِّ النَّاسِ إِلَىَّ بَعْدَهُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏{‏وَايْمُ اللَّهِ‏}‏",
                "headingUrdu": "فرمان نبوی صلی اللہ علیہ وسلم",
                "headingEnglish": "The statement of the Prophet (saws)",
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6363,
                "hadithNumber": "6628",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The oath of the Prophet (ﷺ) used to be: \"No, by Him who turns the hearts.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی قسم بس اتنی تھی کہ نہیں ، دلوں کے پھیرنے والے اللہ کی قسم ۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا ، ان سے سفیان نے ، ان سے موسیٰ بن عقبہ نے اور ان سے سالم نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنْ سُفْيَانَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَتْ يَمِينُ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ لاَ وَمُقَلِّبِ الْقُلُوبِ ‏\"‏‏.‏",
                "headingArabic": "كَيْفَ كَانَتْ يَمِينُ النَّبِيِّ صلى الله عليه وسلم",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی قسمیں کیسی تھیں؟",
                "headingEnglish": "How did the oaths of the Prophet (saws) use to be?",
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6364,
                "hadithNumber": "6629",
                "englishNarrator": "Narrated Jabir bin Samura رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If Caesar is ruined, there will be no Caesar after him; and if Khosrau is ruined, there will be no Khosrau, after him; and, by Him in Whose Hand my soul is, surely you will spend their treasures in Allah's Cause.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب قیصر ہلاک ہو جائے گا تو پھر اس کے بعد کوئی قیصر نہیں پیدا ہو گا اور جب کسریٰ ہلاک ہو جائے گا تو اس کے بعد کوئی کسریٰ نہیں پیدا ہو گا اور اس ذات کی قسم جس کے ہاتھ میں میری جان ہے تم ان کے خزانے اللہ کے راستے میں خرچ کرو گے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے عبدالملک نے ، ان سے جابر بن سمرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ، عَنْ جَابِرِ بْنِ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا هَلَكَ قَيْصَرُ فَلاَ قَيْصَرَ بَعْدَهُ، وَإِذَا هَلَكَ كِسْرَى فَلاَ كِسْرَى بَعْدَهُ، وَالَّذِي نَفْسِي بِيَدِهِ لَتُنْفَقَنَّ كُنُوزُهُمَا فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6365,
                "hadithNumber": "6630",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If Khosrau is ruined, there will be no Khosrau after him; and if Caesar is ruined, there will be no Caesar after him. By Him in Whose Hand Muhammad's soul is, surely you will spend their treasures in Allah's Cause.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب کسریٰ ( بادشاہ ایران ) ہلاک ہو جائے گا تو اس کے بعد کوئی کسریٰ نہیں پیدا ہو گا اور جب قیصر ( بادشاہ روم ) ہلاک ہو جائے گا تو اس کے بعد کوئی قیصر نہیں پیدا ہو گا اور اس ذات کی قسم جس کے ہاتھ میں میری جان ہے تم ان کے خزانے اللہ کے راستے میں خرچ کرو گے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، انہیں سعید بن مسیب نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا هَلَكَ كِسْرَى فَلاَ كِسْرَى بَعْدَهُ، وَإِذَا هَلَكَ قَيْصَرُ فَلاَ قَيْصَرَ بَعْدَهُ، وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَتُنْفَقَنَّ كُنُوزُهُمَا فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6366,
                "hadithNumber": "6631",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"O followers of Muhammad! By Allah, if you knew what I know, you would weep much and laugh little.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ و سلم نے فرمایا ، امت محمد ! واللہ ، اگر تم وہ جانتے جو میں جانتا ہوں تو زیادہ روتے اور کم ہنستے ۔",
                "urduNarrator": "مجھ سے محمد بن سلام نے بیان کیا ، انہوں نے کہا ہم کو عبدہ نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے والد عروہ بن زبیر نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ يَا أُمَّةَ مُحَمَّدٍ وَاللَّهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَبَكَيْتُمْ كَثِيرًا، وَلَضَحِكْتُمْ قَلِيلاً ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6367,
                "hadithNumber": "6632",
                "englishNarrator": "Narrated `Abdullah bin Hisham:",
                "hadithEnglish": "We were with the Prophet (ﷺ) and he was holding the hand of `Umar bin Al-Khattab. `Umar said to Him, \"O Allah's Messenger (ﷺ)! You are dearer to me than everything except my own self.\" The Prophet (ﷺ) said, \"No, by Him in Whose Hand my soul is, (you will not have complete faith) till I am dearer to you than your own self.\" Then `Umar said to him, \"However, now, by Allah, you are dearer to me than my own self.\" The Prophet (ﷺ) said, \"Now, O `Umar, (now you are a believer).",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے اور آپ عمر بن خطاب رضی اللہ عنہ کا ہاتھ پکڑے ہوئے تھے ۔ عمر رضی اللہ عنہ نے عرض کیا ، یا رسول اللہ ! آپ مجھے ہر چیز سے زیادہ عزیز ہیں ، سوا میری اپنی جان کے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا نہیں ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ۔ ( ایمان اس وقت تک مکمل نہیں ہو سکتا ) جب میں تمہیں تمہاری اپنی جان سے بھی زیادہ عزیز نہ ہو جاؤں ۔ عمر رضی اللہ عنہ نے عرض کیا پھر واللہ ! اب آپ مجھے میری اپنی جان سے بھی زیادہ عزیز ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، ہاں ، عمر ! اب تیرا ایمان پورا ہوا ۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابن وہب نے بیان کیا ، انہوں نے کہا کہ مجھے حیوہ نے خبر دی ، کہا کہ مجھ سے ابوعقیل زہرہ بن معبد نے بیان کیا ، انہوں نے اپنے دادا عبداللہ بن ہشام سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي حَيْوَةُ، قَالَ حَدَّثَنِي أَبُو عَقِيلٍ، زُهْرَةُ بْنُ مَعْبَدٍ أَنَّهُ سَمِعَ جَدَّهُ عَبْدَ اللَّهِ بْنَ هِشَامٍ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم وَهْوَ آخِذٌ بِيَدِ عُمَرَ بْنِ الْخَطَّابِ فَقَالَ لَهُ عُمَرُ يَا رَسُولَ اللَّهِ لأَنْتَ أَحَبُّ إِلَىَّ مِنْ كُلِّ شَىْءٍ إِلاَّ مِنْ نَفْسِي‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ وَالَّذِي نَفْسِي بِيَدِهِ حَتَّى أَكُونَ أَحَبَّ إِلَيْكَ مِنْ نَفْسِكَ ‏\"‏‏.‏ فَقَالَ لَهُ عُمَرُ فَإِنَّهُ الآنَ وَاللَّهِ لأَنْتَ أَحَبُّ إِلَىَّ مِنْ نَفْسِي‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الآنَ يَا عُمَرُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6368,
                "hadithNumber": "6633, 6634",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ and Zaid bin Khalid رضی اللہ عنہ :",
                "hadithEnglish": "Two men had a dispute in the presence of Allah's Messenger (ﷺ). One of them said, \"O Allah's Messenger (ﷺ)! Judge between us according to Allah's Laws.\" The other who was wiser, said, \"Yes, O Allah's Apostle! Judge between us according to Allah's Laws and allow me to speak.\" The Prophet (ﷺ) said, \"Speak.\" He said, \"My son was a laborer serving this (person) and he committed illegal sexual intercourse with his wife, The people said that my son is to be stoned to death, but I ransomed him with one-hundred sheep and a slave girl. Then I asked the learned people, who informed me that my son should receive one hundred lashes and will be exiled for one year, and stoning will be the lot for the man's wife.\" Allah's Messenger (ﷺ) said, \"Indeed, by Him in Whose Hand my soul is, I will judge between you according to Allah's Laws: As for your sheep and slave girl, they are to be returned to you.\" Then he scourged his son one hundred lashes and exiled him for one year. Then Unais Al-Aslami was ordered to go to the wife of the second man, and if she confessed (the crime), then stone her to death. She did confess, so he stoned her to death.",
                "hadithUrdu": "دو آدمیوں نے رسول اللہ صلی اللہ علیہ وسلم کی مجلس میں اپنا جھگڑا پیش کیا ۔ ان میں سے ایک نے کہا کہ ہمارے درمیان آپ کتاب اللہ کے مطابق فیصلہ کر دیں ۔ دوسرے نے ، جو زیادہ سمجھ دار تھا کہا کہ ٹھیک ہے ، یا رسول اللہ ! ہمارے درمیان کتاب اللہ کے مطابق فیصلہ کر دیجئیے اور مجھے اجازت دیجئیے کہ اس معاملہ میں کچھ عرض کروں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کہو ۔ ان صاحب نے کہا کہ میرا لڑکا اس شخص کے یہاں ” عسیف “ تھا ۔ عسیف اجیر کو کہتے ہیں ۔ ( اجیر کے معنی مزدور کے ہیں ) اور اس نے اس کی بیوی سے زنا کر لیا ۔ انہوں نے مجھ سے کہا کہ اب میرے لڑکے کو سنگسار کیا جائے گا ۔ اس لئے ( اس سے نجات دلانے کے لئے ) میں نے سو بکریوں اور ایک لونڈی کا انہیں فدیہ دے دیا پھر میں نے دوسرے علم والوں سے اس مسئلہ کو پوچھا تو انہوں نے بتایا کہ میرے لڑکے کی سزا یہ ہے کہ اسے سو کوڑے لگائے جائیں اور ایک سال کے لئے شہر بدر کر دیا جائے ، سنگساری کی سزا صرف اس عورت کو ہو گی ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے میں تمہارا فیصلہ کتاب اللہ کے مطابق کروں گا ۔ تمہاری بکریاں اور تمہاری لونڈی تمہیں واپس ہو گی اور پھر آپ نے اس کے لڑکے کو سو کوڑے لگوائے اور ایک سال کے لئے جلاوطن کر دیا ۔ پھر آپ نے انیس اسلمی سے فرمایا کہ مدعی کی بیوی کو لائے اور اگر وہ زنا کا اقرار کرے تو اسے سنگسار کر دے ۔ اس عورت نے زنا کا اقرار کر لیا اور سنگسار کر دی گئی ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عبیداللہ بن عتبہ بن مسعود رضی اللہ عنہ نے ، انہیں ابوہریرہ رضی اللہ عنہ اور زید بن خالد رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ، أَنَّهُمَا أَخْبَرَاهُ أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَحَدُهُمَا اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ‏.‏ وَقَالَ الآخَرُ وَهْوَ أَفْقَهُهُمَا أَجَلْ يَا رَسُولَ اللَّهِ فَاقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ، وَائْذَنْ لِي أَنْ أَتَكَلَّمَ‏.‏ قَالَ ‏\"‏ تَكَلَّمْ ‏\"‏‏.‏ قَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا ـ قَالَ مَالِكٌ وَالْعَسِيفُ الأَجِيرُ ـ زَنَى بِامْرَأَتِهِ، فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي الرَّجْمَ، فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَجَارِيَةٍ لِي، ثُمَّ إِنِّي سَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّ مَا عَلَى ابْنِي جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، وَإِنَّمَا الرَّجْمُ عَلَى امْرَأَتِهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَا وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ، أَمَّا غَنَمُكَ وَجَارِيَتُكَ فَرَدٌّ عَلَيْكَ ‏\"‏‏.‏ وَجَلَدَ ابْنَهُ مِائَةً وَغَرَّبَهُ عَامًا، وَأُمِرَ أُنَيْسٌ الأَسْلَمِيُّ أَنْ يَأْتِيَ امْرَأَةَ الآخَرِ، فَإِنِ اعْتَرَفَتْ رَجَمَهَا، فَاعْتَرَفَتْ فَرَجَمَهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6369,
                "hadithNumber": "6635",
                "englishNarrator": "Narrated Abu Bakra:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Do you think if the tribes of Aslam, Ghifar, Muzaina and Juhaina are better than the tribes of Tamim, 'Amir bin Sa'sa'a, Ghatfan and Asad, they (the second group) are despairing and losing?\" They (the Prophet's companions) said, \"Yes, (they are).\" He said, \"By Him in Whose Hand my soul is, they (the first group) are better than them (the second group).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا بھلا بتلاؤ اسلم ، غفار ، مزینہ اور جہینہ کے قبائل اگر تمیم ، عامر بن صعصعہ ، غطفان اور اسد والوں سے بہتر ہوں تو یہ تمیم اور عامر اور غطفان اور اسد والے گھاٹے میں پڑے اور نقصان میں رہے یا نہیں ۔ صحابہ نے عرض کیا ، جی ہاں بیشک ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر پھر فرمایا کہ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ( وہ پہلے جن قبائل کا ذکر ہوا ) ان ( تمیم وغیرہ ) سے بہتر ہیں ۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے وہب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے محمد بن ابی یعقوب نے ، ان سے عبدالرحمٰن بن ابی بکرہ نے اور ان سے ان کے والد نے کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ أَبِي يَعْقُوبَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَرَأَيْتُمْ إِنْ كَانَ أَسْلَمُ وَغِفَارُ وَمُزَيْنَةُ وَجُهَيْنَةُ خَيْرًا مِنْ تَمِيمٍ وَعَامِرِ بْنِ صَعْصَعَةَ وَغَطَفَانَ وَأَسَدٍ، خَابُوا وَخَسِرُوا ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ فَقَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهُمْ خَيْرٌ مِنْهُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6370,
                "hadithNumber": "6636",
                "englishNarrator": "Narrated Abu Humaid As-Sa`idi رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) employed an employee (to collect Zakat). The employee returned after completing his job and said, \"O Allah's Messenger (ﷺ)! This (amount of Zakat) is for you, and this (other amount) was given to me as a present.\" The Prophet (ﷺ) said to him, \"Why didn't you stay at your father's or mother's house and see if you would be given presents or not?\" Then Allah's Messenger (ﷺ) got up in the evening after the prayer, and having testified that none has the right to be worshipped but Allah and praised and glorified Allah as He deserved, he said, \"Now then ! What about an employee whom we employ and then he comes and says, 'This amount (of Zakat) is for you, and this (amount) was given to me as a present'? Why didn't he stay at the house of his father and mother to see if he would be given presents or not? By Him in Whose Hand Muhammad's soul is, none of you will steal anything of it (i.e. Zakat) but will bring it by carrying it over his neck on the Day of Resurrection. If it has been a camel, he will bring it (over his neck) while it will be grunting, and if it has been a cow, he will bring it (over his neck), while it will be mooing; and if it has been a sheep, he will bring it (over his neck) while it will be bleeding.\" The Prophet (ﷺ) added, \"I have preached you (Allah's Message).\" Abu Humaid said, \"Then Allah's Messenger (ﷺ) raised his hands so high that we saw the whiteness of his armpits.\" Hadrat Abu Humaid says: Hadrat Zaid bin Thabit رضی اللہ عنہ heard this Hadith from the prophet ﷺ along with me, you can also ask him about it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک عامل مقررکیا ۔ عامل اپنے کام پورے کر کے آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا ، یا رسول اللہ ! یہ مال آپ کا ہے اور یہ مال مجھے تحفہ دیا گیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر تم اپنے ماں باپ کے گھر ہی میں کیوں نہیں بیٹھے رہے اور پھر دیکھتے کہ تمہیں کوئی تحفہ دیتا ہے یا نہیں ۔ اس کے بعد آپ خطبہ کے لئے کھڑے ہوئے ، رات کی نماز کے بعد اور کلمہ شہادت اور اللہ تعالیٰ کی اس کی شان کے مطابق ثنا کے بعد فرمایا امابعد ! ایسے عامل کو کیا ہو گیا ہے کہ ہم اسے عامل بناتے ہیں ۔ ( جزیہ اور دوسرے ٹیکس وصول کرنے کے لئے ) اور وہ پھر ہمارے پاس آ کر کہتا ہے کہ یہ تو آپ کا ٹیکس ہے اور مجھے تحفہ دیا گیا ہے ۔ پھر وہ اپنے ماں باپ کے گھر کیوں نہیں بیٹھا اور دیکھتاکہ اسے تحفہ دیا جاتا ہے یا نہیں ۔ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ، اگر تم میں سے کوئی بھی اس مال میں سے کچھ بھی خیانت کرے گا تو قیامت کے دن اسے اپنی گردن پر اٹھائے گا ۔ اگر اونٹ کی اس نے خیانت کی ہو گی تو اس حال میں لے کر آئے گا کہ آواز نکل رہی ہو گی ۔ اگر گائے کی خیانت کی ہو گی تو اس حال میں اسے لے کر آئے گا کہ گائے کی آواز آ رہی ہو گی ۔ اگر بکری کی خیانت کی ہو گی تو اس حال میں آئے گا کہ بکری کی آواز آ رہی ہو گی ۔ بس میں نے تم تک پہنچا دیا ۔ حضرت ابوحمید رضی اللہ عنہ نے بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے اپنا ہاتھ اتنی اوپر اٹھایا کہ ہم آپ کی بغلوں کی سفیدی دیکھنے لگے ۔ ابوحمید رضی اللہ عنہ نے بیان کیا کہ میرے ساتھ یہ حدیث زید بن ثابت رضی اللہ عنہ نے بھی آنحضرت صلی اللہ علیہ وسلم سے سنی تھی ، تم لوگ ان سے بھی پوچھ لو ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، کہا کہ مجھے عروہ ثقفی نے خبر دی ، نہیں ابو حمید ساعدی رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَ عَامِلاً فَجَاءَهُ الْعَامِلُ حِينَ فَرَغَ مِنْ عَمَلِهِ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا لَكُمْ، وَهَذَا أُهْدِيَ لِي‏.‏ فَقَالَ لَهُ ‏\"‏ أَفَلاَ قَعَدْتَ فِي بَيْتِ أَبِيكَ وَأُمِّكَ فَنَظَرْتَ أَيُهْدَى لَكَ أَمْ لاَ ‏\"‏‏.‏ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَشِيَّةً بَعْدَ الصَّلاَةِ فَتَشَهَّدَ وَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَمَا بَالُ الْعَامِلِ نَسْتَعْمِلُهُ، فَيَأْتِينَا فَيَقُولُ هَذَا مِنْ عَمَلِكُمْ، وَهَذَا أُهْدِيَ لِي‏.‏ أَفَلاَ قَعَدَ فِي بَيْتِ أَبِيهِ وَأُمِّهِ فَنَظَرَ هَلْ يُهْدَى لَهُ أَمْ لاَ، فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لاَ يَغُلُّ أَحَدُكُمْ مِنْهَا شَيْئًا، إِلاَّ جَاءَ بِهِ يَوْمَ الْقِيَامَةِ يَحْمِلُهُ عَلَى عُنُقِهِ، إِنْ كَانَ بَعِيرًا جَاءَ بِهِ لَهُ رُغَاءٌ، وَإِنْ كَانَتْ بَقَرَةً جَاءَ بِهَا لَهَا خُوَارٌ، وَإِنْ كَانَتْ شَاةً جَاءَ بِهَا تَيْعَرُ، فَقَدْ بَلَّغْتُ ‏\"‏‏.‏ فَقَالَ أَبُو حُمَيْدٍ ثُمَّ رَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ حَتَّى إِنَّا لَنَنْظُرُ إِلَى عُفْرَةِ إِبْطَيْهِ‏.‏ قَالَ أَبُو حُمَيْدٍ وَقَدْ سَمِعَ ذَلِكَ مَعِي زَيْدُ بْنُ ثَابِتٍ مِنَ النَّبِيِّ صلى الله عليه وسلم فَسَلُوهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6371,
                "hadithNumber": "6637",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Abu-l-Qasim (the Prophet) said, \"By Him in Whose Hand Muhammad's soul is, if you know that which I know, you would weep much and laugh little.\"",
                "hadithUrdu": "ابو القاسم (رسول اللہ صلی اللہ علیہ وسلم )نے فرمایا اس ذات کی قسم ! جس کے ہاتھ میں میری جان ہے اگر تم بھی آخرت کی وہ مشکلات جانتے جو میں جانتا ہوں تو تم زیادہ روتے اور کم ہنستے ۔",
                "urduNarrator": "مجھ سے ابراہیم بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم کو ہشام بن یوسف نے خبر دی ، انہیں معمر نے ، انہیں ہمام بن منبہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَام ٌ ـ هُوَ ابْنُ يُوسُفَ ـ عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏ \"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَبَكَيْتُمْ كَثِيرًا، وَلَضَحِكْتُمْ قَلِيلاً ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6372,
                "hadithNumber": "6638",
                "englishNarrator": "Narrated Abu Dhar رضی اللہ عنہ :",
                "hadithEnglish": "I reached him (the Prophet (ﷺ) ) while in the shade of the Ka`ba; he was saying, \"They are the losers, by the Lord of the Ka`ba! They are the losers, by the Lord of the Ka`ba!\" I said (to myself ), \"What is wrong with me? Is anything improper detected in me? What is wrong with me? Then I sat beside him and he kept on saying his statement. I could not remain quiet, and Allah knows in what sorrowful state I was at that time. So I said, ' Who are they (the losers)? Let My father and mother be sacrificed for you, O Allah's Messenger (ﷺ)!\" He said, \"They are the wealthy people, except the one who does like this and like this and like this (i.e., spends of his wealth in Allah's Cause).",
                "hadithUrdu": "میں آنحضرت صلی اللہ علیہ وسلم تک پہنچا تو آپ کعبہ کے سایہ میں بیٹھے ہوئے فرما رہے تھے کعبہ کے رب کی قسم ! وہی سب سے زیادہ خسارے والے ہیں ۔ کعبہ کے رب کی قسم وہی سب سے زیادہ خسارے والے ہیں ۔ میں نے کہا کہ حضور ، میری حالت کیسی ہے ، کیا مجھ میں ( بھی ) کوئی ایسی بات نظر آئی ہے ؟ میری حالت کیسی ہے ؟ پھر میں آنحضرت صلی اللہ علیہ وسلم کے پاس بیٹھ گیا اور آنحضرت صلی اللہ علیہ وسلم فرماتے جا رہے تھے ، میں آپ کو خاموش نہیں کرا سکتا تھا اور اللہ کی مشیت کے مطابق مجھ پر عجیب بےقراری طاری ہو گئی ۔ میں نے پھر عرض کی ، میرے ماں باپ آپ پر فدا ہوں ، یا رسول اللہ ! وہ کون لوگ ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ وہ لوگ ہیں جن کے پاس مال زیادہ ہے ۔ لیکن اس سے وہ مستثنیٰ ہیں ۔ جنہوں نے اس میں سے اس اس طرح ( یعنی دائیں اور بائیں بے دریغ مستحقین پر ) راہ خدا میں خرچ کیا ہو گا ۔",
                "urduNarrator": "ہم سے عمر بن حفص نے بیان کیا ، کہا ہم سے ہمارے والد نے ، کہا ہم سے اعمش نے ، ان سے معرور نے ، ان سے ابوذر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنِ الْمَعْرُورِ، عَنْ أَبِي ذَرٍّ، قَالَ انْتَهَيْتُ إِلَيْهِ وَهُوَ يَقُولُ فِي ظِلِّ الْكَعْبَةِ ‏\"‏ هُمُ الأَخْسَرُونَ وَرَبِّ الْكَعْبَةِ، هُمُ الأَخْسَرُونَ وَرَبِّ الْكَعْبَةِ ‏\"‏ قُلْتُ مَا شَأْنِي أَيُرَى فِيَّ شَىْءٌ مَا شَأْنِي فَجَلَسْتُ إِلَيْهِ وَهْوَ يَقُولُ، فَمَا اسْتَطَعْتُ أَنْ أَسْكُتَ، وَتَغَشَّانِي مَا شَاءَ اللَّهُ، فَقُلْتُ مَنْ هُمْ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الأَكْثَرُونَ أَمْوَالاً، إِلاَّ مَنْ قَالَ هَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6373,
                "hadithNumber": "6639",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"(The Prophet) Solomon once said, 'Tonight I will sleep with ninety women, each of whom will bring forth a (would-be) cavalier who will fight in Allah's Cause.\" On this, his companion said to him, \"Say: Allah willing!\" But he did not say Allah willing. Solomon then slept with all the women, but none of them became pregnant but one woman who later delivered a halfman. By Him in Whose Hand Muhammad's soul is, if he (Solomon) had said, 'Allah willing' (all his wives would have brought forth boys) and they would have fought in Allah's Cause as cavaliers. \"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا سلیمان علیہ السلام نے ایک دن کہا کہ آج میں رات میں اپنی نوے بیویوں کے پاس جاؤں گا اور ہر ایک کے یہاں ایک گھوڑ سوار بچہ پیدا ہو گا جو اللہ کے راستہ میں جہاد کرے گا ۔ اس پر ان کے ساتھ نے کہا کہ انشاءاللہ ۔ لیکن سلیمان علیہ السلام نے انشاءاللہ نہیں کہا ۔ چنانچہ وہ اپنی تمام بیویوں کے پاس گئے لیکن ایک عورت کے سوا کسی کو حمل نہیں ہوا اور اس سے بھی ناقص بچہ پیدا ہوا اور اس ذات کی قسم جس کے ہاتھ میں محمد کی جان ہے ! اگر انہوں نے انشاءاللہ کہہ دیا ہوتا تو ( تمام بیویوں کے یہاں بچے پیدا ہوتے ) اور سب گھوڑوں پر سوار ہو کر اللہ کے راستے میں جہاد کرنے والے ہوتے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے عبدالرحمٰن اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ قَالَ سُلَيْمَانُ لأَطُوفَنَّ اللَّيْلَةَ عَلَى تِسْعِينَ امْرَأَةً، كُلُّهُنَّ تَأْتِي بِفَارِسٍ يُجَاهِدُ فِي سَبِيلِ اللَّهِ‏.‏ فَقَالَ لَهُ صَاحِبُهُ إِنْ شَاءَ اللَّهُ‏.‏ فَلَمْ يَقُلْ إِنْ شَاءَ اللَّهُ‏.‏ فَطَافَ عَلَيْهِنَّ جَمِيعًا، فَلَمْ تَحْمِلْ مِنْهُنَّ إِلاَّ امْرَأَةٌ وَاحِدَةٌ، جَاءَتْ بِشِقِّ رَجُلٍ، وَايْمُ الَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ قَالَ إِنْ شَاءَ اللَّهُ‏.‏ لَجَاهَدُوا فِي سَبِيلِ اللَّهِ فُرْسَانًا أَجْمَعُونَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6374,
                "hadithNumber": "6640",
                "englishNarrator": "Narrated Al-Bara 'bin `Azib رضی اللہ عنہ :",
                "hadithEnglish": "A piece of silken cloth was given to the Prophet (ﷺ) as a present and the people handed it over amongst themselves and were astonished at its beauty and softness. Allah's Messenger (ﷺ) said, \"Are you astonished at it?\" They said, \"Yes, O Allah's Messenger (ﷺ)!\" He said, \"By Him in Whose Hand my soul is, the handkerchiefs of Sa`d رضی اللہ عنہ  in Paradise are better than it.\" Shobah,s and Israil's reports from Abu Ishaq don't have ''‏ وَالَّذِي نَفْسِي بِيَدِهِ'' .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ریشم کا ایک ٹکڑا ہدیہ کے طور پر آیا تو لوگ اسے دست بدست اپنے ہاتھوں میں لینے لگے اور اس کی خوبصورتی اور نرمی پرحیرت کرنے لگے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ تمہیں اس پر حیرت ہے ؟ صحابہ نے عرض کی جی ہاں ، یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے فرمایا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ، سعد رضی اللہ عنہ کے رومال جنت میں اس سے بھی اچھے ہیں ۔ شعبہ اور اسرائیل نے ابواسحاق سے الفاظ ” اس ذات کی قسم جس کے ہاتھ میں میری جان ہے “ کا ذکر نہیں کیا ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے ابوالاحوص نے بیان کیا ، ان سے ابواسحاق نے ، ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ أُهْدِيَ إِلَى النَّبِيِّ صلى الله عليه وسلم سَرَقَةٌ مِنْ حَرِيرٍ، فَجَعَلَ النَّاسُ يَتَدَاوَلُونَهَا بَيْنَهُمْ، وَيَعْجَبُونَ مِنْ حُسْنِهَا وَلِينِهَا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَعْجَبُونَ مِنْهَا ‏\"‏‏.‏ قَالُوا نَعَمْ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَمَنَادِيلُ سَعْدٍ فِي الْجَنَّةِ خَيْرٌ مِنْهَا ‏\"‏‏.‏ لَمْ يَقُلْ شُعْبَةُ وَإِسْرَائِيلُ عَنْ أَبِي إِسْحَاقَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6375,
                "hadithNumber": "6641",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Hind bint `Utba bin Rabi`a said, \"O Allah 's Apostle! (Before I embraced Islam), there was no family on the surface of the earth, I wish to have degraded more than I did your family. But today there is no family whom I wish to have honored more than I did yours.\" Allah's Messenger (ﷺ) said, \"I thought similarly, by Him in Whose Hand Muhammad's soul is!\" Hind said, \"O Allah's Messenger (ﷺ)! (My husband) Abu Sufyan is a miser. Is it sinful of me to feed my children from his property?\" The Prophet said, \"No, unless you take it for your needs what is just and reasonable.\"",
                "hadithUrdu": "ہند بنت عتبہ بن ربیعہ ( معاویہ رضی اللہ عنہ کی ماں ) نے عرض کیا یا رسول اللہ ! ساری زمین پر جتنے ڈیرے والے ہیں ( یعنی عرب لوگ جو اکثر ڈیروں اور خیموں میں رہا کرتے تھے ) میں کسی کا ذلیل و خوار ہونا مجھ کو اتنا پسند نہیں تھا جتنا آپ کا ۔ یحییٰ بن بکیر راوی کو شک ہے ( کہ ڈیرے کا لفظ بہ صیغہ مفرد کہا یا بہ صیغہ جمع ) اب کوئی ڈیرہ والا یا ڈیرے والے ان کو عزت اور آبرو حاصل ہونا مجھ کو آپ کے ڈیرے والوں سے زیادہ پسند نہیں ہے ( یعنی اب میں آپ کی اور مسلمانوں کی سب سے زیادہ خیرخواہ ہوں ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا ابھی کیا ہے تو اور بھی زیادہ خیرخواہ بنے گی ۔ قسم ہے اس کی جس کے ہاتھ میں محمد کی جان ہے ۔ پھر ہند کہنے لگی یا رسول اللہ ! ابوسفیان تو ایک بخیل آدمی ہے مجھ پر گناہ تو نہیں ہو گا اگر میں اس کے مال میں سے ( اپنے بال بچوں کو کھلاؤں ) آپ نے فرمایا نہیں اگر تو دستور کے موافق خرچ کرے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے ، انہوں نے یونس سے ، انہوں نے ابن شہاب سے ، کہا مجھ سے عروہ بن زبیر نے بیان کیا کہ حضرت عائشہ رضی اللہ عنہا نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ إِنَّ هِنْدَ بِنْتَ عُتْبَةَ بْنِ رَبِيعَةَ قَالَتْ يَا رَسُولَ اللَّهِ مَا كَانَ مِمَّا عَلَى ظَهْرِ الأَرْضِ أَهْلُ أَخْبَاءٍ ـ أَوْ خِبَاءٍ ـ أَحَبَّ إِلَىَّ أَنْ يَذِلُّوا مِنْ أَهْلِ أَخْبَائِكَ ـ أَوْ خِبَائِكَ، شَكَّ يَحْيَى ـ ثُمَّ مَا أَصْبَحَ الْيَوْمَ أَهْلُ أَخْبَاءٍ ـ أَوْ خِبَاءٍ ـ أَحَبَّ إِلَىَّ مِنْ أَنْ يَعِزُّوا مِنْ أَهْلِ أَخْبَائِكَ أَوْ خِبَائِكَ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَأَيْضًا وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ ‏\"‏‏.‏ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ مِسِّيكٌ، فَهَلْ عَلَىَّ حَرَجٌ أَنْ أُطْعِمَ مِنَ الَّذِي لَهُ قَالَ ‏\"‏ لاَ إِلاَّ بِالْمَعْرُوفِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6376,
                "hadithNumber": "6642",
                "englishNarrator": "Narrated `Abdullah bin Masud رضی اللہ عنہ :",
                "hadithEnglish": "While Allah's Messenger (ﷺ) was sitting, reclining his back against a Yemenite leather tent he said to his companions, \"Will you be pleased to be one-fourth of the people of Paradise?\" They said, 'Yes.' He said \"Won't you be pleased to be one-third of the people of Paradise\" They said, \"Yes.\" He said, \"By Him in Whose Hand Muhammad's soul is, I hope that you will be one-half of the people of Paradise.\"",
                "hadithUrdu": "ایک موقع پر رسول اللہ صلی اللہ علیہ وسلم جب یمنی چمڑے کے خیمہ سے پشت لگائے ہوئے بیٹھے تھے تو آپ نے اپنے صحابہ سے فرمایا کیا تم اس پر خوش ہو کہ تم اہل جنت کے ایک چوتھائی رہو ؟ انہوں نے عرض کیا ، کیوں نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ۔ کیا تم اس پر خوش نہیں ہو کہ تم اہل جنت کے ایک تہائی حصہ پاؤ ۔ صحابہ نے عرض کیا کیوں نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا ، پس اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ! مجھے امید ہے کہ جنت میں آدھے تم ہی ہو گے ۔",
                "urduNarrator": "مجھ سے احمد بن عثمان نے بیان کیا ، انہوں نے کہا ہم سے شریح بن مسلمہ نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، ان سے ابواسحاق نے ، کہا کہ میں نے عمرو بن میمون سے سنا ، کہا کہ مجھ سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ عُثْمَانَ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، سَمِعْتُ عَمْرَو بْنَ مَيْمُونٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ بَيْنَمَا رَسُولُ اللَّهِ صلى الله عليه وسلم مُضِيفٌ ظَهْرَهُ إِلَى قُبَّةٍ مِنْ أَدَمٍ يَمَانٍ إِذْ قَالَ لأَصْحَابِهِ ‏\"‏ أَتَرْضَوْنَ أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قَالُوا بَلَى‏.‏ قَالَ ‏\"‏ أَفَلَمْ تَرْضَوْا أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قَالُوا بَلَى‏.‏ قَالَ ‏\"‏ فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، إِنِّي لأَرْجُو أَنْ تَكُونُوا نِصْفَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6377,
                "hadithNumber": "6643",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "A man heard another man reciting: Surat-ul-Ikhlas (The Unity) 'Say: He is Allah, the One (112) and he was repeating it. The next morning he came to Allah's Messenger (ﷺ) and mentioned the whole story to him as if he regarded the recitation of that Sura as insufficient On that, Allah's Messenger (ﷺ) said, \"By Him in Whose Hand my soul is! That (Sura No. 112) equals one-third of the Qur'an.\"",
                "hadithUrdu": "ایک صحابی نے سنا کہ ایک دوسرے صحابی سورۃ قل ھو اللہ باربار پڑھتے ہیں جب صبح ہوئی تو وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور آنحضرت صلی اللہ علیہ وسلم سے اس کا ذکر کیا ، وہ صحابی اس سورت کو کم سمجھتے تھے لیکن آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے یہ قرآن مجید کے ایک تہائی حصہ کے برابرہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے عبدالرحمٰن بن عبداللہ بن عبدالرحمٰن نے بیان کیا ، ان سے ان کے والد نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ، أَنَّ رَجُلاً، سَمِعَ رَجُلاً، يَقْرَأُ ‏{‏قُلْ هُوَ اللَّهُ أَحَدٌ‏}‏ يُرَدِّدُهَا، فَلَمَّا أَصْبَحَ جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ، وَكَأَنَّ الرَّجُلَ يَتَقَالُّهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهَا لَتَعْدِلُ ثُلُثَ الْقُرْآنِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "84",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 84,
                    "chapterNumber": "84",
                    "chapterEnglish": "Oaths and Vows",
                    "chapterUrdu": "قسموں اور نذروں کے بیان میں",
                    "chapterArabic": "كتاب الأيمان والنذور",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6378,
                "hadithNumber": "6644",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"Perform the bowing and the prostration properly (with peace of mind), for, by Him in Whose Hand my soul is, I see you from behind my back when you bow and when you prostrate.\"",
                "hadithUrdu": "انہوں نے نبی کریم کریم صلی اللہ علیہ وسلم سے سنا ۔ آپ فرما رہے تھے کہ رکوع اور سجدہ پورے طور پر ادا کیا کرو ۔ اللہ کی قسم جس کے ہاتھ میں میری جان ہے میں اپنی کمر کے پیچھے سے تم کو دیکھ لیتا ہوں جب رکوع اور سجدہ کرتے ہو ۔",
                "urduNarrator": "مجھ سے اسحاق نے بیان کیا ، کہا ہم کو حبان نے خبر دی ، کہا ہم سے ہمام نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، کہا ہم سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا حَبَّانُ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ أَتِمُّوا الرُّكُوعَ وَالسُّجُودَ، فَوَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لأَرَاكُمْ مِنْ بَعْدِ ظَهْرِي إِذَا مَا رَكَعْتُمْ وَإِذَا مَا سَجَدْتُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "1",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 1,
                    "chapterNumber": "1",
                    "chapterEnglish": "Revelation",
                    "chapterUrdu": "وحی کے بیان میں",
                    "chapterArabic": "كتاب بدء الوحى",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 6351,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=254",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=252",
                "label": "252",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=253",
                "label": "253",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=254",
                "label": "254",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=255",
                "label": "255",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=256",
                "label": "256",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=257",
                "label": "257",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=258",
                "label": "258",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=256",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=256",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=254",
        "to": 6375,
        "total": 40465
    }
}