{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 42,
        "data": [
            {
                "id": 1026,
                "hadithNumber": "1059",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ:",
                "hadithEnglish": "The sun eclipsed and the Prophet (ﷺ) got up, being afraid that it might be the Hour (i.e. Day of Judgment). He went to the Mosque and offered the prayer with the longest Qiyam, bowing and prostration that I had ever seen him doing. Then he said, \"These signs which Allah sends do not occur because of the life or death of somebody, but Allah makes His worshipers afraid by them. So when you see anything thereof, proceed to remember Allah, invoke Him and ask for His forgiveness.\"",
                "hadithUrdu": "ایک دفعہ سورج گرہن ہوا تو نبی کریم صلی اللہ علیہ وسلم بہت گھبرا کر اٹھے اس ڈر سے کہ کہیں قیامت نہ قائم ہو جائے ۔ آپ صلی اللہ علیہ وسلم نے مسجد میں آ کر بہت ہی لمبا قیام ، لمبا رکوع اور لمبے سجدوں کے ساتھ نماز پڑھی ۔ میں نے کبھی آپ صلی اللہ علیہ وسلم کو اس طرح کرتے نہیں دیکھا تھا ۔ آپ صلی اللہ علیہ وسلم نے نماز کے بعد فرمایا کہ یہ نشانیاں ہیں جنہیں اللہ تعالیٰ بھیجتا ہے یہ کسی کی موت و حیات کی وجہ سے نہیں آتیں بلکہ اللہ تعالیٰ ان کے ذریعہ اپنے بندوں کو ڈراتا ہے اس لیے جب تم اس طرح کی کوئی چیز دیکھو تو فوراً اللہ تعالیٰ کے ذکر اور اس سے استغفار کی طرف لپکو ۔",
                "urduNarrator": "ہم سے محمد بن علاء نے بیان کیا ، کہا کہ ہم سے ابواسامہ نے بیان کیا ، ان سے برید بن عبداللہ نے ، ان سے ابوبردہ نے ، ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ خَسَفَتِ الشَّمْسُ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَزِعًا، يَخْشَى أَنْ تَكُونَ السَّاعَةُ، فَأَتَى الْمَسْجِدَ، فَصَلَّى بِأَطْوَلِ قِيَامٍ وَرُكُوعٍ وَسُجُودٍ رَأَيْتُهُ قَطُّ يَفْعَلُهُ وَقَالَ ‏ \"‏ هَذِهِ الآيَاتُ الَّتِي يُرْسِلُ اللَّهُ لاَ تَكُونُ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، وَلَكِنْ يُخَوِّفُ اللَّهُ بِهِ عِبَادَهُ، فَإِذَا رَأَيْتُمْ شَيْئًا مِنْ ذَلِكَ فَافْزَعُوا إِلَى ذِكْرِهِ وَدُعَائِهِ وَاسْتِغْفَارِهِ ‏\"‏‏.‏",
                "headingArabic": "الذِّكْرِ فِي الْكُسُوفِ",
                "headingUrdu": "سورج گرہن کے وقت اللہ کو یاد کرنا",
                "headingEnglish": "To remember Allah during the eclips",
                "chapterId": "17",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 17,
                    "chapterNumber": "17",
                    "chapterEnglish": "Eclipses",
                    "chapterUrdu": "سورج گہن کے متعلق بیان",
                    "chapterArabic": "كتاب الكسوف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1027,
                "hadithNumber": "1060",
                "englishNarrator": "Narrated Al-Mughira bin Shu`ba رضی اللہ عنہ :",
                "hadithEnglish": "On the day of Ibrahim's death, the sun eclipsed and the people said that the eclipse was due to the death of Ibrahim رضی اللہ عنہ (the son of the Prophet). Allah's Messenger (ﷺ) said, \"The sun and the moon are two signs amongst the signs of Allah. They do not eclipse because of someone's death or life. So when you see them, invoke Allah and pray till the eclipse is clear.\"",
                "hadithUrdu": "جس دن ابراہیم رضی اللہ عنہ کی موت ہوئی سورج گرہن بھی اسی دن لگا ۔ اس پر بعض لوگوں نے کہا کہ گرہن ابراہیم رضی اللہ عنہ ( آنحضور اکرم صلی اللہ علیہ وسلم کے صاحبزادے ) کی وفات کی وجہ سے لگا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشان ہیں ۔ ان میں گرہن کسی کی موت و حیات کی وجہ سے نہیں لگتا ۔ جب اسے دیکھو تو اللہ پاک سے دعا کرو اور نماز پڑھو  حا لیکہ سورج صاف ہو جائے ۔",
                "urduNarrator": "ہم سے ابو الولید طیالسی نے بیان کیا ، انہوں نے کہا کہ ہم سے زائدہ بن قدامہ نے بیان کیا ، انہوں نے کہا کہ ہم سے زیاد بن علاقہ نے بیان کیا ، انہوں نے کہا کہ میں نے مغیرہ بن شعبہ رضی اللہ عنہ سے سنا کہ انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا زَائِدَةُ، قَالَ حَدَّثَنَا زِيَادُ بْنُ عِلاَقَةَ، قَالَ سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ انْكَسَفَتِ الشَّمْسُ يَوْمَ مَاتَ إِبْرَاهِيمُ، فَقَالَ النَّاسُ انْكَسَفَتْ لِمَوْتِ إِبْرَاهِيمَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمُوهُمَا فَادْعُوا اللَّهَ وَصَلُّوا حَتَّى يَنْجَلِيَ ‏\"‏‏.‏",
                "headingArabic": "الدُّعَاءِ فِي الْخُسُوفِ",
                "headingUrdu": "گرہن کے دوران دعا",
                "headingEnglish": "Invocation during the eclipse",
                "chapterId": "17",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 17,
                    "chapterNumber": "17",
                    "chapterEnglish": "Eclipses",
                    "chapterUrdu": "سورج گہن کے متعلق بیان",
                    "chapterArabic": "كتاب الكسوف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1028,
                "hadithNumber": "1061",
                "englishNarrator": "And this was narrated by Asma رضی اللہ عنہما :",
                "hadithEnglish": "When \"Allah's Messenger (ﷺ) finished the eclipse prayer and by then the sun (eclipse) had cleared. Then he delivered the Khutba (religious talk) and praised Allah as He deserved and then said Amma ba'du.\"\r\nWhen Allah's Messenger (ﷺ) got free , the sun had become bright. So, he delivered the sermon, praised Allah as He deserves, then said: To proceed!",
                "hadithUrdu": "جب سورج صاف ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نماز سے فارغ ہوئے اور آپ صلی اللہ علیہ وسلم نے خطبہ دیا ۔ پہلے اللہ تعالیٰ کی شان کے مطابق اس کی تعریف کی اس کے بعد فرمایا «أما بعد»  ۔",
                "urduNarrator": "اور ابواسامہ نے بیان کیا کہ ہم سے ہشام بن عروہ نے بیان کیا ، انہوں نے کہا کہ مجھے فاطمہ بنت منذر نے خبر دی ، ان سے حضرت اسماء بنت ابی بکر رضی اللہ عنہما نے فرمایا کہ",
                "hadithArabic": "وَقَالَ أَبُو أُسَامَةَ حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَتْنِي فَاطِمَةُ بِنْتُ الْمُنْذِرِ، عَنْ أَسْمَاءَ، قَالَتْ فَانْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ تَجَلَّتِ الشَّمْسُ فَخَطَبَ، فَحَمِدَ اللَّهَ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏ \"‏ أَمَّا بَعْدُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ الإِمَامِ فِي خُطْبَةِ الْكُسُوفِ أَمَّا بَعْدُ",
                "headingUrdu": "گرہن کے خطبہ کے دوران اماں بدو کا قول",
                "headingEnglish": "The saying of Amma ba'du during the Khutba of the eclipse",
                "chapterId": "17",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 17,
                    "chapterNumber": "17",
                    "chapterEnglish": "Eclipses",
                    "chapterUrdu": "سورج گہن کے متعلق بیان",
                    "chapterArabic": "كتاب الكسوف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1029,
                "hadithNumber": "1062",
                "englishNarrator": "Narrated Abu Bakra رضی اللہ عنہ :",
                "hadithEnglish": "In the lifetime of the Prophet (ﷺ) the sun eclipsed and then he offered a two rak`at prayer.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں سورج کو گرہن لگا تو آپ صلی اللہ علیہ وسلم نے دو رکعت نماز پڑھی تھی ۔",
                "urduNarrator": "ہم سے محمود بن غیلان نے بیان کیا ، کہا کہ ہم سے سعید بن عامر نے بیان کیا ، ان سے شعبہ نے ، ان سے یونس نے ، ان سے امام حسن بصری نے اور ان سے ابوبکرہ رضی اللہ عنہ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مَحْمُودٌ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ، عَنْ شُعْبَةَ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ قَالَ انْكَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَصَلَّى رَكْعَتَيْنِ‏.‏",
                "headingArabic": "الصَّلاَةِ فِي كُسُوفِ الْقَمَرِ",
                "headingUrdu": "چاند گرہن کی دعا",
                "headingEnglish": "The prayer f the lunar eclipse",
                "chapterId": "17",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 17,
                    "chapterNumber": "17",
                    "chapterEnglish": "Eclipses",
                    "chapterUrdu": "سورج گہن کے متعلق بیان",
                    "chapterArabic": "كتاب الكسوف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1030,
                "hadithNumber": "1063",
                "englishNarrator": "Narrated Abu Bakra:",
                "hadithEnglish": "In the lifetime of the Allah's Messenger (ﷺ) the sun eclipsed and he went out dragging his clothes till he reached the Mosque. The people gathered around him and he led them and offered two rak`at. When the sun (eclipse) cleared, he said, \"The sun and the moon are two signs amongst the signs of Allah; they do not eclipse because of the death of someone, and so when an eclipse occurs, pray and invoke Allah till the eclipse is over.\" It happened that a son of the Prophet (ﷺ) called Ibrahim رضی اللہ عنہ died on that day and the people were talking about that (saying that the eclipse was caused by his death).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں سورج گرہن لگا تو آپ صلی اللہ علیہ وسلم اپنی چادر گھسیٹتے ہوئے ( بڑی تیزی سے ) مسجد میں پہنچے ۔ صحابہ بھی جمع ہو گئے ۔ پھر آپ صلی اللہ علیہ وسلم نے انہیں دو رکعت نماز پڑھائی ، گرہن بھی ختم ہو گیا ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں اور ان میں گرہن کسی کی موت پر نہیں لگتا اس لیے جب گرہن لگے تو اس وقت تک نماز اور دعا میں مشغول رہو جب تک یہ صاف نہ ہو جائے ۔ یہ آپ صلی اللہ علیہ وسلم نے اس لیے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم کے ایک صاحبزادے ابراہیم رضی اللہ عنہ کی وفات ( اسی دن ) ہوئی تھی اور بعض لوگ ان کے متعلق کہنے لگے تھے ( کہ گرہن ان کی موت پر لگا ہے ) ۔",
                "urduNarrator": "ہم سے ابو معمر نے بیان کیا ، کہا کہ ہم سے عبدالورث نے بیان کیا ، کہا کہ ہم سے یونس نے بیان کیا ، ان سے امام حسن بصری نے ، ان سے ابوبکرہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا يُونُسُ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ خَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَخَرَجَ يَجُرُّ رِدَاءَهُ حَتَّى انْتَهَى إِلَى الْمَسْجِدِ، وَثَابَ النَّاسُ إِلَيْهِ فَصَلَّى بِهِمْ رَكْعَتَيْنِ، فَانْجَلَتِ الشَّمْسُ فَقَالَ ‏ \"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، وَإِنَّهُمَا لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ، وَإِذَا كَانَ ذَاكَ فَصَلُّوا وَادْعُوا حَتَّى يُكْشَفَ مَا بِكُمْ ‏\"‏‏.‏ وَذَاكَ أَنَّ ابْنًا لِلنَّبِيِّ صلى الله عليه وسلم مَاتَ، يُقَالُ لَهُ إِبْرَاهِيمُ، فَقَالَ النَّاسُ فِي ذَاكَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "17",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 17,
                    "chapterNumber": "17",
                    "chapterEnglish": "Eclipses",
                    "chapterUrdu": "سورج گہن کے متعلق بیان",
                    "chapterArabic": "كتاب الكسوف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1031,
                "hadithNumber": "1064",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) led us and performed four bowing in two rak`at during the solar eclipse and the first rak`a was longer.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے سورج گرہن کی دو رکعتوں میں چار رکوع کئے اور پہلی رکعت دوسری رکعت سے لمبی تھی ۔",
                "urduNarrator": "ہم سے محمود بن غیلان نے بیان کیا ، انہوں نے کہا کہ ہم سے ابو احمد محمد بن عبداللہ زبیری نے بیان کیا ، انہوں نے کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے یحیی بن سعید انصاری نے ، ان سے عمرہ نے ، ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مَحْمُودٌ، قَالَ حَدَّثَنَا أَبُو أَحْمَدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى بِهِمْ فِي كُسُوفِ الشَّمْسِ أَرْبَعَ رَكَعَاتٍ فِي سَجْدَتَيْنِ، الأَوَّلُ الأَوَّلُ أَطْوَلُ‏.‏",
                "headingArabic": "الرَّكْعَةُ الأُولَى فِي الْكُسُوفِ أَطْوَلُ",
                "headingUrdu": "سورج گرہن کی نماز کی پہلی رکعت لمبی ہے۔",
                "headingEnglish": "The first Rak'a of the eclipse prayer is longer",
                "chapterId": "17",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 17,
                    "chapterNumber": "17",
                    "chapterEnglish": "Eclipses",
                    "chapterUrdu": "سورج گہن کے متعلق بیان",
                    "chapterArabic": "كتاب الكسوف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1032,
                "hadithNumber": "1065, 1066",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) recited (the Qur'an) aloud during the eclipse prayer and when he had finished the eclipse prayer he said the Takbir and bowed. When he stood straight from bowing he would say \"Sami 'allahu liman hamidah Rabbana wa laka l-hamd.\" And he would again start reciting. In the eclipse prayer there are four bowing and four prostrations in two rak`at. \r\nAl-Auza'i and others said that they had heard Az-Zuhri from 'Urwa from `Aisha saying, \"In the lifetime of Allah's Messenger (ﷺ) the sun eclipsed, and he made a person to announce: 'Prayer in congregation.' He led the prayer and performed four bowing and four prostrations in two rak`at.\" Narrated Al-Walid that `Abdur-Rahman bin Namir had informed him that he had heard the same. Ibn Shihab heard the same. Az-Zuhri said, \"I asked ('Urwa), 'What did your brother `Abdullah bin Az-Zubair do? He prayed two rak`at (of the eclipse prayer) like the morning prayer, when he offered the (eclipse) prayer in Medina.' 'Urwa replied that he had missed (i.e. did not pray according to) the Prophet's tradition.\" Sulaiman bin Kathir and Sufyan bin Husain narrated from Az-Zuhri that the prayer for the eclipse used to be offered with loud recitation.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے گرہن کی نماز میں قرآت بلند آواز سے کی ، قرآت سے فارغ ہو کر آپ صلی اللہ علیہ وسلم تکبیر کہہ کر رکوع میں چلے گئے جب رکوع سے سر اٹھایا تو «سمع الله لمن حمده ،‏‏‏‏ ‏‏‏‏ ربنا ولك الحمد‏» کہا پھر دوبارہ قرآت شروع کی ۔ غرض گرہن کی دو رکعتوں میں آپ صلی اللہ علیہ وسلم نے چار رکوع اور چار سجدے کئے ۔\r\nاور امام اوزاعی رحمہ اللہ نے کہا کہ میں نے زہری سے سنا ، انہوں نے عروہ سے اور عروہ نے عائشہ رضی اللہ عنہا سے کہ نبی کریم صلی اللہ علیہ وسلم کے عہد میں سورج گرہن لگا تو آپ صلی اللہ علیہ وسلم نے ایک آدمی سے اعلان کرا دیا کہ نماز ہونے والی ہے پھر آپ صلی اللہ علیہ وسلم نے دو رکعتیں چار رکوع اور چار سجدوں کے ساتھ پڑھیں ۔ ولید بن مسلم نے بیان کیا کہ مجھے عبدالرحمٰن بن نمر نے خبر دی اور انہوں نے ابن شہاب سے سنا ، اسی حدیث کی طرح زہری ( ابن شہاب ) نے بیان کیا کہ اس پر میں نے ( عروہ سے ) پوچھا کہ پھر تمہارے بھائی عبداللہ بن زبیر نے جب مدینہ میں «کسوف» کی نماز پڑھائی تو کیوں ایسا کیا کہ جس طرح صبح کی نماز پڑھی جاتی ہے ۔ اسی طرح یہ نماز «کسوف» بھی انہوں نے پڑھائی ۔ انہوں نے جواب دیا کہ ہاں انہوں نے سنت کے خلاف کیا ۔ عبدالرحمٰن بن نمر کے ساتھ اس حدیث کو سلیمان بن کثیر اور سفیان بن حسین نے بھی زہری سے روایت کیا ، اس میں بھی جہری قرآت کرنے کا بیان ہے ۔",
                "urduNarrator": "ہم سے محمد بن مہران نے بیان کیا ، انہوں نے کہا کہ ہم سے ولید بن سلم نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدا لرحمن بن نمر نے بیان کیا ، انہوں نے ابن شہاب سنا ، انہوں نے عروہ سے اور عروہ نے ( اپنی خالہ ) حضرت عائشہ صدیقہ رضی اللہ عنہا سے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ، قَالَ حَدَّثَنَا الْوَلِيدُ، قَالَ أَخْبَرَنَا ابْنُ نَمِرٍ، سَمِعَ ابْنَ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ جَهَرَ النَّبِيُّ صلى الله عليه وسلم فِي صَلاَةِ الْخُسُوفِ بِقِرَاءَتِهِ، فَإِذَا فَرَغَ مِنْ قِرَاءَتِهِ كَبَّرَ فَرَكَعَ، وَإِذَا رَفَعَ مِنَ الرَّكْعَةِ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ، رَبَّنَا وَلَكَ الْحَمْدُ‏.‏ ثُمَّ يُعَاوِدُ الْقِرَاءَةَ فِي صَلاَةِ الْكُسُوفِ، أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ‏.‏ وَقَالَ الأَوْزَاعِيُّ وَغَيْرُهُ سَمِعْتُ الزُّهْرِيَّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ الشَّمْسَ، خَسَفَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَبَعَثَ مُنَادِيًا بِالصَّلاَةُ جَامِعَةٌ، فَتَقَدَّمَ فَصَلَّى أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ‏.‏ وَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ نَمِرٍ سَمِعَ ابْنَ شِهَابٍ مِثْلَهُ‏.‏ قَالَ الزُّهْرِيُّ فَقُلْتُ مَا صَنَعَ أَخُوكَ ذَلِكَ، عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ مَا صَلَّى إِلاَّ رَكْعَتَيْنِ مِثْلَ الصُّبْحِ إِذْ صَلَّى بِالْمَدِينَةِ‏.‏ قَالَ أَجَلْ، إِنَّهُ أَخْطَأَ السُّنَّةَ‏.‏ تَابَعَهُ سُفْيَانُ بْنُ حُسَيْنٍ وَسُلَيْمَانُ بْنُ كَثِيرٍ عَنِ الزُّهْرِيِّ فِي الْجَهْرِ‏.‏",
                "headingArabic": "الْجَهْرِ بِالْقِرَاءَةِ فِي الْكُسُوفِ",
                "headingUrdu": "سورج گرہن کی نماز میں بلند آواز سے پڑھنا",
                "headingEnglish": "To recite aloud in the eclipse Salat",
                "chapterId": "17",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 17,
                    "chapterNumber": "17",
                    "chapterEnglish": "Eclipses",
                    "chapterUrdu": "سورج گہن کے متعلق بیان",
                    "chapterArabic": "كتاب الكسوف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1033,
                "hadithNumber": "1067",
                "englishNarrator": "Narrated `Abdullah bin Mas`ud رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) recited Suratan-Najm (103) at Mecca and prostrated while reciting it and those who were with him did the same except an old man who took a handful of small stones or earth and lifted it to his forehead and said, \"This is sufficient for me.\" Later on, I saw him killed as a non-believer.",
                "hadithUrdu": "مکہ میں نبی کریم صلی اللہ علیہ وسلم نے سورۃ النجم کی تلاوت کی اور سجدہ تلاوت کیا آپ صلی اللہ علیہ وسلم کے پاس جتنے آدمی تھے ( مسلمان اور کافر ) ان سب نے بھی آپ صلی اللہ علیہ وسلم کے ساتھ سجدہ کیا البتہ ایک بوڑھا شخص ( امیہ بن خلف ) اپنے ہاتھ میں کنکری یا مٹی اٹھا کر اپنی پیشانی تک لے گیا اور کہا میرے لیے یہی کافی ہے میں نے دیکھا کہ بعد میں وہ بوڑھا حالت کفر میں ہی مارا گیا ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے غندر محمد بن جعفر نے بیان کیا کہا کہ ہم سے شعبہ نے بیان کیا اور ان سے ابواسحاق نے انہوں نے کہا کہ میں نے اسود سے سنا انہوں نے عبداللہ بن مسعود رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الأَسْوَدَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَرَأَ النَّبِيُّ صلى الله عليه وسلم النَّجْمَ بِمَكَّةَ فَسَجَدَ فِيهَا، وَسَجَدَ مَنْ مَعَهُ، غَيْرَ شَيْخٍ أَخَذَ كَفًّا مِنْ حَصًى أَوْ تُرَابٍ فَرَفَعَهُ إِلَى جَبْهَتِهِ وَقَالَ يَكْفِينِي هَذَا‏.‏ فَرَأَيْتُهُ بَعْدَ ذَلِكَ قُتِلَ كَافِرًا‏.‏",
                "headingArabic": "مَا جَاءَ فِي سُجُودِ الْقُرْآنِ وَسُنَّتِهَا",
                "headingUrdu": "قرآن کی تلاوت کے دوران سجدے",
                "headingEnglish": "Prostrations during the recitation of the Qur'an",
                "chapterId": "18",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 18,
                    "chapterNumber": "18",
                    "chapterEnglish": "Prostration During Recital of Qur'an",
                    "chapterUrdu": "سجود قرآن کے مسائل",
                    "chapterArabic": "كتاب سجود القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1034,
                "hadithNumber": "1068",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "On Fridays the Prophet (ﷺ) used to recite Alif Lam Mim Tanzil-As-Sajda (in the first rak`a) and Hal ata `alal-insani i.e. Surat ad-Dahr (LXXVI) (in the second rak`a), in the Fajr prayer.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جمعہ کے دن فجر کی نماز میں «الم تنزيل‏ السجدة» اور «هل أتى على الإنسان‏» ( سورۃ دھر ) پڑھا کرتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن یوسف فریابی نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان ثوری نے بیان کیا ، انہوں نے سعد بن ابراہیم بن عبدالرحمٰن بن عوف سے بیان کیا ، ان سے عبدالرحمٰن بن ہرمز اعرج نے ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ فِي الْجُمُعَةِ فِي صَلاَةِ الْفَجْرِ ‏{‏الم * تَنْزِيلُ‏}‏ السَّجْدَةَ وَ‏{‏هَلْ أَتَى عَلَى الإِنْسَانِ‏}‏",
                "headingArabic": "سَجْدَةِ تَنْزِيلُ السَّجْدَةُ",
                "headingUrdu": "نماز تنزیل کی تلاوت کے دوران سجدہ کرنا - سجدہ (نمبر 32)",
                "headingEnglish": "To prostrate during the recitation of Salat Tanzil - As-Sajda (No. 32)",
                "chapterId": "18",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 18,
                    "chapterNumber": "18",
                    "chapterEnglish": "Prostration During Recital of Qur'an",
                    "chapterUrdu": "سجود قرآن کے مسائل",
                    "chapterArabic": "كتاب سجود القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1035,
                "hadithNumber": "1069",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The prostration of Sa`d is not a compulsory one but I saw the Prophet (ﷺ) prostrating while reciting it.",
                "hadithUrdu": "سورۃ ص کا سجدہ کچھ تاکیدی سجدوں میں سے نہیں ہے اور میں نے نبی کریم صلی اللہ علیہ وسلم کو سجدہ کرتے ہوئے دیکھا ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب اور ابوالنعمان بن فضل نے بیان کیا ، ان دونوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب نے بیان کیا ، ان سے عکرمہ نے بیان کیا اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَأَبُو النُّعْمَانِ، قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ ‏{‏ص‏}‏ لَيْسَ مِنْ عَزَائِمِ السُّجُودِ، وَقَدْ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَسْجُدُ فِيهَا‏.‏",
                "headingArabic": "سَجْدَةِ {ص}",
                "headingUrdu": "سورت ص کی تلاوت کرتے ہوئے سجدہ کرنا (نمبر 38)",
                "headingEnglish": "To prostrate while reciting Surat Sad (No. 38)",
                "chapterId": "18",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 18,
                    "chapterNumber": "18",
                    "chapterEnglish": "Prostration During Recital of Qur'an",
                    "chapterUrdu": "سجود قرآن کے مسائل",
                    "chapterArabic": "كتاب سجود القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1036,
                "hadithNumber": "1070",
                "englishNarrator": "Narrated `Abdullah bin Mas`ud رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) recited Surat-an-Najm (53) and prostrated while reciting it and all the people prostrated and a man amongst the people took a handful of stones or earth and raised it to his face and said, \"This is sufficient for me.Abdullah said: I Later on I saw him killed as a non-believer.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے سورۃ النجم کی تلاوت کی اور اس میں سجدہ کیا اس وقت قوم کا کوئی فرد ( مسلمان اور کافر ) بھی ایسا نہ تھا جس نے سجدہ نہ کیا ہو ۔ البتہ ایک شخص ( امیہ بن خلف ) نے ہاتھ میں کنکری یا مٹی لے کر اپنے چہرہ تک اٹھائی اور کہا کہ میرے لیے یہی کافی ہے ۔ عبداللہ بن مسعود رضی اللہ عنہما نے کہا کہ بعد میں میں نے دیکھا کہ وہ کفرکی حالت ہی میں قتل ہوا ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، کہا کہ ہم سے شعبہ نے ، ابواسحاق سے بیان کیا ، ان سے اسود نے ، ان سے عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَرَأَ سُورَةَ النَّجْمِ فَسَجَدَ بِهَا، فَمَا بَقِيَ أَحَدٌ مِنَ الْقَوْمِ إِلاَّ سَجَدَ، فَأَخَذَ رَجُلٌ مِنَ الْقَوْمِ كَفًّا مِنْ حَصًى أَوْ تُرَابٍ، فَرَفَعَهُ إِلَى وَجْهِهِ وَقَالَ يَكْفِينِي هَذَا، فَلَقَدْ رَأَيْتُهُ بَعْدُ قُتِلَ كَافِرًا‏.‏",
                "headingArabic": "سَجْدَةِ النَّجْمِ",
                "headingUrdu": "نجم میں سجدہ (نمبر 53)",
                "headingEnglish": "The prostration in An-Najm (No. 53)",
                "chapterId": "18",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 18,
                    "chapterNumber": "18",
                    "chapterEnglish": "Prostration During Recital of Qur'an",
                    "chapterUrdu": "سجود قرآن کے مسائل",
                    "chapterArabic": "كتاب سجود القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1037,
                "hadithNumber": "1071",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) I prostrated while reciting An-Najm and with him prostrated the Muslims, the pagans, the jinns, and all human beings.\r\nIbrahim bin Tahman has reported it from Ayyub.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے سورۃ النجم میں سجدہ کیا تو مسلمانوں ، مشرکوں اور جن و انس سب نے آپ صلی اللہ علیہ وسلم کے ساتھ سجدہ کیا ۔ \r\nاس حدیث کی روایت ابراہیم بن طہمان نے بھی ایوب سختیانی سے کی ہے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے عبدالوارث نے بیان کیا ، کہا ہم سے ایوب سختیانی نے بیان کیا ، ان سے عکرمہ نے ، ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ النَّبِيَّ صلى الله عليه وسلم سَجَدَ بِالنَّجْمِ وَسَجَدَ مَعَهُ الْمُسْلِمُونَ وَالْمُشْرِكُونَ وَالْجِنُّ وَالإِنْسُ‏.‏ وَرَوَاهُ ابْنُ طَهْمَانَ عَنْ أَيُّوبَ‏.‏",
                "headingArabic": "سُجُودِ الْمُسْلِمِينَ مَعَ الْمُشْرِكِينَ",
                "headingUrdu": "مشرکین کے ساتھ مسلمانوں کا سجدہ؛ اور مشرک نجس ہے اور وضو نہیں کرتا۔",
                "headingEnglish": "The prostrattion of Muslims along with Al-Mushrikun; and a Mushrik is Najasun (impure) and does not perform ablution;",
                "chapterId": "18",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 18,
                    "chapterNumber": "18",
                    "chapterEnglish": "Prostration During Recital of Qur'an",
                    "chapterUrdu": "سجود قرآن کے مسائل",
                    "chapterArabic": "كتاب سجود القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1038,
                "hadithNumber": "1072",
                "englishNarrator": "Narrated `Ata' bin Yasar:",
                "hadithEnglish": "I asked Zaid bin Thabit رضی اللہ عنہ about prostration on which he said that he had recited An-Najm before the Prophet, yet he (the Prophet) had not performed a prostration.",
                "hadithUrdu": "انہوں نے زید بن ثابت رضی اللہ عنہ سے سوال کیا ۔ آپ نے یقین کے ساتھ اس امر کا اظہار کیا کہ نبی کریم صلی اللہ علیہ وسلم کے سامنے سورۃ النجم کی تلاوت آپ نے کی تھی اور آنحضور صلی اللہ علیہ وسلم نے اس میں سجدہ نہیں کیا ۔",
                "urduNarrator": "ہم سے سلیمان بن داؤد ابوالربیع نے بیان کیا ، انہوں نے کہا کہ ہم سے اسماعیل بن جعفر نے بیان کیا ، کہا کہ ہمیں یزید بن خصیفہ نے خبر دی ، انہیں ( یزید بن عبداللہ ) ابن قسیط نے ، اور انہیں عطاء بن یسار نے کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَبُو الرَّبِيعِ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنَا يَزِيدُ بْنُ خُصَيْفَةَ، عَنِ ابْنِ قُسَيْطٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّهُ أَخْبَرَهُ، أَنَّهُ، سَأَلَ زَيْدَ بْنَ ثَابِتٍ ـ رضى الله عنه ـ فَزَعَمَ أَنَّهُ قَرَأَ عَلَى النَّبِيِّ صلى الله عليه وسلم ‏{‏وَالنَّجْمِ‏}‏ فَلَمْ يَسْجُدْ فِيهَا‏.‏",
                "headingArabic": "مَنْ قَرَأَ السَّجْدَةَ وَلَمْ يَسْجُدْ",
                "headingUrdu": "جس نے سجدہ کی آیات کی تلاوت کی اور سجدہ نہیں کیا۔",
                "headingEnglish": "Whoever recited the verses of prostration and did not prostrate",
                "chapterId": "18",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 18,
                    "chapterNumber": "18",
                    "chapterEnglish": "Prostration During Recital of Qur'an",
                    "chapterUrdu": "سجود قرآن کے مسائل",
                    "chapterArabic": "كتاب سجود القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1039,
                "hadithNumber": "1073",
                "englishNarrator": "Narrated Zaid bin Thabit رضی اللہ عنہ :",
                "hadithEnglish": "I recited An-Najm before the Prophet, yet he did not perform a prostration.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے سامنے سورۃ النجم کی تلاوت کی اور آپ صلی اللہ علیہ وسلم نے اس میں سجدہ نہیں کیا ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے ابن ابی ذئب نے بیان کیا ، کہا کہ ہم سے یزید بن عبداللہ بن قسیط نے بیان کیا ، ان سے عطاء بن یسار نے ، ان سے زید بن ثابت رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، قَالَ قَرَأْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم ‏{‏وَالنَّجْمِ‏}‏ فَلَمْ يَسْجُدْ فِيهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "18",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 18,
                    "chapterNumber": "18",
                    "chapterEnglish": "Prostration During Recital of Qur'an",
                    "chapterUrdu": "سجود قرآن کے مسائل",
                    "chapterArabic": "كتاب سجود القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1040,
                "hadithNumber": "1074",
                "englishNarrator": "Narrated Abu Salma:",
                "hadithEnglish": "I saw Abu Huraira رضی اللہ  عنہ reciting Idha-Sama' un-Shaqqat and he prostrated during its recitation. I asked Abu Huraira, \"Didn't I see you prostrating?\" Abu Huraira said, \"Had I not seen the Prophet (ﷺ) prostrating, I would not have prostrated.\"",
                "hadithUrdu": "میں نے ابوہریرہ رضی اللہ عنہ کو سورۃ «إذا السماء انشقت‏» پڑھتے دیکھا ۔ آپ نے اس میں سجدہ کیا میں نے کہا کہ اے ابوہریرہ ! کیا میں نے آپ کو سجدہ کرتے ہوئے نہیں دیکھا ہے ۔ آپ نے کہا کہ اگر میں نبی کریم صلی اللہ علیہ وسلم کو سجدہ کرتے نہ دیکھتا تو میں بھی نہ کرتا ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم اور معاذ بن فضالہ نے بیان کیا ، انہوں نے کہا کہ ہم سے ہشام بن ابی عبداللہ دستوائی نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے ، ان سے ابوسلمہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمٌ، وَمُعَاذُ بْنُ فَضَالَةَ، قَالاَ أَخْبَرَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ رَأَيْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَرَأَ ‏{‏إِذَا السَّمَاءُ انْشَقَّتْ‏}‏ فَسَجَدَ بِهَا فَقُلْتُ يَا أَبَا هُرَيْرَةَ، أَلَمْ أَرَكَ تَسْجُدُ قَالَ لَوْ لَمْ أَرَ النَّبِيَّ صلى الله عليه وسلم يَسْجُدُ لَمْ أَسْجُدْ‏.‏",
                "headingArabic": "سَجْدَةِ ‏{‏إِذَا السَّمَاءُ انْشَقَّتْ‏}‏",
                "headingUrdu": "عدت سماعون شقات پڑھتے ہوئے سجدہ کرنا",
                "headingEnglish": "Prostration while reciting Idhat-Sama'un-Shaqqat",
                "chapterId": "18",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 18,
                    "chapterNumber": "18",
                    "chapterEnglish": "Prostration During Recital of Qur'an",
                    "chapterUrdu": "سجود قرآن کے مسائل",
                    "chapterArabic": "كتاب سجود القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1041,
                "hadithNumber": "1075",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When the Prophet (ﷺ) recited a Sura that contained the prostration he would prostrate and we would do the same and some of us (because of the heavy rush) could not find a place for prostration.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ہماری موجودگی میں آیت سجدہ پڑھتے اور سجدہ کرتے تو ہم بھی آپ صلی اللہ علیہ وسلم کے ساتھ ( ہجوم کی وجہ سے ) اس طرح سجدہ کرتے کہ پیشانی رکھنے کی جگہ بھی نہ ملتی جس پر سجدہ کرتے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحیی بن سعید قطان نے بیان کیا ، کہا کہ ہم سے عبیداللہ عمری نے بیان کیا کہا کہ ہم سے نافع نے بیان کیا ان سے ابن عمر رضی اللہ عنہما نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ عَلَيْنَا السُّورَةَ فِيهَا السَّجْدَةُ، فَيَسْجُدُ وَنَسْجُدُ، حَتَّى مَا يَجِدُ أَحَدُنَا مَوْضِعَ جَبْهَتِهِ‏.‏",
                "headingArabic": "مَنْ سَجَدَ لِسُجُودِ الْقَارِئِ",
                "headingUrdu": "جس نے تلاوت کرنے والے کے سجدے کے ساتھ سجدہ کیا۔",
                "headingEnglish": "Whoever prostrated with the prostration of the reciter",
                "chapterId": "18",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 18,
                    "chapterNumber": "18",
                    "chapterEnglish": "Prostration During Recital of Qur'an",
                    "chapterUrdu": "سجود قرآن کے مسائل",
                    "chapterArabic": "كتاب سجود القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1042,
                "hadithNumber": "1076",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When the Prophet (ﷺ) recited Surat As-Sajda and we were with him, he would prostrate and we also would prostrate with him and some of us (because of the heavy rush) would not find a place (for our foreheads) to prostrate on.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم آیت سجدہ کی تلاوت اگر ہماری موجودگی میں کرتے تو آپ صلی اللہ علیہ وسلم کے ساتھ ہم بھی سجدہ کرتے تھے ۔ اس وقت اتنا اژدھام ہو جاتا کہ سجدہ کے لیے پیشانی رکھنے کی جگہ نہ ملتی جس پر سجدہ کرنے والا سجدہ کر سکے ۔",
                "urduNarrator": "ہم سے بشر بن آدم نے بیان کیا ، کہا کہ ہم سے علی بن مسہر نے بیان کیا ، کہا کہ ہمیں عبیداللہ عمری نے خبر دی ، انہیں نافع نے اور نافع کو ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا بِشْرُ بْنُ آدَمَ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، قَالَ أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ السَّجْدَةَ وَنَحْنُ عِنْدَهُ فَيَسْجُدُ وَنَسْجُدُ مَعَهُ فَنَزْدَحِمُ حَتَّى مَا يَجِدُ أَحَدُنَا لِجَبْهَتِهِ مَوْضِعًا يَسْجُدُ عَلَيْهِ‏.‏",
                "headingArabic": "ازْدِحَامِ النَّاسِ إِذَا قَرَأَ الإِمَامُ السَّجْدَةَ",
                "headingUrdu": "لوگوں کا ہجوم جب امام سجدہ پڑھتا ہے۔",
                "headingEnglish": "The overcrowding of the people when the Imam recites As-Sajda",
                "chapterId": "18",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 18,
                    "chapterNumber": "18",
                    "chapterEnglish": "Prostration During Recital of Qur'an",
                    "chapterUrdu": "سجود قرآن کے مسائل",
                    "chapterArabic": "كتاب سجود القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1043,
                "hadithNumber": "1077",
                "englishNarrator": "Narrated Rabi`a:",
                "hadithEnglish": "Rabi'a was one of the very good people. Rabi'a described the situation that she saw in the assembly of Hazrat Umar bin Khattab رضی اللہ عنہ . `Umar bin Al-Khattab رضی اللہ عنہ recited Surat-an-Nahl on a Friday on the pulpit and when he reached the verse of Sajda he got down from the pulpit and prostrated and the people also prostrated. The next Friday `Umar bin Al-Khattab recited the same Sura and when he reached the verse of Sajda he said, \"O people! When we recite the verses of Sajda (during the sermon) whoever prostrates does the right thing, yet it is no sin for the one who does not prostrate.\" And `Umar رضی اللہ عنہ did not prostrate (that day). Added Ibn `Umar رضی اللہ عنہما  \"Allah has not made the prostration of recitation compulsory but if we wish we can do it.\"",
                "hadithUrdu": "ربیعہ بہت اچھے لوگوں میں سے تھے ربیعہ نے وہ حال بیان کیا جو حضرت عمر بن خطاب رضی اللہ عنہ کی مجلس میں انہوں نے دیکھا ۔ حضرت عمر رضی اللہ عنہ نے جمعہ کے دن منبر پر سورۃ النحل پڑھی جب سجدہ کی آیت ( « ولله يسجد ما في السمٰوٰت » ) آخر تک پہنچے تو منبر پر سے اترے اور سجدہ کیا تو لوگوں نے بھی ان کے ساتھ سجدہ کیا ۔ دوسرے جمعہ کو پھر یہی سورت پڑھی جب سجدہ کی آیت پر پہنچے تو کہنے لگے لوگو ! ہم سجدہ کی آیت پڑھتے چلے جاتے ہیں پھر جو کوئی سجدہ کرے اس نے اچھا کیا اور جو کوئی نہ کرے تو اس پر کچھ گناہ نہیں اور حضرت عمر رضی اللہ عنہ نے سجدہ نہیں کیا اور نافع نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے نقل کیا کہ اللہ تعالیٰ نے سجدہ تلاوت فرض نہیں کیا ہماری خوشی پر رکھا ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، انہوں نے کہا کہ ہمیں ہشام بن یوسف نے خبر دی اور انہیں ابن جریج نے خبر دی ، انہوں نے کہا کہ مجھے ابوبکر بن ابی ملیکہ نے خبر دی ، انہیں عثمان بن عبدالرحمٰن تیمی نے اور انہیں ربیعہ بن عبداللہ بن ہدیر تیمی نے کہا   کہ ابوبکر بن ابی ملیکہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ أَبِي مُلَيْكَةَ، عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ التَّيْمِيِّ، عَنْ رَبِيعَةَ بْنِ عَبْدِ اللَّهِ بْنِ الْهُدَيْرِ التَّيْمِيِّ ـ قَالَ أَبُو بَكْرٍ وَكَانَ رَبِيعَةُ مِنْ خِيَارِ النَّاسِ عَمَّا حَضَرَ رَبِيعَةُ مِنْ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ قَرَأَ يَوْمَ الْجُمُعَةِ عَلَى الْمِنْبَرِ بِسُورَةِ النَّحْلِ حَتَّى إِذَا جَاءَ السَّجْدَةَ نَزَلَ فَسَجَدَ وَسَجَدَ النَّاسُ، حَتَّى إِذَا كَانَتِ الْجُمُعَةُ الْقَابِلَةُ قَرَأَ بِهَا حَتَّى إِذَا جَاءَ السَّجْدَةَ قَالَ يَا أَيُّهَا النَّاسُ إِنَّا نَمُرُّ بِالسُّجُودِ فَمَنْ سَجَدَ فَقَدْ أَصَابَ، وَمَنْ لَمْ يَسْجُدْ فَلاَ إِثْمَ عَلَيْهِ‏.‏ وَلَمْ يَسْجُدْ عُمَرُ ـ رضى الله عنه‏.‏ وَزَادَ نَافِعٌ عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما إِنَّ اللَّهَ لَمْ يَفْرِضِ السُّجُودَ إِلاَّ أَنْ نَشَاءَ‏.‏",
                "headingArabic": "مَنْ رَأَى أَنَّ اللَّهَ عَزَّ وَجَلَّ لَمْ يُوجِبِ السُّجُودَ",
                "headingUrdu": "جس کا گمان ہو کہ اللہ تعالیٰ نے سجدہ تلاوت کو فرض نہیں کیا ہے۔",
                "headingEnglish": "Whoever thinks that Allah has not made prostration of recitation compulsory",
                "chapterId": "18",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 18,
                    "chapterNumber": "18",
                    "chapterEnglish": "Prostration During Recital of Qur'an",
                    "chapterUrdu": "سجود قرآن کے مسائل",
                    "chapterArabic": "كتاب سجود القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1044,
                "hadithNumber": "1078",
                "englishNarrator": "Narrated Abu Rafi`:",
                "hadithEnglish": "I offered the `Isha' prayer behind Abu Huraira رضی اللہ عنہ and he recited Idhas-Sama' Un-Shaqqat, and prostrated. I said, \"What is this?\" Abu Huraira said, \"I prostrated behind Abul-Qasim صلى الله عليه وسلم and I will do the same till I meet him.\"",
                "hadithUrdu": "میں نے ابوہریرہ رضی اللہ عنہ کے ساتھ نماز عشاء پڑھی ۔ آپ نے «إذا السماء انشقت‏» کی تلاوت کی اور سجدہ کیا ۔ میں نے عرض کیا کہ آپ نے یہ کیا کیا ؟ انہوں نے اس کا جواب دیا کہ میں نے اس میں ابوالقاسم صلی اللہ علیہ وسلم کی اقتداء میں سجدہ کیا تھا اور ہمیشہ سجدہ کرتا ہوں گاحا لیکہ آپ صلی اللہ علیہ وسلم سے جا ملوں ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے معتمر بن سلیمان نے بیان کیا ، کہا کہ میں نے اپنے باپ سے سنا کہا کہ ہم سے بکر بن عبداللہ مزنی نے بیان کیا ، ان سے ابورافع نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي قَالَ، حَدَّثَنِي بَكْرٌ، عَنْ أَبِي رَافِعٍ، قَالَ صَلَّيْتُ مَعَ أَبِي هُرَيْرَةَ الْعَتَمَةَ فَقَرَأَ ‏{‏إِذَا السَّمَاءُ انْشَقَّتْ‏}‏ فَسَجَدَ فَقُلْتُ مَا هَذِهِ قَالَ سَجَدْتُ بِهَا خَلْفَ أَبِي الْقَاسِمِ صلى الله عليه وسلم فَلاَ أَزَالُ أَسْجُدُ فِيهَا حَتَّى أَلْقَاهُ‏.‏",
                "headingArabic": "مَنْ قَرَأَ السَّجْدَةَ فِي الصَّلاَةِ فَسَجَدَ بِهَا",
                "headingUrdu": "جس نے نماز میں سجدہ کی آیت پڑھی اور سجدہ کیا۔",
                "headingEnglish": "Whoever recited the Verse of Sajda during the Salat (prayer) and prostrated",
                "chapterId": "18",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 18,
                    "chapterNumber": "18",
                    "chapterEnglish": "Prostration During Recital of Qur'an",
                    "chapterUrdu": "سجود قرآن کے مسائل",
                    "chapterArabic": "كتاب سجود القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1045,
                "hadithNumber": "1079",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Whenever the Prophet (ﷺ) recited the Sura which contained the prostration of recitation he used to prostrate and then, we, too, would prostrate and some of us did not find a place for prostration.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کسی ایسی سورۃ کی تلاوت کرتے جس میں سجدہ ہوتا پھر آپ صلی اللہ علیہ وسلم سجدہ کرتے اور ہم بھی آپ صلی اللہ علیہ وسلم کے ساتھ سجدہ کرتے یہاں تک کہ ہم میں کسی کو اپنی پیشانی رکھنے کی جگہ نہ ملتی ۔ ( معلوم ہوا کہ ایسی حالت میں سجدہ نہ کیا جائے تو کوئی حرج نہیں ہے ) «والله أعلم» ۔",
                "urduNarrator": "ہم سے صدقہ بن فضل نے بیان کیا ، ان سے یحیی بن سعیدقطان نے بیان کیا ، ان سے عبیداللہ نے ، ان سے نافع نے ، اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا صَدَقَةُ، قَالَ أَخْبَرَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ السُّورَةَ الَّتِي فِيهَا السَّجْدَةُ فَيَسْجُدُ وَنَسْجُدُ حَتَّى مَا يَجِدُ أَحَدُنَا مَكَانًا لِمَوْضِعِ جَبْهَتِهِ‏.‏",
                "headingArabic": "مَنْ لَمْ يَجِدْ مَوْضِعًا لِلسُّجُودِ مِنَ الزِّحَامِ",
                "headingUrdu": "جس کو بھیڑ کی وجہ سے (امام کے ساتھ) سجدہ کی جگہ نہ ملے",
                "headingEnglish": "Whoever does not find a place for prostration (with the Imam) because of overcrowding",
                "chapterId": "18",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 18,
                    "chapterNumber": "18",
                    "chapterEnglish": "Prostration During Recital of Qur'an",
                    "chapterUrdu": "سجود قرآن کے مسائل",
                    "chapterArabic": "كتاب سجود القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1046,
                "hadithNumber": "1080",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) once stayed for nineteen days and prayed shortened prayers. So when we travel led (and stayed) for nineteen days, we used to shorten the prayer but if we traveled (and stayed) for a longer period we used to offer the full prayer.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ( مکہ میں فتح مکہ کے موقع پر ) انیس دن ٹھہرے اور برابر قصر کرتے رہے ۔ اس لیے انیس دن کے سفر میں ہم بھی قصر کرتے رہتے ہیں اور اس سے اگر زیادہ ہو جائے تو پوری نماز پڑھتے ہیں ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے ابوعوانہ وضاح یشکری نے بیان کیا ، ان سے عاصم احول اور حصین سلمی نے ، ان سے عکرمہ نے ، اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَاصِمٍ، وَحُصَيْنٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَقَامَ النَّبِيُّ صلى الله عليه وسلم تِسْعَةَ عَشَرَ يَقْصُرُ، فَنَحْنُ إِذَا سَافَرْنَا تِسْعَةَ عَشَرَ قَصَرْنَا، وَإِنْ زِدْنَا أَتْمَمْنَا‏.‏",
                "headingArabic": "مَا جَاءَ فِي التَّقْصِيرِ وَكَمْ يُقِيمُ حَتَّى يَقْصُرَ",
                "headingUrdu": "قیام کی کتنی مدت میں قصر کی نماز پڑھنی چاہیے؟",
                "headingEnglish": "For what period of stay one should offer shortened prayers",
                "chapterId": "19",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 19,
                    "chapterNumber": "19",
                    "chapterEnglish": "Shortening the Prayers (At-Taqseer)",
                    "chapterUrdu": "نماز میں قصر کرنے کا بیان",
                    "chapterArabic": "كتاب تقصير الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1047,
                "hadithNumber": "1081",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "\"We traveled with the Prophet (ﷺ) from Medina to Mecca and offered two rak`at (for every prayer) till we returned to Medina.\" I said, \"Did you stay for a while in Mecca?\" He replied, \"We stayed in Mecca for ten days.\"",
                "hadithUrdu": "ہم مکہ کے ارادہ سے مدینہ سے نکلے تو برابر نبی کریم صلی اللہ علیہ وسلم دو ، دو رکعت پڑھتے رہے ۔ یہاں تک کہ ہم مدینہ واپس آئے ۔ میں نے پوچھا کہ آپ صلی اللہ علیہ وسلم کا مکہ میں کچھ دن قیام بھی رہا تھا ؟ تو اس کا جواب انس رضی اللہ عنہ نے یہ دیا کہ دس دن تک ہم وہاں ٹھہرے تھے ۔",
                "urduNarrator": "ہم سے ابومعمر نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالوارث نے بیان کیا ، انہوں نے کہا کہ مجھ سے یحییٰ بن ابی اسحاق نے بیان کیا انہوں نے انس رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مِنَ الْمَدِينَةِ إِلَى مَكَّةَ، فَكَانَ يُصَلِّي رَكْعَتَيْنِ رَكْعَتَيْنِ حَتَّى رَجَعْنَا إِلَى الْمَدِينَةِ‏.‏ قُلْتُ أَقَمْتُمْ بِمَكَّةَ شَيْئًا قَالَ أَقَمْنَا بِهَا عَشْرًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 19,
                    "chapterNumber": "19",
                    "chapterEnglish": "Shortening the Prayers (At-Taqseer)",
                    "chapterUrdu": "نماز میں قصر کرنے کا بیان",
                    "chapterArabic": "كتاب تقصير الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1048,
                "hadithNumber": "1082",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "I offered the prayer with the Prophet, Abu Bakr and `Umar رضی اللہ عنہما at Mina and it was of two rak`at. `Uthman  رضی اللہ عنہ in the early days of his caliphate did the same, but later on he started praying the full prayer.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم ابوبکر اور عمر رضی اللہ عنہما کے ساتھ منیٰ میں دو رکعت ( یعنی چار رکعت والی نمازوں میں ) قصر پڑھی ۔ عثمان رضی اللہ عنہ کے ساتھ بھی ان کے دور خلافت کے شروع میں دو ہی رکعت پڑھی تھیں ۔ لیکن بعد میں آپ رضی اللہ عنہ نے پوری پڑھی تھیں ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحییٰ نے عبیداللہ عمری سے بیان کیا ، کہا کہ مجھے نافع نے خبر دی اور انہیں عبداللہ بن مسعود رضی اللہ عنہما نے ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم بِمِنًى رَكْعَتَيْنِ، وَأَبِي بَكْرٍ وَعُمَرَ، وَمَعَ عُثْمَانَ صَدْرًا مِنْ إِمَارَتِهِ ثُمَّ أَتَمَّهَا‏.‏",
                "headingArabic": "الصَّلاَةِ بِمِنًى",
                "headingUrdu": "منیٰ میں (حج کے دوران) نماز",
                "headingEnglish": "As-Salat (the prayers) at Mina (during Hajj)",
                "chapterId": "19",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 19,
                    "chapterNumber": "19",
                    "chapterEnglish": "Shortening the Prayers (At-Taqseer)",
                    "chapterUrdu": "نماز میں قصر کرنے کا بیان",
                    "chapterArabic": "كتاب تقصير الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1049,
                "hadithNumber": "1083",
                "englishNarrator": "Narrated Haritha bin Wahab رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) I led us in the prayer at Mina during the peace period by offering two rak`at.",
                "hadithUrdu": "آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے منیٰ میں امن کی حالت میں ہمیں دو رکعت نماز پڑھائی تھی ۔",
                "urduNarrator": "ہم سے ابو الولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہمیں ابواسحاق نے خبر دی ، انہوں نے حارثہ سے سنا اور انہوں نے وہب رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، أَنْبَأَنَا أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ، قَالَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم آمَنَ مَا كَانَ بِمِنًى رَكْعَتَيْنِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 19,
                    "chapterNumber": "19",
                    "chapterEnglish": "Shortening the Prayers (At-Taqseer)",
                    "chapterUrdu": "نماز میں قصر کرنے کا بیان",
                    "chapterArabic": "كتاب تقصير الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1050,
                "hadithNumber": "1084",
                "englishNarrator": "Narrated `Abdur Rahman bin Yazid:",
                "hadithEnglish": "We offered a four rak`at prayer at Mina behind Ibn `Affan . `Abdullah bin Mas`ud was informed about it. He said sadly, \"Truly to Allah we belong and truly to Him we shall return.\" And added, \"I prayed two rak`at with Allah's Messenger (ﷺ) at Mina and similarly with Abu Bakr رضی اللہ عنہ and with `Umar رضی اللہ عنہ (during their caliphates).\" He further said, \"May I be lucky enough to have two of the four rak`at accepted (by Allah).\"",
                "hadithUrdu": "ہمیں عثمان بن عفان رضی اللہ عنہ نے منیٰ میں چار رکعت نماز پڑھائی تھی لیکن جب اس کا ذکر عبداللہ بن مسعود رضی اللہ عنہما سے کیا گیا تو انہوں نے کہا کہ «انا لله و انا اليه راجعون» ۔ پھر کہنے لگے میں نے تو نبی کریم صلی اللہ علیہ وسلم کے ساتھ منی ٰ میں دو رکعت نماز پڑھی ہے اور ابوبکر صدیق رضی اللہ عنہ کے ساتھ بھی میں نے دو رکعت ہی پڑھی ہیں اور عمر بن خطاب رضی اللہ عنہ کے ساتھ بھی دو رکعت ہی پڑھی تھی کاش میرے حصہ میں ان چار رکعتوں کے بجائے دو مقبول رکعتیں ہوتیں ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالواحد بن زیاد نے بیان کیا ، ان سے اعمش نے ، انہوں نے کہا کہ ہم سے ابراہیم نخعی نے بیان کیا ، انہوں نے کہا کہ,میں نے عبدالرحمٰن بن یزید سے سنا ، وہ کہتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنِ الأَعْمَشِ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ، يَقُولُ صَلَّى بِنَا عُثْمَانُ بْنُ عَفَّانَ ـ رضى الله عنه ـ بِمِنًى أَرْبَعَ رَكَعَاتٍ، فَقِيلَ ذَلِكَ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ فَاسْتَرْجَعَ ثُمَّ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِنًى رَكْعَتَيْنِ، وَصَلَّيْتُ مَعَ أَبِي بَكْرٍ ـ رضى الله عنه ـ بِمِنًى رَكْعَتَيْنِ، وَصَلَّيْتُ مَعَ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ بِمِنًى رَكْعَتَيْنِ، فَلَيْتَ حَظِّي مِنْ أَرْبَعِ رَكَعَاتٍ رَكْعَتَانِ مُتَقَبَّلَتَانِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "19",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 19,
                    "chapterNumber": "19",
                    "chapterEnglish": "Shortening the Prayers (At-Taqseer)",
                    "chapterUrdu": "نماز میں قصر کرنے کا بیان",
                    "chapterArabic": "كتاب تقصير الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1026,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=41",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=39",
                "label": "39",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=40",
                "label": "40",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=41",
                "label": "41",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=42",
                "label": "42",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=43",
                "label": "43",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=44",
                "label": "44",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=45",
                "label": "45",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=43",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=43",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=41",
        "to": 1050,
        "total": 40465
    }
}