{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 83,
        "data": [
            {
                "id": 2052,
                "hadithNumber": "2136",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The buyer of foodstuff should not sell it before it has been measured for him.\" Isma`il narrated instead, \"He should not sell it before receiving it.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جو شخص بھی جب غلہ خریدے تو جب تک اسے پوری طرح قبضہ میں نہ لے لے ، نہ بیچے ۔ اسماعیل نے یہ زیادتی کی ہے کہ جو شخص کوئی غلہ خریدے تو اس پر قبضہ کرنے سے پہلے نہ بیچے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا کہ ہم سے امام مالک نے بیان کیا ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہمانے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ ‏\"‏‏.‏ زَادَ إِسْمَاعِيلُ ‏\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَقْبِضَهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2053,
                "hadithNumber": "2137",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I saw the people buy foodstuff randomly (i.e. blindly without measuring it) in the lifetime of Allah's Apostle and they were punished (by beating), if they tried to sell it before carrying it to their own houses.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں دیکھا کہ لوگوں کو اس پر تنبیہ کی جاتی جب وہ غلہ کا ڈھیر خرید کر کے اپنے ٹھکانے پر لانے سے پہلے ہی اس کو بیچ ڈالتے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے بیان کیا ، کہ مجھے سالم بن عبداللہ رضی اللہ عنہ نے خبر دی ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ لَقَدْ رَأَيْتُ النَّاسَ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَبْتَاعُونَ جِزَافًا ـ يَعْنِي الطَّعَامَ ـ يُضْرَبُونَ أَنْ يَبِيعُوهُ فِي مَكَانِهِمْ حَتَّى يُؤْوُوهُ إِلَى رِحَالِهِمْ‏.‏",
                "headingArabic": "مَنْ رَأَى إِذَا اشْتَرَى طَعَامًا جِزَافًا أَنْ لاَ يَبِيعَهُ حَتَّى يُئْوِيَهُ إِلَى رَحْلِهِ، وَالأَدَبِ فِي ذَلِكَ",
                "headingUrdu": "جس نے ناپ تول کے بغیر کھانے پینے کی چیزیں خریدیں وہ گھر میں لانے سے پہلے فروخت نہ کرے۔",
                "headingEnglish": "Whoever bought foodstuff without measuring or weighing should not sell before bringing into house",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2054,
                "hadithNumber": "2138",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Rarely did the Prophet (ﷺ) fail to visit Abu Bakr's house everyday, either in the morning or in the evening. When the permission for migration to Medina was granted, all of a sudden the Prophet (ﷺ) came to us at noon and Abu Bakr was informed, who said, \"Certainly the Prophet (ﷺ) has come for some urgent matter.\" The Prophet (ﷺ) said to Abu Bark رضی اللہ عنہ , when the latter entered \"Let nobody stay in your home.\" Abu Bakr رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! There are only my two daughters (namely `Aisha and Asma') present.\" The Prophet (ﷺ) said, \"I feel (am informed) that I have been granted the permission for migration.\" Abu Bakr رضی اللہ عنہ said, \"I will accompany you, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, \"You will accompany me.\" Abu Bakr رضی اللہ عنہ then said \"O Allah's Messenger (ﷺ)! I have two she-camels I have prepared specially for migration, so I offer you one of them. The Prophet (ﷺ) said, \"I have accepted it on the condition that I will pay its price.\"",
                "hadithUrdu": "ایسے دن ( مکی زندگی میں ) بہت ہی کم آئے ، جن میں نبی کریم صلی اللہ علیہ وسلم صبح و شام میں کسی نہ کسی وقت ابوبکر رضی اللہ عنہ کے گھر تشریف نہ لائے ہوں ۔ پھر جب آپ صلی اللہ علیہ وسلم کو مدینہ کی طرف ہجرت کی اجازت دی گئی ، تو ہماری گھبراہٹ کا سبب یہ ہوا کہ آپ ( معمول کے خلاف اچانک ) ظہر کے وقت ہمارے گھر تشریف لائے ۔ جب حضرت ابوبکر رضی اللہ عنہ کو آپ صلی اللہ علیہ وسلم کی آمد کی اطلاع دی گئی تو انہوں نے بھی یہی کہا کہ نبی کریم صلی اللہ علیہ وسلم اس وقت ہمارے یہاں کوئی نئی بات پیش آنے ہی کی وجہ سے تشریف لائے ہیں ۔ جب آپ صلی اللہ علیہ وسلم ابوبکر رضی اللہ عنہ کے پاس پہنچے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس وقت جو لوگ تمہارے پاس ہوں انہیں ہٹا دو ۔ ابوبکر رضی اللہ عنہ نے عرض کیا ، یا رسول اللہ ! یہاں تو صرف میری یہی دو بیٹیاں ہیں یعنی عائشہ اور اسماء رضی اللہ عنہما ۔ اب آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں معلوم بھی ہے مجھے تو یہاں سے نکلنے کی اجازت مل گئی ہے ۔ ابوبکر رضی اللہ عنہ نے عرض کیا میرے پاس دو اونٹنیاں ہیں جنہیں میں نے نکلنے ہی کے لیے تیار کر رکھا تھا ۔ آپ ان میں سے ایک لے لیجئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا ، قیمت کے بدلے میں ، میں نے ایک اونٹنی لے لی ۔",
                "urduNarrator": "ہم سے فروہ بن ابی مغراء نے بیان کیا ، کہا کہ ہم کو علی بن مسہر نے خبر دی ، انہیں ہشام نے ، انہیں ان کے باپ نے ، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَقَلَّ يَوْمٌ كَانَ يَأْتِي عَلَى النَّبِيِّ صلى الله عليه وسلم إِلاَّ يَأْتِي فِيهِ بَيْتَ أَبِي بَكْرٍ أَحَدَ طَرَفَىِ النَّهَارِ، فَلَمَّا أُذِنَ لَهُ فِي الْخُرُوجِ إِلَى الْمَدِينَةِ لَمْ يَرُعْنَا إِلاَّ وَقَدْ أَتَانَا ظُهْرًا، فَخُبِّرَ بِهِ أَبُو بَكْرٍ فَقَالَ مَا جَاءَنَا النَّبِيُّ صلى الله عليه وسلم فِي هَذِهِ السَّاعَةِ، إِلاَّ لأَمْرٍ حَدَثَ، فَلَمَّا دَخَلَ عَلَيْهِ قَالَ لأَبِي بَكْرٍ ‏\"‏ أَخْرِجْ مَنْ عِنْدَكَ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ إِنَّمَا هُمَا ابْنَتَاىَ‏.‏ يَعْنِي عَائِشَةَ وَأَسْمَاءَ‏.‏ قَالَ ‏\"‏ أَشَعَرْتَ أَنَّهُ قَدْ أُذِنَ لِي فِي الْخُرُوجِ ‏\"‏‏.‏ قَالَ الصُّحْبَةَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ الصُّحْبَةَ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ إِنَّ عِنْدِي نَاقَتَيْنِ أَعْدَدْتُهُمَا لِلْخُرُوجِ، فَخُذْ إِحْدَاهُمَا‏.‏ قَالَ ‏\"‏ قَدْ أَخَذْتُهَا بِالثَّمَنِ ‏\"‏‏.‏",
                "headingArabic": "إِذَا اشْتَرَى مَتَاعًا أَوْ دَابَّةً فَوَضَعَهُ عِنْدَ الْبَائِع، أَوْ مَاتَ قَبْلَ أَنْ يُقْبَضَ",
                "headingUrdu": "اگر کوئی شخص کچھ مال یا جانور خرید کر بیچنے والے کے پاس دے دے یا اسے اپنے قبضے میں لینے سے پہلے ہی مر جائے",
                "headingEnglish": "If somebody buys some goods or (an) animal and let it with the seller, or it dies before he takes it into his possession",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2055,
                "hadithNumber": "2139",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Do not urge somebody to return what he has already bought (i.e. in optional sale) from another seller so as to sell him your own goods.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، کوئی شخص اپنے بھائی کی خریدوفروخت میں دخل اندازی نہ کرے ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے نافع نے ، اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَبِيعُ بَعْضُكُمْ عَلَى بَيْعِ أَخِيهِ ‏\"‏‏.‏",
                "headingArabic": "لاَ يَبِيعُ عَلَى بَيْعِ أَخِيهِ وَلاَ يَسُومُ عَلَى سَوْمِ أَخِيهِ، حَتَّى يَأْذَنَ لَهُ أَوْ يَتْرُكَ",
                "headingUrdu": "پہلے سے طے شدہ سودے کو منسوخ نہ کرنا",
                "headingEnglish": "Not to cancel a bargain already agreed upon",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2056,
                "hadithNumber": "2140",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) forbade the selling of things by a town dweller on behalf of a desert dweller; and similarly Najsh was forbidden. And one should not urge somebody to return the goods to the seller so as to sell him his own goods; nor should one demand the hand of a girl who has already been engaged to someone else; and a woman should not try to cause some other woman to be divorced in order to take her place.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا کہ کوئی شہری کسی دیہاتی کا مال و اسباب بیچے اور یہ کہ کوئی ( سامان خریدنے کی نیت کے بغیر دوسرے اصل خریداروں سے ) بڑھ کر بولی نہ دے ۔ اسی طرح کوئی شخص اپنے بھائی کے سودے میں مداخلت نہ کرے ۔ کوئی شخص ( کسی عورت کو ) دوسرے کے پیغام نکاح ہوتے ہوئے اپنا پیغام نہ بھیجے ۔ اور کوئی عورت اپنی کسی دینی بہن کو اس نیت سے طلاق نہ دلوائے کہ اس کے حصہ کو خود حاصل کر لے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا کہ ہم سے سفیان نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے سعید بن مسیب نے بیان کیا ، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ، وَلاَ تَنَاجَشُوا، وَلاَ يَبِيعُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلاَ يَخْطُبُ عَلَى خِطْبَةِ أَخِيهِ، وَلاَ تَسْأَلُ الْمَرْأَةُ طَلاَقَ أُخْتِهَا لِتَكْفَأَ مَا فِي إِنَائِهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2057,
                "hadithNumber": "2141",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "A man decided that a slave of his would be manumitted after his death and later on he was in need of money, so the Prophet (ﷺ) took the slave and said, \"Who will buy this slave from me?\" Nu'aim bin `Abdullah رضی اللہ عنہ bought him for such and such price and the Prophet (ﷺ) gave him the slave.",
                "hadithUrdu": "ایک شخص نے اپنا ایک غلام اپنے مرنے کے بعد کی شرط کے ساتھ آزاد کیا ۔ لیکن اتفاق سے وہ شخص مفلس ہو گیا ، تو نبی کریم صلی اللہ علیہ وسلم نے اس کے غلام کو لے کر فرمایا کہ اسے مجھ سے کون خریدے گا ۔ اس پر نعیم بن عبداللہ رضی اللہ عنہ نے اسے اتنی اتنی قیمت پر خرید لیا اور آپ صلی اللہ علیہ وسلم نے غلام ان کے حوالہ کر دیا ۔",
                "urduNarrator": "ہم سے بشیر بن محمد نے بیان کیا ، کہا کہ ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں حسین مکتب نے خبر دی ، انہیں عطاء بن ابی رباح نے اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا الْحُسَيْنُ الْمُكْتِبُ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ رَجُلاً أَعْتَقَ غُلاَمًا لَهُ عَنْ دُبُرٍ، فَاحْتَاجَ فَأَخَذَهُ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ مَنْ يَشْتَرِيهِ مِنِّي ‏\"‏ فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللَّهِ بِكَذَا وَكَذَا، فَدَفَعَهُ إِلَيْهِ‏.‏",
                "headingArabic": "بَيْعِ الْمُزَايَدَةِ",
                "headingUrdu": "نیلامی کے ذریعے فروخت",
                "headingEnglish": "Selling by auction",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2058,
                "hadithNumber": "2142",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) forbade Najsh.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے «نجش» ( فریب ، دھوکہ ) سے منع فرمایا تھا ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، کہا کہ ہم سے امام مالک نے بیان کیا ، ان سے نافع نے ، اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ النَّجْشِ‏.‏",
                "headingArabic": "النَّجْشِ",
                "headingUrdu": "این نیش",
                "headingEnglish": "An-Naish",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2059,
                "hadithNumber": "2143",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) forbade the sale called 'Habal-al-Habala which was a kind of sale practiced in the Pre- Islamic Period of ignorance. One would pay the price of a she-camel which was not born yet would be born by the immediate offspring of an extant she-camel.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے حمل کے حمل کی بیع سے منع فرمایا ۔ اس بیع کا طریقہ جاہلیت میں رائج تھا ۔ ایک شخص ایک اونٹ یا اونٹنی خریدتا اور قیمت دینے کی میعاد یہ مقرر کرتا کہ ایک اونٹنی جنے پھر اس کے پیٹ کی اونٹنی بڑی ہو کر جنے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہیں امام مالک نے خبر دی ، انہیں نافع نے ، اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ، وَكَانَ بَيْعًا يَتَبَايَعُهُ أَهْلُ الْجَاهِلِيَّةِ، كَانَ الرَّجُلُ يَبْتَاعُ الْجَزُورَ إِلَى أَنْ تُنْتَجَ النَّاقَةُ، ثُمَّ تُنْتَجُ الَّتِي فِي بَطْنِهَا‏.‏",
                "headingArabic": "بَيْعِ الْغَرَرِ وَحَبَلِ الْحَبَلَةِ",
                "headingUrdu": "الضرار اور حبال الحبالہ",
                "headingEnglish": "Al-Gharar and Habal-il-Habala",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2060,
                "hadithNumber": "2144",
                "englishNarrator": "Narrated Abu Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) forbade the selling by Munabadha, i.e. to sell one's garment by casting it to the buyer not allowing him to examine or see it. Similarly he forbade the selling by Mulamasa. Mulamasa is to buy a garment, for example, by merely touching it, not looking at it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے منابذہ کی بیع سے منع فرمایا تھا ۔ اس کا طریقہ یہ تھا کہ ایک آدمی بیچنے کے لیے اپنا کپڑا دوسرے شخص کی طرف ( جو خریدار ہوتا ) پھینکتا اور اس سے پہلے کہ وہ اسے الٹے پلٹے یا اس کی طرف دیکھے ( صرف پھینک دینے کی وجہ سے وہ بیع لازم سمجھی جاتی تھی ) اسی طرح آنحضرت صلی اللہ علیہ وسلم نے بیع ملامسۃ سے بھی منع فرمایا ۔ اس کا یہ طریقہ تھا کہ ( خریدنے والا ) کپڑے کو بغیر دیکھے صرف اسے چھو دیتا ( اور اسی سے بیع لازم ہو جاتی تھی اسے بھی دھوکہ کی بیع قرار دیا گیا ۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ مجھ سے لیث بن سعد نے بیان کیا ، کہا کہ مجھ سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، کہ مجھے عامر بن سعید نے خبر دی ، اور انہیں ابو سعید خدری رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدٍ، أَنَّ أَبَا سَعِيدٍ ـ رضى الله عنه ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُنَابَذَةِ، وَهْىَ طَرْحُ الرَّجُلِ ثَوْبَهُ بِالْبَيْعِ إِلَى الرَّجُلِ، قَبْلَ أَنْ يُقَلِّبَهُ، أَوْ يَنْظُرَ إِلَيْهِ، وَنَهَى عَنِ الْمُلاَمَسَةِ، وَالْمُلاَمَسَةُ لَمْسُ الثَّوْبِ لاَ يَنْظُرُ إِلَيْهِ‏.‏",
                "headingArabic": "بَيْعِ الْمُلاَمَسَةِ",
                "headingUrdu": "الماس یا ملامسہ",
                "headingEnglish": "Al-Limas or Mulamasa",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2061,
                "hadithNumber": "2145",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) forbade two kinds of dressing; (one of them) is to sit with one's legs drawn up while wrapped in one garment. (The other) is to lift that garment on one's shoulders. And also forbade two kinds of sale: Al-Limais and An-Nibadh.",
                "hadithUrdu": "دو طرح کے لباس پہننے منع ہیں ۔ کہ کوئی آدمی ایک ہی کپڑے میں گوٹ مار کر بیٹھے ، پھر اسے مونڈے پر اٹھا کر ڈال لے ( اور شرمگاہ کھلی رہے ) اور دو طرح کی بیع سے منع کیا ایک بیع ملامسۃ سے اور دوسری بیع منابذہ سے ۔",
                "urduNarrator": "ہم سے قتبیہ نے بیان کیا ، کہا کہ ہم سے عبدالوہاب نے بیان کیا ، ان سے محمد بن سیرین نے ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نُهِيَ عَنْ لِبْسَتَيْنِ، أَنْ يَحْتَبِيَ الرَّجُلُ، فِي الثَّوْبِ الْوَاحِدِ، ثُمَّ يَرْفَعَهُ عَلَى مَنْكِبِهِ، وَعَنْ بَيْعَتَيْنِ اللِّمَاسِ وَالنِّبَاذِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2062,
                "hadithNumber": "2146",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) forbade selling by Mulamasa and Munabadha.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بیع ملامسۃ اور بیع منابذہ سے منع فرمایا ۔",
                "urduNarrator": "ہم سے اسماعیل بن اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے محمد بن یحییٰ بن حبان نے اور ابوالزناد نے ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، وَعَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ‏.‏",
                "headingArabic": "بَيْعِ الْمُنَابَذَةِ",
                "headingUrdu": "منابدھا",
                "headingEnglish": "Munabadha",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2063,
                "hadithNumber": "2147",
                "englishNarrator": "Narrated Abu Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) forbade two kinds of dresses and two kinds of sale, i.e., Mulamasa and Munabadha.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے دو طرح کے لباس سے منع فرمایا ، اور دو طرح کی بیع ، بیع ملامسۃ اور بیع منابذہ سے منع فرمایا ۔",
                "urduNarrator": "ہم سے عیاش بن ولید نے بیان کیا ، ان سے عبدالاعلیٰ نے بیان کیا ، ان سے معمر نے بیان کیا ، ان سے زہری نے ، ان سے عطاء بن یزید نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ لِبْسَتَيْنِ وَعَنْ بَيْعَتَيْنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2064,
                "hadithNumber": "2148",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Don't keep camels and sheep unmilked for a long time, for whoever buys such an animal has the option to milk it and then either to keep it or return it to the owner along with one Sa of dates.\" Moreover, Abu Sualih and Mujahid and Walid bin Rabah and Musa bin Yassar from Hadrat Huraira رضی اللہ عنہ and he reported from prophet (ﷺ): Some narrated from Ibn Seereen (that the Prophet (ﷺ) had said), \"One Sa of wheat, and he has the option for three days.\" And some narrated from Ibn Seereen, \" ... a Sa of dates,\" not mentioning the option for three days. But a Sa of dates is mentioned in most narrations.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( بیچنے کے لیے ) اونٹنی اور بکری کے تھنوں میں دودھ کو روک کر نہ رکھو ۔ اگر کسی نے ( دھوکہ میں آ کر ) کوئی ایسا جانور خرید لیا تو اسے دودھ دوہنے کے بعد دونوں اختیارات ہیں چاہے تو جانور کو رکھ لے ، اور چاہے تو واپس کر دے ۔ اور ایک صاع کھجور اس کے ساتھ دودھ کے بدل دیدے ۔ ابوصالح ، مجاہد ، ولید بن رباح اور موسیٰ بن یسار سے بواسطہ ابوہریرہ رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم سے روایت ایک صاع کھجور ہی کی ہے ۔ بعض راویوں نے ابن سیرین سے ایک صاع کھجور کی روایت کی ہے اور یہ کہ خریدار کو ( صورت مذکورہ میں ) تین دن کا اختیار ہو گا ۔ اگرچہ بعض دوسرے راویوں نے ابن سیرین ہی سے ایک صاع کھجور کی بھی روایت کی ہے ، لیکن تین دن کے اختیار کا ذکر نہیں کیا اور ( تاوان میں ) کھجور دینے کی روایات ہی زیادہ ہیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث بن سعد نے بیان کیا ، ان سے جعفر بن ربیعہ نے ، ان سے عبدالرحمٰن بن ہرمز اعرج نے ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنِ الأَعْرَجِ، قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ لاَ تُصَرُّوا الإِبِلَ وَالْغَنَمَ، فَمَنِ ابْتَاعَهَا بَعْدُ فَإِنَّهُ بِخَيْرِ النَّظَرَيْنِ بَعْدَ أَنْ يَحْتَلِبَهَا إِنْ شَاءَ أَمْسَكَ، وَإِنْ شَاءَ رَدَّهَا وَصَاعَ تَمْرٍ ‏\"‏‏.‏ وَيُذْكَرُ عَنْ أَبِي صَالِحٍ وَمُجَاهِدٍ وَالْوَلِيدِ بْنِ رَبَاحٍ وَمُوسَى بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ صَاعَ تَمْرٍ ‏\"‏‏.‏ وَقَالَ بَعْضُهُمْ عَنِ ابْنِ سِيرِينَ صَاعًا مِنْ طَعَامٍ وَهْوَ بِالْخِيَارِ ثَلاَثًا‏.‏ وَقَالَ بَعْضُهُمْ عَنِ ابْنِ سِيرِينَ صَاعًا مِنْ تَمْرٍ‏.‏ وَلَمْ يَذْكُرْ ثَلاَثًا، وَالتَّمْرُ أَكْثَرُ‏.‏",
                "headingArabic": "النَّهْىِ لِلْبَائِعِ أَنْ لاَ يُحَفِّلَ الإِبِلَ وَالْبَقَرَ وَالْغَنَمَ وَكُلَّ مُحَفَّلَة",
                "headingUrdu": "بیچنے والے کو اجازت نہیں ہے کہ وہ زیادہ دیر تک بغیر دودھ کے جانور رکھے",
                "headingEnglish": "The seller is not allowed to keep animal unmilked for a long time",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2065,
                "hadithNumber": "2149",
                "englishNarrator": "Narrated `Abdullah bin Mas`ud رضی اللہ عنہ :",
                "hadithEnglish": "Whoever buys a sheep which has not been milked for a long time, has the option of returning it along with one Sa of dates; and the Prophet (ﷺ) forbade going to meet the seller on the way (as he has no knowledge of the market price and he may sell his goods at a low price).",
                "hadithUrdu": "جو شخص «مصراة» بکری خریدے اور اسے واپس کرنا چاہے تو ( اصل مالک کو ) اس کے ساتھ ایک صاع بھی دے ۔ اور نبی کریم صلی اللہ علیہ وسلم نے قافلہ والوں سے ( جو مال بیچنے لائیں ) آگے بڑھ کر خریدنے سے منع فرمایا ہے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے معمتر نے بیان کیا ، کہا کہ میں نے اپنے باپ سے سنا ، وہ کہتے تھے کہ ہم سے ابوعثمان نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي يَقُولُ، حَدَّثَنَا أَبُو عُثْمَانَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ مَنِ اشْتَرَى شَاةً مُحَفَّلَةً، فَرَدَّهَا فَلْيَرُدَّ مَعَهَا صَاعًا‏.‏ وَنَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ تُلَقَّى الْبُيُوعُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2066,
                "hadithNumber": "2150",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Do not go forward to meet the caravan (to buy from it on the way before it reaches the town). And do not urge buyers to cancel their purchases to sell them (your own goods) yourselves, and do not practice Najsh. A town dweller should not sell the goods for the desert dweller. Do not leave sheep unmilked for a long time, when they are on sale, and whoever buys such an animal has the option of returning it, after milking it, along with a Sa of dates or keeping it. it has been kept unmilked for a long period by the seller (to deceive others).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ( تجارتی ) قافلوں کی پیشوائی ( ان کا سامان شہر پہنچے سے پہلے ہی خرید لینے کی غرض سے ) نہ کرو ۔ ایک شخص کسی دوسرے کی بیع پر بیع نہ کرے اور کوئی «نجش» (دھوکہ فریب ) نہ کرے اور کوئی شہری ، بدوی کا مال نہ بیچے اور بکری کے تھن میں دودھ نہ روکے ۔ لیکن اگر کوئی اس ( آخری ) صورت میں جانور خرید لے تو اسے دوہنے کے بعد دونوں طرح کے اختیارات ہیں ۔ اگر وہ اس بیع پر راضی ہے تو جانور کو روک سکتا ہے اور اگر وہ راضی نہیں تو ایک صاع کھجور اس کے ساتھ دے کر اسے واپس کر دے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ابوالزناد نے ، انہیں اعرج نے ، اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَلَقَّوُا الرُّكْبَانَ، وَلاَ يَبِيعُ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَلاَ تَنَاجَشُوا وَلاَ يَبِيعُ حَاضِرٌ لِبَادٍ، وَلاَ تُصَرُّوا الْغَنَمَ، وَمَنِ ابْتَاعَهَا فَهْوَ بِخَيْرِ النَّظَرَيْنِ بَعْدَ أَنْ يَحْتَلِبَهَا إِنْ رَضِيَهَا أَمْسَكَهَا، وَإِنْ سَخِطَهَا رَدَّهَا وَصَاعًا مِنْ تَمْرٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2067,
                "hadithNumber": "2151",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Whoever buys a sheep which has been kept unmilked for a long period, and milks it, can keep it if he is satisfied, and if he is not satisfied, he can return it, but he should pay one Sa of dates for the milk.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس شخص نے «مصراة» بکری خریدی اور اسے دوہا ۔ تو اگر وہ اس معاملہ پر راضی ہے تو اسے اپنے لیے روک لے اور اگر راضی نہیں ہے تو ( واپس کر دے اور ) اس کے دودھ کے بدلے میں ایک صاع کھجور دیدے ۔",
                "urduNarrator": "ہم سے محمد بن عمرو نے بیان کیا ، کہا کہ ہم سے مکی بن ابراہیم نے بیان کیا ، انہیں ابن جریج نے خبر دی ، کہا کہ مجھے زیادنے خبر دی کہ عبدالرحمٰن بن زید کے غلام ثابت نے انہیں خبر دی ، کہ انہوں نے ابوہریرہ رضی اللہ عنہ کو یہ کہتے سنا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، حَدَّثَنَا الْمَكِّيُّ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي زِيَادٌ، أَنَّ ثَابِتًا، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنِ اشْتَرَى غَنَمًا مُصَرَّاةً فَاحْتَلَبَهَا، فَإِنْ رَضِيَهَا أَمْسَكَهَا، وَإِنْ سَخِطَهَا فَفِي حَلْبَتِهَا صَاعٌ مِنْ تَمْرٍ ‏\"‏‏.‏",
                "headingArabic": "إِنْ شَاءَ رَدَّ الْمُصَرَّاةَ وَفِي حَلْبَتِهَا صَاعٌ مِنْ تَمْرٍ",
                "headingUrdu": "جانور کو دودھ دینے کے بعد واپس کرنا",
                "headingEnglish": "Returning an animal after milking it",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2068,
                "hadithNumber": "2152",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If a slave-girl commits illegal sexual intercourse and it is proved beyond doubt, then her owner should lash her and should not blame her after the legal punishment. And then if she repeats the illegal sexual intercourse he should lash her again and should not blame her after the legal punishment, and if she commits it a third time, then he should sell her even for a hair rope.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب کوئی باندی زنا کرے اور اس کے زنا کا ثبوت ( شرعی ) مل جائے تو اسے کوڑے لگوائے ، پھر اس کی لعنت ملامت نہ کرے ۔ اس کے بعد اگر پھر وہ زنا کرے تو پھر کوڑے لگوائے مگر پھر لعنت ملامت نہ کرے ۔ پھر اگر تیسری مرتبہ بھی زنا کرے تو اسے بیچ دے چاہے بال کی ایک رسی کے بدلہ ہی میں کیوں نہ ہو ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، کہا کہ مجھے سعید مقبری نے خبر دی ، ان سے ان کے باپ نے ، اور انہوں نے ابوہریرہ رضی اللہ عنہ کو یہ کہتے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ سَمِعَهُ يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِذَا زَنَتِ الأَمَةُ فَتَبَيَّنَ زِنَاهَا فَلْيَجْلِدْهَا، وَلاَ يُثَرِّبْ، ثُمَّ إِنْ زَنَتْ فَلْيَجْلِدْهَا، وَلاَ يُثَرِّبْ، ثُمَّ إِنْ زَنَتِ الثَّالِثَةَ فَلْيَبِعْهَا، وَلَوْ بِحَبْلٍ مِنْ شَعَرٍ ‏\"‏‏.‏",
                "headingArabic": "بَيْعِ الْعَبْدِ الزَّانِي‏",
                "headingUrdu": "زانی غلام کو بیچنا",
                "headingEnglish": "The selling of an adulterer slave",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2069,
                "hadithNumber": "2153, 2154",
                "englishNarrator": "Narrated Abu Huraira and Zaid bin Khalid رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) was asked about the slave-girl, if she was a virgin and committed illegal sexual intercourse. The Prophet (ﷺ) said, \"If she committed illegal sexual intercourse, lash her, and if she did it a second time, then lash her again, and if she repeated the third time, then sell her even for a hair rope.\" Ibn Shihab said, \"I don't know whether to sell her after the third or fourth offense.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم سے پوچھا گیا کہ اگر کوئی غیر شادی شدہ باندی زنا کرے ( تو اس کا کیا حکم ہے ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے کوڑے لگاؤ ۔ اگر پھر زنا کرے تو پھر کوڑے لگاؤ ۔ پھر بھی اگر زنا کرے تو اسے بیچ دو ، اگرچہ ایک رسی ہی کے بدلے میں وہ فروخت ہو ۔ ابن شہاب نے کہا کہ مجھے یہ معلوم نہیں کہ ( بیچنے کے لیے ) آپ صلی اللہ علیہ وسلم نے تیسری مرتبہ فرمایا تھا یا چوتھی مرتبہ ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عبیداللہ بن عبداللہ نے اور ان سے ابوہریرہ رضی اللہ عنہ اور زید بن خالد رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنِ الأَمَةِ إِذَا زَنَتْ وَلَمْ تُحْصِنْ قَالَ ‏ \"‏ إِنْ زَنَتْ فَاجْلِدُوهَا، ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا، ثُمَّ إِنْ زَنَتْ فَبِيعُوهَا وَلَوْ بِضَفِيرٍ ‏\"‏‏.‏ قَالَ ابْنُ شِهَابٍ لاَ أَدْرِي بَعْدَ الثَّالِثَةِ، أَوِ الرَّابِعَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2070,
                "hadithNumber": "2155",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) came to me and I told him about the slave-girl (Buraira رضی اللہ عنہا) Allah's Messenger (ﷺ) said, \"Buy and manumit her, for the Wala is for the one who manumits.\" In the evening the Prophet (ﷺ) got up and glorified Allah as He deserved and then said, \"Why do some people impose conditions which are not present in Allah's Book (Laws)? Whoever imposes such a condition as is not in Allah's Laws, then that condition is invalid even if he imposes one hundred conditions, for Allah's conditions are more binding and reliable.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ صلی اللہ علیہ وسلم سے ( بریرہ رضی اللہ عنہا کے خریدنے کا ) ذکر کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا تم خرید کر آزاد کر دو ۔ ولاء تو اسی کی ہوتی ہے جو آزاد کرے ۔ پھر آپ صلی اللہ علیہ وسلم منبر پر تشریف لائے اور فرمایا ” لوگوں کو کیا ہو گیا ہے کہ ( خریدوفروخت میں ) ایسی شرطیں لگاتے ہیں جن کی کوئی اصل کتاب اللہ میں نہیں ہے جو شخص بھی کوئی ایسی شرط لگائے گا جس کی اصل کتاب اللہ میں نہ ہو وہ شرط باطل ہو گی ۔ خواہ سو شرطیں ہی کیوں نہ لگا لے کیونکہ اللہ ہی کی شرط حق اور مضبوط ہے ( اور اسی کا اعتبار ہے ) ۔ “",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہمیں شعیب نے خبر دی ، انہیں زہری نے ، ان سے عروہ بن زبیر رضی اللہ عنہ نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ عُرْوَةُ بْنُ الزُّبَيْرِ قَالَتْ عَائِشَةُ ـ رضى الله عنها دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَذَكَرْتُ لَهُ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اشْتَرِي وَأَعْتِقِي، فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ ثُمَّ قَامَ النَّبِيُّ صلى الله عليه وسلم مِنَ الْعَشِيِّ، فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ، ثُمَّ قَالَ ‏\"‏ مَا بَالُ أُنَاسٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَ فِي كِتَابِ اللَّهِ، مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَهْوَ بَاطِلٌ، وَإِنِ اشْتَرَطَ مِائَةَ شَرْطٍ، شَرْطُ اللَّهِ أَحَقُّ وَأَوْثَقُ ‏\"‏‏.‏",
                "headingArabic": "الْبَيْعِ وَالشِّرَاءِ مَعَ النِّسَاءِ",
                "headingUrdu": "خرید و فروخت میں عورتوں کے ساتھ معاملہ کرنا",
                "headingEnglish": "Dealing with women in selling and buying",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2071,
                "hadithNumber": "2156",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Aisha رضی اللہ عنہا wanted to buy Buraira رضی اللہ عنہا and he (the Prophet (ﷺ) ) went out for the prayer. When he returned, she told him that they (her masters) refused to sell her except on the condition that her Wala' would go to them. The Prophet (ﷺ) replied, 'The Wala' would go to him who manumits.' \" Hammam asked Nafi` whether her (Buraira's) husband was a free man or a slave. He replied that he did not know.",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا ، بریرہ رضی اللہ عنہا کی ( جو باندی تھیں ) قیمیت لگا رہی تھیں ( تاکہ انہیں خرید کر آزاد کر دیں ) کہ نبی کریم صلی اللہ علیہ وسلم نماز کے لیے ( مسجد میں ) تشریف لے گئے ۔ پھر جب آپ صلی اللہ علیہ وسلم تشریف لائے تو عائشہ رضی اللہ عنہا نے کہا کہ ( بریرہ رضی اللہ عنہا کے مالکوں نے تو ) اپنے لیے ولاء کی شرط کے بغیر انہیں بیچنے سے انکار کر دیا ہے ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ولاء تو اسی کی ہوتی ہے جو آزاد کرے ۔ میں نے نافع سے پوچھا کہ بریرہ رضی اللہ عنہا کے شوہر آزاد تھے یا غلام ، تو انہوں نے فرمایا کہ مجھے معلوم نہیں ۔",
                "urduNarrator": "ہم سے حسان بن ابی عباد نے بیان کیا ، کہا کہ ہم سے ہمام نے بیان کیا ، کہا کہ میں نے نافع سے سنا ، وہ عبداللہ بن عمر رضی اللہ عنہما سے روایت کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا حَسَّانُ بْنُ أَبِي عَبَّادٍ، حَدَّثَنَا هَمَّامٌ، قَالَ سَمِعْتُ نَافِعًا، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما أَنَّ عَائِشَةَ ـ رضى الله عنها ـ سَاوَمَتْ بَرِيرَةَ فَخَرَجَ إِلَى الصَّلاَةِ، فَلَمَّا جَاءَ قَالَتْ إِنَّهُمْ أَبَوْا أَنْ يَبِيعُوهَا، إِلاَّ أَنْ يَشْتَرِطُوا الْوَلاَءَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ قُلْتُ لِنَافِعٍ حُرًّا كَانَ زَوْجُهَا أَوْ عَبْدًا فَقَالَ مَا يُدْرِينِي",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2072,
                "hadithNumber": "2157",
                "englishNarrator": "Narrated Jarir رضی اللہ عنہ :",
                "hadithEnglish": "I have given a pledge of allegiance to Allah's Messenger (ﷺ) for to testify that None has the right to be worshipped but Allah, and Muhammad is His Apostle, to offer prayers perfectly, to pay Zakat, to listen to and obey (Allah's and His Prophet's orders), and to give good advice to every Muslim.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس بات کی شہادت پر کہ اللہ کے سوا کوئی معبود نہیں اور محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں ۔ اور نماز قائم کرنے اور زکوٰۃ دینے اور ( اپنے مقررہ امیر کی بات ) سننے اور اس کی اطاعت کرنے پر اور ہر مسلمان کے ساتھ خیر خواہی کرنے کی بیعت کی تھی ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، ان سے سفیان نے ، ان سے اسماعیل نے ، ان سے قیس نے ، انہوں نے جریر رضی اللہ عنہ سے یہ سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، سَمِعْتُ جَرِيرًا ـ رضى الله عنه ـ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلاَةِ، وَإِيتَاءِ الزَّكَاةِ، وَالسَّمْعِ وَالطَّاعَةِ، وَالنُّصْحِ لِكُلِّ مُسْلِمٍ‏.‏",
                "headingArabic": "هَلْ يَبِيعُ حَاضِرٌ لِبَادٍ بِغَيْرِ أَجْرٍ وَهَلْ يُعِينُهُ أَوْ يَنْصَحُهُ",
                "headingUrdu": "کیا بستی کے کسی شخص کے لیے صحرائی کا سامان بیچنا جائز ہے؟",
                "headingEnglish": "Is it permissible for a person from the town to sell the goods of a desert dweller",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2073,
                "hadithNumber": "2158",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) said, 'Do not go to meet the caravans on the way (for buying their goods without letting them know the market price); a town dweller should not sell the goods of a desert dweller on behalf of the latter.' I asked Ibn `Abbas, 'What does he mean by not selling the goods of a desert dweller by a town dweller?' He said, 'He should not become his broker.' \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( تجارتی ) قافلوں سے آگے جا کر نہ ملا کرو ( ان کو منڈی میں آنے دو ) اور کوئی شہری ، کسی دیہاتی کا سامان نہ بیچے ، انہوں نے بیان کیا کہ اس پر میں نے ابن عباس رضی اللہ عنہما سے پوچھا کہ حضور اکرم صلی اللہ علیہ وسلم کے اس ارشاد کا کہ ” کوئی شہری کسی دیہاتی کا مال نہ بیچے “ کا مطلب کیا ہے ؟ تو انہوں نے فرمایا کہ مطلب یہ ہے کہ اس کا دلال نہ بنے ۔",
                "urduNarrator": "ہم سے صلت بن محمد نے بیان کیا ، کہا کہ ہم سے عبدالواحد نے بیان کیا ، کہا کہ ہم سے معمر نے بیان کیا ، ان سے عبداللہ بن طاؤس نے ، ان سے ان کے باپ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا مَعْمَرٌ، عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَلَقَّوُا الرُّكْبَانَ وَلاَ يَبِيعُ حَاضِرٌ لِبَادٍ ‏\"‏‏.‏ قَالَ فَقُلْتُ لاِبْنِ عَبَّاسٍ مَا قَوْلُهُ لاَ يَبِيعُ حَاضِرٌ لِبَادٍ قَالَ لاَ يَكُونُ لَهُ سِمْسَارًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2074,
                "hadithNumber": "2159",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) forbade the selling of the goods of a desert dweller by a town person. And the same in the saying of Hadrat Ibn-e- Abbas رضی اللہ عنہما .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اس سے منع فرمایا کہ کوئی شہری ، کسی دیہاتی کا مال بیچے ۔ یہی ابن عباس رضی اللہ عنہما نے بھی کہا ہے ۔",
                "urduNarrator": "مجھ سے عبداللہ بن صباح نے بیان کیا ، کہا کہ ہم سے ابوعلی حنفی نے بیان کیا ، ان سے عبدالرحمٰن بن عبداللہ بن دینار نے بیان کیا ، کہا کہ مجھ سے میرے والد نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ صَبَّاحٍ، حَدَّثَنَا أَبُو عَلِيٍّ الْحَنَفِيُّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ دِينَارٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ‏.‏ وَبِهِ قَالَ ابْنُ عَبَّاسٍ‏.‏",
                "headingArabic": "مَنْ كَرِهَ أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ بِأَجْرٍ",
                "headingUrdu": "جس کو یہ نفرت ہو کہ کوئی شہری صحرائی باشندے کا مال بیچ کر اس سے قیمت وصول کرے۔",
                "headingEnglish": "Whoever hated that an urban person should sell the goods of a desert dweller and charge him for that",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2075,
                "hadithNumber": "2160",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"A buyer should not urge a seller to restore a purchase so as to buy it himself, and do not practice Najsh; and a town dweller should not sell goods of a desert dweller.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، کوئی شخص اپنے کسی بھائی کے مول پر مول نہ کرے اور کوئی «نجش» (دھوکہ ، فریب ) نہ کرے ، اور نہ کوئی شہری ، کسی دیہاتی کے لیے بیچے یا مول لے ۔",
                "urduNarrator": "ہم سے مکی بن ابراہیم نے بیان کیا ، کہا کہ مجھے ابن جریج نے خبر دی ، انہیں ابن شہاب نے ، انہیں سعید بن مسیب نے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَبْتَاعُ الْمَرْءُ عَلَى بَيْعِ أَخِيهِ، وَلاَ تَنَاجَشُوا، وَلاَ يَبِعْ حَاضِرٌ لِبَادٍ ‏\"‏",
                "headingArabic": "لاَ يَبِيعُ حَاضِرٌ لِبَادٍ بِالسَّمْسَرَةِ",
                "headingUrdu": "ایک شہر کے باشندے کو کسی صحرائی باشندے کے لیے سامان نہیں خریدنا چاہیے اور بروکر کے طور پر کمیشن لینا چاہیے۔",
                "headingEnglish": "A town dweller should not buy goods for a desert dweller and charge commission as a broker",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2076,
                "hadithNumber": "2161",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "We were forbidden that a town dweller should sell goods of a desert dweller.",
                "hadithUrdu": "ہمیں اس سے روکا گیا کہ کوئی شہری کسی دیہاتی کا مال تجارت بیچے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ ہم سے معاذ بن معاذ نے بیان کیا ، ان سے عبداللہ بن عون نے بیان کیا ، ان سے محمد بن سیرین نے کہ انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذٌ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، قَالَ أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ نُهِينَا أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 2051,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=82",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=80",
                "label": "80",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=81",
                "label": "81",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=82",
                "label": "82",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=83",
                "label": "83",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=84",
                "label": "84",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=85",
                "label": "85",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=86",
                "label": "86",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=84",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=84",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=82",
        "to": 2075,
        "total": 40465
    }
}