{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 226,
        "data": [
            {
                "id": 5628,
                "hadithNumber": "5878",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When Abu Bakr رضی اللہ عنہ became the Caliph, he wrote a letter to him (and stamped it with the Prophet's ring) and the engraving of the ring was in three lines: Muhammad in one line, 'Apostle' in another line, and 'Allah' in a third line.",
                "hadithUrdu": "حضرت ابوبکر رضی اللہ عنہ جب خلیفہ ہوئے تو انہوں نے مجھ کو زکوٰۃ کے مسائل لکھوا دیئے اور انگوٹھی ( مہر ) کا نقش تین سطروں میں تھا ایک سطر میں ” محمد “ دوسری سطر میں ” رسول “ اور تیسری سطر میں ” اللہ “ ۔",
                "urduNarrator": "مجھ سے عبداللہ انصاری نے بیان کیا ، کہا کہ مجھ سے میرے والد عبداللہ بن مثنیٰ نے بیان کیا ، ان سے ثمامہ بن عبداللہ بن انس نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، قَالَ حَدَّثَنِي أَبِي، عَنْ ثُمَامَةَ، عَنْ أَنَسٍ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ لَمَّا اسْتُخْلِفَ كَتَبَ لَهُ، وَكَانَ نَقْشُ الْخَاتَمِ ثَلاَثَةَ أَسْطُرٍ‏.‏ مُحَمَّدٌ سَطْرٌ، وَرَسُولُ سَطْرٌ، وَاللَّهِ سَطْرٌ‏.‏",
                "headingArabic": "هَلْ يُجْعَلُ نَقْشُ الْخَاتَمِ ثَلاَثَةَ أَسْطُرٍ",
                "headingUrdu": "انگوٹھی کی کندہ کاری تین لائنوں میں کی گئی؟",
                "headingEnglish": "Allah's Messenger (ﷺ) took a silver ring and had 'Muhammad, the Apostle' of Allah' engraved on it. The Prophet then said (to us), 'I have a silver ring with 'Muhammad, the Messenger of Allah engraved on it, so none of you should have the same engraving on his ring.\"",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5629,
                "hadithNumber": "5879",
                "englishNarrator": "Anas added:",
                "hadithEnglish": "The ring of the Prophet (ﷺ) was in his hand, and after him, in Abu Bakr's hand, and then in `Umar's hand after Abu Bakr. When `Uthman was the Caliph, once he was sitting at the well of Aris. He removed the ring from his hand and while he was trifling with it, dropped into the well. We kept on going to the well with `Uthman for three days looking for the ring, and finally the well was drained, but the ring was not found.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی انگوٹھی وفات تک آپ کے ہاتھ میں رہی ۔ آپ کے بعد ابوبکر رضی اللہ عنہ کے ہاتھ میں اور ابوبکر رضی اللہ عنہ کے بعد عمر رضی اللہ عنہ کے ہاتھ میں رہی پھر جب عثمان رضی اللہ عنہ کی خلافت کا زمانہ آیا تو وہ اریس کے کنویں پر ایک مرتبہ بیٹھے ، بیان کیا کہ پھر انگوٹھی نکالی اور اسے الٹنے پلٹنے لگے کہ اتنے میں وہ ( کنویں میں ) گر گئی ۔ انس رضی اللہ عنہ نے بیان کیا کہ پھر عثمان رضی اللہ عنہ کے ساتھ ہم تین دن تک اسے ڈھونڈتے رہے اور کنویں کا سارا پانی بھی کھینچ ڈالا لیکن وہ انگوٹھی نہیں ملی ۔",
                "urduNarrator": "حضرت امام بخاری نے کہا کہ مجھ سے امام احمد بن حنبل نے اتنا اور روایت کیا ، کہا مجھ سے محمد بن عبداللہ انصاری نے ، کہا کہ مجھ سے میرے والد نے ، ان سے ثمامہ بن عبداللہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَزَادَنِي أَحْمَدُ حَدَّثَنَا الأَنْصَارِيُّ، قَالَ حَدَّثَنِي أَبِي، عَنْ ثُمَامَةَ، عَنْ أَنَسٍ، قَالَ كَانَ خَاتَمُ النَّبِيِّ صلى الله عليه وسلم فِي يَدِهِ، وَفِي يَدِ أَبِي بَكْرٍ بَعْدَهُ، وَفِي يَدِ عُمَرَ بَعْدَ أَبِي بَكْرٍ، فَلَمَّا كَانَ عُثْمَانُ جَلَسَ عَلَى بِئْرِ أَرِيسَ ـ قَالَ ـ فَأَخْرَجَ الْخَاتَمَ، فَجَعَلَ يَعْبَثُ بِهِ فَسَقَطَ قَالَ فَاخْتَلَفْنَا ثَلاَثَةَ أَيَّامٍ مَعَ عُثْمَانَ فَنَنْزَحُ الْبِئْرَ فَلَمْ نَجِدْهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5630,
                "hadithNumber": "5880",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "I offered the `Id prayer with the Prophet (ﷺ) and he offered prayer before the Khutba (sermon). Ibn Wahb added: After the prayer the Prophet (ﷺ) came towards (the rows of) the women and ordered them to give alms, and the women started putting their big and small rings in the garment of Bilal رضی اللہ عنہ.",
                "hadithUrdu": "میں عیدالفطر کی نماز میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ موجود تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے خطبہ سے پہلے نماز پڑھائی اور ابن وہب نے جریج سے یہ لفظ بڑھائے کہ پھر آنحضرت صلی اللہ علیہ وسلم عورتوں کے مجمع کی طرف گئے ( اور صدقہ کی ترغیب دلائی ) تو عورتیں حضرت بلال رضی اللہ عنہ کے کپڑے میں چھلے دار انگوٹھیاں ڈالنے لگیں ۔",
                "urduNarrator": "ہم سے ابو عاصم نبیل نے بیان کیا ، انہوں نے کہا ہم کوابن جریج نے خبر دی ، انہوں نے کہا ہم کو حسن بن مسلم نے خبر دی ، انہیں طاؤس نے اور انہیں حضرت ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنَا الْحَسَنُ بْنُ مُسْلِمٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ شَهِدْتُ الْعِيدَ مَعَ النَّبِيِّ صلى الله عليه وسلم فَصَلَّى قَبْلَ الْخُطْبَةِ‏.‏ وَزَادَ ابْنُ وَهْبٍ عَنِ ابْنِ جُرَيْجٍ فَأَتَى النِّسَاءَ فَجَعَلْنَ يُلْقِينَ الْفَتَخَ وَالْخَوَاتِيمَ فِي ثَوْبِ بِلاَلٍ‏.‏",
                "headingArabic": "الْخَاتَمِ لِلنِّسَاءِ",
                "headingUrdu": "خواتین کے لیے انگوٹھیاں",
                "headingEnglish": "Rings for women",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5631,
                "hadithNumber": "5881",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) came out on the day of `Id and offered a two-rak`at prayer, and he did not pray any rak`a before it, nor after it. Then he went towards the women and ordered them to give alms. The women started donating their earring and necklaces.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم عیدالفطر کے دن ( آبادی سے باہر ) گئے اور دو رکعت نماز پڑھائی آپ نے اس سے پہلے اور اس کے بعد کوئی دوسری نفل نمازنہیں پڑھی پھر آپ عورتوں کے مجمع کی طرف آئے اور انہیں صدقہ کا حکم فرمایا ۔ چنانچہ عورتیں اپنی بالیاں اور خوشبو اور مشک کے ہار صدقہ میں دینے لگیں ۔",
                "urduNarrator": "ہم سے محمد بن عرعرہ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عدی بن ثابت نے ، ان سے سعید بن جبیر نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ عِيدٍ فَصَلَّى رَكْعَتَيْنِ، لَمْ يُصَلِّ قَبْلُ وَلاَ بَعْدُ، ثُمَّ أَتَى النِّسَاءَ فَأَمَرَهُنَّ بِالصَّدَقَةِ، فَجَعَلَتِ الْمَرْأَةُ تَصَدَّقُ بِخُرْصِهَا وَسِخَابِهَا‏.‏",
                "headingArabic": "الْقَلاَئِدِ وَالسِّخَابِ لِلنِّسَاءِ",
                "headingUrdu": "عورتوں کا ہار اور سکھاب پہننا",
                "headingEnglish": "The wearing of necklaces and Sikhab by the women",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5632,
                "hadithNumber": "5882",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "A necklace belonging to Asma' رضی اللہ عنہا was lost, and the Prophet (ﷺ) sent men in its search. The time for the prayer became due and they were without ablution and they could not find water; therefore they prayed without ablution, They mentioned that to the Prophet (ﷺ) . Then Allah revealed the Verse of Tayammum. (`Aisha رضی اللہ عنہا added: that she had borrowed (the necklace) from Asma').",
                "hadithUrdu": "حضرت اسماء رضی اللہ عنہا کا ہار ( جو ام المؤمنین رضی اللہ عنہا نے عاریت پر لیا تھا ) گم ہو گیا تو آنحضرت صلی اللہ علیہ وسلم نے اسے تلاش کرنے کے لیے چند صحابہ کو بھیجا اسی دوران میں نماز کا وقت ہو گیا اور لوگ بلا وضو تھے چونکہ پانی بھی موجود نہیں تھا ، اس لئے سب نے بلا وضو نماز پڑھی پھر آنحضرت صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو تیمم کی آیت نازل ہوئی ۔ ابن نمیر نے یہ اضافہ کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ وہ ہار انہوں نے حضرت اسماء سے عاریتاً لیا تھا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، کہا ہم سے عبدہ بن سلیمان نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدَةُ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ هَلَكَتْ قِلاَدَةٌ لأَسْمَاءَ، فَبَعَثَ النَّبِيُّ صلى الله عليه وسلم فِي طَلَبِهَا رِجَالاً، فَحَضَرَتِ الصَّلاَةُ وَلَيْسُوا عَلَى وُضُوءٍ وَلَمْ يَجِدُوا مَاءً، فَصَلَّوْا وَهُمْ عَلَى غَيْرِ وُضُوءٍ، فَذَكَرُوا ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ آيَةَ التَّيَمُّمِ‏.‏ زَادَ ابْنُ نُمَيْرٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ اسْتَعَارَتْ مِنْ أَسْمَاءَ‏.‏",
                "headingArabic": "اسْتِعَارَةِ الْقَلاَئِدِ",
                "headingUrdu": "ہار ادھار لینا",
                "headingEnglish": "To borrow a necklace",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5633,
                "hadithNumber": "5883",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"The Prophet (ﷺ) offered a two-rak`at prayer on `Id day and he did not offer any (Nawafil prayer) before or after it. He then went towards the women, and Bilal رضی اللہ عنہ was accompanying him, and ordered them to give alms. And so the women started giving their earrings (etc .).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے عید کے دن دو رکعتیں پڑھا ئیں نہ اس کے پہلے کوئی نماز پڑھی اور نہ اس کے بعدپھر آپ عورتوں کی طرف تشریف لائے ، آپ کے ساتھ حضرت بلال رضی اللہ عنہ تھے ۔ آپ نے عورتوں کو صدقہ کا حکم فرمایا تو وہ اپنی بالیاں حضرت بلال رضی اللہ عنہ کی جھولی میں ڈالنے لگیں ۔",
                "urduNarrator": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے عدی بن ثابت نے خبر دی ، کہا کہ میں نے سعید بن جبیر سے سنا اور انہوں نے حضرت ابن عباس رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَدِيٌّ، قَالَ سَمِعْتُ سَعِيدًا، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى يَوْمَ الْعِيدِ رَكْعَتَيْنِ، لَمْ يُصَلِّ قَبْلَهَا وَلاَ بَعْدَهَا ثُمَّ أَتَى النِّسَاءَ وَمَعَهُ بِلاَلٌ فَأَمَرَهُنَّ بِالصَّدَقَةِ، فَجَعَلَتِ الْمَرْأَةُ تُلْقِي قُرْطَهَا‏.‏",
                "headingArabic": "الْقُرْطِ لِلنِّسَاءِ",
                "headingUrdu": "بالیاں",
                "headingEnglish": "Earrings",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5634,
                "hadithNumber": "5884",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I was with Allah's Messenger (ﷺ) in one of the Markets of Medina. He left (the market) and so did I. Then he asked thrice, \"Where is the small (child)?\" Then he said, \"Call Al-Hasan bin `Ali.\" So Al-Hasan bin `Ali رضی اللہ عنہما got up and started walking with a necklace (of beads) around his neck. The Prophet (ﷺ) stretched his hand out like this, and Al-Hasan رضی اللہ عنہ did the same. The Prophet (ﷺ) embraced him and said, \"0 Allah! l love him, so please love him and love those who love him.\" Since Allah's Messenger (ﷺ) said that. nothing has been dearer to me than Al-Hasan رضی اللہ عنہما .",
                "hadithUrdu": "میں مدینہ کے بازاروں میں سے ایک بازار میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھا ۔ آنحضرت صلی اللہ علیہ وسلم واپس ہوئے تو میں پھر آپ صلی اللہ علیہ وسلم کے ساتھ واپس ہوا ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا بچہ کہاں ہے ۔ یہ آپ نے تین مرتبہ فرمایا ۔ حسن بن علی کو بلاؤ ۔ حسن بن علی رضی اللہ عنہما آ رہے تھے اور ان کی گردن میں ( خوشبودار لونگ وغیرہ کا ) ہار پڑا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے اپنا ہاتھ اس طرح پھیلا یا کہ ( آپ حضرت حسن رضی اللہ عنہ کو گلے سے لگانے کے لیے ) اور حضرت حسن رضی اللہ عنہ نے بھی اپنا ہاتھ پھیلایا اور وہ آنحضرت صلی اللہ علیہ وسلم سے لپٹ گئے ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا اے اللہ ! میں اس سے محبت کرتا ہوں تو بھی اس سے محبت کر اور ان سے بھی محبت کر جو اس سے محبت رکھیں ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم کے اس ارشاد کے بعد کوئی شخص بھی حضرت حسن بن علی رضی اللہ عنہما سے زیادہ مجھے پیارا نہیں تھا ۔",
                "urduNarrator": "مجھ سے اسحاق بن ابراہیم حنظلی نے بیان کیا ، کہا ہم کو یحییٰ بن آدم نے خبر دی ، کہا ہم سے ورقاء بن عمر نے بیان کیا ، ان سے عبیداللہ بن ابی یزید نے ، ان سے نافع بن جبیر نے بیان ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا وَرْقَاءُ بْنُ عُمَرَ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سُوقٍ مِنْ أَسْوَاقِ الْمَدِينَةِ فَانْصَرَفَ فَانْصَرَفْتُ فَقَالَ ‏\"‏ أَيْنَ لُكَعُ ـ ثَلاَثًا ـ ادْعُ الْحَسَنَ بْنَ عَلِيٍّ ‏\"‏‏.‏ فَقَامَ الْحَسَنُ بْنُ عَلِيٍّ يَمْشِي وَفِي عُنُقِهِ السِّخَابُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ هَكَذَا، فَقَالَ الْحَسَنُ بِيَدِهِ، هَكَذَا فَالْتَزَمَهُ فَقَالَ ‏\"‏ اللَّهُمَّ إِنِّي أُحِبُّهُ، فَأَحِبَّهُ، وَأَحِبَّ مَنْ يُحِبُّهُ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَمَا كَانَ أَحَدٌ أَحَبَّ إِلَىَّ مِنَ الْحَسَنِ بْنِ عَلِيٍّ بَعْدَ مَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا قَالَ‏.‏",
                "headingArabic": null,
                "headingUrdu": "لڑکوں کے لیے سکھاب",
                "headingEnglish": "As-Sikhab for boys",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5635,
                "hadithNumber": "5885",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) cursed those men who are in the similitude (assume the manners) of women and those women who are in the similitude (assume the manners) of men. Amr (bin Marzooq) has reported that Shuba has apprised us.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ان مرودوں پر لعنت بھیجی جو عورتوں جیسا چال چلن اختیار کریں اور ان عورتوں پر لعنت بھیجی جو مردوں جیسا چال چلن اختیار کریں ۔ غندر کے ساتھ اس حدیث کو عمرو بن مرزوق نے بھی شعبہ سے روایت کیا ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے قتادہ نے ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُتَشَبِّهِينَ مِنَ الرِّجَالِ بِالنِّسَاءِ، وَالْمُتَشَبِّهَاتِ مِنَ النِّسَاءِ بِالرِّجَالِ‏.‏ تَابَعَهُ عَمْرٌو أَخْبَرَنَا شُعْبَةُ‏.‏",
                "headingArabic": "الْمُتَشَبِّهُونَ بِالنِّسَاءِ وَالْمُتَشَبِّهَاتُ بِالرِّجَالِ",
                "headingUrdu": "وہ مرد جو عورتوں کی مشابہت میں ہوں اور وہ عورتیں جو مردوں کی مشابہت میں ہوں۔",
                "headingEnglish": "Men who are in the similitude of women, and women who are in the similitude of men",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5636,
                "hadithNumber": "5886",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) cursed effeminate men (those men who are in the similitude (assume the manners of women) and those women who assume the manners of men, and he said, \"Turn them out of your houses .\" The Prophet (ﷺ) turned out such-and-such man, and `Umar رضی اللہ عنہ turned out such-and-such woman.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مخنث مردوں پر اور مردوں کی چال چلن اختیار کرنے والی عورتوں پر لعنت بھیجی اور فرمایا کہ ان زنانہ بننے والے مردوں کو اپنے گھروں سے باہر نکال دو ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے فلاں مرد کونکالاتھا اور عمر رضی اللہ عنہ نے فلاں عورت کو نکالا تھا ۔",
                "urduNarrator": "ہم سے معاذ بن فضالہ نے بیان کیا ، کہا ہم سے ہشام دستوائی نے ، ان سے یحییٰ بن ابی کثیر نے ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَعَنَ النَّبِيُّ صلى الله عليه وسلم الْمُخَنَّثِينَ مِنَ الرِّجَالِ، وَالْمُتَرَجِّلاَتِ مِنَ النِّسَاءِ وَقَالَ ‏ \"‏ أَخْرِجُوهُمْ مِنْ بُيُوتِكُمْ ‏\"‏‏.‏ قَالَ فَأَخْرَجَ النَّبِيُّ صلى الله عليه وسلم فُلاَنًا، وَأَخْرَجَ عُمَرُ فُلاَنًا‏.‏",
                "headingArabic": "إِخْرَاجِ الْمُتَشَبِّهِينَ بِالنِّسَاءِ مِنَ الْبُيُوتِ",
                "headingUrdu": "ایسے مردوں کو گھروں سے نکال دینا جو عورتوں کے مشابہ ہیں۔",
                "headingEnglish": "The dismissal of such men as are in similitude of women, from the houses",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5637,
                "hadithNumber": "5887",
                "englishNarrator": "Narrated Um Salama رضی اللہ عنہ :",
                "hadithEnglish": "Once the Prophet (ﷺ) was in her house, and an effeminate man was there too. The effeminate man said to `Abdullah رضی اللہ عنہ , (Um Salama's brother) \"0 `Abdullah! If Ta'if should be conquered tomorrow, I recommend you the daughter of Ghailan, for she is so fat that she has four curves in the front (of her belly) and eight at the back.\" So the Prophet (ﷺ) said (to his wives) \"These effeminate (men) should not enter upon you (your houses). Imam Bukhari says: ''Tudbirru Bi Thamanin: mean the edges of those folds which cover the both sides until they meet. That's why it is said: ''Thaman'' not ''Thamaniyah'' and the singular of ''Atraaf'' is masculine that's why it is not said: Thamaniya-ta-Atraafin.''",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ان کے پاس تشریف رکھتے تھے ۔ گھر میں ایک مخنث بھی تھا ، اس نے ام سلمہ رضی اللہ عنہما کے بھائی عبداللہ رضی اللہ عنہ سے کہا عبداللہ ! اگر کل تمہیں طائف پر فتح حاصل ہو جائے تو میں تمہیں بنت غیلان ( بادیہ نامی ) کو دکھلاؤں گا وہ جب سامنے آتی ہے تو ( اس کے موٹاپے کی وجہ سے ) چار سلوٹیں دکھائی دیتی ہیں اور جب پیٹھ پھیر تی ہے تو آٹھ سلوٹیں دکھائی دیتی ہیں ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اب یہ شخص تم لوگوں کے پاس نہ آیا کرے ۔ ابوعبداللہ ( حضرت امام بخاری ) نے کہا کہ سامنے سے چارسلوٹوں کا مطلب یہ ہے کہ ( موٹے ہونے کی وجہ سے ) اس کے پیٹ میں چار سلوٹیں پڑی ہوئی ہیں اور جب وہ سامنے آتی ہے تو وہ دکھائی دیتی ہیں اور آٹھ سلوٹوں سے پیچھے پھرتی ہے کا مفہوم ہے ( آگے کی ) ان چاروں سلوٹوں کے کنارے کیونکہ یہ دونوں پہلوؤں کو گھیرے ہوئے ہوتے ہیں اور پھر وہ مل جاتی ہیں اور حدیث میں ” بثمان “ کا لفظ ہے حالانکہ از روئے قائدہ نحو کے ” بثمانیۃ “ ہونا تھا کیونکہ مراد آٹھ اطراف یعنی کنارے ہیں اور اطراف طرف کی جمع ہے اور طرف کا لفظ مذکر ہے ۔ مگر چونکہ اطراف کا لفظ مذکور نہ تھا اس لیے بثمان بھی کہنا درست ہوا ۔",
                "urduNarrator": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، انہیں عروہ نے خبر دی ، انہیں زینب بنت ابی سلمہ رضی اللہ عنہا نے خبر دی اور انہیں حضرت ام سلمہ رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، أَنَّ عُرْوَةَ، أَخْبَرَهُ أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ أَخْبَرَتْهُ أَنَّ أُمَّ سَلَمَةَ أَخْبَرَتْهَا أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ عِنْدَهَا وَفِي الْبَيْتِ مُخَنَّثٌ، فَقَالَ لِعَبْدِ اللَّهِ أَخِي أُمِّ سَلَمَةَ يَا عَبْدَ اللَّهِ إِنْ فُتِحَ لَكُمْ غَدًا الطَّائِفُ، فَإِنِّي أَدُلُّكَ عَلَى بِنْتِ غَيْلاَنَ، فَإِنَّهَا تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَدْخُلَنَّ هَؤُلاَءِ عَلَيْكُنَّ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ يَعْنِي أَرْبَعَ عُكَنِ بَطْنِهَا، فَهْىَ تُقْبِلُ بِهِنَّ، وَقَوْلُهُ وَتُدْبِرُ بِثَمَانٍ‏.‏ يَعْنِي أَطْرَافَ هَذِهِ الْعُكَنِ الأَرْبَعِ، لأَنَّهَا مُحِيطَةٌ بِالْجَنْبَيْنِ حَتَّى لَحِقَتْ وَإِنَّمَا قَالَ بِثَمَانٍ‏.‏ وَلَمْ يَقُلْ بِثَمَانِيَةٍ‏.‏ وَوَاحِدُ الأَطْرَافِ وَهْوَ ذَكَرٌ، لأَنَّهُ لَمْ يَقُلْ ثَمَانِيَةَ أَطْرَافٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5638,
                "hadithNumber": "5888",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"To get the moustaches cut 'short is characteristic of the Fitra.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مونچھ کے بال کتروانا پیدائشی سنت ہے ۔",
                "urduNarrator": "ہم سے مکی بن ابراہیم نے بیان کیا ، ان سے حنظلہ بن ابی ہانی نے ، ان سے نافع نے بیان کیا ، ( مصنف حضرت امام بخاری نے ) کہا کہ اس حدیث کو ہمارے اصحاب نے مکی سے روایت کیا ، انہوں نے بحوالہ ابن عمر رضی اللہ عنہما کہ",
                "hadithArabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، عَنْ حَنْظَلَةَ، عَنْ نَافِعٍ، قَالَ أَصْحَابُنَا عَنِ الْمَكِّيِّ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مِنَ الْفِطْرَةِ قَصُّ الشَّارِبِ ‏\"‏‏.‏",
                "headingArabic": "قَصِّ الشَّارِبِ",
                "headingUrdu": "مونچھیں چھوٹی کرنا",
                "headingEnglish": "To cut short the mustaches",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5639,
                "hadithNumber": "5889",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Five practices are characteristics of the Fitra: circumcision, shaving the pubic region, clipping the nails and cutting the moustaches short.\"",
                "hadithUrdu": "پانچ چیزیں ( فرمایا کہ ) پانچ چیزیں ختنہ کرانا ، موئے زیر ناف مونڈنا ، بغل کے بال نوچنا ، ناخن ترشوانا اور مونچھ کم کرانا پیدائشی سنتوں میں سے ہیں ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا کہ زہری نے ہم سے بیان کیا ( سفیان نے کہا ) ہم سے زہری نے سعید بن مسیب سے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے ( نبی کریم صلی اللہ علیہ وسلم سے ) روایت کیاکہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ الزُّهْرِيُّ حَدَّثَنَا عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، رِوَايَةً ‏ \"‏ الْفِطْرَةُ خَمْسٌ ـ أَوْ خَمْسٌ مِنَ الْفِطْرَةِ ـ الْخِتَانُ، وَالاِسْتِحْدَادُ، وَنَتْفُ الإِبْطِ، وَتَقْلِيمُ الأَظْفَارِ، وَقَصُّ الشَّارِبِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5640,
                "hadithNumber": "5890",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"To shave the pubic hair. to clip the nails and to cut the moustaches short, are characteristics of the Fitra.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا موئے زیر ناف مونڈنا ، ناخن ترشوانا اور مونچھ کترانا پیدائشی سنتیں ہیں ۔",
                "urduNarrator": "ہم سے احمد بن ابی رجاء نے بیان کیا ، انہوں نے کہا ہم سے اسحاق بن سلیمان نے بیان کیا ، انہوں نے کہا کہ میں نے حنظلہ سے سنا ، انہوں نے نافع سے بیان کیا اور انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ حَنْظَلَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مِنَ الْفِطْرَةِ حَلْقُ الْعَانَةِ، وَتَقْلِيمُ الأَظْفَارِ، وَقَصُّ الشَّارِبِ ‏\"‏‏.‏",
                "headingArabic": "تَقْلِيمِ الأَظْفَارِ",
                "headingUrdu": "ناخن تراشنا",
                "headingEnglish": "The clipping of nails",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5641,
                "hadithNumber": "5891",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying. \"Five practices are characteristics of the Fitra: circumcision, shaving the pubic hair, cutting the moustaches short, clipping the nails, and depilating the hair of the armpits.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سناآپ نے فرمایا کہ پانچ چیزیں ختنہ کرانا ، زیر ناف مونڈنا ، مونچھ کترانا ، ناخن ترشوانا اور بغل کے بال نوچنا پیدائشی سنتیں ہیں ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ، انہوں نے کہا ہم سے ابن شہاب نے بیان کیا ، ان سے سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْفِطْرَةُ خَمْسٌ الْخِتَانُ، وَالاِسْتِحْدَادُ، وَقَصُّ الشَّارِبِ، وَتَقْلِيمُ الأَظْفَارِ، وَنَتْفُ الآبَاطِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5642,
                "hadithNumber": "5892",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, 'Do the opposite of what the pagans do. Keep the beards and cut the moustaches short.' Whenever Ibn `Umar رضی اللہ عنہما performed the Hajj or `Umra, he used to hold his beard with his hand and cut whatever remained outside his hold.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم مشرکین کے خلاف کرو ، داڑھی چھوڑ دو اور مونچھیں کترواؤ ۔ عبداللہ بن عمر رضی اللہ عنہما جب حج یا عمرہ کرتے تو اپنی داڑھی ( ہاتھ سے ) پکڑ لیتے اور ( مٹھی ) سے جو بال زیادہ ہوتے انہیں کتروا دیتے ۔",
                "urduNarrator": "ہم سے محمد بن منہال نے بیان کیا ، انہوں نے کہا ہم سے یزید بن زریع نے ، انہوں نے کہا ہم سے عمر بن محمد بن زید نے بیان کیا ، ان سے نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا عُمَرُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ خَالِفُوا الْمُشْرِكِينَ، وَفِّرُوا اللِّحَى، وَأَحْفُوا الشَّوَارِبَ ‏\"‏‏.‏ وَكَانَ ابْنُ عُمَرَ إِذَا حَجَّ أَوِ اعْتَمَرَ قَبَضَ عَلَى لِحْيَتِهِ، فَمَا فَضَلَ أَخَذَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5643,
                "hadithNumber": "5893",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Cut the moustaches short and leave the beard (as it is).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، مونچھیں خوب کتروایا لیا کرو اورداڑھی کو بڑھاؤ ۔",
                "urduNarrator": "مجھ سے محمد نے حدیث بیان کی ، انہوں نے کہا ہمیں عبدہ نے خبر دی ، انہیں عبیداللہ بن عمر نے خبر دی ، انہیں نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ انْهَكُوا الشَّوَارِبَ، وَأَعْفُوا اللِّحَى ‏\"‏‏.‏",
                "headingArabic": "إِعْفَاءِ اللِّحَى عَفَوْا كَثُرُوا وَكَثُرَتْ أَمْوَالُهُمْ",
                "headingUrdu": "داڑھی چھوڑنا",
                "headingEnglish": "To leave the beard",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5644,
                "hadithNumber": "5894",
                "englishNarrator": "Narrated Muhammad bin Seereen:",
                "hadithEnglish": "I asked Anas رضی اللہ عنہ , \"Did the Prophet (ﷺ) dye his hair?\" Anas replied, \"The Prophet (ﷺ) did not have except a few grey hairs.\"",
                "hadithUrdu": "میں نے حضرت انس رضی اللہ عنہ سے پوچھا کیا نبی کریم صلی اللہ علیہ وسلم نے خضاب استعمال کیا تھا ۔ بولے کہ آنحضرت صلی اللہ علیہ وسلم کے بال ہی بہت کم سفید ہوئے تھے ۔",
                "urduNarrator": "ہم سے معلی بن اسد نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے محمد بن سیرین نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ سَأَلْتُ أَنَسًا أَخَضَبَ النَّبِيُّ صلى الله عليه وسلم قَالَ لَمْ يَبْلُغِ الشَّيْبَ إِلاَّ قَلِيلاً‏.‏",
                "headingArabic": "مَا يُذْكَرُ فِي الشَّيْبِ",
                "headingUrdu": "سرمئی بالوں کے بارے میں کیا کہا جاتا ہے۔",
                "headingEnglish": "What is said about grey hair",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5645,
                "hadithNumber": "5895",
                "englishNarrator": "Narrated Thabit:",
                "hadithEnglish": "Anas رضی اللہ عنہ was asked whether the Prophet (ﷺ) used a a hair dye or not. He replied, \"The Prophet (ﷺ) did not have enough grey hair to dye, (such that) if I wanted to count the fading hairs in his beard (I could have).\"",
                "hadithUrdu": "حضرت انس رضی اللہ عنہ سے نبی کریم صلی اللہ علیہ وسلم کے خضاب کے متعلق سوال کیا گیا تو احول نے کہا کہ آنحضرت صلی اللہ علیہ وسلم کو خضاب کی نوبت ہی نہیں آئی تھی اگر میں آپ کی داڑھی کے سفید بال گننا چاہتا تو گن سکتا تھا ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، قَالَ سُئِلَ أَنَسٌ عَنْ خِضَابِ النَّبِيِّ، صلى الله عليه وسلم فَقَالَ إِنَّهُ لَمْ يَبْلُغْ مَا يَخْضِبُ، لَوْ شِئْتُ أَنْ أَعُدَّ شَمَطَاتِهِ فِي لِحْيَتِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5646,
                "hadithNumber": "5896",
                "englishNarrator": "Narrated `Uthman bin `Abdullah bin Mauhab:",
                "hadithEnglish": "\"My people sent me with a bowl of water to Um Salama رضی اللہ عنہا .\" Isra'il approximated three fingers ('indicating the small size of the container in which there was some hair of the Prophet. `Uthman added, \"If any person suffered from evil eye or some other disease, he would send a vessel (containing water) to Um Salama رضی اللہ عنہا . I looked into the container (that held the hair of the Prophet) and saw a few red hairs in it,\"",
                "hadithUrdu": "میرے گھر والوں نے حضرت ام سلمہ رضی اللہ عنہا کے پاس پانی کا ایک پیالہ لے کر بھیجا ( راوی حدیث ) اسرائیل راوی نے تین انگلیاں بند کر لیں یعنی وہ اتنی چھوٹی پیالی تھی اس پیالی میں بالوں کا ایک گچھا تھا جس میں نبی کریم صلی اللہ علیہ وسلم کے بالوں میں سے کچھ بال تھے ۔ عثمان نے کہا جب کسی شخص کو نظر لگ جاتی یا اور کوئی بیماری ہوتی تو وہ اپنا برتن پانی کا بی بی حضرت ام سلمہ رضی اللہ عنہا کے پاس بھیج دیتا ۔ ( وہ اس میں آنحضرت صلی اللہ علیہ وسلم کے بال ڈبو دیتیں ) عثمان نے کہا کہ میں نلکی کو دیکھا ( جس میں موئے مبارک رکھے ہوئے تھے ) تو سرخ سرخ بال دکھائی دیئے ۔",
                "urduNarrator": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے عثمان بن عبداللہ بن وہب نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، قَالَ أَرْسَلَنِي أَهْلِي إِلَى أُمِّ سَلَمَةَ بِقَدَحٍ مِنْ مَاءٍ ـ وَقَبَضَ إِسْرَائِيلُ ثَلاَثَ أَصَابِعَ ـ مِنْ فِضَّةٍ فِيهِ شَعَرٌ مِنْ شَعَرِ النَّبِيِّ صلى الله عليه وسلم وَكَانَ إِذَا أَصَابَ الإِنْسَانَ عَيْنٌ أَوْ شَىْءٌ بَعَثَ إِلَيْهَا مِخْضَبَهُ، فَاطَّلَعْتُ فِي الْجُلْجُلِ فَرَأَيْتُ شَعَرَاتٍ حُمْرًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5647,
                "hadithNumber": "5897",
                "englishNarrator": "Narrated `Uthman bin `Abdullah bin Mauhab:",
                "hadithEnglish": "I went to Um Salama رضی اللہ عنہا and she brought out for us some of the dyed hair of the Prophet.",
                "hadithUrdu": "میں حضرت ام سلمہ رضی اللہ عنہا کی خدمت میں حاضر ہوا تو انہوں نے ہمیں نبی کریم صلی اللہ علیہ وسلم کے چند بال نکال کر دکھائے جن پر خضاب لگا ہوا تھا ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے سلام بن ابی مطیع نے بیان کیا ، ان سے عثمان بن عبداللہ بن موہب نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا سَلاَّمٌ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، قَالَ دَخَلْتُ عَلَى أُمِّ سَلَمَةَ فَأَخْرَجَتْ إِلَيْنَا شَعَرًا مِنْ شَعَرِ النَّبِيِّ صلى الله عليه وسلم مَخْضُوبًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5648,
                "hadithNumber": "5898",
                "englishNarrator": "Narrated Ibn Mauhab:",
                "hadithEnglish": "Um Salama رضی اللہ عنہا had shown him the red hair of the Prophet.",
                "hadithUrdu": "حضرت ام سلمہ رضی اللہ عنہا نے انہیں نبی کریم صلی اللہ علیہ وسلم کا بال دکھایاجو سرخ تھا ۔",
                "urduNarrator": "اور ہم سے ابونعیم نے بیان کیا ، ان سے نصیر بن ابی الاشعث نے بیان کیا ، ان سے عبداللہ بن موہب نے کہ",
                "hadithArabic": "وَقَالَ لَنَا أَبُو نُعَيْمٍ حَدَّثَنَا نُصَيْرُ بْنُ أَبِي الأَشْعَثِ، عَنِ ابْنِ مَوْهَبٍ، أَنَّ أُمَّ سَلَمَةَ، أَرَتْهُ شَعَرَ النَّبِيِّ صلى الله عليه وسلم أَحْمَرَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5649,
                "hadithNumber": "5899",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Jews and Christians do not dye their hair so you should do the opposite of what they do.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہود و نصاریٰ خضاب نہیں لگاتے تم ان کے خلاف کرو یعنی خضاب کیا کرو ۔",
                "urduNarrator": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، کہا ہم سے زہری نے بیان کیا ان سے ابوسلمہ اور سلیمان بن یسار نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ أَبِي سَلَمَةَ، وَسُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ الْيَهُودَ وَالنَّصَارَى لاَ يَصْبُغُونَ فَخَالِفُوهُمْ ‏\"‏‏.‏",
                "headingArabic": "الْخِضَابِ",
                "headingUrdu": "بالوں کا رنگ",
                "headingEnglish": "The hair dye",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5650,
                "hadithNumber": "5900",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) was neither conspicuously tall, nor short; neither, very white, nor tawny. His hair was neither much curled, nor very straight. Allah sent him (as an Apostle) at the age of forty (and after that) he stayed for ten years in Mecca, and for ten more years in Medina. Allah took him unto Him at the age of sixty, and he scarcely had twenty white hairs on his head and in his beard.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم بہت لمبے نہیں تھے اور نہ آپ چھوٹے قد کے ہی تھے ( بلکہ آپ کا بیچ والا قد تھا ) نہ آپ بالکل سفید بھورے تھے اور نہ گندم گوں ہی تھے ، آپ کے بال گھونگھر یالے الجھے ہوئے نہیں تھے اور نہ بالکل سیدھے لٹکے ہوئے تھے ۔ اللہ تعالیٰ نے آپ کو چالیس سال کی عمر میں رسول بنایا دس سال آپ نے ( نبوت کے بعد ) مکہ مکرمہ میں قیام کیا اور دس سال مدینہ منورہ میں اور تقریباً ساٹھ سا ل کی عمر میں اللہ تعالیٰ نے آپ کو وفات دی ۔ وفات کے وقت آپ کے سر اور داڑھی میں بیس بال بھی سفید نہیں تھے ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک بن انس نے بیان کیا ، ان سے ربیعہ بن عبدالرحمٰن نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے ، انہوں نے ان سے سنا کہ وہ بیان کر رہے تھے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ سَمِعَهُ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْسَ بِالطَّوِيلِ الْبَائِنِ، وَلاَ بِالْقَصِيرِ، وَلَيْسَ بِالأَبْيَضِ الأَمْهَقِ، وَلَيْسَ بِالآدَمِ، وَلَيْسَ بِالْجَعْدِ الْقَطَطِ، وَلاَ بِالسَّبْطِ، بَعَثَهُ اللَّهُ عَلَى رَأْسِ أَرْبَعِينَ سَنَةً، فَأَقَامَ بِمَكَّةَ عَشْرَ سِنِينَ، وَبِالْمَدِينَةِ عَشْرَ سِنِينَ، وَتَوَفَّاهُ اللَّهُ عَلَى رَأْسِ سِتِّينَ سَنَةً، وَلَيْسَ فِي رَأْسِهِ وَلِحْيَتِهِ عِشْرُونَ شَعَرَةً بَيْضَاءَ‏.‏",
                "headingArabic": "الْجَعْدِ",
                "headingUrdu": "گھنگریالے بال",
                "headingEnglish": "The curly hair",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5651,
                "hadithNumber": "5901",
                "englishNarrator": "Narrated Al-Bara' رضی اللہ عنہ :",
                "hadithEnglish": "I did not see anybody in a red cloak looking more handsome than the Prophet. Narrated Malik: The hair of the Prophet (ﷺ) used to hang near his shoulders. Abu Ishaq said, \"I heard him relate it more than once. He always laughed when he related it.\" Narrated Shu`ba: The hair of the Prophet (ﷺ) used to hang down to the earlobes.",
                "hadithUrdu": "میں نے سرخ حلہ میں نبی کریم صلی اللہ علیہ وسلم سے زیادہ کسی کو خوبصورت نہیں دیکھا ( امام بخاری نے کہا کہ ) مجھ سے میرے بعض اصحاب نے امام مالک سے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم کے سر کے بال شانہ مبارک کے قریب تک تھے ۔ ابواسحاق نے بیان کیا کہ میں نے براء رضی اللہ عنہ کو ایک مرتبہ سے زیادہ یہ حدیث بیان کرتے سنا جب بھی وہ یہ حدیث بیان کرتے تو مسکراتے ۔ اس روایت کی متابعت شعبہ نے کی کہ آنحضرت صلی اللہ علیہ وسلم کے بال آپ کے کانوں کی لو تک تھے ۔",
                "urduNarrator": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے اسرائیل نے ، ان سے ابواسحاق نے ، کہا میں براء رضی اللہ عنہ سے سنا ، انہوں نے بیان کہا کہ",
                "hadithArabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، سَمِعْتُ الْبَرَاءَ، يَقُولُ مَا رَأَيْتُ أَحَدًا أَحْسَنَ فِي حُلَّةٍ حَمْرَاءَ مِنَ النَّبِيِّ صلى الله عليه وسلم‏.‏ قَالَ بَعْضُ أَصْحَابِي عَنْ مَالِكٍ إِنَّ جُمَّتَهُ لَتَضْرِبُ قَرِيبًا مِنْ مَنْكِبَيْهِ‏.‏ قَالَ أَبُو إِسْحَاقَ سَمِعْتُهُ يُحَدِّثُهُ غَيْرَ مَرَّةٍ، مَا حَدَّثَ بِهِ قَطُّ إِلاَّ ضَحِكَ‏.‏ تَابَعَهُ شُعْبَةُ شَعَرُهُ يَبْلُغُ شَحْمَةَ أُذُنَيْهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5652,
                "hadithNumber": "5902",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Today I saw myself in a dream near the Ka`ba. I saw a whitish brown man, the handsomest of all brown men you might ever see. He had the most beautiful Limma (hair hanging down to the earlobes) you might ever see. He had combed it and it was dripping water; and he was performing the Tawaf around the Ka`ba leaning on two men or on the shoulders of two men. l asked, \"Who is this?\" It was said. \"Messiah, the son of Mary.\" Suddenly I saw a curly-haired man, blind in the right eye which looked like a protruding out grape. I asked, \"Who is this?\" It was said, \"He is Masiah Ad-Dajjal.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا رات کعبہ کے پاس مجھے دیکھایا گیا ، میں نے دیکھا کہ ایک صاحب ہیں گندمی رنگ ، گندمی رنگ کے لوگوں میں سب سے زیادہ خوبصورت ، ان کے شانوں تک لمبے لمبے بال ہیں ایسے بال والے لوگوں میں سب سے زیادہ خوبصورت ، انہوں نے بالوں میں کنگھا کر رکھا ہے اور اس کی وجہ سے سر سے پانی ٹپک رہا ہے ۔ دو آدمیوں کا سہارا لئے ہوئے ہیں یا دو آدمیوں کے شانوں کا سہارا لئے ہوئے ہیں اور خانہ کعبہ کا طواف کر رہے ہیں ، میں نے پوچھا کہ یہ کون بزرگ ہیں تو مجھے بتایا گیا کہ یہ حضرت عیسیٰ ابن مریم علیہ السلام ہیں پھر اچانک میں نے ایک الجھے ہوئے گھونگھریالے بال والے شخص کو دیکھا ، دائیں آنکھ سے کانا تھا گویا انگور ہے جو ابھرا ہوا ہے ۔ میں نے پوچھا یہ کانا کون ہے ؟ مجھے بتایا گیا کہ یہ مسیح دجال ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں نافع نے اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أُرَانِي اللَّيْلَةَ عِنْدَ الْكَعْبَةِ، فَرَأَيْتُ رَجُلاً آدَمَ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنْ أُدْمِ الرِّجَالِ، لَهُ لِمَّةٌ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنَ اللِّمَمِ، قَدْ رَجَّلَهَا، فَهْىَ تَقْطُرُ مَاءً مُتَّكِئًا عَلَى رَجُلَيْنِ، أَوْ عَلَى عَوَاتِقِ رَجُلَيْنِ، يَطُوفُ بِالْبَيْتِ فَسَأَلْتُ مَنْ هَذَا فَقِيلَ الْمَسِيحُ ابْنُ مَرْيَمَ‏.‏ وَإِذَا أَنَا بِرَجُلٍ جَعْدٍ، قَطَطٍ، أَعْوَرِ الْعَيْنِ الْيُمْنَى كَأَنَّهَا عِنَبَةٌ طَافِيَةٌ، فَسَأَلْتُ مَنْ هَذَا فَقِيلَ الْمَسِيحُ الدَّجَّالُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5626,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=225",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=223",
                "label": "223",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=224",
                "label": "224",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=225",
                "label": "225",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=226",
                "label": "226",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=227",
                "label": "227",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=228",
                "label": "228",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=229",
                "label": "229",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=227",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=227",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=225",
        "to": 5650,
        "total": 40465
    }
}