{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 187,
        "data": [
            {
                "id": 4653,
                "hadithNumber": "4875",
                "englishNarrator": "Narrated `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) while in a tent on the day of the Battle of Badr, said, \"O Allah! I request you (to fulfill) Your promise and contract! O Allah! If You wish that you will not be worshipped henceforth..\" On that Abu Bakr رضی اللہ عنہ held the Prophet (ﷺ) by the hand and said, \"That is enough, O Allah's Messenger (ﷺ) You have appealed to your Lord too pressingly,\" while the Prophet (ﷺ) was putting on his armor. So Allah's Messenger (ﷺ) went out, reciting Their multitude will be put to flight, and they will show their backs.' (54.45)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جبکہ آپ بدر کی لڑائی کے دن ایک خیمے میں تھے اور یہ دعا کر رہے تھے کہ اے اللہ! میں تجھے تیرا عہد اور وعدہ نصرت یاد دلاتا ہوں۔ اے اللہ! تیری مرضی ہے اگر تو چاہے ( ان تھوڑے سے مسلمانوں کو بھی ہلاک کر دے ) پھر آج کے بعد تیری عبادت باقی نہیں رہے گی۔ پھر ابوبکر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم کا ہاتھ پکڑ لیا اور عرض کیا: بس یا رسول اللہ! آپ نے اپنے رب سے بہت ہی الحاح و زاری سے دعا کر لی ہے۔ اس وقت نبی کریم صلی اللہ علیہ وسلم زرہ پہنے ہوئے چل پھر رہے تھے اور آپ خیمہ سے نکلے تو زبان مبارک پر یہ آیت تھی «سيهزم الجمع ويولون الدبر‏» ”سو عنقریب ( کافروں کی ) جماعت شکست کھائے گی اور یہ سب پیٹھ پھیر کر بھاگیں گے۔“",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن حوشب نے بیان کیا، کہا ہم سے عبدالوہاب نے بیان کیا، کہا ہم سے خالد حذاء نے بیان کیا، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے (دوسری سند) اور مجھ سے محمد بن یحییٰ ذہلی نے بیان کیا، کہا ہم سے عفان بن مسلم نے بیان کیا، ان سے وہیب نے کہا ہم سے خالد حذاء نے ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَوْشَبٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ،‏.‏ وَحَدَّثَنِي مُحَمَّدٌ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، عَنْ وُهَيْبٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ وَهْوَ فِي قُبَّةٍ يَوْمَ بَدْرٍ ‏\"‏ اللَّهُمَّ إِنِّي أَنْشُدُكَ عَهْدَكَ وَوَعْدَكَ، اللَّهُمَّ إِنْ تَشَأْ لاَ تُعْبَدْ بَعْدَ الْيَوْمِ ‏\"‏‏.‏ فَأَخَذَ أَبُو بَكْرٍ بِيَدِهِ فَقَالَ حَسْبُكَ يَا رَسُولَ اللَّهِ، أَلْحَحْتَ عَلَى رَبِّكَ‏.‏ وَهْوَ يَثِبُ فِي الدِّرْعِ، فَخَرَجَ وَهْوَ يَقُولُ ‏\"‏ ‏{‏سَيُهْزَمُ الْجَمْعُ وَيُوَلُّونَ الدُّبُرَ‏}‏‏.‏‏\"‏",
                "headingArabic": "قَوْلِهِ ‏{‏سَيُهْزَمُ الْجَمْعُ وَيُوَلُّونَ الدُّبُرَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’ان کی جماعت کو بھگا دیا جائے گا‘‘۔ (V.54:45)",
                "headingEnglish": "The Statement of Allah the Most High: \"Their multitude will be put to flight.\" (V.54:45)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4654,
                "hadithNumber": "4876",
                "englishNarrator": "Narrated Yusuf bin Mahik:",
                "hadithEnglish": "I was in the house of `Aisha رضی اللہ عنہا , the mother of the Believers. She said, \"This revelation: \"Nay, but the Hour is their appointed time (for their full recompense); and the Hour will be more previous and most bitter.\" (54.46) was revealed to Muhammad at Mecca while I was a playfull little girl.\"",
                "hadithUrdu": "میں ام المؤمنین عائشہ رضی اللہ عنہا کی خدمت میں حاضر تھا۔ آپ نے فرمایا کہ جس وقت آیت «بل الساعة موعدهم والساعة أدهى وأمر‏» ”لیکن ان کا اصل وعدہ تو قیامت کے دن کا ہے اور قیامت بڑی سخت اور تلخ چیز ہے“ محمد صلی اللہ علیہ وسلم پر مکہ میں نازل ہوئی تو میں بچی تھی اور کھیلا کرتی تھی۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم سے ہشام بن یوسف نے بیان کیا، انہیں ابن جریج نے خبر دی، کہا کہ مجھے یوسف بن ماہک نے خبر دی، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي يُوسُفُ بْنُ مَاهَكَ، قَالَ إِنِّي عِنْدَ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْ لَقَدْ أُنْزِلَ عَلَى مُحَمَّدٍ صلى الله عليه وسلم بِمَكَّةَ، وَإِنِّي لَجَارِيَةٌ أَلْعَبُ ‏{‏بَلِ السَّاعَةُ مَوْعِدُهُمْ وَالسَّاعَةُ أَدْهَى وَأَمَرُّ‏}‏",
                "headingArabic": "قَوْلِهِ ‏{‏بَلِ السَّاعَةُ مَوْعِدُهُمْ وَالسَّاعَةُ أَدْهَى وَأَمَرُّ‏}‏ يَعْنِي مِنَ الْمَرَارَةِ",
                "headingUrdu": "ارشادِ باری تعالیٰ ہے: ’’بلکہ قیامت ان کا وقت مقرر ہے (ان کے پورے بدلے کے لیے) اور قیامت زیادہ سخت اور زیادہ تلخ ہوگی۔‘‘ (V.54:46)",
                "headingEnglish": "The Statement of Allah the Most High: \"Nay, but the Hour is their appointed time (for their full recompense), and the Hour will be more grievous and more bitter.\" (V.54:46)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4655,
                "hadithNumber": "4877",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "While in his tent on the day the Battle of Badr, the Prophet (ﷺ) said, \"O Allah! I request You (to fulfill) Your promise and contract. O Allah! It You wish that the Believers be destroyed). You will never be worshipped henceforth.\" On that, Abu Bakr رضی اللہ عنہ held the Prophet (ﷺ) by the hand and said, \"That is enough, O Allah's Messenger (ﷺ)! You have appealed to your Lord too pressingly\" The Prophet (ﷺ) was wearing his armor and then went out reciting: 'Their multitude will be put to flight and they will show their backs. Nay, but the Hour is their appointed time (for their full recompense), and the Hour will be more previous and most bitter.' (54.45-46)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جبکہ آپ بدر کی لڑائی کے موقع پر میدان میں ایک خیمے میں یہ دعا کر رہے تھے کہ ”اے اللہ! میں تجھے تیرا عہد اور وعدہ نصرت یاد دلاتا ہوں۔ اے اللہ! اگر تو چاہے کہ ( مسلمانوں کو فنا کر دے ) تو آج کے بعد پھر کبھی تیری عبادت نہیں کی جائے گی۔“ اور اس پر ابوبکر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم کا ہاتھ پکڑ کر عرض کیا: بس یا رسول اللہ! آپ اپنے رب سے خوب الحاح و زاری کے ساتھ دعا کر چکے ہیں۔ نبی کریم اس وقت زرہ پہنے ہوئے تھے۔ آپ باہر تشریف لائے تو آپ کی زبان مبارک پر یہ آیت تھی «سيهزم الجمع ويولون الدبر * بل الساعة موعدهم والساعة أدهى وأمر‏» یعنی ”عنقریب کافروں کی یہ جماعت ہار جائے گی اور یہ سب پیٹھ پھیر کر بھاگیں گے۔ لیکن ان کا اصل وعدہ تو قیامت کے دن کا ہے اور قیامت بڑی سخت اور بہت ہی کڑوی چیز ہے۔“",
                "urduNarrator": "مجھ سے اسحاق بن شاہین واسطی نے بیان کیا، کہا ہم سے خالد بن عبداللہ طحان نے، کہا ان سے خالد بن مہران حذاء نے بیان کیا، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا خَالِدٌ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ وَهْوَ فِي قُبَّةٍ لَهُ يَوْمَ بَدْرٍ ‏\"‏ أَنْشُدُكَ عَهْدَكَ وَوَعْدَكَ، اللَّهُمَّ إِنْ شِئْتَ لَمْ تُعْبَدْ بَعْدَ الْيَوْمِ أَبَدًا ‏\"‏‏.‏ فَأَخَذَ أَبُو بَكْرٍ بِيَدِهِ وَقَالَ حَسْبُكَ يَا رَسُولَ اللَّهِ فَقَدْ أَلْحَحْتَ عَلَى رَبِّكَ‏.‏ وَهْوَ فِي الدِّرْعِ فَخَرَجَ وَهْوَ يَقُولُ ‏\"‏ ‏{‏سَيُهْزَمُ الْجَمْعُ وَيُوَلُّونَ الدُّبُرَ * بَلِ السَّاعَةُ مَوْعِدُهُمْ وَالسَّاعَةُ أَدْهَى وَأَمَرُّ‏}‏‏\"‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4656,
                "hadithNumber": "4878",
                "englishNarrator": "Narrated `Abdullah bin Qais:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Two gardens, the utensils and the contents of which are of silver, and two other gardens, the utensils and contents of which are of gold. And nothing will prevent the people who will be in the Garden of Eden from seeing their Lord except the curtain of Majesty over His Face.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ( جنت میں ) دو باغ ہوں گے جن کے برتن اور تمام دوسری چیزیں چاندی کی ہوں گی اور دو دوسرے باغ ہوں گے جن کے برتن اور تمام دوسری چیزیں سونے کے ہوں گے اور جنت عدن سے جنتیوں کے اپنے رب کے دیدار میں کوئی چیز سوائے کبریائی کی چادر کے جو اس کے منہ پر ہو گی، حائل نہ ہو گی۔",
                "urduNarrator": "ہم سے عبداللہ بن ابی الاسود نے بیان کیا، کہا ہم سے عبدالعزیز بن عبدالصمد العمی نے بیان کیا، کہا ہم سے ابوعمران الجونی نے بیان کیا، ان سے ابوبکر بن عبداللہ بن قیس نے اور ان سے ان کے والد (عبداللہ بن قیس ابوموسیٰ اشعری) نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ الْعَمِّيُّ، حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ جَنَّتَانِ مِنْ فِضَّةٍ، آنِيَتُهُمَا وَمَا فِيهِمَا وَجَنَّتَانِ مِنْ ذَهَبٍ آنِيَتُهُمَا وَمَا فِيهِمَا، وَمَا بَيْنَ الْقَوْمِ وَبَيْنَ أَنْ يَنْظُرُوا إِلَى رَبِّهِمْ إِلاَّ رِدَاءُ الْكِبْرِ عَلَى وَجْهِهِ فِي جَنَّةِ عَدْنٍ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَمِنْ دُونِهِمَا جَنَّتَانِ‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’اور ان دونوں کے علاوہ دو اور باغات ہیں (یعنی جنت میں)۔ (V.55:62)",
                "headingEnglish": "The Statement of Allah the Most High: \"And besides these two, there are two other gardens (i.e., in Paradise) .\" (V.55:62)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4657,
                "hadithNumber": "4879 , 4880",
                "englishNarrator": "Narrated `Abdullah bin Qais:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"In Paradise there is a pavilion made of a single hollow pearl sixty miles wide, in each corner of which there are wives who will not see those in the other corners; and the believers will visit and enjoy them.\" And there are two gardens, the utensils and contents of which are made of silver; and two other gardens, the utensils and contents of which are made of so-and-so (i.e. gold) and nothing will prevent the people staying in the Garden of Eden from seeing their Lord except the curtain of Majesty over His Face.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جنت میں کھوکھلے موتی کا خیمہ ہو گا، اس کی چوڑائی ساٹھ میل ہو گی اور اس کے ہر کنارے پر مسلمان کی ایک بیوی ہو گی ایک کنارے والی دوسرے کنارے والی کو نہ دیکھ سکے گی. اورمومن انکے پاس باری باری جائیں گے۔اور دو باغ ہیں جن کے برتن اور سامان چاندی کے بنے ہوئے ہیں۔ اور دو باغات، جن کے برتن اور چیزیں فلاں (یعنی سونے) سے بنی ہیں اور باغ عدن میں رہنے والوں کو اپنے رب کے دیدار سے کوئی چیز نہیں روک سکتی سوائے اس کے چہرے پر عظمت کے پردے کے۔\"",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا، انہوں نے کہا کہ مجھ سے عبدالعزیز بن عبدالصمد نے بیان کیا، کہا ہم سے ابوعمران جونی نے بیان کیا، ان سے ابوبکر بن عبداللہ بن قیس نے اور ان سے ان کے والد نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ فِي الْجَنَّةِ خَيْمَةً مِنْ لُؤْلُؤَةٍ مُجَوَّفَةٍ، عَرْضُهَا سِتُّونَ مِيلاً، فِي كُلِّ زَاوِيَةٍ مِنْهَا أَهْلٌ، مَا يَرَوْنَ الآخَرِينَ يَطُوفُ عَلَيْهِمُ الْمُؤْمِنُونَ ‏\"‏‏. ‏\"‏ وَجَنَّتَانِ مِنْ فِضَّةٍ، آنِيَتُهُمَا وَمَا فِيهِمَا، وَجَنَّتَانِ مِنْ كَذَا آنِيَتُهُمَا، وَمَا فِيهِمَا، وَمَا بَيْنَ الْقَوْمِ وَبَيْنَ أَنْ يَنْظُرُوا إِلَى رَبِّهِمْ إِلاَّ رِدَاءُ الْكِبْرِ عَلَى وَجْهِهِ فِي جَنَّةِ عَدْنٍ ‏\"‏‏.‏",
                "headingArabic": "‏{‏حُورٌ مَقْصُورَاتٌ فِي الْخِيَامِ‏}‏",
                "headingUrdu": "\"حور (خوبصورت میلی لڑکیاں) منڈپوں میں پہرے دار ہیں۔\" (V.55:72)",
                "headingEnglish": "\"Ḥūr (beautiful fair females) guarded in pavilions.\" (V.55:72)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4658,
                "hadithNumber": "4881",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"In Paradise there is a tree which is so big that a rider can travel in its shade for one hundred years without passing it; and if you wish, you can recite: 'In shade long extended.' 56.30.",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جنت میں ایک درخت طویل ہو گا ( اتنا بڑا کہ ) سوار اس کے سایہ میں سو سال تک چلے گا اور پھر بھی اس کا سایہ ختم نہ ہو گا اگر تمہارا جی چاہے تو اس آیت «وظل ممدود‏» کی قرآت کر لو۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے ابوالزناد نے، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا، وہ کہتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ فِي الْجَنَّةِ شَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ لاَ يَقْطَعُهَا، وَاقْرَءُوا إِنْ شِئْتُمْ ‏{‏وَظِلٍّ مَمْدُودٍ‏}‏‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَظِلٍّ مَمْدُودٍ‏}‏",
                "headingUrdu": "اللہ عزوجل کا فرمان ہے: ’’اور سایہ میں لمبا ہوا‘‘۔ (V.56:30)",
                "headingEnglish": "The Statement of Allah the Exalted: \"And in shade long extended.\" (V.56:30)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4659,
                "hadithNumber": "4882",
                "englishNarrator": "Narrated Sa`id bin Jubair:",
                "hadithEnglish": "I asked Ibn `Abbas رضی اللہ عنہما about Surat Al-Tauba, and he said, \"Surat Al-Tauba? It is exposure (of all the evils of the infidels and the hypocrites). And it continued revealing (that the oft-repeated expression): '...and of them ...and of them.' till they started thinking that none would be left unmentioned therein.\" I said, \"What about) Surat Al-Anfal?\" He replied, \"Surat Al-Anfal was revealed in connection with the Badr Battle.\" I said, \"(What about) Surat Al-Hashr?\" He replied, \"It was revealed in connection with Bani an-Nadir.\"",
                "hadithUrdu": "میں نے عبداللہ بن عباس رضی اللہ عنہما سے سورۃ التوبہ کے متعلق پوچھا تو انہوں نے کہا یہ سورۃ التوبہ کی ہے یا فضیحت کرنے والی ہے اس سورت میں برابر یہی اترتا رہا بعض لوگ ایسے ہیں اور بعض لوگ ایسے ہیں یہاں تک کہ لوگوں کو گمان ہوا یہ سورت کسی کا کچھ بھی نہیں چھوڑے گی بلکہ سب کے بھید کھول دے گی۔ بیان کیا کہ میں نے سورۃ الانفال کے متعلق پوچھا تو فرمایا کہ یہ جنگ بدر کے بارے میں نازل ہوئی تھی۔ بیان کیا کہ میں نے سورۃ الحشر کے متعلق پوچھا تو فرمایا کہ قبیلہ بنو نضیر کے یہود کے بارے میں نازل ہوئی تھی۔",
                "urduNarrator": "ہم سے محمد بن عبدالرحیم نے بیان کیا، کہا ہم سے سعید بن سلیمان نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، کہا ہم کو ابوبشر جعفر نے خبر دی، ان سے سعید بن جبیر نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ سُورَةُ التَّوْبَةِ قَالَ التَّوْبَةُ هِيَ الْفَاضِحَةُ، مَا زَالَتْ تَنْزِلُ وَمِنْهُمْ وَمِنْهُمْ، حَتَّى ظَنُّوا أَنَّهَا لَمْ تُبْقِ أَحَدًا مِنْهُمْ إِلاَّ ذُكِرَ فِيهَا‏.‏ قَالَ قُلْتُ سُورَةُ الأَنْفَالِ‏.‏ قَالَ نَزَلَتْ فِي بَدْرٍ‏.‏ قَالَ قُلْتُ سُورَةُ الْحَشْرِ‏.‏ قَالَ نَزَلَتْ فِي بَنِي النَّضِيرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4660,
                "hadithNumber": "4883",
                "englishNarrator": "Narrated Sa`id:",
                "hadithEnglish": "I asked Ibn `Abbas رضی اللہ عنہما about Surat Al-Hashr. He replied, \"Say Surat An-Nadir.\"",
                "hadithUrdu": "میں نے ابن عباس رضی اللہ عنہما سے سورۃ الحشر کے متعلق پوچھا تو انہوں نے کہا بلکہ اسے سورۃ النضیر کہا۔",
                "urduNarrator": "ہم سے حسن بن مدرک نے بیان کیا، کہا ہم سے یحییٰ بن حماد نے بیان کیا، کہا ہم کو ابوعوانہ نے خبر دی، انہیں ابوبشر (جعفر بن ابی) نے اور ان سے سعید بن جبیر نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ مُدْرِكٍ، حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ ـ رضى الله عنهما ـ سُورَةُ الْحَشْرِ قَالَ قُلْ سُورَةُ النَّضِيرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4661,
                "hadithNumber": "4884",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) burnt and cut down the palm trees of Bani An-Nadir which were at Al-Buwair (a place near Medina). There upon Allah revealed: 'What you (O Muslims) cut down of the palm trees (of the enemy) or you left them standing on their stems, it was by the leave of Allah, so that He might cover with shame the rebellious.' (59.5)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بنو نضیر کے کھجوروں کے درخت جلا دیئے تھے اور انہیں کاٹ ڈالا تھا۔ یہ درخت مقام بویرہ میں تھے پھر اس کے متعلق اللہ تعالیٰ نے آیت نازل کی «ما قطعتم من لينة أو تركتموها قائمة على أصولها فبإذن الله وليخزي الفاسقين‏» کہ ”جو کھجوروں کے درخت تم نے کاٹے یا انہیں ان کی جڑوں پر قائم رہنے دیا سو یہ دونوں اللہ ہی کے حکم کے موافق ہیں اور تاکہ نافرمانوں کو ذلیل کرے۔“",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَرَّقَ نَخْلَ بَنِي النَّضِيرِ وَقَطَعَ، وَهْىَ الْبُوَيْرَةُ، فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَى أُصُولِهَا فَبِإِذْنِ اللَّهِ وَلِيُخْزِيَ الْفَاسِقِينَ‏}‏",
                "headingArabic": "‏{‏مَا قَطَعْتُمْ مِنْ لِينَةٍ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’تم (مسلمان) کھجور کے درختوں کو جو (دشمن کے) کاٹتے ہو‘‘ (آیت 59:5)",
                "headingEnglish": "The Statement of Allah the Exalted: \"What you (O Muslims) cut down of the palm-trees (of the enemy)...\" (V.59:5)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4662,
                "hadithNumber": "4885",
                "englishNarrator": "Narrated `Umar رضی اللہ عنہ :",
                "hadithEnglish": "The properties of Bam An-Nadir were among the booty that Allah gave to His Apostle such Booty were not obtained by any expedition on the part of Muslims, neither with cavalry, nor with camelry. So those properties were for Allah's Messenger (ﷺ) only, and he used to provide thereof the yearly expenditure for his wives, and dedicate the rest of its revenues for purchasing arms and horses as war material to be used in Allah's Cause.",
                "hadithUrdu": "بنی نضیر کے اموال کو اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو بغیر لڑائی کے دیا تھا۔ مسلمانوں نے اس کے لیے گھوڑے اور اونٹ نہیں دوڑائے۔ ان اموال کا خرچ کرنا خاص طور سے رسول اللہ صلی اللہ علیہ وسلم کے ہاتھ میں تھا۔ چنانچہ آپ صلی اللہ علیہ وسلم اس میں سے ازواج مطہرات کا سالانہ خرچ دیتے تھے اور جو باقی بچتا تھا اس سے سامان جنگ اور گھوڑوں کے لیے خرچ کرتے تھے تاکہ اللہ رب العزت کے راستہ میں جہاد کے موقع پر کام آئیں۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے کئی مرتبہ عمرو بن دینار سے بیان کیا، ان سے زہری نے، ان سے مالک بن اوس بن حدثان نے اور ان سے عمر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَان ُ ـ غَيْرَ مَرَّةٍ ـ عَنْ عَمْرٍو، عَنِ الزُّهْرِيِّ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، عَنْ عُمَرَ ـ رضى الله عنه ـ قَالَ كَانَتْ أَمْوَالُ بَنِي النَّضِيرِ مِمَّا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ صلى الله عليه وسلم مِمَّا لَمْ يُوجِفِ الْمُسْلِمُونَ عَلَيْهِ بِخَيْلٍ وَلاَ رِكَابٍ، فَكَانَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم خَاصَّةً، يُنْفِقُ عَلَى أَهْلِهِ مِنْهَا نَفَقَةَ سَنَتِهِ، ثُمَّ يَجْعَلُ مَا بَقِيَ فِي السِّلاَحِ وَالْكُرَاعِ، عُدَّةً فِي سَبِيلِ اللَّهِ‏.‏",
                "headingArabic": "قَوْلُهُ ‏{‏مَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"جو کچھ اللہ نے اپنے رسول کو غنیمت کے طور پر دیا...\" (V.59:7)",
                "headingEnglish": "The Statement of Allah the Most High: \"What Allah gave as booty (Fai') to His Messenger . . .\" (V.59:7)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4663,
                "hadithNumber": "4886",
                "englishNarrator": "Narrated `Abdullah (bin Masud) رضی اللہ عنہ :",
                "hadithEnglish": "\"Allah curses those ladies who practice tattooing and those who get themselves tattooed, and those ladies who remove the hair from their faces and those who make artificial spaces between their teeth in order to look more beautiful whereby they change Allah's creation.\" His saying reached a lady from Bani Asd called Um Yaqub who came (to `Abdullah رضی اللہ عنہ) and said, \"I have come to know that you have cursed such-and-such (ladies)?\" He replied, \"Why should I not curse these whom Allah's Messenger (ﷺ) has cursed and who are (cursed) in Allah's Book!\" Um Yaqub said, \"I have read the whole Qur'an, but I did not find in it what you say.\" He said, \"Verily, if you have read it (i.e. the Qur'an), you have found it. Didn't you read: 'And whatsoever the Apostle gives you take it and whatsoever he forbids you, you abstain (from it). (59.7) She replied, \"Yes, I did,\" He said, \"Verily, Allah's Messenger (ﷺ) forbade such things.\" \"She said, \"But I see your wife doing these things?\" He said, \"Go and watch her.\" She went and watched her but could not see anything in support of her statement. On that he said, \"If my wife was as you thought, I would not keep her in my company.\"",
                "hadithUrdu": "اللہ تعالیٰ نے گودوانے والیوں اور گودنے والیوں پر لعنت بھیجی ہے چہرے کے بال اکھاڑنے والیوں اور حسن کے لیے آگے کے دانتوں میں کشادگی کرنے والیوں پر لعنت بھیجی ہے کہ یہ اللہ کی پیدا کی ہوئی صورت میں تبدیلی کرتی ہیں۔ عبداللہ بن مسعود رضی اللہ عنہ کا یہ کلام قبیلہ بنی اسد کی ایک عورت کو معلوم ہوا جو ام یعقوب کے نام سے معروف تھی وہ آئی اور کہا کہ مجھے معلوم ہوا ہے کہ آپ نے اس طرح کی عورتوں پر لعنت بھیجی ہے؟ عبداللہ بن مسعود رضی اللہ عنہ نے کہا آخر کیوں نہ میں انہیں لعنت کروں جنہیں رسول اللہ صلی اللہ علیہ وسلم نے لعنت کی ہے اور جو کتاب اللہ کے حکم کے مطابق ملعون ہے۔ اس عورت نے کہا کہ قرآن مجید تو میں نے بھی پڑھا ہے لیکن آپ جو کچھ کہتے ہیں میں نے تو اس میں کہیں یہ بات نہیں دیکھی۔ انہوں نے کہا کہ اگر تم نے بغور پڑھا ہوتا تو تمہیں ضرور مل جاتا کیا تم نے یہ آیت نہیں پڑھی «وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا‏» کہ ”رسول ( صلی اللہ علیہ وسلم ) تمہیں جو کچھ دیں لے لیا کرو اور جس سے تمہیں روک دیں، رک جایا کرو۔“ اس نے کہا کہ پڑھی ہے عبداللہ بن مسعود رضی اللہ عنہ نے کہا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے ان چیزوں سے روکا ہے۔ اس پر عورت نے کہا کہ میرا خیال ہے کہ آپ کی بیوی بھی ایسا کرتی ہیں۔ انہوں نے کہا کہ اچھا جاؤ اور دیکھ لو۔ وہ عورت گئی اور اس نے دیکھا لیکن اس طرح کی ان کے یہاں کوئی معیوب چیز اسے نہیں ملی۔ پھر عبداللہ بن مسعود رضی اللہ عنہ نے کہا کہ اگر میری بیوی اسی طرح کرتی تو بھلا وہ میرے ساتھ رہ سکتی تھی؟ ہرگز نہیں۔",
                "urduNarrator": "ہم سے محمد بن یوسف بیکندی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے، بیان کیا، ان سے منصور بن معتمر نے، ان سے ابراہیم نخعی نے، ان سے علقمہ نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ لَعَنَ اللَّهُ الْوَاشِمَاتِ وَالْمُوتَشِمَاتِ وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ الْمُغَيِّرَاتِ خَلْقَ اللَّهِ‏.‏ فَبَلَغَ ذَلِكَ امْرَأَةً مِنْ بَنِي أَسَدٍ يُقَالُ لَهَا أُمُّ يَعْقُوبَ، فَجَاءَتْ فَقَالَتْ إِنَّهُ بَلَغَنِي أَنَّكَ لَعَنْتَ كَيْتَ وَكَيْتَ‏.‏ فَقَالَ وَمَا لِي لاَ أَلْعَنُ مَنْ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَنْ هُوَ فِي كِتَابِ اللَّهِ فَقَالَتْ لَقَدْ قَرَأْتُ مَا بَيْنَ اللَّوْحَيْنِ فَمَا وَجَدْتُ فِيهِ مَا تَقُولُ‏.‏ قَالَ لَئِنْ كُنْتِ قَرَأْتِيهِ لَقَدْ وَجَدْتِيهِ، أَمَا قَرَأْتِ ‏{‏وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا‏}‏‏.‏ قَالَتْ بَلَى‏.‏ قَالَ فَإِنَّهُ قَدْ نَهَى عَنْهُ‏.‏ قَالَتْ فَإِنِّي أَرَى أَهْلَكَ يَفْعَلُونَهُ‏.‏ قَالَ فَاذْهَبِي فَانْظُرِي‏.‏ فَذَهَبَتْ فَنَظَرَتْ فَلَمْ تَرَ مِنْ حَاجَتِهَا شَيْئًا، فَقَالَ لَوْ كَانَتْ كَذَلِكَ مَا جَامَعْتُها.",
                "headingArabic": "‏{‏وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ‏}‏",
                "headingUrdu": "\"اور جو کچھ رسول (محمد صلی اللہ علیہ وسلم) تمہیں دیں وہ لے لو...\" (V.59:7)",
                "headingEnglish": "\"And whatsoever the Messenger (Muḥammad pbuh) gives you take it...\" (V.59:7)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4664,
                "hadithNumber": "4887",
                "englishNarrator": "Narrated `Abdullah (bin Mus'ud) رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) has cursed the lady who uses false hair. So, Abdur Rehman bin Abi states that he heard a woman called Umm-e-Yaqub reporting from Hadrat Abdullah bin Masoud رضی اللہ عنہ like this Hadith of Mansur.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے سر کے قدرتی بالوں کے ساتھ مصنوعی بال لگانے والیوں پر لعنت بھیجی تھی۔ عبدالرحمٰن بن عابس نے کہا کہ میں نے بھی ام یعقوب نامی ایک عورت سے سنا تھا وہ عبداللہ بن مسعود رضی اللہ عنہ منصور کی حدیث کے مثل بیان کرتی تھی۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، ان سے سفیان ثوری نے بیان کیا کہ میں نے عبدالرحمٰن بن عابس سے منصور بن معتمر کی حدیث کا ذکر کیا جو وہ ابراہیم سے بیان کرتے تھے کہ ان سے علقمہ نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، قَالَ ذَكَرْتُ لِعَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ حَدِيثَ مَنْصُورٍ عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْوَاصِلَةَ فَقَالَ سَمِعْتُهُ مِنِ امْرَأَةٍ يُقَالُ لَهَا أُمُّ يَعْقُوبَ عَنْ عَبْدِ اللَّهِ مِثْلَ حَدِيثِ مَنْصُورٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4665,
                "hadithNumber": "4888",
                "englishNarrator": "Narrated `Umar رضی اللہ عنہ :",
                "hadithEnglish": "I recommend that my successor should take care of and secure the rights of the early emigrants; and I also advise my successor to be kind to the Ansar who had homes (in Medina) and had adopted the Faith, before the Prophet (ﷺ) migrated to them, and to accept the good from their good ones and excuse their wrong doers.",
                "hadithUrdu": "میں اپنے بعد ہونے والے خلیفہ کو مہاجرین اولین کے بارے میں وصیت کرتا ہوں کہ وہ ان کا حق پہچانے اور میں اپنے بعد ہونے والے خلیفہ کو انصار کے بارے میں وصیت کرتا ہوں جو دارالسلام اور ایمان میں نبی کریم صلی اللہ علیہ وسلم کی ہجرت سے پہلے ہی سے قرار پکڑے ہوئے ہیں یہ کہ ان میں جو نیکوکار ہیں ان کی عزت کرے اور ان کے غلط کاروں سے درگزر کرے۔",
                "urduNarrator": "ہم سے احمد بن یونس بیان کیا، کہا ہم سے ابوبکر نے بیان کیا، ان سے حصین نے، ان سے عمرو بن میمون نے بیان کیا کہ عمر بن خطاب رضی اللہ عنہ نے ( زخمی ہونے کے بعد انتقال سے پہلے ) فرمایا تھا",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو بَكْرٍ، عَنْ حُصَيْنٍ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، قَالَ قَالَ عُمَرُ رضى الله عنه أُوصِي الْخَلِيفَةَ بِالْمُهَاجِرِينَ الأَوَّلِينَ أَنْ يَعْرِفَ لَهُمْ حَقَّهُمْ، وَأُوصِي الْخَلِيفَةَ بِالأَنْصَارِ الَّذِينَ تَبَوَّءُوا الدَّارَ وَالإِيمَانَ مِنْ قَبْلِ أَنْ يُهَاجِرَ النَّبِيُّ صلى الله عليه وسلم أَنْ يَقْبَلَ مِنْ مُحْسِنِهِمْ وَيَعْفُوَ عَنْ مُسِيئِهِمْ‏.‏",
                "headingArabic": "‏{‏وَالَّذِينَ تَبَوَّءُوا الدَّارَ وَالإِيمَانَ‏}‏",
                "headingUrdu": "’’اور (یہ ان لوگوں کے لیے بھی ہے) جن کے پاس ان سے پہلے (مدینہ میں) گھر تھے اور وہ ایمان لائے تھے۔‘‘ (آیت 59:9)",
                "headingEnglish": "\"And (it is also for) those who, before them, had homes (in Al-Madīna) and had adopted the Faith...\" (V.59:9)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4666,
                "hadithNumber": "4889",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "A man came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I am suffering from fatigue and hunger.\" The Prophet (ﷺ) sent (somebody) to his wives (to get something), but the messenger found nothing with them. Then Allah's Messenger (ﷺ) said (to his companions). \"Isn't there anybody who can entertain this man tonight so that Allah may be merciful to him?\" An Ansari man got up and said, \"I (will, entertain him), O Allah's Messenger (ﷺ)!\" So he went to his wife and said to her, \"This is the guest of Allah's Messenger (ﷺ), so do not keep anything away from him.\" She said. \"By Allah, I have nothing but the children's food.\" He said, \"When the children ask for their dinner, put them to bed and put out the light; we shall not take our meals tonight,\" She did so. In the morning the Ansari man went to Allah's Messenger (ﷺ) who said, \"Allah was pleased with (or He bestowed His Mercy) on so-and-so and his wife (because of their good deed).\" Then Allah revealed: 'But give them preference over themselves even though they were in need of that.' (59.9)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک صاحب خود ( ابوہریرہ رضی اللہ عنہ ) حاضر ہوئے اور عرض کیا: یا رسول اللہ! میں فاقہ سے ہوں۔ نبی کریم صلی اللہ علیہ وسلم نے انہیں ازواج مطہرات کے پاس بھیجا ( کہ وہ آپ کی دعوت کریں ) لیکن ان کے پاس کوئی چیز کھانے کی نہیں تھی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ کیا کوئی شخص ایسا نہیں جو آج رات اس مہمان کی میزبانی کرے؟ اللہ اس پر رحم کرے گا۔ اس پر ایک انصاری صحابی ( ابوطلحہ ) کھڑے ہوئے اور عرض کیا: یا رسول اللہ! یہ آج میرے مہمان ہیں پھر وہ انہیں اپنے ساتھ گھر لے گئے اور اپنی بیوی سے کہا کہ یہ رسول اللہ صلی اللہ علیہ وسلم کے مہمان ہیں، کوئی چیز ان سے بچا کے نہ رکھنا۔ بیوی نے کہا اللہ کی قسم میرے پاس اس وقت بچوں کے کھانے کے سوا اور کوئی چیز نہیں ہے۔ انصاری صحابی نے کہا اگر بچے کھانا مانگیں تو انہیں سلا دو اور آؤ یہ چراغ بھی بجھا دو، آج رات ہم بھوکے ہی رہ لیں گے۔ بیوی نے ایسا ہی کیا۔ پھر وہ انصاری صحابی صبح کے وقت رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے فلاں ( انصاری صحابی ) اور ان کی بیوی ( کے عمل ) کو پسند فرمایا۔ یا ( آپ صلی اللہ علیہ وسلم نے یہ فرمایا کہ ) اللہ تعالیٰ مسکرایا پھر اللہ تعالیٰ نے یہ آیت نازل کی «ويؤثرون على أنفسهم ولو كان بهم خصاصة‏» یعنی اور اپنے سے مقدم رکھتے ہیں اگرچہ خود فاقہ میں ہی ہوں۔",
                "urduNarrator": "مجھ سے یعقوب بن ابراہیم بن کثیر نے بیان کیا، کہا کہ ہم سے اسامہ نے بیان کیا، کہا ہم سے فضیل بن غزوان نے بیان کیا، ان سے ابوحازم اشجعی نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ كَثِيرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا فُضَيْلُ بْنُ غَزْوَانَ، حَدَّثَنَا أَبُو حَازِمٍ الأَشْجَعِيُّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ أَتَى رَجُلٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَصَابَنِي الْجَهْدُ فَأَرْسَلَ إِلَى نِسَائِهِ فَلَمْ يَجِدْ عِنْدَهُنَّ شَيْئًا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ رَجُلٌ يُضَيِّفُ هَذِهِ اللَّيْلَةَ يَرْحَمُهُ اللَّهُ ‏\"‏‏.‏ فَقَامَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ أَنَا يَا رَسُولَ اللَّهِ‏.‏ فَذَهَبَ إِلَى أَهْلِهِ فَقَالَ لاِمْرَأَتِهِ ضَيْفُ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ تَدَّخِرِيهِ شَيْئًا‏.‏ قَالَتْ وَاللَّهِ مَا عِنْدِي إِلاَّ قُوتُ الصِّبْيَةِ‏.‏ قَالَ فَإِذَا أَرَادَ الصِّبْيَةُ الْعَشَاءَ فَنَوِّمِيهِمْ، وَتَعَالَىْ فَأَطْفِئِي السِّرَاجَ وَنَطْوِي بُطُونَنَا اللَّيْلَةَ‏.‏ فَفَعَلَتْ ثُمَّ غَدَا الرَّجُلُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ لَقَدْ عَجِبَ اللَّهُ عَزَّ وَجَلَّ ـ أَوْ ضَحِكَ ـ مِنْ فُلاَنٍ وَفُلاَنَةَ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏وَيُؤْثِرُونَ عَلَى أَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ‏}‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَيُؤْثِرُونَ عَلَى أَنْفُسِهِمْ‏}‏ الآيَةَ",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’اور ان (ہجرت کرنے والوں) کو اپنے اوپر ترجیح دو‘‘ (59:9)",
                "headingEnglish": "The Statement of Allah the Exalted: \"...And give them (emigrants) preference over themselves...\" (V.59:9)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4667,
                "hadithNumber": "4890",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent me along with Az-Zubair and Al-Miqdad  رضی اللہ عنہما and said, \"Proceed till you reach a place called Raudat-Khakh where there is a lady travelling in a howda on a camel. She has a letter. Take the letter from her.\" So we set out, and our horses ran at full pace till we reached Raudat Khakh, and behold, we saw the lady and said (to her), \"Take out the letter!\" She said, \"I have no letter with me.\" We said, \"Either you take out the letter or we will strip you of your clothes.\" So she took the letter out of her hair braid. We brought the letter to the Prophet (ﷺ) and behold, it was addressed by Hatib bin Abi Balta'a to some pagans at Mecca, informing them of some of the affairs of the Prophet. The Prophet (ﷺ) said, \"What is this, O Hatib?\" Hatib replied, \"Do not be hasty with me, O Allah's Messenger (ﷺ)! I am an Ansari man and do not belong to them (Quraish infidels) while the emigrants who were with you had their relatives who used to protect their families and properties at Mecca. So, to compensate for not having blood relation with them.' I intended to do them some favor so that they might protect my relatives (at Mecca), and I did not do this out of disbelief or an inclination to desert my religion.\" The Prophet then said (to his companions), \"He (Hatib) has told you the truth.\" `Umar رضی اللہ عنہ said, \"O Allah's Apostle! Allow me to chop his head off?\" The Apostle said, \"He is one of those who witnessed (fought in) the Battle of Badr, and what do you know, perhaps Allah looked upon the people of Badr (Badr warriors) and said, 'Do what you want as I have forgiven you.' \" (`Amr, a sub-narrator, said,: This Verse was revealed about him (Hatib): 'O you who believe! Take not My enemies and your enemies as friends or protectors.' (60.1) Narrated `Ali: Sufyan was asked whether (the Verse): 'Take not My enemies and your enemies...' was revealed in connection with Hatib. Sufyan replied, \"This occurs only in the narration of the people. I memorized the Hadith from `Amr, not overlooking even a single letter thereof, and I do not know of anybody who remembered it by heart other than myself.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھے، زبیر اور مقداد رضی اللہ عنہما کو روانہ کیا اور فرمایا کہ چلے جاؤ اور جب مقام خاخ کے باغ پر پہنچ جاؤ گے ( جو مکہ اور مدینہ کے درمیان تھا ) تو وہاں تمہیں ہودج میں ایک عورت ملے گی، اس کے ساتھ ایک خط ہو گا، وہ خط تم اس سے لے لینا۔ چنانچہ ہم روانہ ہوئے ہمارے گھوڑے ہمیں تیز رفتاری کے ساتھ لے جا رہے تھے۔ آخر جب ہم اس باغ پر پہنچے تو واقعی وہاں ہم نے ہودج میں اس عورت کو پا لیا ہم نے اس سے کہا کہ خط نکال۔ اس نے کہا میرے پاس کوئی خط نہیں ہے ہم نے اس سے کہا کہ خط نکال دے ورنہ ہم تیرا سارا کپڑا اتار کر تلاشی لیں گے۔ آخر اس نے اپنی چوٹی سے خط نکالا ہم لوگ وہ خط لے کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے۔ اس خط میں لکھا ہوا تھا کہ حاطب بن ابی بلتعہ کی طرف سے مشرکین کے چند آدمیوں کی طرف جو مکہ میں تھے اس خط میں انہوں نے نبی کریم صلی اللہ علیہ وسلم کی تیاری کا ذکر لکھا تھا ( کہ نبی کریم صلی اللہ علیہ وسلم ایک بڑی فوج لے کر آتے ہیں تم اپنا بچاؤ کر لو ) ۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا: حاطب! یہ کیا ہے؟ انہوں نے عرض کیا: یا رسول اللہ! میرے معاملہ میں جلدی نہ فرمائیں میں قریش کے ساتھ بطور حلیف ( زمانہ قیام مکہ میں ) رہا کرتا تھا لیکن ان کے قبیلہ و خاندان سے میرا کوئی تعلق نہیں تھا۔ اس کے برخلاف آپ کے ساتھ جو دوسرے مہاجرین ہیں ان کی قریش میں رشتہ داریاں ہیں اور ان کی رعایت سے قریش مکہ میں رہ جانے والے ان کے اہل و عیال اور مال کی حفاظت کرتے ہیں۔ میں نے چاہا کہ جبکہ ان سے میرا کوئی نسبی تعلق نہیں ہے تو اس موقع پر ان پر ایک احسان کر دوں اور اس کی وجہ سے وہ میرے رشتہ داروں کی مکہ میں حفاظت کریں۔ یا رسول اللہ! میں نے یہ عمل کفر یا اپنے دین سے پھر جانے کی وجہ سے نہیں کیا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یقیناً انہوں نے تم سے سچی بات کہہ دی ہے۔ عمر رضی اللہ عنہ بولے کہ یا رسول اللہ! مجھے اجازت دیں میں اس کی گردن مار دوں۔ آپ صلی اللہ علیہ وسلم نے فرمایا یہ بدر کی جنگ میں ہمارے ساتھ موجود تھے۔ تمہیں کیا معلوم، اللہ تعالیٰ بدر والوں کے تمام حالات سے واقف تھا اور اس کے باوجود ان کے متعلق فرما دیا کہ جو جی چاہے کرو کہ میں نے تمہیں معاف کر دیا۔ عمرو بن دینار نے کہا کہ حاطب بن ابی بلتعہ رضی اللہ عنہ ہی کے بارے میں یہ آیت نازل ہوئی تھی «يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم‏» کہ الایۃ۔ ”اے ایمان والو! تم میرے دشمن اور اپنے دشمن کو دوست نہ بنا لینا۔“ سفیان بن عیینہ نے کہا کہ مجھے اس کا علم نہیں کہ اس آیت کا ذکر حدیث میں داخل ہے یا نہیں یہ عمرو بن دینار کا قول ہے۔ ہم سے علی بن عبداللہ مدینی نے بیان کیا کہ سفیان بن عیینہ سے حاطب بن ابی بلتعہ رضی اللہ عنہ کے بارے میں پوچھا گیا کہ کیا آیت «لا تتخذوا عدوي‏» انہیں کے بارے میں نازل ہوئی تھی؟ سفیان نے کہا کہ لوگوں کی روایت میں تو یونہی ہے لیکن میں نے عمرو سے حدیث یاد کی اس میں سے ایک حرف بھی میں نے نہیں چھوڑا اور میں نہیں سمجھتا کہ میرے سوا اور کسی نے اس حدیث کو عمرو سے خوب یاد رکھا ہو۔",
                "urduNarrator": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے عمرو بن دینار نے بیان کیا، کہا کہ مجھ سے حسن بن محمد بن علی نے بیان کیا، انہوں نے علی رضی اللہ عنہ کے کاتب عبیداللہ بن ابی رافع سے سنا، وہ بیان کرتے تھے کہ میں نے علی رضی اللہ عنہ سے سنا انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، قَالَ حَدَّثَنِي الْحَسَنُ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ، أَنَّهُ سَمِعَ عُبَيْدَ اللَّهِ بْنَ أَبِي رَافِعٍ، كَاتِبَ عَلِيٍّ يَقُولُ سَمِعْتُ عَلِيًّا ـ رضى الله عنه ـ يَقُولُ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَا وَالزُّبَيْرَ وَالْمِقْدَادَ فَقَالَ ‏\"‏ انْطَلِقُوا حَتَّى تَأْتُوا رَوْضَةَ خَاخٍ فَإِنَّ بِهَا ظَعِينَةً مَعَهَا كِتَابٌ فَخُذُوهُ مِنْهَا ‏\"‏‏.‏ فَذَهَبْنَا تَعَادَى بِنَا خَيْلُنَا حَتَّى أَتَيْنَا الرَّوْضَةَ فَإِذَا نَحْنُ بِالظَّعِينَةِ فَقُلْنَا أَخْرِجِي الْكِتَابَ فَقَالَتْ مَا مَعِي مِنْ كِتَابٍ‏.‏ فَقُلْنَا لَتُخْرِجِنَّ الْكِتَابَ أَوْ لَنُلْقِيَنَّ الثِّيَابَ‏.‏ فَأَخْرَجَتْهُ مِنْ عِقَاصِهَا فَأَتَيْنَا بِهِ النَّبِيَّ صلى الله عليه وسلم فَإِذَا فِيهِ مِنْ حَاطِبِ بْنِ أَبِي بَلْتَعَةَ إِلَى أُنَاسٍ مِنَ الْمُشْرِكِينَ مِمَّنْ بِمَكَّةَ يُخْبِرُهُمْ بِبَعْضِ أَمْرِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا هَذَا يَا حَاطِبُ ‏\"‏‏.‏ قَالَ لاَ تَعْجَلْ عَلَىَّ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ امْرَأً مِنْ قُرَيْشٍ وَلَمْ أَكُنْ مِنْ أَنْفُسِهِمْ وَكَانَ مَنْ مَعَكَ مِنَ الْمُهَاجِرِينَ لَهُمْ قَرَابَاتٌ يَحْمُونَ بِهَا أَهْلِيهِمْ وَأَمْوَالَهُمْ بِمَكَّةَ فَأَحْبَبْتُ إِذْ فَاتَنِي مِنَ النَّسَبِ فِيهِمْ أَنْ أَصْطَنِعَ إِلَيْهِمْ يَدًا يَحْمُونَ قَرَابَتِي وَمَا فَعَلْتُ ذَلِكَ كُفْرًا وَلاَ ارْتِدَادًا عَنْ دِينِي‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّهُ قَدْ صَدَقَكُمْ ‏\"‏‏.‏ فَقَالَ عُمَرُ دَعْنِي يَا رَسُولَ اللَّهِ فَأَضْرِبَ عُنُقَهُ‏.‏ فَقَالَ ‏\"‏ إِنَّهُ شَهِدَ بَدْرًا وَمَا يُدْرِيكَ لَعَلَّ اللَّهَ ـ عَزَّ وَجَلَّ ـ اطَّلَعَ عَلَى أَهْلِ بَدْرٍ فَقَالَ اعْمَلُوا مَا شِئْتُمْ فَقَدْ غَفَرْتُ لَكُمْ ‏\"‏‏.‏ قَالَ عَمْرٌو وَنَزَلَتْ فِيهِ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ‏}‏ قَالَ لاَ أَدْرِي الآيَةَ فِي الْحَدِيثِ أَوْ قَوْلُ عَمْرٍو‏.‏ حَدَّثَنَا عَلِيٌّ قِيلَ لِسُفْيَانَ فِي هَذَا فَنَزَلَتْ ‏{‏لاَ تَتَّخِذُوا عَدُوِّي‏}‏ قَالَ سُفْيَانُ هَذَا فِي حَدِيثِ النَّاسِ حَفِظْتُهُ مِنْ عَمْرٍو وَمَا تَرَكْتُ مِنْهُ حَرْفًا وَمَا أُرَى أَحَدًا حَفِظَهُ غَيْرِي‏.‏",
                "headingArabic": "‏{‏لاَ تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَاءَ‏}‏",
                "headingUrdu": "’’(اے ایمان والو!) میرے دشمنوں اور اپنے دشمنوں (یعنی کافروں اور مشرکوں) کو دوست نہ بناؤ۔‘‘ (آیت 60:1)",
                "headingEnglish": "\"(O you who believe!) Take not My enemies and your enemies (i.e., disbelievers and polytheists) as friends...\" (V.60:1)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4668,
                "hadithNumber": "4891",
                "englishNarrator": "Narrated Aisha the wife of the Prophet رضی اللہ عنہا :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) used to examine the believing women who migrated to him in accordance with this Verse: 'O Prophet! When believing women come to you to take the oath of allegiance to you... Verily! Allah is Oft-Forgiving Most Merciful.' (60.12) `Aisha رضی اللہ عنہ said, \"And if any of the believing women accepted the condition (assigned in the above-mentioned Verse), Allah's Messenger (ﷺ) would say to her. \"I have accepted your pledge of allegiance.\" \"He would only say that, for, by Allah, his hand never touched, any lady during that pledge of allegiance. He did not receive their pledge except by saying, \"I have accepted your pledge of allegiance for that.\" Zuhri has alsoreported the same from Urwah and Amrah.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اس آیت کے نازل ہونے کے بعد ان مومن عورتوں کا امتحان لیا کرتے تھے جو ہجرت کر کے مدینہ آتی تھیں۔ اللہ تعالیٰ نے ارشاد فرمایا تھا «يا أيها النبي إذا جاءك المؤمنات يبايعنك‏» کہ ”اے نبی! جب آپ سے مسلمان عورتیں بیعت کرنے کے لیے آئیں“ ارشاد «غفور رحيم‏» تک۔ عروہ نے بیان کیا کہ عائشہ رضی اللہ عنہا نے کہا چنانچہ جو عورت اس شرط ( آیت میں مذکور یعنی ایمان وغیرہ ) کا اقرار کر لیتی نبی کریم صلی اللہ علیہ وسلم اس سے زبانی طور پر فرماتے کہ میں نے تمہاری بیعت قبول کر لی اور ہرگز نہیں، اللہ کی قسم! نبی کریم صلی اللہ علیہ وسلم کے ہاتھ نے کسی عورت کا ہاتھ بیعت لیتے وقت کبھی نہیں چھوا صرف آپ ان سے زبانی بیعت لیتے تھے کہ آیت میں مذکورہ باتوں پر قائم رہنا۔ اس روایت کی متابعت یونس، معمر اور عبدالرحمٰن بن اسحاق نے زہری سے کی اور اسحاق بن راشد نے زہری سے بیان کیا کہ ان سے عروہ اور عمرہ بنت عبدالرحمٰن نے کہا۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے یعقوب بن ابراہیم نے بیان کیا، کہا ہم سے ابن شہاب کے بھتیجے نے اپنے چچا محمد بن مسلم سے، انہیں عروہ نے خبر دی اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، أَخْبَرَنِي عُرْوَةُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَمْتَحِنُ مَنْ هَاجَرَ إِلَيْهِ مِنَ الْمُؤْمِنَاتِ بِهَذِهِ الآيَةِ، بِقَوْلِ اللَّهِ ‏{‏يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ‏}‏ إِلَى قَوْلِهِ ‏{‏غَفُورٌ رَحِيمٌ‏}‏‏.‏ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ فَمَنْ أَقَرَّ بِهَذَا الشَّرْطِ مِنَ الْمُؤْمِنَاتِ قَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ بَايَعْتُكِ ‏\"‏‏.‏ كَلاَمًا وَلاَ وَاللَّهِ مَا مَسَّتْ يَدُهُ يَدَ امْرَأَةٍ قَطُّ فِي الْمُبَايَعَةِ، مَا يُبَايِعُهُنَّ إِلاَّ بِقَوْلِهِ ‏\"‏ قَدْ بَايَعْتُكِ عَلَى ذَلِكَ ‏\"‏‏.‏ تَابَعَهُ يُونُسُ وَمَعْمَرٌ وَعَبْدُ الرَّحْمَنِ بْنُ إِسْحَاقَ عَنِ الزُّهْرِيِّ‏.‏ وَقَالَ إِسْحَاقُ بْنُ رَاشِدٍ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ وَعَمْرَةَ‏.‏",
                "headingArabic": "‏{‏إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’جب مومن عورتیں تمہارے پاس ہجرت کرکے آئیں‘‘ (آیت 60:10)",
                "headingEnglish": "The Statement of Allah the Exalted: \"...When believing women come to you as emigrants...\" (V.60:10)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4669,
                "hadithNumber": "4892",
                "englishNarrator": "Narrated Um Atiya رضی اللہ عنہا :",
                "hadithEnglish": "We took the oath of allegiance to Allah's Messenger (ﷺ) and he recited to us: 'They will not associate anything in worship with Allah,' and forbade us to bewail the dead. Thereupon a lady withdrew her hand (refrained from taking the oath of allegiance), and said, \"But such-and-such lady lamented over one of my relatives, so I must reward (do the same over the dead relatives of) hers.\" The Prophet (ﷺ) did not object to that, so she went (there) and returned to the Prophet (ﷺ) so he accepted her pledge of allegiance.",
                "hadithUrdu": "ہم نے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی تو آپ نے ہمارے سامنے اس آیت کی تلاوت کی «أن لا يشركن بالله شيئا‏» کے ساتھ کسی کو شریک نہ کریں گی اور ہمیں نوحہ ( یعنی میت پر زور زور سے رونا پیٹنا ) کرنے سے منع فرمایا۔ نبی کریم صلی اللہ علیہ وسلم کی اس ممانعت پر ایک عورت ( خود ام عطیہ رضی اللہ عنہا ) نے اپنا ہاتھ کھینچ لیا اور عرض کیا کہ فلاں عورت نے نوحہ میں میری مدد کی تھی، میں چاہتی ہوں کہ اس کا بدلہ چکا آؤں نبی کریم صلی اللہ علیہ وسلم نے اس کا کوئی جواب نہیں دیا چنانچہ وہ گئیں اور پھر دوبارہ آ کر نبی کریم صلی اللہ علیہ وسلم سے بیعت کی۔",
                "urduNarrator": "ہم سے ابومعمر نے بیان کیا، کہا ہم سے عبدالوارث نے، کہا ہم سے ایوب نے، ان سے حفصہ بنت سیرین نے اور ان سے ام عطیہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ بَايَعْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَرَأَ عَلَيْنَا ‏{‏أَنْ لاَ يُشْرِكْنَ بِاللَّهِ شَيْئًا‏}‏ وَنَهَانَا عَنِ النِّيَاحَةِ، فَقَبَضَتِ امْرَأَةٌ يَدَهَا فَقَالَتْ أَسْعَدَتْنِي فُلاَنَةُ أُرِيدُ أَنْ أَجْزِيَهَا‏.‏ فَمَا قَالَ لَهَا النَّبِيُّ صلى الله عليه وسلم شَيْئًا فَانْطَلَقَتْ وَرَجَعَتْ فَبَايَعَهَا‏.‏",
                "headingArabic": "‏{‏إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ‏}‏",
                "headingUrdu": "\"اے نبی! جب مومن عورتیں آپ کے پاس بیعت کرنے آئیں...\" (V.60:12)",
                "headingEnglish": "\"O Prophet! When believing women come to you to give you the Bai'a (pledge).. .\" (V.60:12)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4670,
                "hadithNumber": "4893",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Regarding the saying of Allah: 'And they will not disobey you in any just matter.' (60.12) That was one of the conditions which Allah imposed on The believing) women (who came to take the oath of allegiance to the Prophet).",
                "hadithUrdu": "اللہ تعالیٰ کے ارشاد «ولا يعصينك في معروف‏» یعنی ”اور بھلی باتوں ( اور اچھے کاموں میں ) آپ کی نافرمانی نہ کریں گی۔“ کے بارے میں انہوں نے کہا کہ یہ بھی ایک شرط تھی جسے اللہ تعالیٰ نے ( نبی کریم صلی اللہ علیہ وسلم سے بیعت کے وقت ) عورتوں کے لیے ضروری قرار دیا تھا۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے وہب بن جریر نے بیان کیا، کہا کہ ہم سے میرے والد نے بیان کیا، انہوں نے بیان کیا کہ میں نے زبیر سے سنا، انہوں نے عکرمہ سے اور انہوں نے ابن عباس رضی اللہ عنہما سے",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ الزُّبَيْرَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ تَعَالَى ‏{‏وَلاَ يَعْصِينَكَ فِي مَعْرُوفٍ‏}‏ قَالَ إِنَّمَا هُوَ شَرْطٌ شَرَطَهُ اللَّهُ لِلنِّسَاءِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4671,
                "hadithNumber": "4894",
                "englishNarrator": "Narrated 'Ubada bin As-Samit رضی اللہ عنہ :",
                "hadithEnglish": "While we were with the Prophet, he said, \"Will you swear to me the pledge of allegiance that you will not worship any thing besides Allah, will not commit illegal sexual intercourse, and will not steal?\" Then he recited the Verse concerning the women. (Sufyan, the subnarrator, often said that the Prophet: added, \"Whoever among you fulfills his pledge, will receive his reward from Allah, and whoever commits any of those sins and receives the legal punishment (in this life), his punishment will be an expiation for that sin; and whoever commits any of those sins and Allah screens him, then it is up to Allah to punish or forgive them.\" Abdur Razzaq has reported same from Mamar in connection with with this verse.",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کیا تم مجھ سے اس بات پر بیعت کرو گے کہ اللہ تعالیٰ کے ساتھ کسی کو شریک نہ ٹھہراؤ گے اور نہ زنا کرو گے اور نہ چوری کرو گے۔“ آپ صلی اللہ علیہ وسلم نے سورۃ النساء کی آیتیں پڑھیں۔ سفیان نے اس حدیث میں اکثر یوں کہا کہ آپ نے یہ آیت پڑھی۔ پھر تم میں سے جو شخص اس شرط کو پورا کرے گا تو اس کا اجر اللہ پر ہے اور جو کوئی ان میں سے کسی شرط کی خلاف ورزی کر بیٹھا اور اس پر اسے سزا بھی مل گئی تو سزا اس کے لیے کفارہ بن جائے گی لیکن کسی نے اپنے کسی عہد کے خلاف کیا اور اللہ نے اسے چھپا لیا تو وہ اللہ کے حوالے ہے اللہ چاہے تو اسے اس پر عذاب دے اور اگر چاہے معاف کر دے، سفیان کے ساتھ اس حدیث کو عبدالرزاق نے بھی معمر سے روایت کیا انہوں نے زہری سے اور یوں ہی کہا آیت پڑھی۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا کہ ہم سے زہری نے بیان کیا، کہا کہ مجھ سے ابوادریس نے بیان کیا اور انہوں نے عبادہ بن صامت رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ الزُّهْرِيُّ حَدَّثَنَاهُ قَالَ حَدَّثَنِي أَبُو إِدْرِيسَ، سَمِعَ عُبَادَةَ بْنَ الصَّامِتِ ـ رضى الله عنه ـ قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَتُبَايِعُونِي عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا وَلاَ تَزْنُوا وَلاَ تَسْرِقُوا ‏\"‏‏.‏ وَقَرَأَ آيَةَ النِّسَاءِ ـ وَأَكْثَرُ لَفْظِ سُفْيَانَ قَرَأَ الآيَةَ ـ ‏\"‏ فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَعُوقِبَ فَهُوَ كَفَّارَةٌ لَهُ، وَمَنْ أَصَابَ مِنْهَا شَيْئًا مِنْ ذَلِكَ فَسَتَرَهُ اللَّهُ فَهْوَ إِلَى اللَّهِ، إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ غَفَرَ لَهُ‏}‏ ‏\"‏‏.‏ تَابَعَهُ عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ فِي الآيَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4672,
                "hadithNumber": "4895",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "I witnessed the `Id-al-Fitr prayer with Allah's Messenger (ﷺ) , Abu Bakr, `Umar and `Uthman رضی اللہ عنہم; and all of them offered it before delivering the sermon... and then delivered the sermon. Once the Prophet (after completing the prayer and the sermon) came down, as if I am now looking at him waving at the men with his hand to sit down, and walked through them till he, along with Bilal رضی اللہ عنہ, reached (the rows of) the women. Then he recited: 'O Prophet! When believing women come to you to take the oath of allegiance that they will not worship anything other than Allah, will not steal, will not commit illegal sexual intercourse, will not kill their children, and will not utter slander, intentionally forging falsehood (by making illegal children belonging to their husbands)'....(60.12) Having finished, he said, 'Do you agree to that?\" One lady, other than whom none replied the Prophet (ﷺ) said, \"Yes, O Allah's Messenger (ﷺ)!\" (The, sub-narrator, Al-Hasan did not know who the lady was.) Then the Prophet (ﷺ) said to them: \"Will you give alms?\" Thereupon Bilal رضی اللہ عنہ spread out his garment and the women started throwing big rings and small rings into Bilal's garment. (See Hadith No. 95 vol.2)",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر اور عمر اور عثمان رضی اللہ عنہم کے ساتھ عیدالفطر کی نماز پڑھی ہے۔ ان تمام بزرگوں نے نماز خطبہ سے پہلے پڑھی تھی اور خطبہ بعد میں دیا تھا ( ایک مرتبہ خطبہ سے فارغ ہونے کے بعد ) نبی کریم صلی اللہ علیہ وسلم اترے گویا اب بھی میں نبی کریم صلی اللہ علیہ وسلم کو دیکھ رہا ہوں، جب آپ لوگوں کو اپنے ہاتھ کے اشارے سے بٹھا رہے تھے پھر آپ صف چیرتے ہوئے آگے بڑھے اور عورتوں کے پاس تشریف لائے۔ بلال رضی اللہ عنہ آپ کے ساتھ تھے پھر آپ نے یہ آیت تلاوت کی «يا أيها النبي إذا جاءك المؤمنات يبايعنك على أن لا يشركن بالله شيئا ولا يسرقن ولا يزنين ولا يقتلن أولادهن ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن‏» یعنی ”اے نبی! جب مومن عورتیں آپ کے پاس آئیں کہ آپ سے ان باتوں پر بیعت کریں کہ اللہ کے ساتھ نہ کسی کو شریک کریں گی اور نہ چوری کریں گی اور نہ بدکاری کریں گی اور نہ اپنے بچوں کو قتل کریں گی اور نہ بہتان لگائیں گی جسے اپنے ہاتھ اور پاؤں کے درمیان گھڑ لیں“ آپ نے پوری آیت آخر تک پڑھی۔ جب آپ صلی اللہ علیہ وسلم آیت پڑھ چکے تو فرمایا تم ان شرائط پر قائم رہنے کا وعدہ کرتی ہو؟ ان میں سے ایک عورت نے جواب دیا جی ہاں یا رسول اللہ! ان کے سوا اور کسی عورت نے ( شرم کی وجہ سے ) کوئی بات نہیں کہی۔ حسن کو اس عورت کا نام معلوم نہیں تھا بیان کیا کہ پھر عورتوں نے صدقہ دینا شروع کیا اور بلال رضی اللہ عنہ نے اپنا کپڑا پھیلا لیا۔ عورتیں بلال رضی اللہ عنہ کے کپڑے میں چھلے اور انگوٹھیاں ڈالنے لگیں۔",
                "urduNarrator": "ہم سے محمد بن عبدالرحیم نے بیان کیا، کہا ہم سے ہارون بن معروف نے بیان کیا، کہا ہم سے عبداللہ بن وہب نے بیان کیا کہ مجھے ابن جریج نے خبر دی، انہیں حسن بن مسلم نے خبر دی، انہیں طاؤس نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ وَأَخْبَرَنِي ابْنُ جُرَيْجٍ، أَنَّ الْحَسَنَ بْنَ مُسْلِمٍ، أَخْبَرَهُ عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ شَهِدْتُ الصَّلاَةَ يَوْمَ الْفِطْرِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ فَكُلُّهُمْ يُصَلِّيهَا قَبْلَ الْخُطْبَةِ ثُمَّ يَخْطُبُ بَعْدُ، فَنَزَلَ نَبِيُّ اللَّهِ صلى الله عليه وسلم فَكَأَنِّي أَنْظُرُ إِلَيْهِ حِينَ يُجَلِّسُ الرِّجَالَ بِيَدِهِ، ثُمَّ أَقْبَلَ يَشُقُّهُمْ حَتَّى أَتَى النِّسَاءَ مَعَ بِلاَلٍ فَقَالَ ‏{‏يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ عَلَى أَنْ لاَ يُشْرِكْنَ بِاللَّهِ شَيْئًا وَلاَ يَسْرِقْنَ وَلاَ يَزْنِينَ وَلاَ يَقْتُلْنَ أَوْلاَدَهُنَّ وَلاَ يَأْتِينَ بِبُهْتَانٍ يَفْتَرِينَهُ بَيْنَ أَيْدِيهِنَّ وَأَرْجُلِهِنَّ‏}‏ حَتَّى فَرَغَ مِنَ الآيَةِ كُلِّهَا ثُمَّ قَالَ حِينَ فَرَغَ ‏\"‏ أَنْتُنَّ عَلَى ذَلِكَ ‏\"‏‏.‏ وَقَالَتِ امْرَأَةٌ وَاحِدَةٌ لَمْ يُجِبْهُ غَيْرُهَا نَعَمْ يَا رَسُولَ اللَّهِ، لاَ يَدْرِي الْحَسَنُ مَنْ هِيَ‏.‏ قَالَ ‏\"‏ فَتَصَدَّقْنَ ‏\"‏ وَبَسَطَ بِلاَلٌ ثَوْبَهُ فَجَعَلْنَ يُلْقِينَ الْفَتَخَ وَالْخَوَاتِيمَ فِي ثَوْبِ بِلاَلٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4673,
                "hadithNumber": "4896",
                "englishNarrator": "Narrated Jubair bin Mut`im رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, 'I have several names: I am Muhammad and I am Ahmad, and I am Al- Mahi with whom Allah obliterates Kufr (disbelief), and I am Al-Hashir (gatherer) at whose feet (i.e. behind whom) the people will be gathered (on the Day of Resurrection), and I am Al-Aqib (i.e. who succeeds the other prophets in bringing about good).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ میرے کئی نام ہیں۔ میں محمد ہوں، میں احمد ہوں، میں ماحی ہوں کہ جس کے ذریعہ اللہ تعالیٰ کفر کو مٹا دے گا اور میں حاشر ہوں کہ اللہ تعالیٰ سب کو حشر میں میرے بعد جمع کرے گا اور میں عاقب ہوں۔ یعنی سب پیغمبروں کے بعد دنیا میں آنے والا ہوں۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی اور ان سے زہری نے بیان کیا کہا ہم کو محمد بن جبیر بن مطعم نے خبر دی اور ان سے ان کے والد جبیر بن مطعم رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ لِي أَسْمَاءً، أَنَا مُحَمَّدٌ، وَأَنَا أَحْمَدُ، وَأَنَا الْمَاحِي الَّذِي يَمْحُو اللَّهُ بِيَ الْكُفْرَ، وَأَنَا الْحَاشِرُ الَّذِي يُحْشَرُ النَّاسُ عَلَى قَدَمِي، وَأَنَا الْعَاقِبُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلُهُ تَعَالَى ‏{‏مِنْ بَعْدِي اسْمُهُ أَحْمَدُ‏}‏",
                "headingUrdu": "\"اور (یاد کرو) جب عیسیٰ ابن مریم نے کہا: \"اے بنی اسرائیل! میں تمہاری طرف اللہ کا رسول ہوں، مجھ سے پہلے آنے والی تورات کی تصدیق کرنے والا ہوں اور اپنے بعد آنے والے رسول کی بشارت دینے والا ہوں، جس کا نام احمد ہوگا۔\" (61:6)",
                "headingEnglish": "\"[And (remember) when 'Isā (Jesus a.s.), son of Mary said: \"O Children of Israel! I am the Messenger of Allāh unto you, confirming the Torah (which came) before me, and giving glad tidings of a Messenger to come] after me, whose name shall be Ahmad.\" (61:6)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4674,
                "hadithNumber": "4897",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "While we were sitting with the Prophet (ﷺ) Surat Al-Jumu'a was revealed to him, and when the Verse, \"And He (Allah) has sent him (Muhammad) also to other (Muslims).....' (62.3) was recited by the Prophet, I said, \"Who are they, O Allah's Messenger (ﷺ)?\" The Prophet (ﷺ) did not reply till I repeated my question thrice. At that time, Salman Al-Farisi رضی اللہ عنہ was with us. So Allah's Messenger (ﷺ) put his hand on Salman, saying, \"If Faith were at (the place of) Ath-Thuraiya (pleiades, the highest star), even then (some men or man from these people (i.e. Salman's folk) would attain it.\"",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے کہ سورۃ الجمعہ کی یہ آیتیں نازل ہوئیں «وآخرين منهم لما يلحقوا بهم‏» الایۃ اور دوسروں کے لیے بھی جو ابھی ان میں شامل نہیں ہوئے ہیں۔ ( نبی کریم صلی اللہ علیہ وسلم ہادی اور معلم ہیں ) بیان کیا میں نے عرض کی یا رسول اللہ! یہ دوسرے کون لوگ ہیں؟ نبی کریم صلی اللہ علیہ وسلم نے کوئی جواب نہیں دیا۔ آخر یہی سوال تین مرتبہ کیا۔ مجلس میں سلمان فارسی رضی اللہ عنہ بھی موجود تھے نبی کریم صلی اللہ علیہ وسلم نے ان پر ہاتھ رکھ کر فرمایا اگر ایمان ثریا پر بھی ہو گا تب بھی ان لوگوں ( یعنی فارس والوں ) میں سے اس تک پہنچ جائیں گے یا یوں فرمایا کہ ایک آدمی ان لوگوں میں سے اس تک پہنچ جائے گا۔",
                "urduNarrator": "مجھ سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا کہ مجھ سے سلیمان بن ہلال نے بیان کیا، ان سے ثور نے، ان سے ابوالغیث سالم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ ثَوْرٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه قَالَ كُنَّا جُلُوسًا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأُنْزِلَتْ عَلَيْهِ سُورَةُ الْجُمُعَةِ ‏{‏وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا بِهِمْ‏}‏ قَالَ قُلْتُ مَنْ هُمْ يَا رَسُولَ اللَّهِ فَلَمْ يُرَاجِعْهُ حَتَّى سَأَلَ ثَلاَثًا، وَفِينَا سَلْمَانُ الْفَارِسِيُّ، وَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ عَلَى سَلْمَانَ ثُمَّ قَالَ ‏\"‏ لَوْ كَانَ الإِيمَانُ عِنْدَ الثُّرَيَّا لَنَالَهُ رِجَالٌ ـ أَوْ رَجُلٌ ـ مِنْ هَؤُلاَءِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلُهُ ‏{‏وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا بِهِمْ‏}‏‏.‏ وَقَرَأَ عُمَرُ فَامْضُوا إِلَى ذِكْرِ اللَّهِ",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور ان (مسلمانوں) میں سے جو ابھی تک ان کے ساتھ شامل نہیں ہوئے ہیں ان کی طرف بھیجا ہے۔‘‘ (آیت 62:3)",
                "headingEnglish": "The Statement of Allah ta'ala: \"And [He has sent him (Prophet Muḥammad pbuh) also to] others among them (Muslims) who have not yet joined them...\" (V.62:3)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4675,
                "hadithNumber": "4898",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said. Then some men from these people would attain it.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ان کی قوم کے کچھ لوگ اسے پا لیں گے۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبدالوہاب نے بیان کیا، کہا ہم سے عبدالعزیز نے بیان کیا، انہیں ثور نے اور ان سے ابوالغیث نے، انہیں ابوہریرہ رضی اللہ عنہ نے اور انہیں",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، أَخْبَرَنِي ثَوْرٌ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ لَنَالَهُ رِجَالٌ مِنْ هَؤُلاَءِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4676,
                "hadithNumber": "4899",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "A caravan of merchandise arrived at Medina on a Friday while we were with the Prophet (ﷺ) All the people left (the Prophet (ﷺ) and headed for the caravan) except twelve persons. Then Allah revealed:-- 'But when they see some bargain or some amusement they disperse headlong to it.' ..(62.11)",
                "hadithUrdu": "جمعہ کے دن سامان تجارت لیے ہوئے اونٹ آئے ہم اس وقت نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے انہیں دیکھ کر سوائے بارہ آدمی کے سب لوگ ادھر ہی دوڑ پڑے۔ اس پر اللہ تبارک و تعالیٰ نے یہ آیت نازل کی «وإذا رأوا تجارة أو لهوا انفضوا إليها‏» الایۃ یعنی اور بعض لوگوں نے جب کبھی ایک سودے یا تماشے کی چیز کو دیکھا تو اس کی طرف دوڑے ہوئے پھیل گئے۔",
                "urduNarrator": "مجھ سے حفص بن عمر نے بیان کیا، کہا ہم سے خالد بن عبداللہ نے بیان کیا، ان سے حصین نے بیان کیا، ان سے سالم بن ابی الجعد نے اور ابوسفیان نے جابر بن عبداللہ رضی اللہ عنہما سے، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حُصَيْنٌ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، وَعَنْ أَبِي سُفْيَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ أَقْبَلَتْ عِيرٌ يَوْمَ الْجُمُعَةِ وَنَحْنُ مَعَ النَّبِيِّ صلى الله عليه وسلم فَثَارَ النَّاسُ إِلاَّ اثْنَا عَشَرَ رَجُلاً فَأَنْزَلَ اللَّهُ ‏{‏وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا‏}‏",
                "headingArabic": "‏{‏وَإِذَا رَأَوْا تِجَارَةً‏}‏",
                "headingUrdu": "\"اور جب وہ کچھ تجارتی سامان یا کوئی تفریح ​​​​دیکھتے ہیں ...\" (V.62:11)",
                "headingEnglish": "\"And when they see some merchandise or some amusement...\" (V.62:11)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4677,
                "hadithNumber": "4900",
                "englishNarrator": "Narrated Zaid bin Arqam رضی اللہ عنہما :",
                "hadithEnglish": "While I was taking part in a Ghazwa. I heard `Abdullah bin Ubai (bin Abi Salul) saying. \"Don't spend on those who are with Allah's Messenger (ﷺ), that they may disperse and go away from him. If we return (to Medina), surely, the more honorable will expel the meaner amongst them.\" I reported that (saying) to my uncle or to `Umar who, in his turn, informed the Prophet (ﷺ) of it. The Prophet (ﷺ) called me and I narrated to him the whole story. Then Allah's Messenger (ﷺ) sent for `Abdullah bin Ubai and his companions, and they took an oath that they did not say that. So Allah's Messenger (ﷺ) disbelieved my saying and believed his. I was distressed as I never was before. I stayed at home and my uncle said to me. \"You just wanted Allah's Messenger (ﷺ) to disbelieve your statement and hate you.\" So Allah revealed (the Sura beginning with) 'When the hypocrites come to you.' (63.1) The Prophet (ﷺ) then sent for me and recited it and said, \"O Zaid! Allah confirmed your statement.\"",
                "hadithUrdu": "میں ایک غزوہ ( غزوہ تبوک ) میں تھا اور میں نے ( منافقوں کے سردار ) عبداللہ بن ابی کو یہ کہتے سنا کہ جو لوگ ( مہاجرین ) رسول اللہ صلی اللہ علیہ وسلم کے پاس جمع ہیں ان پر خرچ نہ کرو تاکہ وہ خود ہی رسول اللہ صلی اللہ علیہ وسلم سے جدا ہو جائیں گے۔ اس نے یہ بھی کہا اب اگر ہم مدینہ لوٹ کر جائیں گے تو عزت والا وہاں سے ذلت والوں کو نکال باہر کرے گا۔ میں نے اس کا ذکر اپنے چچا ( سعد بن عبادہ انصاری ) سے کیا یا عمر رضی اللہ عنہ سے اس کا ذکر کیا۔ ( راوی کو شک تھا ) انہوں نے اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا۔ نبی کریم صلی اللہ علیہ وسلم نے مجھے بلایا میں نے تمام باتیں آپ کو سنا دیں۔ نبی کریم صلی اللہ علیہ وسلم نے عبداللہ بن ابی اور اس کے ساتھیوں کو بلا بھیجا۔ انہوں نے قسم کھا لی کہا کہ انہوں نے اس طرح کی کوئی بات نہیں کہی تھی۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے مجھ کو جھوٹا سمجھا اور عبداللہ کو سچا سمجھا۔ مجھے اس کا اتنا صدمہ ہوا کہ ایسا کبھی نہ ہوا تھا۔ پھر میں گھر میں بیٹھ رہا۔ میرے چچا نے کہا کہ میرا خیال نہیں تھا کہ نبی کریم صلی اللہ علیہ وسلم تمہاری تکذیب کریں گے اور تم پر ناراض ہوں گے۔ پھر اللہ تعالیٰ نے یہ سورت نازل کی «إذا جاءك المنافقون‏» ”جب منافق آپ کے پاس آتے ہیں“ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے مجھے بلوایا اور اس سورت کی تلاوت کی اور فرمایا کہ اے زید! اللہ تعالیٰ نے تم کو سچا کر دیا ہے۔",
                "urduNarrator": "ہم سے عبداللہ بن رجاء نے بیان کیا، کہا ہم سے اسرائیل بن یونس نے بیان کیا، ان سے اسحاق نے اور ان سے زید بن ارقم رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ كُنْتُ فِي غَزَاةٍ فَسَمِعْتُ عَبْدَ اللَّهِ بْنَ أُبَىٍّ، يَقُولُ لاَ تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ حَتَّى يَنْفَضُّوا مِنْ حَوْلِهِ وَلَوْ رَجَعْنَا مِنْ عِنْدِهِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا‏.‏ الأَذَلَّ فَذَكَرْتُ ذَلِكَ لِعَمِّي أَوْ لِعُمَرَ فَذَكَرَهُ لِلنَّبِيِّ صلى الله عليه وسلم فَدَعَانِي فَحَدَّثْتُهُ فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى عَبْدِ اللَّهِ بْنِ أُبَىٍّ وَأَصْحَابِهِ فَحَلَفُوا مَا قَالُوا فَكَذَّبَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَصَدَّقَهُ فَأَصَابَنِي هَمٌّ لَمْ يُصِبْنِي مِثْلُهُ قَطُّ، فَجَلَسْتُ فِي الْبَيْتِ فَقَالَ لِي عَمِّي مَا أَرَدْتَ إِلَى أَنْ كَذَّبَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَقَتَكَ‏.‏ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِذَا جَاءَكَ الْمُنَافِقُونَ‏}‏ فَبَعَثَ إِلَىَّ النَّبِيُّ صلى الله عليه وسلم فَقَرَأَ فَقَالَ ‏\"‏ إِنَّ اللَّهَ قَدْ صَدَّقَكَ يَا زَيْدُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏إِذَا جَاءَكَ الْمُنَافِقُونَ قَالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ اللَّهِ‏}‏ إِلَى ‏{‏لَكَاذِبُونَ‏}‏‏.‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’جب منافقین آپ کے پاس آتے ہیں تو کہتے ہیں: ہم گواہی دیتے ہیں کہ آپ اللہ کے رسول ہیں‘‘ (63:1)",
                "headingEnglish": "The Statement of Allāh the Most High: \"When the hypocrites come to you (O Muḥammad pbuh) they say: 'We bear witness that you are indeed the Messenger of Allah...\" (V.63:1)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4651,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=186",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=184",
                "label": "184",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=185",
                "label": "185",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=186",
                "label": "186",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=187",
                "label": "187",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=188",
                "label": "188",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=189",
                "label": "189",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=190",
                "label": "190",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=188",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=188",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=186",
        "to": 4675,
        "total": 40465
    }
}