{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 29,
        "data": [
            {
                "id": 701,
                "hadithNumber": "720, 721",
                "englishNarrator": "Narrated Abu Huraira  رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Martyrs are those who die because of drowning, plague, an Abdominal disease, or of being buried alive by a falling building.\" And then he added, \"If the people knew the Reward for the Zuhr prayer in its early time, they would race for it. If they knew the reward for the `Isha' and the Fajr prayers in congregation, they would join them even if they had to crawl. If they knew the reward for the first row, they would draw lots for it.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ڈوبنے والے ، پیٹ کی بیماری میں مرنے والے ، طاعون میں مرنے والے اور دب کر مرنے والے شہید ہیں ۔ فرمایا کہاگر لوگ جان لیں جو ثواب نماز کے لیے جلدی آنے میں ہے تو ایک دوسرے سے آگے بڑھیں اور اگر عشاء اور صبح کی نماز کے ثواب کو جان لیں تو اس کے لیے ضرور آئیں ۔ خواہ سرین کے بل آنا پڑے اور اگر پہلی صف کے ثواب کو جان لیں تو اس کے لیے قرعہ اندازی کریں ۔",
                "urduNarrator": "ہم سے ابوعاصم ضحاک بن مخلد نے امام مالک کے واسطہ سے بیان کیا ، انہوں نے سمی سے ، انہوں نے ابوصالح ذکوان سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ ، عَنْ مَالِكٍ ، عَنْ سُمَيٍّ ، عَنْ أَبِي صَالِحٍ ، عَنْ أَبِي هُرَيْرَةَ ، قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : الشُّهَدَاءُ الْغَرِقُ وَالْمَطْعُونُ وَالْمَبْطُونُ وَالْهَدِمُ. وَقَالَ ‏\"‏ وَلَوْ يَعْلَمُونَ مَا فِي التَّهْجِيرِ لاَسْتَبَقُوا ‏{‏إِلَيْهِ‏}‏ وَلَوْ يَعْلَمُونَ مَا فِي الْعَتَمَةِ وَالصُّبْحِ لأَتَوْهُمَا وَلَوْ حَبْوًا، وَلَوْ يَعْلَمُونَ مَا فِي الصَّفِّ الْمُقَدَّمِ لاَسْتَهَمُوا ‏\"‏‏.‏",
                "headingArabic": "الصَّفِّ الأَوَّلِ",
                "headingUrdu": "پہلی صف",
                "headingEnglish": "The first row",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 702,
                "hadithNumber": "722",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The Imam is (appointed) to be followed. So do not differ from him, bow when he bows, and say, \"Rabbana-lakal hamd\" if he says \"Sami`a l-lahu liman hamidah\"; and if he prostrates, prostrate (after him), and if he prays sitting, pray sitting all together, and straighten the rows for the prayer, as the straightening of the rows is amongst those things which make your prayer a correct and perfect one. (See Hadith No. 657).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ امام اس لیے ہوتا ہے تاکہ اس کی پیروی کی جائے ، اس لیے تم اس سے اختلاف نہ کرو ۔ جب وہ رکوع کرے تو تم بھی رکوع کرو اور جب وہ «سمع الله لمن حمده‏» کہے تو تم «ربنا لك الحمد‏» کہو اور جب وہ سجدہ کرے تو تم بھی سجدہ کرو ۔ اور جب وہ بیٹھ کر نماز پڑھے تو تم سب بھی بیٹھ کر پڑھو اور نماز میں صفیں برابر رکھو ، کیونکہ نماز کا حسن صفوں کے برابر رکھنے میں ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا کہ ہم کو عبدالرزاق نے خبر دی ، انہوں نے کہا کہ ہمیں معمر نے ہمام بن منبہ کے واسطہ سے خبر دی ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ فَلاَ تَخْتَلِفُوا عَلَيْهِ، فَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَقُولُوا رَبَّنَا لَكَ الْحَمْدُ‏.‏ وَإِذَا سَجَدَ فَاسْجُدُوا، وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا أَجْمَعُونَ، وَأَقِيمُوا الصَّفَّ فِي الصَّلاَةِ، فَإِنَّ إِقَامَةَ الصَّفِّ مِنْ حُسْنِ الصَّلاَةِ ‏\"‏‏.‏",
                "headingArabic": "إِقَامَةِ الصَّفِّ مِنْ تَمَامِ الصَّلاَةِ",
                "headingUrdu": "صفوں کا سیدھا کرنا ان واجبات اور نیکیوں میں سے ہے جو آپ کی نماز کو صحیح اور کامل بناتی ہے۔",
                "headingEnglish": "The straightening of the rows is amongst those obligatory and good things which make your As-Salat (the prayer) a correct and perfect one.",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 703,
                "hadithNumber": "723",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Straighten your rows as the straightening of rows is essential for a perfect and correct prayer. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ صفیں برابر رکھو کیونکہ صفوں کا برابر رکھنا نماز کے قائم کرنے میں داخل ہے ۔",
                "urduNarrator": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، کہا کہ ہم کو شعبہ نے قتادہ کے واسطہ سے خبر دی ، انہوں نے حضرت انس رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ سَوُّوا صُفُوفَكُمْ فَإِنَّ تَسْوِيَةَ الصُّفُوفِ مِنْ إِقَامَةِ الصَّلاَةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 704,
                "hadithNumber": "724",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "When he arrived in Madina, he was asked: Which thing have you found contrary to that of Allah's Messenger (ﷺ) time? He said: \"I have not found any change except this that you do not stand in alignment in your prayers.\"\r\nUqba bin has reported from Bushir bin Yasar that Hadrat Anas bin Malik رضی اللہ عنہ came to us in Madinah Munawwarah and said this.",
                "hadithUrdu": "جب وہ ( بصرہ سے ) مدینہ آئے ، تو آپ سے پوچھا گیا کہ نبی کریم صلی اللہ علیہ وسلم کے عہد مبارک اور ہمارے اس دور میں آپ نے کیا فرق پایا ۔ فرمایا کہ اور تو کوئی بات نہیں صرف لوگ صفیں برابر نہیں کرتے ۔\r\n اور عقبہ بن عبید نے بشیر بن یسار سے یوں روایت کیا کہ انس رضی اللہ عنہ ہمارے پاس مدینہ تشریف لائے ۔ پھر یہی حدیث بیان کی ۔",
                "urduNarrator": "ہم سے معاذ بن اسد نے بیان کیا ، انہوں نے کہا کہ ہم سے فضل بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم سے سعید بن عبید طائی نے بیان کیا بشیر بن یسار انصاری سے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، قَالَ أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا سَعِيدُ بْنُ عُبَيْدٍ الطَّائِيُّ، عَنْ بُشَيْرِ بْنِ يَسَارٍ الأَنْصَارِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَدِمَ الْمَدِينَةَ فَقِيلَ لَهُ مَا أَنْكَرْتَ مِنَّا مُنْذُ يَوْمِ عَهِدْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ مَا أَنْكَرْتُ شَيْئًا إِلاَّ أَنَّكُمْ لاَ تُقِيمُونَ الصُّفُوفَ‏.‏ وَقَالَ عُقْبَةُ بْنُ عُبَيْدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ قَدِمَ عَلَيْنَا أَنَسُ بْنُ مَالِكٍ الْمَدِينَةَ بِهَذَا‏.‏",
                "headingArabic": "إِثْمِ مَنْ لَمْ يُتِمَّ الصُّفُوفَ",
                "headingUrdu": "نماز کے لیے صفیں پوری نہ کرنے والے کا گناہ",
                "headingEnglish": "The sin of a person who does not complete the rows (who is out of alignment) for the prayer",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 705,
                "hadithNumber": "725",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Straighten your rows for I see you from behind my back.\" Anas added, \"Everyone of us used to put his shoulder with the shoulder of his companion and his foot with the foot of his companion.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا ، صفیں برابر کر لو ۔ میں تمہیں اپنے پیچھے سے بھی دیکھتا رہتا ہوں اور ہم میں سے ہر شخص یہ کرتا کہ ( صف میں ) اپنا کندھا اپنے ساتھی کے کندھے سے اور اپنا قدم ( پاؤں ) اس کے قدم ( پاؤں ) سے ملا دیتا تھا ۔",
                "urduNarrator": "ہم سے عمرو بن خالد نے بیان کیا ، کہا کہ ہم سے زہیر بن معاویہ نے حمید سے بیان کیا ، انہوں نے حضرت انس رضی اللہ عنہ سے ، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، قَالَ حَدَّثَنَا زُهَيْرٌ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَقِيمُوا صُفُوفَكُمْ فَإِنِّي أَرَاكُمْ مِنْ وَرَاءِ ظَهْرِي ‏\"‏‏.‏ وَكَانَ أَحَدُنَا يُلْزِقُ مَنْكِبَهُ بِمَنْكِبِ صَاحِبِهِ وَقَدَمَهُ بِقَدَمِهِ‏.‏",
                "headingArabic": "إِلْزَاقِ الْمَنْكِبِ بِالْمَنْكِبِ وَالْقَدَمِ بِالْقَدَمِ فِي الصَّفِّ",
                "headingUrdu": "ایک قطار میں کندھے سے کندھے اور پاؤں سے پاؤں کھڑے ہونا",
                "headingEnglish": "To stand shoulder to shoulder and foot to foot in a row",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 706,
                "hadithNumber": "726",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "I prayed with the Prophet (ﷺ) one night and stood on his left side. Allah's Messenger (ﷺ) caught hold of my head from behind and drew me to his right and then offered the prayer and slept. Later the Mu'adh-dhin came and the Prophet (ﷺ) stood up for prayer without performing ablution.",
                "hadithUrdu": "ایک رات میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ ( آپ کے گھر میں تہجد کی ) نماز پڑھی ۔ میں آپ کے بائیں طرف کھڑا ہو گیا ۔ اس لیے آپ صلی اللہ علیہ وسلم نے پیچھے سے میرا سر پکڑ کر مجھے اپنے دائیں طرف کر دیا ۔ پھر نماز پڑھی اور آپ صلی اللہ علیہ وسلم سو گئے جب مؤذن ( نماز کی اطلاع دینے ) آیا تو آپ صلی اللہ علیہ وسلم نماز پڑھانے کے لیے کھڑے ہوئے اور وضو نہیں کیا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے داؤد بن عبدالرحمٰن نے عمرو بن دینار سے بیان کیا ، انہوں نے ابن عباس رضی اللہ عنہما کے غلام کریب سے انہوں نے حضرت عبداللہ بن عباس رضی اللہ عنہما سے ، ، آپ نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا دَاوُدُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَقُمْتُ عَنْ يَسَارِهِ، فَأَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِرَأْسِي مِنْ وَرَائِي، فَجَعَلَنِي عَنْ يَمِينِهِ، فَصَلَّى وَرَقَدَ فَجَاءَهُ الْمُؤَذِّنُ، فَقَامَ وَصَلَّى وَلَمْ يَتَوَضَّأْ‏.‏",
                "headingArabic": "إِذَا قَامَ الرَّجُلُ عَنْ يَسَارِ الإِمَامِ، وَحَوَّلَهُ الإِمَامُ خَلْفَهُ إِلَى يَمِينِهِ، تَمَّتْ صَلاَتُهُ",
                "headingUrdu": "اگر کوئی شخص امام کے بائیں طرف کھڑا ہو اور امام اسے پیچھے سے دائیں طرف پہنائے تو نماز صحیح ہے۔",
                "headingEnglish": "If a person stands by the left side of the Imam, and the Imam dress him to the right from behind, the Salat (prayer) is correct.",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 707,
                "hadithNumber": "727",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "One night an orphan and I offered the prayers behind the Prophet (ﷺ) in my house and my mother (Um Sulaim) was standing behind us (by herself forming a row).",
                "hadithUrdu": "میں نے اور ایک یتیم لڑکے ( ضمیرہ بن ابی ضمیرہ ) نے جو ہمارے گھر میں موجود تھا ، آنحضرت صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی اور میری والدہ ام سلیم ہمارے پیچھے تھیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، ان سے سفیان بن عیینہ نے بیان کیا ، وہ اسحٰق بن عبداللہ بن ابی طلحہ سے وہ انس بن مالک رضی اللہ عنہ سے انہوں نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ إِسْحَاقَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ صَلَّيْتُ أَنَا وَيَتِيمٌ، فِي بَيْتِنَا خَلْفَ النَّبِيِّ صلى الله عليه وسلم وَأُمِّي أُمُّ سُلَيْمٍ خَلْفَنَا‏.‏",
                "headingArabic": "الْمَرْأَةُ وَحْدَهَا تَكُونُ صَفًّا",
                "headingUrdu": "ایک عورت قطار بنا سکتی ہے۔",
                "headingEnglish": "One woman can form a row",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 708,
                "hadithNumber": "728",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "One night I stood to the left of the Prophet (ﷺ) in the prayer but he caught hold of me by the hand or by the shoulder (arm) till he made me stand on his right and beckoned with his hand (for me) to go from behind (him). (Al-Kashmaihani [??] , Fath-ul-Bari).",
                "hadithUrdu": "میں ایک رات نبی کریم صلی اللہ علیہ وسلم کے بائیں طرف ( آپ صلی اللہ علیہ وسلم کے گھر میں ) نماز ( تہجد ) پڑھنے کے لیے کھڑا ہو گیا ۔ اس لیے آپ صلی اللہ علیہ وسلم نے میرا سر یا بازو پکڑ کر مجھ کو اپنی دائیں طرف کھڑا کر دیا ۔ آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ سے اشارہ کیا تھا کہ پیچھے سے گھوم آؤ ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے ثابت بن یزید نے بیان کیا ، کہا کہ ہم سے عاصم احول نے عامر شعبی سے بیان کیا ، انہوں نے ابن عباس رضی اللہ عنہما سے ، آپ نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ، حَدَّثَنَا عَاصِمٌ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قُمْتُ لَيْلَةً أُصَلِّي عَنْ يَسَارِ النَّبِيِّ صلى الله عليه وسلم فَأَخَذَ بِيَدِي أَوْ بِعَضُدِي حَتَّى أَقَامَنِي عَنْ يَمِينِهِ، وَقَالَ بِيَدِهِ مِنْ وَرَائِي‏.‏",
                "headingArabic": "مَيْمَنَةِ الْمَسْجِدِ وَالإِمَامِ",
                "headingUrdu": "مسجد کا داہنی طرف اور امام کے دائیں طرف کی جگہ",
                "headingEnglish": "The right side of the mosque and the place to the right of the Imam",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 709,
                "hadithNumber": "729",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to pray in his room at night. As the wall of the room was LOW, the people saw him and some of them stood up to follow him in the prayer. In the morning they spread the news. The following night the Prophet (ﷺ) stood for the prayer and the people followed him. This went on for two or three nights. Thereupon Allah's Messenger (ﷺ) did not stand for the prayer the following night, and did not come out. In the morning, the people asked him about it. He replied, that he way afraid that the night prayer might become compulsory.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم رات میں اپنے حجرہ کے اندر ( تہجد کی ) نماز پڑھتے تھے ۔ حجرے کی دیواریں پست تھیں اس لیے لوگوں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھ لیا اور کچھ لوگ آپ صلی اللہ علیہ وسلم کی اقتداء میں نماز کے لیے کھڑے ہو گئے ۔ صبح کے وقت لوگوں نے اس کا ذکر دوسروں سے کیا ۔ پھر جب دوسری رات آپ صلی اللہ علیہ وسلم کھڑے ہوئے تو کچھ لوگ آپ صلی اللہ علیہ وسلم کی اقتداء میں اس رات بھی کھڑے ہو گئے ۔ یہ صورت دو یا تین رات تک رہی ۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم بیٹھ رہے اور نماز کے مقام پر تشریف نہیں لائے ۔ پھر صبح کے وقت لوگوں نے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں ڈرا کہ کہیں رات کی نماز ( تہجد ) تم پر فرض نہ ہو جائے ۔ ( اس خیال سے میں نے یہاں کا آنا ناغہ کر دیا ) ۔",
                "urduNarrator": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، کہا کہ ہم سے عبدہ بن سلیمان نے یحییٰ بن سعید انصاری کے واسطہ سے بیان کیا ، انہوں نے عمرہ بنت عبدالرحمٰن سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے ، آپ نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، قَالَ أَخْبَرَنَا عَبْدَةُ، عَنْ يَحْيَى بْنِ سَعِيدٍ الأَنْصَارِيِّ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ فِي حُجْرَتِهِ، وَجِدَارُ الْحُجْرَةِ قَصِيرٌ، فَرَأَى النَّاسُ شَخْصَ النَّبِيِّ صلى الله عليه وسلم فَقَامَ أُنَاسٌ يُصَلُّونَ بِصَلاَتِهِ، فَأَصْبَحُوا فَتَحَدَّثُوا بِذَلِكَ، فَقَامَ لَيْلَةَ الثَّانِيَةِ، فَقَامَ مَعَهُ أُنَاسٌ يُصَلُّونَ بِصَلاَتِهِ، صَنَعُوا ذَلِكَ لَيْلَتَيْنِ أَوْ ثَلاَثَةً، حَتَّى إِذَا كَانَ بَعْدَ ذَلِكَ جَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمْ يَخْرُجْ، فَلَمَّا أَصْبَحَ ذَكَرَ ذَلِكَ النَّاسُ فَقَالَ ‏ \"‏ إِنِّي خَشِيتُ أَنْ تُكْتَبَ عَلَيْكُمْ صَلاَةُ اللَّيْلِ ‏\"‏‏.‏",
                "headingArabic": "إِذَا كَانَ بَيْنَ الإِمَامِ وَبَيْنَ الْقَوْمِ حَائِطٌ أَوْ سُتْرَةٌ",
                "headingUrdu": "اگر امام اور مقتدیوں کے درمیان دیوار یا سترہ ہو۔",
                "headingEnglish": "If there is a wall or a Sutra between the Imam and followers",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 710,
                "hadithNumber": "730",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) had a mat which he used to spread during the day and use as a curtain at night. So a number of people gathered at night facing it and prayed behind him.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے پاس ایک چٹائی تھی ۔ جسے آپ صلی اللہ علیہ وسلم دن میں بچھاتے تھے اور رات میں اس کا پردہ کر لیتے تھے ۔ پھر چند لوگ آپ صلی اللہ علیہ وسلم کے پاس کھڑے ہوئے یا آپ صلی اللہ علیہ وسلم کی طرف جھکے اور آپ صلی اللہ علیہ وسلم کے پیچھے نماز پڑھنے لگے ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا کہ ہم سے محمد بن اسماعیل بن ابی فدیک نے بیان کیا ، کہا کہ ہم سے محمد بن عبدالرحمٰن بن ابی ذئب نے بیان کیا ، مقبری کے واسطہ سے ، انہوں نے ابوسلمہ بن عبدالرحمٰن سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لَهُ حَصِيرٌ يَبْسُطُهُ بِالنَّهَارِ، وَيَحْتَجِرُهُ بِاللَّيْلِ، فَثَابَ إِلَيْهِ نَاسٌ، فَصَلَّوْا وَرَاءَهُ‏.‏",
                "headingArabic": "صَلاَةِ اللَّيْلِ",
                "headingUrdu": "رات کی نماز۔",
                "headingEnglish": "The night prayer.",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 711,
                "hadithNumber": "731",
                "englishNarrator": "Narrated Zaid bin Thabit رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) made a small room in the month of Ramadan (Sa`id said, \"I think that Zaid bin Thabit said that it was made of a mat\") and he prayed there for a few nights, and so some of his companions prayed behind him. When he came to know about it, he kept on sitting. In the morning, he went out to them and said, \"I have seen and understood what you did. You should pray in your houses, for the best prayer of a person is that which he prays in his house except the compulsory prayers.\"\r\nAffan, Wohaib, Musa, Abu Nasr, Busr , Hadrat Zaid bin Thabit  has reported  the same from  the prophet (ﷺ).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے رمضان میں ایک حجرہ بنا لیا یا اوٹ ( پردہ ) بسر بن سعید نے کہا میں سمجھتا ہوں وہ بورئیے کا تھا ۔ آپ نے کئی رات اس میں نماز پڑھی ۔ صحابہ میں سے بعض حضرات نے ان راتوں میں آپ کی اقتداء کی ۔ جب آپ کو اس کا علم ہوا تو آپ نے بیٹھ رہنا شروع کیا ( نماز موقوف رکھی ) پھر برآمد ہوئے اور فرمایا تم نے جو کیا وہ مجھ کو معلوم ہے ، لیکن لوگو ! تم اپنے گھروں میں نماز پڑھتے رہو کیونکہ بہتر نماز آدمی کی وہی ہے جو اس کے گھر میں ہو ۔ مگر فرض نماز ( مسجد میں پڑھنی ضروری ہے ) اور عفان بن مسلم نے کہا کہ ہم سے وہیب نے بیان کیا ، کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا ، کہا کہ میں نے ابوالنضر ابن ابی امیہ سے سنا ، وہ بسر بن سعید سے روایت کرتے تھے ، وہ زید بن ثابت سے ، وہ نبی کریم صلی اللہ علیہ وسلم سے ۔",
                "urduNarrator": "ہم سے عبدالاعلیٰ بن حماد نے بیان کیا ، کہا کہ ہم سے وہیب بن خالد نے بیان کیا ، کہا ہم سے موسیٰ بن عقبہ نے بیان کیا ، ابوالنضر سالم سے ، انہوں نے بسر بن سعید سے ، انہوں نے زید بن ثابت رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمٍ أَبِي النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اتَّخَذَ حُجْرَةً ـ قَالَ حَسِبْتُ أَنَّهُ قَالَ ـ مِنْ حَصِيرٍ فِي رَمَضَانَ فَصَلَّى فِيهَا لَيَالِيَ، فَصَلَّى بِصَلاَتِهِ نَاسٌ مِنْ أَصْحَابِهِ، فَلَمَّا عَلِمَ بِهِمْ جَعَلَ يَقْعُدُ، فَخَرَجَ إِلَيْهِمْ فَقَالَ ‏ \"‏ قَدْ عَرَفْتُ الَّذِي رَأَيْتُ مِنْ صَنِيعِكُمْ، فَصَلُّوا أَيُّهَا النَّاسُ فِي بُيُوتِكُمْ، فَإِنَّ أَفْضَلَ الصَّلاَةِ صَلاَةُ الْمَرْءِ فِي بَيْتِهِ إِلاَّ الْمَكْتُوبَةَ ‏\"‏‏.‏ قَالَ عَفَّانُ حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مُوسَى، سَمِعْتُ أَبَا النَّضْرِ، عَنْ بُسْرٍ، عَنْ زَيْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 712,
                "hadithNumber": "732",
                "englishNarrator": "Narrated Anas bin Malik Al-Ansari رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) rode a horse and fell down and the right side of his body was injured. On that day he prayed one of the prayers sitting and we also prayed behind him sitting. When the Prophet (ﷺ) finished the prayer with Taslim, he said, \"The Imam is to be followed and if he prays standing then pray standing, and bow when he bows, and raise your heads when he raises his head; prostrate when he prostrates; and if he says \"Sami`a l-lahu liman hamidah\", you should say, \"Rabbana wa laka l-hamd.:",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ایک گھوڑے پر سوار ہوئے اور ( گر جانے کی وجہ سے ) آپ صلی اللہ علیہ وسلم کے دائیں پہلو میں زخم آ گئے ۔ حضرت انس رضی اللہ عنہ نے بتلایا کہ اس دن ہمیں آپ صلی اللہ علیہ وسلم نے ایک نماز پڑھائی ، چونکہ آپ صلی اللہ علیہ وسلم بیٹھے ہوئے تھے ، اس لیے ہم نے بھی آپ صلی اللہ علیہ وسلم کے پیچھے بیٹھ کر نماز پڑھی ۔ پھر سلام کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ امام اس لیے ہے کہ اس کی پیروی کی جائے ۔ اس لیے جب وہ کھڑے ہو کر نماز پڑھے تو تم بھی کھڑے ہو کر پڑھو اور جب وہ رکوع کرے تو تم بھی رکوع کرو اور جب وہ سر اٹھائے تو تم بھی اٹھاؤ اور جب وہ سجدہ کرے تو تم بھی کرو اور جب وہ «سمع الله لمن حمده‏» کہے تو تم «ربنا ولك الحمد» کہو ۔",
                "urduNarrator": "ہم سے ابوالیمان حکم بن نافع نے یہ بیان کیا ، انہوں نے کہا کہ ہم سے شعیب نے زہری کے واسطہ سے بیان کیا ، انہوں نے کہا کہ مجھے انس بن مالک انصاری رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ الأَنْصَارِيُّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَكِبَ فَرَسًا، فَجُحِشَ شِقُّهُ الأَيْمَنُ، قَالَ أَنَسٌ ـ رضى الله عنه ـ فَصَلَّى لَنَا يَوْمَئِذٍ صَلاَةً مِنَ الصَّلَوَاتِ وَهْوَ قَاعِدٌ، فَصَلَّيْنَا وَرَاءَهُ قُعُودًا، ثُمَّ قَالَ لَمَّا سَلَّمَ ‏ \"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ، فَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا، وَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا رَفَعَ فَارْفَعُوا، وَإِذَا سَجَدَ فَاسْجُدُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ ‏\"‏‏.‏",
                "headingArabic": "إِيجَابِ التَّكْبِيرِ وَافْتِتَاحِ الصَّلاَةِ",
                "headingUrdu": "تکبیر کہنے کی ضرورت، یعنی اللہ اکبر (اللہ سب سے بڑا ہے) اور نماز کا آغاز",
                "headingEnglish": "The necessity of saying the Takbir, i.e., Allahu Akbar (Allah is the Most Great) and the commencement of As-Salat (the prayer)",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 713,
                "hadithNumber": "733",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) fell from a horse and got injured so he led the prayer sitting and we also prayed sitting. When he completed the prayer he said, \"The Imam is to be followed; if he says Takbir then say Takbir, bow if he bows; raise your heads when he raises his head, when he says, 'Sami`a l-lahu liman hamidah say, 'Rabbana laka l-hamd', and prostrate when he prostrates.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم گھوڑے سے گر گئے اور آپ صلی اللہ علیہ وسلم زخمی ہو گئے ، اس لیے آپ صلی اللہ علیہ وسلم نے بیٹھ کر نماز پڑھی اور ہم نے بھی آپ صلی اللہ علیہ وسلم کی اقتداء میں بیٹھ کر نماز پڑھی ۔ پھر نماز پڑھ کر آپ صلی اللہ علیہ وسلم نے فرمایا کہ امام اس لیے ہے کہ اس کی پیروی کی جائے ۔ اس لیے جب وہ تکبیر کہے تو تم بھی تکبیر کہو ۔ جب وہ رکوع کرے تو تم بھی رکوع کرو ۔ جب وہ سر اٹھائے تو تم بھی اٹھاؤ اور جب وہ «سمع الله لمن حمده‏» کہے تو تم «ربنا لك الحمد» اور جب وہ سجدہ کرے تو تم بھی کرو ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے بیان کیا ، انہوں نے ابن شہاب زہری سے بیان کیا ، انہوں نے انس بن مالک رضی اللہ عنہ سے ، انہوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ خَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ فَرَسٍ فَجُحِشَ فَصَلَّى لَنَا قَاعِدًا فَصَلَّيْنَا مَعَهُ قُعُودًا، ثُمَّ انْصَرَفَ فَقَالَ ‏ \"‏ إِنَّمَا الإِمَامُ ـ أَوْ إِنَّمَا جُعِلَ الإِمَامُ ـ لِيُؤْتَمَّ بِهِ، فَإِذَا كَبَّرَ فَكَبِّرُوا، وَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا رَفَعَ فَارْفَعُوا، وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَقُولُوا رَبَّنَا لَكَ الْحَمْدُ‏.‏ وَإِذَا سَجَدَ فَاسْجُدُوا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 714,
                "hadithNumber": "734",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The Imam is to be followed. Say the Takbir when he says it; bow if he bows; if he says 'Sami`a l-lahu liman hamidah', say, ' Rabbana wa laka l-hamd', prostrate if he prostrates and pray sitting altogether if he prays sitting.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، امام اس لیے ہے کہ اس کی پیروی کی جائے ، اس لیے جب وہ تکبیر کہے تو تم بھی تکبیر کہو ۔ جب وہ رکوع کرے تو تم بھی رکوع کرو اور جب وہ «سمع الله لمن حمده‏» کہے تو تم «ربنا ولك الحمد» اور جب وہ سجدہ کرے تو تم بھی سجدہ کرو اور جب وہ بیٹھ کر نماز پڑھے تو تم سب بھی بیٹھ کر نماز پڑھو ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے خبر دی ، انہوں نے کہا کہ ابوالزناد نے مجھ سے بیان کیا اعرج کے واسطہ سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، قَالَ حَدَّثَنِي أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ، فَإِذَا كَبَّرَ فَكَبِّرُوا، وَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ‏.‏ وَإِذَا سَجَدَ فَاسْجُدُوا، وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا أَجْمَعُونَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 715,
                "hadithNumber": "735",
                "englishNarrator": "Narrated Salim bin `Abdullah:",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) used to raise both his hands up to the level of his shoulders when opening the prayer; and on saying the Takbir for bowing. And on raising his head from bowing he used to do the same and then say \"Sami`a l-lahu liman hamidah, Rabbana wa laka l-hamd.\" And he did not do that (i.e. raising his hands) in prostrations.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نماز شروع کرتے وقت اپنے دونوں ہاتھوں کو کندھوں تک اٹھاتے ، اسی طرح جب رکوع کے لیے «الله اكبر» کہتے اور جب اپنا سر رکوع سے اٹھاتے تو دونوں ہاتھ بھی اٹھاتے ( رفع یدین کرتے ) اور رکوع سے سرمبارک اٹھاتے ہوئے «سمع الله لمن حمده ،‏‏‏‏ ‏‏‏‏ ربنا ولك الحمد» کہتے تھے ۔ سجدہ میں جاتے وقت رفع یدین نہیں کرتے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، انہوں نے امام مالک سے ، انہوں نے ابن شہاب زہری سے ، انہوں نے سالم بن عبداللہ سے ، انہوں نے اپنے باپ ( عبداللہ بن عمر رضی اللہ عنہما ) سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَرْفَعُ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ إِذَا افْتَتَحَ الصَّلاَةَ، وَإِذَا كَبَّرَ لِلرُّكُوعِ، وَإِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ رَفَعَهُمَا كَذَلِكَ أَيْضًا وَقَالَ ‏ \"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ، رَبَّنَا وَلَكَ الْحَمْدُ ‏\"‏‏.‏ وَكَانَ لاَ يَفْعَلُ ذَلِكَ فِي السُّجُودِ‏.‏",
                "headingArabic": "رَفْعِ الْيَدَيْنِ فِي التَّكْبِيرَةِ الأُولَى مَعَ الاِفْتِتَاحِ سَوَاءً",
                "headingUrdu": "نماز کھولنے کے ساتھ ساتھ پہلی تکبیر کہنے پر دونوں ہاتھ اٹھانا",
                "headingEnglish": "To raise both hands on saying the first Takbir simultaneously with opening the Salat (prayer)",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 716,
                "hadithNumber": "736",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I saw that whenever Allah's Messenger (ﷺ) stood for the prayer, he used to raise both his hands up to the shoulders, and used to do the same on saying the Takbir for bowing and on raising his head from it and used to say, \"Sami`a l-lahu liman hamidah\". But he did not do that (i.e. raising his hands) in prostrations.",
                "hadithUrdu": "جب آپ صلی اللہ علیہ وسلم نماز کے لیے کھڑے ہوئے تو تکبیر تحریمہ کے وقت آپ صلی اللہ علیہ وسلم نے رفع یدین کیا ۔ آپ صلی اللہ علیہ وسلم کے دونوں ہاتھ اس وقت مونڈھوں ( کندھوں ) تک اٹھے اور اسی طرح جب آپ صلی اللہ علیہ وسلم رکوع کے لیے تکبیر کہتے اس وقت بھی ( رفع یدین ) کرتے ۔ اس وقت آپ صلی اللہ علیہ وسلم کہتے «سمع الله لمن حمده» البتہ سجدہ میں آپ رفع یدین نہیں کرتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا کہ ہم کو عبداللہ بن مبارک نے خبر دی ، کہا کہ ہم کو یونس بن یزید ایلی نے زہری سے خبر دی ، انہوں نے کہا کہ مجھے سالم بن عبداللہ بن عمر رضی اللہ عنہما نے عبداللہ بن عمر رضی اللہ عنہما سے خبر دی ، انہوں نے بتلایا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، رضى الله عنهما قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا قَامَ فِي الصَّلاَةِ رَفَعَ يَدَيْهِ حَتَّى يَكُونَا حَذْوَ مَنْكِبَيْهِ، وَكَانَ يَفْعَلُ ذَلِكَ حِينَ يُكَبِّرُ لِلرُّكُوعِ، وَيَفْعَلُ ذَلِكَ إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ وَيَقُولُ ‏ \"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏\"‏‏.‏ وَلاَ يَفْعَلُ ذَلِكَ فِي السُّجُودِ‏.‏",
                "headingArabic": "رَفْعِ الْيَدَيْنِ إِذَا كَبَّرَ وَإِذَا رَكَعَ وَإِذَا رَفَعَ",
                "headingUrdu": "تکبیر (نماز کھولنے پر) کہتے ہوئے دونوں ہاتھ اٹھانا اور رکوع کرتے وقت اور سر اٹھاتے وقت (رکوع کے بعد)",
                "headingEnglish": "To raise both hands while saying the Takbir [on opening As-Salat (the prayer)], and while bowing and on raising up the head (after bowing)",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 717,
                "hadithNumber": "737",
                "englishNarrator": "Narrated Abu Qilaba:",
                "hadithEnglish": "I saw Malik bin Huwairith saying Takbir and raising both his hands (on starting the prayers and raising his hands on bowing and also on raising his head after bowing. Malik bin Huwairith said, \"Allah's Messenger (ﷺ) did the same.\"",
                "hadithUrdu": "انہوں نے مالک بن حویرث صحابی کو دیکھا کہ جب وہ نماز شروع کرتے تو تکبیر تحریمہ کے ساتھ رفع یدین کرتے ، پھر جب رکوع میں جاتے اس وقت بھی رفع یدین کرتے اور جب رکوع سے سر اٹھاتے تب بھی کرتے اور انھوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم بھی اسی طرح کیا کرتے تھے ۔",
                "urduNarrator": "ہم سے اسحاق بن شاہین واسطی نے بیان کیا ، کہا کہ ہم سے خالد بن عبداللہ طحان نے بیان کیا خالد حذاء سے ، انہوں نے ابوقلابہ سے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ الْوَاسِطِيُّ، قَالَ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ خَالِدٍ، عَنْ أَبِي قِلاَبَةَ، أَنَّهُ رَأَى مَالِكَ بْنَ الْحُوَيْرِثِ إِذَا صَلَّى كَبَّرَ وَرَفَعَ يَدَيْهِ، وَإِذَا أَرَادَ أَنْ يَرْكَعَ رَفَعَ يَدَيْهِ، وَإِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ رَفَعَ يَدَيْهِ، وَحَدَّثَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَنَعَ هَكَذَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 718,
                "hadithNumber": "738",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I saw Allah's Messenger (ﷺ) opening the prayer with the Takbir and raising his hands to the level of his shoulders at the time of saying the Takbir, and on saying the Takbir for bowing he did the same; and when he said, \"Sami`a l-lahu liman hamidah \", he did the same and then said, \"Rabbana wa laka lhamd.\" But he did not do the same on prostrating and on lifting the head from it.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نماز تکبیر تحریمہ سے شروع کرتے اور تکبیر کہتے وقت اپنے دونوں ہاتھوں کو کندھوں تک اٹھا کر لے جاتے اور جب رکوع کے لیے تکبیر کہتے تب بھی اسی طرح کرتے اور جب «سمع الله لمن حمده» کہتے تب بھی اسی طرح کرتے اور «ربنا ولك الحمد» کہتے ۔ سجدہ کرتے وقت یا سجدے سے سر اٹھاتے وقت اس طرح رفع یدین نہیں کرتے تھے ۔",
                "urduNarrator": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی ، انہوں نے کہا کہ مجھے سالم بن عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنَا سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم افْتَتَحَ التَّكْبِيرَ فِي الصَّلاَةِ، فَرَفَعَ يَدَيْهِ حِينَ يُكَبِّرُ حَتَّى يَجْعَلَهُمَا حَذْوَ مَنْكِبَيْهِ، وَإِذَا كَبَّرَ لِلرُّكُوعِ فَعَلَ مِثْلَهُ، وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَعَلَ مِثْلَهُ وَقَالَ ‏ \"‏ رَبَّنَا وَلَكَ الْحَمْدُ ‏\"‏‏.‏ وَلاَ يَفْعَلُ ذَلِكَ حِينَ يَسْجُدُ وَلاَ حِينَ يَرْفَعُ رَأْسَهُ مِنَ السُّجُودِ‏.‏",
                "headingArabic": "إِلَى أَيْنَ يَرْفَعُ يَدَيْهِ",
                "headingUrdu": "کس سطح پر ہاتھ اٹھانا چاہیے؟",
                "headingEnglish": "To what level should one raise one's hand.",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 719,
                "hadithNumber": "739",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "Whenever Ibn `Umar started the prayer with Takbir, he used to raise his hands: whenever he bowed, he used to raise his hands (before bowing) and also used to raise his hands on saying, \"Sami`a l-lahu liman hamidah\", and he used to do the same on rising from the second rak`a (for the 3rd rak`a). Ibn `Umar said: \"The Prophet (ﷺ) used to do the same.\"",
                "hadithUrdu": "عبداللہ بن عمر رضی اللہ عنہما جب نماز میں داخل ہوتے تو پہلے تکبیر تحریمہ کہتے اور ساتھ ہی رفع یدین کرتے ۔ اسی طرح جب وہ رکوع کرتے تب اور جب «سمع الله لمن حمده» کہتے تب بھی ( رفع یدین کرتے ) دونوں ہاتھوں کو اٹھاتے اور جب قعدہ اولیٰ سے اٹھتے تب بھی رفع یدین کرتے ۔ آپ نے اس فعل کو نبی کریم صلی اللہ علیہ وسلم تک پہنچایا ۔ ( کہ آنحضرت صلی اللہ علیہ وسلم اسی طرح نماز پڑھا کرتے تھے ۔ )",
                "urduNarrator": "ہم سے عیاش بن ولید نے بیان کیا ، کہا کہ ہم سے عبدالاعلیٰ بن عبدالاعلی نے بیان کیا ، کہا کہ ہم سے عبیداللہ عمری نے نافع سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَيَّاشٌ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ إِذَا دَخَلَ فِي الصَّلاَةِ كَبَّرَ وَرَفَعَ يَدَيْهِ، وَإِذَا رَكَعَ رَفَعَ يَدَيْهِ، وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ رَفَعَ يَدَيْهِ، وَإِذَا قَامَ مِنَ الرَّكْعَتَيْنِ رَفَعَ يَدَيْهِ‏.‏ وَرَفَعَ ذَلِكَ ابْنُ عُمَرَ إِلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم‏.‏ رَوَاهُ حَمَّادُ بْنُ سَلَمَةَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَرَوَاهُ ابْنُ طَهْمَانَ عَنْ أَيُّوبَ وَمُوسَى بْنِ عُقْبَةَ مُخْتَصَرًا‏.‏",
                "headingArabic": "رَفْعِ الْيَدَيْنِ إِذَا قَامَ مِنَ الرَّكْعَتَيْنِ",
                "headingUrdu": "دوسری رکعت ختم کرنے کے بعد ہاتھ اٹھانا (تیسری رکعت کے لیے کھڑے ہونے پر)",
                "headingEnglish": "To raise one's hands after finishing the second Rak'a (on standing for the third Rak'a)",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 720,
                "hadithNumber": "740",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "The people were ordered to place the right hand on the left forearm in the prayer. Abu Hazim said, \"I knew that the order was from the Prophet (ﷺ) .\"\r\nIsmail said: This  statement is 'ascribed to' and did not say: \"Sahl ascribed this statment \".",
                "hadithUrdu": "لوگوں کو حکم دیا جاتا تھا کہ نماز میں دایاں ہاتھ بائیں کلائی پر رکھیں ، ابوحازم بن دینار نے بیان کیا کہ مجھے اچھی طرح یاد ہے کہ آپ اسے رسول اللہ صلی اللہ علیہ وسلم تک پہنچاتے تھے ۔\r\n اسماعیل بن ابی اویس نے کہا کہ یہ بات آنحضرت صلی اللہ علیہ وسلم تک پہنچائی جاتی تھی یوں نہیں کہا کہ پہنچاتے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا امام مالک رحمہ اللہ سے ، انہوں نے ابوحازم بن دینار سے ، انہوں نے سہل بن سعد رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ كَانَ النَّاسُ يُؤْمَرُونَ أَنْ يَضَعَ الرَّجُلُ الْيَدَ الْيُمْنَى عَلَى ذِرَاعِهِ الْيُسْرَى فِي الصَّلاَةِ‏.‏ قَالَ أَبُو حَازِمٍ لاَ أَعْلَمُهُ إِلاَّ يَنْمِي ذَلِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم‏.‏ قَالَ إِسْمَاعِيلُ يُنْمَى ذَلِكَ‏.‏ وَلَمْ يَقُلْ يَنْمِي‏.‏",
                "headingArabic": "وَضْعِ الْيُمْنَى عَلَى الْيُسْرَى",
                "headingUrdu": "دائیں ہاتھ کو بائیں طرف رکھنا [نماز میں]",
                "headingEnglish": "To place the right hand on the left [in As-Salt (the prayers)]",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 721,
                "hadithNumber": "741",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"You see me facing the Qibla; but, by Allah, nothing is hidden from me regarding your bowing and submissiveness and I see you from behind my back.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ، کیا تم سمجھتے ہو کہ میرا منہ ادھر ( قبلہ کی طرف ) ہے ۔ خدا کی قسم تمہارا رکوع اور تمہارا خشوع مجھ سے کچھ چھپا ہوا نہیں ہے ، میں تمہیں اپنے پیچھے سے بھی دیکھتا رہتا ہوں ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک رحمہ اللہ نے ابوالزناد سے بیان کیا ، انھوں نے اعرج سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ هَلْ تَرَوْنَ قِبْلَتِي هَا هُنَا وَاللَّهِ مَا يَخْفَى عَلَىَّ رُكُوعُكُمْ وَلاَ خُشُوعُكُمْ، وَإِنِّي لأَرَاكُمْ وَرَاءَ ظَهْرِي ‏\"‏‏.‏",
                "headingArabic": "الْخُشُوعِ فِي الصَّلاَةِ",
                "headingUrdu": "نماز میں تواضع",
                "headingEnglish": "Submissiveness in As-Salat (the prayer)",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 722,
                "hadithNumber": "742",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Perform the bowing and the prostrations properly. By Allah, I see you from behind me (or from behind my back) when you bow or prostrate.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا رکوع اور سجود پوری طرح کیا کرو ۔ خدا کی قسم ! میں تمہیں اپنے پیچھے سے بھی دیکھتا رہتا ہوں یا اس طرح کہا کہ پیٹھ پیچھے سے جب تم رکوع کرتے ہو اور سجدہ کرتے ہو ( تو میں تمہیں دیکھتا ہوں ) ۔",
                "urduNarrator": "ہم سے محمد بشار نے بیان کیا ، انھوں نے کہا کہ ہم سے غندر نے بیان کیا ، انھوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ میں نے قتادہ سے سنا ، وہ انس بن مالک رضی اللہ عنہ سے بیان کرتے تھے اور وہ نبی کریم صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَقِيمُوا الرُّكُوعَ وَالسُّجُودَ، فَوَاللَّهِ إِنِّي لأَرَاكُمْ مِنْ بَعْدِي ـ وَرُبَّمَا قَالَ مِنْ بَعْدِ ظَهْرِي ـ إِذَا رَكَعْتُمْ وَسَجَدْتُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 723,
                "hadithNumber": "743",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet, Abu Bakr and `Umar used to start the prayer with \"Al hamdu li l-lahi Rabbi l-`alamin (All praise is but to Allah, Lord of the Worlds).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم اور ابوبکر اور عمر رضی اللہ عنہما نماز «الحمد لله رب العالمين‏» سے شروع کرتے تھے ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، انھوں نے کہا کہ ہم سے شعبہ نے قتادہ رضی اللہ عنہ کے واسطے سے بیان کیا ، انھوں نے حضرت انس رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ ـ رضى الله عنهما ـ كَانُوا يَفْتَتِحُونَ الصَّلاَةَ بِ ـ ‏{‏الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏",
                "headingArabic": "مَا يَقُولُ بَعْدَ التَّكْبِيرِ",
                "headingUrdu": "تکبیر کے بعد کیا کہا جائے؟",
                "headingEnglish": "What to say after the Takbir",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 724,
                "hadithNumber": "744",
                "englishNarrator": "Narrated Abu Huraira  رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to keep silent between the Takbir and the recitation of Qur'an and that interval of silence used to be a short one. I said to the Prophet (ﷺ) \"May my parents be sacrificed for you! What do you say in the pause between Takbir and recitation?\" The Prophet (ﷺ) said, \"I say, 'Allahumma, baa`id baini wa baina khatayaya kama baa`adta baina l-mashriqi wa l-maghrib. Allahumma, naqqini min khatayaya kama yunaqqa th-thawbu l-abyadu mina d-danas. Allahumma, ighsil khatayaya bi l-maa'i wa th-thalji wa l-barad (O Allah! Set me apart from my sins (faults) as the East and West are set apart from each other and clean me from sins as a white garment is cleaned of dirt (after thorough washing). O Allah! Wash off my sins with water, snow and hail.)\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم تکبیر تحریمہ اور قرآت کے درمیان تھوڑی دیر چپ رہتے تھے ۔ ابوزرعہ نے کہا میں سمجھتا ہوں ابوہریرہ رضی اللہ عنہ نے یوں کہا یا رسول اللہ ! آپ پر میرے ماں باپ فدا ہوں ۔ آپ اس تکبیر اور قرآت کے درمیان کی خاموشی کے بیچ میں کیا پڑھتے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں پڑھتا ہوں «اللهم باعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب ،‏‏‏‏ ‏‏‏‏ اللهم نقني من الخطايا كما ينقى الثوب الأبيض من الدنس ،‏‏‏‏ ‏‏‏‏ اللهم اغسل خطاياى بالماء والثلج والبرد» اے اللہ ! میرے اور میرے گناہوں کے درمیان اتنی دوری کر جتنی مشرق اور مغرب میں ہے ۔ اے اللہ ! مجھے گناہوں سے اس طرح پاک کر جیسے سفید کپڑا میل سے پاک ہوتا ہے ۔ اے اللہ ! میرے گناہوں کو پانی ، برف اور اولے سے دھو ڈال ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انھوں نے کہا کہ ہم سے عبدالواحد بن زیاد نے بیان کیا ، انھوں نے کہا کہ ہم سے عمارہ بن قعقاع نے بیان کیا ، انھوں نے کہا کہ ہم سے ابوزرعہ نے بیان کیا ، انھوں نے کہا کہ ہم سے ابوہریرہ رضی اللہ عنہ نے بیان کیا ، انھوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، قَالَ حَدَّثَنَا عُمَارَةُ بْنُ الْقَعْقَاعِ، قَالَ حَدَّثَنَا أَبُو زُرْعَةَ، قَالَ حَدَّثَنَا أَبُو هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَسْكُتُ بَيْنَ التَّكْبِيرِ وَبَيْنَ الْقِرَاءَةِ إِسْكَاتَةً ـ قَالَ أَحْسِبُهُ قَالَ هُنَيَّةً ـ فَقُلْتُ بِأَبِي وَأُمِّي يَا رَسُولَ اللَّهِ، إِسْكَاتُكَ بَيْنَ التَّكْبِيرِ وَالْقِرَاءَةِ مَا تَقُولُ قَالَ ‏ \"‏ أَقُولُ اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنَ الْخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْ خَطَايَاىَ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 725,
                "hadithNumber": "745",
                "englishNarrator": "Narrated Asma' bint Abi Bakr:",
                "hadithEnglish": "The Prophet (ﷺ) once offered the eclipse prayer. He stood for a long time and then did a prolonged bowing. He stood up straight again and kept on standing for a long time, then bowed a long bowing and then stood up straight and then prostrated a prolonged prostration and then lifted his head and prostrated a prolonged prostration. And then he stood up for a long time and then did a prolonged bowing and then stood up straight again and kept on standing for a long time. Then he bowed a long bowing and then stood up straight and then prostrated a prolonged prostration and then lifted his head and went for a prolonged prostration. On completion o the prayer, he said, \"Paradise became s near to me that if I had dared, I would have plucked one of its bunches for you and Hell became so near to me that said, 'O my Lord will I be among those people?' Then suddenly I saw a woman and a cat was lacerating her with it claws. On inquiring, it was said that the woman had imprisoned the cat till it died of starvation and she neither fed it no freed it so that it could feed itself.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے سورج گہن کی نماز پڑھی ۔ آپ صلی اللہ علیہ وسلم جب کھڑے ہوئے تو دیر تک کھڑے رہے پھر رکوع میں گئے تو دیر تک رکوع میں رہے ۔ پھر رکوع سے سر اٹھایا تو دیر تک کھڑے ہی رہے ۔ پھر ( دوبارہ ) رکوع میں گئے اور دیر تک رکوع کی حالت میں رہے اور پھر سر اٹھایا ، پھر سجدہ کیا اور دیر تک سجدہ میں رہے ۔ پھر سر اٹھایا اور پھر سجدہ کیا اور دیر تک سجدہ میں رہے پھر کھڑے ہوئے اور دیر تک کھڑے ہی رہے ۔ پھر رکوع کیا اور دیر تک رکوع میں رہے ۔ پھر آپ صلی اللہ علیہ وسلم نے سر اٹھایا اور دیر تک کھڑے رہے ۔ پھر ( دوبارہ ) رکوع کیا اور آپ صلی اللہ علیہ وسلم دیر تک رکوع کی حالت میں رہے ۔ پھر سر اٹھایا ۔ پھر آپ صلی اللہ علیہ وسلم سجدہ میں چلے گئے اور دیر تک سجدہ میں رہے ۔ جب نماز سے فارغ ہوئے تو فرمایا کہ جنت مجھ سے اتنی نزدیک ہو گئی تھی کہ اگر میں چاہتا تو اس کے خوشوں میں سے کوئی خوشہ تم کو توڑ کر لا دیتا اور مجھ سے دوزخ بھی اتنی قریب ہو گئی تھی کہ میں بول پڑا کہ میرے مالک میں تو اس میں سے نہیں ہوں ؟ میں نے وہاں ایک عورت کو دیکھا ۔ نافع بیان کرتے ہیں کہ مجھے خیال ہے کہ ابن ابی ملیکہ نے بتلایا کہ اس عورت کو ایک بلی نوچ رہی تھی ، میں نے پوچھا کہ اس کی کیا وجہ ہے ؟ جواب ملا کہ اس عورت نے اس بلی کو باندھے رکھا تھا تاآنکہ بھوک کی وجہ سے وہ مر گئی ، نہ تو اس نے اسے کھانا دیا اور نہ چھوڑا کہ وہ خود کہیں سے کھا لیتی ۔ نافع نے بیان کیا کہ میرا خیال ہے کہ ابن ابی ملیکہ نے یوں کہا کہ نہ چھوڑا کہ وہ زمین کے کیڑے وغیرہ کھا لیتی ۔",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا کہ ہمیں نافع بن عمر نے خبر دی ، کہا کہ مجھ سے ابن ابی ملیکہ نے اسماء بنت ابی بکر سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، قَالَ أَخْبَرَنَا نَافِعُ بْنُ عُمَرَ، قَالَ حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى صَلاَةَ الْكُسُوفِ، فَقَامَ فَأَطَالَ الْقِيَامَ، ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ، ثُمَّ قَامَ فَأَطَالَ الْقِيَامَ، ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ، ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ، ثُمَّ رَفَعَ، ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ، ثُمَّ قَامَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ فَسَجَدَ فَأَطَالَ السُّجُودَ، ثُمَّ رَفَعَ، ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ ثُمَّ انْصَرَفَ فَقَالَ ‏\"‏ قَدْ دَنَتْ مِنِّي الْجَنَّةُ حَتَّى لَوِ اجْتَرَأْتُ عَلَيْهَا لَجِئْتُكُمْ بِقِطَافٍ مِنْ قِطَافِهَا، وَدَنَتْ مِنِّي النَّارُ حَتَّى قُلْتُ أَىْ رَبِّ وَأَنَا مَعَهُمْ فَإِذَا امْرَأَةٌ ـ حَسِبْتُ أَنَّهُ قَالَ ـ تَخْدِشُهَا هِرَّةٌ قُلْتُ مَا شَأْنُ هَذِهِ قَالُوا حَبَسَتْهَا حَتَّى مَاتَتْ جُوعًا، لاَ أَطْعَمَتْهَا، وَلاَ أَرْسَلَتْهَا تَأْكُلُ ‏\"‏‏.‏ قَالَ نَافِعٌ حَسِبْتُ أَنَّهُ قَالَ ‏\"‏ مِنْ خَشِيشِ أَوْ خُشَاشِ الأَرْضِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 701,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=28",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=26",
                "label": "26",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=27",
                "label": "27",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=28",
                "label": "28",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=29",
                "label": "29",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=30",
                "label": "30",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=31",
                "label": "31",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=32",
                "label": "32",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=30",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=30",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=28",
        "to": 725,
        "total": 40465
    }
}