{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 209,
        "data": [
            {
                "id": 5203,
                "hadithNumber": "5438",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) did not do that (i.e., forbade the storage of the meat of sacrifices for three days) except (he did so) so that the rich would feed the poor. But later we used to keep even trotters to cook, fifteen days later. The family of Muhammad did not eat wheat bread with meat or soup to their satisfaction for three successive days.",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے ایسا کبھی نہیں کیا کہ تین دن سے زیادہ گوشت قربانی والا رکھنے سے منع فرمایا ہو ۔ صرف اس سال یہ حکم دیا تھا جس سال قحط کی وجہ سے لوگ فاقے میں مبتلا تھے ۔ مقصد یہ تھا کہ جو لوگ غنی ہیں وہ گوشت محتاجوں کو کھلائیں ( اور جمع کر کے نہ رکھیں ) اور ہم تو بکری کے پائے محفوظ کر کے رکھ لیتے تھے اور پندرہ دن بعد تک ( کھاتے تھے ) اور آل محمد صلی اللہ علیہ وسلم نے کبھی سالن کے ساتھ گیہوں کی روٹی تین دن تک برابر سیر ہو کر نہیں کھائی ۔",
                "urduNarrator": "ہم سے قبیصہ نے بیان کیا ، ان سے سفیان نے بیان کیا ، ان سے عبدالرحمٰن بن عابس نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا فَعَلَهُ إِلاَّ فِي عَامٍ جَاعَ النَّاسُ، أَرَادَ أَنْ يُطْعِمَ الْغَنِيُّ الْفَقِيرَ، وَإِنْ كُنَّا لَنَرْفَعُ الْكُرَاعَ بَعْدَ خَمْسَ عَشْرَةَ، وَمَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مَنْ خُبْزِ بُرٍّ مَأْدُومٍ ثَلاَثًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5204,
                "hadithNumber": "5439",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "A tailor invited Allah's Messenger (ﷺ) to a meal which he had prepared. I went with Allah's Messenger (ﷺ) to that meal, and the tailor served the Prophet (ﷺ) with barley bread and soup of gourd and cured meat. I saw Allah's Messenger (ﷺ) picking the pieces of gourd from around the dish, and since then I have kept on liking gourd.",
                "hadithUrdu": "ایک درزی نے رسول اللہ صلی اللہ علیہ وسلم کو کھانے کی دعوت دی جو اس نے آنحضرت صلی اللہ علیہ وسلم کے لیے تیار کیا تھا ۔ حضرت انس رضی اللہ عنہ نے بیان کیا کہ میں بھی حضور اکرم صلی اللہ علیہ وسلم کے ساتھ اس دعوت میں گیا ۔ انہوں نے آپ کی خدمت میں جو کی روٹی اور شوربہ ، جس میں کدو اور خشک کیا ہوا گوشت تھا ، پیش کیا ۔ حضرت انس رضی اللہ عنہ نے کہا کہ میں نے دیکھا کہ حضور اکرم صلی اللہ علیہ وسلم پیالہ میں چاروں طرف کدو تلاش کر رہے ہیں ۔ اسی دن سے میں بھی کدو پسند کرنے لگا ۔ شمامہ نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے کہ پھر میں آنحضرت صلی اللہ علیہ وسلم کے سامنے کدو کے قتلے ( تلاش کر کر کے ) اکٹھے کرنے لگا ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ إِنَّ خَيَّاطًا دَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ صَنَعَهُ ـ قَالَ أَنَسٌ ـ فَذَهَبْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى ذَلِكَ الطَّعَامِ، فَقَرَّبَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم خُبْزًا مِنْ شَعِيرٍ وَمَرَقًا فِيهِ دُبَّاءٌ وَقَدِيدٌ ـ قَالَ أَنَسٌ ـ فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوْلِ الصَّحْفَةِ، فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ مِنْ يَوْمِئِذٍ‏.‏ وَقَالَ ثُمَامَةُ عَنْ أَنَسٍ، فَجَعَلْتُ أَجْمَعُ الدُّبَّاءَ بَيْنَ يَدَيْهِ‏.‏",
                "headingArabic": "مَنْ نَاوَلَ أَوْ قَدَّمَ إِلَى صَاحِبِهِ عَلَى الْمَائِدَةِ شَيْئًا",
                "headingUrdu": "کھانے کی میز کے پار ساتھی کو کچھ پیش کرنا۔",
                "headingEnglish": "To present something to the companion across the dining table.",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5205,
                "hadithNumber": "5440",
                "englishNarrator": "Narrated `Abdullah bin Ja`far bin Abi Talib رضی اللہ عنہما :",
                "hadithEnglish": "I saw Allah's Messenger (ﷺ) eating fresh dates with snake cucumber.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کو تازہ کھجورککڑی کے ساتھ کھاتے دیکھا ہے ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والد نے اور ان سے عبداللہ بن جعفر بن ابی طالب رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرِ بْنِ أَبِي طَالِبٍ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَأْكُلُ الرُّطَبَ بِالْقِثَّاءِ‏.‏",
                "headingArabic": "الرُّطَبِ بِالْقِثَّاءِ",
                "headingUrdu": "ککڑی کے ساتھ تازہ کھجور",
                "headingEnglish": "Fresh dates along with the cucumber",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5206,
                "hadithNumber": "5441",
                "englishNarrator": "Narrated Abu `Uthman:",
                "hadithEnglish": "I was a guest of Abu Huraira رضی اللہ عنہ for seven days. Abu Huraira رضی اللہ عنہ , his wife and his slave used to get up and remain awake for one-third of the night by turns. Each would offer the night prayer and then awaken the other. I heard Abu Huraira رضی اللہ عنہ saying, \"Allah's Messenger (ﷺ) distributed dates among his companions and my share was seven dates, one of which was a Hashafa (a date which dried on the tree before it was fully ripe).\r\n Abu Huraira رضی اللہ عنہ : The Prophet (ﷺ) distributed dates among us, and my share was five dates, four of which were good, and one was a ,Hashafa, and I found the Hashafa the hardest for my teeth.",
                "hadithUrdu": "میں حضرت ابوہریرہ رضی اللہ عنہ کے یہاں سات دن تک مہمان رہا ، وہ اور ان کی بیوی اور ان کے خادم نے رات میں ( جاگنے کی ) باری مقرر کر رکھی تھی ۔ رات کے ایک تہائی حصہ میں ایک صاحب نماز پڑھتے رہے پھر وہ دوسرے کوجگا دیتے اور میں نے حضرت ابوہریرہ رضی اللہ عنہ کو یہ کہتے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے صحابہ میں ایک مرتبہ کھجور تقسیم کی اور مجھے بھی سات کھجوریں دیں ، ایک ان میں خراب تھی ۔\r\nہم سے محمد بن صباح نے بیان کیا ، انہوں نے کہا ہم سے اسماعیل بن زکریا نے بیان کیا ، ان سے عاصم نے ، ان سے ابوعثمان نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ہم میں کھجور تقسیم کی پانچ مجھے عنایت فرمائیں چار تو اچھی کھجوریں تھیں اور ایک خراب تھی جو میرے دانتوں کے لیے سب سے زیادہ سخت تھی ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے حماد بن یزید نے بیان کیا ، ان سے عباس جریری نے اور ان سے ابوعثمان نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، عَنْ عَبَّاسٍ الْجُرَيْرِيِّ ، عَنْ أَبِي عُثْمَانَ ، قَالَ : تَضَيَّفْتُ أَبَا هُرَيْرَةَ سَبْعًا فَكَانَ هُوَ وَامْرَأَتُهُ وَخَادِمُهُ يَعْتَقِبُونَ اللَّيْلَ أَثْلَاثًا ، يُصَلِّي هَذَا ثُمَّ يُوقِظُ هَذَا ، وَسَمِعْتُهُ يَقُولُ : قَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَصْحَابهِ تَمْرًا ، فَأَصَابَنِي سَبْعُ تَمَرَاتٍ إِحْدَاهُنَّ حَشَفَةٌ. \r\nحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَسَمَ النَّبِيُّ صلى الله عليه وسلم بَيْنَنَا تَمْرًا فَأَصَابَنِي مِنْهُ خَمْسٌ أَرْبَعُ تَمَرَاتٍ وَحَشَفَةٌ، ثُمَّ رَأَيْتُ الْحَشَفَةَ هِيَ أَشَدُّهُنَّ لِضِرْسِي‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5207,
                "hadithNumber": "5442",
                "englishNarrator": "Narrated Aishah رضی اللہ عنہا :",
                "hadithEnglish": "\"When Allah's Messenger (ﷺ) died, we had been satisfied by the two black things, i.e., dates and water.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی وفات ہو گئی اور ہم پانی اور کھجور ہی سے ( اکثر دنوں میں ) پیٹ بھرتے رہے ۔",
                "urduNarrator": "اورمحمد بن یوسف نے بیان کیا ، ان سے سفیان نے بیان کیا ، ان سے منصور ابن صفیہ نے ، ان سے ان کی والدہ نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ، عَنْ مَنْصُورِ ابْنِ صَفِيَّةَ، حَدَّثَتْنِي أُمِّي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ شَبِعْنَا مِنَ الأَسْوَدَيْنِ التَّمْرِ وَالْمَاءِ‏.‏",
                "headingArabic": "الرُّطَبِ وَالتَّمْرِ",
                "headingUrdu": "تازہ کھجوریں اور خشک کھجوریں۔",
                "headingEnglish": "Fresh dates and dry dates",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5208,
                "hadithNumber": "5443",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "There was a Jew in Medina who used to lend me money up to the season of plucking dates. (Jabir رضی اللہ عنہ had a piece of land which was on the way to Ruma). That year the land was not promising, so the payment of the debt was delayed one year. The Jew came to me at the time of plucking, but gathered nothing from my land. I asked him to give me one year respite, but he refused. This news reached the Prophet (ﷺ) whereupon he said to his companions, \"Let us go and ask the Jew for respite for Jabir رضی اللہ عنہ .\" All of them came to me in my garden, and the Prophet (ﷺ) started speaking to the Jew, but he Jew said, \"O Abu Qasim! I will not grant him respite.\" When the Prophet (ﷺ) saw the Jew's attitude, he stood up and walked all around the garden and came again and talked to the Jew, but the Jew refused his request. I got up and brought some ripe fresh dates and put it in front of the Prophet. He ate and then said to me, \"Where is your hut, O Jabir?\" I informed him, and he said, \"Spread out a bed for me in it.\" I spread out a bed, and he entered and slept. When he woke up, I brought some dates to him again and he ate of it and then got up and talked to the Jew again, but the Jew again refused his request. Then the Prophet (ﷺ) got up for the second time amidst the palm trees loaded with fresh dates, and said, \"O Jabir! Pluck dates to repay your debt.\" The Jew remained with me while I was plucking the dates, till I paid him all his right, yet there remained extra quantity of dates. So I went out and proceeded till I reached the Prophet and informed him of the good news, whereupon he said, \"I testify that I am Allah's Messenger (ﷺ).\"",
                "hadithUrdu": "مدینہ میں ایک یہودی تھا اور وہ مجھے قرض اس شرط پر دیا کرتا تھا کہ میری کھجوریں تیار ہونے کے وقت لے لے گا ۔ حضرت جابر رضی اللہ عنہ کی ایک زمین بئررومہ کے راستہ میں تھی ۔ ایک سال کھجور کے باغ میں پھل نہیں آئے ۔ پھل چنے جانے کا جب وقت آیا تو وہ یہودی میرے پاس آیا لیکن میں نے تو باغ سے کچھ بھی نہیں توڑا تھا ۔ اس لیے میں آئندہ سال کے لیے مہلت مانگنے لگا لیکن اس نے مہلت دینے سے انکار کیا ۔ اس کی خبر جب رسول اللہ صلی اللہ علیہ وسلم کو دی گئی تو آپ نے اپنے صحابہ سے فرمایا کہ چلو ، یہودی سے جابر رضی اللہ عنہ کے لیے ہم مہلت مانگیں گے ۔ چنانچہ یہ سب میرے باغ میں تشریف لائے ۔ آنحضرت صلی اللہ علیہ وسلم اس یہودی سے گفتگو فرماتے رہے لیکن وہ یہی کہتا رہا کہ ابوالقاسم میں مہلت نہیں دے سکتا ۔ جب آنحضرت صلی اللہ علیہ وسلم نے یہ دیکھا تو آپ کھڑے ہو گئے اورکھجور کے باغ میں چاروں طرف پھرے پھر تشریف لائے اور اس سے گفتگو کی لیکن اس نے اب بھی انکار کیا پھر میں کھڑا ہوا اور تھوڑی سی تازہ کھجور لا کر آنحضرت صلی اللہ علیہ وسلم کے سامنے رکھی ۔ آنحضرت صلی اللہ علیہ وسلم نے ان کو تناول فرمایا پھر فرمایا جابر ! تمہاری جھونپڑی کہاں ہے ؟ میں نے آپ کو بتایا تو آپ نے فرمایا کہ اس میں میرے لیے کچھ فرش بچھا دو ۔ میں نے بچھا دیا تو آپ داخل ہوئے اور آرام فرمایا پھر بیدار ہوئے تو میں ایک مٹھی اورکھجور لایا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس میں سے بھی تناول فرمایا پھر آپ کھڑے ہوئے اور یہودی سے گفتگو فرمائی ۔ اس نے اب بھی انکار کیا ۔ آنحضرت صلی اللہ علیہ وسلم دوبارہ باغ میں کھڑے ہوئے پھر فرمایا ، جابر ! جاؤ اب پھل توڑو اور قرض ادا کر دو ۔ آپ کھجوروں کے توڑے جانے کی جگہ کھڑے ہو گئے اور میں نے باغ میں سے اتنی کھجوریں توڑ لیں جن سے میں نے قرض ادا کر دیا اور اس میں سے کھجوریں بچ بھی گئی پھر میں وہاں سے نکلا اورحضور اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر یہ خوشخبری سنائی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا میں گواہی دیتا ہوں کہ میں اللہ کا رسول ہوں ۔",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابو غسان نے بیان کیا ، کہا کہ مجھ سے ابوحازم نے بیان کیا ، ان سے ابراہیم بن عبدالرحمٰن بن عبداللہ بن ابی ربیعہ نے اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي رَبِيعَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، رضى الله عنهما قَالَ كَانَ بِالْمَدِينَةِ يَهُودِيٌّ وَكَانَ يُسْلِفُنِي فِي تَمْرِي إِلَى الْجِدَادِ، وَكَانَتْ لِجَابِرٍ الأَرْضُ الَّتِي بِطَرِيقِ رُومَةَ فَجَلَسَتْ، فَخَلاَ عَامًا فَجَاءَنِي الْيَهُودِيُّ عِنْدَ الْجَدَادِ، وَلَمْ أَجُدَّ مِنْهَا شَيْئًا، فَجَعَلْتُ أَسْتَنْظِرُهُ إِلَى قَابِلٍ فَيَأْبَى، فَأُخْبِرَ بِذَلِكَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ لأَصْحَابِهِ ‏\"‏ امْشُوا نَسْتَنْظِرْ لِجَابِرٍ مِنَ الْيَهُودِيِّ ‏\"‏‏.‏ فَجَاءُونِي فِي نَخْلِي فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يُكَلِّمُ الْيَهُودِيَّ فَيَقُولُ أَبَا الْقَاسِمِ لاَ أُنْظِرُهُ‏.‏ فَلَمَّا رَأَى النَّبِيُّ صلى الله عليه وسلم قَامَ فَطَافَ فِي النَّخْلِ، ثُمَّ جَاءَهُ فَكَلَّمَهُ فَأَبَى فَقُمْتُ فَجِئْتُ بِقَلِيلِ رُطَبٍ فَوَضَعْتُهُ بَيْنَ يَدَىِ النَّبِيِّ صلى الله عليه وسلم فَأَكَلَ ثُمَّ قَالَ ‏\"‏ أَيْنَ عَرِيشُكَ يَا جَابِرُ ‏\"‏‏.‏ فَأَخْبَرْتُهُ فَقَالَ ‏\"‏ افْرُشْ لِي فِيهِ ‏\"‏‏.‏ فَفَرَشْتُهُ فَدَخَلَ فَرَقَدَ، ثُمَّ اسْتَيْقَظَ فَجِئْتُهُ بِقَبْضَةٍ أُخْرَى فَأَكَلَ مِنْهَا، ثُمَّ قَامَ فَكَلَّمَ الْيَهُودِيَّ فَأَبَى عَلَيْهِ فَقَامَ فِي الرِّطَابِ فِي النَّخْلِ الثَّانِيَةَ ثُمَّ قَالَ ‏\"‏ يَا جَابِرُ جُدَّ وَاقْضِ ‏\"‏‏.‏ فَوَقَفَ فِي الْجَدَادِ فَجَدَدْتُ مِنْهَا مَا قَضَيْتُهُ وَفَضَلَ مِنْهُ فَخَرَجْتُ حَتَّى جِئْتُ النَّبِيَّ صلى الله عليه وسلم فَبَشَّرْتُهُ فَقَالَ ‏\"‏ أَشْهَدُ أَنِّي رَسُولُ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5209,
                "hadithNumber": "5444",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "While we were sitting with the Prophet, fresh dates were brought to him. The Prophet (ﷺ) said, \"There is a tree among the trees which is as blessed as a Muslim\" I thought that it was the date palm tree and intended to say, \"It is the date-palm tree, O Allah's Messenger (ﷺ)!\" but I looked behind to see that I was the tenth and youngest of ten men present there, so I kept quiet' Then the Prophet (ﷺ) said, \"It is the datepalm tree.\"",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بیٹھے ہوئے تھے کہ کھجور کے درخت کا گابھہ لایا گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا بعض درخت ایسے ہوتے ہیں جن کی برکت مسلمان کی برکت کی طرح ہوتی ہے ۔ میں نے خیال کیا کہ آپ کا اشارہ کھجور کے درخت کی طرف ہے ۔ میں نے سوچا کہ کہہ دوں کہ وہ درخت کھجور کا ہوتا ہے یا رسول اللہ ! لیکن پھر جو میں نے مڑ کر دیکھا تو مجلس میں میرے علاوہ نو آدمی اور تھے اور میں ان میں سب سے چھوٹا تھا ۔ اس لیے میں خاموش رہا پھر آپ نے فرمایا کہ وہ درخت کھجور کا ہے ۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، ان سے اعمش نے بیان کیا ، کہا کہ مجھ سے مجاہد نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي مُجَاهِدٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ بَيْنَا نَحْنُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم جُلُوسٌ إِذْ أُتِيَ بِجُمَّارِ نَخْلَةٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنَ الشَّجَرِ لَمَا بَرَكَتُهُ كَبَرَكَةِ الْمُسْلِمِ ‏\"‏‏.‏ فَظَنَنْتُ أَنَّهُ يَعْنِي النَّخْلَةَ، فَأَرَدْتُ أَنْ أَقُولَ هِيَ النَّخْلَةُ يَا رَسُولَ اللَّهِ‏.‏ ثُمَّ الْتَفَتُّ فَإِذَا أَنَا عَاشِرُ عَشَرَةٍ أَنَا أَحْدَثُهُمْ فَسَكَتُّ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5210,
                "hadithNumber": "5445",
                "englishNarrator": "Narrated Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"He who eats seven 'Ajwa dates every morning, will not be affected by poison or magic on the day he eats them.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے ہر دن صبح کے وقت سات عجوہ کھجوریں کھالیں ، اسے اس دن نہ زہر نقصان پہنچا سکے گا اور نہ جادو ۔",
                "urduNarrator": "ہم سے جمعہ بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے مروان نے بیان کیا ، انہوں نے کہا ہم کو ہاشم بن ہاشم نے خبر دی ، انہوں نے کہا ہم کو عامر بن سعد نے خبر دی اور ان سے ان کے والد سعد بن ابی وقاص رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا جُمْعَةُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَرْوَانُ، أَخْبَرَنَا هَاشِمُ بْنُ هَاشِمٍ، أَخْبَرَنَا عَامِرُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ تَصَبَّحَ كُلَّ يَوْمٍ سَبْعَ تَمَرَاتٍ عَجْوَةً لَمْ يَضُرُّهُ فِي ذَلِكَ الْيَوْمِ سُمٌّ وَلاَ سِحْرٌ ‏\"‏‏.‏",
                "headingArabic": "الْعَجْوَةِ",
                "headingUrdu": "العجوہ (ایک خاص قسم کی  کھجور)۔",
                "headingEnglish": "Al-'Ajwa (a special kind of date).",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5211,
                "hadithNumber": "5446",
                "englishNarrator": "Narrated Jabala bin Suhaim.:",
                "hadithEnglish": "At the time of Ibn Az-Zubair رضی اللہ عنہما , we were struck with famine, and he provided us with dates for our food. `Abdullah bin `Umar used to pass by us while we were eating, and say, \"Do not eat two dates together at a time, for the Prophet (ﷺ) forbade the taking of two dates together at a time (in a gathering).\" Ibn `Umar رضی اللہ عنہما used to add, \"Unless one takes the permission of one's companions.\" Shobah narrates: ''permission'' is said by Hadrat Ibn-e-Umer رضی اللہ عنہما .",
                "hadithUrdu": "ہمیں عبداللہ بن زبیر رضی اللہ عنہما کے ساتھ ( جب وہ حجاز کے خلیفہ تھے ) ایک سال قحط کا سامنا کرنا پڑا تو انہوں نے راشن میں ہمیں کھانے کے لیے کھجوریں دیں ۔ عبداللہ بن عمر رضی اللہ عنہما ہمارے پاس سے گزرتے اور ہم کھجور کھاتے ہوتے تو وہ فرماتے کہ دو کھجور وں کو ایک ساتھ ملا کر نہ کھاؤ کیونکہ نبی کریم صلی اللہ علیہ وسلم نے دو کھجور وں کو ایک ساتھ ملا کر کھانے سے منع کیا ہے ، پھر فرمایا سوا اس صورت کے جب اس کو کھانے والا شخص اپنے ساتھی سے ( جو کھانے میں شریک ہے ) اس کی اجازت لے لے ۔ شعبہ نے بیان کیا کہ اجازت والاٹکڑا حضرت ابن عمر رضی اللہ عنہما کا قول ہے ۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے جبلہ بن سحیم نے بیان کیا ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا جَبَلَةُ بْنُ سُحَيْمٍ، قَالَ أَصَابَنَا عَامُ سَنَةٍ مَعَ ابْنِ الزُّبَيْرِ فَرَزَقَنَا تَمْرًا، فَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَمُرُّ بِنَا وَنَحْنُ نَأْكُلُ وَيَقُولُ لاَ تُقَارِنُوا فَإِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْقِرَانِ‏.‏ ثُمَّ يَقُولُ إِلاَّ أَنْ يَسْتَأْذِنَ الرَّجُلُ أَخَاهُ‏.‏ قَالَ شُعْبَةُ الإِذْنُ مِنْ قَوْلِ ابْنِ عُمَرَ‏.‏",
                "headingArabic": "الْقِرَانِ فِي التَّمْرِ",
                "headingUrdu": "ایک وقت میں دو کھجوریں کھانا",
                "headingEnglish": "To eat two dates at a time",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5212,
                "hadithNumber": "5447",
                "englishNarrator": "Narrated `Abdullah bin Ja`far رضی اللہ عنہ :",
                "hadithEnglish": "I saw the Prophet (ﷺ) eating fresh dates with snake cucumbers.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کو کھجور کو ککڑی کے ساتھ کھاتے ہوئے دیکھا ۔",
                "urduNarrator": "مجھ سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والد نے بیان کیا اور انہوں نے عبداللہ بن جعفر رضی اللہ عنہ ے سنا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ جَعْفَرٍ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَأْكُلُ الرُّطَبَ بِالْقِثَّاءِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5213,
                "hadithNumber": "5448",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"There is a tree among the trees which is similar to a Muslim (in goodness), and that is the date palm tree.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ درختوں میں ایک درخت مثل مسلمان کے ہے اور وہ کھجور کا درخت ہے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا ہم سے محمد بن طلحہ نے بیان کیا ، ان سے زبید نے بیان کیا ، ان سے مجاہد نے بیان کیا ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، عَنْ زُبَيْدٍ، عَنْ مُجَاهِدٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏مِنَ الشَّجَرِ شَجَرَةٌ تَكُونُ مِثْلَ الْمُسْلِمِ، وَهْىَ النَّخْلَةُ ‏\"‏‏.‏",
                "headingArabic": "بَرَكَةِ النَّخْلِ",
                "headingUrdu": "کھجور کے درخت کی خوبی",
                "headingEnglish": "The goodness of the date-palm tree.",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5214,
                "hadithNumber": "5449",
                "englishNarrator": "Narrated `Abdullah bin Ja`far رضی اللہ عنہما :",
                "hadithEnglish": "I saw Allah's Messenger (ﷺ) eating fresh dates with snake cucumbers.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو ککڑی کے ساتھ کھجور کھاتے ہوئے دیکھا ہے ۔",
                "urduNarrator": "ہم سے ابن مقاتل نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا ہم کو ابراہیم بن سعد نے خبر دی ، انہیں ان کے والد نے اور ان سے عبداللہ بن جعفر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ ـ رضى الله عنهما ـ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُ الرُّطَبَ بِالْقِثَّاءِ‏.‏",
                "headingArabic": "جَمْعِ اللَّوْنَيْنِ أَوِ الطَّعَامَيْنِ بِمَرَّةٍ",
                "headingUrdu": "ایک وقت میں دو قسم کے پھل یا خوراک لینا۔",
                "headingEnglish": "The taking of two kinds of fruit or food at a time.",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5215,
                "hadithNumber": "5450",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "My mother, Um Sulaim رضی اللہ عنہا , took a Mudd of barley grain, ground it and made porridge from it, and pressed (over it), a butter skin she had with her. Then she sent me to the Prophet, and I reached him while he was sitting with his companions. I invited him, whereupon he said, \"And those who are with me?' I returned and said, \"He says, 'And those who are with me?\" Abu Talha went out to him and said, \"O Allah's Messenger (ﷺ)! It is just a meal prepared by Um Sulaim.\" The Prophet (ﷺ) entered and the food was brought to him. He said, \"Let ten persons enter upon me.\" Those ten entered and ate their fill. Again he said, 'Let ten (more) enter upon me.\" Those ten entered and ate their fill. Then he said, \"Let ten (more) enter upon me.\" He called forty persons in all Then Allah's Messenger (ﷺ) ate and got up. I started looking (at the food) to see if it decreased or not.",
                "hadithUrdu": "ان کی والدہ ام سلیم رضی اللہ عنہا نے ایک مدجو لیا اور ان سے پیس کر اس کا خطیفہ ( آٹے کو دودھ میں ملا کر پکاتے ہیں ) پکایا اور ان کے پاس جو گھی کا ڈبہ تھا اس میں اس پر سے گھی نچوڑا ، پھر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ( بلانے کے لیے ) بھیجا ۔ میں آنحضرت صلی اللہ علیہ وسلم کی خدمت میں گیا تو آپ اپنے صحابہ کے ساتھ تشریف رکھتے تھے ۔ میں نے آپ کو کھانا کھانے کے لیے بلایا ۔ آپ نے دریافت فرمایا اور وہ لوگ بھی جو میرے ساتھ ہیں ؟ چنانچہ میں واپس آیا اور کہا کہ آنحضرت صلی اللہ علیہ وسلم تو فرماتے ہیں کہ جو میرے ساتھ موجود ہیں وہ بھی چلیں گے ۔ اس پر ابوطلحہ آپ کی خدمت میں حاضر ہوئے اور عرض کیا کہ یا رسول اللہ ! وہ تو ایک چیز ہے جو ام سلیم نے آپ کے لیے پکائی ہے ۔ آنحضرت صلی اللہ علیہ وسلم تشریف لائے اور کھانا آپ کے پاس لایا گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ دس آدمیوں کو میرے پاس اندر بلا لو ۔ چنانچہ دس صحابہ داخل ہوئے اور کھانا پیٹ بھر کر کھایا پھر فرمایا دس آدمیوں کو میرے پاس اور بلا لو ۔ یہ دس بھی اندر آئے اور پیٹ بھر کر کھایا پھر فرمایا اور دس آدمیوں کو بلا لو ۔ اس طرح انہوں نے چالیس آدمیوں کا شمار کیا ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے کھانا کھایا پھر آپ کھڑے ہوئے تو میں دیکھنے لگا کہ کھانے میں سے کچھ بھی کم نہیں ہوا ۔",
                "urduNarrator": "ہم سے صلت بن محمد نے بیان کیا ، کہا ہم سے حماد بن زید نے ، ان سے جعد ابوعثمان نے ان سے انس رضی اللہ عنہ نے اور ( اس کی روایت حماد نے ) ہشام سے بھی کی ، ان سے محمد نے اور ان سے انس رضی اللہ عنہ نے اور سنان ابو ربیعہ سے ( بھی کی ) اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ الْجَعْدِ أَبِي عُثْمَانَ، عَنْ أَنَسٍ،‏.‏ وَعَنْ هِشَامٍ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ،‏.‏ وَعَنْ سِنَانٍ أَبِي رَبِيعَةَ، عَنْ أَنَسٍ، أَنَّ أُمَّ سُلَيْمٍ، أُمَّهُ عَمَدَتْ إِلَى مُدٍّ مِنْ شَعِيرٍ، جَشَّتْهُ وَجَعَلَتْ مِنْهُ خَطِيفَةً، وَعَصَرَتْ عُكَّةً عِنْدَهَا، ثُمَّ بَعَثَتْنِي إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَتَيْتُهُ وَهْوَ فِي أَصْحَابِهِ فَدَعَوْتُهُ قَالَ ‏\"‏ وَمَنْ مَعِي ‏\"‏‏.‏ فَجِئْتُ فَقُلْتُ إِنَّهُ يَقُولُ، وَمَنْ مَعِي، فَخَرَجَ إِلَيْهِ أَبُو طَلْحَةَ قَالَ يَا رَسُولَ اللَّهِ إِنَّمَا هُوَ شَىْءٌ صَنَعَتْهُ أُمُّ سُلَيْمٍ، فَدَخَلَ فَجِيءَ بِهِ وَقَالَ ‏\"‏ أَدْخِلْ عَلَىَّ عَشَرَةً ‏\"‏‏.‏ فَدَخَلُوا فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ قَالَ ‏\"‏ أَدْخِلْ عَلَىَّ عَشَرَةً ‏\"‏‏.‏ فَدَخَلُوا فَأَكَلُوا حَتَّى شَبِعُوا، ثُمَّ قَالَ ‏\"‏ أَدْخِلْ عَلَىَّ عَشَرَةً ‏\"‏‏.‏ حَتَّى عَدَّ أَرْبَعِينَ، ثُمَّ أَكَلَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ قَامَ، فَجَعَلْتُ أَنْظُرُ هَلْ نَقَصَ مِنْهَا شَىْءٌ‏.‏",
                "headingArabic": "مَنْ أَدْخَلَ الضِّيفَانَ عَشَرَةً عَشَرَةً وَالْجُلُوسِ عَلَى الطَّعَامِ عَشَرَةً عَشَرَةً",
                "headingUrdu": "جو شخص دس بار مہمانوں کو بلائے اور دس دس بار کھانے پر بیٹھے۔",
                "headingEnglish": "Whoever admitted the guests in batches of ten persons (by turns).",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5216,
                "hadithNumber": "5451",
                "englishNarrator": "Narrated `Abdul `Aziz:",
                "hadithEnglish": "It was said to Anas رضی اللہ عنہ \"What did you hear the Prophet (ﷺ) saying about garlic?\" Anas replied, \"Whoever has eaten (garlic) should not approach our mosque.\"",
                "hadithUrdu": "حضرت انس رضی اللہ عنہ نے کہا میں نے نبی کریم صلی اللہ علیہ وسلم کو لہسن کے بارے میں کچھ کہتے نہیں سنا ۔ البتہ آپ نے فرمایا کہ جو شخص ( لہسن ) کھائے تو وہ ہماری مسجد کے قریب نہ آئے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، ان سے عبدالعزیز نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، قَالَ قِيلَ لأَنَسٍ مَا سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم فِي الثُّومِ فَقَالَ ‏ \"‏ مَنْ أَكَلَ فَلاَ يَقْرَبَنَّ مَسْجِدَنَا ‏\"‏‏.‏",
                "headingArabic": "مَا يُكْرَهُ مِنَ الثُّومِ وَالْبُقُولِ",
                "headingUrdu": "لہسن یا دیگر (خراب بو والی سبزیاں) کھانا۔",
                "headingEnglish": "The eating of garlic or other (bad smelling vegetables).",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5217,
                "hadithNumber": "5452",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever has eaten garlic or onion should keep away from us (or should keep away from our mosque).'",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے لہسن یا پیاز کھائی ہو تو اسے چاہئے کہ ہم سے دور رہے ۔ یا یہ فرمایا کہ ہماری مسجد سے دور رہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے ابوصفوان عبداللہ بن سعید نے بیان کیا ، کہا ہم کو یونس نے خبر دی ، ان سے ابن شہاب نے بیان کیا ، ان سے عطاء نے بیان کیا کہ حضرت جابر بن عبداللہ رضی اللہ عنہما کہتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو صَفْوَانَ عَبْدُ اللَّهِ بْنُ سَعِيدٍ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عَطَاءٌ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ زَعَمَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ أَكَلَ ثُومًا أَوْ بَصَلاً فَلْيَعْتَزِلْنَا، أَوْ لِيَعْتَزِلْ مَسْجِدَنَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5218,
                "hadithNumber": "5453",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "We were with Allah's Messenger (ﷺ) collecting Al-Kabath at Mar-Az-Zahran. The Prophet (ﷺ) said, \"Collect the black ones, for they are better.\" Somebody said, (O Allah's Messenger (ﷺ)!) Have you ever shepherded sheep?\" He said, \"There has been no prophet but has shepherded them. \"",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ مقام مرالظہران پر تھے ، ہم پیلو توڑ رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو خوب کالا ہو وہ تو ڑو کیونکہ وہ زیادہ لذیذ ہوتا ہے ۔ حضرت جابر رضی اللہ عنہ نے عرض کیا آپ نے بکریاں چرائی ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اور کوئی نبی ایسا نہیں گزرا جس نے بکریاںنہ چرائی ہوں ۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ، کہا ہم سے ابن وہب نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے بیان کیا انہیں ابوسلمہ نے خبر دی ، کہا کہ مجھے حضرت جابر بن عبداللہ رضی اللہ عنہما نے خبر دی ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، قَالَ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمَرِّ الظَّهْرَانِ نَجْنِي الْكَبَاثَ فَقَالَ ‏\"‏ عَلَيْكُمْ بِالأَسْوَدِ مِنْهُ، فَإِنَّهُ أَيْطَبُ ‏\"‏‏.‏ فَقَالَ أَكُنْتَ تَرْعَى الْغَنَمَ قَالَ ‏\"‏ نَعَمْ، وَهَلْ مِنْ نَبِيٍّ إِلاَّ رَعَاهَا ‏\"‏‏.‏",
                "headingArabic": "الْكَبَاثِ وَهْوَ ثَمَرُ الأَرَاكِ",
                "headingUrdu": "الکبث یعنی العرک کے پتے",
                "headingEnglish": "Al-Kabath, i.e., the leaves of Al-Arak",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5219,
                "hadithNumber": "5454",
                "englishNarrator": "Narrated Suwaid bin An Nu`man:",
                "hadithEnglish": "We went out with Allah's Messenger (ﷺ) to Khaibar, and when we reached As-Sahba', the Prophet (ﷺ) asked for food, and he was offered nothing but Sawiq. We ate, and then Allah's Messenger (ﷺ) stood up for the prayer. He rinsed his mouth with water, and we too, rinsed our mouths.",
                "hadithUrdu": "ہم رسول کریم صلی اللہ علیہ وسلم کے ساتھ خیبر روانہ ہوئے ۔ جب ہم مقام صہبا پر پہنچے تو آنحضرت صلی اللہ علیہ وسلم نے کھانا طلب فرمایا ۔ کھانے میں ستو کے سوا اور کوئی چیز نہیں لائی گئی ، پھر ہم نے کھانا کھایا اور آنحضور صلی اللہ علیہ وسلم کلی کر کے نماز کے لیے کھڑے ہو گئے ۔ ہم نے بھی کلی کی ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، انہوں نے یحییٰ بن سعید سے سنا ، انہوں نے بشیر بن یسار سے ، ان سے سوید بن نعمان نے ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سُوَيْدِ بْنِ النُّعْمَانِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى خَيْبَرَ، فَلَمَّا كُنَّا بِالصَّهْبَاءِ دَعَا بِطَعَامٍ فَمَا أُتِيَ إِلاَّ بِسَوِيقٍ، فَأَكَلْنَا فَقَامَ إِلَى الصَّلاَةِ، فَتَمَضْمَضَ وَمَضْمَضْنَا‏.‏",
                "headingArabic": "الْمَضْمَضَةِ بَعْدَ الطَّعَامِ",
                "headingUrdu": "کھانا کھانے کے بعد منہ دھونا",
                "headingEnglish": "To rinse the mouth after taking meals",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5220,
                "hadithNumber": "5455",
                "englishNarrator": "Narrated Suwaid رضی اللہ عنہ :",
                "hadithEnglish": "We went out with Allah's Messenger (ﷺ) to Khaibar. and when we reached As-Sahba', which (Yahya says) is one day' journey from Khaibar, the Prophet (ﷺ) asked for food, and he was offered nothing but Sawiq which we chewed and ate. Then the Prophet (ﷺ) asked for water and rinsed his mouth, and we too, rinsed our mouths along with him. He then led us in the Maghrib prayer without performing ablution again. Sufyan, the reporter says: It is as if you were hearing it from Yahya.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ و سلم کے ساتھ خیبر کی طرف نکلے جب ہم مقام صہبا پر پہنچے ۔ یحییٰ نے کہا کہ یہ جگہ خیبر سے ایک منزل کی دوری پر ہے تو آنحضرت صلی اللہ علیہ وسلم نے کھانا طلب فرمایا لیکن ستو کے سوا اور کوئی چیز نہیں لائی گئی ۔ ہم نے اسے آپ کے ساتھ کھایا پھر آپ نے ہمیں مغرب کی نماز پڑھائی اور نیا وضو نہیں کیا اور سفیان نے کہا گویا کہ تم یہ حدیث یحییٰ ہی سے سن رہے ہو ۔",
                "urduNarrator": "یحییٰ نے بیان کیا کہ میں نے بشیر سے سنا ، انہوں نے بیان کیا ہم سے سوید رضی اللہ عنہ نے بیان کیا",
                "hadithArabic": "قَالَ يَحْيَى سَمِعْتُ بُشَيْرًا، يَقُولُ حَدَّثَنَا سُوَيْدٌ، خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى خَيْبَرَ، فَلَمَّا كُنَّا بِالصَّهْبَاءِ ـ قَالَ يَحْيَى وَهْىَ مِنْ خَيْبَرَ عَلَى رَوْحَةٍ ـ دَعَا بِطَعَامٍ فَمَا أُتِيَ إِلاَّ بِسَوِيقٍ، فَلُكْنَاهُ فَأَكَلْنَا مَعَهُ، ثُمَّ دَعَا بِمَاءٍ فَمَضْمَضَ وَمَضْمَضْنَا مَعَهُ، ثُمَّ صَلَّى بِنَا الْمَغْرِبَ وَلَمْ يَتَوَضَّأْ‏.‏ وَقَالَ سُفْيَانُ كَأَنَّكَ تَسْمَعُهُ مِنْ يَحْيَى‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5221,
                "hadithNumber": "5456",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, 'When you eat, do not wipe your hands till you have licked it, or had it licked by somebody else.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب کوئی شخص کھانا کھائے تو ہاتھ چاٹنے یا کسی کو چٹانے سے پہلے ہاتھ نہ پونچھے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے عطاء نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَكَلَ أَحَدُكُمْ فَلاَ يَمْسَحْ يَدَهُ حَتَّى يَلْعَقَهَا أَوْ يُلْعِقَهَا ‏\"‏‏.‏",
                "headingArabic": "لَعْقِ الأَصَابِعِ وَمَصِّهَا قَبْلَ أَنْ تُمْسَحَ بِالْمِنْدِيلِ",
                "headingUrdu": "انگلیوں کو چاٹنا اور چوسنا",
                "headingEnglish": "To lick and suck the fingers",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5222,
                "hadithNumber": "5457",
                "englishNarrator": "Narrated Sa`id bin Al-Harith:",
                "hadithEnglish": "He asked Jabir bin `Abdullah رضی اللہ عنہ about performing ablution after taking a cooked meal. He replied, \"It is not essential,\" and added, \"We never used to get such kind of food during the lifetime of the Prophet except rarely; and if at all we got such a dish, we did not have any handkerchiefs to wipe our hands with except the palms of our hands, our forearms and our feet. We would perform the prayer thereafter with-out performing new ablution.\"",
                "hadithUrdu": "انہوں نے جابر رضی اللہ عنہ سے ایسی چیز کے ( کھانے کے بعد ) جو آگ پر رکھی ہو وضو کے متعلق پوچھا ( کہ کیا ایسی چیز کھانے سے وضو ٹوٹ جاتا ہے ؟ ) تو انہوں نے کہا کہ نہیں ۔ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں ہمیں اس طرح کا کھانا ( جو پکا ہوا ہوتا ) بہت کم میسر آتا تھا اور اگر میسر آبھی جاتا تھا تو سوا ہماری ہتھیلیوں بازوؤں اور پاؤں کے کوئی رومال نہیں ہوتا تھا ( اور ہم انہیں سے اپنے ہاتھ صاف کر کے ) نماز پڑھ لیتے تھے اور وضو ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا کہ مجھ سے محمد بن فلیح نے بیان کیا ، کہا کہ مجھ سے میرے والد نے ، ان سے سعیدبن الحارث نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ سعید بن الحارث",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ فُلَيْحٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ سَعِيدِ بْنِ الْحَارِثِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّهُ سَأَلَهُ عَنِ الْوُضُوءِ مِمَّا مَسَّتِ النَّارُ، فَقَالَ لاَ قَدْ كُنَّا زَمَانَ النَّبِيِّ صلى الله عليه وسلم لاَ نَجِدُ مِثْلَ ذَلِكَ مِنَ الطَّعَامِ إِلاَّ قَلِيلاً، فَإِذَا نَحْنُ وَجَدْنَاهُ لَمْ يَكُنْ لَنَا مَنَادِيلُ، إِلاَّ أَكُفَّنَا وَسَوَاعِدَنَا وَأَقْدَامَنَا، ثُمَّ نُصَلِّي وَلاَ نَتَوَضَّأُ‏.‏",
                "headingArabic": "الْمِنْدِيلِ",
                "headingUrdu": "رومال۔",
                "headingEnglish": "The handkerchief.",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5223,
                "hadithNumber": "5458",
                "englishNarrator": "Narrated Abu Umama رضی اللہ عنہ :",
                "hadithEnglish": "Whenever the dining sheet of the Prophet (ﷺ) was taken away (i.e., whenever he finished his meal), he used to say: \"Al-hamdu li l-lah kathiran taiyiban mubarakan fihi ghaira makfiy wala muWada` wala mustaghna'anhu Rabbuna.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے سامنے سے جب کھانا اٹھایا جاتا تو آپ یہ دعا پڑھتے ۔ تمام تعریفیں اللہ کے لیے ، بہت زیادہ پاکیزہ برکت والی ، ہم اس کھانے کا حق پوری طرح ادا نہ کر سکے اور یہ ہمیشہ کے لیے رخصت نہیں کیا گیا ہے ( اور یہ اس لیے کہا تاکہ ) اس سے ہم کو بےپرواہی کا خیال نہ ہو ، اے ہمارے رب ! “",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ثور نے ، ان سے خالد بن معدان نے اور ان سے حضرت ابوامامہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ ثَوْرٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ أَبِي أُمَامَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا رَفَعَ مَائِدَتَهُ قَالَ ‏ \"‏ الْحَمْدُ لِلَّهِ كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ، غَيْرَ مَكْفِيٍّ، وَلاَ مُوَدَّعٍ وَلاَ مُسْتَغْنًى عَنْهُ، رَبَّنَا ‏\"‏‏.‏",
                "headingArabic": "مَا يَقُولُ إِذَا فَرَغَ مِنْ طَعَامِهِ",
                "headingUrdu": "کھانا ختم کرنے کے بعد کیا کہنا چاہیے؟",
                "headingEnglish": "What one should say after finishing one's meal.",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5224,
                "hadithNumber": "5459",
                "englishNarrator": "Narrated Abu Umama رضی اللہ عنہ :",
                "hadithEnglish": "Whenever the Prophet (ﷺ) finished his meals (or when his dining sheet was taken away), he used to say. \"Praise be to Allah Who has satisfied our needs and quenched our thirst. Your favor cannot by compensated or denied.\" Once he said, upraise be to You, O our Lord! Your favor cannot be compensated, nor can be left, nor can be dispensed with, O our Lord!\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب کھانے سے فارغ ہوتے اور ایک مرتبہ بیان کیا کہ جب آنحضرت صلی اللہ علیہ وسلم اپنا دسترخوان اٹھاتے یہ دعا پڑھتے ” تمام تعریفیں اس اللہ کے لیے ہیں جس نے ہماری کفایت کی اور ہمیں سیراب کیا ۔ ہم اس کھانے کا حق پوری طرح ادا نہ کر سکے ورنہ ہم اس نعمت کے منکر نہیں ہیں ۔ اور ایک مرتبہ فرمایا ” تیرے ہی لیے تمام تعریفیں ہیں اے ہمارے رب ! اس کا حق ادا نہیں کر سکے اور نہ یہ ہمیشہ کے لیے رخصت کیا گیا ہے ۔ ( یہ اس لیے کہا تاکہ ) اس سے ہم کو بے نیازی کا خیال نہ ہو ۔ اے ہمارے رب ! “",
                "urduNarrator": "ہم سے ابو عاصم نے بیان کیا ، ان سے ثور بن یزید نے بیان کیا ، ان سے خالدبن معدان نے اور ان سے حضرت ابوامامہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ ثَوْرِ بْنِ يَزِيدَ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ أَبِي أُمَامَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا فَرَغَ مِنْ طَعَامِهِ ـ وَقَالَ مَرَّةً إِذَا رَفَعَ مَائِدَتَهُ ـ قَالَ ‏ \"‏ الْحَمْدُ لِلَّهِ الَّذِي كَفَانَا وَأَرْوَانَا، غَيْرَ مَكْفِيٍّ، وَلاَ مَكْفُورٍ ـ وَقَالَ مَرَّةً الْحَمْدُ لِلَّهِ رَبِّنَا، غَيْرَ مَكْفِيٍّ، وَلاَ مُوَدَّعٍ ـ وَلاَ مُسْتَغْنًى، رَبَّنَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5225,
                "hadithNumber": "5460",
                "englishNarrator": "Narrated .Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"When your servant brings your food to you, if you do not ask him to join you, then at least ask him to take one or two handfuls, for he has suffered from its heat (while cooking it) and has taken pains to cook it nicely.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب تم میں کسی شخص کا خادم اس کا کھانا لائے تو اگر وہ اسے اپنے ساتھ نہیں بٹھا سکتا تو کم از کم ایک یا دو لقمہ اس کھانے میں سے اسے کھلا دے ( کیونکہ ) اس نے ( پکاتے وقت ) اس کی گرمی اور تیاری کی مشقت برداشت کی ہے ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے محمد نے ، وہ زیاد کے صاحبزادے ہیں ، کہا کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، ان سے",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدٍ ـ هُوَ ابْنُ زِيَادٍ ـ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَتَى أَحَدَكُمْ خَادِمُهُ بِطَعَامِهِ، فَإِنْ لَمْ يُجْلِسْهُ مَعَهُ فَلْيُنَاوِلْهُ أُكْلَةً أَوْ أُكْلَتَيْنِ، أَوْ لُقْمَةً أَوْ لُقْمَتَيْنِ، فَإِنَّهُ وَلِيَ حَرَّهُ وَعِلاَجَهُ ‏\"‏‏.‏",
                "headingArabic": "الأَكْلِ مَعَ الْخَادِمِ",
                "headingUrdu": "نوکر کے ساتھ کھانا۔",
                "headingEnglish": "To eat with one's servant.",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5226,
                "hadithNumber": "5461",
                "englishNarrator": "Narrated Abu Mas`ud Al-Ansari رضی اللہ عنہ :",
                "hadithEnglish": "There was an Ansari man nicknamed, Abu Shu'aib رضی اللہ عنہ , who had a slave who was a butcher. He came to the Prophet (ﷺ) while he was sitting with his companions and noticed the signs of hunger on the face of the Prophet (ﷺ) . So he went to his butcher slave and said, \"Prepare for me a meal sufficient for five persons so that I may invite the Prophet (ﷺ) along with four other men.\" He had the meal prepared for him and invited him. A (sixth) man followed them. The Prophet (ﷺ) said, \"O Abu Shu'aib! Another man has followed us. If you wish, you may invite him; and if you wish, you may refuse him.\" Abu Shu'aib رضی اللہ عنہ said, \"No, I will admit him.\"",
                "hadithUrdu": "جماعت انصار کے ایک صحابی ابو شعیب رضی اللہ عنہ کے نام سے مشہور تھے ۔ ان کے پاس ایک غلام تھا جو گوشت بیچا کرتا تھا ۔ وہ صحابی نبی کریم صلی اللہ علیہ وسلم کی مجلس میں حاضر ہوئے تو آنحضرت صلی اللہ علیہ وسلم اپنے صحابہ کے ساتھ تشریف رکھتے تھے ۔ انہوں نے آنحضرت صلی اللہ علیہ وسلم کے چہرہ مبارک سے فاقہ کا اندازہ لگا لیا ۔ چنانچہ وہ اپنے گوشت فروش غلام کے پاس گئے اور کہا کہ میرے لیے پانچ آدمیوں کا کھانا تیار کر دو ۔ میں حضور اکرم صلی اللہ علیہ وسلم کو چار دوسرے آدمیوں کے ساتھ دعوت دوں گا ۔ غلام نے کھانا تیار کر دیا ۔ اس کے بعد ابو شعیب رضی اللہ عنہ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں گئے اور آپ کو کھانے کی دعوت دی ۔ ان کے ساتھ ایک اور صاحب بھی چلنے لگے تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا اے ابو شعیب ! یہ صاحب بھی ہمارے ساتھ آ گئے ہیں ، اگر تم چاہو تو انہیں بھی اجازت دے دو اور اگر چا ہو تو چھوڑ دو ۔ انہوں نے عرض کیا نہیں بلکہ میں انہیں بھی اجازت دیتا ہوں ۔",
                "urduNarrator": "ہم سے عبداللہ بن ابی اسود نے بیان کیا ، کہا ہم سے ابواسامہ نے ، ان سے اعمش نے ، ان سے شقیق نے ، اور ان سے ابومسعود انصاری رضی اللہ عنہ نے بیان کیا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا شَقِيقٌ، حَدَّثَنَا أَبُو مَسْعُودٍ الأَنْصَارِيُّ، قَالَ كَانَ رَجُلٌ مِنَ الأَنْصَارِ يُكْنَى أَبَا شُعَيْبٍ، وَكَانَ لَهُ غُلاَمٌ لَحَّامٌ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم وَهْوَ فِي أَصْحَابِهِ، فَعَرَفَ الْجُوعَ فِي وَجْهِ النَّبِيِّ صلى الله عليه وسلم فَذَهَبَ إِلَى غُلاَمِهِ اللَّحَّامِ فَقَالَ اصْنَعْ لِي طَعَامًا يَكْفِي خَمْسَةً، لَعَلِّي أَدْعُو النَّبِيَّ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ‏.‏ فَصَنَعَ لَهُ طُعَيِّمًا، ثُمَّ أَتَاهُ فَدَعَاهُ، فَتَبِعَهُمْ رَجُلٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَا أَبَا شُعَيْبٍ إِنَّ رَجُلاً تَبِعَنَا فَإِنْ شِئْتَ أَذِنْتَ لَهُ، وَإِنْ شِئْتَ تَرَكْتَهُ ‏\"‏‏.‏ قَالَ لاَ بَلْ أَذِنْتُ لَهُ‏.‏",
                "headingArabic": "الرَّجُلِ يُدْعَى إِلَى طَعَامٍ فَيَقُولُ وَهَذَا مَعِي",
                "headingUrdu": "\"کیا یہ شخص بھی میرے ساتھ آ سکتا ہے؟\"",
                "headingEnglish": "\"May this (person) come with me too?\"",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5227,
                "hadithNumber": "5462",
                "englishNarrator": "Narrated `Amr bin Umaiyya:",
                "hadithEnglish": "That he saw Allah's Messenger (ﷺ) cutting a piece of mutton from its shoulder part he was carrying in his hand. When he was called for prayer, he put it down and the knife with which he was cutting it. Then he stood up and offered the prayer without performing new ablution.",
                "hadithUrdu": "انہوں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم اپنے ہاتھ سے بکری کے شانے کا گوشت کاٹ کاٹ کر کھا رہے تھے ، پھر آپ کو نماز کے لیے بلایا گیا تو آپ گوشت اور چھری جس سے آپ کاٹ رہے تھے ، چھوڑ کر کھڑے ہو گئے اور نماز پڑھائی اور اس نماز کے لیے نیا وضو نہیں کیا ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے اور لیث نے بیان کیا ، کہا انہوں نے کہ مجھ سے یونس نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، انہیں جعفر بن عمرو بن امیہ رضی اللہ عنہ نے خبر دی ، انہیں ان کے والد عمرو بن امیہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ، أَنَّ أَبَاهُ، عَمْرَو بْنَ أُمَيَّةَ أَخْبَرَهُ أَنَّهُ، رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ فِي يَدِهِ، فَدُعِيَ إِلَى الصَّلاَةِ فَأَلْقَاهَا وَالسِّكِّينَ الَّتِي كَانَ يَحْتَزُّ بِهَا، ثُمَّ قَامَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
                "headingArabic": "إِذَا حَضَرَ الْعَشَاءُ فَلاَ يَعْجَلْ عَنْ عَشَائِهِ",
                "headingUrdu": "اگر رات کا کھانا یا رات کا کھانا پیش کیا جائے (جب نماز کا وقت ہو جائے)۔",
                "headingEnglish": "If supper or dinner is served (when the time for Salat is due).",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5201,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=208",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=206",
                "label": "206",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=207",
                "label": "207",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=208",
                "label": "208",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=209",
                "label": "209",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=210",
                "label": "210",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=211",
                "label": "211",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=212",
                "label": "212",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=210",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=210",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=208",
        "to": 5225,
        "total": 40465
    }
}