{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 144,
        "data": [
            {
                "id": 3578,
                "hadithNumber": "3754",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "`Umar رضی اللہ عنہ used to say, \"Abu Bakr رضی اللہ عنہ is our chief, and he manumitted our chief,\" meaning Bilal رضی اللہ عنہ .",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ کہا کرتے تھے کہ ابوبکر رضی اللہ عنہ ہمارے سردار ہیں اور ہمارے سردار کو انہوں نے آزاد کیا ہے ، ان کی مراد حضرت بلا ل حبشی رضی اللہ عنہ سے تھی ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے عبدالعزیز بن ابی سلمہ نے بیان کیا ، ان سے محمد بن منکدر نے کہا ہم کو جابر بن عبداللہ رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، أَخْبَرَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كَانَ عُمَرُ يَقُولُ أَبُو بَكْرٍ سَيِّدُنَا، وَأَعْتَقَ سَيِّدَنَا‏.‏ يَعْنِي بِلاَلاً‏.‏",
                "headingArabic": "مَنَاقِبُ بِلاَلِ بْنِ رَبَاحٍ مَوْلَى أَبِي بَكْرٍ رضى الله عنهما",
                "headingUrdu": "حضرت ابوبکر رضی اللہ عنہ کے آزاد کردہ غلام بلال بن رباح کی فضیلت",
                "headingEnglish": "The merits of Bilal bin Rabah, the freed slave of Abu Bakr رضي الله عنه",
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3579,
                "hadithNumber": "3755",
                "englishNarrator": "Narrated Qais:",
                "hadithEnglish": "Bilal رضی اللہ عنہ said to Abu Bakr رضی اللہ عنہ , \"If you have bought me for yourself then keep me (for yourself), but if you have bought me for Allah's Sake, then leave me for Allah's Work.\"",
                "hadithUrdu": "حضرت بلال رضی اللہ عنہ نے حضرت ابوبکر رضی اللہ عنہ سے کہا ، اگر آپ نے مجھے اپنے لیے خریدا ہے تو پھر اپنے پاس ہی رکھئے اور اگر اللہ کے لیے خریدا ہے تو پھر مجھے آزاد کر دیجئیے اور اللہ کے راستے میں عمل کرنے دیجئیے ۔",
                "urduNarrator": "ہم سے ابن نمیر نے بیان کیا ، ان سے محمد بن عبید نے کہا ، ہم سے اسماعیل نے بیان کیا ، اور ان سے قیس نے کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ مُحَمَّدِ بْنِ عُبَيْدٍ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، أَنَّ بِلاَلاً، قَالَ لأَبِي بَكْرٍ إِنْ كُنْتَ إِنَّمَا اشْتَرَيْتَنِي لِنَفْسِكَ فَأَمْسِكْنِي، وَإِنْ كُنْتَ إِنَّمَا اشْتَرَيْتَنِي لِلَّهِ فَدَعْنِي وَعَمَلَ اللَّهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3580,
                "hadithNumber": "3756",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The prophet ﷺ cuddled me to his chest and said: O Allah! Teach him wisdom. Abu Mamar narrated us this Hadith and he said: O Allah! Teach him wisdom. Abu Mamar narrated us this Hadith and he said Abu Warith narrated us this Hadith that he ﷺsaid: Teach him the Book. Musa narrated us this Hadith and Wohaib narrated him the Hadith like this from Khalid.",
                "hadithUrdu": "مجھے نبی کریم صلی اللہ علیہ وسلم نے سینے سے لگایا اور فرمایا اے اللہ ! اسے حکمت کا علم عطا فرما ۔ہم سےابومعمر  نے بیان کیا, ہم سےعبدالوارث نے بیان کیا  کہ آپﷺنےفرمایا:اے اللہ!اسے قرآن کا علم عطا فرما۔ہم سے موسٰی نے بیان کیا,ہم سے وہیب نے بیان کیاکہ خالد سے اس کی مثال مروی ہے",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، ان سے خالد نے ، ان سے عکرمہ نے کہ ابن عباس رضی اللہ عنہما نے کہا",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ،، قَالَ ضَمَّنِي النَّبِيُّ صلى الله عليه وسلم إِلَى صَدْرِهِ وَقَالَ ‏ \"‏ اللَّهُمَّ عَلِّمْهُ الْحِكْمَةَ ‏\"‏‏.‏ حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، وَقَالَ، ‏ \"‏ عَلِّمْهُ الْكِتَابَ ‏\"‏‏.‏ حَدَّثَنَا مُوسَى، حَدَّثَنَا وُهَيْبٌ، عَنْ خَالِدٍ، مِثْلَهُ‏.‏ وَالْحِكْمَةُ الْإِصَابَةُ فِي غَيْرِ النُّبُوَّةِ.",
                "headingArabic": "ذِكْرُ ابْنِ عَبَّاسٍ رضى الله عنهما",
                "headingUrdu": "ابن عباس رضی اللہ عنہما کے بارے میں روایات",
                "headingEnglish": "Narrations about Ibn 'Abbas رضي الله عنهما",
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3581,
                "hadithNumber": "3757",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) had informed the people about the death of Zaid, Ja`far and Ibn Rawaha رضی اللہ عنہم before the news of their death reached them. He said with his eyes flowing with tears, \"Zaid رضی اللہ عنہ took the flag and was martyred; then Ja`far رضی اللہ عنہ took the flag and was martyred, and then Ibn Rawaha رضی اللہ عنہ took the flag and was martyred. Finally the flag was taken by one of Allah's Swords (i.e. Khalid bin Al-Walid  رضی اللہ عنہ) and Allah gave them (i.e. the Muslims) victory.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے کسی اطلاع کے پہنچنے سے پہلے زید ، جعفر اور ابن رواحہ رضی اللہ عنہم کی شہادت کی خبر صحابہ کو سنا دی تھی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اب اسلامی علم کو زید رضی اللہ عنہ لیے ہوئے ہیں اور وہ شہید کر دیئے گئے ، اب جعفر رضی اللہ عنہ نے علم اٹھا لیا اور وہ بھی شہید کر دیئے گئے ، اب ابن رواحہ رضی اللہ عنہ نے علم اٹھا لیا اور وہ بھی شہید کر دیئے گئے ، حضور اکرم صلی اللہ علیہ وسلم کی آنکھوں سے آنسو جاری تھے پھر آپ صلی اللہ علیہ وسلم نے فرمایا : اور آخر اللہ کی تلوار وں میں سے ایک تلوار ( حضرت خالد بن ولید رضی اللہ عنہ ) نے علم اٹھا لیا اور اللہ تعالیٰ نے ان کے ہاتھ پر مسلمانوں کو فتح عنایت فرمائی ۔",
                "urduNarrator": "ہم سے احمد بن واقد نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب نے ان سے حمید بن ہلال نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ وَاقِدٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَنَسٍ ـ رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم نَعَى زَيْدًا وَجَعْفَرًا وَابْنَ رَوَاحَةَ لِلنَّاسِ قَبْلَ أَنْ يَأْتِيَهُمْ خَبَرُهُمْ، فَقَالَ ‏ \"‏ أَخَذَ الرَّايَةَ زَيْدٌ فَأُصِيبَ، ثُمَّ أَخَذَ جَعْفَرٌ فَأُصِيبَ، ثُمَّ أَخَذَ ابْنُ رَوَاحَةَ فَأُصِيبَ ـ وَعَيْنَاهُ تَذْرِفَانِ ـ حَتَّى أَخَذَ سَيْفٌ مِنْ سُيُوفِ اللَّهِ حَتَّى فَتَحَ اللَّهُ عَلَيْهِمْ ‏\"‏‏.‏",
                "headingArabic": "مَنَاقِبُ خَالِدِ بْنِ الْوَلِيدِ رضى الله عنه",
                "headingUrdu": "خالد بن ولید رضی اللہ عنہ کی فضیلت",
                "headingEnglish": "The merits of Khalid bin Al-Walid رضي الله عنه",
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3582,
                "hadithNumber": "3758",
                "englishNarrator": "Narrated Masruq:",
                "hadithEnglish": "`Abdullah (bin Mas`ud رضی اللہ عنہما) was mentioned before `Abdullah bin `Amr رضی اللہ عنہما . The latter said, \"That is a man I continue to love because I heard Allah's Messenger (ﷺ) saying, ' Learn the recitation of the Qur'an from (any of these) four persons: `Abdullah bin Masud رضی اللہ عنہما , Salim the freed slave of Abu Hudhaifa رضی اللہ عنہ , Ubai bin Ka`b, and Mu`adh bin Jabal رضی اللہ عنہم .\" I do not remember whether he mentioned Ubai first or Mu`adh.",
                "hadithUrdu": "عبداللہ بن عمر و رضی اللہ عنہما کے یہاں عبداللہ بن مسعود کا ذکر ہوا تو انہوں نے کہا میں ان سے ہمیشہ محبت رکھوں گا کیونکہ میں نے رسول کریم صلی اللہ علیہ وسلم کو یہ فرماتے سنا ہے کہ چار اشخاص سے قرآن سیکھو ۔ عبداللہ بن مسعود رضی اللہ عنہما ، آنحضرت صلی اللہ علیہ وسلم نے ابتداء عبداللہ بن مسعود رضی اللہ عنہما سے ہی کی اور ابوحذیفہ رضی اللہ عنہ کے مولیٰ سالم ، ابی بن کعب اور معاذ بن جبل رضی اللہ عہنم سے ، انہوں نے بیان کیا کہ مجھے پوری طرح یاد نہیں کہ حضور اکرم صلی اللہ علیہ وسلم نے پہلے ابی بن کعب کا ذکر کیا یا معاذ بن جبل رضی اللہ عنہ کا ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عمرو بن مرہ نے ، ان سے ابراہیم نے اور ان سے مسروق نے کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، قَالَ ذُكِرَ عَبْدُ اللَّهِ عِنْدَ عَبْدِ اللَّهِ بْنِ عَمْرٍو، فَقَالَ ذَاكَ رَجُلٌ لاَ أَزَالُ أُحِبُّهُ بَعْدَ مَا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ اسْتَقْرِئُوا الْقُرْآنَ مِنْ أَرْبَعَةٍ مِنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، فَبَدَأَ بِهِ، وَسَالِمٍ مَوْلَى أَبِي حُذَيْفَةَ، وَأُبَىِّ بْنِ كَعْبٍ، وَمُعَاذِ بْنِ جَبَلٍ ‏\"‏‏.‏ قَالَ لاَ أَدْرِي بَدَأَ بِأُبَىٍّ أَوْ بِمُعَاذٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3583,
                "hadithNumber": "3759, 3760",
                "englishNarrator": "Narrated `Abdullah bin `Amr رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) neither talked in an insulting manner nor did he ever speak evil intentionally. He used to say, \"The most beloved to me amongst you is the one who has the best character and manners.\" He added, \" Learn the Qur'an from (any of these) four persons. `Abdullah bin Mas`ud رضی اللہ عنہما , Salim the freed slave of Abu Hudhaifa رضی اللہ عنہ , Ubai bin Ka`b, and Mu`adh bin Jabal رضی اللہ عنہ.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی زبان مبارک پر کوئی برا کلمہ نہیں آتا تھا اور نہ آپ صلی اللہ علیہ وسلم کی ذات سے یہ ممکن تھا اور آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ تم میں سب سے زیادہ عزیز مجھے وہ شخص ہے جس کے عادات و اخلاق سب سے عمدہ ہوں ۔میں نے رسول کریم صلی اللہ علیہ وسلم کو یہ فرماتے سنا ہے کہ چار اشخاص سے قرآن سیکھو ۔ عبداللہ بن مسعود رضی اللہ عنہما ، ابوحذیفہ رضی اللہ عنہ کے مولیٰ سالم ، ابی بن کعب اور معاذ بن جبل رضی اللہ عہنم سے .",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے سلیمان نے بیان کیا ، کہا میں نے ابووائل سے سنا ، کہا کہ میں نے مسروق سے سنا ، انہوں نے بیان کیا کہ عبداللہ بن عمرو رضی اللہ عنہما نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، قَالَ سَمِعْتُ مَسْرُوقًا، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍو إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَكُنْ فَاحِشًا وَلاَ مُتَفَحِّشًا وَقَالَ ‏\"‏ إِنَّ مِنْ أَحَبِّكُمْ إِلَىَّ أَحْسَنَكُمْ أَخْلاَقًا ‏\"‏‏.‏ وَقَالَ ‏\"‏ اسْتَقْرِئُوا الْقُرْآنَ مِنْ أَرْبَعَةٍ مِنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، وَسَالِمٍ مَوْلَى أَبِي حُذَيْفَةَ، وَأُبَىِّ بْنِ كَعْبٍ، وَمُعَاذِ بْنِ جَبَلٍ ‏\"‏‏.‏",
                "headingArabic": "مَنَاقِبُ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رضى الله عنه",
                "headingUrdu": "عبداللہ بن مسعود رضی اللہ عنہ کی فضیلت",
                "headingEnglish": "The merits of 'Abdullah bin Mas’ud رضي الله عنه",
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3584,
                "hadithNumber": "3761",
                "englishNarrator": "Narrated Alqama:",
                "hadithEnglish": "I went to Sham and was offering a two-rak`at prayer; I said, \"O Allah! Bless me with a (pious) companion.\" Then I saw an old man coming towards me, and when he came near I said, (to myself), \"I hope Allah has given me my request.\" The man asked (me), \"Where are you from?\" I replied, \"I am from the people of Kufa.\" He said, \"Weren't there amongst you the Carrier of the (Prophet's) shoes, Siwak and the ablution water container? Weren't there amongst you the man who was given Allah's Refuge from the Satan? And weren't there amongst you the man who used to keep the (Prophet's) secrets which nobody else knew? How did Ibn Um `Abd (i.e. `Abdullah bin Mas`ud رضی اللہ عنہما ) use to recite Surat-al-lail (the Night:92)?\" I recited:-- \"By the Night as it envelops By the Day as it appears in brightness. And by male and female.\" (92.1- 3) On that, Abu Darda said, \"By Allah, the Prophet (ﷺ) made me read the Verse in this way after listening to him, but these people (of Sham) tried their best to let me say something different.\"",
                "hadithUrdu": "میں شام پہنچا تو سب سے پہلے میں نے دو رکعت نماز پڑھی اور یہ دعا کی کہ اے اللہ ! مجھے کسی ( نیک ) ساتھی کی صحبت سے فیض یابی کی توفیق عطا فرما ، چنانچہ میں نے دیکھا کہ ایک بزرگ آ رہے ہیں ، جب وہ قریب آ گئے تو میں نے سوچا کہ شاید میری دعا قبول ہو گئی ہے ۔ انہوں نے دریافت فرمایا : آپ کا وطن کہاں ہے ؟ میں نے عرض کیا کہ میں کوفہ کا رہنے والا ہوں ، اس پر انہوں نے فرمایا : کیا تمہارے یہاں صاحب نعلین ، صاحب و سادہ و مطہرہ ( عبداللہ بن مسعود رضی اللہ عنہما ) نہیں ہیں ؟ کیا تمہارے یہاں وہ صحابی نہیں ہیں جنہیں شیطان سے ( اللہ کی ) پناہ مل چکی ہے ۔ ( یعنی عمار بن یاسر رضی اللہ عنہ ) کیا تمہارے یہاں سربستہ رازوں کے جاننے والے نہیں ہیں کہ جنہیں ان کے سوا اور کوئی نہیں جانتا ( پھر دریافت فرمایا ) ابن ام عبد ( عبداللہ بن مسعود رضی اللہ عنہما ) آیت واللیل کی قرآت کس طرح کرتے ہیں ؟ میں نے عرض کیا کہ واللیل اذا یغشیٰ والنھار اذا تجلی والذکر والانثی آپ نے فرمایا کہ مجھے بھی رسول اللہ صلی اللہ علیہ وسلم نے خود اپنی زبان مبارک سے اسی طرح سکھایا تھا ۔ لیکن اب شام والے مجھے اس طرح قرآت کرنے سے ہٹانا چاہتے ہیں ۔",
                "urduNarrator": "ہم سے موسیٰ نے بیان کیا ، ان سے ابوعوانہ نے ، ان سے مغیرہ نے ، ان سے ابراہیم نے ، ان سے علقمہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى، عَنْ أَبِي عَوَانَةَ، عَنْ مُغِيرَةَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، دَخَلْتُ الشَّأْمَ فَصَلَّيْتُ رَكْعَتَيْنِ، فَقُلْتُ اللَّهُمَّ يَسِّرْ لِي جَلِيسًا‏.‏ فَرَأَيْتُ شَيْخًا مُقْبِلاً، فَلَمَّا دَنَا قُلْتُ أَرْجُو أَنْ يَكُونَ اسْتَجَابَ‏.‏ قَالَ مِنْ أَيْنَ أَنْتَ قُلْتُ مِنْ أَهْلِ الْكُوفَةِ‏.‏ قَالَ أَفَلَمْ يَكُنْ فِيكُمْ صَاحِبُ النَّعْلَيْنِ وَالْوِسَادِ وَالْمِطْهَرَةِ أَوَلَمْ يَكُنْ فِيكُمُ الَّذِي أُجِيرَ مِنَ الشَّيْطَانِ أَوَلَمْ يَكُنْ فِيكُمْ صَاحِبُ السِّرِّ الَّذِي لاَ يَعْلَمُهُ غَيْرُهُ كَيْفَ قَرَأَ ابْنُ أُمِّ عَبْدٍ ‏{‏وَاللَّيْلِ‏}‏ فَقَرَأْتُ ‏{‏وَاللَّيْلِ إِذَا يَغْشَى * وَالنَّهَارِ إِذَا تَجَلَّى * وَالذَّكَرِ وَالأُنْثَى‏}‏‏.‏ قَالَ أَقْرَأَنِيهَا النَّبِيُّ صلى الله عليه وسلم فَاهُ إِلَى فِيَّ، فَمَا زَالَ هَؤُلاَءِ حَتَّى كَادُوا يَرُدُّونِي‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3585,
                "hadithNumber": "3762",
                "englishNarrator": "Narrated `Abdur-Rahman bin Yazid:",
                "hadithEnglish": "We asked Hudhaifa رضی اللہ عنہ to tell us of a person resembling (to some extent) the Prophet (ﷺ) in good appearance and straight forward behavior so that we may learn from him (good manners and acceptable conduct). Hudhaifa replied, \"I do not know anybody resembling the Prophet (to some extent) in appearance and conduct more than Ibn Um `Abd.",
                "hadithUrdu": "ہم نے حضرت حذیفہ رضی اللہ عنہ سے پوچھا کہ صحابہ میں نبی کریم صلی اللہ علیہ وسلم سے عادات واخلاق اور طور طریق میں سب سے زیادہ قریب کون سے صحابی تھے ؟ تاکہ ہم ان سے سیکھیں ، انہوں نے کہا اخلاق ، طور و طریق اور سیرت وعادت میں ابن ام عبد سے زیادہ آنحضرت صلی اللہ علیہ وسلم سے قریب اور کسی کو میں نہیں سمجھتا ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابواسحٰق نے ، ان سے عبدالرحمٰن بن زید نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ،، قَالَ سَأَلْنَا حُذَيْفَةَ عَنْ رَجُلٍ، قَرِيبِ السَّمْتِ وَالْهَدْىِ مِنَ النَّبِيِّ صلى الله عليه وسلم حَتَّى نَأْخُذَ عَنْهُ فَقَالَ مَا أَعْرِفُ أَحَدًا أَقْرَبَ سَمْتًا وَهَدْيًا وَدَلاًّ بِالنَّبِيِّ صلى الله عليه وسلم مِنِ ابْنِ أُمِّ عَبْدٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3586,
                "hadithNumber": "3763",
                "englishNarrator": "Narrated Abu Musa Al-Ash`ari رضی اللہ عنہ :",
                "hadithEnglish": "My brother and I came from Yemen, and for some time we continued to consider `Abdullah bin Mas`ud رضی اللہ عنہما as one of the members of the family of the Prophet (ﷺ) because we used to see him and his mother going in the house of the Prophet (ﷺ) very often.",
                "hadithUrdu": "میں اور میرے بھائی یمن سے ( مدینہ طیبہ ) حاضر ہوئے اور ایک زمانے تک یہاں قیام کیا ، ہم اس پورے عرصہ میں یہی سمجھتے رہے کہ عبداللہ بن مسعود رضی اللہ عنہما نبی کریم صلی اللہ علیہ وسلم کے گھرانے ہی کے ایک فرد ہیں ، کیونکہ حضور اکرم صلی اللہ علیہ وسلم کے گھر میں عبداللہ بن مسعود رضی اللہ عنہما اور ان کی والدہ کا ( بکثرت ) آناجانا ہم خود دیکھا کرتے تھے ۔",
                "urduNarrator": "مجھ سے محمد بن علاء نے بیان کیا ، کہا ہم سے ابراہیم بن یوسف بن ابی اسحٰق نے بیان کیا ، کہا کہ مجھ سے میرے والد نے بیان کیا ، ان سے ابواسحٰق نے ، کہا کہ مجھ سے اسود بن یزید نے بیان کیا ، کہا کہ میں نے حضرت ابوموسیٰ اشعری رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ بْنِ أَبِي إِسْحَاقَ، قَالَ حَدَّثَنِي أَبِي، عَنْ أَبِي إِسْحَاقَ، قَالَ حَدَّثَنِي الأَسْوَدُ بْنُ يَزِيدَ، قَالَ سَمِعْتُ أَبَا مُوسَى الأَشْعَرِيَّ ـ رضى الله عنه ـ يَقُولُ قَدِمْتُ أَنَا وَأَخِي مِنَ الْيَمَنِ، فَمَكُثْنَا حِينًا مَا نُرَى إِلاَّ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ رَجُلٌ مِنْ أَهْلِ بَيْتِ النَّبِيِّ صلى الله عليه وسلم، لِمَا نَرَى مِنْ دُخُولِهِ وَدُخُولِ أُمِّهِ عَلَى النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3587,
                "hadithNumber": "3764",
                "englishNarrator": "Narrated Ibn Abi Mulaika:",
                "hadithEnglish": "Muawiya رضی اللہ عنہ offered one rak`a witr prayer after the `Isha prayer, and at that time a freed slave of Ibn `Abbas رضی اللہ عنہما was present. He (i.e. the slave) went to Ibn `Abbas رضی اللہ عنہما (and told him that Muawiya رضی اللہ عنہ offered one rak`a witr prayer). Ibn `Abbas رضی اللہ عنہما said, \"Leave him, for he was in the company of Allah's Messenger (ﷺ).\"",
                "hadithUrdu": "حضرت معاویہ رضی اللہ عنہ نے عشاء کے بعد وتر کی نماز صرف ایک رکعت پڑھی ، وہیں حضرت ابن عباس رضی اللہ عنہما کے مولیٰ ( کریب ) بھی موجود تھے ، جب وہ حضرت ابن عباس رضی اللہ عنہما کی خدمت میں حاضر ہوئے تو ( حضرت امیر معاویہ رضی اللہ عنہ کی ایک رکعت وتر کا ذکر کیا ) اس پر انہوں نے کہا : کوئی حرج نہیں ہے ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم کی صحبت اٹھائی ہے ۔",
                "urduNarrator": "کہا ہم سے حسن بن بشیر نے بیان کیا ، ان سے عثمان بن اسود نے اور ان سے ابن ابی ملیکہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ بِشْرٍ، حَدَّثَنَا الْمُعَافَى، عَنْ عُثْمَانَ بْنِ الأَسْوَدِ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ أَوْتَرَ مُعَاوِيَةُ بَعْدَ الْعِشَاءِ بِرَكْعَةٍ وَعِنْدَهُ مَوْلًى لاِبْنِ عَبَّاسٍ، فَأَتَى ابْنَ عَبَّاسٍ فَقَالَ دَعْهُ، فَإِنَّهُ صَحِبَ رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": "ذِكْرُ مُعَاوِيَةَ رضى الله عنه",
                "headingUrdu": "معاویہ رضی اللہ عنہ کے بارے میں روایت ہے۔",
                "headingEnglish": "Narration about Mu'awiya رضي الله عنه",
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3588,
                "hadithNumber": "3765",
                "englishNarrator": "Narrated Ibn Abi Mulaika:",
                "hadithEnglish": "Somebody said to Ibn `Abbas رضی اللہ عنہما , \"Can you speak to the chief of the believers Mu`awiyah رضی اللہ عنہ , as he does not pray except one rak`a as witr?\" Ibn `Abbas رضی اللہ عنہما replied, \"He is a Faqih (i.e. a learned man who can give religious verdicts) .\"",
                "hadithUrdu": "حضرت عبداللہ بن عباس رضی اللہ عنہما سے کہا گیا کہ امیرالمؤمنین حضرت معاویہ رضی اللہ عنہ کے متعلق آپ کیا فرماتے ہیں ، انہوں نے وتر کی نماز صرف ایک رکعت پڑھی ہے ؟ انہوں نے کہا کہ وہ خود فقیہ ہیں ۔",
                "urduNarrator": "ہم سے ابن ابی مریم نے بیان کیا ، کہا ہم سے نافع بن عمر نے بیان کیا ، کہا مجھ سے ابن ابی ملیکہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ، حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، قِيلَ لاِبْنِ عَبَّاسٍ هَلْ لَكَ فِي أَمِيرِ الْمُؤْمِنِينَ مُعَاوِيَةَ، فَإِنَّهُ مَا أَوْتَرَ إِلاَّ بِوَاحِدَةٍ‏.‏ قَالَ إِنَّهُ فَقِيهٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3589,
                "hadithNumber": "3766",
                "englishNarrator": "Narrated Humran bin Aban:",
                "hadithEnglish": "Muawiya رضی اللہ عنہ said (to the people), \"You offer a prayer which we, who were the companions of the Prophet (ﷺ) never saw the Prophet (ﷺ) offering, and he forbade its offering,\" i.e. the two rak`at after the compulsory `Asr prayer.",
                "hadithUrdu": "معاویہ رضی اللہ عنہ نے کہا تم لوگ ایک خاص نماز پڑھتے ہو ، ۔ ہم لوگ نبی کریم صلی اللہ علیہ وسلم کی صحبت میں رہے اور ہم نے کبھی آپ صلی اللہ علیہ وسلم کو اس وقت نماز پڑھتے نہیں دیکھا ، بلکہ آپ نے تو اس سے منع فرمایا تھا ، حضرت معاویہ رضی اللہ عنہ کی مراد عصر کے بعد دو رکعت نماز سے تھی ۔ ( جسے اس زمانے میں بعض لوگ پڑھتے تھے )",
                "urduNarrator": "مجھ سے عمرو بن عباس نے بیان کیا ، کہا ہم سے محمد بن جعفر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابوالتیاح نے بیان کیا ، انہوں نے حمران بن ابان سے سنا کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، قَالَ سَمِعْتُ حُمْرَانَ بْنَ أَبَانَ، عَنْ مُعَاوِيَةَ ـ رضى الله عنه ـ قَالَ إِنَّكُمْ لَتُصَلُّونَ صَلاَةً لَقَدْ صَحِبْنَا النَّبِيَّ صلى الله عليه وسلم فَمَا رَأَيْنَاهُ يُصَلِّيهَا، وَلَقَدْ نَهَى عَنْهُمَا، يَعْنِي الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3590,
                "hadithNumber": "3767",
                "englishNarrator": "Narrated Al-Miswar bin Makhrama رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Fatima is a part of me, and whoever makes her angry, makes me angry.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ فاطمہ میرے جسم کا ایک ٹکڑا ہے جس نے اسے ناراض کیا اس نے مجھے ناراض کیا ۔",
                "urduNarrator": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے ابن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے ابن ابی ملیکہ نے اور ان سے حضرت مسور بن مخرمہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ فَاطِمَةُ بَضْعَةٌ مِنِّي، فَمَنْ أَغْضَبَهَا أَغْضَبَنِي ‏\"‏‏.‏",
                "headingArabic": "مَنَاقِبُ فَاطِمَةَ عَلَيْهَا السَّلاَمُ",
                "headingUrdu": "فاطمہ سلام اللہ علیہا کی فضیلت",
                "headingEnglish": "The merits of Fatima عليها السلام",
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3591,
                "hadithNumber": "3768",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"Once Allah's Messenger (ﷺ) said (to me), 'O Aish (`Aisha)! This is Gabriel greeting you.' I said, 'Peace and Allah's Mercy and Blessings be on him, you see what I don't see' \" She was addressing Allah 's Apostle.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک دن فرمایا : اے عائش یہ جبرائیل علیہ السلام تشریف فرما ہیں اور تمہیں سلام کہتے ہیں ، میں نے اس پر جواب دیا وعلیہ السلام ورحمۃ اللہ وبرکاتہ ، آپ وہ چیز ملاحظہ فرماتے ہیں جو مجھ کو نظر نہیں آتی ۔ ( آپ کی مراد نبی کریم صلی اللہ علیہ وسلم سے تھی ) ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے بیان کیا ، ان سے ابوسلمہ نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَبُو سَلَمَةَ إِنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا ‏ \"‏ يَا عَائِشَ، هَذَا جِبْرِيلُ يُقْرِئُكِ السَّلاَمَ ‏\"‏‏.‏ فَقُلْتُ وَعَلَيْهِ السَّلاَمُ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، تَرَى مَا لاَ أَرَى‏.‏ تُرِيدُ رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": "فَضْلِ عَائِشَةَ رضى الله عنها",
                "headingUrdu": "عائشہ رضی اللہ عنہا کی فضیلت",
                "headingEnglish": "The superiority of 'Aishah رضي الله عنها",
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3592,
                "hadithNumber": "3769",
                "englishNarrator": "Narrated Abu Musa Al-Ash`ari رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Many amongst men attained perfection but amongst women none attained the perfection except Mary, the daughter of `Imran and Asiya, the wife of Pharaoh. And the superiority of `Aisha to other women is like the superiority of Tharid (i.e. an Arabic dish) to other meals.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : مردوں میں تو بہت سے کامل پیدا ہوئے لیکن عورتوں میں مریم بنت عمران ، فرعون کی بیوی آسیہ کے سوا اور کوئی کامل پیدا نہیں ہوئی ، اور عائشہ کی فضیلت عورتوں پر ایسی ہے جیسے ثرید کی فضیلت بقیہ تمام کھانوں پر ہے ۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ( امام بخاری رحمہ اللہ نے ) اور ہم سے عمرو نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں عمرو بن مرہ نے ، انہیں مرہ نے اور انہیں حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، قَالَ وَحَدَّثَنَا عَمْرٌو، أَخْبَرَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ مُرَّةَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كَمَلَ مِنَ الرِّجَالِ كَثِيرٌ، وَلَمْ يَكْمُلْ مِنَ النِّسَاءِ إِلاَّ مَرْيَمُ بِنْتُ عِمْرَانَ، وَآسِيَةُ امْرَأَةُ فِرْعَوْنَ، وَفَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3593,
                "hadithNumber": "3770",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The superiority of `Aisha رضی اللہ عنہا over other women is like the superiority of Tharid to other meals.\"",
                "hadithUrdu": "میں نے رسول کریم صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ہے کہ عائشہ رضی اللہ عنہا کی فضیلت باقی عورتوں پر ایسی ہے جیسے ثرید کی فضیلت اور تمام کھانوں پر ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے محمد بن جعفر نے بیان کیا ، ان سے عبداللہ بن عبدالرحمٰن نے اور انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى الطَّعَامِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3594,
                "hadithNumber": "3771",
                "englishNarrator": "Narrated Al-Qasim bin Muhammad:",
                "hadithEnglish": "Once `Aisha رضی اللہ عنہا became sick and Ibn `Abbas رضی اللہ عنہما went to see her and said, \"O mother of the believers! You are leaving for truthful fore-runners i.e. for Allah's Messenger (ﷺ) and Abu Bakr.",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا بیمار پڑیں تو حضرت ابن عباس رضی اللہ عنہما عیادت کے لیے آئے اور عرض کیا ، ام المؤمنین ! آپ تو سچے جانے والے کے پاس جا رہی ہیں ، یعنی رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر کے پاس ۔ ( عالم برزخ میں ان سے ملاقات مراد تھی ) ۔",
                "urduNarrator": "محمد بن بشار نے مجھ سے بیان کیا ، کہا ہم سے عبدالوہاب بن عبدالمجید نے بیان کیا ، ہم سے ابن عون نے بیان کیا ، ان سے قاسم بن محمد نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّ عَائِشَةَ، اشْتَكَتْ، فَجَاءَ ابْنُ عَبَّاسٍ فَقَالَ يَا أُمَّ الْمُؤْمِنِينَ، تَقْدَمِينَ عَلَى فَرَطِ صِدْقٍ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَعَلَى أَبِي بَكْرٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3595,
                "hadithNumber": "3772",
                "englishNarrator": "Narrated Abu Wail:",
                "hadithEnglish": "When `Ali رضی اللہ عنہ sent `Ammar and Al-Hasan رضی اللہ عنہما to (the people of) Kufa to urge them to fight, `Ammar رضی اللہ عنہ addressed them saying, \"I know that she (i.e. `Aisha رضی اللہ عنہا) is the wife of the Prophet (ﷺ) in this world and in the Hereafter (world to come), but Allah has put you to test, whether you will follow Him (i.e. Allah) or her.\"",
                "hadithUrdu": "جب علی رضی اللہ عنہ نے عمار اور حسن رضی اللہ عنہما کو کوفہ بھیجا تھا تاکہ لوگوں کو اپنی مدد کے لیے تیار کریں تو عمار رضی اللہ عنہ نے ان سے خطاب کرتے ہوئے فرمایا تھا : مجھے بھی خوب معلوم ہے کہ عائشہ رضی اللہ عنہا رسول اللہ صلی اللہ علیہ وسلم کی زوجہ ہیں اس دنیا میں بھی اور آخرت میں بھی ، لیکن اللہ تعالیٰ تمہیں آزمانا چاہتا ہے کہ دیکھے تم علی رضی اللہ عنہ کی اتباع کرتے ہو ( جو برحق خلیفہ ہیں ) یا عائشہ رضی اللہ عنہا کی ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے حکم نے اور انہوں نے ابووائل سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، سَمِعْتُ أَبَا وَائِلٍ، قَالَ لَمَّا بَعَثَ عَلِيٌّ عَمَّارًا وَالْحَسَنَ إِلَى الْكُوفَةِ لِيَسْتَنْفِرَهُمْ خَطَبَ عَمَّارٌ فَقَالَ إِنِّي لأَعْلَمُ أَنَّهَا زَوْجَتُهُ فِي الدُّنْيَا وَالآخِرَةِ، وَلَكِنَّ اللَّهَ ابْتَلاَكُمْ لِتَتَّبِعُوهُ أَوْ إِيَّاهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3596,
                "hadithNumber": "3773",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "That she borrowed a necklace from Asma' رضی اللہ عنہا and it was lost. Allah's Messenger (ﷺ) sent some of his companions to look for it. During their journey the time of prayer was due and they prayed without ablution. When they returned to the Prophet (ﷺ) they complained about it. So the Divine Verse of Tayammum was revealed. Usaid bin Hudair رضی اللہ عنہ said (to `Aisha رضی اللہ عنہا), \"May Allah reward you handsomely. By Allah, whenever you have a difficulty, Allah took you out of it and brought with it, a Blessing for the Muslims.\"",
                "hadithUrdu": "( نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ میں جانے کے لیے ) آپ نے ( اپنی بہن ) اسماء رضی اللہ عنہا سے ایک ہار عاریتاً لے لیا تھا ، اتفاق سے وہ راستے میں کہیں گم ہو گیا ، حضور صلی اللہ علیہ وسلم نے اسے تلاش کرنے کے لیے چند صحابہ کو بھیجا ، اس دوران میں نماز کا وقت ہو گیا تو ان حضرات نے بغیر وضو کے نماز پڑھ لی ، پھر جب آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو آپ سے صورت حال کے متعلق عرض کیا ، اس کے بعد تیمم کی آیت نازل ہوئی ۔ اس پر اسید بن حضیر رضی اللہ عنہ نے کہا : تمہیں اللہ تعالیٰ جزائے خیر دے ، خدا کی قسم تم پر جب بھی کوئی مرحلہ آیا تو اللہ تعالیٰ نے اس سے نکلنے کی سبیل تمہارے لیے پیدا کر دی ، اور تمام مسلمانوں کے لیے بھی اس میں برکت پیدا فرمائی ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّهَا اسْتَعَارَتْ مِنْ أَسْمَاءَ قِلاَدَةً فَهَلَكَتْ، فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم نَاسًا مِنْ أَصْحَابِهِ فِي طَلَبِهَا، فَأَدْرَكَتْهُمُ الصَّلاَةُ، فَصَلَّوْا بِغَيْرِ وُضُوءٍ، فَلَمَّا أَتَوُا النَّبِيَّ صلى الله عليه وسلم شَكَوْا ذَلِكَ إِلَيْهِ، فَنَزَلَتْ آيَةُ التَّيَمُّمِ‏.‏ فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ جَزَاكِ اللَّهُ خَيْرًا، فَوَاللَّهِ مَا نَزَلَ بِكِ أَمْرٌ قَطُّ إِلاَّ جَعَلَ اللَّهُ لَكِ مِنْهُ مَخْرَجًا، وَجَعَلَ لِلْمُسْلِمِينَ فِيهِ بَرَكَةً‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3597,
                "hadithNumber": "3774",
                "englishNarrator": "Narrated Hisham's father:",
                "hadithEnglish": "When Allah's Messenger (ﷺ) was in his fatal illness, he started visiting his wives and saying, \"Where will I be tomorrow?\" He was anxious to be in `Aisha's home. `Aisha رضی اللہ عنہا said, \"So when it was my day, the Prophet became silent (no longer asked the question).",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم اپنے مرض الوفات میں بھی ازواج مطہرات کی باری کی پابندی فرماتے رہے البتہ یہ دریافت فرماتے رہے کہ کل مجھے کس کے یہاں ٹھہرنا ہے ؟ کیونکہ آپ حضرت عائشہ رضی اللہ عنہا کی باری کے خواہاں تھے ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ جب میرے یہاں قیام کا دن آیا تو آپ کو سکون ہوا ۔",
                "urduNarrator": "مجھ سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے کہ",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا كَانَ فِي مَرَضِهِ، جَعَلَ يَدُورُ فِي نِسَائِهِ وَيَقُولُ ‏ \"‏ أَيْنَ أَنَا غَدًا أَيْنَ أَنَا غَدًا ‏\"‏‏.‏ حِرْصًا عَلَى بَيْتِ عَائِشَةَ، قَالَتْ عَائِشَةُ فَلَمَّا كَانَ يَوْمِي سَكَنَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3598,
                "hadithNumber": "3775",
                "englishNarrator": "Narrated Hisham's father:",
                "hadithEnglish": "The people used to send presents to the Prophet (ﷺ) on the day of `Aisha's turn. `Aisha رضی اللہ عنہا said, \"My companions (i.e. the other wives of the Prophet) gathered in the house of Um Salama رضی اللہ عنہا and said, \"O Um Salama! By Allah, the people choose to send presents on the day of `Aisha's turn and we too, love the good (i.e. presents etc.) as `Aisha رضی اللہ عنہا does. You should tell Allah's Messenger (ﷺ) to tell the people to send their presents to him wherever he may be, or wherever his turn may be.\" Um Salama رضی اللہ عنہا said that to the Prophet and he turned away from her, and when the Prophet (ﷺ) returned to her (i.e. Um Salama), she repeated the same, and the Prophet (ﷺ) again turned away, and when she told him the same for the third time, the Prophet (ﷺ) said, \"O Um Salama! Don't trouble me by harming `Aisha رضی اللہ عنہا , for by Allah, the Divine Inspiration never came to me while I was under the blanket of any woman amongst you except her.\"",
                "hadithUrdu": "لوگ آنحضرت صلی اللہ علیہ وسلم کو تحفے بھیجنے میں حضرت عائشہ رضی اللہ عنہا کی باری کا انتظار کیا کرتے تھے ، حضرت عائشہ رضی اللہ عنہا کہتی ہیں کہ میری سوکنیں سب ام سلمہ رضی اللہ عنہا کے پاس گئیں اور ان سے کہا : اللہ کی قسم لوگ جان بوجھ کر اپنے تحفے اس دن بھیجتے ہیں جس دن حضرت عائشہ رضی اللہ عنہا کی باری ہوتی ہے ، ہم بھی حضرت عائشہ رضی اللہ عنہا کی طرح اپنے لیے فائدہ چاہتی ہیں ، اس لیے تم آنحضرت صلی اللہ علیہ وسلم سے کہو کہ آپ لوگوں کو فرما دیں کہ میں جس بھی بیوی کے پاس رہوں جس کی بھی باری ہو اسی گھر میں تحفے بھیج دیا کرو ۔ ام سلمہ رضی اللہ عنہا نے یہ بات آنحضرت صلی اللہ علیہ وسلم کے سامنے بیان کی ، آپ نے کچھ بھی جواب نہیں دیا ۔ انہوں نے دوبارہ عرض کیا جب بھی جواب نہ دیا ، پھر تیسری بار عرض کیا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا : اے ام سلمہ ! عائشہ کے بارے میں مجھ کو نہ ستاو ۔ اللہ کی قسم ! تم میں سے کسی بیوی کے لحاف میں ( جو میں اوڑھتا ہوں سوتے وقت ) مجھ پر وحی نازل نہیں ہوتی ہاں ( عائشہ کا مقام یہ ہے ) ان کے لحاف میں وحی نازل ہوتی ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، کہا ہم سے حماد نے کہا ، ہم سے ہشام نے ، انہوں نے اپنے والد ( عروہ ) سے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ،، قَالَ كَانَ النَّاسُ يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ قَالَتْ عَائِشَةُ فَاجْتَمَعَ صَوَاحِبِي إِلَى أُمِّ سَلَمَةَ، فَقُلْنَ يَا أُمَّ سَلَمَةَ، وَاللَّهِ إِنَّ النَّاسَ يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ، وَإِنَّا نُرِيدُ الْخَيْرَ كَمَا تُرِيدُهُ عَائِشَةُ، فَمُرِي رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يَأْمُرَ النَّاسَ أَنْ يُهْدُوا إِلَيْهِ حَيْثُ مَا كَانَ أَوْ حَيْثُ مَا دَارَ، قَالَتْ فَذَكَرَتْ ذَلِكَ أُمُّ سَلَمَةَ لِلنَّبِيِّ صلى الله عليه وسلم قَالَتْ فَأَعْرَضَ عَنِّي، فَلَمَّا عَادَ إِلَىَّ ذَكَرْتُ لَهُ ذَاكَ فَأَعْرَضَ عَنِّي، فَلَمَّا كَانَ فِي الثَّالِثَةِ ذَكَرْتُ لَهُ فَقَالَ ‏ \"‏ يَا أُمَّ سَلَمَةَ لاَ تُؤْذِينِي فِي عَائِشَةَ، فَإِنَّهُ وَاللَّهِ مَا نَزَلَ عَلَىَّ الْوَحْىُ وَأَنَا فِي لِحَافِ امْرَأَةٍ مِنْكُنَّ غَيْرِهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3599,
                "hadithNumber": "3776",
                "englishNarrator": "Narrated Ghailan bin Jarir:",
                "hadithEnglish": "I asked Anas رضی اللہ عنہ , \"Tell me about the name 'Al-Ansar.; Did you call yourselves by it or did Allah call you by it?\" He said, \"Allah called us by it.\" We used to visit Anas رضی اللہ عنہ (at Basra) and he used to narrate to us the virtues and deeds of the Ansar, and he used to address me or a person from the tribe of Al-Azd and say, \"Your tribe did so-and-so on such-and-such a day.\"",
                "hadithUrdu": "میں نے حضرت انس رضی اللہ عنہ سے پوچھا بتلائیے ( انصار ) اپنا نام آپ لو گوں نے خود رکھ لیا تھا یا آپ لوگوں کا یہ نام اللہ تعالیٰ نے رکھا ؟ انہوں نے کہا نہیں بلکہ ہمارا یہ نام اللہ تعالیٰ نے رکھا ہے ۔ غیلان کی روایت ہے کہ ہم انس رضی اللہ عنہ کی خدمت میں حاضر ہوتے تو آپ ہم سے انصار کی فضیلتیں اور غزوات میں ان کے مجاہدانہ واقعات بیان کیا کرتے پھر میری طرف یا قبیلہ ازد کے ایک شخص کی طرف متوجہ ہو کر کہتے : تمہاری قوم ( انصار ) نے فلاں دن فلاں دن فلاں فلاں کام انجام دیے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا کہا ہم سے مہدی بن میمون نے ، کہا ہم سے غیلان بن جریر نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا غَيْلاَنُ بْنُ جَرِيرٍ، قَالَ قُلْتُ لأَنَسٍ أَرَأَيْتَ اسْمَ الأَنْصَارِ كُنْتُمْ تُسَمَّوْنَ بِهِ، أَمْ سَمَّاكُمُ اللَّهُ قَالَ بَلْ سَمَّانَا اللَّهُ، كُنَّا نَدْخُلُ عَلَى أَنَسٍ فَيُحَدِّثُنَا مَنَاقِبَ الأَنْصَارِ وَمَشَاهِدَهُمْ، وَيُقْبِلُ عَلَىَّ أَوْ عَلَى رَجُلٍ مِنَ الأَزْدِ فَيَقُولُ فَعَلَ قَوْمُكَ يَوْمَ كَذَا وَكَذَا كَذَا وَكَذَا‏.‏",
                "headingArabic": "مَنَاقِبُ الأَنْصَارِ",
                "headingUrdu": "الانصار کی فضیلت",
                "headingEnglish": "The merits of Al-Ansar",
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3600,
                "hadithNumber": "3777",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The day of Bu'ath (i.e. Day of fighting between the two tribes of the Ansar, the Aus and Khazraj) was brought about by Allah for the good of His Apostle so that when Allah's Messenger (ﷺ) reached (Medina), the tribes of Medina had already divided and their chiefs had been killed and wounded. So Allah had brought about the battle for the good of H is Apostle in order that they (i.e. the Ansar) might embrace Islam.",
                "hadithUrdu": "بعاث کی جنگ کو ( جو اسلام سے پہلے اوس اور خزرج میں ہوئی تھی ) اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کے مفاد میں پہلے ہی مقدم کر رکھا تھا چنانچہ جب آپ مدینہ میں تشریف لائے تو یہ قبائل آپس کی پھوٹ کا شکار تھے اور ان کے سردار کچھ قتل کئے جا چکے تھے ، کچھ زخمی تھے ، تو اللہ تعالیٰ نے اس جنگ کو آپ سے پہلے اس لیے مقدم کیا تھا تاکہ وہ آپ کے تشریف لاتے ہی مسلمان ہو جائیں ۔",
                "urduNarrator": "مجھ سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ يَوْمُ بُعَاثَ يَوْمًا قَدَّمَهُ اللَّهُ لِرَسُولِهِ صلى الله عليه وسلم فَقَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدِ افْتَرَقَ مَلَؤُهُمْ، وَقُتِلَتْ سَرَوَاتُهُمْ، وَجُرِّحُوا، فَقَدَّمَهُ اللَّهُ لِرَسُولِهِ صلى الله عليه وسلم فِي دُخُولِهِمْ فِي الإِسْلاَمِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3601,
                "hadithNumber": "3778",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "On the day of the Conquest of Mecca, when the Prophet (ﷺ) had given (from the booty) the Quraish, the Ansar said, \"By Allah, this is indeed very strange: While our swords are still dribbling with the blood of Quraish, our war booty are distributed amongst them.\" When this news reached the Prophet (ﷺ) he called the Ansar and said, \"What is this news that has reached me from you?\" They used not to tell lies, so they replied, \"What has reached you is true.\" He said, \"Doesn't it please you that the people take the booty to their homes and you take Allah's Messenger (ﷺ) to your homes? If the Ansar took their way through a valley or a mountain pass, I would take the Ansar's valley or a mountain pass.\"",
                "hadithUrdu": "فتح مکہ کے دن جب آنحضرت صلی اللہ علیہ وسلم نے قریش کو ( غزوہ حنین کی ) غنیمت کا سارا مال دے دیا تو بعض نوجوان انصار یوں نے کہا ( اللہ کی قسم ! ) یہ تو عجیب بات ہے ابھی ہماری تلواروں سے قریش کا خون ٹپک رہا ہے اور ہمارا حاصل کیا ہوا مال غنیمت صرف انہیں دیا جا رہا ہے ، اس کی خبر جب آنحضرت صلی اللہ علیہ وسلم کو ملی تو آپ نے انصار کو بلایا ، انس رضی اللہ عنہ نے کہا کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا جو خبر مجھے ملی ہے کیا وہ صحیح ہے ؟ انصار لوگ جھوٹ نہیں بولتے تھے انہوں نے عرض کر دیا کہ آپ کو صحیح اطلاع ملی ہے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیا تم اس سے خوش اور راضی نہیں ہو کہ جب سب لوگ غنیمت کا مال لے کر اپنے گھروں کو واپس ہوں اور تم لوگ رسول اللہ صلی اللہ علیہ وسلم کو ساتھ لیے اپنے گھروں کو جاؤ گے ؟ انصار جس نالے یا گھاٹی میں چلیں گے تو میں بھی اسی نالے یا گھاٹی میں چلوں گا ۔",
                "urduNarrator": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابوالتیاح نے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ يَقُولُ قَالَتِ الأَنْصَارُ يَوْمَ فَتْحِ مَكَّةَ ـ وَأَعْطَى قُرَيْشًا ـ وَاللَّهِ إِنَّ هَذَا لَهُوَ الْعَجَبُ، إِنَّ سُيُوفَنَا تَقْطُرُ مِنْ دِمَاءِ قُرَيْشٍ، وَغَنَائِمُنَا تُرَدُّ عَلَيْهِمْ‏.‏ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَدَعَا الأَنْصَارَ قَالَ فَقَالَ ‏\"‏ مَا الَّذِي بَلَغَنِي عَنْكُمْ ‏\"‏‏.‏ وَكَانُوا لاَ يَكْذِبُونَ‏.‏ فَقَالُوا هُوَ الَّذِي بَلَغَكَ‏.‏ قَالَ ‏\"‏ أَوَلاَ تَرْضَوْنَ أَنْ يَرْجِعَ النَّاسُ بِالْغَنَائِمِ إِلَى بُيُوتِهِمْ، وَتَرْجِعُونَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى بُيُوتِكُمْ لَوْ سَلَكَتِ الأَنْصَارُ وَادِيًا أَوْ شِعْبًا، لَسَلَكْتُ وَادِيَ الأَنْصَارِ أَوْ شِعْبَهُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3602,
                "hadithNumber": "3779",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) or Abul-Qasim said, \"If the Ansar took their way through a valley or a mountain pass, I would take Ansar's valley. And but for the migration, I would have been one of the Ansar.\" Abu Huraira رضی اللہ عنہ used to say, \"The Prophet (ﷺ) is not unjust (by saying so). May my parents be sacrificed for him, for the Ansar sheltered and helped him,\" or said a similar sentence.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے یا ( یوں بیان کیا کہ ) ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا : انصار جس وادی یا گھاٹی میں جائیں تو میں بھی انہیں کی وادی میں جاؤں گا ۔ اور اگر میں ہجرت نہ کرتا تو میں انصار کا ایک فرد ہونا پسند کرتا ۔ حضرت ابوہریرہ رضی اللہ عنہ نے کہا آپ پر میرے ماں باپ قربان ہوں آپ نے یہ کوئی ظلم والی بات نہیں فرمائی آپ کو انصار نے اپنے یہاں ٹھہرایا اور آپ کی مدد کی تھی یا حضرت ابوہریرہ رضی اللہ عنہ نے ( اس کے ہم معنی ) اور کوئی دوسرا کلمہ کہا ۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، ہم سے شعبہ نے بیان کیا ، ان سے محمد بن زیاد نے ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَوْ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏ \"‏ لَوْ أَنَّ الأَنْصَارَ سَلَكُوا وَادِيًا أَوْ شِعْبًا، لَسَلَكْتُ فِي وَادِي الأَنْصَارِ، وَلَوْلاَ الْهِجْرَةُ لَكُنْتُ امْرَأً مِنَ الأَنْصَارِ ‏\"‏‏.‏ فَقَالَ أَبُو هُرَيْرَةَ مَا ظَلَمَ بِأَبِي وَأُمِّي، آوَوْهُ وَنَصَرُوهُ‏.‏ أَوْ كَلِمَةً أُخْرَى‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْلَا الْهِجْرَةُ لَكُنْتُ امْرَأً مِنْ الْأَنْصَارِ",
                "headingUrdu": "لیکن ہجرت کے لیے میں انصار میں سے ہوتا",
                "headingEnglish": "“But for the emigration, I would have been one of the Ansar",
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 3576,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=143",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=141",
                "label": "141",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=142",
                "label": "142",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=143",
                "label": "143",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=144",
                "label": "144",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=145",
                "label": "145",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=146",
                "label": "146",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=147",
                "label": "147",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=145",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=145",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=143",
        "to": 3600,
        "total": 40465
    }
}