{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 188,
        "data": [
            {
                "id": 4678,
                "hadithNumber": "4901",
                "englishNarrator": "Narrated Zaid bin Arqam رضی اللہ عنہ :",
                "hadithEnglish": "I was with my uncle and I heard `Abdullah bin Ubai bin Salul, saying, \"Don't spend on those who are with Allah's Messenger (ﷺ) that they may disperse and go away from him.\" He also said, \"If we return to Medina, surely, the more honorable will expel the meaner.\" So I informed my uncle of that and then my uncle informed Allah's Messenger (ﷺ) thereof. Allah's Messenger (ﷺ) sent for `Abdullah bin Ubai and his companions. They swore that they did not say anything of that sort Allah's Messenger (ﷺ) deemed their statement true and rejected mine. Thereof I became as distressed as I have never been before, and stayed at home. Then Allah revealed (Surat Al-Munafiqin): 'When the hypocrites come to you.....(63.1) They are the ones who say: Spend nothing on those who are with Allah's Messenger (ﷺ) ..(63.7) Verily the more honorable will expel therefrom the meaner..' (63.7-8) Allah's Messenger (ﷺ) sent for me and recited that Sura for me and said, \"Allah has confirmed your statement.\"",
                "hadithUrdu": "میں اپنے چچا ( سعد بن عبادہ یا عبداللہ بن رواحہ رضی اللہ عنہما ) کے ساتھ تھا میں نے عبداللہ بن ابی ابن سلول کو کہتے سنا کہ جو لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس ہیں ان پر خرچ مت کرو تاکہ وہ ان کے پاس سے بھاگ جائیں۔ یہ بھی کہا کہ اگر اب ہم مدینہ لوٹ کر جائیں گے تو عزت والا وہاں سے ذلیلوں کو نکال کر باہر کر دے گا۔ میں نے اس کی یہ بات چچا سے آ کر کہی اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کا ذکر کیا۔ نبی کریم صلی اللہ علیہ وسلم نے عبداللہ بن ابی اور اس کے ساتھیوں کو بلوایا انہوں نے قسم کھا لی کہ ایسی کوئی بات انہوں نے نہیں کہی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے بھی ان کو سچا جانا اور مجھ کو جھوٹا سمجھا۔ مجھے اس اتنا صدمہ پہنچا کہ ایسا کبھی نہیں پہنچا ہو گا پھر میں گھر کے اندر بیٹھ گیا۔ پھر اللہ تعالیٰ نے یہ سورت نازل کی «إذا جاءك المنافقون‏» سے «هم الذين يقولون لا تنفقوا على من عند رسول الله‏» اور آیت «ليخرجن الأعز منها الأذل‏» تو نبی کریم صلی اللہ علیہ وسلم نے مجھے بلوایا اور میرے سامنے اس سورت کی تلاوت کی پھر فرمایا کہ اللہ نے تمہارے بیان کو سچا کر دیا ہے۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا ہم سے اسرائیل بن یونس نے بیان کیا، انہوں نے کہا ان سے ابواسحاق سبیعی نے بیان کیا اور ان سے زید بن ارقم رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنْ زَيْدِ بْنِ أَرْقَمَ ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ عَمِّي فَسَمِعْتُ عَبْدَ اللَّهِ بْنَ أُبَىٍّ ابْنَ سَلُولَ يَقُولُ لاَ تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ حَتَّى يَنْفَضُّوا‏.‏ وَقَالَ أَيْضًا لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ‏.‏ فَذَكَرْتُ ذَلِكَ لِعَمِّي فَذَكَرَ عَمِّي لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى عَبْدِ اللَّهِ بْنِ أُبَىٍّ وَأَصْحَابِهِ، فَحَلَفُوا مَا قَالُوا، فَصَدَّقَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَذَّبَنِي، فَأَصَابَنِي هَمٌّ لَمْ يُصِبْنِي مِثْلُهُ، فَجَلَسْتُ فِي بَيْتِي، فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏إِذَا جَاءَكَ الْمُنَافِقُونَ‏}‏ إِلَى قَوْلِهِ ‏{‏هُمُ الَّذِينَ يَقُولُونَ لاَ تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ‏}‏ إِلَى قَوْلِهِ ‏{‏لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ‏}‏ فَأَرْسَلَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَرَأَهَا عَلَىَّ ثُمَّ قَالَ ‏\"‏ إِنَّ اللَّهَ قَدْ صَدَّقَكَ ‏\"‏‏.‏",
                "headingArabic": "‏{‏اتَّخَذُوا أَيْمَانَهُمْ جُنَّةً‏}‏ يَجْتَنُّونَ بِهَا",
                "headingUrdu": "\"انہوں نے اپنی قسموں کو (اپنی منافقت کا) پردہ بنا رکھا ہے۔\" (1) (63:2) (1): (Ch. 2) \"ان-نفاق\": (منافقت دو قسم کی ہوتی ہے، یعنی: اعتقاد میں نفاق ب- اعمال و افعال میں نفاق۔)",
                "headingEnglish": "\"They have made their oaths a screen (for their hypocrisy).\" (1) (63:2) (1): (Ch. 2) \"An-Nifāq\": (Hypocrisy is of two types, namely: A - Hypocrisy in Belief B - Hypocrisy in deeds and actions. )",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4679,
                "hadithNumber": "4902",
                "englishNarrator": "Narrated Zaid bin Arqam رضی اللہ عنہ :",
                "hadithEnglish": "When `Abdullah bin Ubai said, \"Do not spend on those who are with Allah's Messenger (ﷺ),\" and also said, \"If we return to Medina , surely, the more honorable will expel the meaner.\" So, I informed the Prophet (ﷺ) of his saying. The Ansar blamed me for that, and `Abdullah bin Ubai swore that he did not say. I returned to my house and slept. Allah's Messenger (ﷺ) then called me and I went to him. He said, \"Allah has confirmed your statement.\" The Verse: \"They are the one who say: Spend nothing......(63.7) was revealed. Ibn-e-Zaidah has reported it from Aamash, from Amr, from Ibn-e-zaidah has reported it from Aamash, from Amr, fro Ibn-e-Abi Laila, from Hadrat Zaid bin Arqam رضی اللہ عنہما with another chain.",
                "hadithUrdu": "جب عبداللہ بن ابی ابن سلول نے کہا کہ جو لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس ہیں ان پر خرچ نہ کرو یہ بھی کہا کہ اب اگر ہم مدینہ واپس گئے تو ہم سے عزت والا ذلیلوں کو نکال باہر کرے گا تو میں نے یہ خبر نبی کریم صلی اللہ علیہ وسلم تک پہنچائی۔ اس پر کفار نے مجھے ملامت کی اور عبداللہ بن ابی نے قسم کھا لی کہ اس نے یہ بات نہیں کہی تھی پھر میں گھر واپس آ گیا اور سو گیا۔ اس کے بعد مجھے نبی کریم صلی اللہ علیہ وسلم نے مجھے طلب فرمایا اور میں حاضر ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے تمہاری تصدیق میں آیت نازل کر دی ہے اور یہ آیت اتری ہے «هم الذين يقولون لا تنفقوا‏» الخ آخر تک۔ اور ابن ابی زائدہ نے اعمش سے بیان کیا، ان سے عمرو نے، ان سے ابن ابی لیلیٰ نے اور ان سے زید بن ارقم رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے اسی طرح نقل کیا۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے حکم نے بیان کیا، انہوں نے کہا کہ میں نے محمد بن کعب قرظی سے سنا، کہا کہ میں نے زید بن ارقم رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ كَعْبٍ الْقُرَظِيَّ، قَالَ سَمِعْتُ زَيْدَ بْنَ أَرْقَمَ ـ رضى الله عنه ـ قَالَ لَمَّا قَالَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ لاَ تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ‏.‏ وَقَالَ أَيْضًا لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ‏.‏ أَخْبَرْتُ بِهِ النَّبِيَّ صلى الله عليه وسلم فَلاَمَنِي الأَنْصَارُ، وَحَلَفَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ مَا قَالَ ذَلِكَ، فَرَجَعْتُ إِلَى الْمَنْزِلِ فَنِمْتُ فَدَعَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَتَيْتُهُ فَقَالَ ‏\"‏ إِنَّ اللَّهَ قَدْ صَدَّقَكَ ‏\"‏‏.‏ وَنَزَلَ ‏{‏هُمُ الَّذِينَ يَقُولُونَ لاَ تُنْفِقُوا‏}‏ الآيَةَ‏.‏ وَقَالَ ابْنُ أَبِي زَائِدَةَ عَنِ الأَعْمَشِ عَنْ عَمْرٍو عَنِ ابْنِ أَبِي لَيْلَى عَنْ زَيْدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏ذَلِكَ بِأَنَّهُمْ آمَنُوا ثُمَّ كَفَرُوا فَطُبِعَ عَلَى قُلُوبِهِمْ فَهُمْ لاَ يَفْقَهُونَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’یہ اس لیے کہ وہ ایمان لائے پھر کافر ہوئے، اس لیے ان کے دلوں پر مہر لگا دی گئی، اس لیے وہ سمجھتے نہیں۔ (V.63:3)",
                "headingEnglish": "The Statement of Allah ta'ala: \"That is because they believed, then disbelieved, therefore their hearts are sealed, so they understand not.\" (V.63:3)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4680,
                "hadithNumber": "4903",
                "englishNarrator": "Narrated Zaid bin Arqam:",
                "hadithEnglish": "We went out with the Prophet (ﷺ) : on a journey and the people suffered from lack of provisions. So `Abdullah bin Ubai said to his companions, \"Don't spend on those who are with Allah's Messenger (ﷺ), that they may disperse and go away from him.\" He also said, \"If we return to Medina, surely, the more honorable will expel therefrom the meaner. So I went to the Prophet (ﷺ) and informed him of that. He sent for `Abdullah bin Ubai and asked him, but `Abdullah bin Ubai swore that he did not say so. The people said, \"Zaid رضی اللہ عنہ told a lie to 'Allah's Messenger (ﷺ).\" What they said distressed me very much. Later Allah revealed the confirmation of my statement in his saying:-- '(When the hypocrites come to you.' (63.1) So the Prophet (ﷺ) called them that they might ask Allah to forgive them, but they turned their heads aside. (Concerning Allah's saying: 'Pieces of wood propped up,' Zaid رضی اللہ عنہ said; They were the most handsome men.)",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر ( غزوہ تبوک یا بنی مصطلق ) میں تھے جس میں لوگوں پر بڑے تنگ اوقات آئے تھے۔ عبداللہ بن ابی نے اپنے ساتھیوں سے کہا کہ جو لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس جمع ہیں ان پر کچھ خرچ مت کرو تاکہ وہ ان کے پاس سے منتشر ہو جائیں گے۔ اس نے یہ بھی کہا کہ اگر ہم اب مدینہ لوٹ کر جائیں گے تو عزت والا وہاں سے ذلیلوں کو نکال باہر کرے گا۔ میں نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر ان کی اس گفتگو کی اطلاع دی تو آپ نے عبداللہ بن ابی ابن سلول کو بلا کر پوچھا۔ اس نے بڑی قسمیں کھا کر کہا کہ میں نے ایسی کوئی بات نہیں کہی۔ لوگوں نے کہا کہ زید رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے سامنے جھوٹ بولا ہے۔ لوگوں کی اس طرح کی باتوں سے میں بڑا رنجیدہ ہوا یہاں تک کہ اللہ تعالیٰ نے میری تصدیق فرمائی اور یہ آیت نازل ہوئی «إذا جاءك المنافقون‏» الخ یعنی جب آپ کے پاس منافق آئے پھر نبی کریم صلی اللہ علیہ وسلم نے انہیں بلایا تاکہ ان کے لیے مغفرت کی دعا کریں لیکن انہوں نے اپنے سر پھیر لیے۔ زید رضی اللہ عنہ نے بیان کیا کہ اللہ تعالیٰ کے ارشاد «خشب مسندة‏» گویا وہ بہت بڑے لکڑی کے کھمبے ہیں ( ان کے متعلق اس لیے کہا گیا کہ ) وہ بڑے خوبصورت اور ڈیل ڈول معقول مگر دل میں منافق تھے۔",
                "urduNarrator": "ہم سے عمرو بن خالد نے بیان کیا، کہا ہم سے زہیر بن معاویہ نے بیان کیا، کہا ہم سے ابواسحاق نے بیان کیا، کہا کہ میں نے زید بن ارقم رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ زَيْدَ بْنَ أَرْقَمَ، قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ أَصَابَ النَّاسَ فِيهِ شِدَّةٌ، فَقَالَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ لأَصْحَابِهِ لاَ تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ حَتَّى يَنْفَضُّوا مِنْ حَوْلِهِ‏.‏ وَقَالَ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ‏.‏ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرْتُهُ فَأَرْسَلَ إِلَى عَبْدِ اللَّهِ بْنِ أُبَىٍّ فَسَأَلَهُ، فَاجْتَهَدَ يَمِينَهُ مَا فَعَلَ، قَالُوا كَذَبَ زَيْدٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَوَقَعَ فِي نَفْسِي مِمَّا قَالُوا شِدَّةٌ، حَتَّى أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ تَصْدِيقِي فِي ‏{‏إِذَا جَاءَكَ الْمُنَافِقُونَ‏}‏ فَدَعَاهُمُ النَّبِيُّ صلى الله عليه وسلم لِيَسْتَغْفِرَ لَهُمْ فَلَوَّوْا رُءُوسَهُمْ‏.‏ وَقَوْلُهُ ‏{‏خُشُبٌ مُسَنَّدَةٌ‏}‏ قَالَ كَانُوا رِجَالاً أَجْمَلَ شَىْءٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4681,
                "hadithNumber": "4904",
                "englishNarrator": "Narrated Zaid bin Arqam رضی اللہ عنہما :",
                "hadithEnglish": "While I was with my uncle, I heard `Abdullah bin Ubai bin Salul saying, \"Do not spend on those who are with Allah's Messenger (ﷺ), that they may disperse and go away (from him). And if we return to Medina, surely, the more honorable will expel therefrom the meaner. \"I mentioned that to my uncle who, in turn, mentioned it to the Prophet. The Prophet (ﷺ) called me and I told him about that. Then he sent for `Abdullah bin Ubai and his companions, and they swore that they did not say so. The Prophet (ﷺ) disbelieved my statement and believed theirs. I was distressed as I have never been before, and I remained in my house. My uncle said to me, \"You just wanted the Prophet (ﷺ) to consider you a liar and hate you.\" Then Allah revealed:-- 'When the hypocrites come to you, they say: 'We bear witness that you are indeed the Apostle of Allah.\" (63.1) So the Prophet (ﷺ) sent for me and recited it and said, \"Allah has confirmed your statement.\"",
                "hadithUrdu": "میں نے اپنے چچا کے ساتھ تھا میں نے عبداللہ بن ابی ابن سلول کو کہتے سنا کہ جو لوگ رسول ( صلی اللہ علیہ وسلم ) کے پاس ہیں ان پر کچھ خرچ نہ کرو تاکہ وہ منتشر ہو جائیں اور اگر اب ہم مدینہ واپس لوٹیں گے تو ہم میں سے جو عزت والے ہیں ان ذلیلوں کو نکال باہر کر دیں گے۔ میں نے اس کا ذکر اپنے چچا سے کیا اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے کہا جب نبی کریم صلی اللہ علیہ وسلم نے ان ہی کی تصدیق کر دی تو مجھے اس کا اتنا افسوس ہوا کہ پہلے کبھی کسی بات پر نہ ہوا ہو گا، میں غم سے اپنے گھر میں بیٹھ گیا۔ میرے چچا نے کہا کہ تمہارا کیا ایسا خیال تھا کہ نبی کریم صلی اللہ علیہ وسلم نے تمہیں جھٹلایا اور تم پر خفا ہوئے ہیں؟ پھر اللہ تعالیٰ نے یہ آیت نازل کی «إذا جاءك المنافقون قالوا نشهد إنك لرسول الله‏» ”جب منافق آپ کے پاس آتے ہیں تو کہتے ہیں کہ آپ بیشک اللہ کے رسول ہیں“ نبی کریم صلی اللہ علیہ وسلم نے مجھے بلوا کر اس آیت کی تلاوت فرمائی اور فرمایا کہ اللہ تعالیٰ نے تمہاری تصدیق نازل کر دی ہے۔",
                "urduNarrator": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا، ان سے اسرائیل نے بیان کیا، ان سے ابواسحاق نے اور ان سے زید بن ارقم رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ كُنْتُ مَعَ عَمِّي فَسَمِعْتُ عَبْدَ اللَّهِ بْنَ أُبَىٍّ ابْنَ سَلُولَ، يَقُولُ لاَ تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ حَتَّى يَنْفَضُّوا، وَلَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ‏.‏ فَذَكَرْتُ ذَلِكَ لِعَمِّي، فَذَكَرَ عَمِّي لِلنَّبِيِّ صلى الله عليه وسلم ‏{‏فَدَعَانِي فَحَدَّثْتُهُ، فَأَرْسَلَ إِلَى عَبْدِ اللَّهِ بْنِ أُبَىٍّ وَأَصْحَابِهِ فَحَلَفُوا مَا قَالُوا، وَكَذَّبَنِي النَّبِيُّ صلى الله عليه وسلم‏}‏ وَصَدَّقَهُمْ، فَأَصَابَنِي غَمٌّ لَمْ يُصِبْنِي مِثْلُهُ قَطُّ، فَجَلَسْتُ فِي بَيْتِي وَقَالَ عَمِّي مَا أَرَدْتَ إِلَى أَنْ كَذَّبَكَ النَّبِيُّ صلى الله عليه وسلم وَمَقَتَكَ‏.‏ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِذَا جَاءَكَ الْمُنَافِقُونَ قَالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ اللَّهِ‏}‏ وَأَرْسَلَ إِلَىَّ النَّبِيُّ صلى الله عليه وسلم فَقَرَأَهَا وَقَالَ ‏\"‏ إِنَّ اللَّهَ قَدْ صَدَّقَكَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَإِذَا قِيلَ لَهُمْ تَعَالَوْا يَسْتَغْفِرْ لَكُمْ رَسُولُ اللَّهِ لَوَّوْا رُءُوسَهُمْ وَرَأَيْتَهُمْ يَصُدُّونَ وَهُمْ مُسْتَكْبِرُونَ‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’اور جب ان سے کہا جاتا ہے کہ آؤ تاکہ اللہ کے رسول تمہارے لیے استغفار کریں، تو وہ اپنے سر پھیر لیتے ہیں اور تم دیکھتے ہو کہ وہ منہ پھیر رہے ہیں۔ فخر\" (V.63:5)",
                "headingEnglish": "The Statement of Allah the Exalted: \"And when it is said to them: 'Come, so that the Messenger of Allah may ask forgiveness from Allah for you,' they turn aside their heads, and you would see them turning away their faces in pride.\" (V.63:5)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4682,
                "hadithNumber": "4905",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "We were in a Ghazwa (Sufyan once said, in an army) and a man from the emigrants kicked an Ansari man (on the buttocks with his foot). The Ansari man said, \"O the Ansar! (Help!)\" and the emigrant said. \"O the emigrants! (Help!) Allah's Messenger (ﷺ) heard that and said, \"What is this call for, which is characteristic of the period of ignorance?\" They said, \"O Allah's Messenger (ﷺ)! A man from the emigrants kicked one of the Ansar (on the buttocks with his foot).\" Allah's Messenger (ﷺ) said, \"Leave it (that call) as is a detestable thing.\" `Abdullah bin Ubai heard that and said, 'Have the (the emigrants) done so? By Allah, if we return Medina, surely, the more honorable will expel therefrom the meaner.\" When this statement reached the Prophet. `Umar رضی اللہ عنہ got up an, said, \"O Allah's Messenger (ﷺ)! Let me chop off the head of this hypocrite (`Abdullah bin Ubai)!\" The Prophet (ﷺ) said \"Leave him, lest the people say that Muhammad kills his companions.\" The Ansar were then more in number than the emigrants when the latter came to Medina, but later on the emigrant increased. Sufyan narrates: I have memorized this Hadith after hearing it from Amr bin Dinnar, and he would say that he heard Hadrat Jabir bin Dinnar رضی اللہ عنہ, and he would say that he heard Hadrat Jabir bin Abdullah رضی اللہ عنہ say: We were accompanying the prophet ﷺ.",
                "hadithUrdu": "ہم ایک غزوہ ( غزوہ تبوک ) میں تھے۔ سفیان نے ایک مرتبہ ( بجائے غزوہ کے ) جیش ( لشکر ) کا لفظ کہا۔ مہاجرین میں سے ایک آدمی نے انصار کے ایک آدمی کو لات مار دی۔ انصاری نے کہا کہ اے انصاریو! دوڑو اور مہاجر نے کہا اے مہاجرین! دوڑو۔ تو رسول اللہ صلی اللہ علیہ وسلم نے بھی اسے سنا اور فرمایا کیا قصہ ہے؟ یہ جاہلیت کی پکار کیسی ہے؟ لوگوں نے بتایا کہ یا رسول اللہ! ایک مہاجر نے ایک انصاری کو لات سے مار دیا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس طرح جاہلیت کی پکار کو چھوڑ دو کہ یہ نہایت ناپاک باتیں ہیں۔ عبداللہ بن ابی نے بھی یہ بات سنی تو کہا اچھا اب یہاں تک نوبت پہنچ گئی۔ خدا کی قسم! جب ہم مدینہ لوٹیں گے تو ہم سے عزت والا ذلیلوں کو نکال کر باہر کر دے گا۔ اس کی خبر نبی کریم صلی اللہ علیہ وسلم کو پہنچ گئی۔ عمر رضی اللہ عنہ نے کھڑے ہو کر عرض کیا: یا رسول اللہ! مجھے اجازت دیں کہ میں اس منافق کو ختم کر دوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسے چھوڑ دو تاکہ لوگ یہ نہ کہیں کہ محمد ( صلی اللہ علیہ وسلم ) اپنے ساتھیوں کو قتل کرا دیتے ہیں۔ جب مہاجرین مدینہ منورہ میں آئے تو انصار کی تعداد سے ان کی تعداد کم تھی۔ لیکن بعد میں ان مہاجرین کی تعداد زیادہ ہو گئی تھی۔ سفیان نے بیان کیا کہ میں نے حدیث عمرو بن دینار سے یاد کی، عمرو نے بیان کیا کہ میں نے جابر رضی اللہ عنہ سے سنا کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا کہ ان سے عمرو بن دینار نے بیان کیا اور انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كُنَّا فِي غَزَاةٍ ـ قَالَ سُفْيَانُ مَرَّةً فِي جَيْشٍ ـ فَكَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِينَ رَجُلاً مِنَ الأَنْصَارِ فَقَالَ الأَنْصَارِيُّ يَا لَلأَنْصَارِ‏.‏ وَقَالَ الْمُهَاجِرِيُّ يَا لَلْمُهَاجِرِينَ‏.‏ فَسَمِعَ ذَاكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا بَالُ دَعْوَى جَاهِلِيَّةٍ ‏\"‏ قَالُوا يَا رَسُولَ اللَّهِ كَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِينَ رَجُلاً مِنَ الأَنْصَارِ‏.‏ فَقَالَ ‏\"‏ دَعُوهَا فَإِنَّهَا مُنْتِنَةٌ ‏\"‏‏.‏ فَسَمِعَ بِذَلِكَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ فَقَالَ فَعَلُوهَا، أَمَا وَاللَّهِ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ‏.‏ فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَقَامَ عُمَرُ فَقَالَ يَا رَسُولَ اللَّهِ دَعْنِي أَضْرِبْ عُنُقَ هَذَا الْمُنَافِقِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعْهُ لاَ يَتَحَدَّثُ النَّاسُ أَنَّ مُحَمَّدًا يَقْتُلُ أَصْحَابَهُ ‏\"‏ وَكَانَتِ الأَنْصَارُ أَكْثَرَ مِنَ الْمُهَاجِرِينَ حِينَ قَدِمُوا الْمَدِينَةَ، ثُمَّ إِنَّ الْمُهَاجِرِينَ كَثُرُوا بَعْدُ‏.‏ قَالَ سُفْيَانُ فَحَفِظْتُهُ مِنْ عَمْرٍو قَالَ عَمْرٌو سَمِعْتُ جَابِرًا كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏سَوَاءٌ عَلَيْهِمْ أَسْتَغْفَرْتَ لَهُمْ أَمْ لَمْ تَسْتَغْفِرْ لَهُمْ لَنْ يَغْفِرَ اللَّهُ لَهُمْ إِنَّ اللَّهَ لاَ يَهْدِي الْقَوْمَ الْفَاسِقِينَ‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’ان کے لیے برابر ہے خواہ آپ (صلی اللہ علیہ وسلم) ان کے لیے استغفار کریں‘‘۔ (V.63:6)",
                "headingEnglish": "The Statement of Allah the Exalted: \"It is equal to them whether you (Muḥammad pbuh) ask for their forgiveness.. .\" (V.63:6)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4683,
                "hadithNumber": "4906",
                "englishNarrator": "Narrated Musa bin `Uqba:",
                "hadithEnglish": "`Abdullah bin Al-Fadl told me that Anas bin Malik رضی اللہ عنہ said, \"I was much grieve over those who had been killed in the Battle of Al-Harra. When Zaid bin Arqam رضی اللہ عنہما heard of my intense grief (over the killed Ansar), he wrote a letter to me saying that he heard Allah's Messenger (ﷺ) saying, O Allah! Forgive the Ansar and the Ansar children. The subnarrator, Ibn Al-Fadl, is not sure whether the Prophet (ﷺ) also said, And their grand-children.\" Some of those who were present, asked Anas رضی اللہ عنہ (about Zaid). He said, \"He (Zaid) is the one about whom Allah's Messenger (ﷺ) said, 'He is the one whose sound hearing Allah testified.'",
                "hadithUrdu": "مجھ سے عبداللہ بن فضل نے بیان کیا اور انہوں نے انس بن مالک رضی اللہ عنہ سے ان کا بیان نقل کیا کہ مقام حرہ میں جو لوگ شہید کر دیئے گئے تھے ان پر مجھے بڑا رنج ہوا۔ زید بن ارقم رضی اللہ عنہما کو میرے غم کی اطلاع پہنچی تو انہوں نے مجھے لکھا کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے، آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ اے اللہ! انصار کی مغفرت فرما اور ان کے بیٹوں کی بھی مغفرت فرما۔ عبداللہ بن فضل کو اس میں شک تھا کہ آپ نے انصار کے بیٹوں کے بیٹوں کا بھی ذکر کیا تھا یا نہیں۔ انس رضی اللہ عنہ سے ان کی مجلس کے حاضرین میں سے کسی نے سوال کیا تو انہوں نے کہا کہ زید بن ارقم رضی اللہ عنہما ہی وہ ہیں جن کے سننے کی اللہ تعالیٰ نے تصدیق کی تھی۔",
                "urduNarrator": "ہم سے اسماعیل بن عبداللہ نے بیان کیا، انہوں نے کہا کہ مجھ سے اسماعیل بن ابراہیم بن عقبہ نے بیان کیا، ان سے موسیٰ بن عقبہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ بْنِ عُقْبَةَ، عَنْ مُوسَى بْنِ عُقْبَةَ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ الْفَضْلِ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ حَزِنْتُ عَلَى مَنْ أُصِيبَ بِالْحَرَّةِ فَكَتَبَ إِلَىَّ زَيْدُ بْنُ أَرْقَمَ وَبَلَغَهُ شِدَّةُ حُزْنِي يَذْكُرُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ اللَّهُمَّ اغْفِرْ لِلأَنْصَارِ وَلأَبْنَاءِ الأَنْصَارِ ‏\"‏ ـ وَشَكَّ ابْنُ الْفَضْلِ فِي أَبْنَاءِ أَبْنَاءِ الأَنْصَارِ ـ فَسَأَلَ أَنَسًا بَعْضُ مَنْ كَانَ عِنْدَهُ فَقَالَ هُوَ الَّذِي يَقُولُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا الَّذِي أَوْفَى اللَّهُ لَهُ بِأُذُنِهِ ‏\"‏‏.‏",
                "headingArabic": "{‏وَلِلَّهِ خَزَائِنُ السَّمَوَاتِ وَالأَرْضِ وَلَكِنَّ الْمُنَافِقِينَ لاَ يَفْقَهُونَ‏}",
                "headingUrdu": "’’اور آسمانوں اور زمین کے خزانے اللہ ہی کے ہیں لیکن منافق نہیں سمجھتے۔‘‘ (63:7)",
                "headingEnglish": "\"And to Allah belong the treasures of the heavens and the earth, but the hypocrites comprehend not.\" (63:7)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4684,
                "hadithNumber": "4907",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "We were in a Ghazwa and a man from the emigrants kicked an Ansari (on the buttocks with his foot). The Ansari man said, \"O the Ansari! (Help!)\" The emigrant said, \"O the emigrants! (Help).\" When Allah's Messenger (ﷺ) heard that, he said, \"What is that?\" They said, \"A man from the emigrants kicked a man from the Ansar (on the buttocks his foot). On that the Ansar said, 'O the Ansar!' and the emigrant said, 'O the emigrants!\" The Prophet (ﷺ) said' \"Leave it (that call) for it Is a detestable thing.\" Hadrat Jabir رضی اللہ عنہ said: The number of Ansar was larger (than that of the emigrants) at the time when the Prophet (ﷺ) came to Medina, but later the number of emigrants increased. `Abdullah bin Ubai said, \"Have they, (the emigrants) done so? By Allah, if we return to Medina, surely, the more honorable will expel therefrom the meaner,\" `Umar bin Al-Khattab رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! Let me chop off the head of this hypocrite!\" The Prophet said, \"Leave him, lest the people say Muhammad kills his companions:\"",
                "hadithUrdu": "ہم ایک غزوہ میں تھے، اچانک مہاجرین کے ایک آدمی نے انصاری کے ایک آدمی کو مار دیا۔ انصار نے کہا: اے انصاریو! دوڑو اور مہاجر نے کہا: اے مہاجرین! دوڑو۔ اللہ تعالیٰ نے یہ اپنے رسول صلی اللہ علیہ وسلم کو بھی سنایا۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کیا بات ہے؟ لوگوں نے بتایا کہ ایک مہاجر نے ایک انصاری کو مار دیا ہے۔ اس پر انصاری نے کہا کہ اے انصاریو! دوڑو اور مہاجر نے کہا کہ اے مہاجرین! دوڑو۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اس طرح پکارنا چھوڑ دو کہ یہ نہایت ناپاک باتیں ہیں۔ جابر رضی اللہ عنہ نے بیان کیا کہ جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو شروع میں انصار کی تعداد زیادہ تھی لیکن بعد میں مہاجرین زیادہ ہو گئے تھے۔ عبداللہ بن ابی نے کہا اچھا اب نوبت یہاں تک پہنچ گئی ہے۔ اللہ کی قسم! مدینہ واپس ہو کر عزت والے ذلیلوں کو باہر نکال دیں گے۔ عمر بن خطاب رضی اللہ عنہ نے کہا: یا رسول اللہ! اجازت ہو تو اس منافق کی گردن اڑا دوں۔ تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ورنہ لوگ یوں کہیں گے محمد ( صلی اللہ علیہ وسلم ) اپنے ساتھیوں کو قتل کرانے لگے ہیں۔",
                "urduNarrator": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا، انہوں نے کہا کہ ہم نے یہ حدیث عمرو بن دینار سے یاد کی، انہوں نے بیان کیا کہ میں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا، وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، قَالَ حَفِظْنَاهُ مِنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ كُنَّا فِي غَزَاةٍ فَكَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِينَ رَجُلاً مِنَ الأَنْصَارِ فَقَالَ الأَنْصَارِيُّ يَا لَلأَنْصَارِ‏.‏ وَقَالَ الْمُهَاجِرِيُّ يَا لَلْمُهَاجِرِينَ‏.‏ فَسَمَّعَهَا اللَّهُ رَسُولَهُ صلى الله عليه وسلم قَالَ ‏\"‏ مَا هَذَا ‏\"‏‏.‏ فَقَالُوا كَسَعَ رَجُلٌ مِنَ الْمُهَاجِرِينَ رَجُلاً مِنَ الأَنْصَارِ فَقَالَ الأَنْصَارِيُّ يَا لَلأَنْصَارِ‏.‏ وَقَالَ الْمُهَاجِرِيُّ يَالَلْمُهَاجِرِينَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعُوهَا فَإِنَّهَا مُنْتِنَةٌ ‏\"‏‏.‏ قَالَ جَابِرٌ وَكَانَتِ الأَنْصَارُ حِينَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم أَكْثَرَ، ثُمَّ كَثُرَ الْمُهَاجِرُونَ بَعْدُ، فَقَالَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ أَوَقَدْ فَعَلُوا، وَاللَّهِ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ رضى الله عنه دَعْنِي يَا رَسُولَ اللَّهِ أَضْرِبْ عُنُقَ هَذَا الْمُنَافِقِ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعْهُ لاَ يَتَحَدَّثُ النَّاسُ أَنَّ مُحَمَّدًا يَقْتُلُ أَصْحَابَهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4685,
                "hadithNumber": "4908",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "He had divorced his wife while she was in her menses so `Umar رضی اللہ عنہ informed Allah's Messenger (ﷺ) of that. Allah's Messenger (ﷺ) became very angry at that and said, \"(Ibn `Umar رضی اللہ عنہ must return her to his house and keep her as his wife till she becomes clean and then menstruates and becomes clean again, whereupon, if he wishes to divorce her, he may do so while she is still clean and before having any sexual relations with her, for that is the legally prescribed period for divorce as Allah has ordered.\"",
                "hadithUrdu": "انہوں نے اپنی بیوی آمنہ بنت غفار کو جبکہ وہ حائضہ تھیں طلاق دے دی۔ عمر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اس کا ذکر کیا۔ آپ اس پر بہت غصہ ہوئے اور فرمایا کہ وہ ان سے ( اپنی بیوی سے ) رجوع کر لیں اور اپنے نکاح میں رکھیں یہاں تک کہ وہ ماہواری سے پاک ہو جائے پھر ماہواری آئے اور پھر وہ اس سے پاک ہو، اب اگر وہ طلاق دینا مناسب سمجھیں تو اس کی پاکی ( طہر ) کے زمانہ میں ان کے ساتھ ہمبستری سے پہلے طلاق دے سکتے ہیں بس یہی وہ وقت ہے جس میں اللہ تعالیٰ نے ( مردوں کو ) حکم دیا ہے کہ اس میں یعنی حالت طہر میں طلاق دیں۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، کہا کہ مجھ سے عقیل نے بیان کیا، ان سے ابن شہاب نے بیان کیا، کہا مجھ کو سالم نے خبر دی اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَالِمٌ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّهُ، طَلَّقَ امْرَأَتَهُ وَهْىَ حَائِضٌ، فَذَكَرَ عُمَرُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَتَغَيَّظَ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏ \"‏ لِيُرَاجِعْهَا ثُمَّ يُمْسِكْهَا حَتَّى تَطْهُرَ، ثُمَّ تَحِيضَ فَتَطْهُرَ، فَإِنْ بَدَا لَهُ أَنْ يُطَلِّقَهَا فَلْيُطَلِّقْهَا طَاهِرًا قَبْلَ أَنْ يَمَسَّهَا فَتِلْكَ الْعِدَّةُ كَمَا أَمَرَهُ اللَّهُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏يَقُولُونَ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ وَلِلَّهِ الْعِزَّةُ وَلِرَسُولِهِ وَلِلْمُؤْمِنِينَ وَلَكِنَّ الْمُنَافِقِينَ لاَ يَعْلَمُونَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’وہ (منافقین) کہتے ہیں: اگر ہم مدینہ کی طرف لوٹے تو یقیناً زیادہ عزت والے ذلیل کو وہاں سے نکال دیں گے۔‘‘ (آیت 63:8)",
                "headingEnglish": "The Statement of Allah ta'ala: \"They (hypocrites) say: 'If we return to Al- Madīna, indeed the more honourable will expel therefrom the meaner...\" (V.63:8)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4686,
                "hadithNumber": "4909",
                "englishNarrator": "Narrated Abu Salama:",
                "hadithEnglish": "A man came to Ibn `Abbas رضی اللہ عنہما while Abu Huraira رضی اللہ عنہ was sitting with him and said, \"Give me your verdict regarding a lady who delivered a baby forty days after the death of her husband.\" Ibn `Abbas رضی اللہ عنہما said, \"This indicates the end of one of the two prescribed periods.\" I said \"For those who are pregnant, their prescribed period is until they deliver their burdens.\" Abu Huraira رضی اللہ عنہ said, I agree with my cousin (Abu Salama).\" Then Ibn `Abbas رضی اللہ عنہما sent his slave, Kuraib to Um Salama رضی اللہ عنہا to ask her (regarding this matter). She replied. \"The husband of Subai'a al Aslamiya was killed while she was pregnant, and she delivered a baby forty days after his death. Then her hand was asked in marriage and Allah's Messenger (ﷺ) married her (to somebody). Abu As-Sanabil was one of those who asked for her hand in marriage\".",
                "hadithUrdu": "ایک شخص ابن عباس رضی اللہ عنہما کے پاس آیا ابوہریرہ رضی اللہ عنہ بھی ان کے پاس بیٹھے ہوئے تھے۔ آنے والے نے پوچھا کہ آپ مجھے اس عورت کے متعلق مسئلہ بتائیے جس نے اپنے شوہر کی وفات کے چار مہینے بعد بچہ جنا؟ ابن عباس رضی اللہ عنہما نے کہا کہ جس کا خاوند فوت ہو وہ عدت کی دو مدتوں میں جو مدت لمبی ہو اس کی رعایت کرے۔ ( ابوسلمہ نے بیان کیا کہ ) میں نے عرض کیا کہ ( قرآن مجید میں تو ان کی عدت کا یہ حکم ہے ) حمل والیوں کی عدت ان کے حمل کا پیدا ہو جانا ہے۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ میں بھی اس مسئلہ میں اپنے بھتیجے کے ساتھ ہوں۔ ان کی مراد ابوسلمہ بن عبدالرحمٰن سے تھی آخر ابن عباس رضی اللہ عنہما نے اپنے غلام کریب کو ام المؤمنین ام سلمہ رضی اللہ عنہا کی خدمت میں بھیجا یہی مسئلہ پوچھنے کے لیے۔ ام المؤمنین نے بتایا کہ سبیعہ اسلمیہ کے شوہر ( سعد بن خولہ رضی اللہ عنہما ) شہید کر دیئے گئے تھے وہ اس وقت حاملہ تھیں شوہر کی موت کے چالیس دن بعد ان کے یہاں بچہ پیدا ہوا پھر ان کے پاس نکاح کا پیغام پہنچا اور رسول اللہ صلی اللہ علیہ وسلم نے ان کا نکاح کر دیا۔ ابوالسنابل بھی ان کے پاس پیغام نکاح بھیجنے والوں میں سے تھے۔",
                "urduNarrator": "ہم سے سعد بن حفص نے بیان کیا، کہا ہم سے شیبان نے بیان کیا، ان سے یحییٰ نے بیان کیا، کہا مجھے ابوسلمہ بن عبدالرحمٰن نے خبر دی، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، قَالَ جَاءَ رَجُلٌ إِلَى ابْنِ عَبَّاسٍ وَأَبُو هُرَيْرَةَ جَالِسٌ عِنْدَهُ فَقَالَ أَفْتِنِي فِي امْرَأَةٍ وَلَدَتْ بَعْدَ زَوْجِهَا بِأَرْبَعِينَ لَيْلَةً‏.‏ فَقَالَ ابْنُ عَبَّاسٍ آخِرُ الأَجَلَيْنِ‏.‏ قُلْتُ أَنَا ‏{‏وَأُولاَتُ الأَحْمَالِ أَجَلُهُنَّ أَنْ يَضَعْنَ حَمْلَهُنَّ‏}‏ قَالَ أَبُو هُرَيْرَةَ أَنَا مَعَ ابْنِ أَخِي ـ يَعْنِي أَبَا سَلَمَةَ ـ فَأَرْسَلَ ابْنُ عَبَّاسٍ غُلاَمَهُ كُرَيْبًا إِلَى أُمِّ سَلَمَةَ يَسْأَلُهَا فَقَالَتْ قُتِلَ زَوْجُ سُبَيْعَةَ الأَسْلَمِيَّةِ وَهْىَ حُبْلَى، فَوَضَعَتْ بَعْدَ مَوْتِهِ بِأَرْبَعِينَ لَيْلَةً فَخُطِبَتْ فَأَنْكَحَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَانَ أَبُو السَّنَابِلِ فِيمَنْ خَطَبَهَا‏.‏",
                "headingArabic": "‏{‏وَأُولاَتُ الأَحْمَالِ أَجَلُهُنَّ أَنْ يَضَعْنَ حَمْلَهُنَّ وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مِنْ أَمْرِهِ يُسْرًا‏}‏‏.‏ وَأُولاَتُ الأَحْمَالِ وَاحِدُهَا ذَاتُ حَمْلٍ",
                "headingUrdu": ". ’’اور جو حاملہ ہوں (خواہ وہ طلاق یافتہ ہوں یا ان کے شوہر فوت ہوچکے ہوں) ان کی عدت اس وقت تک ہے جب تک کہ وہ اپنا بوجھ نہ اٹھالیں، اور جو شخص اللہ سے ڈرتا ہے اور اس سے ڈرتا ہے تو اللہ تعالیٰ اس کی عدت کو قبول کرتا ہے۔ اس کے لیے اس کا معاملہ آسان کر دے\"۔ (V.65:4)",
                "headingEnglish": ". \"... And for those who are pregnant (whether they are divorced or their husbands are dead), their 'Idda (prescribed period) is until they lay down their burdens, and whoever keeps his duty to Allah and fears Him, He will make his matter easy for him.\" (V.65:4)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4687,
                "hadithNumber": "4910",
                "englishNarrator": "Narrated Muhammad bin Sireen:",
                "hadithEnglish": "He was sitting in the meeting wherein Hadrat Hadrat Abdur Rehman bin Abu Laila was also present and his Companions would respect him. So, he mentioned the both prescribed waiting periods, so I, with reference to Abdullah bin Utbah, narrated the episode of Hadrat Sobaiah, the daughter of Harith.  Thereupon, some of his Companions beckoned to me. I got it and said: It means I am daring to fasten falsehood to Abdullah bin Utbah whereas he lived in the outskirts of Koufah. So, he (who beckoned) got ashamed, but Hadrat Abdur Rehman said: His uncle does not say so. Then I met Abu Atiyyah Malik bin Amir and asked him, and he narrated me the Hadith of Sobaiah. I, thereafter, asked him whether he had heard anything from Hadrat Abdullah (bin Masoud) رضی اللہ عنہ in this regard, he said: We were in the company of Hadrat Abdullah (bin Masoud) رضی اللہ عنہ and he said: Do you put her in difficulty and ignore facility in her matter? The verse imposing short waiting period was revealed after the verse enjoining long waiting period i.e. ''And the period of the pregnent women is when they give birth to children.''",
                "hadithUrdu": "میں ایک مجلس میں جس میں عبدالرحمٰن بن ابی لیلیٰ بھی تھے موجود تھا۔ ان کے شاگرد ان کی بہت عزت کیا کرتے تھے۔ میں نے وہاں سبیعہ بنت الحارث کا عبداللہ بن عتبہ بن مسعود سے بیان کیا کہ اس پر ان کے شاگرد نے زبان اور آنکھوں کے اشارے سے ہونٹ کاٹ کر مجھے تنبیہ کی۔ محمد بن سیرین نے بیان کیا کہ میں سمجھ گیا اور کہا کہ عبداللہ بن عتبہ کوفہ میں ابھی زندہ موجود ہیں۔ اگر میں ان کی طرف بھی جھوٹ نسبت کرتا ہوں تو بڑی جرات کی بات ہو گی مجھے تنبیہ کرنے والے صاحب اس پر شرمندہ ہو گئے اور عبدالرحمٰن بن ابی لیلیٰ نے کہا لیکن ان کے چچا تو یہ بات نہیں کرتے تھے۔ ( ابن سیرین نے بیان کیا کہ ) پھر میں ابوعطیہ مالک بن عامر سے ملا اور ان سے یہ مسئلہ پوچھا وہ بھی سبیعہ والی حدیث بیان کرنے لگے لیکن میں نے ان سے کہا آپ نے عبداللہ بن مسعود رضی اللہ عنہ سے بھی اس سلسلہ میں کچھ سنا ہے؟ انہوں نے بیان کیا کہ ہم عبداللہ بن مسعود رضی اللہ عنہ کی خدمت میں حاضر تھے تو انہوں نے کہا کیا تم اس پر ( جس کے شوہر کا انتقال ہو گیا اور وہ حاملہ ہو۔ عدت کی مدت کو طول دے کر ) سختی کرنا چاہتے ہو اور رخصت و سہولت دینے کے لیے تیار نہیں، بات یہ ہے کہ چھوٹی سورۃ نساء یعنی ( سورۃ الطلاق ) بڑی سورۃ النساء کے بعد نازل ہوئی ہے اور کہا «وأولات الأحمال أجلهن أن يضعن حملهن‏» الایۃ اور حمل والیوں کی عدت ان کے حمل کا پیدا ہو جانا ہے۔",
                "urduNarrator": "اور سلیمان بن حرب اور النعمان نے بیان کیا، کہ ہم سے حماد بن زید نے بیان کیا، ان سے ایوب نے اور ان سے محمد بن سیرین نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ سُلَيْمَانُ بْنُ حَرْبٍ وَأَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، قَالَ كُنْتُ فِي حَلْقَةٍ فِيهَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى وَكَانَ أَصْحَابُهُ يُعَظِّمُونَهُ، فَذَكَرَ آخِرَ الأَجَلَيْنِ فَحَدَّثْتُ بِحَدِيثِ سُبَيْعَةَ بِنْتِ الْحَارِثِ عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ قَالَ فَضَمَّزَ لِي بَعْضُ أَصْحَابِهِ‏.‏ قَالَ مُحَمَّدٌ فَفَطِنْتُ لَهُ فَقُلْتُ إِنِّي إِذًا لَجَرِيءٌ إِنْ كَذَبْتُ عَلَى عَبْدِ اللَّهِ بْنِ عُتْبَةَ وَهْوَ فِي نَاحِيَةِ الْكُوفَةِ‏.‏ فَاسْتَحْيَا وَقَالَ لَكِنَّ عَمَّهُ لَمْ يَقُلْ ذَاكَ‏.‏ فَلَقِيتُ أَبَا عَطِيَّةَ مَالِكَ بْنَ عَامِرٍ فَسَأَلْتُهُ فَذَهَبَ يُحَدِّثُنِي حَدِيثَ سُبَيْعَةَ فَقُلْتُ هَلْ سَمِعْتَ عَنْ عَبْدِ اللَّهِ فِيهَا شَيْئًا فَقَالَ كُنَّا عِنْدَ عَبْدِ اللَّهِ فَقَالَ أَتَجْعَلُونَ عَلَيْهَا التَّغْلِيظَ وَلاَ تَجْعَلُونَ عَلَيْهَا الرُّخْصَةَ‏.‏ لَنَزَلَتْ سُورَةُ النِّسَاءِ الْقُصْرَى بَعْدَ الطُّولَى ‏{‏وَأُولاَتُ الأَحْمَالِ أَجَلُهُنَّ أَنْ يَضَعْنَ حَمْلَهُنَّ‏}‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4688,
                "hadithNumber": "4911",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "If someone says to his wife, \"You are unlawful to me.\" he must make an expiation (for his oath). Ibn `Abbas رضی اللہ عنہما added: There is for you in Allah's Messenger (ﷺ), an excellent example to follow.",
                "hadithUrdu": "اگر کسی نے اپنے اوپر کوئی حلال چیز حرام کر لی تو اس کا کفارہ دینا ہو گا۔ ابن عباس رضی اللہ عنہما نے کہا «لقد كان لكم في رسول الله إسوة حسنة‏» یعنی ”بیشک تمہارے لیے تمہارے رسول اللہ کی زندگی میں بہترین نمونہ ہے۔“",
                "urduNarrator": "ہم سے معاذ بن فضالہ نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، ان سے یحییٰ بن سعید قطان نے، ان سے ابن حکیم نے، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما   نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنِ ابْنِ حَكِيمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، أَنَّ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ فِي الْحَرَامِ يُكَفِّرُ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ إِسْوَةٌ حَسَنَةٌ‏}‏‏.‏",
                "headingArabic": "{‏يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ تَبْتَغِي مَرْضَاةَ أَزْوَاجِكَ وَاللَّهُ غَفُورٌ رَحِيمٌ‏}‏",
                "headingUrdu": "\"اے نبی! اللہ نے آپ کو جس چیز کی اجازت دی ہے اسے آپ (اپنے لیے) کیوں حرام کرتے ہیں؟\" (V.66:1)",
                "headingEnglish": "\"O Prophet! Why do you forbid (for yourself) that which Allah has allowed to you?...\" (V.66:1)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4689,
                "hadithNumber": "4912",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to drink honey in the house of Zainab رضی اللہ عنہا , the daughter of Jahsh, and would stay there with her. So Hafsa  رضی اللہ عنہا and I agreed secretly that, if he come to either of us, she would say to him. \"It seems you have eaten Maghafir (a kind of bad-smelling resin), for I smell in you the smell of Maghafir,\" (We did so) and he replied. \"No, but I was drinking honey in the house of Zainab, the daughter of Jahsh, and I shall never take it again. I have taken an oath as to that, and you should not tell anybody about it.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم زینب بنت جحش رضی اللہ عنہا کے گھر میں شہد پیتے اور وہاں ٹھہرتے تھے پھر میں نے اور حفصہ رضی اللہ عنہا نے ایسے کیا کہ ہم میں سے جس کے پاس بھی نبی کریم صلی اللہ علیہ وسلم ( زینب کے یہاں سے شہد پی کر آنے کے بعد ) داخل ہوں تو وہ کہے کہ کیا آپ نے پیاز کھائی ہے۔ آپ کے منہ سے مغافیر کی بو آتی ہے۔ چنانچہ جب آپ صلی اللہ علیہ وسلم تشریف لائے تو منصوبہ بندی کے تحت یہی کہا گیا۔ نبی کریم صلی اللہ علیہ وسلم بدبو کو بہت ناپسند فرماتے تھے۔ اس لیے آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے مغافیر نہیں کھائی ہے البتہ زینب بنت جحش کے یہاں سے شہد پیا تھا لیکن اب اسے بھی ہرگز نہیں پیوں گا۔ میں نے اس کی قسم کھا لی ہے لیکن تم کسی سے اس کا ذکر نہ کرنا۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم کو ہشام بن یوسف نے خبر دی، انہیں ابن جریج نے، انہیں عطاء نے، انہیں عبید بن عمیر اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَشْرَبُ عَسَلاً عِنْدَ زَيْنَبَ ابْنَةِ جَحْشٍ وَيَمْكُثُ عِنْدَهَا فَوَاطَيْتُ أَنَا وَحَفْصَةُ عَنْ أَيَّتُنَا دَخَلَ عَلَيْهَا فَلْتَقُلْ لَهُ أَكَلْتَ مَغَافِيرَ إِنِّي أَجِدُ مِنْكَ رِيحَ مَغَافِيرَ‏.‏ قَالَ ‏ \"‏ لاَ وَلَكِنِّي كُنْتُ أَشْرَبُ عَسَلاً عِنْدَ زَيْنَبَ ابْنَةِ جَحْشٍ فَلَنْ أَعُودَ لَهُ وَقَدْ حَلَفْتُ لاَ تُخْبِرِي بِذَلِكِ أَحَدًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4690,
                "hadithNumber": "4913",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "For the whole year I had the desire to ask `Umar bin Al-Khattab رضی اللہ عنہ regarding the explanation of a Verse (in Surat Al-Tahrim) but I could not ask him because I respected him very much. When he went to perform the Hajj, I too went along with him. On our return, while we were still on the way home. `Umar رضی اللہ عنہwent aside to answer the call of nature by the Arak trees. I waited till he finished and then I proceeded with him and asked him. \"O chief of the Believers! Who were the two wives of the Prophet (ﷺ) who aided one another against him?\" He said, \"They were Hafsa and `Aisha رضی اللہ عنہما .\" Then I said to him, \"By Allah, I wanted to ask you about this a year ago, but I could not do so owing to my respect for you.\" `Umar  رضی اللہ عنہ said, \"Do not refrain from asking me. If you think that I have knowledge (about a certain matter), ask me; and if I know (something about it), I will tell you.\" Then `Umar رضی اللہ عنہ added, \"By Allah, in the Pre-lslamic Period of Ignorance we did not pay attention to women until Allah revealed regarding them what He revealed regarding them and assigned for them what He has assigned. Once while I was thinking over a certain matter, my wife said, \"I recommend that you do so-and-so.\" I said to her, \"What have you got to do with the is matter? Why do you poke your nose in a matter which I want to see fulfilled.?\" She said, How strange you are, O son of Al-Khattab! You don't want to be argued with whereas your daughter, Hafsa surely, argues with Allah's Messenger (ﷺ) so much that he remains angry for a full day!\" `Umar رضی اللہ عنہ then reported; how he at once put on his outer garment and went to Hafsa and said to her, \"O my daughter! Do you argue with Allah's Messenger (ﷺ) so that he remains angry the whole day?\" H. afsa said, \"By Allah, we argue with him.\" `Umar رضی اللہ عنہ said, \"Know that I warn you of Allah's punishment and the anger of Allah's Messenger (ﷺ) . . . O my daughter! Don't be betrayed by the one who is proud of her beauty because of the love of Allah's Messenger (ﷺ) for her (i.e. `Aisha رضی اللہ عنہما ).\" `Umar رضی اللہ عنہ addled, \"Then I went out to Um Salama's house who was one of my relatives, and I talked to her. She said, O son of Al-Khattab! It is rather astonishing that you interfere in everything; you even want to interfere between Allah's Apostle and his wives!' By Allah, by her talk she influenced me so much that I lost some of my anger. I left her (and went home). At that time I had a friend from the Ansar who used to bring news (from the Prophet) in case of my absence, and I used to bring him the news if he was absent. In those days we were afraid of one of the kings of Ghassan tribe. We heard that he intended to move and attack us, so fear filled our hearts because of that. (One day) my Ansari friend unexpectedly knocked at my door, and said, \"Open Open!' I said, 'Has the king of Ghassan come?' He said, 'No, but something worse; Allah's Messenger (ﷺ) has isolated himself from his wives.' I said, 'Let the nose of `Aisha رضی اللہ عنہما and Hafsa رضی اللہ عنہا be stuck to dust (i.e. humiliated)!' Then I put on my clothes and went to Allah's Messenger (ﷺ)'s residence, and behold, he was staying in an upper room of his to which he ascended by a ladder, and a black slave of Allah's Messenger (ﷺ) was (sitting) on the first step. I said to him, 'Say (to the Prophet (ﷺ) ) `Umar bin Al-Khattab رضی اللہ عنہ is here.' Then the Prophet (ﷺ) admitted me and I narrated the story to Allah's Messenger (ﷺ). When I reached the story of Um Salama رضی اللہ عنہما , Allah's Messenger (ﷺ) smiled while he was lying on a mat made of palm tree leaves with nothing between him and the mat. Underneath his head there was a leather pillow stuffed with palm fibres, and leaves of a saut tree were piled at his feet, and above his head hung a few water skins. On seeing the marks of the mat imprinted on his side, I wept. He said.' 'Why are you weeping?' I replied, \"O Allah's Messenger (ﷺ)! Caesar and Khosrau are leading the life (i.e. Luxurious life) while you, Allah's Messenger (ﷺ) though you are, is living in destitute\". The Prophet (ﷺ) then replied. 'Won't you be satisfied that they enjoy this world and we the Hereafter?' \"",
                "hadithUrdu": "ایک آیت کے متعلق عمر بن خطاب رضی اللہ عنہ سے پوچھنے کے لیے ایک سال تک میں تردد میں رہا، ان کا اتنا ڈر غالب تھا کہ میں ان سے نہ پوچھ سکا۔ آخر وہ حج کے لیے گئے تو میں بھی ان کے ساتھ ہو لیا، واپسی میں جب ہم راستہ میں تھے تو رفع حاجت کے لیے وہ پیلو کے درخت میں گئے۔ بیان کیا کہ میں ان کے انتظار میں کھڑا رہا جب وہ فارغ ہو کر آئے تو پھر میں ان کے ساتھ چلا اس وقت میں نے عرض کیا۔ امیرالمؤمنین! امہات المؤمنین میں وہ کون دو عورتیں تھیں جنہوں نے نبی کریم صلی اللہ علیہ وسلم کے لیے متفقہ منصوبہ بنایا تھا؟ انہوں نے بتلایا کہ حفصہ اور عائشہ رضی اللہ عنہما تھیں۔ بیان کیا کہ میں نے عرض کیا اللہ کی قسم میں یہ سوال آپ سے کرنے کے لیے ایک سال سے ارادہ کر رہا تھا لیکن آپ کے رعب کی وجہ سے پوچھنے کی ہمت نہیں ہوتی تھی۔ عمر رضی اللہ عنہ نے کہا ایسا نہ کیا کرو جس مسئلہ کے متعلق تمہارا خیال ہو کہ میرے پاس اس سلسلے میں کوئی علم ہے تو اسے پوچھ لیا کرو، اگر میرے پاس اس کا کوئی علم ہو گا تو تمہیں بتا دیا کروں گا۔ بیان کیا کہ عمر رضی اللہ عنہ نے کہا: اللہ کی قسم! جاہلیت میں ہماری نظر میں عورتوں کی کوئی عزت نہ تھی۔ یہاں تک کہ اللہ تعالیٰ نے ان کے بارے میں وہ احکام نازل کئے جو نازل کرنے تھے اور ان کے حقوق مقرر کئے جو مقرر کرنے تھے۔ بتلایا کہ ایک دن میں سوچ رہا تھا کہ میری بیوی نے مجھ سے کہا کہ بہتر ہے اگر تم اس معاملہ کا فلاں فلاں طرح کرو، میں نے کہا تمہارا اس میں کیا کام۔ معاملہ مجھ سے متعلق ہے تم اس میں دخل دینے والی کون ہوتی ہو؟ میری بیوی نے اس پر کہا: خطاب کے بیٹے! تمہارے اس طرز عمل پر حیرت ہے تم اپنی باتوں کا جواب برداشت نہیں کر سکتے تمہاری لڑکی ( حفصہ ) تو رسول اللہ صلی اللہ علیہ وسلم کو بھی جواب دے دیتی ہیں ایک دن تو اس نے نبی کریم صلی اللہ علیہ وسلم کو غصہ بھی کر دیا تھا۔ یہ سن کر عمر رضی اللہ عنہ کھڑے ہو گئے اور اپنی چادر اوڑھ کر حفصہ کے گھر پہنچے اور فرمایا بیٹی! کیا تم رسول اللہ صلی اللہ علیہ وسلم کی باتوں کا جواب دے دیتی ہو یہاں تک کہ ایک دن تم نے نبی کریم صلی اللہ علیہ وسلم کو دن بھر ناراض بھی رکھا ہے۔ حفصہ رضی اللہ عنہا نے عرض کیا: جی ہاں، اللہ کی قسم! ہم نبی کریم صلی اللہ علیہ وسلم کو کبھی جواب دے دیتے ہیں۔ عمر رضی اللہ عنہ نے کہا کہ میں نے کہا جان لو میں تمہیں اللہ کی سزا اور اس کے رسول کی سزا ( ناراضگی ) سے ڈراتا ہوں۔ بیٹی! اس عورت کی وجہ سے دھوکا میں نہ آ جانا جس نے نبی کریم صلی اللہ علیہ وسلم کی محبت حاصل کر لی ہے۔ ان کا اشارہ عائشہ رضی اللہ عنہا کی طرف تھا کہا کہ پھر میں وہاں سے نکل کر ام المؤمنین ام سلمہ رضی اللہ عنہا کے پاس آیا کیونکہ وہ بھی میری رشتہ دار تھیں۔ میں نے ان سے بھی گفتگو کی انہوں نے کہا ابن خطاب! تعجب ہے کہ آپ ہر معاملہ میں دخل اندازی کرتے ہیں اور آپ چاہتے ہیں کہ نبی کریم صلی اللہ علیہ وسلم اور ان کی ازواج کے معاملات میں بھی دخل دیں۔ اللہ کی قسم! انہوں نے میری ایسی گرفت کی کہ میرے غصہ کو ٹھنڈا کر کے رکھ دیا، میں ان کے گھر سے باہر نکل آیا۔ میرے ایک انصاری دوست تھے، جب میں نبی کریم صلی اللہ علیہ وسلم کی مجلس میں حاضر نہ ہوتا تو وہ مجلس کی تمام باتیں مجھ سے آ کر بتایا کرتے اور جب وہ حاضر نہ ہوتے تو میں انہیں آ کر بتایا کرتا تھا۔ اس زمانہ میں ہمیں غسان کے بادشاہ کی طرف سے ڈر تھا اطلاع ملی تھی کہ وہ مدینہ پر چڑھائی کرنے کا ارادہ کر رہا ہے، اس زمانہ میں کئی عیسائی اور ایرانی بادشاہ ایسا غلط گھمنڈ رکھتے تھے کہ یہ مسلمان کیا ہیں ہم جب چاہیں گے ان کا صفایا کر دیں گے مگر یہ سارے خیالات غلط ثابت ہوئے اللہ نے اسلام کو غالب کیا۔ چنانچہ ہم کو ہر وقت یہی خطرہ رہتا تھا، ایک دن اچانک میرے انصاری دوست نے دروازہ کھٹکھٹایا اور کہا کھولو! کھولو! کھولو! میں نے کہا معلوم ہوتا ہے غسانی آ گئے۔ انہوں نے کہا بلکہ اس سے بھی زیادہ اہم معاملہ پیش آ گیا ہے، وہ یہ کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں سے علیحدگی اختیار کر لی ہے۔ میں نے کہا حفصہ اور عائشہ رضی اللہ عنہما کی ناک غبار آلود ہو۔ چنانچہ میں نے اپنا کپڑا پہنا اور باہر نکل آیا۔ میں جب پہنچا تو نبی کریم صلی اللہ علیہ وسلم اپنے بالاخانہ میں تشریف رکھتے تھے جس پر سیڑھی سے چڑھا جاتا تھا۔ نبی کریم کا ایک حبشی غلام ( رباح ) سیڑھی کے سرے پر موجود تھا، میں نے کہا: نبی کریم صلی اللہ علیہ وسلم سے عرض کرو کہ عمر بن خطاب آیا ہے اور اندر آنے کی اجازت چاہتا ہے۔ میں نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پہنچ کر اپنا سارا واقعہ سنایا۔ جب میں ام سلمہ رضی اللہ عنہما کی گفتگو پر پہنچا تو آپ کو ہنسی آ گئی۔ اس وقت نبی کریم صلی اللہ علیہ وسلم کھجور کی ایک چٹائی پر تشریف رکھتے تھے آپ صلی اللہ علیہ وسلم کے جسم مبارک اور اس چٹائی کے درمیان کوئی اور چیز نہیں تھی آپ کے سر کے نیچے ایک چمڑے کا تکیہ تھا۔ جس میں کھجور کی چھال بھری ہوئی تھی۔ پاؤں کی طرف کیکر کے پتوں کا ڈھیر تھا اور سر کی طرف مشکیزہ لٹک رہا تھا۔ میں نے چٹائی کے نشانات آپ کے پہلو پر دیکھے تو رو پڑا۔ آپ صلی اللہ علیہ وسلم نے فرمایا، کس بات پر رونے لگے ہو میں نے عرض کی یا رسول اللہ! قیصر و کسریٰ کو دنیا کا ہر طرح کا آرام مل رہا ہے آپ اللہ کے رسول ہیں ( آپ پھر ایسی تنگ زندگی گزارتے ہیں ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کیا تم اس پر خوش نہیں ہو کہ ان کے حصہ میں دنیا ہے اور ہمارے حصہ میں آخرت ہے۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا ہم سے سلیمان بن بلال نے بیان کیا، ان سے یحییٰ نے، ان سے عبید بن حنین نے کہ انہوں نے ابن عباس رضی اللہ عنہما کو حدیث بیان کرتے ہوئے سنا، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يُحَدِّثُ أَنَّهُ قَالَ مَكَثْتُ سَنَةً أُرِيدُ أَنْ أَسْأَلَ عُمَرَ بْنَ الْخَطَّابِ عَنْ آيَةٍ، فَمَا أَسْتَطِيعُ أَنْ أَسْأَلَهُ هَيْبَةً لَهُ، حَتَّى خَرَجَ حَاجًّا فَخَرَجْتُ مَعَهُ فَلَمَّا رَجَعْتُ وَكُنَّا بِبَعْضِ الطَّرِيقِ عَدَلَ إِلَى الأَرَاكِ لِحَاجَةٍ لَهُ ـ قَالَ ـ فَوَقَفْتُ لَهُ حَتَّى فَرَغَ سِرْتُ مَعَهُ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ مَنِ اللَّتَانِ تَظَاهَرَتَا عَلَى النَّبِيِّ صلى الله عليه وسلم مِنْ أَزْوَاجِهِ فَقَالَ تِلْكَ حَفْصَةُ وَعَائِشَةُ‏.‏ قَالَ فَقُلْتُ وَاللَّهِ إِنْ كُنْتُ لأُرِيدُ أَنْ أَسْأَلَكَ عَنْ هَذَا مُنْذُ سَنَةٍ، فَمَا أَسْتَطِيعُ هَيْبَةً لَكَ‏.‏ قَالَ فَلاَ تَفْعَلْ مَا ظَنَنْتَ أَنَّ عِنْدِي مِنْ عِلْمٍ فَاسْأَلْنِي، فَإِنْ كَانَ لِي عِلْمٌ خَبَّرْتُكَ بِهِ ـ قَالَ ـ ثُمَّ قَالَ عُمَرُ وَاللَّهِ إِنْ كُنَّا فِي الْجَاهِلِيَّةِ مَا نَعُدُّ لِلنِّسَاءِ أَمْرًا، حَتَّى أَنْزَلَ اللَّهُ فِيهِنَّ مَا أَنْزَلَ وَقَسَمَ لَهُنَّ مَا قَسَمَ ـ قَالَ ـ فَبَيْنَا أَنَا فِي أَمْرٍ أَتَأَمَّرُهُ إِذْ قَالَتِ امْرَأَتِي لَوْ صَنَعْتَ كَذَا وَكَذَا ـ قَالَ ـ فَقُلْتُ لَهَا مَالَكِ وَلِمَا هَا هُنَا فِيمَا تَكَلُّفُكِ فِي أَمْرٍ أُرِيدُهُ‏.‏ فَقَالَتْ لِي عَجَبًا لَكَ يَا ابْنَ الْخَطَّابِ مَا تُرِيدُ أَنْ تُرَاجَعَ أَنْتَ، وَإِنَّ ابْنَتَكَ لَتُرَاجِعُ رَسُولَ اللَّهِ صلى الله عليه وسلم حَتَّى يَظَلَّ يَوْمَهُ غَضْبَانَ‏.‏ فَقَامَ عُمَرُ فَأَخَذَ رِدَاءَهُ مَكَانَهُ حَتَّى دَخَلَ عَلَى حَفْصَةَ فَقَالَ لَهَا يَا بُنَيَّةُ إِنَّكِ لَتُرَاجِعِينَ رَسُولَ اللَّهِ صلى الله عليه وسلم حَتَّى يَظَلَّ يَوْمَهُ غَضْبَانَ‏.‏ فَقَالَتْ حَفْصَةُ وَاللَّهِ إِنَّا لَنُرَاجِعُهُ‏.‏ فَقُلْتُ‏.‏ تَعْلَمِينَ أَنِّي أُحَذِّرُكِ عُقُوبَةَ اللَّهِ وَغَضَبَ رَسُولِهِ صلى الله عليه وسلم يَا بُنَيَّةُ لاَ يَغُرَّنَّكِ هَذِهِ الَّتِي أَعْجَبَهَا حُسْنُهَا حُبُّ رَسُولِ اللَّهِ صلى الله عليه وسلم إِيَّاهَا ـ يُرِيدُ عَائِشَةَ ـ قَالَ ثُمَّ خَرَجْتُ حَتَّى دَخَلْتُ عَلَى أُمِّ سَلَمَةَ لِقَرَابَتِي مِنْهَا فَكَلَّمْتُهَا‏.‏ فَقَالَتْ أُمُّ سَلَمَةَ عَجَبًا لَكَ يَا ابْنَ الْخَطَّابِ دَخَلْتَ فِي كُلِّ شَىْءٍ، حَتَّى تَبْتَغِي أَنْ تَدْخُلَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَزْوَاجِهِ‏.‏ فَأَخَذَتْنِي وَاللَّهِ أَخْذًا كَسَرَتْنِي عَنْ بَعْضِ مَا كُنْتُ أَجِدُ، فَخَرَجْتُ مِنْ عِنْدِهَا، وَكَانَ لِي صَاحِبٌ مِنَ الأَنْصَارِ إِذَا غِبْتُ أَتَانِي بِالْخَبَرِ، وَإِذَا غَابَ كُنْتُ أَنَا آتِيهِ بِالْخَبَرِ، وَنَحْنُ نَتَخَوَّفُ مَلِكًا مِنْ مُلُوكِ غَسَّانَ، ذُكِرَ لَنَا أَنَّهُ يُرِيدُ أَنْ يَسِيرَ إِلَيْنَا، فَقَدِ امْتَلأَتْ صُدُورُنَا مِنْهُ، فَإِذَا صَاحِبِي الأَنْصَارِيُّ يَدُقُّ الْبَابَ فَقَالَ افْتَحِ افْتَحْ‏.‏ فَقُلْتُ جَاءَ الْغَسَّانِيُّ فَقَالَ بَلْ أَشَدُّ مِنْ ذَلِكَ‏.‏ اعْتَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَزْوَاجَهُ‏.‏ فَقُلْتُ رَغَمَ أَنْفُ حَفْصَةَ وَعَائِشَةَ‏.‏ فَأَخَذْتُ ثَوْبِيَ فَأَخْرُجُ حَتَّى جِئْتُ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَشْرُبَةٍ لَهُ يَرْقَى عَلَيْهَا بِعَجَلَةٍ، وَغُلاَمٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَسْوَدُ عَلَى رَأْسِ الدَّرَجَةِ فَقُلْتُ لَهُ قُلْ هَذَا عُمَرُ بْنُ الْخَطَّابِ‏.‏ فَأَذِنَ لِي ـ قَالَ عُمَرُ ـ فَقَصَصْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم هَذَا الْحَدِيثَ، فَلَمَّا بَلَغْتُ حَدِيثَ أُمِّ سَلَمَةَ تَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَإِنَّهُ لَعَلَى حَصِيرٍ مَا بَيْنَهُ وَبَيْنَهُ شَىْءٌ، وَتَحْتَ رَأْسِهِ وِسَادَةٌ مِنْ أَدَمٍ حَشْوُهَا لِيفٌ، وَإِنَّ عِنْدَ رِجْلَيْهِ قَرَظًا مَصْبُوبًا، وَعِنْدَ رَأْسِهِ أَهَبٌ مُعَلَّقَةٌ فَرَأَيْتُ أَثَرَ الْحَصِيرِ فِي جَنْبِهِ فَبَكَيْتُ فَقَالَ ‏\"‏ مَا يُبْكِيكَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ كِسْرَى وَقَيْصَرَ فِيمَا هُمَا فِيهِ وَأَنْتَ رَسُولُ اللَّهِ‏.‏ فَقَالَ ‏\"‏ أَمَا تَرْضَى أَنْ تَكُونَ لَهُمُ الدُّنْيَا وَلَنَا الآخِرَةُ ‏\"‏‏.‏",
                "headingArabic": "‏{‏تَبْتَغِي مَرْضَاةَ أَزْوَاجِكَ‏}‏ ‏{‏قَدْ فَرَضَ اللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ‏}‏",
                "headingUrdu": "\"... اپنی بیویوں کو خوش کرنے کے لیے...\" (V.66:1) \"اللہ نے پہلے ہی تم پر (اے مردو) قسموں کو ختم کرنے کا حکم دے رکھا ہے...\" (V.66:2)",
                "headingEnglish": "\"... seeking to please your wives...\" (V.66:1) \"Allah has already ordained for you (O men), the dissolution of your oaths.. .\" (V.66:2)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4691,
                "hadithNumber": "4914",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "I intended to ask `Umar رضی اللہ عنہso I said, \"Who were those two ladies who tried to back each other against the Prophet?\" I hardly finished my speech when he said, They were `Aisha and Hafsa رضی اللہ عنہما .\"",
                "hadithUrdu": "میں نے عمر رضی اللہ عنہ سے ایک بات پوچھنے کا ارادہ کیا اور عرض کیا امیرالمؤمنین! وہ کون دو عورتیں تھیں جنہوں نے رسول اللہ صلی اللہ علیہ وسلم کے ستانے کے لیے منصوبہ بنایا تھا؟ ابھی میں نے اپنی بات پوری بھی نہیں کی تھی کہ انہوں نے کہا وہ عائشہ اور حفصہ رضی اللہ عنہما تھیں۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے یحییٰ بن سعید انصاری نے بیان کیا، کہا میں نے عبید بن حنین سے سنا، انہوں نے بیان کیا کہ میں نے ابن عباس رضی اللہ عنہما سے سنا وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ سَمِعْتُ عُبَيْدَ بْنَ حُنَيْنٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ أَرَدْتُ أَنْ أَسْأَلَ عُمَرَ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ مَنِ الْمَرْأَتَانِ اللَّتَانِ تَظَاهَرَتَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَمَا أَتْمَمْتُ كَلاَمِي حَتَّى قَالَ عَائِشَةُ وَحَفْصَةُ‏.‏",
                "headingArabic": "\"اور (یاد کرو) جب نبی صلی اللہ علیہ وسلم نے اپنی بیویوں میں سے ایک (حفصہ) کو رازداری کے ساتھ ایک معاملہ ظاہر کیا (تک) ... سب سے باخبر۔\" (V.66:3)",
                "headingUrdu": "\"اور (یاد کرو) جب نبی صلی اللہ علیہ وسلم نے اپنی بیویوں میں سے ایک (حفصہ) کو رازداری کے ساتھ ایک معاملہ ظاہر کیا (تک) ... سب سے باخبر۔\" (V.66:3)",
                "headingEnglish": "\"And (remember) when the Prophet pbuh disclosed a matter in confidence to one of his wives (Ḥafsa) (up to) ... The All-Aware.\" (V.66:3)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4692,
                "hadithNumber": "4915",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "I intended to ask `Umar رضی اللہ عنہ about those two ladies who back each other against 'Allah's Messenger (ﷺ) . For one year I was seeking the opportunity to ask this question, but in vain, until once when I accompanied him for Hajj. While we were in Zahran, `Umar رضی اللہ عنہ went to answer the call of nature and told me to follow him with some water for ablution. So I followed him with a container of water and started pouring water for him. I found it a good opportunity to ask him, so I said, \"O chief of the Believers! Who were those two ladies who had backed each other (against the Prophet)?\" Before I could complete my question, he replied, \"They were `Aisha and Hafsa رضی اللہ عنہما .\"",
                "hadithUrdu": "میں نے عمر رضی اللہ عنہ سے ان عورتوں کے متعلق سوال کرنا چاہا جنہوں نے رسول اللہ صلی اللہ علیہ وسلم کے اوپر زور کیا تھا۔ ایک سال اسی فکر میں رہا اور مجھے کوئی موقع نہیں ملتا تھا آخر ان کے ساتھ حج کے لیے نکلا ( واپسی میں ) جب ہم مقام ظہران میں تھے تو عمر رضی اللہ عنہ رفع حاجت کے لیے گئے۔ پھر کہا کہ میرے لیے وضو کا پانی لاؤ، میں ایک برتن میں پانی لایا اور ان کو وضو کرانے لگا اس وقت مجھ کو موقع ملا۔ میں نے عرض کیا امیرالمؤمنین! وہ عورتیں کون تھیں جنہوں نے نبی کریم صلی اللہ علیہ وسلم کے مقابل ایسا کیا تھا؟ ابھی میں نے اپنی بات پوری نہ کی تھی انہوں نے کہا کہ وہ عائشہ اور حفصہ رضی اللہ عنہما تھیں۔",
                "urduNarrator": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے یحییٰ بن انصاری نے بیان کیا، کہا کہ میں نے عبید بن حنین سے سنا، وہ بیان کرتے تھے کہ میں نے ابن عباس رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ سَمِعْتُ عُبَيْدَ بْنَ حُنَيْنٍ، يَقُولُ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ أَرَدْتُ أَنْ أَسْأَلَ، عُمَرَ عَنِ الْمَرْأَتَيْنِ اللَّتَيْنِ، تَظَاهَرَتَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَمَكُثْتُ سَنَةً فَلَمْ أَجِدْ لَهُ مَوْضِعًا، حَتَّى خَرَجْتُ مَعَهُ حَاجًّا، فَلَمَّا كُنَّا بِظَهْرَانَ ذَهَبَ عُمَرُ لِحَاجَتِهِ فَقَالَ أَدْرِكْنِي بِالْوَضُوءِ فَأَدْرَكْتُهُ بِالإِدَاوَةِ، فَجَعَلْتُ أَسْكُبُ عَلَيْهِ وَرَأَيْتُ مَوْضِعًا فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ مَنِ الْمَرْأَتَانِ اللَّتَانِ تَظَاهَرَتَا قَالَ ابْنُ عَبَّاسٍ فَمَا أَتْمَمْتُ كَلاَمِي حَتَّى قَالَ عَائِشَةُ وَحَفْصَةُ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’اگر تم دونوں (نبی کی ازواجِ مطہرات، یعنی عائشہ اور حفصہ) اللہ کے حضور توبہ کرلو (یہ تمہارے حق میں بہتر ہے)) تو یقیناً تمہارے دل (کسی چیز کی مخالفت پر) مائل ہیں۔ نبی کو پسند ہے)۔ (V.66:4)",
                "headingEnglish": "The Statement of Allah the Most High: \"If you two (wives of the Prophet, namely, 'Aishah and Hafsa) turn in repentance to Allah, (it will be better for you), your hearts are indeed so inclined (to oppose what the Prophet likes).\" (V.66:4)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4693,
                "hadithNumber": "4916",
                "englishNarrator": "Narrated `Umar رضی اللہ عنہ :",
                "hadithEnglish": "The wives of the Prophet (ﷺ) out of their jealousy, backed each other against the Prophet, so I said to them, \"It may be, if he divorced you all, that Allah will give him, instead of you wives better than you.\" So this Verse was revealed. (66.5)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی ازواج نبی کریم صلی اللہ علیہ وسلم کو غیرت دلانے کے لیے جمع ہو گئیں تو میں نے ان سے کہا اگر نبی صلی اللہ علیہ وسلم طلاق دے دیں تو ان کا پروردگار تمہارے بدلے میں انہیں تم سے بہتر بیویاں دیدے گا۔ چنانچہ یہ آیت نازل ہوئی «عسى ربه إن طلقكن» آخر تک۔",
                "urduNarrator": "ہم سے عمرو بن عون نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ عمر رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ قَالَ عُمَرُ ـ رضى الله عنه ـ اجْتَمَعَ نِسَاءُ النَّبِيِّ صلى الله عليه وسلم فِي الْغَيْرَةِ عَلَيْهِ فَقُلْتُ لَهُنَّ عَسَى رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبَدِّلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ‏.‏ فَنَزَلَتْ هَذِهِ الآيَةُ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏عَسَى رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبَدِّلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ مُسْلِمَاتٍ مُؤْمِنَاتٍ قَانِتَاتٍ تَائِبَاتٍ عَابِدَاتٍ سَائِحَاتٍ ثَيِّبَاتٍ وَأَبْكَارًا‏}‏",
                "headingUrdu": "’’ہوسکتا ہے کہ اگر وہ تم کو طلاق دے دے تو اس کا رب (اللہ) اسے تمہارے بدلے تم سے بہتر بیویاں دے دے‘‘ (V.66:5)",
                "headingEnglish": "\"It may be, if he divorced you (all), that his Lord (Allah) will give him instead of you, wives better than you... (V.66:5)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4694,
                "hadithNumber": "4917",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "(regarding the Verse):-- 'Cruel after all that, base-born (of illegitimate birth).' (68.13) It was revealed in connection with a man from Quaraish who had a notable sign (Zanamah) similar to the notable sign which usually-hung on the neck of a sheep (to recognize it).",
                "hadithUrdu": "آیت «عتل بعد ذلك زنيم‏» یعنی ”وہ ظالم سخت مزاج ہے اس کے علاوہ حرامی بھی ہے۔“ کے متعلق فرمایا کہ یہ آیت قریش کے ایک شخص کے بارے میں ہوئی تھی اس کی گردن میں نشانی تھی جیسے بکری میں نشانی ہوتی ہے کہ بعض ان میں کا کوئی عضو بڑھا ہوا ہوتا ہے۔",
                "urduNarrator": "ہم سے محمود نے بیان کیا، کہا ہم سے عبیداللہ نے بیان کیا، ان سے اسرائیل نے، ان سے ابوحصین نے، ان سے مجاہد نے اور ان سے ابن عباس رضی اللہ عنہما نے",
                "hadithArabic": "حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي حَصِينٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏عُتُلٍّ بَعْدَ ذَلِكَ زَنِيمٍ‏}‏ قَالَ رَجُلٌ مِنْ قُرَيْشٍ لَهُ زَنَمَةٌ مِثْلُ زَنَمَةِ الشَّاةِ‏.‏",
                "headingArabic": "‏{‏عُتُلٍّ بَعْدَ ذَلِكَ زَنِيمٍ‏}‏",
                "headingUrdu": "\"ظالم، اور اس کے علاوہ بنیاد پر پیدا ہونے والا (ناجائز پیدائش کا)۔\" (V.68:13)",
                "headingEnglish": "\"Cruel, and moreover base-born (of illegitimate birth) .\" (V.68:13)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4695,
                "hadithNumber": "4918",
                "englishNarrator": "Narrated Haritha bin Wahb Al-Khuza`i رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying. \"May I tell you of the people of Paradise? Every weak and poor obscure person whom the people look down upon but his oath is fulfilled by Allah when he takes an oath to do something. And may I inform you of the people of the Hell-Fire? They are all those violent, arrogant and stubborn people.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ میں تمہیں بہشتی آدمی کے متعلق نہ بتا دوں۔ وہ دیکھنے میں کمزور ناتواں ہوتا ہے ( لیکن اللہ کے یہاں اس کا مرتبہ یہ ہے کہ ) اگر کسی بات پر اللہ کی قسم کھا لے تو اللہ اسے ضرور پوری کر دیتا ہے اور کیا میں تمہیں دوزخ والوں کے متعلق نہ بتا دوں ہر بدخو، بھاری جسم والا اور تکبر کرنے والا۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے سفیان نے عبد بن خالد سے بیان کیا، کہا کہ میں نے حارثہ بن وہب خزاعی رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، قَالَ سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ الْخُزَاعِيَّ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ أَلاَ أُخْبِرُكُمْ بِأَهْلِ الْجَنَّةِ كُلُّ ضَعِيفٍ مُتَضَعِّفٍ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ، أَلاَ أُخْبِرُكُمْ بِأَهْلِ النَّارِ كُلُّ عُتُلٍّ جَوَّاظٍ مُسْتَكْبِرٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4696,
                "hadithNumber": "4919",
                "englishNarrator": "Narrated Abu Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"Allah will bring forth the severest Hour, and then all the Believers, men and women, will prostrate themselves before Him, but there will remain those who used to prostrate in the world for showing off and for gaining good reputation. Such people will try to prostrate (on the Day of Judgment) but their back swill be as stiff as if it is one bone (a single vertebra).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ ہمارا رب قیامت کے دن اپنی پنڈلی کھولے گا اس وقت ہر مومن مرد اور ہر مومنہ عورت اس کے لیے سجدہ میں گر پڑیں گے۔ صرف وہ باقی رہ جائیں گے جو دنیا میں دکھاوے اور ناموری کے لیے سجدہ کرتے تھے۔ جب وہ سجدہ کرنا چاہیں گے تو ان کی پیٹھ تختہ ہو جائے گی اور وہ سجدہ کے لیے نہ مڑ سکیں گے۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے خالد بن یزید نے، ان سے سعید بن ابی ہلال نے، ان سے زید بن اسلم نے، ان سے عطا بن یسار اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا اللَّيْثُ، عَنْ خَالِدِ بْنِ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ يَكْشِفُ رَبُّنَا عَنْ سَاقِهِ فَيَسْجُدُ لَهُ كُلُّ مُؤْمِنٍ وَمُؤْمِنَةٍ، وَيَبْقَى مَنْ كَانَ يَسْجُدُ فِي الدُّنْيَا رِئَاءً وَسُمْعَةً، فَيَذْهَبُ لِيَسْجُدَ فَيَعُودُ ظَهْرُهُ طَبَقًا وَاحِدًا ‏\"‏‏.‏",
                "headingArabic": "‏{‏يَوْمَ يُكْشَفُ عَنْ سَاقٍ‏}‏",
                "headingUrdu": "\"(یاد رکھو) وہ دن جب پنڈلی کو ننگا کر دیا جائے گا...\" (V.68:42)",
                "headingEnglish": "\"(Remember) the Day when the Shin shalt be laid bare...\" (V.68:42)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4697,
                "hadithNumber": "4920",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "All the idols which were worshiped by the people of Noah were worshiped by the Arabs later on. As for the idol Wadd, it was worshiped by the tribe of Kalb at Daumat-al-Jandal; Suwa` was the idol of (the tribe of) Hudhail; Yaghouth was worshiped by (the tribe of) Murad and then by Bani Ghutaif at Al-Jurf near Saba; Ya`uq was the idol of Hamdan, and Nasr was the idol of Himyar, the branch of Dhi-al-Kala`. The names (of the idols) formerly belonged to some pious men of the people of Noah, and when they died Satan inspired their people to (prepare and place idols at the places where they used to sit, and to call those idols by their names. The people did so, but the idols were not worshiped till those people (who initiated them) had died and the origin of the idols had become obscure, whereupon people began worshiping them.",
                "hadithUrdu": "جو بت موسیٰ علیہ السلام کی قوم میں پوجے جاتے تھے بعد میں وہی عرب میں پوجے جانے لگے۔ ود دومۃ الجندل میں بنی کلب کا بت تھا۔ سواع بنی ہذیل کا۔ یغوث بنی مراد کا اور مراد کی شاخ بنی غطیف کا جو وادی اجوف میں قوم سبا کے پاس رہتے تھے یعوق بنی ہمدان کا بت تھا۔ نسر حمیر کا بت تھا جو ذوالکلاع کی آل میں سے تھے۔ یہ پانچوں نوح علیہ السلام کی قوم کے نیک لوگوں کے نام تھے جب ان کی موت ہو گئی تو شیطان نے ان کے دل میں ڈالا کہ اپنی مجلسوں میں جہاں وہ بیٹھے تھے ان کے بت قائم کر لیں اور ان بتوں کے نام اپنے نیک لوگوں کے نام پر رکھ لیں چنانچہ ان لوگوں نے ایسا ہی کیا اس وقت ان بتوں کی پوجا نہیں ہوتی تھی لیکن جب وہ لوگ بھی مر گئے جنہوں نے بت قائم کئے تھے اور علم لوگوں میں نہ رہا تو ان کی پوجا ہونے لگی۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، انہوں نے کہا ہم کو ہشام نے خبر دی، ان سے ابن جریج نے اور عطاء نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنِ ابْنِ جُرَيْجٍ، وَقَالَ، عَطَاءٌ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ صَارَتِ الأَوْثَانُ الَّتِي كَانَتْ فِي قَوْمِ نُوحٍ فِي الْعَرَبِ بَعْدُ، أَمَّا وُدٌّ كَانَتْ لِكَلْبٍ بِدَوْمَةِ الْجَنْدَلِ، وَأَمَّا سُوَاعٌ كَانَتْ لِهُذَيْلٍ، وَأَمَّا يَغُوثُ فَكَانَتْ لِمُرَادٍ ثُمَّ لِبَنِي غُطَيْفٍ بِالْجُرُفِ عِنْدَ سَبَا، وَأَمَّا يَعُوقُ فَكَانَتْ لِهَمْدَانَ، وَأَمَّا نَسْرٌ فَكَانَتْ لِحِمْيَرَ، لآلِ ذِي الْكَلاَعِ‏.‏ أَسْمَاءُ رِجَالٍ صَالِحِينَ مِنْ قَوْمِ نُوحٍ، فَلَمَّا هَلَكُوا أَوْحَى الشَّيْطَانُ إِلَى قَوْمِهِمْ أَنِ انْصِبُوا إِلَى مَجَالِسِهِمُ الَّتِي كَانُوا يَجْلِسُونَ أَنْصَابًا، وَسَمُّوهَا بِأَسْمَائِهِمْ فَفَعَلُوا فَلَمْ تُعْبَدْ حَتَّى إِذَا هَلَكَ أُولَئِكَ وَتَنَسَّخَ الْعِلْمُ عُبِدَتْ‏.‏",
                "headingArabic": "‏{‏وَدًّا وَلاَ سُوَاعًا وَلاَ يَغُوثَ وَيَعُوقَ‏}‏",
                "headingUrdu": "’’نہ تم ود کو چھوڑو نہ سواع نہ یغوث اور نہ یعوق اور نہ نصر کو۔‘‘ (V.71:23)",
                "headingEnglish": "\"Nor shall you leave Wadd nor Suwā' nor Yagūth nor Ya'ūq nor Nasr'. . .\" (V.71:23)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4698,
                "hadithNumber": "4921",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) went out along with a group of his companions towards `Ukaz Market. At that time something intervened between the devils and the news of the Heaven, and flames were sent down upon them, so the devils returned. Their fellow-devils said, \"What is wrong with you? \" They said, \"Something has intervened between us and the news of the Heaven, and fires (flames) have been shot at us.\" Their fellow-devils said, \"Nothing has intervened between you and the news of the Heaven, but an important event has happened. Therefore, travel all over the world, east and west, and try to find out what has happened.\" And so they set out and travelled all over the world, east and west, looking for that thing which intervened between them and the news of the Heaven. Those of the devils who had set out towards Tihama, went to Allah's Messenger (ﷺ) at Nakhla (a place between Mecca and Taif) while he was on his way to `Ukaz Market. (They met him) while he was offering the Fajr prayer with his companions. When they heard the Holy Qur'an being recited (by Allah's Messenger (ﷺ)), they listened to it and said (to each other). This is the thing which has intervened between you and the news of the Heavens.\" Then they returned to their people and said, \"O our people! We have really heard a wonderful recital (Qur'an). It gives guidance to the right, and we have believed therein. We shall not join in worship, anybody with our Lord.\" (See 72.1-2) Then Allah revealed to His Prophet (Surat al- Jinn): 'Say: It has been revealed to me that a group (3 to 9) of Jinns listened (to the Qur'an).' (72.1) The statement of the Jinns was revealed to him .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنے صحابہ کے ساتھ سوق عکاظ ( مکہ اور طائف کے درمیان ایک میدان جہاں عربوں کا مشہور میلہ لگتا تھا ) کا قصد کیا اس زمانہ میں شیاطین تک آسمان کی خبروں کے چرا لینے میں رکاوٹ پیدا کر دی گئی تھی اور ان پر آسمان سے آگ کے انگارے چھوڑے جاتے تھے جب وہ جِن اپنی قوم کے پاس لوٹ کر آئے تو ان کی قوم نے ان سے پوچھا کہ کیا بات ہوئی۔ انہوں نے بتایا کہ آسمان کی خبروں میں اور ہمارے درمیان رکاوٹ کر دی گئی ہے اور ہم پر آسمان سے آگ کے انگارے برسائے گئے ہیں، انہوں نے کہا کہ آسمان کی خبروں اور تمہارے درمیان رکاوٹ ہونے کی وجہ یہ ہے کہ کوئی خاص بات پیش آئی ہے۔ اس لیے ساری زمین پر مشرق و مغرب میں پھیل جاؤ اور تلاش کرو کہ کون سی بات پیش آ گئی ہے۔ چنانچہ شیاطین مشرق و مغرب میں پھیل گئے تاکہ اس بات کا پتہ لگائیں کہ آسمان کی خبروں کی ان تک پہنچنے میں رکاوٹ پیدا کی گئی ہے وہ کس بڑے واقعہ کی وجہ سے ہے۔ بیان کیا کہ جو شیاطین اس کھوج میں نکلے تھے ان کا ایک گروہ وادی تہامہ کی طرف بھی آ نکلا ( یہ جگہ مکہ معظمہ سے ایک دن کے سفر کی راہ پر ہے ) جہاں رسول اللہ صلی اللہ علیہ وسلم منڈی عکاظ کی طرف جاتے ہوئے کھجور کے ایک باغ کے پاس ٹھہرے ہوئے تھے۔ نبی کریم صلی اللہ علیہ وسلم اس وقت صحابہ کے ساتھ فجر کی نماز پڑھ رہے تھے۔ جب شیاطین نے قرآن مجید سنا تو یہ اس کو سننے لگ گئے پھر انہوں نے کہا کہ یہی چیز ہے وہ جس کی وجہ سے تمہارے اور آسمان کی خبروں کے درمیان رکاوٹ پیدا ہوئی ہے۔ اس کے بعد وہ اپنی قوم کی طرف لوٹ آئے اور ان سے کہا کہ «إنا سمعنا قرآنا عجبا» الایۃ ہم نے ایک عجیب قرآن سنا ہے جو نیکی کی راہ دکھلاتا ہے سو ہم تو اس پر ایمان لے آئے اور ہم اب اپنے پروردگار کو کسی کا ساجھی نہ بنائیں گے اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم پر یہ آیت نازل کی «قل أوحي إلى أنه استمع نفر من الجن‏» الایۃ۔ آپ کہئے کہ میرے پاس وحی آئی ہے اس بات کی کہ جِنوں کی ایک جماعت نے قرآن مجید سنا یہی جِنوں کا قول نبی کریم صلی اللہ علیہ وسلم پر نازل ہوا۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا کہ ہم سے ابوعوانہ نے بیان کیا، ان سے ابوبشر نے، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ انْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي طَائِفَةٍ مِنْ أَصْحَابِهِ عَامِدِينَ إِلَى سُوقِ عُكَاظٍ، وَقَدْ حِيلَ بَيْنَ الشَّيَاطِينِ وَبَيْنَ خَبَرِ السَّمَاءِ، وَأُرْسِلَتْ عَلَيْهِمُ الشُّهُبُ فَرَجَعَتِ الشَّيَاطِينُ فَقَالُوا مَا لَكُمْ فَقَالُوا حِيلَ بَيْنَنَا وَبَيْنَ خَبَرِ السَّمَاءِ وَأُرْسِلَتْ عَلَيْنَا الشُّهُبُ‏.‏ قَالَ مَا حَالَ بَيْنَكُمْ وَبَيْنَ خَبَرِ السَّمَاءِ إِلاَّ مَا حَدَثَ، فَاضْرِبُوا مَشَارِقَ الأَرْضِ وَمَغَارِبَهَا فَانْظُرُوا مَا هَذَا الأَمْرُ الَّذِي حَدَثَ‏.‏ فَانْطَلَقُوا فَضَرَبُوا مَشَارِقَ الأَرْضِ وَمَغَارِبَهَا يَنْظُرُونَ مَا هَذَا الأَمْرُ الَّذِي حَالَ بَيْنَهُمْ وَبَيْنَ خَبَرِ السَّمَاءِ‏.‏ قَالَ فَانْطَلَقَ الَّذِينَ تَوَجَّهُوا نَحْوَ تِهَامَةَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِنَخْلَةَ، وَهْوَ عَامِدٌ إِلَى سُوقِ عُكَاظٍ، وَهْوَ يُصَلِّي بِأَصْحَابِهِ صَلاَةَ الْفَجْرِ، فَلَمَّا سَمِعُوا الْقُرْآنَ تَسَمَّعُوا لَهُ فَقَالُوا هَذَا الَّذِي حَالَ بَيْنَكُمْ وَبَيْنَ خَبَرِ السَّمَاءِ‏.‏ فَهُنَالِكَ رَجَعُوا إِلَى قَوْمِهِمْ فَقَالُوا يَا قَوْمَنَا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ، وَلَنْ نُشْرِكَ بِرَبِّنَا أَحَدًا‏.‏ وَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ عَلَى نَبِيِّهِ صلى الله عليه وسلم ‏{‏قُلْ أُوحِيَ إِلَىَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِنَ الْجِنِّ‏}‏ وَإِنَّمَا أُوحِيَ إِلَيْهِ قَوْلُ الْجِنِّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4699,
                "hadithNumber": "4922",
                "englishNarrator": "Narrated Aba Salama bin `Abdur-Rahman:",
                "hadithEnglish": "The first Sura revealed of the Qur'an. He replied \"O you, wrapped-up (i.e. Al Muddaththir).\" I said, \"They say it was, 'Read, in the Name of your Lord Who created,' (i.e. Surat Al-`Alaq (the Clot).\" On that, Abu Salama said, \"I asked Jabir bin `Abdullah رضی اللہ عنہما about that, saying the same as you have said, whereupon he said, 'I will not tell you except what Allah's Messenger (ﷺ) had told us. Allah's Messenger (ﷺ) said, \"I was in seclusion in the cave of Hiram', and after I completed the limited period of my seclusion. I came down (from the cave) and heard a voice calling me. I looked to my right, but saw nothing. Then I looked up and saw something. So I went to Khadija رضی اللہ عنہا (the Prophet's wife) and told her to wrap me up and pour cold water on me. So they wrapped me up and poured cold water on me.\" Then, 'O you, (Muhammad) wrapped up! Arise and warn,' (Surat Al Muddaththir) was revealed.\" (74.1)",
                "hadithUrdu": "قرآن مجید کی کون سی آیت سب سے پہلے نازل ہوئی تھی۔ انہوں نے کہا کہ «يا أيها المدثر‏» میں نے عرض کیا کہ لوگ تو کہتے ہیں کہ «اقرأ باسم ربك الذي خلق‏» سب سے پہلے نازل ہوئی۔ ابوسلمہ نے اس پر کہا کہ میں نے جابر بن عبداللہ رضی اللہ عنہما سے پوچھا تھا اور جو بات ابھی تم نے مجھ سے کہی وہی میں نے بھی ان سے کہی تھی لیکن جابر رضی اللہ عنہ نے کہا تھا کہ میں تم سے وہی حدیث بیان کرتا ہوں جو ہم سے رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فرمائی تھی۔ آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ میں غار حرا میں ایک مدت کے لیے خلوت نشیں تھا۔ جب میں وہ دن پورے کر کے پہاڑ سے اترا تو مجھے آواز دی گئی، میں نے اس آواز پر اپنے دائیں طرف دیکھا لیکن کوئی چیز نہیں دکھائی دی۔ پھر بائیں طرف دیکھا ادھر بھی کوئی چیز دکھائی نہیں دی، سامنے دیکھا ادھر بھی کوئی چیز نہیں دکھائی دی۔ پیچھے کی طرف دیکھا اور ادھر بھی کوئی چیز نہیں دکھائی دی۔ اب میں نے اپنا سر اوپر کی طرف اٹھایا تو مجھے ایک چیز دکھائی دی۔ پھر میں خدیجہ رضی اللہ عنہا کے پاس آیا اور ان سے کہا کہ مجھے کپڑا اوڑھا دو اور مجھ پر ٹھنڈا پانی ڈالو۔ فرمایا کہ پھر انہوں نے مجھے کپڑا اوڑھا دیا اور ٹھنڈا پانی مجھ پر بہایا۔ فرمایا کہ پھر یہ آیت نازل ہوئی «يا أيها المدثر * قم فأنذر * وربك فكبر‏» یعنی ”اے کپڑے میں لپٹنے والے! اٹھئیے پھر لوگوں کو عذاب الٰہی سے ڈرایئے اور اپنے پروردگار کی بڑائی بیان کیجئے۔“",
                "urduNarrator": "ہم سے یحییٰ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، ان سے علی بن مبارک نے بیان کیا، ان سے یحییٰ بن ابی کثیر نے، انہوں نے ابوسلمہ بن عبدالرحمٰن سے پوچھا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ عَلِيِّ بْنِ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، سَأَلْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ عَنْ أَوَّلِ، مَا نَزَلَ مِنَ الْقُرْآنِ‏.‏ قَالَ ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ‏}‏ قُلْتُ يَقُولُونَ ‏{‏اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ‏}‏ فَقَالَ أَبُو سَلَمَةَ سَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ رضى الله عنهما عَنْ ذَلِكَ وَقُلْتُ لَهُ مِثْلَ الَّذِي قُلْتَ فَقَالَ جَابِرٌ لاَ أُحَدِّثُكَ إِلاَّ مَا حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ جَاوَرْتُ بِحِرَاءٍ، فَلَمَّا قَضَيْتُ جِوَارِي هَبَطْتُ فَنُودِيتُ فَنَظَرْتُ عَنْ يَمِينِي فَلَمْ أَرَ شَيْئًا، وَنَظَرْتُ عَنْ شِمَالِي فَلَمْ أَرَ شَيْئًا، وَنَظَرْتُ أَمَامِي فَلَمْ أَرَ شَيْئًا، وَنَظَرْتُ خَلْفِي فَلَمْ أَرَ شَيْئًا، فَرَفَعْتُ رَأْسِي فَرَأَيْتُ شَيْئًا، فَأَتَيْتُ خَدِيجَةَ فَقُلْتُ دَثِّرُونِي وَصُبُّوا عَلَىَّ مَاءً بَارِدًا ـ قَالَ ـ فَدَثَّرُونِي وَصَبُّوا عَلَىَّ مَاءً بَارِدًا قَالَ فَنَزَلَتْ ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ * قُمْ فَأَنْذِرْ * وَرَبَّكَ فَكَبِّرْ‏}‏ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4700,
                "hadithNumber": "4923",
                "englishNarrator": "Narrated Jabir bin `Abdullah:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I was in a seclusion in the cave of Hira.........\"(similar to the narration related by `Ali bin Al-Mubarak, 444 above).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں غار حرا میں تنہائی اختیار کئے ہوئے تھا۔ یہ روایت بھی عثمان بن عمر کی حدیث کی طرح ہے جو انہوں نے علی بن مبارک سے بیان کی ہے۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا، کہا کہ مجھ سے عبدالرحمٰن بن مہدی نے اور ان کے غیر (ابوداؤد طیالسی) نے بیان کیا، کہا کہ ہم سے حرب بن شداد نے بیان کیا، ان سے یحییٰ بن ابی کثیر نے، ان سے ابوسلمہ نے اور ان سے جابر عبداللہ رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، وَغَيْرُهُ، قَالاَ حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، رضى الله عنهما عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ جَاوَرْتُ بِحِرَاءٍ ‏\"‏‏.‏ مِثْلَ حَدِيثِ عُثْمَانَ بْنِ عُمَرَ عَنْ عَلِيِّ بْنِ الْمُبَارَكِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4701,
                "hadithNumber": "4924",
                "englishNarrator": "Narrated Yahya:",
                "hadithEnglish": "I asked Abu Salama, \"Which Sura of the Qur'an was revealed first?\" He replied, \"O you, wrapped-up' (Al-Muddaththir).\" I said, \"I have been informed that it was, 'Read, in the Name of your Lord who created (i.e. Surat Al-Alaq) Thereupon, Abu Salamah said that he asked Hadrat Jabir bin Abdullah رضی اللہ عنہما : Which chapter of the Quran was revealed first? He replied: The Mantled one. i submitted: I have been told that the chapter the clot of the Blood was the first to be revealed. He, whereupon, said: I have told you what Allah`s Apostle ﷺ told me Allah`s Apostle ﷺ said: I had retired to the Cave Hira. After completing the session, when I ascended, and reached the valley, some one called me. I, whereupon, looked forward, backward, to right and to left, and saw someone sitting on a throne in between the heaven and the earth. I came back home and asked Khadijah to wrap me up and pour the cold water on me. So, these verses were revealed to me: ''O the Mantled one. Stand up, then warn. And magnify your Lord alone.",
                "hadithUrdu": "میں نے ابوسلمہ سے پوچھا کہ قرآن مجید کی کون سی آیت سب سے پہلے نازل ہوئی تھی؟ فرمایا کہ «يا أيها المدثر‏» میں نے کہا کہ مجھے خبر ملی ہے کہ «اقرأ باسم ربك الذي خلق‏» سب سے پہلے نازل ہوئی تھی۔ ابوسلمہ نے بیان کیا کہ میں نے جابر بن عبداللہ رضی اللہ عنہما سے پوچھا تھا کہ قرآن کی کون سی آیت سب سے پہلے نازل ہوئی تھی؟ انہوں نے فرمایا کہ «يا أيها المدثر‏» ”اے کپڑے میں لپٹنے والے!“ میں نے ان سے یہی کہا تھا کہ مجھے خبر ملی ہے کہ «اقرأ باسم ربك‏» سب سے پہلے نازل ہوئی تھی تو انہوں نے کہا کہ میں تمہیں وہی خبر دے رہا ہوں جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں نے غار حرا میں تنہائی اختیار کی جب میں وہ مدت پوری کر چکا اور نیچے اتر کر وادی کے بیچ میں پہنچا تو مجھے پکارا گیا۔ میں نے اپنے آگے پیچھے دائیں بائیں دیکھا اور مجھے دکھائی دیا کہ فرشتہ آسمان اور زمین کے درمیان کرسی پر بیٹھا ہے۔ پھر میں خدیجہ ( رضی اللہ عنہا ) کے پاس آیا اور ان سے کہا کہ مجھے کپڑا اوڑھا دو اور میرے اوپر ٹھنڈا پانی ڈالو اور مجھ پر یہ آیت نازل ہوئی «يا أيها المدثر * قم فأنذر * وربك فكبر‏» ”اے کپڑے میں لپٹنے والے! اٹھئیے پھر لوگوں کو عذاب آخرت سے ڈرایئے اور اپنے پروردگار کی بڑائی کیجئے۔“",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے عبدالصمد نے بیان کیا، کہا ہم سے حرب نے بیان کیا کہ ہم سے یحییٰ نے بیان کیا، کہا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حَرْبٌ، حَدَّثَنَا يَحْيَى، قَالَ سَأَلْتُ أَبَا سَلَمَةَ أَىُّ الْقُرْآنِ أُنْزِلَ أَوَّلُ فَقَالَ ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ‏}‏ فَقُلْتُ أُنْبِئْتُ أَنَّهُ ‏{‏اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ‏}‏ فَقَالَ أَبُو سَلَمَةَ سَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ أَىُّ الْقُرْآنِ أُنْزِلَ أَوَّلُ فَقَالَ ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ‏}‏ فَقُلْتُ أُنْبِئْتُ أَنَّهُ ‏{‏اقْرَأْ بِاسْمِ رَبِّكَ‏}‏ فَقَالَ لاَ أُخْبِرُكَ إِلاَّ بِمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ جَاوَرْتُ فِي حِرَاءٍ فَلَمَّا قَضَيْتُ جِوَارِي، هَبَطْتُ فَاسْتَبْطَنْتُ الْوَادِيَ فَنُودِيتُ، فَنَظَرْتُ أَمَامِي وَخَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي فَإِذَا هُوَ جَالِسٌ عَلَى عَرْشٍ بَيْنَ السَّمَاءِ وَالأَرْضِ، فَأَتَيْتُ خَدِيجَةَ فَقُلْتُ دَثِّرُونِي وَصُبُّوا عَلَىَّ مَاءً بَارِدًا، وَأُنْزِلَ عَلَىَّ ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ * قُمْ فَأَنْذِرْ * وَرَبَّكَ فَكَبِّرْ‏}‏‏\"‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَرَبَّكَ فَكَبِّرْ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"اور اپنے رب کی بڑائی بیان کرو!\" (V.74:3)",
                "headingEnglish": "The Statement of Allah the Most High: \"And magnify your Lord (Allah)!\" (V.74:3)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4702,
                "hadithNumber": "4925",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "I heard the Prophet (ﷺ) describing the period of pause of the Divine Inspiration. He said in his talk, \"While I was walking, I heard voices from the sky. I looked up, and behold ! I saw the same Angel who came to me in the cave of Hira' sitting on a chair between the sky and the earth. I was too much afraid of him (so I returned to my house) and said, 'Fold me up in garments!' They wrapped me up. Then Allah revealed: 'O you wrapped...and desert the idols before the prayer became compulsory.' Rujz means idols.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، نبی کریم صلی اللہ علیہ وسلم درمیان میں وحی کا سلسلہ رک جانے کا حال بیان فرما رہے تھے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں رو رہا تھا کہ میں نے آسمان کی طرف سے آواز سنی۔ میں نے اپنا سر اوپر اٹھایا تو وہی فرشتہ نظر آیا جو میرے پاس غار حرا میں آیا تھا۔ وہ آسمان و زمین کے درمیان کرسی پر بیٹھا ہوا تھا۔ میں اس کے ڈر سے گھبرا گیا پھر میں گھر واپس آیا اور خدیجہ سے کہا کہ مجھے کپڑا اوڑھا دو، مجھے کپڑا اوڑھا دو۔ انہوں نے مجھے کپڑا اوڑھا دیا پھر اللہ تعالیٰ نے آیت «يا أيها المدثر‏» سے «والرجز فاهجر‏» تک نازل کی۔ یہ سورت نماز فرض کئے جانے سے پہلے نازل ہوئی تھی «الرجز‏» سے مراد بت ہے۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے (دوسری سند) اور مجھ سے عبداللہ بن محمد نے بیان کیا، انہوں نے کہا ہم سے عبدالرزاق نے بیان کیا، انہوں نے کہا ہم کو معمر نے خبر دی، انہیں زہری نے خبر دی، کہا مجھ کو ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ،‏.‏ وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، فَأَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم وَهْوَ يُحَدِّثُ عَنْ فَتْرَةِ الْوَحْىِ فَقَالَ فِي حَدِيثِهِ ‏\"‏ فَبَيْنَا أَنَا أَمْشِي إِذْ سَمِعْتُ صَوْتًا مِنَ السَّمَاءِ فَرَفَعْتُ رَأْسِي فَإِذَا الْمَلَكُ الَّذِي جَاءَنِي بِحِرَاءٍ جَالِسٌ عَلَى كُرْسِيٍّ بَيْنَ السَّمَاءِ وَالأَرْضِ، فَجَئِثْتُ مِنْهُ رُعْبًا فَرَجَعْتُ فَقُلْتُ زَمِّلُونِي زَمِّلُونِي‏.‏ فَدَثَّرُونِي فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ‏}‏ إِلَى ‏{‏وَالرِّجْزَ فَاهْجُرْ‏}‏ ـ قَبْلَ أَنْ تُفْرَضَ الصَّلاَةُ ـ وَهْىَ الأَوْثَانُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَثِيَابَكَ فَطَهِّرْ‏}‏",
                "headingUrdu": "\"اور اپنے کپڑوں کو پاک کرو!\" (V.74:4)",
                "headingEnglish": "\"And purify your garments!\" (V.74:4)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4676,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=187",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=185",
                "label": "185",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=186",
                "label": "186",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=187",
                "label": "187",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=188",
                "label": "188",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=189",
                "label": "189",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=190",
                "label": "190",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=191",
                "label": "191",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=189",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=189",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=187",
        "to": 4700,
        "total": 40465
    }
}