{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 183,
        "data": [
            {
                "id": 4553,
                "hadithNumber": "4774",
                "englishNarrator": "Narrated Masruq:",
                "hadithEnglish": "While a man was delivering a speech in the tribe of Kinda, he said, \"Smoke will prevail on the Day of Resurrection and will deprive the hypocrites their faculties of hearing and seeing. The believers will be afflicted with something like cold only thereof.\" That news scared us, so I went to (Abdullah) Ibn Mas`ud while he was reclining (and told him the story) whereupon he became angry, sat up and said, \"He who knows a thing can say, it, but if he does not know, he should say, 'Allah knows best,' for it is an aspect of knowledge to say, 'I do not know,' if you do not know a certain thing. Allah said to His prophet. 'Say (O Muhammad): No wage do I ask of you for this (Qur'an), nor I am one of the pretenders (a person who pretends things which do not exist.)' (38.86) The Qur'aish delayed in embracing Islam for a period, so the Prophet (ﷺ) invoked evil on them, saying, 'O Allah! Help me against them by sending seven years of (famine) like those of Joseph.' So they were afflicted with such a severe year of famine that they were destroyed therein and ate dead animals and bones. They started seeing something like smoke between the sky and the earth (because of severe hunger). Abu Sufyan then came (to the Prophet) and said, \"O Muhammad! You came to order us for to keep good relations with Kith and kin, and your kinsmen have now perished, so please invoke Allah (to relieve them).' Then Ibn Mas`ud recited:-- 'Then watch you for the day that the sky will bring forth a kind of smoke plainly visible....but truly you will return! (to disbelief) (44.10-15) Ibn Mas`ud added, Then the punishment was stopped, but truly, they reverted to heathenism (their old way). So Allah (threatened them thus): 'On the day when we shall seize you with a mighty grasp.' (44.16) And that was the day of the Battle of Badr. Allah's saying- \"Lizama\" (the punishment) refers to the day of Badr Allah's Statement: Alif-Lam-Mim, the Romans have been defeated, and they, after their defeat, will be victorious,' (30.1- 3) (This verse): Indicates that the defeat of Byzantine has already passed.",
                "hadithUrdu": "ایک شخص نے قبیلہ کندہ میں وعظ بیان کرتے ہوئے کہا کہ قیامت کے دن ایک دھواں اٹھے گا جس سے منافقوں کے آنکھ کان بالکل بیکار ہو جائیں گے لیکن مومن پر اس کا اثر صرف زکام جیسا ہو گا۔ ہم اس کی بات سے بہت گھبرا گئے۔ پھر میں ابن مسعود رضی اللہ عنہ کی خدمت میں حاضر ہوا ( اور انہیں ان صاحب کی یہ بات سنائی ) وہ اس وقت ٹیک لگائے بیٹھے تھے، اسے سن کر بہت غصہ ہوئے اور سیدھے بیٹھ گئے۔ پھر فرمایا کہ اگر کسی کو کسی بات کا واقعی علم ہے تو پھر اسے بیان کرنا چاہئے لیکن اگر علم نہیں ہے تو کہہ دینا چاہئے کہ اللہ زیادہ جاننے والا ہے۔ یہ بھی علم ہی ہے کہ آدمی اپنی لاعلمی کا اقرار کر لے اور صاف کہہ دے کہ میں نہیں جانتا۔ اللہ تعالیٰ نے اپنے نبی کریم صلی اللہ علیہ وسلم سے فرمایا تھا «قل ما أسألكم عليه من أجر وما أنا من المتكلفين‏» ”آپ کہہ دیجئیے کہ میں اپنی تبلیغ و دعوت پر تم سے کوئی اجر نہیں چاہتا اور نہ میں بناوٹ کرتا ہوں۔“ اصل میں واقعہ یہ ہے کہ قریش کسی طرح اسلام نہیں لاتے تھے۔ اس لیے نبی کریم صلی اللہ علیہ وسلم نے ان کے حق میں بددعا کی کہ اے اللہ! ان پر یوسف علیہ السلام کے زمانے جیسا قحط بھیج کر میری مدد کر پھر ایسا قحط پڑا کہ لوگ تباہ ہو گئے اور مردار اور ہڈیاں کھانے لگے کوئی اگر فضا میں دیکھتا ( تو فاقہ کی وجہ سے ) اسے دھویں جیسا نظر آتا۔ پھر ابوسفیان آئے اور کہا کہ اے محمد! آپ ہمیں صلہ رحمی کا حکم دیتے ہیں لیکن آپ کی قوم تباہ ہو رہی ہے، اللہ سے دعا کیجئے ( کہ ان کی یہ مصیبت دور ہو ) ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے یہ آیت پڑھی «فارتقب يوم تأتي السماء بدخان مبين‏» سے «عائدون‏» تک۔ ابن مسعود رضی اللہ عنہ نے بیان کیا کہ قحط کا یہ عذاب تو نبی کریم صلی اللہ علیہ وسلم کی دعا کے نتیجہ میں ختم ہو گیا تھا لیکن کیا آخرت کا عذاب بھی ان سے ٹل جائے گا؟ چنانچہ قحط ختم ہونے کے بعد پھر وہ کفر سے باز نہ آئے، اس کی طرف اشارہ «يوم نبطش البطشة الكبرى‏» میں ہے، یہ بطش کفار پر غزوہ بدر کے موقع پر نازل ہوئی تھی ( کہ ان کے بڑے بڑے سردار قتل کر دیئے گئے ) اور «لزاما» ( قید ) سے اشارہ بھی معرکہ بدر ہی کی طرف ہے «الم * غلبت الروم‏» سے «سيغلبون‏» تک کا واقعہ گزر چکا ہے کہ ( کہ روم والوں نے فارس والوں پر فتح پالی تھی ) ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، کہا ہم سے منصور اور اعمش نے بیان کیا، ان سے ابوالضحیٰ نے، ان سے مسروق نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا مَنْصُورٌ، وَالأَعْمَشُ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، قَالَ بَيْنَمَا رَجُلٌ يُحَدِّثُ فِي كِنْدَةَ فَقَالَ يَجِيءُ دُخَانٌ يَوْمَ الْقِيَامَةِ فَيَأْخُذُ بِأَسْمَاعِ الْمُنَافِقِينَ وَأَبْصَارِهِمْ، يَأْخُذُ الْمُؤْمِنَ كَهَيْئَةِ الزُّكَامِ‏.‏ فَفَزِعْنَا، فَأَتَيْتُ ابْنَ مَسْعُودٍ، وَكَانَ مُتَّكِئًا، فَغَضِبَ فَجَلَسَ فَقَالَ مَنْ عَلِمَ فَلْيَقُلْ، وَمَنْ لَمْ يَعْلَمْ فَلْيَقُلِ اللَّهُ أَعْلَمُ‏.‏ فَإِنَّ مِنَ الْعِلْمِ أَنْ يَقُولَ لِمَا لاَ يَعْلَمُ لاَ أَعْلَمُ‏.‏ فَإِنَّ اللَّهَ قَالَ لِنَبِيِّهِ صلى الله عليه وسلم ‏{‏قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَمَا أَنَا مِنَ الْمُتَكَلِّفِينَ‏}‏ وَإِنَّ قُرَيْشًا أَبْطَئُوا عَنِ الإِسْلاَمِ فَدَعَا عَلَيْهِمِ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ اللَّهُمَّ أَعِنِّي عَلَيْهِمْ بِسَبْعٍ كَسَبْعِ يُوسُفَ، فَأَخَذَتْهُمْ سَنَةٌ حَتَّى هَلَكُوا فِيهَا، وَأَكَلُوا الْمَيْتَةَ وَالْعِظَامَ وَيَرَى الرَّجُلُ مَا بَيْنَ السَّمَاءِ وَالأَرْضِ كَهَيْئَةِ الدُّخَانِ ‏\"‏، فَجَاءَهُ أَبُو سُفْيَانَ فَقَالَ يَا مُحَمَّدُ جِئْتَ تَأْمُرُنَا بِصِلَةِ الرَّحِمِ، وَإِنَّ قَوْمَكَ قَدْ هَلَكُوا فَادْعُ اللَّهَ، فَقَرَأَ ‏{‏فَارْتَقِبْ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ‏}‏ إِلَى قَوْلِهِ ‏{‏عَائِدُونَ‏}‏ أَفَيُكْشَفُ عَنْهُمْ عَذَابُ الآخِرَةِ إِذَا جَاءَ ثُمَّ عَادُوا إِلَى كُفْرِهِمْ فَذَلِكَ قَوْلُهُ تَعَالَى ‏{‏يَوْمَ نَبْطِشُ الْبَطْشَةَ الْكُبْرَى‏}‏ يَوْمَ بَدْرٍ وَلِزَامًا يَوْمَ بَدْرٍ ‏{‏الم * غُلِبَتِ الرُّومُ‏}‏ إِلَى ‏{‏سَيَغْلِبُونَ‏}‏ وَالرُّومُ قَدْ مَضَى‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4554,
                "hadithNumber": "4775",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"No child is born except on Al-Fitra (Islam) and then his parents make him Jewish, Christian or Magian, as an animal produces a perfect young animal: do you see any part of its body amputated?\" Then he rec 'The religion of pure Islamic Faith (Hanifa),(i.e. to worship none but Allah), The pure Allah's Islamic nature with which He (Allah) has created mankind. Let There be no change in Allah's religion (i.e. to join none in Allah's worship). That is the straight religion; but most of men know not...\" (30.30)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ہر پیدا ہونے والا بچہ دین فطرت پر پیدا ہوتا ہے لیکن اس کے ماں باپ اسے یہودی، نصرانی یا مجوسی بنا لیتے ہیں۔ اس کی مثال ایسی ہے جیسی جانور کا بچہ صحیح سالم پیدا ہوتا ہے کیا تم نے انہیں ناک کان کٹا ہوا کوئی بچہ دیکھا ہے۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے اس آیت کی تلاوت کی «فطرة الله التي فطر الناس عليها لا تبديل لخلق الله ذلك الدين القيم‏» ”اللہ کی اس فطرت کی اتباع کرو جس پر اس نے انسان کو پیدا کیا ہے، اللہ کی بنائی ہوئی فطرت میں کوئی تبدیلی ممکن نہیں، یہی سیدھا دین ہے۔“",
                "urduNarrator": "ہم سے عبدان نے بیان کیا، کہا ہمیں عبداللہ بن مبارک نے خبر دی، انہیں یونس بن یزید نے خبر دی، ان سے زہری نے بیان کیا، انہیں ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ مَوْلُودٍ إِلاَّ يُولَدُ عَلَى الْفِطْرَةِ، فَأَبَوَاهُ يُهَوِّدَانِهِ أَوْ يُنَصِّرَانِهِ أَوْ يُمَجِّسَانِهِ، كَمَا تُنْتَجُ الْبَهِيمَةُ بَهِيمَةً جَمْعَاءَ، هَلْ تُحِسُّونَ فِيهَا مِنْ جَدْعَاءَ ‏\"‏ ثُمَّ يَقُولُ ‏{‏فِطْرَةَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا لاَ تَبْدِيلَ لِخَلْقِ اللَّهِ ذَلِكَ الدِّينُ الْقَيِّمُ‏}‏",
                "headingArabic": "‏{‏لاَ تَبْدِيلَ لِخَلْقِ اللَّهِ‏}‏ لِدِينِ اللَّهِ",
                "headingUrdu": "اللہ کا فرمان: \"... خلق اللہ (یعنی اللہ کے دین - اسلامی توحید) میں کوئی تبدیلی نہیں ہونی چاہیے...\" (V.30:30)",
                "headingEnglish": "Allah's Statement: \"...No change let there be in Khalq-illāh (i.e., the religion of Allāh - Islamic Monotheism)...\" (V.30:30)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4555,
                "hadithNumber": "4776",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "When there was revealed: 'It is those who believe and confuse not their beliefs with wrong.' (6.82) It was very hard for the companions of Allah's Messenger (ﷺ), so they said, \"Which of us has not confused his belief with wrong?\" Allah's Messenger (ﷺ) said, \"The Verse does not mean this. Don't you hear Luqman's statement to his son: 'Verily! Joining others in worship, with Allah is a great wrong indeed.' (31.13)",
                "hadithUrdu": "جب آیت «الذين آمنوا ولم يلبسوا إيمانهم بظلم‏» کہ ”جو لوگ ایمان لائے اور اپنے ایمان کے ساتھ ظلم کی آمیزش نہیں کی۔“ نازل ہوئی تو اصحاب رسول صلی اللہ علیہ وسلم بہت گھبرائے اور کہنے لگے کہ ہم میں کون ایسا ہو گا جس نے اپنے ایمان کے ساتھ ظلم کی ملاوٹ نہیں کی ہو گی؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ آیت میں ظلم سے یہ مراد نہیں ہے۔ تم نے لقمان علیہ السلام کی وہ نصیحت نہیں سنی جو انہوں نے اپنے بیٹے کو کی تھی «إن الشرك لظلم عظيم‏» کہ ”بیشک شرک کرنا بڑا بھاری ظلم ہے۔“",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے اعمش نے، ان سے ابراہیم نے، ان سے علقمہ نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏}‏ شَقَّ ذَلِكَ عَلَى أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَالُوا أَيُّنَا لَمْ يَلْبِسْ إِيمَانَهُ بِظُلْمٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُ لَيْسَ بِذَاكَ، أَلاَ تَسْمَعُ إِلَى قَوْلِ لُقْمَانَ لاِبْنِهِ ‏{‏إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ‏}‏‏\"‏",
                "headingArabic": "‏{‏لاَ تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ‏}‏",
                "headingUrdu": "\"... اللہ کے ساتھ دوسروں کی عبادت میں شریک نہ بنو۔ بے شک! اللہ کے ساتھ عبادت میں شریک ہونا بہت بڑی غلطی ہے۔\" (V.31:13)",
                "headingEnglish": "\"... Join not in worship others with Allah. Verily! Joining others in worship with Allah is a great Ẓulm (wrong) indeed.\" (V.31:13)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4556,
                "hadithNumber": "4777",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "One day while Allah's Messenger (ﷺ) was sitting with the people, a man came to him walking and said, \"O Allah's Messenger (ﷺ). What is Belief?\" The Prophet (ﷺ) said, \"Belief is to believe in Allah, His Angels, His Books, His Apostles, and the meeting with Him, and to believe in the Resurrection.\" The man asked, \"O Allah's Messenger (ﷺ) What is Islam?\" The Prophet (ﷺ) replied, \"Islam is to worship Allah and not worship anything besides Him, to offer prayers perfectly, to pay the (compulsory) charity i.e. Zakat and to fast the month of Ramadan.\" The man again asked, \"O Allah's Messenger (ﷺ) What is Ihsan (i.e. perfection or Benevolence)?\" The Prophet (ﷺ) said, \"Ihsan is to worship Allah as if you see Him, and if you do not achieve this state of devotion, then (take it for granted that) Allah sees you.\" The man further asked, \"O Allah's Messenger (ﷺ) When will the Hour be established?\" The Prophet (ﷺ) replied, \"The one who is asked about it does not know more than the questioner does, but I will describe to you its portents. When the lady slave gives birth to her mistress, that will be of its portents; when the bare-footed naked people become the chiefs of the people, that will be of its portents. The Hour is one of five things which nobody knows except Allah. Verily, the knowledge of the Hour is with Allah (alone). He sends down the rain, and knows that which is in the wombs.\" (31.34) Then the man left. The Prophet (ﷺ) said, \"Call him back to me.\" They went to call him back but could not see him. The Prophet (ﷺ) said, \"That was Gabriel who came to teach the people their religion.\" (See Hadith No. 47 Vol 1)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ایک دن لوگوں کے ساتھ تشریف رکھتے تھے کہ ایک نیا آدمی خدمت میں حاضر ہوا اور پوچھا: یا رسول اللہ! ایمان کیا ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ایمان یہ ہے کہ تم اللہ اور اس کے فرشتوں، رسولوں اور اس کی ملاقات پر ایمان لاؤ اور قیامت کے دن پر ایمان لاؤ۔ انہوں نے پوچھا: یا رسول اللہ! اسلام کیا ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسلام یہ ہے کہ تنہا اللہ کی عبادت کرو اور کسی کو اس کا شریک نہ ٹھہراؤ، نماز قائم کرو اور فرض زکوٰۃ ادا کرو اور رمضان کے روزے رکھو۔ انہوں نے پوچھا: یا رسول اللہ! احسان کیا ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ احسان یہ ہے کہ تم اللہ کی اس طرح عبادت کرو گویا کہ تم اسے دیکھ رہے ہو ورنہ یہ عقیدہ لازماً رکھو کہ اگر تم اسے نہیں دیکھتے تو وہ تمہیں ضرور دیکھ رہا ہے۔ انہوں نے پوچھا: یا رسول اللہ! قیامت کب قائم ہو گی؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس سے پوچھا جا رہا ہے خود وہ سائل سے زیادہ اس کے واقع ہونے کے متعلق نہیں جانتا۔ البتہ میں تمہیں اس کی چند نشانیاں بتاتا ہوں۔ جب عورت ایسی اولاد جنے جو اس کے آقا بن جائیں تو یہ قیامت کی نشانی ہے، جب ننگے پاؤں، ننگے جسم والے لوگ لوگوں پر حاکم ہو جائیں تو یہ قیامت کی نشانی ہے۔ قیامت بھی ان پانچ چیزوں میں سے ہے جسے اللہ کے سوا اور کوئی نہیں جانتا، بیشک اللہ ہی کے پاس قیامت کا علم ہے۔ وہی مینہ برساتا ہے اور وہی جانتا ہے کہ ماں کے رحم میں کیا ہے ( لڑکا یا لڑکی ) پھر وہ صاحب اٹھ کر چلے گئے تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہیں میرے پاس واپس بلا لاؤ۔ لوگوں نے انہیں تلاش کیا تاکہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں دوبارہ لائیں لیکن ان کا کہیں پتہ نہیں تھا۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ صاحب جبرائیل تھے ( انسانی صورت میں ) لوگوں کو دین کی باتیں سکھانے آئے تھے۔",
                "urduNarrator": "مجھ سے اسحاق نے بیان کیا، ان سے جریر نے، ان سے ابوحیان نے، ان سے ابوزرعہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، عَنْ جَرِيرٍ، عَنْ أَبِي حَيَّانَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَوْمًا بَارِزًا لِلنَّاسِ إِذْ أَتَاهُ رَجُلٌ يَمْشِي فَقَالَ يَا رَسُولَ اللَّهِ مَا الإِيمَانُ قَالَ ‏\"‏ الإِيمَانُ أَنْ تُؤْمِنَ بِاللَّهِ وَمَلاَئِكَتِهِ وَرُسُلِهِ وَلِقَائِهِ وَتُؤْمِنَ بِالْبَعْثِ الآخِرِ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ مَا الإِسْلاَمُ قَالَ ‏\"‏ الإِسْلاَمُ أَنْ تَعْبُدَ اللَّهَ وَلاَ تُشْرِكَ بِهِ شَيْئًا، وَتُقِيمَ الصَّلاَةَ، وَتُؤْتِيَ الزَّكَاةَ الْمَفْرُوضَةَ، وَتَصُومَ رَمَضَانَ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ، مَا الإِحْسَانُ قَالَ ‏\"‏ الإِحْسَانُ أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ مَتَى السَّاعَةُ قَالَ ‏\"‏ مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ، وَلَكِنْ سَأُحَدِّثُكَ عَنْ أَشْرَاطِهَا إِذَا وَلَدَتِ الْمَرْأَةُ رَبَّتَهَا، فَذَاكَ مِنْ أَشْرَاطِهَا، وَإِذَا كَانَ الْحُفَاةُ الْعُرَاةُ رُءُوسَ النَّاسِ فَذَاكَ مِنْ أَشْرَاطِهَا فِي خَمْسٍ لا يَعْلَمُهُنَّ إِلاَّ اللَّهُ ‏{‏إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الأَرْحَامِ‏}‏ ‏\"‏‏.‏ ثُمَّ انْصَرَفَ الرَّجُلُ فَقَالَ ‏\"‏ رُدُّوا عَلَىَّ ‏\"‏‏.‏ فَأَخَذُوا لِيَرُدُّوا فَلَمْ يَرَوْا شَيْئًا‏.‏ فَقَالَ ‏\"‏ هَذَا جِبْرِيلُ جَاءَ لِيُعَلِّمَ النَّاسَ دِينَهُمْ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"بے شک اللہ! قیامت کا علم اسی کے پاس ہے۔\" (آیت 31:34)",
                "headingEnglish": "The Statement of Allah the Exalted: \"Verily, Allah! With Him (Alone) is the knowledge of the Hour...\" (V.31:34)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4557,
                "hadithNumber": "4778",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet said, \"The keys of A1-Ghaib (the Unseen) are five.\" And then he recited :- \"Verily, Allah! With Him (Alone) is the knowledge of the Hour.....(V.31:34)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ غیب کی کنجیاں پانچ ہیں۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے اس آیت کی تلاوت کی «إن الله عنده علم الساعة‏» ”بیشک اللہ ہی کو قیامت کا علم ہے....''",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا، کہا کہ مجھ سے ابن وہب نے بیان کیا، کہا کہ مجھ سے عمر بن محمد بن عبداللہ بن عمر نے بیان کیا، ان سے ان کے والد نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدِ بْنِ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ مَفَاتِيحُ الْغَيْبِ خَمْسٌ ‏\"‏ ثُمَّ قَرَأَ ‏{‏إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ‏}‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4558,
                "hadithNumber": "4779",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Allah said, 'I have prepared for my pious worshipers such things as no eye has ever seen, no ear has ever heard of, and nobody has ever thought of.\" Abu Huraira رضی اللہ عنہ  added: If you wish you can read:-- 'No soul knows what is kept hidden (in reserve) for them of joy as reward for what they used to do.' 32.17. Hadrat Abu Hurarirah رضی اللہ عنہ reports that Allah says: Then he reported as per the Hadith mentioned above. Sufyan was asked: Are you reporting it from the prophet ﷺ?he replied: No. It was asked: then from whom else? Abu Sualih has reported from Hadrat Abu Hurairah رضی اللہ عنہ and he read '' قُرَّاتِ أَعْيُنٍ‏ '' in it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ کا ارشاد ہے کہ ”میں نے اپنے صالح اور نیک بندوں کے لیے وہ چیزیں تیار کر رکھی ہیں جنہیں کسی آنکھ نے دیکھا نہ کسی کان نے سنا اور نہ کسی کے گمان و خیال میں وہ آئی ہیں۔“ ابوہریرہ رضی اللہ عنہ نے کہا کہ اگر چاہو تو اس آیت کو پڑھ لو «فلا تعلم نفس ما أخفي لهم من قرة أعين‏» کہ ”سو کسی کو نہیں معلوم جو جو سامان آنکھوں کی ٹھنڈک کا ان کے لیے جنت میں چھپا کر رکھا گیا ہے۔“ علی بن عبداللہ مدینی نے بیان کیا کہ ہم سے سفیان نے بیان کیا، ان سے ابوالزناد نے بیان کیا، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ اللہ تعالیٰ نے فرمایا ہے، پہلی حدیث کی طرح۔ سفیان سے پوچھا گیا کہ یہ آپ نبی کریم صلی اللہ علیہ وسلم کی حدیث روایت کر رہے ہیں یا اپنے اجتہاد سے فرما رہے ہیں؟ انہوں نے فرمایا کہ ( اگر یہ نبی کریم صلی اللہ علیہ وسلم کی حدیث نہیں ہے ) تو پھر اور کیا ہے؟ ابومعاویہ نے بیان کیا، ان سے اعمش نے اور ان سے صالح نے کہ ابوہریرہ رضی اللہ عنہ نے ( آیت مذکورہ میں ) قرآت ( صیغہ جمع کے ساتھ ) پڑھا ہے۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان نے بیان کیا، ان سے ابوالزناد نے، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى أَعْدَدْتُ لِعِبَادِي الصَّالِحِينَ مَا لاَ عَيْنٌ رَأَتْ، وَلاَ أُذُنٌ سَمِعَتْ، وَلاَ خَطَرَ عَلَى قَلْبِ بَشَرٍ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ اقْرَءُوا إِنْ شِئْتُمْ ‏{‏فَلاَ تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ‏}‏‏.‏ وَحَدَّثَنَا سُفْيَانُ حَدَّثَنَا أَبُو الزِّنَادِ عَنِ الأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ اللَّهُ مِثْلَهُ‏.‏ قِيلَ لِسُفْيَانَ رِوَايَةً‏.‏ قَالَ فَأَىُّ شَىْءٍ قَالَ أَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ عَنْ أَبِي صَالِحٍ قَرَأَ أَبُو هُرَيْرَةَ قُرَّاتِ أَعْيُنٍ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏فَلاَ تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ‏ مِّن قُرَّةِ أَعْيُنٍ}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’کوئی نہیں جانتا کہ ان کے لیے خوشی کے لیے کیا پوشیدہ رکھا گیا ہے‘‘ (V.32:17)",
                "headingEnglish": "The Statement of Allah the Exalted: \"No person knows what is kept hidden for them of joy...\" (V.32:17)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4559,
                "hadithNumber": "4780",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet, said, \"Allah said, 'I have prepared for My pious worshipers such things as no eye has ever seen, no ear has ever heard of, and nobody has ever thought of. All that is reserved, besides which, all that you have seen, is nothing.\" Then he recited:-- 'No soul knows what is kept hidden (in reserve) for them of joy as a reward for what they used to do.' (32.17)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ ارشاد فرماتا ہے کہ میں نے اپنے نیکوکار بندوں کے لیے وہ چیزیں تیار رکھی ہیں جنہیں کسی آنکھ نے نہ دیکھا اور کسی کان نے نہ سنا اور نہ کسی انسان کے دل میں ان کا کبھی گمان و خیال پیدا ہوا۔ اللہ کی ان نعمتوں سے واقفیت اور آگاہی تو الگ رہی ( ان کا کسی کو گمان و خیال بھی پیدا نہیں ہوا ) ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے اس آیت کی تلاوت کی «فلا تعلم نفس ما أخفي لهم من قرة أعين جزاء بما كانوا يعملون‏» کہ ”سو کسی نفس مومن کو معلوم نہیں جو جو سامان آنکھوں کی ٹھنڈک کا ( جنت میں ) ان کے لیے چھپا کر رکھا گیا ہے، یہ بدلہ ہے ان کے نیک عملوں کا جو دنیا میں کرتے رہے۔“",
                "urduNarrator": "مجھ سے اسحاق بن نصر نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے اعمش نے، کہا ہم سے ابوصالح نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الأَعْمَشِ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ يَقُولُ اللَّهُ تَعَالَى أَعْدَدْتُ لِعِبَادِي الصَّالِحِينَ مَا لاَ عَيْنٌ رَأَتْ، وَلاَ أُذُنٌ سَمِعَتْ، وَلاَ خَطَرَ عَلَى قَلْبِ بَشَرٍ، ذُخْرًا، بَلْهَ مَا أُطْلِعْتُمْ عَلَيْهِ ‏\"‏‏.‏ ثُمَّ قَرَأَ ‏{‏فَلاَ تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ جَزَاءً بِمَا كَانُوا يَعْمَلُونَ‏}‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4560,
                "hadithNumber": "4781",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"There is no believer but I, of all the people, I am the closest to him both in this world and in the Hereafter. Recite if you wish: 'The Prophet (ﷺ) is closer to the believers than their own selves.' (33.6) so if a believer (dies) leaves some property then his relatives will inherit that property; but if he is in debt or he leaves poor children, let those (creditors and children) come to me (that I may pay the debt and provide for the children), for them I am his sponsor (surely).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ کوئی مومن ایسا نہیں کہ میں خود اس کے نفس سے بھی زیادہ اس سے اور آخرت میں تعلق نہ رکھتا ہوں، اگر تمہارا جی چاہے تو یہ آیت پڑھ لو «النبي أولى بالمؤمنين من أنفسهم‏» کہ ”نبی مؤمنین کے ساتھ خود ان کے نفس سے بھی زیادہ تعلق رکھتے ہے۔“ پس جو مومن بھی ( مرنے کے بعد ) ترکہ مال و اسباب چھوڑے اور کوئی ان کا ولی وارث نہیں ہے اس کے عزیز و اقارب جو بھی ہوں، اس کے مال کے وارث ہوں گے، لیکن اگر کسی مومن نے کوئی قرض چھوڑا ہے یا اولاد چھوڑی ہے تو وہ میرے پاس آ جائیں ان کا ذمہ دار میں ہوں۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا، کہا ہم سے محمد بن فلیح نے، کہا مجھ سے میرے والد نے، ان سے ہلال بن علی نے اور ان سے عبدالرحمٰن بن ابی عمرہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ، حَدَّثَنَا أَبِي، عَنْ هِلاَلِ بْنِ عَلِيٍّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَا مِنْ مُؤْمِنٍ إِلاَّ وَأَنَا أَوْلَى النَّاسِ بِهِ فِي الدُّنْيَا وَالآخِرَةِ، اقْرَءُوا إِنْ شِئْتُمْ ‏{‏النَّبِيُّ أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ‏}‏ فَأَيُّمَا مُؤْمِنٍ تَرَكَ مَالاً فَلْيَرِثْهُ عَصَبَتُهُ مَنْ كَانُوا، فَإِنْ تَرَكَ دَيْنًا أَوْ ضِيَاعًا فَلْيَأْتِنِي وَأَنَا مَوْلاَهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4561,
                "hadithNumber": "4782",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "We used not to call Zaid bin Haritha the freed slave of Allah's Messenger (ﷺ) except Zaid bin Muhammad till the Qu'anic Verse was revealed: \"Call them (adopted sons) by (the names of) their fathers. That is more than just in the Sight of Allah.\" (33.5)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے آزاد کئے ہوئے غلام زید بن حارثہ کو ہم ہمیشہ زید بن محمد کہہ کر پکارا کرتے تھے، یہاں تک کہ قرآن کریم میں آیت نازل ہوئی «ادعوهم لآبائهم هو أقسط عند الله‏» کہ ”انہیں ان کے باپوں کی طرف منسوب کرو کہ یہی اللہ کے نزدیک سچی اور ٹھیک بات ہے۔“",
                "urduNarrator": "ہم سے معلی بن اسد نے بیان کیا، کہا ہم سے عبدالعزیز بن مختار نے بیان کیا، کہا ہم سے موسیٰ بن عقبہ نے بیان کیا، کہا کہ مجھ سے سالم نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، قَالَ حَدَّثَنِي سَالِمٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ زَيْدَ بْنَ حَارِثَةَ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مَا كُنَّا نَدْعُوهُ إِلاَّ زَيْدَ ابْنَ مُحَمَّدٍ حَتَّى نَزَلَ الْقُرْآنُ ‏{‏ادْعُوهُمْ لآبَائِهِمْ هُوَ أَقْسَطُ عِنْدَ اللَّهِ‏}‏‏.‏",
                "headingArabic": "‏{‏ادْعُوهُمْ لآبَائِهِمْ هُوَ أَقْسَطُ عِندَ اللَّهِ ۚ‏}‏",
                "headingUrdu": "\"انہیں (گود لیے ہوئے بیٹوں) کو ان کے باپوں کے ناموں سے پکارو، یہ اللہ کے نزدیک زیادہ انصاف ہے...\" (V.33:5)",
                "headingEnglish": "\"Call them (adopted sons) by (the names of) their fathers. That is more just with Allah...\" (V.33:5)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4562,
                "hadithNumber": "4783",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "We think that the Verse: 'Among the Believers are men who have been true to their covenant with Allah.' was revealed in favor of Anas bin An-Nadir.",
                "hadithUrdu": "ہمارے خیال میں یہ آیت انس بن نضر کے بارے میں نازل ہوئی تھی «من المؤمنين رجال صدقوا ما عاهدوا الله عليه‏» کہ ”اہل ایمان میں کچھ لوگ ایسے بھی ہیں کہ انہوں نے اللہ سے جو عہد کیا تھا اس میں وہ سچے اترے۔“",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا، کہا ہم سے محمد بن عبداللہ انصاری نے بیان کیا، کہا کہ مجھ سے میرے والد نے بیان کیا، ان سے ثمامہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، قَالَ حَدَّثَنِي أَبِي، عَنْ ثُمَامَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ نُرَى هَذِهِ الآيَةَ نَزَلَتْ فِي أَنَسِ بْنِ النَّضْرِ ‏{‏مِنَ الْمُؤْمِنِينَ رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ‏}‏‏.‏",
                "headingArabic": "‏{‏فَمِنْهُمْ مَنْ قَضَى نَحْبَهُ وَمِنْهُمْ مَنْ يَنْتَظِرُ وَمَا بَدَّلُوا تَبْدِيلاً‏}‏",
                "headingUrdu": "’’ان میں سے بعض نے اپنی ذمہ داریاں پوری کر دی ہیں (یعنی شہید ہو چکے ہیں) اور ان میں سے کچھ ابھی تک انتظار میں ہیں، لیکن وہ کبھی نہیں بدلے (یعنی وہ اپنے عہد کے ساتھ خیانت نہیں کرتے جو انہوں نے اللہ سے کیا تھا)۔ \" (V.33:23)",
                "headingEnglish": "\"Of them, some have fulfilled their obligations (i.e ., have been martyred) and some of them are still waiting, but they have never changed (i.e., they never proved treacherous to their covenant which they concluded with Allah) in the least.\" (V.33:23)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4563,
                "hadithNumber": "4784",
                "englishNarrator": "Narrated Zaid bin Thabit رضی اللہ عنہ :",
                "hadithEnglish": "When we collected the fragramentary manuscripts of the Qur'an into copies, I missed one of the Verses of Surat al-Ahzab which I used to hear Allah's Messenger (ﷺ) reading. Finally I did not find it with anybody except Khuza`ima Al-Ansari رضی اللہ عنہ , whose witness was considered by Allah's Messenger (ﷺ) equal to the witness of two men. (And that Verse was:) 'Among the believers are men who have been true to their covenant with Allah.'",
                "hadithUrdu": "جب ہم قرآن مجید کو مصحف کی صورت میں جمع کر رہے تھے تو مجھے سورۃ الاحزاب کی ایک آیت ( کہیں لکھی ہوئی ) نہیں مل رہی تھی۔ میں وہ آیت رسول اللہ صلی اللہ علیہ وسلم سے سن چکا تھا۔ آخر وہ مجھے خزیمہ انصاری رضی اللہ عنہ کے پاس ملی جن کی شہادت کو رسول اللہ صلی اللہ علیہ وسلم نے دو مومن مردوں کی شہادت کے برابر قرار دیا تھا۔ وہ آیت یہ تھی «من المؤمنين رجال صدقوا ما عاهدوا الله عليه‏» ”اہل ایمان میں کچھ لوگ ایسے بھی ہیں کہ انہوں نے اللہ سے جو عہد کیا تھا اس میں وہ سچے اترے۔“",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا، کہا مجھ کو خارجہ بن زید بن ثابت رضی اللہ عنہ نے خبر دی اور ان سے زید بن ثابت رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ، أَنَّ زَيْدَ بْنَ ثَابِتٍ، قَالَ لَمَّا نَسَخْنَا الصُّحُفَ فِي الْمَصَاحِفِ فَقَدْتُ آيَةً مِنْ سُورَةِ الأَحْزَابِ، كُنْتُ أَسْمَعُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقْرَؤُهَا، لَمْ أَجِدْهَا مَعَ أَحَدٍ إِلاَّ مَعَ خُزَيْمَةَ الأَنْصَارِيِّ، الَّذِي جَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَهَادَتَهُ شَهَادَةَ رَجُلَيْنِ ‏{‏مِنَ الْمُؤْمِنِينَ رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ‏}‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4564,
                "hadithNumber": "4785",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا (the wife of the Prophet) :",
                "hadithEnglish": "Allah's Messenger (ﷺ) came to me when Allah ordered him to give option to his wives. So Allah's Messenger (ﷺ) started with me, saying, \"I am going to mention to you something but you should not hasten (to give your reply) unless you consult your parents.' He knew that my parents would not order me to leave him. Then he said, \"Allah says:-- \"O Prophet! Say to your wives...\" (33.28-29) On that I said to him, \"Then why should I consult my parents? Verily, I seek Allah, His Apostle and the Home of the Hereafter.\"",
                "hadithUrdu": "جب اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو حکم دیا کہ نبی کریم ( صلی اللہ علیہ وسلم ) اپنی ازواج کو ( آپ کے سامنے رہنے یا آپ سے علیحدگی کا ) اختیار دیں تو آپ عائشہ رضی اللہ عنہا کے پاس بھی تشریف لے گئے اور فرمایا کہ میں تم سے ایک معاملہ کے متعلق کہنے آیا ہوں ضروری نہیں کہ تم اس میں جلد بازی سے کام لو، اپنے والدین سے بھی مشورہ کر سکتی ہو۔ نبی کریم صلی اللہ علیہ وسلم تو جانتے ہی تھے کہ میرے والد کبھی آپ سے جدائی کا مشورہ نہیں دے سکتے۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ کا فرمان ہے «يا أيها النبي قل لأزواجك‏» کہ ”اے نبی! اپنی بیویوں سے فرما دیجئیے“ آخر آیت تک۔ میں نے عرض کیا، لیکن کس چیز کے لیے مجھے اپنے والدین سے مشورہ کی ضرورت ہے، کھلی ہوئی بات ہے کہ میں اللہ، اس کے رسول اور عالم آخرت کو چاہتی ہوں۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا، کہا کہ مجھے ابوسلمہ بن عبدالرحمٰن نے خبر دی اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، رضى الله عنها زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَاءَهَا حِينَ أَمَرَ اللَّهُ أَنْ يُخَيِّرَ أَزْوَاجَهُ، فَبَدَأَ بِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ إِنِّي ذَاكِرٌ لَكِ أَمْرًا فَلاَ عَلَيْكِ أَنْ تَسْتَعْجِلِي حَتَّى تَسْتَأْمِرِي أَبَوَيْكِ ‏\"‏، وَقَدْ عَلِمَ أَنَّ أَبَوَىَّ لَمْ يَكُونَا يَأْمُرَانِي بِفِرَاقِهِ، قَالَتْ ثُمَّ قَالَ ‏\"‏ إِنَّ اللَّهَ قَالَ ‏{‏يَا أَيُّهَا النَّبِيُّ قُلْ لأَزْوَاجِكَ‏}‏ ‏\"‏‏.‏ إِلَى تَمَامِ الآيَتَيْنِ فَقُلْتُ لَهُ فَفِي أَىِّ هَذَا أَسْتَأْمِرُ أَبَوَىَّ فَإِنِّي أُرِيدُ اللَّهَ وَرَسُولَهُ وَالدَّارَ الآخِرَةَ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏يَا أَيُّهَا النَّبِيُّ قُلْ لأَزْوَاجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلاً‏}‏",
                "headingUrdu": "ارشادِ باری تعالیٰ ہے: ’’اے نبیؐ! اپنی بیویوں سے کہہ دو کہ اگر تم دنیا کی زندگی اور اس کی رونقیں چاہتی ہو تو آؤ، میں تمہارے لیے رزق پیدا کروں گا اور تمہیں مقرر کروں گا۔ خوبصورت طریقے سے آزاد (طلاق)''۔ (V.33:28)",
                "headingEnglish": "The Statement of Allah (the Exalted): \"O Prophet! (Muḥammad pbuh)! Say to your wives: 'If you desire the life of this world and its glitter, - then come! I will make a provision for you and set you free in a handsome manner (divorce)'.\" (V.33:28)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4565,
                "hadithNumber": "4786",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا (the wife of the Prophet) :",
                "hadithEnglish": "when Allah's Messenger (ﷺ) was ordered to give option to his wives, he started with me, saying, \"I am going to mention to you something, but you shall not hasten (to give your reply) unless you consult your parents.\" The Prophet (ﷺ) knew that my parents would not order me to leave him. Then he said, \"Allah says: 'O Prophet (Muhammad)! Say to your wives: If you desire the life of this world and its glitter........a great reward.\" (33.28-29) I said, \"Then why I consult my parents? Verily, I seek Allah, His Apostle and the Home of the Hereafter.\" Then all the other wives of the Prophet (ﷺ) did the same as I did. Similarly, Musa bin Ayun, Mamar, Zuhri reported from Abu Salamah bin Abdur Rehman. Moreover, Abdur Razzaq, Abu Sufyan Mamari, Mamar, Zuhri, Urwah bin Zubair reported from Hadrat Aishah رضی اللہ عنہا .",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم کو حکم ہوا کہ اپنی ازواج کو اختیار دیں تو آپ صلی اللہ علیہ وسلم میرے پاس تشریف لائے اور فرمایا کہ میں تم سے ایک معاملہ کے متعلق کہنے آیا ہوں، ضروری نہیں کہ تم جلدی کرو، اپنے والدین سے بھی مشورہ لے سکتی ہو۔ انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کو تو معلوم ہی تھا کہ میرے والدین آپ سے جدائی کا کبھی مشورہ نہیں دے سکتے۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے ( وہ آیت جس میں یہ حکم تھا ) پڑھی کہ اللہ پاک کا ارشاد ہے «يا أيها النبي قل لأزواجك إن كنتن تردن الحياة الدنيا وزينتها‏» ”اے نبی! اپنی بیویوں سے فرما دیجئیے کہ اگر تم دنیوی زندگی اور اس کی زینت کو چاہتی ہو سے «أجرا عظيما‏» تک۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے عرض کیا لیکن اپنے والدین سے مشورہ کی کس بات کے لیے ضرورت ہے، ظاہر ہے کہ میں اللہ اور اس کے رسول اور عالم آخرت کو چاہتی ہوں۔ بیان کیا کہ پھر دوسری ازواج مطہرات نے بھی وہی کہا جو میں کہہ چکی تھی۔ اس کی متابعت موسیٰ بن اعین نے معمر سے کی ہے کہ ان سے زہری نے بیان کیا کہ انہیں ابوسلمہ نے خبر دی اور عبدالرزاق اور ابوسفیان معمری نے معمر سے بیان کیا، ان سے زہری نے، اور ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے۔",
                "urduNarrator": "اور لیث نے بیان کیا کہ مجھ سے یونس نے بیان کیا، ان سے ابن شہاب نے بیان کیا، کہا مجھے ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ لَمَّا أُمِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِتَخْيِيرِ أَزْوَاجِهِ بَدَأَ بِي فَقَالَ ‏\"‏ إِنِّي ذَاكِرٌ لَكِ أَمْرًا فَلاَ عَلَيْكِ أَنْ لاَ تَعْجَلِي حَتَّى تَسْتَأْمِرِي أَبَوَيْكِ ‏\"‏‏.‏ قَالَتْ وَقَدْ عَلِمَ أَنَّ أَبَوَىَّ لَمْ يَكُونَا يَأْمُرَانِي بِفِرَاقِهِ، قَالَتْ ثُمَّ قَالَ ‏\"‏ إِنَّ اللَّهَ جَلَّ ثَنَاؤُهُ قَالَ ‏{‏يَا أَيُّهَا النَّبِيُّ قُلْ لأَزْوَاجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا‏}‏ إِلَى ‏{‏أَجْرًا عَظِيمًا‏}‏ ‏\"‏‏.‏ قَالَتْ فَقُلْتُ فَفِي أَىِّ هَذَا أَسْتَأْمِرُ أَبَوَىَّ فَإِنِّي أُرِيدُ اللَّهَ وَرَسُولَهُ وَالدَّارَ الآخِرَةَ، قَالَتْ ثُمَّ فَعَلَ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم مِثْلَ مَا فَعَلْتُ‏.‏ تَابَعَهُ مُوسَى بْنُ أَعْيَنَ عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ‏.‏ وَقَالَ عَبْدُ الرَّزَّاقِ وَأَبُو سُفْيَانَ الْمَعْمَرِيُّ عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَإِنْ كُنْتُنَّ تُرِدْنَ اللَّهَ وَرَسُولَهُ وَالدَّارَ الآخِرَةَ فَإِنَّ اللَّهَ أَعَدَّ لِلْمُحْسِنَاتِ مِنْكُنَّ أَجْرًا عَظِيمًا‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’لیکن اگر تم اللہ اور اس کے رسول اور آخرت کا گھر چاہتے ہو تو یقیناً اللہ تعالیٰ نے تم میں سے محسنوں کے لیے بہت بڑا اجر تیار کر رکھا ہے۔‘‘ (V.33:29)",
                "headingEnglish": "The Statement of Allah the Exalted: \"But if you desire Allah and His Messenger, and the home of the Hereafter, then verily, Allah has prepared for Al-Muhsināt (good-doers) amongst you an enormous reward.\" (V.33:29)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4566,
                "hadithNumber": "4787",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Verse: 'But you did hide in your mind that which Allah was about to make manifest.' (33.37) was revealed concerning Zainab bint Jahsh رضی اللہ عنہا and Zaid bin Haritha رضی اللہ عنہما .",
                "hadithUrdu": "آیت «وتخفي في نفسك ما الله مبديه‏» ”اور آپ اپنے دل میں وہ چھپاتے رہے جسے اللہ ظاہر کرنے والا تھا۔“ زینب بنت جحش رضی اللہ عنہا اور زید بن حارثہ رضی اللہ عنہما کے معاملہ میں نازل ہوئی تھی۔",
                "urduNarrator": "ہم سے محمد بن عبدالرحیم نے بیان کیا، کہا ہم سے معلی بن منصور نے بیان کیا، اسے حماد بن زید نے کہا ہم سے ثابت نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ، عَنْ حَمَّادِ بْنِ زَيْدٍ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ هَذِهِ، الآيَةَ ‏{‏وَتُخْفِي فِي نَفْسِكَ مَا اللَّهُ مُبْدِيهِ‏}‏ نَزَلَتْ فِي شَأْنِ زَيْنَبَ ابْنَةِ جَحْشٍ وَزَيْدِ بْنِ حَارِثَةَ‏.‏",
                "headingArabic": "‏{‏وَتُخْفِي فِي نَفْسِكَ مَا اللَّهُ مُبْدِيهِ وَتَخْشَى النَّاسَ وَاللَّهُ أَحَقُّ أَنْ تَخْشَاهُ‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’اور (یاد کرو) جب تم نے ان (زید بن حارثہ رضی اللہ عنہ) سے کہا تھا کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے آزاد کردہ غلام ہیں جن پر اللہ تعالیٰ نے فضل فرمایا ہے۔ اور آپ نے (اے محمد صلی اللہ علیہ وسلم بھی) احسان کیا ہے کہ: 'اپنی بیوی کو اپنے پاس رکھو اور اللہ سے ڈرو۔' لیکن تم نے اپنے اندر چھپایا (یعنی جو اللہ تمہیں پہلے ہی بتا چکا ہے کہ وہ تمہیں اس کی شادی کر دے گا) جسے اللہ ظاہر کر دے گا، تم لوگوں سے ڈرتے رہے (یعنی محمد صلی اللہ علیہ وسلم نے اپنی طلاق یافتہ بیوی سے شادی کر لی۔ جبکہ اللہ کا زیادہ حق تھا کہ تم اس سے ڈرو...\" (آیت 33:37)",
                "headingEnglish": "The Statement of Allah the Exalted: \"And (remember) when you said to him (Zaid bin Haritha [may Allah be pleased with him] - the freed slave of the Prophet pbuh) on whom Allah has bestowed grace (by guiding him to Islam) and you (O Muḥammad pbuh too) have done favour (by manumitting him): 'Keep your wife to yourself and fear Allah.' But you did hide in yourself (i.e., what Allah has already made known to you that He will give her to you in marriage) that which Allah will make manifest, you did fear people (i.e., Muḥammad pbuh married the divorced wife of his manumitted slave) whereas Allah had a better right that you should fear Him...\" (V.33:37)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4567,
                "hadithNumber": "4788",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I used to look down upon those ladies who had given themselves to Allah's Messenger (ﷺ) and I used to say, \"Can a lady give herself (to a man)?\" But when Allah revealed: \"You (O Muhammad) can postpone (the turn of) whom you will of them (your wives), and you may receive any of them whom you will; and there is no blame on you if you invite one whose turn you have set aside (temporarily).' (33.51) I said (to the Prophet), \"I feel that your Lord hastens in fulfilling your wishes and desires.\"",
                "hadithUrdu": "جو عورتیں اپنے نفس کو رسول اللہ صلی اللہ علیہ وسلم کے لیے ہبہ کرنے آتی تھیں مجھے ان پر بڑی غیرت آتی تھی۔ میں کہتی کہ کیا عورت خود ہی اپنے کو کسی مرد کے لیے پیش کر سکتی ہے؟ پھر جب اللہ تعالیٰ نے یہ آیت نازل کی «ترجئ من تشاء منهن وتؤوي إليك من تشاء ومن ابتغيت ممن عزلت فلا جناح عليك‏» کہ ”ان میں سے جس کو چاہیں اپنے سے دور رکھیں اور جس کو چاہیں اپنے نزدیک رکھیں اور جن کو آپ نے الگ کر رکھا تھا اس میں سے کسی کو پھر طلب کر لیں جب بھی، آپ پر کوئی گناہ نہیں ہے۔“ تو میں نے کہا کہ میں تو سمجھتی ہوں کہ آپ کا رب آپ کی مراد بلا تاخیر پوری کر دینا چاہتا ہے۔",
                "urduNarrator": "ہم سے زکریا بن یحییٰ نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، کہا ہم سے ہشام نے اپنے والد سے سن کر بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا زَكَرِيَّاءُ بْنُ يَحْيَى، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ هِشَامٌ حَدَّثَنَا عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كُنْتُ أَغَارُ عَلَى اللاَّتِي وَهَبْنَ أَنْفُسَهُنَّ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَأَقُولُ أَتَهَبُ الْمَرْأَةُ نَفْسَهَا فَلَمَّا أَنْزَلَ اللَّهُ تَعَالَى ‏{‏تُرْجِئُ مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ وَمَنِ ابْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلاَ جُنَاحَ عَلَيْكَ‏}‏ قُلْتُ مَا أُرَى رَبَّكَ إِلاَّ يُسَارِعُ فِي هَوَاكَ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏تُرْجِئُ مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ وَمَنِ ابْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلاَ جُنَاحَ عَلَيْكَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"آپ (اے محمد صلی اللہ علیہ وسلم) ان (اپنی بیویوں) میں سے جس کی چاہیں ملتوی کر سکتے ہیں، اور جس کو چاہیں قبول کر سکتے ہیں۔ ایک طرف (اس کی باری عارضی طور پر)، آپ پر کوئی گناہ نہیں ہے (اسے دوبارہ حاصل کرنا)...\" (V.33:51)",
                "headingEnglish": "The Statement of Allah the Most High: \"You (O Muḥammad pbuh) can postpone (the turn of) whom you will of them (your wives), and you may receive whom you will. And whomsoever you desire of those whom you have set aside (her turn temporarily), it is no sin on you (to receive her again)...\" (V.33:51)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4568,
                "hadithNumber": "4789",
                "englishNarrator": "Narrated `Aishah رضی اللہ عنہا :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) used to take the permission of that wife with whom he was supposed to stay overnight if he wanted to go to one other than her, after this Verse was revealed:-- \"You (O Muhammad) can postpone (the turn of) whom you will of them (your wives) and you may receive any (of them) whom you will; and there is no blame on you if you invite one whose turn you have set aside (temporarily). (33.51) I asked Aisha رضی اللہ عنہا , \"What did you use to say (in this case)?\" She said, \"I used to say to him, \"If I could deny you the permission (to go to your other wives) I would not allow your favor to be bestowed on any other person.\" Abbad bin Abbad heard the same from Hadrat Asim.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اس آیت کے نازل ہونے کے بعد بھی «ترجئ من تشاء منهن وتؤوي إليك من تشاء ومن ابتغيت ممن عزلت فلا جناح عليك‏» کہ ”ان میں سے آپ جس کو چاہیں اپنے سے دور رکھیں اور جن کو آپ نے الگ کر رکھا تھا ان میں سے کسی کو طلب کر لیں جب بھی آپ پر کوئی گناہ نہیں۔“ اگر ( ازواج مطہرات ) میں سے کسی کی باری میں کسی دوسری بیوی کے پاس جانا چاہتے تو جن کی باری ہوتی ان سے اجازت لیتے تھے ( معاذہ نے بیان کیا کہ ) میں نے اس پر عائشہ رضی اللہ عنہا سے پوچھا کہ ایسی صورت میں آپ نبی کریم صلی اللہ علیہ وسلم سے کیا کہتی تھیں؟ انہوں نے فرمایا کہ میں تو یہ عرض کر دیتی تھی کہ یا رسول اللہ! اگر یہ اجازت آپ مجھ سے لے رہے ہیں تو میں تو اپنی باری کا کسی دوسرے پر ایثار نہیں کر سکتی۔ اس روایت کی متابعت عباد بن عباد نے کی، انہوں نے عاصم سے سنا۔",
                "urduNarrator": "ہم سے حبان بن موسیٰ نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی، کہا ہم کو عاصم احول نے خبر دی، انہیں معاذہ نے اور انہیں عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا حِبَّانُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عَاصِمٌ الأَحْوَلُ، عَنْ مُعَاذَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَسْتَأْذِنُ فِي يَوْمِ الْمَرْأَةِ مِنَّا بَعْدَ أَنْ أُنْزِلَتْ هَذِهِ الآيَةُ ‏{‏تُرْجِئُ مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ وَمَنِ ابْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلاَ جُنَاحَ عَلَيْكَ‏}‏‏.‏ فَقُلْتُ لَهَا مَا كُنْتِ تَقُولِينَ قَالَتْ كُنْتُ أَقُولُ لَهُ إِنْ كَانَ ذَاكَ إِلَىَّ فَإِنِّي لاَ أُرِيدُ يَا رَسُولَ اللَّهِ أَنْ أُوثِرَ عَلَيْكَ أَحَدًا‏.‏ تَابَعَهُ عَبَّادُ بْنُ عَبَّادٍ سَمِعَ عَاصِمًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4569,
                "hadithNumber": "4790",
                "englishNarrator": "Narrated `Umar رضی اللہ عنہ :",
                "hadithEnglish": "I said, \"O Allah's Messenger (ﷺ)! Good and bad persons enter upon you, so I suggest that you order the mothers of the Believers (i.e. your wives) to observe veils.\" Then Allah revealed the Verses of Al- Hijab.",
                "hadithUrdu": "میں نے عرض کیا: یا رسول اللہ! آپ کے پاس اچھے برے ہر طرح کے لوگ آتے ہیں، کاش آپ ازواج مطہرات کو پردہ کا حکم دے دیں۔ اس کے بعد اللہ نے پردہ کا حکم اتارا۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا، ان سے یحییٰ بن سعید قطان نے، ان سے حمید طویل نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ عمر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ قَالَ عُمَرُ ـ رضى الله عنه ـ قُلْتُ يَا رَسُولَ اللَّهِ، يَدْخُلُ عَلَيْكَ الْبَرُّ وَالْفَاجِرُ، فَلَوْ أَمَرْتَ أُمَّهَاتِ الْمُؤْمِنِينَ بِالْحِجَابِ، فَأَنْزَلَ اللَّهُ آيَةَ الْحِجَابِ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏لاَ تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلاَّ أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ وَلَكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا فَإِذَا طَعِمْتُمْ فَانْتَشِرُوا وَلاَ مُسْتَأْنِسِينَ لِحَدِيثٍ إِنَّ ذَلِكُمْ كَانَ يُؤْذِي النَّبِيَّ فَيَسْتَحْيِي مِنْكُمْ وَاللَّهُ لاَ يَسْتَحْيِي مِنَ الْحَقِّ وَإِذَا سَأَلْتُمُوهُنَّ مَتَاعًا فَاسْأَلُوهُنَّ مِنْ وَرَاءِ حِجَابٍ ذَلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ وَمَا كَانَ لَكُمْ أَنْ تُؤْذُوا رَسُولَ اللَّهِ وَلاَ أَنْ تَنْكِحُوا أَزْوَاجَهُ مِنْ بَعْدِهِ أَبَدًا إِنَّ ذَلِكُمْ كَانَ عِنْدَ اللَّهِ عَظِيمًا‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: \"...اے ایمان والو! نبی کے گھروں میں داخل نہ ہو، مگر اس وقت جب تم کو کھانے کی اجازت دی جائے... عظمت\" (V.33:53)",
                "headingEnglish": "The Statement of Allah the Exalted: \"...O you who believe! Enter not the Prophet's houses, except when leave is given to you for a meal... (up to) ... Verily! With Allah that shall be an enormity.\" (V.33:53)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4570,
                "hadithNumber": "4791",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) married Zainab bint Jahsh رضی اللہ عنہ , he invited the people to a meal. They took the meal and remained sitting and talking. Then the Prophet (showed them) as if he is ready to get up, yet they did not get up. When he noticed that (there was no response to his movement), he got up, and the others too, got up except three persons who kept on sitting. The Prophet (ﷺ) came back in order to enter his house, but he went away again. Then they left, whereupon I set out and went to the Prophet (ﷺ) to tell him that they had departed, so he came and entered his house. I wanted to enter along with him, but he put a screen between me and him. Then Allah revealed: 'O you who believe! Do not enter the houses of the Prophet...' (33.53)",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم نے زینب بنت جحش رضی اللہ عنہا سے نکاح کیا تو قوم کو آپ نے دعوت ولیمہ دی، کھانا کھانے کے بعد لوگ ( گھر کے اندر ہی ) بیٹھے ( دیر تک ) باتیں کرتے رہے۔ نبی کریم صلی اللہ علیہ وسلم نے ایسا کیا گویا آپ اٹھنا چاہتے ہیں ( تاکہ لوگ سمجھ جائیں اور اٹھ جائیں ) لیکن کوئی بھی نہیں اٹھا، جب آپ نے دیکھا کہ کوئی نہیں اٹھتا تو آپ صلی اللہ علیہ وسلم کھڑے ہو گئے۔ جب آپ صلی اللہ علیہ وسلم کھڑے ہوئے تو دوسرے لوگ بھی کھڑے ہو گئے، لیکن تین آدمی اب بھی بیٹھے رہ گئے۔ نبی کریم صلی اللہ علیہ وسلم جب باہر سے اندر جانے کے لیے آئے تو دیکھا کہ کچھ اب بھی بیٹھے ہوئے ہیں۔ اس کے بعد وہ لوگ بھی اٹھ گئے تو میں نے آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر خبر دی کہ وہ لوگ بھی چلے گئے ہیں تو آپ اندر تشریف لائے۔ میں نے بھی چاہا کہ اندر جاؤں، لیکن نبی کریم صلی اللہ علیہ وسلم نے اپنے اور میرے بیچ میں دروازہ کا پردہ گرا لیا، اس کے بعد آیت ( مذکورہ بالا ) نازل ہوئی «يا أيها الذين آمنوا لا تدخلوا بيوت النبي‏» کہ ”اے ایمان والو! نبی کے گھروں میں مت جایا کرو۔“ آخر آیت تک۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ رقاشی نے بیان کیا، کہا ہم سے معتمر بن سلیمان نے بیان کیا، کہا کہ میں نے اپنے والد سے سنا، انہوں نے بیان کیا ہم سے ابومجلز نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ أَبِي يَقُولُ، حَدَّثَنَا أَبُو مِجْلَزٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ لَمَّا تَزَوَّجَ رَسُولُ اللَّهِ صلى الله عليه وسلم زَيْنَبَ ابْنَةَ جَحْشٍ دَعَا الْقَوْمَ، فَطَعِمُوا ثُمَّ جَلَسُوا يَتَحَدَّثُونَ وَإِذَا هُوَ كَأَنَّهُ يَتَهَيَّأُ لِلْقِيَامِ فَلَمْ يَقُومُوا، فَلَمَّا رَأَى ذَلِكَ قَامَ، فَلَمَّا قَامَ قَامَ مَنْ قَامَ، وَقَعَدَ ثَلاَثَةُ نَفَرٍ فَجَاءَ النَّبِيُّ صلى الله عليه وسلم لِيَدْخُلَ فَإِذَا الْقَوْمُ جُلُوسٌ ثُمَّ إِنَّهُمْ قَامُوا، فَانْطَلَقْتُ فَجِئْتُ فَأَخْبَرْتُ النَّبِيَّ صلى الله عليه وسلم أَنَّهُمْ قَدِ انْطَلَقُوا، فَجَاءَ حَتَّى دَخَلَ، فَذَهَبْتُ أَدْخُلُ فَأَلْقَى الْحِجَابَ بَيْنِي وَبَيْنَهُ فَأَنْزَلَ اللَّهُ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَدْخُلُوا بُيُوتَ النَّبِيِّ‏}‏ الآيَةَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4571,
                "hadithNumber": "4792",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "I of all the people know best this verse of Al-Hijab. When Allah's Messenger (ﷺ) married Zainab bint Jahsh رضی اللہ عنہ she was with him in the house and he prepared a meal and invited the people (to it). They sat down (after finishing their meal) and started chatting. So the Prophet (ﷺ) went out and then returned several times while they were still sitting and talking. So Allah revealed the Verse: 'O you who believe! Enter not the Prophet's houses until leave is given to you for a meal, (and then) not (so early as) to wait for its preparation .....ask them from behind a screen.' (33.53) So the screen was set up and the people went away.",
                "hadithUrdu": "اس آیت یعنی آیت پردہ ( کے شان نزول ) کے متعلق میں سب سے زیادہ جانتا ہوں، جب زینب رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم نے نکاح کیا اور وہ آپ کے ساتھ آپ کے گھر ہی میں تھیں تو آپ صلی اللہ علیہ وسلم نے کھانا تیار کروایا اور قوم کو بلایا ( کھانے سے فارغ ہونے کے بعد ) لوگ بیٹھے باتیں کرتے رہے۔ نبی کریم صلی اللہ علیہ وسلم باہر جاتے اور پھر اندر آتے ( تاکہ لوگ اٹھ جائیں ) لیکن لوگ بیٹھے باتیں کرتے رہے۔ اس پر یہ آیت نازل ہوئی «يا أيها الذين آمنوا لا تدخلوا بيوت النبي إلا أن يؤذن لكم إلى طعام غير ناظرين إناه‏» کہ ”اے ایمان والو! نبی کے گھروں میں مت جایا کرو۔ سوائے اس وقت کے جب تمہیں ( کھانے کے لیے ) آنے کی اجازت دی جائے۔ ایسے طور پر کہ اس کی تیاری کے منتظر نہ رہو۔“ اللہ تعالیٰ کے ارشاد «من وراء حجاب‏» تک اس کے بعد پردہ ڈال دیا گیا اور لوگ کھڑے ہو گئے۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ایوب سختیانی نے، ان سے ابوقلابہ نے کہ انس بن مالک رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، قَالَ أَنَسُ بْنُ مَالِكٍ أَنَا أَعْلَمُ النَّاسِ، بِهَذِهِ الآيَةِ آيَةِ الْحِجَابِ، لَمَّا أُهْدِيَتْ زَيْنَبُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم كَانَتْ مَعَهُ فِي الْبَيْتِ، صَنَعَ طَعَامًا، وَدَعَا الْقَوْمَ، فَقَعَدُوا يَتَحَدَّثُونَ، فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَخْرُجُ، ثُمَّ يَرْجِعُ، وَهُمْ قُعُودٌ يَتَحَدَّثُونَ، فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلاَّ أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ‏}‏ إِلَى قَوْلِهِ ‏{‏مِنْ وَرَاءِ حِجَابٍ‏}‏ فَضُرِبَ الْحِجَابُ، وَقَامَ الْقَوْمُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4572,
                "hadithNumber": "4793",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "A banquet of bread and meat was held on the occasion of the marriage of the Prophet (ﷺ) to Zainab bint Jahsh رضی اللہ عنہا . I was sent to invite the people (to the banquet), and so the people started coming (in groups); They would eat and then leave. Another batch would come, eat and leave. So I kept on inviting the people till I found nobody to invite. Then I said, \"O Allah's Prophet! I do not find anybody to invite.\" He said, \"Carry away the remaining food.\" Then a batch of three persons stayed in the house chatting. The Prophet (ﷺ) left and went towards the dwelling place of Aisha رضی اللہ عنہا and said, \"Peace and Allah's Mercy be on you, O the people of the house!\" She replied, \"Peace and the mercy of Allah be on you too. How did you find your wife? May Allah bless you. Then he went to the dwelling places of all his other wives and said to them the same as he said to Aisha رضی اللہ عنہا and they said to him the same as Aisha رضی اللہ عنہا  had said to him. Then the Prophet (ﷺ) returned and found a group of three persons still in the house chatting. The Prophet was a very shy person, so he went out (for the second time) and went towards the dwelling place of `Aisha رضی اللہ عنہا . I do not remember whether I informed him that the people have gone away. So he returned and as soon as he entered the gate, he drew the curtain between me and him, and then the Verse of Al-Hijab was revealed.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے زینب بنت جحش رضی اللہ عنہا سے نکاح کے بعد ( بطور ولیمہ ) گوشت اور روٹی تیار کروائی اور مجھے کھانے پر لوگوں کو بلانے کے لیے بھیجا، پھر کچھ لوگ آئے اور کھا کر واپس چلے گئے۔ پھر دوسرے لوگ آئے اور کھا کر واپس چلے، میں بلاتا رہا۔ آخر جب کوئی باقی نہیں رہا تو میں نے عرض کیا: اے اللہ کے نبی! اب تو کوئی باقی نہیں رہا جس کو میں دعوت دوں تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اب دستر خوان اٹھا لو لیکن تین اشخاص گھر میں باتیں کرتے رہے۔ نبی کریم صلی اللہ علیہ وسلم باہر نکل آئے اور عائشہ رضی اللہ عنہا کے حجرہ کے سامنے جا کر فرمایا السلام علیکم اہل البیت ورحمۃ اللہ۔ انہوں نے کہا وعلیک السلام ورحمۃ اللہ، اپنی اہل کو آپ نے کیسا پایا؟ اللہ برکت عطا فرمائے۔ نبی کریم صلی اللہ علیہ وسلم اسی طرح تمام ازواج مطہرات کے حجروں کے سامنے گئے اور جس طرح عائشہ رضی اللہ عنہا سے فرمایا تھا اس طرح سب سے فرمایا اور انہوں نے بھی عائشہ رضی اللہ عنہا کی طرح جواب دیا۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم واپس تشریف لائے تو وہ تین آدمی اب بھی گھر میں بیٹھے باتیں کر رہے تھے۔ نبی کریم صلی اللہ علیہ وسلم بہت زیادہ حیاء دار تھے، آپ ( یہ دیکھ کر کہ لوگ اب بھی بیٹھے ہوئے ہیں ) عائشہ رضی اللہ عنہا کے حجرہ کی طرف پھر چلے گئے، مجھے یاد نہیں کہ اس کے بعد میں نے یا کسی اور نے آپ کو جا کر خبر کی کہ اب وہ تینوں آدمی روانہ ہو چکے ہیں۔ پھر نبی کریم صلی اللہ علیہ وسلم اب واپس تشریف لائے اور پاؤں چوکھٹ پر رکھا۔ ابھی آپ کا ایک پاؤں اندر تھا اور ایک پاؤں باہر کہ آپ نے پردہ گرا لیا اور پردہ کی آیت نازل ہوئی۔",
                "urduNarrator": "ہم سے ابومعمر نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا، کہا ہم سے عبدالعزیز بن صہیب نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ بُنِيَ عَلَى النَّبِيِّ صلى الله عليه وسلم بِزَيْنَبَ ابْنَةِ جَحْشٍ بِخُبْزٍ وَلَحْمٍ فَأُرْسِلْتُ عَلَى الطَّعَامِ دَاعِيًا فَيَجِيءُ قَوْمٌ فَيَأْكُلُونَ وَيَخْرُجُونَ، ثُمَّ يَجِيءُ قَوْمٌ فَيَأْكُلُونَ وَيَخْرُجُونَ، فَدَعَوْتُ حَتَّى مَا أَجِدُ أَحَدًا أَدْعُو فَقُلْتُ يَا نَبِيَّ اللَّهِ مَا أَجِدُ أَحَدًا أَدْعُوهُ قَالَ ارْفَعُوا طَعَامَكُمْ، وَبَقِيَ ثَلاَثَةُ رَهْطٍ يَتَحَدَّثُونَ فِي الْبَيْتِ، فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم فَانْطَلَقَ إِلَى حُجْرَةِ عَائِشَةَ فَقَالَ ‏ \"‏ السَّلاَمُ عَلَيْكُمْ أَهْلَ الْبَيْتِ وَرَحْمَةُ اللَّهِ ‏\"‏‏.‏ فَقَالَتْ وَعَلَيْكَ السَّلاَمُ وَرَحْمَةُ اللَّهِ، كَيْفَ وَجَدْتَ أَهْلَكَ بَارَكَ اللَّهُ لَكَ فَتَقَرَّى حُجَرَ نِسَائِهِ كُلِّهِنَّ، يَقُولُ لَهُنَّ كَمَا يَقُولُ لِعَائِشَةَ، وَيَقُلْنَ لَهُ كَمَا قَالَتْ عَائِشَةُ، ثُمَّ رَجَعَ النَّبِيُّ صلى الله عليه وسلم فَإِذَا ثَلاَثَةُ رَهْطٍ فِي الْبَيْتِ يَتَحَدَّثُونَ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم شَدِيدَ الْحَيَاءِ، فَخَرَجَ مُنْطَلِقًا نَحْوَ حُجْرَةِ عَائِشَةَ فَمَا أَدْرِي آخْبَرْتُهُ أَوْ أُخْبِرَ أَنَّ الْقَوْمَ خَرَجُوا، فَرَجَعَ حَتَّى إِذَا وَضَعَ رِجْلَهُ فِي أُسْكُفَّةِ الْبَابِ دَاخِلَةً وَأُخْرَى خَارِجَةً أَرْخَى السِّتْرَ بَيْنِي وَبَيْنَهُ، وَأُنْزِلَتْ آيَةُ الْحِجَابِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4573,
                "hadithNumber": "4794",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) married Zainab bint Jahsh رضی اللہ عنہا , he made the people eat meat and bread to their fill (by giving a Walima banquet). Then he went out to the dwelling places of the mothers of the believers (his wives), as he used to do in the morning of his marriage. He would greet them and invoke good on them, and they (too) would return his greeting and invoke good on him. When he returned to his house, he found two men talking to each other; and when he saw them, he went out of his house again. When those two men saw Allah's Messenger (ﷺ): going out of his house, they quickly got up (and departed). I do not remember whether I informed him of their departure, or he was informed (by somebody else). So he returned, and when he entered the house, he lowered the curtain between me and him. Then the Verse of Al-Hijab was revealed. Ibn-e-Abi Maryam, Yahya, Homaid heard from Hadrat Anas رضی اللہ عنہ and he from the prophet ﷺ.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے زینب بنت جحش رضی اللہ عنہا سے نکاح پر دعوت ولیمہ کی اور گوشت اور روٹی لوگوں کو کھلائی۔ پھر امہات المؤمنین کے حجروں کی طرف گئے، جیسا کہ آپ کا معمول تھا کہ نکاح کی صبح کو آپ جایا کرتے تھے، آپ انہیں سلام کرتے اور ان کے حق میں دعا کرتے اور امہات المؤمنین بھی آپ کو سلام کرتیں اور آپ کے لیے دعا کرتیں۔ امہات المؤمنین کے حجروں سے جب آپ اپنے حجرہ میں واپس تشریف لائے تو آپ نے دیکھا کہ دو آدمی آپس میں گفتگو کر رہے ہیں۔ جب آپ نے انہیں بیٹھے ہوئے دیکھا تو پھر آپ حجرہ سے نکل گئے۔ ان دونوں نے جب دیکھا کہ اللہ کے نبی اپنے حجرہ سے واپس چلے گئے ہیں تو بڑی جلدی جلدی وہ اٹھ کر باہر نکل گئے۔ مجھے یاد نہیں کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو ان کے چلے جانے کی اطلاع دی یا کسی اور نے پھر نبی کریم صلی اللہ علیہ وسلم واپس آئے اور گھر میں آتے ہی دروازہ کا پردہ گرا لیا اور آیت حجاب نازل ہوئی۔ اور سعید ابن ابی مریم نے بیان کیا کہ ہم کو یحی ٰبن کثیر نے خبر دی، کہا مجھ سے حمید طویل نے بیان کیا اور انہوں نے انس رضی اللہ عنہ سے سنا، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے نقل کیا۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم کو عبداللہ بن بکر سہمی نے خبر دی، کہا ہم سے حمید طویل نے بیان کیا کہ انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ السَّهْمِيُّ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أَوْلَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ بَنَى بِزَيْنَبَ ابْنَةِ جَحْشٍ فَأَشْبَعَ النَّاسَ خُبْزًا وَلَحْمًا ثُمَّ خَرَجَ إِلَى حُجَرِ أُمَّهَاتِ الْمُؤْمِنِينَ كَمَا كَانَ يَصْنَعُ صَبِيحَةَ بِنَائِهِ فَيُسَلِّمُ عَلَيْهِنَّ وَيَدْعُو لَهُنَّ وَيُسَلِّمْنَ عَلَيْهِ وَيَدْعُونَ لَهُ فَلَمَّا رَجَعَ إِلَى بَيْتِهِ رَأَى رَجُلَيْنِ جَرَى بِهِمَا الْحَدِيثُ، فَلَمَّا رَآهُمَا رَجَعَ عَنْ بَيْتِهِ، فَلَمَّا رَأَى الرَّجُلاَنِ نَبِيَّ اللَّهِ صلى الله عليه وسلم رَجَعَ عَنْ بَيْتِهِ وَثَبَا مُسْرِعَيْنِ، فَمَا أَدْرِي أَنَا أَخْبَرْتُهُ بِخُرُوجِهِمَا أَمْ أُخْبِرَ فَرَجَعَ حَتَّى دَخَلَ الْبَيْتَ، وَأَرْخَى السِّتْرَ بَيْنِي وَبَيْنَهُ وَأُنْزِلَتْ آيَةُ الْحِجَابِ‏.‏ وَقَالَ ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا يَحْيَى حَدَّثَنِي حُمَيْدٌ سَمِعَ أَنَسًا عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4574,
                "hadithNumber": "4795",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Sauda رضی اللہ عنہا (the wife of the Prophet) went out to answer the call of nature after it was made obligatory (for all the Muslims ladies) to observe the veil. She had a large frame and everybody who knew her before could recognize her. So `Umar bin Al-Khattab رضی اللہ عنہ saw her and said, \"O Sauda! By Allah, you cannot hide yourself from us, so think of a way by which you should not be recognized on going out. Sauda رضی اللہ عنہا returned while Allah's Messenger (ﷺ) was in my house taking his supper and a bone covered with meat was in his hand. She entered and said, \"O Allah's Messenger (ﷺ)! I went out to answer the call of nature and `Umar said to me so-and-so.\" Then Allah inspired him (the Prophet) and when the state of inspiration was over and the bone was still in his hand as he had not put in down, he said (to Sauda رضی اللہ عنہا ), \"You (women) have been allowed to go out for your needs.\"",
                "hadithUrdu": "ام المؤمنین سودہ رضی اللہ عنہا پردہ کا حکم نازل ہونے کے بعد قضائے حاجت کے لیے نکلیں وہ بہت بھاری بھر کم تھیں جو انہیں جانتا تھا اس سے پوشیدہ نہیں رہ سکتی تھیں۔ راستے میں عمر بن خطاب رضی اللہ عنہ نے انہیں دیکھ لیا اور کہا کہ اے سودہ! ہاں اللہ کی قسم! آپ ہم سے اپنے آپ کو نہیں چھپا سکتیں دیکھئیے تو آپ کس طرح باہر نکلی ہیں۔ بیان کیا کہ سودہ رضی اللہ عنہا الٹے پاؤں وہاں سے واپس آ گئیں، رسول اللہ صلی اللہ علیہ وسلم اس وقت میرے حجرہ میں تشریف رکھتے تھے اور رات کا کھانا کھا رہے تھے۔ نبی کریم صلی اللہ علیہ وسلم کے ہاتھ میں اس وقت گوشت کی ایک ہڈی تھی۔ سودہ رضی اللہ عنہا نے داخل ہوتے ہی کہا: یا رسول اللہ! میں قضائے حاجت کے لیے نکلی تھی تو عمر ( رضی اللہ عنہ ) نے مجھ سے باتیں کیں، بیان کیا کہ آپ صلی اللہ علیہ وسلم پر وحی کا نزول شروع ہو گیا اور تھوڑی دیر بعد یہ کیفیت ختم ہوئی، ہڈی اب بھی آپ کے ہاتھ میں تھی۔ آپ نے اسے رکھا نہیں تھا۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں ( اللہ کی طرف سے ) قضائے حاجت کے لیے باہر جانے کی اجازت دے دی گئی ہے۔",
                "urduNarrator": "ہم سے زکریا بن یحییٰ نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے ہشام نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي زَكَرِيَّاءُ بْنُ يَحْيَى، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجَتْ سَوْدَةُ بَعْدَ مَا ضُرِبَ الْحِجَابُ لِحَاجَتِهَا، وَكَانَتِ امْرَأَةً جَسِيمَةً لاَ تَخْفَى عَلَى مَنْ يَعْرِفُهَا، فَرَآهَا عُمَرُ بْنُ الْخَطَّابِ فَقَالَ يَا سَوْدَةُ أَمَا وَاللَّهِ مَا تَخْفَيْنَ عَلَيْنَا، فَانْظُرِي كَيْفَ تَخْرُجِينَ، قَالَتْ فَانْكَفَأَتْ رَاجِعَةً، وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَيْتِي، وَإِنَّهُ لَيَتَعَشَّى‏.‏ وَفِي يَدِهِ عَرْقٌ فَدَخَلَتْ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي خَرَجْتُ لِبَعْضِ حَاجَتِي فَقَالَ لِي عُمَرُ كَذَا وَكَذَا‏.‏ قَالَتْ فَأَوْحَى اللَّهُ إِلَيْهِ ثُمَّ رُفِعَ عَنْهُ وَإِنَّ الْعَرْقَ فِي يَدِهِ مَا وَضَعَهُ فَقَالَ ‏ \"‏ إِنَّهُ قَدْ أُذِنَ لَكُنَّ أَنْ تَخْرُجْنَ لِحَاجَتِكُنَّ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4575,
                "hadithNumber": "4796",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Aflah رضی اللہ عنہ , the brother of Abi Al-Qu`ais, asked permission to visit me after the order of Al-Hijab was revealed. I said, \"I will not permit him unless I take permission of the Prophet (ﷺ) about him for it was not the brother of Abi Al-Qu`ais but the wife of Abi Al-Qu`ais that nursed me.\" The Prophet (ﷺ) entered upon me, and I said to him, \"O Allah's Messenger (ﷺ)! Aflah رضی اللہ عنہ , the brother of Abi Al-Qu`ais asked permission to visit me but I refused to permit him unless I took your permission.\" The Prophet (ﷺ) said, \"What stopped you from permitting him? He is your uncle.\" I said, \"O Allah's Messenger (ﷺ)! The man was not the person who had nursed me, but the woman, the wife of Abi Al-Qu`ais had nursed me.\" He said, \"Admit him, for he is your uncle. Taribat Yaminuki (may your right hand be saved)\" `Urwa, the sub-narrator added: For that `Aisha رضی اللہ عنہا used to say, \"Consider those things which are illegal because of blood relations as illegal because of the corresponding foster relations.\"",
                "hadithUrdu": "پردہ کا حکم نازل ہونے کے بعد ابوالقعیس کے بھائی افلح رضی اللہ عنہ نے مجھ سے ملنے کی اجازت چاہی، لیکن میں نے کہلوا دیا کہ جب تک اس سلسلے میں رسول اللہ صلی اللہ علیہ وسلم سے اجازت حاصل نہ لے لوں، ان سے نہیں مل سکتی۔ میں نے سوچا کہ ان کے بھائی ابوالقعیس نے مجھے تھوڑا ہی دودھ پلایا تھا، دودھ پلانے والی تو ابوالقعیس کی بیوی تھی۔ پھر نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ سے عرض کیا کہ یا رسول اللہ! ابوالقعیس کے بھائی افلح رضی اللہ عنہ نے مجھ سے ملنے کی اجازت چاہی، لیکن میں نے یہ کہلوا دیا کہ جب تک نبی کریم صلی اللہ علیہ وسلم سے اجازت نہ لے لوں ان سے ملاقات نہیں کر سکتی۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اپنے چچا سے ملنے سے تم نے کیوں انکار کر دیا۔ میں نے عرض کیا: یا رسول اللہ! ابوالقعیس نے مجھے تھوڑا ہی دودھ پلایا تھا، دودھ پلانے والی تو ان کی بیوی تھیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا انہیں اندر آنے کی اجازت دے دو وہ تمہارے چچا ہیں۔ عروہ نے بیان کیا کہ اسی وجہ سے عائشہ رضی اللہ عنہا فرماتی تھیں کہ رضاعت سے بھی وہ چیز یں ( مثلاً نکاح وغیرہ ) حرام ہو جاتی ہیں جو نسب کی وجہ سے حرام ہوتی ہیں۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے، ان سے عروہ بن زبیر نے بیان کیا، ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اسْتَأْذَنَ عَلَىَّ أَفْلَحُ أَخُو أَبِي الْقُعَيْسِ بَعْدَ مَا أُنْزِلَ الْحِجَابُ، فَقُلْتُ لاَ آذَنُ لَهُ حَتَّى أَسْتَأْذِنَ فِيهِ النَّبِيَّ صلى الله عليه وسلم فَإِنَّ أَخَاهُ أَبَا الْقُعَيْسِ لَيْسَ هُوَ أَرْضَعَنِي، وَلَكِنْ أَرْضَعَتْنِي امْرَأَةُ أَبِي الْقُعَيْسِ، فَدَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم فَقُلْتُ لَهُ يَا رَسُولَ اللَّهِ، إِنَّ أَفْلَحَ أَخَا أَبِي الْقُعَيْسِ اسْتَأْذَنَ، فَأَبَيْتُ أَنْ آذَنَ حَتَّى أَسْتَأْذِنَكَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَمَا مَنَعَكِ أَنْ تَأْذَنِي عَمُّكِ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ الرَّجُلَ لَيْسَ هُوَ أَرْضَعَنِي، وَلَكِنْ أَرْضَعَتْنِي امْرَأَةُ أَبِي الْقُعَيْسِ‏.‏ فَقَالَ ‏\"‏ ائْذَنِي لَهُ فَإِنَّهُ عَمُّكِ، تَرِبَتْ يَمِينُكِ ‏\"‏‏.‏ قَالَ عُرْوَةُ فَلِذَلِكَ كَانَتْ عَائِشَةُ تَقُولُ حَرِّمُوا مِنَ الرَّضَاعَةِ مَا تُحَرِّمُونَ مِنَ النَّسَبِ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏إِنْ تُبْدُوا شَيْئًا أَوْ تُخْفُوهُ فَإِنَّ اللَّهَ كَانَ بِكُلِّ شَىْءٍ عَلِيمًا * لاَ جُنَاحَ عَلَيْهِنَّ فِي آبَائِهِنَّ وَلاَ أَبْنَائِهِنَّ وَلاَ إِخْوَانِهِنَّ وَلاَ أَبْنَاءِ إِخْوَانِهِنَّ وَلاَ أَبْنَاءِ أَخَوَاتِهِنَّ وَلاَ نِسَائِهِنَّ وَلاَ مَا مَلَكَتْ أَيْمَانُهُنَّ وَاتَّقِينَ اللَّهَ إِنَّ اللَّهَ كَانَ عَلَى كُلِّ شَىْءٍ شَهِيدً‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: \"چاہے تم کسی چیز کو ظاہر کرو یا چھپاؤ، بے شک اللہ ہر چیز کا جاننے والا ہے... بے شک اللہ ہر چیز پر گواہ ہے۔ (V-33:54,55)",
                "headingEnglish": "The Statement of Allah the Exalted: “Whether you reveal anything or conceal it, verily, Allah is [the] Ever All-Knower of everything... (up to) ... Verily, Allah is Ever All-Witness over everything.\" (V-33:54,55)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4576,
                "hadithNumber": "4797",
                "englishNarrator": "Narrated Ka`b bin Ujra رضی اللہ عنہ :",
                "hadithEnglish": "It was said, \"O Allah's Messenger (ﷺ)! We know how to greet you, but how to invoke Allah for you?\" The Prophet said, \"Say: Allahumma salli ala Muhammadin wa'ala `Ali Muhammaddin, kama sallaita 'ala all Ibrahim, innaka Hamidun Majid.\"",
                "hadithUrdu": "عرض کیا گیا: یا رسول اللہ! آپ پر سلام کا طریقہ تو ہمیں معلوم ہو گیا ہے، لیکن آپ پر «صلاة» کا کیا طریقہ ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یوں پڑھا کرو «اللهم صل على محمد وعلى آل محمد،‏‏‏‏ كما صليت على آل إبراهيم،‏‏‏‏ إنك حميد مجيد،‏‏‏‏ اللهم بارك على محمد وعلى آل محمد،‏‏‏‏ كما باركت على آل إبراهيم،‏‏‏‏ إنك حميد مجيد‏ ‏‏.» ۔",
                "urduNarrator": "مجھ سے سعید بن یحییٰ نے بیان کیا، کہا مجھ سے میرے والد نے بیان کیا، کہا ہم سے مسعر نے بیان کیا، ان سے حکم نے، ان سے ابن ابی لیلیٰ نے اور ان سے کعب بن عجرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي سَعِيدُ بْنُ يَحْيَى، حَدَّثَنَا أَبِي، حَدَّثَنَا مِسْعَرٌ، عَنِ الْحَكَمِ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ ـ رضى الله عنه ـ قِيلَ يَا رَسُولَ اللَّهِ، أَمَّا السَّلاَمُ عَلَيْكَ فَقَدْ عَرَفْنَاهُ فَكَيْفَ الصَّلاَةُ قَالَ ‏ \"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏إِنَّ اللَّهَ وَمَلاَئِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اللہ تعالیٰ نبی (صلی اللہ علیہ وآلہ وسلم) پر درود بھیجتا ہے اور اس کے فرشتے بھی (اللہ تعالیٰ سے ان پر درود بھیجتے ہیں اور معافی مانگتے ہیں)...‘‘ (آیت 33) :56)",
                "headingEnglish": "The Statement of Allah the Most High: \"Allah sends His Salāt (Graces, Honours, Blessings and Mercy) on the Prophet (Muḥammad pbuh) and also His angels (ask Allah to bless and forgive him)...\" (V.33:56)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4577,
                "hadithNumber": "4798",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "We said, \"O Allah's Messenger (ﷺ)! It is how to salute you, but how should we convey blessing to you? He ﷺ said: O Allah! Bestow blessings on Hadrat Muhammad ﷺ who is your Bondsman and Apostle as you bestowed on the progeny of Hadrat Ibrahim and grant Hadrat Muhammad ﷺ and the progeny of Hadrat Muhammad ﷺ favours as you granted Hadrat Ibrahim favours. Abu Shualih has reported from Laith in this way: On Hadrat Muhammad ﷺ and the progeny of Hadrat Muhammad ﷺ as you bestowed favour on the progeny of Hadrat Ibrahim. Ibn-e-Abu Hazim and Darawardi have reported from Yazeed bin Hammad that he ﷺ said: As you bestowed blessings on Hadrat Ibrahim and confer favours on Hadrat Muhammad ﷺ and the progeny of Hadrat Muhammad ﷺ as you conferred the favours on Hadrat Ibrahim and the progeny of Hadrat Ibrahim.",
                "hadithUrdu": "ہم نے عرض کیا: یا رسول اللہ! آپ پر سلام بھیجنے کا طریقہ تو ہمیں معلوم ہو گیا ہے۔ لیکن «صلاة» ( درود ) بھیجنے کا کیا طریقہ ہے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یوں کہا کرو «اللهم صل على محمد عبدك ورسولك،‏‏‏‏ كما صليت على آل إبراهيم،‏‏‏‏ وبارك على محمد وعلى آل محمد كما باركت على إبراهيم» اے اللہ اپنے بندے اور رسول محمد صلی اللہ علیہ وسلم پر رحمت نازل فرما جیسا کہ تو نے آل ابراہیم پر رحمت نازل فرمائی، اور محمد ﷺاور آل محمدﷺ پر رحمت نازل فرما جیسا کہ تو نے ابراہیم پر رحمت نازل فرمائی تھی، ۔ ابوصالح نے بیان کیا کہ اور ان سے لیث بن سعد نے ( ان الفاظ کے ساتھ ) «على محمد وعلى آل محمد،‏‏‏‏ كما باركت على آل إبراهيم» آل محمد پر جس طرح تو نے ابراہیم کی آل پر برکت نازل فرمائی،کے الفاظ روایت کئے ہیں۔ ہم سے ابراہیم بن حمزہ نے بیان کیا، ابن ابی حازم نے۔ اور الدراوردی نے ہمیں یزید کی سند سے بیان کیا  ‏\"‏ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ ‏\"‏‏ محمد ﷺاور آل محمد ﷺپر جس طرح تو نے ابراہیم کی آل پر برکت نازل فرمائی، اس روایت میں ذرا لفظوں میں کمی بیشی ہے اور ان الفاظ میں بھی یہ درود پڑھنا جائز ہے،معنی میں کوئی فرق نہیں پڑتا۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا، انہوں نے کہا کہ مجھ سے ابن الہاد نے بیان کیا، ان سے عبداللہ بن خباب نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قُلْنَا يَا رَسُولَ اللَّهِ هَذَا التَّسْلِيمُ فَكَيْفَ نُصَلِّي عَلَيْكَ قَالَ ‏\"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ ‏\"‏‏.‏ قَالَ أَبُو صَالِحٍ عَنِ اللَّيْثِ ‏\"‏ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ ‏\"‏‏.‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، وَالدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ، وَقَالَ، ‏\"‏ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4551,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=182",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=180",
                "label": "180",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=181",
                "label": "181",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=182",
                "label": "182",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=183",
                "label": "183",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=184",
                "label": "184",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=185",
                "label": "185",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=186",
                "label": "186",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=184",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=184",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=182",
        "to": 4575,
        "total": 40465
    }
}