{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 39,
        "data": [
            {
                "id": 951,
                "hadithNumber": "980",
                "englishNarrator": "Narrate Hafsa bint Seereen :",
                "hadithEnglish": "said, \"On Id we used to forbid our girls to go out for `Id prayer. A lady came and stayed at the palace of Bani Khalaf and I went to her. She said, 'The husband of my sister took part in twelve holy battles along with the Prophet (ﷺ) and my sister was with her husband in six of them. My sister said that they used to nurse the sick and treat the wounded. Once she asked, 'O Allah's Messenger (ﷺ)! If a woman has no veil, is there any harm if she does not come out (on `Id day)?' The Prophet (ﷺ) said, 'Her companion should let her share her veil with her, and the women should participate in the good deeds and in the religious gatherings of the believers.' \" Hafsa رضی اللہ عنہا added, \"When Um-`Atiya رضی اللہ عنہا came, I went to her and asked her, 'Did you hear anything about so-and-so?' Um-`Atiya said, 'Yes, let my father be sacrificed for the Prophet (ﷺ). (And whenever she mentioned the name of the Prophet (ﷺ) she always used to say, 'Let my father be' sacrificed for him). He said, 'Virgin mature girls staying often screened (or said, 'Mature girls and virgins staying often screened--Aiyub is not sure as which was right) and menstruating women should come out (on the `Id day). But the menstruating women should keep away from the Musalla. And all the women should participate in the good deeds and in the religious gatherings of the believers'.\" Hafsa said, \"On that I said to Um-`Atiya رضی اللہ عنہا , 'Also those who are menstruating?' \" Um-`Atiya replied, \"Yes. Do they not present themselves at `Arafat and elsewhere?\".",
                "hadithUrdu": "ہم اپنی لڑکیوں کو عیدگاہ جانے سے منع کرتے تھے ۔ پھر ایک خاتون باہر سے آئی اور قصر بنو خلف میں انہوں نے قیام کیا میں ان سے ملنے کے لیے حاضر ہوئی تو انہوں نے بیان کیا کہ ان کی بہن کے شوہر نبی کریم صلی اللہ علیہ وسلم کے ساتھ بارہ لڑائیوں میں شریک رہے اور خود ان کی بہن اپنے شوہر کے ساتھ چھ لڑائیوں میں شریک ہوئی تھیں ، ان کا بیان تھا کہ ہم مریضوں کی خدمت کیا کرتے تھے اور زخمیوں کی مرہم پٹی کرتے تھے ۔ انہوں نے پوچھا کہ یا رسول اللہ ! کیا ہم میں سے اگر کسی کے پاس چادر نہ ہو اور اس وجہ سے وہ عید کے دن ( عیدگاہ ) نہ جا سکے تو کوئی حرج ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی سہیلی اپنی چادر کا ایک حصہ اسے اڑھا دے اور پھر وہ خیر اور مسلمانوں کی دعا میں شریک ہوں ۔ حفصہ رضی اللہ عنہا نے بیان کیا کہ پھر جب ام عطیہ رضی اللہ عنہا یہاں تشریف لائیں تو میں ان کی خدمت میں بھی حاضر ہوئی اور دریافت کیا کہ آپ نے فلاں فلاں بات سنی ہے ۔ انہوں نے فرمایا کہ ہاں میرے باپ آپ پر فدا ہوں ۔ ام عطیہ رضی اللہ عنہا جب بھی نبی کریم صلی اللہ علیہ وسلم کا ذکر کرتیں تو یہ ضرور کہتیں کہ میرے باپ آپ پر فدا ہوں ، ہاں تو انہوں نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جوان پردہ والی یا جوان اور پردہ والی باہر نکلیں ۔ شبہ ایوب کو تھا ۔ البتہ حائضہ عورتیں عیدگاہ سے علیحدہ ہو کر بیٹھیں انہیں خیر اور مسلمانوں کی دعا میں ضرور شریک ہونا چاہیے ۔ حفصہ نے کہا کہ میں نے ام عطیہ رضی اللہ عنہا سے دریافت کیا کہ حائضہ عورتیں بھی ؟ انہوں نے فرمایا کیا حائضہ عورتیں عرفات نہیں جاتیں اور کیا وہ فلاں فلاں جگہوں میں شریک نہیں ہوتیں ( پھر اجتماع عید ہی کی شرکت میں کون سی قباحت ہے ) ۔",
                "urduNarrator": "ہم سے ابومعمر نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالوارث نے بیان کیا ، انہوں نے کہا کہ ہم سے ایوب سختیانی نے حفصہ بن سیرین کے واسطے سے بیان کیا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، قَالَتْ كُنَّا نَمْنَعُ جَوَارِيَنَا أَنْ يَخْرُجْنَ يَوْمَ الْعِيدِ، فَجَاءَتِ امْرَأَةٌ فَنَزَلَتْ قَصْرَ بَنِي خَلَفٍ فَأَتَيْتُهَا فَحَدَّثَتْ أَنَّ زَوْجَ أُخْتِهَا غَزَا مَعَ النَّبِيِّ صلى الله عليه وسلم ثِنْتَىْ عَشْرَةَ غَزْوَةً فَكَانَتْ أُخْتُهَا مَعَهُ فِي سِتِّ غَزَوَاتٍ‏.‏ فَقَالَتْ فَكُنَّا نَقُومُ عَلَى الْمَرْضَى وَنُدَاوِي الْكَلْمَى، فَقَالَتْ يَا رَسُولَ اللَّهِ، عَلَى إِحْدَانَا بَأْسٌ إِذَا لَمْ يَكُنْ لَهَا جِلْبَابٌ أَنْ لاَ تَخْرُجَ فَقَالَ ‏\"‏ لِتُلْبِسْهَا صَاحِبَتُهَا مِنْ جِلْبَابِهَا فَلْيَشْهَدْنَ الْخَيْرَ وَدَعْوَةَ الْمُؤْمِنِينَ ‏\"‏‏.‏ قَالَتْ حَفْصَةُ فَلَمَّا قَدِمَتْ أُمُّ عَطِيَّةَ أَتَيْتُهَا، فَسَأَلْتُهَا أَسَمِعْتِ فِي كَذَا وَكَذَا قَالَتْ نَعَمْ، بِأَبِي ـ وَقَلَّمَا ذَكَرَتِ النَّبِيَّ صلى الله عليه وسلم إِلاَّ قَالَتْ بِأَبِي ـ قَالَ ‏\"‏ لِيَخْرُجِ الْعَوَاتِقُ ذَوَاتُ الْخُدُورِ ـ أَوْ قَالَ الْعَوَاتِقُ وَذَوَاتُ الْخُدُورِ شَكَّ أَيُّوبُ ـ وَالْحُيَّضُ، وَيَعْتَزِلُ الْحُيَّضُ الْمُصَلَّى، وَلْيَشْهَدْنَ الْخَيْرَ وَدَعْوَةَ الْمُؤْمِنِينَ ‏\"‏‏.‏ قَالَتْ فَقُلْتُ لَهَا آلْحُيَّضُ قَالَتْ نَعَمْ، أَلَيْسَ الْحَائِضُ تَشْهَدُ عَرَفَاتٍ وَتَشْهَدُ كَذَا وَتَشْهَدُ كَذَا",
                "headingArabic": "إِذَا لَمْ يَكُنْ لَهَا جِلْبَابٌ فِي الْعِيدِ",
                "headingUrdu": "اگر کسی عورت کے پاس عید کے لیے پردہ نہ ہو۔",
                "headingEnglish": "If a women has no veil to use for Eid",
                "chapterId": "14",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 14,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Two Festivals (Eids)",
                    "chapterUrdu": "عیدین کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب العيدين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 952,
                "hadithNumber": "981",
                "englishNarrator": "Narrated Um-`Atiya رضی اللہ عنہا :",
                "hadithEnglish": "We were ordered to go out (for `Id) and also to take along with us the menstruating women, mature girls and virgins staying in seclusion. (Ibn `Aun said, \"Or mature virgins staying in seclusion).\" The menstruating women could present themselves at the religious gathering and invocation of Muslims but should keep away from their Musalla.",
                "hadithUrdu": "ہمیں حکم تھا کہ حائضہ عورتوں ، دوشیزاؤں اور پردہ والیوں کو عیدگاہ لے جائیں ابن عون نے کہا کہ یا ( حدیث میں ) پردہ والی دوشیزائیں ہے البتہ حائضہ عورتیں مسلمانوں کی جماعت اور دعاؤں میں شریک ہوں اور ( نماز سے ) الگ رہیں ۔",
                "urduNarrator": "ہم سے محمد بن مثنی نے بیان کیا ، انہوں نے کہا کہ ہم سے محمد بن ابراہیم ابن ابی عدی نے بیان کیا ، ان سے عبداللہ بن عون نے بیان کیا ، ان سے محمد بن سیرین نے کہ ام عطیہ رضی اللہ عنہا نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُحَمَّدٍ، قَالَ قَالَتْ أُمُّ عَطِيَّةَ أُمِرْنَا أَنْ نَخْرُجَ فَنُخْرِجَ الْحُيَّضَ وَالْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ‏.‏ قَالَ ابْنُ عَوْنٍ أَوِ الْعَوَاتِقَ ذَوَاتِ الْخُدُورِ، فَأَمَّا الْحُيَّضُ فَيَشْهَدْنَ جَمَاعَةَ الْمُسْلِمِينَ وَدَعْوَتَهُمْ، وَيَعْتَزِلْنَ مُصَلاَّهُمْ‏.‏",
                "headingArabic": "اعْتِزَالِ الْحُيَّضِ الْمُصَلَّى",
                "headingUrdu": "حیض والی عورتیں مسلہ سے دور رہیں",
                "headingEnglish": "Menstruating women should keep away from the Mussalla",
                "chapterId": "14",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 14,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Two Festivals (Eids)",
                    "chapterUrdu": "عیدین کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب العيدين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 953,
                "hadithNumber": "982",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) used to Nahr or slaughter sacrifices at the Musalla (on `Id-ul-Adha).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم عیدگاہ ہی میں نحر اور ذبح کیا کرتے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، کہا کہ مجھ سے کثیر بن فرقد نے نافع سے بیان کیا ، ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي كَثِيرُ بْنُ فَرْقَدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَنْحَرُ أَوْ يَذْبَحُ بِالْمُصَلَّى‏.‏",
                "headingArabic": "النَّحْرِ وَالذَّبْحِ يَوْمَ النَّحْرِ بِالْمُصَلَّى",
                "headingUrdu": "یوم النحر کو مسجد میں النحر اور ذھب",
                "headingEnglish": "An-Nahr and Adh-Dhabh at the Masjid on the day of Nahr",
                "chapterId": "14",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 14,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Two Festivals (Eids)",
                    "chapterUrdu": "عیدین کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب العيدين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 954,
                "hadithNumber": "983",
                "englishNarrator": "Narrated Al-Bara' bin `Azib رضی اللہ عنہ :",
                "hadithEnglish": "On the day of Nahr Allah's Messenger (ﷺ) delivered the Khutba after the `Id prayer and said, \"Anyone who prayed like us and slaughtered the sacrifice like we did then he acted according to our (Nusuk) tradition of sacrificing, and whoever slaughtered the sacrifice before the prayer, then that was just mutton (i.e. not sacrifice).\" Abu Burda bin Naiyar stood up and said, \"O Allah's Messenger (ﷺ)! By Allah, I slaughtered my sacrifice before I offered the (Id) prayer and thought that today was the day of eating and drinking (nonalcoholic drinks) and so I made haste (in slaughtering) and ate and also fed my family and neighbors.\" Allah's Messenger (ﷺ) said, \"That was just mutton (not a sacrifice).\" Then Abu Burda said, \"I have a young she-goat and no doubt, it is better than two sheep. Will that be sufficient as a sacrifice for me?\" The Prophet (ﷺ) replied, \"Yes. But it will not be sufficient for anyone else (as a sacrifice), after you.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے بقرعید کے دن نماز کے بعد خطبہ دیا اور فرمایا کہ جس نے ہماری طرح کی نماز پڑھی اور ہماری طرح کی قربانی کی ، اس کی قربانی درست ہوئی ۔ لیکن جس نے نماز سے پہلے قربانی کی تو وہ ذبیحہ صرف گوشت کھانے کے لیے ہو گا ۔ اس پر ابوبردہ بن نیار نے عرض کیا کہ یا رسول اللہ صلی اللہ علیہ وسلم قسم اللہ کی میں نے تو نماز کے لیے آنے سے پہلے قربانی کر لی میں نے یہ سمجھا کہ آج کا دن کھانے پینے کا دن ہے ۔ اسی لیے میں نے جلدی کی اور خود بھی کھایا اور گھر والوں کو اور پڑوسیوں کو بھی کھلایا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ بہرحال یہ گوشت ( کھانے کا ) ہوا ( قربانی نہیں ) انہوں نے عرض کیا کہ میرے پاس ایک بکری کا سال بھر کا بچہ ہے وہ دو بکریوں کے گوشت سے زیادہ بہتر ہے ۔ کیا میری ( طرف سے اس کی ) قربانی درست ہو گی ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں مگر تمہارے بعد کسی کی طرف سے ایسے بچے کی قربانی کافی نہ ہو گی ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے ابوالاحوص سلام بن سلیم نے بیان کیا ، کہا کہ ہم سے منصور بن معتمر نے بیان کیا کہ ان سے عامر شعبی نے ، ان سے براء بن عازب رضی اللہ عنہ نے ، انہوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، قَالَ حَدَّثَنَا مَنْصُورُ بْنُ الْمُعْتَمِرِ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ خَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ النَّحْرِ بَعْدَ الصَّلاَةِ فَقَالَ ‏\"‏ مَنْ صَلَّى صَلاَتَنَا وَنَسَكَ نُسْكَنَا فَقَدْ أَصَابَ النُّسُكَ، وَمَنْ نَسَكَ قَبْلَ الصَّلاَةِ فَتِلْكَ شَاةُ لَحْمٍ ‏\"‏‏.‏ فَقَامَ أَبُو بُرْدَةَ بْنُ نِيَارٍ فَقَالَ يَا رَسُولَ اللَّهِ وَاللَّهِ لَقَدْ نَسَكْتُ قَبْلَ أَنْ أَخْرُجَ إِلَى الصَّلاَةِ، وَعَرَفْتُ أَنَّ الْيَوْمَ يَوْمُ أَكْلٍ وَشُرْبٍ فَتَعَجَّلْتُ وَأَكَلْتُ وَأَطْعَمْتُ أَهْلِي وَجِيرَانِي‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تِلْكَ شَاةُ لَحْمٍ ‏\"‏‏.‏ قَالَ فَإِنَّ عِنْدِي عَنَاقَ جَذَعَةٍ، هِيَ خَيْرٌ مِنْ شَاتَىْ لَحْمٍ، فَهَلْ تَجْزِي عَنِّي قَالَ ‏\"‏ نَعَمْ، وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏‏.‏",
                "headingArabic": "كَلاَمِ الإِمَامِ وَالنَّاسِ فِي خُطْبَةِ الْعِيدِ، وَإِذَا سُئِلَ الإِمَامُ عَنْ شَيْءٍ وَهْوَ يَخْطُبُ",
                "headingUrdu": "اگر امام سے خطبہ دیتے وقت کسی چیز کے بارے میں پوچھا جائے؟",
                "headingEnglish": "If the Imam is asked about something while he is delivering the Khutba",
                "chapterId": "14",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 14,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Two Festivals (Eids)",
                    "chapterUrdu": "عیدین کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب العيدين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 955,
                "hadithNumber": "984",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) offered the prayer on the day of Nahr and then delivered the Khutba and ordered that whoever had slaughtered his sacrifice before the prayer should repeat it, that is, should slaughter another sacrifice. Then a person from the Ansar stood up and said, \"O Allah's Messenger (ﷺ)! because of my neighbors (he described them as being very needy or poor) I slaughtered before the prayer. I have a young she-goat which, in my opinion, is better than two sheep.\" The Prophet (ﷺ) gave him the permission for slaughtering it as a sacrifice.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بقرعید کے دن نماز پڑھ کر خطبہ دیا آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس شخص نے نماز سے پہلے جانور ذبح کر لیا اسے دوبارہ قربانی کرنی ہو گی ۔ اس پر انصار میں سے ایک صاحب اٹھے کہ یا رسول اللہ ! میرے کچھ غریب بھوکے پڑوسی ہیں یا یوں کہا وہ محتاج ہیں ۔ اس لیے میں نے نماز سے پہلے ذبح کر دیا البتہ میرے پاس ایک سال کی ایک پٹھیا ہے جو دو بکریوں کے گوشت سے بھی زیادہ مجھے پسند ہے ۔ آپ صلی اللہ علیہ وسلم نے انہیں اجازت دے دی ۔",
                "urduNarrator": "ہم سے حامد بن عمر نے بیان کیا ، ان سے حماد بن زید نے ، ان سے ایوب سختیانی نے ، ان سے محمدنے ، ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ، عَنْ حَمَّادِ بْنِ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، أَنَّ أَنَسَ بْنَ مَالِكٍ، قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى يَوْمَ النَّحْرِ، ثُمَّ خَطَبَ فَأَمَرَ مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ أَنْ يُعِيدَ ذَبْحَهُ فَقَامَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ يَا رَسُولَ اللَّهِ، جِيرَانٌ لِي ـ إِمَّا قَالَ بِهِمْ خَصَاصَةٌ، وَإِمَّا قَالَ بِهِمْ فَقْرٌ ـ وَإِنِّي ذَبَحْتُ قَبْلَ الصَّلاَةِ وَعِنْدِي عَنَاقٌ لِي أَحَبُّ إِلَىَّ مِنْ شَاتَىْ لَحْمٍ‏.‏ فَرَخَّصَ لَهُ فِيهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 14,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Two Festivals (Eids)",
                    "chapterUrdu": "عیدین کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب العيدين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 956,
                "hadithNumber": "985",
                "englishNarrator": "Narrated Jundab:",
                "hadithEnglish": "On the day of Nahr the Prophet (ﷺ) offered the prayer and delivered the Khutba and then slaughtered the sacrifice and said, \"Anybody who slaughtered (his sacrifice) before the prayer should slaughter another animal in lieu of it, and the one who has not yet slaughtered should slaughter the sacrifice mentioning Allah's name on it.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے بقرعید کے دن نماز پڑھنے کے بعد خطبہ دیا پھر قربانی کی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس نے نماز سے پہلے ذبح کر لیا ہو تو اسے دوسرا جانور بدلہ میں قربانی کرنا چاہیے اور جس نے نماز سے پہلے ذبح نہ کیا ہو وہ اللہ کے نام پر ذبح کرے ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے اسود بن قیس نے ، ان سے جندب نے ، انہوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَسْوَدِ، عَنْ جُنْدَبٍ، قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم يَوْمَ النَّحْرِ ثُمَّ خَطَبَ، ثُمَّ ذَبَحَ فَقَالَ ‏ \"‏ مَنْ ذَبَحَ قَبْلَ أَنْ يُصَلِّيَ فَلْيَذْبَحْ أُخْرَى مَكَانَهَا، وَمَنْ لَمْ يَذْبَحْ فَلْيَذْبَحْ بِاسْمِ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "14",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 14,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Two Festivals (Eids)",
                    "chapterUrdu": "عیدین کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب العيدين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 957,
                "hadithNumber": "986",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "On the Day of `Id the Prophet (ﷺ) used to return (after offering the `Id prayer) through a way different from that by which he went.\r\nYounus bin Muhammad corroborated him from fulaih and jabir's Hadith is more authentic.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم عید کے دن ایک راستہ سے جاتے پھر دوسرا راستہ بدل کر آتے ۔ \r\nاس روایت کی متابعت یونس بن محمد نے فلیح سے کی ، ان سے سعید نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا لیکن جابر کی روایت زیادہ صحیح ہے ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، انہوں نے کہا کہ ہمیں ابو تمیلہ یحییٰ بن واضح نے خبر دی ، انہیں فلیح بن سلیمان نے ، انہیں سعید بن حارث نے ، انہیں جابر رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، قَالَ أَخْبَرَنَا أَبُو تُمَيْلَةَ، يَحْيَى بْنُ وَاضِحٍ عَنْ فُلَيْحِ بْنِ سُلَيْمَانَ، عَنْ سَعِيدِ بْنِ الْحَارِثِ، عَنْ جَابِرٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا كَانَ يَوْمُ عِيدٍ خَالَفَ الطَّرِيقَ‏.‏ تَابَعَهُ يُونُسُ بْنُ مُحَمَّدٍ عَنْ فُلَيْحٍ‏.‏ وَحَدِيثُ جَابِرٍ أَصَحُّ‏.‏",
                "headingArabic": "مَنْ خَالَفَ الطَّرِيقَ إِذَا رَجَعَ يَوْمَ الْعِيدِ",
                "headingUrdu": "جو شخص عید کے دن (نماز ادا کرنے کے بعد) اس راستے سے واپس آیا جس سے وہ گیا تھا۔",
                "headingEnglish": "Whoever returned (after offering the Eid prayer) on the day of Eid through a way different from that by which he went",
                "chapterId": "14",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 14,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Two Festivals (Eids)",
                    "chapterUrdu": "عیدین کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب العيدين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 958,
                "hadithNumber": "987, 988",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "On the days of Mina, (11th, 12th, and 13th of Dhul-Hijjah) Abu Bakr رضی اللہ عنہ came to her while two young girls were beating the tambourine and the Prophet (ﷺ) was lying covered with his clothes. Abu Bakr رضی اللہ عنہ scolded them and the Prophet (ﷺ) uncovered his face and said to Abu Bakr رضی اللہ عنہ , \"Leave them, for these days are the days of `Eid and the days of Mina.\"  `Aisha ضی اللہ عنہا further said, \"Once the Prophet (ﷺ) was screening me and I was watching the display of black slaves in the Mosque and (`Umar رضی اللہ عنہ ) scolded them. The Prophet (ﷺ) said, 'Leave them. O Bani Arfida! (carry on), you are safe (protected)'.\"",
                "hadithUrdu": "ابوبکر رضی اللہ عنہ ان کے یہاں ( منٰی کے دنوں میں ) تشریف لائے اس وقت گھر میں دو لڑکیاں دف بجا رہی تھیں اور بعاث کی لڑائی کی نظمیں گا رہی تھیں ۔ نبی کریم صلی اللہ علیہ وسلم چہرہ مبارک پر کپڑا ڈالے ہوئے تشریف فرما تھے ۔ ابوبکر رضی اللہ عنہ نے ان دونوں کو ڈانٹا ۔ اس پر آپ صلی اللہ علیہ وسلم نے چہرہ مبارک سے کپڑا ہٹا کر فرمایا کہ ابوبکر جانے بھی دو یہ عید کے دن ہیں ( اور وہ بھی منٰی میں ) ۔ اور حضرت عائشہ رضی اللہ عنہا نے کہامیں نے ( ایک دفعہ ) نبی کریم صلی اللہ علیہ وسلم کو دیکھا کہ آپ صلی اللہ علیہ وسلم نے مجھے چھپا رکھا تھا اور میں حبشہ کے لوگوں کو دیکھ رہی تھی جو مسجد میں تیروں سے کھیل رہے تھے ۔ حضرت عمر رضی اللہ عنہ نے انہیں ڈانٹا لیکن نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جانے دو اور ان سے فرمایا اے بنوارفدہ ! تم بے فکر ہو کر کھیل دکھاؤ ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ان سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عروہ نے ، ان سے حضرت عائشہ رضی اللہ عنہا نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ دَخَلَ عَلَيْهَا وَعِنْدَهَا جَارِيَتَانِ فِي أَيَّامِ مِنًى تُدَفِّفَانِ وَتَضْرِبَانِ، وَالنَّبِيُّ صلى الله عليه وسلم مُتَغَشٍّ بِثَوْبِهِ، فَانْتَهَرَهُمَا أَبُو بَكْرٍ فَكَشَفَ النَّبِيُّ صلى الله عليه وسلم عَنْ وَجْهِهِ فَقَالَ ‏\"‏ دَعْهُمَا يَا أَبَا بَكْرٍ فَإِنَّهَا أَيَّامُ عِيدٍ ‏\"‏‏.‏ وَتِلْكَ الأَيَّامُ أَيَّامُ مِنًى‏.‏ وَقَالَتْ عَائِشَةُ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَسْتُرُنِي، وَأَنَا أَنْظُرُ إِلَى الْحَبَشَةِ وَهُمْ يَلْعَبُونَ فِي الْمَسْجِدِ، فَزَجَرَهُمْ عُمَرُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعْهُمْ، أَمْنًا بَنِي أَرْفِدَةَ ‏\"‏‏.‏ يَعْنِي مِنَ الأَمْنِ‏.‏",
                "headingArabic": "إِذَا فَاتَهُ الْعِيدُ يُصَلِّي رَكْعَتَيْنِ",
                "headingUrdu": "جس کی نماز عید چھوٹ جائے وہ دو رکعت نماز پڑھے۔",
                "headingEnglish": "Whoever missed the Eid prayer should offer two Rak'a prayer",
                "chapterId": "14",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 14,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Two Festivals (Eids)",
                    "chapterUrdu": "عیدین کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب العيدين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 959,
                "hadithNumber": "989",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) went out and offered a two rak`at prayer on the Day of `Id ul Fitr and did not offer any other prayer before or after it and at that time Bilal رضی اللہ عنہ was accompanying him.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم عیدالفطر کے دن نکلے اور ( عیدگاہ ) میں دو رکعت نمازعید پڑھی ۔ آپ صلی اللہ علیہ وسلم نے نہ اس سے پہلے نفل نماز پڑھی اور نہ اس کے بعد ۔ آپ صلی اللہ علیہ وسلم کے ساتھ بلال رضی اللہ عنہ بھی تھے ۔",
                "urduNarrator": "ہم سے ابو ولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے عدی بن ثابت نے خبر دی ، انہوں نے کہا کہ میں نے سعید بن جبیر سے سنا ، وہ ابن عباس رضی اللہ عنہما سے بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي عَدِيُّ بْنُ ثَابِتٍ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمَ الْفِطْرِ، فَصَلَّى رَكْعَتَيْنِ لَمْ يُصَلِّ قَبْلَهَا وَلاَ بَعْدَهَا وَمَعَهُ بِلاَلٌ‏.‏",
                "headingArabic": "الصَّلاَةِ قَبْلَ الْعِيدِ وَبَعْدَهَا",
                "headingUrdu": "نماز عید سے پہلے یا بعد میں",
                "headingEnglish": "Salat before or after the Eid prayer",
                "chapterId": "14",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 14,
                    "chapterNumber": "14",
                    "chapterEnglish": "The Two Festivals (Eids)",
                    "chapterUrdu": "عیدین کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب العيدين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 960,
                "hadithNumber": "990",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Once a person asked Allah's Messenger (ﷺ) about the night prayer. Allah's Apostle (ﷺ) replied, \"The night prayer is offered as two Rak`at followed by two Rak`at and so on and if anyone is afraid of the approaching dawn (Fajr prayer) he should pray one Rak`ah and this will be a Witr for all the Rak`at which he has prayed before.\"",
                "hadithUrdu": "ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے رات میں نماز کے متعلق معلوم کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ رات کی نماز دو دو رکعت ہے پھر جب کوئی صبح ہو جانے سے ڈرے تو ایک رکعت پڑھ لے ، وہ اس کی ساری نماز کو طاق بنا دے گی ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے نافع اور عبداللہ ابن دینار سے خبر دی اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى، فَإِذَا خَشِيَ أَحَدُكُمُ الصُّبْحَ صَلَّى رَكْعَةً وَاحِدَةً، تُوتِرُ لَهُ مَا قَدْ صَلَّى ‏\"‏‏.‏",
                "headingArabic": "مَا جَاءَ فِي الْوِتْرِ",
                "headingUrdu": "نماز وتر کے بارے میں کیا کہا جاتا ہے؟",
                "headingEnglish": "What is said regarding the Witr prayer",
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 961,
                "hadithNumber": "991",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "Hadrat Abdullah bin Umer  رضی اللہ عنہما that he would perform the salutation between one and two units of Witr; and pass orders to fulfil any of his needs.",
                "hadithUrdu": "عبداللہ بن عمر رضی اللہ عنہما وتر کی جب تین رکعتیں پڑھتے تو دو رکعت پڑھ کر سلام پھیرتے یہاں تک کہ ضرورت سے بات بھی کرتے ۔",
                "urduNarrator": "اور اسی سند کے ساتھ نافع سے روایت ہے کہ",
                "hadithArabic": "وَعَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُسَلِّمُ بَيْنَ الرَّكْعَةِ وَالرَّكْعَتَيْنِ فِي الْوِتْرِ، حَتَّى يَأْمُرَ بِبَعْضِ حَاجَتِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 962,
                "hadithNumber": "992",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Once I passed the night in the house of Maimuna رضی اللہ عنہ (his aunt). I slept across the bed while Allah's Apostle and his wife slept length-wise. The Prophet (ﷺ) slept till midnight or nearly so and woke up rubbing his face and recited ten verses from Surat \"Al-`Imran.\" Allah's Messenger (ﷺ) went towards a leather skin and performed ablution in the most perfect way and then stood for the prayer. I did the same and stood beside him. The Prophet (ﷺ) put his right hand on my head, twisted my ear and then prayed two rak`at five times and then ended his prayer with witr. He laid down till the Mu'adh-dhin came then he stood up and offered two rak`at (Sunnah of Fajr prayer) and then went out and offered the Fajr prayer. (See Hadith 183)",
                "hadithUrdu": "آپ ایک رات اپنی خالہ ام المؤمنین میمونہ رضی اللہ عنہا کے یہاں سوئے ( آپ رضی اللہ عنہ نے کہا کہ ) میں تکیہ کے عرض میں لیٹ گیا اور رسول اللہ صلی اللہ علیہ وسلم اور آپ کی بیوی لمبائی میں لیٹیں ، آپ صلی اللہ علیہ وسلم سو گئے جب آدھی رات گزر گئی یا اس کے لگ بھگ تو آپ صلی اللہ علیہ وسلم بیدار ہوئے نیند کے اثر کو چہرہ مبارک پر ہاتھ پھیر کر آپ صلی اللہ علیہ وسلم نے دور کیا ۔ اس کے بعد آل عمران کی دس آیتیں پڑھیں ۔ پھر ایک پرانی مشک پانی کی بھری ہوئی لٹک رہی تھی ۔ آپ صلی اللہ علیہ وسلم اس کے پاس گئے اور اچھی طرح وضو کیا اور نماز کے لیے کھڑے ہو گئے ۔ میں نے بھی ایسا ہی کیا ۔ آپ صلی اللہ علیہ وسلم پیار سے اپنا داہنا ہاتھ میرے سر رکھ کر اور میرا کان پکڑ کر اسے ملنے لگے ۔ پھر آپ صلی اللہ علیہ وسلم نے دو رکعت نماز پڑھی ، پھر دو رکعت ، پھر دو رکعت ، پھر دو رکعت ، پھر دو رکعت ، پھر دو رکعت سب بارہ رکعتیں پھر ایک رکعت وتر پڑھ کر آپ صلی اللہ علیہ وسلم لیٹ گئے ، یہاں تک کہ مؤذن صبح صادق کی اطلاع دینے آیا تو آپ صلی اللہ علیہ وسلم نے پھر کھڑے ہو کر دو رکعت سنت نماز پڑھی ۔ پھر باہر تشریف لائے اور صبح کی نماز پڑھائی ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے مخرمہ بن سلیمان نے بیان کیا ، ان سے کریب نے اور انہیں حضرت عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّهُ، بَاتَ عِنْدَ مَيْمُونَةَ، وَهْىَ خَالَتُهُ، فَاضْطَجَعْتُ فِي عَرْضِ وِسَادَةٍ، وَاضْطَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَهْلُهُ فِي طُولِهَا، فَنَامَ حَتَّى انْتَصَفَ اللَّيْلُ أَوْ قَرِيبًا مِنْهُ، فَاسْتَيْقَظَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ، ثُمَّ قَرَأَ عَشْرَ آيَاتٍ مِنْ آلِ عِمْرَانَ، ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى شَنٍّ مُعَلَّقَةٍ، فَتَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ، ثُمَّ قَامَ يُصَلِّي فَصَنَعْتُ مِثْلَهُ فَقُمْتُ إِلَى جَنْبِهِ، فَوَضَعَ يَدَهُ الْيُمْنَى عَلَى رَأْسِي، وَأَخَذَ بِأُذُنِي يَفْتِلُهَا، ثُمَّ صَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ أَوْتَرَ، ثُمَّ اضْطَجَعَ حَتَّى جَاءَهُ الْمُؤَذِّنُ فَقَامَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ، خَرَجَ فَصَلَّى الصُّبْحَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 963,
                "hadithNumber": "993",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Night prayer is offered as two rak`at followed by two rak`at and so on, and if you want to finish it, pray only one rak`a which will be witr for all the previous rak`at.\" Al-Qasim said, \"Since we attained the age of puberty we have seen some people offering a three-rak`at prayer as witr and all that is permissible. I hope there will be no harm in it.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، رات کی نماز دو ، دو رکعتیں ہے اور جب تو ختم کرنا چاہے تو ایک رکعت وتر پڑھ لے جو ساری نماز کو طاق بنا دے گی ۔ قاسم بن محمد نے بیان کیا کہ ہم نے بہت سوں کو تین رکعت وتر پڑھتے بھی پایا ہے اور تین یا ایک ( رکعت وتر ) سب جائز اور مجھ کو امید ہے کہ کسی میں قباحت نہ ہو گی ۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، انہوں نے کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، انہوں نے کہا کہ ہمیں عمرو بن حارث نے خبر دی ، ان سے عبدالرحمٰن بن قاسم نے اپنے باپ قاسم سے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، حَدَّثَهُ عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى، فَإِذَا أَرَدْتَ أَنْ تَنْصَرِفَ فَارْكَعْ رَكْعَةً تُوتِرُ لَكَ مَا صَلَّيْتَ ‏\"‏‏.‏ قَالَ الْقَاسِمُ وَرَأَيْنَا أُنَاسًا مُنْذُ أَدْرَكْنَا يُوتِرُونَ بِثَلاَثٍ، وَإِنَّ كُلاًّ لَوَاسِعٌ أَرْجُو أَنْ لاَ يَكُونَ بِشَىْءٍ مِنْهُ بَأْسٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 964,
                "hadithNumber": "994",
                "englishNarrator": "Narrated `A'isha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to pray eleven rak`at at night and that was his night prayer and each of his prostrations lasted for a period enough for one of you to recite fifty verses before Allah's Messenger (ﷺ) raised his head. He also used to pray two rak`at (Sunnah) before the (compulsory) Fajr prayer and then lie down on his right side till the Mu'adh-dhin came to him for the prayer.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم گیارہ رکعتیں ( وتر اور تہجد کی ) پڑھتے تھے ، آپ صلی اللہ علیہ وسلم کی یہی نماز تھی ۔ مراد ان کی رات کی نماز تھی ۔ آپ صلی اللہ علیہ وسلم کا سجدہ ان رکعتوں میں اتنا لمبا ہوتا تھا کہ سر اٹھانے سے پہلے تم میں سے کوئی شخص بھی پچاس آیتیں پڑھ سکتا اور فجر کی نماز فرض سے پہلے آپ صلی اللہ علیہ وسلم سنت دو رکعتیں پڑھتے تھے اس کے بعد ( ذرا دیر ) داہنے پہلو پر لیٹ رہتے یہاں تک کہ مئوذن بلانے کے لئے آپ صلی اللہ علیہ وسلم کے پاس آتا ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی ، انہوں نے کہا کہ مجھ سے عروہ بن زبیر نے بیان کیا کہ حضرت عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي إِحْدَى عَشْرَةَ رَكْعَةً، كَانَتْ تِلْكَ صَلاَتَهُ ـ تَعْنِي بِاللَّيْلِ ـ فَيَسْجُدُ السَّجْدَةَ مِنْ ذَلِكَ قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ، وَيَرْكَعُ رَكْعَتَيْنِ قَبْلَ صَلاَةِ الْفَجْرِ، ثُمَّ يَضْطَجِعُ عَلَى شِقِّهِ الأَيْمَنِ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ لِلصَّلاَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 965,
                "hadithNumber": "995",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"What is your opinion about the two rak`at before the Fajr (compulsory) prayer, as to prolonging the recitation in them?\" He said, \"The Prophet (ﷺ) used to pray at night two rak`at followed by two and so on, and end the prayer by one rak`ah witr. He used to offer two rak`at before the Fajr prayer immediately after the Adhan.\" (Hammad, the sub-narrator said, \"That meant (that he prayed) quickly.)\"",
                "hadithUrdu": "نماز صبح سے پہلے کی دو رکعتوں کے متعلق آپ کا کیا خیال ہے ؟ کیا میں ان میں لمبی قرآت کر سکتا ہوں ؟ انہوں نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم تو رات کی نماز ( تہجد ) دو ، دو رکعت کر کے پڑھتے تھے پھر ایک رکعت پڑھ کر ان کو طاق بنا لیتے اور صبح کی نماز سے پہلے کی دو رکعتیں ( سنت فجر تو ) اس طرح پڑھتے گویا اذان ( اقامت ) کی آواز آپ کے کان میں پڑ رہی ہے ۔ حماد کی اس سے مراد یہ ہے کہ آپ جلدی پڑھ لیتے ۔",
                "urduNarrator": "ہم سے ابو نعمان نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، کہا کہ ہم سے انس بن سیرین نے بیان کیا ، کہا کہ میں نے ابن عمر رضی اللہ عنہما سے پوچھا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، قَالَ حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ، قَالَ قُلْتُ لاِبْنِ عُمَرَ أَرَأَيْتَ الرَّكْعَتَيْنِ قَبْلَ صَلاَةِ الْغَدَاةِ أُطِيلُ فِيهِمَا الْقِرَاءَةَ فَقَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ مَثْنَى مَثْنَى، وَيُوتِرُ بِرَكْعَةٍ وَيُصَلِّي الرَّكْعَتَيْنِ قَبْلَ صَلاَةِ الْغَدَاةِ وَكَأَنَّ الأَذَانَ بِأُذُنَيْهِ‏.‏ قَالَ حَمَّادٌ أَىْ سُرْعَةً‏.‏",
                "headingArabic": "سَاعَاتِ الْوِتْرِ",
                "headingUrdu": "نماز وتر کے اوقات (نماز وتر)",
                "headingEnglish": "The timing of the Salat-ul-Witr (Witr prayer)",
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 966,
                "hadithNumber": "996",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) offered witr prayer at different nights at various hours extending (from the `Isha' prayer) up to the last hour of the night.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے رات کے ہر حصہ میں بھی وتر پڑھی ہے اور آخیر میں آپ صلی اللہ علیہ وسلم کا وتر صبح کے قریب پہنچا ۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا کہ مجھ سے میرے باپ نے بیان کیا ، انہوں نے کہا کہ ہم سے اعمش نے بیان کیا ، کہا کہ مجھ سے مسلم بن کیسان نے بیان کیا ، ان سے مسروق نے ، ان سے حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي مُسْلِمٌ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ كُلَّ اللَّيْلِ أَوْتَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَانْتَهَى وِتْرُهُ إِلَى السَّحَرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 967,
                "hadithNumber": "997",
                "englishNarrator": "Narrated `A'isha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) used to offer his night prayer while I was sleeping across in his bed. Whenever he intended to offer the witr prayer, he used to wake me up and I would offer the witr prayer too.",
                "hadithUrdu": "آپ نے فرمایا نبی کریم صلی اللہ علیہ وسلم ( تہجد کی ) نماز پڑھتے رہتے اور میں آپ صلی اللہ علیہ وسلم کے بستر پر عرض میں لیٹی رہتی ۔ جب وتر پڑھنے لگتے تو مجھے بھی جگا دیتے اور میں بھی وتر پڑھ لیتی ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے ہشام بن عروہ نے بیان کیا ، کہا کہ مجھ سے میرے باپ نے عائشہ رضی اللہ عنہا سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنِي أَبِي، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي، وَأَنَا رَاقِدَةٌ مُعْتَرِضَةً عَلَى فِرَاشِهِ، فَإِذَا أَرَادَ أَنْ يُوتِرَ أَيْقَظَنِي فَأَوْتَرْتُ‏.‏",
                "headingArabic": "إِيقَاظِ النَّبِيِّ صلى الله عليه وسلم أَهْلَهُ بِالْوِتْرِ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنے گھر والوں کو نماز وتر کے لیے جگایا کرتے تھے۔",
                "headingEnglish": "The Prophet (ﷺ) used to wake his family up for the Witr prayer",
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 968,
                "hadithNumber": "998",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Make witr as your last prayer at night.\"",
                "hadithUrdu": "اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ وتر رات کی تمام نمازوں کے بعد پڑھا کرو ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے عبیداللہ عمری نے ان سے نافع نے عبداللہ بن عمر رضی اللہ عنہما سے بیان کیا",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ اجْعَلُوا آخِرَ صَلاَتِكُمْ بِاللَّيْلِ وِتْرًا ‏\"‏‏.‏",
                "headingArabic": "لِيَجْعَلْ آخِرَ صَلاَتِهِ وِتْرًا",
                "headingUrdu": "وتر آخری نماز کے طور پر (رات کو)",
                "headingEnglish": "Witr as the last Salat (at night)",
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 969,
                "hadithNumber": "999",
                "englishNarrator": "Narrated Sa`id bin Yasar:",
                "hadithEnglish": "I was going to Mecca in the company of `Abdullah bin `Umar رضی اللہ عنہما and when I apprehended the approaching dawn, I dismounted and offered the witr prayer and then joined him. `Abdullah bin `Umar رضی اللہ عنہما said, \"Where have you been?\" I replied, \"I apprehended the approaching dawn so I dismounted and prayed the witr prayer.\" `Abdullah رضی اللہ عنہما said, \"Isn't it sufficient for you to follow the good example of Allah's Messenger (ﷺ)?\" I replied, \"Yes, by Allah.\" He said, \"Allah's Messenger (ﷺ) used to pray witr on the back of the camel (while on a journey).\"",
                "hadithUrdu": "میں عبداللہ بن عمر رضی اللہ عنہما کے ساتھ مکہ کے راستے میں تھا ۔ سعید نے کہا کہ جب راستے میں مجھے طلوع فجر کا خطرہ ہوا تو سواری سے اتر کر میں نے وتر پڑھ لیا اور پھر عبداللہ بن عمر رضی اللہ عنہما سے جا ملا ۔ آپ نے پوچھا کہ کہاں رک گئے تھے ؟ میں نے کہا کہ اب صبح کا وقت ہونے ہی والا تھا اس لیے میں سواری سے اتر کر وتر پڑھنے لگا ۔ اس پر حضرت عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ کیا تمہارے لیے نبی کریم صلی اللہ علیہ وسلم کا عمل اچھا نمونہ نہیں ہے ۔ میں نے عرض کیا کیوں نہیں بیشک ہے ۔ آپ نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم تو اونٹ ہی پر وتر پڑھ لیا کرتے تھے ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا کہ ہم سے امام مالک نے بیان کیا ، انہوں نے ابوبکر بن عمر بن عبدالرحمٰن بن عبداللہ بن عمر بن خطاب سے بیان کیا اور ان کو سعید بن یسار نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي بَكْرِ بْنِ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، عَنْ سَعِيدِ بْنِ يَسَارٍ، أَنَّهُ قَالَ كُنْتُ أَسِيرُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ بِطَرِيقِ مَكَّةَ فَقَالَ سَعِيدٌ فَلَمَّا خَشِيتُ الصُّبْحَ نَزَلْتُ فَأَوْتَرْتُ، ثُمَّ لَحِقْتُهُ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ أَيْنَ كُنْتَ فَقُلْتُ خَشِيتُ الصُّبْحَ، فَنَزَلْتُ فَأَوْتَرْتُ‏.‏ فَقَالَ عَبْدُ اللَّهِ أَلَيْسَ لَكَ فِي رَسُولِ اللَّهِ صلى الله عليه وسلم أُسْوَةٌ حَسَنَةٌ فَقُلْتُ بَلَى وَاللَّهِ‏.‏ قَالَ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ عَلَى الْبَعِيرِ‏.‏",
                "headingArabic": "الْوِتْرِ عَلَى الدَّابَّةِ",
                "headingUrdu": "جانور پر سوار ہو کر وتر کی نماز پڑھنا",
                "headingEnglish": "To offer the Witr Salat while riding on an animal",
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 970,
                "hadithNumber": "1000",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) used to offer (Nawafil) prayers on his Rahila (mount) facing its direction by signals, but not the compulsory prayer. He also used to pray witr on his (mount) Rahila.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سفر میں اپنی سواری ہی پر رات کی نماز اشاروں سے پڑھ لیتے تھے خواہ سواری کا رخ کسی طرف ہو جاتا آپ صلی اللہ علیہ وسلم اشاروں سے پڑھتے رہتے مگر فرائض اس طرح نہیں پڑھتے تھے اور وتر اپنی اونٹنی پر پڑھ لیتے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے جویریہ بن اسماء نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي فِي السَّفَرِ عَلَى رَاحِلَتِهِ، حَيْثُ تَوَجَّهَتْ بِهِ، يُومِئُ إِيمَاءً، صَلاَةَ اللَّيْلِ إِلاَّ الْفَرَائِضَ، وَيُوتِرُ عَلَى رَاحِلَتِهِ‏.‏",
                "headingArabic": "الْوِتْرِ فِي السَّفَرِ",
                "headingUrdu": "سفر میں وتر کی نماز پڑھنا",
                "headingEnglish": "Offering prayers of Witr while on a journey",
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 971,
                "hadithNumber": "1001",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "\"Did the Prophet (ﷺ) recite Qunut in the Fajr prayer?\" Anas replied in the affirmative. He was further asked, \"Did he recite Qunut before bowing?\" Anas replied, \"He recited Qunut after bowing for some time (for one month).\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے صبح کی نماز میں قنوت پڑھا ہے ؟ آپ نے فرمایا کہ ہاں پھر پوچھا گیا کہ کیا رکوع سے پہلے ؟ تو آپ نے فرمایا کہ رکوع کے بعد تھوڑے دنوں تک ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ان سے محمد بن سیرین نے ، انہوں نے کہا کہ انس بن مالک رضی اللہ عنہ سے پوچھا گیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، قَالَ سُئِلَ أَنَسٌ أَقَنَتَ النَّبِيُّ صلى الله عليه وسلم فِي الصُّبْحِ قَالَ نَعَمْ‏.‏ فَقِيلَ لَهُ أَوَقَنَتَ قَبْلَ الرُّكُوعِ قَالَ بَعْدَ الرُّكُوعِ يَسِيرًا‏.‏",
                "headingArabic": "الْقُنُوتِ قَبْلَ الرُّكُوعِ وَبَعْدَهُ",
                "headingUrdu": "رکوع سے پہلے اور بعد میں قنوت پڑھنا",
                "headingEnglish": "To recite Qunut before and after bowing",
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 972,
                "hadithNumber": "1002",
                "englishNarrator": "Narrated `Asim:",
                "hadithEnglish": "I asked Anas bin Malik رضی اللہ عنہ about the Qunut. Anas replied, \"Definitely it was (recited)\". I asked, \"Before bowing or after it?\" Anas replied, \"Before bowing.\" I added, \"So and so has told me that you had informed him that it had been after bowing.\" Anas said, \"He told an untruth (i.e. \"was mistaken,\" according to the Hijazi dialect). Allah's Messenger (ﷺ) recited Qunut after bowing for a period of one month.\" Anas added, \"The Prophet (ﷺ) sent about seventy men (who knew the Qur'an by heart) towards the pagans (of Najd) who were less than they in number and there was a peace treaty between them and Allah's Messenger (ﷺ) (but the Pagans broke the treaty and killed the seventy men). So Allah's Messenger (ﷺ) recited Qunut for a period of one month asking Allah to punish them.\"",
                "hadithUrdu": "میں نے انس بن مالک رضی اللہ عنہ سے قنوت کے بارے میں پوچھا تو آپ نے فرمایا کہ دعائے قنوت ( حضور اکرم صلی اللہ علیہ وسلم کے دور میں ) پڑھی جاتی تھی ۔ میں نے پوچھا کہ رکوع سے پہلے یا اس کے بعد ؟ آپ نے فرمایا کہ رکوع سے پہلے ۔ عاصم نے کہا کہ آپ ہی کے حوالے سے فلاں شخص نے خبر دی ہے کہ آپ نے رکوع کے بعد فرمایا تھا ۔ اس کا جواب حضرت انس نے یہ دیا کہ انہوں نے غلط سمجھا ۔ رسول اللہ صلی اللہ علیہ وسلم نے رکوع کے بعد صرف ایک مہینہ دعائے قنوت پڑھی تھی ۔ ہوا یہ تھا کہ آپ صلی اللہ علیہ وسلم نے صحابہ میں سے ستر قاریوں کے قریب مشرکوں کی ایک قوم ( بنی عامر ) کی طرف سے ان کو تعلیم دینے کے لیے بھیجے تھے ، یہ لوگ ان کے سوا تھے جن پر آپ نے بددعا کی تھی ۔ ان میں اور آنحضرت صلی اللہ علیہ وسلم کے درمیان عہد تھا ، لیکن انہوں نے عہد شکنی کی ( اور قاریوں کو مار ڈالا ) تو آنحضرت صلی اللہ علیہ وسلم ایک مہینہ تک ( رکوع کے بعد ) قنوت پڑھتے رہے ان پر بددعا کرتے رہے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے عبدالواحد بن زیاد نے بیان کیا ، کہا کہ ہم سے عاصم بن سلیمان نے بیان کیا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا عَاصِمٌ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنِ الْقُنُوتِ،‏.‏ فَقَالَ قَدْ كَانَ الْقُنُوتُ‏.‏ قُلْتُ قَبْلَ الرُّكُوعِ أَوْ بَعْدَهُ قَالَ قَبْلَهُ‏.‏ قَالَ فَإِنَّ فُلاَنًا أَخْبَرَنِي عَنْكَ أَنَّكَ قُلْتَ بَعْدَ الرُّكُوعِ‏.‏ فَقَالَ كَذَبَ، إِنَّمَا قَنَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْدَ الرُّكُوعِ شَهْرًا ـ أُرَاهُ ـ كَانَ بَعَثَ قَوْمًا يُقَالُ لَهُمُ الْقُرَّاءُ زُهَاءَ سَبْعِينَ رَجُلاً إِلَى قَوْمٍ مِنَ الْمُشْرِكِينَ دُونَ أُولَئِكَ، وَكَانَ بَيْنَهُمْ وَبَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَهْدٌ فَقَنَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَهْرًا يَدْعُو عَلَيْهِمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 973,
                "hadithNumber": "1003",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) recited Qunut for one month (in the Fajr prayer) asking Allah to punish the tribes of Ral and Dhakwan.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک مہینہ تک دعا قنوت پڑھی اور اس میں قبائل رعل و ذکوان پر بددعا کی تھی ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، کہا کہ ہم سے زائدہ نے بیان کیا ، ان سے تیمی نے ، ان سے ابو مجلز نے ، ان سے انس بن مالک رضی اللہ عنہ کہ",
                "hadithArabic": "أَخْبَرَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ حَدَّثَنَا زَائِدَةُ، عَنِ التَّيْمِيِّ، عَنْ أَبِي مِجْلَزٍ، عَنْ أَنَسٍ، قَالَ قَنَتَ النَّبِيُّ صلى الله عليه وسلم شَهْرًا يَدْعُو عَلَى رِعْلٍ وَذَكْوَانَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 974,
                "hadithNumber": "1004",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "During the time of Holy prophet (ﷺ) Qunut used to be recited in the Maghrib and the Fajr prayers.",
                "hadithUrdu": "آنحضور صلی اللہ علیہ وسلم کے عہد میں قنوت مغرب اور فجر میں پڑھی جاتی تھی ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہمیں اسماعیل بن علیہ نے خبر دی ، کہا کہ ہمیں خالد حذاء نے خبر دی ، انہیں ابوقلابہ نے ، انہیں انس بن مالک رضی اللہ عنہ نے ، آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، قَالَ كَانَ الْقُنُوتُ فِي الْمَغْرِبِ وَالْفَجْرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "15",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 15,
                    "chapterNumber": "15",
                    "chapterEnglish": "Witr Prayer",
                    "chapterUrdu": "نماز وتر کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوتر",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 975,
                "hadithNumber": "1005",
                "englishNarrator": "Narrated `Abbad bin Tamim's uncle:",
                "hadithEnglish": "The Prophet (ﷺ) went out to perform the prayer for rain and turned his cloak.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم پانی کی دعا کرنے کے لیے تشریف لے گئے اور اپنی چادر الٹائی ۔",
                "urduNarrator": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان ثوری نے عبداللہ بن ابی بکر سے بیان کیا ، ان سے عباد بن تمیم نے اور ان سے ان کے چچا عبداللہ بن زید نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم يَسْتَسْقِي وَحَوَّلَ رِدَاءَهُ‏.‏",
                "headingArabic": "الاِسْتِسْقَاءِ وَخُرُوجِ النَّبِيِّ صلى الله عليه وسلم فِي الاِسْتِسْقَاءِ",
                "headingUrdu": "نماز استسقاء کے لیے رسول اللہ صلی اللہ علیہ وسلم سے باہر جانا",
                "headingEnglish": "Going out of the Prophet (ﷺ) to offer Istisqa' prayer",
                "chapterId": "16",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 16,
                    "chapterNumber": "16",
                    "chapterEnglish": "Invoking Allah for Rain (Istisqaa)",
                    "chapterUrdu": "استسقاء یعنی پانی مانگنے کا بیان",
                    "chapterArabic": "كتاب الاستسقاء",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 951,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=38",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=36",
                "label": "36",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=37",
                "label": "37",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=38",
                "label": "38",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=39",
                "label": "39",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=40",
                "label": "40",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=41",
                "label": "41",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=42",
                "label": "42",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=40",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=40",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=38",
        "to": 975,
        "total": 40465
    }
}