{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 109,
        "data": [
            {
                "id": 2703,
                "hadithNumber": "2829",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Five are regarded as martyrs: They are those who die because of plague, Abdominal disease, drowning or a falling building etc., and the martyrs in Allah's Cause.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا شہید پانچ قسم کے ہوتے ہیں ۔ طاعون میں ہلاک ہونے والا ‘ پیٹ کی بیماری میں ہلاک ہونے والا ‘ ڈوب کر مرنے والا ‘ دب کر مر جانے والا اور اللہ کے راستے میں شہادت پانے والا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ کہا ہم کو امام مالک نے خبر دی ‘ انہیں سمی نے ‘ انہیں ابوصالح نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الشُّهَدَاءُ خَمْسَةٌ الْمَطْعُونُ، وَالْمَبْطُونُ، وَالْغَرِقُ وَصَاحِبُ الْهَدْمِ، وَالشَّهِيدُ فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": "الشَّهَادَةُ سَبْعٌ سِوَى الْقَتْلِ",
                "headingUrdu": "جہاد میں شہید ہونے والوں کے علاوہ سات شہید ہیں۔",
                "headingEnglish": "There are seven martyrs other than killed in Jihad",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2704,
                "hadithNumber": "2830",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Plague is the cause of martyrdom of every Muslim (who dies because of it).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا طاعون کی موت ہر مسلمان کے لئے شہادت کا درجہ رکھتی ہے ۔",
                "urduNarrator": "ہم سے بشر بن محمد نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو عاصم نے خبر دی حفصہ بنت سیرین سے اور انہوں نے انس بن مالک رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عَاصِمٌ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الطَّاعُونُ شَهَادَةٌ لِكُلِّ مُسْلِمٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2705,
                "hadithNumber": "2831",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "When the Divine Inspiration: \"Those of the believers who sit (at home), was revealed the Prophet (ﷺ) sent for Zaid (bin Thabit رضی اللہ عنہ) who came with a shoulder-blade and wrote on it. Ibn Um-Maktum رضی اللہ عنہ complained about his blindness and on that the following revelation came: \"Not equal are those believers who sit (at home) except those who are disabled (by injury, or are blind or lame etc.) and those who strive hard and fight in the Way of Allah with their wealth and lives).\" (4.95)",
                "hadithUrdu": "جب آیت » لایستوی القاعدون من المؤمنین « نازل ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے زید بن ثابت رضی اللہ عنہ ( جو کاتب وحی تھے ) کو بلایا ‘ آپ ایک چوڑی ہڈی ساتھ لے کر حاضر ہوئے اور اس آیت کو لکھا اور ابن ام مکتوم رضی اللہ عنہ نے جب اپنے نابینا ہونے کی شکایت کی تو آیت یوں نازل ہوئی» لا یستوی القاعدون المؤمنین غیر اولیٰ الضرر « ۔",
                "urduNarrator": "ہم سے ابو الولید نے بیان کیا ‘ انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ابواسحاق سے کہ میں نے براء بن عازب رضی اللہ عنہ سے سنا ‘ آپ کہتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ يَقُولُ لَمَّا نَزَلَتْ ‏{‏لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ‏}‏ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم زَيْدًا، فَجَاءَ بِكَتِفٍ فَكَتَبَهَا، وَشَكَا ابْنُ أُمِّ مَكْتُومٍ ضَرَارَتَهُ فَنَزَلَتْ ‏{‏لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ غَيْرُ أُولِي الضَّرَرِ ‏}‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ غَيْرُ أُولِي الضَّرَرِ وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فَضَّلَ اللَّهُ الْمُجَاهِدِينَ بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ عَلَى الْقَاعِدِينَ دَرَجَةً وَكُلاًّ وَعَدَ اللَّهُ الْحُسْنَى وَفَضَّلَ اللَّهُ الْمُجَاهِدِينَ عَلَى الْقَاعِدِينَ} إِلَى قَوْلِهِ: {غَفُورًا رَحِيمًا}",
                "headingUrdu": "اللہ تعالیٰ کا ارشاد ہے: ’’وہ مسلمان جو بغیر عذر کے لڑائی سے الگ ہو جاتے ہیں اور جو اللہ کی راہ میں اپنے مال اور جان سے جہاد کرتے ہیں وہ برابر نہیں ہیں۔ اللہ تعالیٰ نے اپنے مال و جان سے جہاد کرنے والوں کو الگ بیٹھنے والوں پر بلند درجہ دیا ہے۔ اور اللہ نے سب سے بھلائی کا وعدہ کیا ہے اور اللہ نے جدوجہد کرنے والوں کو بیٹھنے والوں پر اجر عظیم دیا ہے۔ اس کی طرف سے درجات اور بخشش اور رحمت۔ اور اللہ بخشنے والا مہربان ہے''",
                "headingEnglish": "Allh says: ''ThosevMuslims who sit aloof from fighting without excuse and those who strive in the way of Allah with their wealth and lives are not equal. Allah has exalted in rank those who strive with their wealth and lives over those who sit aloof. And Allah has promised good to all and Allah has preferred the strivers to the sitters by a great reward. From Him, ranks and forgiveness and Mercy. And Allah is Forgiving, Merciful''",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2706,
                "hadithNumber": "2832",
                "englishNarrator": "Narrated Sahl bin Sa`d As-Sa`idi رضی اللہ عنہ :",
                "hadithEnglish": "I saw Marwan bin Al-Hakam sitting in the Mosque. So I came forward and sat by his side. He told us that Zaid bin Thabit رضی اللہ عنہ had told him that Allah's Messenger (ﷺ) had dictated to him the Divine Verse: \"Not equal are those believers who sit (at home) and those who strive hard and fight in the Cause of Allah with their wealth and lives.' (4.95) Zaid said, \"Ibn-Maktum رضی اللہ عنہ came to the Prophet (ﷺ) while he was dictating to me that very Verse. On that Ibn Um Maktum رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! If I had power, I would surely take part in Jihad.\" He was a blind man. So Allah sent down revelation to His Apostle while his thigh was on mine and it became so heavy for me that I feared that my thigh would be broken. Then that state of the Prophet (ﷺ) was over after Allah revealed \"...except those who are disabled (by injury or are blind or lame etc.) (4.95)",
                "hadithUrdu": "میں مروان بن حکم ( خلیفہ اور اس وقت کے امیر مدینہ ) کو مسجدنبوی میں بیٹھے ہوئے دیکھا تو ان کے قریب گیا اور پہلو میں بیٹھ گیا اور پھر انہوں نے ہمیں خبر دی کہ زید بن ثابت انصاری رضی اللہ عنہ نے انہیں خبر دی تھی کہ رسول اللہ صلی اللہ علیہ وسلم نے ان سے آیت لکھوائی »لا یستوی القاعدون من المؤمنین والمجاہدون فی سبیل اللہ « انہوں نے بیان کیا پھر عبداللہ ابن مکتوم رضی اللہ عنہ آئے آپ صلی اللہ علیہ وسلم اس وقت مجھ سے آیت مذکورہ لکھوا رہے تھے ، انہوں نے کہا یا رسول اللہ ! اگر مجھ میں جہاد کی طاقت ہوتی تو میں جہاد میں شریک ہوتا ۔ وہ نابینا تھے ‘ اس پر اللہ تبارک تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم پر وحی نازل کی ۔ اس وقت آپ صلی اللہ علیہ وسلم کی ران میری ران پر تھی میں نے آپ پر وحی کی شدت کی وجہ سے آپ صلی اللہ علیہ وسلم کی ران کا اتنا بوجھ محسوس کیا کہ مجھے ڈر ہو گیا کہ کہیں میری ران پھٹ نہ جائے ۔ اس کے بعد وہ کیفیت آپ صلی اللہ علیہ وسلم سے ختم ہو گئی اور اللہ عزوجل نے فقط » غیر اولیٰ الضرر « نازل فرمایا ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ‘ کہا ہم سے ابراہیم بن سعد زہری نے بیان کیا ‘ کہا کہ مجھ سے صالح بن کیسان نے بیان کیا ابن شہاب سے ‘ انہوں نے سہل بن سعد زہری رضی اللہ عنہ سے ‘ انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ الزُّهْرِيُّ، قَالَ حَدَّثَنِي صَالِحُ بْنُ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّهُ قَالَ رَأَيْتُ مَرْوَانَ بْنَ الْحَكَمِ جَالِسًا فِي الْمَسْجِدِ، فَأَقْبَلْتُ حَتَّى جَلَسْتُ إِلَى جَنْبِهِ، فَأَخْبَرَنَا أَنَّ زَيْدَ بْنَ ثَابِتٍ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمْلَى عَلَيْهِ لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ قَالَ فَجَاءَهُ ابْنُ أُمِّ مَكْتُومٍ وَهُوَ يُمِلُّهَا عَلَىَّ، فَقَالَ يَا رَسُولَ اللَّهِ، لَوْ أَسْتَطِيعُ الْجِهَادَ لَجَاهَدْتُ‏.‏ وَكَانَ رَجُلاً أَعْمَى، فَأَنْزَلَ اللَّهُ تَبَارَكَ وَتَعَالَى عَلَى رَسُولِهِ صلى الله عليه وسلم وَفَخِذُهُ عَلَى فَخِذِي، فَثَقُلَتْ عَلَىَّ حَتَّى خِفْتُ أَنْ تَرُضَّ فَخِذِي، ثُمَّ سُرِّيَ عَنْهُ، فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏غَيْرُ أُولِي الضَّرَرِ‏}‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2707,
                "hadithNumber": "2833",
                "englishNarrator": "Narrated Salim Abu-An-Nadr:",
                "hadithEnglish": "`Abdullah bin Abi `Aufa رضی اللہ عنہ wrote and I read what he wrote that Allah's Messenger (ﷺ) said, \"When you face them ( i.e. your enemy) then be patient.\"",
                "hadithUrdu": "عبداللہ بن ابی اوفی رضی اللہ عنہ نے ( عمر بن عبیداللہ کو ) لکھا تو میں نے وہ تحریر پڑھی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے جب تمہاری کفار سے مڈبھیڑ ہو تو صبر سے کام لو ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ‘ کہا ہم سے معاویہ بن عمرو نے بیان کیا ‘ کہا ہم سے ابواسحاق موسیٰ ابن عقبہ نے بیان کیا ‘ ان سے سالم بن ابی النضر نے کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمٍ أَبِي النَّضْرِ، أَنَّ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى، كَتَبَ فَقَرَأْتُهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا لَقِيتُمُوهُمْ فَاصْبِرُوا ‏\"‏‏.‏",
                "headingArabic": "الصَّبْرِ عِنْدَ الْقِتَالِ",
                "headingUrdu": "لڑائی کے دوران صبر",
                "headingEnglish": "Patience during fighting",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2708,
                "hadithNumber": "2834",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) went towards the Khandaq (i.e. Trench) and saw the Emigrants and the Ansar digging in a very cold morning as they did not have slaves to do that for them. When he noticed their fatigue and hunger he said, \"O Allah! The real life is that of the Here-after, (so please) forgive the Ansar and the Emigrants.\" In its reply the Emigrants and the Ansar said, \"We are those who have given a pledge of allegiance to Muhammad that we will carry on Jihad as long as we live.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ( غزوہ خندق کے شروع ہونے سے کچھ پہلے جب خندق کی کھدائی ہو رہی تھی ) میدان خندق کی طرف تشریف لے گئے ‘ آپ نے دیکھا کہ مہاجرین اور انصار رضوان اللہ علیہم اجمعین سردی کی سختی کے باوجود صبح ہی صبح خندق کھودنے میں مصروف ہیں ‘ ان کے پاس غلام بھی نہیں تھے جو ان کی اس کھدائی میں مدد کرتے ۔ آپ صلی اللہ علیہ وسلم نے ان کی تھکن اور بھوک کو دیکھا تو آپ صلی اللہ علیہ وسلم نے دعا فرمائی ” اے اللہ ! زندگی تو پس آخرت ہی کی زندگی ہے پس انصار اور مہاجرین کی مغفرت فرما ، “  یعنی درحقیقت جو مزہ ہے آخرت کا ہے مزہ ۔۔۔  بخش دے انصار اور پردیسیوں کو اے خدا ۔۔۔  صحابہ نے اس کے جواب میں کہا ” ہم وہ ہیں جنہوں نے محمد صلی اللہ علیہ وسلم کے ہاتھ پر اس وقت تک جہاد کرنے کا عہد کیا ہے جب تک ہماری جان میں جان ہے “  اپنے پیغمبر محمد صلی اللہ علیہ وسلم سے یہ بیعت ہم نے کی  جب تلک ہے زندگی لڑتے رہیں گے ہم سدا ۔",
                "urduNarrator": "سے عبداللہ بن محمد مسندی نے بیان کیا ‘ کہا ہم سے معاویہ بن عمرو نے بیان کیا ‘ کہا ہم سے اسحاق نے بیان کیا ‘ ان سے حمید نے بیان کیا میں نے انس رضی اللہ عنہ سے سنا ‘ وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ حُمَيْدٍ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ يَقُولُ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْخَنْدَقِ فَإِذَا الْمُهَاجِرُونَ وَالأَنْصَارُ يَحْفِرُونَ فِي غَدَاةٍ بَارِدَةٍ، فَلَمْ يَكُنْ لَهُمْ عَبِيدٌ يَعْمَلُونَ ذَلِكَ لَهُمْ، فَلَمَّا رَأَى مَا بِهِمْ مِنَ النَّصَبِ وَالْجُوعِ قَالَ اللَّهُمَّ إِنَّ الْعَيْشَ عَيْشُ الآخِرَهْ فَاغْفِرْ لِلأَنْصَارِ وَالْمُهَاجِرَهْ‏.‏ فَقَالُوا مُجِيبِينَ لَهُ نَحْنُ الَّذِينَ بَايَعُوا مُحَمَّدًا عَلَى الْجِهَادِ مَا بَقِينَا أَبَدًا",
                "headingArabic": "التَّحْرِيضِ عَلَى الْقِتَالِ",
                "headingUrdu": "لوگوں کو لڑنے کی ترغیب دینا",
                "headingEnglish": "Rousing and exhorting people to figh",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2709,
                "hadithNumber": "2835",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Emigrants and the Ansar started digging the trench around Medina carrying the earth on their backs and saying, \"We are those who have given a pledge of allegiance to Muhammad that we will I carry on Jihad as long as we live.\" The Prophet (ﷺ) kept on replying, \"O Allah, there is no good except the good of the Hereafter; so confer Your Blessings on the Ansar and the Emigrants.\"",
                "hadithUrdu": "( جب تمام عرب کے مدینہ منورہ پر حملہ کا خطرہ ہوا تو ) مدینہ کے اردگرد مہاجرین و انصار خندق کھودنے میں مشغول ہو گئے ‘ مٹی اپنی پشت پر لاد لاد کر اٹھاتے اور ( یہ رجز ) پڑھتے جاتے ” ہم وہ ہیں جنہوں نے محمد صلی اللہ علیہ وسلم کے ہاتھ پر اس وقت تک جہاد کے لئے بیعت کی ہے جب تک ہماری جان میں جان ہے ۔ “ نبی کریم صلی اللہ علیہ وسلم ان کے پاس رجز کے جواب میں یہ دعا فرماتے ” اے اللہ ! آخرت کی خیر کے سوا اور کوئی خیر نہیں ‘ پس آپ انصار اور مہاجرین کو برکت عطا فرما ۔",
                "urduNarrator": "ہم سے ابو معمر نے بیان کیا ‘ کہا ہم سے عبدالوارث نے بیان کیا ‘ کہا ہم سے عبدالعزیز نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ جَعَلَ الْمُهَاجِرُونَ وَالأَنْصَارُ يَحْفِرُونَ الْخَنْدَقَ حَوْلَ الْمَدِينَةِ، وَيَنْقُلُونَ التُّرَابَ عَلَى مُتُونِهِمْ وَيَقُولُونَ نَحْنُ الَّذِينَ بَايَعُوا مُحَمَّدًا عَلَى الإِسْلاَمِ مَا بَقِينَا أَبَدًا وَالنَّبِيُّ صلى الله عليه وسلم يُجِيبُهُمْ وَيَقُولُ اللَّهُمَّ إِنَّهُ لاَ خَيْرَ إِلاَّ خَيْرُ الآخِرَهْ فَبَارِكْ فِي الأَنْصَارِ وَالْمُهَاجِرَهْ‏.‏",
                "headingArabic": "حَفْرِ الْخَنْدَقِ",
                "headingUrdu": "خندق (خندق) کی کھدائی",
                "headingEnglish": "The digging of the Khandaq (trench)",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2710,
                "hadithNumber": "2836",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) went on carrying (i.e. the earth) and saying, \"Without You (O Allah!) we would have got no guidance.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ( خندق کھودتے ہوئے مٹی ) اٹھا رہے تھے اور فرما رہے تھے کہ ” ( اے اللہ ! ) اگر تو نہ ہوتا تو ہمیں ہدایت نصیب نہ ہوتی “ یعنی تو ہدایت گر نہ ہوتا تو نہ ملتی ہم کو راہ ۔",
                "urduNarrator": "ہم سے ابو الولید نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے ابواسحاق نے ‘ انہوں نے براء بن عازب رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ كَانَ النَّبِيُّ صلى الله عليه وسلم يَنْقُلُ وَيَقُولُ ‏ \"‏ لَوْلاَ أَنْتَ مَا اهْتَدَيْنَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2711,
                "hadithNumber": "2837",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "On the day (of the battle) of Al-Ahzab (i.e. clans) I saw the Prophet (ﷺ) carrying earth, and the earth was covering the whiteness of his `Abdomen. And he was saying, \"Without You (O Allah!) we would have got no guidance, nor given in charity, nor prayed. So please bless us with tranquility and make firm our feet when we meet our enemies. Indeed (these) people have rebelled against (oppressed) us but never shall we yield if they try to bring affliction upon us.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو غزوہ احزاب ( خندق ) کے موقع پر دیکھا کہ آپ صلی اللہ علیہ وسلم مٹی ( خندق کھودنے کی وجہ سے جو نکلتی تھی ) خود ڈھو رہے تھے ‘ مٹی سے آپ کے پیٹ کی سفیدی چھپ گئی تھی اور یہ شعر کہہ رہے تھے ۔کہ تیرے بغیر ہمیں ہدایت نصیب نہ ہوتی، نہ صدقہ دیا جاتا اور نہ نماز پڑھی جاتی، تو ہمیں سکون عطا فرما اور جب ہم اپنے دشمنوں سے ملیں تو ہمارے قدم جما دے، بیشک یہ لوگ ہم سے بغاوت کر چکے ہیں لیکن اگر وہ ہم پر مصیبت ڈالنے کی کوشش کریں گے تو ہم کبھی پیچھے نہیں ہٹیں گے۔",
                "urduNarrator": "ہم سے حفص بن عمرنے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے ابواسحاق نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَوْمَ الأَحْزَابِ يَنْقُلُ التُّرَابَ وَقَدْ وَارَى التُّرَابُ بَيَاضَ بَطْنِهِ، وَهُوَ يَقُولُ لَوْلاَ أَنْتَ مَا اهْتَدَيْنَا وَلاَ تَصَدَّقْنَا وَلاَ صَلَّيْنَا‏.‏ فَأَنْزِلِ السَّكِينَةَ عَلَيْنَا وَثَبِّتِ الأَقْدَامَ إِنْ لاَقَيْنَا‏.‏ إِنَّ الأُلَى قَدْ بَغَوْا عَلَيْنَا إِذَا أَرَادُوا فِتْنَةً أَبَيْنَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2712,
                "hadithNumber": "2838",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "We returned from the Ghazwa of Tabuk along with the Prophet. (See Hadith No. 92 below) .",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کی ساتھ غزوہ تبوک سے واپس ہوئے ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ‘ کہا ہم سے زہیر نے بیان کیا ‘ کہا ہم سے حمید نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا حُمَيْدٌ، أَنَّ أَنَسًا، حَدَّثَهُمْ قَالَ رَجَعْنَا مِنْ غَزْوَةِ تَبُوكَ مَعَ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "مَنْ حَبَسَهُ الْعُذْرُ عَنِ الْغَزْوِ",
                "headingUrdu": "جو شخص کسی شرعی وجہ سے جہاد سے باز آجائے",
                "headingEnglish": "Whoever is held back from Jihad by a legal cause",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2713,
                "hadithNumber": "2839",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "While the Prophet (ﷺ) was in a Ghazwa he said, \"Some people have remained behind us in Medina and we never crossed a mountain path or a valley, but they were with us (i.e. sharing the reward with us), as they have been held back by a (legal) excuse. \" Musa bin Anas and he from his father reported it to us that the prophet (ﷺ) said it . Imam Abdullah Bukhari says: The first chain is more authentic.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک غزوہ ( تبوک ) پر تھے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ کچھ لوگ مدینہ میں ہمارے پیچھے رہ گئے ہیں لیکن ہم کسی بھی گھاٹی یا وادی میں ( جہاد کے لئے ) چلیں وہ ثواب میں ہمارے ساتھ ہیں کہ وہ صرف عذر کی وجہ سے ہمارے ساتھ نہیں آ سکے ۔ اور موسیٰ نے بیان کیا کہ ہم سے حماد نے بیان کیا ‘ ان سے حمید نے ‘ ان سے موسیٰ بن انس نے اور ان سے ان کے والد نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ ابوعبداللہ امام بخاری رحمہ اللہ فرماتے ہیں کہ پہلی سند زیادہ صحیح ہے ۔",
                "urduNarrator": "امام بخاری رحمہ اللہ حدیث کی دوسری سند بیان کرتے ہیں کہ ہم سے سلیمان بن حرب نے بیان کیا ‘ کہا ہم سے حماد نے بیان کیا ‘ یہ زید کے بیٹے ہیں ‘ ان سے حمید نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ ـ هُوَ ابْنُ زَيْدٍ ـ عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ فِي غَزَاةٍ فَقَالَ ‏ \"‏ إِنَّ أَقْوَامًا بِالْمَدِينَةِ خَلْفَنَا، مَا سَلَكْنَا شِعْبًا وَلاَ وَادِيًا إِلاَّ وَهُمْ مَعَنَا فِيهِ، حَبَسَهُمُ الْعُذْرُ ‏\"‏‏.‏ وَقَالَ مُوسَى حَدَّثَنَا حَمَّادٌ، عَنْ حُمَيْدٍ، عَنْ مُوسَى بْنِ أَنَسٍ، عَنْ أَبِيهِ، قَالَ النَّبِيُّ صلى الله عليه وسلم‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ الأَوَّلُ أَصَحُّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2714,
                "hadithNumber": "2840",
                "englishNarrator": "Narrated Abu Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"Indeed, anyone who fasts for one day for Allah's Pleasure, Allah will keep his face away from the (Hell) fire for (a distance covered by a journey of) seventy years.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ‘ آپ فرماتے تھے کہ جس نے اللہ تعالیٰ کے راستے میں ( جہاد کرتے ہوئے ) ایک دن بھی روزہ رکھا اللہ تعالیٰ اسے جہنم سے ستر سال کی مسافت کی دوری تک دور کر دے گا ۔",
                "urduNarrator": "ہم سے اسحاق بن نضر نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ کہا ہم کو ابن جریج نے خبر دی ‘ کہا کہ مجھے یحییٰ بن سعیداور سہیل بن ابی صالح نے خبر دی ‘ ان دونوں حضرات نے نعمان بن ابی عیاش سے سنا ‘ انہوں نے ابو سعید خدری رضی اللہ عنہ سے ‘ آپ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ، وَسُهَيْلُ بْنُ أَبِي صَالِحٍ، أَنَّهُمَا سَمِعَا النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَعَّدَ اللَّهُ وَجْهَهُ عَنِ النَّارِ سَبْعِينَ خَرِيفًا ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ الصَّوْمِ فِي سَبِيلِ اللَّهِ",
                "headingUrdu": "اللہ کی راہ میں صوم کو دیکھنے کی فضیلت",
                "headingEnglish": "The superiority of observing Saum in Allah's Cause",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2715,
                "hadithNumber": "2841",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever spends two things in Allah's Cause, will be called by all the gate-keepers of Paradise who will be saying, 'O so-and-so! Come here.' \" Abu Bakr رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! Such persons will never be destroyed.\" The Prophet (ﷺ) said, \"I hope you will be one of them.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس شخص نے اللہ کے راستے میں ایک جوڑا ( کسی چیز کا ) خرچ کیا تو اسے جنت کے داروغہ بلائیں گے ۔ جنت کے ہر دروازے کا داروغہ ( اپنی طرف ) بلائے گا کہ اے فلاں ! اس دروازے سے آ ، اس پر ابوبکر رضی اللہ عنہ بولے یا رسول اللہ ! پھر اس شخص کو کوئی خوف نہیں رہے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا مجھے امید ہے کہ تم بھی انہیں میں سے ہو گے ۔",
                "urduNarrator": "ہم سے سعد بن حفص نے بیان کیا ‘ کہا ہم سے شیبان نے بیان کیا یحییٰ سے ‘ وہ ابوسلمہ سے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَنْفَقَ زَوْجَيْنِ فِي سَبِيلِ اللَّهِ دَعَاهُ خَزَنَةُ الْجَنَّةِ، كُلُّ خَزَنَةِ باب أَىْ فُلُ هَلُمَّ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ، ذَاكَ الَّذِي لاَ تَوَى عَلَيْهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنِّي لأَرْجُو أَنْ تَكُونَ مِنْهُمْ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ النَّفَقَةِ فِي سَبِيلِ اللَّهِ",
                "headingUrdu": "اللہ کی راہ میں خرچ کرنے کی فضیلت",
                "headingEnglish": "The Superiority of spending in Allah's Cause",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2716,
                "hadithNumber": "2842",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) ascended the pulpit and said, \"Nothing worries me as to what will happen to you after me, except the temptation of worldly blessings which will be conferred on you.\" Then he mentioned the worldly pleasures. He started with the one (i.e. the blessings) and took up the other (i.e. the pleasures). A man got up saying, \"O Allah's Messenger (ﷺ)! Can the good bring about evil?\" The Prophet (ﷺ) remained silent and we thought that he was being inspired divinely, so all the people kept silent with awe. Then the Prophet (ﷺ) wiped the sweat off his face and asked, \"Where is the present questioner?\" \"Do you think wealth is good?\" he repeated thrice, adding, \"No doubt, good produces nothing but good. Indeed it is like what grows on the banks of a stream which either kills or nearly kills the grazing animals because of gluttony except the vegetation-eating animal which eats till both its flanks are full (i.e. till it gets satisfied) and then stands in the sun and defecates and urinates and again starts grazing. This worldly property is sweet vegetation. How excellent the wealth of the Muslim is, if it is collected through legal means and is spent in Allah's Cause and on orphans, poor people and travelers. But he who does not take it legally is like an eater who is never satisfied and his wealth will be a witness against him on the Day of Resurrection.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم منبر پر تشریف لائے اور فرمایا میرے بعد تم پر دنیا کی جو برکتیں کھول دی جائیں گی ‘ میں تمہارے بارے میں ان سے ڈر رہا ہوں کہ ( کہیں تم ان میں مبتلا نہ ہو جاؤ ) اس کے بعد آپ نے دنیا کی رنگینیوں کا ذکر فرمایا ۔ پہلے دنیا کی برکات کا ذکر کیا پھر اس کی رنگینیوں کو بیان فرمایا ‘ اتنے میں ایک صحابی کھڑے ہوئے اور عرض کیا یا رسول اللہ ! کیا بھلائی برائی پیدا کر دے گی ۔ آپ اس پر تھوڑی دیر کے لئے خاموش ہو گئے ۔ ہم نے سمجھا کہ آپ صلی اللہ علیہ وسلم پر وحی نازل ہو رہی ہے ۔ سب لوگ خاموش ہو گئے جیسے ان کے سروں پر پرندے ہوں ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے چہرہ مبارک سے پسینہ صاف کیا اور دریافت فرمایا سوال کرنے والا کہاں ہے ؟ کیا یہ بھی ( مال اور دینا کی برکات ) خیر ہے ؟ تین مرتبہ آپ نے یہی جملہ دہرایا پھر فرمایا دیکھو بہار کے موسم میں جب ہری گھاس پیدا ہوتی ہے ‘ وہ جانور کو ما ر ڈالتی ہے یا مرنے کے قریب کر دیتی ہے مگر وہ جانور بچ جاتا ہے جو ہری ہری دوب چرتا ہے ‘ کوکھیں بھرتے ہی سورج کے سامنے جا کھڑا ہوتا ہے ۔ لید ‘ گوبر ‘ پیشاب کرتا ہے پھر اس کے ہضم ہو جانے کے بعد اور چرتا ہے ‘ اسی طرح یہ مال بھی ہرا بھرا اور شیریں ہے اور مسلمان کا وہ مال کتنا عمدہ ہے جسے اس نے حلال طریقوں سے جمع کیا ہو اور پھر اسے اللہ کے راستے میں ( جہاد کے لئے ) یتیموں کے لئے مسکینوں کے لئے وقف کر دیا ہو لیکن جو شخص ناجائز طریقوں سے جمع کرتا ہے تو وہ ایک ایسا کھانے والا ہے جو کبھی آسودہ نہیں ہوتا اور وہ مال قیامت کے دن اس کے خلاف گواہ بن کر آئے گا ۔",
                "urduNarrator": "ہم سے محمد بن سنان نے بیان کیا ‘ کہا کہ ہم سے فلیح نے بیان کیا ‘ ان سے ہلال نے بیان کیا ‘ ان سے عطاء بن یسار نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحٌ، حَدَّثَنَا هِلاَلٌ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ عَلَى الْمِنْبَرِ فَقَالَ ‏\"‏ إِنَّمَا أَخْشَى عَلَيْكُمْ مِنْ بَعْدِي مَا يُفْتَحُ عَلَيْكُمْ مِنْ بَرَكَاتِ الأَرْضِ ‏\"‏‏.‏ ثُمَّ ذَكَرَ زَهْرَةَ الدُّنْيَا، فَبَدَأَ بِإِحْدَاهُمَا وَثَنَّى بِالأُخْرَى، فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ أَوَيَأْتِي الْخَيْرُ بِالشَّرِّ فَسَكَتَ عَنْهُ النَّبِيُّ صلى الله عليه وسلم قُلْنَا يُوحَى إِلَيْهِ‏.‏ وَسَكَتَ النَّاسُ كَأَنَّ عَلَى رُءُوسِهِمِ الطَّيْرَ، ثُمَّ إِنَّهُ مَسَحَ عَنْ وَجْهِهِ الرُّحَضَاءَ، فَقَالَ ‏\"‏ أَيْنَ السَّائِلُ آنِفًا أَوَخَيْرٌ هُوَ ـ ثَلاَثًا ـ إِنَّ الْخَيْرَ لاَ يَأْتِي إِلاَّ بِالْخَيْرِ، وَإِنَّهُ كُلُّ مَا يُنْبِتُ الرَّبِيعُ مَا يَقْتُلُ حَبَطًا أَوْ يُلِمُّ كُلَّمَا أَكَلَتْ، حَتَّى إِذَا امْتَلأَتْ خَاصِرَتَاهَا اسْتَقْبَلَتِ الشَّمْسَ، فَثَلَطَتْ وَبَالَتْ ثُمَّ رَتَعَتْ، وَإِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ، وَنِعْمَ صَاحِبُ الْمُسْلِمِ لِمَنْ أَخَذَهُ بِحَقِّهِ، فَجَعَلَهُ فِي سَبِيلِ اللَّهِ وَالْيَتَامَى وَالْمَسَاكِينِ، وَمَنْ لَمْ يَأْخُذْهُ بِحَقِّهِ فَهْوَ كَالآكِلِ الَّذِي لاَ يَشْبَعُ، وَيَكُونُ عَلَيْهِ شَهِيدًا يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2717,
                "hadithNumber": "2843",
                "englishNarrator": "Narrated Zaid bin Khalid رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \" He who pre pares a Ghazi going in Allah's Cause is given a reward equal to that of) a Ghazi; and he who looks after properly the dependents of a Ghazi going in Allah's Cause is (given a reward equal to that of) Ghazi.\"",
                "hadithUrdu": "رسول اللہ نے فرمایا جس شخص نے اللہ کے راستے میں غزوہ کرنے والے کو ساز و سامان دیا تو وہ ( گویا ) خود غزوہ میں شریک ہوا اور جس نے خیرخواہانہ طریقہ پر غازی کے گھربار کی نگرانی کی تو وہ ( گویا ) خود غزوہ میں شریک ہوا ۔",
                "urduNarrator": "ہم سے ابو معمر نے بیان کیا ‘ کہا ہم سے عبدالوارث نے بیان کیا ‘ ہم سے حسین نے بیان کیا ‘ کہا مجھ سے یحییٰ نے بیان کیا ‘ کہا مجھ سے ابوسلمہ نے بیان کیا ‘ کہا کہ مجھ سے بسربن سعید نے بیان کیا ‘ کہا کہ مجھ سے زید بن خالد رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا الْحُسَيْنُ، قَالَ حَدَّثَنِي يَحْيَى، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، قَالَ حَدَّثَنِي بُسْرُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنِي زَيْدُ بْنُ خَالِدٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ جَهَّزَ غَازِيًا فِي سَبِيلِ اللَّهِ فَقَدْ غَزَا، وَمَنْ خَلَفَ غَازِيًا فِي سَبِيلِ اللَّهِ بِخَيْرٍ فَقَدْ غَزَا ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ مَنْ جَهَّزَ غَازِيًا أَوْ خَلَفَهُ بِخَيْرٍ",
                "headingUrdu": "اس کی برتری جو غازی کو تیار کرے یا اس کے کفیلوں کی دیکھ بھال کرے۔",
                "headingEnglish": "The superiority of the one who prepares a Ghazi or looks after his dependents",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2718,
                "hadithNumber": "2844",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) used not to enter any house in Medina except the house of Um Sulaim besides those of his wives when he was asked why, he said, \"I take pity on her as her brother was killed in my company. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم مدینہ میں اپنی بیویوں کے سوا اور کسی کے گھر نہیں جایا کرتے تھے مگر ام سلیم کے پاس جاتے ۔ آنحضرت صلی اللہ علیہ وسلم سے جب اس کے متعلق پوچھا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے اس پر رحم آتا ہے ، اس کا بھائی ( حرام بن ملحان ) میرے کام میں شہید کر دیا گیا ۔",
                "urduNarrator": "ہم سے موسیٰ نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے اسحاق بن عبداللہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا هَمَّامٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمْ يَكُنْ يَدْخُلُ بَيْتًا بِالْمَدِينَةِ غَيْرَ بَيْتِ أُمِّ سُلَيْمٍ، إِلاَّ عَلَى أَزْوَاجِهِ فَقِيلَ لَهُ، فَقَالَ ‏ \"‏ إِنِّي أَرْحَمُهَا، قُتِلَ أَخُوهَا مَعِي ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2719,
                "hadithNumber": "2845",
                "englishNarrator": "Narrated Once Musa bin Anas while describing the battle of Yamama, said:",
                "hadithEnglish": "\"Anas bin Malik رضی اللہ عنہ went to Thabit bin Qais رضی اللہ عنہ , who had lifted his clothes from his thighs and was applying Hunut to his body. Anas رضی اللہ عنہ asked, 'O Uncle! What is holding you back (from the battle)?' He replied, 'O my nephew! I am coming just now,' and went on perfuming himself with Hunut, then he came and sat (in the row). Anas رضی اللہ عنہ then mentioned that the people fled from the battle-field. On that Thabit said, 'Clear the way for me to fight the enemy. We would never do so (i.e. flee) in the company of Allah's Messenger (ﷺ). How bad the habits you have acquired from your enemies!\". Hammad has narrated it from Thabit and he from Hadrat Anas رضی اللہ عنہ .",
                "hadithUrdu": "انس بن مالک رضی اللہ عنہ ثابت بن قیس رضی اللہ عنہ کے یہاں گئے ‘ انہوں نے اپنی ران کھول رکھی تھی اور خوشبو لگا رہے تھے ۔ انس رضی اللہ عنہ نے کہا چچا اب تک آپ جنگ میں کیوں تشریف نہیں لائے ؟ انہوں نے جواب دیا کہ بیٹے ابھی آتا ہوں اور وہ پھر خوشبو لگانے لگے پھر ( کفن پہن کر تشریف لائے اور بیٹھ گئے ) مراد صف میں شرکت سے ہے ) انس رضی اللہ عنہ نے گفتگو کرتے ہوئے مسلمانوں کی طرف سے کچھ کمزوری کے آثار کا ذکر کیا تو انہوں نے فرمایا کہ ہمارے سامنے سے ہٹ جاؤ تاکہ ہم کافروں سے دست بدست لڑیں ‘ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہم ایسا کبھی نہیں کرتے تھے ۔ ( یعنی پہلی صف کے لوگ ڈٹ کر لڑتے تھے کمزوری کا ہرگز مظاہرہ نہیں ہونے دیتے تھے ) تم نے اپنے دشمنوں کو بہت بری چیز کا عادی بنا دیا ہے ( تم جنگ کے موقع پر پیچھے ہٹ گئے ) وہ حملہ کرنے لگے ۔ اس حدیث کو حماد نے ثابت سے اور انہوں نے انس رضی اللہ عنہ سے روایت کیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ‘ کہا ہم سے خالد بن حارث نے بیان کیا ‘ کہا ہم سے ابن عون نے بیان کیا ‘ ان سے موسیٰ بن انس نے بیان کیا جنگ یمامہ کا وہ ذکر کر رہے تھے ‘ بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُوسَى بْنِ أَنَسٍ، قَالَ وَذَكَرَ يَوْمَ الْيَمَامَةِ قَالَ أَتَى أَنَسٌ ثَابِتَ بْنَ قَيْسٍ وَقَدْ حَسَرَ عَنْ فَخِذَيْهِ وَهْوَ يَتَحَنَّطُ فَقَالَ يَا عَمِّ مَا يَحْبِسُكَ أَنْ لاَ تَجِيءَ قَالَ الآنَ يَا ابْنَ أَخِي‏.‏ وَجَعَلَ يَتَحَنَّطُ، يَعْنِي مِنَ الْحَنُوطِ، ثُمَّ جَاءَ فَجَلَسَ، فَذَكَرَ فِي الْحَدِيثِ انْكِشَافًا مِنَ النَّاسِ، فَقَالَ هَكَذَا عَنْ وُجُوهِنَا حَتَّى نُضَارِبَ الْقَوْمَ، مَا هَكَذَا كُنَّا نَفْعَلُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم، بِئْسَ مَا عَوَّدْتُمْ أَقْرَانَكُمْ‏.‏ رَوَاهُ حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَنَسٍ‏.‏",
                "headingArabic": "التَّحَنُّطِ عِنْدَ الْقِتَالِ",
                "headingUrdu": "جنگ کے دوران ہنوت کا اطلاق کرنا",
                "headingEnglish": "To apply Hanut during the battle",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2720,
                "hadithNumber": "2846",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Who will bring me the information about the enemy on the day (of the battle) of Al-Ahzab (i.e. Clans)?\" Az-Zubair رضی اللہ عنہ said, \"I will.\" The Prophet (ﷺ) said again, \"Who will bring me the information about the enemy?\" Az-Zubair said again, \"I will.\" The Prophet (ﷺ) said, \"Every prophet had a disciple and my disciple is Az-Zubair. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے جنگ خندق کے دن فرمایا دشمن کے لشکر کی خبر میرے پاس کون لا سکتا ہے ؟ ( دشمن سے مراد یہاں بنوقریظہ تھے ) زبیر رضی اللہ عنہ نے کہا کہ میں ۔ آپ صلی اللہ علیہ وسلم نے دوبارہ پھر پوچھا دشمن کے لشکر کی خبریں کون لا سکے گا ؟ اس مرتبہ بھی زبیر رضی اللہ عنہ نے کہا کہ میں ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہر نبی کے حواری ( سچے مددگار ) ہوتے ہیں اور میرے حواری ( زبیر ) ہیں ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ‘ کہا ہم سے سفیان ثوری نے بیان کیا ‘ ان سے محمد بن منکدر نے بیان کیا اور ان سے جابربن عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ يَأْتِينِي بِخَبَرِ الْقَوْمِ يَوْمَ الأَحْزَابِ ‏\"‏‏.‏ قَالَ الزُّبَيْرُ أَنَا‏.‏ ثُمَّ قَالَ ‏\"‏ مَنْ يَأْتِينِي بِخَبَرِ الْقَوْمِ ‏\"‏‏.‏ قَالَ الزُّبَيْرُ أَنَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ لِكُلِّ نَبِيٍّ حَوَارِيًّا، وَحَوَارِيَّ الزُّبَيْرُ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ الطَّلِيعَةِ",
                "headingUrdu": "دشمن کی خبرلانےوالےدستہ کی برتری",
                "headingEnglish": "The superiority of the reconnoitrer",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2721,
                "hadithNumber": "2847",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "When the Prophet (ﷺ) called the people (Sadqa, a sub-narrator, said, 'Most probably that happened on the day of Al-Khandaq) Az-Zubair رضی اللہ عنہ responded to the call (i.e. to act as a reconnoiter). The Prophet) called the people again and Az-Zubair           رضی اللہ عنہ responded to the call. The Prophet (ﷺ) then said, \"Every prophet had a disciple and my disciple is Zubair bin Al-`Awwam   رضی اللہ عنہ.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے صحابہ کو ( بنی قریظہ کی طرف خبر لانے کے لئے ) دعوت دی ۔ صدقہ ( امام بخاری رحمہ اللہ کے استاد ) نے کہا کہ میرا خیال ہے یہ غزوہ خندق کا واقعہ ہے ۔ تو زبیر رضی اللہ عنہ نے اس پر لبیک کہا پھر آپ صلی اللہ علیہ وسلم نے بلایا اور زبیر رضی اللہ عنہ نے لبیک کہا پھر تیسری بار آپ صلی اللہ علیہ وسلم نے بلایا اور اس مرتبہ بھی زبیر رضی اللہ عنہ نے لبیک کہا ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا ہر نبی کے حواری ہوتے ہیں اور میرے حواری زبیر بن عوام ہیں ( رضی اللہ عنہ ) ۔",
                "urduNarrator": "ہم سے صدقہ نے بیان کیا ‘ کہا ہم کو ابن عیینہ نے خبر دی ‘ کہا ہم سے ابن منکدر نے بیان کیا ‘ انہوں نے جابر بن عبداللہ رضی اللہ عنہ  سے سنا ‘ انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، حَدَّثَنَا ابْنُ الْمُنْكَدِرِ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ نَدَبَ النَّبِيُّ صلى الله عليه وسلم النَّاسَ ـ قَالَ صَدَقَةُ أَظُنُّهُ ـ يَوْمَ الْخَنْدَقِ فَانْتَدَبَ الزُّبَيْرُ، ثُمَّ نَدَبَ فَانْتَدَبَ الزُّبَيْرُ، ثُمَّ نَدَبَ النَّاسَ فَانْتَدَبَ الزُّبَيْرُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ لِكُلِّ نَبِيٍّ حَوَارِيًّا، وَإِنَّ حَوَارِيَّ الزُّبَيْرُ بْنُ الْعَوَّامِ ‏\"‏‏.‏",
                "headingArabic": "هَلْ يُبْعَثُ الطَّلِيعَةُ وَحْدَهُ",
                "headingUrdu": "کیا کھوج لگانے والے کو اکیلے بھیجا جا سکتا ہے؟",
                "headingEnglish": "Can the reconnoitrer be sent alone?",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2722,
                "hadithNumber": "2848",
                "englishNarrator": "Narrated Malik bin Al-Huwairith رضی اللہ عنہ :",
                "hadithEnglish": "On my departure from the Prophet (ﷺ) he said to me and to a friend of mine, \"You two, pronounce the Adhan and the Iqama for the prayer and let the elder of you lead the prayer.\"",
                "hadithUrdu": "جب ہم نبی کریم صلی اللہ علیہ وسلم کے یہاں سے وطن کے لئے واپس لوٹے تو آپ صلی اللہ علیہ وسلم نے ہم سے فرمایا ایک میں تھا اور دوسرے میرے ساتھی ‘ ( ہر نماز کے وقت ) اذان پکارنا اور اقامت کہنا اور تم دونوں میں جو بڑا ہو وہ نماز پڑھائے ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ‘ کہا ہم سے ابو شہاب نے بیان کیا ‘ ان سے خالد حذاء نے ‘ ان سے ابوقلابہ نے اور ان سے مالک بن حویرث رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو شِهَابٍ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ، قَالَ انْصَرَفْتُ مِنْ عِنْدِ النَّبِيِّ صلى الله عليه وسلم، فَقَالَ لَنَا أَنَا وَصَاحِبٌ لِي ‏ \"‏ أَذِّنَا وَأَقِيمَا، وَلْيَؤُمَّكُمَا أَكْبَرُكُمَا ‏\"‏‏.‏",
                "headingArabic": "سَفَرِ الاِثْنَيْنِ",
                "headingUrdu": "دو افراد کا ایک ساتھ سفر کرنا",
                "headingEnglish": "The travelling of two persons together",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2723,
                "hadithNumber": "2849",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Good will remain (as a permanent quality) in the foreheads of horses till the Day of Resurrection.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا قیامت تک گھوڑے کی پیشانی کے ساتھ خیر و برکت وابستہ رہے گی ( کیونکہ اس سے جہاد میں کام لیا جاتا رہے گا ) ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْخَيْلُ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏",
                "headingArabic": "الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ",
                "headingUrdu": "نیکی گھوڑوں کی پیشانی میں رہے گی۔",
                "headingEnglish": "Good will remain in the forelocks of horses",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2724,
                "hadithNumber": "2850",
                "englishNarrator": "Narrated Urwa bin Ja'd رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Good will remain (as a permanent quality) in the foreheads of horses till the Day of Resurrection.\" Sulaiman also reported it from Shobah, Hadrat Urwah bin Abu Al-Ja'd رضی اللہ عنہ . Musaddad corroborated him from Hoshaim, Husain, Shabi and Urwah bin Abi Al-Ja'd.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا قیامت تک گھوڑے کی پیشانی کے ساتھ خیر و برکت بندھی رہے گی ۔ سلیمان نے شعبہ کے واسطہ سے بیان کیا کہ ان سے عروہ بن ابی الجعد رضی اللہ عنہ نے اس روایت کی متابعت ( جس میں بجائے ابن الجعد کے ابن ابی الجعد ہے ) مسدد نے ہشیم سے کی ، ان سے حصین نے ، ان سے شعبی نے اور ان سے عروہ ابن ابی الجعد نے ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے حصین اور ابن ابی السفر نے ، ان سے شعبی نے اور ان سے عروہ بن جعد رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ حُصَيْنٍ، وَابْنِ أَبِي السَّفَرِ، عَنِ الشَّعْبِيِّ، عَنْ عُرْوَةَ بْنِ الْجَعْدِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏ قَالَ سُلَيْمَانُ عَنْ شُعْبَةَ عَنْ عُرْوَةَ بْنِ أَبِي الْجَعْدِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2725,
                "hadithNumber": "2851",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) (ﷺ) said, \"There is a blessing in the fore-heads of horses.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا گھوڑے کی پیشانی میں برکت بندھی ہوئی ہے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے شعبہ نے ، ان سے ابوالتیاح نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْبَرَكَةُ فِي نَوَاصِي الْخَيْلِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2726,
                "hadithNumber": "2852",
                "englishNarrator": "Narrated `Urwa Al-Bariqi رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Good will remain (as a permanent quality) in the foreheads of horses (for Jihad) till the Day of Resurrection, for they bring about either a reward (in the Hereafter) or (war) booty (in this world).\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا خیر و برکت قیامت تک گھوڑے کی پیشانی کے ساتھ بندھی رہے گی یعنی آخرت میں ثواب اور دنیا میں مال غنیمت ملتا رہے گا ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے زکریا نے بیان کیا ، کہا ہم سے عامر نے ، کہا ہم سے عروہ بارقی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، حَدَّثَنَا عُرْوَةُ الْبَارِقِيُّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ الأَجْرُ وَالْمَغْنَمُ ‏\"‏‏.‏",
                "headingArabic": "الْجِهَادُ مَاضٍ مَعَ الْبَرِّ وَالْفَاجِرِ",
                "headingUrdu": "جہاد اس بات پر کرنا ہے کہ مسلمان حکمران اچھا ہو یا برا",
                "headingEnglish": "Jihad is to be carried on whether the Muslim ruler is good or bad",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2727,
                "hadithNumber": "2853",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If somebody keeps a horse in Allah's Cause motivated by his faith in Allah and his belief in His Promise, then he will be rewarded on the Day of Resurrection for what the horse has eaten or drunk and for its dung and urine.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس شخص نے اللہ تعالیٰ پر ایمان کے ساتھ اور اس کے وعدہ ثواب کو جانتے ہوئے اللہ کے راستے میں ( جہاد کے لیے ) گھوڑا پالا تو اس گھوڑے کا کھانا ، پینا اور اس کا پیشاب و لید سب قیامت کے دن اس کی ترازو میں ہو گا اور سب پر اس کو ثواب ملے گا ۔",
                "urduNarrator": "ہم سے علی بن حفص نے بیان کیا ، کہا ہم سے امام عبداللہ بن المبارک نے بیان کیا ، کہا مجھ کو طلحہ بن ابی سعید نے خبر دی ، کہا کہ میں نے سعید مقبری سے سنا ، وہ بیان کرتے تھے کہ انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، أَخْبَرَنَا طَلْحَةُ بْنُ أَبِي سَعِيدٍ، قَالَ سَمِعْتُ سَعِيدًا الْمَقْبُرِيَّ، يُحَدِّثُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنِ احْتَبَسَ فَرَسًا فِي سَبِيلِ اللَّهِ إِيمَانًا بِاللَّهِ وَتَصْدِيقًا بِوَعْدِهِ، فَإِنَّ شِبَعَهُ وَرِيَّهُ وَرَوْثَهُ وَبَوْلَهُ فِي مِيزَانِهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
                "headingArabic": "مَنِ احْتَبَسَ فَرَسًا لِقَوْلِهِ تَعَالَى: {وَمِنْ رِبَاطِ الْخَيْلِ}",
                "headingUrdu": "جہاد کے لیے گھوڑا رکھنا",
                "headingEnglish": "Keeping a horse for Jihad",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 2701,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=108",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=106",
                "label": "106",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=107",
                "label": "107",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=108",
                "label": "108",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=109",
                "label": "109",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=110",
                "label": "110",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=111",
                "label": "111",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=112",
                "label": "112",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=110",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=110",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=108",
        "to": 2725,
        "total": 40465
    }
}