{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 94,
        "data": [
            {
                "id": 2327,
                "hadithNumber": "2435",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"An animal should not be milked without the permission of its owner. Does any of you like that somebody comes to his store and breaks his container and takes away his food? The udders of the animals are the stores of their owners where their provision is kept, so nobody should milk the animals of somebody else, without the permission of its owner.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، کوئی شخص کسی دوسرے کے دودھ کے جانور کو مالک کی اجازت کے بغیر نہ دوہے ۔ کیا کوئی شخص یہ پسند کرے گا کہ ایک غیر شخص اس کے گودام میں پہنچ کر اس کا ذخیرہ کھولے اور وہاں سے اس کا غلہ چرا لائے ، لوگوں کے مویشی کے تھن بھی ان کے لیے کھانا یعنی ( دودھ کے ) گودا م ہیں ۔ اس لیے انہیں بھی مالک کی اجازت کے بغیر نہ دودھا جائے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی نافع سے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَحْلُبَنَّ أَحَدٌ مَاشِيَةَ امْرِئٍ بِغَيْرِ إِذْنِهِ، أَيُحِبُّ أَحَدُكُمْ أَنْ تُؤْتَى مَشْرُبَتُهُ فَتُكْسَرَ خِزَانَتُهُ، فَيُنْتَقَلَ طَعَامُهُ فَإِنَّمَا تَخْزُنُ لَهُمْ ضُرُوعُ مَوَاشِيهِمْ أَطْعِمَاتِهِمْ، فَلاَ يَحْلُبَنَّ أَحَدٌ مَاشِيَةَ أَحَدٍ إِلاَّ بِإِذْنِهِ ‏\"‏‏.‏",
                "headingArabic": "لاَ تُحْتَلَبُ مَاشِيَةُ أَحَدٍ بِغَيْرِ إِذْنٍهِ",
                "headingUrdu": "کسی جانور کو اس کے مالک کی اجازت کے بغیر دودھ نہیں دیا جا سکتا",
                "headingEnglish": "No animal may be milked without the permission of its owner",
                "chapterId": "46",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 46,
                    "chapterNumber": "46",
                    "chapterEnglish": "Lost Things Picked up by Someone (Luqatah)",
                    "chapterUrdu": "لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
                    "chapterArabic": "كتاب اللقطة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2328,
                "hadithNumber": "2436",
                "englishNarrator": "Narrated Zaid bin Khalid Al-Juhani رضی اللہ عنہ :",
                "hadithEnglish": "A man asked Allah's Messenger (ﷺ) about the Luqata. He said, \"Make public announcement of it for one year, then remember the description of its container and the string it is tied with, utilize the money, and if its owner comes back after that, give it to him.\" The people asked, \"O Allah's Messenger (ﷺ)! What about a lost sheep?\" Allah's Messenger (ﷺ) said, \"Take it, for it is for you, for your brother, or for the wolf.\" The man asked, \"O Allah's Messenger (ﷺ)! What about a lost camel?\" Allah's Messenger (ﷺ) got angry and his cheeks or face became red, and said, \"You have no concern with it as it has its feet, and its watercontainer, till its owner finds it.\"",
                "hadithUrdu": "ایک شخص نے رسول کریم صلی اللہ علیہ وسلم سے لقطہٰ کے بارے میں پوچھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کا اعلان کرتا رہ ۔ پھر اس کے بندھن اور برتن کی بناوٹ کو ذہن میں یاد رکھ ۔ اور اسے اپنی ضروریات میں خرچ کر ۔ اس کا مالک اگر اس کے بعد آئے تو اسے واپس کر دے ۔ صحابہ رضی اللہ عنہم نے پوچھا یا رسول اللہ ! راستہ بھولی ہوئی بکری کا کیا کیا جائے ؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے پکڑ لو ، کیونکہ وہ یا تمہاری ہو گی یا تمہارے بھائی کی ہو گی یا پھر بھیڑیئے کی ہو گی ۔ صحابہ نے پوچھا ، یا رسول اللہ ! راستہ بھولے ہوئے اونٹ کا کیا کیا جائے ؟ آپ اس پر غصہ ہو گئے اور چہرہ مبارک سرخ ہو گیا ( یا راوی نے وجنتاہ کے بجائے ) احمر وجہہ کہا ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا ، تمہیں اس سے کیا مطلب ؟ اس کے ساتھ خود اس کے کھر اور اس کا مشکیزہ ہے ۔ اسی طرح اسے اس کا اصل مالک مل جائے گا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے ربیعہ بن عبدالرحمٰن نے ، ان سے منبعث کے غلام یزید نے ، اور ان سے زید بن خالد جہنی رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ ـ رضى الله عنه ـ أَنَّ رَجُلاً سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ اللُّقَطَةِ قَالَ ‏\"‏ عَرِّفْهَا سَنَةً، ثُمَّ اعْرِفْ وِكَاءَهَا وَعِفَاصَهَا، ثُمَّ اسْتَنْفِقْ بِهَا، فَإِنْ جَاءَ رَبُّهَا فَأَدِّهَا إِلَيْهِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ فَضَالَّةُ الْغَنَمِ قَالَ ‏\"‏ خُذْهَا فَإِنَّمَا هِيَ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ، فَضَالَّةُ الإِبِلِ قَالَ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى احْمَرَّتْ وَجْنَتَاهُ ـ أَوِ احْمَرَّ وَجْهُهُ ـ ثُمَّ قَالَ ‏\"‏ مَا لَكَ وَلَهَا، مَعَهَا حِذَاؤُهَا وَسِقَاؤُهَا، حَتَّى يَلْقَاهَا رَبُّهَا ‏\"‏‏.‏",
                "headingArabic": "إِذَا جَاءَ صَاحِبُ اللُّقَطَةِ بَعْدَ سَنَةٍ رَدَّهَا عَلَيْهِ، لأَنَّهَا وَدِيعَةٌ عِنْدَهُ",
                "headingUrdu": "اگر کھوئی ہوئی جائیداد کا مالک ایک سال بعد واپس آجائے",
                "headingEnglish": "If the owner of lost property comes back after a year",
                "chapterId": "46",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 46,
                    "chapterNumber": "46",
                    "chapterEnglish": "Lost Things Picked up by Someone (Luqatah)",
                    "chapterUrdu": "لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
                    "chapterArabic": "كتاب اللقطة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2329,
                "hadithNumber": "2437",
                "englishNarrator": "Narrated Suwaid bin Ghafala:",
                "hadithEnglish": "While I as in the company of Salman bin Rabi`a and Suhan, in one of the holy battles, I found a whip. One of them told me to drop it but I refused to do so and said that I would give it to its owner if I found him, otherwise I would utilize it. On our return we performed Hajj and on passing by Medina, I asked Ubai bin Ka`b about it. He said, \"I found a bag containing a hundred Dinars in the lifetime of the Prophet (ﷺ) and took it to the Prophet (ﷺ) who said to me, 'Make public announcement about it for one year.' So, I announced it for one year and went to the Prophet (ﷺ) who said, 'Announce it publicly for another year.' So, I announced it for another year. I went to him again and he said, \"Announce for an other year.\" So I announced for still another year. I went to the Prophet (ﷺ) for the fourth time, and he said, 'Remember the amount of money, the description of its container and the string it is tied with, and if the owner comes, give it to him; otherwise, utilize it.' \"\r\nSalama narrated the above narration from Ubai bin Ka`b: adding, \"I met the sub-narrator at Makkah later on, but he did not remember whether Ka`b had announced what he had found for one year or three years.\"",
                "hadithUrdu": "میں سلمان بن ربیعہ اور زید بن صوحان کے ساتھ ایک جہاد میں شریک تھا ۔ میں نے ایک کوڑا پایا ( اور اس کو اٹھا لیا ) دونوں میں سے ایک نے مجھ سے کہا کہ اسے پھینک دے ۔ میں نے کہا کہ ممکن ہے مجھے اس کا مالک مل جائے ۔ ( تو اس کو دے دوں گا ) ورنہ خود اس سے نفع اٹھاؤں گا ۔ جہاد سے واپس ہونے کے بعد ہم نے حج کیا ۔ جب میں مدینے گیا تو میں نے ابی بن کعب رضی اللہ عنہ سے اس کے بارے میں پوچھا ، انہوں نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں مجھ کو ایک تھیلی مل گئی تھی ۔ جس میں سو دینار تھے ۔ میں اسے لے کر آنحضرت صلی اللہ علیہ وسلم کی خدمت میں گیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کا اعلان کرتا رہ ، میں نے ایک سال تک اس کا اعلان کیا اور پھر حاضر ہوا ۔ ( کہ مالک ابھی تک نہیں ملا ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اور اعلان کر ، میں نے ایک سال تک اس کا پھر اعلان کیا ، اور حاضر خدمت ہوا ۔ اس مرتبہ بھی آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کا پھر اعلان کر ، میں نے پھر ایک سال تک اعلان کیا اور جب چوتھی مرتبہ حاضر ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ رقم کے عدد ، تھیلی کا بندھن ، اور اس کی ساخت کو خیال میں رکھ ، اگر اس کا مالک مل جائے تو اسے دیدے ورنہ اسے اپنی ضروریات میں خرچ کر ۔\r\nہم سے عبدان نے بیان کیا کہا کہ مجھے میرے باپ نے خبر دی شعبہ سے اور انہیں سلمہ نے یہی حدیث ، شعبہ نے بیان کیا کہ پھر اس کے بعد مکہ میں سلمہ سے ملا ، تو انہوں نے کہا کہ مجھے خیال نہیں ( اس حدیث میں سوید نے ) تین سال تک بتلانے کا ذکر کیا تھا یا ایک سال کا ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے سلمہ بن کہیل نے بیان کیا کہ میں نے سوید بن غفلہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، قَالَ سَمِعْتُ سُوَيْدَ بْنَ غَفَلَةَ، قَالَ كُنْتُ مَعَ سَلْمَانَ بْنِ رَبِيعَةَ، وَزَيْدِ بْنِ صُوحَانَ فِي غَزَاةٍ، فَوَجَدْتُ سَوْطًا‏.‏ فَقَالَ لِي أَلْقِهِ‏.‏ قُلْتُ لاَ، وَلَكِنْ إِنْ وَجَدْتُ صَاحِبَهُ، وَإِلاَّ اسْتَمْتَعْتُ بِهِ‏.‏ فَلَمَّا رَجَعْنَا حَجَجْنَا فَمَرَرْتُ بِالْمَدِينَةِ، فَسَأَلْتُ أُبَىَّ بْنَ كَعْبٍ ـ رضى الله عنه ـ فَقَالَ وَجَدْتُ صُرَّةً عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم فِيهَا مِائَةُ دِينَارٍ، فَأَتَيْتُ بِهَا النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً ‏\"‏‏.‏ فَعَرَّفْتُهَا حَوْلاً ثُمَّ أَتَيْتُ، فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً ‏\"‏‏.‏ فَعَرَّفْتُهَا حَوْلاً ثُمَّ أَتَيْتُهُ، فَقَالَ ‏\"‏ عَرِّفْهَا حَوْلاً ‏\"‏‏.‏ فَعَرَّفْتُهَا حَوْلاً ثُمَّ أَتَيْتُهُ الرَّابِعَةَ فَقَالَ ‏\"‏ اعْرِفْ عِدَّتَهَا وَوِكَاءَهَا وَوِعَاءَهَا، فَإِنْ جَاءَ صَاحِبُهَا وَإِلاَّ اسْتَمْتِعْ بِهَا ‏\"‏‏.‏\r\nحَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ سَلَمَةَ، بِهَذَا قَالَ فَلَقِيتُهُ بَعْدُ بِمَكَّةَ، فَقَالَ لاَ أَدْرِي أَثَلاَثَةَ أَحْوَالٍ أَوْ حَوْلاً وَاحِدًا‏.‏",
                "headingArabic": "هَلْ يَأْخُذُ اللُّقَطَةَ وَلاَ يَدَعُهَا تَضِيعُ، حَتَّى لاَ يَأْخُذَهَا مَنْ لاَ يَسْتَحِقُّ",
                "headingUrdu": "کیا کوئی گری ہوئی چیز اٹھا لے؟",
                "headingEnglish": "Should one pick up a fallen thing?",
                "chapterId": "46",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 46,
                    "chapterNumber": "46",
                    "chapterEnglish": "Lost Things Picked up by Someone (Luqatah)",
                    "chapterUrdu": "لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
                    "chapterArabic": "كتاب اللقطة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2331,
                "hadithNumber": "2438",
                "englishNarrator": "Narrated Zaid bin Khalid رضی اللہ عنہ :",
                "hadithEnglish": "A bedouin asked the Prophet (ﷺ) about the Luqata. The Prophet (ﷺ) said, \"Make public announcement about it for one year and if then somebody comes and describes the container of the Luqata and the string it was tied with, (give it to him); otherwise, spend it.\" He then asked the Prophet (ﷺ) about a lost camel. The face of the Prophet (ﷺ) become red and he said, \"You have o concern with it as it has its water reservoir and feet and it will reach water and drink and eat trees. Leave it till its owner finds it.\" He then asked the Prophet (ﷺ) about a lost sheep. The Prophet (ﷺ) said, \"It is for you, for your brother, or for the wolf.\"",
                "hadithUrdu": "ایک دیہاتی نے رسول اللہ صلی اللہ علیہ وسلم سے لقطہٰ کے متعلق پوچھا ، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک سال تک اس کا اعلان کرتا رہ ، اگر کوئی ایسا شخص آ جائے جو اس کی بناوٹ اور بندھن کے بارے میں صحیح صحیح بتائے ( تو اسے دیدے ) ورنہ اپنی ضروریات میں اسے خرچ کر ۔ انہوں نے جب ایسے اونٹ کے متعلق بھی پوچھا جو راستہ بھول گیا ہو ۔ تو آپ کے چہرہ مبارک کا رنگ بدل گیا اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں اس سے کیا مطلب ؟ اس کے ساتھ اس کا مشکیزہ اور اس کے کھر موجود ہیں ۔ وہ خود پانی تک پہنچ سکتا ہے ۔ اور درخت کے پتے کھا سکتا ہے اور اس طرح وہ اپنے مالک تک پہنچ سکتا ہے ۔ انہوں نے راستہ بھولی ہوئی بکری کے متعلق بھی پوچھا ، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ یا وہ تمہاری ہو گی یا تمہارے بھائی ( اصل مالک ) کو مل جائے گی ۔ ورنہ اسے بھیڑیا اٹھا لے جائے گا ۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ربیعہ سے ، ان سے منبعث کے غلام یزید نے ، اور ان سے زید بن خالد رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ رَبِيعَةَ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ ـ رضى الله عنه ـ أَنَّ أَعْرَابِيًّا، سَأَلَ النَّبِيَّ صلى الله عليه وسلم عَنِ اللُّقَطَةِ قَالَ ‏\"‏ عَرِّفْهَا سَنَةً، فَإِنْ جَاءَ أَحَدٌ يُخْبِرُكَ بِعِفَاصِهَا وَوِكَائِهَا، وَإِلاَّ فَاسْتَنْفِقْ بِهَا ‏\"‏‏.‏ وَسَأَلَهُ عَنْ ضَالَّةِ الإِبِلِ فَتَمَعَّرَ وَجْهُهُ، قَالَ ‏\"‏ مَا لَكَ وَلَهَا مَعَهَا سِقَاؤُهَا وَحِذَاؤُهَا، تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ، دَعْهَا حَتَّى يَجِدَهَا رَبُّهَا ‏\"‏‏.‏ وَسَأَلَهُ عَنْ ضَالَّةِ الْغَنَمِ‏.‏ فَقَالَ ‏\"‏ هِيَ لَكَ أَوْ لأَخِيكَ، أَوْ لِلذِّئْبِ ‏\"‏‏.‏",
                "headingArabic": "مَنْ عَرَّفَ اللُّقَطَةَ، وَلَمْ يَدْفَعْهَا إِلَى السُّلْطَانِ",
                "headingUrdu": "جس نے بھی عوام میں لوقاتا کا اعلان کیا۔",
                "headingEnglish": "Whoever announced the Luqata in public",
                "chapterId": "46",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 46,
                    "chapterNumber": "46",
                    "chapterEnglish": "Lost Things Picked up by Someone (Luqatah)",
                    "chapterUrdu": "لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
                    "chapterArabic": "كتاب اللقطة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2332,
                "hadithNumber": "2439",
                "englishNarrator": "Narrated Abu Bakr رضی اللہ عنہ :",
                "hadithEnglish": "While I was on my way, all of a sudden I saw a shepherd driving his sheep, I asked him whose servant he was. He replied that he was the servant of a man from Quraish, and then he mentioned his name and I recognized him. I asked, \"Do your sheep have some milk?\" He replied in the affirmative. I said, \"Are you going to milk for me?\" He replied in the affirmative. I ordered him and he tied the legs of one of the sheep. Then I told him to clean the udder (teats) of dust and to remove dust off his hands. He removed the dust off his hands by clapping his hands. He then milked a little milk. I put the milk for Allah's Messenger (ﷺ) in a pot and closed its mouth with a piece of cloth and poured water over it till it became cold. I took it to the Prophet (ﷺ) and said, \"Drink, O Allah's Messenger (ﷺ)!\" He drank it till I was pleased.",
                "hadithUrdu": "( ہجرت کر کے مدینہ جاتے وقت ) میں نے تلاش کیا تو مجھے ایک چرواہا ملا جو اپنی بکریاں چرا رہا تھا ۔ میں نے اس سے پوچھا کہ تم کس کے چرواہے ہو ؟ اس نے کہا کہ قریش کے ایک شخص کا ۔ اس نے قریشی کا نام بھی بتایا ، جسے میں جانتا تھا ۔ میں نے اس سے پوچھا کیا تمہارے ریوڑ کی بکریوں میں دودھ بھی ہے ؟ اس نے کہا کہ ہاں ! میں نے اس سے کہا کیا تم میرے لیے دودھ دوہ لو گے ؟ اس نے کہا ، ہاں ضرور ! چنانچہ میں نے اس سے دوہنے کے لیے کہا ۔ وہ اپنے ریوڑ سے ایک بکری پکڑ لایا ۔ پھر میں نے اس سے بکری کا تھن گردوغبار سے صاف کرنے کے لیے کہا ۔ پھر میں نے اس سے اپنا ہاتھ صاف کرنے کے لیے کہا ۔ اس نے ویسا ہی کیا ۔ ایک ہاتھ کو دوسرے پر مار کر صاف کر لیا ۔ اور ایک پیالہ دودھ دوہا ۔ رسول اللہ صلی اللہ علیہ وسلم کے لیے میں نے ایک برتن ساتھ لیا تھا ۔ جس کے منہ پر کپڑا بندھا ہوا تھا ۔ میں نے پانی دودھ پر بہایا ۔ جس سے اس کا نچلا حصہ ٹھنڈا ہو گیا پھر دودھ لے کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ اور عرض کیا کہ دودھ حاضر ہے ۔ یا رسول اللہ ! پی لیجئے ، آپ نے اسے پیا ، یہاں تک کہ میں خوش ہو گیا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، کہا کہ ہم کو نضر نے خبر دی ، کہا کہ ہم کو اسرائیل نے خبر دی ابواسحاق سے کہ مجھے براء بن عازب رضی اللہ عنہ نے ابوبکر رضی اللہ عنہ سے خبر دی ( دوسری سند ) ہم سے عبداللہ بن رجاء نے بیان کیا ، کہا کہ ہم سے اسرائیل نے بیان کیا ابواسحاق سے ، اور انہوں نے ابوبکر رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ، أَخْبَرَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، قَالَ أَخْبَرَنِي الْبَرَاءُ، عَنْ أَبِي بَكْرٍ ـ رضى الله عنهما ـ‏.‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، عَنْ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَ انْطَلَقْتُ، فَإِذَا أَنَا بِرَاعِي غَنَمٍ يَسُوقُ غَنَمَهُ فَقُلْتُ لِمَنْ أَنْتَ قَالَ لِرَجُلٍ مِنْ قُرَيْشٍ‏.‏ فَسَمَّاهُ فَعَرَفْتُهُ‏.‏ فَقُلْتُ هَلْ فِي غَنَمِكَ مِنْ لَبَنٍ فَقَالَ نَعَمْ‏.‏ فَقُلْتُ هَلْ أَنْتَ حَالِبٌ لِي قَالَ نَعَمْ‏.‏ فَأَمَرْتُهُ فَاعْتَقَلَ شَاةً مِنْ غَنَمِهِ، ثُمَّ أَمَرْتُهُ أَنْ يَنْفُضَ ضَرْعَهَا مِنَ الْغُبَارِ، ثُمَّ أَمَرْتُهُ أَنْ يَنْفُضَ كَفَّيْهِ، فَقَالَ هَكَذَا ـ ضَرَبَ إِحْدَى كَفَّيْهِ بِالأُخْرَى ـ فَحَلَبَ كُثْبَةً مِنْ لَبَنٍ وَقَدْ جَعَلْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِدَاوَةً عَلَى فَمِهَا خِرْقَةٌ، فَصَبَبْتُ عَلَى اللَّبَنِ، حَتَّى بَرَدَ أَسْفَلُهُ، فَانْتَهَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقُلْتُ اشْرَبْ يَا رَسُولَ اللَّهِ‏.‏ فَشَرِبَ حَتَّى رَضِيتُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "46",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 46,
                    "chapterNumber": "46",
                    "chapterEnglish": "Lost Things Picked up by Someone (Luqatah)",
                    "chapterUrdu": "لقطہ یعنی گری پڑی چیزوں کے بارے میں احکام",
                    "chapterArabic": "كتاب اللقطة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2333,
                "hadithNumber": "2440",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"When the believers pass safely over (the bridge across) Hell, they will be stopped at a bridge in between Hell and Paradise where they will retaliate upon each other for the injustices done among them in the world, and when they get purified of all their sins, they will be admitted into Paradise. By Him in Whose Hands the life of Muhammad is everybody will recognize his dwelling in Paradise better than he recognizes his dwelling in this world.\" Yunus bin Muhammad narrated that Shaiban narrated from us, Qatadah narrated from him and Abul Mutawakkil narrated from him.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، جب مومنوں کو دوزخ سے نجات مل جائے گی تو انہیں ایک پل پر جو جنت اور دوزخ کے درمیان ہو گا روک لیا جائے گا اور وہیں ان کے مظالم کا بدلہ دے دیا جائے گا ۔ جو وہ دنیا میں باہم کرتے تھے ۔ پھر جب پاک صاف ہو جائیں گے تو انہیں جنت میں داخلہ کی اجازت دی جائے گی ۔ اس ذات کی قسم ! جس کے ہاتھ میں محمد کی جان ہے ، ان میں سے ہر شخص اپنے جنت کے گھر کو اپنے دنیا کے گھر سے بھی بہتر طور پر پہچانے گا ۔ یونس بن محمد نے بیان کیا کہ ہم سے شیبان نے بیان کیا ، ان سے قتادہ نے اور ان سے ابوالمتوکل نے بیان کیا ۔",
                "urduNarrator": "ہم سے اسحٰق بن ابراہیم نے بیان کیا ، انہوں نے کہا کہ ہم کو معاذ بن ہشام نے خبر دی ، انہوں نے کہا کہ ہم سے ان کے باپ نے بیان کیا ، ان سے قتادہ نے ، ان سے ابوالمتوکل ناجی نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا خَلَصَ الْمُؤْمِنُونَ مِنَ النَّارِ حُبِسُوا بِقَنْطَرَةٍ بَيْنَ الْجَنَّةِ وَالنَّارِ، فَيَتَقَاصُّونَ مَظَالِمَ كَانَتْ بَيْنَهُمْ فِي الدُّنْيَا، حَتَّى إِذَا نُقُّوا وَهُذِّبُوا أُذِنَ لَهُمْ بِدُخُولِ الْجَنَّةِ، فَوَالَّذِي نَفْسُ مُحَمَّدٍ صلى الله عليه وسلم بِيَدِهِ لأَحَدُهُمْ بِمَسْكَنِهِ فِي الْجَنَّةِ أَدَلُّ بِمَنْزِلِهِ كَانَ فِي الدُّنْيَا ‏\"‏‏.‏ وَقَالَ يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا شَيْبَانُ عَنْ قَتَادَةَ حَدَّثَنَا أَبُو الْمُتَوَكِّلِ‏.‏",
                "headingArabic": "قِصَاصِ الْمَظَالِمِ",
                "headingUrdu": "انتقام (قیامت کے دن)",
                "headingEnglish": "Retaliation (on the Day of Judgement)",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2334,
                "hadithNumber": "2441",
                "englishNarrator": "Narrated Safwan bin Muhriz Al-Mazini:",
                "hadithEnglish": "While I was walking with Ibn `Umar رضی اللہ عنہما holding his hand, a man came in front of us and asked, \"What have you heard from Allah's Messenger (ﷺ) about An-Najwa?\" Ibn `Umar said, \"I heard Allah's Messenger (ﷺ) saying, 'Allah will bring a believer near Him and shelter him with His Screen and ask him: Did you commit such-and-such sins? He will say: Yes, my Lord. Allah will keep on asking him till he will confess all his sins and will think that he is ruined. Allah will say: 'I did screen your sins in the world and I forgive them for you today', and then he will be given the book of his good deeds. Regarding infidels and hypocrites (their evil acts will be exposed publicly) and the witnesses will say: These are the people who lied against their Lord. Behold! The Curse of Allah is upon the wrongdoers.\" (11.18)",
                "hadithUrdu": "میں عبداللہ بن عمر رضی اللہ عنہما کے ہاتھ میں ہاتھ دیئے جا رہا تھا ۔ کہ ایک شخص سامنے آیا اور پوچھا رسول کریم صلی اللہ علیہ وسلم سے آپ نے ( قیامت میں اللہ اور بندے کے درمیان ہونے والی ) سرگوشی کے بارے میں کیا سنا ہے ؟ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ۔ آپ فرماتے تھے کہ اللہ تعالیٰ مومن کو اپنے نزدیک بلا لے گا اور اس پر اپنا پردہ ڈال دے گا اور اسے چھپا لے گا ۔ اللہ تعالیٰ اس سے فرمائے گا کیا تجھ کو فلاں گناہ یاد ہے ؟ کیا فلاں گناہ تجھ کو یاد ہے ؟ وہ مومن کہے گا ہاں ، اے میرے پروردگار ۔ آخر جب وہ اپنے گناہوں کا اقرار کر لے گا اور اسے یقین آ جائے گا کہ اب وہ ہلاک ہوا تو اللہ تعالیٰ فرمائے گا کہ میں نے دنیا میں تیرے گناہوں پر پردہ ڈالا ۔ اور آج بھی میں تیری مغفرت کرتا ہوں ، چنانچہ اسے اس کی نیکیوں کی کتاب دے دی جائے گی ، لیکن کافر اور منافق کے متعلق ان پر گواہ ( ملائکہ ، انبیاء ، اور تمام جن و انس سب ) کہیں گے کہ یہی وہ لوگ ہیں جنہوں نے اپنے پروردگار پر جھوٹ باندھا تھا ۔ خبردار ہو جاؤ ! ظالموں پر اللہ کی پھٹکار ہو گی ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے ہمام نے بیان کیا ، کہا کہ مجھے قتادہ نے خبر دی ، ان سے صفوان بن محرزمازنی نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، قَالَ أَخْبَرَنِي قَتَادَةُ، عَنْ صَفْوَانَ بْنِ مُحْرِزٍ الْمَازِنِيِّ، قَالَ بَيْنَمَا أَنَا أَمْشِي، مَعَ ابْنِ عُمَرَ ـ رضى الله عنهما ـ آخِذٌ بِيَدِهِ إِذْ عَرَضَ رَجُلٌ، فَقَالَ كَيْفَ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي النَّجْوَى فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ اللَّهَ يُدْنِي الْمُؤْمِنَ فَيَضَعُ عَلَيْهِ كَنَفَهُ، وَيَسْتُرُهُ فَيَقُولُ أَتَعْرِفُ ذَنْبَ كَذَا أَتَعْرِفُ ذَنْبَ كَذَا فَيَقُولُ نَعَمْ أَىْ رَبِّ‏.‏ حَتَّى إِذَا قَرَّرَهُ بِذُنُوبِهِ وَرَأَى فِي نَفْسِهِ أَنَّهُ هَلَكَ قَالَ سَتَرْتُهَا عَلَيْكَ فِي الدُّنْيَا، وَأَنَا أَغْفِرُهَا لَكَ الْيَوْمَ‏.‏ فَيُعْطَى كِتَابَ حَسَنَاتِهِ، وَأَمَّا الْكَافِرُ وَالْمُنَافِقُونَ فَيَقُولُ الأَشْهَادُ هَؤُلاَءِ الَّذِينَ كَذَبُوا عَلَى رَبِّهِمْ، أَلاَ لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": "اللہ تعالیٰ کی طرف سے ایک بیان تھا: \"... کوئی شک! وہ ظالم تھے، اور اللہ کی قسم، وہ ظالم تھے۔\"",
                "headingEnglish": "The Statement of Allah Taa'la: \"... No doubt! The curse of Allah is on the Zalimun.\"",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2335,
                "hadithNumber": "2442",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"A Muslim is a brother of another Muslim, so he should not oppress him, nor should he hand him over to an oppressor. Whoever fulfilled the needs of his brother, Allah will fulfill his needs; whoever brought his (Muslim) brother out of a discomfort, Allah will bring him out of the discomforts of the Day of Resurrection, and whoever screened a Muslim, Allah will screen him on the Day of Resurrection . \"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ایک مسلمان دوسرے مسلمان کا بھائی ہے ، پس اس پر ظلم نہ کرے اور نہ ظلم ہونے دے ۔ جو شخص اپنے بھائی کی ضرورت پوری کرے ، اللہ تعالیٰ اس کی ضرورت پوری کرے گا ۔ جو شخص کسی مسلمان کی ایک مصیبت کو دور کرے ، اللہ تعالیٰ اس کی قیامت کی مصیبتوں میں سے ایک بڑی مصیبت کو دور فرمائے گا ۔ اور جو شخص کسی مسلمان کے عیب کو چھپائے اللہ تعالیٰ قیامت میں اس کے عیب چھپائے گا ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، انہیں سالم نے خبر دی ، اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَالِمًا، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمُسْلِمُ أَخُو الْمُسْلِمِ، لاَ يَظْلِمُهُ وَلاَ يُسْلِمُهُ، وَمَنْ كَانَ فِي حَاجَةِ أَخِيهِ كَانَ اللَّهُ فِي حَاجَتِهِ، وَمَنْ فَرَّجَ عَنْ مُسْلِمٍ كُرْبَةً فَرَّجَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرُبَاتِ يَوْمِ الْقِيَامَةِ، وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
                "headingArabic": "لاَ يَظْلِمُ الْمُسْلِمُ الْمُسْلِمَ وَلاَ يُسْلِمُهُ",
                "headingUrdu": "ایک مسلمان کو دوسرے مسلمان پر ظلم نہیں کرنا چاہیے۔",
                "headingEnglish": "A Muslim should not oppress another Muslim",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2336,
                "hadithNumber": "2443",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Help your brother, whether he is an oppressor or he is an oppressed one.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، اپنے بھائی کی مدد کرو وہ ظالم ہو یا مظلوم ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، انہوں نے کہا کہ ہم سے ہشیم نے بیان کیا ، انہیں عبیداللہ بن ابی بکر بن انس اور حمید طویل نے خبر دی ، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ أَنَسٍ، وَحُمَيْدٌ الطَّوِيلُ، سَمِعَا أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ انْصُرْ أَخَاكَ ظَالِمًا أَوْ مَظْلُومًا ‏\"‏‏.‏",
                "headingArabic": "أَعِنْ أَخَاكَ ظَالِمًا أَوْ مَظْلُومًا",
                "headingUrdu": "اپنے بھائی کی مدد کریں۔",
                "headingEnglish": "Help your brother",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2337,
                "hadithNumber": "2444",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Help your brother, whether he is an oppressor or he is an oppressed one. People asked, \"O Allah's Messenger (ﷺ)! It is all right to help him if he is oppressed, but how should we help him if he is an oppressor?\" The Prophet (ﷺ) said, \"By preventing him from oppressing others.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، اپنے بھائی کی مدد کرو خواہ وہ ظالم ہو یا مظلوم ۔ صحابہ نے عرض کیا ، یا رسول اللہ ! ہم مظلوم کی تو مدد کر سکتے ہیں ۔ لیکن ظالم کی مدد کس طرح کریں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ظلم سے اس کا ہاتھ پکڑ لو ۔ ( یہی اس کی مدد ہے )",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے معتمر نے بیان کیا ، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْصُرْ أَخَاكَ ظَالِمًا أَوْ مَظْلُومًا ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ هَذَا نَنْصُرُهُ مَظْلُومًا، فَكَيْفَ نَنْصُرُهُ ظَالِمًا قَالَ ‏\"‏ تَأْخُذُ فَوْقَ يَدَيْهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2338,
                "hadithNumber": "2445",
                "englishNarrator": "Narrated Al-Bara' bin `Azib رضی اللہ عنہ :",
                "hadithEnglish": "\"The Prophet (ﷺ) orders us to do seven things and prohibited us from doing seven other things.\" Then Al-Bara' mentioned the following:-\r\n(1) To pay a visit to the sick (inquiring about his health), \r\n(2) to follow funeral processions, \r\n(3) to say to a sneezer, \"May Allah be merciful to you\" (if he says, \"Praise be to Allah!\"), \r\n(4) to return greetings, \r\n(5) to help the oppressed, \r\n(6) to accept invitations, \r\n(7) to help others to fulfill their oaths. (See Hadith No. 753, Vol. 7)",
                "hadithUrdu": "ہمیں نبی کریم صلی اللہ علیہ وسلم نے سات چیزوں کو حکم فرمایا تھا اور سات ہی چیزوں سے منع بھی فرمایا تھا ( جن چیزوں کا حکم فرمایا تھا ان میں ) انہوں نے مریض کی عیادت ، جنازے کے پیچھے چلنے ، چھینکنے والے کا جواب دینے ، سلام کا جواب دینے ، مظلوم کی مدد کرنے ، دعوت کرنے والے ( کی دعوت ) قبول کرنے ، اور قسم پوری کرنے کا ذکر کیا ۔",
                "urduNarrator": "ہم سے سعید بن ربیع نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے اشعث بن سلیم نے بیان کیا ، کہ میں نے معاویہ بن سوید سے سنا ، انہوں نے براء بن عازب رضی اللہ عنہ سے سنا ، آپ نے بیان کیا تھا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَشْعَثِ بْنِ سُلَيْمٍ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ سُوَيْدٍ، سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ قَالَ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم بِسَبْعٍ، وَنَهَانَا عَنْ سَبْعٍ‏.‏ فَذَكَرَ عِيَادَةَ الْمَرِيضِ، وَاتِّبَاعَ الْجَنَائِزِ، وَتَشْمِيتَ الْعَاطِسِ، وَرَدَّ السَّلاَمِ، وَنَصْرَ الْمَظْلُومِ، وَإِجَابَةَ الدَّاعِي، وَإِبْرَارَ الْمُقْسِمِ‏.‏",
                "headingArabic": "نَصْرِ الْمَظْلُومِ",
                "headingUrdu": "مظلوموں کی مدد کرنا",
                "headingEnglish": "To help the oppressed",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2339,
                "hadithNumber": "2446",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A believer to another believer is like a building whose different parts enforce each other.\" The Prophet (ﷺ) then clasped his hands with the fingers interlaced (while saying that).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک مومن دوسرے مومن کے ساتھ ایک عمارت کے حکم میں ہے کہ ایک کو دسرے سے قوت پہنچتی ہے ۔ اور آپ نے اپنے ایک ہاتھ کی انگلیوں کو دوسرے ہاتھ کی انگلیوں کے اندرکیا ۔",
                "urduNarrator": "ہم سے محمد بن علاء نے بیان کیا ، کہا کہ ہم سے ابواسامہ نے بیان کیا ، ان سے برید نے ، ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمُؤْمِنُ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا ‏\"‏‏.‏ وَشَبَّكَ بَيْنَ أَصَابِعِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2340,
                "hadithNumber": "2447",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Oppression will be a darkness on the Day of Resurrection.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، ظلم قیامت کے دن اندھیرے ہوں گے ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، کہا کہ ہم سے عبدالعزیز ماجشون نے بیان کیا ، انہیں عبداللہ بن دینار نے خبر دی ، اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ الْمَاجِشُونُ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الظُّلْمُ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
                "headingArabic": "الظُّلْمُ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ",
                "headingUrdu": "ظلم ایک اندھیرا ہوگا۔",
                "headingEnglish": "Az-Zulm (oppression) will be a darkness",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2341,
                "hadithNumber": "2448",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) sent Mu`adh رضی اللہ عنہ to Yemen and said, \"Be afraid, from the curse of the oppressed as there is no screen between his invocation and Allah.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے معاذ رضی اللہ عنہ کو جب ( عامل بنا کر ) یمن بھیجا ، تو آپ نے انہیں ہدایت فرمائی کہ مظلوم کی بددعا سے ڈرتے رہنا کہ اس ( دعا ) کے اور اللہ تعالیٰ کے درمیان کوئی پردہ نہیں ہوتا ۔",
                "urduNarrator": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، کہا ہم سے وکیع نے بیان کیا ، کہا ہم سے زکریابن اسحاق مکی نے بیان کیا ، ان سے یحییٰ بن عبداللہ صیفی نے ، ان سے ابن عباس رضی اللہ عنہما کے غلام ابومعبد نے ، اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ الْمَكِّيُّ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ، عَنْ أَبِي مَعْبَدٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ مُعَاذًا إِلَى الْيَمَنِ، فَقَالَ ‏ \"‏ اتَّقِ دَعْوَةَ الْمَظْلُومِ، فَإِنَّهَا لَيْسَ بَيْنَهَا وَبَيْنَ اللَّهِ حِجَابٌ ‏\"‏‏.‏",
                "headingArabic": "الاِتِّقَاءِ وَالْحَذَرِ مِنْ دَعْوَةِ الْمَظْلُومِ",
                "headingUrdu": "مظلوم کی لعنت",
                "headingEnglish": "The curse of the oppressed",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2342,
                "hadithNumber": "2449",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Whoever has oppressed another person concerning his reputation or anything else, he should beg him to forgive him before the Day of Resurrection when there will be no money (to compensate for wrong deeds), but if he has good deeds, those good deeds will be taken from him according to his oppression which he has done, and if he has no good deeds, the sins of the oppressed person will be loaded on him.\" Imam Abu Abdullah Bukhari said: Saeed Maqboriyy was actually manumitted by Banu Laith. He is Saeed bin Abu Saeed and the name of Saeed's father is Kaisan.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، اگر کسی شخص کا ظلم کسی دوسرے کی عزت پر ہو یا کسی طریقہ ( سے ظلم کیا ہو ) تو آج ہی ، اس دن کے آنے سے پہلے معاف کرا لے جس دن نہ دینار ہوں گے ، نہ درہم ، بلکہ اگر اس کا کوئی نیک عمل ہو گا تو اس کے ظلم کے بدلے میں وہی لے لیا جائے گا اور اگر کوئی نیک عمل اس کے پاس نہیں ہو گا تو اس کے ( مظلوم ) ساتھی کی برائیاں اس پر ڈال دی جائیں گی ۔ ابوعبدللہ ( حضرت امام بخاری رحمہ اللہ ) نے کہا کہ اسماعیل بن ابی اویس نے کہا سعید مقبری کا نام مقبری اس لیے ہوا کہ قبرستان کے قریب انہوں نے قیام کیا تھا ۔ ابوعبداللہ ( اما م بخاری رحمہ اللہ ) نے کہا کہ سعید مقبری ہی بنی لیث کے غلام ہیں ۔ پورا نام سعید بن ابی سعید ہے اور ( ان کے والد ) ابوسعید کا نام کیسان ہے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا ہم سے ابن ابی ذئب نے بیان کیا ، انہوں نے کہا ہم سے سعید مقبری نے بیان کیا ، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ كَانَتْ لَهُ مَظْلَمَةٌ لأَحَدٍ مِنْ عِرْضِهِ أَوْ شَىْءٍ فَلْيَتَحَلَّلْهُ مِنْهُ الْيَوْمَ، قَبْلَ أَنْ لاَ يَكُونَ دِينَارٌ وَلاَ دِرْهَمٌ، إِنْ كَانَ لَهُ عَمَلٌ صَالِحٌ أُخِذَ مِنْهُ بِقَدْرِ مَظْلَمَتِهِ، وَإِنْ لَمْ تَكُنْ لَهُ حَسَنَاتٌ أُخِذَ مِنْ سَيِّئَاتِ صَاحِبِهِ فَحُمِلَ عَلَيْهِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ إِنَّمَا سُمِّيَ الْمَقْبُرِيَّ لأَنَّهُ كَانَ نَزَلَ نَاحِيَةَ الْمَقَابِرِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ وَسَعِيدٌ الْمَقْبُرِيُّ هُوَ مَوْلَى بَنِي لَيْثٍ، وَهُوَ سَعِيدُ بْنُ أَبِي سَعِيدٍ، وَاسْمُ أَبِي سَعِيدٍ كَيْسَانُ‏.‏",
                "headingArabic": "مَنْ كَانَتْ لَهُ مَظْلَمَةٌ عِنْدَ الرَّجُلِ فَحَلَّلَهَا لَهُ، هَلْ يُبَيِّنُ مَظْلَمَتَهُ",
                "headingUrdu": "اگر مظلوم مظلوم کو معاف کر دے ۔",
                "headingEnglish": "If the oppressed on forgives the oppressor",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2343,
                "hadithNumber": "2450",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Regarding the explanation of the following verse:-- \"If a wife fears Cruelty or desertion On her husband's part.\" (4.128) A man may dislike his wife and intend to divorce her, so she says to him, \"I give up my rights, so do not divorce me.\" The above verse was revealed concerning such a case.",
                "hadithUrdu": "( قرآن مجید کی آیت ) ” اگر کوئی عورت اپنے شوہر کی طرف سے نفرت یا اس کے منہ پھیرنے کا خوف رکھتی ہو “ کے بارے میں فرمایا کہ کسی شخص کی بیوی ہے لیکن شوہر اس کے پاس زیادہ آتا جاتا نہیں بلکہ اسے جدا کرنا چاہتا ہے اس پر اس کی بیوی کہتی ہے کہ میں اپنا حق تمہیں معاف کرتی ہوں ۔ اسی بارے میں یہ آیت نازل ہوئی ۔",
                "urduNarrator": "ہم سے محمد نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں ان کے باپ نے ، اور ان سے عائشہ رضی اللہ عنہا نے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها – ‏{‏وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا‏}‏ قَالَتِ الرَّجُلُ تَكُونُ عِنْدَهُ الْمَرْأَةُ، لَيْسَ بِمُسْتَكْثِرٍ مِنْهَا، يُرِيدُ أَنْ يُفَارِقَهَا، فَتَقُولُ أَجْعَلُكَ مِنْ شَأْنِي فِي حِلٍّ‏.‏ فَنَزَلَتْ هَذِهِ الآيَةُ فِي ذَلِكَ‏.‏",
                "headingArabic": "إِذَا حَلَّلَهُ مِنْ ظُلْمِهِ فَلاَ رُجُوعَ فِيهِ",
                "headingUrdu": "اگر مظلوم ظالم کو معاف کر دے تو اسے پیچھے ہٹنے کا کوئی حق نہیں۔",
                "headingEnglish": "If the oppressed person forgives the oppressor, he has no right to back out",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2344,
                "hadithNumber": "2451",
                "englishNarrator": "Narrated Sahl bin Sa`d As-Sa`idi رضی اللہ عنہ :",
                "hadithEnglish": "A drink (milk mixed with water) was brought to Allah's Messenger (ﷺ) who drank some of it. A boy was sitting to his right, and some old men to his left. Allah's Messenger (ﷺ) said to the boy, \"Do you allow me to give the rest of the drink to these people?\" The boy said, \"O Allah's Messenger (ﷺ)! I will not give preference to anyone over me to drink the rest of it from which you have drunk.\" Allah's Messenger (ﷺ) then handed the bowl (of drink) to the boy. (See Hadith No. 541).",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم کی خدمت میں دودھ یا پانی پینے کو پیش کیا گیا ۔ آپ صلی اللہ علیہ وسلم نے اسے پیا ۔ آپ صلی اللہ علیہ وسلم کے دائیں طرف ایک لڑکا تھا اور بائیں طرف بڑی عمر والے تھے ۔ لڑکے سے آپ صلی اللہ علیہ وسلم نے فرمایا کیا تم مجھے اس کی اجازت دو گے کہ ان لوگوں کو یہ ( پیالہ ) دے دوں ؟ لڑکے نے کہا ، نہیں اللہ کی قسم ! یا رسول اللہ آپ کی طرف سے ملنے والے حصے کا ایثار میں کسی پر نہیں کر سکتا ۔ راوی نے بیان کیا کہ آخر رسول کریم صلی اللہ علیہ وسلم نے وہ پیالہ اسی لڑکے کو دے دیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابوحازم بن دینار نے اور انہیں سہل بن سعد ساعدی رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِشَرَابٍ، فَشَرِبَ مِنْهُ وَعَنْ يَمِينِهِ غُلاَمٌ وَعَنْ يَسَارِهِ الأَشْيَاخُ، فَقَالَ لِلْغُلاَمِ ‏ \"‏ أَتَأْذَنُ لِي أَنْ أُعْطِيَ هَؤُلاَءِ ‏\"‏‏.‏ فَقَالَ الْغُلاَمُ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ لاَ أُوثِرُ بِنَصِيبِي مِنْكَ أَحَدًا‏.‏ قَالَ فَتَلَّهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي يَدِهِ‏.‏",
                "headingArabic": "إِذَا أَذِنَ لَهُ أَوْ أَحَلَّهُ وَلَمْ يُبَيِّنْ كَمْ هُوَ",
                "headingUrdu": "اگر کوئی شخص دوسرے کو اس کا حق دینے دیتا ہے۔",
                "headingEnglish": "If a person allows another to have his right",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2345,
                "hadithNumber": "2452",
                "englishNarrator": "Narrated Sa`id bin Zaid رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Whoever usurps the land of somebody unjustly, his neck will be encircled with it down the seven earths (on the Day of Resurrection). \"",
                "hadithUrdu": "میں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا جس نے کسی کی زمین ظلم سے لے لی ، اسے قیامت کے دن سات زمینوں کا طوق پہنایا جائے گا ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، انہوں نے کہا کہ ہم سے زہری نے بیان کیا ، ان سے طلحہ بن عبداللہ نے بیان کیا ، انہیں عبدالرحمٰن بن عمرو بن سہل نے خبر دی اور ان سے سعید بن زید رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي طَلْحَةُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَمْرِو بْنِ سَهْلٍ، أَخْبَرَهُ أَنَّ سَعِيدَ بْنَ زَيْدٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ ظَلَمَ مِنَ الأَرْضِ شَيْئًا طُوِّقَهُ مِنْ سَبْعِ أَرَضِينَ ‏\"‏‏.‏",
                "headingArabic": "إِثْمِ مَنْ ظَلَمَ شَيْئًا مِنَ الأَرْضِ",
                "headingUrdu": "دوسروں کی زمین ہتھیانے والے کا گناہ",
                "headingEnglish": "The sin of him who usurps the land of others",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2346,
                "hadithNumber": "2453",
                "englishNarrator": "Narrated Abu Salama:",
                "hadithEnglish": "That there was a dispute between him and some people (about a piece of land). When he told `Aisha about it, she said, \"O Abu Salama! Avoid taking the land unjustly, for the Prophet (ﷺ) said, 'Whoever usurps even one span of the land of somebody, his neck will be encircled with it down the seven earths.\"",
                "hadithUrdu": "ان کے اور بعض دوسرے لوگوں کے درمیان ( زمین کا ) جھگڑا تھا ۔ اس کا ذکر انہوں نے عائشہ رضی اللہ عنہا سے کیا تو انہوں نے بتلایا ، ابوسلمہ ! زمین سے پرہیز کر نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اگر کسی شخص نے ایک بالشت بھر زمین بھی کسی دوسرے کی ظلم سے لے لی تو سات زمینوں کا طوق ( قیامت کے دن ) اس کے گردن میں ڈالا جائے گا ۔",
                "urduNarrator": "ہم سے ابومعمر نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالوارث نے بیان کیا ، ان سے حسین نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے کہ مجھ سے محمد بن ابراہیم نے بیان کیا ، ان سے ابوسلمہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا حُسَيْنٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ، أَنَّ أَبَا سَلَمَةَ، حَدَّثَهُ أَنَّهُ، كَانَتْ بَيْنَهُ وَبَيْنَ أُنَاسٍ خُصُومَةٌ، فَذَكَرَ لِعَائِشَةَ ـ رضى الله عنها ـ فَقَالَتْ يَا أَبَا سَلَمَةَ اجْتَنِبِ الأَرْضَ، فَإِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ ظَلَمَ قِيدَ شِبْرٍ مِنَ الأَرْضِ طُوِّقَهُ مِنْ سَبْعِ أَرَضِينَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2347,
                "hadithNumber": "2454",
                "englishNarrator": "Narrated Salim's father (i.e. `Abdullah):",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever takes a piece of the land of others unjustly, he will sink down the seven earths on the Day of Resurrection.\" Imam Abu Abdullah Bukhari said: This Hadith is not present in Hadith Ibn-e-Mubarak's book in Khurasan but he dictated it to the people of Basrah.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جس شخص نے ناحق کسی زمین کا تھوڑا سا حصہ بھی لے لیا ، تو قیامت کے دن اسے سات زمینوں تک دھنسایا جائے گا ۔ ابوعبداللہ ( حضرت امام بخاری رحمۃاللہ علیہ ) نے کہا کہ یہ حدیث عبداللہ بن مبارک کی اس کتاب میں نہیں ہے جو خراسان میں تھی ۔ بلکہ اس میں تھی جسے انہوں نے بصرہ میں اپنے شاگردوں کو املا کرایا تھا ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے عبداللہ بن مبارک نے بیان کیا ، کہا ہم سے مو سیٰ بن عقبہ نے بیان کیا سالم سے اور ان سے ان کے والد ( عبداللہ بن عمر رضی اللہ عنہما ) نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ أَخَذَ مِنَ الأَرْضِ شَيْئًا بِغَيْرِ حَقِّهِ خُسِفَ بِهِ يَوْمَ الْقِيَامَةِ إِلَى سَبْعِ أَرَضِينَ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ هَذَا الْحَدِيثُ لَيْسَ بِخُرَاسَانَ فِي كِتَابِ ابْنِ الْمُبَارَكِ، أَمْلاَهُ عَلَيْهِمْ بِالْبَصْرَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2348,
                "hadithNumber": "2455",
                "englishNarrator": "Narrated Jabala:",
                "hadithEnglish": "\"We were in Medina with some of the Iraqi people, and we were struck with famine and Ibn Az- Zubair رضی اللہ عنہما used to give us dates. Ibn `Umar رضی اللہ عنہما used to pass by and say, \"The Prophet (ﷺ) forbade us to eat two dates at a time, unless one takes the permission of one's companions.\"",
                "hadithUrdu": "ہم بعض اہل عراق کے ساتھ مدینہ میں مقیم تھے ۔ وہاں ہمیں قحط میں مبتلا ہوناپڑا ۔ عبداللہ بن زبیر رضی اللہ عنہما کھانے کے لیے ہمارے پاس کھجور بھجوایا کرتے تھے ۔ اور عبداللہ بن عمر رضی اللہ عنہما جب ہماری طرف سے گزرتے تو فرماتے کہ رسول اللہ صلی اللہ علیہ وسلم نے ( دوسرے لوگوں کے ساتھ مل کر کھاتے وقت ) دو کھجور کو ایک ساتھ ملا کر کھانے سے منع فرمایا ہے مگر یہ کہ تم میں سے کوئی شخص اپنے بھائی سے اجازت لے لے ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے جبلہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ جَبَلَةَ، كُنَّا بِالْمَدِينَةِ فِي بَعْضِ أَهْلِ الْعِرَاقِ، فَأَصَابَنَا سَنَةٌ، فَكَانَ ابْنُ الزُّبَيْرِ يَرْزُقُنَا التَّمْرَ، فَكَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يَمُرُّ بِنَا فَيَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الإِقْرَانِ، إِلاَّ أَنْ يَسْتَأْذِنَ الرَّجُلُ مِنْكُمْ أَخَاهُ‏.‏",
                "headingArabic": "إِذَا أَذِنَ إِنْسَانٌ لآخَرَ شَيْئًا جَازَ",
                "headingUrdu": "اگر کوئی دوسرے کو کچھ کرنے دیتا ہے۔",
                "headingEnglish": "If somebody allows another to do something",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2349,
                "hadithNumber": "2456",
                "englishNarrator": "Narrated Abu Mas`ud رضی اللہ عنہ :",
                "hadithEnglish": "There was an Ansari man called Abu Shu'aib رضی اللہ عنہ who had a slave butcher. Abu Shu'aib رضی اللہ عنہ said to him, \"Prepare a meal sufficient for five persons so that I might invite the Prophet (ﷺ) besides other four persons.\" Abu Shu'aib رضی اللہ عنہ had seen the signs of hunger on the face of the Prophet (ﷺ) and so he invited him. Another man who was not invited, followed the Prophet. The Prophet (ﷺ) said to Abu Shu'aib رضی اللہ عنہ , \"This man has followed us. Do you allow him to share the meal?\" Abu Shu'aib رضی اللہ عنہ said, \"Yes.\"",
                "hadithUrdu": "انصار میں ایک صحابی جنہیں ابوشعیب رضی اللہ عنہ کہا جاتا تھا ، کا ایک قصائی غلام تھا ۔ ابوشعیب رضی اللہ عنہ نے ان سے کہا کہ میرے لیے پانچ آدمیوں کا کھانا تیا رکر دے ، کیونکہ میں نبی کریم صلی اللہ علیہ وسلم کو چار دیگر اصحاب کے ساتھ دعوت دوں گا ۔ انہوں نے آپ صلی اللہ علیہ وسلم کے چہرہ مبارک پر بھوک کے آثار دیکھے تھے ۔ چنانچہ آپ صلی اللہ علیہ وسلم کو انہوں نے بتلایا ۔ ایک اور شخص آپ کے ساتھ بن بلائے چلا گیا ۔ نبی کریم صلی اللہ علیہ وسلم نے صاحب خانہ سے فرمایا یہ آدمی بھی ہمارے ساتھ آ گیا ہے ۔ کیا اس کے لیے تمہاری اجازت ہے ؟ انہوں نے کہا جی ہاں اجازت ہے ۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے اعمش نے ، ان سے ابووائل نے اور ان سے ابومسعود رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مَسْعُودٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ يُقَالُ لَهُ أَبُو شُعَيْبٍ كَانَ لَهُ غُلاَمٌ لَحَّامٌ فَقَالَ لَهُ أَبُو شُعَيْبٍ اصْنَعْ لِي طَعَامَ خَمْسَةٍ لَعَلِّي أَدْعُو النَّبِيَّ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ‏.‏ وَأَبْصَرَ فِي وَجْهِ النَّبِيِّ صلى الله عليه وسلم الْجُوعَ ـ فَدَعَاهُ، فَتَبِعَهُمْ رَجُلٌ لَمْ يُدْعَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ هَذَا قَدِ اتَّبَعَنَا أَتَأْذَنُ لَهُ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2350,
                "hadithNumber": "2457",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The most hated person in the sight of Allah is the most quarrelsome person.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اللہ تعالیٰ کے یہاں سب سے زیادہ ناپسند وہ آدمی ہے جو سخت جھگڑالو ہو ۔",
                "urduNarrator": "ہم سے ابوعاصم نے بیان کیا ، ان سے ابن جریج نے ، ان سے ابن ابی ملیکہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ أَبْغَضَ الرِّجَالِ إِلَى اللَّهِ الأَلَدُّ الْخَصِمُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏وَهُوَ أَلَدُّ الْخِصَامِ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’پھر بھی وہ مخالفین میں سب سے زیادہ جھگڑالو ہے‘‘۔",
                "headingEnglish": "The Statement of Allah Taa'la: \"Yet he is the most quarrelsome of the opponents...\"",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2351,
                "hadithNumber": "2458",
                "englishNarrator": "Narrated Um Salama رضی اللہ عنہا (the wife of the Prophet):",
                "hadithEnglish": "Allah's Messenger (ﷺ) heard some people quarreling at the door of his dwelling. He came out and said, \"I am only a human being, and opponents come to me (to settle their problems); maybe someone amongst you can present his case more eloquently than the other, whereby I may consider him true and give a verdict in his favor. So, If I give the right of a Muslim to another by mistake, then it is really a portion of (Hell) Fire, he has the option to take or give up (before the Day of Resurrection).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنے حجرے کے دروازے کے سامنے جھگڑے کی آواز سنی اور جھگڑا کرنے والوں کے پاس تشریف لائے ۔ آپ نے ان سے فرمایا کہ میں بھی ایک انسان ہوں ۔ اس لیے جب میرے یہاں کوئی جھگڑا لے کر آتا ہے تو ہو سکتا ہے کہ ( فریقین میں سے ) ایک فریق کی بحث دوسرے فریق سے عمدہ ہو ، میں سمجھتا ہوں کہ وہ سچا ہے ۔ اور اس طرح میں اس کے حق میں فیصلہ کر دیتا ہوں ، لیکن اگر میں اس کو ( اس کے ظاہری بیان پر بھروسہ کر کے ) کسی مسلمان کا حق دلا دوں تو دوزخ کا ایک ٹکڑا اس کو دلا رہا ہوں ، وہ لے لے یا چھوڑ دے ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے ابراہیم بن سعد نے بیان کیا ، ان سے صالح بن کیسان نے اور ان سے ابن شہاب نے کہ مجھے عروہ بن زبیر رضی اللہ عنہ نے خبر دی ، انہیں زینب بنت ام سلمہ رضی اللہ عنہما نے خبر دی اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ، أَخْبَرَتْهُ أَنَّ أُمَّهَا أُمَّ سَلَمَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهَا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ سَمِعَ خُصُومَةً بِبَابِ حُجْرَتِهِ، فَخَرَجَ إِلَيْهِمْ، فَقَالَ ‏ \"‏ إِنَّمَا أَنَا بَشَرٌ وَإِنَّهُ يَأْتِينِي الْخَصْمُ، فَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَبْلَغَ مِنْ بَعْضٍ، فَأَحْسِبُ أَنَّهُ صَدَقَ، فَأَقْضِيَ لَهُ بِذَلِكَ، فَمَنْ قَضَيْتُ لَهُ بِحَقِّ مُسْلِمٍ فَإِنَّمَا هِيَ قِطْعَةٌ مِنَ النَّارِ، فَلْيَأْخُذْهَا أَوْ فَلْيَتْرُكْهَا ‏\"‏‏.‏",
                "headingArabic": "إِثْمِ مَنْ خَاصَمَ فِي بَاطِلٍ وَهْوَ يَعْلَمُهُ",
                "headingUrdu": "ناحق جھگڑا کرنے والے آدمی کا گناہ",
                "headingEnglish": "The sin of a man who quarrels unjustly",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2352,
                "hadithNumber": "2459",
                "englishNarrator": "Narrated `Abdullah bin `Amr رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever has (the following) four characters will be a hypocrite, and whoever has one of the following four characteristics will have one characteristic of hypocrisy until he gives it up. These are: \r\n(1 ) Whenever he talks, he tells a lie; \r\n(2) whenever he makes a promise, he breaks it; \r\n(3) whenever he makes a covenant he proves treacherous; \r\n(4) and whenever he quarrels, he behaves impudently in an evil insulting manner.\" (See Hadith No. 33 Vol. 1)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا چار خصلتیں ایسی ہیں کہ جس شخص میں بھی وہ ہوں گی ، وہ منافق ہو گا ۔ یا ان چار میں سے اگر ایک خصلت بھی اس میں ہے تو اس میں نفاق کی ایک خصلت ہے ۔ یہاں تک کہ وہ اسے چھوڑ دے ۔ جب بولے تو جھوٹ بولے ، جب وعدہ کرے تو پورا نہ کرے ، جب معاہدہ کرے تو بےوفائی کرے ، اور جب جھگڑے تو بدزبانی پر اترآئے ۔",
                "urduNarrator": "ہم سے بشر بن خالد نے بیان کیا کہا ہم کو محمد نے خبر دی شعبہ سے ، انہیں سلیمان نے ، انہیں عبداللہ بن مرہ نے ، انہیں مسروق نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدٌ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَرْبَعٌ مَنْ كُنَّ فِيهِ كَانَ مُنَافِقًا، أَوْ كَانَتْ فِيهِ خَصْلَةٌ مِنْ أَرْبَعَةٍ كَانَتْ فِيهِ خَصْلَةٌ مِنَ النِّفَاقِ، حَتَّى يَدَعَهَا إِذَا حَدَّثَ كَذَبَ، وَإِذَا وَعَدَ أَخْلَفَ، وَإِذَا عَاهَدَ غَدَرَ، وَإِذَا خَاصَمَ فَجَرَ ‏\"‏‏.‏",
                "headingArabic": "إِذَا خَاصَمَ فَجَرَ",
                "headingUrdu": "وہ شخص جو بے ادبی سے پیش آتا ہے۔",
                "headingEnglish": "The person who behaves impudently",
                "chapterId": "47",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 47,
                    "chapterNumber": "47",
                    "chapterEnglish": "Oppressions",
                    "chapterUrdu": "ظلم اور مال غصب کرنے کے بیان میں",
                    "chapterArabic": "کتاب المظالم والغصب",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 2326,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=93",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=91",
                "label": "91",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=92",
                "label": "92",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=93",
                "label": "93",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=94",
                "label": "94",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=95",
                "label": "95",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=96",
                "label": "96",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=97",
                "label": "97",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=95",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=95",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=93",
        "to": 2350,
        "total": 40465
    }
}