{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 117,
        "data": [
            {
                "id": 2903,
                "hadithNumber": "3039",
                "englishNarrator": "Narrated Al-Bara bin Azib رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) appointed `Abdullah bin Jubair رضی اللہ عنہ as the commander of the infantry men (archers) who were fifty on the day (of the battle) of Uhud. He instructed them, \"Stick to your place, and don't leave it even if you see birds snatching us, till I send for you; and if you see that we have defeated the infidels and made them flee, even then you should not leave your place till I send for you.\" Then the infidels were defeated. By Allah, I saw the women fleeing lifting up their clothes revealing their leg-bangles and their legs. So, the companions of `Abdullah bin Jubair رضی اللہ عنہ said, \"The booty! O people, the booty ! Your companions have become victorious, what are you waiting for now?\" `Abdullah bin Jubair رضی اللہ عنہ said, \"Have you forgotten what Allah's Messenger (ﷺ) said to you?\" They replied, \"By Allah! We will go to the people (i.e. the enemy) and collect our share from the war booty.\" But when they went to them, they were forced to turn back defeated. At that time Allah's Messenger (ﷺ) in their rear was calling them back. Only twelve men remained with the Prophet (ﷺ) and the infidels martyred seventy men from us. On the day (of the battle) of Badr, the Prophet (ﷺ) and his companions had caused the 'Pagans to lose 140 men, seventy of whom were captured and seventy were killed. Then Abu Sufyan asked thrice, \"Is Muhammad present amongst these people?\" The Prophet (ﷺ) ordered his companions not to answer him. Then he asked thrice, \"Is the son of Abu Quhafa present amongst these people?\" He asked again thrice, \"Is the son of Al-Khattab present amongst these people?\" He then returned to his companions and said, \"As for these (men), they have been killed.\" `Umar رضی اللہ عنہ could not control himself and said (to Abu Sufyan), \"You told a lie, by Allah! O enemy of Allah! All those you have mentioned are alive, and the thing which will make you unhappy is still there.\" Abu Sufyan said, \"Our victory today is a counterbalance to yours in the battle of Badr, and in war (the victory) is always undecided and is shared in turns by the belligerents, and you will find some of your (killed) men mutilated, but I did not urge my men to do so, yet I do not feel sorry for their deed\" After that he started reciting cheerfully, \"O Hubal, be high! (1) On that the Prophet (ﷺ) said (to his companions), \"Why don't you answer him back?\" They said, \"O Allah's Messenger (ﷺ) What shall we say?\" He said, \"Say, Allah is Higher and more Sublime.\" (Then) Abu Sufyan said, \"We have the (idol) Al `Uzza, and you have no `Uzza.\" The Prophet said (to his companions), \"Why don't you answer him back?\" They asked, \"O Allah's Messenger (ﷺ)! What shall we say?\" He said, \"Says Allah is our Helper and you have no helper.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے جنگ احد کے موقع پر ( تیراندازوں کے ) پچاس آدمیوں کا افسر عبداللہ بن جبیر رضی اللہ عنہ کو بنایا تھا ۔ آپ صلی اللہ علیہ وسلم نے انہیں تاکید کر دی تھی کہ اگر تم یہ بھی دیکھ لو کہ پرندے ہم پر ٹوٹ پڑے ہیں ۔ پھر بھی اپنی جگہ سے مت ہٹنا ‘ جب تک میں تم لوگوں کو کہلا نہ بھیجوں ۔ اسی طرح اگر تم یہ دیکھو کہ کفار کو ہم نے شکست دے دی ہے اور انہیں پامال کر دیا ہے پھر بھی یہاں سے نہ ٹلنا ‘ جب میں تمہیں خود بلا نہ بھیجوں ۔ پھر اسلامی لشکر نے کفار کو شکست دے دی ۔ براء بن عازب رضی اللہ عنہ نے بیان کیا ‘ کہ اللہ کی قسم ! میں نے مشرک عورتوں کو دیکھا کہ تیزی کے ساتھ بھاگ رہی تھیں ۔ ان کے پازیب اور پنڈلیاں دکھائی دے رہی تھیں ۔ اور وہ اپنے کپڑوں کو اٹھائے ہوئے تھیں ۔ عبداللہ بن جبیر رضی اللہ عنہ کے ساتھیوں نے کہا ‘ کہ غنیمت لوٹو ‘ اے قوم ! غنیمت تمہارے سامنے ہے ۔ تمہارے ساتھی غالب آ گئے ہیں ۔ اب ڈر کس بات کا ہے ۔ اس پر عبداللہ بن جبیر رضی اللہ عنہ نے ان سے کہا کہ کیا جو ہدایت رسول اللہ صلی اللہ علیہ وسلم نے کی تھی ‘ تم اسے بھول گئے ؟ لیکن وہ لوگ اسی پر اڑے رہے کہ دوسرے اصحاب کے ساتھ غنیمت جمع کرنے میں شریک رہیں گے ۔ جب یہ لوگ ( اکثریت ) اپنی جگہ چھوڑ کر چلے آئے تو ان کے منہ کافروں نے پھیر دیئے ‘ اور ( مسلمانوں کو ) شکست زدہ پا کر بھاگتے ہوئے آئے ‘ یہی وہ گھڑی تھی ( جس کا ذکر سورۃ آل عمران میں ہے کہ ) ” جب رسول کریم صلی اللہ علیہ وسلم تم کو پیچھے کھڑے ہوئے بلا رہے تھے “ ۔ اس سے یہی مراد ہے ۔ اس وقت رسول کریم صلی اللہ علیہ وسلم کے ساتھ بارہ صحابہ کے سوا اور کوئی بھی باقی نہ رہ گیا تھا ۔ آخر ہمارے ستر آدمی شہید ہو گئے ۔ بدر کی لڑائی میں آنحضرت صلی اللہ علیہ وسلم نے اپنے صحابہ کے ساتھ مشرکین کے ایک سو چالیس آدمیوں کا نقصان کیا تھا ‘ ستر ان میں سے قیدی تھے اور ستر مقتول ‘ ( جب جنگ ختم ہو گئی تو ایک پہاڑ پر کھڑے ہو کر ) ابوسفیان نے کہا کیا محمد صلی اللہ علیہ وسلم اپنی قوم کے ساتھ موجود ہیں ؟ تین مرتبہ انہوں نے یہی پوچھا ۔ لیکن نبی کریم صلی اللہ علیہ وسلم نے جواب دینے سے منع فرما دیا تھا ۔ پھر انہوں نے پوچھا ‘ کیا ابن ابی قحافہ ( ابوبکر رضی اللہ عنہ ) اپنی قوم میں موجود ہیں ؟ یہ سوال بھی تین مرتبہ کیا ‘ پھر پوچھا ابن خطاب ( عمر رضی اللہ عنہ ) اپنی قوم میں موجود ہیں ؟ یہ بھی تین مرتبہ پوچھا ‘ پھر اپنے ساتھیوں کی طرف مڑ کر کہنے لگے کہ یہ تینوں قتل ہو چکے ہیں اس پر عمر رضی اللہ عنہ سے نہ رہا گیا اور آپ بول پڑے کہ اے خدا کے دشمن ! خدا گواہ ہے کہ تو جھوٹ بول رہا ہے جن کے تو نے ابھی نام لئے تھے وہ سب زندہ ہیں اور ابھی تیرا برا دن آنے والا ہے ۔ ابوسفیان نے کہا اچھا ! آج کا دن بدر کا بدلہ ہے ۔ اور لڑائی بھی ایک ڈول کی طرح ہے ( کبھی ادھر کبھی ادھر ) تم لوگوں کو اپنی قوم کے بعض لوگ مثلہ کئے ہوئے ملیں گے ۔ میں نے اس طرح کا کوئی حکم ( اپنے آدمیوں کو ) نہیں دیا تھا ‘ لیکن مجھے ان کا یہ عمل برا بھی نہیں معلوم ہوا ۔ اس کے بعد وہ فخر یہ رجز پڑھنے لگا ‘ ہبل ( بت کا نام ) بلند رہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا تم لوگ اس کا جواب کیوں نہیں دیتے ۔ صحابہ رضی اللہ عنہم نے پوچھا ہم اس کے جواب میں کیا کہیں یا رسول اللہ ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہو کہ اللہ سب سے بلند اور سب سے بڑا بزرگ ہے ۔ ابوسفیان نے کہا ہمارا مددگار عزیٰ ( بت ) ہے اور تمہارا کوئی بھی نہیں ، آپ نے فرمایا ، جواب کیوں نہیں دیتے ، صحابہ نے عرض کیا ، یا رسول اللہ ! اس کا جواب کیا دیا جائے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ‘ کہو کہ اللہ ہمارا حامی ہے اور تمہارا حامی کوئی نہیں ۔",
                "urduNarrator": "ہم سے عمرو بن خالد نے بیان کیا ‘ کہا ہم سے زہیر نے بیان کیا ‘ کہا ہم سے ابواسحاق نے بیان کیا ‘ کہا کہ میں نے براء بن عازب رضی اللہ عنہ سے سنا ‘ آپ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ يُحَدِّثُ قَالَ جَعَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى الرَّجَّالَةِ يَوْمَ أُحُدٍ ـ وَكَانُوا خَمْسِينَ رَجُلاً ـ عَبْدَ اللَّهِ بْنَ جُبَيْرٍ فَقَالَ ‏\"‏ إِنْ رَأَيْتُمُونَا تَخْطَفُنَا الطَّيْرُ، فَلاَ تَبْرَحُوا مَكَانَكُمْ هَذَا حَتَّى أُرْسِلَ إِلَيْكُمْ، وَإِنْ رَأَيْتُمُونَا هَزَمْنَا الْقَوْمَ وَأَوْطَأْنَاهُمْ فَلاَ تَبْرَحُوا حَتَّى أُرْسِلَ إِلَيْكُمْ ‏\"‏ فَهَزَمُوهُمْ‏.‏ قَالَ فَأَنَا وَاللَّهِ رَأَيْتُ النِّسَاءَ يَشْتَدِدْنَ قَدْ بَدَتْ خَلاَخِلُهُنَّ وَأَسْوُقُهُنَّ رَافِعَاتٍ ثِيَابَهُنَّ، فَقَالَ أَصْحَابُ عَبْدِ اللَّهِ بْنِ جُبَيْرٍ الْغَنِيمَةَ ـ أَىْ قَوْمِ ـ الْغَنِيمَةَ، ظَهَرَ أَصْحَابُكُمْ فَمَا تَنْتَظِرُونَ فَقَالَ عَبْدُ اللَّهِ بْنُ جُبَيْرٍ أَنَسِيتُمْ مَا قَالَ لَكُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالُوا وَاللَّهِ لَنَأْتِيَنَّ النَّاسَ فَلَنُصِيبَنَّ مِنَ الْغَنِيمَةِ‏.‏ فَلَمَّا أَتَوْهُمْ صُرِفَتْ وُجُوهُهُمْ فَأَقْبَلُوا مُنْهَزِمِينَ، فَذَاكَ إِذْ يَدْعُوهُمُ الرَّسُولُ فِي أُخْرَاهُمْ، فَلَمْ يَبْقَ مَعَ النَّبِيِّ صلى الله عليه وسلم غَيْرُ اثْنَىْ عَشَرَ رَجُلاً، فَأَصَابُوا مِنَّا سَبْعِينَ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم وَأَصْحَابُهُ أَصَابَ مِنَ الْمُشْرِكِينَ يَوْمَ بَدْرٍ أَرْبَعِينَ وَمِائَةً سَبْعِينَ أَسِيرًا وَسَبْعِينَ قَتِيلاً، فَقَالَ أَبُو سُفْيَانَ أَفِي الْقَوْمِ مُحَمَّدٌ ثَلاَثَ مَرَّاتٍ، فَنَهَاهُمُ النَّبِيُّ صلى الله عليه وسلم أَنْ يُجِيبُوهُ ثُمَّ قَالَ أَفِي الْقَوْمِ ابْنُ أَبِي قُحَافَةَ ثَلاَثَ مَرَّاتٍ، ثُمَّ قَالَ أَفِي الْقَوْمِ ابْنُ الْخَطَّابِ ثَلاَثَ مَرَّاتٍ، ثُمَّ رَجَعَ إِلَى أَصْحَابِهِ فَقَالَ أَمَّا هَؤُلاَءِ فَقَدْ قُتِلُوا‏.‏ فَمَا مَلَكَ عُمَرُ نَفْسَهُ فَقَالَ كَذَبْتَ وَاللَّهِ يَا عَدُوَّ اللَّهِ، إِنَّ الَّذِينَ عَدَدْتَ لأَحْيَاءٌ كُلُّهُمْ، وَقَدْ بَقِيَ لَكَ مَا يَسُوؤُكَ‏.‏ قَالَ يَوْمٌ بِيَوْمِ بَدْرٍ، وَالْحَرْبُ سِجَالٌ، إِنَّكُمْ سَتَجِدُونَ فِي الْقَوْمِ مُثْلَةً لَمْ آمُرْ بِهَا وَلَمْ تَسُؤْنِي، ثُمَّ أَخَذَ يَرْتَجِزُ أُعْلُ هُبَلْ، أُعْلُ هُبَلْ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَلاَ تُجِيبُوا لَهُ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ، مَا نَقُولُ قَالَ ‏\"‏ قُولُوا اللَّهُ أَعْلَى وَأَجَلُّ ‏\"‏‏.‏ قَالَ إِنَّ لَنَا الْعُزَّى وَلاَ عُزَّى لَكُمْ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَلاَ تُجِيبُوا لَهُ ‏\"‏‏.‏ قَالَ قَالُوا يَا رَسُولَ اللَّهِ، مَا نَقُولُ قَالَ ‏\"‏ قُولُوا اللَّهُ مَوْلاَنَا وَلاَ مَوْلَى لَكُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2904,
                "hadithNumber": "3040",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) was the (most handsome), most generous and the bravest of all the people. Once the people of Medina got frightened having heard an uproar at night. So, the Prophet (ﷺ) met the people while he was riding an unsaddled horse belonging to Abu Talha   رضی اللہ عنہ and carrying his sword (slung over his shoulder). He said (to them), \"Don't get scared, don't get scared.\" Then he added, \"I found it (i.e the horse) very fast.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سب سے زیادہ حسین ‘ سب سے زیادہ سخی اور سب سے زیادہ بہادر تھے ۔ انہوں نے کہا کہ ایک مرتبہ رات کے وقت اہل مدینہ گھبرا گئے تھے ‘ کیونکہ ایک آواز سنائی دی تھی ۔ پھر ابوطلحہ رضی اللہ عنہ کے ایک گھوڑے پر جس کی پیٹھ ننگی تھی رسول کریم صلی اللہ علیہ وسلم حقیقت حال معلوم کرنے کے لئے تنہا اطراف مدینہ میں سب سے آگے تشریف لے گئے ۔ پھر آپ صلی اللہ علیہ وسلم واپس آ کر صحابہ رضی اللہ عنہم سے ملے تو تلوار آپ صلی اللہ علیہ وسلم کی گردن میں لٹک رہی تھی اور آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ گھبرانے کی کوئی بات نہیں ‘ گھبرانے کی کوئی بات نہیں ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا ‘ میں نے تو اسے دریا کی طرح پایا ۔ ( تیز دوڑنے میں ) آپ صلی اللہ علیہ وسلم کا اشارہ گھوڑے کی طرف تھا ۔",
                "urduNarrator": "ہم سے قتیبہ نے بن سعید نے بیان کیا ‘ کہا ہم سے حماد نے بیان کیا ‘ ان سے ثابت نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحْسَنَ النَّاسِ، وَأَجْوَدَ النَّاسِ، وَأَشْجَعَ النَّاسِ، قَالَ وَقَدْ فَزِعَ أَهْلُ الْمَدِينَةِ لَيْلَةً سَمِعُوا صَوْتًا، قَالَ فَتَلَقَّاهُمُ النَّبِيُّ صلى الله عليه وسلم عَلَى فَرَسٍ لأَبِي طَلْحَةَ عُرْىٍ، وَهُوَ مُتَقَلِّدٌ سَيْفَهُ فَقَالَ ‏\"‏ لَمْ تُرَاعُوا، لَمْ تُرَاعُوا ‏\"‏‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَجَدْتُهُ بَحْرًا ‏\"‏‏.‏ يَعْنِي الْفَرَسَ‏.‏",
                "headingArabic": "إِذَا فَزِعُوا بِاللَّيْلِ",
                "headingUrdu": "اگر رات کو لوگ خوفزدہ ہوجائیں",
                "headingEnglish": "If the people get frightened at night",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2905,
                "hadithNumber": "3041",
                "englishNarrator": "Narrated Salama رضی اللہ عنہ :",
                "hadithEnglish": "I went out of Medina towards Al-Ghaba. When I reached the mountain path of Al-Ghaba, a slave of `Abdur-Rahman bin `Auf رضی اللہ عنہ met me. I said to him, \"Woe to you! What brought you here?\" He replied, \"The she-camels of the Prophet (ﷺ) have been taken away.\" I said, \"Who took them?\" He said, \"Ghatafan and Fazara.\" So, I sent three cries, \"O Sabaha-h ! O Sabahah !\" so loudly that made the people in between its (i.e. Medina's) two mountains hear me. Then I rushed till I met them after they had taken the camels away. I started throwing arrows at them saying, \"I am the son of Al-Akwa`\"; and today perish the mean people!\" So, I saved the she-camels from them before they (i.e. the robbers) could drink water. When I returned driving the camels, the Prophet (ﷺ) met me, I said, \"O Allah's Messenger (ﷺ) Those people are thirsty and I have prevented them from drinking water, so send some people to chase them.\" The Prophet (ﷺ) said, \"O son of Al-Akwa`, you have gained power (over your enemy), so forgive (them). (Besides) those people are now being entertained by their folk.\"",
                "hadithUrdu": "میں مدینہ منورہ سے غابہ ( شام کے راستے میں ایک مقام ) جا رہا تھا ‘ غابہ کی پہاڑی پر ابھی میں پہنچا تھا کہ عبدالرحمٰن بن عوف رضی اللہ عنہ کا ایک غلام ( رباح ) مجھے ملا ۔ میں نے کہا ‘ کیا بات پیش آئی ؟ کہنے لگا کہ رسول اللہ صلی اللہ علیہ وسلم کی دودہیل اونٹنیاں ( دودھ دینے والیاں ) چھین لی گئیں ہیں ۔ میں نے پوچھا کس نے چھینا ہے ؟ بتایا کہ قبیلہ غطفان اور فزارہ کے لوگوں نے ۔ پھر میں نے تین مرتبہ بہت زور سے چیخ کر ” یا صباحاہ ‘ یا صباحاہ “ کہا ۔ اتنی زور سے کہ مدینہ کے چاروں طرف میری آواز پہنچ گئی ۔ اس کے بعد میں بہت تیزی کے ساتھ آگے بڑھا ‘ اور ڈاکوؤں کو جا لیا ‘ اونٹنیاں ان کے ساتھ تھیں ‘ میں نے ان پر تیر برسانا شروع کر دیا ‘ اور کہنے لگا ‘ میں اکوع کا بیٹا سلمہ ہوں اور آج کا دن کمینوں کی ہلاکت کا دن ہے ۔ آخر اونٹنیاں میں نے ان سے چھڑا لیں ‘ ابھی وہ لوگ پانی نہ پینے پائے تھے اور انہیں ہانک کر واپس لا رہا تھا کہ اتنے میں رسول اللہ صلی اللہ علیہ وسلم بھی مجھ کو مل گئے ۔ میں نے عرض کیا یا رسول اللہ ! ڈاکو پیاسے ہیں اور میں نے مارے تیروں کے پانی بھی نہیں پینے دیا ۔ اس لئے ان کے پیچھے کچھ لوگوں کو بھیج دیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ‘ اے ابن الاکوع ! تو ان پر غالب ہو چکا اب جانے دے ‘ درگزر کر وہ تو اپنی قوم میں پہنچ گئے جہاں ان کی مہمانی ہو رہی ہے ۔",
                "urduNarrator": "ہم سے مکی بن ابراہیم نے بیان کیا ‘ کہا ہم کو یزید بن ابی عبید نے خبر دی ‘ انہیں سلمہ بن اکوع رضی اللہ عنہ نے خبر دی ‘ انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ، أَنَّهُ أَخْبَرَهُ قَالَ خَرَجْتُ مِنَ الْمَدِينَةِ ذَاهِبًا نَحْوَ الْغَابَةِ، حَتَّى إِذَا كُنْتُ بِثَنِيَّةِ الْغَابَةِ لَقِيَنِي غُلاَمٌ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قُلْتُ وَيْحَكَ، مَا بِكَ قَالَ أُخِذَتْ لِقَاحُ النَّبِيِّ صلى الله عليه وسلم‏.‏ قُلْتُ مَنْ أَخَذَهَا قَالَ غَطَفَانُ وَفَزَارَةُ‏.‏ فَصَرَخْتُ ثَلاَثَ صَرَخَاتٍ أَسْمَعْتُ مَا بَيْنَ لاَبَتَيْهَا يَا صَبَاحَاهْ، يَا صَبَاحَاهْ‏.‏ ثُمَّ انْدَفَعْتُ حَتَّى أَلْقَاهُمْ وَقَدْ أَخَذُوهَا، فَجَعَلْتُ أَرْمِيهِمْ وَأَقُولُ أَنَا ابْنُ الأَكْوَعِ، وَالْيَوْمُ يَوْمُ الرُّضَّعِ، فَاسْتَنْقَذْتُهَا مِنْهُمْ قَبْلَ أَنْ يَشْرَبُوا، فَأَقْبَلْتُ بِهَا أَسُوقُهَا، فَلَقِيَنِي النَّبِيُّ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ الْقَوْمَ عِطَاشٌ، وَإِنِّي أَعْجَلْتُهُمْ أَنْ يَشْرَبُوا سِقْيَهُمْ، فَابْعَثْ فِي إِثْرِهِمْ، فَقَالَ ‏ \"‏ يَا ابْنَ الأَكْوَعِ، مَلَكْتَ فَأَسْجِحْ‏.‏ إِنَّ الْقَوْمَ يُقْرَوْنَ فِي قَوْمِهِمْ ‏\"‏‏.‏",
                "headingArabic": "مَنْ رَأَى الْعَدُوَّ فَنَادَى بِأَعْلَى صَوْتِهِ يَا صَبَاحَاهْ. حَتَّى يُسْمِعَ النَّاسَ",
                "headingUrdu": "چلانا: \"یا صباح!\"",
                "headingEnglish": "Shouting: \"Ya Sabahah!\"",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2906,
                "hadithNumber": "3042",
                "englishNarrator": "Narrated Abu 'Is-haq:",
                "hadithEnglish": "A man asked Al-Bara رضی اللہ عنہ \"O Abu '`Umara! Did you flee on the day (of the battle) of Hunain?\" Al-Bara رضی اللہ عنہ replied while I was listening, \"As for Allah's Messenger (ﷺ) he did not flee on that day. Abu Sufyan bin Al- Harith was holding the reins of his mule and when the pagans attacked him, he dismounted and started saying, 'I am the Prophet, and there is no lie about it; I am the son of `Abdul Muttalib.' On that day nobody was seen braver than the Prophet.",
                "hadithUrdu": "انہوں نے براء بن عازب رضی اللہ عنہ سے پوچھا تھا ‘ اے ابو عمارہ ! کیا آپ لوگ حنین کی جنگ میں واقعی فرار ہو گئے تھے ؟ ابواسحاق نے کہا میں سن رہا تھا ‘ براء رضی اللہ عنہ نے یہ جواب دیا کہ رسول کریم صلی اللہ علیہ وسلم اس دن اپنی جگہ سے بالکل نہیں ہٹے تھے ۔ ابوسفیان بن حارث بن عبدالمطلب آپ کے خچر کی لگام تھامے ہوئے تھے ‘ جس وقت مشرکین نے آپ کو چاروں طرف سے گھیر لیا تو آپ سواری سے اترے اور ( تنہا میدان میں آ کر ) فرمانے لگے میں اللہ کا نبی ہوں ‘ اس میں بالکل جھوٹ نہیں ۔ میں عبدالمطلب کا بیٹا ہوں ۔ براء نے کہا کہ آنحضرت صلی اللہ علیہ وسلم سے زیادہ بہادر اس دن کوئی بھی نہیں تھا ۔",
                "urduNarrator": "ہم سے عبیداللہ بن موسیٰ نے ‘ ان سے اسرائیل نے ‘ ان سے ابواسحاق نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَأَلَ رَجُلٌ الْبَرَاءَ ـ رضى الله عنه ـ فَقَالَ يَا أَبَا عُمَارَةَ، أَوَلَّيْتُمْ يَوْمَ حُنَيْنٍ قَالَ الْبَرَاءُ وَأَنَا أَسْمَعُ أَمَّا رَسُولُ اللَّهِ صلى الله عليه وسلم لَمْ يُوَلِّ يَوْمَئِذٍ، كَانَ أَبُو سُفْيَانَ بْنُ الْحَارِثِ آخِذًا بِعِنَانِ بَغْلَتِهِ، فَلَمَّا غَشِيَهُ الْمُشْرِكُونَ نَزَلَ، فَجَعَلَ يَقُولُ أَنَا النَّبِيُّ لاَ كَذِبْ، أَنَا ابْنُ عَبْدِ الْمُطَّلِبْ قَالَ فَمَا رُئِيَ مِنَ النَّاسِ يَوْمَئِذٍ أَشَدُّ مِنْهُ‏.‏",
                "headingArabic": "مَنْ قَالَ خُذْهَا وَأَنَا ابْنُ فُلاَنٍ",
                "headingUrdu": "کہنے لگا: لے لو میں فلاں کا بیٹا ہوں۔",
                "headingEnglish": "Saying: \"Take it! I am the son of so-and-so.\"",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2907,
                "hadithNumber": "3043",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "When the tribe of Bani Quraiza was ready to accept Sa`d's judgment, Allah's Messenger (ﷺ) sent for Sa`d رضی اللہ عنہ who was near to him. Sa`d رضی اللہ عنہ came, riding a donkey and when he came near, Allah's Messenger (ﷺ) said (to the Ansar), \"Stand up for your leader.\" Then Sa`d رضی اللہ عنہ came and sat beside Allah's Messenger (ﷺ) who said to him. \"These people are ready to accept your judgment.\" Sa`d رضی اللہ عنہ said, \"I give the judgment that their warriors should be killed and their children and women should be taken as prisoners.\" The Prophet (ﷺ) then remarked, \"O Sa`d! You have judged amongst them with (or similar to) the judgment of the King Allah.\"",
                "hadithUrdu": "جب بنوقریظہ سعد بن معاذ رضی اللہ عنہ کی ثالثی کی شرط پر ہتھیار ڈال کر قلعہ سے اتر آئے تو رسول کریم صلی اللہ علیہ وسلم نے انہیں ( سعد رضی اللہ عنہ کو ) بلایا ۔ آپ وہیں قریب ہی ایک جگہ ٹھہرے ہوئے تھے ( کیونکہ زخمی تھے ) حضرت سعد رضی اللہ عنہ گدھے پر سوار ہو کر آئے ‘ جب وہ آپ کے قریب پہنچے تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا ‘ اپنے سردار کی طرف کھڑے ہو جاؤ ( اور ان کو سواری سے اتارو ) آخر آپ اتر کر آنحضرت صلی اللہ علیہ وسلم کے قریب آ کر بیٹھ گئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان لوگوں ( بنو قریضہ کے یہودی ) نے آپ کی ثالثی کی شرط پر ہتھیار ڈال دیئے ہیں ۔ ( اس لئے آپ ان کا فیصلہ کر دیں ) انہوں نے کہا کہ پھر میرا فیصلہ یہ ہے کہ ان میں جتنے آدمی لڑنے والے ہیں ‘ انہیں قتل کر دیا جائے ‘ اور ان کی عورتوں اور بچوں کو غلام بنا لیا جائے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا تو نے اللہ تعالیٰ کے حکم کے مطابق فیصلہ کیا ہے ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے سعد بن ابراہیم نے ‘ ان سے ابوامامہ نے ‘ جو سہل بن حنیف کے لڑکے تھے کہ ابو سعید خدری رضی اللہ عنہ نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي أُمَامَةَ ـ هُوَ ابْنُ سَهْلِ بْنِ حُنَيْفٍ ـ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتْ بَنُو قُرَيْظَةَ عَلَى حُكْمِ سَعْدٍ ـ هُوَ ابْنُ مُعَاذٍ ـ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم، وَكَانَ قَرِيبًا مِنْهُ، فَجَاءَ عَلَى حِمَارٍ، فَلَمَّا دَنَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُومُوا إِلَى سَيِّدِكُمْ ‏\"‏‏.‏ فَجَاءَ فَجَلَسَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُ ‏\"‏ إِنَّ هَؤُلاَءِ نَزَلُوا عَلَى حُكْمِكَ ‏\"‏‏.‏ قَالَ فَإِنِّي أَحْكُمُ أَنْ تُقْتَلَ الْمُقَاتِلَةُ، وَأَنْ تُسْبَى الذُّرِّيَّةُ‏.‏ قَالَ ‏\"‏ لَقَدْ حَكَمْتَ فِيهِمْ بِحُكْمِ الْمَلِكِ ‏\"‏‏.‏",
                "headingArabic": "إِذَا نَزَلَ الْعَدُوُّ عَلَى حُكْمِ رَجُلٍ",
                "headingUrdu": "اگر دشمن مسلمان کا فیصلہ ماننے کے لیے تیار ہو۔",
                "headingEnglish": "If the enemy is ready to accept the judgement of a Muslim",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2908,
                "hadithNumber": "3044",
                "englishNarrator": "Narrated Anas bin Malik (رضی اللہ عنہ):",
                "hadithEnglish": "Allah's Messenger (ﷺ) entered (Makkah) in the year of the Conquest (of Makkah) wearing a helmet over his head. After he took it off, a man came and said, \"Ibn Khatal is clinging to the curtains of the Ka'bah.\" The Prophet (ﷺ) said, \"Kill him.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم فتح مکہ کے دن جب شہر میں داخل ہوئے تو آپ کے سرمبارک پر خود تھا ۔ آپ جب اسے اتار رہے تھے تو ایک شخص ( ابوبرزہ اسلمی ) نے آ کر آپ کو خبر دی کہ ابن خطل ( اسلام کا بدترین دشمن ) کعبہ کے پردے سے لٹکا ہوا ہے ۔ آپ نے فرمایا اسے وہیں قتل کر دو ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَامَ الْفَتْحِ وَعَلَى رَأْسِهِ الْمِغْفَرُ، فَلَمَّا نَزَعَهُ جَاءَ رَجُلٌ فَقَالَ إِنَّ ابْنَ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ، فَقَالَ ‏ \"‏ اقْتُلُوهُ ‏\"‏‏.‏",
                "headingArabic": "قَتْلِ الأَسِيرِ وَقَتْلِ الصَّبْرِ",
                "headingUrdu": "اسیر کا قتل",
                "headingEnglish": "The killing of a captive",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2909,
                "hadithNumber": "3045",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent a Sariya of ten men as spies under the leadership of `Asim bin Thabit al-Ansari رضی اللہ عنہ , the grandfather of `Asim bin `Umar Al-Khattab رضی اللہ عنہ . They proceeded till they reached Hadaa, a place between 'Usfan, and Mecca, and their news reached a branch of the tribe of Hudhail called Bani Lihyan. About two-hundred men, who were all archers, hurried to follow their tracks till they found the place where they had eaten dates they had brought with them from Medina. They said, \"These are the dates of Yathrib (i.e. Medina), \"and continued following their tracks When `Asim رضی اللہ عنہ and his companions saw their pursuers, they went up a high place and the infidels circled them. The infidels said to them, \"Come down and surrender, and we promise and guarantee you that we will not kill any one of you\" `Asim bin Thabit رضی اللہ عنہ ; the leader of the Sariya said, \"By Allah! I will not come down to be under the protection of infidels. O Allah! Convey our news to Your Prophet. Then the infidels threw arrows at them till they martyred `Asim رضی اللہ عنہ along with six other men, and three men came down accepting their promise and convention, and they were Khubaib-al-Ansari and Ibn Dathina and another man So, when the infidels captured them, they undid the strings of their bows and tied them. Then the third (of the captives) said, \"This is the first betrayal. By Allah! I will not go with you. No doubt these, namely the martyred, have set a good example to us.\" So, they dragged him and tried to compel him to accompany them, but as he refused, they killed him. They took Khubaid and Ibn Dathina with them and sold them (as slaves) in Mecca (and all that took place) after the battle of Badr. Khubaib was bought by the sons of Al-Harith bin 'Amir bin Naufal bin `Abd Manaf. It was Khubaib who had killed Al-Harith bin 'Amir on the day (of the battle of) Badr. So, Khubaib remained a prisoner with those people. Narrated Az-Zuhri: 'Ubaidullah bin 'Iyyad said that the daughter of Al-Harith had told him, \"When those people gathered (to kill Khubaib) he borrowed a razor from me to shave his pubes and I gave it to him. Then he took a son of mine while I was unaware when he came upon him. I saw him placing my son on his thigh and the razor was in his hand. I got scared so much that Khubaib noticed the agitation on my face and said, 'Are you afraid that I will kill him? No, I will never do so.' By Allah, I never saw a prisoner better than Khubaib. By Allah, one day I saw him eating of a bunch of grapes in his hand while he was chained in irons, and there was no fruit at that time in Mecca.\" The daughter of Al-Harith used to say, \"It was a boon Allah bestowed upon Khubaib.\" When they took him out of the Sanctuary (of Mecca) to kill him outside its boundaries, Khubaib requested them to let him offer two rak`at (prayer). They allowed him and he offered Two rak`at and then said, \"Hadn't I been afraid that you would think that I was afraid (of being killed), I would have prolonged the prayer. O Allah, kill them all with no exception.\" (He then recited the poetic verse):-- \"I being martyred as a Muslim, Do not mind how I am killed in Allah's Cause, For my killing is for Allah's Sake, And if Allah wishes, He will bless the amputated parts of a torn body\" Then the son of Al Harith killed him. So, it was Khubaib who set the tradition for any Muslim sentenced to death in captivity, to offer a two-rak`at prayer (before being killed). Allah fulfilled the invocation of `Asim bin Thabit رضی اللہ عنہ on that very day on which he was martyred. The Prophet (ﷺ) informed his companions of their news and what had happened to them. Later on when some infidels from Quraish were informed that `Asim رضی اللہ عنہ had been killed, they sent some people to fetch a part of his body (i.e. his head) by which he would be recognized. (That was because) `Asim رضی اللہ عنہ had killed one of their chiefs on the day (of the battle) of Badr. So, a swarm of wasps, resembling a shady cloud, were sent to hover over `Asim رضی اللہ عنہ and protect him from their messenger and thus they could not cut off anything from his flesh.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے دس صحابہ کی ایک جماعت کفار کی جاسوسی کے لئے بھیجی ‘ اس جماعت کا امیر عاصم بن عمر بن خطاب کے نانا عاصم بن ثابت انصاری رضی اللہ عنہ کو بنایا اور جماعت روانہ ہو گئی ۔ جب یہ لوگ مقام ھداۃ پر پہنچے جو عسفان اور مکہ کے درمیان میں ہے تو قبیلہ ہذیل کی ایک شاخ بنو لحیان کو کسی نے خبر دے دی اور اس قبیلہ کے دو سو تیراندازوں کی جماعت ان کی تلاش میں نکلی ‘ یہ سب صحابہ کے نشانات قدم سے اندازہ لگاتے ہوئے چلتے چلتے آخر ایک ایسی جگہ پر پہنچ گئے جہاں صحابہ نے بیٹھ کر کھجوریں کھائی تھیں ‘ جو وہ مدینہ منورہ سے اپنے ساتھ لے کر چلے تھے ۔ پیچھا کرنے والوں نے کہا کہ یہ ( گٹھلیاں ) تو یثرب ( مدینہ ) کی ( کھجوروں کی ) ہیں اور پھر قدم کے نشانوں سے اندازہ کرتے ہوئے آگے بڑھنے لگے ۔ آخر عاصم رضی اللہ عنہ اور ان کے ساتھیوں نے جب انہیں دیکھا توا ن سب نے ایک پہاڑ کی چوٹی پر پناہ لی ‘ مشرکین نے ان سے کہا کہ ہتھیار ڈال کر نیچے اتر آؤ ‘ تم سے ہمارا عہد و پیمان ہے ۔ ہم کسی شخص کو بھی قتل نہیں کریں گے ۔ عاصم بن ثابت رضی اللہ عنہ مہم کے امیر نے کہا کہ میں تو آج کسی صورت میں بھی ایک کافر کی پناہ میں نہیں اتروں گا ۔ اے اللہ ! ہماری حالت سے اپنے نبی کو مطلع کر دے ۔ اس پر ان کافروں نے تیر برسانے شروع کر دئیے اور عاصم رضی اللہ عنہ اور سات دوسرے صحابہ کو شہید کر ڈالا باقی تین صحابی ان کے عہد و پیمان پر اتر آئے ، یہ خبیب انصاری رضی اللہ عنہ ابن دثنہ رضی اللہ عنہ اور ایک تیسرے صحابی ( عبداللہ بن طارق بلوی رضی اللہ عنہ ) تھے ۔ جب یہ صحابی ان کے قابو میں آ گئے تو انہوں نے اپنی کمانوں کے تانت اتار کر ان کو ان سے باندھ لیا ‘ حضرت عبداللہ بن طارق رضی اللہ عنہ نے کہا کہ اللہ کی قسم ! یہ تمہاری پہلی غداری ہے ۔ میں تمہارے ساتھ ہرگز نہ جاؤں گا ‘ بلکہ میں تو انہیں حضرت کا اسوہ اختیار کروں گا ‘ ان کی مراد شہداء سے تھی ‘ مگر مشرکین انہیں کھنچنے لگے اور زبردستی اپنے ساتھ لے جانا چاہا جب وہ کسی طرح نہ گئے تو ان کو بھی شہید کر دیا ۔ اب یہ خبیب اور ابن دثنہ رضوی اللہ عنہما کو ساتھ لے کر چلے اور ان کو مکہ میں لے جا کر بیچ دیا ۔ یہ جنگ بدر کے بعد کا واقعہ ہے ۔ خبیب رضی اللہ عنہ کو حارث بن عامر بن نوفل بن عبد مناف کے لڑکوں نے خرید لیا ، خبیب رضی اللہ عنہ نے ہی بدر کی لڑائی میں حارث بن عامر کو قتل کیا تھا ۔ آپ ان کے یہاں کچھ دنوں تک قید ی بن کر رہے ، ( زہری نے بیان کیا ) کہ مجھے عبیداللہ بن عیاض نے خبر دی اور انہیں حارث کی بیٹی ( زینب رضی اللہ عنہا ) نے خبر دی کہ جب ( ان کو قتل کرنے کے لئے ) لوگ آئے تو زینب سے انہوں نے موئے زیر ناف مونڈنے کے لئے استرا مانگا ۔ انہوں نے استرا دے دیا ، ( زینب نے بیان کیا ) پھر انہوں نے میرے ایک بچے کو اپنے پاس بلا لیا ‘ جب وہ ان کے پاس گیا تو میں غافل تھی ‘ زینب نے بیان کیا کہ پھر جب میں نے اپنے بچے کو ان کی ران پر بیٹھا ہوا دیکھا اور استرا ان کے ہاتھ میں تھا ‘ تو میں اس بری طرح گھبرا گئی کہ خبیب رضی اللہ عنہ بھی میرے چہرے سے سمجھ گئے انہوں نے کہا ‘ تمہیں اس کا خوف ہو گا کہ میں اسے قتل کر ڈالوں گا ‘ یقین کرو میں کبھی ایسا نہیں کر سکتا ۔ اللہ کی قسم ! کوئی قیدی میں نے خبیب سے بہتر کبھی نہیں دیکھا ۔ اللہ کی قسم ! میں نے ایک دن دیکھا کہ انگور کا خوشہ ان کے ہاتھ میں ہے اور وہ اس میں سے کھا رہے ہیں ۔ حالانکہ وہ لوہے کی زنجیروں میں جکڑے ہوئے تھے اور مکہ میں پھلوں کا موسم بھی نہیں تھا ۔ کہا کرتی تھیں کہ وہ تو اللہ تعالیٰ کی روزی تھی جو اللہ نے خبیب رضی اللہ عنہ کو بھیجی تھی ۔ پھر جب مشرکین انہیں حرم سے باہر لائے ‘ تاکہ حرم کے حدود سے نکل کر انہیں شہید کر دیں تو خبیب رضی اللہ عنہ نے ان سے کہا کہ مجھے صرف دو رکعت نماز پڑھ لینے دو ۔ انہوں نے ان کو اجازت دے دی ۔ پھر خبیب رضی اللہ عنہ نے دو رکعت نماز پڑھی اور فرمایا ‘ اگر تم یہ خیال نہ کرنے لگتے کہ میں ( قتل سے ) گھبرا رہا ہوں تو میں ان رکعتوں کو اور لمبا کرتا ۔ اے اللہ ! ان ظالموں سے ایک ایک کو ختم کر دے ، ( پھر یہ اشعار پڑھے ) ” جبکہ میں مسلمان ہونے کی حالت میں قتل کیا جا رہا ہوں ‘ تو مجھے کسی قسم کی بھی پرواہ نہیں ہے ۔ خواہ اللہ کے راستے میں مجھے کسی پہلو پر بھی پچھاڑا جائے ، یہ صرف اللہ تعالیٰ کی رضا حاصل کرنے کے لئے ہے اور اگر وہ چاہے تو اس جسم کے ٹکڑوں میں بھی برکت دے سکتا ہے جس کی بوٹی بوٹی کر دی گئی ہو ۔ آخر حارث کے بیٹے ( عقبہ ) نے ان کو شہید کر دیا ۔ حضرت خبیب رضی اللہ عنہ سے ہی ہر اس مسلمان کے لئے جسے قید کر کے قتل کیا جائے ( قتل سے پہلے ) دو رکعتیں مشروع ہوئی ہیں ۔ ادھر حادثہ کے شروع ہی میں حضرت عاصم بن ثابت رضی اللہ عنہ ( مہم کے امیر ) کی دعا اللہ تعالیٰ نے قبول کر لی تھی کہ اے اللہ ! ہماری حالت کی خبر اپنے نبی کو دیدے ) اور نبی کریم صلی اللہ علیہ وسلم نے اپنے صحابہ کو وہ سب حالات بتا دیئے تھے جن سے یہ مہم دو چار ہوئی تھی ۔ کفار قریش کے کچھ لوگوں کو جب معلوم ہوا کہ حضرت عاصم شہید کر دیئے گئے تو انہوں نے نے ان کی لاش کے لئے اپنے آدمی بھیجے تاکہ ان کی جسم کا کوئی ایسا حصہ کاٹ لائیں جس سے ان کی شناخت ہو سکتی ہو ۔ عاصم رضی اللہ عنہ نے بدر کی جنگ میں کفار قریش کے ایک سردار ( عقبہ بن ابی معیط ) کو قتل کیا تھا ۔ لیکن اللہ تعالیٰ نے بھڑوں کا ایک چھتہ عاصم کی نعش پر قائم کر دیا انہوں نے قریش کے آدمیوں سے عاصم کی لاش کو بچا لیا اور وہ ان کے بدن کا کوئی ٹکڑا نہ کاٹ سکے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا کہ ہم کو شعیب نے خبر دی ‘ اس سے زہری نے بیان کیا ‘ انہیں عمرو بن سفیان بن اسید بن جاریہ ثقفی نے خبر دی ‘ وہ بنی زہرہ کے حلیف تھے اور حضرت ابوہریرہ رضی اللہ عنہ کے دوست ‘ انہوں نے کہا کہ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ أَبِي سُفْيَانَ بْنِ أَسِيدِ بْنِ جَارِيَةَ الثَّقَفِيُّ ـ وَهْوَ حَلِيفٌ لِبَنِي زُهْرَةَ وَكَانَ مِنْ أَصْحَابِ أَبِي هُرَيْرَةَ ـ أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَشَرَةَ رَهْطٍ سَرِيَّةً عَيْنًا، وَأَمَّرَ عَلَيْهِمْ عَاصِمَ بْنَ ثَابِتٍ الأَنْصَارِيَّ جَدَّ عَاصِمِ بْنِ عُمَرَ، فَانْطَلَقُوا حَتَّى إِذَا كَانُوا بِالْهَدَأَةِ وَهْوَ بَيْنَ عُسْفَانَ وَمَكَّةَ ذُكِرُوا لِحَىٍّ مِنْ هُذَيْلٍ يُقَالُ لَهُمْ بَنُو لِحْيَانَ، فَنَفَرُوا لَهُمْ قَرِيبًا مِنْ مِائَتَىْ رَجُلٍ، كُلُّهُمْ رَامٍ، فَاقْتَصُّوا آثَارَهُمْ حَتَّى وَجَدُوا مَأْكَلَهُمْ تَمْرًا تَزَوَّدُوهُ مِنَ الْمَدِينَةِ فَقَالُوا هَذَا تَمْرُ يَثْرِبَ‏.‏ فَاقْتَصُّوا آثَارَهُمْ، فَلَمَّا رَآهُمْ عَاصِمٌ وَأَصْحَابُهُ لَجَئُوا إِلَى فَدْفَدٍ، وَأَحَاطَ بِهِمُ الْقَوْمُ فَقَالُوا لَهُمُ انْزِلُوا وَأَعْطُونَا بِأَيْدِيكُمْ، وَلَكُمُ الْعَهْدُ وَالْمِيثَاقُ، وَلاَ نَقْتُلُ مِنْكُمْ أَحَدًا‏.‏ قَالَ عَاصِمُ بْنُ ثَابِتٍ أَمِيرُ السَّرِيَّةِ أَمَّا أَنَا فَوَاللَّهِ لاَ أَنْزِلُ الْيَوْمَ فِي ذِمَّةِ كَافِرٍ، اللَّهُمَّ أَخْبِرْ عَنَّا نَبِيَّكَ‏.‏ فَرَمَوْهُمْ بِالنَّبْلِ، فَقَتَلُوا عَاصِمًا فِي سَبْعَةٍ، فَنَزَلَ إِلَيْهِمْ ثَلاَثَةُ رَهْطٍ بِالْعَهْدِ وَالْمِيثَاقِ، مِنْهُمْ خُبَيْبٌ الأَنْصَارِيُّ وَابْنُ دَثِنَةَ وَرَجُلٌ آخَرُ، فَلَمَّا اسْتَمْكَنُوا مِنْهُمْ أَطْلَقُوا أَوْتَارَ قِسِيِّهِمْ فَأَوْثَقُوهُمْ فَقَالَ الرَّجُلُ الثَّالِثُ هَذَا أَوَّلُ الْغَدْرِ، وَاللَّهِ لاَ أَصْحَبُكُمْ، إِنَّ فِي هَؤُلاَءِ لأُسْوَةً‏.‏ يُرِيدُ الْقَتْلَى، فَجَرَّرُوهُ وَعَالَجُوهُ عَلَى أَنْ يَصْحَبَهُمْ فَأَبَى فَقَتَلُوهُ، فَانْطَلَقُوا بِخُبَيْبٍ وَابْنِ دَثِنَةَ حَتَّى بَاعُوهُمَا بِمَكَّةَ بَعْدَ وَقْعَةِ بَدْرٍ، فَابْتَاعَ خُبَيْبًا بَنُو الْحَارِثِ بْنِ عَامِرِ بْنِ نَوْفَلِ بْنِ عَبْدِ مَنَافٍ، وَكَانَ خُبَيْبٌ هُوَ قَتَلَ الْحَارِثَ بْنَ عَامِرٍ يَوْمَ بَدْرٍ، فَلَبِثَ خُبَيْبٌ عِنْدَهُمْ أَسِيرًا، فَأَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عِيَاضٍ أَنَّ بِنْتَ الْحَارِثِ أَخْبَرَتْهُ أَنَّهُمْ حِينَ اجْتَمَعُوا اسْتَعَارَ مِنْهَا مُوسَى يَسْتَحِدُّ بِهَا فَأَعَارَتْهُ، فَأَخَذَ ابْنًا لِي وَأَنَا غَافِلَةٌ حِينَ أَتَاهُ قَالَتْ فَوَجَدْتُهُ مُجْلِسَهُ عَلَى فَخِذِهِ وَالْمُوسَى بِيَدِهِ، فَفَزِعْتُ فَزْعَةً عَرَفَهَا خُبَيْبٌ فِي وَجْهِي فَقَالَ تَخْشَيْنَ أَنْ أَقْتُلَهُ مَا كُنْتُ لأَفْعَلَ ذَلِكَ‏.‏ وَاللَّهِ مَا رَأَيْتُ أَسِيرًا قَطُّ خَيْرًا مِنْ خُبَيْبٍ، وَاللَّهِ لَقَدْ وَجَدْتُهُ يَوْمًا يَأْكُلُ مِنْ قِطْفِ عِنَبٍ فِي يَدِهِ، وَإِنَّهُ لَمُوثَقٌ فِي الْحَدِيدِ، وَمَا بِمَكَّةَ مِنْ ثَمَرٍ وَكَانَتْ تَقُولُ إِنَّهُ لَرِزْقٌ مِنَ اللَّهِ رَزَقَهُ خُبَيْبًا، فَلَمَّا خَرَجُوا مِنَ الْحَرَمِ لِيَقْتُلُوهُ فِي الْحِلِّ، قَالَ لَهُمْ خُبَيْبٌ ذَرُونِي أَرْكَعْ رَكْعَتَيْنِ‏.‏ فَتَرَكُوهُ، فَرَكَعَ رَكْعَتَيْنِ ثُمَّ قَالَ لَوْلاَ أَنْ تَظُنُّوا أَنَّ مَا بِي جَزَعٌ لَطَوَّلْتُهَا اللَّهُمَّ أَحْصِهِمْ عَدَدًا‏.‏ وَلَسْتُ أُبَالِي حِينَ أُقْتَلُ مُسْلِمًا عَلَى أَىِّ شِقٍّ كَانَ لِلَّهِ مَصْرَعِي وَذَلِكَ فِي ذَاتِ الإِلَهِ وَإِنْ يَشَأْ يُبَارِكْ عَلَى أَوْصَالِ شِلْوٍ مُمَزَّعِ فَقَتَلَهُ ابْنُ الْحَارِثِ، فَكَانَ خُبَيْبٌ هُوَ سَنَّ الرَّكْعَتَيْنِ لِكُلِّ امْرِئٍ مُسْلِمٍ قُتِلَ صَبْرًا، فَاسْتَجَابَ اللَّهُ لِعَاصِمِ بْنِ ثَابِتٍ يَوْمَ أُصِيبَ، فَأَخْبَرَ النَّبِيُّ صلى الله عليه وسلم أَصْحَابَهُ خَبَرَهُمْ وَمَا أُصِيبُوا، وَبَعَثَ نَاسٌ مِنْ كُفَّارِ قُرَيْشٍ إِلَى عَاصِمٍ حِينَ حُدِّثُوا أَنَّهُ قُتِلَ لِيُؤْتَوْا بِشَىْءٍ مِنْهُ يُعْرَفُ، وَكَانَ قَدْ قَتَلَ رَجُلاً مِنْ عُظَمَائِهِمْ يَوْمَ بَدْرٍ، فَبُعِثَ عَلَى عَاصِمٍ مِثْلُ الظُّلَّةِ مِنَ الدَّبْرِ، فَحَمَتْهُ مِنْ رَسُولِهِمْ، فَلَمْ يَقْدِرُوا عَلَى أَنْ يَقْطَعَ مِنْ لَحْمِهِ شَيْئًا‏.‏",
                "headingArabic": "هَلْ يَسْتَأْسِرُ الرَّجُلُ وَمَنْ لَمْ يَسْتَأْسِرْ، وَمَنْ رَكَعَ رَكْعَتَيْنِ عِنْدَ الْقَتْلِ",
                "headingUrdu": "موت سے پہلے دو رکعت نماز ادا کرنا",
                "headingEnglish": "The performance of a two Rak'a Salat before being put to death",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2910,
                "hadithNumber": "3046",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Free the captives, feed the hungry and pay a visit to the sick.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ”عانی “ یعنی قیدی کو چھڑایا کرو ‘ بھوکے کو کھلایا کرو ‘ بیمار کی عیادت کرو ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ انہوں نے کہا ہم سے جریر نے بیان کیا ۔ ان سے منصور نے بیان کیا ‘ان سے ابووائل نے بیان کیا اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا ‘ انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ فُكُّوا الْعَانِيَ ـ يَعْنِي الأَسِيرَ ـ وَأَطْعِمُوا الْجَائِعَ وَعُودُوا الْمَرِيضَ ‏\"‏‏.‏",
                "headingArabic": "فَكَاكِ الأَسِيرِ",
                "headingUrdu": "اسیر کی رہائی",
                "headingEnglish": "The freeing of a captive",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2911,
                "hadithNumber": "3047",
                "englishNarrator": "Narrated Abu Juhaifa رضی اللہ عنہ :",
                "hadithEnglish": "I asked `Ali رضی اللہ عنہ , \"Do you have the knowledge of any Divine Inspiration besides what is in Allah's Book?\" `Ali رضی اللہ عنہ replied, \"No, by Him Who splits the grain of corn and creates the soul. I don't think we have such knowledge, but we have the ability of understanding which Allah may endow a person with, so that he may understand the Qur'an, and we have what is written in this paper as well.\" I asked, \"What is written in this paper?\" He replied, \"(The regulations of) blood-money, the freeing of captives, and the judgment that no Muslim should be killed for killing an infidel.\"",
                "hadithUrdu": "میں نے حضرت علی رضی اللہ عنہ سے پوچھا ‘ آپ حضرات ( اہل بیت ) کے پاس کتاب اللہ کے سوا اور بھی کوئی وحی ہے ؟ آپ نے اس کا جواب دیا ۔ اس ذات کی قسم ! جس نے دانے کو ( زمین ) چیر کر ( نکالا ) اور جس نے روح کو پیدا کیا ‘ مجھے تو کوئی ایسی وحی معلوم نہیں ( جو قرآن میں نہ ہو ) البتہ سمجھ ایک دوسری چیز ہے ‘ جو اللہ کسی بندے کو قرآن میں عطا فرمائے ( قرآن سے طرح طرح کے مطالب نکالے ) یا جو اس ورق میں ہے ۔ میں نے پوچھا ‘ اس ورق میں کیا لکھا ہے ؟ انہوں نے بتلایا کہ دیت کے احکام اور قیدی کا چھڑانا اور مسلمان کا کافر کے بدلے میں نہ مارا جانا ‘ ( یہ مسائل اس ورق میں لکھے ہوئے ہیں اور بس ) ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ‘ کہا ہم سے زہیر نے بیان کیا ‘ ان سے مطرف نے بیان کیا‘ان سے عامر نے بیان کیا ‘ اور ان سے ابو جحیفہ رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مُطَرِّفٌ، أَنَّ عَامِرًا، حَدَّثَهُمْ عَنْ أَبِي جُحَيْفَةَ ـ رضى الله عنه ـ قَالَ قُلْتُ لِعَلِيٍّ ـ رضى الله عنه هَلْ عِنْدَكُمْ شَىْءٌ مِنَ الْوَحْىِ إِلاَّ مَا فِي كِتَابِ اللَّهِ قَالَ وَالَّذِي فَلَقَ الْحَبَّةَ وَبَرَأَ النَّسَمَةَ مَا أَعْلَمُهُ إِلاَّ فَهْمًا يُعْطِيهِ اللَّهُ رَجُلاً فِي الْقُرْآنِ، وَمَا فِي هَذِهِ الصَّحِيفَةِ‏.‏ قُلْتُ وَمَا فِي الصَّحِيفَةِ قَالَ الْعَقْلُ وَفَكَاكُ الأَسِيرِ، وَأَنْ لاَ يُقْتَلَ مُسْلِمٌ بِكَافِرٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2912,
                "hadithNumber": "3048",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Some Ansari men asked permission from Allah's Messenger (ﷺ) saying, \"O Allah's Messenger (ﷺ)! Allow us not to take the ransom of our nephew Al `Abbas. The Prophet (ﷺ) replied, \"Do not leave a single Dirham thereof.\"",
                "hadithUrdu": "انصار کے بعض لوگوں نے رسول کریم صلی اللہ علیہ وسلم سے اجازت چاہی اور عرض کیا یا رسول اللہ ! آپ صلی اللہ علیہ وسلم ہمیں اس کی اجازت دے دیں کہ ہم اپنے بھانجے عباس بن عبدالمطلب کا فدیہ معاف کر دیں ‘ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا ان کے فدیہ میں سے ایک درہم بھی نہ چھوڑو ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا ہم سے اسماعیل بن ابراہیم بن عقبہ نے بیان کیا ‘ ان سے موسیٰ بن عقبہ نے ‘ ان سے ابن شہاب نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ بْنِ عُقْبَةَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رِجَالاً، مِنَ الأَنْصَارِ اسْتَأْذَنُوا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالُوا يَا رَسُولَ اللَّهِ ائْذَنْ فَلْنَتْرُكْ لاِبْنِ أُخْتِنَا عَبَّاسٍ فِدَاءَهُ‏.‏ فَقَالَ ‏ \"‏ لاَ تَدَعُونَ مِنْهَا دِرْهَمًا ‏\"‏‏.‏",
                "headingArabic": "فِدَاءِ الْمُشْرِكِينَ",
                "headingUrdu": "مشرکین کا فدیہ",
                "headingEnglish": "The ransom of Al-Mushrikun",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2913,
                "hadithNumber": "3049",
                "englishNarrator": "Narrator Anas رضی اللہ عنہ :",
                "hadithEnglish": "\"Some wealth was brought to the Prophet (ﷺ) from Bahrain. Al `Abbas رضی اللہ عنہ came to him and said, 'O Allah's Messenger (ﷺ)! Give me (some of it), as I have paid my and `Aqil's ransom.' The Prophet (ﷺ) said, 'Take,' and gave him in his garment.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بحرین کا خراج آیا تو حضرت عباس رضی اللہ عنہ خدمت نبوی میں حاضر ہوئے اور عرض کیا ‘ یا رسول اللہ ! اس مال سے مجھے بھی دیجئیے کیونکہ ( بدر کے موقع پر ) میں نے اپنا اور عقیل دونوں کا فدیہ ادا کیا تھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ‘ پھر آپ لے لیں ‘ چنانچہ آپ صلی اللہ علیہ وسلم نے انہیں ان کے کپڑے میں نقدی کو بندھوا دیا ۔",
                "urduNarrator": "اور ابراہیم بن طہمان نے بیان کیا ‘ ان سے عبدالعزیز بن صہیب نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ إِبْرَاهِيمُ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِمَالٍ مِنَ الْبَحْرَيْنِ، فَجَاءَهُ الْعَبَّاسُ فَقَالَ يَا رَسُولَ اللَّهِ، أَعْطِنِي فَإِنِّي فَادَيْتُ نَفْسِي، وَفَادَيْتُ عَقِيلاً‏.‏ فَقَالَ ‏ \"‏ خُذْ ‏\"‏‏.‏ فَأَعْطَاهُ فِي ثَوْبِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2914,
                "hadithNumber": "3050",
                "englishNarrator": "Narrated Jubair:",
                "hadithEnglish": "When he came as the war captives of Badr, he heard the Prophet (ﷺ) reciting 'Surat-at-Tur' in the Maghrib prayer.",
                "hadithUrdu": "وہ بدر کے قیدیوں کو چھڑانے آنحضرت صلی اللہ علیہ وسلم کے پاس آئے ( وہ ابھی اسلام نہیں لائے تھے ) انہوں نے بیان کیا کہ میں نے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے مغرب کی نماز میں سورۃ الطور پڑھی ۔",
                "urduNarrator": "مجھ سے محمود بن غیلان نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں زہری نے ‘ انہیں محمد بن جبیر نے ‘ انہیں ان کے باپ ( جبیر بن مطعم رضی اللہ عنہ ) نے",
                "hadithArabic": "حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ مُحَمَّدِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ ـ وَكَانَ جَاءَ فِي أُسَارَى بَدْرٍ ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ فِي الْمَغْرِبِ بِالطُّورِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2915,
                "hadithNumber": "3051",
                "englishNarrator": "Narrated Salama bin Al-Akwa` رضی اللہ عنہ reported from his father:",
                "hadithEnglish": "\"An infidel spy came to the Prophet (ﷺ) while he was on a journey. The spy sat with the companions of the Prophet (ﷺ) and started talking and then went away. The Prophet (ﷺ) said (to his companions), 'Chase and kill him.' So, I killed him.\" The Prophet (ﷺ) then gave him the belongings of the killed spy (in addition to his share of the war booty).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے پاس سفر میں مشرکوں کا ایک جاسوس آیا ۔ ( آپ صلی اللہ علیہ وسلم غزوہ ہوازن کے لئے تشریف لے جا رہے تھے ) وہ جاسوس صحابہ کی جماعت میں بیٹھا ‘ باتیں کیں ‘ پھر وہ واپس چلا گیا ‘ تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا ‘ کہ اسے تلاش کر کے مار ڈالو ۔ چنانچہ اسے ( سلمہ بن اکوع رضی اللہ عنہ نے ) قتل کر دیا ‘ اور آنحضرت صلی اللہ علیہ وسلم نے اس کے ہتھیار اور اوزار قتل کرنے والے کو دلوا دئیے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ‘ کہا ہم سے ابو عمیس عتبہ بن عبداللہ نے بیان کیا ‘ ان سے ایاس بن سلمہ بن اکوع رضی اللہ عنہ نے ‘ ان سے ان کے باپ ( سلمہ رضی اللہ عنہ ) نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا أَبُو الْعُمَيْسِ، عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الأَكْوَعِ، عَنْ أَبِيهِ، قَالَ أَتَى النَّبِيَّ صلى الله عليه وسلم عَيْنٌ مِنَ الْمُشْرِكِينَ وَهْوَ فِي سَفَرٍ، فَجَلَسَ عِنْدَ أَصْحَابِهِ يَتَحَدَّثُ ثُمَّ انْفَتَلَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اطْلُبُوهُ وَاقْتُلُوهُ ‏\"‏‏.‏ فَقَتَلَهُ فَنَفَّلَهُ سَلَبَهُ‏.‏",
                "headingArabic": "الْحَرْبِيِّ إِذَا دَخَلَ دَارَ الإِسْلاَمِ بِغَيْرِ أَمَانٍ",
                "headingUrdu": "اگر کوئی کافر جنگجو کسی اسلامی سرزمین میں آجائے",
                "headingEnglish": "If an infidel warrior comes in an Islamic territory",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2916,
                "hadithNumber": "3052",
                "englishNarrator": "Narrated `Amr bin Maimun:",
                "hadithEnglish": "`Umar رضی اللہ عنہ (after he was stabbed), instructed (his would-be-successor) saying, \"I urge him (i.e. the new Caliph) to take care of those non-Muslims who are under the protection of Allah and His Apostle in that he should observe the convention agreed upon with them, and fight on their behalf (to secure their safety) and he should not over-tax them beyond their capability.\"",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ نے ( وفات سے تھوڑی دیر پہلے ) فرمایا کہ میں اپنے بعد آنے والے خلیفہ کو اس کی وصیت کرتا ہوں کہ اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم کا ( ذمیوں سے ) جو عہد ہے اس کو وہ پورا کرے اور یہ کہ ان کی حمایت میں ان کے دشمنوں سے جنگ کرے اور ان کی طاقت سے زیادہ کوئی بوجھ ان پر نہ ڈالا جائے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابو عوانہ نے بیان کیا ‘ انہیں حصین بن عبدالرحمٰن نے ‘ ان سے عمرو بن میمون نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ حُصَيْنٍ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عُمَرَ ـ رضى الله عنه ـ قَالَ وَأُوصِيهِ بِذِمَّةِ اللَّهِ وَذِمَّةِ رَسُولِهِ صلى الله عليه وسلم أَنْ يُوفَى لَهُمْ بِعَهْدِهِمْ، وَأَنْ يُقَاتَلَ مِنْ وَرَائِهِمْ، وَلاَ يُكَلَّفُوا إِلاَّ طَاقَتَهُمْ‏.‏",
                "headingArabic": "يُقَاتَلُ عَنْ أَهْلِ الذِّمَّةِ، وَلاَ يُسْتَرَقُّونَ",
                "headingUrdu": "ذمی کے تحفظ کے لیے لڑنا چاہیے۔",
                "headingEnglish": "One should fight for the protection of the Dhimmi",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2917,
                "hadithNumber": "3053",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"Thursday! What (great thing) took place on Thursday!\" Then he started weeping till his tears wetted the gravels of the ground . Then he said, \"On Thursday the illness of Allah's Messenger (ﷺ) was aggravated and he said, \"Fetch me writing materials so that I may have something written to you after which you will never go astray.\" The people (present there) differed in this matter and people should not differ before a prophet. They said, \"Allah's Messenger (ﷺ) is seriously sick.' The Prophet (ﷺ) said, \"Let me alone, as the state in which I am now, is better than what you are calling me for.\" The Prophet (ﷺ) on his death-bed, gave three orders saying, \"Expel the pagans from the Arabian Peninsula, respect and give gifts to the foreign delegates as you have seen me dealing with them.\" I forgot the third (order)\" (Ya'qub bin Muhammad said, \"I asked Al-Mughira bin `Abdur-Rahman about the Arabian Peninsula and he said, 'It comprises Mecca, Medina, Al-Yama-ma and Yemen.\" Ya'qub added, \"And Al-Arj, the beginning of Tihama.\")",
                "hadithUrdu": "جمعرات کے دن ‘ اور معلوم ہے جمعرات کا دن کیا ہے ؟ پھر آپ اتنا روئے کہ کنکریاں تک بھیگ گئیں ۔ آخر آپ نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کی بیماری میں شدت اسی جمعرات کے دن ہوئی تھی ۔ تو آپ صلی اللہ علیہ وسلم نے صحابہ سے فرمایا کہ قلم دوات لاؤ ‘ تاکہ میں تمہارے لئے ایک ایسی کتاب لکھوا جاؤں کہ تم ( میرے بعد اس پر چلتے رہو تو ) کبھی گمراہ نہ ہو سکو اس پر صحابہ میں اختلاف ہو گیا ۔ آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ نبی کے سامنے جھگڑنا مناسب نہیں ہے ۔ صحابہ نے کہا کہ نبی کریم صلی اللہ علیہ وسلم ( بیماری کی شدت سے ) ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اچھا ‘ اب مجھے میری حالت پر چھوڑ دو ‘ میں جس حال میں اس وقت ہوں وہ اس سے بہتر ہے جو تم کرانا چاہتے ہو ۔ آخر آپ صلی اللہ علیہ وسلم نے اپنی وفات کے وقت تین وصیتیں فرمائی تھیں ۔ یہ مشرکین کو جزیرہ عرب سے باہر کر دینا ۔ دوسرے یہ کہ وفود سے ایسا ہی سلوک کرتے رہنا ‘ جیسے میں کرتا رہا ( ان کی خاطرداری ضیافت وغیرہ ) اور تیسری ہدایت میں بھول گیا ۔ اور یعقوب بن محمد نے بیان کیا کہ میں نے مغیرہ بن عبدالرحمٰن سے جزیرہ عرب کے بارے میں پوچھا تو انہوں نے فرمایا کہا مکہ ‘ مدینہ ‘ یمامہ اور یمن ( کا نام جزیرہ عرب ) ہے ۔ اور یعقوب نے کہا کہ عرج سے تہامہ شروع ہوتا ہے ۔ ( عرج مکہ اور مدینہ کے راستے میں ایک منزل کا نام ہے )",
                "urduNarrator": "ہم سے قبیصہ نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے سلیمان احول نے ‘ ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ سُلَيْمَانَ الأَحْوَلِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ قَالَ يَوْمُ الْخَمِيسِ، وَمَا يَوْمُ الْخَمِيسِ ثُمَّ بَكَى حَتَّى خَضَبَ دَمْعُهُ الْحَصْبَاءَ فَقَالَ اشْتَدَّ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَجَعُهُ يَوْمَ الْخَمِيسِ فَقَالَ ‏\"‏ ائْتُونِي بِكِتَابٍ أَكْتُبْ لَكُمْ كِتَابًا لَنْ تَضِلُّوا بَعْدَهُ أَبَدًا ‏\"‏‏.‏ فَتَنَازَعُوا وَلاَ يَنْبَغِي عِنْدَ نَبِيٍّ تَنَازُعٌ فَقَالُوا هَجَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ ‏\"‏ دَعُونِي فَالَّذِي أَنَا فِيهِ خَيْرٌ مِمَّا تَدْعُونِي إِلَيْهِ ‏\"‏‏.‏ وَأَوْصَى عِنْدَ مَوْتِهِ بِثَلاَثٍ ‏\"‏ أَخْرِجُوا الْمُشْرِكِينَ مِنْ جَزِيرَةِ الْعَرَبِ، وَأَجِيزُوا الْوَفْدَ بِنَحْوِ مَا كُنْتُ أُجِيزُهُمْ ‏\"‏‏.‏ وَنَسِيتُ الثَّالِثَةَ‏.‏ وَقَالَ يَعْقُوبُ بْنُ مُحَمَّدٍ سَأَلْتُ الْمُغِيرَةَ بْنَ عَبْدِ الرَّحْمَنِ عَنْ جَزِيرَةِ الْعَرَبِ‏.‏ فَقَالَ مَكَّةُ وَالْمَدِينَةُ وَالْيَمَامَةُ وَالْيَمَنُ‏.‏ وَقَالَ يَعْقُوبُ وَالْعَرْجُ أَوَّلُ تِهَامَةَ‏.‏",
                "headingArabic": "هَلْ يُسْتَشْفَعُ إِلَى أَهْلِ الذِّمَّةِ وَمُعَامَلَتِهِمْ",
                "headingUrdu": "کیا کوئی ذمی کی شفاعت کرسکتا ہے یا ان کے ساتھ معاملہ کرسکتا ہے؟",
                "headingEnglish": "Can one intercede for the Dhimmi or deal with them?",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2918,
                "hadithNumber": "3054",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "`Umar رضی اللہ عنہ saw a silken cloak being sold in the market and he brought it to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Buy this cloak and adorn yourself with it on the `Id festivals and on meeting the delegations.\" Allah's Messenger (ﷺ) replied, \"This is the dress for the one who will have no share in the Hereafter (or, this is worn by one who will have no share in the Hereafter).\" After sometime had passed, Allah's Messenger (ﷺ) sent a silken cloak to `Umar رضی اللہ عنہ . `Umar رضی اللہ عنہ took it and brought it to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! You have said that this is the dress of that who will have no share in the Hereafter (or, this is worn by one who will have no share in the Hereafter), yet you have sent me this!\" The Prophet (ﷺ) said,\" I have sent it) so that you may sell it or fulfill with it some of your needs.\"",
                "hadithUrdu": "عمر رضی اللہ عنہ نے دیکھا کہ بازار میں ایک ریشمی جوڑا فروخت ہو رہا ہے ۔ پھر اسے وہ رسول خدا صلی اللہ علیہ وسلم کی خدمت میں لائے اور عرض کیا یا رسول اللہ ! یہ جوڑا آپ خرید لیں اور عید اور وفود کی ملاقات پر اس سے اپنی زیبائش فرمایا کریں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا یہ ان لوگوں کا لباس ہے جن کا ( آخرت میں ) کوئی حصہ نہیں یا ( آپ نے یہ جملہ فرمایا ) اسے تو وہی لوگ پہن سکتے ہیں جن کا ( آخرت میں ) کوئی حصہ نہیں ۔ پھر اللہ نے جتنے دنوں چاہا حضرت عمر رضی اللہ عنہ خاموش رہے ۔ پھر جب ایک دن رسول اللہ صلی اللہ علیہ وسلم نے ان کے پاس ایک ریشمی جبہ بھیجا تو حضرت عمر رضی اللہ عنہ اسے لے کر خدمت نبوی میں حاضر ہوئے اور عرض کیا ‘ یا رسول اللہ ! آپ صلی اللہ علیہ وسلم نے تو یہ فرمایا تھا کہ یہ ان کا لباس ہے جن کا ( آخرت میں ) کوئی حصہ نہیں ‘ یا ( عمر رضی اللہ عنہ نے آپ کی بات اس طرح دہرائی کہ ) اسے وہی لوگ پہن سکتے ہیں جن کا ( آخرت میں ) کوئی حصہ نہیں ۔ اور پھر آپ صلی اللہ علیہ وسلم نے یہی میرے پاس ارسال فرما دیا ۔ اس پر آپ نے فرمایا کہ ( میرے بھیجنے کا مقصد یہ تھا کہ ) تم اسے بیچ لو ‘ یا ( فرمایا کہ ) اس سے اپنی کوئی ضرورت پوری کر سکو ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے بیان کیا ‘ ان سے عقیل نے ‘ ان سے ابن شہاب نے ‘ ان سے سالم بن عبداللہ نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ وَجَدَ عُمَرُ حُلَّةَ إِسْتَبْرَقٍ تُبَاعُ فِي السُّوقِ فَأَتَى بِهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، ابْتَعْ هَذِهِ الْحُلَّةَ فَتَجَمَّلْ بِهَا لِلْعِيدِ وَلِلْوُفُودِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا هَذِهِ لِبَاسُ مَنْ لاَ خَلاَقَ لَهُ، أَوْ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لاَ خَلاَقَ لَهُ ‏\"‏‏.‏ فَلَبِثَ مَا شَاءَ اللَّهُ ثُمَّ أَرْسَلَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم بِجُبَّةِ دِيبَاجٍ، فَأَقْبَلَ بِهَا عُمَرُ حَتَّى أَتَى بِهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، قُلْتَ ‏\"‏ إِنَّمَا هَذِهِ لِبَاسُ مَنْ لاَ خَلاَقَ لَهُ أَوْ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لا خَلاَقَ لَهُ ‏\"‏‏.‏ ثُمَّ أَرْسَلْتَ إِلَىَّ بِهَذِهِ فَقَالَ ‏\"‏ تَبِيعُهَا، أَوْ تُصِيبُ بِهَا بَعْضَ حَاجَتِكَ ‏\"‏‏.‏",
                "headingArabic": "التَّجَمُّلِ لِلْوُفُودِ",
                "headingUrdu": "وفد کے استقبال سے پہلے خود کو تیار کرنا",
                "headingEnglish": "Sprucing oneself up before receiving a delegation",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2919,
                "hadithNumber": "3055",
                "englishNarrator": "Narrated Ibn 'Umar رضی اللہ عنہما :",
                "hadithEnglish": "Umar رضی اللہ عنہ and a group of the companions of the Prophet (ﷺ) set out with the Prophet to Ibn Saiyad. He found him playing with some boys near the hillocks of Bani Maghala. Ibn Saiyad at that time was nearing his puberty. He did not notice (the Prophet's presence) till the Prophet (ﷺ) stroked him on the back with his hand and said, \"Ibn Saiyad! Do you testify that I am Allah's Messenger (ﷺ)?\" Ibn Saiyad looked at him and said, \"I testify that you are the Apostle of the illiterates.\" Then Ibn Saiyad asked the Prophet. \"Do you testify that I am the apostle of Allah?\" The Prophet (ﷺ) said to him, \"I believe in Allah and His Apostles.\" Then the Prophet (ﷺ) said (to Ibn Saiyad). \"What do you see?\" Ibn Saiyad replied, \"True people and false ones visit me.\" The Prophet said, \"Your mind is confused as to this matter.\" The Prophet (ﷺ) added, \" I have kept something (in my mind) for you.\" Ibn Saiyad said, \"It is Ad-Dukh.\" The Prophet (ﷺ) said (to him), \"Shame be on you! You cannot cross your limits.\" On that 'Umar said, \"O Allah's Messenger (ﷺ)! Allow me to chop his head off.\" The Prophet (ﷺ) said, \"If he should be him (i.e. Ad-Dajjal) then you cannot overpower him, and should he not be him, then you are not going to benefit by murdering him.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے ساتھ صحابہ کی ایک جماعت جن میں حضرت عمر رضی اللہ عنہ بھی شامل تھے ‘ ابن صیاد ( یہودی لڑکا ) کے یہاں جا رہی تھی ۔ آخر بنو مغالہ ( ایک انصاری قبیلے ) کے ٹیلوں کے پاس بچوں کے ساتھ کھیلتے ہوئے اسے ان لوگوں نے پا لیا ‘ ابن صیاد بالغ ہونے کے قریب تھا ۔ اسے ( رسول کریم صلی اللہ علیہ وسلم کی آمد کا ) پتہ نہیں ہوا ۔ آنحضرت صلی اللہ علیہ وسلم نے ( اس کے قریب پہنچ کر ) اپنا ہاتھ اس کی پیٹھ پر مارا ‘ اور فرمایا کیا تو اس کی گواہی دیتا ہے کہ میں اللہ کا رسول ہوں ۔ ابن صیاد نے آپ کی طرف دیکھا ‘ پھر کہنے لگا ۔ ہاں ! میں گواہی دیتا ہوں کہ آپ ان پڑھوں کے نبی ہیں ۔ اس کے بعد اس نے آنحضرت صلی اللہ علیہ وسلم سے پوچھا کیا آپ گواہی دیتے ہیں کہ میں اللہ کا رسول ہوں ؟ آپ نے اس کا جواب ( صرف اتنا ) دیا کہ میں اللہ اور اس کے ( سچے ) انبیاء پر ایمان لایا ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ‘ تو کیا دیکھتا ہے ؟ اس نے کہا کہ میرے پاس ایک خبر سچی آتی ہے تو دوسری جھوٹی بھی ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا ‘ کہ حقیقت حال تجھ پر مشتبہ ہو گئی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس سے فرمایا ‘ اچھا میں نے تیرے لئے اپنے دل میں ایک بات سوچی ہے ( بتا وہ کیا ہے ؟ ) ابن صیاد بولا کہ دھواں ، حضور اکرم صلی اللہ علیہ وسلم نے فرمایا ‘ ذلیل ہو ‘ کمبخت ! تو اپنی حیثیت سے آگے نہ بڑھ سکے گا ۔ حضرت عمر رضی اللہ عنہ نے عرض کیا ‘ یا رسول اللہ ! مجھے اجازت ہو تو میں اس کی گردن مار دوں لیکن آنحضرت صلی اللہ علیہ وسلم نے فرمایا ‘ اگر یہ وہی ( دجال ) ہے تو تم اس پر قادر نہیں ہو سکتے اور اگر دجال نہیں ہے تو اس کی جان لینے میں کوئی خیر نہیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ‘ کہا ہم سے ہشام بن یوسف نے بیان کیا ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں زہری نے ‘ انہیں سالم بن عبداللہ نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ أَخْبَرَهُ أَنَّ عُمَرَ انْطَلَقَ فِي رَهْطٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مَعَ النَّبِيِّ صلى الله عليه وسلم قِبَلَ ابْنِ صَيَّادٍ حَتَّى وَجَدُوهُ يَلْعَبُ مَعَ الْغِلْمَانِ عِنْدَ أُطُمِ بَنِي مَغَالَةَ، وَقَدْ قَارَبَ يَوْمَئِذٍ ابْنُ صَيَّادٍ يَحْتَلِمُ، فَلَمْ يَشْعُرْ حَتَّى ضَرَبَ النَّبِيُّ صلى الله عليه وسلم ظَهْرَهُ بِيَدِهِ ثُمَّ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏‏.‏ فَنَظَرَ إِلَيْهِ ابْنُ صَيَّادٍ فَقَالَ أَشْهَدُ أَنَّكَ رَسُولُ الأُمِّيِّينَ‏.‏ فَقَالَ ابْنُ صَيَّادٍ لِلنَّبِيِّ صلى الله عليه وسلم أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ‏.‏ قَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ آمَنْتُ بِاللَّهِ وَرُسُلِهِ ‏\"‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَاذَا تَرَى ‏\"‏‏.‏ قَالَ ابْنُ صَيَّادٍ يَأْتِينِي صَادِقٌ وَكَاذِبٌ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ خُلِطَ عَلَيْكَ الأَمْرُ ‏\"‏‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنِّي قَدْ خَبَأْتُ لَكَ خَبِيئًا ‏\"‏‏.‏ قَالَ ابْنُ صَيَّادٍ هُوَ الدُّخُّ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اخْسَأْ فَلَنْ تَعْدُوَ قَدْرَكَ ‏\"‏‏.‏ قَالَ عُمَرُ يَا رَسُولَ اللَّهِ، ائْذَنْ لِي فِيهِ أَضْرِبْ عُنُقَهُ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنْ يَكُنْهُ فَلَنْ تُسَلَّطَ عَلَيْهِ، وَإِنْ لَمْ يَكُنْهُ فَلاَ خَيْرَ لَكَ فِي قَتْلِهِ ‏\"‏‏.‏",
                "headingArabic": "كَيْفَ يُعْرَضُ الإِسْلاَمُ عَلَى الصَّبِيِّ",
                "headingUrdu": "ایک (غیر مسلم) لڑکے کے سامنے اسلام کیسے پیش کیا جائے؟",
                "headingEnglish": "How to present Islam to a (non-Muslim) boy",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2920,
                "hadithNumber": "3056, 3057",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "(Later on) Allah's Messenger (ﷺ) (once again) went along with Ubai bin Ka'b رضی اللہ عنہ to the garden of date-palms where Ibn Saiyad was staying. When the Prophet entered the garden, he started hiding himself behind the trunks of the date-palms as he wanted to hear something from the Ibn Saiyad before the latter could see him. Ibn Saiyad was lying in his bed, covered with a velvet sheet from where his murmurs were heard. Ibn Saiyad's mother saw the Prophet (ﷺ) while he was hiding himself behind the trunks of the date-palms. She addressed Ibn Saiyad, \"O Saf!\" (And this was his name). Ibn Saiyad got up. The Prophet (ﷺ) said, \"Had this woman let him to himself, he would have revealed the reality of his case.\" Then the Prophet (ﷺ) got up amongst the people, glorifying Allah as He deserves, he mentioned Ad-Dajjal, saying, \"I warn you about him (i.e. Ad-Dajjal) and there is no prophet who did not warn his nation about him, and Noah warned his nation about him, but I tell you a statement which no prophet informed his nation of. You should understand that he is a one-eyed man and Allah is not one-eyed.\"",
                "hadithUrdu": "( ایک مرتبہ ) ابی بن کعب رضی اللہ عنہ کو ساتھ لے کر آنحضرت صلی اللہ علیہ وسلم اس کھجور کے باغ میں تشریف لائے جس میں ابن صیاد موجود تھا ۔ جب آپ صلی اللہ علیہ وسلم باغ میں داخل ہو گئے تو کجھور کے تنوں کی آڑ لیتے ہوئے آپ صلی اللہ علیہ وسلم آگے بڑھنے لگے ۔ آپ چاہتے یہ تھے کہ اسے آپ کی موجودگی کا احساس نہ ہو سکے اور آپ اس کی باتیں سن لیں ۔ ابن صیاد اس وقت اپنے بستر پر ایک چادر اوڑھے پڑا تھا اور کچھ گنگنا رہا تھا ۔ اتنے میں اس کی ماں آنحضور صلی اللہ علیہ وسلم کو دیکھ لیا کہ آپ کھجور کے تنوں کی آڑ لے کر آگے آ رہے ہیں اور اسے آگاہ کر دیا کہ اے صاف ! یہ اس کا نام تھا ۔ ابن صیاد یہ سنتے ہی اچھل پڑا ۔ آنحضرت نے فرمایا ‘ اگر اس کی ماں نے اسے یوں ہی رہنے دیا ہوتا تو حقیقت کھل جاتی ۔ سالم نے بیان کیا ‘ ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے صحابہ کو خطاب فرمایا ‘ آپ نے اللہ تعالیٰ کی ثناء بیان کی ‘ جو اس کی شان کے لائق تھی ۔ پھر دجال کا ذکر فرمایا ‘ اور فرمایا کہ میں بھی تمہیں اس کے ( فتنوں سے ) ڈراتا ہوں ‘ کوئی نبی ایسا نہیں گزرا جس نے اپنی قوم کو اس کے فتنوں سے نہ ڈرایا ہو ‘ نوح علیہ السلام نے بھی اپنی قوم کو اس سے ڈرایا تھا لیکن میں اس کے بارے میں تم سے ایک ایسی بات کہوں گا جو کسی نبی نے اپنی قوم سے نہیں کہی ‘ اور وہ بات یہ ہے کہ دجال کانا ہو گا اور اللہ تعالیٰ اس سے پاک ہے ۔",
                "urduNarrator": "عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "قَالَ ابْنُ عُمَرَ انْطَلَقَ النَّبِيُّ صلى الله عليه وسلم وَأُبَىُّ بْنُ كَعْبٍ يَأْتِيَانِ النَّخْلَ الَّذِي فِيهِ ابْنُ صَيَّادٍ، حَتَّى إِذَا دَخَلَ النَّخْلَ طَفِقَ النَّبِيُّ صلى الله عليه وسلم يَتَّقِي بِجُذُوعِ النَّخْلِ وَهْوَ يَخْتِلُ ابْنَ صَيَّادٍ أَنْ يَسْمَعَ مِنِ ابْنِ صَيَّادٍ شَيْئًا قَبْلَ أَنْ يَرَاهُ، وَابْنُ صَيَّادٍ مُضْطَجِعٌ عَلَى فِرَاشِهِ فِي قَطِيفَةٍ لَهُ فِيهَا رَمْزَةٌ، فَرَأَتْ أُمُّ ابْنِ صَيَّادٍ النَّبِيَّ صلى الله عليه وسلم وَهْوَ يَتَّقِي بِجُذُوعِ النَّخْلِ، فَقَالَتْ لاِبْنِ صَيَّادٍ أَىْ صَافِ ـ وَهْوَ اسْمُهُ ـ فَثَارَ ابْنُ صَيَّادٍ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ تَرَكَتْهُ بَيَّنَ ‏\"‏‏. وَقَالَ سَالِمٌ قَالَ ابْنُ عُمَرَ ثُمَّ قَامَ النَّبِيُّ صلى الله عليه وسلم فِي النَّاسِ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ، ثُمَّ ذَكَرَ الدَّجَّالَ فَقَالَ ‏\"‏ إِنِّي أُنْذِرُكُمُوهُ، وَمَا مِنْ نَبِيٍّ إِلاَّ قَدْ أَنْذَرَهُ قَوْمَهُ، لَقَدْ أَنْذَرَهُ نُوحٌ قَوْمَهُ، وَلَكِنْ سَأَقُولُ لَكُمْ فِيهِ قَوْلاً لَمْ يَقُلْهُ نَبِيٌّ لِقَوْمِهِ، تَعْلَمُونَ أَنَّهُ أَعْوَرُ وَأَنَّ اللَّهَ لَيْسَ بِأَعْوَرَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2921,
                "hadithNumber": "3058",
                "englishNarrator": "Narrated Usama bin Zaid رضی اللہ عنہما :",
                "hadithEnglish": "I asked the Prophet (ﷺ) during his Hajj, \"O Allah's Messenger (ﷺ)! Where will you stay tomorrow?\" He said, \"Has `Aqil رضی اللہ عنہ left for us any house?\" He then added, \"Tomorrow we will stay at Khaif Bani Kinana, i.e. Al-Muhassab, where (the Pagans of) Quraish took an oath of Kufr (i.e. to be loyal to heathenism) in that Bani Kinana got allied with Quraish against Bani Hashim on the terms that they would not deal with the members of the is tribe or give them shelter.\" (Az-Zuhri said, \"Khaif means valley.\") (See Hadith No. 659, Vol. 2)",
                "hadithUrdu": "میں نے حجۃ الوداع کے موقع پر عرض کیا ‘ یا رسول اللہ ! کل آپ ( مکہ میں ) کہاں قیام فرمائیں گے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ! عقیل رضی اللہ عنہ نے ہمارے لئے کوئی گھر چھوڑا ہی کب ہے ۔ پھر فرمایا کہ کل ہمارا قیام حنیف بن کنانہ کے مقام محصب میں ہو گا ‘ جہاں پر قریش نے کفر پر قسم کھائی تھی ۔ واقعہ یہ ہوا تھا کہ بنی کنانہ اور قریش نے ( یہیں پر ) بنی ہاشم کے خلاف اس بات کی قسمیں کھائی تھیں کہ ان سے خریدوفروخت کی جائے اور نہ انہیں اپنے گھروں میں آنے دیں ۔ زہری نے کہا کہ خیف وادی کو کہتے ہیں ۔",
                "urduNarrator": "ہم سے محمود بن غیلان نے بیان کیا ‘ انہوں نے کہا ہم کو عبدالرزاق نے خبر دی ‘ انہوں نے کہا ہم کو معمر نے خبر دی انہیں زہری نے ‘ انہیں علی بن حسین نے ‘ انہیں عمرو بن عثمان بن عفان رضی اللہ عنہ نے اور ان سے اسامہ بن زید رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مَحْمُودٌ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ عَمْرِو بْنِ عُثْمَانَ بْنِ عَفَّانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ، أَيْنَ تَنْزِلُ غَدًا فِي حَجَّتِهِ‏.‏ قَالَ ‏\"‏ وَهَلْ تَرَكَ لَنَا عَقِيلٌ مَنْزِلاً ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏نَحْنُ نَازِلُونَ غَدًا بِخَيْفِ بَنِي كِنَانَةَ الْمُحَصَّبِ، حَيْثُ قَاسَمَتْ قُرَيْشٌ عَلَى الْكُفْرِ ‏\"‏‏.‏ وَذَلِكَ أَنَّ بَنِي كِنَانَةَ حَالَفَتْ قُرَيْشًا عَلَى بَنِي هَاشِمٍ أَنْ لاَ يُبَايِعُوهُمْ وَلاَ يُئْوُوهُمْ‏.‏ قَالَ الزُّهْرِيُّ وَالْخَيْفُ الْوَادِي‏.‏",
                "headingArabic": "إِذَا أَسْلَمَ قَوْمٌ فِي دَارِ الْحَرْبِ، وَلَهُمْ مَالٌ وَأَرَضُونَ، فَهْىَ لَهُمْ",
                "headingUrdu": "اگر کسی دشمن غیر مسلم ملک میں کچھ لوگ اسلام قبول کر لیں اور ان کے پاس مال ہو۔",
                "headingEnglish": "If some people in a hostile non-Muslim country embrace Islam and they have possessions",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2922,
                "hadithNumber": "3059",
                "englishNarrator": "Narrated Aslam:",
                "hadithEnglish": "`Umar bin Al-Khattab رضی اللہ عنہ appointed a freed slave of his, called Hunai, manager of the Hima (i.e. a pasture devoted for grazing the animals of the Zakat or other specified animals). He said to him, \"O Hunai! Don't oppress the Muslims and ward off their curse (invocations against you) for the invocation of the oppressed is responded to (by Allah); and allow the shepherd having a few camels and those having a few sheep (to graze their animals), and take care not to allow the livestock of `Abdur-Rahman bin `Auf and the livestock of (`Uthman) bin `Affan, for if their livestock should perish, then they have their farms and gardens, while those who own a few camels and those who own a few sheep, if their livestock should perish, would bring their dependents to me and appeal for help saying, 'O chief of the believers! O chief of the believers!' Would I then neglect them? (No, of course). So, I find it easier to let them have water and grass rather than to give them gold and silver (from the Muslims' treasury). By Allah, these people think that I have been unjust to them. This is their land, and during the prelslamic period, they fought for it and they embraced Islam (willingly) while it was in their possession. By Him in Whose Hand my life is! Were it not for the animals (in my custody) which I give to be ridden for striving in Allah's Cause, I would not have turned even a span of their land into a Hima.\"",
                "hadithUrdu": "عمر بن خطاب رضی اللہ عنہ نے ہنی نامی اپنے ایک غلام کو ( سرکاری ) چراگاہ کا حاکم بنایا ‘ تو انہیں یہ ہدایت کی ‘ اے ہنی ! مسلمانوں سے اپنے ہاتھ روکے رکھنا ( ان پر ظلم نہ کرنا ) اور مظلوم کی بدعا سے ہر وقت بچتے رہنا ‘ کیونکہ مظلوم کی دعا قبول ہوتی ہے ۔ اور ہاں ابن عوف اور ابن عفان اور ان جیسے ( امیر صحابہ ) کے مویشیوں کے بارے میں تجھے ڈرتے رہنا چاہئے ۔ ( یعنی ان کے امیر ہونے کی وجہ سے دوسرے غریبوں کے مویشیوں پر چراگاہ میں انہیں مقدم نہ رکھنا ) کیونکہ اگر ان کے مویشی ہلاک بھی ہو جائیں گے تو یہ رؤسا اپنے کھجور کے باغات اور کھیتوں سے اپنی معاش حاصل کر سکتے ہیں ۔ لیکن گنے چنے اونٹوں اور گنی چنی بکریوں کا مالک ( غریب ) کہ اگر اس کے مویشی ہلاک ہو گئے ‘ تو وہ اپنے بچوں کو لے کر میرے پاس آئے گا ‘ اور فریاد کرے گا یا امیرالمؤمنین ! یا امیرالمؤمنین ! ( ان کو پالنا تیرا باپ نہ ہو ) تو کیا میں انہیں چھو ڑ دوں گا ؟ اس لئے ( پہلے ہی سے ) ان کیلئے چارے اور پانی کا انتظام کر دینا میرے لئے اس سے زیادہ آسان ہے کہ میں ان کیلئے سونے چاندی کا انتظام کروں اور خدا کی قسم ! وہ ( اہل مدینہ ) یہ سمجھتے ہوں گے کہ میں نے ان کے ساتھ زیادتی کی ہے کیونکہ یہ زمینیں انہیں کی ہیں ۔ انہوں نے جاہلیت کے زمانہ میں اس کے لئے لڑائیاں لڑیں ہیں اور اسلام لانے کے بعد بھی ان کی ملکیت کو بحال رکھا گیا ہے ۔ اس ذات کی قسم ! جس کے ہاتھ میں میری جان ہے اگر وہ اموال ( گھوڑے وغیرہ ) نہ ہوتے جن پر جہاد میں لوگوں کو سوار کرتا ہوں تو ان کے علاقوں میں ایک بالشت زمین کو بھی میں چراگاہ نہ بناتا ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا کہ مجھ سے امام مالک نے بیان کیا ‘ ان سے زید بن اسلم نے ‘ ان سے ان کے والد نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ اسْتَعْمَلَ مَوْلًى لَهُ يُدْعَى هُنَيًّا عَلَى الْحِمَى فَقَالَ يَا هُنَىُّ، اضْمُمْ جَنَاحَكَ عَنِ الْمُسْلِمِينَ، وَاتَّقِ دَعْوَةَ الْمَظْلُومِ، فَإِنَّ دَعْوَةَ الْمَظْلُومِ مُسْتَجَابَةٌ، وَأَدْخِلْ رَبَّ الصُّرَيْمَةِ وَرَبَّ الْغُنَيْمَةِ، وَإِيَّاىَ وَنَعَمَ ابْنِ عَوْفٍ، وَنَعَمَ ابْنِ عَفَّانَ، فَإِنَّهُمَا إِنْ تَهْلِكْ مَاشِيَتُهُمَا يَرْجِعَا إِلَى نَخْلٍ وَزَرْعٍ، وَإِنَّ رَبَّ الصُّرَيْمَةِ وَرَبَّ الْغُنَيْمَةِ إِنْ تَهْلِكْ مَاشِيَتُهُمَا يَأْتِنِي بِبَنِيهِ فَيَقُولُ يَا أَمِيرَ الْمُؤْمِنِينَ‏.‏ أَفَتَارِكُهُمْ أَنَا لاَ أَبَا لَكَ فَالْمَاءُ وَالْكَلأُ أَيْسَرُ عَلَىَّ مِنَ الذَّهَبِ وَالْوَرِقِ، وَايْمُ اللَّهِ، إِنَّهُمْ لَيَرَوْنَ أَنِّي قَدْ ظَلَمْتُهُمْ، إِنَّهَا لَبِلاَدُهُمْ فَقَاتَلُوا عَلَيْهَا فِي الْجَاهِلِيَّةِ، وَأَسْلَمُوا عَلَيْهَا فِي الإِسْلاَمِ، وَالَّذِي نَفْسِي بِيَدِهِ لَوْلاَ الْمَالُ الَّذِي أَحْمِلُ عَلَيْهِ فِي سَبِيلِ اللَّهِ مَا حَمَيْتُ عَلَيْهِمْ مِنْ بِلاَدِهِمْ شِبْرًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2923,
                "hadithNumber": "3060",
                "englishNarrator": "Narrated Hudhaifa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said (to us), \" List the names of those people who have announced that they are Muslims.\" So, we listed one thousand and five hundred men. Then we wondered, \"Should we be afraid (of infidels) although we are one thousand and five hundred in number?\" No doubt, we witnessed ourselves being afflicted with such bad trials that one would have to offer the prayer alone in fear. Narrated Al-A`mash: We (listed the Muslims and) found them five hundred. And Abu Mu'awiya said, Between six-hundred to seven-hundred.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا جو لوگ اسلام کا کلمہ پڑھ چکے ہیں ان کے نام لکھ کر میرے پاس لاؤ ۔ چنانچہ ہم نے ڈیڑھ ہزار مردوں کے نام لکھ کر آپ صلی اللہ علیہ وسلم کی خدمت میں پیش کئے اور ہم نے آنحضرت صلی اللہ علیہ وسلم سے عرض کیا ہماری تعداد ڈیڑھ ہزار ہو گئی ہے ۔ اب ہم کو کیا ڈر ہے ۔ لیکن تم دیکھ رہے ہو کہ ( آنحضرت صلی اللہ علیہ وسلم کے بعد ) ہم فتنوں میں اس طرح گھر گئے کہ اب مسلمان تنہا نماز پڑھتے ہوئے بھی ڈرنے لگا ہے ۔  ہم سے عبدان نے بیان کیا ‘ ان سے ابوحمزہ نے اور ان سے اعمش نے ( مذکورہ بالا سند کے ساتھ ) کہ ہم نے پانچ سو مسلمانوں کی تعداد لکھی ( ہزار کا ذکر اس روایت میں نہیں ہوا ) اور ابومعاویہ نے ( اپنی روایت میں ) یوں بیان کیا ‘ کہ چھ سو سے سات سو تک ۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا ‘ کہا ہم سے سفیان نے بیان کیا ‘ ان سے اعمش نے ‘ ان سے ابووائل نے اور ان سے حضرت حذیفہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ ، حَدَّثَنَا سُفْيَانُ ، عَنْ الْأَعْمَشِ ، عَنْ أَبِي وَائِلٍ ، عَنْ حُذَيْفَةَ رَضِيَ اللَّهُ عَنْهُ ، قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : اكْتُبُوا لِي مَنْ تَلَفَّظَ بِالْإِسْلَامِ مِنَ النَّاسِ فَكَتَبْنَا لَهُ أَلْفًا وَخَمْسَ مِائَةِ رَجُلٍ فَقُلْنَا نَخَافُ وَنَحْنُ أَلْفٌ وَخَمْسُ مِائَةٍ ، فَلَقَدْ رَأَيْتُنَا ابْتُلِينَا حَتَّى إِنَّ الرَّجُلَ لَيُصَلِّي وَحْدَهُ وَهُوَ خَائِفٌ ، حَدَّثَنَا عَبْدَانُ ، عَنْ أَبِي حَمْزَةَ ، عَنْ الْأَعْمَشِ فَوَجَدْنَاهُمْ خَمْسَ مِائَةٍ ، قَالَ أَبُو مُعَاوِيَةَ : مَا بَيْنَ سِتِّ مِائَةٍ إِلَى سَبْعِ مِائَةٍ.",
                "headingArabic": "كِتَابَةِ الإِمَامِ النَّاسَ",
                "headingUrdu": "امام کی طرف سے لوگوں کی فہرست",
                "headingEnglish": "The listing of the people by the Imam",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2924,
                "hadithNumber": "3061",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "A man came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I have enlisted in the army for such-andsuch Ghazwa, and my wife is leaving for Hajj.\" Allah's Messenger (ﷺ) said, \"Go back and perform Hajj with your wife.\"",
                "hadithUrdu": "ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا یا رسول اللہ ! میرا نام فلاں جہاد میں جانے کے لئے لکھا گیا ہے ۔ ادھر میری بیوی حج کرنے جا رہی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر جا اور اپنی بیوی کے ساتھ حج کرآ ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ‘ کہا ہم سے سفیان نے بیان کیا ‘ ان سے ابن جریج نے ‘ ان سے عمرو بن دینار نے ‘ ان سے ابو معبد نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي مَعْبَدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، إِنِّي كُتِبْتُ فِي غَزْوَةِ كَذَا وَكَذَا، وَامْرَأَتِي حَاجَّةٌ‏.‏ قَالَ ‏ \"‏ ارْجِعْ فَحُجَّ مَعَ امْرَأَتِكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2925,
                "hadithNumber": "3062",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "We were in the company of Allah's Messenger (ﷺ) in a Ghazwa, and he remarked about a man who claimed to be a Muslim, saying, \"This (man) is from the people of the (Hell) Fire.\" When the battle started, the man fought violently till he got wounded. Somebody said, \"O Allah's Messenger (ﷺ)! The man whom you described as being from the people of the (Hell) Fire fought violently today and died.\" The Prophet (ﷺ) said, \"He will go to the (Hell) Fire.\" Some people were on the point of doubting (the truth of what the Prophet had said) while they were in this state, suddenly someone said that he was still alive but severely wounded. When night fell, he lost patience and committed suicide. The Prophet (ﷺ) was informed of that, and he said, \"Allah is Greater! I testify that I am Allah's Slave and His Apostle.\" Then he ordered Bilal  رضی اللہ عنہ to announce amongst the people: 'None will enter Paradise but a Muslim, and Allah may support this religion (i.e. Islam) even with a disobedient man.'",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ میں موجود تھے ۔ آپ صلی اللہ علیہ وسلم نے ایک شخص کے متعلق جو اپنے کو مسلمان کہتا تھا ‘ فرمایا کہ یہ شخص دوزخ والوں میں سے ہے ۔ جب جنگ شروع ہوئی تو وہ شخص ( مسلمانوں کی طرف ) بڑی بہادری کے ساتھ لڑا اور وہ زخمی بھی ہو گیا ۔ صحابہ نے عرض کیا ‘ یا رسول اللہ ! جس کے متعلق آپ نے فرمایا تھا کہ وہ دوزخ میں جائے گا ۔ آج تو وہ بڑی بے جگری کے ساتھ لڑا ہے اور ( زخمی ہو کر ) مر بھی گیا ہے ۔ آپ صلی اللہ علیہ وسلم نے اب بھی وہی جواب دیا کہ جہنم میں گیا ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا ‘ کہ ممکن تھا کہ بعض لوگوں کے دل میں کچھ شبہ پیدا ہو جاتا ۔ لیکن ابھی لوگ اسی غور و فکر میں تھے کہ کسی نے بتایا کہ ابھی وہ مرا نہیں ہے ۔ البتہ زخم کاری ہے ۔ پھر جب رات آئی تو اس نے زخموں کی تاب نہ لا کر خودکشی کر لی ۔ جب آنحضرت صلی اللہ علیہ وسلم کو اس کی خبر دی گئی تو آپ نے فرمایا اللہ اکبر ! میں گواہی دیتا ہوں کہ میں اللہ کا بندہ اور اس کا رسول ہوں ۔ پھر آپ نے بلال رضی اللہ عنہ کو حکم دیا ‘ اور انہوں نے لوگوں میں اعلان کر دیا کہ مسلمان کے سوا جنت میں کوئی اور داخل نہیں ہو گا اور اللہ تعالیٰ کبھی اپنے دین کی امداد کسی فاجر شخص سے بھی کرا لیتا ہے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ( دوسری سند ) مجھ سے محمود بن غیلان نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ‘ انہیں معمر نے خبر دی ‘ انہیں زہری نے ‘ انہیں ابن مسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، ح وَحَدَّثَنِي مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ شَهِدْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لِرَجُلٍ مِمَّنْ يَدَّعِي الإِسْلاَمَ ‏\"‏ هَذَا مِنْ أَهْلِ النَّارِ ‏\"‏‏.‏ فَلَمَّا حَضَرَ الْقِتَالُ قَاتَلَ الرَّجُلُ قِتَالاً شَدِيدًا، فَأَصَابَتْهُ جِرَاحَةٌ فَقِيلَ يَا رَسُولَ اللَّهِ، الَّذِي قُلْتَ إِنَّهُ مِنْ أَهْلِ النَّارِ فَإِنَّهُ قَدْ قَاتَلَ الْيَوْمَ قِتَالاً شَدِيدًا وَقَدْ مَاتَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِلَى النَّارِ ‏\"‏‏.‏ قَالَ فَكَادَ بَعْضُ النَّاسِ أَنْ يَرْتَابَ، فَبَيْنَمَا هُمْ عَلَى ذَلِكَ إِذْ قِيلَ إِنَّهُ لَمْ يَمُتْ، وَلَكِنَّ بِهِ جِرَاحًا شَدِيدًا‏.‏ فَلَمَّا كَانَ مِنَ اللَّيْلِ لَمْ يَصْبِرْ عَلَى الْجِرَاحِ، فَقَتَلَ نَفْسَهُ، فَأُخْبِرَ النَّبِيُّ صلى الله عليه وسلم بِذَلِكَ فَقَالَ ‏\"‏ اللَّهُ أَكْبَرُ، أَشْهَدُ أَنِّي عَبْدُ اللَّهِ وَرَسُولُهُ ‏\"‏‏.‏ ثُمَّ أَمَرَ بِلاَلاً فَنَادَى بِالنَّاسِ ‏\"‏ إِنَّهُ لاَ يَدْخُلُ الْجَنَّةَ إِلاَّ نَفْسٌ مُسْلِمَةٌ، وَإِنَّ اللَّهَ لَيُؤَيِّدُ هَذَا الدِّينَ بِالرَّجُلِ الْفَاجِرِ ‏\"‏‏.‏",
                "headingArabic": "إِنَّ اللَّهَ يُؤَيِّدُ الدِّينَ بِالرَّجُلِ الْفَاجِرِ",
                "headingUrdu": "اللہ کسی فجر سے دین کی حفاظت کرے۔",
                "headingEnglish": "Allah may supprt the religion with a Fajir",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2926,
                "hadithNumber": "3063",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) delivered a sermon and said, \"Zaid received the flag and was martyred, then Ja`far took it and was martyred, then `Abdullah bin Rawaha took it and was martyred, and then Khalid bin Al-Walid took it without being appointed, and Allah gave him victory.\" The Prophet (ﷺ) added, \"I am not pleased (or they will not be pleased) that they should remain (alive) with us,\" while his eyes were shedding tears.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ( مدینہ میں ) غزوہ موتہ کے موقع پر خطبہ دیا ‘ ( جب کہ مسلمان سپاہی موتہ کے میدان میں داد شجاعت دے رہے تھے ) آپ نے فرمایا ‘ کہ اب اسلامی علم زید بن حارثہ نے سنبھالا اور انہیں شہید کر دیا گیا ، پھر جعفر نے علم اپنے ہاتھ میں اٹھا لیا اور وہ بھی شہید کر دیئے گئے ۔ اب عبداللہ بن رواحہ نے علم تھاما ‘ یہ بھی شہید کر دیئے گئے ۔ آخر خالد بن ولید نے کسی نئی ہدایت کے بغیر اسلامی علم اٹھا لیا ہے ۔ اور ان کے ہاتھ پر فتح حاصل ہو گئی ‘ اور میرے لئے اس میں کوئی خوشی کی بات نہیں تھی یا آپ نے فرمایا ‘ کہ ان کے لئے کوئی خوشی کی بات نہیں تھی کہ وہ ( شہداء ) ہمارے پاس زندہ ہوتے ۔ ( کیونکہ شہادت کے بعد وہ جنت میں عیش کر رہے ہیں ) اور انس رضی اللہ عنہ نے بیان کیا کہ اس وقت آنحضرت صلی اللہ علیہ وسلم کی آنکھوں سے آنسو جاری تھے ۔",
                "urduNarrator": "ہم سے یعقوب بن ابراہیم نے بیان کیا ‘ کہا ہم سے ابن علیہ نے بیان کیا ‘ ان سے ایوب نے ‘ ان سے حمید بن ہلال نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ أَخَذَ الرَّايَةَ زَيْدٌ فَأُصِيبَ، ثُمَّ أَخَذَهَا جَعْفَرٌ فَأُصِيبَ، ثُمَّ أَخَذَهَا عَبْدُ اللَّهِ بْنُ رَوَاحَةَ فَأُصِيبَ، ثُمَّ أَخَذَهَا خَالِدُ بْنُ الْوَلِيدِ عَنْ غَيْرِ إِمْرَةٍ فَفُتِحَ عَلَيْهِ، وَمَا يَسُرُّنِي ـ أَوْ قَالَ مَا يَسُرُّهُمْ ـ أَنَّهُمْ عِنْدَنَا ‏\"‏‏.‏ وَقَالَ وَإِنَّ عَيْنَيْهِ لَتَذْرِفَانِ‏.‏",
                "headingArabic": "مَنْ تَأَمَّرَ فِي الْحَرْبِ مِنْ غَيْرِ إِمْرَةٍ إِذَا خَافَ الْعَدُوَّ",
                "headingUrdu": "جنگ کے دوران جب خطرہ ہو تو فوج کی قیادت سنبھالنا",
                "headingEnglish": "To take over the leadership of the army during a battle when there is danger",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2927,
                "hadithNumber": "3064",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The people of the tribes of Ril, Dhakwan, 'Usiya and Bani Lihyan came to the Prophet (ﷺ) and claimed that they had embraced Islam, and they requested him to support them with some men to fight their own people. The Prophet (ﷺ) supported them with seventy men from the Ansar whom we used to call Al-Qurra'(i.e. Scholars) who (out of piety) used to cut wood during the day and pray all the night. So, those people took the (seventy) men till they reached a place called Bi'r-Ma'ana where they betrayed and martyred them. So, the Prophet (ﷺ) invoked evil on the tribe of Ril, Dhakwan and Bani Lihyan for one month in the prayer. Narrated Qatada: Anas told us that they (i.e. Muslims) used to recite a Quranic Verse concerning those martyrs which was:-- \"O Allah! Let our people be informed on our behalf that we have met our Lord Who has got pleased with us and made us pleased.\" Then the Verse was cancelled.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں رعل ‘ ذکوان ‘ عصیہ اور بنو لحیان قبائل کے کچھ لوگ آئے اور یقین دلایا کہ وہ لوگ اسلام لا چکے ہیں اور انہوں نے اپنی کافر قوم کے مقابل امداد اورتعلیم و تبلیغ کے لئے آپ سے مدد چاہی ۔ تو نبی کریم صلی اللہ علیہ وسلم نے ستر انصاریوں کو ان کے ساتھ کر دیا ۔ انس رضی اللہ عنہ نے بیان کیا ‘ کہ ہم انہیں قاری کہا کرتے تھے ۔ وہ لوگ دن میں جنگل سے لکڑیاں جمع کرتے اور رات میں نماز پڑھتے رہتے ۔ یہ حضرات ان قبیلہ والوں کے ساتھ چلے گئے ‘ لیکن جب بئرمعونہ پر پہنچے تو انہیں قبیلہ والوں نے ان صحابہ کے ساتھ دغا کی اور انہیں شہید کر ڈالا ‘ حضور اکرم صلی اللہ علیہ وسلم نے ایک مہینہ تک ( نماز میں ) قنوت پڑھی اور رعل و ذکوان اور بنو لحیان کے لئے بددعا کرتے رہے ۔ قتادہ نے کہا کہ ہم سے انس رضی اللہ عنہ نے کہا کہ ( ان شہداء کے بارے میں ) قرآن مجید میں ہم یہ آیت یوں پڑھتے رہے ( ترجمہ ) ” ہاں ! ہماری قوم ( مسلم ) کو بتا دو کہ ہم اپنے رب سے جا ملے ۔ اور وہ ہم سے راضی ہو گیا ہے اور ہمیں بھی اس نے خوش کیا ہے ۔ پھر یہ آیت منسوخ ہو گئی تھی ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ‘ کہا ہم سے محمد بن ابی عدی اور سہل بن یوسف نے بیان کیا ‘ ان سے سعید بن ابی عروبہ نے ‘ ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، وَسَهْلُ بْنُ يُوسُفَ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم أَتَاهُ رِعْلٌ وَذَكْوَانُ وَعُصَيَّةُ وَبَنُو لِحْيَانَ، فَزَعَمُوا أَنَّهُمْ قَدْ أَسْلَمُوا، وَاسْتَمَدُّوهُ عَلَى قَوْمِهِمْ، فَأَمَدَّهُمُ النَّبِيُّ صلى الله عليه وسلم بِسَبْعِينَ مِنَ الأَنْصَارِ قَالَ أَنَسٌ كُنَّا نُسَمِّيهِمُ الْقُرَّاءَ، يَحْطِبُونَ بِالنَّهَارِ وَيُصَلُّونَ بِاللَّيْلِ، فَانْطَلَقُوا بِهِمْ حَتَّى بَلَغُوا بِئْرَ مَعُونَةَ غَدَرُوا بِهِمْ وَقَتَلُوهُمْ، فَقَنَتَ شَهْرًا يَدْعُو عَلَى رِعْلٍ وَذَكْوَانَ وَبَنِي لِحْيَانَ‏.‏ قَالَ قَتَادَةُ وَحَدَّثَنَا أَنَسٌ أَنَّهُمْ قَرَءُوا بِهِمْ قُرْآنًا أَلاَ بَلِّغُوا عَنَّا قَوْمَنَا بِأَنَّا قَدْ لَقِينَا رَبَّنَا فَرَضِيَ عَنَّا وَأَرْضَانَا‏.‏ ثُمَّ رُفِعَ ذَلِكَ بَعْدُ‏.‏",
                "headingArabic": "الْعَوْنِ بِالْمَدَدِ",
                "headingUrdu": "کمک کے ساتھ سپورٹ کرنا",
                "headingEnglish": "Supporting with reinforcements",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 2901,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=116",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=114",
                "label": "114",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=115",
                "label": "115",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=116",
                "label": "116",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=117",
                "label": "117",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=118",
                "label": "118",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=119",
                "label": "119",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=120",
                "label": "120",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=118",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=118",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=116",
        "to": 2925,
        "total": 40465
    }
}