{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 27,
        "data": [
            {
                "id": 651,
                "hadithNumber": "670",
                "englishNarrator": "Narrated Anas  رضی اللہ عنہ :",
                "hadithEnglish": "\"A man from Ansar said to the Prophet, 'I cannot pray with you (in congregation).' He was a very fat man and he prepared a meal for the Prophet (ﷺ) and invited him to his house. He spread out a mat for the Prophet, and washed one of its sides with water, and the Prophet (ﷺ) prayed two rak`at on it.\" A man from the family of Al-Jaruid asked Anas رضی اللہ عنہ , \"Did the Prophet (ﷺ) used to pray the Duha (forenoon) prayer?\" Anas رضی اللہ عنہ said, \"I did not see him praying the Duha prayer except on that day.\"",
                "hadithUrdu": "انصار میں سے ایک مرد نے عذر پیش کیا کہ میں آپ کے ساتھ نماز میں شریک نہیں ہو سکتا اور وہ موٹا آدمی تھا ۔ اس نے نبی کریم صلی اللہ علیہ وسلم کے لیے کھانا تیار کیا اور آپ صلی اللہ علیہ وسلم کو اپنے گھر دعوت دی اور آپ صلی اللہ علیہ وسلم کے لیے ایک چٹائی بچھا دی اور اس کے ایک کنارہ کو ( صاف کر کے ) دھو دیا ۔ آنحضور صلی اللہ علیہ وسلم نے اس بوریے پر دو رکعتیں پڑھیں ۔ آل جارود کے ایک شخص ( عبدالحمید ) نے انس رضی اللہ عنہ سے پوچھا کہ کیا نبی کریم صلی اللہ علیہ وسلم چاشت کی نماز پڑھتے تھے تو انھوں نے فرمایا کہ اس دن کے سوا اور کبھی میں نے آپ صلی اللہ علیہ وسلم کو پڑھتے نہیں دیکھا ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے انس بن سیرین نے بیان کیا ، کہا کہ میں نے انس رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ قَالَ رَجُلٌ مِنَ الأَنْصَارِ إِنِّي لاَ أَسْتَطِيعُ الصَّلاَةَ مَعَكَ‏.‏ وَكَانَ رَجُلاً ضَخْمًا، فَصَنَعَ لِلنَّبِيِّ صلى الله عليه وسلم طَعَامًا فَدَعَاهُ إِلَى مَنْزِلِهِ، فَبَسَطَ لَهُ حَصِيرًا وَنَضَحَ طَرَفَ الْحَصِيرِ، صَلَّى عَلَيْهِ رَكْعَتَيْنِ‏.‏ فَقَالَ رَجُلٌ مِنْ آلِ الْجَارُودِ لأَنَسٍ أَكَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الضُّحَى قَالَ مَا رَأَيْتُهُ صَلاَّهَا إِلاَّ يَوْمَئِذٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 652,
                "hadithNumber": "671",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If supper is served, and Iqama is pronounced one should start with the supper.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر شام کا کھانا سامنے رکھا جائے اور ادھر نماز کے لیے تکبیر بھی ہونے لگے تو پہلے کھانا کھا لو ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے ہشام بن عروہ سے بیان کیا ، کہا کہ مجھ سے میرے باپ نے بیان کیا ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے سنا ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، سَمِعْتُ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ إِذَا وُضِعَ الْعَشَاءُ وَأُقِيمَتِ الصَّلاَةُ فَابْدَءُوا بِالْعَشَاءِ ‏\"‏‏.‏",
                "headingArabic": "إِذَا حَضَرَ الطَّعَامُ وَأُقِيمَتِ الصَّلاَةُ",
                "headingUrdu": "اگر کھانا پیش کر دیا جائے اور نماز کے لیے اقامت کہہ دی جائے تو (کیا کرنا چاہیے)",
                "headingEnglish": "(WHat should one do) if the meal has been served and the Iqama has been pronounced for As-Salat(the prayer)",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 653,
                "hadithNumber": "672",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If the supper is served start having it before praying the Maghrib prayer and do not be hasty in finishing it.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب شام کا کھانا حاضر کیا جائے تو مغرب کی نماز سے پہلے کھانا کھا لو اور کھانے میں بے مزہ بھی نہ ہونا چاہئے اور اپنا کھانا چھوڑ کر نماز میں جلدی مت کرو ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے بیان کیا ، انہوں نے عقیل سے ، انہوں نے ابن شہاب سے بیان کیا ، انہوں نے انس بن مالک رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا قُدِّمَ الْعَشَاءُ فَابْدَءُوا بِهِ قَبْلَ أَنْ تُصَلُّوا صَلاَةَ الْمَغْرِبِ، وَلاَ تَعْجَلُوا عَنْ عَشَائِكُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 654,
                "hadithNumber": "673",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) said, 'If the supper is served for anyone of you and the Iqama is pronounced, start with the supper and don't be in haste (and carry on eating) till you finish it.\" If food was served for Ibn `Umar and Iqama was pronounced, he never came to the prayer till he finished it (i.e. food) in spite of the fact that he heard the recitation (of the Qur'an) by the Imam (in the prayer).",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جب تم میں سے کسی کا شام کا کھانا تیار ہو چکا ہو اور تکبیر بھی کہی جا چکی ہو تو پہلے کھانا کھا لو اور نماز کے لیے جلدی نہ کرو ، کھانے سے فراغت کر لو ۔ اور عبداللہ بن عمر رضی اللہ عنہما کے لیے کھانا رکھ دیا جاتا ، ادھر اقامت بھی ہو جاتی لیکن آپ کھانے سے فارغ ہونے تک نماز میں شریک نہیں ہوتے تھے ۔ آپ امام کی قرآت برابر سنتے رہتے تھے ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ابواسامہ حماد بن اسامہ سے ، انہوں نے عبیداللہ سے ، انہوں نے نافع سے ، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، عَنْ أَبِي أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا وُضِعَ عَشَاءُ أَحَدِكُمْ وَأُقِيمَتِ الصَّلاَةُ فَابْدَءُوا بِالْعَشَاءِ، وَلاَ يَعْجَلْ حَتَّى يَفْرُغَ مِنْهُ ‏\"‏‏.‏ وَكَانَ ابْنُ عُمَرَ يُوضَعُ لَهُ الطَّعَامُ وَتُقَامُ الصَّلاَةُ فَلاَ يَأْتِيهَا حَتَّى يَفْرُغَ، وَإِنَّهُ لَيَسْمَعُ قِرَاءَةَ الإِمَامِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 655,
                "hadithNumber": "674",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If anyone of you is having his meals, he should not hurry up till he is; satisfied even if the prayer has been started.\"\r\nIbrahim bin Al-Mundhir has  reported this Hadith from Wahb bin Uthman and Wahb is  Madni.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر تم میں سے کوئی کھانا کھا رہا ہو تو جلدی نہ کرے ، بلکہ پوری طرح کھا لے گو ( اگرچہ ) نماز کھڑی کیوں نہ ہو گئی ہو ۔\r\n ابوعبداللہ حضرت امام بخاری رحمہ اللہ نے کہا اور مجھ سے ابراہیم بن المنذر نے وہب بن عثمان سے یہ حدیث بیان کی اور وہب مدنی ہیں ۔",
                "urduNarrator": "زہیر اور وہب بن عثمان نے موسیٰ بن عقبہ سے بیان کیا ، انہوں نے نافع سے ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "وَقَالَ زُهَيْرٌ وَوَهْبُ بْنُ عُثْمَانَ عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِذَا كَانَ أَحَدُكُمْ عَلَى الطَّعَامِ فَلاَ يَعْجَلْ حَتَّى يَقْضِيَ حَاجَتَهُ مِنْهُ، وَإِنْ أُقِيمَتِ الصَّلاَةُ ‏\"‏‏.‏ رَوَاهُ إِبْرَاهِيمُ بْنُ الْمُنْذِرِ عَنْ وَهْبِ بْنِ عُثْمَانَ، وَوَهْبٌ مَدِينِيٌّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 656,
                "hadithNumber": "675",
                "englishNarrator": "Narrated Ja`far bin `Amr bin Umaiya that his father said:",
                "hadithEnglish": "\"I saw Allah's Messenger (ﷺ) eating a piece of meat from the shoulder of a sheep and he was called for the prayer. He stood up, put down the knife and prayed but did not perform ablution.''",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ صلی اللہ علیہ وسلم بکری کی ران کا گوشت کاٹ کاٹ کر کھا رہے تھے ۔ اتنے میں آپ صلی اللہ علیہ وسلم نماز کے لیے بلائے گئے آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور چھری ڈال دی ، پھر آپ صلی اللہ علیہ وسلم نے نماز پڑھائی اور وضو نہیں کیا ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ ہم سے ابراہیم بن سعد نے صالح بن کیسان سے بیان کیا ، انہوں نے ابن شہاب سے ، انہوں نے کہا کہ مجھ کو جعفر بن عمرو بن امیہ نے خبر دی کہ ان کے باپ عمرو بن امیہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ، أَنَّ أَبَاهُ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُ ذِرَاعًا يَحْتَزُّ مِنْهَا، فَدُعِيَ إِلَى الصَّلاَةِ فَقَامَ فَطَرَحَ السِّكِّينَ، فَصَلَّى وَلَمْ يَتَوَضَّأْ‏.‏",
                "headingArabic": "إِذَا دُعِيَ الإِمَامُ إِلَى الصَّلاَةِ وَبِيَدِهِ مَا يَأْكُلُ",
                "headingUrdu": "جب امام کو نماز کے لیے بلایا جائے اور اس کے ہاتھ میں کھانے کے لیے کچھ ہو۔",
                "headingEnglish": "When the Imam is called for As-Salat (the prayer) while he has in his hands something to eat.",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 657,
                "hadithNumber": "676",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"What did the Prophet (ﷺ) use to do in his house?\" She replied, \"He used to keep himself busy serving his family and when it was the time for prayer he would go for it.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم اپنے گھر میں کیا کیا کرتے تھے آپ نے بتلایا کہ حضور صلی اللہ علیہ وسلم اپنے گھر کے کام کاج یعنی اپنے گھر والیوں کی خدمت کیا کرتے تھے اور جب نماز کا وقت ہوتا تو فوراً ( کام کاج چھوڑ کر ) نماز کے لیے چلے جاتے تھے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے حکم بن عتبہ نے ابراہیم نخعی سے بیان کیا ، انہوں نے اسود بن یزید سے ، انہوں نے کہا کہ میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا الْحَكَمُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ سَأَلْتُ عَائِشَةَ مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَصْنَعُ فِي بَيْتِهِ قَالَتْ كَانَ يَكُونُ فِي مِهْنَةِ أَهْلِهِ ـ تَعْنِي خِدْمَةَ أَهْلِهِ ـ فَإِذَا حَضَرَتِ الصَّلاَةُ خَرَجَ إِلَى الصَّلاَةِ‏.‏",
                "headingArabic": "مَنْ كَانَ فِي حَاجَةِ أَهْلِهِ فَأُقِيمَتِ الصَّلاَةُ فَخَرَجَ",
                "headingUrdu": "اگر کوئی اپنے گھریلو کام میں مصروف ہو اور اقامت کہہ دی جائے اور پھر باہر نکل آئے [نماز کی ادائیگی کے لیے]",
                "headingEnglish": "If somebody was busy with his domestic work and Iqama was pronounced and then he came out [for offering the Salat (prayer)]",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 658,
                "hadithNumber": "677",
                "englishNarrator": "Narrated Abu Qilaba :",
                "hadithEnglish": "\"Malik bin Huwairith came to this Mosque of ours and said, 'I pray in front of you and my aim is not to lead the prayer but to show you the way in which the Prophet (ﷺ) used to pray.' \" I asked Abu Qilaba, \"How did he use to pray?' \" He replied, \"(The Prophet (ﷺ) used to pray) like this Sheikh of ours and the Sheikh used to sit for a while after the prostration, before getting up after the first rak`a. \"",
                "hadithUrdu": "مالک بن حویرث ( صحابی )  ایک دفعہ ہماری اس مسجد میں تشریف لائے اور فرمایا کہ میں تم لوگوں کو نماز پڑھاؤں گا اور میری نیت نماز پڑھنے کی نہیں ہے ، میرا مقصد صرف یہ ہے کہ تمہیں نماز کا وہ طریقہ سکھا دوں جس طریقہ سے نبی کریم صلی اللہ علیہ وسلم نماز پڑھا کرتے تھے ۔ میں نے ابوقلابہ سے پوچھا کہ انہوں نے کس طرح نماز پڑھی تھی ؟ انہوں نے بتلایا کہ ہمارے شیخ ( عمر بن سلمہ ) کی طرح ۔ شیخ جب سجدہ سے سر اٹھاتے تو ذرا بیٹھ جاتے پھر کھڑے ہوتے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے وہیب بن خالد نے بیان کیا ، کہا کہ ہم سے ایوب سختیانی نے ابوقلابہ عبداللہ بن زید سے بیان کیا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، قَالَ جَاءَنَا مَالِكُ بْنُ الْحُوَيْرِثِ فِي مَسْجِدِنَا هَذَا فَقَالَ إِنِّي لأُصَلِّي بِكُمْ، وَمَا أُرِيدُ الصَّلاَةَ، أُصَلِّي كَيْفَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يُصَلِّي‏.‏ فَقُلْتُ لأَبِي قِلاَبَةَ كَيْفَ كَانَ يُصَلِّي قَالَ مِثْلَ شَيْخِنَا هَذَا‏.‏ قَالَ وَكَانَ شَيْخًا يَجْلِسُ إِذَا رَفَعَ رَأْسَهُ مِنَ السُّجُودِ قَبْلَ أَنْ يَنْهَضَ فِي الرَّكْعَةِ الأُولَى‏.‏",
                "headingArabic": "مَنْ صَلَّى بِالنَّاسِ وَهْوَ لاَ يُرِيدُ إِلاَّ أَنْ يُعَلِّمَهُمْ صَلاَةَ النَّبِيِّ صلى الله عليه وسلم وَسُنَّتَهُ",
                "headingUrdu": "لوگوں کے سامنے نماز پڑھنا صرف اس نیت سے ہے کہ انہیں نماز نبی صلی اللہ علیہ وسلم اور آپ کی سنت (شرعی طریقے وغیرہ) کی تعلیم دی جائے۔",
                "headingEnglish": "Offering Salat (prayer) in front of the people with the sole intention of teaching them the Salat of the Prophet (pbuh) and his Sunnah (legal ways etc.)",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 659,
                "hadithNumber": "678",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "\"The Prophet (ﷺ) became sick and when his disease became aggravated, he said, \"Tell Abu Bakr to lead the prayer.\" `Aisha رضی اللہ عنہ said, \"He is a softhearted man and would not be able to lead the prayer in your place.\" The Prophet (ﷺ) said again, \"Tell Abu Bakr to lead the people in prayer.\" She repeated the same reply but he said, \"Tell Abu Bakr to lead the people in prayer. You are the companions of Joseph.\" So the messenger went to Abu Bakr (with that order) and he led the people in prayer in the lifetime of the Prophet.",
                "hadithUrdu": "آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم بیمار ہوئے اور جب بیماری شدت اختیار کر گئی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ابوبکر ( رضی اللہ عنہ ) سے کہو کہ وہ لوگوں کو نماز پڑھائیں ۔ اس پر حضرت عائشہ رضی اللہ عنہا بولیں کہ وہ نرم دل ہیں جب آپ کی جگہ کھڑے ہوں گے تو ان کے لئے نماز پڑھانا مشکل ہو گا ۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا کہ ابوبکر سے کہو کہ وہ نماز پڑھائیں ۔ حضرت عائشہ رضی اللہ عنہا نے پھر وہی بات کہی ۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا کہ ابوبکر سے کہو کہ نماز پڑھائیں ، تم لوگ صواحب یوسف ( زلیخا ) کی طرح ( باتیں بناتی ) ہو ۔ آخر ابوبکر صدیق رضی اللہ عنہ کے پاس آدمی بلانے آیا اور آپ نے لوگوں کو نبی کریم صلی اللہ علیہ وسلم کی زندگی میں ہی نماز پڑھائی ۔",
                "urduNarrator": "ہم سے اسحاق بن نصر نے بیان کیا ، کہا کہ ہم سے حسین بن علی بن ولید نے زائدہ بن قدامہ سے بیان کیا ، انہوں نے عبدالملک بن عمیر سے ، کہا کہ مجھ سے ابوبردہ عامر نے بیان کیا ، انہوں نے ابوموسیٰ اشعری رضی اللہ عنہ سے ، آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا حُسَيْنٌ، عَنْ زَائِدَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، قَالَ حَدَّثَنِي أَبُو بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ مَرِضَ النَّبِيُّ صلى الله عليه وسلم فَاشْتَدَّ مَرَضُهُ فَقَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ إِنَّهُ رَجُلٌ رَقِيقٌ، إِذَا قَامَ مَقَامَكَ لَمْ يَسْتَطِعْ أَنْ يُصَلِّيَ بِالنَّاسِ‏.‏ قَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ‏\"‏ فَعَادَتْ فَقَالَ ‏\"‏ مُرِي أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ، فَإِنَّكُنَّ صَوَاحِبُ يُوسُفَ ‏\"‏‏.‏ فَأَتَاهُ الرَّسُولُ فَصَلَّى بِالنَّاسِ فِي حَيَاةِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "أَهْلُ الْعِلْمِ وَالْفَضْلِ أَحَقُّ بِالإِمَامَةِ",
                "headingUrdu": "علماء کرام نماز کی امامت میں سبقت کے حقدار ہیں",
                "headingEnglish": "The religious learned men are entitled to precedence in leading the Salat (prayer)",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 660,
                "hadithNumber": "679",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا , the mother of the believers:",
                "hadithEnglish": "Allah's Messenger (ﷺ) in his illness said, \"Tell Abu Bakr to lead the people in prayer.\" I said to him, \"If Abu Bakr \r\nرضی اللہ عنہ stands in your place, the people would not hear him owing to his (excessive) weeping. So please order `Umar رضی اللہ عنہ to lead the prayer.\" `Aisha رضی اللہ عنہا added I said to Hafsa, \"Say to him: If Abu Bakr should lead the people in the prayer in your place, the people would not be able to hear him owing to his weeping; so please, order `Umar to lead the prayer.\" Hafsa did so but Allah's Apostle said, \"Keep quiet! You are verily the Companions of Joseph. Tell Abu Bakr to lead the people in the prayer. \" Hafsa رضی اللہ عنہ said to `Aisha رضی اللہ عنہا , \"I never got anything good from you.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیماری میں فرمایا کہ ابوبکر ( رضی اللہ عنہ ) سے نماز پڑھانے کے لیے کہو ۔ حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں کہ میں نے عرض کیا کہ ابوبکر آپ کی جگہ کھڑے ہوں گے تو روتے روتے وہ ( قرآن مجید ) سنا نہ سکیں گے ، اس لیے آپ عمر رضی اللہ عنہ سے کہئے کہ وہ نماز پڑھائیں ۔ آپ فرماتی تھیں کہ میں نے حفصہ رضی اللہ عنہا سے کہا کہ وہ بھی کہیں کہ اگر ابوبکر آپ کی جگہ کھڑے ہوئے تو روتے روتے لوگوں کو ( قرآن ) نہ سنا سکیں گے ۔ اس لیے عمر رضی اللہ عنہ سے کہئے کہ وہ نماز پڑھائیں ۔ حفصہ رضی اللہ عنہا ( ام المؤمنین اور حضرت عمر رضی اللہ عنہ کی صاحبزادی ) نے بھی اسی طرح کہا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ خاموش رہو ۔ تم صواحب یوسف کی طرح ہو ۔ ابوبکر سے کہو کہ وہ لوگوں کو نماز پڑھائیں ۔ پس حضرت حفصہ رضی اللہ عنہ نے حضرت عائشہ رضی اللہ عنہا سے کہا ۔ بھلا مجھ کو کہیں تم سے بھلائی پہنچ سکتی ہے ؟",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے ہشام بن عروہ سے خبر دی ، انہوں نے اپنے باپ عروہ بن زبیر سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فِي مَرَضِهِ ‏\"‏ مُرُوا أَبَا بَكْرٍ يُصَلِّي بِالنَّاسِ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ قُلْتُ إِنَّ أَبَا بَكْرٍ إِذَا قَامَ فِي مَقَامِكَ لَمْ يُسْمِعِ النَّاسَ مِنَ الْبُكَاءِ، فَمُرْ عُمَرَ فَلْيُصَلِّ لِلنَّاسِ‏.‏ فَقَالَتْ عَائِشَةُ فَقُلْتُ لِحَفْصَةَ قُولِي لَهُ إِنَّ أَبَا بَكْرٍ إِذَا قَامَ فِي مَقَامِكَ لَمْ يُسْمِعِ النَّاسَ مِنَ الْبُكَاءِ، فَمُرْ عُمَرَ فَلْيُصَلِّ لِلنَّاسِ‏.‏ فَفَعَلَتْ حَفْصَةُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَهْ، إِنَّكُنَّ لأَنْتُنَّ صَوَاحِبُ يُوسُفَ، مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ لِلنَّاسِ ‏\"‏‏.‏ فَقَالَتْ حَفْصَةُ لِعَائِشَةَ مَا كُنْتُ لأُصِيبَ مِنْكِ خَيْرًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 661,
                "hadithNumber": "680",
                "englishNarrator": "Narrated Anas bin Malik Al-Ansari رضی اللہ عنہ :",
                "hadithEnglish": "\"Abu Bakr رضی اللہ عنہ used to lead the people in prayer during the fatal illness of the Prophet (ﷺ) till it was Monday. When the people aligned (in rows) for the prayer the Prophet (ﷺ) lifted the curtain of his house and started looking at us and was standing at that time. His face was (glittering) like a page of the Qur'an and he smiled cheerfully. We were about to be put to trial for the pleasure of seeing the Prophet, Abu Bakr رضی اللہ عنہ retreated to join the row as he thought that the Prophet (ﷺ) would lead the prayer. The Prophet (ﷺ) beckoned us to complete the prayer and he let the curtain fall. On the same day he died.\"",
                "hadithUrdu": "کہ آنحضور صلی اللہ علیہ وسلم کے مرض الموت میں ابوبکر صدیق رضی اللہ عنہ نماز پڑھاتے تھے ۔ پیر کے دن جب لوگ نماز میں صف باندھے کھڑے ہوئے تھے تو آنحضور صلی اللہ علیہ وسلم حجرہ کا پردہ ہٹائے کھڑے ہوئے ، ہماری طرف دیکھ رہے تھے ۔ آپ صلی اللہ علیہ وسلم کا چہرہ مبارک ( حسن و جمال اور صفائی میں ) گویا مصحف کا ورق تھا ۔ آپ صلی اللہ علیہ وسلم مسکرا کر ہنسنے لگے ۔ ہمیں اتنی خوشی ہوئی کہ خطرہ ہو گیا کہ کہیں ہم سب آپ صلی اللہ علیہ وسلم کو دیکھنے ہی میں نہ مشغول ہو جائیں اور نماز توڑ دیں ۔ حضرت ابوبکر رضی اللہ عنہ الٹے پاؤں پیچھے ہٹ کر صف کے ساتھ آ ملنا چاہتے تھے ۔ انہوں نے سمجھا کہ نبی کریم صلی اللہ علیہ وسلم نماز کے لیے تشریف لا رہے ہیں ، لیکن آپ صلی اللہ علیہ وسلم نے ہمیں اشارہ کیا کہ نماز پوری کر لو ۔ پھر آپ صلی اللہ علیہ وسلم نے پردہ ڈال دیا ۔ پس آنحضرت صلی اللہ علیہ وسلم کی وفات اسی دن ہو گئی ۔ («اناللہ و انا الیہ راجعون»)",
                "urduNarrator": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا ، کہا کہ ہمیں شعیب بن ابی حمزہ نے زہری سے خبر دی ، کہا کہ مجھے انس بن مالک انصاری رضی اللہ عنہ نے خبر دی .... آپ نبی کریم صلی اللہ علیہ وسلم کی پیروی کرنے والے ، آپ کے خادم اور صحابی تھے ....",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ الأَنْصَارِيُّ ـ وَكَانَ تَبِعَ النَّبِيَّ صلى الله عليه وسلم وَخَدَمَهُ وَصَحِبَهُ أَنَّ أَبَا بَكْرٍ كَانَ يُصَلِّي لَهُمْ فِي وَجَعِ النَّبِيِّ صلى الله عليه وسلم الَّذِي تُوُفِّيَ فِيهِ، حَتَّى إِذَا كَانَ يَوْمُ الاِثْنَيْنِ وَهُمْ صُفُوفٌ فِي الصَّلاَةِ، فَكَشَفَ النَّبِيُّ صلى الله عليه وسلم سِتْرَ الْحُجْرَةِ يَنْظُرُ إِلَيْنَا، وَهْوَ قَائِمٌ كَأَنَّ وَجْهَهُ وَرَقَةُ مُصْحَفٍ، ثُمَّ تَبَسَّمَ يَضْحَكُ، فَهَمَمْنَا أَنْ نَفْتَتِنَ مِنَ الْفَرَحِ بِرُؤْيَةِ النَّبِيِّ صلى الله عليه وسلم، فَنَكَصَ أَبُو بَكْرٍ عَلَى عَقِبَيْهِ لِيَصِلَ الصَّفَّ، وَظَنَّ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَارِجٌ إِلَى الصَّلاَةِ، فَأَشَارَ إِلَيْنَا النَّبِيُّ صلى الله عليه وسلم أَنْ أَتِمُّوا صَلاَتَكُمْ، وَأَرْخَى السِّتْرَ، فَتُوُفِّيَ مِنْ يَوْمِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 662,
                "hadithNumber": "681",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) did not come out for three days. The people stood for the prayer and Abu Bakr went ahead to lead the prayer. (In the meantime) the Prophet (ﷺ) caught hold of the curtain and lifted it. When the face of the Prophet (ﷺ) appeared we had never seen a scene more pleasing than the face of the Prophet (ﷺ) as it appeared then. The Prophet (ﷺ) beckoned to Abu Bakr to lead the people in the prayer and then let the curtain fall. We did not see him (again) till he died.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ( ایام بیماری میں ) تین دن تک باہر تشریف نہیں لائے ۔ ان ہی دنوں میں ایک دن نماز قائم کی گئی ۔ حضرت ابوبکر رضی اللہ عنہ آگے بڑھنے کو تھے کہ نبی کریم صلی اللہ علیہ وسلم نے ( حجرہ مبارک کا ) پردہ اٹھایا ۔ جب حضور صلی اللہ علیہ وسلم کا چہرہ مبارک دکھائی دیا ۔ تو آپ صلی اللہ علیہ وسلم کے روئے پاک و مبارک سے زیادہ حسین منظر ہم نے کبھی نہیں دیکھا تھا ۔ ( قربان اس حسن و جمال کے ) پھر آپ صلی اللہ علیہ وسلم نے حضرت ابوبکر صدیق رضی اللہ عنہ کو آگے بڑھنے کے لیے اشارہ کیا اور آپ صلی اللہ علیہ وسلم نے پردہ گرا دیا اور اس کے بعد وفات تک کوئی آپ صلی اللہ علیہ وسلم کو دیکھنے پر قادر نہ ہو سکا ۔",
                "urduNarrator": "ہم سے ابومعمر عبداللہ بن عمر منقری نے بیان کیا ، کہا کہ ہم سے عبدالوارث بن سعید نے بیان کیا ۔ کہا کہ ہم سے عبدالعزیز بن صہیب نے انس بن مالک رضی اللہ عنہ سے بیان کیا ، آپ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ لَمْ يَخْرُجِ النَّبِيُّ صلى الله عليه وسلم ثَلاَثًا، فَأُقِيمَتِ الصَّلاَةُ، فَذَهَبَ أَبُو بَكْرٍ يَتَقَدَّمُ فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم بِالْحِجَابِ فَرَفَعَهُ، فَلَمَّا وَضَحَ وَجْهُ النَّبِيِّ صلى الله عليه وسلم مَا نَظَرْنَا مَنْظَرًا كَانَ أَعْجَبَ إِلَيْنَا مِنْ وَجْهِ النَّبِيِّ صلى الله عليه وسلم حِينَ وَضَحَ لَنَا، فَأَوْمَأَ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ إِلَى أَبِي بَكْرٍ أَنْ يَتَقَدَّمَ، وَأَرْخَى النَّبِيُّ صلى الله عليه وسلم الْحِجَابَ، فَلَمْ يُقْدَرْ عَلَيْهِ حَتَّى مَاتَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 663,
                "hadithNumber": "682",
                "englishNarrator": "Narrated Hamza bin `Abdullah:",
                "hadithEnglish": "\"When Allah's Messenger (ﷺ) became seriously ill, he was told about the prayer. He said, 'Tell Abu Bakr to lead the people in the prayer.' `Aisha said, 'Abu Bakr is a softhearted man and he would be overpowered by his weeping if he recited the Qur'an.' He said to them, 'Tell him (Abu Bakr) to lead the prayer. The same reply was given to him. He said again, 'Tell him to lead the prayer. You (women) are the companions of Joseph.\"",
                "hadithUrdu": "جب رسول کریم صلی اللہ علیہ وسلم کی بیماری شدت اختیار کر گئی اور آپ صلی اللہ علیہ وسلم سے نماز کے لیے کہا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ابوبکر سے کہو کہ وہ نماز پڑھائیں ۔ عائشہ رضی اللہ عنہا نے عرض کیا کہ ابوبکر کچے دل کے آدمی ہیں ۔ جب وہ قرآن مجید پڑھتے ہیں تو بہت رونے لگتے ہیں ۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان ہی سے کہو کہ نماز پڑھائیں ۔ دوبارہ انہوں نے پھر وہی عذر دہرایا ۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا کہ ان سے نماز پڑھانے کے لیے کہو ۔ تم تو بالکل صواحب یوسف کی طرح ہو ۔ اس حدیث کی متابعت محمد بن ولید زبیدی اور زہری کے بھتیجے اور اسحاق بن یحییٰ کلبی نے زہری سے کی ہے اور عقیل اور معمر نے زہری سے ، انہوں نے حمزہ بن عبداللہ بن عمر سے ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھ سے یونس بن یزید ایلی نے ابن شہاب سے بیان کیا ، انہوں نے حمزہ بن عبداللہ سے ، انہوں نے اپنے باپ عبداللہ بن عمر رضی اللہ عنہما سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ، أَنَّهُ أَخْبَرَهُ عَنْ أَبِيهِ، قَالَ لَمَّا اشْتَدَّ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَجَعُهُ قِيلَ لَهُ فِي الصَّلاَةِ فَقَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ إِنَّ أَبَا بَكْرٍ رَجُلٌ رَقِيقٌ، إِذَا قَرَأَ غَلَبَهُ الْبُكَاءُ‏.‏ قَالَ ‏\"‏ مُرُوهُ فَيُصَلِّي ‏\"‏ فَعَاوَدَتْهُ‏.‏ قَالَ ‏\"‏ مُرُوهُ فَيُصَلِّي، إِنَّكُنَّ صَوَاحِبُ يُوسُفَ ‏\"‏‏.‏ تَابَعَهُ الزُّبَيْدِيُّ وَابْنُ أَخِي الزُّهْرِيِّ وَإِسْحَاقُ بْنُ يَحْيَى الْكَلْبِيُّ عَنِ الزُّهْرِيِّ‏.‏ وَقَالَ عُقَيْلٌ وَمَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ حَمْزَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 664,
                "hadithNumber": "683",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) ordered Abu Bakr to lead the people in the prayer during his illness and so he led them in prayer.\" `Urwa, a sub narrator, added, \"Allah's Messenger (ﷺ) felt a bit relieved and came out and Abu Bakr was leading the people. When Abu Bakr saw the Prophet (ﷺ) he retreated but the Prophet beckoned him to remain there. Allah's Messenger (ﷺ) sat beside Abu Bakr. Abu Bakr was following the prayer of Allah's Messenger (ﷺ) and the people were following the prayer of Abu Bakr.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیماری میں حکم دیا کہ ابوبکر لوگوں کو نماز پڑھائیں ۔ اس لیے آپ لوگوں کو نماز پڑھاتے تھے ۔ عروہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک دن اپنے آپ کو کچھ ہلکا پایا اور باہر تشریف لائے ۔ اس وقت حضرت ابوبکر رضی اللہ عنہ نماز پڑھا رہے تھے ۔ انھوں نے جب حضور اکرم صلی اللہ علیہ وسلم کو دیکھا تو پیچھے ہٹنا چاہا ، لیکن آنحضور صلی اللہ علیہ وسلم نے اشارے سے انہیں اپنی جگہ قائم رہنے کا حکم فرمایا ۔ پس رسول کریم صلی اللہ علیہ وسلم ابوبکر صدیق رضی اللہ عنہ کے بازو میں بیٹھ گئے ۔ ابوبکر رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کی اقتداء کر رہے تھے اور لوگ ابوبکر رضی اللہ عنہ کی پیروی کرتے تھے ۔",
                "urduNarrator": "ہم سے زکریابن یحییٰ بلخی نے بیان کیا ، انہوں نے کہا کہ ہم سے عبداللہ بن نمیر نے بیان کیا ، انہوں نے کہا کہ ہمیں ہشام بن عروہ نے اپنے والد عروہ سے خبر دی ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے ۔ آپ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا زَكَرِيَّاءُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا ابْنُ نُمَيْرٍ، قَالَ أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا بَكْرٍ أَنْ يُصَلِّيَ بِالنَّاسِ فِي مَرَضِهِ، فَكَانَ يُصَلِّي بِهِمْ‏.‏ قَالَ عُرْوَةُ فَوَجَدَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي نَفْسِهِ خِفَّةً، فَخَرَجَ فَإِذَا أَبُو بَكْرٍ يَؤُمُّ النَّاسَ، فَلَمَّا رَآهُ أَبُو بَكْرٍ اسْتَأْخَرَ، فَأَشَارَ إِلَيْهِ أَنْ كَمَا أَنْتَ، فَجَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِذَاءَ أَبِي بَكْرٍ إِلَى جَنْبِهِ، فَكَانَ أَبُو بَكْرٍ يُصَلِّي بِصَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَالنَّاسُ يُصَلُّونَ بِصَلاَةِ أَبِي بَكْرٍ‏.‏",
                "headingArabic": "مَنْ قَامَ إِلَى جَنْبِ الإِمَامِ لِعِلَّةٍ",
                "headingUrdu": "جو شخص امام کے ساتھ حقیقی وجہ سے کھڑا ہوا [نماز میں]",
                "headingEnglish": "Whoever stood by the side of the Imam because of a genuine cause [in Salat (prayer)]",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 665,
                "hadithNumber": "684",
                "englishNarrator": "Narrated Sahl bin Sa`d As-Sa`idi رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) went to establish peace among Bani `Amr bin `Auf. In the meantime the time of prayer was due and the Mu'adh-dhin went to Abu Bakr and said, \"Will you lead the prayer, so that I may pronounce the Iqama?\" Abu Bakr رضی اللہ عنہ replied in the affirmative and led the prayer. Allah's Messenger (ﷺ) came while the people were still praying and he entered the rows of the praying people till he stood in the (first row). The people clapped their hands. Abu Bakr never glanced sideways in his prayer but when the people continued clapping, Abu Bakr looked and saw Allah's Messenger (ﷺ). Allah's Messenger (ﷺ) beckoned him to stay at his place. Abu Bakr رضی اللہ عنہ raised his hands and thanked Allah for that order of Allah's Messenger (ﷺ) and then he retreated till he reached the first row. Allah's Messenger (ﷺ) went forward and led the prayer. When Allah's Messenger (ﷺ) finished the prayer, he said, \"O Abu Bakr! What prevented you from staying when I ordered you to do so?\" Abu Bakr replied, \"How can Ibn Abi Quhafa (Abu Bakr) dare to lead the prayer in the presence of Allah's Messenger (ﷺ)?\" Then Allah's Messenger (ﷺ) said, \"Why did you clap so much? If something happens to anyone during his prayer he should say Subhan Allah. If he says so he will be attended to, for clapping is for women.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم بنی عمرو بن عوف میں ( قباء میں ) صلح کرانے کے لیے گئے ، پس نماز کا وقت آ گیا ۔ مؤذن ( حضرت بلال رضی اللہ عنہ نے ) ابوبکر رضی اللہ عنہ سے آ کر کہا کہ کیا آپ نماز پڑھائیں گے ۔ میں تکبیر کہوں ۔ ابوبکر رضی اللہ نے فرمایا کہ ہاں چنانچہ ابوبکر صدیق رضی اللہ عنہ نے نماز شروع کر دی ۔ اتنے میں رسول کریم صلی اللہ علیہ وسلم تشریف لے آئے تو لوگ نماز میں تھے ۔ آپ صلی اللہ علیہ وسلم صفوں سے گزر کر پہلی صف میں پہنچے ۔ لوگوں نے ایک ہاتھ کو دوسرے پر مارا ( تاکہ حضرت ابوبکر رضی اللہ عنہ آنحضور صلی اللہ علیہ وسلم کی آمد پر آگاہ ہو جائیں ) لیکن ابوبکر رضی اللہ عنہ نماز میں کسی طرف توجہ نہیں دیتے تھے ۔ جب لوگوں نے متواتر ہاتھ پر ہاتھ مارنا شروع کیا تو صدیق اکبر رضی اللہ عنہ متوجہ ہوئے اور رسول کریم صلی اللہ علیہ وسلم کو دیکھا ۔ آپ صلی اللہ علیہ وسلم نے اشارہ سے انہیں اپنی جگہ رہنے کے لیے کہا ۔ ( کہ نماز پڑھائے جاؤ ) لیکن انھوں نے اپنے ہاتھ اٹھا کر اللہ کا شکر کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان کو امامت کا اعزاز بخشا ، پھر بھی وہ پیچھے ہٹ گئے اور صف میں شامل ہو گئے ۔ اس لیے نبی کریم صلی اللہ علیہ وسلم نے آگے بڑھ کر نماز پڑھائی ۔ نماز سے فارغ ہو کر آپ صلی اللہ علیہ وسلم نے فرمایا کہ ابوبکر جب میں نے آپ کو حکم دے دیا تھا پھر آپ ثابت قدم کیوں نہ رہے ۔ حضرت ابوبکر رضی اللہ عنہ بولے کہ ابوقحافہ کے بیٹے ( یعنی ابوبکر ) کی یہ حیثیت نہ تھی کہ رسول اللہ صلی اللہ علیہ وسلم کے سامنے نماز پڑھا سکیں ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کی طرف خطاب کرتے ہوئے فرمایا کہ عجیب بات ہے ۔ میں نے دیکھا کہ تم لوگ بکثرت تالیاں بجا رہے تھے ۔ ( یاد رکھو ) اگر نماز میں کوئی بات پیش آ جائے تو سبحان اللہ کہنا چاہئے جب وہ یہ کہے گا تو اس کی طرف توجہ کی جائے گی اور یہ تالی بجانا عورتوں کے لیے ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہمیں امام مالک نے ابوحازم سلمہ بن دینار سے خبر دی ، انہوں نے سہل بن سعد ساعدی ( صحابی رضی اللہ عنہ ) سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَهَبَ إِلَى بَنِي عَمْرِو بْنِ عَوْفٍ لِيُصْلِحَ بَيْنَهُمْ فَحَانَتِ الصَّلاَةُ فَجَاءَ الْمُؤَذِّنُ إِلَى أَبِي بَكْرٍ فَقَالَ أَتُصَلِّي لِلنَّاسِ فَأُقِيمَ قَالَ نَعَمْ‏.‏ فَصَلَّى أَبُو بَكْرٍ، فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالنَّاسُ فِي الصَّلاَةِ، فَتَخَلَّصَ حَتَّى وَقَفَ فِي الصَّفِّ، فَصَفَّقَ النَّاسُ ـ وَكَانَ أَبُو بَكْرٍ لاَ يَلْتَفِتُ فِي صَلاَتِهِ ـ فَلَمَّا أَكْثَرَ النَّاسُ التَّصْفِيقَ الْتَفَتَ فَرَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم، فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنِ امْكُثْ مَكَانَكَ، فَرَفَعَ أَبُو بَكْرٍ ـ رضى الله عنه ـ يَدَيْهِ، فَحَمِدَ اللَّهَ عَلَى مَا أَمَرَهُ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ ذَلِكَ، ثُمَّ اسْتَأْخَرَ أَبُو بَكْرٍ حَتَّى اسْتَوَى فِي الصَّفِّ، وَتَقَدَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى، فَلَمَّا انْصَرَفَ قَالَ ‏\"‏ يَا أَبَا بَكْرٍ مَا مَنَعَكَ أَنْ تَثْبُتَ إِذْ أَمَرْتُكَ ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ مَا كَانَ لاِبْنِ أَبِي قُحَافَةَ أَنْ يُصَلِّيَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا لِي رَأَيْتُكُمْ أَكْثَرْتُمُ التَّصْفِيقَ مَنْ رَابَهُ شَىْءٌ فِي صَلاَتِهِ فَلْيُسَبِّحْ، فَإِنَّهُ إِذَا سَبَّحَ الْتُفِتَ إِلَيْهِ، وَإِنَّمَا التَّصْفِيقُ لِلنِّسَاءِ ‏\"‏‏.‏",
                "headingArabic": "مَنْ دَخَلَ لِيَؤُمَّ النَّاسَ فَجَاءَ الإِمَامُ الأَوَّلُ فَتَأَخَّرَ الأَوَّلُ أَوْ لَمْ يَتَأَخَّرْ جَازَتْ صَلاَتُهُ‏",
                "headingUrdu": "اگر کوئی نماز پڑھا رہا ہو اور (اس دوران) پہلا (معمول کا) امام آجائے تو نماز صحیح ہے خواہ سابقہ ​​اعتکاف کرے یا نہ کرے۔",
                "headingEnglish": "If somebody is leading the Salat (prayer) and (in the meanwhile) the first (usual) Imam comes, the Salat is valid whether the former retreats or does not retreat",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 666,
                "hadithNumber": "685",
                "englishNarrator": "Narrated Malik bin Huwairith رضی اللہ عنہ :",
                "hadithEnglish": "We went to the Prophet (ﷺ) and we were all young men and stayed with him for about twenty nights. The Prophet (ﷺ) was very merciful. He said, \"When you return home, impart religious teachings to your families and tell them to offer perfectly such and such a prayer at such and such a time and such and such a prayer at such and such a time. And at the time of the prayer one of you should pronounce the Adhan and the oldest of you should lead the prayer.\"",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اپنے ملک سے حاضر ہوئے ۔ ہم سب ہم عمر نوجوان تھے ۔ تقریباً بیس راتیں ہم آپ کی خدمت میں ٹھہرے رہے ۔ آپ صلی اللہ علیہ وسلم بڑے ہی رحم دل تھے ۔ آپ صلی اللہ علیہ وسلم نے ( ہماری غربت کا حال دیکھ کر ) فرمایا کہ جب تم لوگ اپنے گھروں کو جاؤ تو اپنے قبیلہ والوں کو دین کی باتیں بتانا اور ان سے نماز پڑھنے کے لیے کہنا کہ فلاں نماز فلاں وقت اور فلاں نماز فلاں وقت پڑھیں ۔ اور جب نماز کا وقت ہو جائے تو کوئی ایک اذان دے اور جو عمر میں بڑا ہو وہ امامت کرائے ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہمیں حماد بن زید نے خبر دی ایوب سختیانی سے ، انہوں نے ابوقلابہ سے ، انہوں نے مالک بن حویرث رضی اللہ عنہ سے ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ، قَالَ قَدِمْنَا عَلَى النَّبِيِّ صلى الله عليه وسلم وَنَحْنُ شَبَبَةٌ، فَلَبِثْنَا عِنْدَهُ نَحْوًا مِنْ عِشْرِينَ لَيْلَةً، وَكَانَ النَّبِيُّ صلى الله عليه وسلم رَحِيمًا فَقَالَ ‏ \"‏ لَوْ رَجَعْتُمْ إِلَى بِلاَدِكُمْ فَعَلَّمْتُمُوهُمْ، مُرُوهُمْ فَلْيُصَلُّوا صَلاَةَ كَذَا فِي حِينِ كَذَا، وَصَلاَةَ كَذَا فِي حِينِ كَذَا، وَإِذَا حَضَرَتِ الصَّلاَةُ فَلْيُؤَذِّنْ لَكُمْ أَحَدُكُمْ، وَلْيَؤُمَّكُمْ أَكْبَرُكُمْ ‏\"‏‏.‏",
                "headingArabic": "إِذَا اسْتَوَوْا فِي الْقِرَاءَةِ فَلْيَؤُمَّهُمْ أَكْبَرُهُمْ",
                "headingUrdu": "اگر کچھ لوگ قرآن کی تلاوت (اور دینی علم) میں اتنے ہی ماہر ہوں تو ان میں سب سے بوڑھے کو نماز کی امامت کرنی چاہیے۔",
                "headingEnglish": "If some people are equally proficient in the recitation of the Quran (and religious knowledge), the oldest of them should lead As-Salat (the prayer)",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 667,
                "hadithNumber": "686",
                "englishNarrator": "Narrated `Itban bin Malik Al-Ansari رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (came to my house and) asked permission for entering and I allowed him. He asked, \"Where do you like me to pray in your house?\" I pointed to a place which I liked. He stood up for prayer and we aligned behind him and he finished the prayer with Taslim and we did the same.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے ( میرے گھر تشریف لانے کی ) اجازت چاہی اور میں نے آپ کو اجازت دی ، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تم لوگ اپنے گھر میں جس جگہ پسند کرو میں نماز پڑھ دوں میں جہاں چاہتا تھا اس کی طرف میں نے اشارہ کیا ۔ پھر آپ کھڑے ہو گئے اور ہم نے آپ کے پیچھے صف باندھ لی ۔ پھر آپ نے جب سلام پھیرا تو ہم نے بھی سلام پھیرا ۔",
                "urduNarrator": "ہم سے معاذ بن اسد نے بیان کیا ، کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ، کہا کہ ہمیں معمر نے زہری سے خبر دی ، کہا کہ مجھے محمود بن ربیع نے خبر دی ، کہا کہ میں نے عتبان بن مالک انصاری رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ، قَالَ سَمِعْتُ عِتْبَانَ بْنَ مَالِكٍ الأَنْصَارِيَّ، قَالَ اسْتَأْذَنَ النَّبِيُّ صلى الله عليه وسلم فَأَذِنْتُ لَهُ فَقَالَ ‏ \"‏ أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ مِنْ بَيْتِكَ ‏\"‏‏.‏ فَأَشَرْتُ لَهُ إِلَى الْمَكَانِ الَّذِي أُحِبُّ، فَقَامَ وَصَفَفْنَا خَلْفَهُ ثُمَّ سَلَّمَ وَسَلَّمْنَا‏.‏",
                "headingArabic": "إِذَا زَارَ الإِمَامُ قَومًا فَأَمَّهُمْ",
                "headingUrdu": "اگر امام کچھ لوگوں کے پاس گیا اور ان کی نماز پڑھائی۔",
                "headingEnglish": "If the Imam visited some people and led them in Salat (prayer)",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 668,
                "hadithNumber": "687",
                "englishNarrator": "Narrated 'Ubaidullah Ibn `Abdullah bin `Utba:",
                "hadithEnglish": "I went to `Aisha رضی اللہ عنہا and asked her to describe to me the illness of Allah's Messenger (ﷺ). `Aisha رضی اللہ عنہا said, \"Yes. The Prophet became seriously ill and asked whether the people had prayed. We replied, 'No. O Allah's Apostle! They are waiting for you.' He added, 'Put water for me in a trough.\" `Aisha رضی اللہ عنہا added, \"We did so. He took a bath and tried to get up but fainted. When he recovered, he again asked whether the people had prayed. We said, 'No, they are waiting for you. O Allah's Messenger (ﷺ),' He again said, 'Put water in a trough for me.' He sat down and took a bath and tried to get up but fainted again. Then he recovered and said, 'Have the people prayed?' We replied, 'No, they are waiting for you. O Allah's Apostle.' He said, 'Put water for me in the trough.' Then he sat down and washed himself and tried to get up but he fainted. When he recovered, he asked, 'Have the people prayed?' We said, 'No, they are waiting for you. O Allah's Messenger (ﷺ)! The people were in the mosque waiting for the Prophet (ﷺ) for the `Isha prayer. The Prophet (ﷺ) sent for Abu Bakr رضی اللہ عنہ to lead the people in the prayer. The messenger went to Abu Bakr رضی اللہ عنہ and said, 'Allah's Messenger (ﷺ) orders you to lead the people in the prayer.' Abu Bakr رضی اللہ عنہ was a softhearted man, so he asked `Umar to lead the prayer but `Umar replied, 'You are more rightful.' So Abu Bakr رضی اللہ عنہ led the prayer in those days. When the Prophet (ﷺ) felt a bit better, he came out for the Zuhr prayer with the help of two persons one of whom was Al-`Abbas. while Abu Bakr رضی اللہ عنہ was leading the people in the prayer. When Abu Bakr رضی اللہ عنہ saw him he wanted to retreat but the Prophet (ﷺ) beckoned him not to do so and asked them to make him sit beside Abu Bakr رضی اللہ عنہ and they did so. Abu Bakr رضی اللہ عنہ was following the Prophet (in the prayer) and the people were following Abu Bakr رضی اللہ عنہ . The Prophet (prayed) sitting.\" 'Ubaidullah added \"I went to `Abdullah bin `Abbas and asked him, Shall I tell you what Aisha رضی اللہ عنہا has told me about the fatal illness of the Prophet?' Ibn `Abbas said, 'Go ahead. I told him her narration and he did not deny anything of it but asked whether `Aisha رضی اللہ عنہا told me the name of the second person (who helped the Prophet (ﷺ) ) along with Al-Abbas. I said. 'No.' He said, 'He was `Ali (Ibn Abi Talib).",
                "hadithUrdu": "میں حضرت عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا اور کہا ، کاش ! رسول اللہ صلی اللہ علیہ وسلم کی بیماری کی حالت آپ ہم سے بیان کرتیں ، ( تو اچھا ہوتا ) انھوں نے فرمایا کہ ہاں ضرور سن لو ۔ آپ صلی اللہ علیہ وسلم کا مرض بڑھ گیا ۔ تو آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا لوگوں نے نماز پڑھ لی ؟ ہم نے عرض کی جی نہیں یا رسول اللہ ! لوگ آپ کا انتظام کر رہے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میرے لیے ایک لگن میں پانی رکھ دو ۔ حضرت عائشہ رضی اللہ عنہا نے کہا کہ ہم نے پانی رکھ دیا اور آپ صلی اللہ علیہ وسلم نے بیٹھ کر غسل کیا ۔ پھر آپ اٹھنے لگے ، لیکن آپ بیہوش ہو گئے ۔ جب ہوش ہوا تو پھر آپ نے پوچھا کہ کیا لوگوں نے نماز پڑھ لی ہے ۔ ہم نے عرض کی نہیں حضور ! لوگ آپ کا انتظار کر رہے ہیں ۔ آپ صلی اللہ علیہ وسلم نے ( پھر ) فرمایا کہ لگن میں میرے لیے پانی رکھ دو ۔ حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ ہم نے پھر پانی رکھ دیا اور آپ صلی اللہ علیہ وسلم نے بیٹھ کر غسل فرمایا ۔ پھر اٹھنے کی کوشش کی لیکن ( دوبارہ ) پھر آپ بیہوش ہو گئے ۔ جب ہوش ہوا تو آپ نے پھر یہی فرمایا کہ کیا لوگوں نے نماز پڑھ لی ہے ۔ ہم نے عرض کی کہ نہیں یا رسول اللہ ! لوگ آپ کا انتظار کر رہے ہیں ۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا کہ لگن میں پانی لاؤ اور آپ صلی اللہ علیہ وسلم نے بیٹھ کر غسل کیا ۔ پھر اٹھنے کی کوشش کی ، لیکن پھر آپ بیہوش ہو گئے ۔ پھر جب ہوش ہوا تو آپ صلی اللہ علیہ وسلم نے پوچھا کہ کیا لوگوں نے نماز پڑھ لی ہم نے عرض کی کہ نہیں یا رسول اللہ ! وہ آپ کا انتظار کر رہے ہیں ۔ لوگ مسجد میں عشاء کی نماز کے لیے بیٹھے ہوئے نبی کریم صلی اللہ علیہ وسلم کا انتظار کر رہے تھے ۔ آخر آپ صلی اللہ علیہ وسلم نے حضرت ابوبکر رضی اللہ عنہ کے پاس آدمی بھیجا اور حکم فرمایا کہ وہ نماز پڑھا دیں ۔ بھیجے ہوئے شخص نے آ کر کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے آپ کو نماز پڑھانے کے لیے حکم فرمایا ہے ۔ ابوبکر رضی اللہ عنہ بڑے نرم دل انسان تھے ۔ انھوں نے حضرت عمر رضی اللہ عنہ سے کہا کہ تم نماز پڑھاؤ ، لیکن حضرت عمر رضی اللہ عنہ نے جواب دیا کہ آپ اس کے زیادہ حقدار ہیں ۔ آخر ( بیماری ) کے دنوں میں حضرت ابوبکر رضی اللہ عنہ نماز پڑھاتے رہے ۔ پھر جب نبی کریم صلی اللہ علیہ وسلم کو مزاج کچھ ہلکا معلوم ہوا تو دو مردوں کا سہارا لے کر جن میں ایک حضرت عباس رضی اللہ عنہ تھے ظہر کی نماز کے لیے گھر سے باہر تشریف لائے اور ابوبکر رضی اللہ عنہ نماز پڑھا رہے تھے ، جب انھوں نے آنحضور صلی اللہ علیہ وسلم کو دیکھا تو پیچھے ہٹنا چاہا ، لیکن نبی کریم صلی اللہ علیہ وسلم نے اشارے سے انہیں روکا کہ پیچھے نہ ہٹو ! پھر آپ نے ان دونوں مردوں سے فرمایا کہ مجھے ابوبکر کے بازو میں بٹھا دو ۔ چنانچہ دونوں نے آپ کو ابوبکر رضی اللہ عنہ کے بازو میں بٹھا دیا ۔ راوی نے کہا کہ پھر ابوبکر رضی اللہ عنہ نماز میں نبی کریم صلی اللہ علیہ وسلم کی پیروی کر رہے تھے اور لوگ ابوبکر رضی اللہ عنہ کی نماز کی پیروی کر رہے تھے ۔ نبی کریم صلی اللہ علیہ وسلم بیٹھے بیٹھے نماز پڑھ رہے تھے ۔ عبیداللہ نے کہا کہ پھر میں عبداللہ بن عباس رضی اللہ عنہما کی خدمت میں گیا اور ان سے عرض کی کہ حضرت عائشہ رضی اللہ عنہا نے آنحضرت صلی اللہ علیہ وسلم کی بیماری کے بارے میں جو حدیث بیان کی ہے کیا میں وہ آپ کو سناؤں ؟ انھوں نے فرمایا کہ ضرور سناؤ ۔ میں نے یہ حدیث سنا دی ۔ انھوں نے کسی بات کا انکار نہیں کیا ۔ صرف اتنا کہا کہ عائشہ رضی اللہ عنہا نے ان صاحب کا نام بھی تم کو بتایا جو حضرت عباس رضی اللہ عنہ کے ساتھ تھے ۔ میں نے کہا نہیں ۔ آپ نے فرمایا وہ حضرت علی رضی اللہ عنہ تھے ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، کہا کہ ہمیں زائدہ بن قدامہ نے موسیٰ بن ابی عائشہ سے خبر دی ، انہوں نے عبیداللہ بن عبداللہ بن عتبہ سے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ حَدَّثَنَا زَائِدَةُ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ فَقُلْتُ أَلاَ تُحَدِّثِينِي عَنْ مَرَضِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتْ بَلَى، ثَقُلَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَصَلَّى النَّاسُ ‏\"‏‏.‏ قُلْنَا لاَ، هُمْ يَنْتَظِرُونَكَ‏.‏ قَالَ ‏\"‏ ضَعُوا لِي مَاءً فِي الْمِخْضَبِ ‏\"‏‏.‏ قَالَتْ فَفَعَلْنَا فَاغْتَسَلَ فَذَهَبَ لِيَنُوءَ فَأُغْمِيَ عَلَيْهِ، ثُمَّ أَفَاقَ فَقَالَ صلى الله عليه وسلم ‏\"‏ أَصَلَّى النَّاسُ ‏\"‏‏.‏ قُلْنَا لاَ، هُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ ضَعُوا لِي مَاءً فِي الْمِخْضَبِ ‏\"‏‏.‏ قَالَتْ فَقَعَدَ فَاغْتَسَلَ، ثُمَّ ذَهَبَ لِيَنُوءَ فَأُغْمِيَ عَلَيْهِ، ثُمَّ أَفَاقَ فَقَالَ ‏\"‏ أَصَلَّى النَّاسُ ‏\"‏‏.‏ قُلْنَا لاَ، هُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ ضَعُوا لِي مَاءً فِي الْمِخْضَبِ ‏\"‏، فَقَعَدَ فَاغْتَسَلَ، ثُمَّ ذَهَبَ لِيَنُوءَ فَأُغْمِيَ عَلَيْهِ، ثُمَّ أَفَاقَ فَقَالَ ‏\"‏ أَصَلَّى النَّاسُ ‏\"‏‏.‏ فَقُلْنَا لاَ، هُمْ يَنْتَظِرُونَكَ يَا رَسُولَ اللَّهِ ـ وَالنَّاسُ عُكُوفٌ فِي الْمَسْجِدِ يَنْتَظِرُونَ النَّبِيَّ عَلَيْهِ السَّلاَمُ لِصَلاَةِ الْعِشَاءِ الآخِرَةِ ـ فَأَرْسَلَ النَّبِيُّ صلى الله عليه وسلم إِلَى أَبِي بَكْرٍ بِأَنْ يُصَلِّيَ بِالنَّاسِ، فَأَتَاهُ الرَّسُولُ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُكَ أَنْ تُصَلِّيَ بِالنَّاسِ‏.‏ فَقَالَ أَبُو بَكْرٍ ـ وَكَانَ رَجُلاً رَقِيقًا ـ يَا عُمَرُ صَلِّ بِالنَّاسِ‏.‏ فَقَالَ لَهُ عُمَرُ أَنْتَ أَحَقُّ بِذَلِكَ‏.‏ فَصَلَّى أَبُو بَكْرٍ تِلْكَ الأَيَّامَ، ثُمَّ إِنَّ النَّبِيَّ صلى الله عليه وسلم وَجَدَ مِنْ نَفْسِهِ خِفَّةً فَخَرَجَ بَيْنَ رَجُلَيْنِ أَحَدُهُمَا الْعَبَّاسُ لِصَلاَةِ الظُّهْرِ، وَأَبُو بَكْرٍ يُصَلِّي بِالنَّاسِ، فَلَمَّا رَآهُ أَبُو بَكْرٍ ذَهَبَ لِيَتَأَخَّرَ فَأَوْمَأَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم بِأَنْ لاَ يَتَأَخَّرَ‏.‏ قَالَ ‏\"‏ أَجْلِسَانِي إِلَى جَنْبِهِ ‏\"‏‏.‏ فَأَجْلَسَاهُ إِلَى جَنْبِ أَبِي بَكْرٍ‏.‏ قَالَ فَجَعَلَ أَبُو بَكْرٍ يُصَلِّي وَهْوَ يَأْتَمُّ بِصَلاَةِ النَّبِيِّ صلى الله عليه وسلم وَالنَّاسُ بِصَلاَةِ أَبِي بَكْرٍ، وَالنَّبِيُّ صلى الله عليه وسلم قَاعِدٌ‏.‏ قَالَ عُبَيْدُ اللَّهِ فَدَخَلْتُ عَلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ فَقُلْتُ لَهُ أَلاَ أَعْرِضُ عَلَيْكَ مَا حَدَّثَتْنِي عَائِشَةُ عَنْ مَرَضِ النَّبِيِّ صلى الله عليه وسلم قَالَ هَاتِ‏.‏ فَعَرَضْتُ عَلَيْهِ حَدِيثَهَا، فَمَا أَنْكَرَ مِنْهُ شَيْئًا، غَيْرَ أَنَّهُ قَالَ أَسَمَّتْ لَكَ الرَّجُلَ الَّذِي كَانَ مَعَ الْعَبَّاسِ قُلْتُ لاَ‏.‏ قَالَ هُوَ عَلِيٌّ‏.‏",
                "headingArabic": "إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ",
                "headingUrdu": "امام تقلید کے لیے مقرر کیا گیا ہے۔",
                "headingEnglish": "The Imam is appointed to be followed",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 669,
                "hadithNumber": "688",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا the mother of the believers:",
                "hadithEnglish": "Allah's Messenger (ﷺ) during his illness prayed at his house while sitting whereas some people prayed behind him standing. The Prophet (ﷺ) beckoned them to sit down. On completion of the prayer, he said, 'The Imam is to be followed: bow when he bows, raise up your heads (stand erect) when he raises his head and when he says, 'Sami`a l-lahu liman hamidah' (Allah heard those who sent praises to Him) say then 'Rabbana wa laka l-hamd' (O our Lord! All the praises are for You), and if he prays sitting then pray sitting.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے ایک مرتبہ بیماری کی حالت میں میرے ہی گھر میں نماز پڑھی ۔ آپ صلی اللہ علیہ وسلم بیٹھ کر نماز پڑھ رہے تھے اور لوگ آپ صلی اللہ علیہ وسلم کے پیچھے کھڑے ہو کر پڑھ رہے تھے ۔ آپ صلی اللہ علیہ وسلم نے ان کو بیٹھنے کا اشارہ کیا اور نماز سے فارغ ہونے کے بعد فرمایا کہ امام اس لیے ہے کہ اس کی پیروی کی جائے ۔ اس لیے جب وہ رکوع میں جائے تو تم بھی رکوع میں جاؤ اور جب وہ سر اٹھائے تو تم بھی سر اٹھاؤ اور جب وہ «سمع الله لمن حمده‏» کہے تو تم «ربنا ولك الحمد‏» کہو اور جب وہ بیٹھ کر نماز پڑھے تو تم بھی بیٹھ کر نماز پڑھو ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا کہا کہ ہم سے امام مالک رحمہ اللہ نے ہشام بن عروہ سے بیان کیا ۔ انہوں نے اپنے باپ عروہ سے انہوں نے ام المؤمنین حضرت عائشہ رضی اللہ عنہا سے کہ آپ نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَيْتِهِ وَهْوَ شَاكٍ، فَصَلَّى جَالِسًا وَصَلَّى وَرَاءَهُ قَوْمٌ قِيَامًا، فَأَشَارَ إِلَيْهِمْ أَنِ اجْلِسُوا، فَلَمَّا انْصَرَفَ قَالَ ‏ \"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ، فَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا رَفَعَ فَارْفَعُوا، وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 670,
                "hadithNumber": "689",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Once Allah's Messenger (ﷺ) rode a horse and fell down and the right side (of his body) was injured. He offered one of the prayers while sitting and we also prayed behind him sitting. When he completed the prayer, he said, \"The Imam is to be followed. Pray standing if he prays standing and bow when he bows; rise when he rises; and if he says, 'Sami`a l-lahu-liman hamidah, say then, 'Rabbana wa laka lhamd' and pray standing if he prays standing and pray sitting (all of you) if he prays sitting.\" Humaid said: The saying of the Prophet (ﷺ) \"Pray sitting, if he (Imam) prays sitting\" was said in his former illness (during his early life) but the Prophet (ﷺ) prayed sitting afterwards (in the last illness) and the people were praying standing behind him and the Prophet (ﷺ) did not order them to sit. We should follow the latest actions of the Prophet.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ایک گھوڑے پر سوار ہوئے تو آپ صلی اللہ علیہ وسلم اس پر سے گر پڑے ۔ اس سے آپ صلی اللہ علیہ وسلم کے دائیں پہلو پر زخم آئے ۔ تو آپ صلی اللہ علیہ وسلم نے کوئی نماز پڑھی ۔ جسے آپ صلی اللہ علیہ وسلم بیٹھ کر پڑھ رہے تھے ۔ اس لیے ہم نے بھی آپ صلی اللہ علیہ وسلم کے پیچھے بیٹھ کر نماز پڑھی ۔ جب آپ صلی اللہ علیہ وسلم فارغ ہوئے تو فرمایا کہ امام اس لیے مقرر کیا گیا ہے کہ اس کی اقتداء کی جائے ۔ اس لیے جب وہ کھڑے ہو کر نماز پڑھے تو تم بھی کھڑے ہو کر پڑھو اور جب وہ رکوع کرے تو تم بھی رکوع کرو ۔ جب وہ رکوع سے سر اٹھائے تو تم بھی اٹھاؤ اور جب وہ «سمع الله لمن حمده‏» کہے تو تم «ربنا ولك الحمد‏» کہو اور جب وہ بیٹھ کر نماز پڑھے تو تم بھی بیٹھ کر پڑھو ۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ حمیدی نے آپ صلی اللہ علیہ وسلم کے اس قول ’’ جب امام بیٹھ کر نماز پڑھے تو تم بھی بیٹھ کر پڑھو ۔ ‘‘ کے متعلق کہا ہے کہ یہ ابتداء میں آپ صلی اللہ علیہ وسلم کی پرانی بیماری کا واقعہ ہے ۔ اس کے بعد آخری بیماری میں آپ صلی اللہ علیہ وسلم نے خود بیٹھ کر نماز پڑھی تھی اور لوگ آپ صلی اللہ علیہ وسلم کے پیچھے کھڑے ہو کر اقتداء کر رہے تھے ۔ آپ صلی اللہ علیہ وسلم نے اس وقت لوگوں کو بیٹھنے کی ہدایت نہیں فرمائی اور اصل یہ ہے کہ جو فعل آپ صلی اللہ علیہ وسلم کا آخری ہو اس کو لینا چاہئے اور پھر جو اس سے آخری ہو ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک رحمہ اللہ نے ابن شہاب سے خبر دی ، انہوں نے انس بن مالک رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَكِبَ فَرَسًا فَصُرِعَ عَنْهُ، فَجُحِشَ شِقُّهُ الأَيْمَنُ، فَصَلَّى صَلاَةً مِنَ الصَّلَوَاتِ وَهْوَ قَاعِدٌ، فَصَلَّيْنَا وَرَاءَهُ قُعُودًا، فَلَمَّا انْصَرَفَ قَالَ ‏\"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ، فَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا، فَإِذَا رَكَعَ فَارْكَعُوا، وَإِذَا رَفَعَ فَارْفَعُوا، وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ‏.‏ وَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا، وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا أَجْمَعُونَ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ الْحُمَيْدِيُّ قَوْلُهُ ‏\"‏ إِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا ‏\"‏‏.‏ هُوَ فِي مَرَضِهِ الْقَدِيمِ، ثُمَّ صَلَّى بَعْدَ ذَلِكَ النَّبِيُّ صلى الله عليه وسلم جَالِسًا وَالنَّاسُ خَلْفَهُ قِيَامًا، لَمْ يَأْمُرْهُمْ بِالْقُعُودِ، وَإِنَّمَا يُؤْخَذُ بِالآخِرِ فَالآخِرِ مِنْ فِعْلِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 671,
                "hadithNumber": "690",
                "englishNarrator": "Narrated Al-Bara (and he was not a liar) :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) said, \"Sami`a l-lahu liman hamidah\" none of us bent his back (for prostration) till the Prophet (ﷺ) prostrated and then we would prostrate after him. Narrated Abu 'Is-haq: As above.",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم «سمع الله لمن حمده‏» کہتے تو ہم میں سے کوئی بھی اس وقت تک نہ جھکتا جب تک آنحضور صلی اللہ علیہ وسلم سجدہ میں نہ چلے جاتے پھر ہم لوگ سجدہ میں جاتے ۔ ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان ثوری نے ، انھوں نے ابواسحٰق سے جیسے اوپر گزرا ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، انہوں نے کہا کہ ہم سے یحییٰ بن سعید نے سفیان سے بیان کیا ، انہوں نے کہا کہ مجھ سے ابواسحاق نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن یزید نے بیان کیا ، کہا کہ مجھ سے براء بن عازب رضی اللہ عنہ نے بیان کیا ، وہ جھوٹے نہیں تھے ۔ ( بلکہ نہایت ہی سچے تھے ) انہوں نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي أَبُو إِسْحَاقَ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يَزِيدَ، قَالَ حَدَّثَنِي الْبَرَاءُ ـ وَهْوَ غَيْرُ كَذُوبٍ ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ‏.‏ لَمْ يَحْنِ أَحَدٌ مِنَّا ظَهْرَهُ حَتَّى يَقَعَ النَّبِيُّ صلى الله عليه وسلم سَاجِدًا، ثُمَّ نَقَعُ سُجُودًا بَعْدَهُ‏ ، حَدَّثَنَا أَبُو نُعَيْمٍ ، عَنْ سُفْيَانَ ، عَنْ أَبِي إِسْحَاقَ نَحْوَهُ بِهَذَا.",
                "headingArabic": "مَتَى يَسْجُدُ مَنْ خَلْفَ الإِمَامِ",
                "headingUrdu": "امام کے پیچھے والے سجدہ کب کریں؟",
                "headingEnglish": "When should those who are behind the Imam prostrate?",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 672,
                "hadithNumber": "691",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Isn't he who raises his head before the Imam afraid that Allah may transform his head into that of a donkey or his figure (face) into that of a donkey?\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا کیا تم میں وہ شخص جو ( رکوع یا سجدہ میں ) امام سے پہلے اپنا سر اٹھا لیتا ہے اس بات سے نہیں ڈرتا کہ کہیں اللہ پاک اس کا سر گدھے کے سر کی طرح بنا دے یا اس کی صورت کو گدھے کی سی صورت بنا دے ۔",
                "urduNarrator": "ہم سے حجاج بن منہال نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، انہوں نے محمد بن زیاد سے بیان کیا ، کہا کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَمَا يَخْشَى أَحَدُكُمْ ـ أَوْ لاَ يَخْشَى أَحَدُكُمْ ـ إِذَا رَفَعَ رَأْسَهُ قَبْلَ الإِمَامِ أَنْ يَجْعَلَ اللَّهُ رَأْسَهُ رَأْسَ حِمَارٍ أَوْ يَجْعَلَ اللَّهُ صُورَتَهُ صُورَةَ حِمَارٍ ‏\"‏‏.‏",
                "headingArabic": "إِثْمِ مَنْ رَفَعَ رَأْسَهُ قَبْلَ الإِمَامِ",
                "headingUrdu": "امام سے پہلے سر اٹھانے والے کا گناہ",
                "headingEnglish": "The sin of the one who raises his head before the Imam (raises his head)",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 673,
                "hadithNumber": "692",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When the earliest emigrants came to Al-`Usba [??] a place in Quba', before the arrival of the Prophet- Salim \r\nرضی اللہ عنہ  , the slave of Abu Hudhaifa, who knew the Qur'an more than the others used to lead them in prayer.",
                "hadithUrdu": "جب پہلے مہاجرین رسول اللہ صلی اللہ علیہ وسلم کی ہجرت سے بھی پہلے قباء کے مقام عصبہ میں پہنچے تو ان کی امامت ابوحذیفہ کے غلام سالم رضی اللہ عنہ کیا کرتے تھے ۔ آپ کو قرآن مجید سب سے زیادہ یاد تھا ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر حزامی نے بیان کیا ، انہوں نے کہا کہ ہم سے انس بن عیاض نے بیان کیا انہوں نے عبیداللہ عمری سے ، انہوں نے حضرت نافع سے انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ لَمَّا قَدِمَ الْمُهَاجِرُونَ الأَوَّلُونَ الْعُصْبَةَ ـ مَوْضِعٌ بِقُبَاءٍ ـ قَبْلَ مَقْدَمِ رَسُولِ اللَّهِ صلى الله عليه وسلم كَانَ يَؤُمُّهُمْ سَالِمٌ مَوْلَى أَبِي حُذَيْفَةَ، وَكَانَ أَكْثَرَهُمْ قُرْآنًا‏.‏",
                "headingArabic": "إِمَامَةِ الْعَبْدِ وَالْمَوْلَى",
                "headingUrdu": "غلام یا آزاد شدہ غلام نماز کی امامت کر سکتا ہے",
                "headingEnglish": "A slave or a manumitted slave can lead the Salat (prayer)",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 674,
                "hadithNumber": "693",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Listen and obey (your chief) even if an Ethiopian whose head is like a raisin were made your chief.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا ( اپنے حاکم کی ) سنو اور اطاعت کرو ، خواہ ایک ایسا حبشی ( غلام تم پر ) کیوں نہ حاکم بنا دیا جائے جس کا سر سوکھے ہوئے انگور کے برابر ہو ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ مجھ سے ابوالتیاح یزید بن حمید ضبعی نے انس بن مالک رضی اللہ عنہ سے بیان کیا ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي أَبُو التَّيَّاحِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ اسْمَعُوا وَأَطِيعُوا، وَإِنِ اسْتُعْمِلَ حَبَشِيٌّ كَأَنَّ رَأْسَهُ زَبِيبَةٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 675,
                "hadithNumber": "694",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If the Imam leads the prayer correctly then he and you will receive the rewards but if he makes a mistake (in the prayer) then you will receive the reward for the prayer and the sin will be his.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ امام لوگوں کو نماز پڑھاتے ہیں ۔ پس اگر امام نے ٹھیک نماز پڑھائی تو اس کا ثواب تمہیں ملے گا اور اگر غلطی کی تو بھی ( تمہاری نماز کا ) ثواب تم کو ملے گا اور غلطی کا وبال ان پر رہے گا ۔",
                "urduNarrator": "ہم سے فضل بن سہل نے بیان کیا ، کہا کہ ہم سے حسن بن موسیٰ اشیب نے بیان کیا ، کہا کہ ہم سے ابوعبدالرحمن بن عبداللہ بن دینار نے بیان کیا زید بن اسلم سے ، انہوں نے عطاء بن یسار سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا الْفَضْلُ بْنُ سَهْلٍ، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى الأَشْيَبُ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ يُصَلُّونَ لَكُمْ، فَإِنْ أَصَابُوا فَلَكُمْ، وَإِنْ أَخْطَئُوا فَلَكُمْ وَعَلَيْهِمْ ‏\"‏‏.‏",
                "headingArabic": "إِذَا لَمْ يُتِمَّ الإِمَامُ وَأَتَمَّ مَنْ خَلْفَهُ",
                "headingUrdu": "اگر امام صحیح طریقے سے نماز نہ پڑھے اور مقتدی بالکل ٹھیک پڑھے۔",
                "headingEnglish": "If the Imam does not offer the Salat (prayer) perfectly and the followers offer it perfectly",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 651,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=26",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=24",
                "label": "24",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=25",
                "label": "25",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=26",
                "label": "26",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=27",
                "label": "27",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=28",
                "label": "28",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=29",
                "label": "29",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=30",
                "label": "30",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=28",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=28",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=26",
        "to": 675,
        "total": 40465
    }
}