{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 72,
        "data": [
            {
                "id": 1777,
                "hadithNumber": "1853",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Hadrat Fadl bin Abbas رضی اللہ عنہ that a woman.",
                "hadithUrdu": "فضل بن عیاض رضی اللہ عنہم نے کہ ایک خاتون ۔ ۔ ۔ ( حدیث نمبر 1854 دیکھیں )",
                "urduNarrator": "ہم سے ابوعاصم نے ابن جریج سے بیان کیا ، انہوں نے کہا ان سے ابن شہاب نے ، ان سے سلیمان بن یسار نے ، ان سے عبداللہ بن عباس رضی اللہ عنہما نے اور ان سے",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ الْفَضْلِ بْنِ عَبَّاسٍ ـ رضى الله عنهم ـ أَنَّ امْرَأَةً، ح‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "29",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 29,
                    "chapterNumber": "29",
                    "chapterEnglish": "Penalty of Hunting while on Pilgrimage",
                    "chapterUrdu": "شکار کے بدلے کا بیان",
                    "chapterArabic": "كتاب جزاء الصيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1778,
                "hadithNumber": "1854",
                "englishNarrator": "Narrated `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "In the year of farewell pilgrimage, a woman belonging to Khath' am tribe came and said: O Allah's Apostle (ﷺ)! Allah ha prescribed the Hajj obligatory for his bondsmen. My father has grown extremely old and cannot sit on the mount properly. Will the Hajj be stood performed, If I perform it on his behalf? He (ﷺ) said: Yes.",
                "hadithUrdu": "حجۃ الوداع کے موقع پر قبیلہ خشعم کی ایک عورت آئی اور عرض کی یا رسول اللہ ! اللہ تعالیٰ کی طرف سے فریضہ حج جو اس کے بندوں پر ہے اس نے میرے بوڑھے باپ کو پا لیا ہے لیکن ان میں اتنی سکت نہیں کہ وہ سواری پر بھی بیٹھ سکیں تو کیامیں ان کی طرف سے حج کر لوں تو ان کا حج ادا ہو جائے گا ؟ آپ نے فرمایا کہ ہاں ۔",
                "urduNarrator": "( دوسری سند سے امام بخاری نے ) کہا ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے عبدالعزیز بن ابی سلمہ نے بیان کیا ، کہا ہم سے ابن شہاب زہری نے بیان کیا ، ان سے سلیمان بن یسار نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ جَاءَتِ امْرَأَةٌ مِنْ خَثْعَمَ، عَامَ حَجَّةِ الْوَدَاعِ، قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ فَرِيضَةَ اللَّهِ عَلَى عِبَادِهِ فِي الْحَجِّ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا، لاَ يَسْتَطِيعُ أَنْ يَسْتَوِيَ عَلَى الرَّاحِلَةِ فَهَلْ يَقْضِي عَنْهُ أَنْ أَحُجَّ عَنْهُ قَالَ ‏ \"‏ نَعَمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "29",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 29,
                    "chapterNumber": "29",
                    "chapterEnglish": "Penalty of Hunting while on Pilgrimage",
                    "chapterUrdu": "شکار کے بدلے کا بیان",
                    "chapterArabic": "كتاب جزاء الصيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1779,
                "hadithNumber": "1855",
                "englishNarrator": "Narrated 'Abdullah bin 'Abbas (رضی اللہ عنہما):",
                "hadithEnglish": "Al Fadl was riding behind the Prophet (ﷺ) and a woman from the tribe of Khath'am came up. Al Fadl started looking at her and she looked at him. The Prophet (ﷺ) turned Al-Fadl's face to the other side. She said, \"My father has come under Allah's obligation of performing Hajj but he is very old man and cannot sit properly on his Rahila (mount). Shall I perform Hajj on his behalf ? The Prophet (ﷺ) replied affirmative. That happened during Hajjat-ul-Wada' of the Prophet (ﷺ).",
                "hadithUrdu": "فضل بن عباس رضی اللہ عنہما رسول اللہ صلی اللہ علیہ وسلم کی سواری پر پیچھے بیٹھے ہوئے تھے ۔ اتنے میں قبیلہ خشعم کی ایک عورت آئی ۔ فضل رضی اللہ عنہ اس کو دیکھنے لگے اور وہ فضل رضی اللہ عنہ کو دیکھنے لگی ۔ اس لیے نبی کریم صلی اللہ علیہ وسلم فضل کا چہرہ دوسری طرف پھیرنے لگے ، اس عورت نے کہا کہ اللہ کا فریضہ ( حج ) نے میرے بوڑھے والد کو اس حالت میں پا لیا ہے کہ وہ سواری پر بیٹھ بھی نہیں سکتے تو کیا میں ان کی طرف سے حج کر سکتی ہوں ، آپ نے فرمایا کہ ہاں ۔ یہ حجۃ الوداع کا واقعہ ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے ، ان سے ابن شہاب زہری نے ، ان سے سلیمان بن یسار نے ، ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ الْفَضْلُ رَدِيفَ النَّبِيِّ صلى الله عليه وسلم فَجَاءَتِ امْرَأَةٌ مِنْ خَثْعَمٍ، فَجَعَلَ الْفَضْلُ يَنْظُرُ إِلَيْهَا، وَتَنْظُرُ إِلَيْهِ فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَصْرِفُ وَجْهَ الْفَضْلِ إِلَى الشِّقِّ الآخَرِ، فَقَالَتْ إِنَّ فَرِيضَةَ اللَّهِ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا، لاَ يَثْبُتُ عَلَى الرَّاحِلَةِ، أَفَأَحُجُّ عَنْهُ قَالَ ‏ \"‏ نَعَمْ ‏\"‏‏.‏ وَذَلِكَ فِي حَجَّةِ الْوَدَاعِ‏.‏",
                "headingArabic": "حَجِّ الْمَرْأَةِ عَنِ الرَّجُلِ",
                "headingUrdu": "عورت کا مرد کی طرف سے حج کرنا",
                "headingEnglish": "Performing Hajj by a woman on behalf of a man",
                "chapterId": "29",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 29,
                    "chapterNumber": "29",
                    "chapterEnglish": "Penalty of Hunting while on Pilgrimage",
                    "chapterUrdu": "شکار کے بدلے کا بیان",
                    "chapterArabic": "كتاب جزاء الصيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1780,
                "hadithNumber": "1856",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) sent me (to Mina) with the luggage from Jam' (i.e. Al-Muzdalifa) at night.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے مجھے مزدلفہ کی رات منیٰ میں سامان کے ساتھ آگے بھیج دیا تھا ۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے عبیداللہ بن ابی یزید رضی اللہ عنہ نے بیان کیا کہ میں نے ابن عباس رضی اللہ عنہما سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ بَعَثَنِي ـ أَوْ قَدَّمَنِي ـ النَّبِيُّ صلى الله عليه وسلم فِي الثَّقَلِ مِنْ جَمْعٍ بِلَيْلٍ‏.‏",
                "headingArabic": "حَجِّ الصِّبْيَانِ",
                "headingUrdu": "لڑکوں کا حج (بچوں وغیرہ)",
                "headingEnglish": "The Hajj of boys (children etc.)",
                "chapterId": "29",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 29,
                    "chapterNumber": "29",
                    "chapterEnglish": "Penalty of Hunting while on Pilgrimage",
                    "chapterUrdu": "شکار کے بدلے کا بیان",
                    "chapterArabic": "كتاب جزاء الصيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1781,
                "hadithNumber": "1857",
                "englishNarrator": "Narrated `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "I came riding on my she-ass and had (just) then attained the age of puberty. Allah's Messenger (ﷺ) was praying at Mina. I passed in front of a part of the first row and then dismounted from it, and the animal started grazing. I aligned with the people behind Allah's Messenger (ﷺ) (The sub-narrator added that happened in Mina during the Prophet's Hajjat-al-Wada`.)",
                "hadithUrdu": "میں اپنی ایک گدھی پر سوار ہو کر ( منیٰ میں آیا ) اس وقت میں جوانی کے قریب تھا ، رسول اللہ صلی اللہ علیہ وسلم منیٰ میں کھڑے نماز پڑھا رہے تھے ۔ میں پہلی صف کے ایک حصہ کے آگے سے ہو کر گزرا پھر سواری سے نیچے اتر آیا اور اسے چرنے کے لیے چھوڑ دیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم کے پیچھے لوگوں کے ساتھ صف میں شریک ہو گیا ، یونس نے ابن شہاب کے واسطہ سے بیان کیا کہ یہ حجۃ الوداع کے موقع پر منیٰ کا واقعہ ہے ۔",
                "urduNarrator": "ہم سے اسحٰق بن منصور نے بیان کیا ، انہوں نے کہا ہمیں یعقوب بن ابراہیم نے خبر دی ، ان سے ان کے بھتیجے ابن شہاب زہری نے بیان کیا ، ان سے ان کے چچا نے ، انہیں عبیداللہ بن عبداللہ بن عتبہ نے ، خبر دی کہ ابن عباس رضی اللہ عنہما نے کہا",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَقْبَلْتُ وَقَدْ نَاهَزْتُ الْحُلُمَ، أَسِيرُ عَلَى أَتَانٍ لِي، وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ يُصَلِّي بِمِنًى، حَتَّى سِرْتُ بَيْنَ يَدَىْ بَعْضِ الصَّفِّ الأَوَّلِ، ثُمَّ نَزَلْتُ عَنْهَا فَرَتَعَتْ، فَصَفَفْتُ مَعَ النَّاسِ وَرَاءَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَقَالَ يُونُسُ عَنِ ابْنِ شِهَابٍ بِمِنًى فِي حَجَّةِ الْوَدَاعِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "29",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 29,
                    "chapterNumber": "29",
                    "chapterEnglish": "Penalty of Hunting while on Pilgrimage",
                    "chapterUrdu": "شکار کے بدلے کا بیان",
                    "chapterArabic": "كتاب جزاء الصيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1782,
                "hadithNumber": "1858",
                "englishNarrator": "Narrated As-Sa'ib bin Yazid رضی اللہ عنہ :",
                "hadithEnglish": "(While in the company of my parents) I was made to perform Hajj with Allah's Messenger (ﷺ) and I was a seven-year-old boy then. (Fath-ul-Bari, p.443, Vol.4)",
                "hadithUrdu": "مجھے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج کرایا گیا تھا ۔ میں اس وقت سات سال کا تھا ۔",
                "urduNarrator": "ہم سے عبدالرحمٰن بن یونس نے بیان کیا ، ان سے حاتم بن اسماعیل نے بیان کیا ، ان سے محمد بن یوسف نے اور ان سے سائب بن یزید رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يُونُسَ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ مُحَمَّدِ بْنِ يُوسُفَ، عَنِ السَّائِبِ بْنِ يَزِيدَ، قَالَ حُجَّ بِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا ابْنُ سَبْعِ سِنِينَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "29",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 29,
                    "chapterNumber": "29",
                    "chapterEnglish": "Penalty of Hunting while on Pilgrimage",
                    "chapterUrdu": "شکار کے بدلے کا بیان",
                    "chapterArabic": "كتاب جزاء الصيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1783,
                "hadithNumber": "1859",
                "englishNarrator": "Narrated Al-Ju'aid bin `Abdur-Rahman:",
                "hadithEnglish": "I heard `Umar bin `Abdul `Aziz telling about As-Sa'ib bin Yazid رضی اللہ عنہ that he had performed Hajj (while carried) with the belongings of the Prophet.",
                "hadithUrdu": "عمر بن عبدالعزیز رحمہ اللہ سے سنا ، وہ سائب بن یزید رضی اللہ عنہ سے کہہ رہے تھے سائب رضی اللہ عنہ کو نبی کریم صلی اللہ علیہ وسلم کے سامان کے ساتھ ( یعنی بال بچوں میں ) حج کرایا گیا تھا ۔",
                "urduNarrator": "ہم سے عمرو بن ذرارہ نے بیان کیا ، کہا کہ ہمیں قاسم بن مالک نے خبر دی ، انہیں جعید بن عبدالرحمٰن نے ، انہوں نے کہا کہ میں نے",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا الْقَاسِمُ بْنُ مَالِكٍ، عَنِ الْجُعَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ سَمِعْتُ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، يَقُولُ لِلسَّائِبِ بْنِ يَزِيدَ، وَكَانَ قَدْ حُجَّ بِهِ فِي ثَقَلِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "29",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 29,
                    "chapterNumber": "29",
                    "chapterEnglish": "Penalty of Hunting while on Pilgrimage",
                    "chapterUrdu": "شکار کے بدلے کا بیان",
                    "chapterArabic": "كتاب جزاء الصيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1784,
                "hadithNumber": "1860",
                "englishNarrator": "Narrated Ibrahim's grand-father that:",
                "hadithEnglish": "'Umar(رضی اللہ عنہ) in his last Hajj allowed the wives of the Prophet(ﷺ)to perform Hajj and he sent with them 'Uthman bin 'Affan(ra) and 'Abdur-Rahman bin 'Auf( رضی اللہ عنہما) as escorts.",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ نے اپنے آخری حج کے موقع پر نبی کریم صلی اللہ علیہ وسلم کی بیویوں کو حج کی اجازت دی تھی اور ان کے ساتھ عثمان بن عفان اور عبدالرحمٰن بن عوف رضی اللہ عنہما کو بھیجا تھا ۔",
                "urduNarrator": "امام بخاری رحمہ اللہ نے کہا کہ مجھ سے احمد بن محمد نے کہا کہ ان سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والد نے ، ان سے ان کے داد ا( ابراہیم بن عبدالرحمٰن بن عوف رضی اللہ عنہ ) نے کہ",
                "hadithArabic": "وَقَالَ لِي أَحْمَدُ بْنُ مُحَمَّدٍ حَدَّثَنَا إِبْرَاهِيمُ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَذِنَ عُمَرُ ـ رضى الله عنه ـ لأَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم فِي آخِرِ حَجَّةٍ حَجَّهَا، فَبَعَثَ مَعَهُنَّ عُثْمَانَ بْنَ عَفَّانَ وَعَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ‏.‏",
                "headingArabic": "حَجِّ النِّسَاءِ",
                "headingUrdu": "خواتین کا حج",
                "headingEnglish": "Hajj of women",
                "chapterId": "29",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 29,
                    "chapterNumber": "29",
                    "chapterEnglish": "Penalty of Hunting while on Pilgrimage",
                    "chapterUrdu": "شکار کے بدلے کا بیان",
                    "chapterArabic": "كتاب جزاء الصيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1785,
                "hadithNumber": "1861",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا (mother of the faithful believers):",
                "hadithEnglish": "I said, \"O Allah's Messenger (ﷺ)! Shouldn't we participate in Holy battles and Jihad along with you?\" He replied, \"The best and the most superior Jihad (for women) is Hajj which is accepted by Allah.\" `Aisha رضی اللہ عنہا added: Ever since I heard that from Allah's Messenger (ﷺ) I have determined not to miss Hajj.",
                "hadithUrdu": "میں نے پوچھا یا رسول اللہ صلی اللہ علیہ وسلم ! ہم بھی کیوں نہ آپ صلی اللہ علیہ وسلم کے ساتھ جہاد اور غزووں میں جایا کریں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا تم لوگوں کے لیے سب سے عمدہ اور سب سے مناسب جہاد حج ہے ، وہ حج جو مقبول ہو ۔ حضرت عائشہ رضی اللہ عنہا کہتی تھیں کہ جب سے میں نے رسول اللہ صلی اللہ علیہ وسلم کا یہ ارشاد سن لیا ہے حج کو میں کبھی چھوڑنے والی نہیں ہوں ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے عبدالواحد نے بیان کیا ، ان سے حبیب بن عمرہ نے بیان کیا ، انھوں نے کہامجھ سے عائشہ بنت طلحہ نے بیان کیا اور ان سے ام المؤمنین عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا حَبِيبُ بْنُ أَبِي عَمْرَةَ، قَالَ حَدَّثَتْنَا عَائِشَةُ بِنْتُ طَلْحَةَ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ أَلاَ نَغْزُوا وَنُجَاهِدُ مَعَكُمْ فَقَالَ ‏ \"‏ لَكُنَّ أَحْسَنُ الْجِهَادِ وَأَجْمَلُهُ الْحَجُّ، حَجٌّ مَبْرُورٌ ‏\"‏‏.‏ فَقَالَتْ عَائِشَةُ فَلاَ أَدَعُ الْحَجَّ بَعْدَ إِذْ سَمِعْتُ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "29",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 29,
                    "chapterNumber": "29",
                    "chapterEnglish": "Penalty of Hunting while on Pilgrimage",
                    "chapterUrdu": "شکار کے بدلے کا بیان",
                    "chapterArabic": "كتاب جزاء الصيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1786,
                "hadithNumber": "1862",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A woman should not travel except with a Dhu-Mahram (her husband or a man with whom that woman cannot marry at all according to the Islamic Jurisprudence), and no man may visit her except in the presence of a Dhu-Mahram.\" A man got up and said, \"O Allah's Messenger (ﷺ)! I intend to go to such and such an army and my wife wants to perform Hajj.\" The Prophet (ﷺ) said (to him), \"Go along with her (to Hajj).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کوئی عورت اپنے محرم رشتہ دار کے بغیر سفر نہ کرے اور کوئی شخص کسی عورت کے پاس اس وقت تک نہ جائے جب تک وہاں ذی محرم موجود نہ ہو ۔ ایک شخص نے پوچھا کہ یا رسول اللہ ! میں فلاں لشکر میں جہاد کے لیے نکلنا چاہتا ہوں ، لیکن میری بیوی کا ارادہ حج کا ہے ؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تو اپنی بیوی کے ساتھ حج کو جا ۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے عمرو بن دینار نے بیان کیا ، ان سے ابن عباس رضی اللہ عنہما کے غلام ابومعبد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، عَنْ أَبِي مَعْبَدٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تُسَافِرِ الْمَرْأَةُ إِلاَّ مَعَ ذِي مَحْرَمٍ، وَلاَ يَدْخُلُ عَلَيْهَا رَجُلٌ إِلاَّ وَمَعَهَا مَحْرَمٌ ‏\"‏‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ أَنْ أَخْرُجَ فِي جَيْشِ كَذَا وَكَذَا، وَامْرَأَتِي تُرِيدُ الْحَجَّ‏.‏ فَقَالَ ‏\"‏ اخْرُجْ مَعَهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "29",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 29,
                    "chapterNumber": "29",
                    "chapterEnglish": "Penalty of Hunting while on Pilgrimage",
                    "chapterUrdu": "شکار کے بدلے کا بیان",
                    "chapterArabic": "كتاب جزاء الصيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1787,
                "hadithNumber": "1863",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When the Prophet (ﷺ) returned after performing his Hajj, he asked Um Sinan Al-Ansari, \"What did forbid you to perform Hajj?\" She replied, \"Father of so-and-so (i.e. her husband) had two camels and he performed Hajj on one of them, and the second is used for the irrigation of our land.\" The Prophet (ﷺ) said (to her), \"Perform `Umra in the month of Ramadan, (as it is equivalent to Hajj or Hajj with me (in reward). Ibn Juraj, Ata, Ibn Abbas رضی اللہ عنہما , reported it from the Prophet (ﷺ).",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم حجۃ الوداع سے واپس ہوئے تو آپ صلی اللہ علیہ وسلم نے ام سنان انصاریہ عورت رضی اللہ عنہا سے دریافت فرمایا کہ تو حج کرنے نہیں گئی ؟ انہوں نے عرض کی کہ فلاں کے باپ یعنی میرے خاوند کے پاس دو اونٹ پانی پلانے کے تھے ایک پر تو خود حج کو چلے گئے اور دوسرا ہماری زمین سیراب کرتا ہے ۔ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ رمضان میں عمرہ کرنا میرے ساتھ حج کرنے کے برابر ہے ، اس روایت کو ابن جریج نے عطاء سے سنا ، کہا انہوں نے ابن عباس رضی اللہ عنہما سے سنا ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ، اور عبیداللہ نے عبدالکریم سے روایت کیا ، ان سے عطاء نے ان سے جابر رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، کہا ہم کو یزید بن زریع نے خبر دی ، کہا ہم کو حبیب معلم نے خبر دی ، انہیں عطاء بن ابی رباح نے اور ان سے ابن عباس رضی اللہ عنہما نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، أَخْبَرَنَا حَبِيبٌ الْمُعَلِّمُ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا رَجَعَ النَّبِيُّ صلى الله عليه وسلم مِنْ حَجَّتِهِ قَالَ لأُمِّ سِنَانٍ الأَنْصَارِيَّةِ ‏\"‏ مَا مَنَعَكِ مِنَ الْحَجِّ ‏\"‏‏.‏ قَالَتْ أَبُو فُلاَنٍ ـ تَعْنِي زَوْجَهَا ـ كَانَ لَهُ نَاضِحَانِ، حَجَّ عَلَى أَحَدِهِمَا، وَالآخَرُ يَسْقِي أَرْضًا لَنَا‏.‏ قَالَ ‏\"‏ فَإِنَّ عُمْرَةً فِي رَمَضَانَ تَقْضِي حَجَّةً مَعِي ‏\"‏‏.‏ رَوَاهُ ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ سَمِعْتُ ابْنَ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "29",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 29,
                    "chapterNumber": "29",
                    "chapterEnglish": "Penalty of Hunting while on Pilgrimage",
                    "chapterUrdu": "شکار کے بدلے کا بیان",
                    "chapterArabic": "كتاب جزاء الصيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1788,
                "hadithNumber": "1864",
                "englishNarrator": "Narrated Qaza'a the slave of Ziyad:",
                "hadithEnglish": "Abu Sa`id رضی اللہ عنہ who participated in twelve Ghazawat with the Prophet (ﷺ) said, \"I heard four things from Allah's Messenger (ﷺ) (or I narrate them from the Prophet (ﷺ) ) which won my admiration and appreciation. They are: -1. \"No lady should travel without her husband or without a Dhu-Mahram for a two-days' journey. -2. No fasting is permissible on two days of `Id-ul-Fitr, and `Id-al-Adha. -3. No prayer (may be offered) after two prayers: after the `Asr prayer till the sun set and after the morning prayer till the sun rises. -4. Not to travel (for visiting) except for three mosques: Masjid-al-Haram (in Mecca), my Mosque (in Medina), and Masjid-al-Aqsa (in Jerusalem).",
                "hadithUrdu": "میں نے ابو سعید خدری رضی اللہ عنہ سے سنا جنہوں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ بارہ جہاد کئے تھے ۔ وہ کہتے تھے کہ میں نے چار باتیں نبی کریم صلی اللہ علیہ وسلم سے سنی تھیں یا یہ کہ وہ یہ چار باتیں نبی کریم صلی اللہ علیہ وسلم سے نقل کرتے اور کہتے تھے کہ یہ باتیں مجھے انتہائی پسند ہیں یہ کہ کوئی عورت دو دن کا سفر اس وقت تک نہ کرے جب تک اس کے ساتھ اس کا شوہر یا کوئی ذو رحم محرم نہ ہو ، نہ عیدالفطر اور عیدالاضحی کے روزے رکھے جائیں نہ عصر کی نماز کے بعد غروب ہونے کے پہلے اور نہ صبح کی نماز کے بعد سورج نکلنے سے پہلے کوئی نماز پڑھی جائے اور نہ تین مساجد کے سوا کسی کے لیے کجاوے باندھے جائیں مسجدالحرام ، میری مسجد اورمسجد الاقصیٰ ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے شعبہ نے ، ان سے عبدالملک بن عمر نے ، ان سے زیاد کے غلام قزعہ نے ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ قَزَعَةَ، مَوْلَى زِيَادٍ قَالَ سَمِعْتُ أَبَا سَعِيدٍ ـ وَقَدْ غَزَا مَعَ النَّبِيِّ صلى الله عليه وسلم ثِنْتَىْ عَشْرَةَ ـ غَزْوَةً ـ قَالَ أَرْبَعٌ سَمِعْتُهُنَّ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَوْ قَالَ يُحَدِّثُهُنَّ عَنِ النَّبِيِّ صلى الله عليه وسلم ـ فَأَعْجَبْنَنِي وَآنَقْنَنِي ‏ \"‏ أَنْ لاَ تُسَافِرَ امْرَأَةٌ مَسِيرَةَ يَوْمَيْنِ لَيْسَ مَعَهَا زَوْجُهَا أَوْ ذُو مَحْرَمٍ، وَلاَ صَوْمَ يَوْمَيْنِ الْفِطْرِ وَالأَضْحَى، وَلاَ صَلاَةَ بَعْدَ صَلاَتَيْنِ بَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ، وَبَعْدَ الصُّبْحِ حَتَّى تَطْلُعَ الشَّمْسُ، وَلاَ تُشَدُّ الرِّحَالُ إِلاَّ إِلَى ثَلاَثَةِ مَسَاجِدَ مَسْجِدِ الْحَرَامِ، وَمَسْجِدِي، وَمَسْجِدِ الأَقْصَى ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "29",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 29,
                    "chapterNumber": "29",
                    "chapterEnglish": "Penalty of Hunting while on Pilgrimage",
                    "chapterUrdu": "شکار کے بدلے کا بیان",
                    "chapterArabic": "كتاب جزاء الصيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1789,
                "hadithNumber": "1865",
                "englishNarrator": "Narrated Anas:",
                "hadithEnglish": "The Prophet (ﷺ) saw an old man walking, supported by his two sons, and asked about him. The people informed him that he had vowed to go on foot (to the Ka`ba). He said, \"Allah is not in need of this old man's torturing himself,\" and ordered him to ride.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک بوڑھے شخص کو دیکھا جو اپنے دو بیٹوں کا سہارا لیے چل رہا ہے ۔ آپ صلی اللہ علیہ وسلم نے پوچھا ان صاحب کا کیا حال ہے ؟ لوگوں نے بتایا کہ انہوں نے کعبہ کو پیدل چلنے کی منت مانی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ اس سے بےنیاز ہے کہ یہ اپنے کو تکلیف میں ڈالیں پھر آپ صلی اللہ علیہ وسلم نے انہیں سوار ہونے کا حکم دیا ۔",
                "urduNarrator": "ہم سے محمدبن سلام نے بیان کیا ، کہا ہمیں مروان فزاری نے خبر دی ، انہیں حمیدطویل نے ، انہوں نے بیان کیا کہ مجھ سے ثابت نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا الْفَزَارِيُّ، عَنْ حُمَيْدٍ الطَّوِيلِ، قَالَ حَدَّثَنِي ثَابِتٌ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى شَيْخًا يُهَادَى بَيْنَ ابْنَيْهِ قَالَ ‏\"‏ مَا بَالُ هَذَا ‏\"‏‏.‏ قَالُوا نَذَرَ أَنْ يَمْشِيَ‏.‏ قَالَ ‏\"‏ إِنَّ اللَّهَ عَنْ تَعْذِيبِ هَذَا نَفْسَهُ لَغَنِيٌّ ‏\"‏‏.‏ وَأَمَرَهُ أَنْ يَرْكَبَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "29",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 29,
                    "chapterNumber": "29",
                    "chapterEnglish": "Penalty of Hunting while on Pilgrimage",
                    "chapterUrdu": "شکار کے بدلے کا بیان",
                    "chapterArabic": "كتاب جزاء الصيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1790,
                "hadithNumber": "1866",
                "englishNarrator": "Narrated `Uqba bin 'Amir:",
                "hadithEnglish": "My sister vowed to go on foot to the Ka`ba, and she asked me to take the verdict of the Prophet (ﷺ) about it. So, I did and the Prophet (ﷺ) said, \"She should walk and also should ride.\" Narrated Abul-Khair from `Uqba رضی اللہ عنہ as above.",
                "hadithUrdu": "میری بہن نے منت مانی تھی کہ بیت اللہ تک وہ پیدل جائیں گی ، پھر انہوں نے مجھ سے کہا کہ تم اس کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے بھی پوچھ لو چنانچہ میں نے آپ صلی اللہ علیہ وسلم سے پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ پیدل چلیں اور سوار بھی ہو جائیں ۔ یزید نے کہا کہ ابوالخیر ہمیشہ عقبہ رضی اللہ عنہ کے ساتھ رہتے تھے ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہم کو ہشام بن یوسف نے خبر دی کہ ابن جریج نے انہیں خبر دی ، انہوں نے بیان کیا کہ مجھے سعید بن ابی ایوب نے خبر دی ، انہیں یزید بن حبیب نے خبر دی ، انہیں ابوالخیر نے خبر دی ، کہ عقبہ بن عامر رضی اللہ عنہ نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ، أَنَّ يَزِيدَ بْنَ أَبِي حَبِيبٍ، أَخْبَرَهُ أَنَّ أَبَا الْخَيْرِ حَدَّثَهُ عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ نَذَرَتْ أُخْتِي أَنْ تَمْشِيَ، إِلَى بَيْتِ اللَّهِ، وَأَمَرَتْنِي أَنْ أَسْتَفْتِيَ لَهَا النَّبِيَّ صلى الله عليه وسلم فَاسْتَفْتَيْتُهُ، فَقَالَ عَلَيْهِ السَّلاَمُ ‏ \"‏ لِتَمْشِ وَلْتَرْكَبْ ‏\"‏‏.‏ قَالَ وَكَانَ أَبُو الْخَيْرِ لاَ يُفَارِقُ عُقْبَةَ‏.‏ قَالَ أَبُو عَبْد اللَّهِ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ يَزِيدَ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ فَذَكَرَ الْحَدِيثَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "29",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 29,
                    "chapterNumber": "29",
                    "chapterEnglish": "Penalty of Hunting while on Pilgrimage",
                    "chapterUrdu": "شکار کے بدلے کا بیان",
                    "chapterArabic": "كتاب جزاء الصيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1791,
                "hadithNumber": "1867",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Medina is a sanctuary from that place to that. Its trees should not be cut and no heresy should be innovated nor any sin should be committed in it, and whoever innovates in it an heresy or commits sins (bad deeds), then he will incur the curse of Allah, the angels, and all the people.\" (See Hadith No. 409, Vol 9).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مدینہ حرم ہے فلاں جگہ سے فلاں جگہ تک ( یعنی جبل عیر سے ثور تک ) اس حد میں کوئی درخت نہ کاٹا جائے نہ کوئی بدعت کی جائے اور جس نے بھی یہاں کوئی بدعت نکالی اس پر اللہ تعالیٰ اور تمام ملائکہ اور انسانوں کی لعنت ہے ۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، ان سے ثابت بن یزید نے بیان کیا ، ان سے ابوعبدالرحمٰن احول عاصم نے بیان کیا ، اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ، حَدَّثَنَا عَاصِمٌ أَبُو عَبْدِ الرَّحْمَنِ الأَحْوَلُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمَدِينَةُ حَرَمٌ، مِنْ كَذَا إِلَى كَذَا، لاَ يُقْطَعُ شَجَرُهَا، وَلاَ يُحْدَثُ فِيهَا حَدَثٌ، مَنْ أَحْدَثَ حَدَثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ ‏\"‏‏.‏",
                "headingArabic": "حَرَمِ الْمَدِينَةِ",
                "headingUrdu": "المدینہ کا حرم",
                "headingEnglish": "Haram (sanctuary) of Al-Madina",
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1792,
                "hadithNumber": "1868",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) came to Medina and ordered a mosque to be built and said, \"O Bani Najjar! Suggest to me the price (of your land).\" They said, \"We do not want its price except from Allah\" (i.e. they wished for a reward from Allah for giving up their land freely). So, the Prophet (ﷺ) ordered the graves of the pagans to be dug out and the land to be leveled, and the date-palm trees to be cut down. The cut datepalms were fixed in the direction of the Qibla of the mosque.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب مدینہ ( ہجرت کر کے ) تشریف لائے تو آنحضرت صلی اللہ علیہ وسلم نے مسجد کی تعمیر کا حکم دیا ، آپ صلی اللہ علیہ وسلم نے فرمایا اے بنو نجار تم ( اپنی اس زمین کی ) مجھ سے قیمت لے لو لیکن انہوں نے عرض کی کہ ہم اس کی قیمت صرف اللہ تعالیٰ سے مانگتے ہیں ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے مشرکین کی قبروں کے متعلق فرمایا اور وہ اکھاڑی دی گئیں ، ویرانہ کے متعلق حکم دیا اور وہ برابر کر دیا گیا ، کھجور کے درختوں کے متعلق حکم دیا اور وہ کاٹ دیئے گئے اور وہ درخت قبلہ کی طرف بچھا دیئے گئے ۔",
                "urduNarrator": "ہم سے ابومعمر نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، ان سے ابوالتیاح نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ فَأَمَرَ بِبِنَاءِ الْمَسْجِدِ فَقَالَ ‏ \"‏ يَا بَنِي النَّجَّارِ ثَامِنُونِي ‏\"‏‏.‏ فَقَالُوا لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ‏.‏ فَأَمَرَ بِقُبُورِ الْمُشْرِكِينَ، فَنُبِشَتْ، ثُمَّ بِالْخِرَبِ فَسُوِّيَتْ، وَبِالنَّخْلِ فَقُطِعَ، فَصَفُّوا النَّخْلَ قِبْلَةَ الْمَسْجِدِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1793,
                "hadithNumber": "1869",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I have made Medina a sanctuary between its two (Harrat) mountains.\" The Prophet (ﷺ) went to the tribe of Bani Haritha and said (to them), \"I see that you have gone out of the sanctuary,\" but looking around, he added, \"No, you are inside the sanctuary.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مدینہ کے دونوں پتھریلے کناروں میں جو زمین ہے وہ میری زبان پر حرم ٹھہرائی گئی ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم بنو حارثہ کے پاس آئے اور فرمایا بنوحارثہ ! میرا خیال ہے کہ تم لوگ حرم سے باہر ہو گئے ہو ، پھر آپ صلی اللہ علیہ وسلم نے مڑ کر دیکھا اور فرمایا کہ نہیں بلکہ تم لوگ حرم کے اندر ہی ہو ۔",
                "urduNarrator": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا ، ان سے سلیمان بن بلال نے ، ان سے عبیداللہ نے ، ان سے سعید مقبری نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ حُرِّمَ مَا بَيْنَ لاَبَتَىِ الْمَدِينَةِ عَلَى لِسَانِي ‏\"‏‏.‏ قَالَ وَأَتَى النَّبِيُّ صلى الله عليه وسلم بَنِي حَارِثَةَ فَقَالَ ‏\"‏ أَرَاكُمْ يَا بَنِي حَارِثَةَ قَدْ خَرَجْتُمْ مِنَ الْحَرَمِ ‏\"‏‏.‏ ثُمَّ الْتَفَتَ، فَقَالَ ‏\"‏ بَلْ أَنْتُمْ فِيهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1794,
                "hadithNumber": "1870",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "We have nothing except the Book of Allah and this written paper from the Prophet (wherein is written:) Medina is a sanctuary from the 'Air Mountain to such and such a place, and whoever innovates in it an heresy or commits a sin, or gives shelter to such an innovator in it will incur the curse of Allah, the angels, and all the people, none of his compulsory or optional good deeds of worship will be accepted. And the asylum (of protection) granted by any Muslim is to be secured (respected) by all the other Muslims; and whoever betrays a Muslim in this respect incurs the curse of Allah, the angels, and all the people, and none of his compulsory or optional good deeds of worship will be accepted, and whoever (freed slave) befriends (take as masters) other than his manumitters without their permission incurs the curse of Allah, the angels, and all the people, and none of his compulsory or optional good deeds of worship will be accepted.",
                "hadithUrdu": "میرے پاس کتاب اللہ اور نبی کریم صلی اللہ علیہ وسلم کے اس صحیفہ کے سوا جو نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے ہے اور کوئی چیز ( شرعی احکام سے متعلق ) لکھی ہوئی صورت میں نہیں ہے ۔ اس صحیفہ میں یہ بھی لکھا ہوا ہے کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا مدینہ عائر پہاڑی سے لے کر فلاں مقام تک حرم ہے ، جس نے اس حد میں کوئی بدعت نکالی یا کسی بدعتی کو پناہ دی تو اس پر اللہ اور تمام ملائکہ اور انسانوں کی لعنت ہے ، نہ اس کی کوئی فرض عبادت مقبول ہے نہ نفل اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمام مسلمانوں میں سے کسی کا بھی عہد کافی ہے اس لیے اگر کسی مسلمان کی ( دی ہوئی امان میں دوسرے مسلمان نے ) بدعہدی کی تو اس پر اللہ تعالیٰ اور تمام ملائکہ اور انسانوں کی لعنت ہے ۔ نہ اس کی کوئی فرض عبادت مقبول ہے نہ نفل ، اور جو کوئی اپنے مالک کو چھوڑ کر اس کی اجازت کے بغیر کسی دوسرے کو مالک بنائے ، اس پر اللہ اور تمام ملائکہ اور انسانوں کی لعنت ہے ، نہ اس کی کوئی فرض عبادت مقبول ہے نہ نفل ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ، ان سے سفیان ثوری نے ، ان سے اعمش نے ، ان سے ان کے والد یزید بن شریک نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ مَا عِنْدَنَا شَىْءٌ إِلاَّ كِتَابُ اللَّهِ، وَهَذِهِ الصَّحِيفَةُ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ الْمَدِينَةُ حَرَمٌ، مَا بَيْنَ عَائِرٍ إِلَى كَذَا، مَنْ أَحْدَثَ فِيهَا حَدَثًا، أَوْ آوَى مُحْدِثًا، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ ‏\"‏‏.‏ وَقَالَ ‏\"‏ ذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ، فَمَنْ أَخْفَرَ مُسْلِمًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ، وَمَنْ تَوَلَّى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ، فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ، لاَ يُقْبَلُ مِنْهُ صَرْفٌ وَلاَ عَدْلٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1795,
                "hadithNumber": "1871",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"I was ordered to migrate to a town which will swallow (conquer) other towns and is called Yathrib and that is Medina, and it turns out (bad) persons as a furnace removes the impurities of iron.",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مجھے ایک ایسے شہر ( میں ہجرت ) کا حکم ہوا ہے جو دوسرے شہروں کو کھا لے گا ۔ ( یعنی سب کا سردار بنے گا ) منافقین اسے یثرب کہتے ہیں لیکن اس کا نام مدینہ ہے وہ ( برے ) لوگوں کو اس طرح باہر کر دیتا ہے جس طرح بھٹی لوہے کے زنگ کو نکال دیتی ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہمیں امام مالک رحمہ اللہ نے خبر دی ، انہیں یحییٰ بن سعید نے ، انہوں نے بیان کیا کہ میں نے ابوالحباب سعید بن یسار سے سنا ، انہوں نے کہا کہ میں نے ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ سَمِعْتُ أَبَا الْحُبَابِ، سَعِيدَ بْنَ يَسَارٍ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ ‏ \"‏ أُمِرْتُ بِقَرْيَةٍ تَأْكُلُ الْقُرَى يَقُولُونَ يَثْرِبُ‏.‏ وَهْىَ الْمَدِينَةُ، تَنْفِي النَّاسَ كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ الْمَدِينَةِ، وَأَنَّهَا تَنْفِي النَّاسَ",
                "headingUrdu": "المدینہ کی برتری یہ (برے) لوگوں کو نکال دیتا ہے۔",
                "headingEnglish": "Superiority of Al-Madina. It expels (evil) persons",
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1796,
                "hadithNumber": "1872",
                "englishNarrator": "Narrated Abu Humaid رضی اللہ عنہ :",
                "hadithEnglish": "We came with the Prophet (ﷺ) from Tabuk, and when we reached near Medina, the Prophet (ﷺ) said, \"This is Tabah.\"",
                "hadithUrdu": "ہم غزوہ تبوک سے نبی کریم صلی اللہ علیہ وسلم کے ساتھ واپس ہوتے ہوئے جب مدینہ کے قریب پہنچے تو آپ نے فرمایا کہ یہ طابہ آ گیا ۔",
                "urduNarrator": "ہم سے خالد بن مخلد نے بیان کیا ، کہا کہ ہم سے سلیمان بن بلال نے بیان کیا ، کہا کہ مجھ سے عمرو بن یحییٰ نے بیان کیا ، ان سے عباس بن سہل بن سعد نے اور ان سے ابو حمید ساعدی رضی اللہ عنہ نے یہ بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، قَالَ حَدَّثَنِي عَمْرُو بْنُ يَحْيَى، عَنْ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ، عَنْ أَبِي حُمَيْدٍ ـ رضى الله عنه ـ أَقْبَلْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مِنْ تَبُوكَ حَتَّى أَشْرَفْنَا عَلَى الْمَدِينَةِ فَقَالَ ‏ \"‏ هَذِهِ طَابَةُ ‏\"‏‏.‏",
                "headingArabic": "الْمَدِينَةُ طَابَةُ",
                "headingUrdu": "المدینہ کو تبع بھی کہا جاتا ہے۔",
                "headingEnglish": "Al-Madina is also called Taba",
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1797,
                "hadithNumber": "1873",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "If I saw deers grazing in Medina, I would not chase them, for Allah's Messenger (ﷺ) said, \"(Medina) is a sanctuary between its two mountains.\"",
                "hadithUrdu": "اگر میں مدینہ میں ہرن چرتے ہوئے دیکھوں تو انہیں کبھی نہ چھیڑوں کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ مدینہ کی زمین دونوں پتھریلے میدانوں کے بیچ میں حرم ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہمیں امام مالک نے خبر دی ، انہیں ابن شہاب زہری نے ، انہیں سعید بن مسیب نے کہ ابوہریرہ رضی اللہ عنہ فرمایا کرتے تھے",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ كَانَ يَقُولُ لَوْ رَأَيْتُ الظِّبَاءَ بِالْمَدِينَةِ تَرْتَعُ مَا ذَعَرْتُهَا، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا بَيْنَ لاَبَتَيْهَا حَرَامٌ ‏\"‏‏.‏",
                "headingArabic": "لاَبَتَىِ الْمَدِينَةِ",
                "headingUrdu": "مدینہ کے دو پہاڑ",
                "headingEnglish": "The two mountains of Al-Madina",
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1798,
                "hadithNumber": "1874",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"The people will leave Medina in spite of the best state it will have, and none except the wild birds and the beasts of prey will live in it, and the last persons who will die will be two shepherds from the tribe of Muzaina, who will be driving their sheep towards Medina, but will find nobody in it, and when they reach the valley of Thaniyat-al-Wada`, they will fall down on their faces dead.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ مدینہ کو بہتر حالت میں چھوڑ جاؤ گے پھر وہ ایسا اجاڑ ہو جائے گا کہ پھر وہاں وحشی جانور ، درند اور پرند بسنے لگیں گے اور آخر میں مزینہ کے دو چرواہے مدینہ آئیں گے تاکہ اپنی بکریوں کو ہانک لے جائیں لیکن وہاں انہیں صرف وحشی جانور نظر آئیں گے آخر ثنیۃ الوداع تک جب پہنچیں گے تو اپنے منہ کے بل گر پڑیں گے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہمیں شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا کہ مجھے سعید بن مسیب نے خبر دی ، ان سے ابوہریرہ رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ يَتْرُكُونَ الْمَدِينَةَ عَلَى خَيْرِ مَا كَانَتْ، لاَ يَغْشَاهَا إِلاَّ الْعَوَافِ ـ يُرِيدُ عَوَافِيَ السِّبَاعِ وَالطَّيْرِ ـ وَآخِرُ مَنْ يُحْشَرُ رَاعِيَانِ مِنْ مُزَيْنَةَ، يُرِيدَانِ الْمَدِينَةَ يَنْعِقَانِ بِغَنَمِهِمَا، فَيَجِدَانِهَا وَحْشًا، حَتَّى إِذَا بَلَغَا ثَنِيَّةَ الْوَدَاعِ خَرَّا عَلَى وُجُوهِهِمَا ‏\"‏‏.‏",
                "headingArabic": "مَنْ رَغِبَ عَنِ الْمَدِينَةِ",
                "headingUrdu": "وہ جو مدینہ میں رہنے سے گریز کرتا ہے؟",
                "headingEnglish": "The one who avoids living in Al-Madina?",
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1799,
                "hadithNumber": "1875",
                "englishNarrator": "Narrated Sufyan b. Abu Zuhair رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"Yemen will be conquered and some people will migrate (from Medina) and will urge their families, and those who will obey them to migrate (to Yemen) although Medina will be better for them; if they but knew. Sham will also be conquered and some people will migrate (from Medina) and will urge their families and those who will obey them, to migrate (to Sham) although Medina will be better for them; if they but knew. 'Iraq will be conquered and some people will migrate (from Medina) and will urge their families and those who will obey them to migrate (to 'Iraq) although Medina will be better for them; if they but knew.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ آپ نے فرمایا کہ یمن فتح ہو گا تو لوگ اپنی سواریوں کو دوڑاتے ہوئے لائیں گے اور اپنے گھر والوں کو اور ان کو جو ان کی بات مان جائیں گے سوار کر کے مدینہ سے ( واپس یمن کو ) لے جائیں گے کاش ! انہیں معلوم ہوتا کہ مدینہ ہی ان کے لیے بہتر تھا اور عراق فتح ہو گا تو کچھ لوگ اپنی سواریوں کو تیز دوڑاتے ہوئے لائیں گے اور اپنے گھر والوں کو اور جو ان کی بات مانیں گے اپنے ساتھ ( عراق واپس ) لے جائیں گے کاش ! انہیں معلوم ہوتا کہ مدینہ ہی ان کے لیے بہتر تھا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہمیں امام مالک نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے والد عروہ بن زبیر نے خبر دی ، انہیں عبداللہ بن زبیر رضی اللہ عنہمانے اور ان سے سفیان بن ابی زہیر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ سُفْيَانَ بْنِ أَبِي زُهَيْرٍ ـ رضى الله عنه ـ أَنَّهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ تُفْتَحُ الْيَمَنُ فَيَأْتِي قَوْمٌ يُبِسُّونَ، فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ، وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ، وَتُفْتَحُ الشَّأْمُ، فَيَأْتِي قَوْمٌ يُبِسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ، وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ، وَتُفْتَحُ الْعِرَاقُ، فَيَأْتِي قَوْمٌ يُبِسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ‏.‏ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1800,
                "hadithNumber": "1876",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Verily, Belief returns and goes back to Medina as a snake returns and goes back to its hole (when in danger).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ( قیامت کے قریب ) ایمان مدینہ میں اس طرح سمٹ آئے گا جیسے سانپ سمٹ کر اپنے بل میں آ جایا کرتا ہے ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، انہوں نے کہا کہ ہم سے انس بن عیاض نے بیان کیا ، انہوں نے کہا کہ مجھ سے عبیداللہ عمری نے بیان کیا ، انہوں نے کہا کہ ہم سے خبیب بن عبدالرحمٰن نے ، ان سے حفص بن عاصم نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الإِيمَانَ لَيَأْرِزُ إِلَى الْمَدِينَةِ كَمَا تَأْرِزُ الْحَيَّةُ إِلَى جُحْرِهَا ‏\"‏‏.‏",
                "headingArabic": "الإِيمَانُ يَأْرِزُ إِلَى الْمَدِينَةِ",
                "headingUrdu": "ایمان (ایمان) لوٹتا ہے اور مدینہ واپس چلا جاتا ہے۔",
                "headingEnglish": "Iman (Belief) returns and goes back to Al-Madina",
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1801,
                "hadithNumber": "1877",
                "englishNarrator": "Narrated Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"None plots against the people of Medina but that he will be dissolved (destroyed) like the salt is dissolved in water.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا تھا کہ اہل مدینہ کے ساتھ جو شخص بھی فریب کرے گا وہ اس طرح گھل جائے گا جیسے نمک میں پانی گھل جایا کرتا ہے ۔",
                "urduNarrator": "ہم سے حسین بن حرث نے بیان کیا ، کہا ہمیں فضل بن موسیٰ نے خبر دی ، انہیں جعید بن عبدالرحمٰن نے اور ان سے عائشہ رضی اللہ عنہا نے فرمایا کہ میں نے سعد بن ابی وقاص رضی اللہ عنہ سے سنا تھا کہ",
                "hadithArabic": "حَدَّثَنَا حُسَيْنُ بْنُ حُرَيْثٍ، أَخْبَرَنَا الْفَضْلُ، عَنْ جُعَيْدٍ، عَنْ عَائِشَةَ، قَالَتْ سَمِعْتُ سَعْدًا ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يَكِيدُ أَهْلَ الْمَدِينَةِ أَحَدٌ إِلاَّ انْمَاعَ كَمَا يَنْمَاعُ الْمِلْحُ فِي الْمَاءِ ‏\"‏‏.‏",
                "headingArabic": "إِثْمِ مَنْ كَادَ أَهْلَ الْمَدِينَةِ",
                "headingUrdu": "اس شخص کا گناہ جو اہل مدینہ کو نقصان پہنچائے۔",
                "headingEnglish": "Sin of that person who harms the people of Al-Madina",
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1776,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=71",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=69",
                "label": "69",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=70",
                "label": "70",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=71",
                "label": "71",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=72",
                "label": "72",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=73",
                "label": "73",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=74",
                "label": "74",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=75",
                "label": "75",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=73",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=73",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=71",
        "to": 1800,
        "total": 40465
    }
}