{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 132,
        "data": [
            {
                "id": 3278,
                "hadithNumber": "3431",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "\"I heard Allah's Messenger (ﷺ) saying, 'There is none born among the off-spring of Adam, but Satan touches it. A child therefore, cries loudly at the time of birth because of the touch of Satan, except Mary and her child.\" Then Abu Huraira رضی اللہ عنہ recited: \"And I seek refuge with You for her and for her offspring from the outcast Satan\" (3.36)",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا کہ ہر ایک بنی آدم جب پیدا ہوتا ہے تو پیدائش کے وقت شیطان اسے چھوتا ہے اور بچہ شیطان کے چھونے سے زور سے چیختا ہے ۔ سوائے مریم اور ان کے بیٹے عیسیٰ علیہما السلام کے ۔ پھر ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ( اس کی وجہ مریم علیہما السلام کی والدہ کی دعا ہے کہ اے اللہ ! ) میں اسے ( مریم کو ) اور اس کی اولاد کو شیطان رجیم سے تیری پناہ میں دیتی ہوں ۔",
                "urduNarrator": "ہم سے ابو لیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا انہوں نے کہا کہ مجھ سے سعید بن مسیب نے بیان کیا ، کہا کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَا مِنْ بَنِي آدَمَ مَوْلُودٌ إِلاَّ يَمَسُّهُ الشَّيْطَانُ حِينَ يُولَدُ، فَيَسْتَهِلُّ صَارِخًا مِنْ مَسِّ الشَّيْطَانِ، غَيْرَ مَرْيَمَ وَابْنِهَا ‏\"‏‏.‏ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ ‏{‏وَإِنِّي أُعِيذُهَا بِكَ وَذُرِّيَّتَهَا مِنَ الشَّيْطَانِ الرَّجِيمِ ‏}‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَاذْكُرْ فِي الْكِتَابِ مَرْيَمَ إِذِ انْتَبَذَتْ مِنْ أَهْلِهَا مَكَانًا شَرْقِيًّا}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور کتاب میں مریم کا ذکر کرو۔‘‘",
                "headingEnglish": "The Statement of Allah Taa'la: \"And mention in the Book, Maryam...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3279,
                "hadithNumber": "3432",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"Mary, the daughter of `Imran, was the best among the women (of the world of her time) and Khadija رضی اللہ عنہا is the best amongst the women. (of this nation).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم فرما رہے تھے کہ مریم بنت عمران ( اپنے زمانہ میں ) سب سے بہترین خاتون تھیں اور اس امت کی سب سے بہترین خاتون حضرت خدیجہ ہیں ( رضی اللہ عنہا ) ۔",
                "urduNarrator": "مجھ سے احمد بن ابی رجاء نے بیان کیا ، کہا ہم سے نضر نے بیان کیا ، ان سے ہشام ، کہا کہ مجھے میرے والد نے خبر دی ، کہا کہ میں نے عبداللہ بن جعفر سے سنا ، کہا کہ میں نے حضرت علی رضی اللہ عنہ سے سنا ، آپ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا النَّضْرُ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي قَالَ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ جَعْفَرٍ، قَالَ سَمِعْتُ عَلِيًّا ـ رضى الله عنه ـ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ خَيْرُ نِسَائِهَا مَرْيَمُ ابْنَةُ عِمْرَانَ، وَخَيْرُ نِسَائِهَا خَدِيجَةُ ‏\"‏‏.‏",
                "headingArabic": "{وَإِذْ قَالَتِ الْمَلاَئِكَةُ يَا مَرْيَمُ إِنَّ اللَّهَ اصْطَفَاكِ وَطَهَّرَكِ وَاصْطَفَاكِ عَلَى نِسَاءِ الْعَالَمِينَ}",
                "headingUrdu": "اور (یاد کرو) جب فرشتوں نے کہا: اے مریم، بیشک اللہ نے آپ کو چن لیا ہے۔",
                "headingEnglish": "\"And (remember) when the angels said: 'O Maryam (Mary)! Verily, Allah has chosen you...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3280,
                "hadithNumber": "3433",
                "englishNarrator": "Narrated Abu Musa Al-Ash`ari رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The superiority of `Aisha to other ladies is like the superiority of Tharid (i.e. meat and bread dish) to other meals. Many men reached the level of perfection, but no woman reached such a level except Mary, the daughter of `Imran and Asia, the wife of Pharaoh.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا عورتوں پر عائشہ کی فضیلت ایسے ہے جیسے تمام کھانوں پر ثرید کی ۔ مردوں میں سے تو بہت سے کامل ہو گزرے ہیں لیکن عورتوں میں مریم بنت عمران اور فرعون کی بیوی آسیہ کے سوا اور کوئی کامل پیدا نہیں ہوئی ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انھوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے عمرو بن مرہ نے ، انہوں نے کہا ہم کہ میں نے مرہ ہمدانی سے سنا ۔ وہ حضرت ابوموسیٰ اشعری رضی اللہ عنہ سے بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ سَمِعْتُ مُرَّةَ الْهَمْدَانِيَّ، يُحَدِّثُ عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ، كَمَلَ مِنَ الرِّجَالِ كَثِيرٌ، وَلَمْ يَكْمُلْ مِنَ النِّسَاءِ إِلاَّ مَرْيَمُ بِنْتُ عِمْرَانَ وَآسِيَةُ امْرَأَةُ فِرْعَوْنَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ تَعَالَى: {إِذْ قَالَتِ الْمَلاَئِكَةُ يَا مَرْيَمُ} إِلَى قَوْلِهِ: {فَإِنَّمَا يَقُولُ لَهُ كُنْ فَيَكُونُ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"جب فرشتوں نے کہا: اے مریم! بے شک اللہ تمہیں ایک کلمہ کی بشارت دیتا ہے۔\"",
                "headingEnglish": "The Statement of Allah Taa'la: \"When the angels said: O Maryam! Verily, Allah gives you glad tidings of a Word...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3281,
                "hadithNumber": "3434",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"Amongst all those women who ride camels (i.e. Arabs), the ladies of Quraish are the best. They are merciful and kind to their off-spring and the best guardians of their husbands' properties.' Abu Huraira رضی اللہ عنہ added, \"Mary the daughter of `Imran never rode a camel.\" Zuhri's nephew and Ishaq Kalbi have reported from Zuhri likewise.",
                "hadithUrdu": "میں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا کہ اونٹ سوار ہونے والیوں ( عربی خواتین ) میں سب سے بہترین قریشی خواتین ہیں ۔ اپنے بچے پر سب سے زیادہ محبت و شفقت کرنے والی اور اپنے شوہر کے مال و اسباب کی سب سے بہتر نگراں و محافظ ۔ حضرت ابوہریرہ رضی اللہ عنہ یہ حدیث بیان کرنے کے بعد کہتے تھے کہ مریم بنت عمران اونٹ پر کبھی سوار نہیں ہوئی تھیں ۔ یونس کے ساتھ اس حدیث کو زہری کے بھتیجے اور اسحاق کلبی نے بھی زہری سے روایت کیا ہے ۔",
                "urduNarrator": "اور ابن وہب نے بیان کیا کہ مجھے یونس نے خبر دی ، ان سے ابن شہاب نے بیان کیا ، کہا کہ مجھ سے سعید بن مسیب نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ نِسَاءُ قُرَيْشٍ خَيْرُ نِسَاءٍ رَكِبْنَ الإِبِلَ، أَحْنَاهُ عَلَى طِفْلٍ، وَأَرْعَاهُ عَلَى زَوْجٍ فِي ذَاتِ يَدِهِ ‏\"‏‏.‏ يَقُولُ أَبُو هُرَيْرَةَ عَلَى إِثْرِ ذَلِكَ وَلَمْ تَرْكَبْ مَرْيَمُ بِنْتُ عِمْرَانَ بَعِيرًا قَطُّ‏.‏ تَابَعَهُ ابْنُ أَخِي الزُّهْرِيِّ وَإِسْحَاقُ الْكَلْبِيُّ عَنِ الزُّهْرِيِّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3282,
                "hadithNumber": "3435",
                "englishNarrator": "Narrated 'Ubada رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If anyone testifies that None has the right to be worshipped but Allah Alone Who has no partners, and that Muhammad is His Slave and His Apostle, and that Jesus is Allah's Slave and His Apostle and His Word which He bestowed on Mary and a Spirit created by Him, and that Paradise is true, and Hell is true, Allah will admit him into Paradise with the deeds which he had done even if those deeds were few.\" (Junada, the sub-narrator said, \" 'Ubada added, 'Such a person can enter Paradise through any of its eight gates he likes.\")",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جس نے گواہی دی کہ اللہ کے سوا کوئی معبود نہیں ، وہ وحدہ لا شریک ہے اور یہ کہ محمد صلی اللہ علیہ وسلم اس کے بندے اور رسول ہیں اور یہ کہ عیسیٰ علیہ السلام اس کے بندے اور رسول ہیں اور اس کا کلمہ ہیں ، جسے پہنچا دیا تھا اللہ نے مریم تک اور ایک روح ہیں اس کی طرف سے اور یہ کہ جنت حق ہے اور دوزخ حق ہے تو اس نے جو بھی عمل کیا ہو گا ( آخر ) اللہ تعالیٰ اسے جنت میں داخل کرے گا ۔ ولید نے بیان کیا ، کہ مجھ سے ابن جابر نے بیان کیا ، ان سے عمیر نے اور جنادہ نے اور اپنی روایت میں یہ زیادہ کیا ( ایسا شخص ) جنت کے آٹھ دروازوں میں سے جس سے چاہے ( داخل ہو گا ) ۔",
                "urduNarrator": "ہم سے صدقہ بن فضل نے بیان کیا ، کہا ہم سے ولید نے بیان کیا ، ان سے اوزاعی نے بیان کیا ، کہا کہ مجھ سے عمیر بن ہانی نے بیان کیا ، کہا کہ مجھ سے جنادہ بن ابی امیہ نے بیان کیا اور ان سے عبادہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، حَدَّثَنَا الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي عُمَيْرُ بْنُ هَانِئٍ، قَالَ حَدَّثَنِي جُنَادَةُ بْنُ أَبِي أُمَيَّةَ، عَنْ عُبَادَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ شَهِدَ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، وَأَنَّ عِيسَى عَبْدُ اللَّهِ وَرَسُولُهُ وَكَلِمَتُهُ، أَلْقَاهَا إِلَى مَرْيَمَ، وَرُوحٌ مِنْهُ، وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ، أَدْخَلَهُ اللَّهُ الْجَنَّةَ عَلَى مَا كَانَ مِنَ الْعَمَلِ ‏\"‏‏.‏ قَالَ الْوَلِيدُ حَدَّثَنِي ابْنُ جَابِرٍ عَنْ عُمَيْرٍ عَنْ جُنَادَةَ وَزَادَ ‏\"‏ مِنْ أَبْوَابِ الْجَنَّةِ الثَّمَانِيَةِ، أَيَّهَا شَاءَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلُهُ: {يَا أَهْلَ الْكِتَابِ لاَ تَغْلُوا فِي دِينِكُمْ وَلاَ تَقُولُوا عَلَى اللَّهِ إِلاَّ الْحَقَّ إِنَّمَا الْمَسِيحُ عِيسَى ابْنُ مَرْيَمَ رَسُولُ اللَّهِ وَكَلِمَتُهُ أَلْقَاهَا إِلَى مَرْيَمَ وَرُوحٌ مِنْهُ فَآمِنُوا بِاللَّهِ وَرُسُلِهِ وَلاَ تَقُولُوا ثَلاَثَةٌ انْتَهُوا خَيْرًا لَكُمْ إِنَّمَا اللَّهُ إِلَهٌ وَاحِدٌ سُبْحَانَهُ أَنْ يَكُونَ لَهُ وَلَدٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ وَكَفَى بِاللَّهِ وَكِيلاً}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"اے اہل کتاب! اپنے دین میں حد سے تجاوز نہ کرو۔\"",
                "headingEnglish": "The Statement of Allah Taa'la: \"O people of the Scriptures! Do not exceed the limits in your religion...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3283,
                "hadithNumber": "3436",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"None spoke in cradle but three: (The first was) Jesus, (the second was), there a man from Bani Israel called Juraij. While he was offering his prayers, his mother came and called him. He said (to himself), 'Shall I answer her or keep on praying?\" (He went on praying) and did not answer her, his mother said, \"O Allah! Do not let him die till he sees the faces of prostitutes.\" So while he was in his hermitage, a lady came and sought to seduce him, but he refused. So she went to a shepherd and presented herself to him to commit illegal sexual intercourse with her and then later she gave birth to a child and claimed that it belonged to Juraij. The people, therefore, came to him and dismantled his hermitage and expelled him out of it and abused him. Juraij performed the ablution and offered prayer, and then came to the child and said, 'O child! Who is your father?' The child replied, 'The shepherd.' (After hearing this) the people said, 'We shall rebuild your hermitage of gold,' but he said, 'No, of nothing but mud.'(The third was the hero of the following story) A lady from Bani Israel was nursing her child at her breast when a handsome rider passed by her. She said, 'O Allah ! Make my child like him.' On that the child left her breast, and facing the rider said, 'O Allah! Do not make me like him.' The child then started to suck her breast again. (Abu Huraira further said, \"As if I were now looking at the Prophet (ﷺ) sucking his finger (in way of demonstration.\") After a while the people passed by, with a lady slave and she (i.e. the child's mother) said, 'O Allah! Do not make my child like this (slave girl)!, On that the child left her breast and said, 'O Allah! Make me like her.' When she asked why, the child replied, 'The rider is one of the tyrants while this slave girl is falsely accused of theft and illegal sexual intercourse.\" whereas, she does not commit any of these crimes.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا گود میں تین بچوں کے سوا اور کسی نے بات نہیں کی ۔ اول عیسیٰ علیہ السلام ( دوسرے کا واقعہ یہ ہے کہ ) بنی اسرائیل میں ایک بزرگ تھے ، نام جریج تھا ۔ وہ نماز پڑھ رہے تھے کہ ان کی ماں نے انہیں پکارا ۔ انہوں نے ۔ ( اپنے دل میں ) کہا کہ میں والدہ کا جواب دوں یا نماز پڑھتا رہوں ؟ اس پر ان کی والدہ نے ( غصہ ہو کر ) بدعا کی ، اے اللہ ! اس وقت تک اسے موت نہ آئے جب تک یہ زانیہ عورتوں کا منہ نہ دیکھ لے ۔ جریج اپنے عبادت خانے میں رہا کرتے تھے ۔ ایک مرتبہ ان کے سامنے ایک فاحشہ عورت آئی اور ان سے بدکاری چاہی لیکن انہوں نے ( اس کی خواہش پوری کرنے سے ) انکار کیا ۔ پھر ایک چرواہے کے پاس آئی اور اسے اپنے اوپر قابو دے دیا اس سے ایک بچہ پیدا ہوا ۔ اور اس نے ان پر یہ تہمت دھری کہ یہ جریج کا بچہ ہے ۔ ان کی قوم کے لوگ آئے اور ان کا عبادت خانہ توڑ دیا ، انہیں نیچے اتار کر لائے اور انہیں گالیاں دیں ۔ پھر انہوں نے وضو کر کے نماز پڑھی ، اس کے بعد بچے کے پاس آئے اور اس سے پوچھا کہ تیرا باپ کون ہے ؟ بچہ ( اللہ کے حکم سے ) بول پڑا کہ چرواہا ہے اس پر ( ان کی قوم شرمندہ ہوئی اور ) کہا ہم آپ کا عبادت خانہ سونے کا بنائیں گے ۔ لیکن انہوں نے کہا ہرگز نہیں ، مٹی ہی کا بنے گا ( تیسرا واقعہ ) اور ایک بنی اسرائیل کی عورت تھی ، اپنے بچے کو دودھ پلا رہی تھی ۔ قریب سے ایک سوار نہایت عزت والا اور خوش پوش گزرا ، اس عورت نے دعا کی ، اے اللہ ! میرے بچے کو بھی اسی جیسا بنا دے لیکن بچہ ( اللہ کے حکم سے ) بول پڑا کہ اے اللہ ! مجھے اس جیسا نہ بنانا ۔ پھر اس کے سینے سے لگ کر دودھ پینے لگا ۔ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ جیسے میں اس وقت بھی دیکھ رہا ہوں کہ نبی کریم صلی اللہ علیہ وسلم اپنی انگلی چوس رہے ہیں ( بچے کے دودھ پینے لگنے کی کیفیت بتلاتے وقت ) پھر ایک باندی اس کے قریب سے لے جائی گئی ( جسے اس کے مالک مار رہے تھے ) تو اس عورت نے دعا کی کہ اے اللہ ! میرے بچے کو اس جیسا نہ بنانا ۔ بچے نے پھر اس کا پستان چھوڑ دیا اور کہا کہ اے اللہ ! مجھے اسی جیسا بنا دے ۔ اس عورت نے پوچھا ۔ ایسا تو کیوں کہہ رہا ہے ؟ بچے نے کہا کہ وہ سوار ظالموں میں سے ایک ظالم شخص تھا اور اس باندی سے لوگ کہہ رہے تھے کہ تم نے چوری کی اور زنا کیا حالانکہ اس نے کچھ بھی نہیں کیا تھا ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے جریربن حازم نے بیان کیا ، ان سے محمد بن سرین نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَمْ يَتَكَلَّمْ فِي الْمَهْدِ إِلاَّ ثَلاَثَةٌ عِيسَى، وَكَانَ فِي بَنِي إِسْرَائِيلَ رَجُلٌ يُقَالُ لَهُ جُرَيْجٌ، كَانَ يُصَلِّي، فَجَاءَتْهُ أُمُّهُ فَدَعَتْهُ، فَقَالَ أُجِيبُهَا أَوْ أُصَلِّي‏.‏ فَقَالَتِ اللَّهُمَّ لاَ تُمِتْهُ حَتَّى تُرِيَهُ وُجُوهَ الْمُومِسَاتِ‏.‏ وَكَانَ جُرَيْجٌ فِي صَوْمَعَتِهِ، فَتَعَرَّضَتْ لَهُ امْرَأَةٌ وَكَلَّمَتْهُ فَأَبَى، فَأَتَتْ رَاعِيًا، فَأَمْكَنَتْهُ مِنْ نَفْسِهَا فَوَلَدَتْ غُلاَمًا، فَقَالَتْ مِنْ جُرَيْجٍ‏.‏ فَأَتَوْهُ فَكَسَرُوا صَوْمَعَتَهُ، وَأَنْزَلُوهُ وَسَبُّوهُ، فَتَوَضَّأَ وَصَلَّى ثُمَّ أَتَى الْغُلاَمَ فَقَالَ مَنْ أَبُوكَ يَا غُلاَمُ قَالَ الرَّاعِي‏.‏ قَالُوا نَبْنِي صَوْمَعَتَكَ مِنْ ذَهَبٍ‏.‏ قَالَ لاَ إِلاَّ مِنْ طِينٍ‏.‏ وَكَانَتِ امْرَأَةٌ تُرْضِعُ ابْنًا لَهَا مِنْ بَنِي إِسْرَائِيلَ، فَمَرَّ بِهَا رَجُلٌ رَاكِبٌ ذُو شَارَةٍ، فَقَالَتِ اللَّهُمَّ اجْعَلِ ابْنِي مِثْلَهُ‏.‏ فَتَرَكَ ثَدْيَهَا، وَأَقْبَلَ عَلَى الرَّاكِبِ فَقَالَ اللَّهُمَّ لاَ تَجْعَلْنِي مِثْلَهُ‏.‏ ثُمَّ أَقْبَلَ عَلَى ثَدْيِهَا يَمَصُّهُ ـ قَالَ أَبُو هُرَيْرَةَ كَأَنِّي أَنْظُرُ إِلَى النَّبِيِّ صلى الله عليه وسلم يَمَصُّ إِصْبَعَهُ ـ ثُمَّ مُرَّ بِأَمَةٍ فَقَالَتِ اللَّهُمَّ لاَ تَجْعَلِ ابْنِي مِثْلَ هَذِهِ‏.‏ فَتَرَكَ ثَدْيَهَا فَقَالَ اللَّهُمَّ اجْعَلْنِي مِثْلَهَا‏.‏ فَقَالَتْ لِمَ ذَاكَ فَقَالَ الرَّاكِبُ جَبَّارٌ مِنَ الْجَبَابِرَةِ، وَهَذِهِ الأَمَةُ يَقُولُونَ سَرَقْتِ زَنَيْتِ‏.‏ وَلَمْ تَفْعَلْ ‏\"‏‏.‏",
                "headingArabic": "{وَاذْكُرْ فِي الْكِتَابِ مَرْيَمَ إِذِ انْتَبَذَتْ مِنْ أَهْلِهَا}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور کتاب میں مریم کا قصہ ذکر کرو۔‘‘",
                "headingEnglish": "The Statement of Allah Taa'la: \"And mention in the Book, the story of Maryam...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3284,
                "hadithNumber": "3437",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I met Moses on the night of my Ascension to heaven.\" The Prophet (ﷺ) then described him saying, as I think, \"He was a tall person with lank hair as if he belonged to the people of the tribe of Shanu's.' The Prophet (ﷺ) further said, \"I met Jesus.\" The Prophet (ﷺ) described him saying, \"He was one of moderate height and was red-faced as if he had just come out of a bathroom. I saw Abraham whom I resembled more than any of his children did.\" The Prophet (ﷺ) further said, \"(That night) I was given two cups; one full of milk and the other full of wine. I was asked to take either of them which I liked, and I took the milk and drank it. On that it was said to me, 'You have taken the right path (religion). If you had taken the wine, your (Muslim) nation would have gone astray.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جس رات میری معراج ہوئی ، میں نے موسیٰ علیہ السلام سے ملاقات کی تھی ۔ راوی نے بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے ان کا حلیہ بیان کیا وہ .... میرا خیال ہے کہ معمر نے کہا .... درازقامت اور سیدھے بالوں والے تھے جیسے قبیلہ شنوہ کے لوگ ہوتے ہیں ۔ آپ نے بیان کیا کہ میں نے عیسیٰ علیہ السلام سے بھی ملاقات کی ۔ آنحضرت صلی اللہ علیہ وسلم نے ان کا بھی حلیہ بیان فرمایا کہ درمیانہ قد اور سرخ و سپید تھے ، جیسے ابھی ابھی غسل خانے سے باہر آئے ہوں اور میں نے ابراہیم علیہ السلام سے بھی ملاقات کی تھی اور میں ان کی اولاد میں ان سے سب سے زیادہ مشابہ ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میرے پاس دو برتن لائے گئے ، ایک میں دودھ تھا اور دوسرے میں شراب ۔ مجھ سے کہا گیا کہ جو آپ کا جی چاہے لے لو ۔ میں نے دودھ کا برتن لے لیا اور پی لیا ۔ اس پر مجھ سے کہا گیا کہ فطرت کی آپ نے راہ پالی ، یا فطرت کو آپ نے پا لیا ۔ اس کے بجائے اگر آپ شراب کا برتن لیتے تو آپ کی امت گمراہ ہو جاتی ۔",
                "urduNarrator": "مجھ سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہم کو ہشام نے خبر دی ، انہیں معمر نے ( دوسری سند ) مجھ سے محمود نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا کہ ہم کو معمر نے خبر دی ، ان سے زہری نے بیان کیا ، کہا مجھ کو سعید بن مسیب نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ،‏.‏ حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَيْلَةَ أُسْرِيَ بِهِ لَقِيتُ مُوسَى ـ قَالَ فَنَعَتَهُ ـ فَإِذَا رَجُلٌ ـ حَسِبْتُهُ قَالَ ـ مُضْطَرِبٌ رَجِلُ الرَّأْسِ، كَأَنَّهُ مِنْ رِجَالِ شَنُوءَةَ ـ قَالَ ـ وَلَقِيتُ عِيسَى ـ فَنَعَتَهُ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ـ رَبْعَةٌ أَحْمَرُ كَأَنَّمَا خَرَجَ مِنْ دِيمَاسٍ ـ يَعْنِي الْحَمَّامَ ـ وَرَأَيْتُ إِبْرَاهِيمَ، وَأَنَا أَشْبَهُ وَلَدِهِ بِهِ ـ قَالَ ـ وَأُتِيتُ بِإِنَاءَيْنِ أَحَدُهُمَا لَبَنٌ وَالآخَرُ فِيهِ خَمْرٌ، فَقِيلَ لِي خُذْ أَيَّهُمَا شِئْتَ‏.‏ فَأَخَذْتُ اللَّبَنَ فَشَرِبْتُهُ، فَقِيلَ لِي هُدِيتَ الْفِطْرَةَ، أَوْ أَصَبْتَ الْفِطْرَةَ، أَمَا إِنَّكَ لَوْ أَخَذْتَ الْخَمْرَ غَوَتْ أُمَّتُكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3285,
                "hadithNumber": "3438",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I saw Moses, Jesus and Abraham علیہم السلام (on the night of my Ascension to the heavens). Jesus was of red complexion, curly hair and a broad chest. Moses علیہم السلام was of brown complexion, straight hair and tall stature as if he was from the people of Az-Zutt.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں نے عیسیٰ ، موسیٰ اور ابراہیم علیہم السلام کو دیکھا ۔ عیسیٰ علیہ السلام نہایت سرخ گھونگھریالے بال والے اور چوڑے سینے والے تھے اور موسیٰ علیہ السلام گندم ، گوں درازقامت اور سیدھے بالوں والے تھے جیسے کوئی قبیلہ زط کا آدمی ہو ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو اسرائیل نے خبر دی ، کہا ہم کو عثمان بن مغیرہ نے خبر دی ، انہیں مجاہد نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا إِسْرَائِيلُ، أَخْبَرَنَا عُثْمَانُ بْنُ الْمُغِيرَةِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ رَأَيْتُ عِيسَى وَمُوسَى وَإِبْرَاهِيمَ، فَأَمَّا عِيسَى فَأَحْمَرُ جَعْدٌ عَرِيضُ الصَّدْرِ، وَأَمَّا مُوسَى فَآدَمُ جَسِيمٌ سَبْطٌ كَأَنَّهُ مِنْ رِجَالِ الزُّطِّ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3286,
                "hadithNumber": "3439, 3440",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) mentioned the Masih Ad-Dajjal in front of the people saying, Allah is not one-eyed while Masih Ad-Dajjal is blind in the right eye and his eye looks like a bulging out grape. While sleeping near the Ka`ba last night, I saw in my dream a man of brown color the best one can see amongst brown color and his hair was long that it fell between his shoulders. His hair was lank and water was dribbling from his head and he was placing his hands on the shoulders of two men while circumambulating the Ka`ba. I asked, 'Who is this?' They replied, 'This is Jesus, son of Mary.' Behind him I saw a man who had very curly hair and was blind in the right eye, resembling Ibn Qatan (i.e. an infidel) in appearance. He was placing his hands on the shoulders of a person while performing Tawaf around the Ka`ba. I asked, 'Who is this? 'They replied, 'The Masih, Ad-Dajjal.' \"  Obaidullah has reported it from Nafi.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ سلم نے ایک دن لوگوں کے سامنے دجال کا ذکر کیا اور فرمایا کہ اس میں کوئی شبہ نہیں کہ اللہ تعا لیٰ کانا نہیں ہے ، لیکن دجال داہنی آنکھ سے کانا ہو گا ، اس کی آنکھ اٹھے ہوئے انگور کی طرح ہو گی ۔اور میں نے رات کعبہ کے پاس خواب میں ایک گندمی رنگ کے آدمی کو دیکھا جو گندمی رنگ کے آدمیوں میں شکل کے اعتبار سے سب سے زیادہ حسین و جمیل تھا ۔ اس کے سر کے بال شانوں تک لٹک رہے تھے ، سر سے پانی ٹپک رہا تھا اور دونوں ہاتھ دو آدمیوں کے شانوں پر رکھے ہوئے وہ بیت اللہ کا طواف کر رہے تھے ۔ میں نے پوچھا یہ کون بزرگ ہیں ؟ تو فرشتوں نے بتایا کہ یہ مسیح ابن مریم ہیں ۔ اس کے بعد میں نے ایک شخص کو دیکھا ، سخت اور مڑے ہوئے بالوں والا جو داہنی آنکھ سے کانا تھا ۔ اسے میں نے ابن قطن سے سب سے زیادہ شکل میں ملتا ہوا پایا ، وہ بھی ایک شخص کے شانوں پر اپنے دونوں ہاتھ رکھے ہوئے بیت اللہ کا طواف کر رہا تھا ۔ میں نے پوچھا ، یہ کون ہیں ؟ فرشتوں نے بتایا کہ یہ دجال ہے ۔ اس روایت کی متابعت عبیداللہ نے نافع سے کی ہے ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، انہوں نے کہا ہم سے ابوضمرہ نے بیان کیا ، انہوں نے کہا ہم سے موسیٰ نے بیان کیا ، ان سے نافع نے بیان کیا کہ حضرت عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا مُوسَى، عَنْ نَافِعٍ، قَالَ عَبْدُ اللَّهِ ذَكَرَ النَّبِيُّ صلى الله عليه وسلم يَوْمًا بَيْنَ ظَهْرَىِ النَّاسِ الْمَسِيحَ الدَّجَّالَ، فَقَالَ ‏\"‏ إِنَّ اللَّهَ لَيْسَ بِأَعْوَرَ، أَلاَ إِنَّ الْمَسِيحَ الدَّجَّالَ أَعْوَرُ الْعَيْنِ الْيُمْنَى، كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ ‏\"‏‏.‏\"‏ وَأَرَانِي اللَّيْلَةَ عِنْدَ الْكَعْبَةِ فِي الْمَنَامِ، فَإِذَا رَجُلٌ آدَمُ كَأَحْسَنِ مَا يُرَى مِنْ أُدْمِ الرِّجَالِ، تَضْرِبُ لِمَّتُهُ بَيْنَ مَنْكِبَيْهِ، رَجِلُ الشَّعَرِ، يَقْطُرُ رَأْسُهُ مَاءً، وَاضِعًا يَدَيْهِ عَلَى مَنْكِبَىْ رَجُلَيْنِ وَهْوَ يَطُوفُ بِالْبَيْتِ‏.‏ فَقُلْتُ مَنْ هَذَا فَقَالُوا هَذَا الْمَسِيحُ ابْنُ مَرْيَمَ‏.‏ ثُمَّ رَأَيْتُ رَجُلاً وَرَاءَهُ جَعْدًا قَطَطًا أَعْوَرَ عَيْنِ الْيُمْنَى كَأَشْبَهِ مَنْ رَأَيْتُ بِابْنِ قَطَنٍ، وَاضِعًا يَدَيْهِ عَلَى مَنْكِبَىْ رَجُلٍ، يَطُوفُ بِالْبَيْتِ، فَقُلْتُ مَنْ هَذَا قَالُوا الْمَسِيحُ الدَّجَّالُ ‏\"‏‏.‏ تَابَعَهُ عُبَيْدُ اللَّهِ عَنْ نَافِعٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3287,
                "hadithNumber": "3441",
                "englishNarrator": "Narrated Salim from his father:",
                "hadithEnglish": "No, By Allah, the Prophet (ﷺ) did not tell that Jesus was of red complexion but said, \"While I was asleep circumambulating the Ka`ba (in my dream), suddenly I saw a man of brown complexion and lank hair walking between two men, and water was dropping from his head. I asked, 'Who is this?' The people said, 'He is the son of Mary.' Then I looked behind and I saw a red-complexioned, fat, curly-haired man, blind in the right eye which looked like a bulging out grape. I asked, 'Who is this?' They replied, 'He is Ad-Dajjal.' The one who resembled to him among the people, was Ibn Qatar.\" (Az-Zuhri said, \"He (i.e. Ibn Qatan) was a man from the tribe Khuza`a who died in the pre-lslamic period.\")",
                "hadithUrdu": "ہرگز نہیں ۔ خدا کی قسم نبی کریم صلی اللہ علیہ وسلم نے حضرت عیسیٰ کے بارے میں یہ نہیں فرمایا تھا کہ وہ سرخ تھے بلکہ آپ نے یہ فرمایا تھا کہ میں نے خواب میں ایک مرتبہ بیت اللہ کا طواف کرتے ہوئے اپنے کو دیکھا ، اس وقت مجھے ایک صاحب نظر آئے جو گندمی رنگ لٹکے ہوئے بال والے تھے ، دو آدمیوں کے درمیان ان کا سہارا لئے ہوئے اور سر سے پانی صاف کر رہے تھے ۔ میں نے پوچھا کہ آپ کون ہیں ؟ تو فرشتوں نے جواب دیا کہ آپ ابن مریم علیہما السلام ہیں ۔ اس پر میں نے انہیں غور سے دیکھا تو مجھے ایک اور شخص بھی دکھائی دیا جو سرخ ، موٹا ، سر کے بال مڑے ہوئے اور داہنی آنکھ سے کانا تھا ، اس کی آنکھ ایسی دکھائی دیتی تھی جیسے اٹھا ہوا انار ہو ، میں نے پوچھا یہ کون ہے ؟ تو فرشتوں نے بتایا کہ یہ دجال ہے ۔ اس سے شکل و صورت میں ابن قطن بہت زیادہ مشابہ تھا ۔ زہری نے کہا کہ یہ قبیلہ خزاعہ کا ایک شخص تھا جو جاہلیت کے زمانہ میں مر گیا تھا ۔",
                "urduNarrator": "ہم سے احمد بن محمد مکی نے بیان کیا ، کہا کہ میں نے ابراہیم بن سعد سے سنا ، کہا کہ مجھ سے زہری نے بیان کیا ، ان سے سالم نے اور ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَكِّيُّ، قَالَ سَمِعْتُ إِبْرَاهِيمَ بْنَ سَعْدٍ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ،، قَالَ لاَ وَاللَّهِ مَا قَالَ النَّبِيُّ صلى الله عليه وسلم لِعِيسَى أَحْمَرُ، وَلَكِنْ قَالَ ‏ \"‏ بَيْنَمَا أَنَا نَائِمٌ أَطُوفُ بِالْكَعْبَةِ، فَإِذَا رَجُلٌ آدَمُ سَبْطُ الشَّعَرِ، يُهَادَى بَيْنَ رَجُلَيْنِ، يَنْطِفُ رَأْسُهُ مَاءً أَوْ يُهَرَاقُ رَأْسُهُ مَاءً فَقُلْتُ مَنْ هَذَا قَالُوا ابْنُ مَرْيَمَ، فَذَهَبْتُ أَلْتَفِتُ، فَإِذَا رَجُلٌ أَحْمَرُ جَسِيمٌ، جَعْدُ الرَّأْسِ، أَعْوَرُ عَيْنِهِ الْيُمْنَى، كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ‏.‏ قُلْتُ مَنْ هَذَا قَالُوا هَذَا الدَّجَّالُ‏.‏ وَأَقْرَبُ النَّاسِ بِهِ شَبَهًا ابْنُ قَطَنٍ ‏\"‏‏.‏ قَالَ الزُّهْرِيُّ رَجُلٌ مِنْ خُزَاعَةَ هَلَكَ فِي الْجَاهِلِيَّةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3288,
                "hadithNumber": "3442",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"I am the nearest of all the people to the son of Mary, and all the prophets are paternal brothers, and there has been no prophet between me and him (i.e. Jesus).",
                "hadithUrdu": "میں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ میں ابن مریم علیہما السلام سے دوسروں کے مقابلہ میں زیادہ قریب ہوں ، انبیاء علاتی بھائیوں کی طرح ہیں اور میرے اور عیسیٰ علیہ السلام کے درمیان کوئی نبی نہیں ہے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں ابوسلمہ نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عَنْهُ ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ أَنَا أَوْلَى النَّاسِ بِابْنِ مَرْيَمَ، وَالأَنْبِيَاءُ أَوْلاَدُ عَلاَّتٍ، لَيْسَ بَيْنِي وَبَيْنَهُ نَبِيٌّ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3289,
                "hadithNumber": "3443",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Both in this world and in the Hereafter, I am the nearest of all the people to Jesus, the son of Mary. The prophets are paternal brothers; their mothers are different, but their religion is one.\" Ibrahim bin Tahman has reported from Musa bin Uqbah, Safwaan bin Solaiman, Ataa bin Yasar that Hadrat Abu Hurairah رضی اللہ عنہ said that the prophet (ﷺ) said: (Then he mentioned the aforementioned Hadith).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں عیسیٰ بن مریم علیہ السلام سے اور لوگوں کی بہ نسبت زیادہ قریب ہوں ، دنیا میں بھی اور آخرت میں بھی اور انبیاء علیہم السلام علاتی بھائیوں ( کی طرح ) ہیں ۔ ان کے مسائل میں اگرچہ اختلاف ہے لیکن دین سب کا ایک ہی ہے ۔ اور ابراہیم بن طہمان نے بیان کیا ، ان سے موسیٰ بن عقبہ نے ، ان سے صفوان بن سلیم نے ، ان سے عطاء بن یسار نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔",
                "urduNarrator": "ہم سے محمد بن سنان نے بیان کیا ، کہا ہم سے فلیح بن سلیمان نے بیان کیا ، کہا ہم سے ہلال بن علی نے بیان کیا ، ان سے عبدالرحمٰن بن ابی عمرہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، حَدَّثَنَا هِلاَلُ بْنُ عَلِيٍّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنَا أَوْلَى النَّاسِ بِعِيسَى ابْنِ مَرْيَمَ فِي الدُّنْيَا وَالآخِرَةِ، وَالأَنْبِيَاءُ إِخْوَةٌ لِعَلاَّتٍ، أُمَّهَاتُهُمْ شَتَّى، وَدِينُهُمْ وَاحِدٌ ‏\"‏‏.‏ وَقَالَ إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3290,
                "hadithNumber": "3444",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Jesus, seeing a man stealing, asked him, 'Did you steal?, He said, 'No, by Allah, except Whom there is None who has the right to be worshipped' Jesus said, 'I believe in Allah and suspect my eyes.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، عیسیٰ ابن مریم علیہما السلام نے ایک شخص کو چوری کرتے ہوئے دیکھا پھر اس سے دریافت فرمایا تو نے چوری کی ہے ؟ اس نے کہا ہرگز نہیں ، اس ذات کی قسم جس کے سوا اور کوئی معبود نہیں ۔ حضرت عیسیٰ علیہ السلام نے فرمایا کہ میں اللہ پر ایمان لایا اور میری آنکھوں کو دھوکا ہوا ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے عبدالر زاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ رَأَى عِيسَى ابْنُ مَرْيَمَ رَجُلاً يَسْرِقُ، فَقَالَ لَهُ أَسَرَقْتَ قَالَ كَلاَّ وَاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ‏.‏ فَقَالَ عِيسَى آمَنْتُ بِاللَّهِ وَكَذَّبْتُ عَيْنِي ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3291,
                "hadithNumber": "3445",
                "englishNarrator": "Narrated `Umar رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"Do not exaggerate in praising me as the Christians praised the son of Mary, for I am only a Slave. So, call me the Slave of Allah and His Apostle.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا مجھے میرے مرتبے سے زیادہ نہ بڑھاؤ جیسے عیسیٰ ابن مریم علیہما السلام کو نصاریٰ نے ان کے رتبے سے زیادہ بڑھا دیا ہے ۔ میں تو صرف اللہ کا بندہ ہوں ، اس لئے یہی کہا کرو ( میرے متعلق ) کہ میں اللہ کا بندہ اور اس کا رسول ہوں ۔",
                "urduNarrator": "ہم سے حمیدی نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا کہ میں نے زہری سے سنا ، وہ بیان کرتے تھے کہ مجھے عبیداللہ بن عبداللہ نے خبر دی اور انہیں حضرت ابن عباس رضی اللہ عنہما نے ، انہوں نے حضرت عمر رضی اللہ عنہ کو منبر پر یہ کہتے سنا تھا کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، يَقُولُ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، سَمِعَ عُمَرَ ـ رضى الله عنه ـ يَقُولُ عَلَى الْمِنْبَرِ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ تُطْرُونِي كَمَا أَطْرَتِ النَّصَارَى ابْنَ مَرْيَمَ، فَإِنَّمَا أَنَا عَبْدُهُ، فَقُولُوا عَبْدُ اللَّهِ وَرَسُولُهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3292,
                "hadithNumber": "3446",
                "englishNarrator": "Narrated Abu Musa Al-Ash`ari رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If a person teaches his slave girl good manners properly, educates her properly, and then manumits and marries her, he will get a double reward. And if a man believes in Jesus and then believes in me, he will get a double reward. And if a slave fears his Lord (i.e. Allah) and obeys his masters, he too will get a double reward.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بیان فرمایا ، اگر کوئی شخص اپنی لونڈی کو اچھی طرح ادب سکھلائے اور پورے طور پر اسے دین کی تعلیم دے ۔ پھر اسے آزاد کر کے اس سے نکاح کر لے تو اسے دوگنا ثواب ملتا ہے اور وہ شخص جو پہلے حضرت عیسیٰ علیہ السلام پر ایمان رکھتا تھا ، پھر مجھ پر ایمان لایا تو اسے بھی دوگنا ثواب ملتا ہے اور وہ غلام جو اپنے رب کا بھی ڈر رکھتا ہے اور اپنے آقا کی بھی اطاعت کرتا ہے تو اسے بھی دوگنا ثواب ملتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو صالح بن حیی نے خبر دی کہ خراسان کے ایک شخص نے شعبی سے پوچھا تو انہوں نے بیان کیا کہ مجھے ابوبردہ نے خبر دی اور ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا صَالِحُ بْنُ حَىٍّ، أَنَّ رَجُلاً، مِنْ أَهْلِ خُرَاسَانَ قَالَ لِلشَّعْبِيِّ‏.‏ فَقَالَ الشَّعْبِيُّ أَخْبَرَنِي أَبُو بُرْدَةَ عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أَدَّبَ الرَّجُلُ أَمَتَهُ فَأَحْسَنَ تَأْدِيبَهَا، وَعَلَّمَهَا فَأَحْسَنَ تَعْلِيمَهَا ثُمَّ أَعْتَقَهَا فَتَزَوَّجَهَا، كَانَ لَهُ أَجْرَانِ، وَإِذَا آمَنَ بِعِيسَى ثُمَّ آمَنَ بِي، فَلَهُ أَجْرَانِ، وَالْعَبْدُ إِذَا اتَّقَى رَبَّهُ وَأَطَاعَ مَوَالِيَهُ، فَلَهُ أَجْرَانِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3293,
                "hadithNumber": "3447",
                "englishNarrator": "Narrted Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"You will be resurrected (and assembled) bare-footed, naked and uncircumcised.\" The Prophet (ﷺ) then recited the Divine Verse:-- \"As We began the first creation, We shall repeat it: A promise We have undertaken. Truly we shall do it.\" (21.104) He added, \"The first to be dressed will be Abraham. Then some of my companions will take to the right and to the left. I will say: 'My companions! 'It will be said, 'They had been renegades since you left them.' I will then say what the Pious Slave Jesus, the son of Mary said: 'And I was a witness over them while I dwelt amongst them; when You did take me up, You were the Watcher over them, and You are a Witness to all things. If You punish them, they are Your slaves, and if you forgive them, You, only You are the All-Mighty the All-Wise.' \" (5.117-118) Narrated Quaggas, \"Those were the apostates who renegade from Islam during the Caliphate of Abu Bakr رضی اللہ عنہ who fought them\".",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ( قیامت کے دن ) تم لوگ ننگے پاؤں ، ننگے بدن اور بغیر ختنہ کے اٹھائے جاؤ گے ۔ پھر آپ نے اس آیت کی تلاوت کی ” جس طرح ہم نے انہیں پہلی مرتبہ پیدا کیا تھا اسی طرح ہم دوبارہ لوٹائیں گے ، یہ ہماری جانب سے وعدہ ہے اور بیشک ہم اسے کرنے والے ہیں ‘‘ پھر سب سے پہلے حضرت ابراہیم علیہ السلام کو کپڑا پہنایا جائے گا ۔ پھر میرے اصحاب کو دائیں ( جنت کی ) طرف لے جایا جائے گا ۔ لیکن کچھ کو بائیں ( جہنم کی ) طرف لے جایا جائے گا ۔ میں کہوں گا کہ یہ تو میرے اصحاب ہیں لیکن مجھے بتایا جائے گا کہ جب آپ ان سے جدا ہوئے تو اسی وقت انہوں نے ارتداد اختیار کر لیا تھا ۔ میں اس وقت وہی کہوں گا جو عبد صالح عیسیٰ ابن مریم علیہما السلام نے کہا تھا کہ جب تک میں ان میں موجود تھا ان کی نگرانی کرتا رہا لیکن جب تو نے مجھے اٹھا لیا تو تو ہی ان کا نگہبان ہے اور تو ہر چیز پر نگہبان ہے ۔ آیت ” العزیز الحکیم تک ‘‘ محمد بن یوسف نے بیان کیا کہ ابوعبداللہ سے روایت ہے اور ان سے قبیصہ نے بیان کیا کہ یہ وہ مرتدین ہیں جنہوں نے حضرت ابوبکر رضی اللہ عنہ کے عہد خلافت میں کفر اختیار کیا تھا اور جن سے ابوبکر رضی اللہ عنہ نے جنگ کی تھی ۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، انہوں نے کہا کہ ہم سے مغیرہ بن نعمان نے ، انہیں سعید بن جبیر نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تُحْشَرُونَ حُفَاةً عُرَاةً غُرْلاً، ثُمَّ قَرَأَ ‏{‏كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْدًا عَلَيْنَا إِنَّا كُنَّا فَاعِلِينَ‏}‏ فَأَوَّلُ مَنْ يُكْسَى إِبْرَاهِيمُ، ثُمَّ يُؤْخَذُ بِرِجَالٍ مِنْ أَصْحَابِي ذَاتَ الْيَمِينِ وَذَاتَ الشِّمَالِ فَأَقُولُ أَصْحَابِي فَيُقَالُ إِنَّهُمْ لَمْ يَزَالُوا مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ مُنْذُ فَارَقْتَهُمْ، فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ عِيسَى ابْنُ مَرْيَمَ ‏{‏وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ فَلَمَّا تَوَفَّيْتَنِي كُنْتَ أَنْتَ الرَّقِيبَ عَلَيْهِمْ وَأَنْتَ عَلَى كُلِّ شَىْءٍ شَهِيدٌ‏}‏ إِلَى قَوْلِهِ ‏{‏الْعَزِيزُ الْحَكِيمُ‏}‏‏\"‏‏.‏ قَالَ مُحَمَّدُ بْنُ يُوسُفَ ذُكِرَ عَنْ أَبِي عَبْدِ اللَّهِ عَنْ قَبِيصَةَ قَالَ هُمُ الْمُرْتَدُّونَ الَّذِينَ ارْتَدُّوا عَلَى عَهْدِ أَبِي بَكْرٍ، فَقَاتَلَهُمْ أَبُو بَكْرٍ ـ رضى الله عنه‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3294,
                "hadithNumber": "3448",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"By Him in Whose Hands my soul is, surely (Jesus,) the son of Mary will soon descend amongst you and will judge mankind justly (as a Just Ruler); he will break the Cross and kill the pigs and there will be no Jizya (i.e. taxation taken from non Muslims). Money will be in abundance so that nobody will accept it, and a single prostration to Allah (in prayer) will be better than the whole world and whatever is in it.\" Abu Huraira  رضی اللہ عنہ added \"If you wish, you can recite (this verse of the Holy Book): -- 'And there is none Of the people of the Scriptures (Jews and Christians) But must believe in him (i.e Jesus as an Apostle of Allah and a human being) Before his death. And on the Day of Judgment He will be a witness Against them.\" (4.159) (See Fath-ul-Bari, Page 302 Vol 7)",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ، وہ زمانہ قریب ہے کہ عیسیٰ ابن مریم علیہما السلام تمہارے درمیان ایک عادل حاکم کی حیثیت سے نازل ہوں گے ۔ وہ صلیب کو توڑ دیں گے ، سور کو مار ڈالیں گے اور جزیہ موقوف کر دیں گے ۔ اس وقت مال کی اتنی کثرت ہو جائے گی کہ کوئی اسے لینے والا نہیں ملے گا ۔ اس وقت کا ایک سجدہ دنیا و مافیہا سے بڑھ کر ہو گا ۔ پھر حضرت ابوہریرہ رضی اللہ عنہ نے کہا کہ اگر تمہارا جی چاہے تو یہ آیت پڑھ لو ” اور کوئی اہل کتاب ایسا نہیں ہو گا جو عیسیٰ کی موت سے پہلے اس پر ایمان نہ لائے اور قیامت کے دن وہ ان پر گواہ ہوں گے ‘‘ ۔",
                "urduNarrator": "ہم سے اسحاق بن راہویہ نے بیان کیا ، کہا ہم کو یعقوب بن ابراہیم نے خبر دی ، کہا مجھ سے میرے والد نے بیان کیا ، ان سے صالح بن کیسان نے ، ان سے ابن شہاب نے ، ان سے سعید بن مسیب نے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ، لَيُوشِكَنَّ أَنْ يَنْزِلَ فِيكُمُ ابْنُ مَرْيَمَ حَكَمًا عَدْلاً، فَيَكْسِرَ الصَّلِيبَ، وَيَقْتُلَ الْخِنْزِيرَ، وَيَضَعَ الْجِزْيَةَ، وَيَفِيضَ الْمَالُ حَتَّى لاَ يَقْبَلَهُ أَحَدٌ، حَتَّى تَكُونَ السَّجْدَةُ الْوَاحِدَةُ خَيْرًا مِنَ الدُّنْيَا وَمَا فِيهَا ‏\"‏‏.‏ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ وَاقْرَءُوا إِنْ شِئْتُمْ ‏{‏وَإِنْ مِنْ أَهْلِ الْكِتَابِ إِلاَّ لَيُؤْمِنَنَّ بِهِ قَبْلَ مَوْتِهِ وَيَوْمَ الْقِيَامَةِ يَكُونُ عَلَيْهِمْ شَهِيدًا‏}‏‏.‏",
                "headingArabic": "نُزُولُ عِيسَى ابْنِ مَرْيَمَ عليهما السلام",
                "headingUrdu": "عیسیٰ ابن مریم علیہ السلام کا نزول",
                "headingEnglish": "The advent (descent) of 'Isa (Jesus), son of Maryam (Mary) alayhis-salam",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3295,
                "hadithNumber": "3449",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said \"How will you be when the son of Mary (i.e. Jesus) descends amongst you and your imam is among you.\" Oqail and Auzai have also reported it.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا تمہارا اس وقت کیا حال ہو گا جب عیسیٰ ابن مریم تم میں اتریں گے ( تم نماز پڑھ رہے ہو گے ) اور تمہارا امام تم ہی میں سے ہو گا ۔ اس روایت کی متابعت عقیل اور اوزاعی نے کی ۔",
                "urduNarrator": "ہم سے ابن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے ، ان سے حضرت ابوقتادہ انصاری رضی اللہ عنہ کے غلام نافع نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ نَافِعٍ، مَوْلَى أَبِي قَتَادَةَ الأَنْصَارِيِّ أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كَيْفَ أَنْتُمْ إِذَا نَزَلَ ابْنُ مَرْيَمَ فِيكُمْ وَإِمَامُكُمْ مِنْكُمْ ‏\"‏‏.‏ تَابَعَهُ عُقَيْلٌ وَالأَوْزَاعِيُّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3296,
                "hadithNumber": "3450, 3451, 3452",
                "englishNarrator": "Narrated Rabi bin Hirash:",
                "hadithEnglish": "`Uqba bin `Amr رضی اللہ عنہ said to Hudhaifa رضی اللہ عنہ , \"Won't you relate to us of what you have heard from Allah's Apostle ?\" He said, \"I heard him saying, \"When Al-Dajjal appears, he will have fire and water along with him. What the people will consider as cold water, will be fire that will burn (things). So, if anyone of you comes across this, he should fall in the thing which will appear to him as fire, for in reality, it will be fresh cold water.\"  Hudhaifa رضی اللہ عنہ added, \"I also heard him saying, 'From among the people preceding your generation, there was a man whom the angel of death visited to capture his soul. (So his soul was captured) and he was asked if he had done any good deed.' He replied, 'I don't remember any good deed.' He was asked to think it over. He said, 'I do not remember, except that I used to trade with the people in the world and I used to give a respite to the rich and forgive the poor (among my debtors). So Allah made him enter Paradise.\" Hudhaifa رضی اللہ عنہ further said, \"I also heard him saying, 'Once there was a man on his death-bed, who, losing every hope of surviving said to his family: When I die, gather for me a large heap of wood and make a fire (to burn me). When the fire eats my meat and reaches my bones, and when the bones burn, take and crush them into powder and wait for a windy day to throw it (i.e. the powder) over the sea. They did so, but Allah collected his particles and asked him: Why did you do so? He replied: For fear of You. So Allah forgave him.\" `Uqba bin `Amr رضی اللہ عنہ said, \"I heard him saying that the Israeli used to dig the grave of the dead (to steal their shrouds).",
                "hadithUrdu": "حضرت عقبہ بن عمرو رضی اللہ عنہ نے حضرت حذیفہ رضی اللہ عنہ سے کہا ، کیا آپ وہ حدیث ہم سے نہیں بیان کریں گے جو آپ نے رسول اللہ سے سنی تھی ؟ انہوں نے کہا کہ میں نے آنحضرت صلی اللہ علیہ وسلم کو یہ فرماتے سنا تھا کہ جب دجال نکلے گا تو اس کے ساتھ آگ اور پانی دونوں ہوں گے لیکن لوگوں کو جو آگ دکھائی دے گی وہ ٹھنڈا پانی ہو گا اور لوگوں کو جو ٹھنڈا پانی دکھائی دے گا تو وہ جلانے والی آگ ہو گی ۔ اس لیے تم میں سے جو کوئی اس کے زمانے میں ہو تو اسے اس میں گرنا چاہئے جو آگ ہو گی کیونکہ وہی انتہائی شیریں اور ٹھنڈا پانی ہو گا ۔حضرت حذیفہ رضی اللہ عنہ نے فرمایا کہ میں نے آنحضرت صلی اللہ علیہ وسلم کو یہ فرماتے سنا تھا کہ پہلے زمانے میں ایک شخص کے پاس ملک الموت ان کی روح قبض کرنے آئے تو ان سے پوچھا گیا کوئی اپنی نیکی تمہیں یاد ہے ؟ انہوں نے کہا کہ مجھے تو یاد نہیں پڑتی ، ان سے دوبارہ کہا گیا کہ یاد کرو ! انہوں نے کہا کہ مجھے کوئی اپنی نیکی یاد نہیں ، سوا اس کے کہ میں دنیا میں لوگوں کے ساتھ خریدوفروخت کیا کرتا تھا اور لین دین کیا کرتا تھا ، جو لوگ خوشحال ہوتے انہیں تو میں ( اپنا قرض وصول کرتے وقت ) مہلت دیا کرتا تھا اور تنگ ہاتھ والوں کو معاف کر دیا کرتا تھا ۔ اللہ تعالیٰ نے انہیں اسی پر جنت میں داخل کیا ۔ اور حضرت حذیفہ رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا کہ ایک شخص کی موت کا جب وقت آ گیا اور وہ اپنی زندگی سے بالکل مایوس ہو گیا تو اس نے اپنے گھر والوں کو وصیت کی کہ جب میری موت ہو جائے تو میرے لیے بہت ساری لکڑیاں جمع کرنا اور ان میں آگ لگا دینا ۔ جب آگ میرے گوشت کو جلا چکے اور آخری ہڈی کو بھی جلا دے تو ان جلی ہوئی ہڈیوں کو پیس ڈالنا اور کسی تند ہوا والے دن کا انتظار کرنا اور ( ایسے کسی دن ) میری راکھ کو دریا میں بہا دینا ۔ اس کے گھر والوں نے ایسا ہی کیا ۔ لیکن اللہ تعالیٰ نے اس کی راکھ کو جمع کیا اور اس سے پوچھا ایسا تو نے کیوں کروایا تھا ؟ اس نے جواب دیا کہ تیرے ہی خوف سے اے اﷲ ! اللہ تعالیٰ نے اسی وجہ سے اس کی مغفرت فرما دی ۔ حضرت عقبہ بن عمرو رضی اللہ عنہ نے کہا کہ میں نے آپ کو یہ فرماتے سنا تھا کہ یہ شخص کفن چور تھا ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے ابوعوانہ نے بیان کیا ، کہا ہم سے عبدالملک نے بیان کیا ، ان سے ربعی بن حراش نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، قَالَ قَالَ عُقْبَةُ بْنُ عَمْرٍو لِحُذَيْفَةَ أَلاَ تُحَدِّثُنَا مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ إِنِّي سَمِعْتُهُ يَقُولُ ‏\"‏ إِنَّ مَعَ الدَّجَّالِ إِذَا خَرَجَ مَاءً وَنَارًا، فَأَمَّا الَّذِي يَرَى النَّاسُ أَنَّهَا النَّارُ فَمَاءٌ بَارِدٌ، وَأَمَّا الَّذِي يَرَى النَّاسُ أَنَّهُ مَاءٌ بَارِدٌ فَنَارٌ تُحْرِقُ، فَمَنْ أَدْرَكَ مِنْكُمْ فَلْيَقَعْ فِي الَّذِي يَرَى أَنَّهَا نَارٌ، فَإِنَّهُ عَذْبٌ بَارِدٌ ‏\"‏‏.‏ قَالَ حُذَيْفَةُ وَسَمِعْتُهُ يَقُولُ ‏\"‏ إِنَّ رَجُلاً كَانَ فِيمَنْ كَانَ قَبْلَكُمْ أَتَاهُ الْمَلَكُ لِيَقْبِضَ رُوحَهُ فَقِيلَ لَهُ هَلْ عَمِلْتَ مِنْ خَيْرٍ قَالَ مَا أَعْلَمُ، قِيلَ لَهُ انْظُرْ‏.‏ قَالَ مَا أَعْلَمُ شَيْئًا غَيْرَ أَنِّي كُنْتُ أُبَايِعُ النَّاسَ فِي الدُّنْيَا وَأُجَازِيهِمْ، فَأُنْظِرُ الْمُوسِرَ، وَأَتَجَاوَزُ عَنِ الْمُعْسِرِ‏.‏ فَأَدْخَلَهُ اللَّهُ الْجَنَّةَ ‏\"‏‏.‏ فَقَالَ وَسَمِعْتُهُ يَقُولُ ‏\"‏ إِنَّ رَجُلاً حَضَرَهُ الْمَوْتُ، فَلَمَّا يَئِسَ مِنَ الْحَيَاةِ أَوْصَى أَهْلَهُ إِذَا أَنَا مُتُّ فَاجْمَعُوا لِي حَطَبًا كَثِيرًا وَأَوْقِدُوا فِيهِ نَارًا حَتَّى إِذَا أَكَلَتْ لَحْمِي، وَخَلَصَتْ إِلَى عَظْمِي، فَامْتَحَشْتُ، فَخُذُوهَا فَاطْحَنُوهَا، ثُمَّ انْظُرُوا يَوْمًا رَاحًا فَاذْرُوهُ فِي الْيَمِّ‏.‏ فَفَعَلُوا، فَجَمَعَهُ فَقَالَ لَهُ لِمَ فَعَلْتَ ذَلِكَ قَالَ مِنْ خَشْيَتِكَ‏.‏ فَغَفَرَ اللَّهُ لَهُ ‏\"‏‏.‏ قَالَ عُقْبَةُ بْنُ عَمْرٍو، وَأَنَا سَمِعْتُهُ يَقُولُ ذَاكَ، وَكَانَ نَبَّاشًا‏.‏",
                "headingArabic": "مَا ذُكِرَ عَنْ بَنِي إِسْرَائِيلَ",
                "headingUrdu": "بنی اسرائیل کے بارے میں کیا کہا گیا ہے۔",
                "headingEnglish": "What has been said about Bani Israel",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3297,
                "hadithNumber": "3453, 3454",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا and Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "On his death-bed Allah's Messenger (ﷺ) put a sheet over his-face and when he felt hot, he would remove it from his face. When in that state (of putting and removing the sheet) he said, \"May Allah's Curse be on the Jews and the Christians for they build places of worship at the graves of their prophets.\" (By that) he intended to warn (the Muslim) from what they (i.e. Jews and Christians) had done.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم پر نزع کی حالت طاری ہوئی تو آپ اپنی چادر چہرہ مبارک پر باربار ڈال لیتے پھر جب شدت بڑھتی تو اسے ہٹا دیتے تھے ۔ حضور صلی اللہ علیہ وسلم نے اسی حالت میں فرمایا تھا ، اللہ کی لعنت ہو یہود و نصاریٰ پر کہ انہوں نے اپنے انبیاء کی قبروں کو سجدہ گاہ بنا لیا ۔ آنحضور صلی اللہ علیہ وسلم اس امت کو ان کے کئے سے ڈرانا چاہتے تھے ۔",
                "urduNarrator": "مجھ سے بشر بن محمد نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا مجھ کو معمر اور یونس نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں عبیداللہ بن عبداللہ نے خبر دی کہ حضرت عائشہ رضی اللہ عنہا اور حضرت ابن عباس رضی اللہ عنہما نے بیان کیا ،",
                "hadithArabic": "حَدَّثَنِي بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنِي مَعْمَرٌ، وَيُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ عَائِشَةَ، وَابْنَ، عَبَّاسٍ رضى الله عنهم قَالاَ لَمَّا نَزَلَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم طَفِقَ يَطْرَحُ خَمِيصَةً عَلَى وَجْهِهِ، فَإِذَا اغْتَمَّ كَشَفَهَا عَنْ وَجْهِهِ، فَقَالَ وَهْوَ كَذَلِكَ ‏ \"‏ لَعْنَةُ اللَّهِ عَلَى الْيَهُودِ وَالنَّصَارَى، اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏‏.‏ يُحَذِّرُ مَا صَنَعُوا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3298,
                "hadithNumber": "3455",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The Israelis used to be ruled and guided by prophets: Whenever a prophet died, another would take over his place. There will be no prophet after me, but there will be Caliphs who will increase in number.\" The people asked, \"O Allah's Messenger (ﷺ)! What do you order us (to do)?\" He said, \"Obey the one who will be given the pledge of allegiance first. Fulfil their (i.e. the Caliphs) rights, for Allah will ask them about (any shortcoming) in ruling those Allah has put under their guardianship.\"",
                "hadithUrdu": "آپ نے فرمایا بنی اسرائیل کے انبیاء ان کی سیاسی رہنمائی بھی کیا کرتے تھے ، جب بھی ان کا کوئی نبی ہلاک ہو جاتا تو دوسرے ان کی جگہ آ موجود ہوتے ، لیکن یاد رکھو میرے بعد کوئی نبی نہیں آئے گا ۔ ہاں میرے نائب ہوں گے اور بہت ہوں گے ۔ صحابہ نے عرض کیا کہ ان کے متعلق آپ کا ہمیں کیا حکم ہے ۔ آپ نے فرمایا کہ سب سے پہلے جس سے بیعت کر لو ، بس اسی کی وفاداری پر قائم رہو اور ان کا جو حق ہے اس کی ادائیگی میں کوتاہی نہ کرو کیونکہ اللہ تعالیٰ ان سے قیامت کے دن ان کی رعایا کے بارے میں سوال کرے گا ۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا کہ ہم سے محمد بن جعفر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے فرات قزار نے بیان کیا ، انہوں نے ابوحازم سے سنا ، انہوں نے بیان کیا کہ میں حضرت ابوہریرہ رضی اللہ عنہ کی مجلس میں پانچ سال تک بیٹھا ہوں ۔ میں نے انہیں رسول اللہ صلی اللہ علیہ وسلم کی یہ حدیث بیان کرتے سنا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ فُرَاتٍ الْقَزَّازِ، قَالَ سَمِعْتُ أَبَا حَازِمٍ، قَالَ قَاعَدْتُ أَبَا هُرَيْرَةَ خَمْسَ سِنِينَ، فَسَمِعْتُهُ يُحَدِّثُ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كَانَتْ بَنُو إِسْرَائِيلَ تَسُوسُهُمُ الأَنْبِيَاءُ، كُلَّمَا هَلَكَ نَبِيٌّ خَلَفَهُ نَبِيٌّ، وَإِنَّهُ لاَ نَبِيَّ بَعْدِي، وَسَيَكُونُ خُلَفَاءُ فَيَكْثُرُونَ‏.‏ قَالُوا فَمَا تَأْمُرُنَا قَالَ فُوا بِبَيْعَةِ الأَوَّلِ فَالأَوَّلِ، أَعْطُوهُمْ حَقَّهُمْ، فَإِنَّ اللَّهَ سَائِلُهُمْ عَمَّا اسْتَرْعَاهُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3299,
                "hadithNumber": "3456",
                "englishNarrator": "Narrated Abu Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"You will follow the wrong ways, of your predecessors so completely and literally that if they should go into the hole of a mastigure, you too will go there.\" We said, \"O Allah's Messenger (ﷺ)! Do you mean the Jews and the Christians?\" He replied, \"Whom else?\" (Meaning, of course, the Jews and the Christians.)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم لوگ پہلی امتوں کے طریقوں کی قدم بقدم پیروی کرو گے یہاں تک کہ اگر وہ لوگ کسی ساہنہ کے سوراخ میں داخل ہوئے تو تم بھی اس میں داخل ہو گے ۔ ہم نے پوچھا یا رسول اللہ صلی اللہ علیہ وسلم ! کیا آپ کی مراد پہلی امتوں سے یہود و نصاریٰ ہیں ؟ آپ نے فرمایا کون ہو سکتا ہے ؟",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابوغسان نے بیان کیا ، کہا کہ مجھ سے زید بن اسلم نے بیان کیا ، ان سے عطاء بن یسار نے اور ان سے حضرت ابوسعید رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لَتَتَّبِعُنَّ سَنَنَ مَنْ قَبْلَكُمْ شِبْرًا بِشِبْرٍ، وَذِرَاعًا بِذِرَاعٍ، حَتَّى لَوْ سَلَكُوا جُحْرَ ضَبٍّ لَسَلَكْتُمُوهُ ‏\"‏‏.‏ قُلْنَا يَا رَسُولَ اللَّهِ، الْيَهُودَ وَالنَّصَارَى قَالَ ‏\"‏ فَمَنْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3300,
                "hadithNumber": "3457",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The people mentioned the fire and the bell (as means proposed for announcing the time of prayer) and by such a suggestion they referred to the Jews and the Christians. But Bilal رضی اللہ عنہ was ordered, \"Pronounce the words of the Adhan (i.e. call for the prayer) twice and the Iqama once only.\"",
                "hadithUrdu": "( نماز کے لیے اعلان کے طریقے پر بحث کرتے وقت ) صحابہ نے آگ اور ناقوس کا ذکر کیا ، لیکن بعض نے کہا کہ یہ تو یہود و نصاریٰ کا طریقہ ہے ۔ آخر بلال رضی اللہ عنہ کو حکم ہوا کہ اذان میں ( کلمات ) دو دو دفعہ کہیں اور تکبیر میں ایک ایک دفعہ ۔",
                "urduNarrator": "ہم سے عمران بن میسرہ نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، کہا ہم سے خالد نے ، ان سے ابوقلابہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ ذَكَرُوا النَّارَ وَالنَّاقُوسَ، فَذَكَرُوا الْيَهُودَ وَالنَّصَارَى، فَأُمِرَ بِلاَلٌ أَنْ يَشْفَعَ الأَذَانَ وَأَنْ يُوتِرَ الإِقَامَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3301,
                "hadithNumber": "3458",
                "englishNarrator": "Narrated Masrooq:",
                "hadithEnglish": "Hadrat Aisha رضی اللہ عنہا she used to hate that one should keep his hands on his flanks while praying. She said that the Jew used to do so.",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا کوکھ پر ہاتھ رکھنے کو ناپسند کرتی تھیں اور فرماتی تھیں کہ اس طرح یہود کرتے ہیں ۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا ، ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے ابوالضحیٰ نے بیان کیا ، ان سے مسروق نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها كَانَتْ تَكْرَهُ أَنْ يَجْعَلَ ‏{‏الْمُصَلِّي‏}‏ يَدَهُ فِي خَاصِرَتِهِ وَتَقُولُ إِنَّ الْيَهُودَ تَفْعَلُهُ‏.‏ تَابَعَهُ شُعْبَةُ عَنِ الأَعْمَشِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3302,
                "hadithNumber": "3459",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Your period (i.e. the Muslims' period) in comparison to the periods of the previous nations, is like the period between the `Asr prayer and sunset. And your example in comparison to the Jews and the Christians is like the example of a person who employed some laborers and asked them, 'Who will work for me till midday for one Qirat each?' The Jews worked for half a day for one Qirat each. The person asked, 'Who will do the work for me from midday to the time of the `Asr (prayer) for one Qirat each?' The Christians worked from midday till the `Asr prayer for one Qirat. Then the person asked, 'Who will do the work for me from the `Asr till sunset for two Qirats each?' \" The Prophet (ﷺ) added, \"It is you (i.e. Muslims) who are doing the work from the `Asr till sunset, so you will have a double reward. The Jews and the Christians got angry and said, 'We have done more work but got less wages.' Allah said, 'Have I been unjust to you as regards your rights?' They said, 'No.' So Allah said, 'Then it is My Blessing which I bestow on whomever I like. \"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، تمہارا زمانہ پچھلی امتوں کے مقابلے میں ایسا ہے جیسے عصر سے مغرب تک کا وقت ہے ، تمہاری مثال یہود و نصاریٰ کے ساتھ ایسی ہے جیسے کسی شخص نے کچھ مزدور لیے اور کہا کہ میرا کام آدھے دن تک کون ایک ایک قیراط کی اجرت پر کرے گا ؟ یہود نے آدھے دن تک ایک ایک قیراط کی مزدوری پر کام کرنا طے کر لیا ۔ پھر اس شخص نے کہا کہ آدھے دن سے عصر کی نماز تک میرا کام کون شخص ایک ایک قیراط کی مزدوری پر کرے گا ۔ اب نصاریٰ ایک ایک قیراط کی مزدوری پر آدھے دن سے عصر کے وقت تک مزدوری کرنے پر تیار ہو گئے ۔ پھر اس شخص نے کہا کہ عصر کی نماز سے سورج ڈوبنے تک دو دو قیراط پر کون شخص میرا کام کرے گا ؟ تمہیں معلوم ہونا چاہئے کہ وہ تمہیں ہو جو دو دو قیراط کی مزدوری پر عصر سے سورج ڈوبنے تک کام کرو گے ، تم آگاہ رہو کہ تمہاری مزدوری دگنی ہے ۔ یہود و نصاریٰ اس فیصلہ پر غصہ ہو گئے اور کہنے لگے کہ کام تو ہم زیادہ کریں اور مزدوری ہمیں کو کم ملے ۔ اللہ تعالیٰ نے ان سے فرمایا کیا میں نے تمہیں تمہارا حق دینے میں کوئی کمی کی ہے ؟ انہوں نے کہا کہ نہیں ۔ اللہ تعالیٰ نے فرمایا کہ پھر یہ میرا فضل ہے ، میں جسے چاہوں زیادہ دوں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، انہوں نے کہا کہ ہم سے نافع نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا أَجَلُكُمْ فِي أَجَلِ مَنْ خَلاَ مِنَ الأُمَمِ مَا بَيْنَ صَلاَةِ الْعَصْرِ إِلَى مَغْرِبِ الشَّمْسِ، وَإِنَّمَا مَثَلُكُمْ وَمَثَلُ الْيَهُودِ وَالنَّصَارَى كَرَجُلٍ اسْتَعْمَلَ عُمَّالاً فَقَالَ مَنْ يَعْمَلُ لِي إِلَى نِصْفِ النَّهَارِ عَلَى قِيرَاطٍ قِيرَاطٍ فَعَمِلَتِ الْيَهُودُ إِلَى نِصْفِ النَّهَارِ عَلَى قِيرَاطٍ قِيرَاطٍ، ثُمَّ قَالَ مَنْ يَعْمَلُ لِي مِنْ نِصْفِ النَّهَارِ إِلَى صَلاَةِ الْعَصْرِ عَلَى قِيرَاطٍ قِيرَاطٍ فَعَمِلَتِ النَّصَارَى مِنْ نِصْفِ النَّهَارِ إِلَى صَلاَةِ الْعَصْرِ، عَلَى قِيرَاطٍ قِيرَاطٍ، ثُمَّ قَالَ مَنْ يَعْمَلُ لِي مِنْ صَلاَةِ الْعَصْرِ إِلَى مَغْرِبِ الشَّمْسِ عَلَى قِيرَاطَيْنِ قِيرَاطَيْنِ أَلاَ فَأَنْتُمُ الَّذِينَ يَعْمَلُونَ مِنْ صَلاَةِ الْعَصْرِ إِلَى مَغْرِبِ الشَّمْسِ عَلَى قِيرَاطَيْنِ قِيرَاطَيْنِ، أَلاَ لَكُمُ الأَجْرُ مَرَّتَيْنِ، فَغَضِبَتِ الْيَهُودُ وَالنَّصَارَى، فَقَالُوا نَحْنُ أَكْثَرُ عَمَلاً وَأَقَلُّ عَطَاءً، قَالَ اللَّهُ هَلْ ظَلَمْتُكُمْ مِنْ حَقِّكُمْ شَيْئًا قَالُوا لاَ‏.‏ قَالَ فَإِنَّهُ فَضْلِي أُعْطِيهِ مَنْ شِئْتُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 3276,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=131",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=129",
                "label": "129",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=130",
                "label": "130",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=131",
                "label": "131",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=132",
                "label": "132",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=133",
                "label": "133",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=134",
                "label": "134",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=135",
                "label": "135",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=133",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=133",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=131",
        "to": 3300,
        "total": 40465
    }
}