{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 61,
        "data": [
            {
                "id": 1502,
                "hadithNumber": "1564",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The people (of the Pre-Islamic Period) used to think that to perform `Umra during the months of Hajj was one of the major sins on earth. And also used to consider the month of Safar as a forbidden (i.e. sacred) month and they used to say, \"When the wounds of the camel's back heal up (after they return from Hajj) and the signs of those wounds vanish and the month of Safar passes away then (at that time) `Umra is permissible for the one who wishes to perform it.\" In the morning of the 4th of Dhul- Hijja, the Prophet (ﷺ) and his companions reached Mecca, assuming Ihram for Hajj and he ordered his companions to make their intentions of the Ihram for `Umra only (instead of Hajj) so they considered his order as something great and were puzzled, and said, \"O Allah's Messenger (ﷺ)! What kind (of finishing) of Ihram is allowed?\" The Prophet (ﷺ) replied, \"Finish the Ihram completely like a non-Muhrim (you are allowed everything).\"",
                "hadithUrdu": "عرب سمجھتے تھے کہ حج کے دنوں میں عمرہ کرنا روئے زمین پر سب سے بڑا گناہ ہے ۔ یہ لوگ محرم کو صفر بنا لیتے اور کہتے کہ جب اونٹ کی پیٹھ سستا لے اور اس پر خوب بال اگ جائیں اور صفر کا مہینہ ختم ہو جائے ( یعنی حج کے ایام گزر جائیں ) تو عمرہ حلال ہوتا ہے ۔ پھر جب نبی کریم صلی اللہ علیہ وسلم اپنے صحابہ کے ساتھ چوتھی کی صبح کو حج کا احرام باندھے ہوئے آئے تو آپ صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ اپنے حج کو عمرہ بنا لیں ، یہ حکم ( عرب کے پرانے رواج کی بنا پر ) عام صحابہ پر بڑا بھاری گزرا ۔ انہوں نے پوچھا یا رسول اللہ ! عمرہ کر کے ہمارے لیے کیا چیز حلال ہو گئی ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمام چیزیں حلال ہو جائیں گی ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے وہیب بن خالد نے بیان کیا ، کہا کہ ہم سے عبداللہ بن طاؤس نے بیان کیا ، ان سے ان کے باپ اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانُوا يَرَوْنَ أَنَّ الْعُمْرَةَ فِي أَشْهُرِ الْحَجِّ مِنْ أَفْجَرِ الْفُجُورِ فِي الأَرْضِ، وَيَجْعَلُونَ الْمُحَرَّمَ صَفَرًا وَيَقُولُونَ إِذَا بَرَأَ الدَّبَرْ، وَعَفَا الأَثَرْ، وَانْسَلَخَ صَفَرْ، حَلَّتِ الْعُمْرَةُ لِمَنِ اعْتَمَرْ‏.‏ قَدِمَ النَّبِيُّ صلى الله عليه وسلم وَأَصْحَابُهُ صَبِيحَةَ رَابِعَةٍ مُهِلِّينَ بِالْحَجِّ، فَأَمَرَهُمْ أَنْ يَجْعَلُوهَا عُمْرَةً فَتَعَاظَمَ ذَلِكَ عِنْدَهُمْ فَقَالُوا يَا رَسُولَ اللَّهِ أَىُّ الْحِلِّ قَالَ ‏ \"‏ حِلٌّ كُلُّهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1503,
                "hadithNumber": "1565",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "I came to the Prophet (from Yemen and was assuming Ihram for Hajj) and he ordered me to finish the Ihram (after performing the `Umra).",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ( حجتہ الوداع کے موقع پر یمن سے ) حاضر ہوا تو آپ صلی اللہ علیہ وسلم نے ( مجھ کو عمرہ کے بعد ) احرام کھول دینے کا حکم دیا ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ ہم سے محمد بن جعفر غندر نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے قیس بن مسلم نے ، ان سے طارق بن شہاب نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ قَدِمْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم‏.‏ فَأَمَرَهُ بِالْحِلِّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1504,
                "hadithNumber": "1566",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Hafsa رضی اللہ عنہا the wife of the Prophet (ﷺ) said, \"O Allah's Messenger (ﷺ)! Why have the people finished their Ihram after performing `Umra but you have not finished your Ihram after performing `Umra?\" He replied, \"I have matted my hair and garlanded my Hadi. So I will not finish my Ihram till I have slaughtered (my Hadi). \"",
                "hadithUrdu": "حضور صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت حفصہ رضی اللہ عنہا نے بیان کیا کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے دریافت کیا یا رسول اللہ ! کیا بات ہے اور لوگ تو عمرہ کر کے حلال ہو گئے لیکن آپ حلال نہیں ہوئے ؟ آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اپنے سر کی تلبید ( بالوں کو جمانے کے لیے ایک لیس دار چیز کا استعمال کرنا ) کی ہے اور اپنے ساتھ ہدی ( قربانی کا جانور ) لایا ہوں اس لیے میں قربانی کرنے سے پہلے احرام نہیں کھول سکتا ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ( دوسری سند ) اور امام بخاری رحمہ اللہ نے کہا کہ ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہمیں امام مالک رحمہ اللہ نے خبر دی ، انہیں نافع نے اور انہیں ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ،‏.‏ وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ ـ رضى الله عنهم ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ يَا رَسُولَ اللَّهِ، مَا شَأْنُ النَّاسِ حَلُّوا بِعُمْرَةٍ وَلَمْ تَحْلِلْ أَنْتَ مِنْ عُمْرَتِكَ قَالَ ‏ \"‏ إِنِّي لَبَّدْتُ رَأْسِي، وَقَلَّدْتُ هَدْيِي فَلاَ أَحِلُّ حَتَّى أَنْحَرَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1505,
                "hadithNumber": "1567",
                "englishNarrator": "Narrated Abu Jamra Nasr bin `Imran Ad-Duba'i:",
                "hadithEnglish": "\"I intended to perform Hajj-at-Tamattu` and the people advised me not to do so. I asked Ibn `Abbas رضی اللہ عنہما regarding it and he ordered me to perform Hajj-at- Tammatu'. Later I saw in a dream someone saying to me, 'Hajj-Mabrur (Hajj performed in accordance with the Prophet's tradition without committing sins and accepted by Allah) and an accepted `Umra.' So I told that dream to Ibn `Abbas رضی اللہ عنہما . He said, 'This is the tradition of Abul-Qasim.' Then he said to me, 'Stay with me and I shall give you a portion of my property.' \" I (Shu`ba) asked, \"Why (did he invite you)?\" He (Abu Jamra) said, \"Because of the dream which I had seen.\"",
                "hadithUrdu": "میں نے حج اور عمرہ کا ایک ساتھ احرام باندھا تو کچھ لوگوں نے مجھے منع کیا ۔ اس لیے میں نے ابن عباس رضی اللہ عنہما سے اس کے متعلق دریافت کیا ۔ آپ نے تمتع کرنے کے لیے کہا ۔ پھر میں نے ایک شخص کو دیکھا کہ مجھ سے کہہ رہا ہے ” حج بھی مبرور ہوا اور عمرہ بھی قبول ہوا “ میں نے یہ خواب ابن عباس رضی اللہ عنہما کو سنایا ، تو آپ نے فرمایا کہ یہ نبی کریم صلی اللہ علیہ وسلم کی سنت ہے ۔ پھر آپ نے فرمایا کہ میرے یہاں قیام کر ، میں اپنے پاس سے تمہارے لیے کچھ مقرر کر کے دیا کروں گا ۔ شعبہ نے بیان کیا کہ میں نے ( ابوجمرہ سے ) پوچھا کہ ابن عباس رضی اللہ عنہما نے یہ کیوں کیا تھا ؟ ( یعنی مال کس بات پر دینے کے لیے کہا ) انہوں نے بیان کیا کہ اسی خواب کی وجہ سے جو میں نے دیکھا تھا ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے ابوجمرہ نصربن عمران ضبعی نے بیان کیا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا أَبُو جَمْرَةَ، نَصْرُ بْنُ عِمْرَانَ الضُّبَعِيُّ قَالَ تَمَتَّعْتُ فَنَهَانِي نَاسٌ، فَسَأَلْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ فَأَمَرَنِي، فَرَأَيْتُ فِي الْمَنَامِ كَأَنَّ رَجُلاً يَقُولُ لِي حَجٌّ مَبْرُورٌ وَعُمْرَةٌ مُتَقَبَّلَةٌ، فَأَخْبَرْتُ ابْنَ عَبَّاسٍ فَقَالَ سُنَّةَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ لِي أَقِمْ عِنْدِي، فَأَجْعَلَ لَكَ سَهْمًا مِنْ مَالِي‏.‏ قَالَ شُعْبَةُ فَقُلْتُ لِمَ فَقَالَ لِلرُّؤْيَا الَّتِي رَأَيْتُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1506,
                "hadithNumber": "1568",
                "englishNarrator": "Narrated Abu Shihab:",
                "hadithEnglish": "I left for Mecca for Hajj-at-Tamattu` assuming Ihram for `Umra. I reached Mecca three days before the day of Tarwiya (8th Dhul-Hijja). Some people of Mecca said to me, \"Your Hajj will be like the Hajj performed by the people of Mecca (i.e. you will lose the superiority of assuming Ihram from the Miqat). So I went to `Ata' asking him his view about it. He said, \"Jabir bin `Abdullah narrated to me, 'I performed Hajj with Allah's Messenger (ﷺ) on the day when he drove camels with him. The people had assumed Ihram for Hajj-al-Ifrad. The Prophet (ﷺ) ordered them to finish their Ihram after Tawaf round the Ka`ba, and between Safa and Marwa and to cut short their hair and then to stay there (in Mecca) as non-Muhrims till the day of Tarwiya (i.e. 8th of Dhul-Hijja) when they would assume Ihram for Hajj and they were ordered to make the Ihram with which they had come as for `Umra only. They asked, 'How can we make it `Umra (Tamattu`) as we have intended to perform Hajj?' The Prophet (ﷺ) said, 'Do what I have ordered you. Had I not brought the Hadi with me, I would have done the same, but I cannot finish my Ihram till the Hadi reaches its destination (i.e. is slaughtered).' So, they did (what he ordered them to do).\" Imam Abu Abdullah Bukhari said: Abu shihab does not have any Musnad Hadith expect for this one.",
                "hadithUrdu": "میں تمتع کی نیت سے عمرہ کا احرام باندھ کے یوم ترویہ سے تین دن پہلے مکہ پہنچا ۔ اس پر مکہ کے کچھ لوگوں نے کہا اب تمہارا حج مکی ہو گا ۔ میں عطاء بن ابی رباح کی خدمت میں حاضر ہوا ۔ یہی پوچھنے کے لیے ۔ انہوں نے فرمایا کہ مجھ سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ وہ حج کیا تھا جس میں آپ صلی اللہ علیہ وسلم اپنے ساتھ قربانی کے اونٹ لائے تھے ( یعنی حجتہ الوداع ) صحابہ نے صرف مفرد حج کا احرام باندھا تھا ۔ لیکن آنحضور صلی اللہ علیہ وسلم نے ان سے فرمایا کہ ( عمرہ کا احرام باندھ لو اور ) بیت اللہ کے طواف اور صفا مروہ کی سعی کے بعد اپنے احرام کھول ڈالو اور بال ترشوا لو ۔ یوم ترویہ تک برابر اسی طرح حلال رہو ، پھر یوم ترویہ میں مکہ ہی سے حج کا احرام باندھو اور اس طرح اپنے حج مفرد کو جس کی تم نے پہلے نیت کی تھی ، اب اسے تمتع بنا لو ۔ صحابہ نے عرض کی کہ ہم اسے تمتع کیسے بنا سکتے ہیں ؟ ہم تو حج کا احرام باندھ چکے ہیں ۔ اس پر آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ جس طرح میں کہہ رہا ہوں ویسے ہی کرو ۔ اگر میرے ساتھ ہدی نہ ہوتی تو خود میں بھی اسی طرح کرتا جس طرح تم سے کہہ رہا ہوں ۔ لیکن میں کیا کروں اب میرے لیے کوئی چیز اس وقت تک حلال نہیں ہو سکتی جب تک میرے قربانی کے جانوروں کی قربانی نہ ہو جائے ۔ چنانچہ صحابہ نے آپ کے حکم کی تعمیل کی ۔ ابوعبداللہ امام بخاری رحمتہ اللہ علیہ نے کہا کہ ابوشہاب کی اس حدیث کے سوا اور کوئی مرفوع حدیث مروی نہیں ہے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، ان سے ابوشہاب نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا أَبُو شِهَابٍ، قَالَ قَدِمْتُ مُتَمَتِّعًا مَكَّةَ بِعُمْرَةٍ فَدَخَلْنَا قَبْلَ التَّرْوِيَةِ بِثَلاَثَةِ أَيَّامٍ، فَقَالَ لِي أُنَاسٌ مِنْ أَهْلِ مَكَّةَ تَصِيرُ الآنَ حَجَّتُكَ مَكِّيَّةً‏.‏ فَدَخَلْتُ عَلَى عَطَاءٍ أَسْتَفْتِيهِ فَقَالَ حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّهُ حَجَّ مَعَ النَّبِيِّ صلى الله عليه وسلم يَوْمَ سَاقَ الْبُدْنَ مَعَهُ، وَقَدْ أَهَلُّوا بِالْحَجِّ مُفْرَدًا، فَقَالَ لَهُمْ ‏\"‏ أَحِلُّوا مِنْ إِحْرَامِكُمْ بِطَوَافِ الْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ، وَقَصِّرُوا ثُمَّ أَقِيمُوا حَلاَلاً، حَتَّى إِذَا كَانَ يَوْمُ التَّرْوِيَةِ فَأَهِلُّوا بِالْحَجِّ، وَاجْعَلُوا الَّتِي قَدِمْتُمْ بِهَا مُتْعَةً ‏\"‏‏.‏ فَقَالُوا كَيْفَ نَجْعَلُهَا مُتْعَةً وَقَدْ سَمَّيْنَا الْحَجَّ فَقَالَ ‏\"‏ افْعَلُوا مَا أَمَرْتُكُمْ، فَلَوْلاَ أَنِّي سُقْتُ الْهَدْىَ لَفَعَلْتُ مِثْلَ الَّذِي أَمَرْتُكُمْ، وَلَكِنْ لاَ يَحِلُّ مِنِّي حَرَامٌ حَتَّى يَبْلُغَ الْهَدْىُ مَحِلَّهُ ‏\"‏‏.‏ فَفَعَلُوا‏.‏ قَالَ أَبُو عَبْد اللَّهِ أَبُو شِهَابٍ لَيْسَ لَهُ مُسْنَدٌ إِلَّا هَذَا",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1507,
                "hadithNumber": "1569",
                "englishNarrator": "Narrated Sa`id bin Al-Musaiyab:",
                "hadithEnglish": "`Ali and `Uthman رضی اللہ عنہما differed regarding Hajj-at-Tamattu` while they were at 'Usfan (a familiar place near Mecca). `Ali رضی اللہ عنہما said, \"I see you want to forbid people to do a thing that the Prophet (ﷺ) did?\" When `Ali saw that, he assumed Ihram for both Hajj and `Umra.",
                "hadithUrdu": "حضرت عثمان اور حضرت علی رضی اللہ عنہما عسفان آئے تو ان میں باہم تمتع کے سلسلے میں اختلاف ہوا تو حضرت علی رضی اللہ عنہ نے فرمایا کہ جس کو رسول اللہ صلی اللہ علیہ وسلم نےکہا ہے اس سے آپ کیوں روک رہے ہیں ؟ اس پر عثمان رضی اللہ عنہ نے فرمایا کہ مجھے اپنے حال پر رہنے دو ۔ یہ دیکھ کر علی رضی اللہ عنہ نے حج اور عمرہ دونوں کا احرام ایک ساتھ باندھا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے حجاج بن محمد اعور نے بیان کیا ، ان سے شعبہ نے ، ان سے عمرو بن مرہ نے ، ان سے سعید بن مسیب نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ الأَعْوَرُ، عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ اخْتَلَفَ عَلِيٌّ وَعُثْمَانُ ـ رضى الله عنهما ـ وَهُمَا بِعُسْفَانَ فِي الْمُتْعَةِ، فَقَالَ عَلِيٌّ مَا تُرِيدُ إِلاَّ أَنْ تَنْهَى عَنْ أَمْرٍ فَعَلَهُ النَّبِيُّ صلى الله عليه وسلم‏.‏ فَلَمَّا رَأَى ذَلِكَ عَلِيٌّ أَهَلَّ بِهِمَا جَمِيعًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1508,
                "hadithNumber": "1570",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "We came with Allah's Messenger (ﷺ) (to Mecca) and we were saying: 'Labbaika Allahumma Labbaik' for Hajj. Allah's Messenger (ﷺ) ordered us to perform `Umra with that Ihram (instead of Hajj).",
                "hadithUrdu": "جب ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ آئے تو ہم نے حج کی لبیک پکاری ۔ پھر رسول االلہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا ہم نے اسے عمرہ بنا لیا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، کہا کہ میں نے مجاہد سے سنا ، انہوں نے کہا ہم سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، قَالَ سَمِعْتُ مُجَاهِدًا، يَقُولُ حَدَّثَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَدِمْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَنَحْنُ نَقُولُ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ بِالْحَجِّ‏.‏ فَأَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَعَلْنَاهَا عُمْرَةً‏.‏",
                "headingArabic": "مَنْ لَبَّى بِالْحَجِّ وَسَمَّاهُ",
                "headingUrdu": "حج کے لیے تلبیہ اور حج کی نیت",
                "headingEnglish": "Talbiya for Hajj and the intention of Hajj",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1509,
                "hadithNumber": "1571",
                "englishNarrator": "Narrated `Imran:",
                "hadithEnglish": "We performed Hajj-at-Tamattu` in the lifetime of Allah's Messenger (ﷺ) and then the Qur'an was revealed (regarding Hajj-at-Tamattu`) and somebody said what he wished (regarding Hajj-at-Tamattu`) according his own opinion.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں ہم نے تمتع کیا تھا اور خود قرآن میں تمتع کا حکم نازل ہوا تھا ۔ اب ایک شخص نے اپنی رائے سے جو چاہا کہہ دیا ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے ہمام بن یحییٰ نے قتادہ سے بیان کیا کہا کہ مجھ سے مطرف نے عمران بن حصین سے بیان کیا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، قَالَ حَدَّثَنِي مُطَرِّفٌ، عَنْ عِمْرَانَ ـ رضى الله عنه ـ قَالَ تَمَتَّعْنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَنَزَلَ الْقُرْآنُ قَالَ رَجُلٌ بِرَأْيِهِ مَا شَاءَ‏.‏",
                "headingArabic": "التَّمَتُّعِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "headingUrdu": "حج تمتع",
                "headingEnglish": "Hajj-at-Tamattu'",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1510,
                "hadithNumber": "1572",
                "englishNarrator": "Hadrat Ikrimah reports that Hadrat Ibn-e-Abbas رضی اللہ عنہما was asked about Hajj-e-t",
                "hadithEnglish": "Ibn 'Abbas رضی اللہ عنہما said that he has been asked regarding Hajj-at-Tamattu' on which he said, \"The Muhajirin and the Ansar and the wives of the Prophet (ﷺ) and we did the same. When we reached Makkah, Allah's Messenger (ﷺ) said, \"Give up your intention of doing the Hajj (at this moment) and perform 'Umra, except the one who had garlanded the Hady.\" So, we performed Tawaf round the Ka'bah and [Sa'y] between As-safa and Al-MArwa, slept with our wives and wore ordinary (stitched) clothes. The Prophet (ﷺ) added, \"Whoever has garlanded his Hady is not allowed to finish the Ihram till the Hady has reached its destination (has been sacrificed)\". Then on the night of Tarwiya (8th Dhul Hijjah, in the afternoon) he ordered us to assume Ihram for Hajj and when we have performed all the ceremonies of Hajj, we came and performed Tawaf round the Ka'bah and (Sa'y) between As-Safa and Al-Marwa, and then our Hajj was complete, and we had to sacrifice a Hady according to the statement of Allah:\r\n\"... He must slaughter a Hady such as he can afford, but if he cannot afford it, he should observer Saum (fasts) three days during the Hajj and seven days after his return (to his home)….\" (V. 2:196). \r\nAnd the sacrifice of the sheep is sufficient. So, the Prophet (ﷺ) and his Companions honied the two religious deeds, (i.e. Hajj and 'Umra) in one year, for Allah revealed (the permissibility) of such practice in His book and in the Sunna (legal ways) of His Prophet (ﷺ) and rendered it permissible for all the people except those living in Makkah. Allah says: \"This is for him whose family is not present at the Al-Masjid-Al-Haram, (i.e. non resident of Makkah).\" The months of Hajj which Allah mentioned in His book are: Shawwal, Dhul-Qa'da and Dhul-Hijjah. Whoever performed Hajj-at-Tamattu' in those months, then slaughtering or fasting is compulsory for him. The words: 1. Ar-Rafatha means sexual intercourse. 2. Al-Fasuq means all kinds of sin, and 3. Al-Jidal means to dispute.",
                "hadithUrdu": "ابن عباس رضی اللہ عنہما سے حج میں تمتع کے متعلق پوچھا گیا ۔ آپ نے فرمایا کہ حجۃ الوداع کے موقع پر مہاجرین انصار نبی کریم صلی اللہ علیہ وسلم کی ازواج اور ہم سب نے احرام باندھا تھا ۔ جب ہم مکہ آئے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے احرام کو حج اور عمرہ دونوں کے لیے کر لو لیکن جو لوگ قربانی کا جانور اپنے ساتھ لائے ہیں ۔ ( وہ عمرہ کرنے کے بعد حلال نہیں ہوں گے ) چنانچہ ہم نے بیت اللہ کا طواف اور صفا و مروہ کی سعی کر لی تو اپنا احرام کھول ڈالا اور ہم اپنی بیویوں کے پاس گئے اور سلے ہوئے کپڑے پہنے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ جس کے ساتھ قربانی کا جانور ہے وہ اس وقت تک حلال نہیں ہو سکتا جب تک ہدی اپنی جگہ نہ پہنچ لے ( یعنی قربانی نہ ہولے ) ہمیں ( جنہوں نے ہدی ساتھ نہیں لی تھی ) آپ صلی اللہ علیہ وسلم نے آٹھویں تاریخ کی شام کو حکم دیا کہ ہم حج کا احرام باندھ لیں ۔ پھر جب ہم مناسک حج سے فارغ ہو گئے تو ہم نے آ کر بیت اللہ کا طواف اور صفا مروہ کی سعی کی ، پھر ہمارا حج پورا ہو گیا اور اب قربانی ہم پر لازم ہوئی ۔ جیسا کہ اللہ تعالیٰ کا ارشاد ہے ” جسے قربانی کا جانور میسر ہو ( تو وہ قربانی کرے ) اور اگر کسی کو قربانی کی طاقت نہ ہو تو تین روزے حج میں اور سات دن گھر واپس ہونے پر رکھے ( قربانی میں ) بکری بھی کافی ہے ۔ تو لوگوں نے حج اور عمرہ دونوں عبادتیں ایک ہی سال میں ایک ساتھ ادا کیں ۔ کیونکہ اللہ تعالیٰ نے خود اپنی کتاب میں یہ حکم نازل کیا تھا اور رسول اللہ صلی اللہ علیہ وسلم نے اس پر خود عمل کر کے تمام لوگوں کے لیے جائز قرار دیا تھا ۔ البتہ مکہ کے باشندوں کا اس سے استثناء ہے ۔ کیونکہ اللہ تعالیٰ کا فرمان ہے ” یہ حکم ان لوگوں کے لیے ہے جن کے گھر والے مسجدالحرام کے پاس رہنے والے نہ ہوں “ ۔ اور حج کے جن مہینوں کا قرآن میں ذکر ہے وہ شوال ، ذیقعدہ اور ذی الحجہ ہیں ۔ ان مہینوں میں جو کوئی بھی تمتع کرے وہ یا قربانی دے یا اگر مقدور نہ ہو تو روزے رکھے ۔ اور «رفث» کا معنی جماع ( یا فحش باتیں ) اور «فسوق» گناہ اور «جدال» لوگوں سے جھگڑنا ۔",
                "urduNarrator": "اور ابو کامل فضیل بن حسین بصریٰ نے کہا کہ ہم سے ابو معشر یوسف بن یزید براء نے بیان کیا ، کہا کہ ہم سے عثمان بن غیاث نے بیان کیا ، ان سے عکرمہ نے ، ان سے ابن عباس رضی اللہ عنہما نے ،",
                "hadithArabic": "وَقَالَ أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْبَصْرِيُّ حَدَّثَنَا أَبُو مَعْشَرٍ، حَدَّثَنَا عُثْمَانُ بْنُ غِيَاثٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ سُئِلَ عَنْ مُتْعَةِ الْحَجِّ، فَقَالَ أَهَلَّ الْمُهَاجِرُونَ وَالأَنْصَارُ وَأَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ وَأَهْلَلْنَا، فَلَمَّا قَدِمْنَا مَكَّةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اجْعَلُوا إِهْلاَلَكُمْ بِالْحَجِّ عُمْرَةً إِلاَّ مَنْ قَلَّدَ الْهَدْىَ ‏\"‏‏.‏ فَطُفْنَا بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ وَأَتَيْنَا النِّسَاءَ، وَلَبِسْنَا الثِّيَابَ وَقَالَ ‏\"‏ مَنْ قَلَّدَ الْهَدْىَ فَإِنَّهُ لاَ يَحِلُّ لَهُ حَتَّى يَبْلُغَ الْهَدْىُ مَحِلَّهُ ‏\"‏‏.‏ ثُمَّ أَمَرَنَا عَشِيَّةَ التَّرْوِيَةِ أَنْ نُهِلَّ بِالْحَجِّ، فَإِذَا فَرَغْنَا مِنَ الْمَنَاسِكِ جِئْنَا فَطُفْنَا بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ فَقَدْ تَمَّ حَجُّنَا، وَعَلَيْنَا الْهَدْىُ كَمَا قَالَ اللَّهُ تَعَالَى ‏{‏فَمَا اسْتَيْسَرَ مِنَ الْهَدْىِ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلاَثَةِ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ إِذَا رَجَعْتُمْ‏}‏ إِلَى أَمْصَارِكُمْ‏.‏ الشَّاةُ تَجْزِي، فَجَمَعُوا نُسُكَيْنِ فِي عَامٍ بَيْنَ الْحَجِّ وَالْعُمْرَةِ، فَإِنَّ اللَّهَ تَعَالَى أَنْزَلَهُ فِي كِتَابِهِ وَسَنَّهُ نَبِيُّهُ صلى الله عليه وسلم وَأَبَاحَهُ لِلنَّاسِ غَيْرَ أَهْلِ مَكَّةَ، قَالَ اللَّهُ ‏{‏ذَلِكَ لِمَنْ لَمْ يَكُنْ أَهْلُهُ حَاضِرِي الْمَسْجِدِ الْحَرَامِ‏}‏ وَأَشْهُرُ الْحَجِّ الَّتِي ذَكَرَ اللَّهُ تَعَالَى شَوَّالٌ وَذُو الْقَعْدَةِ وَذُو الْحَجَّةِ، فَمَنْ تَمَتَّعَ فِي هَذِهِ الأَشْهُرِ فَعَلَيْهِ دَمٌ أَوْ صَوْمٌ، وَالرَّفَثُ الْجِمَاعُ، وَالْفُسُوقُ الْمَعَاصِي، وَالْجِدَالُ الْمِرَاءُ‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {ذَلِكَ لِمَنْ لَمْ يَكُنْ أَهْلُهُ حَاضِرِي الْمَسْجِدِ الْحَرَامِ}",
                "headingUrdu": "\"یہ اس کے لیے ہے جس کے گھر والے مسجد الحرام میں موجود نہیں ہیں\"",
                "headingEnglish": "\"This is for him whose family is not present at the Al-Masjid-al-Haram\"",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1511,
                "hadithNumber": "1573",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "On reaching the sanctuary of Mecca, Ibn `Umar رضی اللہ عنہما used to stop, reciting Talbiya and then he would pass the night at Dhi-Tuwa and then offer the Fajr prayer and take a bath. He used to say that the Prophet (ﷺ) used to do the same.",
                "hadithUrdu": "جب عبداللہ بن عمر رضی اللہ عنہما حرم کی سرحد کے قریب پہنچتے تو تلبیہ کہنا بند کر دیتے ۔ رات ذی طویٰ میں گزارتے ، صبح کی نماز وہیں پڑھتے اور غسل کرتے ( پھر مکہ میں داخل ہوتے ) آپ بیان کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم بھی اسی طرح کیا کرتے تھے ۔",
                "urduNarrator": "ہم سے یعقوب بن ابراہیم نے بیان کیا ، ان سے اسماعیل بن علیہ نے بیان کیا ، انہیں ایوب سختیانی نے خبر دی ، انہیں نافع نے ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، أَخْبَرَنَا أَيُّوبُ، عَنْ نَافِعٍ، قَالَ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ إِذَا دَخَلَ أَدْنَى الْحَرَمِ أَمْسَكَ عَنِ التَّلْبِيَةِ، ثُمَّ يَبِيتُ بِذِي طُوًى، ثُمَّ يُصَلِّي بِهِ الصُّبْحَ وَيَغْتَسِلُ، وَيُحَدِّثُ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَفْعَلُ ذَلِكَ‏.‏",
                "headingArabic": "الاِغْتِسَالِ عِنْدَ دُخُولِ مَكَّةَ",
                "headingUrdu": "مکہ میں داخل ہوتے ہی غسل کرنا",
                "headingEnglish": "Taking a bath on entering Makkah",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1512,
                "hadithNumber": "1574",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"The Prophet (ﷺ) passed the night at Dhi-Tuwa till it was dawn and then he entered Mecca.\" Ibn `Umar رضی اللہ عنہما used to do the same.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ذی طویٰ میں رات گزاری ۔ پھر جب صبح ہوئی تو آپ صلی اللہ علیہ وسلم مکہ میں داخل ہوئے ۔ ابن عمر رضی اللہ عنہما بھی اسی طرح کرتے تھے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ قطان نے بیان کیا ، انہوں نے کہا کہ ہم سے عبیداللہ عمری نے بیان کیا ، ان سے نافع نے ابن عمر رضی اللہ عنہما سے بیان کیا ، آپ رضی اللہ عنہ نے فرمایا کہ کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ بَاتَ النَّبِيُّ صلى الله عليه وسلم بِذِي طُوًى حَتَّى أَصْبَحَ ثُمَّ دَخَلَ مَكَّةَ‏.‏ وَكَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يَفْعَلُهُ‏.‏",
                "headingArabic": "دُخُولِ مَكَّةَ نَهَارًا أَوْ لَيْلاً",
                "headingUrdu": "مکہ میں دن کو یا رات میں داخل ہونا",
                "headingEnglish": "To enter Makkah by day or by night",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1513,
                "hadithNumber": "1575",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to enter Mecca from the high Thaniya and used to leave Mecca from the low Thaniya.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم مکہ میں بلند گھاٹی ( یعنی جنت المعلیٰ ) کی طرف سے داخل ہوتے اور نکلتے ”ثنیہ سفلیٰ“ کی طرف سے یعنی نیچے کی گھاٹی ( باب شبیکہ ) کی طرف سے ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، ان سے معن بن عیسیٰ نے بیان کیا ، ان سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنِي مَعْنٌ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْخُلُ مِنَ الثَّنِيَّةِ الْعُلْيَا، وَيَخْرُجُ مِنَ الثَّنِيَّةِ السُّفْلَى‏.‏",
                "headingArabic": "مِنْ أَيْنَ يَدْخُلُ مَكَّةَ",
                "headingUrdu": "جہاں سے مکہ میں داخل ہونا ہے۔",
                "headingEnglish": "From where to enter Makkah",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1514,
                "hadithNumber": "1576",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) entered Mecca from Kada' from the highest Thaniya which is at Al-Batha' and used to leave Mecca from the low Thaniya.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ”ثنیہ علیا“ یعنی مقام کداء کی طرف سے داخل ہوتے جو بطحاء میں ہے اور ”ثنیہ سفلیٰ“ کی طرف سے نکلتے تھے یعنی نیچے والی گھاٹی کی طرف سے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد بصریٰ نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے عبیداللہ عمری نے ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ الْبَصْرِيُّ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ مَكَّةَ مِنْ كَدَاءٍ مِنَ الثَّنِيَّةِ الْعُلْيَا الَّتِي بِالْبَطْحَاءِ، وَيَخْرُجُ مِنَ الثَّنِيَّةِ السُّفْلَى‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ كَانَ يُقَالُ هُوَ مُسَدَّدٌ كَاسْمِهِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ سَمِعْتُ يَحْيَى بْنَ مَعِينٍ يَقُولُ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ يَقُولُ لَوْ أَنَّ مُسَدَّدًا أَتَيْتُهُ فِي بَيْتِهِ فَحَدَّثْتُهُ لاَسْتَحَقَّ ذَلِكَ، وَمَا أُبَالِي كُتُبِي كَانَتْ عِنْدِي أَوْ عِنْدَ مُسَدَّدٍ‏.‏",
                "headingArabic": "مِنْ أَيْنَ يَخْرُجُ مِنْ مَكَّةَ",
                "headingUrdu": "جہاں سے مکہ چھوڑنا ہے۔",
                "headingEnglish": "From where to leave Makkah",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1515,
                "hadithNumber": "1577",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "When the Prophet (ﷺ) came to Mecca he entered from its higher side and left from its lower side.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم مکہ میں تشریف لائے تو اوپر کی بلند جانب سے شہر کے اندر داخل ہوئے اور ( مکہ سے ) واپس جب گئے تو نیچے کی طرف سے نکل گئے ۔",
                "urduNarrator": "ہم حمیدی اور محمدبن مثنیٰ نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے ، ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمَّا جَاءَ إِلَى مَكَّةَ دَخَلَ مِنْ أَعْلاَهَا وَخَرَجَ مِنْ أَسْفَلِهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1516,
                "hadithNumber": "1578",
                "englishNarrator": "Narrated `Aisha' رضی اللہ عنہا :",
                "hadithEnglish": "In the year of the conquest of Mecca, the Prophet (ﷺ) entered Mecca from Kada' and left Mecca from Kuda, from the higher part of Mecca.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم فتح مکہ کے موقع پر شہر میں کداء کی طرف سے داخل ہوئے اور کدیٰ کی طرف سے نکلے جو مکہ کے بلند جانب ہے ۔",
                "urduNarrator": "ہم سے محمود بن غیلان مروزی نے بیان کیا ، انہوں نے کہا کہ ہم سے ابواسامہ نے بیان کیا ، انہوں نے کہا کہ ہم سے ہشام بن عروہ نے بیان کیا ۔ ان سے ان کے والد عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ الْمَرْوَزِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَامَ الْفَتْحِ مِنْ كَدَاءٍ، وَخَرَجَ مِنْ كُدًا مِنْ أَعْلَى مَكَّةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1517,
                "hadithNumber": "1579",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "In the year of the conquest of Mecca, the Prophet (ﷺ) entered Mecca from Kada' at the higher place of Mecca. (Hisham, a sub-narrator said, \" `Urwa used to enter (Mecca) from both Kada' and Kuda and he often entered through Kada' which was nearer to his dwelling place.)\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم فتح مکہ موقع پر داخل ہوتے وقت مکہ کے بالائی علاقہ کداء سے داخل ہوئے ۔ ہشام نے بیان کیا کہ عروہ اگرچہ کداء اور کدیٰ دونوں طرف سے داخل ہوتے تھے لیکن اکثر کدیٰ سے داخل ہوتے کیونکہ یہ راستہ ان کے گھر سے قریب تھا ۔",
                "urduNarrator": "ہم سے احمد بن عیسیٰ نے بیان کیا ، کہا کہ ہم سے عبداللہ ابن وہب نے بیان کیا ، کہا کہ ہمیں عمرو بن حارث نے خبر دی اور انہیں ہشام بن عروہ نے ، انہیں ان کے والد عروہ بن زبیر نے اور انہیں عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرٌو، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَامَ الْفَتْحِ مِنْ كَدَاءٍ أَعْلَى مَكَّةَ‏.‏ قَالَ هِشَامٌ وَكَانَ عُرْوَةُ يَدْخُلُ عَلَى كِلْتَيْهِمَا مِنْ كَدَاءٍ وَكُدًا، وَأَكْثَرُ مَا يَدْخُلُ مِنْ كَدَاءٍ، وَكَانَتْ أَقْرَبَهُمَا إِلَى مَنْزِلِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1518,
                "hadithNumber": "1580",
                "englishNarrator": "Narrated `Urwa:",
                "hadithEnglish": "\"The Prophet (ﷺ) entered Mecca in the year of the conquest of Mecca from the side of Kada' which is at the higher part of Mecca.\" `Urwa often entered from Kada' which was nearer of the two to his dwelling place.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم فتح مکہ کے موقع پر مکہ کے بالائی علاقہ کداء کی طرف سے داخل ہوئے تھے ۔ لیکن عروہ اکثر کدیٰ کی طرف سے داخل ہوتے تھے کیونکہ یہ راستہ ان کے گھر سے قریب تھا ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، انہوں نے کہا کہ ہم سے حاتم بن اسماعیل نے ہشام سے بیان کیا ، ان سے عروہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا حَاتِمٌ، عَنْ هِشَامٍ، عَنْ عُرْوَةَ، دَخَلَ النَّبِيُّ صلى الله عليه وسلم عَامَ الْفَتْحِ مِنْ كَدَاءٍ مِنْ أَعْلَى مَكَّةَ‏.‏ وَكَانَ عُرْوَةُ أَكْثَرَ مَا يَدْخُلُ مِنْ كَدَاءٍ وَكَانَ أَقْرَبَهُمَا إِلَى مَنْزِلِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1519,
                "hadithNumber": "1581",
                "englishNarrator": "Narrated Hisham from his father:",
                "hadithEnglish": "In the year of the conquest of Mecca, the Prophet (ﷺ) entered Mecca from the side of Kada. `Urwa used to enter through both places and he often entered through Kada' which was nearer of the two to his dwelling place. Imam Abu Abdullah Bukhari said: Kada and Kuda both are places.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم فتح مکہ کے موقع پر کداء سے داخل ہوئے تھے ۔ عروہ خود اگرچہ دونوں طرف سے ( کداء اور کدیٰ ) داخل ہوتے لیکن اکثر آپ کدیٰ کی طرف سے داخل ہوتے تھے کیونکہ یہ راستہ ان کے گھر سے قریب تھا ۔ ابوعبداللہ امام بخاری رحمہ اللہ نے کہا کہ کداء اور کدیٰ دو مقامات کے نام ہیں ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے وہیب بن خالد نے بیان کیا کہا کہ ہم سے ہشام نے اپنے باپ سے بیان کیا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، دَخَلَ النَّبِيُّ صلى الله عليه وسلم عَامَ الْفَتْحِ مِنْ كَدَاءٍ‏.‏ وَكَانَ عُرْوَةُ يَدْخُلُ مِنْهُمَا كِلَيْهِمَا وَأَكْثَرُ مَا يَدْخُلُ مِنْ كَدَاءٍ أَقْرَبِهِمَا إِلَى مَنْزِلِهِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ كَدَاءٌ وَكُدًا مَوْضِعَانِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1520,
                "hadithNumber": "1582",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "When the Ka`ba was built, the Prophet (ﷺ) and `Abbas رضی اللہ عنہ went to bring stones (for its construction). Al `Abbas رضی اللہ عنہ said to the Prophet, \"Take off your waist sheet and put it on your neck.\" (When the Prophet (ﷺ) took it off) he fell on the ground with his eyes open towards the sky and said, \"Give me my waist sheet.\" And he covered himself with it.",
                "hadithUrdu": "( زمانہ جاہلیت میں ) جب کعبہ کی تعمیر ہوئی تو نبی کریم صلی اللہ علیہ وسلم اور عباس رضی اللہ عنہ بھی پتھر اٹھا کر لا رہے تھے ۔ عباس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے کہا کہ اپنا تہبند اتار کر کاندھے پر ڈال لو ( تاکہ پتھر اٹھانے میں تکلیف نہ ہو ) آنحضور صلی اللہ علیہ وسلم نے ایسا کیا تو ننگے ہوتے ہی بیہوش ہو کر آپ زمین پر گر پڑے اور آپ کی آنکھیں آسمان کی طرف لگ گئیں ۔ آپ کہنے لگے مجھے میرا تہبند دے دو ۔ پھر آپ صلی اللہ علیہ وسلم نے اسے مضبوط باندھ لیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا کہ ہم سے ابوعاصم نبیل نے بیان کیا ، کہا کہ مجھے ابن جریج نے خبر دی ، کہا کہ مجھے عمرو بن دینا ر نے خبر دی ، کہا کہ میں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَاصِمٍ، قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ لَمَّا بُنِيَتِ الْكَعْبَةُ ذَهَبَ النَّبِيُّ صلى الله عليه وسلم وَعَبَّاسٌ يَنْقُلاَنِ الْحِجَارَةَ فَقَالَ الْعَبَّاسُ لِلنَّبِيِّ صلى الله عليه وسلم اجْعَلْ إِزَارَكَ عَلَى رَقَبَتِكَ‏.‏ فَخَرَّ إِلَى الأَرْضِ، وَطَمَحَتْ عَيْنَاهُ إِلَى السَّمَاءِ فَقَالَ ‏ \"‏ أَرِنِي إِزَارِي ‏\"‏‏.‏ فَشَدَّهُ عَلَيْهِ‏.‏",
                "headingArabic": "فَضْلِ مَكَّةَ وَبُنْيَانِهَا",
                "headingUrdu": "مکہ مکرمہ اور اس کی عمارتوں کی فضیلت اور اللہ تعالیٰ کا بیان",
                "headingEnglish": "The superiority of Makkah and its buildings, and the statement of Allah Ta'ala",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1521,
                "hadithNumber": "1583",
                "englishNarrator": "Narrated `Aisha (the wife of the Prophet):",
                "hadithEnglish": "\"Do you know that when your people (Quraish) rebuilt the Ka`ba, they decreased it from its original foundation laid by Abraham?\" I said, \"O Allah's Messenger (ﷺ)! Why don't you rebuild it on its original foundation laid by Abraham?\" He replied, \"Were it not for the fact that your people are close to the Pre-Islamic Period of ignorance (i.e. they have recently become Muslims) I would have done so.\" The sub-narrator, `Abdullah (bin `Umar ) stated: `Aisha 'must have heard this from Allah's Messenger (ﷺ) for in my opinion Allah's Messenger (ﷺ) had not placed his hand over the two corners of the Ka`ba opposite Al-Hijr only because the Ka`ba was not rebuilt on its original foundations laid by Abraham.\r\nHadrat Abdullah said: If Hadrat Aishah رضی اللہ عنہا heard from Allah Apostle (ﷺ) then I think this is the reason that Allah Apostle abandoned to kiss (touch with respect) these both pillars which are closed to the Black stone for Allah's House was not lifted up on the foundations laid by Hadrat Ibrahim.",
                "hadithUrdu": "تجھے معلوم ہے جب تیری قوم نے کعبہ کی تعمیر کی تو بنیاد ابراہیم کو چھوڑ دیا تھا ۔ میں نے عرض کیا یا رسول اللہ ! پھر آپ بنیاد ابراہیم پر اس کو کیوں نہیں بنا دیتے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر تمہاری قوم کا زمانہ کفر سے بالکل نزدیک نہ ہوتا تو میں بیشک ایسا کر دیتا ۔ \r\n¤ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ اگر عائشہ صدیقہ رضی اللہ عنہا نے یہ بات رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے ( اور یقیناً حضرت عائشہ رضی اللہ عنہا سچی ہیں ) تو میں سمجھتا ہوں یہی وجہ تھی جو آنحضرت صلی اللہ علیہ وسلم حطیم سے متصل جو دیواروں کے کونے ہیں ان کو نہیں چومتے تھے ۔ کیونکہ خانہ کعبہ ابراہیمی بنیادوں پر پورا نہ ہوا تھا ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے سالم بن عبداللہ نے کہ عبداللہ بن محمد بن ابی بکر نے انہیں خبر دی ، انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبردی اور انہیں نبی کریم صلی اللہ علیہ وسلم کی پاک بیوی حضرت عائشہ صدیقہ رضی اللہ عنہا نے کہ آنحضور صلی اللہ علیہ وسلم نے ان سے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ مُحَمَّدِ بْنِ أَبِي بَكْرٍ، أَخْبَرَ عَبْدَ اللَّهِ بْنَ عُمَرَ، عَنْ عَائِشَةَ ـ رضى الله عنهم ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهَا ‏\"‏ أَلَمْ تَرَىْ أَنَّ قَوْمَكِ لَمَّا بَنَوُا الْكَعْبَةَ اقْتَصَرُوا عَنْ قَوَاعِدِ إِبْرَاهِيمَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَلاَ تَرُدُّهَا عَلَى قَوَاعِدِ إِبْرَاهِيمَ‏.‏ قَالَ ‏\"‏ لَوْلاَ حِدْثَانُ قَوْمِكِ بِالْكُفْرِ لَفَعَلْتُ ‏\"‏‏.‏ فَقَالَ عَبْدُ اللَّهِ ـ رضى الله عنه ـ لَئِنْ كَانَتْ عَائِشَةُ ـ رضى الله عنها ـ سَمِعَتْ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم مَا أُرَى رَسُولَ اللَّهِ صلى الله عليه وسلم تَرَكَ اسْتِلاَمَ الرُّكْنَيْنِ اللَّذَيْنِ يَلِيَانِ الْحِجْرَ، إِلاَّ أَنَّ الْبَيْتَ لَمْ يُتَمَّمْ عَلَى قَوَاعِدِ إِبْرَاهِيمَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1522,
                "hadithNumber": "1584",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I asked the Prophet (ﷺ) whether the round wall (near Ka`ba) was part of the Ka`ba. The Prophet (ﷺ) replied in the affirmative. I further said, \"What is wrong with them, why have they not included it in the building of the Ka`ba?\" He said, \"Don't you see that your people (Quraish) ran short of money (so they could not include it inside the building of Ka`ba)?\" I asked, \"What about its gate? Why is it so high?\" He replied, \"Your people did this so as to admit into it whomever they liked and prevent whomever they liked. Were your people not close to the Pre-Islamic Period of ignorance (i.e. they have recently embraced Islam) and were I not afraid that they would dislike it, surely I would have included the (area of the) wall inside the building of the Ka`ba and I would have lowered its gate to the level of the ground.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ کیا حطیم بھی بیت اللہ میں داخل ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ، پھر میں نے پوچھا کہ پھر لوگوں نے اسے کعبے میں کیوں نہیں شامل کیا ؟ آپ صلی اللہ علیہ وسلم نے جواب دیا کہ تمہاری قوم کے پاس خرچ کی کمی پڑ گئی تھی ۔ پھر میں نے پوچھا کہ یہ دروازہ کیوں اونچا بنایا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ بھی تمہاری قوم ہی نے کیا تاکہ جسے چاہیں اندر آنے دیں اور جسے چاہیں روک دیں ۔ اگر تمہاری قوم کی جاہلیت کا زمانہ تازہ تازہ نہ ہوتا اور مجھے اس کا خوف نہ ہوتا کہ ان کے دل بگڑ جائیں گے تو اس حطیم کو بھی میں کعبہ میں شامل کر دیتا اور کعبہ کا دروازہ زمین کے برابر کر دیتا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا کہ ہم سے ابوالاحوص سلام بن سلیم جعفی نے بیان کیا ، ان سے اشعت نے بیان کیا ، ان سے اسود بن یزید نے اور ان سے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، حَدَّثَنَا أَشْعَثُ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنِ الْجَدْرِ أَمِنَ الْبَيْتِ هُوَ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قُلْتُ فَمَا لَهُمْ لَمْ يُدْخِلُوهُ فِي الْبَيْتِ قَالَ ‏\"‏ إِنَّ قَوْمَكِ قَصَّرَتْ بِهِمُ النَّفَقَةُ ‏\"‏‏.‏ قُلْتُ فَمَا شَأْنُ بَابِهِ مُرْتَفِعًا قَالَ ‏\"‏ فَعَلَ ذَلِكِ قَوْمُكِ لِيُدْخِلُوا مَنْ شَاءُوا وَيَمْنَعُوا مَنْ شَاءُوا، وَلَوْلاَ أَنَّ قَوْمَكِ حَدِيثٌ عَهْدُهُمْ بِالْجَاهِلِيَّةِ فَأَخَافُ أَنْ تُنْكِرَ قُلُوبُهُمْ أَنْ أُدْخِلَ الْجَدْرَ فِي الْبَيْتِ وَأَنْ أُلْصِقَ بَابَهُ بِالأَرْضِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1523,
                "hadithNumber": "1585",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said to me, \"Were your people not close to the Pre-Islamic period of ignorance, I would have demolished the Ka`ba and would have rebuilt it on its original foundations laid by Abraham (for Quraish had curtailed its building), and I would have built a back door (too).\" Moaviyah reported from Hisham that خَلْفًا means a door.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا ، اگر تمہاری قوم کا زمانہ کفر سے ابھی تازہ نہ ہوتا تو میں خانہ کعبہ کو توڑ کر اسے ابراہیم علیہ السلام کی بنیاد پر بناتا کیونکہ قریش نے اس میں کمی کر دی ہے ۔ اس میں ایک دروازہ اور اس دروازے کے مقابل رکھتا ۔ ابومعاویہ نے کہا ہم سے ہشام نے بیان کیا ۔ حدیث میں «خلف» سے دروازہ مراد ہے ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ، انہوں نے کہا کہ ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے بیان کیا ، ان سے ان کے والد نے اور ان سے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْلاَ حَدَاثَةُ قَوْمِكِ بِالْكُفْرِ لَنَقَضْتُ الْبَيْتَ ثُمَّ لَبَنَيْتُهُ عَلَى أَسَاسِ إِبْرَاهِيمَ ـ عَلَيْهِ السَّلاَمُ ـ فَإِنَّ قُرَيْشًا اسْتَقْصَرَتْ بِنَاءَهُ ـ وَجَعَلْتُ لَهُ خَلْفًا ‏\"‏‏.‏ قَالَ أَبُو مُعَاوِيَةَ حَدَّثَنَا هِشَامٌ خَلْفًا يَعْنِي بَابًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1524,
                "hadithNumber": "1586",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) said to her, \"O Aisha! Were your nation not close to the Pre-Islamic Period of Ignorance, I would have had the Ka`ba demolished and would have included in it the portion which had been left, and would have made it at a level with the ground and would have made two doors for it, one towards the east and the other towards the west, and then by doing this it would have been built on the foundations laid by Abraham.\" That was what urged Ibn-Az-Zubair رضی اللہ عنہما to demolish the Ka`ba. Yazeed said, \"I saw Ibn-Az-Zubair رضی اللہ عنہما when he demolished and rebuilt the Ka`ba and included in it a portion of Al-Hijr (the unroofed portion of Ka`ba which is at present in the form of a compound towards the northwest of the Ka`ba). I saw the original foundations of Abraham which were of stones resembling the humps of camels.\" So Jarir asked Yazid, \"Where was the place of those stones?\" Jazz said, \"I will just now show it to you.\" So Jarir accompanied Yazid and entered Al-Hijr, and he pointed to a place and said, \"Here it is.\" Jarir said, \"It appeared to me about six cubits from Al-Hijr or so.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، عائشہ ! اگر تیری قوم کا زمانہ جاہلیت ابھی تازہ نہ ہوتا ، تو میں بیت اللہ کو گرانے کا حکم دے دیتا تاکہ ( نئی تعمیر میں ) اس حصہ کو بھی داخل کر دوں جو اس سے باہر رہ گیا ہے اور اس کی کرسی زمین کے برابر کر دوں اور اس کے دو دروازے بنا دوں ، ایک مشرق میں اور ایک مغرب میں ۔ اس طرح ابراہیم علیہ السلام کی بنیاد پر اس کی تعمیر ہو جاتی ۔ عبداللہ بن زبیر رضی اللہ عنہما کا کعبہ کو گرانے سے یہی مقصد تھا ۔ یزید نے بیان کیا کہ میں اس وقت موجود تھا جب عبداللہ بن زبیر رضی اللہ عنہما نے اسے گرایا تھا اور اس کی نئی تعمیر کر کے حطیم کو اس کے اندر کر دیا تھا ۔ میں نے ابراہیم علیہ السلام کی تعمیر کے پائے بھی دیکھے جو اونٹ کی کوہان کی طرح تھے ۔ جریر بن حازم نے کہا کہ میں نے ان سے پوچھا ، ان کی جگہ کہاں ہے ؟ انہوں نے فرمایا کہ میں ابھی دکھاتا ہوں ۔ چنانچہ میں ان کے ساتھ حطیم میں گیا اور آپ نے ایک جگہ کی طرف اشارہ کر کے کہا کہ یہ وہ جگہ ہے ۔ جریر نے کہا کہ میں نے اندازہ لگایا کہ وہ جگہ حطیم میں سے چھ ہاتھ ہو گی یا ایسی ہی کچھ ۔",
                "urduNarrator": "ہم سے بیان بن عمرو نے بیان کیا ، انہوں نے کہا کہ ہم سے یزید بن ہاروں نے بیان کیا ، انہوں نے کہا کہ ہم سے جریر بن حازم نے بیان کیا ، انہوں نے کہا کہ ہم سے یزید بن رومان نے بیان کیا ، ان سے عروہ نے اور ان سے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا بَيَانُ بْنُ عَمْرٍو، حَدَّثَنَا يَزِيدُ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا يَزِيدُ بْنُ رُومَانَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهَا ‏ \"‏ يَا عَائِشَةُ لَوْلاَ أَنَّ قَوْمَكِ حَدِيثُ عَهْدٍ بِجَاهِلِيَّةٍ لأَمَرْتُ بِالْبَيْتِ فَهُدِمَ، فَأَدْخَلْتُ فِيهِ مَا أُخْرِجَ مِنْهُ وَأَلْزَقْتُهُ بِالأَرْضِ، وَجَعَلْتُ لَهُ بَابَيْنِ بَابًا شَرْقِيًّا وَبَابًا غَرْبِيًّا، فَبَلَغْتُ بِهِ أَسَاسَ إِبْرَاهِيمَ ‏\"‏‏.‏ فَذَلِكَ الَّذِي حَمَلَ ابْنَ الزُّبَيْرِ ـ رضى الله عنهما ـ عَلَى هَدْمِهِ‏.‏ قَالَ يَزِيدُ وَشَهِدْتُ ابْنَ الزُّبَيْرِ حِينَ هَدَمَهُ وَبَنَاهُ وَأَدْخَلَ فِيهِ مِنَ الْحِجْرِ، وَقَدْ رَأَيْتُ أَسَاسَ إِبْرَاهِيمَ حِجَارَةً كَأَسْنِمَةِ الإِبِلِ‏.‏ قَالَ جَرِيرٌ فَقُلْتُ لَهُ أَيْنَ مَوْضِعُهُ قَالَ أُرِيكَهُ الآنَ‏.‏ فَدَخَلْتُ مَعَهُ الْحِجْرَ فَأَشَارَ إِلَى مَكَانٍ فَقَالَ هَا هُنَا‏.‏ قَالَ جَرِيرٌ فَحَزَرْتُ مِنَ الْحِجْرِ سِتَّةَ أَذْرُعٍ أَوْ نَحْوَهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1525,
                "hadithNumber": "1587",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "On the Day of the Conquest of Mecca, Allah's Messenger (ﷺ) said, \"Allah has made this town a sanctuary. Its thorny bushes should not be cut, its game should not be chased, and its fallen things should not be picked up except by one who would announce it publicly.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ پر فرمایا تھا کہ اللہ تعالیٰ نے اس شہر ( مکہ ) کو حرمت والا بنایا ہے ( یعنی عزت دی ہے ) پس اس کے ( درختوں کے ) کانٹے تک بھی نہیں کاٹے جا سکتے یہاں کے شکار بھی نہیں ہنکائے جا سکتے ۔ اور ان کے علاوہ جو اعلان کر کے ( مالک تک پہنچانے کا ارادہ رکھتے ہوں ) کوئی شخص یہاں کی گری پڑی چیز بھی نہیں اٹھا سکتا ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ بن جعفر نے بیان کیا ، کہا کہ ہم سے جریر بن عبدالحمید نے منصور سے بیان کیا ان سے مجاہد نے ، ان سے طاؤس نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ فَتْحِ مَكَّةَ ‏ \"‏ إِنَّ هَذَا الْبَلَدَ حَرَّمَهُ اللَّهُ، لاَ يُعْضَدُ شَوْكُهُ، وَلاَ يُنَفَّرُ صَيْدُهُ، وَلاَ يَلْتَقِطُ لُقَطَتَهُ إِلاَّ مَنْ عَرَّفَهَا ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ الْحَرَمِ",
                "headingUrdu": "حرم (مکہ) کی برتری",
                "headingEnglish": "The superiority of the Haram (of Makkah)",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1526,
                "hadithNumber": "1588",
                "englishNarrator": "Narrated 'Usama bin Zaid رضی اللہ عنہما :",
                "hadithEnglish": "I asked, \"O Allah's Messenger (ﷺ)! Where will you stay in Mecca? Will you stay in your house in Mecca?\" He replied, \"Has `Aqil left any property or house?\" `Aqil along with Talib had inherited the property of Abu Talib. Jafar and `Ali رضی اللہ عنہما did not inherit anything as they were Muslims and the other two were non-believers. `Umar bin Al-Khattab رضی اللہ عنہ used to say, \"A believer cannot inherit (anything from an) infidel.\" Ibn Shihab, (a sub-narrator) said, \"They (`Umar and others) derived the above verdict from Allah's Statement: \"Verily! those who believed and Emigrated and strove with their life And property in Allah's Cause, And those who helped (the emigrants) And gave them their places to live in, These are (all) allies to one another.\" (8.72)",
                "hadithUrdu": "انہوں نے پوچھا یا رسول اللہ ! آپ مکہ میں کیا اپنے گھر میں قیام فرمائیں گے ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ عقیل نے ہمارے لیے محلہ یا مکان چھوڑا ہی کب ہے ۔ ( سب بیچ کھوچ کر برابر کر دئیے ) عقیل اور طالب ، ابوطالب کے وارث ہوئے تھے ۔ جعفر اور علی رضی اللہ عنہما کو وراثت میں کچھ نہیں ملا تھا ، کیونکہ یہ دونوں مسلمان ہو گئے تھے اور عقیل رضی اللہ عنہ ( ابتداء میں ) اور طالب اسلام نہیں لائے تھے ۔ اسی بنیاد پر حضرت عمر بن خطاب رضی اللہ عنہ فرمایا کرتے تھے کہ مسلمان کافر کا وارث نہیں ہوتا ۔ ابن شہاب نے کہا کہ لوگ اللہ تعالیٰ کے اس ارشاد سے دلیل لیتے ہیں کہ ” جو لوگ ایمان لائے ، ہجرت کی اور اپنے مال اور جان کے ساتھ اللہ کی راہ میں جہاد کیا اور وہ لوگ جنہوں نے پناہ دی اور مدد کی ، وہی ایک دوسرے کے وارث ہوں گے ۔“",
                "urduNarrator": "ہم سے اصبغ بن فرج نے بیان کیا ، انہوں نے کہا کہ مجھے عبداللہ بن وہب نے خبر دی ، انہیں یونس نے ، انہیں ابن شہاب نے ، انہیں علی بن حسین نے ، انہیں عمرو بن عثمان نے اور انہیں حضرت اسامہ بن زید رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَصْبَغُ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ عَمْرِو بْنِ عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ، أَيْنَ تَنْزِلُ فِي دَارِكَ بِمَكَّةَ‏.‏ فَقَالَ ‏\"‏ وَهَلْ تَرَكَ عَقِيلٌ مِنْ رِبَاعٍ أَوْ دُورٍ ‏\"‏‏.‏ وَكَانَ عَقِيلٌ وَرِثَ أَبَا طَالِبٍ هُوَ وَطَالِبٌ وَلَمْ يَرِثْهُ جَعْفَرٌ وَلاَ عَلِيٌّ ـ رضى الله عنهما ـ شَيْئًا لأَنَّهُمَا كَانَا مُسْلِمَيْنِ، وَكَانَ عَقِيلٌ وَطَالِبٌ كَافِرَيْنِ، فَكَانَ عُمَرُ بْنُ الْخَطَّابِ ـ رضى الله عنه ـ يَقُولُ لاَ يَرِثُ الْمُؤْمِنُ الْكَافِرَ‏.‏ قَالَ ابْنُ شِهَابٍ وَكَانُوا يَتَأَوَّلُونَ قَوْلَ اللَّهِ تَعَالَى ‏{‏إِنَّ الَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ وَالَّذِينَ آوَوْا وَنَصَرُوا أُولَئِكَ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ‏}‏ الآيَةَ‏.‏",
                "headingArabic": "تَوْرِيثِ دُورِ مَكَّةَ وَبَيْعِهَا وَشِرَائِهَا",
                "headingUrdu": "مکہ مکرمہ کے مکانات کی وراثت، خرید و فروخت",
                "headingEnglish": "The inheritance, sale and purchase of the houses of Makkah",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1501,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=60",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=58",
                "label": "58",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=59",
                "label": "59",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=60",
                "label": "60",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=61",
                "label": "61",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=62",
                "label": "62",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=63",
                "label": "63",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=64",
                "label": "64",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=62",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=62",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=60",
        "to": 1525,
        "total": 40465
    }
}