{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 62,
        "data": [
            {
                "id": 1527,
                "hadithNumber": "1589",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) intended to enter Mecca he said, \"Our destination tomorrow, if Allah wished, will be Khaif Bani Kinana where (the pagans) had taken the oath of Kufr.\" (Against the Prophet (ﷺ) i.e. to be loyal to heathenism by boycotting Bani Hashim, the Prophet's folk) (See Hadith 3882)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے جب ( منیٰ سے لوٹتے ہوئے حجتہ الوداع کے موقع پر ) مکہ آنے کا ارادہ کیا تو فرمایا کہ کل انشاءاللہ ہمارا قیام اسی خیف بنی کنانہ ( یعنی محصب ) میں ہو گا جہاں ( قریش نے ) کفر پر اڑے رہنے کی قسم کھائی تھی ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا کہ ہمیں شعیب نے خبر دی ، انہیں زہری نے کہا کہ مجھ سے ابوسلمہ نے بیان کیا ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ أَرَادَ قُدُومَ مَكَّةَ ‏ \"‏ مَنْزِلُنَا غَدًا إِنْ شَاءَ اللَّهُ بِخَيْفِ بَنِي كِنَانَةَ حَيْثُ تَقَاسَمُوا عَلَى الْكُفْرِ ‏\"‏‏.‏",
                "headingArabic": "نُزُولِ النَّبِيِّ صلى الله عليه وسلم مَكَّةَ",
                "headingUrdu": "مکہ مکرمہ میں رسول اللہ صلی اللہ علیہ وسلم کی رہائش گا",
                "headingEnglish": "The residence of the Prophet (ﷺ) in Makkah",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1528,
                "hadithNumber": "1590",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "On the Day of Nahr at Mina, the Prophet (ﷺ) said, \"Tomorrow we shall stay at Khaif Bani Kinana where the pagans had taken the oath of Kufr (heathenism).\" He meant (by that place) Al-Muhassab where the Quraish tribe and Bani Kinana concluded a contract against Bani Hashim and Bani `Abdul-Muttalib or Bani Al-Muttalib that they would not intermarry with them or deal with them in business until they handed over the Prophet (ﷺ) to them. salamah, Uqail and Yahya bin Dahhaak, Auzai, Ibne Shihab report that Bani Hisham and Bani Abdull Muttalib. Imam Abdullah Bukhari  said: Bani Al-Muttalib is more appropriate.",
                "hadithUrdu": "گیارہویں کی صبح کو جب آنحضور صلی اللہ علیہ وسلم منیٰ میں تھے تو یہ فرمایا تھا کہ کل ہم خیف بنی کنانہ میں قیام کریں گے جہاں قریش نے کفر کی حمایت کی قسم کھائی تھی ۔ آپ صلی اللہ علیہ وسلم کی مراد محصب سے تھی کیونکہ یہیں قریش اور کنانہ نے بنوہاشم اور بنو عبدالمطلب یا ( راوی نے ) بنوالمطلب ( کہا ) کے خلاف حلف اٹھایا تھا کہ جب تک وہ نبی کریم صلی اللہ علیہ وسلم کو ان کے حوالہ نہ کر دیں ، ان کے یہاں شادی بیاہ نہ کریں گے اور نہ ان سے خریدوفروخت کریں گے ۔ اور سلامہ بن روح نے عقیل اور یحییٰ بن ضحاک سے روایت کیا ، ان سے امام اوزاعی نے بیان کیا کہ مجھے ابن شہاب نے خبر دی ، انہوں نے ( اپنی روایت میں ) بنوہاشم اور بنوالمطلب کہا ۔ ابوعبداللہ امام بخاری نے کہا کہ بنوالمطلب زیادہ صحیح ہے ۔",
                "urduNarrator": "ہم سے حمیدی نے بیان کیا ، انہوں نے کہا کہ ہم سے ولیدبن مسلم نے بیان کیا ، انہوں نے کہا کہ ہم سے امام اوزاعی نے بیان کیا ، انہوں نے کہا کہ مجھ سے زہری نے بیان کیا ، ان سے ابوسلمہ نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم مِنَ الْغَدِ يَوْمَ النَّحْرِ وَهُوَ بِمِنًى ‏ \"‏ نَحْنُ نَازِلُونَ غَدًا بِخَيْفِ بَنِي كِنَانَةَ حَيْثُ تَقَاسَمُوا عَلَى الْكُفْرِ ‏\"‏‏.‏ يَعْنِي ذَلِكَ الْمُحَصَّبَ، وَذَلِكَ أَنَّ قُرَيْشًا وَكِنَانَةَ تَحَالَفَتْ عَلَى بَنِي هَاشِمٍ وَبَنِي عَبْدِ الْمُطَّلِبِ، أَوْ بَنِي الْمُطَّلِبِ أَنْ لاَ يُنَاكِحُوهُمْ، وَلاَ يُبَايِعُوهُمْ حَتَّى يُسْلِمُوا إِلَيْهِمُ النَّبِيَّ صلى الله عليه وسلم‏.‏ وَقَالَ سَلاَمَةُ عَنْ عُقَيْلٍ وَيَحْيَى بْنُ الضَّحَّاكِ عَنِ الأَوْزَاعِيِّ أَخْبَرَنِي ابْنُ شِهَابٍ وَقَالاَ بَنِي هَاشِمٍ وَبَنِي الْمُطَّلِبِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ بَنِي الْمُطَّلِبِ أَشْبَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1529,
                "hadithNumber": "1591",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet;; said, \"Dhus-Suwaiqa-tain (literally: One with two lean legs) from Ethiopia will demolish the Ka`ba.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ” کعبہ کو دو پتلی پنڈلیوں والا ایک حقیر حبشی تباہ کر دے گا ۔“",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، انہوں نے کہا ہم سے زیاد بن سعد نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے سعید بن مسیب نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا زِيَادُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يُخَرِّبُ الْكَعْبَةَ ذُو السُّوَيْقَتَيْنِ مِنَ الْحَبَشَةِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {جَعَلَ اللَّهُ الْكَعْبَةَ الْبَيْتَ الْحَرَامَ قِيَامًا لِلنَّاسِ وَالشَّهْرَ الْحَرَامَ وَالْهَدْيَ وَالْقَلاَئِدَ ذَلِكَ لِتَعْلَمُوا أَنَّ اللَّهَ يَعْلَمُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ وَأَنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اللہ تعالیٰ نے خانہ کعبہ کو حرمت والے مہینوں، قربانی کے جانوروں اور ہاروں سے مزین ہدیوں کے ساتھ تمام لوگوں کے لیے خیر و عافیت کا مرکز بنایا ہے۔ تاکہ تم جان لو کہ اللہ جانتا ہے جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے اور وہ ہر چیز کا کامل علم رکھتا ہے۔\"",
                "headingEnglish": "The Statement of Allah Most High: \"Allah has made the Ka’bah—the Sacred House—a sanctuary of well-being for all people, along with the sacred months, the sacrificial animals, and the ˹offerings decorated with˺ garlands. All this so you may know that Allah knows whatever is in the heavens and whatever is on the earth, and that He has ˹perfect˺ knowledge of everything.\"",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1530,
                "hadithNumber": "1592",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The people used to fast on 'Ashura (the tenth day of the month of Muharram) before the fasting of Ramadan was made obligatory. And on that day the Ka`ba used to be covered with a cover. When Allah made the fasting of the month of Ramadan compulsory, Allah's Messenger (ﷺ) said, \"Whoever wishes to fast (on the day of 'Ashura') may do so; and whoever wishes to leave it can do so.\"",
                "hadithUrdu": "رمضان ( کے روزے ) فرض ہونے سے پہلے مسلمان عاشوراء کا روزہ رکھتے تھے ۔ عاشوراء ہی کے دن ( جاہلیت میں ) کعبہ پر غلاف چڑھایا جاتا تھا ۔ پھر جب اللہ تعالیٰ نے رمضان فرض کر دیا تو رسول اللہ صلی اللہ علیہ وسلم نے لوگوں سے فرمایا کہ ”اب جس کا جی چاہے عاشوراء کا روزہ رکھے اور جس کا جی چاہے چھوڑ دے ۔“",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا ( دوسری سند امام بخاری رحمہ اللہ نے کہا ) اور مجھ سے محمد بن مقاتل نے بیان کیا ، انہوں نے کہا کہ مجھ سے عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا کہ ہمیں محمد بن ابی حفصہ نے خبر دی ، انہیں زہری نے ، انہیں عروہ نے اور ان سے ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے بیان فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ‏.‏ وَحَدَّثَنِي مُحَمَّدُ بْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ ـ هُوَ ابْنُ الْمُبَارَكِ ـ قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ أَبِي حَفْصَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانُوا يَصُومُونَ عَاشُورَاءَ قَبْلَ أَنْ يُفْرَضَ رَمَضَانُ، وَكَانَ يَوْمًا تُسْتَرُ فِيهِ الْكَعْبَةُ، فَلَمَّا فَرَضَ اللَّهُ رَمَضَانَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ شَاءَ أَنْ يَصُومَهُ فَلْيَصُمْهُ، وَمَنْ شَاءَ أَنْ يَتْرُكَهُ فَلْيَتْرُكْهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1531,
                "hadithNumber": "1593",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said \"The people will continue performing the Hajj and `Umra to the Ka`ba even after the appearance of Gog and Magog.\" Narrated Shu`ba extra: The Hour (Day of Judgment) will not be established till the Hajj (to the Ka`ba) is abandoned. Imam Abu Abdullah said: Qatadah heard from Abdullah and Abdullah is the father of saeed.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا بیت اللہ کا حج اور عمرہ یاجوج اور ماجوج کے نکلنے کے بعد بھی ہوتا رہے گا ۔ عبداللہ بن ابی عتبہ کے ساتھ اس حدیث کو ابان اور عمران نے قتادہ سے روایت کیا اور عبدالرحمٰن نے شعبہ کے واسطہ سے یوں بیان کیا کہ قیامت اس وقت تک قائم نہیں ہو گی جب تک بیت اللہ کا حج بند نہ ہو جائے ۔ امام بخاری رحمہ اللہ نے کہا کہ پہلی روایت زیادہ راویوں نے کی ہے اور قتادہ نے عبداللہ بن عتبہ سے سنا اور عبداللہ نے ابو سعید خدری رضی اللہ عنہ سے سنا ۔",
                "urduNarrator": "ہم سے احمد بن حفص نے بیان کیا ، کہا کہ ہم سے میرے والد نے بیان کیا ، کہا کہ ہم سے ابراہیم بن طہمان نے بیان کیا ، ان سے حجاج بن حجاج اسلمی نے ، ان سے قتادہ نے ، ان سے عبداللہ بن ابی عتبہ نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے اور ان سے",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ، حَدَّثَنَا أَبِي، حَدَّثَنَا إِبْرَاهِيمُ، عَنِ الْحَجَّاجِ بْنِ حَجَّاجٍ، عَنْ قَتَادَةَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي عُتْبَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لَيُحَجَّنَّ الْبَيْتُ وَلَيُعْتَمَرَنَّ بَعْدَ خُرُوجِ يَأْجُوجَ وَمَأْجُوجَ ‏\"‏‏.‏ تَابَعَهُ أَبَانُ وَعِمْرَانُ عَنْ قَتَادَةَ‏.‏ وَقَالَ عَبْدُ الرَّحْمَنِ عَنْ شُعْبَةَ قَالَ ‏\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى لاَ يُحَجَّ الْبَيْتُ ‏\"‏‏.‏ وَالأَوَّلُ أَكْثَرُ، سَمِعَ قَتَادَةُ عَبْدَ اللَّهِ وَعَبْدُ اللَّهِ أَبَا سَعِيدٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1532,
                "hadithNumber": "1594",
                "englishNarrator": "Narrated Abu Wail:",
                "hadithEnglish": "(One day) I sat along with Shaiba on the chair inside the Ka`ba. He (Shaiba) said, \"No doubt, `Umar رضی اللہ عنہ sat at this place and said, 'I intended not to leave any yellow (i.e. gold) or white (i.e. silver) (inside the Ka`ba) undistributed.' I said (to `Umar), 'But your two companions (i.e. The Prophet (ﷺ) and Abu Bakr رضی اللہ عنہ) did not do so.' `Umar said, They are the two persons whom I always follow.' \"",
                "hadithUrdu": "میں شیبہ کے ساتھ کعبہ میں کرسی پر بیٹھا ہوا تھا تو شیبہ نے فرمایا کہ اسی جگہ بیٹھ کر عمر رضی اللہ عنہ نے ( ایک مرتبہ ) فرمایا کہ میرا ارادہ یہ ہوتا ہے کہ کعبہ کے اندر جتنا سونا چاندی ہے اسے نہ چھوڑوں ( جسے زمانہ جاہلیت میں کفار نے جمع کیا تھا ) بلکہ سب کو نکال کر ( مسلمانوں میں ) تقسیم کر دوں ۔ میں نے عرض کی کہ آپ کے ساتھیوں ( آنحضرت صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ ) نے تو ایسا نہیں کیا ۔ انہوں نے فرمایا کہ میں بھی انہیں کی پیروی کر رہا ہوں ( اسی لیے میں اس کے ہاتھ نہیں لگاتا ) ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، کہا کہ ہم سے خالد بن حارث نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ، کہا کہ ہم سے واصل احدب نے بیان کیا اور ان سے ابووائل نے بیان کیا کہ میں شیبہ کی خدمت میں حاضر ہوا ( دوسری سند ) اور ہم سے قبیصہ نے بیان کیا ، کہا کہ ہم سے سفیان نے واصل سے بیان کیا اور ان سے ابووائل نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا وَاصِلٌ الأَحْدَبُ، عَنْ أَبِي وَائِلٍ، قَالَ جِئْتُ إِلَى شَيْبَةَ‏.‏ وَحَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ وَاصِلٍ، عَنْ أَبِي وَائِلٍ، قَالَ جَلَسْتُ مَعَ شَيْبَةَ عَلَى الْكُرْسِيِّ فِي الْكَعْبَةِ فَقَالَ لَقَدْ جَلَسَ هَذَا الْمَجْلِسَ عُمَرُ ـ رضى الله عنه ـ فَقَالَ لَقَدْ هَمَمْتُ أَنْ لاَ أَدَعَ فِيهَا صَفْرَاءَ وَلاَ بَيْضَاءَ إِلاَّ قَسَمْتُهُ‏.‏ قُلْتُ إِنَّ صَاحِبَيْكَ لَمْ يَفْعَلاَ‏.‏ قَالَ هُمَا الْمَرْآنِ أَقْتَدِي بِهِمَا‏.‏",
                "headingArabic": "كِسْوَةِ الْكَعْبَةِ",
                "headingUrdu": "غلاف کعبہ",
                "headingEnglish": "The covering of the Ka'bah",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1533,
                "hadithNumber": "1595",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"As if I were looking at him, a black person with thin legs plucking the stones of the Ka`ba one after another. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” گویا میری نظروں کے سامنے وہ پتلی ٹانگوں والا سیاہ آدمی ہے جو خانہ کعبہ کے ایک ایک پتھر کو اکھاڑ پھینکے گا ۔“",
                "urduNarrator": "ہم سے عمرو بن علی فلاس نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، کہا کہ ہم سے عبیداللہ بن اخنس نے بیان کیا ، کہا کہ مجھ سے ابن ابی ملیکہ نے بیان کیا ، ان سے عبداللہ بن عباس رضی اللہ عنہما نے اور ان سے",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ الأَخْنَسِ، حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كَأَنِّي بِهِ أَسْوَدَ أَفْحَجَ، يَقْلَعُهَا حَجَرًا حَجَرًا ‏\"‏‏.‏",
                "headingArabic": "هَدْمِ الْكَعْبَةِ",
                "headingUrdu": "خانہ کعبہ کا انہدام",
                "headingEnglish": "The demolishing of the Ka'bah",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1534,
                "hadithNumber": "1596",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Dhus-Suwaiqatain (the thin legged man) from Ethiopia will demolish the Ka`ba.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ” کعبہ کو دو پتلی پنڈلیوں والا حبشی خراب کرے گا ۔“",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے ، ان سے سعید بن مسیب نے کہ ابوہریرہ رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يُخَرِّبُ الْكَعْبَةَ ذُو السُّوَيْقَتَيْنِ مِنَ الْحَبَشَةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1535,
                "hadithNumber": "1597",
                "englishNarrator": "Narrated `Abis bin Rabi`a:",
                "hadithEnglish": "`Umar رضی اللہ عنہ came near the Black Stone and kissed it and said \"No doubt, I know that you are a stone and can neither benefit anyone nor harm anyone. Had I not seen Allah's Messenger (ﷺ) kissing you I would not have kissed you.\"",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ حجراسود کے پاس آئے اور اسے بوسہ دیا اور فرمایا ”میں خوب جانتا ہوں کہ تو صرف ایک پتھر ہے ، نہ کسی کو نقصان پہنچا سکتا ہے نہ نفع ۔ اگر رسول اللہ صلی اللہ علیہ وسلم کو تجھے بوسہ دیتے ہوئے میں نہ دیکھتا تو میں بھی کبھی تجھے بوسہ نہ دیتا ۔“",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، انہوں نے کہا کہ ہمیں سفیان ثوری نے خبر دی ، انہیں اعمش نے ، انہیں ابراہیم نے ، انہیں عابس نے ، انہیں ربیعہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَابِسِ بْنِ رَبِيعَةَ، عَنْ عُمَرَ ـ رضى الله عنه ـ أَنَّهُ جَاءَ إِلَى الْحَجَرِ الأَسْوَدِ فَقَبَّلَهُ، فَقَالَ إِنِّي أَعْلَمُ أَنَّكَ حَجَرٌ لاَ تَضُرُّ وَلاَ تَنْفَعُ، وَلَوْلاَ أَنِّي رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يُقَبِّلُكَ مَا قَبَّلْتُكَ‏.‏",
                "headingArabic": "مَا ذُكِرَ فِي الْحَجَرِ الأَسْوَدِ",
                "headingUrdu": "حجر اسود کے بارے میں کیا کہا جاتا ہے۔",
                "headingEnglish": "What is said regarding the Black Stone",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1536,
                "hadithNumber": "1598",
                "englishNarrator": "Narrated Salim that his father said:",
                "hadithEnglish": "\"Allah's Messenger (ﷺ), Usama bin Zaid, Bilal, and `Uthman bin abu Talha رضی اللہ عنہم entered the Ka`ba and then closed its door. When they opened the door I was the first person to enter (the Ka`ba). I met Bilal رضی اللہ عنہ and asked him, \"Did Allah's Messenger (ﷺ) offer a prayer inside (the Ka`ba)?\" Bilal replied in the affirmative and said, \"(The Prophet (ﷺ) offered the prayer) in between the two right pillars.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اور اسامہ بن زید اور بلال و عثمان بن ابی طلحہ رضی اللہ عنہم چاروں خانہ کعبہ کے اندر گئے اور اندر سے دروازہ بند کر لیا ۔ پھر جب دروازہ کھولا تو میں پہلا شخص تھا جو اندر گیا ۔ میری ملاقات بلال رضی اللہ عنہ سے ہوئی ۔ میں نے پوچھا کہ کیا نبی کریم صلی اللہ علیہ وسلم نے ( اندر ) نماز پڑھی ہے ؟ انہوں نے بتلایا کہ ” ہاں ! دونوں یمنی ستونوں کے درمیان آپ صلی اللہ علیہ وسلم نے نماز پڑھی ہے ۔“",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے لیث بن سعد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے سالم نے اور ان سے ان کے باپ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْبَيْتَ هُوَ وَأُسَامَةُ بْنُ زَيْدٍ، وَبِلاَلٌ، وَعُثْمَانُ بْنُ طَلْحَةَ، فَأَغْلَقُوا عَلَيْهِمْ فَلَمَّا فَتَحُوا، كُنْتُ أَوَّلَ مَنْ وَلَجَ، فَلَقِيتُ بِلاَلاً فَسَأَلْتُهُ هَلْ صَلَّى فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ، بَيْنَ الْعَمُودَيْنِ الْيَمَانِيَيْنِ‏.‏",
                "headingArabic": "إِغْلاَقِ الْبَيْتِ وَيُصَلِّي فِي أَىِّ نَوَاحِي الْبَيْتِ شَاءَ",
                "headingUrdu": "کعبہ کا دروازہ بند کرنا اور اس میں نماز پڑھنا",
                "headingEnglish": "Closing the door of the Ka'bah and Salat in it",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1537,
                "hadithNumber": "1599",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "Whenever Ibn `Umar رضی اللہ عنہما entered the Ka`ba he used to walk straight keeping the door at his back on entering, and used to proceed on till about three cubits from the wall in front of him, and then he would offer the prayer there aiming at the place where Allah's Messenger (ﷺ) prayed, as Bilal رضی اللہ عنہ had told him. There is no harm for any person to offer the prayer at any place inside the Ka`ba.",
                "hadithUrdu": "حضرت عبداللہ بن عمر رضی اللہ عنہما جب کعبہ کے اندر داخل ہوتے تو سامنے کی طرف چلتے اور دروازہ پیٹھ کی طرف چھوڑ دیتے ۔ آپ اسی طرح چلتے رہتے اور جب سامنے کی دیوار تقریباً تین ہاتھ رہ جاتی تو نماز پڑھتے تھے ۔ اس طرح آپ اس جگہ نماز پڑھنے کا اہتمام کرتے تھے جس کے متعلق بلال رضی اللہ عنہ سے معلوم ہوا تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے وہیں نماز پڑھی تھی ۔ لیکن اس میں کوئی حرج نہیں کعبہ میں جس جگہ بھی کوئی چاہے نماز پڑھ لے ۔",
                "urduNarrator": "ہم سے احمد بن محمد نے بیان کیا ، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا کہ ہمیں موسیٰ بن عقبہ نے خبر دی ، انہیں نافع نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ كَانَ إِذَا دَخَلَ الْكَعْبَةَ مَشَى قِبَلَ الْوَجْهِ حِينَ يَدْخُلُ، وَيَجْعَلُ الْبَابَ قِبَلَ الظَّهْرِ، يَمْشِي حَتَّى يَكُونَ بَيْنَهُ وَبَيْنَ الْجِدَارِ الَّذِي قِبَلَ وَجْهِهِ قَرِيبًا مِنْ ثَلاَثِ أَذْرُعٍ، فَيُصَلِّي يَتَوَخَّى الْمَكَانَ الَّذِي أَخْبَرَهُ بِلاَلٌ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى فِيهِ، وَلَيْسَ عَلَى أَحَدٍ بَأْسٌ أَنْ يُصَلِّيَ فِي أَىِّ نَوَاحِي الْبَيْتِ شَاءَ‏.‏",
                "headingArabic": "الصَّلاَةِ فِي الْكَعْبَةِ",
                "headingUrdu": "خانہ کعبہ کے اندر نماز پڑھنا",
                "headingEnglish": "Offering As-Salat (the prayers) inside the Ka'bah",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1538,
                "hadithNumber": "1600",
                "englishNarrator": "Narrated `Abdullah bin Abu `Aufa:",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) performed the `Umra. He performed Tawaf of the Ka`ba and offered two rak`at behind the Maqam (Abraham's place) and was accompanied by those who were screening him from the people.\" Somebody asked `Abdullah, \"Did Allah's Messenger (ﷺ) enter the Ka`ba?\" `Abdullah replied in the negative.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے عمرہ کیا تو آپ صلی اللہ علیہ وسلم نے کعبہ کا طواف کر کے مقام ابراہیم کے پیچھے دو رکعتیں پڑھیں ۔ آپ صلی اللہ علیہ وسلم کے ساتھ کچھ لوگ تھے جو آپ صلی اللہ علیہ وسلم کے اور لوگوں کے درمیان آڑ بنے ہوئے تھے ۔ ان میں سے ایک صاحب نے ابن ابی اوفی سے پوچھا کیا رسول اللہ صلی اللہ علیہ وسلم کعبہ کے اندر تشریف لے گئے تھے تو انہوں نے بتایا کہ ”نہیں ۔“",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے خالد بن عبداللہ نے بیان کیا ، انہیں اسماعیل بن ابی خالد نے خبر دی ، انہیں عبداللہ ابن ابی اوفی نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ وَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ، وَمَعَهُ مَنْ يَسْتُرُهُ مِنَ النَّاسِ فَقَالَ لَهُ رَجُلٌ أَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْكَعْبَةَ قَالَ لاَ‏.‏",
                "headingArabic": "مَنْ لَمْ يَدْخُلِ الْكَعْبَةَ",
                "headingUrdu": "جو خانہ کعبہ میں داخل نہیں ہوا۔",
                "headingEnglish": "Whoever did not enter the Ka'bah",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1539,
                "hadithNumber": "1601",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) came to Mecca, he refused to enter the Ka`ba with idols in it. He ordered (idols to be taken out). So they were taken out. The people took out the pictures of Abraham and Ishmael holding Azlams in their hands. Allah's Messenger (ﷺ) said, \"May Allah curse these people. By Allah, both Abraham and Ishmael never did the game of chance with Azlams.\" Then he entered the Ka`ba and said Takbir at its corners but did not offer the prayer in it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب ( فتح مکہ کے دن ) تشریف لائے تو آپ صلی اللہ علیہ وسلم نے کعبہ کے اندر جانے سے اس لیے انکار فرمایا کہ اس میں بت رکھے ہوئے تھے ۔ پھر آپ صلی اللہ علیہ وسلم نے حکم دیا اور وہ نکالے گئے ، لوگوں نے ابراہیم اور اسماعیل علیہما السلام کے بت بھی نکالے ۔ ان کے ہاتھوں میں فال نکالنے کے تیر دے رکھے تھے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ ان مشرکوں کو غارت کرے ، اللہ کی قسم انہیں اچھی طرح معلوم تھا کہ ان بزرگوں نے تیر سے فال کبھی نہیں نکالی ۔ اس کے بعد آپ صلی اللہ علیہ وسلم کعبہ کے اندر تشریف لے گئے اور چاروں طرف تکبیر کہی ۔ آپ صلی اللہ علیہ وسلم نے اندر نماز نہیں پڑھی ۔",
                "urduNarrator": "ہم سے ابومعمر نے بیان کیا ، کہا کہ ہم سے عبدالوارث نے بیان کیا ، کہا کہ ہم سے ایوب نے بیان کیا ، کہا کہ ہم سے عکرمہ نے ابن عباس رضی اللہ عنہما سے بیان کیا ، آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا قَدِمَ أَبَى أَنْ يَدْخُلَ الْبَيْتَ وَفِيهِ الآلِهَةُ فَأَمَرَ بِهَا فَأُخْرِجَتْ فَأَخْرَجُوا صُورَةَ إِبْرَاهِيمَ وَإِسْمَاعِيلَ فِي أَيْدِيهِمَا الأَزْلاَمُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ قَاتَلَهُمُ اللَّهُ أَمَا وَاللَّهِ قَدْ عَلِمُوا أَنَّهُمَا لَمْ يَسْتَقْسِمَا بِهَا قَطُّ ‏\"‏‏.‏ فَدَخَلَ الْبَيْتَ، فَكَبَّرَ فِي نَوَاحِيهِ، وَلَمْ يُصَلِّ فِيهِ‏.‏",
                "headingArabic": "مَنْ كَبَّرَ فِي نَوَاحِي الْكَعْبَةِ",
                "headingUrdu": "خانہ کعبہ کے اندر تکبیر کہنا",
                "headingEnglish": "Saying Takbir inside the Ka'bah",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1540,
                "hadithNumber": "1602",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) and his companions came to Mecca, the pagans circulated the news that a group of people were coming to them and they had been weakened by the Fever of Yathrib (Medina). So the Prophet ordered his companions to do Ramal in the first three rounds of Tawaf of the Ka`ba and to walk between the two corners (The Black Stone and Yemenite corner). The Prophet (ﷺ) did not order them to do Ramal in all the rounds of Tawaf out of pity for them.",
                "hadithUrdu": "( عمرۃ القضاء 7 ھ میں ) جب رسول اللہ صلی اللہ علیہ وسلم ( مکہ ) تشریف لائے تو مشرکوں نے کہا کہ محمد (صلی اللہ علیہ وسلم) آئے ہیں ، ان کے ساتھ ایسے لوگ آئے ہیں جنہیں یثرب ( مدینہ منورہ ) کے بخار نے کمزور کر دیا ہے ۔ اس لیے رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ طواف کے پہلے تین چکروں میں رمل ( تیز چلنا جس سے اظہار قوت ہو ) کریں اور دونوں یمانی رکنوں کے درمیان حسب معمول چلیں اور آپ صلی اللہ علیہ وسلم نے یہ حکم نہیں دیا کہ سب پھیروں میں رمل کریں اس لیے کہ ان پر آسانی ہو ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ ـ هُوَ ابْنُ زَيْدٍ ـ عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَصْحَابُهُ فَقَالَ الْمُشْرِكُونَ إِنَّهُ يَقْدَمُ عَلَيْكُمْ، وَقَدْ وَهَنَهُمْ حُمَّى يَثْرِبَ‏.‏ فَأَمَرَهُمُ النَّبِيُّ صلى الله عليه وسلم أَنْ يَرْمُلُوا الأَشْوَاطَ الثَّلاَثَةَ، وَأَنْ يَمْشُوا مَا بَيْنَ الرُّكْنَيْنِ، وَلَمْ يَمْنَعْهُ أَنْ يَأْمُرَهُمْ أَنْ يَرْمُلُوا الأَشْوَاطَ كُلَّهَا إِلاَّ الإِبْقَاءُ عَلَيْهِمْ‏.‏",
                "headingArabic": "كَيْفَ كَانَ بَدْءُ الرَّمَلِ",
                "headingUrdu": "رمل (کی قانونی حیثیت) کیسے شروع ہوئی؟",
                "headingEnglish": "How (the legality of) the Ramal started",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1541,
                "hadithNumber": "1603",
                "englishNarrator": "Narrated Salim that his father said:",
                "hadithEnglish": "I saw Allah's Messenger (ﷺ) arriving at Mecca; he kissed the Black Stone Corner first while doing Tawaf and did ramal in the first three rounds of the seven rounds (of Tawaf).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ۔ جب آپ صلی اللہ علیہ وسلم مکہ تشریف لاتے تو پہلے طواف شروع کرتے وقت حجراسود کو بوسہ دیتے اور سات چکروں میں سے پہلے تین چکروں میں رمل کرتے تھے ۔",
                "urduNarrator": "ہم سے اصبغ بن فرج نے بیان کیا ، کہا کہ مجھے عبداللہ بن وہب نے خبر دی ، انہیں یونس نے ، انہیں زہری نے ، انہیں سالم نے اور ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَصْبَغُ بْنُ الْفَرَجِ، أَخْبَرَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ يَقْدَمُ مَكَّةَ، إِذَا اسْتَلَمَ الرُّكْنَ الأَسْوَدَ أَوَّلَ مَا يَطُوفُ يَخُبُّ ثَلاَثَةَ أَطْوَافٍ مِنَ السَّبْعِ‏.‏",
                "headingArabic": "اسْتِلاَمِ الْحَجَرِ الأَسْوَدِ حِينَ يَقْدَمُ مَكَّةَ أَوَّلَ مَا يَطُوفُ وَيَرْمُلُ ثَلاَثًا",
                "headingUrdu": "حجر اسود اور رمل کا چھونا (اور چومنا)",
                "headingEnglish": "The touching (and kissing) of the Black Stone and Ramal",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1542,
                "hadithNumber": "1604",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) did Ramal in (first) three rounds (of Tawaf), and walked in the remaining four, in Hajj and Umra. Laith corroborated him and said: Katheer bin Ferqad narratedd this Hadith to me and he from Hadrat Ibn-e-Umer رضی اللہ عنہما and he from the prophet (ﷺ).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے پہلے تین چکروں میں رمل کیا اور بقیہ چار چکروں میں حسب معمول چلے ، حج اور عمرہ دونوں میں ۔ سریج کے ساتھ اس حدیث کو لیث نے روایت کیا ہے ۔ کہا کہ مجھ سے کثیر بن فرقد نے بیان کیا ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا کہ ہم سے سریج بن نعمان نے بیان کیا ، کہا کہ ہم سے فلیح نے بیان کیا ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدٌ، حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ، حَدَّثَنَا فُلَيْحٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَعَى النَّبِيُّ صلى الله عليه وسلم ثَلاَثَةَ أَشْوَاطٍ وَمَشَى أَرْبَعَةً فِي الْحَجِّ وَالْعُمْرَةِ‏.‏ تَابَعَهُ اللَّيْثُ قَالَ حَدَّثَنِي كَثِيرُ بْنُ فَرْقَدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "الرَّمَلِ فِي الْحَجِّ وَالْعُمْرَةِ",
                "headingUrdu": "حج اور عمرہ کے دوران طواف میں رمل کرنا",
                "headingEnglish": "Doing Ramal in Tawaf during Hajj and 'Umra",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1543,
                "hadithNumber": "1605",
                "englishNarrator": "Narrated Zaid bin Aslam from his father who said:",
                "hadithEnglish": "\"`Umar bin Al-Khattab رضی اللہ عنہ addressed the Corner (Black Stone) saying, 'By Allah! I know that you are a stone and can neither benefit nor harm. Had I not seen the Prophet (ﷺ) touching (and kissing) you, I would never have touched (and kissed) you.' Then he kissed it and said, 'There is no reason for us to do Ramal (in Tawaf) except that we wanted to show off before the pagans, and now Allah has destroyed them.' `Umar added, '(Nevertheless), the Prophet (ﷺ) did that and we do not want to leave it (i.e. Ramal).'",
                "hadithUrdu": "عمر بن خطاب رضی اللہ عنہ نے حجراسود کو خطاب کر کے فرمایا ” بخدا مجھے خوب معلوم ہے کہ تو صرف ایک پتھر ہے جو نہ کوئی نفع پہنچا سکتا ہے نہ نقصان اور اگر میں نے رسول اللہ صلی اللہ علیہ وسلم کو تجھے بوسہ دیتے نہ دیکھا ہوتا تو میں کبھی بوسہ نہ دیتا ۔“ اس کے بعد آپ نے بوسہ دیا ۔ پھر فرمایا ” اور اب ہمیں رمل کی بھی کیا ضرورت ہے ۔ ہم نے اس کے ذریعہ مشرکوں کو اپنی قوت دکھائی تھی تو اللہ نے ان کو تباہ کر دیا ۔“ پھر فرمایا ” جو عمل رسول اللہ صلی اللہ علیہ وسلم نے کیا ہے اسے اب چھوڑنا بھی ہم پسند نہیں کرتے ۔“",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا کہ ہمیں محمد بن جعفر نے خبر دی ، کہا کہ مجھے زید بن اسلم نے خبر دی ، انہیں ان کے والد نے کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ قَالَ لِلرُّكْنِ أَمَا وَاللَّهِ إِنِّي لأَعْلَمُ أَنَّكَ حَجَرٌ لاَ تَضُرُّ وَلاَ تَنْفَعُ، وَلَوْلاَ أَنِّي رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم اسْتَلَمَكَ مَا اسْتَلَمْتُكَ‏.‏ فَاسْتَلَمَهُ، ثُمَّ قَالَ فَمَا لَنَا وَلِلرَّمَلِ إِنَّمَا كُنَّا رَاءَيْنَا بِهِ الْمُشْرِكِينَ، وَقَدْ أَهْلَكَهُمُ اللَّهُ‏.‏ ثُمَّ قَالَ شَىْءٌ صَنَعَهُ النَّبِيُّ صلى الله عليه وسلم فَلاَ نُحِبُّ أَنْ نَتْرُكَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1544,
                "hadithNumber": "1606",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"I have never missed the touching of these two stones of Ka`ba (the Black Stone and the Yemenite Corner) both in the presence and the absence of crowds, since I saw the Prophet (ﷺ) touching them.\" I asked Nafi`: \"Did Ibn `Umar رضی اللہ عنہما use to walk between the two Corners?\" Nafi` replied, \"He used to walk in order that it might be easy for him to touch it (the Corner Stone).\"",
                "hadithUrdu": "جب سے میں نے رسول اللہ صلی اللہ علیہ وسلم کو ان دونوں رکن یمانی کو چومتے ہوئے دیکھا میں نے بھی اس کے چومنے کو خواہ سخت حالات ہوں یا نرم نہیں چھوڑا ۔ میں نے نافع سے پوچھا کیا ابن عمر رضی اللہ عنہما ان دونوں یمنی رکنوں کے درمیان معمول کے مطابق چلتے تھے ؟ تو انہوں نے بتایا کہ آپ معمول کے مطابق اس لیے چلتے تھے تاکہ حجراسود کو چھونے میں آسانی رہے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، ان سے یحییٰ قطان نے بیان کیا ، ان سے عبیداللہ عمری نے ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا ۔",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ مَا تَرَكْتُ اسْتِلاَمَ هَذَيْنِ الرُّكْنَيْنِ فِي شِدَّةٍ وَلاَ رَخَاءٍ، مُنْذُ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَسْتَلِمُهُمَا‏.‏ قُلْتُ لِنَافِعٍ أَكَانَ ابْنُ عُمَرَ يَمْشِي بَيْنَ الرُّكْنَيْنِ قَالَ إِنَّمَا كَانَ يَمْشِي لِيَكُونَ أَيْسَرَ لاِسْتِلاَمِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1545,
                "hadithNumber": "1607",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "In his Last Hajj the Prophet (ﷺ) performed Tawaf of the Ka`ba riding a camel and touched the Black stone with his stick. Darawardi has corroborated him from Zohri's nephnew and he from his uncle.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے حجتہ الوداع کے موقع پر اپنی اونٹنی پر طواف کیا تھا اور آپ صلی اللہ علیہ وسلم حجراسود کا استلام ایک چھڑی کے ذریعہ کر رہے تھے.اور یونس کے ساتھ اس حدیث کو دراوردی نے زہری کے بھتیجے سے روایت کیا اور انہوں نے اپنے چچا ( زہری ) سے ۔",
                "urduNarrator": "ہم سے احمد بن صالح اور یحییٰ بن سلیمان نے بیان کیا ، انہوں نے بیان کیا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، کہا کہ ہمیں یونس نے ابن شہاب سے خبر دی ، انہیں عبیداللہ بن عبداللہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، وَيَحْيَى بْنُ سُلَيْمَانَ، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ طَافَ النَّبِيُّ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ عَلَى بَعِيرٍ، يَسْتَلِمُ الرُّكْنَ بِمِحْجَنٍ‏.‏ تَابَعَهُ الدَّرَاوَرْدِيُّ عَنِ ابْنِ أَخِي الزُّهْرِيِّ عَنْ عَمِّهِ‏.‏",
                "headingArabic": "اسْتِلاَمِ الرُّكْنِ بِالْمِحْجَنِ",
                "headingUrdu": "حجر اسود کو چھڑی سے چھونا۔",
                "headingEnglish": "Touching the Black Stone with a stick",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1546,
                "hadithNumber": "1608",
                "englishNarrator": "Narrator Abu Ash-Sha'tha",
                "hadithEnglish": "\"Who keeps away from some portion of the Ka'bah?\" Mu'awiya رضی اللہ عنہ used to touch the four corners of the Ka'bah, Ibn 'Abbas رضی اللہ عنہما said to him, \"These two corners (the one facing the Hijr) are not to be touched.\" Mu'awiya رضی اللہ عنہ said, \"Nothing is untouchable in the Ka'bah.\" And Ibn Az-Zubair رضی اللہ عنہما used to touch all the corners of the Ka'bah.",
                "hadithUrdu": "بیت اللہ کے کسی بھی حصہ سے بھلا کون پرہیز کر سکتا ہے ۔ اور معاویہ رضی اللہ عنہ چاروں رکنوں کا استلام کرتے تھے ، اس پر حضرت عبداللہ بن عباس رضی اللہ عنہما نے ان سے کہا کہ ہم ان دو ارکان شامی اور عراقی کا استلام نہیں کرتے تو معاویہ رضی اللہ عنہ نے فرمایا کہ بیت اللہ کا کوئی جزء ایسا نہیں جسے چھوڑ دیا جائے اور عبداللہ بن زبیر رضی اللہ عنہما بھی تمام ارکان کا استلام کرتے تھے ۔",
                "urduNarrator": "اور محمد بن بکر نے کہا کہ ہمیں ابن جریج نے خبر دی ، انہوں نے کہا مجھ کو عمرو بن دینار نے خبر دی کہ ابوالشعثاء نے کہا",
                "hadithArabic": "وَقَالَ مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، عَنْ أَبِي الشَّعْثَاءِ، أَنَّهُ قَالَ وَمَنْ يَتَّقِي شَيْئًا مِنَ الْبَيْتِ، وَكَانَ مُعَاوِيَةُ يَسْتَلِمُ الأَرْكَانَ، فَقَالَ لَهُ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ إِنَّهُ لاَ يُسْتَلَمُ هَذَانِ الرُّكْنَانِ‏.‏ فَقَالَ لَيْسَ شَىْءٌ مِنَ الْبَيْتِ مَهْجُورًا، وَكَانَ ابْنُ الزُّبَيْرِ ـ رضى الله عنهما ـ يَسْتَلِمُهُنَّ كُلَّهُنَّ‏.‏",
                "headingArabic": "مَنْ لَمْ يَسْتَلِمْ إِلاَّ الرُّكْنَيْنِ الْيَمَانِيَيْنِ",
                "headingUrdu": "کعبہ کے دو یمنی گوشے",
                "headingEnglish": "The two Yemenite Corners of the Ka'bah",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1547,
                "hadithNumber": "1609",
                "englishNarrator": "Narrated Salim bin `Abdullah that his father said:",
                "hadithEnglish": "\"I have not seen the Prophet (ﷺ) touching except the two Yemenite Corners (i.e. the ones facing Yemen).\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کو صرف دونوں یمانی ارکان کا استلام کرتے دیکھا ۔",
                "urduNarrator": "ہم سے ابوالولید طیالسی نے بیان کیا ، ان سے لیث بن سعد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے سالم بن عبداللہ نے ، ان سے ان کے والد حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ ـ رضى الله عنهما ـ قَالَ لَمْ أَرَ النَّبِيَّ صلى الله عليه وسلم يَسْتَلِمُ مِنَ الْبَيْتِ إِلاَّ الرُّكْنَيْنِ الْيَمَانِيَيْنِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1548,
                "hadithNumber": "1610",
                "englishNarrator": "Narrated Zaid bin Aslam that his father said:",
                "hadithEnglish": "\"I saw `Umar bin Al-Khattab رضی اللہ عنہ kissing the Black Stone and he then said, (to it) 'Had I not seen Allah's Apostle kissing you, (stone) I would not have kissed you.' \"",
                "hadithUrdu": "حضرت عمر بن خطاب رضی اللہ عنہ نے حجراسود کو بوسہ دیا اور پھر فرمایا کہ ” اگر میں رسول اللہ صلی اللہ علیہ وسلم کو تجھے بوسہ دیتے نہ دیکھتا تو میں کبھی تجھے بوسہ نہ دیتا ۔“",
                "urduNarrator": "ہم سے احمد بن سنان نے بیان کیا ، ان سے یزید بن ہارون نے بیان کیا ، انہیں ورقاء نے خبر دی ، انہیں زید بن اسلم نے خبر دی ، ان سے ان کے والد نے بیان کیا کہ میں نے دیکھا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا وَرْقَاءُ، أَخْبَرَنَا زَيْدُ بْنُ أَسْلَمَ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ قَبَّلَ الْحَجَرَ وَقَالَ لَوْلاَ أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَبَّلَكَ مَا قَبَّلْتُكَ‏.‏",
                "headingArabic": "تَقْبِيلِ الْحَجَرِ",
                "headingUrdu": "حجر اسود کو چومنا",
                "headingEnglish": "To kiss the Black Stone",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1549,
                "hadithNumber": "1611",
                "englishNarrator": "Narrated Az-Zubair bin 'Arabi:",
                "hadithEnglish": "A man asked Ibn `Umar رضی اللہ عنہما about the touching of the Black Stone. Ibn `Umar said, \"I saw Allah's Messenger (ﷺ) touching and kissing it.\" The questioner said, \"But if there were a throng (much rush) round the Ka`ba and the people overpowered me, (what would I do?)\" He replied angrily, \"Stay in Yemen (as that man was from Yemen). I saw Allah's Messenger (ﷺ) touching and kissing it.\"",
                "hadithUrdu": "ایک شخص نے ابن عمر رضی اللہ عنہما سے حجراسود کے بوسہ دینے کے متعلق پوچھا تو انہوں نے بتلایا کہ ” میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس کو بوسہ دیتے دیکھا ہے ۔“ اس پر اس شخص نے کہا اگر ہجوم ہو جائے اور میں عاجز ہو جاؤں تو کیا کروں ؟ ابن عمر رضی اللہ عنہما نے فرمایا کہ ” اس اگر وگر کو یمن میں جا کر رکھو میں نے تو رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ اس کو بوسہ دیتے تھے ۔“",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے زبیر بن عربی نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادٌ، عَنِ الزُّبَيْرِ بْنِ عَرَبِيٍّ، قَالَ سَأَلَ رَجُلٌ ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنِ اسْتِلاَمِ الْحَجَرِ،‏.‏ فَقَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَسْتَلِمُهُ وَيُقَبِّلُهُ‏.‏ قَالَ قُلْتُ أَرَأَيْتَ إِنْ زُحِمْتُ أَرَأَيْتَ إِنْ غُلِبْتُ قَالَ اجْعَلْ أَرَأَيْتَ بِالْيَمَنِ، رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَسْتَلِمُهُ وَيُقَبِّلُهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1550,
                "hadithNumber": "1612",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) performed Tawaf of the Ka`ba while riding a camel, and whenever he came in front of the Corner, he pointed towards it (with something).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک اونٹنی پر ( سوار ہو کر کعبہ کا ) طواف کر رہے تھے اور جب بھی آپ صلی اللہ علیہ وسلم حجراسود کے سامنے پہنچتے تو کسی چیز سے اس کی طرف اشارہ کرتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ ہم سے عبدالوہاب نے بیان کیا ، کہا کہ ہم سے خالد حذاء نے عکرمہ سے بیان کیا ، ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ طَافَ النَّبِيُّ صلى الله عليه وسلم بِالْبَيْتِ عَلَى بَعِيرٍ، كُلَّمَا أَتَى عَلَى الرُّكْنِ أَشَارَ إِلَيْهِ‏.‏",
                "headingArabic": "مَنْ أَشَارَ إِلَى الرُّكْنِ إِذَا أَتَى عَلَيْهِ",
                "headingUrdu": "جس نے کونے کی طرف اشارہ کیا (سیاہ پتھر)",
                "headingEnglish": "Whoever pointed towards the Corner (Black Stone)",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1551,
                "hadithNumber": "1613",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) performed Tawaf of the Ka`ba riding a camel, and every time he came in front of the Corner (having the Black Stone), he pointed towards it with something he had with him and said Takbir. Ibrahim bin Tehman corroborated him from Khalid Al-Khadhdha.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے بیت اللہ کا طواف ایک اونٹنی پر سوار رہ کر کیا ۔ جب بھی آپ صلی اللہ علیہ وسلم حجراسود کے سامنے پہنچتے تو کسی چیز سے اس کی طرف اشارہ کرتے اور تکبیر کہتے ۔ خالد طحان کے ساتھ اس حدیث کو ابراہیم بن طہمان نے بھی خالد حذاء سے روایت کیا ہے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے خالد بن عبداللہ نے بیان کیا ، کہا کہ ہم سے خالد حذاء نے بیان کیا ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ طَافَ النَّبِيُّ صلى الله عليه وسلم بِالْبَيْتِ عَلَى بَعِيرٍ، كُلَّمَا أَتَى الرُّكْنَ أَشَارَ إِلَيْهِ بِشَىْءٍ كَانَ عِنْدَهُ وَكَبَّرَ‏.‏ تَابَعَهُ إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ خَالِدٍ الْحَذَّاءِ‏.‏",
                "headingArabic": "التَّكْبِيرِ عِنْدَ الرُّكْنِ",
                "headingUrdu": "گوشہ کے سامنے تکبیر کہنا",
                "headingEnglish": "To say Takbir in front of the Corner (having the Black Stone)",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1526,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=61",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=59",
                "label": "59",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=60",
                "label": "60",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=61",
                "label": "61",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=62",
                "label": "62",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=63",
                "label": "63",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=64",
                "label": "64",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=65",
                "label": "65",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=63",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=63",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=61",
        "to": 1550,
        "total": 40465
    }
}