{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 52,
        "data": [
            {
                "id": 1276,
                "hadithNumber": "1326",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) came to a grave and the people said, 'He or she was buried yesterday.' \" Ibn `Abbas\r\nرضی اللہ عنہما added, \"We aligned behind the Prophet (ﷺ) and he led the funeral prayer of the deceased.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ایک قبر پر تشریف لائے ۔ صحابہ نے عرض کیا کہ اس میت کو گزشتہ رات دفن کیا گیا ہے ۔ ( صاحب قبر مرد تھا یا عورت تھی ) ابن عباس رضی اللہ عنہما نے کہا کہ پھر ہم نے آپ صلی اللہ علیہ وسلم کے پیچھے صف بندی کی اور آپ صلی اللہ علیہ وسلم نے نماز جنازہ پڑھائی ۔",
                "urduNarrator": "ہم سے یعقوب بن ابراہیم نے بیان کیا ‘ انہوں نے کہا ہم سے یحییٰ بن ابی بکیر نے ‘ انہوں نے کہا ہم سے زائدہ نے بیان کیا ‘ ان سے ابواسحاق شیبانی نے ‘ ان سے عامر نے ‘ ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا زَائِدَةُ، حَدَّثَنَا أَبُو إِسْحَاقَ الشَّيْبَانِيُّ، عَنْ عَامِرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم قَبْرًا، فَقَالُوا هَذَا دُفِنَ، أَوْ دُفِنَتِ الْبَارِحَةَ‏.‏ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ فَصَفَّنَا خَلْفَهُ ثُمَّ صَلَّى عَلَيْهَا‏.‏",
                "headingArabic": "صَلاَةِ الصِّبْيَانِ مَعَ النَّاسِ عَلَى الْجَنَائِزِ",
                "headingUrdu": "مردوں کے ساتھ لڑکوں کی طرف سے نماز جنازہ پڑھنا",
                "headingEnglish": "The offering of the funeral salat (prayer) by boys along with the men",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1277,
                "hadithNumber": "1327, 1328",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) informed about the news of the death of An-Najash (King of Ethiopia) on the day he expired. He said, \"Ask Allah's forgiveness for your brother. \"\r\nHadrat Saeed bin Musayyab reports that Hadrat Abu Huraira رضی اللہ عنہ : The Prophet (ﷺ) made them align in rows at the Musalla and said four Takbir.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے حبشہ کے نجاشی کی وفات کی خبر دی ‘ اسی دن جس دن ان کا انتقال ہوا تھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے بھائی کے لیے خدا سے مغفرت چاہو ۔\r\nاور ابن شہاب سے یوں بھی روایت ہے انہوں نے کہا کہ مجھ سے سعید بن مسیب نے بیان کیا کہ ابوہریرہ رضی اللہ عنہ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے عیدگاہ میں صف بندی کرائی پھر ( نماز جنازہ کی ) چار تکبیریں کہیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ انہوں نے کہا ہم سے لیث نے بیان کیا ‘ ان سے عقیل نے بیان کیا ‘ ان سے ابن شہاب نے بیان کیا ‘ ان سے سعید بن مسیب اور ابوسلمہ نے بیان کیا اور ان دونوں حضرات سے ابوہریرہ رضی اللہ عنہ نے روایت کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ أَنَّهُمَا حَدَّثَاهُ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَعَى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم النَّجَاشِيَّ صَاحِبَ الْحَبَشَةِ، يَوْمَ الَّذِي مَاتَ فِيهِ فَقَالَ ‏ \"‏ اسْتَغْفِرُوا لأَخِيكُمْ ‏\"‏‏. وَعَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم صَفَّ بِهِمْ بِالْمُصَلَّى فَكَبَّرَ عَلَيْهِ أَرْبَعًا‏.‏",
                "headingArabic": "الصَّلاَةِ عَلَى الْجَنَائِزِ بِالْمُصَلَّى وَالْمَسْجِدِ",
                "headingUrdu": "مصلے اور مسجد میں نماز جنازہ پڑھنا",
                "headingEnglish": "To offer the funeral Salat (prayer) at the Musalla and at the Mosque",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1278,
                "hadithNumber": "1329",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Jew brought to the Prophet (ﷺ) a man and a woman from amongst them who have committed (adultery) illegal sexual intercourse. He ordered both of them to be stoned (to death), near the place of offering the funeral prayers beside the mosque.\"",
                "hadithUrdu": "یہود نبی کریم صلی اللہ علیہ وسلم کے حضور میں اپنے ہم مذہب ایک مرد اور عورت کا جنہوں نے زنا کیا تھا ‘ مقدمہ لے کر آئے ۔ آنحضور صلی اللہ علیہ وسلم کے حکم سے مسجد کے نزدیک نماز جنازہ پڑھنے کی جگہ کے پاس انہیں سنگسار کر دیا گیا ۔",
                "urduNarrator": "ہم سے ابراہیم بن منذرنے بیان کیا ‘ ان سے ابو ضمرہ نے بیان کیا ‘ انہوں نے کہا ہم سے موسیٰ بن عقبہ نے بیان کیا ‘ ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ الْيَهُودَ، جَاءُوا إِلَى النَّبِيِّ صلى الله عليه وسلم بِرَجُلٍ مِنْهُمْ وَامْرَأَةٍ زَنَيَا، فَأَمَرَ بِهِمَا فَرُجِمَا قَرِيبًا مِنْ مَوْضِعِ الْجَنَائِزِ عِنْدَ الْمَسْجِدِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1279,
                "hadithNumber": "1330",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"The Prophet (ﷺ) in his fatal illness said, 'Allah cursed the Jews and the Christians because they took the graves of their Prophets as places for praying.\"' Aisha رضی اللہ عنہا  added, \"Had it not been for that, the grave of the Prophet (ﷺ) would have been made prominent but I am afraid it might be taken (as a) place for praying.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اپنے مرض وفات میں فرمایا کہ یہود اور نصاریٰ پر اللہ کی لعنت ہو کہ انہوں نے اپنے انبیاء کی قبروں کو مساجد بنا لیا ۔ حضرت عائشہ رضی اللہ عنہا نے کہا کہ اگر ایسا ڈر نہ ہوتا تو آپ صلی اللہ علیہ وسلم کی قبر کھلی رہتی ( اور حجرہ میں نہ ہوتی ) کیونکہ مجھے ڈر اس کا ہے کہ کہیں آپ صلی اللہ علیہ وسلم کی قبر بھی مسجد نہ بنا لی جائے ۔",
                "urduNarrator": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا ‘ ان سے شیبان نے ‘ ان سے ہلال وزان نے ‘ ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ هِلاَلٍ ـ هُوَ الْوَزَّانُ ـ عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ ‏ \"‏ لَعَنَ اللَّهُ الْيَهُودَ وَالنَّصَارَى، اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسْجِدًا ‏\"‏‏.‏ قَالَتْ وَلَوْلاَ ذَلِكَ لأَبْرَزُوا قَبْرَهُ غَيْرَ أَنِّي أَخْشَى أَنْ يُتَّخَذَ مَسْجِدًا‏.‏",
                "headingArabic": "مَا يُكْرَهُ مِنِ اتِّخَاذِ الْمَسَاجِدِ عَلَى الْقُبُورِ",
                "headingUrdu": "قبروں پر عبادت گاہیں (مسجدیں) قائم کرنا کیا ناپسندیدہ ہے؟",
                "headingEnglish": "What is disliked of establishing places of worship (mosques) over the graves,",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1280,
                "hadithNumber": "1331",
                "englishNarrator": "Narrated Samura bin Jundab رضی اللہ عنہ :",
                "hadithEnglish": "I offered the funeral prayer behind the Prophet (ﷺ) for a woman who had died during childbirth and he stood up by the middle of the coffin.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کی اقتداء میں ایک عورت ( ام کعب ) کی نماز جنازہ پڑھی تھی جس کا نفاس میں انتقال ہو گیا تھا ۔ رسول اللہ صلی اللہ علیہ وسلم اس کی کمر کے مقابل کھڑے ہوئے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ۔ کہا کہ ہم سے یزیدین زریع نے ‘ ان سے حسین معلم نے ‘ ان سے عبداللہ بن بریدہ نے ‘ ان سے سمرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا حُسَيْنٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ سَمُرَةَ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ وَرَاءَ النَّبِيِّ صلى الله عليه وسلم عَلَى امْرَأَةٍ مَاتَتْ فِي نِفَاسِهَا، فَقَامَ عَلَيْهَا وَسَطَهَا‏.‏",
                "headingArabic": "الصَّلاَةِ عَلَى النُّفَسَاءِ إِذَا مَاتَتْ فِي نِفَاسِهَا",
                "headingUrdu": "اس عورت کی نماز جنازہ پڑھنا جو دورانِ ولادت فوت ہو گئی (بچے کی)",
                "headingEnglish": "The offering of the funeral Salat of a woman who died during the delivery (of a child)",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1281,
                "hadithNumber": "1332",
                "englishNarrator": "Narrated Samura bin Jundab رضی اللہ عنہ :",
                "hadithEnglish": "I offered the funeral prayer behind the Prophet (ﷺ) for a woman who had died during childbirth and he stood up by the middle of the coffin.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کے پیچھے ایک عورت کی نماز جنازہ پڑھی تھی جس کا زچگی کی حالت میں انتقال ہو گیا تھا ۔ آپ صلی اللہ علیہ وسلم اس کے بیچ میں کھڑے ہوئے ۔",
                "urduNarrator": "ہم سے عمران بن میسرہ نے بیان کیا ‘ کہا کہ ہم سے عبدالوارث نے بیان کیا ‘ ان سے حسین نے بیان کیا اور ان سے ابن بریدہ نے کہ ہم سے سمرہ بن جندب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا حُسَيْنٌ، عَنِ ابْنِ بُرَيْدَةَ، حَدَّثَنَا سَمُرَةُ بْنُ جُنْدُبٍ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ وَرَاءَ النَّبِيِّ صلى الله عليه وسلم عَلَى امْرَأَةٍ مَاتَتْ فِي نِفَاسِهَا فَقَامَ عَلَيْهَا وَسَطَهَا‏.‏",
                "headingArabic": "أَيْنَ يَقُومُ مِنَ الْمَرْأَةِ وَالرَّجُلِ",
                "headingUrdu": "عورت یا مرد کی نماز جنازہ پڑھاتے وقت امام کو کہاں کھڑا ہونا چاہیے؟",
                "headingEnglish": "Where should the Imam stand while leading the funeral prayer of a female or a male?",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1282,
                "hadithNumber": "1333",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) informed about the news of the death of An-Najash on the day he died. He went out with us to the Musalla and we aligned in rows and he said four Takbirs for An-Najashi's funeral prayer.",
                "hadithUrdu": "نجاشی کا جس دن انتقال ہوا اسی دن رسول اللہ صلی اللہ علیہ وسلم نے ان کی وفات کی خبر دی اور آپ صلی اللہ علیہ وسلم صحابہ کے ساتھ عیدگاہ گئے ۔ پھر آپ صلی اللہ علیہ وسلم نے صف بندی کرائی اور چار تکبیریں کہیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ‘ کہا کہ ہمیں امام مالک رحمہ اللہ نے خبر دی ‘ انہیں ابن شہاب نے ‘ انہیں سعید بن مسیب نے ‘ انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَعَى النَّجَاشِيَّ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ، وَخَرَجَ بِهِمْ إِلَى الْمُصَلَّى فَصَفَّ بِهِمْ، وَكَبَّرَ عَلَيْهِ أَرْبَعَ تَكْبِيرَاتٍ‏.‏",
                "headingArabic": "التَّكْبِيرِ عَلَى الْجَنَازَةِ أَرْبَعًا",
                "headingUrdu": "نماز جنازہ میں چار تکبیریں ہیں۔",
                "headingEnglish": "There are four Takbir's in the funeral prayers",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1283,
                "hadithNumber": "1334",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) offered the funeral prayer of As-Hama An-Najash and said four Takbir. Yazid bin Haroon Wasti and Abd al-Samad have copied the name Asahmah from Salim and Abd al-Samad followed it.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اصحمہ نجاشی کی نماز جنازہ پڑھائی تو چار تکبیریں کہیں ۔ یزید بن ہارون واسطی اور عبدالصمد نے سلیم سے اصحمہ نام نقل کیا ہے اور عبدالصمد نے اس کی متابعت کی ہے ۔",
                "urduNarrator": "ہم سے محمد بن سنان نے بیان کیا ‘ کہا کہ ہم سے سلیم بن حیان نے بیان کیا ‘ کہا کہ ہم سے سعید بن میناء نے بیان کیا اور ان سے جابر رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ، حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ، عَنْ جَابِرٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى عَلَى أَصْحَمَةَ النَّجَاشِيِّ فَكَبَّرَ أَرْبَعًا‏.‏ وَقَالَ يَزِيدُ بْنُ هَارُونَ وَعَبْدُ الصَّمَدِ عَنْ سَلِيمٍ أَصْحَمَةَ‏.‏ وَتَابَعَهُ عَبْدُ الصَّمَدِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1284,
                "hadithNumber": "1335",
                "englishNarrator": "Narrated Talha bin `Abdullah bin `Auf:",
                "hadithEnglish": "I offered the funeral prayer behind Ibn `Abbas رضی اللہ عنہما and he recited Al-Fatiha and said, \"You should know that it (i.e. recitation of Al-Fatiha) is the tradition of the Prophet (ﷺ) Muhammad.",
                "hadithUrdu": "میں نے ابن عباس رضی اللہ عنہما کے پیچھے نماز جنازہ پڑھی تو آپ نے سورۃ الفاتحہ ( ذرا پکار کر ) پڑھی ۔ پھر فرمایا کہ تمہیں معلوم ہونا چاہیے کہ یہی طریقہ نبوی ہے ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ۔ کہا کہ ہم سے غندر ( محمد بن جعفر ) نے بیان کیا ‘ کہا کہ ہم سے شعبہ نے بیان کیا ‘ ان سے سعد بن ابراہیم نے اور ان سے طلحہ نے کہا کہ میں نے ابن عباس رضی اللہ عنہما کی اقتداء میں نماز ( جنازہ ) پڑھی ( دوسری سند ) ہم سے محمد بن کثیر نے بیان کیا ‘ کہا کہ ہمیں سفیان ثوری نے خبر دی ‘ انہیں سعد بن ابراہیم نے ‘ انہیں طلحہ بن عبداللہ بن عوف نے ‘ انہوں نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدٍ، عَنْ طَلْحَةَ، قَالَ صَلَّيْتُ خَلْفَ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ، قَالَ صَلَّيْتُ خَلْفَ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَلَى جَنَازَةٍ فَقَرَأَ بِفَاتِحَةِ الْكِتَابِ قَالَ لِيَعْلَمُوا أَنَّهَا سُنَّةٌ‏.‏",
                "headingArabic": "قِرَاءَةِ فَاتِحَةِ الْكِتَابِ عَلَى الْجَنَازَةِ",
                "headingUrdu": "نماز جنازہ میں سورہ فاتحہ کی تلاوت",
                "headingEnglish": "The recitation of Surah Al-Fathiha in the funeral Salat",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1285,
                "hadithNumber": "1336",
                "englishNarrator": "Narrated Ash-Shu`bi:",
                "hadithEnglish": "\"I was told by a man who had passed with the Prophet (ﷺ) by a grave that was separate from the other graves that he (the Prophet (ﷺ) ) led them in the prayer and they prayed behind him.\" I said, \"O Abu `Amr! Who narrated that to you?\" He replied, \"Ibn `Abbas رضی اللہ عنہما .\"",
                "hadithUrdu": "مجھے اس صحابی نے خبر دی جو نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک الگ تھلگ قبر سے گزرے تھے ۔ قبر پر آپ صلی اللہ علیہ وسلم امام بنے اور صحابہ نے آپ صلی اللہ علیہ وسلم کے پیچھے نماز جنازہ پڑھی ۔ شیبانی نے کہا کہ میں نے شعبی سے پوچھا کہ ابوعمرو ! یہ آپ سے کس صحابی نے بیان کیا تھا تو انہوں نے بتلایا کہ ابن عباس رضی اللہ عنہما نے ۔",
                "urduNarrator": "ہم سے حجاج بن منہال نے بیان کیا ‘ کہا کہ ہم سے شعبہ نے بیان کیا ‘ کہا کہ مجھ سے سلیمان شیبانی نے بیان کیا ‘ کہا کہ میں نے شعبی سے سنا ‘ انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي سُلَيْمَانُ الشَّيْبَانِيُّ، قَالَ سَمِعْتُ الشَّعْبِيَّ، قَالَ أَخْبَرَنِي مَنْ، مَرَّ مَعَ النَّبِيِّ صلى الله عليه وسلم عَلَى قَبْرٍ مَنْبُوذٍ فَأَمَّهُمْ وَصَلَّوْا خَلْفَهُ‏.‏ قُلْتُ مَنْ حَدَّثَكَ هَذَا يَا أَبَا عَمْرٍو قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ‏.‏",
                "headingArabic": "الصَّلاَةِ عَلَى الْقَبْرِ بَعْدَ مَا يُدْفَنُ",
                "headingUrdu": "میت کی تدفین کے بعد قبر پر نماز جنازہ پڑھنا",
                "headingEnglish": "To offer the (funeral) Salat on the grave after the burial of the deceased",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1286,
                "hadithNumber": "1337",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "A black person, a male or a female used to clean the Mosque and then died. The Prophet (p.b.u.h) did not know about it . One day the Prophet (ﷺ) remembered him and said, \"What happened to that person?\" The people replied, \"O Allah's Messenger (ﷺ)! He died.\" He said, \"Why did you not inform me?\" They said, \"His story was so and so (i.e. regarded him as insignificant).\" He said, \"Show me his grave.\" He then went to his grave and offered the funeral prayer.",
                "hadithUrdu": "کالے رنگ کا ایک مرد یا ایک کالی عورت مسجد کی خدمت کیا کرتی تھیں ‘ ان کی وفات ہو گئی لیکن نبی کریم صلی اللہ علیہ وسلم کو ان کی وفات کی خبر کسی نے نہیں دی ۔ ایک دن آپ صلی اللہ علیہ وسلم نے خود یاد فرمایا کہ وہ شخص دکھائی نہیں دیتا ۔ صحابہ نے کہا کہ یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! ان کا تو انتقال ہو گیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر تم نے مجھے خبر کیوں نہیں دی ؟ صحابہ نے عرض کی کہ یہ وجوہ تھیں ( اس لیے آپ کو تکلیف نہیں دی گئی ) گویا لوگوں نے ان کو حقیر جان کر قابل توجہ نہیں سمجھا لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ چلو مجھے ان کی قبر بتا دو ۔ چنانچہ آپ صلی اللہ علیہ وسلم اس کی قبر پر تشریف لائے اور اس پر نماز جنازہ پڑھی ۔",
                "urduNarrator": "ہم سے محمد بن فضل نے کیا ‘ انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا ‘ ان سے ثابت نے بیان کیا ‘ ان سے ابورافع نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ أَسْوَدَ ـ رَجُلاً أَوِ امْرَأَةً ـ كَانَ يَقُمُّ الْمَسْجِدَ فَمَاتَ، وَلَمْ يَعْلَمِ النَّبِيُّ صلى الله عليه وسلم بِمَوْتِهِ فَذَكَرَهُ ذَاتَ يَوْمٍ فَقَالَ ‏\"‏ مَا فَعَلَ ذَلِكَ الإِنْسَانُ ‏\"‏‏.‏ قَالُوا مَاتَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ أَفَلاَ آذَنْتُمُونِي ‏\"‏‏.‏ فَقَالُوا إِنَّهُ كَانَ كَذَا وَكَذَا قِصَّتَهُ‏.‏ قَالَ فَحَقَرُوا شَأْنَهُ‏.‏ قَالَ ‏\"‏ فَدُلُّونِي عَلَى قَبْرِهِ ‏\"‏‏.‏ فَأَتَى قَبْرَهُ فَصَلَّى عَلَيْهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1287,
                "hadithNumber": "1338",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"When a human being is laid in his grave and his companions return and he even hears their foot steps, two angels come to him and make him sit and ask him: What did you use to say about this man, Muhammad ? He will say: I testify that he is Allah's slave and His Apostle. Then it will be said to him, 'Look at your place in the Hell-Fire. Allah has given you a place in Paradise instead of it.' \" The Prophet (ﷺ) added, \"The dead person will see both his places. But a non-believer or a hypocrite will say to the angels, 'I do not know, but I used to say what the people used to say! It will be said to him, 'Neither did you know nor did you take the guidance (by reciting the Qur'an).' Then he will be hit with an iron hammer between his two ears, and he will cry and that cry will be heard by whatever approaches him except human beings and jinns.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ  آدمی جب قبر میں رکھا جاتا ہے اور دفن کر کے اس کے لوگ پیٹھ موڑ کر رخصت ہوتے ہیں تو وہ ان کے جوتوں کی آواز سنتا ہے ۔ پھر دو فرشتے آتے ہیں اسے بٹھاتے ہیں اور پوچھتے ہیں کہ اس شخص ( محمد صلی اللہ علیہ وسلم ) کے متعلق تمہارا کیا اعتقاد ہے ؟ وہ جواب دیتا ہے کہ میں گواہی دیتا ہوں کہ وہ اللہ کے بندے اور اس کے رسول ہیں ۔ اس جواب پر اس سے کہا جاتا ہے کہ یہ دیکھ جہنم کا اپنا ایک ٹھکانا لیکن اللہ تعالیٰ نے جنت میں تیرے لیے ایک مکان اس کے بدلے میں بنا دیا ہے ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر اس بندہ مومن کو جنت اور جہنم دونوں دکھائی جاتی ہیں اور رہا کافر یا منافق تو اس کا جواب یہ ہوتا ہے کہ مجھے معلوم نہیں ‘ میں نے لوگوں کو ایک بات کہتے سنا تھا وہی میں بھی کہتا رہا ۔ پھر اس سے کہا جاتا ہے کہ نہ تو نے کچھ سمجھا اور نہ ( اچھے لوگوں کی ) پیروی کی ۔ اس کے بعد اسے ایک لوہے کے ہتھوڑے سے بڑے زور سے مارا جاتا ہے اور وہ اتنے بھیانک طریقہ سے چیختا ہے کہ انسان اور جن کے سوا اردگرد کی تمام مخلوق سنتی ہے ۔",
                "urduNarrator": "ہم سے عیاش بن ولید نے بیان کیا ‘ کہا کہ ہم سے عبدالاعلیٰ نے بیان کیا ‘ کہا کہ ہم سے سعید بن ابی عروبہ نے بیان کیا ۔ ( دوسری سند ) امام بخاری نے کہا کہ مجھ سے خلیفہ بن خیاط نے بیان کیا ‘ ان سے یزید بن زریع نے ‘ ان سے سعید بن ابی عروبہ نے ‘ ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَيَّاشٌ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، قَالَ وَقَالَ لِي خَلِيفَةُ حَدَّثَنَا ابْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْعَبْدُ إِذَا وُضِعَ فِي قَبْرِهِ، وَتُوُلِّيَ وَذَهَبَ أَصْحَابُهُ حَتَّى إِنَّهُ لَيَسْمَعُ قَرْعَ نِعَالِهِمْ، أَتَاهُ مَلَكَانِ فَأَقْعَدَاهُ فَيَقُولاَنِ لَهُ مَا كُنْتَ تَقُولُ فِي هَذَا الرَّجُلِ مُحَمَّدٍ صلى الله عليه وسلم فَيَقُولُ أَشْهَدُ أَنَّهُ عَبْدُ اللَّهِ وَرَسُولُهُ‏.‏ فَيُقَالُ انْظُرْ إِلَى مَقْعَدِكَ مِنَ النَّارِ، أَبْدَلَكَ اللَّهُ بِهِ مَقْعَدًا مِنَ الْجَنَّةِ ـ قَالَ النَّبِيُّ صلى الله عليه وسلم فَيَرَاهُمَا جَمِيعًا ـ وَأَمَّا الْكَافِرُ ـ أَوِ الْمُنَافِقُ ـ فَيَقُولُ لاَ أَدْرِي، كُنْتُ أَقُولُ مَا يَقُولُ النَّاسُ‏.‏ فَيُقَالُ لاَ دَرَيْتَ وَلاَ تَلَيْتَ‏.‏ ثُمَّ يُضْرَبُ بِمِطْرَقَةٍ مِنْ حَدِيدٍ ضَرْبَةً بَيْنَ أُذُنَيْهِ، فَيَصِيحُ صَيْحَةً يَسْمَعُهَا مَنْ يَلِيهِ إِلاَّ الثَّقَلَيْنِ ‏\"‏‏.‏",
                "headingArabic": "الْمَيِّتُ يَسْمَعُ خَفْقَ النِّعَالِ",
                "headingUrdu": "مردہ شخص (زندہ کے) قدموں کی آواز سنتا ہے",
                "headingEnglish": "A dead person hears the footsteps (of the living)",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1288,
                "hadithNumber": "1339",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The angel of death was sent to Moses and when he went to him, Moses slapped him severely, spoiling one of his eyes. The angel went back to his Lord, and said, \"You sent me to a slave who does not want to die.\" Allah restored his eye and said, \"Go back and tell him (i.e. Moses) to place his hand over the back of an ox, for he will be allowed to live for a number of years equal to the number of hairs coming under his hand.\" (So the angel came to him and told him the same). Then Moses asked, \"O my Lord! What will be then?\" He said, \"Death will be then.\" He said, \"(Let it be) now.\" He asked Allah that He bring him near the Sacred Land at a distance of a stone's throw. Allah's Messenger (ﷺ) said, \"Were I there I would show you the grave of Moses by the way near the red sand hill.\"",
                "hadithUrdu": "ملک الموت ( آدمی کی شکل میں ) موسیٰ علیہ السلام کے پاس بھیجے گئے ۔ وہ جب آئے تو موسیٰ علیہ السلام نے ( نہ پہچان کر ) انہیں ایک زور کا طمانچہ مارا اور ان کی آنکھ پھوڑ ڈالی ۔ وہ واپس اپنے رب کے حضور میں پہنچے اور عرض کیا کہ یا اللہ ! تو نے مجھے ایسے بندے کی طرف بھیجا جو مرنا نہیں چاہتا ۔ اللہ تعالیٰ نے ان کی آنکھ پہلے کی طرح کر دی اور فرمایا کہ دوبارہ جا اور ان سے کہہ کہ آپ اپنا ہاتھ ایک بیل کی پیٹھ پر رکھئے اور پیٹھ کے جتنے بال آپ کے ہاتھ تلے آ جائیں ان کے ہر بال کے بدلے ایک سال کی زندگی دی جاتی ہے ۔ ( موسیٰ علیہ السلام تک جب اللہ تعالیٰ کا یہ پیغام پہنچا تو ) آپ نے کہا کہ اے اللہ ! پھر کیا ہو گا ؟ اللہ تعالیٰ نے فرمایا کہ پھر بھی موت آنی ہے ۔ موسیٰ علیہ السلام بولے تو ابھی کیوں نہ آ جائے ۔ پھر انہوں نے اللہ سے دعا کی کہ انہیں ایک پتھر کی مار پر ارض مقدس سے قریب کر دیا جائے ۔ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر میں وہاں ہوتا تو تمہیں ان کی قبر دکھاتا کہ لال ٹیلے کے پاس راستے کے قریب ہے ۔",
                "urduNarrator": "ہم سے محمود بن غیلان نے بیان کیا ‘ کہا کہ ہم سے عبدالرزاق نے بیان کیا ‘ کہا کہ ہم کو معمر نے خبر دی ‘ انہیں عبداللہ بن طاؤس نے ‘ انہیں ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ ‏\"‏ أُرْسِلَ مَلَكُ الْمَوْتِ إِلَى مُوسَى ـ عَلَيْهِمَا السَّلاَمُ ـ فَلَمَّا جَاءَهُ صَكَّهُ فَرَجَعَ إِلَى رَبِّهِ فَقَالَ أَرْسَلْتَنِي إِلَى عَبْدٍ لاَ يُرِيدُ الْمَوْتَ‏.‏ فَرَدَّ اللَّهُ عَلَيْهِ عَيْنَهُ وَقَالَ ارْجِعْ فَقُلْ لَهُ يَضَعُ يَدَهُ عَلَى مَتْنِ ثَوْرٍ، فَلَهُ بِكُلِّ مَا غَطَّتْ بِهِ يَدُهُ بِكُلِّ شَعْرَةٍ سَنَةٌ‏.‏ قَالَ أَىْ رَبِّ، ثُمَّ مَاذَا قَالَ ثُمَّ الْمَوْتُ‏.‏ قَالَ فَالآنَ‏.‏ فَسَأَلَ اللَّهَ أَنْ يُدْنِيَهُ مِنَ الأَرْضِ الْمُقَدَّسَةِ رَمْيَةً بِحَجَرٍ ‏\"‏‏.‏ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَلَوْ كُنْتُ ثَمَّ لأَرَيْتُكُمْ قَبْرَهُ إِلَى جَانِبِ الطَّرِيقِ عِنْدَ الْكَثِيبِ الأَحْمَرِ ‏\"‏‏.‏",
                "headingArabic": "مَنْ أَحَبَّ الدَّفْنَ فِي الأَرْضِ الْمُقَدَّسَةِ أَوْ نَحْوِهَا",
                "headingUrdu": "جس نے بھی مقدس سرزمین میں دفن ہونا چاہا۔",
                "headingEnglish": "Whoever desired to be buried in the Sacred Land",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1289,
                "hadithNumber": "1340",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) offered the funeral prayer of a man one night after he was buried, he and his companions stood up (for the Prayer). He had asked them about him before standing, saying, \"Who is this?\" They said, \"He is so and so and was buried last night.\" So all of them offered the funeral prayer.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک ایسے شخص کی نماز جنازہ پڑھی جن کا انتقال رات کے وقت ہوا ( اور اسے رات ہی میں دفن کر دیا گیا تھا ) آپ صلی اللہ علیہ وسلم اور آپ کے اصحاب کھڑے ہوئے اور آپ صلی اللہ علیہ وسلم نے ان کے متعلق پوچھا تھا کہ یہ کن کی قبر ہے ۔ لوگوں نے بتایا کہ فلاں کی ہے جسے کل رات ہی دفن کیا گیا ہے ۔ پھر سب نے ( دوسرے روز ) نماز جنازہ پڑھی ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ‘ کہا کہ ہم سے جریر نے بیان کیا ‘ ان سے شیبانی نے ‘ ان سے شعبی نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الشَّيْبَانِيِّ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم عَلَى رَجُلٍ بَعْدَ مَا دُفِنَ بِلَيْلَةٍ قَامَ هُوَ وَأَصْحَابُهُ، وَكَانَ سَأَلَ عَنْهُ فَقَالَ ‏ \"‏ مَنْ هَذَا ‏\"‏‏.‏ فَقَالُوا فُلاَنٌ، دُفِنَ الْبَارِحَةَ‏.‏ فَصَلَّوْا عَلَيْهِ‏.‏",
                "headingArabic": "الدَّفْنِ بِاللَّيْلِ وَدُفِنَ أَبُو بَكْرٍ ـ رضى الله عنه ـ لَيْلاً",
                "headingUrdu": "رات کو دفن کیا گیا اور ابوبکر رضی اللہ عنہ کو رات کو دفن کیا گیا۔",
                "headingEnglish": "Burial at night and Abu Bakr رضی اللہ عنہ was buried at night.",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1290,
                "hadithNumber": "1341",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "When the Prophet (ﷺ) became ill, some of his wives talked about a church which they had seen in Ethiopia and it was called Mariya. Um Salma and Um Habiba رضی اللہ عنہا had been to Ethiopia, and both of them narrated its (the Church's) beauty and the pictures it contained. The Prophet (ﷺ) raised his head and said, \"Those are the people who, whenever a pious man dies amongst them, make a place of worship at his grave and then they make those pictures in it. Those are the worst creatures in the Sight of Allah.\"",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم بیمار پڑے تو آپ صلی اللہ علیہ وسلم کی بعض بیویوں ( ام سلمہ رضی اللہ عنہا اور ام حبیبہ رضی اللہ عنہا ) نے ایک گرجے کا ذکر کیا جسے انہوں نے حبشہ میں دیکھا تھا جس کا نام ماریہ تھا ۔ ام سلمہ اور ام حبیبہ رضی اللہ عنہا دونوں حبش کے ملک میں گئی تھیں ۔ انہوں نے اس کی خوبصورتی اور اس میں رکھی ہوئی تصاویر کا بھی ذکر کیا ۔ اس پر آنحضور صلی اللہ علیہ وسلم نے سرمبارک اٹھا کر فرمایا کہ یہ وہ لوگ ہیں کہ جب ان میں کوئی صالح شخص مر جاتا تو اس کی قبر پر مسجد تعمیر کر دیتے ۔ پھر اس کی مورت اس میں رکھتے ۔ اللہ کے نزدیک یہ لوگ ساری مخلوق میں برے ہیں ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا مجھ سے امام مالک نے بیان کیا ‘ ان سے ہشام بن عروہ نے ‘ ان سے ان کے باپ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا اشْتَكَى النَّبِيُّ صلى الله عليه وسلم ذَكَرَتْ بَعْضُ نِسَائِهِ كَنِيسَةً رَأَيْنَهَا بِأَرْضِ الْحَبَشَةِ، يُقَالُ لَهَا مَارِيَةُ، وَكَانَتْ أُمُّ سَلَمَةَ وَأُمُّ حَبِيبَةَ ـ رضى الله عنهما ـ أَتَتَا أَرْضَ الْحَبَشَةِ، فَذَكَرَتَا مِنْ حُسْنِهَا وَتَصَاوِيرَ فِيهَا، فَرَفَعَ رَأْسَهُ فَقَالَ ‏ \"‏ أُولَئِكَ إِذَا مَاتَ مِنْهُمُ الرَّجُلُ الصَّالِحُ بَنَوْا عَلَى قَبْرِهِ مَسْجِدًا، ثُمَّ صَوَّرُوا فِيهِ تِلْكَ الصُّورَةَ، أُولَئِكَ شِرَارُ الْخَلْقِ عِنْدَ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": "بِنَاءِ الْمَسْجِدِ عَلَى الْقَبْرِ",
                "headingUrdu": "قبر پر مسجد (عبادت کی جگہ) بنانا",
                "headingEnglish": "Building a mosque (a place of worship) at a grave",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1291,
                "hadithNumber": "1342",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "We were in the funeral procession of the daughter of Allah's Messenger (ﷺ) and Allah's Messenger (ﷺ) was sitting near the grave and I saw his eyes full of tears. He said, \"Is there anyone amongst you who did not have sexual relations with his wife last night?\" Abu Talha رضی اللہ عنہ replied in the affirmative. And so Allah's Apostle told him to get down in her grave and he got down in her grave and buried her. Abdullah bin Mubarak stated that Falih said that I think that the meaning of \"لم يقارف\" is one who has not committed a sin. Imam Bukhari, may God bless him and grant him peace, said that the meaning of what is mentioned in Surah Al-An'am, \"‏لِيَقْتَرِفُوا‏\", is so that they commit sins.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کی بیٹی کے جنازہ میں حاضر تھے ۔ آنحضور صلی اللہ علیہ وسلم قبر پر بیٹھے ہوئے تھے ‘ میں نے دیکھا کہ آپ صلی اللہ علیہ وسلم کی آنکھوں سے آنسو جاری تھے ۔ آپ صلی اللہ علیہ وسلم نے پوچھا کہ کیا ایسا آدمی بھی کوئی یہاں ہے جو آج رات کو عورت کے پاس نہ گیا ہو ۔ اس پر ابوطلحہ رضی اللہ عنہ بولے کہ میں حاضر ہوں ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ پھر تم قبر میں اتر جاؤ ۔ انس رضی اللہ عنہ نے کہا کہ وہ اتر گئے اور میت کو دفن کیا ۔ عبداللہ بن مبارک نے بیان کیا کہ فلیح نے کہا کہ میرا خیال ہے کہ «لم يقارف» کا معنی یہ ہے کہ جس نے گناہ نہ کیا ہو ۔ امام بخاری رحمتہ اللہ علیہ نے کہا کہ سورۃ الانعام میں جو «ليقترفوا‏» آیا ہے اس کا معنی یہی ہے تاکہ گناہ کریں ۔",
                "urduNarrator": "ہم سے محمد بن سنان نے بیان کیا ‘ ان سے فلیح بن سلیمان نے بیان کیا ‘ ان سے ہلال بن علی نے بیان کیا ‘ ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، حَدَّثَنَا هِلاَلُ بْنُ عَلِيٍّ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ شَهِدْنَا بِنْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَرَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ عَلَى الْقَبْرِ، فَرَأَيْتُ عَيْنَيْهِ تَدْمَعَانِ فَقَالَ ‏\"‏ هَلْ فِيكُمْ مِنْ أَحَدٍ لَمْ يُقَارِفِ اللَّيْلَةَ ‏\"‏‏.‏ فَقَالَ أَبُو طَلْحَةَ أَنَا‏.‏ قَالَ ‏\"‏ فَانْزِلْ فِي قَبْرِهَا ‏\"‏‏.‏ فَنَزَلَ فِي قَبْرِهَا فَقَبَرَهَا‏.‏ قَالَ ابْنُ الْمُبَارَكِ قَالَ فُلَيْحٌ أُرَاهُ يَعْنِي الذَّنْبَ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ ‏{‏لِيَقْتَرِفُوا‏}‏ أَىْ لِيَكْتَسِبُوا‏.‏",
                "headingArabic": "مَنْ يَدْخُلُ قَبْرَ الْمَرْأَةِ",
                "headingUrdu": "جو عورت کی قبر میں اُترے۔",
                "headingEnglish": "Who may get down in the grave of a woman",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1292,
                "hadithNumber": "1343",
                "englishNarrator": "Narrated Jabir bin `Abdulla رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) collected every two martyrs of Uhud in one piece of cloth, then he would ask, \"Which of them had (knew) more of the Qur'an?\" When one of them was pointed out for him, he would put that one first in the grave and say, \"I will be a witness on these on the Day of Resurrection.\" He ordered them to be buried with their blood on their bodies and they were neither washed nor was a funeral prayer offered for them.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے احد کے دو دو شہیدوں کو ملا کر ایک ہی کپڑے کا کفن دیا ۔ آپ صلی اللہ علیہ وسلم دریافت فرماتے کہ ان میں قرآن کسے زیادہ یاد ہے ۔ کسی ایک کی طرف اشارہ سے بتایا جاتا تو آپ صلی اللہ علیہ وسلم بغلی قبر میں اسی کو آگے کرتے اور فرماتے کہ میں قیامت میں ان کے حق میں شہادت دوں گا ۔ پھر آپ صلی اللہ علیہ وسلم نے سب کو ان کے خون سمیت دفن کرنے کا حکم دیا ۔ نہ انہیں غسل دیا گیا اور نہ ان کی نماز جنازہ پڑھی گئی ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ انہوں نے کہا کہ ہم سے لیث بن سعد نے بیان کیا ‘ انہوں نے کہا کہ مجھ سے ابن شہاب نے بیان کیا ‘ ان سے عبدالرحمٰن بن کعب بن مالک نے ‘ ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَجْمَعُ بَيْنَ الرَّجُلَيْنِ مِنْ قَتْلَى أُحُدٍ فِي ثَوْبٍ وَاحِدٍ ثُمَّ يَقُولُ ‏\"‏ أَيُّهُمْ أَكْثَرُ أَخْذًا لِلْقُرْآنِ ‏\"‏‏.‏ فَإِذَا أُشِيرَ لَهُ إِلَى أَحَدِهِمَا قَدَّمَهُ فِي اللَّحْدِ وَقَالَ ‏\"‏ أَنَا شَهِيدٌ عَلَى هَؤُلاَءِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ وَأَمَرَ بِدَفْنِهِمْ فِي دِمَائِهِمْ، وَلَمْ يُغَسَّلُوا وَلَمْ يُصَلَّ عَلَيْهِمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": "شہید کی نماز جنازہ",
                "headingEnglish": "The funeral Salat (prayer) of a martyr",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1293,
                "hadithNumber": "1344",
                "englishNarrator": "Narrated `Uqba bin 'Amir:",
                "hadithEnglish": "One day the Prophet (ﷺ) went out and offered the funeral prayers of the martyrs of Uhud and then went up the pulpit and said, \"I will pave the way for you as your predecessor and will be a witness on you. By Allah! I see my Fount (Kauthar) just now and I have been given the keys of all the treasures of the earth (or the keys of the earth). By Allah! I am not afraid that you will worship others along with Allah after my death, but I am afraid that you will fight with one another for the worldly things.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک دن باہر تشریف لائے اور احد کے شہیدوں پر اس طرح نماز پڑھی جیسے میت پر پڑھی جاتی ہے ۔ پھر منبر پر تشریف لائے اور فرمایا ۔ دیکھو میں تم سے پہلے جا کر تمہارے لیے میر ساماں بنوں گا اور میں تم پر گواہ رہوں گا ۔ اور قسم اللہ کی میں اس وقت اپنے حوض کو دیکھ رہا ہوں اور مجھے زمین کے خزانوں کی کنجیاں دی گئی ہیں یا ( یہ فرمایا کہ ) مجھے زمین کی کنجیاں دی گئی ہیں اور قسم خدا کی مجھے اس کا ڈر نہیں کہ میرے بعد تم شرک کرو گے بلکہ اس کا ڈر ہے کہ تم لوگ دنیا حاصل کرنے میں رغبت کرو گے ( نتیجہ یہ کہ آخرت سے غافل ہو جاؤ گے ) ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ کہا کہ ہم سے لیث بن سعد نے بیان کیا ‘ ان سے یزید بن ابی حبیب نے بیان کیا ‘ ان سے ابوالخیر یزیدبن عبداللہ نے ‘ ان سے عقبہ بن عامرنے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلاَتَهُ عَلَى الْمَيِّتِ، ثُمَّ انْصَرَفَ إِلَى الْمِنْبَرِ فَقَالَ ‏ \"‏ إِنِّي فَرَطٌ لَكُمْ، وَأَنَا شَهِيدٌ عَلَيْكُمْ، وَإِنِّي وَاللَّهِ لأَنْظُرُ إِلَى حَوْضِي الآنَ، وَإِنِّي أُعْطِيتُ مَفَاتِيحَ خَزَائِنِ الأَرْضِ ـ أَوْ مَفَاتِيحَ الأَرْضِ ـ وَإِنِّي وَاللَّهِ مَا أَخَافُ عَلَيْكُمْ أَنْ تُشْرِكُوا بَعْدِي، وَلَكِنْ أَخَافُ عَلَيْكُمْ أَنْ تَنَافَسُوا فِيهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1294,
                "hadithNumber": "1345",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) buried every two martyrs in of Uhud in one grave.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے احد کے دو دو شہیدوں کو دفن کرنے میں ایک ساتھ جمع فرمایا تھا ۔",
                "urduNarrator": "ہم سے سعید بن سلیمان نے بیان کیا ‘ انہوں نے کہا کہ ہم سے لیث نے بیان کیا ‘ انہوں نے کہا کہ ہم سے ابن شہاب نے بیان کیا ۔ ان سے عبدالرحمٰن بن کعب نے کہ جابر بن عبداللہ رضی اللہ عنہما نے انہیں خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبٍ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَجْمَعُ بَيْنَ الرَّجُلَيْنِ مِنْ قَتْلَى أُحُدٍ‏.‏",
                "headingArabic": "دَفْنِ الرَّجُلَيْنِ وَالثَّلاَثَةِ فِي قَبْرٍ وَاحِدٍ",
                "headingUrdu": "ایک قبر میں دو یا تین آدمیوں کی تدفین",
                "headingEnglish": "The burial of two or three men in one grave",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1295,
                "hadithNumber": "1346",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Bury them (i.e. martyrs) with their blood.\" (that was) On the day of the Battle of Uhud. He did not get them washed.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہیں خون سمیت دفن کر دو یعنی احد کی لڑائی کے موقع پر اور انہیں غسل نہیں دیا تھا ۔",
                "urduNarrator": "ہم سے ابو الولید نے بیان کیا ، کہا کہ ہم سے لیث بن سعد نے بیان کیا ان سے ابن شہاب نے ، ان سے عبدالرحمٰن بن کعب نے اور ان سے جابر رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبٍ، عَنْ جَابِرٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ ادْفِنُوهُمْ فِي دِمَائِهِمْ ‏\"‏‏.‏ ـ يَعْنِي يَوْمَ أُحُدٍ ـ وَلَمْ يُغَسِّلْهُمْ‏.‏",
                "headingArabic": "مَنْ لَمْ يَرَ غَسْلَ الشُّهَدَاءِ",
                "headingUrdu": "جس کا خیال ہے کہ شہداء پر غسل واجب نہیں ہے۔",
                "headingEnglish": "Whoever thinks no bath is required for the martyrs",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1296,
                "hadithNumber": "1347, 1348",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) shrouded every two martyrs of Uhud in one piece of cloth and then he would ask, \"Which of them knew more Qur'an?\" When one of them was pointed out he would put him first in the grave. He said, \"I am a witness on these.\" Then he ordered them to be buried with blood on their bodies. Neither did he offer their funeral prayer nor did he get them washed. (Jabir bin `Abdullah رضی اللہ عنہما added): Allah's Messenger (ﷺ) used to ask about the martyrs of Uhud as to which of them knew more of the Qur'an.\" And when one of them was pointed out as having more of it he would put him first in the grave and then his companions. (Jabir رضی اللہ عنہما added): My father and my uncle were shrouded in one sheet. Sulaiman bin Katheer said: Zuhri has narrated this Hadith to me the person who heard it from Hadrat Jabir رضی اللہ عنہ .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم احد کے دو دو شہید مردوں کو ایک ہی کپڑے میں کفن دیتے اور پوچھتے کہ ان میں قرآن کس نے زیادہ یاد کیا ہے ، پھر جب کسی ایک طرف اشارہ کر دیا جاتا تو لحد میں اسی کو آگے بڑھاتے اور فرماتے جاتے کہ میں ان پر گواہ ہوں ۔ آپ صلی اللہ علیہ وسلم نے خون سمیت انہیں دفن کرنے کا حکم دیا ، نہ ان کی نماز جنازہ پڑھی اور نہ انہیں غسل دیا ۔ پھر ہمیں امام اوزاعی نے خبر دی ۔ انہیں زہری نے اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہما نے کہ رسول اللہ صلی اللہ علیہ وسلم پوچھتے جاتے تھے کہ ان میں قرآن زیادہ کس نے حاصل کیا ہے ؟ جس کی طرف اشارہ کر دیا جاتا آپ صلی اللہ علیہ وسلم لحد میں اسی کو دوسرے سے آگے بڑھاتے ۔ حضرت جابر بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ میرے والد اور چچا کو ایک ہی کمبل میں کفن دیا گیا تھا ۔ سلیمان بن کثیر نے کہا: مجھے زہری نے بیان کیا، جس نے جابر رضی اللہ عنہ کو سنا، اس نے ہمیں بتایا۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا ‘ انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ‘ انہوں نے کہا کہ ہمیں لیث بن سعد نے خبر دی ۔ انہوں نے کہا کہ مجھ سے ابن شہاب نے بیان کیا ‘ ان سے عبدالرحمٰن بن کعب بن مالک نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا لَيْثُ بْنُ سَعْدٍ، حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَجْمَعُ بَيْنَ الرَّجُلَيْنِ مِنْ قَتْلَى أُحُدٍ فِي ثَوْبٍ وَاحِدٍ ثُمَّ يَقُولُ ‏\"‏ أَيُّهُمْ أَكْثَرُ أَخْذًا لِلْقُرْآنِ ‏\"‏‏.‏ فَإِذَا أُشِيرَ لَهُ إِلَى أَحَدِهِمَا قَدَّمَهُ فِي اللَّحْدِ وَقَالَ ‏\"‏ أَنَا شَهِيدٌ عَلَى هَؤُلاَءِ ‏\"‏‏.‏ وَأَمَرَ بِدَفْنِهِمْ بِدِمَائِهِمْ، وَلَمْ يُصَلِّ عَلَيْهِمْ وَلَمْ يُغَسِّلْهُمْ‏.‏وَأَخْبَرَنَا الأَوْزَاعِيُّ، عَنِ الزُّهْرِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ لِقَتْلَى أُحُدٍ ‏\"‏ أَىُّ هَؤُلاَءِ أَكْثَرُ أَخْذًا لِلْقُرْآنِ ‏\"‏‏.‏ فَإِذَا أُشِيرَ لَهُ إِلَى رَجُلٍ قَدَّمَهُ فِي اللَّحْدِ قَبْلَ صَاحِبِهِ‏.‏ وَقَالَ جَابِرٌ فَكُفِّنَ أَبِي وَعَمِّي فِي نَمِرَةٍ وَاحِدَةٍ‏.‏ وَقَالَ سُلَيْمَانُ بْنُ كَثِيرٍ حَدَّثَنِي الزُّهْرِيُّ، حَدَّثَنَا مَنْ، سَمِعَ جَابِرًا ـ رضى الله عنه‏.‏",
                "headingArabic": "مَنْ يُقَدَّمُ فِي اللَّحْدِ",
                "headingUrdu": "لحد میں سب سے پہلے کس کو رکھا جائے (قبر کا ایک پہلو)",
                "headingEnglish": "Who should be put first in the Lahd (a side extension of a grave)",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1297,
                "hadithNumber": "1349",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah has made Mecca a sanctuary (sacred place) and it was a sanctuary before me and will be so after me. It was made legal for me (to fight in it) for a few hours of the day. None is allowed to uproot its thorny shrubs or to cut its trees or to chase its game or to pick up its fallen things except by a person who announces it publicly.\" On that Al-Abbas رضی اللہ عنہ said (to the Prophet), \"Except Al- Idhkhir for our goldsmiths and for our graves.\" And so the Prophet (ﷺ) added, \"Except Al-Idhkhir. \" And Abu Huraira رضی اللہ عنہ narrated that the Prophet (ﷺ) said, \"Except Al-Idhkhir for our graves and houses.\" And Ibn `Abbas رضی اللہ عنہما  said, \"For their goldsmiths and houses.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے مکہ کو حرم کیا ہے ۔ نہ مجھ سے پہلے کسی کے لیے ( یہاں قتل و خون ) حلال تھا اور نہ میرے بعد ہو گا اور میرے لیے بھی تھوڑی دیر کے لیے ( فتح مکہ کے دن ) حلال ہوا تھا ۔ پس نہ اس کی گھاس اکھاڑی جائے نہ اس کے درخت قلم کئے جائیں ۔ نہ یہاں کے جانوروں کو ( شکار کے لیے ) بھگایا جائے اور سوا اس شخص کے جو اعلان کرنا چاہتا ہو ( کہ یہ گری ہوئی چیز کس کی ہے ) کسی کے لیے وہاں سے کوئی گری ہوئی چیز اٹھانی جائز نہیں ۔ اس پر حضرت عباس رضی اللہ عنہ نے کہا ” لیکن اس سے اذخر کا استثناء کر دیجئیے کہ یہ ہمارے سناروں کے اور ہماری قبروں میں کام آتی ہے ۔ “ آپ صلی اللہ علیہ وسلم نے فرمایا کہ مگر اذخر کی اجازت ہے ۔ ابوہریرہ رضی اللہ عنہ کی نبی کریم صلی اللہ علیہ وسلم سے روایت میں ہے ۔ ” ہماری قبروں اور گھروں کے لیے ۔ “ اور ابان بن صالح نے بیان کیا ‘ ان سے حسن بن مسلم نے ‘ ان سے صفیہ بنت شیبہ نے کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی طرح سنا تھا ۔ اور مجاہد نے طاؤس کے واسطہ سے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے یہ الفاظ بیان کئے ۔ ہمارے قین ( لوہاروں ) اور گھروں کے لیے ( اذخر اکھاڑنا حرم سے ) جائز کر دیجئیے ۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن حوشب نے بیان کیا ‘ کہا کہ ہم سے عبدالوہاب نے بیان کیا ۔ کہا ہم سے خالد حذاء نے ‘ ان سے عکرمہ نے ‘ ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَوْشَبٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ حَرَّمَ اللَّهُ مَكَّةَ، فَلَمْ تَحِلَّ لأَحَدٍ قَبْلِي وَلاَ لأَحَدٍ بَعْدِي، أُحِلَّتْ لِي سَاعَةً مِنْ نَهَارٍ، لاَ يُخْتَلَى خَلاَهَا، وَلاَ يُعْضَدُ شَجَرُهَا، وَلاَ يُنَفَّرُ صَيْدُهَا، وَلاَ تُلْتَقَطُ لُقَطَتُهَا إِلاَّ لِمُعَرِّفٍ ‏\"‏‏.‏ فَقَالَ الْعَبَّاسُ ـ رضى الله عنه ـ إِلاَّ الإِذْخِرَ لِصَاغَتِنَا وَقُبُورِنَا‏.‏ فَقَالَ ‏\"‏ إِلاَّ الإِذْخِرَ ‏\"‏‏.‏ وَقَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ لِقُبُورِنَا وَبُيُوتِنَا ‏\"‏‏.‏ وَقَالَ أَبَانُ بْنُ صَالِحٍ عَنِ الْحَسَنِ بْنِ مُسْلِمٍ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم مِثْلَهُ‏.‏ وَقَالَ مُجَاهِدٌ عَنْ طَاوُسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ لِقَيْنِهِمْ وَبُيُوتِهِمْ‏.‏",
                "headingArabic": "الإِذْخِرِ وَالْحَشِيشِ فِي الْقَبْرِ",
                "headingUrdu": "اذخیر اور گھاس کو قبر میں رکھنا",
                "headingEnglish": "The placing of Idhkhir and grass in the grave",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1298,
                "hadithNumber": "1350",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) came to `Abdullah bin Ubai (a hypocrite) after his death and he has been laid in his pit (grave). He ordered (that he be taken out of the grave) and he was taken out. Then he placed him on his knees and threw some of his saliva on him and clothed him in his (the Prophet's) own shirt. Allah knows better (why he did so). `Abdullah bin Ubai had given his shirt to Al-Abbas to wear. Abu Harun said, \"Allah's Messenger (ﷺ) at that time had two shirts and the son of `Abdullah bin Ubai said to him, 'O Allah's Messenger (ﷺ)! Clothe my father in your shirt which has been in contact with your skin.' ' Sufyan added, \"Thus people think that the Prophet (ﷺ) clothed `Abdullah bin Tubal in his shirt in lieu of what he (Abdullah) had done (for Al `Abbas رضی اللہ عنہ , the Prophet's uncle.)\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو عبداللہ بن ابی ( منافق ) کو اس کی قبر میں ڈالا جا چکا تھا ۔ لیکن آپ صلی اللہ علیہ وسلم کے ارشاد پر اسے قبر سے نکال لیا گیا ۔ پھر آپ صلی اللہ علیہ وسلم نے اسے اپنے گھٹنوں پر رکھ کر لعاب دہن اس کے منہ میں ڈالا اور اپنا کرتہ اسے پہنایا ۔ اب اللہ ہی بہتر جانتا ہے ۔ ( غالباً مرنے کے بعد ایک منافق کے ساتھ اس احسان کی وجہ یہ تھی کہ ) انہوں نے حضرت عباس رضی اللہ عنہ کو ایک قمیص پہنائی تھی ( غزوہ بدر میں جب حضرت عباس رضی اللہ عنہ مسلمانوں کے قیدی بن کر آئے تھے ) سفیان نے بیان کیا کہ ابوہارون موسیٰ بن ابی عیسیٰ کہتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم کے استعمال میں دو کرتے تھے ۔ عبداللہ کے لڑکے ( جو مومن مخلص تھے رضی اللہ عنہ ) نے کہا کہ یا رسول اللہ ! میرے والد کو آپ وہ قمیص پہنا دیجئیے جو آپ صلی اللہ علیہ وسلم کے جسد اطہر کے قریب رہتی ہے ۔ سفیان نے کہا لوگ سمجھتے ہیں کہ آنحضرت صلی اللہ علیہ وسلم نے اپنا کرتہ اس کے کرتے کے بدل پہنا دیا جو اس نے حضرت عباس رضی اللہ عنہ کو پہنایا تھا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ‘ کہا کہ ہم سے سفیان نے بیان کیا ‘ عمرو نے کہا کہ میں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا ‘ انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَبْدَ اللَّهِ بْنَ أُبَىٍّ بَعْدَ مَا أُدْخِلَ حُفْرَتَهُ فَأَمَرَ بِهِ فَأُخْرِجَ، فَوَضَعَهُ عَلَى رُكْبَتَيْهِ، وَنَفَثَ عَلَيْهِ مِنْ رِيقِهِ، وَأَلْبَسَهُ قَمِيصَهُ، فَاللَّهُ أَعْلَمُ، وَكَانَ كَسَا عَبَّاسًا قَمِيصًا‏.‏ قَالَ سُفْيَانُ وَقَالَ أَبُو هَارُونَ وَكَانَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَمِيصَانِ، فَقَالَ لَهُ ابْنُ عَبْدِ اللَّهِ يَا رَسُولَ اللَّهِ، أَلْبِسْ أَبِي قَمِيصَكَ الَّذِي يَلِي جِلْدَكَ‏.‏ قَالَ سُفْيَانُ فَيُرَوْنَ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَلْبَسَ عَبْدَ اللَّهِ قَمِيصَهُ مُكَافَأَةً لِمَا صَنَعَ‏.‏",
                "headingArabic": "لْ يُخْرَجُ الْمَيِّتُ مِنَ الْقَبْرِ وَاللَّحْدِ لِعِلَّةٍ",
                "headingUrdu": "کیا میت کو قبر سے نکالا جا سکتا ہے؟",
                "headingEnglish": "Can the dead body be taken out of its grave",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1299,
                "hadithNumber": "1351",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "When the time of the Battle of Uhud approached, my father called me at night and said, \"I think that I will be the first amongst the companions of the Prophet (ﷺ) to be martyred. I do not leave anyone after me dearer to me than you, except Allah's Messenger (ﷺ)'s soul and I owe some debt and you should repay it and treat your sisters favorably (nicely and politely).\" So in the morning he was the first to be martyred and was buried along with another (martyr). I did not like to leave him with the other (martyr) so I took him out of the grave after six months of his burial and he was in the same condition as he was on the day of burial, except a slight change near his ear.",
                "hadithUrdu": "جب جنگ احد کا وقت قریب آ گیا تو مجھے میرے باپ عبداللہ نے رات کو بلا کر کہا کہ مجھے ایسا دکھائی دیتا ہے کہ نبی کریم صلی اللہ علیہ وسلم کے اصحاب میں سب سے پہلا مقتول میں ہی ہوں گا اور دیکھو نبی کریم صلی اللہ علیہ وسلم کے سوا دوسرا کوئی مجھے ( اپنے عزیزوں اور وارثوں میں ) تم سے زیادہ عزیز نہیں ہے ‘ میں مقروض ہوں اس لیے تم میرا قرض ادا کر دینا اور اپنی ( نو ) بہنوں سے اچھا سلوک کرنا ۔ چنانچہ جب صبح ہوئی تو سب سے پہلے میرے والد ہی شہید ہوئے ۔ قبر میں آپ کے ساتھ میں نے ایک دوسرے شخص کو بھی دفن کیا تھا ۔ پر میرا دل نہیں مانا کہ انہیں دوسرے صاحب کے ساتھ یوں ہی قبر میں رہنے دوں ۔ چنانچہ چھ مہینے کے بعد میں نے ان کی لاش کو قبر سے نکالا دیکھا تو صرف کان تھوڑا سا گلنے کے سوا باقی سارا جسم اسی طرح تھا جیسے دفن کیا گیا تھا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘ کہا کہ ہم کو بشربن مفضل نے خبر دی ‘ کہا کہ ہم سے حسین معلم نے بیان کیا ‘ ان سے عطاء بن ابی رباح نے ‘ ان سے جابر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، أَخْبَرَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ لَمَّا حَضَرَ أُحُدٌ دَعَانِي أَبِي مِنَ اللَّيْلِ فَقَالَ مَا أُرَانِي إِلاَّ مَقْتُولاً فِي أَوَّلِ مَنْ يُقْتَلُ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم، وَإِنِّي لاَ أَتْرُكُ بَعْدِي أَعَزَّ عَلَىَّ مِنْكَ، غَيْرَ نَفْسِ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَإِنَّ عَلَىَّ دَيْنًا فَاقْضِ، وَاسْتَوْصِ بِأَخَوَاتِكَ خَيْرًا‏.‏ فَأَصْبَحْنَا فَكَانَ أَوَّلَ قَتِيلٍ، وَدُفِنَ مَعَهُ آخَرُ فِي قَبْرٍ، ثُمَّ لَمْ تَطِبْ نَفْسِي أَنْ أَتْرُكَهُ مَعَ الآخَرِ فَاسْتَخْرَجْتُهُ بَعْدَ سِتَّةِ أَشْهُرٍ، فَإِذَا هُوَ كَيَوْمِ وَضَعْتُهُ هُنَيَّةً غَيْرَ أُذُنِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1300,
                "hadithNumber": "1352",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "A man was buried along with my father and I did not like it till I took him (i.e. my father) out and buried him in a separate grave.",
                "hadithUrdu": "میرے باپ کے ساتھ ایک ہی قبر میں ایک اور صحابی ( حضرت جابر رضی اللہ عنہ کے چچا ) دفن تھے ۔ لیکن میرا دل اس پر راضی نہیں ہو رہا تھا ۔ اس لیے میں نے ان کی لاش نکال کر دوسری قبر میں دفن کر دی ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ کہا کہ ہم سے سعید بن عامر نے بیان کیا ‘ ان سے شعبہ نے ‘ ان سے ابن ابی نجیح نے ‘ ان سے عطاء بن ابی رباح اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ، عَنْ شُعْبَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ دُفِنَ مَعَ أَبِي رَجُلٌ فَلَمْ تَطِبْ نَفْسِي حَتَّى أَخْرَجْتُهُ فَجَعَلْتُهُ فِي قَبْرٍ عَلَى حِدَةٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1276,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=51",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=49",
                "label": "49",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=50",
                "label": "50",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=51",
                "label": "51",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=52",
                "label": "52",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=53",
                "label": "53",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=54",
                "label": "54",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=55",
                "label": "55",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=53",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=53",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=51",
        "to": 1300,
        "total": 40465
    }
}