{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 204,
        "data": [
            {
                "id": 5078,
                "hadithNumber": "5309",
                "englishNarrator": "Narrated Ibn Juraij:",
                "hadithEnglish": "Ibn Shihab informed me of Lian and the tradition related to it, referring to the narration of Sahl bin Sa`d رضی اللہ عنہ , the brother of Bani Sa`idi He said, \"An Ansari man came to Allah's Messenger (ﷺ) and said, 'O Allah's Apostle! If a man saw another man with his wife, should he kill him, or what should he do?' So Allah revealed concerning his affair what is mentioned in the Holy Qur'an about the affair of those involved in a case of Lian. The Prophet (ﷺ) said, 'Allah has given His verdict regarding you and your wife.' So they carried out Lian in the mosque while I was present there. When they had finished, the man said, \"O Allah's Messenger (ﷺ)! If I should now keep her with me as a wife then I have told a lie about her. Then he divorced her thrice before Allah's Messenger (ﷺ) ordered him, when they had finished the Lian process. So he divorced her in front of the Prophet (ﷺ) .\" Ibn Shihab added, \"After their case, it became a tradition that a couple involved in a case of Lian should be separated by divorce. That lady was pregnant then, and later on her son was called by his mother's name. The tradition concerning their inheritance was that she would be his heir and he would inherit of her property the share Allah had prescribed for him.\" Ibn Shihab said that Sahl bin Sa`d As'Saidi رضی اللہ عنہ said that the Prophet (ﷺ) said (in the above narration), \"If that lady delivers a small red child like a lizard, then the lady has spoken the truth and the man was a liar, but if she delivers a child with black eyes and huge lips, then her husband has spoken the truth.\" Then she delivered it in the shape one would dislike (as it proved her guilty).",
                "hadithUrdu": "مجھے ابن شہاب نے لعان کے بارے میں اور یہ کہ شریعت کی طرف سے اس کا سنت طریقہ کیا ہے ، خبر دی بنی ساعدہ کے سہل بن سعد رضی اللہ عنہ نے ، انہوں نے بیان کیا کہ قبیلہ انصار کے ایک صحابی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! اس شخص کے متعلق آپ کا کیا ارشاد ہے جو اپنی بیوی کے ساتھ کسی غیر مرد کو دیکھے ، کیا وہ اسے قتل کر دے یا اسے کیا کرنا چاہیئے ؟ انہیں کے بارے میں اللہ تعالیٰ نے قرآن مجید کی وہ آیت نازل کی جس میں لعان کرنے والوں کے لیے تفصیلات بیان ہوئی ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اللہ تعالیٰ نے تمہاری بیوی کے بارے میں فیصلہ کر دیا ہے ۔ بیان کیا کہ پھر دونوں نے مسجد میں لعان کیا ، میں اس وقت وہاں موجود تھا ۔ جب دونوں لعان سے فارغ ہوئے تو انصاری صحابی نے عرض کیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! اگر اب بھی میں اسے اپنے نکاح میں رکھوں تو اس کا مطلب یہ ہو گا کہ میں نے اس پر جھوٹی تہمت لگا ئی تھی ۔ چنانچہ لعان سے فارغ ہونے کے بعد انہوں نے آنحضرت صلی اللہ علیہ وسلم کے حکم سے پہلے ہی انہیں تین طلاقیں دے دیں ۔ حضور اکرم صلی اللہ علیہ وسلم کی موجودگی میں ہی انہیں جدا کر دیا ۔ ( سہل نے یا ابن شہاب نے ) کہا کہ ہر لعان کرنے والے میاں بیوی کے درمیان یہی جدائی کا سنت طریقہ مقرر ہوا ۔ ابن جریج نے بیان کیا ، ان سے ابن شہاب نے بیان کیا کہ ان کے بعد شریعت کی طرف سے طریقہ یہ متعین ہوا کہ دو لعان کرنے والوں کے درمیان تفریق کرا دی جایا کرے ۔ اور وہ عورت حاملہ تھی ۔ اور ان کا بیٹا اپنی ماں کی طرف منسوب کیا جاتا تھا ۔ بیان کیا کہ پھر ایسی عورت کے میراث کے بارے میں بھی یہ طریقہ شریعت کی طرف سے مقرر ہو گیا کہ بچہ اس کا وارث ہو گا اور وہ بچہ کی وارث ہو گی ۔ اس کے مطابق جو اللہ تعالیٰ نے وراثت کے سلسلہ میں فرض کیا ہے ۔ ابن جریج نے بیان کیا ، ان سے ابن شہاب نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے ، اسی حدیث میں کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا کہ اگر ( لعان کرنے والی خاتون ) اس نے سرخ اور پستہ قد بچہ جنا جیسے وحرہ تو میں سمجھوں گا کہ عورت ہی سچی ہے اور اس کے شوہر نے اس پر جھوٹی تہمت لگائی ہے لیکن اگر کالا ، بڑی آنکھوں والا اور بڑے سرینوں والا بچہ جنا تو میں سمجھوں گا کہ شوہر نے اس کے متعلق سچ کہا تھا ۔ ( عورت جھوٹی ہے ) جب بچہ پیدا ہو تو وہ بری شکل کا تھا ( یعنی اس مرد کی صورت پر جس سے وہ بد نام ہوئی تھی ) ۔",
                "urduNarrator": "ہم سے یحییٰ بن جعفر نے بیان کیا ، کہا ہم کو عبدالرزاق بن ہمام نے خبر دی ، انہیں ابن جریج نے خبر دی ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، عَنِ الْمُلاَعَنَةِ، وَعَنِ السُّنَّةِ، فِيهَا عَنْ حَدِيثِ، سَهْلِ بْنِ سَعْدٍ أَخِي بَنِي سَاعِدَةَ أَنَّ رَجُلاً، مِنَ الأَنْصَارِ جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ أَمْ كَيْفَ يَفْعَلُ فَأَنْزَلَ اللَّهُ فِي شَأْنِهِ مَا ذَكَرَ فِي الْقُرْآنِ مِنْ أَمْرِ الْمُتَلاَعِنَيْنِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ قَدْ قَضَى اللَّهُ فِيكَ وَفِي امْرَأَتِكَ ‏\"‏‏.‏ قَالَ فَتَلاَعَنَا فِي الْمَسْجِدِ وَأَنَا شَاهِدٌ، فَلَمَّا فَرَغَا قَالَ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ إِنْ أَمْسَكْتُهَا‏.‏ فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ فَرَغَا مِنَ التَّلاَعُنِ، فَفَارَقَهَا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ ذَاكَ تَفْرِيقٌ بَيْنَ كُلِّ مُتَلاَعِنَيْنِ ‏\"‏‏.‏ قَالَ ابْنُ جُرَيْجٍ قَالَ ابْنُ شِهَابٍ فَكَانَتِ السُّنَّةُ بَعْدَهُمَا أَنْ يُفَرَّقَ بَيْنَ الْمُتَلاَعِنَيْنِ، وَكَانَتْ حَامِلاً، وَكَانَ ابْنُهَا يُدْعَى لأُمِّهِ، قَالَ ثُمَّ جَرَتِ السُّنَّةُ فِي مِيرَاثِهَا أَنَّهَا تَرِثُهُ وَيَرِثُ مِنْهَا مَا فَرَضَ اللَّهُ لَهُ‏.‏ قَالَ ابْنُ جُرَيْجٍ عَنِ ابْنِ شِهَابٍ عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ فِي هَذَا الْحَدِيثِ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنْ جَاءَتْ بِهِ أَحْمَرَ قَصِيرًا كَأَنَّهُ وَحَرَةٌ، فَلاَ أُرَاهَا إِلاَّ قَدْ صَدَقَتْ وَكَذَبَ عَلَيْهَا، وَإِنْ جَاءَتْ بِهِ أَسْوَدَ أَعْيَنَ ذَا أَلْيَتَيْنِ، فَلاَ أُرَاهُ إِلاَّ قَدْ صَدَقَ عَلَيْهَا ‏\"‏‏.‏ فَجَاءَتْ بِهِ عَلَى الْمَكْرُوهِ مِنْ ذَلِكَ‏.‏",
                "headingArabic": "التَّلاَعُنِ فِي الْمَسْجِدِ",
                "headingUrdu": "مسجد میں لعان کرنا۔",
                "headingEnglish": "To carry out Li'an in a Mosque.",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5079,
                "hadithNumber": "5310",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"Once Lian was mentioned before the Prophet (ﷺ) whereupon `Asim bin Adi  رضی اللہ عنہ said something and went away. Then a man from his tribe came to him, complaining that he had found a man with his wife. `Asim رضی اللہ عنہ said, 'I have not been put to task except for my statement (about Lian).' `Asim رضی اللہ عنہ took the man to the Prophet (ﷺ) and the man told him of the state in which he had found his wife. The man was pale, thin, and of lank hair, while the other man whom he claimed he had seen with his wife, was brown, fat and had much flesh on his calves. The Prophet (ﷺ) invoked, saying, 'O Allah! Reveal the truth.' So that lady delivered a child resembling the man whom her husband had mentioned he had found her with. The Prophet (ﷺ) then made them carry out Lian.\" Then a man from that gathering asked Ibn `Abbas رضی اللہ عنہما , \"Was she the same lady regarding which the Prophet (ﷺ) had said, 'If I were to stone to death someone without witness, I would have stoned this lady'?\" Ibn `Abbas رضی اللہ عنہما said, \"No, that was another lady who, though being a Muslim, used to arouse suspicion by her outright misbehavior. \" Abu Sualih and Abdullah bin Yousuf narrates that this report contains the word ''خَدِلاً‏'' .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی مجلس میں لعان کا ذکر ہوا اور عاصم رضی اللہ عنہ نے اس سلسلہ میں کوئی بات کہی ( کہ میں اگر اپنی بیوی کے ساتھ کسی غیر مرد کو دیکھ لوں تو وہیں قتل کر دوں ) اور چلے گئے ، پھر ان کی قوم کے ایک صحابی ( عویمر ر ضی اللہ عنہ ) ان کے پاس آئے یہ شکایت لے کر کہ انہوں نے اپنی بیوی کے ساتھ ایک غیر مرد کو پایا ہے ۔ عاصم رضی اللہ عنہ نے کہا کہ مجھے آج یہ ابتلا میری اسی بات کی وجہ سے ہوا ہے ( جو آپ نے آنحضرت صلی اللہ علیہ وسلم کے سامنے کہی تھی ) پھر وہ انہیں لے کر حضور اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آنحضرت صلی اللہ علیہ وسلم کو وہ واقعہ بتایا جس میں ملوث اس صحابی نے اپنی کو پایا تھا ۔ یہ صاحب زرد رنگ ، کم گوشت والے ( پتلے دبلے ) اور سیدھے بال والے تھے اور جس کے متعلق انہوں نے دعویٰ کیا تھا کہ اسے انہوں نے اپنی بیوی کے ساتھ ( تنہائی میں ) پایا ، وہ گھٹے ہوئے جسم کا ، گندمی اور بھر ے گوشت والا تھا ، پھر حضور اکرم صلی اللہ علیہ وسلم نے دعا فرمائی کہ اے اللہ ! اس معاملہ کو صاف کر دے ۔ چنانچہ اس عورت نے بچہ اسی مرد کی شکل کا جنا جس کے متعلق شوہر نے دعویٰ کیا تھا کہ اسے انہوں نے اپنی بیوی کے ساتھ پایا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے میاں بیوی کے درمیان لعان کرایا ۔ ایک شاگرد نے مجلس میں ابن عباس رضی اللہ عنہما سے پوچھا کیا یہی وہ عورت ہے جس کے متعلق حضور اکرم صلی اللہ علیہ وسلم نے فرمایا تھا کہ اگر میں کسی کو بلاشہادت کے سنگسار کر سکتا تو اس عورت کو سنگسار کرتا ۔ ابن عباس رضی اللہ عنہما نے کہا کہ نہیں ( یہ جملہ آنحضرت صلی اللہ علیہ وسلم نے ) اس عورت کے متعلق فرمایا تھا جس کی بدکاری اسلام کے زمانہ میں کھل گئی تھی ۔ ابوصالح اور عبداللہ بن یوسف نے اس حدیث میں بجائے خدلا کے کسرہ کے ساتھ دال خدلا روایت کیا ہے لیکن معنی وہی ہے ۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ مجھ سے لیث نے بیان کیا ، ان سے یحییٰ بن سعید نے ، ان سے عبدالرحمٰن بن قاسم نے ، ان سے قاسم بن محمد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ ذُكِرَ التَّلاَعُنُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ عَاصِمُ بْنُ عَدِيٍّ فِي ذَلِكَ قَوْلاً، ثُمَّ انْصَرَفَ، فَأَتَاهُ رَجُلٌ مِنْ قَوْمِهِ يَشْكُو إِلَيْهِ أَنَّهُ وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، فَقَالَ عَاصِمٌ مَا ابْتُلِيتُ بِهَذَا إِلاَّ لِقَوْلِي، فَذَهَبَ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرَهُ بِالَّذِي وَجَدَ عَلَيْهِ امْرَأَتَهُ وَكَانَ ذَلِكَ الرَّجُلُ مُصْفَرًّا قَلِيلَ اللَّحْمِ سَبْطَ الشَّعَرِ، وَكَانَ الَّذِي ادَّعَى عَلَيْهِ أَنَّهُ وَجَدَهُ عِنْدَ أَهْلِهِ خَدْلاً آدَمَ كَثِيرَ اللَّحْمِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ بَيِّنْ ‏\"‏‏.‏ فَجَاءَتْ شَبِيهًا بِالرَّجُلِ الَّذِي ذَكَرَ زَوْجُهَا أَنَّهُ وَجَدَهُ، فَلاَعَنَ النَّبِيُّ صلى الله عليه وسلم بَيْنَهُمَا‏.‏ قَالَ رَجُلٌ لاِبْنِ عَبَّاسٍ فِي الْمَجْلِسِ هِيَ الَّتِي قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ رَجَمْتُ أَحَدًا بِغَيْرِ بَيِّنَةٍ رَجَمْتُ هَذِهِ ‏\"‏‏.‏ فَقَالَ لاَ تِلْكَ امْرَأَةٌ كَانَتْ تُظْهِرُ فِي الإِسْلاَمِ السُّوءَ قَالَ أَبُو صَالِحٍ وَعَبْدُ اللَّهِ بْنُ يُوسُفَ خَدِلاً‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ لَوْ كُنْتُ رَاجِمًا بِغَيْرِ بَيِّنَةٍ ‏\"‏",
                "headingUrdu": "\"اگر میں کسی بھی شخص کو بغیر گواہوں کے سنگسار کر دوں۔\"",
                "headingEnglish": "\"If I were to stone any person to death without witnesses.\"",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5080,
                "hadithNumber": "5311",
                "englishNarrator": "Narrated Sa`id bin Jubair:",
                "hadithEnglish": "I asked Ibn `Umar رضی اللہ عنہما , \"(What is the verdict if) a man accuses his wife of illegal sexual intercourse?\" Ibn `Umar رضی اللہ عنہما said, \"The Prophet (ﷺ) separated (by divorce) the couple of Bani Al-Ajlan, and said, (to them), 'Allah knows that one of you two is a liar; so will one of you repent?' But both of them refused. He again said, 'Allah knows that one of you two is a liar; so will one of you repent?' But both of them refused. So he separated them by divorce.\" (Aiyub, a sub-narrator said: `Amr bin Dinar said to me, \"There is something else in this Hadith which you have not mentioned. It goes thus: The man said, 'What about my money (i.e. the Mahr that I have given to my wife)?' It was said, 'You have no right to restore any money, for if you have spoken the truth (as regards the accusation), you have also consummated your marriage with her; and if you have told a lie, you are less rightful to have your money back.' \")",
                "hadithUrdu": "میں نے حضرت ابن  عمررضی اللہ عنہما سے ایسے شخص کا حکم پوچھا جس نے اپنی بیوی پر تہمت لگائی ہو تو انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے بنی عجلان کے میاں بیوی کے درمیان ایسی صورت میں جدائی کرا دی تھی اور فرمایا تھا کہ اللہ خوب جانتا ہے کہ تم میں سے ایک جھوٹا ہے ، تو کیا تم میں سے ایک ( جو واقعی گناہ میں مبتلا ہو ) رجو ع کرے گا لیکن ان دونوں نے انکار کیا تو حضور اکرم صلی اللہ علیہ وسلم نے ان میں جدائی کر دی ۔ اور بیان کیا کہ مجھ سے عمرو بن دینار نے فرمایا کہ حدیث کے بعض اجزاء میرا خیال ہے کہ میں نے ابھی تم سے بیان نہیں کئے ہیں ۔ فرمایا کہ ان صاحب نے ( جنہوں نے لعان کیا تھا ) کہا کہ میرے مال کا کیا ہو گا ( جو میں نے مہر میں دیا تھا ) بیان کیا کہ اس پر ان سے کہا گیا کہ وہ مال ( جو عورت کو مہر میں دیا تھا ) اب تمہارا نہیں رہا ۔ اگر تم سچے ہو ( اس تہمت لگانے میں تب بھی کیونکہ ) تم اس عورت کے پاس تنہائی میں جا چکے ہو اور اگر تم جھوٹے ہو تب تو تم کو اور بھی مہر نہ ملنا چاہیئے ۔",
                "urduNarrator": "ہم سے عمرو بن زرارہ نے بیان کیا ، کہا ہم کو اسماعیل نے خبر دی ، انہیں ایوب نے ، ان سے سعید بن جبیر نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عُمَرَ رَجُلٌ قَذَفَ امْرَأَتَهُ فَقَالَ فَرَّقَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ، وَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏‏.‏ فَأَبَيَا‏.‏ وَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبُ ‏\"‏‏.‏ فَأَبَيَا‏.‏ فَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏ فَأَبَيَا فَفَرَّقَ بَيْنَهُمَا‏.‏ قَالَ أَيُّوبُ فَقَالَ لِي عَمْرُو بْنُ دِينَارٍ إِنَّ فِي الْحَدِيثِ شَيْئًا لاَ أَرَاكَ تُحَدِّثُهُ قَالَ قَالَ الرَّجُلُ مَالِي قَالَ قِيلَ لاَ مَالَ لَكَ، إِنْ كُنْتَ صَادِقًا فَقَدْ دَخَلْتَ بِهَا، وَإِنْ كُنْتَ كَاذِبًا فَهْوَ أَبْعَدُ مِنْكَ‏.‏",
                "headingArabic": "صَدَاقِ الْمُلاَعَنَةِ",
                "headingUrdu": "لعان کے معاملے میں مہر",
                "headingEnglish": "The Mahr in the case Li'an",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5081,
                "hadithNumber": "5312",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Those who were involved in a case of Lien. He said, \"The Prophet (ﷺ) said to those who were involved in a case of Lien, 'Your accounts are with Allah. One of you two is a liar, and you (the husband) have no right over her (she is divorced).\" The man said, 'What about my property (Mahr) ?' The Prophet (ﷺ) said, 'You have no right to get back your property. If you have told the truth about her then your property was for the consummation of your marriage with her; and if you told a lie about her, then you are less rightful to get your property back.' \" Sufyan, a sub-narrator said: I learned the Hadith from `Amr. Narrated Aiyub: I heard Sa`id bin Jubair saying, \"I asked Ibn `Umar, 'If a man (accuses his wife for an illegal sexual intercourse and) carries out the process of Lian (what will happen)?' Ibn `Umar set two of his fingers apart. (Sufyan set his index finger and middle finger apart.) Ibn `Umar said, 'The Prophet (ﷺ) separated the couple of Bani Al-Ajlan by divorce and said thrice, \"Allah knows that one of you two is a liar; so will one of you repent (to Allah)?' \" Sufyan says that he has narrated this Hadith to you as helearnt it from Amr bin Dinaar and Ayyub.",
                "hadithUrdu": "ان کے متعلق رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ تمہارا حساب تو اللہ تعالیٰ کے ذمہ ہے ، تم میں سے ایک جھوٹا ہے ۔ اب تمہیں تمہاری بیوی پر کوئی اختیار نہیں ۔ ان صحابی نے عرض کیا کہ میرا مال واپس کرا دیجئیے ( جو مہر میں دیا گیا تھا ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اب وہ تمہارا مال نہیں ہے ۔ اگر تم اس کے معاملہ میں سچے ہو تو تمہارا یہ مال اس کے بدلہ میں ختم ہو چکا کہ تم نے اس کی شرمگاہ کو حلال کیا تھا اور اگر تم نے اس پر جھوٹی تہمت لگائی تھی پھر تو وہ تم سے بعید تر ہے ۔ سفیان نے بیان کیا کہ یہ حدیث میں نے عمرو سے یادکی اور ایوب نے بیان کیا کہ میں نے سعید بن جبیر سے سنا ، کہا کہ میں نے ابن عمر رضی اللہ عنہما سے ایسے شخص کے متعلق پوچھا جس نے اپنی بیوی سے لعان کیا ہو تو آپ نے اپنی دو انگلیوں سے اشارہ کیا ۔ سفیان نے اس اشارہ کو اپنی دوشہادت اور بیچ کی انگلیوں کو جداکر کے بتایا کہ نبی کریم صلی اللہ علیہ وسلم نے قبیلہ بنی عجلان کے میاں بیوی کے درمیان جدائی کرائی تھی اور فرمایا تھا کہ اللہ جانتا ہے کہ تم میں سے ایک جھوٹا ہے ، تو کیا وہ رجوع کر لے گا ؟ آپ نے تین مرتبہ یہ فرمایا ۔ علی بن عبداللہ مدینی نے کہا کہ سفیان بن عیینہ نے مجھ سے کہا ، میں نے یہ حدیث جیسے عمرو بن دینار اور ایوب سے سن کر یاد رکھی تھی ویسی ہی تجھ سے بیان کر دی ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا کہ عمرو نے کہا کہ میں نے سعید بن جبیر سے سنا ، انہوں نے بیان کیا کہ میں نے حضرت ابن عمر رضی اللہ عنہما سے لعان کرنے والوں کا حکم پوچھا تو انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، قَالَ سَأَلْتُ ابْنَ عُمَرَ عَنِ الْمُتَلاَعِنَيْنِ،، فَقَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لِلْمُتَلاَعِنَيْنِ ‏\"‏ حِسَابُكُمَا عَلَى اللَّهِ أَحَدُكُمَا كَاذِبٌ، لاَ سَبِيلَ لَكَ عَلَيْهَا ‏\"‏‏.‏ قَالَ مَالِي قَالَ ‏\"‏ لاَ مَالَ لَكَ، إِنْ كُنْتَ صَدَقْتَ عَلَيْهَا، فَهْوَ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا، وَإِنْ كُنْتَ كَذَبْتَ عَلَيْهَا، فَذَاكَ أَبْعَدُ لَكَ ‏\"‏‏.‏ قَالَ سُفْيَانُ حَفِظْتُهُ مِنْ عَمْرٍو‏.‏ وَقَالَ أَيُّوبُ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ قَالَ قُلْتُ لاِبْنِ عُمَرَ رَجُلٌ لاَعَنَ امْرَأَتَهُ فَقَالَ بِإِصْبَعَيْهِ ـ وَفَرَّقَ سُفْيَانُ بَيْنَ إِصْبَعَيْهِ السَّبَّابَةِ وَالْوُسْطَى ـ فَرَّقَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ أَخَوَىْ بَنِي الْعَجْلاَنِ، وَقَالَ ‏\"‏ اللَّهُ يَعْلَمُ إِنَّ أَحَدَكُمَا كَاذِبٌ فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏‏.‏ ثَلاَثَ مَرَّاتٍ‏.‏ قَالَ سُفْيَانُ حَفِظْتُهُ مِنْ عَمْرٍو وَأَيُّوبَ كَمَا أَخْبَرْتُكَ‏.‏",
                "headingArabic": "قَوْلِ الإِمَامِ لِلْمُتَلاَعِنَيْنِ إِنَّ أَحَدَكُمَا كَاذِبٌ فَهَلْ مِنْكُمَا تَائِبٌ",
                "headingUrdu": "\"یقینا تم دونوں میں سے ایک جھوٹا ہے، تو کیا تم میں سے کوئی توبہ کرے گا؟\"",
                "headingEnglish": "\"Surely one of you two is a liar; so will one of you repent (to Allah)?\"",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5082,
                "hadithNumber": "5313",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) separated (divorced) the wife from her husband who accused her for an illegal sexual intercourse, and made them take the oath of Lian .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اس مرد اور اس کی بیوی کے درمیان جدائی کرا دی تھی جنہوں نے اپنی بیوی پر تہمت لگائی تھی اور دونوں سے قسم لی تھی ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا ہم سے انس بن عیاض نے بیان کیا ، ان سے عبیداللہ نے اور ان سے نافع نے کہ حضرت ابن عمر رضی اللہ عنہما نے انہیں خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَّقَ بَيْنَ رَجُلٍ وَامْرَأَةٍ قَذَفَهَا، وَأَحْلَفَهُمَا‏.‏",
                "headingArabic": "التَّفْرِيقِ بَيْنَ الْمُتَلاَعِنَيْنِ",
                "headingUrdu": "لعان کے معاملے میں ملوث افراد کے درمیان علیحدگی۔",
                "headingEnglish": "The separation between those who are involved in a case of Li'an.",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5083,
                "hadithNumber": "5314",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) made an Ansari man and his wife carry out Lian, and then separated them by divorce.",
                "hadithUrdu": "قبیلہ انصار کے ایک صاحب اور ان کی بیوی کے درمیان رسول اللہ صلی اللہ علیہ وسلم نے لعان کرایا تھا اور دونوں کے درمیان جدائی کرا دی تھی ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے عبیداللہ نے ، کہا مجھے نافع نے خبر دی اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ لاَعَنَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ رَجُلٍ وَامْرَأَةٍ مِنَ الأَنْصَارِ، وَفَرَّقَ بَيْنَهُمَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5084,
                "hadithNumber": "5315",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) made a man and his wife carry out Lian, and the husband repudiated her child. So the Prophet got them separated (by divorce) and decided that the child belonged to the mother only.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک صاحب اور ان کی بیوی کے درمیان لعان کرایا تھا ، پھر ان صاحب نے اپنی بیوی کے لڑکے کا انکار کیا تو آنحضرت صلی اللہ علیہ وسلم نے دونوں کے درمیان جدائی کرا دی اور لڑکا عورت کو دے دیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہ ہم سے مالک نے ، کہا کہ مجھ سے نافع نے بیان کیا اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا مَالِكٌ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم لاَعَنَ بَيْنَ رَجُلٍ وَامْرَأَتِهِ، فَانْتَفَى مِنْ وَلَدِهَا فَفَرَّقَ بَيْنَهُمَا، وَأَلْحَقَ الْوَلَدَ بِالْمَرْأَةِ‏.‏",
                "headingArabic": "يَلْحَقُ الْوَلَدُ بِالْمُلاَعِنَةِ",
                "headingUrdu": "بچہ عورت کو دینا ہے (اس کے شوہر نے الزام لگایا ہے)۔",
                "headingEnglish": "The child is to be given to the lady (accused by her husband).",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5085,
                "hadithNumber": "5316",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Those involved in a case of Lian were mentioned before Allah's Messenger (ﷺ) `Asim bin Adi رضی اللہ عنہ said something about that and then left. Later on a man from his tribe came to him and told him that he had found another man with his wife. On that `Asim رضی اللہ عنہ said, \"I have not been put to task except for what I have said (about Lian).\" `Asim رضی اللہ عنہ نtook the man to Allah's Messenger (ﷺ) and he told him of the state in which he found his wife. The man was pale, thin and lank-haired, while the other man whom he had found with his wife was brown, fat with thick calves and curly hair. Allah's Messenger (ﷺ) said, \"O Allah! Reveal the truth.\" Then the lady delivered a child resembling the man whom her husband had mentioned he had found with her. So Allah's Messenger (ﷺ) ordered them to carry out Lien. A man from that gathering said to Ibn `Abbas رضی اللہ عنہما , \"Was she the same lady regarding whom Allah's Messenger (ﷺ) said, 'If I were to stone to death someone without witnesses, I would have stoned this lady'?\" Ibn `Abbas رضی اللہ عنہما said, \"No, that was another lady who, though being a Muslim, used to arouse suspicion because of her outright misbehavior.\"",
                "hadithUrdu": "لعان کرنے والوں کا ذکر نبی کریم صلی اللہ علیہ وسلم کی مجلس میں ہو اتو عاصم بن عدی رضی اللہ عنہ نے اس پر ایک بات کہی ( کہ اگر میں اپنی بیوی کے ساتھ کسی کو پاؤں تو وہیں قتل کر ڈالوں ) پھر واپس آئے تو ان کی قوم کے ایک صاحب ان کے پاس آئے اور ان سے کہا کہ میں نے اپنی بیوی کے ساتھ ایک غیر مرد کو پایا ہے ۔ عاصم رضی اللہ عنہ نے کہا کہ اس معاملہ میں میرا یہ ابتلاء میری اس بات کی وجہ سے ہوا ہے ( جس کے کہنے کی جرات میں نے حضور اکرم صلی اللہ علیہ وسلم کے سامنے کی تھی ) پھر وہ ان صاحب کو ساتھ لے کر آنحضرت صلی اللہ علیہ وسلم کے پاس گئے اور آنحضرت صلی اللہ علیہ وسلم کو اس صورت سے مطلع کیا جس میں انہوں نے اپنی بیوی کو پایا تھا ۔ یہ صاحب زرد رنگ ، کم گوشت والے اور سیدھے بالوں والے تھے اور وہ جسے انہوں نے اپنی بیوی کے پاس پایا تھا گندمی گھٹے جسم کا زرد ، بھرے گوشت والا تھا اس کے بال بہت زیادہ گھونگھریالے تھے ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا ، اے اللہ ! معاملہ صاف کر دے چنانچہ ان کی بیوی نے جو بچہ جنا وہ اسی شخص سے مشابہ تھا جس کے متعلق شوہر نے کہا تھا کہ انہوں نے اپنی بیوی کے پاس اسے پایا تھا ۔ پھر حضور اکرم صلی اللہ علیہ وسلم نے دونوں کے درمیان لعان کرایا ۔ ابن عباس رضی اللہ عنہما سے ایک شاگرد نے مجلس میں پوچھا ، کیا یہ وہی عورت ہے جس کے متعلق حضور اکرم صلی اللہ علیہ وسلم نے فرمایا تھا کہ اگر میں کسی کو بلاشہادت سنگسار کرتا تو اسے کرتا ؟ ابن عباس رضی اللہ عنہما نے کہا کہ نہیں ۔ یہ دوسری عورت تھی جو اسلام کے زمانہ میں اعلانیہ بدکاری کیا کرتی تھی ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے سلیمان بن بلال نے بیان کیا ، ان سے یحییٰ بن سعید نے ، کہا کہ مجھے عبدالرحمٰن بن قاسم نے خبر دی ، انہیں قاسم بن محمد نے اور انہیں ابن عباس رضی اللہ عنہما نے ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ ذُكِرَ الْمُتَلاَعِنَانِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ عَاصِمُ بْنُ عَدِيٍّ فِي ذَلِكَ قَوْلاً، ثُمَّ انْصَرَفَ فَأَتَاهُ رَجُلٌ مِنْ قَوْمِهِ، فَذَكَرَ لَهُ أَنَّهُ وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، فَقَالَ عَاصِمٌ مَا ابْتُلِيتُ بِهَذَا الأَمْرِ إِلاَّ لِقَوْلِي‏.‏ فَذَهَبَ بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ بِالَّذِي وَجَدَ عَلَيْهِ امْرَأَتَهُ، وَكَانَ ذَلِكَ الرَّجُلُ مُصْفَرًّا قَلِيلَ اللَّحْمِ سَبْطَ الشَّعَرِ، وَكَانَ الَّذِي وَجَدَ عِنْدَ أَهْلِهِ آدَمَ خَدْلاً كَثِيرَ اللَّحْمِ جَعْدًا قَطَطًا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ بَيِّنْ ‏\"‏‏.‏ فَوَضَعَتْ شَبِيهًا بِالرَّجُلِ الَّذِي ذَكَرَ زَوْجُهَا أَنَّهُ وَجَدَ عِنْدَهَا، فَلاَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُمَا، فَقَالَ رَجُلٌ لاِبْنِ عَبَّاسٍ فِي الْمَجْلِسِ هِيَ الَّتِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ رَجَمْتُ أَحَدًا بِغَيْرِ بَيِّنَةٍ لَرَجَمْتُ هَذِهِ ‏\"‏‏.‏ فَقَالَ ابْنُ عَبَّاسٍ لاَ تِلْكَ امْرَأَةٌ كَانَتْ تُظْهِرُ السُّوءَ فِي الإِسْلاَمِ‏.‏",
                "headingArabic": "قَوْلِ الإِمَامِ اللَّهُمَّ بَيِّنْ",
                "headingUrdu": "\"اے اللہ! حقیقت بیان فرما۔\"",
                "headingEnglish": "\"O Allah! Reveal the truth.\"",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5086,
                "hadithNumber": "5317",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Rifa`a Al-Qurazi رضی اللہ عنہ married a lady and then divorced her whereupon she married another man. She came to the Prophet (ﷺ) and said that her new husband did not approach her, and that he was completely impotent. The Prophet (ﷺ) said (to her), \"No (you cannot remarry your first husband) till you taste the second husband and he tastes you (i.e. till he consummates his marriage with you).",
                "hadithUrdu": "رفاعہ قرظی رضی اللہ عنہ نے ایک خاتون سے نکاح کیا ، پھر انہیں طلاق دے دی ، اس کے بعد ایک دوسرے صاحب نے ان خاتون سے نکاح کر لیا ، پھر وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور اپنے دوسرے شوہر کا ذکر کیا اور کہا کہ وہ تو ان کے پاس آتے ہی نہیں اور یہ کہ ان کے پاس کپڑے کے پلو جیسا ہے ( انہوں نے پہلے شوہر کے ساتھ دوبارہ نکاح کی خواہش ظاہر کی لیکن ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ۔ جب تک تم اس ( دوسرے شوہر ) کا مزا نہ چکھ لو اور یہ تمہارا مزا نہ چکھ لیں ۔",
                "urduNarrator": "ہم سے عمرو بن علی نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، کہا ہم سے ہشام نے بیان کیا ، کہا کہ مجھ سے میرے والد نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ( دوسری سند اور حضرت امام بخاری رحمہ اللہ نے کہا کہ ) ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے عبدہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنِي أَبِي، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رِفَاعَةَ، الْقُرَظِيَّ تَزَوَّجَ امْرَأَةً، ثُمَّ طَلَّقَهَا فَتَزَوَّجَتْ آخَرَ فَأَتَتِ النَّبِيَّ صلى الله عليه وسلم فَذَكَرَتْ لَهُ أَنَّهُ لاَ يَأْتِيهَا، وَإِنَّهُ لَيْسَ مَعَهُ إِلاَّ مِثْلُ هُدْبَةٍ فَقَالَ ‏ \"‏ لاَ حَتَّى تَذُوقِي عُسَيْلَتَهُ، وَيَذُوقَ عُسَيْلَتَكِ ‏\"‏‏.‏",
                "headingArabic": "إِذَا طَلَّقَهَا ثَلاَثًا ثُمَّ تَزَوَّجَتْ بَعْدَ الْعِدَّةِ زَوْجًا غَيْرَهُ فَلَمْ يَمَسَّهَا",
                "headingUrdu": "طلاق یافتہ عورت کا دوسرے مرد سے نکاح لیکن وہ اس کے ساتھ نکاح نہیں کرتا",
                "headingEnglish": "Marriage of a divorced woman to another man but he does not consummate his marriage with her",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5087,
                "hadithNumber": "5318",
                "englishNarrator": "Narrated Um Salama (the wife of the Prophet):",
                "hadithEnglish": "A lady from Bani Aslam, called Subai'a, become a widow while she was pregnant. Abu As-Sanabil bin Ba'kak  رضی اللہ عنہ demanded her hand in marriage, but she refused to marry him and said, \"By Allah, I cannot marry him unless I have completed one of the two prescribed periods.\" About ten days later (after having delivered her child), she went to the Prophet (ﷺ) and he said (to her), \"You can marry now.\"",
                "hadithUrdu": "ایک خاتون جو اسلام لائی تھیں اور جن کا نام سبیعہ تھا ، اپنے شوہر کے ساتھ رہتی تھیں ، شوہر کا جب انتقال ہوا تو وہ حاملہ تھیں ۔ ابو سنان بن بعکک رضی اللہ عنہ نے ان کے پاس نکاح کا پیغام بھیجا لیکن انہوں نے نکاح کرنے سے انکار کیا ۔ ابو السنابل نے کہا کہ اللہ کی قسم ! جب تک عدت کی دو مدتوں میں سے لمبی نہ گزارلوں گی ، تمہارے لیے اس سے ( جس سے نکاح وہ کرنا چاہتی تھیں ) نکاح کرنا صحیح نہیں ہو گا ۔ پھر وہ ( وضع حمل کے بعد ) تقریباً دس دن تک رکی رہیں ۔ اس کے بعد حضور اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اب نکاح کر لو ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے جعفربن ربیعہ نے ، ان سے عبدالرحمٰن بن ہرمز نے ، کہا کہ مجھے خبر دی ابوسلمہ بن عبدالرحمٰن نے کہ زینب ام سلمہ رضی اللہ عنہا نے اپنی والدہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ الأَعْرَجِ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ، أَخْبَرَتْهُ عَنْ أُمِّهَا أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ امْرَأَةً مِنْ أَسْلَمَ يُقَالُ لَهَا سُبَيْعَةُ كَانَتْ تَحْتَ زَوْجِهَا، تُوُفِّيَ عَنْهَا وَهْىَ حُبْلَى، فَخَطَبَهَا أَبُو السَّنَابِلِ بْنُ بَعْكَكٍ، فَأَبَتْ أَنْ تَنْكِحَهُ، فَقَالَ وَاللَّهِ مَا يَصْلُحُ أَنْ تَنْكِحِيهِ حَتَّى تَعْتَدِّي آخِرَ الأَجَلَيْنِ‏.‏ فَمَكُثَتْ قَرِيبًا مِنْ عَشْرِ لَيَالٍ ثُمَّ جَاءَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ انْكِحِي ‏\"‏‏.‏",
                "headingArabic": "{وَأُولاَتُ الأَحْمَالِ أَجَلُهُنَّ أَنْ يَضَعْنَ حَمْلَهُنَّ}",
                "headingUrdu": "\"جو حاملہ ہوں ان کی عدت اس وقت تک ہے جب تک کہ وہ اپنا بوجھ نہ ڈالیں۔\"",
                "headingEnglish": "\"For those who are pregnant, their 'Idda is until they laydown their burdens.\"",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5088,
                "hadithNumber": "5319",
                "englishNarrator": "Narrated Subai'a Al-Aslamiya:",
                "hadithEnglish": "The Prophet had given her the verdict. She said, \"The Prophet, gave me his verdict that after I gave birth, I could marry.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ان کے متعلق کیا فتویٰ دیا تھا تو انہوں نے فرمایا کہ جب میرے یہاں بچہ پیدا ہو گیا تو آنحضرت نے مجھے فتویٰ دیا کہ اب میں نکاح کر لوں ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، ان سے لیث نے ، ان سے یزید نے کہ ابن شہاب نے انہیں لکھا کہ عبیداللہ بن عبداللہ نے اپنے والد ( عبداللہ بن عتبہ بن مسعود ) سے انہیں خبر دی کہ انہوں نے ابن الارقم کو لکھا کہ سبیعہ اسلمیہ سے پوچھیں کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، عَنِ اللَّيْثِ، عَنْ يَزِيدَ، أَنَّ ابْنَ شِهَابٍ، كَتَبَ إِلَيْهِ أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ عَنْ أَبِيهِ، أَنَّهُ كَتَبَ إِلَى ابْنِ الأَرْقَمِ أَنْ يَسْأَلَ، سُبَيْعَةَ الأَسْلَمِيَّةَ كَيْفَ أَفْتَاهَا النَّبِيُّ صلى الله عليه وسلم فَقَالَتْ أَفْتَانِي إِذَا وَضَعْتُ أَنْ أَنْكِحَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5089,
                "hadithNumber": "5320",
                "englishNarrator": "Narrated Al-Miswer bin Makhrama:",
                "hadithEnglish": "Subai'a Al-Aslamiya gave birth to a child a few days after the death of her husband. She came to the Prophet and asked permission to remarry, and the Prophet (ﷺ) gave her permission, and she got married.",
                "hadithUrdu": "سبیعہ اسلمیہ اپنے شوہر کی وفات کے بعد چند دنوں تک حالت نفاس میں رہیں ، پھر نبی کریم صلی اللہ علیہ وسلم کے پاس آ کر انہوں نے نکاح کی اجازت مانگی تو آنحضرت صلی اللہ علیہ وسلم نے انہیں اجازت دی اور انہوں نے نکاح کیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے ، ان سے مسور بن مخرمہ نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّ سُبَيْعَةَ الأَسْلَمِيَّةَ، نُفِسَتْ بَعْدَ وَفَاةِ زَوْجِهَا، بِلَيَالٍ فَجَاءَتِ النَّبِيَّ صلى الله عليه وسلم فَاسْتَأْذَنَتْهُ أَنْ تَنْكِحَ، فَأَذِنَ لَهَا، فَنَكَحَتْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5090,
                "hadithNumber": "5321, 5322",
                "englishNarrator": "Narrated Qasim bin Muhammad and Sulaiman bin Yasar:",
                "hadithEnglish": "Yahya bin Sa`id bin Al-`As divorced the daughter of `Abdur-Rahman bin Al-Hakarn. `Abdur- Rahman took her to his house. On that `Aisha رضی اللہ عنہا sent a message to Marwan bin Al-Hakam who was the ruler of Medina, saying, \"Fear Allah, and urge your brother) to return her to her house.\" Marwan (in Sulaiman's version) said, \"Abdur-Rahman bin Al-Hakam did not obey me (or had a convincing argument).\" (In Al-Qasim's versions Marwan said, \"Have you not heard of the case of Fatima bint Qais?\" Aisha رضی اللہ عنہا said, \"The case of Fatima bint Qais رضی اللہ عنہا is not in your favor.' Marwan bin Al-Hakam said to `Aisha رضی اللہ عنہا , \"The reason that made Fatima bint Qais go to her father's house is just applicable to the daughter of `Abdur-Rahman.\"",
                "hadithUrdu": "یحییٰ بن سعید بن العاص نے عبدالرحمٰن بن حکم کی صاحبزادی ( عمرہ ) کو طلاق دے دی تھی اور ان کے باپ عبدالرحمٰن انہیں ان کے ( شوہر کے ) گھر سے لے آئے ( عدت کے ایام گزرنے سے پہلے ) عائشہ رضی اللہ عنہا کو جب معلوم ہوا تو انہوں نے مروان بن حکم کے یہاں ، جو اس وقت مدینہ کا امیر تھا ، کہلوایا کہ اللہ سے ڈرو اور لڑکی کو اس کے گھر ( جہاں اسے طلاق ہوئی ہے ) پہنچا دو ، جیسا کہ سلیمان بن یسار کی حدیث میں ہے ۔ مروان نے اس کو جواب یہ دیا کہ لڑکی کے والد عبدالرحمٰن بن حکم نے میری بات نہیں مانی اور قاسم بن محمد نے بیان کیا کہ ( مروان نے ام المؤمنین کو یہ جواب دیا کہ ) کیا آپ کو فاطمہ بنت قیس رضی اللہ عنہا کے معاملہ کا علم نہیں ہے ؟ ( انہوں نے بھی اپنے شوہر کے گھر عدت نہیں گزاری تھی ) عائشہ رضی اللہ عنہا نے بتلایا کہ اگر تم فاطمہ کے واقعہ کا حوالہ نہ دیتے تب بھی تمہارا کچھ نہ بگڑ تا ( کیونکہ وہ تمہارے لیے دلیل نہیں بن سکتا ) مروان بن حکم نے اس پر کہا کہ اگر آپ کے نزدیک ( فاطمہ رضی اللہ عنہا کا ان کے شوہر کے گھر سے منتقل کرنا ) ان کے اور ان کے شوہر کے رشتہ داری کے درمیان کشیدگی کی وجہ سے تھا تو یہاں بھی یہی وجہ کافی ہے کہ دونوں ( میاں بیوی ) کے درمیان کشیدگی تھی ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، کہا ہم سے یحییٰ بن سعید انصاری نے ، ان سے قاسم بن محمد اور سلیمان بن یسار نے ، وہ دونوں بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ سَمِعَهُ يَذْكُرُ، أَنَّ يَحْيَى بْنَ سَعِيدِ بْنِ الْعَاصِ، طَلَّقَ بِنْتَ عَبْدِ الرَّحْمَنِ بْنِ الْحَكَمِ، فَانْتَقَلَهَا عَبْدُ الرَّحْمَنِ، فَأَرْسَلَتْ عَائِشَةُ أُمُّ الْمُؤْمِنِينَ إِلَى مَرْوَانَ وَهْوَ أَمِيرُ الْمَدِينَةِ اتَّقِ اللَّهَ وَارْدُدْهَا إِلَى بَيْتِهَا‏.‏ قَالَ مَرْوَانُ فِي حَدِيثِ سُلَيْمَانَ إِنَّ عَبْدَ الرَّحْمَنِ بْنَ الْحَكَمِ غَلَبَنِي‏.‏ وَقَالَ الْقَاسِمُ بْنُ مُحَمَّدٍ أَوَمَا بَلَغَكِ شَأْنُ فَاطِمَةَ بِنْتِ قَيْسٍ قَالَتْ لاَ يَضُرُّكَ أَنْ لاَ تَذْكُرَ حَدِيثَ فَاطِمَةَ‏.‏ فَقَالَ مَرْوَانُ بْنُ الْحَكَمِ إِنْ كَانَ بِكِ شَرٌّ فَحَسْبُكِ مَا بَيْنَ هَذَيْنِ مِنَ الشَّرِّ‏.",
                "headingArabic": "قِصَّةِ فَاطِمَةَ بِنْتِ قَيْسٍ",
                "headingUrdu": "فاطمہ بنت قیس کا قصہ",
                "headingEnglish": "The story of Fatima bint Qais",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5091,
                "hadithNumber": "5323, 5324",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"What is wrong with Fatima? Why doesn't she fear Allah?\" by saying that a divorced lady is not entitled to be provided with residence and sustenance (by her husband).",
                "hadithUrdu": "فاطمہ بنت قیس خدا سے ڈرتی نہیں ! ان کااشارہ ان کے اس قول کی طرف تھا ( کہ مطلقہ بائنہ کو ) نفقہ وسکنٰی دینا ضروری نہیں جو کہتی ہے کہ طلاق بائن جس عورت پر پڑے اسے مسکن اور خرچہ نہیں ملے گا ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر محمد بن جعفر نے بیان کیا ، کہا ہم سے شعبہ بن حجاج نے بیان کیا ، ان سے عبدالرحمٰن بن قاسم نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ مَا لِفَاطِمَةَ أَلاَ تَتَّقِي اللَّهَ، يَعْنِي فِي قَوْلِهَا لاَ سُكْنَى وَلاَ نَفَقَةَ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5092,
                "hadithNumber": "5325, 5326",
                "englishNarrator": "Narrated `Urwa said to `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"Do you know so-and-so, the daughter of Al-Hakam? Her husband divorced her irrevocably and she left (her husband's house).\" `Aisha رضی اللہ عنہا said, \"What a bad thing she has done!\" `Urwa said (to `Aisha رضی اللہ عنہا ), \"Haven't you heard the statement of Fatima رضی اللہ عنہا ?\" `Aisha replied, \"It is not in her favor to mention.\" `Urwa added, `Aisha رضی اللہ عنہا reproached (Fatima رضی اللہ عنہا) severely and said, \"Fatima رضی اللہ عنہا was in a lonely place, and she was prone to danger, so the Prophet (ﷺ) allowed her (to go out of her husband's house).",
                "hadithUrdu": "آپ فلانہ ( عمرہ ) بنت حکم کا معاملہ نہیں دیکھتیں ۔ ان کے شوہر نے انہیں طلاق بائنہ دے دی اور وہ وہاں سے نکل آئیں ( عدت گزارے بغیر ) حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ جو کچھ اس نے کیا بہت برا کیا ۔ عروہ نے کہا آپ نے فاطمہ رضی اللہ عنہا کے واقعہ کے متعلق نہیں سنا ۔ بتلایا کہ اس کے لیے اس حدیث کو ذکر کرنے میں کوئی خیرنہیں ہے اورابن ابی زناد نے ہشام سے یہ اضافہ کیا ہے اور ان سے ان کے والد نے بیان کیا کہ حضرت عائشہ رضی اللہ عنہا نے ( عمرہ بنت حکم کے معاملہ پر ) اپنی شدید نا گواری کا اظہار فرمایا اور فرمایا کہ فاطمہ بنت قیس رضی اللہ عنہ تو ایک اجاڑ جگہ میں تھیں اور اس کے چاروں طرف خوف اوروحشت برستی تھی ، اس لیے نبی کریم صلی اللہ علیہ وسلم نے ( وہاں سے منتقل ہونے کی ) انہیں اجازت دے دی تھی ۔",
                "urduNarrator": "ہم سے عمرو بن عباس نے بیان کیا ، کہا ہم سے ابن مہدی نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے عبدالرحمٰن بن قاسم نے ، ان سے ان کے والد نے کہ عروہ بن زبیر نے حضرت عائشہ رضی اللہ عنہا سے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، قَالَ عُرْوَةُ بْنُ الزُّبَيْرِ لِعَائِشَةَ أَلَمْ تَرَيْنَ إِلَى فُلاَنَةَ بِنْتِ الْحَكَمِ طَلَّقَهَا زَوْجُهَا الْبَتَّةَ فَخَرَجَتْ‏.‏ فَقَالَتْ بِئْسَ مَا صَنَعَتْ‏.‏ قَالَ أَلَمْ تَسْمَعِي فِي قَوْلِ فَاطِمَةَ قَالَتْ أَمَا إِنَّهُ لَيْسَ لَهَا خَيْرٌ فِي ذِكْرِ هَذَا الْحَدِيثِ‏.‏ وَزَادَ ابْنُ أَبِي الزِّنَادِ عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَابَتْ عَائِشَةُ أَشَدَّ الْعَيْبِ وَقَالَتْ إِنَّ فَاطِمَةَ كَانَتْ فِي مَكَانٍ وَحِشٍ فَخِيفَ عَلَى نَاحِيَتِهَا، فَلِذَلِكَ أَرْخَصَ لَهَا النَّبِيُّ صلى الله عليه وسلم‏.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5093,
                "hadithNumber": "5327, 5328",
                "englishNarrator": "Narrated `Urwa:",
                "hadithEnglish": "`Aisha رضی اللہ عنہا disapproved of what Fatima رضی اللہ عنہ used to say.",
                "hadithUrdu": "عائشہ رضی اللہ عنہا نے فاطمہ بنت قیس رضی اللہ عنہ کی اس بات کا ( کہ مطلقہ بائنہ کو نفقہ وسکنٰی نہیں ملے گا ) انکار کیا ۔",
                "urduNarrator": "مجھ سے حبان بن موسیٰ نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو ابن جریج نے خبر دی ، انہیں ابن شہاب نے ، انہیں عروہ نے کہ",
                "hadithArabic": "حَدَّثَنِي حِبَّانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، أَنْكَرَتْ ذَلِكَ عَلَى فَاطِمَةَ‏.‏",
                "headingArabic": "الْمُطَلَّقَةِ إِذَا خُشِيَ عَلَيْهَا فِي مَسْكَنِ زَوْجِهَا أَنْ يُقْتَحَمَ عَلَيْهَا، أَوْ تَبْذُوَ عَلَى أَهْلِهَا بِفَاحِشَةٍ",
                "headingUrdu": "اگر طلاق یافتہ عورت کو ڈر ہو کہ اس کے شوہر کے گھر میں حملہ ہو سکتا ہے۔",
                "headingEnglish": "If a divorced lady is afraid that she may be attacked in her husband's house.",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5094,
                "hadithNumber": "5329",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) decided to leave Mecca after the Hajj, he saw Safiyya رضی اللہ عنہا , sad and standing at the entrance of her tent. He said to her, \"Aqr (or) Halq! You will detain us. Did you perform Tawaf-al- Ifada on the day of Nahr? She said, \"Yes.\" He said, \"Then you can depart.\"",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم نے ( حجۃ الوداع میں ) کوچ کا ارادہ کیا تو دیکھا کہ صفیہ رضی اللہ عنہا اپنے خیمہ کے دروازے پر غمگین کھڑی ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا ” عقریٰ “ یا ( فرمایا راوی کو شک تھا ) ” حلقٰی “ معلوم ہوتا ہے کہ تم ہمیں روک دوگی ، کیا تم نے قربانی کے دن طواف کر لیا ہے ؟ انہوں نے عرض کی کہ جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر چلو ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ بن حجاج نے ، ان سے حکم بن عتبہ نے ، ان سے ابراہیم نخعی نے ، ان سے اسود بن یزید نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا أَرَادَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَنْفِرَ إِذَا صَفِيَّةُ عَلَى باب خِبَائِهَا كَئِيبَةً، فَقَالَ لَهَا ‏\"‏ عَقْرَى ـ أَوْ حَلْقَى ـ إِنَّكِ لَحَابِسَتُنَا أَكُنْتِ أَفَضْتِ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قَالَتْ نَعَمْ‏.‏ قَالَ ‏\"‏ فَانْفِرِي إِذًا ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَلاَ يَحِلُّ لَهُنَّ أَنْ يَكْتُمْنَ مَا خَلَقَ اللَّهُ فِي أَرْحَامِهِنَّ} مِنَ الْحَيْضِ وَالْحَبَلِ",
                "headingUrdu": "\"اور ان کے لیے یہ جائز نہیں کہ اللہ نے ان کے رحم میں جو کچھ پیدا کیا ہے اسے چھپائیں۔\"",
                "headingEnglish": "\"And it is not lawful for them to conceal what Allah has created in their wombs.\"",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5095,
                "hadithNumber": "5330",
                "englishNarrator": "Narrated Al-Hasan:",
                "hadithEnglish": "Ma'qil gave his sister in marriage and later her husband divorced her once.",
                "hadithUrdu": "معقل بن یسار رضی اللہ عنہ نے اپنی بہن جمیلہ کا نکاح کیا ، پھر ( ان کے شوہر نے ) انہیں ایک طلاق دی ۔",
                "urduNarrator": "مجھ سے محمد بن سلام نے بیان کیا ، کہا ہم کو عبدالوہاب ثقفی نے خبر دی ، ان سے یونس بن عبید نے بیان کیا ، ان سے امام حسن بصری نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا يُونُسُ، عَنِ الْحَسَنِ، قَالَ زَوَّجَ مَعْقِلٌ أُخْتَهُ فَطَلَّقَهَا تَطْلِيقَةً‏.‏",
                "headingArabic": "{وَبُعُولَتُهُنَّ أَحَقُّ بِرَدِّهِنَّ}",
                "headingUrdu": "\"اور ان کے شوہروں کو ان کو واپس لینے کا بہتر حق ہے...\"",
                "headingEnglish": "\"And their husbands have the better right to take them back...\"",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5096,
                "hadithNumber": "5331",
                "englishNarrator": "Narrated Al-Hasan:",
                "hadithEnglish": "The sister of Ma'qil bin Yasar رضی اللہ عنہ was married to a man and then that man divorced her and remained away from her till her period of the 'Iddah expired. Then he demanded for her hand in marriage, but Ma'qil رضی اللہ عنہ got angry out of pride and haughtiness and said, \"He kept away from her when he could still retain her, and now he demands her hand again?\" So Ma'qil disagreed to remarry her to him. Then Allah revealed: 'When you have divorced women and they have fulfilled the term of their prescribed period, do not prevent them from marrying their (former) husbands.' (2.232) So the Prophet (ﷺ) sent for Ma'qil and recited to him (Allah's order) and consequently Ma'qil gave up his pride and haughtiness and yielded to Allah's order.",
                "hadithUrdu": "معقل بن یساررضی اللہ عنہ کی بہن ایک آدمی کے نکاح میں تھیں ، پھر انہوں نے انہیں طلاق دے دی ، اس کے بعد انہوں نے تنہائی میں عدت گزاری ۔ عدت کے دن جب ختم ہو گئے تو ان کے پہلے شوہر نے ہی پھر معقل رضی اللہ عنہ کے پاس ان کے لیے نکاح کا پیغام بھیجا ۔ معقل کو اس پر بڑی غیرت آئی ۔ انہوں نے کہا جب وہ عدت گزار رہی تھی تو اسے اس پر قدرت تھی ( کہ دوران عدت میں رجعت کر لیں لیکن ایسا نہیں کیا ) اور اب میرے پاس نکاح کا پیغام بھیجتا ہے ۔ چنانچہ وہ ان کے اور اپنی بہن کے درمیان میں حائل ہو گئے ۔ اس پر یہ آیت نازل ہوئی ۔ ” اور جب تم اپنی عورتوں کوطلاق دے چکو اور وہ اپنی مدت کو پہنچ چکیں تو تم انہیں مت روکو “ آخر آیت تک “ پھر رسول اللہ صلی اللہ علیہ وسلم نے انہیں بلا کر یہ آیت سنائی تو انہوں نے ضد چھوڑ دی اور اللہ کے حکم کے سامنے جھک گئے ۔",
                "urduNarrator": "مجھ سے محمد بن مثنٰی نے بیان کیا ، کہا ہم سے عبدالاعلیٰ نے بیان کیا ، کہا ہم سے سعید بن ابی عروبہ نے ، ان سے قتادہ نے ، کہا ہم سے امام حسن بصری نے بیان کیا کہ",
                "hadithArabic": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، حَدَّثَنَا الْحَسَنُ، أَنَّ مَعْقِلَ بْنَ يَسَارٍ، كَانَتْ أُخْتُهُ تَحْتَ رَجُلٍ فَطَلَّقَهَا، ثُمَّ خَلَّى عَنْهَا حَتَّى انْقَضَتْ عِدَّتُهَا، ثُمَّ خَطَبَهَا فَحَمِيَ مَعْقِلٌ مِنَ ذَلِكَ أَنَفًا فَقَالَ خَلَّى عَنْهَا وَهْوَ يَقْدِرُ عَلَيْهَا، ثُمَّ يَخْطُبُهَا فَحَالَ بَيْنَهُ وَبَيْنَهَا، فَأَنْزَلَ اللَّهُ ‏{‏وَإِذَا طَلَّقْتُمُ النِّسَاءَ فَبَلَغْنَ أَجَلَهُنَّ فَلاَ تَعْضُلُوهُنَّ‏}‏ إِلَى آخِرِ الآيَةِ، فَدَعَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَرَأَ عَلَيْهِ، فَتَرَكَ الْحَمِيَّةَ وَاسْتَقَادَ لأَمْرِ اللَّهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5097,
                "hadithNumber": "5332",
                "englishNarrator": "Narrated Ibn `Umar bin Al-Khattab رضی اللہ عنہما :",
                "hadithEnglish": "He divorced his wife during her menses. Allah's Messenger (ﷺ) ordered him to take her back till she became clean, and when she got another period while she was with him, she should wait till she became clean again and only then, if he wanted to divorce her, he could do so before having sexual relations with her. And that is the period Allah has fixed for divorcing women. Whenever `Abdullah (bin `Umar رضی اللہ عنہما) was asked about that, he would say to the questioner, \"If you divorced her thrice, she is no longer lawful for you unless she marries another man (and the other man divorces her in his turn).' Ibn `Umar رضی اللہ عنہما further said, 'Would that you (people) only give one or two divorces, because the Prophet (ﷺ) has ordered me so.\"",
                "hadithUrdu": "انہوں نے اپنی بیوی کو ایک طلاق دی تو اس وقت وہ حائضہ تھیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے ان کو حکم دیا کہ رجعت کر لیں اور انہیں اس وقت تک اپنے ساتھ رکھیں جب تک وہ اس حیض سے پاک ہونے کے بعد پھر دوبارہ حائضہ نہ ہوں ۔ اس وقت بھی ان سے کوئی تعرض نہ کریں اور جب وہ اس حیض سے بھی پاک ہو جائیں تو اگر اس وقت انہیں طلاق دینے کا ارادہ ہو تو طہر میں اس سے پہلے کہ ان سے ہمبستری کریں ، طلاق دیں ۔ پس یہی وہ وقت ہے جس کے متعلق اللہ تعالیٰ نے حکم دیا ہے کہ اس میں عورتوں کو طلاق دی جائے اور عبداللہ بن عمر رضی اللہ عنہما سے اگر اس کے ( مطلقہ ثلاثہ کے ) بارے میں سوال کیا جاتا تو سوال کرنے والے سے وہ کہتے کہ اگر تم نے تین طلاقیں دے دی ہیں تو پھر تمہاری بیوی تم پر حرام ہے ۔ یہاں تک کہ وہ تمہارے سوا دوسرے شوہر سے نکاح کرے ۔ غیر قتیبۃ ( ابو الجہم ) کے اس حدیث میں لیث سے یہ اضافہ کیا ہے کہ ( انہوں نے بیان کیا کہ ) مجھ سے نافع نے بیان کیا اور ان سے ابن عمر رضی اللہ عنہما نے کہا کہ اگر تم نے اپنی بیوی کو ایک یا دو طلاق دے دی ہو ۔ تو تم اسے دوبارہ اپنے نکاح میں لا سکتے ہو ) کیونکہ نبی کریم صلی اللہ علیہ وسلم نے مجھے اس کا حکم دیا تھا ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے نافع نے اور ان سے ابن عمر بن خطاب رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنهما ـ طَلَّقَ امْرَأَةً لَهُ وَهْىَ حَائِضٌ تَطْلِيقَةً وَاحِدَةً، فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُرَاجِعَهَا، ثُمَّ يُمْسِكَهَا حَتَّى تَطْهُرَ، ثُمَّ تَحِيضَ عِنْدَهُ حَيْضَةً أُخْرَى، ثُمَّ يُمْهِلَهَا حَتَّى تَطْهُرَ مِنْ حَيْضِهَا، فَإِنْ أَرَادَ أَنْ يُطَلِّقَهَا فَلْيُطَلِّقْهَا حِينَ تَطْهُرُ مِنْ قَبْلِ أَنْ يُجَامِعَهَا، فَتِلْكَ الْعِدَّةُ الَّتِي أَمَرَ اللَّهُ أَنْ تُطَلَّقَ لَهَا النِّسَاءُ‏.‏ وَكَانَ عَبْدُ اللَّهِ إِذَا سُئِلَ عَنْ ذَلِكَ قَالَ لأَحَدِهِمْ إِنْ كُنْتَ طَلَّقْتَهَا ثَلاَثًا فَقَدْ حَرُمَتْ عَلَيْكَ، حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ‏.‏ وَزَادَ فِيهِ غَيْرُهُ عَنِ اللَّيْثِ حَدَّثَنِي نَافِعٌ قَالَ ابْنُ عُمَرَ لَوْ طَلَّقْتَ مَرَّةً أَوْ مَرَّتَيْنِ، فَإِنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَنِي بِهَذَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5098,
                "hadithNumber": "5333",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Ibn `Umar رضی اللہ عنہما divorced his wife while she was having her menses. `Umar رضی اللہ عنہما asked the Prophet (ﷺ) who said, \"Order him (your son) to take her back, and then divorced her before her period of the 'Iddah has elapsed.\" I asked Ibn `Umar رضی اللہ عنہما , \"Will that divorce (during the menses) be counted?\" He replied, \"If somebody behaves foolishly (will his foolishness be an excuse for his misbehavior)?\"",
                "hadithUrdu": "ابن عمر رضی اللہ عنہما نے اپنی بیوی کو طلاق دے دی ، اس وقت وہ حائضہ تھیں ۔ پھر حضرت عمر رضی اللہ عنہ نے اس کے متعلق نبی کریم صلی اللہ علیہ وسلم سے پوچھا تو آنحضرت صلی اللہ علیہ وسلم نے حکم دیا کہ ابن عمر رضی اللہ عنہما اپنی بیوی سے رجوع کر لیں ، پھر جب طلاق کا صحیح وقت آئے تو طلاق دیں ( یونس بن جبیر نے بیان کیا کہ ابن عمر رضی اللہ عنہما سے ) میں نے پوچھا کہ کیا اس طلاق کا بھی شمار ہوا تھا ؟ انہوں نے بتلایا کہ اگر کوئی طلاق دینے والا شرع کے احکام بجا لانے سے عاجز ہو یا احمق بیوقوف ہو ( تو کیا طلاق نہیں پڑے گی ؟ ) ۔",
                "urduNarrator": "ہم سے حجاج نے بیان کیا ، کہا ہم سے یزید بن ابراہیم نے بیان کیا ، کہا ہم سے محمد بن سیرین نے بیان کیا ، کہا مجھ سے یونس بن جبیر نے بیان کیا کہ میں نے ابن عمر رضی اللہ عنہما سے پوچھا تو انہوں نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، حَدَّثَنِي يُونُسُ بْنُ جُبَيْرٍ، سَأَلْتُ ابْنَ عُمَرَ فَقَالَ طَلَّقَ ابْنُ عُمَرَ امْرَأَتَهُ وَهْىَ حَائِضٌ، فَسَأَلَ عُمَرُ النَّبِيَّ صلى الله عليه وسلم فَأَمَرَهُ أَنْ يُرَاجِعَهَا، ثُمَّ يُطَلِّقَ مِنْ قُبُلِ عِدَّتِهَا، قُلْتُ فَتَعْتَدُّ بِتِلْكَ التَّطْلِيقَةِ قَالَ أَرَأَيْتَ إِنْ عَجَزَ وَاسْتَحْمَقَ‏.‏",
                "headingArabic": "مُرَاجَعَةِ الْحَائِضِ",
                "headingUrdu": "حیض کی حالت میں بیوی کو واپس لے جانا۔",
                "headingEnglish": "To take back one's wife while in her menses.",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5099,
                "hadithNumber": "5334",
                "englishNarrator": "Narrated Zainab رضی اللہ عنہا :",
                "hadithEnglish": "I went to Um Habiba رضی اللہ عنہا , the wife of the Prophet (ﷺ) when her father, Abu- Sufyan bin Herb رضی اللہ عنہا had died. Um ,Habiba asked for a perfume which contained yellow scent (Khaluq) or some other scent, and she first perfumed one of the girls with it and then rubbed her cheeks with it and said, \"By Allah, I am not in need of perfume, but I have heard Allah's Messenger (ﷺ) saying, 'It is not lawful for a lady who believes in Allah and the Last Day to mourn for a dead person for more than three days unless he is her husband for whom she should mourn for four months and ten days.'\"",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام حبیبہ رضی اللہ عنہا کے پاس اس وقت گئی جب ان کے والد ابوسفیان بن حرب رضی اللہ عنہ کا انتقال ہوا تھا ۔ ام حبیبہ نے خوشبو منگوائی جس میں خلوق خوشبو کی زردی یا کسی اور چیز کی ملاوٹ تھی ، پھر وہ خوشبو ایک لونڈی نے ان کو لگائی اور ام المؤمنین نے خود اپنے رخساروں پر اسے لگایا ۔ اس کے بعد کہا کہ واللہ ! مجھے خوشبو کے استعمال کی کوئی خواہش نہیں تھی لیکن میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کسی عورت کے لیے جو اللہ اور آخرت کے دن پر ایمان رکھتی ہو جائز نہیں کہ وہ تین دن سے زیادہ کسی کا سوگ منائے سوا شوہر کے ( کہ اس کا سوگ ) چار مہینے دس دن کا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم سے مالک نے بیان کیا، انہیں عبداللہ بن ابی بکر بن محمد بن عمرو بن حزم نے بیان کیا، وہ حمید بن نافع سے اور ان سے ابوسلمہ کی بیٹی زینب رضی اللہ عنہا نے بیان کیا۔ حدیث میں ہے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ ابْنَةِ أَبِي سَلَمَةَ، أَنَّهَا أَخْبَرَتْهُ هَذِهِ الأَحَادِيثَ الثَّلاَثَةَ، قَالَتْ زَيْنَبُ دَخَلْتُ عَلَى أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم حِينَ تُوُفِّيَ أَبُوهَا أَبُو سُفْيَانَ بْنُ حَرْبٍ، فَدَعَتْ أُمُّ حَبِيبَةَ بِطِيبٍ فِيهِ صُفْرَةٌ خَلُوقٌ أَوْ غَيْرُهُ فَدَهَنَتْ مِنْهُ جَارِيَةً، ثُمَّ مَسَّتْ بِعَارِضَيْهَا، ثُمَّ قَالَتْ وَاللَّهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ، غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثِ لَيَالٍ، إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏",
                "headingArabic": "تُحِدُّ الْمُتَوَفَّى عَنْهَا زَوْجُهَا أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا",
                "headingUrdu": "بیوہ کو چار مہینے دس دن سوگ منانا چاہیے۔",
                "headingEnglish": "A widow should mourn for four months and ten days.",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5100,
                "hadithNumber": "5335",
                "englishNarrator": "Narrated Zainab رضی اللہ عنہا :",
                "hadithEnglish": "I want to Zainab bint Jahsh رضی اللہ عنہا when her brother died. She asked for perfume and used some of it and said, \"By Allah, I am not in need of perfume, but I have heard Allah's Messenger (ﷺ) saying on the pulpit, 'It is not lawful for a lady who believes in Allah and the last day to mourn for more than three days except for her husband for whom she should mourn for four months and ten days.'\"",
                "hadithUrdu": "میں ام المؤمنین زینب بنت جحش رضی اللہ عنہا کے یہاں اس وقت گئی جب ان کے بھائی کا انتقال ہوا ۔ انہوں نے بھی خوشبو منگوائی اور استعمال کیا کہا کہ واللہ ! مجھے خوشبو کے استعمال کی کوئی خواہش نہیں تھی لیکن میں نے رسول اللہ صلی اللہ علیہ وسلم کو برسر منبر یہ فرماتے سنا ہے کہ کسی عورت کے لیے جو اللہ اور آخرت کے دن پر ایمان رکھتی ہو یہ جائز نہیں کہ کسی میت پر تین دن سے زیادہ سوگ منائے ، صرف شوہر کے لیے چار مہینے دس دن کا سوگ ہے ۔",
                "urduNarrator": "حضرت زینب رضی اللہ عنہا نے بیان کیا کہ اس کے بعد",
                "hadithArabic": "قَالَتْ زَيْنَبُ فَدَخَلْتُ عَلَى زَيْنَبَ ابْنَةِ جَحْشٍ حِينَ تُوُفِّيَ أَخُوهَا، فَدَعَتْ بِطِيبٍ فَمَسَّتْ مِنْهُ، ثُمَّ قَالَتْ أَمَا وَاللَّهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ عَلَى الْمِنْبَرِ ‏ \"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثِ لَيَالٍ إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5101,
                "hadithNumber": "5336",
                "englishNarrator": "Narrated Um Salama رضی اللہ عنہا :",
                "hadithEnglish": "A woman came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! The husband of my daughter has died and she is suffering from an eye disease, can she apply kohl to her eye?\" Allah's Messenger (ﷺ) replied, \"No,\" twice or thrice. (Every time she repeated her question) he said, \"No.\" Then Allah's Messenger (ﷺ) added, \"It is just a matter of four months and ten days. In the Pre-Islamic Period of ignorance a widow among you should throw a globe of dung when one year has elapsed.\"",
                "hadithUrdu": "ایک خاتون رسول اللہ صلی اللہ علیہ وسلم کے پاس آئیں اور عرض کیا یا رسول اللہ ! میری لڑکی کے شوہر کا انتقال ہو گیا ہے اور اس کی آنکھوں میں تکلیف ہے تو کیا وہ سرمہ لگا سکتی ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ نہیں ، دو تین مرتبہ ( آپ نے یہ فرمایا ) ہر مرتبہ یہ فرماتے تھے کہ نہیں ! پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ ( شرعی عدت ) چار مہینے اور دس دن ہی کی ہے ۔ جاہلیت میں تو تمہیں سال بھر تک مینگنی پھینکنی پڑتی تھی ( جب کہیں عدت سے باہر ہوتی تھی ) ۔",
                "urduNarrator": "زینب بنت ام سلمہ رضی اللہ عنہا نے کہا کہ میں نے ام سلمہ رضی اللہ عنہا کو بھی یہ کہتے سنا کہ",
                "hadithArabic": "قَالَتْ زَيْنَبُ وَسَمِعْتُ أُمَّ سَلَمَةَ، تَقُولُ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَتِي تُوُفِّيَ عَنْهَا زَوْجُهَا وَقَدِ اشْتَكَتْ عَيْنَهَا أَفَتَكْحُلُهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ ‏\"‏‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا كُلَّ ذَلِكَ يَقُولُ لاَ، ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ، وَقَدْ كَانَتْ إِحْدَاكُنَّ فِي الْجَاهِلِيَّةِ تَرْمِي بِالْبَعَرَةِ عَلَى رَأْسِ الْحَوْلِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5102,
                "hadithNumber": "5337",
                "englishNarrator": "Narrated Zainab رضی اللہ عنہا :",
                "hadithEnglish": "\"What does 'throwing a globe of dung when one year had elapsed' mean?\" Zainab said, \"When a lady was bereaved of her husband, she would live in a wretched small room and put on the worst clothes she had and would not touch any scent till one year had elapsed. Then she would bring an animal, e.g. a donkey, a sheep or a bird and rub her body against it. The animal against which she would rub her body would scarcely survive. Only then she would come out of her room, whereupon she would be given a globe of dung which she would throw away and then she would use the scent she liked or the like.\" Imam Malik was asked: What is meant by '' تَفْتَضُّ بِهِ ''? He replied: She rubbed that animal with her body.",
                "hadithUrdu": "اس کا کیا مطلب ہے کہ ” سال بھر تک مینگنی پھینکنی پڑتی تھی ؟ “ انہوں نے فرمایا کہ زمانہ جاہلیت میں جب کسی عورت کا شوہر مر جاتا تو وہ ایک نہایت تنگ وتاریک کو ٹھڑی میں داخل ہو جاتی ۔ سب سے برے کپڑے پہنتی اور خوشبو کا استعمال ترک کر دیتی ۔ یہاں تک کہ اسی حالت میں ایک سال گزر جاتا پھر کسی چوپائے گدھے یا بکری یا پرندہ کو اس کے پاس لایا جاتا اور وہ عدت سے باہر آنے کے لیے اس پر ہاتھ پھیرتی ۔ ایسا کم ہوتا تھا کہ وہ کسی جانور پر ہاتھ پھیر دے اور وہ مر نہ جائے ۔ اس کے بعد وہ نکالی جاتی اور اسے مینگنی دی جاتی جسے وہ پھینکتی ۔ اب وہ خوشبو وغیرہ کوئی بھی چیز استعمال کر سکتی تھی ۔ امام مالک سے پوچھا گیا کہ ” تفتض بہ “ کا کیا مطلب ہے تو آپ نے فرمایا وہ اس جانور کو اپنے جسم سے  چھوتی تھی ۔",
                "urduNarrator": "حمید نے بیان کیا کہ میں نے زینب بنت ام سلمہ رضی اللہ عنہا سے پوچھا کہ",
                "hadithArabic": "قَالَ حُمَيْدٌ فَقُلْتُ لِزَيْنَبَ وَمَا تَرْمِي بِالْبَعَرَةِ عَلَى رَأْسِ الْحَوْلِ فَقَالَتْ زَيْنَبُ كَانَتِ الْمَرْأَةُ إِذَا تُوُفِّيَ عَنْهَا زَوْجُهَا دَخَلَتْ حِفْشًا، وَلَبِسَتْ شَرَّ ثِيَابِهَا، وَلَمْ تَمَسَّ طِيبًا حَتَّى تَمُرَّ بِهَا سَنَةٌ، ثُمَّ تُؤْتَى بِدَابَّةٍ حِمَارٍ أَوْ شَاةٍ أَوْ طَائِرٍ فَتَفْتَضُّ بِهِ، فَقَلَّمَا تَفْتَضُّ بِشَىْءٍ إِلاَّ مَاتَ، ثُمَّ تَخْرُجُ فَتُعْطَى بَعَرَةً فَتَرْمِي، ثُمَّ تُرَاجِعُ بَعْدُ مَا شَاءَتْ مِنْ طِيبٍ أَوْ غَيْرِهِ‏.‏ سُئِلَ مَالِكٌ مَا تَفْتَضُّ بِهِ قَالَ تَمْسَحُ بِهِ جِلْدَهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5076,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=203",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=201",
                "label": "201",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=202",
                "label": "202",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=203",
                "label": "203",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=204",
                "label": "204",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=205",
                "label": "205",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=206",
                "label": "206",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=207",
                "label": "207",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=205",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=205",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=203",
        "to": 5100,
        "total": 40465
    }
}