{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 208,
        "data": [
            {
                "id": 5178,
                "hadithNumber": "5413",
                "englishNarrator": "Narrated Abu Hazim:",
                "hadithEnglish": "I asked Sahl bin Sa`d رضی اللہ عنہ , \"Did Allah's Messenger (ﷺ) ever eat white flour?\" Sahl said, \"Allah's Messenger (ﷺ) never saw white flour since Allah sent him as an Apostle till He took him unto Him.\" I asked, \"Did the people have (use) sieves during the lifetime of Allah's Messenger (ﷺ)?\" Sahl said, \"Allah's Messenger (ﷺ) never saw (used) a sieve since Allah sent him as an Apostle until He took him unto Him,\" I said, \"How could you eat barley unsifted?\" he said, \"We used to grind it and then blow off its husk, and after the husk flew away, we used to prepare the dough (bake) and eat it.\"",
                "hadithUrdu": "میں نے سہل بن سعد رضی اللہ عنہ سے پوچھا ، کیا نبی کریم صلی اللہ علیہ وسلم نے کبھی میدہ کھایا تھا ؟ انہوں نے کہا کہ جب اللہ تعالیٰ نے حضور اکرم صلی اللہ علیہ وسلم کو نبی بنایا اس وقت سے وفات تک آنحضرت صلی اللہ علیہ وسلم نے میدہ دیکھا بھی نہیں تھا ۔ میں نے پوچھا کیانبی کریم صلی اللہ علیہ وسلم کے زمانہ میں آپ کے پاس چھلنیاں تھیں ۔ کہا کہ جب اللہ تعالیٰ نے حضور اکرم صلی اللہ علیہ وسلم کو نبی بنایا اس وقت سے آپ کی وفات تک آنحضرت صلی اللہ علیہ وسلم نے چھلنی دیکھی بھی نہیں ۔ بیان کیا کہ میں نے پوچھا آپ لوگ پھر بغیر چھنا ہوا جو کس طرح کھاتے تھے ؟ بتلایا ہم اسے پیس لیتے تھے پھر اسے پھونکتے تھے جو کچھ اڑنا ہوتا اڑجاتا اور جو باقی رہ جاتا اسے گوندھ لیتے ( اور پکا کر ) کھالیتے تھے ۔",
                "urduNarrator": "سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے یعقوب نے بیان کیا ، ان سے ابوحازم نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، عَنْ أَبِي حَازِمٍ، قَالَ سَأَلْتُ سَهْلَ بْنَ سَعْدٍ فَقُلْتُ هَلْ أَكَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّقِيَّ فَقَالَ سَهْلٌ مَا رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم النَّقِيَّ مِنْ حِينَ ابْتَعَثَهُ اللَّهُ حَتَّى قَبَضَهُ اللَّهُ‏.‏ قَالَ فَقُلْتُ هَلْ كَانَتْ لَكُمْ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم مَنَاخِلُ قَالَ مَا رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم مُنْخُلاً مِنْ حِينَ ابْتَعَثَهُ اللَّهُ حَتَّى قَبَضَهُ‏.‏ قَالَ قُلْتُ كَيْفَ كُنْتُمْ تَأْكُلُونَ الشَّعِيرَ غَيْرَ مَنْخُولٍ قَالَ كُنَّا نَطْحَنُهُ وَنَنْفُخُهُ، فَيَطِيرُ مَا طَارَ وَمَا بَقِيَ ثَرَّيْنَاهُ فَأَكَلْنَاهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5179,
                "hadithNumber": "5414",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "that he passed by a group of people in front of whom there was a roasted sheep. They invited him but he refused to eat and said, \"Allah's Messenger (ﷺ) left this world without satisfying his hunger even with barley bread.\"",
                "hadithUrdu": "وہ کچھ لوگوں کے پاس سے گزر ے جن کے سامنے بھنی ہوئی بکری رکھی تھی ۔ انہوں نے ان کو کھانے پر بلایا لیکن انہوں نے کھانے سے انکار کر دیا اور کہا کہ رسول اللہ صلی اللہ علیہ وسلم اس دنیا سے رخصت ہو گئے اور آپ نے کبھی جو کی روٹی بھی آسودہ ہو کر نہیں کھائی ۔",
                "urduNarrator": "مجھ سے اسحاق بن ابراہیم نے بیان کیا ، انہیں روح بن عبادہ نے خبر دی ، ان سے ابن ابی ذئب نے بیان کیا ، ان سے سعید بن مقبری نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ مَرَّ بِقَوْمٍ بَيْنَ أَيْدِيهِمْ شَاةٌ مَصْلِيَّةٌ، فَدَعَوْهُ فَأَبَى أَنْ يَأْكُلَ قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الدُّنْيَا وَلَمْ يَشْبَعْ مِنَ الْخُبْزِ الشَّعِيرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5180,
                "hadithNumber": "5415",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) never took his meals at a dining table, nor in small plates, and he never ate thin wellbaked bread. (The sub-narrator asked Qatada, \"Over what did they use to take their meals?\" Qatada said, \"On leather dining sheets.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے کبھی میز پر کھانا نہیں کھایا اور نہ تشتری میں دو چار قسم کی چیزیں رکھ کر کھائے اور نہ کبھی چپاتی کھائی ۔ میں نے قتادہ سے پوچھا ، پھر آپ کس چیز پر کھانا کھاتے تھے ؟ بتلایا کہ سفرہ ( چمڑے کے دسترخوان ) پر ۔",
                "urduNarrator": "ہم سے عبداللہ بن ابی الاسود نے بیان کیا ، کہا ہم سے معاذ بن ہشام نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، ان سے یونس بن ابی الفرات نے ، ان سے قتادہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا مُعَاذٌ، حَدَّثَنِي أَبِي، عَنْ يُونُسَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مَا أَكَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى خِوَانٍ، وَلاَ فِي سُكْرُجَةٍ، وَلاَ خُبِزَ لَهُ مُرَقَّقٌ‏.‏ قُلْتُ لِقَتَادَةَ عَلَى مَا يَأْكُلُونَ قَالَ عَلَى السُّفَرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5181,
                "hadithNumber": "5416",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The family of Muhammad had not eaten wheat bread to their satisfaction for three consecutive days since his arrival at Medina till he died.",
                "hadithUrdu": "مدینہ ہجرت کرنے کے بعد آل محمد صلی اللہ علیہ وسلم نے کبھی برابر تین دن تک گیہوں کی روٹی پیٹ بھر کر نہیں کھائی یہاں تک کہ آپ دنیا سے تشریف لے گئے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے منصور نے ، ان سے ابراہیم نخعی نے ، ان سے اسود بن یزید نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مُنْذُ قَدِمَ الْمَدِينَةَ مِنْ طَعَامِ الْبُرِّ ثَلاَثَ لَيَالٍ تِبَاعًا، حَتَّى قُبِضَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5182,
                "hadithNumber": "5417",
                "englishNarrator": "Narrated `Aisha (the wife of the Prophet) رضی اللہ عنہا :",
                "hadithEnglish": "whenever one of her relatives died, the women assembled and then dispersed (returned to their houses) except her relatives and close friends. She would order that a pot of Talbina be cooked. Then Tharid (a dish prepared from meat and bread) would be prepared and the Talbina would be poured on it. `Aisha رضی اللہ عنہا would say (to the women),\"Eat of it, for I heard Allah's Messenger (ﷺ) saying, 'The Talbina soothes the heart of the patient and relieves him from some of his sadness.' \"",
                "hadithUrdu": "جب کسی گھر میں کسی کی وفات ہو جاتی اور اس کیوجہ سے عورتیں جمع ہوتیں اور پھر وہ چلی جاتیں ۔ صرف گھر والے اورخاص خاص عورتیں رہ جاتیں تو آپ ہانڈی میں تلبینہ پکانے کا حکم دیتیں ۔ وہ پکایا جاتا پھر ثرید بنایا جاتا اور تلبینہ اس پر ڈالا جاتا ۔ پھر ام المؤمنین حضرت عائشہ رضی اللہ عنہا فرماتیں کہ اسے کھاؤ کیونکہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے آپ فرماتے تھے کہ تلبینہ مریض کے دل کو تسکین دیتا ہے اور اس کا غم دور کرتا ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیرنے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل بن خالد نے ، ان سے ابن شہاب زہری نے ، ان سے عروہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا كَانَتْ إِذَا مَاتَ الْمَيِّتُ مِنْ أَهْلِهَا فَاجْتَمَعَ لِذَلِكَ النِّسَاءُ، ثُمَّ تَفَرَّقْنَ، إِلاَّ أَهْلَهَا وَخَاصَّتَهَا، أَمَرَتْ بِبُرْمَةٍ مِنْ تَلْبِينَةٍ فَطُبِخَتْ، ثُمَّ صُنِعَ ثَرِيدٌ فَصُبَّتِ التَّلْبِينَةُ عَلَيْهَا ثُمَّ قَالَتْ كُلْنَ مِنْهَا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ التَّلْبِينَةُ مَجَمَّةٌ لِفُؤَادِ الْمَرِيضِ، تَذْهَبُ بِبَعْضِ الْحُزْنِ ‏\"‏‏.‏",
                "headingArabic": "التَّلْبِينَةِ",
                "headingUrdu": "تلبینہ (ایک قسم کا پکوان جو آٹے یا چوکر سے تیار کیا جاتا ہے)",
                "headingEnglish": "At-Talbina (a kind of dish prepared from flour or bran)",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5183,
                "hadithNumber": "5418",
                "englishNarrator": "Narrated Abu Musa Al-Ash`ari رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Many men reached perfection but none among the women reached perfection except Mary, the daughter of ' `Imran, and Asia رضی اللہ عنہا , Pharoah's wife. And the superiority of `Aisha رضی اللہ عنہا to other women is like the superiority of Tharid to other kinds of food.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، مردوں میں تو بہت سے کامل ہوئے لیکن عورتوں میں حضرت مریم بنت عمران اور فرعون کی بیوی حضرت آسیہ کے سوا اور کوئی کامل نہیں ہوا اور حضرت عائشہ رضی اللہ عنہا کی فضیلت تمام عورتوں پرایسی ہے جیسے تمام کھانوں پر ثرید کی فضیلت ہے ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم سے غندر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے عمرو بن مرہ جملی نے بیان کیا ، ان سے مرہ ہمدانی نے ، ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ الْجَمَلِيِّ، عَنْ مُرَّةَ الْهَمْدَانِيِّ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ كَمَلَ مِنَ الرِّجَالِ كَثِيرٌ، وَلَمْ يَكْمُلْ مِنَ النِّسَاءِ إِلاَّ مَرْيَمُ بِنْتُ عِمْرَانَ وَآسِيَةُ امْرَأَةُ فِرْعَوْنَ، وَفَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏",
                "headingArabic": "الثَّرِيدِ",
                "headingUrdu": "ثرید (گوشت اور روٹی سے تیار کردہ پکوان)۔",
                "headingEnglish": "Ath-Tharid (a dish prepared from meat and bread).",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5184,
                "hadithNumber": "5419",
                "englishNarrator": "Narrated Anas:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The superiority of `Aisha رضی اللہ عنہا to other women is like the superiority of Tharid to other kinds of food . \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا عورتوں پر حضرت عائشہ رضی اللہ عنہا کی فضیلت ایسی ہے جیسے تمام کھانوں پر ثرید کی فضیلت ہے ۔",
                "urduNarrator": "ہم سے عمرو بن عون نے بیان کیا ، کہا ہم سے خالد بن عبداللہ نے بیان کیا ، ان سے ابو طوالہ نے اور ان سے حضرت انس نے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِي طُوَالَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5185,
                "hadithNumber": "5420",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "I went along with the Prophet (ﷺ) to the house of a young tailor of his. The tailor presented a dish of Tharid to the Prophet (ﷺ) and resumed his work. The Prophet (ﷺ) started picking the pieces of gourd and I too, started picking them and putting it before him. Since then I have always loved (to eat) gourd.",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ آپ کے ایک غلام کے پاس گیا جودرزی تھے ۔ انہوں نے آنحضرت صلی اللہ علیہ وسلم کے سامنے ایک پیالہ پیش کیا جس میں ثرید تھا ۔ بیان کیا کہ پھر وہ اپنے کام میں لگ گئے ۔ بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم اس میں سے کدو تلاش کرنے لگے کہا کہ پھر میں بھی اس میں سے کدو تلاش کر کر کے آنحضرت صلی اللہ علیہ وسلم کے سامنے رکھنے لگا ۔ بیان کیا کہ اس کے بعد سے میں بھی کدو بہت پسند کرتا ہوں ۔",
                "urduNarrator": "ہم سے عبداللہ بن منیر نے بیان کیا ، انہوں نے ابوحاتم اشہل ابن حاتم سے سنا ، ان سے ابن عون نے بیان کیا ، ان سے  ثمامہ بن انس نےء اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ أَبَا حَاتِمٍ الأَشْهَلَ بْنَ حَاتِمٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ ثُمَامَةَ بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ دَخَلْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم عَلَى غُلاَمٍ لَهُ خَيَّاطٍ، فَقَدَّمَ إِلَيْهِ قَصْعَةً فِيهَا ثَرِيدٌ ـ قَالَ ـ وَأَقْبَلَ عَلَى عَمَلِهِ ـ قَالَ ـ فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ ـ قَالَ ـ فَجَعَلْتُ أَتَتَبَّعُهُ فَأَضَعُهُ بَيْنَ يَدَيْهِ ـ قَالَ ـ فَمَا زِلْتُ بَعْدُ أُحِبُّ الدُّبَّاءَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5186,
                "hadithNumber": "5421",
                "englishNarrator": "Narrated Qatada:",
                "hadithEnglish": "We used to visit Anas bin Malik رضی اللہ عنہ while his baker was standing (and baking). Anas would say, \"Eat! I do not know that the Prophet (ﷺ) had ever seen well-baked bread till he met Allah, nor had he ever seen a roasted sheep with his own eyes.\"",
                "hadithUrdu": "ہم حضرت انس رضی اللہ عنہ کی خدمت میں حاضر ہوئے تو ان کی روٹی پکانے والا ان کے پاس ہی کھڑا تھا ۔ انہوں نے کہا کہ کھاؤ ۔ میں نہیں جانتا کہ نبی کریم صلی اللہ علیہ وسلم نے کبھی پتلی روٹی ( چپاتی ) دیکھی ہو ۔ یہاں تک کہ آپ اللہ سے جا ملے اور نہ آنحضرت صلی اللہ علیہ وسلم نے کبھی مسلم بھنی ہوئی بکری دیکھی ۔",
                "urduNarrator": "ہم سے ہدبہ بن خالد نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، ان سے قتادہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، عَنْ قَتَادَةَ، قَالَ كُنَّا نَأْتِي أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ وَخَبَّازُهُ قَائِمٌ قَالَ كُلُوا فَمَا أَعْلَمُ النَّبِيَّ صلى الله عليه وسلم رَأَى رَغِيفًا مُرَقَّقًا حَتَّى لَحِقَ بِاللَّهِ، وَلاَ رَأَى شَاةً سَمِيطًا بِعَيْنِهِ قَطُّ‏.‏",
                "headingArabic": "شَاةٍ مَسْمُوطَةٍ وَالْكَتِفِ وَالْجَنْبِ",
                "headingUrdu": "ایک بھنی ہوئی بھیڑ۔",
                "headingEnglish": "A roasted sheep.",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5187,
                "hadithNumber": "5422",
                "englishNarrator": "Narrated `Amr bin Umaiyay Ad-Damri:",
                "hadithEnglish": "I saw Allah's Messenger (ﷺ) cutting part of the shoulder of mutton with a knife. He ate of it and then was called for prayer whereupon he got up and put down the knife and offered the prayer without performing new ablution.",
                "hadithUrdu": "میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم بکری کے شانہ میں سے گوشت کاٹ رہے تھے ، پھر آپ نے اس میں سے کھایا ۔ پھر آپ کو نماز کے لیے بلایا گیا تو آپ کھڑے ہو گئے اور چھری ڈال دی اور نماز پڑھی لیکن نیا وضو نہیں کیا ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں جعفر بن عمر بن امیہ ضمری نے ، انہیں ان کے والد نے ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ، فَأَكَلَ مِنْهَا، فَدُعِيَ إِلَى الصَّلاَةِ، فَقَامَ فَطَرَحَ السِّكِّينَ فَصَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5188,
                "hadithNumber": "5423",
                "englishNarrator": "Narrated `Abis:",
                "hadithEnglish": "I asked `Aisha رضی اللہ عنہا \"Did the Prophet (ﷺ) forbid eating the meat of sacrifices offered on `Id-ul-Adha for more than three days\" She said, \"The Prophet (ﷺ) did not do this except in the year when the people were hungry, so he wanted the rich to feed the poor. But later we used to store even a trotter of a sheep to eat it fifteen days later.\" She was asked, \"What compelled you to do so?\" She smiled and said, \"The family of Muhammad did not eat to their satisfaction white bread with meat soup for three successive days till he met Allah.\" Ibn-e-Kastheer with reference to Sufyan Abdur Rehman bin Abis.",
                "hadithUrdu": "میں نے عائشہ رضی اللہ عنہا سے پوچھا کیا نبی کریم صلی اللہ علیہ وسلم نے تین دن سے زیادہ قربانی کا گوشت کھانے کو منع کیا ہے ؟ انہوں نے کہا کہ آنحضرت صلی اللہ علیہ وسلم نے ایسا کبھی نہیں کیا ۔ صرف ایک سال اس کا حکم دیا تھا جس سال قحط پڑا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے چاہا تھا ( اس حکم کے ذریعہ ) کہ جو مال والے ہیں وہ ( گوشت محفوظ کرنے کے بجائے ) محتاجوں کو کھلادیں اور ہم بکری کے پائے محفوظ رکھ لیتے تھے اور اسے پندرہ پندرہ دن بعد کھاتے تھے ۔ ان سے پوچھا گیا کہ ایسا کرنے کے لیے کیا مجبوری تھی ؟ اس پر ام المؤمنین رضی اللہ عنہا ہنس پڑیں اور فرمایا آل محمد صلی اللہ علیہ وسلم نے سالن کے ساتھ گیہوں کی روٹی تین دن تک برابر کبھی نہیں کھائی یہاں تک کہ آپ اللہ سے جا ملے ۔ اور ابن کثیر نے بیان کیا کہ ہمیں سفیان نے خبر دی ، ان سے عبدالرحمٰن بن عابس نے یہی حدیث بیان کی ۔",
                "urduNarrator": "ہم سے خلاد بن یحییٰ نے بیان کیا ، کہا ہم سے سفیان نے ، ان سے عبدالرحمٰن بن عابس نے ، ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، عَنْ أَبِيهِ، قَالَ قُلْتُ لِعَائِشَةَ أَنَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ تُؤْكَلَ لُحُومُ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ قَالَتْ مَا فَعَلَهُ إِلاَّ فِي عَامٍ جَاعَ النَّاسُ فِيهِ، فَأَرَادَ أَنْ يُطْعِمَ الْغَنِيُّ الْفَقِيرَ، وَإِنْ كُنَّا لَنَرْفَعُ الْكُرَاعَ فَنَأْكُلُهُ بَعْدَ خَمْسَ عَشْرَةَ‏.‏ قِيلَ مَا اضْطَرَّكُمْ إِلَيْهِ فَضَحِكَتْ قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مِنْ خُبْزِ بُرٍّ مَأْدُومٍ ثَلاَثَةَ أَيَّامٍ حَتَّى لَحِقَ بِاللَّهِ‏.‏ وَقَالَ ابْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَابِسٍ بِهَذَا‏.‏",
                "headingArabic": "مَا كَانَ السَّلَفُ يَدَّخِرُونَ فِي بُيُوتِهِمْ وَأَسْفَارِهِمْ مِنَ الطَّعَامِ وَاللَّحْمِ وَغَيْرِهِ",
                "headingUrdu": "گھروں میں اور سفر میں کھانے کا ذخیرہ",
                "headingEnglish": "Storage of food in the houses and on a journey",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5189,
                "hadithNumber": "5424",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "We used to carry the meat of the Hadis (sacrificed animals) to Medina during the life-time of the Prophet . Ibn-e-Juraij inquired of Ataa whether Hadrat Jabir رضی اللہ عنہ said: ''Until we reached Madinah Munawwarah'', he said: No!",
                "hadithUrdu": "( مکہ مکرمہ سے حج کی ) قربانی کا گوشت ہم نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں مدینہ منورہ لاتے تھے ۔ اس کی متابعت محمد نے کی ابن عیینہ کے واسطہ سے اور ابن جریج نے بیان کیا کہ میں نے عطاء سے پوچھا کیا حضرت جابر رضی اللہ عنہ نے یہ بھی کہا تھا کہ ” یہاں تک کہ ہم مدینہ منورہ آ گئے ؟ انہوں نے کہا کہ انہوں نے یہ نہیں کہا تھا ۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے عمرونے ، ان سے عطاء نے اور ان سے حضرت جابر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ كُنَّا نَتَزَوَّدُ لُحُومَ الْهَدْىِ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم إِلَى الْمَدِينَةِ‏.‏ تَابَعَهُ مُحَمَّدٌ عَنِ ابْنِ عُيَيْنَةَ‏.‏ وَقَالَ ابْنُ جُرَيْجٍ قُلْتُ لِعَطَاءٍ أَقَالَ حَتَّى جِئْنَا الْمَدِينَةَ قَالَ لاَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5190,
                "hadithNumber": "5425",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said to Abu Talha رضی اللہ عنہ , \"Seek one of your boys to serve me.\" Abu Talha رضی اللہ عنہ mounted me behind him (on his riding animal) and took me (to the Prophet (ﷺ) ). So I used to serve Allah's Messenger (ﷺ) whenever he dismounted (to stay somewhere). I used to hear him saying very often, \"O Allah! I seek refuge with You from, having worries sadness, helplessness, laziness, miserliness, cowardice, from being heavily in debt and from being overpowered by other persons unjustly.\" I kept on serving till we -returned from the battle of Khaibar. The Prophet (ﷺ) then brought Safiyya bint Huyai رضی اللہ عنہ whom he had won from the war booty. I saw him folding up a gown or a garment for her to sit on behind him (on his shecamel). When he reached As-Sahba', he prepared Hais and placed it on a dining sheet. Then he sent me to invite men, who (came and) ate; and that was his and Safiyya's wedding banquet. Then the Prophet proceeded, and when he saw (noticed) the mountain of Uhud, he said, \"This mountain loves us, and we love it.\" When we approached Medina, he said, \"O Allah! I make the area between its two mountains a sanctuary as Abraham has made Mecca a sanctuary. O Allah! Bless their Mudd and Sa (special kinds of measure).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے حضرت ابوطلحہ رضی اللہ عنہ سے فرمایا کہ اپنے یہاں کے بچوں میں کوئی بچہ تلاش کرلاؤ جو میرے کام کر دیا کرے ۔ چنانچہ حضرت ابوطلحہ رضی اللہ عنہ مجھے اپنی سواری پر اپنے پیچھے بٹھاکر لائے ۔ میں آنحضرت صلی اللہ علیہ وسلم کی جب بھی آپ کہیں پڑاؤ کرتے خدمت کرتا ۔ میں سنا کرتا تھا کہ آنحضرت صلی اللہ علیہ وسلم بکثرت یہ دعا پڑھا کرتے تھے ۔ ” اے اللہ ! میں تیری پناہ مانگتا ہوں غم سے ، رنج سے ، عجز سے ، سستی سے ، بخل سے ، بزدلی سے ، قرض کے بوجھ سے اور لوگوں کے غلبہ سے ۔ “ ( حضرت انس رضی اللہ عنہ نے بیان کیا کہ ) پھر میں اس وقت سے برابر آپ کی خدمت کرتا رہا ۔ یہاں تک کہ ہم خیبر سے واپس ہوئے اور حضرت صفیہ بنت حیی رضی اللہ عنہ بھی ساتھ تھیں ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں پسند فرمایا تھا ۔ میں دیکھتا تھا کہ آنحضرت صلی اللہ علیہ وسلم نے ان کے لیے اپنی سواری پر پیچھے کپڑے سے پردہ کیا اور پھر انہیں وہاں بٹھایا ۔ آخر جب مقام صہبا میں پہنچے تو آپ نے دسترخوان پر حیس ( کھجور ، پنیر اور گھی وغیرہ کا ملیدہ ) بنایا پھر مجھے بھیجا اور میں نے لوگوں کو بلالایا ، پھر سب لوگوں نے اسے کھایا ۔ یہی آنحضرت صلی اللہ علیہ وسلم کی طرف سے حضرت صفیہ رضی اللہ عنہا سے نکاح کی دعوت ولیمہ تھی ۔ پھر آپ روانہ ہوئے اور جب احد دکھائی دیا تو آپ نے فرمایا کہ یہ پہاڑ ہم سے محبت رکھتا ہے اور ہم اس سے محبت رکھتے ہیں ۔ اس کے بعد جب مدینہ نظر آیا تو فرمایا ” اے اللہ ! میں اس کے دونوں پہاڑوں کے درمیانی علاقے کو اسی طرح حرمت والا علاقہ بناتا ہوں جس طرح حضرت ابراہیم علیہ السلام نے مکہ کو حرمت والا شہر بنایا تھا ۔ اے اللہ ! اس کے رہنے والوں کو برکت عطا فرما ۔ ان کے مد میں اور ان کے صاع میں برکت فرما ۔ “",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے مطلب بن عبداللہ بن حنطب کے غلام عمرو بن ابی عمرو نے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، مَوْلَى الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَبِي طَلْحَةَ ‏\"‏ الْتَمِسْ غُلاَمًا مِنْ غِلْمَانِكُمْ يَخْدُمُنِي ‏\"‏‏.‏ فَخَرَجَ بِي أَبُو طَلْحَةَ، يُرْدِفُنِي وَرَاءَهُ، فَكُنْتُ أَخْدُمُ رَسُولَ اللَّهِ صلى الله عليه وسلم كُلَّمَا نَزَلَ، فَكُنْتُ أَسْمَعُهُ يُكْثِرُ أَنْ يَقُولَ ‏\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ ‏\"‏‏.‏ فَلَمْ أَزَلْ أَخْدُمُهُ حَتَّى أَقْبَلْنَا مِنْ خَيْبَرَ، وَأَقْبَلَ بِصَفِيَّةَ بِنْتِ حُيَىٍّ قَدْ حَازَهَا، فَكُنْتُ أَرَاهُ يُحَوِّي وَرَاءَهُ بِعَبَاءَةٍ أَوْ بِكِسَاءٍ، ثُمَّ يُرْدِفُهَا وَرَاءَهُ، حَتَّى إِذَا كُنَّا بِالصَّهْبَاءِ صَنَعَ حَيْسًا فِي نِطَعٍ، ثُمَّ أَرْسَلَنِي فَدَعَوْتُ رِجَالاً فَأَكَلُوا، وَكَانَ ذَلِكَ بِنَاءَهُ بِهَا، ثُمَّ أَقْبَلَ حَتَّى إِذَا بَدَا لَهُ أُحُدٌ قَالَ ‏\"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏‏.‏ فَلَمَّا أَشْرَفَ عَلَى الْمَدِينَةِ قَالَ ‏\"‏ اللَّهُمَّ إِنِّي أُحَرِّمُ مَا بَيْنَ جَبَلَيْهَا مِثْلَ مَا حَرَّمَ بِهِ إِبْرَاهِيمُ مَكَّةَ، اللَّهُمَّ بَارِكْ لَهُمْ فِي مُدِّهِمْ وَصَاعِهِمْ ‏\"‏‏.‏",
                "headingArabic": "الْحَيْسِ",
                "headingUrdu": "الحیس (خشک دہی، مکھن اور کھجور سے تیار کردہ ڈش)۔",
                "headingEnglish": "Al-Hais (dish prepared from dried yoghourt, butter and dates).",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5191,
                "hadithNumber": "5426",
                "englishNarrator": "Narrated `Abdur-Rahman bin Abi Laila:",
                "hadithEnglish": "We were sitting in the company of Hudhaifa رضی اللہ عنہ who asked for water and a Magian brought him water. But when he placed the cup in his hand, he threw it at him and said, \"Had I not forbidden him to do so more than once or twice?\" He wanted to say, \"I would not have done so,\" adding, \"but I heard the Prophet saying, \"Do not wear silk or Dibaja, and do not drink in silver or golden vessels, and do not eat in plates of such metals, for such things are for the unbelievers in this worldly life and for us in the Hereafter.\"",
                "hadithUrdu": "یہ لوگ حذیفہ بن الیمان رضی اللہ عنہ کی خدمت میں موجود تھے ۔ انہوں نے پانی مانگا تو ایک مجوسی نے ان کو پانی ( چاندی کے پیالے میں ) لا کر دیا ۔ جب اس نے پیالہ ان کے ہاتھ میں دیا تو انہوں نے پیالہ کو اس پر پھینک کر مارا اور کہا اگر میں نے اسے بارہا اس سے منع نہ کیا ہوتا ( کہ چاندی سونے کے برتن میں مجھے کچھ نہ دیا کرو ) آگے وہ یہ فرمانا چاہتے تھے کہ تو میں اس سے یہ معاملہ نہ کرتا لیکن میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ ریشم ودیبانہ پہنو اور نہ سونے چاندی کے برتن میں کچھ پیو اور نہ ان کی پلیٹوں میں کچھ کھاؤ کیونکہ یہ چیزیں ان ( کفار کے لیے ) دنیا میں ہیں اور ہمارے لیے آخرت میں ہیں ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سیف بن ابی سلیمان نے ، کہا کہ میں نے مجاہد سے سنا ، کہا کہ مجھ سے عبدالرحمٰن بن ابی لیلیٰ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سَيْفُ بْنُ أَبِي سُلَيْمَانَ، قَالَ سَمِعْتُ مُجَاهِدًا، يَقُولُ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى، أَنَّهُمْ كَانُوا عِنْدَ حُذَيْفَةَ فَاسْتَسْقَى فَسَقَاهُ مَجُوسِيٌّ‏.‏ فَلَمَّا وَضَعَ الْقَدَحَ فِي يَدِهِ رَمَاهُ بِهِ وَقَالَ لَوْلاَ أَنِّي نَهَيْتُهُ غَيْرَ مَرَّةٍ وَلاَ مَرَّتَيْنِ‏.‏ كَأَنَّهُ يَقُولُ لَمْ أَفْعَلْ هَذَا، وَلَكِنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ تَلْبَسُوا الْحَرِيرَ وَلاَ الدِّيبَاجَ وَلاَ تَشْرَبُوا فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ، وَلاَ تَأْكُلُوا فِي صِحَافِهَا، فَإِنَّهَا لَهُمْ فِي الدُّنْيَا وَلَنَا فِي الآخِرَةِ ‏\"‏‏.‏",
                "headingArabic": "الأَكْلِ فِي إِنَاءٍ مُفَضَّضٍ",
                "headingUrdu": "چاندی سے مزین برتن میں کھانا",
                "headingEnglish": "Eating in a dish decorated with silver",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5192,
                "hadithNumber": "5427",
                "englishNarrator": "Narrated Abu Musa Al-Ash`ari رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The example of a Believer who recites the Qur'an, is that of a citron which smells good and tastes good; And the example of a Believer who does not recite the Qur'an, is that of a date which has no smell but tastes sweet; and the example of a hypocrite who recites the Qur'an, is that of an aromatic plant which smells good but tastes bitter; and the example of a hypocrite who does not recite the Qur'an, is that of a colocynth plant which has no smell and is bitter in taste.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اس مومن کی مثال جو قرآن پڑھتا ہو سنگترے جیسی ہے جس کی خوشبو بھی پاکیزہ ہے اور مزہ بھی پاکیزہ ہے اور اس مومن کی مثال جو قرآن نہیں پڑھتا کھجور جیسی ہے جس میں کوئی خوشبو نہیں ہوتی لیکن مزہ میٹھا ہوتا ہے اور منافق کی مثال جو قرآن پڑھتا ہو ، ریحانہ ( پھول ) جیسی ہے جس کی خوشبو تو اچھی ہوتی ہے لیکن مزہ کڑوا ہوتا ہے اور جو منافق قرآن بھی نہیں پڑھتا اس کی مثال اندرائن جیسی ہے جس میں کوئی خوشبو نہیں ہوتی اور جس کا مزہ بھی کڑوا ہوتا ہے ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، انہوں نے کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے قتادہ نے بیان کیا ، ان سے حضرت انس رضی اللہ عنہ نے بیان کیا اور ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏مَثَلُ الْمُؤْمِنِ الَّذِي يَقْرَأُ الْقُرْآنَ كَمَثَلِ الأُتْرُجَّةِ، رِيحُهَا طَيِّبٌ وَطَعْمُهَا طَيِّبٌ، وَمَثَلُ الْمُؤْمِنِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَمَثَلِ التَّمْرَةِ لاَ رِيحَ لَهَا وَطَعْمُهَا حُلْوٌ، وَمَثَلُ الْمُنَافِقِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الرَّيْحَانَةِ، رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ، وَمَثَلُ الْمُنَافِقِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ، لَيْسَ لَهَا رِيحٌ وَطَعْمُهَا مُرٌّ ‏\"‏‏.‏",
                "headingArabic": "ذِكْرِ الطَّعَامِ",
                "headingUrdu": "کھانے کا ذکر",
                "headingEnglish": "The mention of food",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5193,
                "hadithNumber": "5428",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The superiority of `Aisha رضی اللہ عنہا to other ladies is like the superiority of Tharid to other kinds of food.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، عورتوں پر عائشہ رضی اللہ عنہا کی فضیلت ایسی ہے جیسے تمام کھانوں پر ثرید کی فضیلت ہے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے خالد نے بیان کیا ، ان سے عبداللہ بن عبدالرحمٰن نے بیان کیا ، ان سے حضرت انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5194,
                "hadithNumber": "5429",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Traveling is a kind of torture, as it prevents one from sleeping and eating! So when one has finished his job, he should return quickly to his family.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، سفر عذاب کا ایک ٹکڑا ہے ، جو انسان کوسونے اور کھانے سے روک دیتا ہے ۔ پس جب کسی شخص کی سفری ضرورت حسب منشا پوری ہو جائے تو اسے جلد ہی گھر واپس آ جانا چاہیئے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے مالک نے بیان کیا ، ان سے سمی نے ، ان سے صالح نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مَالِكٌ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ، يَمْنَعُ أَحَدَكُمْ نَوْمَهُ وَطَعَامَهُ، فَإِذَا قَضَى نَهْمَتَهُ مِنْ وَجْهِهِ فَلْيُعَجِّلْ إِلَى أَهْلِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5195,
                "hadithNumber": "5430",
                "englishNarrator": "Narrated Qasim bin Muhammad:",
                "hadithEnglish": "Three traditions have been established because of Barira رضی اللہ عنہا : `Aisha رضی اللہ عنہا intended to buy her and set her free, but Barira's masters said, \"Her wala' will be for us.\" `Aisha رضی اللہ عنہا mentioned that to Allah's Messenger (ﷺ) who said, \"You could accept their condition if you wished, for the wala is for the one who manumits the slave.\" Barira رضی اللہ عنہا was manumitted, then she was given the choice either to stay with her husband or leave him; One day Allah's Messenger (ﷺ) entered `Aisha's house while there was a cooking pot of food boiling on the fire. The Prophet (ﷺ) asked for lunch, and he was presented with bread and some extra food from the home-made Udm (e.g. soup). He asked, \"Don't I see meat (being cooked)?\" They said, \"Yes, O Allah's Apostle! But it is the meat that has been given to Barira رضی اللہ عنہا in charity and she has given it to us as a present.\" He said, \"For Barira رضی اللہ عنہا it is alms, but for us it is a present.\"",
                "hadithUrdu": "بریرہ رضی اللہ عنہا کے ساتھ شریعت کی تین سنتیں قائم ہوئیں ۔ حضرت عائشہ رضی اللہ عنہا نے انہیں ( ان کے مالکوں سے ) خرید کر آزاد کرنا چاہا تو ان کے مالکوں نے کہا کہ ولاء کا تعلق ہم سے ہی قائم ہو گا ۔ ( عائشہ رضی اللہ عنہا نے بیان کیا کہ ) میں نے اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا کہ اگر تم یہ شرط لگا بھی لو جب بھی ولاء اسی کے ساتھ قائم ہو گا جو آزاد کرے گا ۔ پھر بیان کیا کہ بریرہ آزاد کی گئیں اور انہیں اختیار دیا گیا کہ اگر وہ چاہیں تو اپنے شوہر کے ساتھ رہیں یا ان سے الگ ہو جائیں اور تیسری بات یہ ہے کہ رسول اللہ صلی اللہ علیہ وسلم ایک دن عائشہ رضی اللہ عنہا کے گھر تشریف لائے ، چولھے پر ہانڈی پک رہی تھی ۔ آپ نے دوپہر کا کھانا طلب فرمایا تو روٹی اور گھر میں موجود سالن پیش کیا گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کیا میں نے گوشت ( پکتے ہوئے ) نہیں دیکھا ہے ؟ عرض کیا کہ دیکھا ہے یا رسول اللہ ! لیکن وہ گوشت تو بریرہ کو صدقہ میں ملا ہے ، انہوں نے ہمیں ہدیہ کے طور پر دیا ہے ۔ آپ نے فرمایا کہ ان کے لیے وہ صدقہ ہے لیکن ہمارے لیے ہدیہ ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعیدنے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے ، ان سے ربیعہ نے ، انہوں نے قاسم بن محمد سے سنا ، آپ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ رَبِيعَةَ، أَنَّهُ سَمِعَ الْقَاسِمَ بْنَ مُحَمَّدٍ، يَقُولُ كَانَ فِي بَرِيرَةَ ثَلاَثُ سُنَنٍ، أَرَادَتْ عَائِشَةُ أَنْ تَشْتَرِيَهَا فَتُعْتِقَهَا، فَقَالَ أَهْلُهَا، وَلَنَا الْوَلاَءُ، فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ لَوْ شِئْتِ شَرَطْتِيهِ لَهُمْ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ قَالَ وَأُعْتِقَتْ فَخُيِّرَتْ فِي أَنْ تَقِرَّ تَحْتَ زَوْجِهَا أَوْ تُفَارِقَهُ، وَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا بَيْتَ عَائِشَةَ وَعَلَى النَّارِ بُرْمَةٌ تَفُورُ، فَدَعَا بِالْغَدَاءِ فَأُتِيَ بِخُبْزٍ وَأُدْمٍ مِنْ أُدْمِ الْبَيْتِ فَقَالَ ‏\"‏ أَلَمْ أَرَ لَحْمًا ‏\"‏‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ، وَلَكِنَّهُ لَحْمٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ، فَأَهْدَتْهُ لَنَا‏.‏ فَقَالَ‏\"‏ هُوَ صَدَقَةٌ عَلَيْهَا، وَهَدِيَّةٌ لَنَا ‏\"‏‏.‏",
                "headingArabic": "الأُدْمِ",
                "headingUrdu": "الدم (روٹی کے ساتھ اضافی کھانا)۔",
                "headingEnglish": "Al-Udm (additional food taken with bread).",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5196,
                "hadithNumber": "5431",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to love sweet edible things and honey.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم میٹھی چیز اور شہد پسند فرمایا کرتے تھے ۔",
                "urduNarrator": "مجھ سے اسحاق بن ابراہیم حنظلی نے بیان کیا ، ان سے ابواسامہ نے ، ان سے ہشام نے بیان کیا ، انہوں نے کہا کہ مجھے میرے والد نے خبر دی اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، عَنْ أَبِي أُسَامَةَ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحِبُّ الْحَلْوَاءَ وَالْعَسَلَ‏.‏",
                "headingArabic": "الْحَلْوَاءِ وَالْعَسَلِ",
                "headingUrdu": "میٹھی کھانے کی چیزیں اور شہد۔",
                "headingEnglish": "Sweet edible things and honey.",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5197,
                "hadithNumber": "5432",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I used to accompany Allah's Messenger (ﷺ) to fill my stomach; and that was when I did not eat baked bread, nor wear silk. Neither a male nor a female slave used to serve me, and I used to bind stones over my belly and ask somebody to recite a Qur'anic Verse for me though I knew it, so that he might take me to his house and feed me. Ja`far bin Abi Talib رضی اللہ عنہ was very kind to the poor, and he used to take us and feed us with what ever was available in his house, (and if nothing was available), he used to give us the empty (honey or butter) skin which we would tear and lick whatever was in it.",
                "hadithUrdu": "میں پیٹ بھرنے کے بعد ہر وقت نبی کریم صلی اللہ علیہ وسلم کے ساتھ ہی رہا کرتا تھا ۔ اس وقت میں روٹی نہیں کھاتا تھا ۔ نہ ریشم پہنتا تھا ، نہ فلاں اور فلانی میری خدمت کرتے تھے ( بھوک کی شدت کی وجہ سے بعض اوقات ) میں اپنے پیٹ پر کنکریاں لگا لیتا اور کبھی میں کسی سے کوئی آیت پڑھنے کے لیے کہتا حالانکہ وہ مجھے یاد ہوتی ۔ مقصد صرف یہ ہوتا کہ وہ مجھے اپنے ساتھ لے جائے اور کھانا کھلا دے اورمسکینوں کے لیے سب سے بہترین شخص حضرت جعفر بن ابی طالب رضی اللہ عنہ تھے ، ہمیں اپنے گھر ساتھ لے جاتے اور جو کچھ بھی گھر میں ہوتا کھلا دیتے تھے ۔ کبھی تو ایسا ہوتا کہ گھی کا ڈبہ نکال کر لاتے اور اس میں کچھ نہ ہوتا ۔ ہم اسے پھاڑ کراس میں جو کچھ لگا ہوتا چاٹ لیتے تھے ۔",
                "urduNarrator": "ہم سے عبدالرحمٰن بن شیبہ نے بیان کیا ، کہا کہ مجھے ابن ابی الفدیک نے خبر دی ، انہیں ابن ابی ذئب نے ، انہیں مقبری نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ شَيْبَةَ، قَالَ أَخْبَرَنِي ابْنُ أَبِي الْفُدَيْكِ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كُنْتُ أَلْزَمُ النَّبِيَّ صلى الله عليه وسلم لِشِبَعِ بَطْنِي حِينَ لاَ آكُلُ الْخَمِيرَ، وَلاَ أَلْبَسُ الْحَرِيرَ، وَلاَ يَخْدُمُنِي فُلاَنٌ وَلاَ فُلاَنَةُ، وَأُلْصِقُ بَطْنِي بِالْحَصْبَاءِ، وَأَسْتَقْرِئُ الرَّجُلَ الآيَةَ وَهْىَ مَعِي كَىْ يَنْقَلِبَ بِي فَيُطْعِمَنِي، وَخَيْرُ النَّاسِ لِلْمَسَاكِينِ جَعْفَرُ بْنُ أَبِي طَالِبٍ، يَنْقَلِبُ بِنَا فَيُطْعِمُنَا مَا كَانَ فِي بَيْتِهِ، حَتَّى إِنْ كَانَ لَيُخْرِجُ إِلَيْنَا الْعُكَّةَ لَيْسَ فِيهَا شَىْءٌ، فَنَشْتَقُّهَا فَنَلْعَقُ مَا فِيهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5198,
                "hadithNumber": "5433",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) went to (the house of) his slave tailor, and he was offered (a dish of) gourd of which he started eating. I have loved to eat gourd since I saw Allah's Messenger (ﷺ) eating it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنے ایک درزی غلام کے پاس تشریف لے گئے ، پھر آپ کی خدمت میں ( پکا ہوا ) کدو پیش کیا گیا اور آپ اسے ( رغبت کے ساتھ ) کھانے لگے ۔ اسی وقت سے میں بھی کدو پسند کرتا ہوں کیونکہ حضور اکرم صلی اللہ علیہ وسلم کو اسے میں نے کھاتے ہوئے دیکھا ہے ۔",
                "urduNarrator": "ہم سے عمرو بن علی نے بیان کیا ، کہا ہم سے ازہر بن سعد نے بیان کیا ، ان سے ابن عون نے ، ان سے ثمامہ بن انس نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَزْهَرُ بْنُ سَعْدٍ، عَنِ ابْنِ عَوْنٍ، عَنْ ثُمَامَةَ بْنِ أَنَسٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَى مَوْلًى لَهُ خَيَّاطًا، فَأُتِيَ بِدُبَّاءٍ، فَجَعَلَ يَأْكُلُهُ، فَلَمْ أَزَلْ أُحِبُّهُ مُنْذُ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُهُ‏.‏",
                "headingArabic": "الدُّبَّاءِ",
                "headingUrdu": "کدوکا بیان",
                "headingEnglish": "Ad-Dubba' (gourd)",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5199,
                "hadithNumber": "5434",
                "englishNarrator": "Narrated Abu Mas`ud Al-Ansari رضی اللہ عنہ :",
                "hadithEnglish": "There was a man called Abu Shu'aib, and he had a slave who was a butcher. He said (to his slave), \"Prepare a meal to which I may invite Allah's Messenger (ﷺ) along with four other men.\" So he invited Allah's Messenger (ﷺ) and four other men, but another man followed them whereupon the Prophet (ﷺ) said, \"You have invited me as one of five guests, but now another man has followed us. If you wish you can admit him, and if you wish you can refuse him.\" On that the host said, \"But I admit him.\" Narrated Muhammad bin Isma`il: If guests are sitting at a dining table, they do not have the right to carry food from other tables to theirs, but they can pass on food from their own table to each other; otherwise they should leave it.",
                "hadithUrdu": "جماعت انصار میں ایک صاحب تھے جنہیں ابوشعیب کہا جاتا تھا ۔ ان کے پاس ایک غلام تھا جو گوشت بیچتا تھا ۔ حضرت ابو شعیب رضی اللہ عنہ نے ان غلام سے کہا کہ تم میری طرف سے کھانا تیار کر دو ۔ میں چاہتا ہوں کہ رسول اللہ صلی اللہ علیہ وسلم سمیت پانچ آدمیوں کی دعوت کروں ۔ چنانچہ وہ حضور اکرم صلی اللہ علیہ وسلم کو چار دوسرے آدمیوں کے ساتھ بلا کرلائے ۔ ان کے ساتھ ایک صاحب بھی چلنے لگے تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہم پانچ آدمیوں کی تم نے دعوت کی ہے مگریہ صاحب بھی ہمارے ساتھ آ گئے ہیں ، اگر چاہو تو انہیں اجازت دو اور اگر چاہو منع کر دو ۔ حضرت ابو شعیب رضی اللہ عنہ نے کہا کہ میں نے انہیں بھی اجازت دے دی ۔ محمد بن یوسف نے بیان کیا کہ میں نے محمد بن اسماعیل سے سنا ، وہ بیان کرتے تھے کہ جب لوگ دسترخوان پر بیٹھے ہوں تو انہیں اس کی اجازت نہیں ہے کہ ایک دسترخوان والے دوسرے دسترخوان والوں کو اپنے دسترخوان سے اٹھا کر کوئی چیز دیں ۔ البتہ ایک ہی دسترخوان پر ان کے شرکاء کو اس میں سے کوئی چیز دینے نہ دینے کا اختیار ہے ۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے اعمش نے ، ان سے ابووائل نے اور ان سے ابومسعود انصاری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ كَانَ مِنَ الأَنْصَارِ رَجُلٌ يُقَالُ لَهُ أَبُو شُعَيْبٍ، وَكَانَ لَهُ غُلاَمٌ لَحَّامٌ فَقَالَ اصْنَعْ لِي طَعَامًا أَدْعُو رَسُولَ اللَّهِ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ، فَدَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم خَامِسَ خَمْسَةٍ، فَتَبِعَهُمْ رَجُلٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّكَ دَعَوْتَنَا خَامِسَ خَمْسَةٍ وَهَذَا رَجُلٌ قَدْ تَبِعَنَا، فَإِنْ شِئْتَ أَذِنْتَ لَهُ، وَإِنْ شِئْتَ تَرَكْتَهُ ‏\"‏‏.‏ قَالَ بَلْ أَذِنْتُ لَهُ‏.‏ قَالَ مُحَمَّدُ بْنُ يُوسُفَ سَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيْلَ يَقُولُ إِذَا كَانَ الْقَوْمُ عَلَى الْمَائِدَةِ لَيْسَ لَهُمْ أَنْ يُنَاوِلُوا مِنْ مَائِدَةٍ إِلَى مَائِدَةٍ أُخْرَى وَلَكِنْ يُنَاوِلُ بَعْضُهُمْ بَعْضًا فِي تِلْكَ الْمَائِدَةِ أَوْ يَدَعُ",
                "headingArabic": "الرَّجُلِ يَتَكَلَّفُ الطَّعَامَ لإِخْوَانِهِ",
                "headingUrdu": "(مسلم) بھائیوں کے لیے کھانا تیار کرنا",
                "headingEnglish": "To prepare a meal for (Muslim) brethren",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5200,
                "hadithNumber": "5435",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "I was a young boy when I once was walking with Allah's Messenger (ﷺ) . Allah's Messenger (ﷺ) entered the house of his slave tailor and the latter brought a dish filled with food covered with pieces of gourd. Allah's Apostle started picking and eating the gourd. When I saw that, I started collecting and placing the gourd before him. Then the slave returned to his work. Anas رضی اللہ عنہ added: I have kept on loving gourd since I saw Allah's Messenger (ﷺ) doing what he was doing.",
                "hadithUrdu": "میں نوعمر تھا اور رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رہتا تھا ۔ آنحضرت صلی اللہ علیہ وسلم اپنے ایک درزی غلام کے پاس تشریف لے گئے ۔ وہ ایک پیالہ لایا جس میں کھانا تھا اور اوپر کدو کے قتلے تھے ۔ آپ کدو تلاش کرنے لگے ۔ حضرت انس رضی اللہ عنہ نے بیان کیا کہ جب میں نے یہ دیکھا تو کدو کے قتلے آپ کے سامنے جمع کر کے رکھنے لگا ۔ حضرت انس رضی اللہ عنہ نے بیان کیا کہ ( پیالہ آنحضور صلی اللہ علیہ وسلم کے سامنے رکھنے کے بعد ) غلام اپنے کام میں لگ گیا ۔ حضرت انس رضی اللہ عنہ نے بیان کیا کہ اسی وقت سے میں کدو پسند کرنے لگا ، جب میں نے آنحضرت صلی اللہ علیہ وسلم کا یہ عمل دیکھا ۔",
                "urduNarrator": "مجھ سے عبداللہ بن منیر نے بیان کیا ، انہوں نے نضر سے سنا ، انہیں ابن عون نے خبر دی ، کہا کہ مجھے ثمامہ بن عبداللہ بن انس نے خبر دی اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ النَّضْرَ، أَخْبَرَنَا ابْنُ عَوْنٍ، قَالَ أَخْبَرَنِي ثُمَامَةُ بْنُ عَبْدِ اللَّهِ بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كُنْتُ غُلاَمًا أَمْشِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى غُلاَمٍ لَهُ خَيَّاطٍ، فَأَتَاهُ بِقَصْعَةٍ فِيهَا طَعَامٌ وَعَلَيْهِ دُبَّاءٌ، فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ ـ قَالَ ـ فَلَمَّا رَأَيْتُ ذَلِكَ جَعَلْتُ أَجْمَعُهُ بَيْنَ يَدَيْهِ ـ قَالَ ـ فَأَقْبَلَ الْغُلاَمُ عَلَى عَمَلِهِ‏.‏ قَالَ أَنَسٌ لاَ أَزَالُ أُحِبُّ الدُّبَّاءَ بَعْدَ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَنَعَ مَا صَنَعَ‏.‏",
                "headingArabic": "مَنْ أَضَافَ رَجُلاً إِلَى طَعَامٍ، وَأَقْبَلَ هُوَ عَلَى عَمَلِهِ",
                "headingUrdu": "جس نے کسی آدمی کو کھانے پر بلایا اور پھر اپنے کام پر چلا گیا۔",
                "headingEnglish": "Whoever invited a man to a meal and then went to carry on his job.",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5201,
                "hadithNumber": "5436",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "A tailor invited the Prophet (ﷺ) to a meal which he had prepared, and I went along with the Prophet (ﷺ) . The tailor presented barley bread and soup containing gourd and cured meat. I saw the Prophet (ﷺ) picking the pieces of gourd from around the dish, and since then I have kept on liking gourd.",
                "hadithUrdu": "ایک درزی نے رسول اللہ صلی اللہ علیہ وسلم کو کھانے کی دعوت دی جو انہوں نے آنحضور صلی اللہ علیہ وسلم کے لیے تیار کیا تھا ۔ میں بھی آپ کے ساتھ گیا ۔ آنحضرت صلی اللہ علیہ وسلم کے سامنے جو کی روٹی اور شوربہ پیش کیا گیا ۔ جس میں کدو اور خشک گوشت کے ٹکڑے تھے ۔ میں نے دیکھا کہ آنحضرت صلی اللہ علیہ وسلم پیالے میں چاروں طرف کدو تلاش کر رہے تھے ۔ اسی دن سے میں بھی کدو پسند کرنے لگا ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک بن انس نے ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، أَنَّ خَيَّاطًا، دَعَا النَّبِيَّ صلى الله عليه وسلم لِطَعَامٍ صَنَعَهُ، فَذَهَبْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فَقَرَّبَ خُبْزَ شَعِيرٍ وَمَرَقًا فِيهِ دُبَّاءٌ وَقَدِيدٌ، فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوَالَىِ الْقَصْعَةِ، فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ بَعْدَ يَوْمِئِذٍ‏.‏",
                "headingArabic": "الْمَرَقِ",
                "headingUrdu": "شوربے کابیان",
                "headingEnglish": "Soup",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5202,
                "hadithNumber": "5437",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "I saw the Prophet (ﷺ) being served with soup and containing gourd and cured meat, and I saw him picking and eating the pieces of gourd.",
                "hadithUrdu": "میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں شوربہ لایا گیا ۔ اس میں کدو اور سوکھے گوشت کے ٹکڑے تھے ، پھر میں نے دیکھا کہ آنحضرت صلی اللہ علیہ وسلم اس میں سے کدو کے قتلے تلاش کر کر کے کھا رہے تھے ۔",
                "urduNarrator": "ہم سے حکیم ابونعیم نے بیان کیا ، کہا ہم سے مالک بن انس نے ، ان سے اسحاق بن عبداللہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِمَرَقَةٍ فِيهَا دُبَّاءٌ وَقَدِيدٌ، فَرَأَيْتُهُ يَتَتَبَّعُ الدُّبَّاءَ يَأْكُلُهَا‏.‏",
                "headingArabic": "الْقَدِيدِ",
                "headingUrdu": "شفا بخش گوشت۔",
                "headingEnglish": "Cured meat.",
                "chapterId": "71",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 71,
                    "chapterNumber": "71",
                    "chapterEnglish": "Food, Meals",
                    "chapterUrdu": "کھانوں کے بیان میں",
                    "chapterArabic": "كتاب الأطعمة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5176,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=207",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=205",
                "label": "205",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=206",
                "label": "206",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=207",
                "label": "207",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=208",
                "label": "208",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=209",
                "label": "209",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=210",
                "label": "210",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=211",
                "label": "211",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=209",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=209",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=207",
        "to": 5200,
        "total": 40465
    }
}