{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 125,
        "data": [
            {
                "id": 3103,
                "hadithNumber": "3247",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Verily! 70,000 or 700,000 of my followers will enter Paradise altogether; so that the first and the last amongst them will enter at the same time, and their faces will be glittering like the bright full moon.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میری امت میں سے ستر ہزار یا ( آپ نے یہ فرمایا کہ ) سات لاکھ کی ایک جماعت جنت میں ایک ہی وقت میں داخل ہوں گی اور ان سب کے چہرے ایسے چمکیں گے جیسے چودہویں کا چاند چمکتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا ، انہوں نے کہا ہم سے فضیل بن سلیمان نے بیان کیا ، ان سے ابوحازم نے بیان کیا اور ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ لَيَدْخُلَنَّ مِنْ أُمَّتِي سَبْعُونَ أَلْفًا ـ أَوْ سَبْعُمِائَةِ أَلْفٍ ـ لاَ يَدْخُلُ أَوَّلُهُمْ حَتَّى يَدْخُلَ آخِرُهُمْ، وَجُوهُهُمْ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3104,
                "hadithNumber": "3248",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "A silken cloak was presented to the Prophet (ﷺ) and he used to forbid the usage of silk (by men). When the people were fascinated by the cloak. he said, \"By Allah in Whose Hands the life of Muhammad is, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں سندس ( ایک خاص قسم کا ریشم ) کا ایک جبہ تحفہ میں پیش کیا گیا ۔ آپ ( مردوں کے لیے ) ریشم کے استعمال سے پہلے ہی منع فرما چکے تھے ۔ لوگوں نے اس جبے کو بہت ہی پسند کیا ، تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جنت میں سعد بن معاذ کے رو مال اس سے بہتر ہوں گے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد جعفی نے بیان کیا ، کہا ہم سے یونس بن محمد نے بیان کیا ، ان سے شیبان نے بیان کیا ، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسٌ ـ رضى الله عنه ـ قَالَ أُهْدِيَ لِلنَّبِيِّ صلى الله عليه وسلم جُبَّةُ سُنْدُسٍ، وَكَانَ يَنْهَى عَنِ الْحَرِيرِ، فَعَجِبَ النَّاسُ مِنْهَا، فَقَالَ ‏ \"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، لَمَنَادِيلُ سَعْدِ بْنِ مُعَاذٍ فِي الْجَنَّةِ أَحْسَنُ مِنْ هَذَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3105,
                "hadithNumber": "3249",
                "englishNarrator": "Narrated Al-Bara bin Azib رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) was given a silken garment, and its beauty and delicacy astonished the people. On that, Allah's Messenger (ﷺ) said, \"No doubt, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ریشم کا ایک کپڑا پیش کیا گیا اس کی خوبصورتی اور نزاکت نے لوگوں کو حیرت میں ڈال دیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جنت میں سعد بن معاذ کے رو مال اس سے بہتر اور افضل ہیں ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے سفیان نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابواسحاق نے بیان کیا ، کہا کہ میں نے براء بن عازب رضی اللہ عنہما سے سنا ، آپ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِثَوْبٍ مِنْ حَرِيرٍ، فَجَعَلُوا يَعْجَبُونَ مِنْ حُسْنِهِ وَلِينِهِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَمَنَادِيلُ سَعْدِ بْنِ مُعَاذٍ فِي الْجَنَّةِ أَفْضَلُ مِنْ هَذَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3106,
                "hadithNumber": "3250",
                "englishNarrator": "Narrated Sahl bin Sa`d Al-Saidi رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"A place in Paradise equal to the size of a lash is better than the whole world and whatever is in it.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جنت میں ایک کوڑے کی جگہ دنیا سے اور جو کچھ دنیا میں ہے ، سب سے بہتر ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے ابوحازم نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَوْضِعُ سَوْطٍ فِي الْجَنَّةِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3107,
                "hadithNumber": "3251",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"There is a tree in Paradise (which is so big and huge that) if a rider travels in its shade for one hundred years, he would not be able to cross it.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جنت میں ایک درخت ہے جس کے سائے میں ایک سوار سو سال تک چل سکتا ہے اور پھر بھی اس کو طے نہ کر سکے گا ۔",
                "urduNarrator": "ہم سے روح بن عبدالمؤمن نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے سعید بن ابی عروبہ نے بیان کیا ، ان سے قتادہ نے او ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا رَوْحُ بْنُ عَبْدِ الْمُؤْمِنِ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ لاَ يَقْطَعُهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3108,
                "hadithNumber": "3252, 3253",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said \"There is a tree in Paradise (which is so big and huge that) a rider could travel in its shade for a hundred years. And if you wish, you can recite:--'In shade long extended..' (56. 30)\" and a place in Paradise equal to an arrow bow of one of you, is better than (the whole earth) on which the sun rises and sets.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جنت میں ایک درخت ہے جس کے سائے میں ایک سوار سو سال تک چل سکے گا اور اگر تمہارا جی چاہے تو یہ آیت پڑھ لو »وظل ممدود « ” اور لمبا سایہ “ ۔اور کسی شخص کے لیے ایک کمان کے برابر جنت میں جگہ اس پوری دنیا سے بہتر ہے جس پر سورج طلوع اور غروب ہوتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن سنان نے بیان کیا ، انہوں نے کہا ہم سے فلیح بن سلیمان نے بیان کیا ، ان سے ہلال بن علی نے بیان کیا ، ان سے عبدالرحمن بن ابی عمرہ نے بیان کیا اور ان سے ابوہریرۃ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، حَدَّثَنَا هِلاَلُ بْنُ عَلِيٍّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ سَنَةٍ، وَاقْرَءُوا إِنْ شِئْتُمْ ‏{‏وَظِلٍّ مَمْدُودٍ‏}‏‏\"‏.«وَلَقَابُ قَوْسِ أَحَدِكُمْ فِي الْجَنَّةِ خَيْرٌ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ أَوْ تَغْرُبُ».",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3109,
                "hadithNumber": "3254",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The first batch (of people) who will enter Paradise will be (glittering) like the full moon, and the batch next to them will be (glittering) like the most brilliant star in the sky. Their hearts will be as if the heart of a single man, for they will have neither enmity nor jealousy amongst themselves; everyone will have two wives from the houris, (who will be so beautiful, pure and transparent that) the marrow of the bones of their legs will be seen through the bones and the flesh.\"",
                "hadithUrdu": "سب سے پہلا گروہ جو جنت میں داخل ہو گا ، ان کے چہرے چودہویں رات کے چاند کی طرح روشن ہوں گے ۔ جو گروہ اس کے بعد داخل ہو گا ان کے چہرے آسمان پر موتی کی طرح چمکنے والے ستاروں میں جو سب سے زیادہ روشن ستارہ ہوتا ہے اس جیسے روشن ہوں گے ، سب کے دل ایک جیسے ہوں گے نہ ان میں بغض و فساد ہو گا اور نہ حسد ، ہر جنتی کی دو حور عین بیویاں ہوں گی ، اتنی حسین کہ ان کی پنڈلی کی ہڈی اور گوشت کے اندر کا گودا بھی دیکھا جا سکے گا ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا ہم سے محمد بن فلیح نے بیان کیا ، کہا ہم سے ہمارے باپ نے بیان کیا ، ان سے ہلال نے ، ان سے عبدالرحمن بن ابی عمرہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ، حَدَّثَنَا أَبِي، عَنْ هِلاَلٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ أَوَّلُ زُمْرَةٍ تَدْخُلُ الْجَنَّةَ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ، وَالَّذِينَ عَلَى آثَارِهِمْ كَأَحْسَنِ كَوْكَبٍ دُرِّيٍّ فِي السَّمَاءِ إِضَاءَةً، قُلُوبُهُمْ عَلَى قَلْبِ رَجُلٍ وَاحِدٍ، لاَ تَبَاغُضَ بَيْنَهُمْ وَلاَ تَحَاسُدَ، لِكُلِّ امْرِئٍ زَوْجَتَانِ مِنَ الْحُورِ الْعِينِ، يُرَى مُخُّ سُوقِهِنَّ مِنْ وَرَاءِ الْعَظْمِ وَاللَّحْمِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3110,
                "hadithNumber": "3255",
                "englishNarrator": "Narrated Al-Bara (bin Azib) رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet, after the death of his son Ibrahim رضی اللہ عنہ , said, \"There is a wet-nurse for him (i.e. Ibrahim) in Paradise.\"",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم کے ( صاحبزادے ) ابراہیم رضی اللہ عنہ کا انتقال ہوا ، تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جنت میں اسے ایک دودھ پلانے والی انا کے حوالہ کر دیا گیا ہے ( جو ان کو دودھ پلاتی ہے )",
                "urduNarrator": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے عدی بن ثابت نے خبر دی ، کہا کہ میں نے براء بن عازب رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ عَدِيُّ بْنُ ثَابِتٍ أَخْبَرَنِي قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ لَمَّا مَاتَ إِبْرَاهِيمُ قَالَ ‏ \"‏ إِنَّ لَهُ مُرْضِعًا فِي الْجَنَّةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3111,
                "hadithNumber": "3256",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The people of Paradise will look at the dwellers of the lofty mansions (i.e. a superior place in Paradise) in the same way as one looks at a brilliant star far away in the East or in the West on the horizon; all that is because of their superiority over one another (in rewards).\" On that the people said, \"O Allah's Messenger (ﷺ)! Are these lofty mansions for the prophets which nobody else can reach? The Prophet (ﷺ) replied,\" No! \"By Allah in whose Hands my life is, these are for the men who believed in Allah and also believed in the Apostles.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جنتی لوگ اپنے سے بلند کمرے والوں کو اوپر اسی طرح دیکھیں گے جیسے چمکتے ستارے کو جو صبح کے وقت رہ گیا ہو ، آسمان کے کنارے پورب یا پچھم میں دیکھتے ہیں ۔ ان میں ایک دوسرے سے افضل ہو گا ۔ لوگوں نے عرض کیا ، یا رسول اللہ ! یہ تو انبیاء کے محل ہوں گے جنہیں ان کے سوار اور کوئی نہ پا سکے گا ۔ آپ نے فرمایا کہ نہیں ، اس ذات کی قسم ! جس کے ہاتھ میں میری جان ہے ۔ یہ ان لوگوں کے لیے ہوں گے جو اللہ تعالیٰ پر ایمان لائے اور انبیاء کی تصدیق کی ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے امام مالک بن انس نے بیان کیا ، ان سے صفوان بن سلیم نے ، ان سے عطاء بن یسار نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ أَهْلَ الْجَنَّةِ يَتَرَاءَيُونَ أَهْلَ الْغُرَفِ مِنْ فَوْقِهِمْ كَمَا يَتَرَاءَيُونَ الْكَوْكَبَ الدُّرِّيَّ الْغَابِرَ فِي الأُفُقِ مِنَ الْمَشْرِقِ أَوِ الْمَغْرِبِ، لِتَفَاضُلِ مَا بَيْنَهُمْ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ، تِلْكَ مَنَازِلُ الأَنْبِيَاءِ لاَ يَبْلُغُهَا غَيْرُهُمْ قَالَ ‏\"‏ بَلَى وَالَّذِي نَفْسِي بِيَدِهِ، رِجَالٌ آمَنُوا بِاللَّهِ وَصَدَّقُوا الْمُرْسَلِينَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3112,
                "hadithNumber": "3257",
                "englishNarrator": "Narrated Sahl bin Sa`di رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Paradise has eight gates, and one of them is called Ar-Raiyan through which none will enter but those who observe fasting.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جنت کے آٹھ دروازے ہیں ۔ ان میں ایک دروازے کا نام ریان ہے ۔ جس سے داخل ہونے والے صرف روزے دار ہوں گے ۔",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے محمد بن مطرف نے بیان کیا ، کہا کہ مجھ سے ابوحازم نے بیان کیا ، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا مُحَمَّدُ بْنُ مُطَرِّفٍ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ فِي الْجَنَّةِ ثَمَانِيَةُ أَبْوَابٍ، فِيهَا باب يُسَمَّى الرَّيَّانَ لاَ يَدْخُلُهُ إِلاَّ الصَّائِمُونَ ‏\"‏‏.‏",
                "headingArabic": "صِفَةِ أَبْوَابِ الْجَنَّةِ",
                "headingUrdu": "جنت کے دروازوں کی خصوصیات",
                "headingEnglish": "The characteristics of the gates of Paradise",
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3113,
                "hadithNumber": "3258",
                "englishNarrator": "Narrated Abu Dhar رضی اللہ عنہ :",
                "hadithEnglish": "While the Prophet (ﷺ) was on a journey, he said (regarding the performance of the Zuhr prayer), \"Wait till it (i.e. the weather) gets cooler.\" He said the same again till the shade of the hillocks extended. Then he said, \"Delay the (Zuhr) Prayer till it gets cooler, for the severity of heat is from the increase in heat of Hell (fire).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک سفر میں تھے ( جب حضرت بلال رضی اللہ عنہ ظہر کی اذان دینے اٹھے تو ) آپ نے فرمایا کہ وقت ذرا ٹھنڈا ہو لینے دو ، پھر دوبارہ ( جب وہ اذان کے لیے اٹھے تو پھر ) آپ نے انہیں یہی حکم دیا کہ وقت اور ٹھنڈا ہو لینے دو ، یہاں تک کہ ٹیلوں کے نیچے سے سایہ ڈھل گیا ، اس کے بعد آپ نے فرمایا کہ نماز ٹھنڈے وقت اوقات میں پڑھا کرو ، کیونکہ گرمی کی شدت جہنم کی بھاپ سے پیدا ہوتی ہے ۔",
                "urduNarrator": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے مہاجر ابوالحسن نے بیان کیا کہ میں نے زید بن وہب سے سنا ، انہوں نے بیان کیا کہ میں نے ابوذر رضی اللہ عنہ سے سنا وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ مُهَاجِرٍ أَبِي الْحَسَنِ، قَالَ سَمِعْتُ زَيْدَ بْنَ وَهْبٍ، يَقُولُ سَمِعْتُ أَبَا ذَرٍّ ـ رضى الله عنه ـ يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم فِي سَفَرٍ فَقَالَ ‏\"‏ أَبْرِدْ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ أَبْرِدْ ‏\"‏‏.‏ حَتَّى فَاءَ الْفَىْءُ، يَعْنِي لِلتُّلُولِ، ثُمَّ قَالَ ‏\"‏ أَبْرِدُوا بِالصَّلاَةِ، فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ‏\"‏‏.‏",
                "headingArabic": "صِفَةِ النَّارِ وَأَنَّهَا مَخْلُوقَةٌ",
                "headingUrdu": "(جہنم) آگ کی تفصیل اور یہ حقیقت کہ یہ پہلے ہی پیدا ہو چکی ہے۔",
                "headingEnglish": "The description of the (Hell) Fire and the fact that it has already been created",
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3114,
                "hadithNumber": "3259",
                "englishNarrator": "Narrated Abu Saeed رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Delay the (Zuhr) Prayer till it gets cooler, for the severity of heat is from the increase in the heat of Hell (fire).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، نماز ٹھنڈے وقت میں پڑھا کرو ، کیونکہ گرمی کی شدت جہنم کی بھاپ سے پیدا ہوتی ہے ۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے اعمش نے ، ان سے ذکو ان نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ ذَكْوَانَ، عَنْ أَبِي سَعِيدٍ، رضى الله عنه قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَبْرِدُوا بِالصَّلاَةِ فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3115,
                "hadithNumber": "3260",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The (Hell) Fire complained to its Lord saying, 'O my Lord! My different parts eat up each other.' So, He allowed it to take two breaths, one in the winter and the other in summer, and this is the reason for the severe heat and the bitter cold you find (in weather).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جہنم نے اپنے رب کے حضور میں شکایت کی اور کہا کہ میرے رب ! میرے ہی بعض حصے نے بعض کو کھا لیا ہے ۔ اللہ تعالیٰ نے اسے دو سانسوں کی اجازت دی ، ایک سانس جاڑے میں اور ایک گرمی میں ۔ تم انتہائی گرمی اور انتہائی سردی جو ان موسموں میں دیکھتے ہو ، اس کا یہی سبب ہے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا کہ ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابوسلمہ بن عبدالرحمن نے بیان کیا اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، آپ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اشْتَكَتِ النَّارُ إِلَى رَبِّهَا، فَقَالَتْ رَبِّ أَكَلَ بَعْضِي بَعْضًا، فَأَذِنَ لَهَا بِنَفَسَيْنِ نَفَسٍ فِي الشِّتَاءِ وَنَفَسٍ فِي الصَّيْفِ، فَأَشَدُّ مَا تَجِدُونَ فِي الْحَرِّ، وَأَشَدُّ مَا تَجِدُونَ مِنَ الزَّمْهَرِيرِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3116,
                "hadithNumber": "3261",
                "englishNarrator": "Narrated Abu Jamra Ad-Dabi:",
                "hadithEnglish": "I used to sit with Ibn `Abbas رضی اللہ عنہما in Mecca. Once I had a fever and he said (to me), \"Cool your fever with Zamzam water, for Allah's Messenger (ﷺ) said: 'It, (the Fever) is from the heat of the (Hell) Fire; so, cool it with water (or Zamzam water). Here Hammam is in doubt.",
                "hadithUrdu": "میں مکہ میں ابن عباس رضی اللہ عنہما کی خدمت میں بیٹھا کرتا تھا ۔ وہاں مجھے بخار آنے لگا ۔ ابن عباس رضی اللہ عنہما نے فرمایا کہ اس بخار کو زمزم کے پانی سے ٹھنڈا کر ، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جہنم کی بھاپ کے اثر سے آتا ہے ، اس لیے اسے پانی سے ٹھنڈا کر لیا کرو یا یہ فرمایا کہ زمزم کے پانی سے ۔ یہ شک ہمام راوی کو ہوا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے ابوعامر عبدالملک عقدی نے بیان کیا ان سے ہمام بن یحییٰ نے بیان کیا ، ان سے ابوجمرہ نصر بن عمران ضبعی نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا هَمَّامٌ، عَنْ أَبِي جَمْرَةَ الضُّبَعِيِّ، قَالَ كُنْتُ أُجَالِسُ ابْنَ عَبَّاسٍ بِمَكَّةَ، فَأَخَذَتْنِي الْحُمَّى، فَقَالَ أَبْرِدْهَا عَنْكَ بِمَاءِ زَمْزَمَ، فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَأَبْرِدُوهَا بِالْمَاءِ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ بِمَاءِ زَمْزَمَ ‏\"‏‏.‏ شَكَّ هَمَّامٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3117,
                "hadithNumber": "3262",
                "englishNarrator": "Narrated Rafi` bin Khadij رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"Fever is from the heat of the (Hell) Fire; so cool it with water.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا تھا کہ بخار جہنم کے جوش مارنے کے اثر سے ہوتا ہے اس لیے اسے پانی سے ٹھنڈا کر لیا کرو ۔",
                "urduNarrator": "مجھ سے عمرو بن عباس نے بیان کیا ، کہا ہم سے عبدالرحمن بن مہدی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے ان کے باپ نے ، ان سے عبایہ بن رفاعہ نے بیان کیا ، کہا مجھ کو رافع بن خدیج رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِيهِ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، قَالَ أَخْبَرَنِي رَافِعُ بْنُ خَدِيجٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْحُمَّى مِنْ فَوْرِ جَهَنَّمَ، فَأَبْرِدُوهَا عَنْكُمْ بِالْمَاءِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3118,
                "hadithNumber": "3263",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Fever is from the heat of the (Hell) Fire, so cool it with water.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، بخار جہنم کی بھاپ کے اثر سے ہوتا ہے اسے پانی سے ٹھنڈا کر لیا کرو ۔",
                "urduNarrator": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے عروہ بن زبیر نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا هِشَامٌ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ، فَأَبْرِدُوهَا بِالْمَاءِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3119,
                "hadithNumber": "3264",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Fever is from the heat of the (Hell) Fire; so abate fever with water.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، بخار جہنم کی بھاپ کے اثر سے ہوتا ہے اس لیے اسے پانی سے ٹھنڈا کر لیا کرو ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، ان سے یحییٰ نے ، ان سے عبیداللہ نے بیان کیا ، کہا کہ مجھ سے نافع نے بیان کیا اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَأَبْرِدُوهَا بِالْمَاءِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3120,
                "hadithNumber": "3265",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Your (ordinary) fire is one of 70 parts of the (Hell) Fire.\" Someone asked, \"O Allah's Messenger (ﷺ) This (ordinary) fire would have been sufficient (to torture the unbelievers),\" Allah's Apostle said, \"The (Hell) Fire has 69 parts more than the ordinary (worldly) fire, each part is as hot as this (worldly) fire.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، تمہاری ( دنیا کی ) آگ جہنم کی آگ کے مقابلے میں ( اپنی گرمی اور ہلاکت خیزی میں ) سترواں حصہ ہے ۔ کسی نے پوچھا ، یا رسول اللہ ! ( کفار اور گنہگاروں کے عذاب کے لیے ) یہ ہماری دنیا کی آگ بھی بہت تھی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ دنیا کی آگ کے مقابلے میں جہنم کی آگ انہتر گنا بڑھ کر ہے ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ نَارُكُمْ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنْ نَارِ جَهَنَّمَ ‏\"‏‏.‏ قِيلَ يَا رَسُولَ اللَّهِ، إِنْ كَانَتْ لَكَافِيَةً‏.‏ قَالَ ‏\"‏ فُضِّلَتْ عَلَيْهِنَّ بِتِسْعَةٍ وَسِتِّينَ جُزْءًا، كُلُّهُنَّ مِثْلُ حَرِّهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3121,
                "hadithNumber": "3266",
                "englishNarrator": "Narrated Yali:",
                "hadithEnglish": "He heard the Prophet (ﷺ) on the pulpit reciting:-- \"They will cry: \"O Malik!' (43.77) (Malik is the gate-keeper (angel) of the (Hell) Fire.)",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم کو منبر پر اس طرح آیت پڑھتے سنا » ونادوا یا ملک « ( اور وہ دوزخی پکاریں گے ، اے مالک ! ) ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، انہوں نے عطاء سے سنا ، انہوں نے صفوان بن یعلیٰ سے خبر دی ۔ انہوں نے اپنے والد کے واسطہ سے",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ عَطَاءً، يُخْبِرُ عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ عَلَى الْمِنْبَرِ ‏{‏وَنَادَوْا يَا مَالِكُ ‏}‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3122,
                "hadithNumber": "3267",
                "englishNarrator": "Narrated Abu Wail:",
                "hadithEnglish": "Somebody said to Usama رضی اللہ عنہما , \"Will you go to so-and-so (i.e. `Uthman) and talk to him (i.e. advise him regarding ruling the country)?\" He said, \"You see that I don't talk to him. Really I talk to (advise) him secretly without opening a gate (of affliction), for neither do I want to be the first to open it (i.e. rebellion), nor will I say to a man who is my ruler that he is the best of all the people after I have heard something from Allah s Apostle .\" They said, What have you heard him saying? He said, \"I have heard him saying, \"A man will be brought on the Day of Resurrection and thrown in the (Hell) Fire, so that his intestines will come out, and he will go around like a donkey goes around a millstone. The people of (Hell) Fire will gather around him and say: O so-and-so! What is wrong with you? Didn't you use to order us to do good deeds and forbid us to do bad deeds? He will reply: Yes, I used to order you to do good deeds, but I did not do them myself, and I used to forbid you to do bad deeds, yet I used to do them myself.\" Ghundar, Shobah, Aamash has also reported it.",
                "hadithUrdu": "اسامہ بن زید رضی اللہ عنہما سے کسی نے کہا کہ اگر آپ فلاں صاحب ( عثمان رضی اللہ عنہ ) کے یہاں جا کر ان سے گفتگو کرو تو اچھا ہے ( تاکہ وہ یہ فساد دبانے کی تدبیر کریں ) انہوں نے کہا کیا تم لوگ یہ سمجھتے ہو کہ میں ان سے تم کو سنا کر ( تمہارے سامنے ہی ) بات کرتا ہوں ، میں تنہائی میں ان سے گفتگو کرتا ہوں اس طرح پر کہ فساد کا دروازہ نہیں کھولتا ، میں یہ بھی نہیں چاہتاکہ سب سے پہلے میں فساد کا دروازہ کھولوں اور میں آنحضرت صلی اللہ علیہ وسلم سے ایک حدیث سننے کے بعد یہ بھی نہیں کہتاکہ جو شخص میرے اوپر سردار ہو وہ سب لوگوں میں بہتر ہے ۔ لوگوں نے پوچھا کہ آپ نے آنحضرت صلی اللہ علیہ وسلم سے جو حدیث سنی ہے وہ کیا ہے ؟ حضرت اسامہ نے کہا آنحضرت صلی اللہ علیہ وسلم کو میں نے یہ فرماتے سنا تھا کہ قیامت کے دن ایک شخص کو لایا جائے گا اور جہنم میں ڈال دیا جائے گا ۔ آگ میں اس کی آنتیں باہر نکل آئیں گی اور وہ شخص اس طرح چکر لگانے لگے گا جیسے گدھا اپنی چکی پر گردش کیا کرتا ہے ۔ جہنم میں ڈالے جانے والے اس کے قریب آ کر جمع ہو جائیں گے اور اس سے کہیں گے ، اے فلاں ! آج یہ تمہاری کیا حالت ہے ؟ کیا تم ہمیں اچھے کام کرنے کے لیے نہیں کہتے تھے ، اور کیا تم برے کاموں سے ہمیں منع نہیں کیا کرتے تھے ؟ وہ شخص کہے گا جی ہاں ، میں تمہیں تو اچھے کاموں کا حکم دیتا تھا لیکن خود نہیں کرتا تھا ۔ برے کاموں سے تمہیں منع بھی کرتا تھا ، لیکن میں اسے خود کیا کرتا تھا ۔ اس حدیث کو غندر نے بھی شعبہ سے ، انہوں نے اعمش سے روایت کیا ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے اعمش نے ، ان سے ابووائل نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ،، قَالَ قِيلَ لأُسَامَةَ لَوْ أَتَيْتَ فُلاَنًا فَكَلَّمْتَهُ‏.‏ قَالَ إِنَّكُمْ لَتَرَوْنَ أَنِّي لاَ أُكَلِّمُهُ إِلاَّ أُسْمِعُكُمْ، إِنِّي أُكُلِّمُهُ فِي السِّرِّ دُونَ أَنْ أَفْتَحَ بَابًا لاَ أَكُونُ أَوَّلَ مَنْ فَتَحَهُ، وَلاَ أَقُولُ لِرَجُلٍ أَنْ كَانَ عَلَىَّ أَمِيرًا إِنَّهُ خَيْرُ النَّاسِ بَعْدَ شَىْءٍ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قَالُوا وَمَا سَمِعْتَهُ يَقُولُ قَالَ سَمِعْتُهُ يَقُولُ ‏ \"‏ يُجَاءُ بِالرَّجُلِ يَوْمَ الْقِيَامَةِ فَيُلْقَى فِي النَّارِ، فَتَنْدَلِقُ أَقْتَابُهُ فِي النَّارِ، فَيَدُورُ كَمَا يَدُورُ الْحِمَارُ بِرَحَاهُ، فَيَجْتَمِعُ أَهْلُ النَّارِ عَلَيْهِ، فَيَقُولُونَ أَىْ فُلاَنُ، مَا شَأْنُكَ أَلَيْسَ كُنْتَ تَأْمُرُنَا بِالْمَعْرُوفِ وَتَنْهَى عَنِ الْمُنْكَرِ قَالَ كُنْتُ آمُرُكُمْ بِالْمَعْرُوفِ وَلاَ آتِيهِ، وَأَنْهَاكُمْ عَنِ الْمُنْكَرِ وَآتِيهِ ‏\"‏‏.‏ رَوَاهُ غُنْدَرٌ عَنْ شُعْبَةَ عَنِ الأَعْمَشِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3123,
                "hadithNumber": "3268",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہما :",
                "hadithEnglish": "Magic was worked on the Prophet (ﷺ) so that he began to fancy that he was doing a thing which he was not actually doing. One day he invoked (Allah) for a long period and then said, \"I feel that Allah has inspired me as how to cure myself. Two persons came to me (in my dream) and sat, one by my head and the other by my feet. One of them asked the other, \"What is the ailment of this man?\" The other replied, 'He has been bewitched\" The first asked, 'Who has bewitched him?' The other replied, 'Lubaid bin Al-A'sam.' The first one asked, 'What material has he used?' The other replied, 'A comb, the hair gathered on it, and the outer skin of the pollen of the male date-palm.' The first asked, 'Where is that?' The other replied, 'It is in the well of Dharwan.' \" So, the Prophet (ﷺ) went out towards the well and then returned and said to me on his return, \"Its date-palms (the date-palms near the well) are like the heads of the devils.\" I asked, \"Did you take out those things with which the magic was worked?\" He said, \"No, for I have been cured by Allah and I am afraid that this action may spread evil amongst the people.\" Later on the well was filled up with earth.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم پر ( جب آپ صلی اللہ علیہ وسلم حدیبیہ سے لوٹے تھے ) جادو ہوا تھا ۔ اور لیث بن سعد نے بیان کیا کہ مجھے ہشام نے لکھا تھا ، انہوں نے اپنے والد سے سنا تھا اور یاد رکھا تھا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا تھا کہ نبی کریم صلی اللہ علیہ وسلم پر جادو کیا گیا تھا ۔ آپ کے ذہن میں بات ہوتی تھی کہ فلاں کام میں کر رہا ہوں حالانکہ آپ اسے نہ کر رہے ہوتے ۔ آخر ایک دن آپ نے دعا کی پھر دعا کی کہ اللہ پاک اس جادو کا اثر دفع کرے ۔ اس کے بعد آپ نے عائشہ رضی اللہ عنہا سے فرمایا کہ تمہیں معلوم بھی ہوا اللہ تعالیٰ نے مجھے وہ تدبیر بتا دی ہے جس میں میری شفاء مقدر ہے ۔ میرے پاس دو آدمی آئے ، ایک تو میرے سر کی طرف بیٹھ گئے اور دوسرا پاؤں کی طرف ۔ پھر ایک نے دوسرے سے کہا ، انہیں بیماری کیا ہے ؟ دوسرے آدمی نے جواب دیا کہ ان پر جادو ہوا ہے ۔ انہوں نے پوچھا ، جادو ان پر کس نے کیا ہے ؟ جواب دیا کہ لبید بن اعصم یہودی نے ، پوچھا کہ وہ جادو ( ٹونا ) رکھا کس چیز میں ہے ؟ کہا کہ کنگھے میں ، کتان میں اور کھجور کے خشک خوشے کے غلاف میں ۔ پوچھا ، اور یہ چیزیں ہیں کہاں ؟ کہا بئر دوران میں ۔ پھر نبی کریم صلی اللہ علیہ وسلم وہاں تشریف لے گئے اور واپس آئے تو حضرت عائشہ رضی اللہ عنہا سے فرمایا ، وہاں کے کھجور کے درخت ایسے ہیں جیسے شیطان کی کھوپڑی ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے پوچھا ، وہ ٹونا آپ نے نکلوایا بھی ؟ آپ نے فرمایا کہ نہیں مجھے تو اللہ تعالیٰ نے خود شفاء دی اور میں نے اسے اس خیال سے نہیں نکلوایا کہ کہیں اس کی وجہ سے لوگوں میں کوئی جھگڑا کھڑا کر دوں ۔ اس کے بعد وہ کنواں بند کر دیا گیا ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو عیسیٰ بن یونس نے خبر دی ، انہیں ہشام نے ، انہیں ان کے والد عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا عِيسَى، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سُحِرَ النَّبِيُّ صلى الله عليه وسلم‏.‏ وَقَالَ اللَّيْثُ كَتَبَ إِلَىَّ هِشَامٌ أَنَّهُ سَمِعَهُ وَوَعَاهُ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ سُحِرَ النَّبِيُّ صلى الله عليه وسلم حَتَّى كَانَ يُخَيَّلُ إِلَيْهِ أَنَّهُ يَفْعَلُ الشَّىْءَ وَمَا يَفْعَلُهُ، حَتَّى كَانَ ذَاتَ يَوْمٍ دَعَا وَدَعَا، ثُمَّ قَالَ ‏\"‏ أَشَعَرْتِ أَنَّ اللَّهَ أَفْتَانِي فِيمَا فِيهِ شِفَائِي أَتَانِي رَجُلاَنِ، فَقَعَدَ أَحَدُهُمَا عِنْدَ رَأْسِي وَالآخَرُ عِنْدَ رِجْلَىَّ، فَقَالَ أَحَدُهُمَا لِلآخَرِ مَا وَجَعُ الرَّجُلِ قَالَ مَطْبُوبٌ‏.‏ قَالَ وَمَنْ طَبَّهُ قَالَ لَبِيدُ بْنُ الأَعْصَمِ‏.‏ قَالَ فِي مَاذَا قَالَ فِي مُشُطٍ وَمُشَاقَةٍ وَجُفِّ طَلْعَةٍ ذَكَرٍ‏.‏ قَالَ فَأَيْنَ هُوَ قَالَ فِي بِئْرِ ذَرْوَانَ ‏\"‏‏.‏ فَخَرَجَ إِلَيْهَا النَّبِيُّ صلى الله عليه وسلم ثُمَّ رَجَعَ فَقَالَ لِعَائِشَةَ حِينَ رَجَعَ ‏\"‏ نَخْلُهَا كَأَنَّهَا رُءُوسُ الشَّيَاطِينِ ‏\"‏‏.‏ فَقُلْتُ اسْتَخْرَجْتَهُ فَقَالَ ‏\"‏ لاَ أَمَّا أَنَا فَقَدْ شَفَانِي اللَّهُ، وَخَشِيتُ أَنْ يُثِيرَ ذَلِكَ عَلَى النَّاسِ شَرًّا، ثُمَّ دُفِنَتِ الْبِئْرُ ‏\"‏‏.‏",
                "headingArabic": "صِفَةِ إِبْلِيسَ وَجُنُودِهِ",
                "headingUrdu": "ابلیس (شیطان) اور اس کے سپاہیوں کی خصوصیات",
                "headingEnglish": "The characteristics of Iblis (Satan) and his soldiers",
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3124,
                "hadithNumber": "3269",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"During your sleep, Satan knots three knots at the back of the head of each of you, and he breathes the following words at each knot, 'The night is, long, so keep on sleeping,' If that person wakes up and celebrates the praises of Allah, then one knot is undone, and when he performs ablution the second knot is undone, and when he prays, all the knots are undone, and he gets up in the morning lively and in good spirits, otherwise he gets up in low spirits and lethargic.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ جب کوئی تم میں سے سویا ہوا ہوتا ہے ، تو شیطان اس کے سر کی گدی پر تین گرہیں لگا دیتا ہے خوب اچھی طرح سے اور ہر گرہ پر یہ افسون پھونک دیتا ہے کہ ابھی بہت رات باقی ہے ۔ پڑا سوتا رہ ۔ لیکن اگر وہ شخص جاگ کر اللہ کا ذکر شروع کرتا ہے تو ایک گرہ کھل جاتی ہے ۔ پھر جب وضو کرتا ہے تو دوسری گرہ کھل جاتی ہے ۔ پھر جب نماز فجر پڑھتا ہے تو تیسری گرہ بھی کھل جاتی ہے اور صبح کو خوش مزاج خوش دل رہتا ہے ۔ ورنہ بدمزاج سست رہ کر وہ دن گزارتا ہے ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا مجھ سے میرے بھائی ( عبدالحمید ) نے بیان کیا ، انہوں نے کہا ہم سے سلیمان بن بلال نے ، ان سے یحییٰ بن سعید نے ، ان سے سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ يَعْقِدُ الشَّيْطَانُ عَلَى قَافِيَةِ رَأْسِ أَحَدِكُمْ إِذَا هُوَ نَامَ ثَلاَثَ عُقَدٍ، يَضْرِبُ كُلَّ عُقْدَةٍ مَكَانَهَا عَلَيْكَ لَيْلٌ طَوِيلٌ فَارْقُدْ‏.‏ فَإِنِ اسْتَيْقَظَ فَذَكَرَ اللَّهَ انْحَلَّتْ عُقْدَةٌ، فَإِنْ تَوَضَّأَ انْحَلَّتْ عُقْدَةٌ، فَإِنْ صَلَّى انْحَلَّتْ عُقَدُهُ كُلُّهَا، فَأَصْبَحَ نَشِيطًا طَيِّبَ النَّفْسِ، وَإِلاَّ أَصْبَحَ خَبِيثَ النَّفْسِ كَسْلاَنَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3125,
                "hadithNumber": "3270",
                "englishNarrator": "Narrated `Abdullah:",
                "hadithEnglish": "It was mentioned before the Prophet (ﷺ) that there was a man who slept the night till morning (after sunrise). The Prophet (ﷺ) said, \"He is a man in whose ears (or ear) Satan had urinated.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے سامنے ایک ایسے شخص کا ذکر آیا ، جو رات بھر دن چڑھے تک پڑا سوتا رہا ہو ، آپ نے فرمایا کہ یہ ایسا شخص ہے جس کے کان یا دونوں کانوں میں شیطان نے پیشاب کر دیا ہے ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے منصور نے ، ان سے ابووائل نے اور ان سے عبداللہ بن مسعودص نے بیان کیا کہ میں حاضر خدمت تھا تو",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ ذُكِرَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم رَجُلٌ نَامَ لَيْلَهُ حَتَّى أَصْبَحَ، قَالَ ‏ \"‏ ذَاكَ رَجُلٌ بَالَ الشَّيْطَانُ فِي أُذُنَيْهِ ـ أَوْ قَالَ ـ فِي أُذُنِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3126,
                "hadithNumber": "3271",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If anyone of you, when having sexual relation with his wife, say: 'In the name of Allah. O Allah! Protect us from Satan and prevent Satan from approaching our offspring you are going to give us,' and if he begets a child (as a result of that relation) Satan will not harm it.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب کوئی شخص اپنی بیوی کے پاس آتا ہے اور یہ دعا پڑتا ہے ” اللہ کے نام سے شروع کرتا ہوں ، اے اللہ ! ہم سے شیطان کو دور رکھ اور جو کچھ ہمیں تو دے ( اولاد ) اس سے بھی شیطان کو دور رکھ ۔ “ پھر اگر ان کے یہاں بچہ پیدا ہوتا ہے تو شیطان اسے کوئی نقصان نہیں پہنچا سکتا ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے منصور نے ان سے سالم بن ابی الجعد نے ، ان سے کریب نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَمَا إِنَّ أَحَدَكُمْ إِذَا أَتَى أَهْلَهُ وَقَالَ بِسْمِ اللَّهِ اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا‏.‏ فَرُزِقَا وَلَدًا، لَمْ يَضُرُّهُ الشَّيْطَانُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3127,
                "hadithNumber": "3272, 3273",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"When the (upper) edge of the sun appears (in the morning), don't perform a prayer till the sun appears in full, and when the lower edge of the sun sets, don't perform a prayer till it sets completely.\" And you should not seek to pray at sunrise or sunset for the sun rises between two sides of the head of the devil (or Satan). I don't know what out of these two statements Hisham has said.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جب سورج کا اوپر کا کنارہ نکل آئے تو نماز نہ پڑھو جب تک وہ پوری طرح ظاہر نہ ہو جائے اور جب غروب ہونے لگے تب بھی اس وقت تک کے لیے نماز چھوڑ دو جب تک بالکل غروب نہ ہو جائے ۔اور نماز سورج کے نکلنے اور ڈوبنے کے وقت نہ پڑھو ، کیونکہ سورج شیطان کے سر کے یا شیطانوں کے سر کے دونوں کونوں کے بیچ میں سے نکلتا ہے ۔ عبدہ نے کہا میں نہیں جانتا ہشام نے شیطان کا سر کہا یا شیطانوں کا ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، انہوں نے کہا ہم کو عبدہ نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے والد نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا طَلَعَ حَاجِبُ الشَّمْسِ فَدَعُوا الصَّلاَةَ حَتَّى تَبْرُزَ، وَإِذَا غَابَ حَاجِبُ الشَّمْسِ فَدَعُوا الصَّلاَةَ حَتَّى تَغِيبَ ‏\"‏‏.وَلاَ تَحَيَّنُوا بِصَلاَتِكُمْ طُلُوعَ الشَّمْسِ وَلاَ غُرُوبَهَا، فَإِنَّهَا تَطْلُعُ بَيْنَ قَرْنَىْ شَيْطَانٍ ‏\"‏‏.‏ أَوِ الشَّيْطَانِ‏.‏ لاَ أَدْرِي أَىَّ ذَلِكَ قَالَ هِشَامٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 3101,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=124",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=122",
                "label": "122",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=123",
                "label": "123",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=124",
                "label": "124",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=125",
                "label": "125",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=126",
                "label": "126",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=127",
                "label": "127",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=128",
                "label": "128",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=126",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=126",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=124",
        "to": 3125,
        "total": 40465
    }
}