{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 123,
        "data": [
            {
                "id": 3053,
                "hadithNumber": "3197",
                "englishNarrator": "Narrated Abu Bakra رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said. \"(The division of time has turned to its original form which was current when Allah created the Heavens and the Earths. The year is of twelve months, out of which four months are sacred: Three are in succession Dhul-Qa' da, Dhul-Hijja and Muharram, and (the fourth is) Rajab of (the tribe of) Mudar which comes between Jumadi-ath-Thaniyah and Sha ban.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، زمانہ گھوم پھر کر اسی حالت پر آ گیا جیسے اس دن تھا جس دن اللہ تعالیٰ نے آسمان اور زمین پیدا کی تھی ۔ سال بارہ مہینوں کا ہوتا ہے ، چار مہینے اس میں سے حرمت کے ہیں ۔ تین تو پے درپے ۔ ذی قعدہ ، ذی الحجہ اور محرم اور ( چوتھا ) رجب مضر جو جمادی الاخریٰ اور شعبان کے بیچ میں پڑتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہا ہم سے عبدالوہاب ثقفی نے بیان کیا ، انہوں نے کہا ہم سے ایوب سختیانی نے بیان کیا ، انہوں نے کہا کہ ہم سے محمد بن سیرین نے بیان کیا ، ان سے ابوبکرہ کے صاحبزادے ( عبدالرحمن ) نے بیان کیا اور ان سے ابوبکرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنِ ابْنِ أَبِي بَكْرَةَ، عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الزَّمَانُ قَدِ اسْتَدَارَ كَهَيْئَتِهِ يَوْمَ خَلَقَ السَّمَوَاتِ وَالأَرْضَ، السَّنَةُ اثْنَا عَشَرَ شَهْرًا، مِنْهَا أَرْبَعَةٌ حُرُمٌ، ثَلاَثَةٌ مُتَوَالِيَاتٌ ذُو الْقَعْدَةِ وَذُو الْحِجَّةِ وَالْمُحَرَّمُ، وَرَجَبُ مُضَرَ الَّذِي بَيْنَ جُمَادَى وَشَعْبَانَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3054,
                "hadithNumber": "3198",
                "englishNarrator": "Narrated Sa`id bin Zaid bin `Amr bin Nufail رضی اللہ عنہ :",
                "hadithEnglish": "That Arwa sued him before Marwan for a right, which she claimed, he had deprived her of. On that Sa`id said, \"How should I deprive her of her right? I testify that I heard Allah's Messenger (ﷺ) saying, 'If anyone takes a span of land unjustly, his neck will be encircled with it down seven earths on the Day of Resurrection.\" Ibn-e-Abi Zinad, Hisham, reports from his father that Hadrat Saeed bin Zaid said to him: (When Iheard this saying) I myself visited the prophet (ﷺ).",
                "hadithUrdu": "ارویٰ بنت ابی اوس سے ان کا ایک ( زمین کے ) بارے میں جھگڑا ہوا ۔ جس کے متعلق ارویٰ کہتی تھی کہ سعید نے میری زمین چھین لی ۔ یہ مقدمہ مروان خلیفہ کے یہاں فیصلہ کے لیے گیا جو مدینہ کا حاکم تھا ۔ سعید رضی اللہ عنہ نے کہا بھلا کیا میں ان کا حق دبالوں گا ، میں گواہی دیتا ہوں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا ہے کہ جس نے ایک بالشت زمین بھی ظلم سے کسی کی دبالی تو قیامت کے دن ساتوں زمینوں کا طوق اس کی گردن میں ڈالا جائے گا ۔ ابن ابی الزناد نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے بیان کیا ، اور ان سے سعید بن زید رضی اللہ عنہ نے بیان کیا کہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں موجود تھے ۔ ( تب آپ صلی اللہ علیہ وسلم نے یہ حدیث بیان فرمائی تھی ) ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے سعید بن زید بن عمرو بن نفیل رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، أَنَّهُ خَاصَمَتْهُ أَرْوَى فِي حَقٍّ زَعَمَتْ أَنَّهُ انْتَقَصَهُ لَهَا إِلَى مَرْوَانَ، فَقَالَ سَعِيدٌ أَنَا أَنْتَقِصُ مِنْ حَقِّهَا شَيْئًا، أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ أَخَذَ شِبْرًا مِنَ الأَرْضِ ظُلْمًا، فَإِنَّهُ يُطَوَّقُهُ يَوْمَ الْقِيَامَةِ مِنْ سَبْعِ أَرَضِينَ ‏\"‏‏.‏ قَالَ ابْنُ أَبِي الزِّنَادِ عَنْ هِشَامٍ عَنْ أَبِيهِ قَالَ قَالَ لِي سَعِيدُ بْنُ زَيْدٍ دَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3055,
                "hadithNumber": "3199",
                "englishNarrator": "Narrated Abu Dhar رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) asked me at sunset, \"Do you know where the sun goes (at the time of sunset)?\" I replied, \"Allah and His Apostle know better.\" He said, \"It goes (i.e. travels) till it prostrates Itself underneath the Throne and takes the permission to rise again, and it is permitted and then (a time will come when) it will be about to prostrate itself but its prostration will not be accepted, and it will ask permission to go on its course but it will not be permitted, but it will be ordered to return whence it has come and so it will rise in the west. And that is the interpretation of the Statement of Allah: \"And the sun Runs its fixed course For a term (decreed). that is The Decree of (Allah) The Exalted in Might, The All- Knowing.\" (36.38)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے جب سورج غروب ہوا تو ان سے پوچھا کہ تم کو معلوم ہے یہ سورج کہاں جاتا ہے ؟ میں نے عرض کی کہ اللہ اور اس کے رسول ہی کو علم ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ جاتا ہے اور عرش کے نیچے پہنچ کر پہلے سجدہ کرتا ہے ۔ پھر ( دوبارہ آنے ) کی اجازت چاہتا ہے اور اسے اجازت دی جاتی ہے اور وہ دن بھی قریب ہے ، جب یہ سجدہ کرے گا تو اس کا سجدہ قبول نہ ہو گا اور اجازت چاہے گا لیکن اجازت نہ ملے گی ۔ بلکہ اس سے کہا جائے گا کہ جہاں سے آیا تھا وہیں واپس چلا جا ۔ چنانچہ اس دن وہ مغربی ہی سے نکلے گا ۔ اللہ تعالیٰ کے فرمان »والشّمس تجری لمستقرٍّ لّہا ذٰلک تقدیر العزیز العلیم « ( یٰس ٓ : 38 ) میں اسی طرف اشارہ ہے ۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے اعمش نے ، ان سے ابراہیم تیمی نے ، ان سے ان کے باپ یزید بن شریک نے اور ان سے ابو ذرغفاری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لأَبِي ذَرٍّ حِينَ غَرَبَتِ الشَّمْسُ ‏\"‏ تَدْرِي أَيْنَ تَذْهَبُ ‏\"‏‏.‏ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ فَإِنَّهَا تَذْهَبُ حَتَّى تَسْجُدَ تَحْتَ الْعَرْشِ، فَتَسْتَأْذِنَ فَيُؤْذَنَ لَهَا، وَيُوشِكُ أَنْ تَسْجُدَ فَلاَ يُقْبَلَ مِنْهَا، وَتَسْتَأْذِنَ فَلاَ يُؤْذَنَ لَهَا، يُقَالُ لَهَا ارْجِعِي مِنْ حَيْثُ جِئْتِ‏.‏ فَتَطْلُعُ مِنْ مَغْرِبِهَا، فَذَلِكَ قَوْلُهُ تَعَالَى ‏{‏وَالشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَهَا ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ ‏}‏‏\"‏‏.‏",
                "headingArabic": "صِفَةِ الشَّمْسِ وَالْقَمَرِ",
                "headingUrdu": "سورج اور چاند کی خصوصیت",
                "headingEnglish": "Characteristic of the sun and the moon",
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3056,
                "hadithNumber": "3200",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The sun and the moon will be folded up (deprived of their light) on the Day of Resurrection.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، قیامت کے دن سورج اور چاند دونوں تاریک ( بینور ) ہو جائیں گے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، انہوں نے کہا ہم سے عبدالعزیز بن مختار نے بیان کیا ، انہوں نے کہا ہم سے عبداللہ بن فیروز داناج نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابوسلمہ بن عبدالرحمن نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، حَدَّثَنَا عَبْدُ اللَّهِ الدَّانَاجُ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الشَّمْسُ وَالْقَمَرُ مُكَوَّرَانِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3057,
                "hadithNumber": "3201",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The sun and the moon do not eclipse because of someone's death or life (i.e. birth), but they are two signs amongst the Signs of Allah. So, if you see them (i.e. eclipse) offer the (eclipse) prayer.",
                "hadithUrdu": "وہ نبی کریم صلی اللہ علیہ وسلم سے نقل کرتے تھے کہ آپ نے فرمایا کہ سورج اور چاند میں کسی کی موت و حیات کی وجہ سے گرہن نہیں لگتا ۔ بلکہ یہ اللہ تعالیٰ کی نشانیوں میں سےدو  نشانی ہیں ۔ اس لیے جب تم ان کو دیکھو تو نماز پڑھا کرو ۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھے عمرو بن حارث نے خبر دی ، ان سے عبدالرحمن بن قاسم نے بیان کیا ، ان سے ان کے باپ قاسم بن محمد بن ابی بکرنے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، حَدَّثَهُ عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ كَانَ يُخْبِرُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3058,
                "hadithNumber": "3202",
                "englishNarrator": "Narrated `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The sun and the moon are two signs amongst the Signs of Allah. They do not eclipse because of someone's death or life. So, if you see them (i.e. eclipse), celebrate the Praises of Allah (i.e. pray).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں کسی کی موت و حیات سے ان میں گرہن نہیں لگتا ۔ اس لیے جب تم گرہن دیکھو تو اللہ کی یاد میں لگ جایا کرو ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے زید بن اسلم نے ، ان سے عطاء بن یسار نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمْ ذَلِكَ فَاذْكُرُوا اللَّهَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3059,
                "hadithNumber": "3203",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "On the day of a solar eclipse, Allah's Messenger (ﷺ) stood up (to offer the eclipse prayer). He recited Takbir, recited a long recitation (of Holy Verses), bowed a long bowing, and then he raised h is head saying. \"Allah hears him who sends his praises to Him.\" Then he stayed standing, recited a long recitation again, but shorter than the former, bowed a long bowing, but shorter than the first, performed a long prostration and then performed the second rak`a in the same way as he had done the first. By the time he had finished his prayer with Taslim, the solar eclipse had been over. Then he addressed the people referring to the solar and lunar eclipses saying, \"These are two signs amongst the Signs of Allah, and they do not eclipse because of anyone's death or life. So, if you see them, hasten for the Prayer.\"",
                "hadithUrdu": "جس دن سورج گرہن لگا تو رسول اللہ صلی اللہ علیہ وسلم ( مصلے پر ) کھڑے ہوئے ۔ اللہ اکبر کہا اور بڑی دیر تک قرآت کرتے رہے ۔ پھر آپ صلی اللہ علیہ وسلم نے رکوع کیا ، ایک بہت لمبا رکوع ، پھر سر اٹھا کر سمع اللہ لمن حمدہ کہا اور پہلے کی طرح کھڑے ہو گئے ۔ اس قیام میں بھی لمبی قرآت کی ۔ اگرچہ پہلی قرآت سے کم تھی اور پھر رکوع میں چلے گئے اور دیر تک رکوع میں رہے ، اگرچہ پہلے رکوع سے یہ کم تھا ۔ اس کے بعد سجدہ کیا ، ایک لمبا سجدہ ، دوسری رکعت میں بھی آپ صلی اللہ علیہ وسلم نے اسی طرح کیا اور اس کے بعد سلام پھیرا تو سورج صاف ہو چکا تھا ۔ اب آپ صلی اللہ علیہ وسلم نے صحابہ کو خطاب فرمایا اور سورج اور چاند گرہن کے متعلق بتلایا کہ یہ اللہ تعالیٰ کی نشانیوں میں سے نشانی ہیں اور ان میں کسی کی موت و حیات کی وجہ سے گرہن نہیں لگتا ، اس لیے جب تم گرہن دیکھو تو فوراً نماز کی طرف لپک جاؤ ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے کیا ، انہوں نے کہا ہم سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا کہ مجھے عروہ نے خبر دی ، اور انہیں ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَوْمَ خَسَفَتِ الشَّمْسُ قَامَ فَكَبَّرَ وَقَرَأَ قِرَاءَةً طَوِيلَةً، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ ‏\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏\"‏ وَقَامَ كَمَا هُوَ، فَقَرَأَ قِرَاءَةً طَوِيلَةً وَهْىَ أَدْنَى مِنَ الْقِرَاءَةِ الأُولَى، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهْىَ أَدْنَى مِنَ الرَّكْعَةِ الأُولَى، ثُمَّ سَجَدَ سُجُودًا طَوِيلاً، ثُمَّ فَعَلَ فِي الرَّكْعَةِ الآخِرَةِ مِثْلَ ذَلِكَ، ثُمَّ سَلَّمَ وَقَدْ تَجَلَّتِ الشَّمْسُ، فَخَطَبَ النَّاسَ، فَقَالَ فِي كُسُوفِ الشَّمْسِ وَالْقَمَرِ ‏\"‏ إِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ، وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمُوهُمَا فَافْزَعُوا إِلَى الصَّلاَةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3060,
                "hadithNumber": "3204",
                "englishNarrator": "Narrated Abu Mas`ud رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"the sun and the moon do not eclipse because of the death or life of someone, but they are two signs amongst the Signs of Allah. So, if you see them, offer the Prayer (of eclipse).",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، سورج اور چاند میں کسی کی موت یا حیات پر گرہن نہیں لگتا ۔ بلکہ یہ اللہ کی نشانیوں میں سے نشانی ہیں اس لیے جب تم ان میں گرہن دیکھو تو نماز پڑھو ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے اسماعیل ابی خالد نے بیان کیا ، کہا کہ ہم سے قیس بن ابی حازم نے بیان کیا اور ان سے ابومسعود انصاری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي قَيْسٌ، عَنْ أَبِي مَسْعُودٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الشَّمْسُ وَالْقَمَرُ لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ، فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3061,
                "hadithNumber": "3205",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I have been made victorious with the Saba (i.e. easterly wind) and the people of 'Ad were destroyed with the Dabur (i.e. westerly wind) .\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ،بادصبا ( مشرقی ہوا ) کے ذریعہ میری مدد کی گئی اور قوم عاد دبور ( مغربی ہوا ) سے ہلاک کر دی گئی تھی ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حکم نے ، ان سے مجاہد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ نُصِرْتُ بِالصَّبَا، وَأُهْلِكَتْ عَادٌ بِالدَّبُورِ ‏\"‏‏.‏",
                "headingArabic": "مَا جَاءَ فِي قَوْلِهِ: {وَهْوَ الَّذِي أَرْسَلَ الرِّيَاحَ نُشُرًا بَيْنَ يَدَيْ رَحْمَتِهِ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور وہی ہے جو اپنی رحمت (بارش) سے پہلے ہواؤں کو خوشخبری دینے والی بنا کر بھیجتا ہے‘‘۔",
                "headingEnglish": "Allah's Statement: \"And it is He Who sends the winds as heralds of glad tidings, going before his Mercy (rain)...\"",
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3062,
                "hadithNumber": "3206",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "If the Prophet (ﷺ) saw a cloud In the sky, he would walk to and fro in agitation, go out and come in, and the color of his face would change, and if it rained, he would feel relaxed.\" So `Aisha رضی اللہ عنہا knew that state of his. So the Prophet (ﷺ) said, I don't know (am afraid), it may be similar to what happened to some people referred to in the Holy Qur'an in the following Verse: -- \"Then when they saw it as a dense cloud coming towards their valleys, they said, 'This is a cloud bringing us rain!' Nay, but, it is that (torment) which you were asking to be hastened a wind wherein is severe torment.\" (46.24)",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم ابر کا کوئی ایسا ٹکڑا دیکھتے جس سے بارش کی امید ہوتی تو آپ کبھی آگے آتے ، کبھی پیچھے جاتے ، کبھی گھر کے اندر تشریف لاتے ، کبھی باہر آ جاتے اور چہرہ مبارک کا رنگ بدل جاتا ۔ لیکن جب بارش ہونے لگتی تو پھر یہ کیفیت باقی نہ رہتی ۔ ایک مرتبہ حضرت عائشہ رضی اللہ عنہا نے اس کے متعلق آپ سے پوچھا ۔ تو آپ نے فرمایا ۔ میں نہیں جانتا ممکن ہے یہ بادل بھی ویسا ہی ہو جس کے بارے میں قوم عاد نے کہا تھا ، جب انہوں نے بادل کو اپنی وادیوں کی طرف آتے دیکھا تھا ۔ آخر آیت تک ( کہ ان کے لیے رحمت کا بادل آیا ہے ، حالانکہ وہ عذاب کا بادل تھا ) ۔",
                "urduNarrator": "ہم سے مکی بن ابراہیم نے بیان کیا ، کہا ہم سے ابن جریج نے ، ان سے عطاء نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا رَأَى مَخِيلَةً فِي السَّمَاءِ أَقْبَلَ وَأَدْبَرَ وَدَخَلَ وَخَرَجَ وَتَغَيَّرَ وَجْهُهُ، فَإِذَا أَمْطَرَتِ السَّمَاءُ سُرِّيَ عَنْهُ، فَعَرَّفَتْهُ عَائِشَةُ ذَلِكَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا أَدْرِي لَعَلَّهُ كَمَا قَالَ قَوْمٌ ‏{‏فَلَمَّا رَأَوْهُ عَارِضًا مُسْتَقْبِلَ أَوْدِيَتِهِمْ‏}‏ ‏\"‏‏.‏ الآيَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3063,
                "hadithNumber": "3207",
                "englishNarrator": "Narrated Malik bin Sasaa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"While I was at the House in a state midway between sleep and wakefulness, (an angel recognized me) as the man lying between two men. A golden tray full of wisdom and belief was brought to me and my body was cut open from the throat to the lower part of the `Abdomen and then my `Abdomen was washed with Zamzam water and (my heart was) filled with wisdom and belief. Al- Buraq, a white animal, smaller than a mule and bigger than a donkey was brought to me and I set out with Gabriel. When I reached the nearest heaven. Gabriel said to the heaven gate-keeper, 'Open the gate.' The gatekeeper asked, 'Who is it?' He said, 'Gabriel.' The gate-keeper,' Who is accompanying you?' Gabriel said, 'Muhammad.' The gate-keeper said, 'Has he been called?' Gabriel said, 'Yes.' Then it was said, 'He is welcomed. What a wonderful visit his is!' Then I met Adam and greeted him and he said, 'You are welcomed O son and a Prophet.' Then we ascended to the second heaven. It was asked, 'Who is it?' Gabriel said, 'Gabriel.' It was said, 'Who is with you?' He said, 'Muhammad' It was asked, 'Has he been sent for?' He said, 'Yes.' It was said, 'He is welcomed. What a wonderful visit his is!\" Then I met Jesus and Yahya (John) who said, 'You are welcomed, O brother and a Prophet.' Then we ascended to the third heaven. It was asked, 'Who is it?' Gabriel said, 'Gabriel.' It was asked, 'Who is with you? Gabriel said, 'Muhammad.' It was asked, 'Has he been sent for?' 'Yes,' said Gabriel. 'He is welcomed. What a wonderful visit his is!' (The Prophet (ﷺ) added:). There I met Joseph and greeted him, and he replied, 'You are welcomed, O brother and a Prophet!' Then we ascended to the 4th heaven and again the same questions and answers were exchanged as in the previous heavens. There I met Idris and greeted him. He said, 'You are welcomed O brother and Prophet.' Then we ascended to the 5th heaven and again the same questions and answers were exchanged as in previous heavens. there I met and greeted Aaron who said, 'You are welcomed O brother and a Prophet\". Then we ascended to the 6th heaven and again the same questions and answers were exchanged as in the previous heavens. There I met and greeted Moses who said, 'You are welcomed O brother and. a Prophet.' When I proceeded on, he started weeping and on being asked why he was weeping, he said, 'O Lord! Followers of this youth who was sent after me will enter Paradise in greater number than my followers.' Then we ascended to the seventh heaven and again the same questions and answers were exchanged as in the previous heavens. There I met and greeted Abraham who said, 'You are welcomed o son and a Prophet.' Then I was shown Al-Bait-al-Ma'mur (i.e. Allah's House). I asked Gabriel about it and he said, This is Al Bait-ul-Ma'mur where 70,000 angels perform prayers daily and when they leave they never return to it (but always a fresh batch comes into it daily).' Then I was shown Sidrat-ul-Muntaha (i.e. a tree in the seventh heaven) and I saw its Nabk fruits which resembled the clay jugs of Hajr (i.e. a town in Arabia), and its leaves were like the ears of elephants, and four rivers originated at its root, two of them were apparent and two were hidden. I asked Gabriel about those rivers and he said, 'The two hidden rivers are in Paradise, and the apparent ones are the Nile and the Euphrates.' Then fifty prayers were enjoined on me. I descended till I met Moses who asked me, 'What have you done?' I said, 'Fifty prayers have been enjoined on me.' He said, 'I know the people better than you, because I had the hardest experience to bring Bani Israel to obedience. Your followers cannot put up with such obligation. So, return to your Lord and request Him (to reduce the number of prayers.' I returned and requested Allah (for reduction) and He made it forty. I returned and (met Moses) and had a similar discussion, and then returned again to Allah for reduction and He made it thirty, then twenty, then ten, and then I came to Moses who repeated the same advice. Ultimately Allah reduced it to five. When I came to Moses again, he said, 'What have you done?' I said, 'Allah has made it five only.' He repeated the same advice but I said that I surrendered (to Allah's Final Order)'\" Allah's Messenger (ﷺ) was addressed by Allah, \"I have decreed My Obligation and have reduced the burden on My slaves, and I shall reward a single good deed as if it were ten good deeds.\" What Hammam, Qatadah, Hasan, Abu Hurairah report from the prophet, it contains the phrase \"بیت المعمور\" .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ میں ایک دفعہ بیت اللہ کے قریب نیند اور بیداری کی درمیانی حالت میں تھا ، پھر آنحضرت صلی اللہ علیہ وسلم نے دو آدمیوں کے درمیان لیٹے ہوئے ایک تیسرے آدمی کا ذکر فرمایا ۔ اس کے بعد میرے پاس سونے کا ایک طشت لایا گیا ، جو حکمت اور ایمان سے بھرپور تھا ۔ میرے سینے کو پیٹ کے آخری حصے تک چاک کیا گیا ۔ پھر میرا پیٹ زمزم کے پانی سے دھویا گیا اور اسے حکمت اور ایمان سے بھر دیا گیا ۔ اس کے بعد میرے پاس ایک سواری لائی گئی ۔ سفید ، خچر سے چھوٹی اور گدھے سے بڑی یعنی براق ، میں اس پر سوار ہو کر جبرائیل علیہ السلام کے ساتھ چلا ۔ جب ہم آسمان دنیا پر پہنچے تو پوچھا گیا کہ یہ کون صاحب ہیں ؟ انہوں نے کہا کہ جبرائیل ۔ پوچھا گیا کہ آپ کے ساتھ اور کون صاحب آئے ہیں ؟ انہوں نے بتایا کہ محمد ( صلی اللہ علیہ وسلم ) پوچھا گیا کہ کیا انہیں بلانے کے لیے آپ کو بھیجا گیا تھا ؟ انہوں نے کہا کہ ہاں ، اس پر جواب آیا کہ اچھی کشادہ جگہ آنے والے کیا ہی مبارک ہیں ، پھر میں آدم علیہ السلام کی خدمت میں حاضر ہوا ۔ اور انہیں سلام کیا ۔ انہوں نے فرمایا ، آو پیارے بیٹے اور اچھے نبی ۔ اس کے بعد ہم دوسرے آسمان پر پہنچے یہاں بھی وہی سوال ہوا ۔ کون صاحب ہیں ؟ کہا جبرائیل ، سوال ہوا ، آپ کے ساتھ کوئی اور صاحب بھی آئے ہیں ؟ کہا کہ محمد صلی اللہ علیہ وسلم ، سوال ہوا انہیں بلانے کے لیے آپ کو بھیجا گیا تھا ؟ کہا کہ ہاں ۔ اب ادھر سے جواب آیا ، اچھی کشادہ جگہ آئے ہیں ، آنے والے کیا ہی مبارک ہیں ۔ اس کے بعد میں عیسیٰ اور یحییٰ علیہ السلام سے ملا ، ان حضرات نے بھی خوش آمدید ، مرحبا کہا اپنے بھائی اور نبی کو ۔ پھر ہم تیسرے آسمان پر آئے یہاں بھی سوال ہوا کون صاحب ہیں ؟ جواب ملا جبرائیل ، سوال ہوا ، آپ کے ساتھ بھی کوئی ہے ؟ کہا کہ محمد صلی اللہ علیہ وسلم ، سوال ہوا ، انہیں بلانے کے لیے آپ کو بھیجا گیا تھا ؟ انہوں نے بتایا کہ ہاں ، اب آواز آئی اچھی کشادہ جگہ آئے آنے والے کیا ہی صالح ہیں ، یہاں یوسف علیہ السلام سے میں ملا اور انہیں سلام کیا ، انہوں نے فرمایا ، اچھی کشادہ جگہ آئے ہو میرے بھائی اور نبی ، یہاں سے ہم چوتھے آسمان پر آئے اس پر بھی یہی سوال ہوا ، کون صاحب ، جواب دیا کہ جبرائیل ، سوال ہوا ، آپ کے ساتھ اور کون صاحب ہیں ؟ کہا کہ محمد صلی اللہ علیہ وسلم ہیں ۔ پوچھا کیا انہیں لانے کے لیے آپ کو بھیجا گیا تھا ، جواب دیا کہ ہاں ، پھر آواز آئی ، اچھی کشادہ جگہ آئے کیا ہی اچھے آنے والے ہیں ۔ یہاں میں ادریس علیہ السلام سے ملا اور سلام کیا ، انہوں نے فرمایا ، مرحبا ، بھائی اور نبی ۔ یہاں سے ہم پانچویں آسمان پر آئے ۔ یہاں بھی سوال ہوا کہ کون صاحب ؟ جواب دیا کہ جبرائیل ، پوچھا گیا اور آپ کے ساتھ اور کون صاحب آئے ہیں ؟ جواب دیا کہ محمد صلی اللہ علیہ وسلم ، پوچھا گیا ، انہیں بلانے کے لیے بھیجا گیا تھا ؟ کہا کہ ہاں ، آواز آئی ، اچھی کشادہ جگہ آئے ہیں ۔ آنے والے کیا ہی اچھے ہیں ۔ یہاں ہم ہارون علیہ السلام سے ملے اور میں نے انہیں سلام کیا ۔ انہوں نے فرمایا ، مبارک میرے بھائی اور نبی ، تم اچھی کشادہ جگہ آئے ، یہاں سے ہم چھٹے آسمان پر آئے ، یہاں بھی سوال ہوا ، کون صاحب ؟ جواب دیا کہ جبرائیل ، پوچھا گیا ، آپ کے ساتھ اور بھی کوئی ہیں ؟ کہا کہ ہاں محمد صلی اللہ علیہ وسلم ہیں ۔ پوچھا گیا ، کیا انہیں بلایاگیا تھا کہا ہاں ، کہا اچھی کشادہ جگہ آئے ہیں ، اچھے آنے والے ہیں ۔ یہاں میں موسیٰ علیہ السلام سے ملا اور انہیں سلام کیا ۔ انہوں نے فرمایا ، میرے بھائی اور نبی اچھی کشادہ جگہ آئے ، جب میں وہاں سے آگے بڑھنے لگا تو وہ رونے لگے کسی نے پوچھا بزرگوار آپ کیوں رو رہے ہیں ؟ انہوں نے فرمایا کہ اے اللہ ! یہ نوجوان جسے میرے بعد نبوت دی گئی ، اس کی امت میں سے جنت میں داخل ہونے والے ، میری امت کے جنت میں داخل ہونے والے لوگوں سے زیادہ ہوں گے ۔ اس کے بعد ہم ساتویں آسمان پر آئے یہاں بھی سوال ہوا کہ کون صاحب ہیں ؟ جواب دیا کہ جبرائیل ، سوال ہوا کہ کوئی صاحب آپ کے ساتھ بھی ہیں ؟ جواب دیا کہ محمد صلی اللہ علیہ وسلم پوچھا ، انہیں بلانے کے لیے آپ کو بھیجا گیا تھا ؟ مرحبا ، اچھے آنے والے ۔ یہاں میں ابراہیم علیہ السلام سے ملا اور انہیں سلام کیا ۔ انہوں نے فرمایا میرے بیٹے اور نبی ، مبارک ، اچھی کشادہ جگہ آئے ہو ، اس کے بعد مجھے بیت المعمور دکھایا گیا ۔ میں نے جبرائیل علیہ السلام سے اس کے بارے میں پوچھا ، تو انہوں نے بتلایا کہ یہ بیت المعمور ہے ۔ اس میں ستر ہزار فرشتے روزانہ نماز پڑھتے ہیں ۔ اور ایک مرتبہ پڑھ کر جو اس سے نکل جاتا ہے تو پھر کبھی داخل نہیں ہوتا ۔ اور مجھے سدرۃالمنتہیٰ بھی دکھایا گیا ، اس کے پھل ایسے تھے جیسے مقام ہجر کے مٹکے ہوتے ہیں اور پتے ایسے تھے جیسے ہاتھی کے کان ، اس کی جڑ سے چار نہریں نکلتی تھیں ، دو نہریں تو باطنی تھیں اور دو ظاہری ، میں نے جبرائیل علیہ السلام سے پوچھا تو انہوں نے بتایا کہ جو دو باطنی نہریں ہیں وہ تو جنت میں ہیں اور دو ظاہری نہریں دنیا میں نیل اور فرات ہیں ، اس کے بعد مجھ پر پچاس وقت کی نمازیں فرض کی گئیں ۔ میں جب واپس ہوا اور موسیٰ علیہ السلام سے ملا تو انہوں نے پوچھا کہ کیا کر کے آئے ہو ؟ میں نے عرض کیا کہ پچاس نمازیں مجھ پر فرض کی گئی ہیں ۔ انہوں نے فرمایا کہ انسانوں کو میں تم سے زیادہ جانتا ہوں ، بنی اسرائیل کا مجھے برا تجربہ ہو چکا ہے ۔ تمہاری امت بھی اتنی نمازوں کی طاقت نہیں رکھتی ، اس لیے اپنے رب کی بارگاہ میں دوبارہ حاضری دو ، اور کچھ تخفیف کی درخواست کرو ، میں واپس ہوا تو اللہ تعالیٰ نے نمازیں چالیس وقت کی کر دیں ۔ پھر بھی موسیٰ علیہ السلام اپنی بات ( یعنی تخفیف کرانے ) پر مصر رہے ۔ اس مرتبہ تیس وقت کی رہ گئیں ۔ پھر انہوں نے وہی فرمایا اور اس مرتبہ بارگاہ رب العزت میں میری درخواست کی پیشی پر اللہ تعالیٰ نے انہیں دس کر دیا ۔ میں جب موسیٰ علیہ السلام کے پاس آیا تو اب بھی انہوں نے کم کرانے کے لیے اپنا اصرار جاری رکھا ۔ اور اس مرتبہ اللہ تعالیٰ نے پانچ وقت کی کر دیں ۔ اب موسیٰ علیہ السلام سے ملا ، تو انہوں نے پھر دریافت فرمایا کہ کیا ہوا ؟ میں نے کہا کہ اللہ تعالیٰ نے پانچ کر دی ہیں ۔ اس مرتبہ بھی انہوں نے کم کرانے کا اصرار کیا ۔ میں نے کہا کہ اب تو میں اللہ کے سپرد کر چکا ۔ پھر آواز آئی ۔ میں نے اپنا فریضہ ( پانچ نمازوں کا ) جاری کر دیا ۔ اپنے بندوں پر تخفیف کر چکا اور میں ایک نیکی کا بدلہ دس گنا دیتا ہوں ۔ اور ہمام نے کہا ، ان سے قتادہ نے کہا ، ان سے حسن نے ، ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے بیت المعمور کے بارے میں الگ روایت کی ہے ۔",
                "urduNarrator": "ہم سے ہدبۃ بن خالد نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے سعید بن ابی عروبہ اور ہشام دستوائی نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، کہا ہم سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا اور ان سے مالک بن صعصعہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ،‏.‏ وَقَالَ لِي خَلِيفَةُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، وَهِشَامٌ، قَالاَ حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنْ مَالِكِ بْنِ صَعْصَعَةَ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بَيْنَا أَنَا عِنْدَ الْبَيْتِ بَيْنَ النَّائِمِ وَالْيَقْظَانِ ـ وَذَكَرَ بَيْنَ الرَّجُلَيْنِ ـ فَأُتِيتُ بِطَسْتٍ مِنْ ذَهَبٍ مُلِئَ حِكْمَةً وَإِيمَانًا، فَشُقَّ مِنَ النَّحْرِ إِلَى مَرَاقِّ الْبَطْنِ، ثُمَّ غُسِلَ الْبَطْنُ بِمَاءِ زَمْزَمَ، ثُمَّ مُلِئَ حِكْمَةً وَإِيمَانًا، وَأُتِيتُ بِدَابَّةٍ أَبْيَضَ دُونَ الْبَغْلِ وَفَوْقَ الْحِمَارِ الْبُرَاقُ، فَانْطَلَقْتُ مَعَ جِبْرِيلَ حَتَّى أَتَيْنَا السَّمَاءَ الدُّنْيَا قِيلَ مَنْ هَذَا قَالَ جِبْرِيلُ‏.‏ قِيلَ مَنْ مَعَكَ قِيلَ مُحَمَّدٌ‏.‏ قِيلَ وَقَدْ أُرْسِلَ إِلَيْهِ قَالَ نَعَمْ‏.‏ قِيلَ مَرْحَبًا بِهِ، وَلَنِعْمَ الْمَجِيءُ جَاءَ‏.‏ فَأَتَيْتُ عَلَى آدَمَ، فَسَلَّمْتُ عَلَيْهِ، فَقَالَ مَرْحَبًا بِكَ مِنِ ابْنٍ وَنَبِيٍّ‏.‏ فَأَتَيْنَا السَّمَاءَ الثَّانِيَةَ، قِيلَ مَنْ هَذَا قَالَ جِبْرِيلُ‏.‏ قِيلَ مَنْ مَعَكَ قَالَ مُحَمَّدٌ صلى الله عليه وسلم‏.‏ قِيلَ أُرْسِلَ إِلَيْهِ قَالَ نَعَمْ‏.‏ قِيلَ مَرْحَبًا بِهِ، وَلَنِعْمَ الْمَجِيءُ جَاءَ‏.‏ فَأَتَيْتُ عَلَى عِيسَى وَيَحْيَى فَقَالاَ مَرْحَبًا بِكَ مِنْ أَخٍ وَنَبِيٍّ‏.‏ فَأَتَيْنَا السَّمَاءَ الثَّالِثَةَ، قِيلَ مَنْ هَذَا قِيلَ جِبْرِيلُ‏.‏ قِيلَ مَنْ مَعَكَ قِيلَ مُحَمَّدٌ‏.‏ قِيلَ وَقَدْ أُرْسِلَ إِلَيْهِ قَالَ نَعَمْ‏.‏ قِيلَ مَرْحَبًا بِهِ وَلَنِعْمَ الْمَجِيءُ جَاءَ‏.‏ فَأَتَيْتُ يُوسُفَ فَسَلَّمْتُ عَلَيْهِ، قَالَ مَرْحَبًا بِكَ مِنْ أَخٍ وَنَبِيٍّ فَأَتَيْنَا السَّمَاءَ الرَّابِعَةَ، قِيلَ مَنْ هَذَا قِيلَ جِبْرِيلُ‏.‏ قِيلَ مَنْ مَعَكَ قِيلَ مُحَمَّدٌ صلى الله عليه وسلم‏.‏ قِيلَ وَقَدْ أُرْسِلَ إِلَيْهِ قِيلَ نَعَمْ‏.‏ قِيلَ مَرْحَبًا بِهِ، وَلَنِعْمَ الْمَجِيءُ جَاءَ‏.‏ فَأَتَيْتُ عَلَى إِدْرِيسَ فَسَلَّمْتُ عَلَيْهِ، فَقَالَ مَرْحَبًا مِنْ أَخٍ وَنَبِيٍّ‏.‏ فَأَتَيْنَا السَّمَاءَ الْخَامِسَةَ، قِيلَ مَنْ هَذَا قَالَ جِبْرِيلُ‏.‏ قِيلَ وَمَنْ مَعَكَ قِيلَ مُحَمَّدٌ‏.‏ قِيلَ وَقَدْ أُرْسِلَ إِلَيْهِ قَالَ نَعَمْ‏.‏ قِيلَ مَرْحَبًا بِهِ، وَلَنِعْمَ الْمَجِيءُ جَاءَ‏.‏ فَأَتَيْنَا عَلَى هَارُونَ، فَسَلَّمْتُ عَلَيْهِ فَقَالَ مَرْحَبًا بِكَ مِنْ أَخٍ وَنَبِيٍّ‏.‏ فَأَتَيْنَا عَلَى السَّمَاءِ السَّادِسَةِ، قِيلَ مَنْ هَذَا قِيلَ جِبْرِيلُ‏.‏ قِيلَ مَنْ مَعَكَ قَالَ مُحَمَّدٌ صلى الله عليه وسلم‏.‏ قِيلَ وَقَدْ أُرْسِلَ إِلَيْهِ مَرْحَبًا بِهِ، وَلَنِعْمَ الْمَجِيءُ جَاءَ‏.‏ فَأَتَيْتُ عَلَى مُوسَى، فَسَلَّمْتُ ‏{‏عَلَيْهِ‏}‏ فَقَالَ مَرْحَبًا بِكَ مِنْ أَخٍ وَنَبِيٍّ‏.‏ فَلَمَّا جَاوَزْتُ بَكَى‏.‏ فَقِيلَ مَا أَبْكَاكَ قَالَ يَا رَبِّ، هَذَا الْغُلاَمُ الَّذِي بُعِثَ بَعْدِي يَدْخُلُ الْجَنَّةَ مِنْ أُمَّتِهِ أَفْضَلُ مِمَّا يَدْخُلُ مِنْ أُمَّتِي‏.‏ فَأَتَيْنَا السَّمَاءَ السَّابِعَةَ، قِيلَ مَنْ هَذَا قِيلَ جِبْرِيلُ‏.‏ قِيلَ مَنْ مَعَكَ قِيلَ مُحَمَّدٌ‏.‏ قِيلَ وَقَدْ أُرْسِلَ إِلَيْهِ مَرْحَبًا بِهِ، وَنِعْمَ الْمَجِيءُ جَاءَ‏.‏ فَأَتَيْتُ عَلَى إِبْرَاهِيمَ، فَسَلَّمْتُ عَلَيْهِ فَقَالَ مَرْحَبًا بِكَ مِنِ ابْنٍ وَنَبِيٍّ، فَرُفِعَ لِيَ الْبَيْتُ الْمَعْمُورُ، فَسَأَلْتُ جِبْرِيلَ فَقَالَ هَذَا الْبَيْتُ الْمَعْمُورُ يُصَلِّي فِيهِ كُلَّ يَوْمٍ سَبْعُونَ أَلْفَ مَلَكٍ، إِذَا خَرَجُوا لَمْ يَعُودُوا إِلَيْهِ آخِرَ مَا عَلَيْهِمْ، وَرُفِعَتْ لِي سِدْرَةُ الْمُنْتَهَى فَإِذَا نَبِقُهَا كَأَنَّهُ قِلاَلُ هَجَرٍ، وَوَرَقُهَا كَأَنَّهُ آذَانُ الْفُيُولِ، فِي أَصْلِهَا أَرْبَعَةُ أَنْهَارٍ نَهْرَانِ بَاطِنَانِ وَنَهْرَانِ ظَاهِرَانِ، فَسَأَلْتُ جِبْرِيلَ فَقَالَ أَمَّا الْبَاطِنَانِ فَفِي الْجَنَّةِ، وَأَمَّا الظَّاهِرَانِ النِّيلُ وَالْفُرَاتُ، ثُمَّ فُرِضَتْ عَلَىَّ خَمْسُونَ صَلاَةً، فَأَقْبَلْتُ حَتَّى جِئْتُ مُوسَى، فَقَالَ مَا صَنَعْتَ قُلْتُ فُرِضَتْ عَلَىَّ خَمْسُونَ صَلاَةً‏.‏ قَالَ أَنَا أَعْلَمُ بِالنَّاسِ مِنْكَ، عَالَجْتُ بَنِي إِسْرَائِيلَ أَشَدَّ الْمُعَالَجَةِ، وَإِنَّ أُمَّتَكَ لاَ تُطِيقُ، فَارْجِعْ إِلَى رَبِّكَ فَسَلْهُ‏.‏ فَرَجَعْتُ فَسَأَلْتُهُ، فَجَعَلَهَا أَرْبَعِينَ، ثُمَّ مِثْلَهُ ثُمَّ ثَلاَثِينَ، ثُمَّ مِثْلَهُ فَجَعَلَ عِشْرِينَ، ثُمَّ مِثْلَهُ فَجَعَلَ عَشْرًا، فَأَتَيْتُ مُوسَى فَقَالَ مِثْلَهُ، فَجَعَلَهَا خَمْسًا، فَأَتَيْتُ مُوسَى فَقَالَ مَا صَنَعْتَ قُلْتُ جَعَلَهَا خَمْسًا، فَقَالَ مِثْلَهُ، قُلْتُ سَلَّمْتُ بِخَيْرٍ، فَنُودِيَ إِنِّي قَدْ أَمْضَيْتُ فَرِيضَتِي وَخَفَّفْتُ عَنْ عِبَادِي، وَأَجْزِي الْحَسَنَةَ عَشْرًا ‏\"‏‏.‏ وَقَالَ هَمَّامٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ فِي الْبَيْتِ الْمَعْمُورِ ‏\"‏‏.‏",
                "headingArabic": "ذِكْرِ الْمَلاَئِكَةِ",
                "headingUrdu": "فرشتوں کا حوالہ",
                "headingEnglish": "The reference to angels",
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3064,
                "hadithNumber": "3208",
                "englishNarrator": "Narrated `Abdullah bin Mus'ud رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ), the true and truly inspired said, \"(The matter of the Creation of) a human being is put together in the womb of the mother in forty days, and then he becomes a clot of thick blood for a similar period, and then a piece of flesh for a similar period. Then Allah sends an angel who is ordered to write four things. He is ordered to write down his (i.e. the new creature's) deeds, his livelihood, his (date of) death, and whether he will be blessed or wretched (in religion). Then the soul is breathed into him. So, a man amongst you may do (good deeds till there is only a cubit between him and Paradise and then what has been written for him decides his behavior and he starts doing (evil) deeds characteristic of the people of the (Hell) Fire. And similarly a man amongst you may do (evil) deeds till there is only a cubit between him and the (Hell) Fire, and then what has been written for him decides his behavior, and he starts doing deeds characteristic of the people of Paradise.\"",
                "hadithUrdu": "ہم سے صادق المصدوق رسول اللہ صلی اللہ علیہ وسلم نے بیان فرمایا اور فرمایا کہ تمہاری پیدائش کی تیاری تمہاری ماں کے پیٹ میں چالیس دنوں تک ( نطفہ کی صورت ) میں کی جاتی ہے اتنی ہی دنوں تک پھر ایک بستہ خون کے صورت میں اختیار کئے رہتا ہے اور پھر وہ اتنے ہی دنوں تک ایک مضغہ گوشت رہتا ہے ۔ اس کے بعد اللہ تعالیٰ ایک فرشتہ بھیجتا ہے اور اسے چار باتوں ( کے لکھنے ) کا حکم دیتا ہے ۔ اس سے کہا جاتا ہے کہ اس کے عمل ، اس کا رزق ، اس کی مدت زندگی اور یہ کہ بد ہے یا نیک ، لکھ لے ۔ اب اس نطفہ میں روح ڈالی جاتی ہے ( یاد رکھ ) ایک شخص ( زندگی بھر نیک ) عمل کرتا رہتا ہے اور جب جنت اور اس کے درمیان صرف ایک ہاتھ کا فاصلہ رہ جاتا ہے تو اس کی تقدیر سامنے آ جاتی ہے اور دوزخ والوں کے عمل شروع کر دیتا ہے ۔ اسی طرح ایک شخص ( زندگی بھر برے ) کام کرتا رہتا ہے اور جب دوزخ اور اس کے درمیان صرف ایک ہاتھ کا فاصلہ رہ جاتا ہے تو اس کی تقدیر غالب آ جاتی ہے اور جنت والوں کے کام شروع کر دیتا ہے ۔",
                "urduNarrator": "ہم سے حسن بن ربیع نے بیان کیا ، کہا ہم سے ابوالاحوص نے ، ان سے اعمش نے ، ان سے زید بن وہب نے اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنِ الأَعْمَشِ، عَنْ زَيْدِ بْنِ وَهْبٍ، قَالَ عَبْدُ اللَّهِ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ الصَّادِقُ الْمَصْدُوقُ قَالَ ‏ \"‏ إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا، ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يَبْعَثُ اللَّهُ مَلَكًا، فَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ، وَيُقَالُ لَهُ اكْتُبْ عَمَلَهُ وَرِزْقَهُ وَأَجَلَهُ وَشَقِيٌّ أَوْ سَعِيدٌ‏.‏ ثُمَّ يُنْفَخُ فِيهِ الرُّوحُ، فَإِنَّ الرَّجُلَ مِنْكُمْ لَيَعْمَلُ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَ الْجَنَّةِ إِلاَّ ذِرَاعٌ، فَيَسْبِقُ عَلَيْهِ كِتَابُهُ، فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ، وَيَعْمَلُ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَ النَّارِ إِلاَّ ذِرَاعٌ، فَيَسْبِقُ عَلَيْهِ الْكِتَابُ، فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3065,
                "hadithNumber": "3209",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If Allah loves a person, He calls Gabriel saying, 'Allah loves so and-so; O Gabriel! Love him.' Gabriel would love him and make an announcement amongst the inhabitants of the Heaven. 'Allah loves so-and-so, therefore you should love him also,' and so all the inhabitants of the Heaven would love him, and then he is granted the pleasure of the people on the earth.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب اللہ تعالیٰ کسی بندے سے محبت کرتا ہے تو جبرائیل علیہ السلام سے فرماتا ہے کہ اللہ تعالیٰ فلاں شخص سے محبت کرتا ہے ۔ تم بھی اس سے محبت رکھو ، چنانچہ جبرائیل علیہ السلام بھی اس سے محبت رکھنے لگتے ہیں ۔ پھر جبرائیل علیہ السلام تمام اہل آسمان کو پکار دیتے ہیں کہ اللہ تعالیٰ فلاں شخص سے محبت رکھتا ہے ۔ اس لیے تم سب لوگ اس سے محبت رکھو ، چنانچہ تمام آسمان والے اس سے محبت رکھنے لگتے ہیں ۔ اس کے بعد روئے زمین والے بھی اس کو مقبول سمجھتے ہیں ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو مخلد نے خبر دی ، انہیں ابن جریج نے خبر دی ، کہا کہ مجھے موسیٰ بن عقبہ نے خبر دی ، انہیں نافع نے ، انہوں نے بیان کیا کہ ابوہریرہ رضی اللہ عنہ نے کہا  نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ اور اس روایت کی متابعت ابوعاصم نے ابن جریج سے کی ہے کہ مجھے موسیٰ بن عقبہ نے خبر دی انہیں نافع نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا مَخْلَدٌ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَتَابَعَهُ أَبُو عَاصِمٍ عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَحَبَّ اللَّهُ الْعَبْدَ نَادَى جِبْرِيلَ إِنَّ اللَّهَ يُحِبُّ فُلاَنًا فَأَحْبِبْهُ‏.‏ فَيُحِبُّهُ جِبْرِيلُ، فَيُنَادِي جِبْرِيلُ فِي أَهْلِ السَّمَاءِ إِنَّ اللَّهَ يُحِبُّ فُلاَنًا فَأَحِبُّوهُ‏.‏ فَيُحِبُّهُ أَهْلُ السَّمَاءِ، ثُمَّ يُوضَعُ لَهُ الْقَبُولُ فِي الأَرْضِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3066,
                "hadithNumber": "3210",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"The angels descend, the clouds and mention this or that matter decreed in the Heaven. The devils listen stealthily to such a matter, come down to inspire the soothsayers with it, and the latter would add to it one-hundred lies of their own.\"",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ۔ آپ نے فرمایا تھا کہ فرشتے عنان میں اترتے ہیں ۔ اور عنان سے مراد بادل ہیں ۔ یہاں فرشتے ان کاموں کا ذکر کرتے ہیں جن کا فیصلہ آسمان میں ہو چکا ہوتا ہے ۔ اور یہیں سے شیاطین کچھ چوری چھپے باتیں اڑا لیتے ہیں ۔ پھر کاہنوں کو اس کی خبر کر دیتے ہیں اور یہ کاہن سو جھوٹ اپنی طرف سے ملا کر اسے بیان کرتے ہیں ۔",
                "urduNarrator": "ہم سے محمد نے بیان کیا ، انہوں نے کہا ہم سے ابن ابی مریم نے بیان کیا ، انہوں نے کہا کہ ہمیں لیث نے خبر دی ، ان سے ابن ابی جعفر نے بیان کیا ، ان سے محمد بن عبدالرحمن نے بیان کیا ، ان سے عروہ بن زبیر نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا اللَّيْثُ، حَدَّثَنَا ابْنُ أَبِي جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ الْمَلاَئِكَةَ تَنْزِلُ فِي الْعَنَانِ ـ وَهْوَ السَّحَابُ ـ فَتَذْكُرُ الأَمْرَ قُضِيَ فِي السَّمَاءِ، فَتَسْتَرِقُ الشَّيَاطِينُ السَّمْعَ، فَتَسْمَعُهُ فَتُوحِيهِ إِلَى الْكُهَّانِ، فَيَكْذِبُونَ مَعَهَا مِائَةَ كَذْبَةٍ مِنْ عِنْدِ أَنْفُسِهِمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3067,
                "hadithNumber": "3211",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"On every Friday the angels take their stand at every gate of the mosque to write the names of the people chronologically (i.e. according to the time of their arrival for the Friday prayer) and when the Imam sits (on the pulpit) they fold up their scrolls and get ready to listen to the sermon.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب جمعہ کا دن آتا ہے تو مسجد کے ہر دروازے پر فرشتے کھڑے ہو جاتے ہیں اور سب سے پہلے آنے والے اور پھر اس کے بعد آنے والوں کو نمبر وار لکھتے جاتے ہیں ۔ پھر جب امام ( خطبے کے لیے منبر پر ) بیٹھ جاتا ہے تو یہ فرشتے اپنے رجسٹر بند کر لیتے ہیں اور ذکر سننے لگ جاتے ہیں ۔ ( یہ حدیث کتاب الجمعہ میں مذکور ہو چکی ہے یہاں فرشتوں کا وجود ثابت کرنا مقصود ہے )",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے ابوسلمہ اور اغرنے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَالأَغَرِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِذَا كَانَ يَوْمُ الْجُمُعَةِ كَانَ عَلَى كُلِّ باب مِنْ أَبْوَابِ الْمَسْجِدِ الْمَلاَئِكَةُ، يَكْتُبُونَ الأَوَّلَ فَالأَوَّلَ، فَإِذَا جَلَسَ الإِمَامُ طَوَوُا الصُّحُفَ وَجَاءُوا يَسْتَمِعُونَ الذِّكْرَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3068,
                "hadithNumber": "3212",
                "englishNarrator": "Narrated Sa`id bin Al-Musaiyab:",
                "hadithEnglish": "`Umar came to the Mosque while Hassan was reciting a poem. (`Umar disapproved of that). On that Hassan said, \"I used to recite poetry in this very Mosque in the presence of one (i.e. the Prophet (ﷺ) ) who was better than you.\" Then he turned towards Abu Huraira and said (to him), \"I ask you by Allah, did you hear Allah's Messenger (ﷺ) saying (to me), \"Retort on my behalf. O Allah! Support him (i.e. Hassan) with the Holy Spirit?\" Abu Huraira said, \"Yes.\"",
                "hadithUrdu": "عمر بن خطاب رضی اللہ عنہ مسجد میں تشریف لائے تو حسان رضی اللہ عنہ نے کہا کہ میں اس وقت یہاں شعر پڑھا کرتا تھا جب آپ سے بہتر شخص ( آنحضرت صلی اللہ علیہ وسلم ) یہاں تشریف رکھتے تھے ۔ پھر حضرت حسان رضی اللہ عنہ حضرت ابوہریرہ رضی اللہ عنہ کی طرف متوجہ ہوئے اور کہا کہ میں تم سے اللہ کا واسطہ دے کر پوچھتا ہو کیا رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے تم نے نہیں سنا تھا کہ اے حسان ! ( کفار مکہ کو ) میری طرف سے جواب دے ۔ اے اللہ ! روح القدس کے ذریعہ حسان کی مدد کر ۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ ہاں بیشک ( میں نے سنا تھا ) ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے زہری نے بیان کیا ، ان سے سعید بن مسیب نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ مَرَّ عُمَرُ فِي الْمَسْجِدِ وَحَسَّانُ يُنْشِدُ، فَقَالَ كُنْتُ أُنْشِدُ فِيهِ، وَفِيهِ مَنْ هُوَ خَيْرٌ مِنْكَ، ثُمَّ الْتَفَتَ إِلَى أَبِي هُرَيْرَةَ، فَقَالَ أَنْشُدُكَ بِاللَّهِ، أَسَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ أَجِبْ عَنِّي، اللَّهُمَّ أَيِّدْهُ بِرُوحِ الْقُدُسِ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3069,
                "hadithNumber": "3213",
                "englishNarrator": "Narrated Al Bara رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said to Hassan, \"Lampoon them (i.e. the pagans) and Gabriel is with you.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے حسان رضی اللہ عنہ سے فرمایا ، مشرکین مکہ کی تم بھی ہجو کو یا ( یہ فرمایا کہ ) ان کی ہجو کا جواب دو ، جبرائیل تمہارے ساتھ ہیں ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عدی بن ثابت نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لِحَسَّانَ ‏ \"‏ اهْجُهُمْ ـ أَوْ هَاجِهِمْ ـ وَجِبْرِيلُ مَعَكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3070,
                "hadithNumber": "3214",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "\"As if I say a cloud of dust swirling up in the lane of Bani Ghanim.\" Musa added, \"That was caused by the procession of Gabriel.\"",
                "hadithUrdu": "جیسے وہ غبار میری نظروں کے سامنے ہے ۔ موسیٰ نے روایت میں یوں زیادتی کی کہ ” حضرت جبرائیل علیہ السلام کے ( ساتھ آنے والے ) سوار فرشتوں کی وجہ سے ۔ ‘ ‘ جو غبار خاندان بنوغنم کی گلی سے اٹھا تھا ۔",
                "urduNarrator": "ہم سے اسحاق نے بیان کیا ، کہا ہم کووہب بن جریر نے خبر دی ، ان سے میرے والد نے بیان کیا ، انہوں نے کہا کہ میں نے حمید بن ہلال سے سنا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ حُمَيْدَ بْنَ هِلاَلٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كَأَنِّي أَنْظُرُ إِلَى غُبَارٍ سَاطِعٍ فِي سِكَّةِ بَنِي غَنْمٍ‏.‏ زَادَ مُوسَى مَوْكِبَ جِبْرِيلَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3071,
                "hadithNumber": "3215",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Al Harith bin Hisham رضی اللہ عنہ asked the Prophet, \"How does the divine inspiration come to you?\" He replied, \"In all these ways: The Angel sometimes comes to me with a voice which resembles the sound of a ringing bell, and when this state abandons me, I remember what the Angel has said, and this type of Divine Inspiration is the hardest on me; and sometimes the Angel comes to me in the shape of a man and talks to me, and I understand and remember what he says.\"",
                "hadithUrdu": "حارث بن ہشام رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ وحی آپ کے پاس کس طرح آتی ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کئی طرح سے آتی ہے ۔ کبھی فرشتہ کے ذریعہ آتی ہے تو وہ گھنٹی بجنے کی آواز کی طرح نازل ہوتی ہے ۔ جب وحی ختم ہو جاتی ہے تو جو کچھ فرشتے نے نازل کیا ہوتا ہے ، میں اسے پوری طرح یاد کر چکا ہوتا ہوں ۔ وحی اترنے کی یہ صورت میرے لیے بہت دشوار ہوتی ہے ۔ کبھی فرشتہ میرے سامنے ایک مرد کی صورت میں آ جاتا ہے وہ مجھ سے باتیں کرتا ہے اور جو کچھ کہہ جاتا ہے میں اسے پوری طرح یاد کر لیتا ہوں ۔",
                "urduNarrator": "ہم سے فروہ بن ابی المغراء نے بیان کیا ، کہا ہم سے علی بن مسہر نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے باپ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا فَرْوَةُ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ الْحَارِثَ بْنَ هِشَامٍ، سَأَلَ النَّبِيَّ صلى الله عليه وسلم كَيْفَ يَأْتِيكَ الْوَحْىُ قَالَ ‏ \"‏ كُلُّ ذَاكَ يَأْتِي الْمَلَكُ أَحْيَانًا فِي مِثْلِ صَلْصَلَةِ الْجَرَسِ، فَيَفْصِمُ عَنِّي وَقَدْ وَعَيْتُ مَا قَالَ، وَهْوَ أَشَدُّهُ عَلَىَّ، وَيَتَمَثَّلُ لِي الْمَلَكُ أَحْيَانًا رَجُلاً، فَيُكَلِّمُنِي فَأَعِي مَا يَقُولُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3072,
                "hadithNumber": "3216",
                "englishNarrator": "Narrated Abu Huraira  رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"Who ever spends a couple (of objects) in Allah's cause, will be called by the Gatekeepers of Paradise who will say, \"O so-and-so, come on!\" Abu Bakr رضی اللہ عنہ  said, \"Such a person will never perish or be miserable' The Prophet (ﷺ) said, \"I hope you will be among such person.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے کہ اللہ کے راستے میں جو شخص کسی چیز کا بھی جوڑا دے ، تو جنت کے چوکیدار فرشتے اسے بلائیں گے کہ فلاں اس دروازے سے اندر آ جا ۔ ابوبکر رضی اللہ عنہ نے اس پر کہا کہ یہ تو وہ شخص ہو گا جسے کوئی نقصان نہ ہو گا ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مجھے امید ہے کہ تو بھی انہیں میں سے ہو گا ۔",
                "urduNarrator": "ہم سے ادم بن ابی ایاس نے بیان کیا ، کہا ہم سے شیبان نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے بیا کیا ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شَيْبَانُ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ أَنْفَقَ زَوْجَيْنِ فِي سَبِيلِ اللَّهِ دَعَتْهُ خَزَنَةُ الْجَنَّةِ أَىْ فُلُ هَلُمَّ ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ ذَاكَ الَّذِي لاَ تَوَى عَلَيْهِ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَرْجُو أَنْ تَكُونَ مِنْهُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3073,
                "hadithNumber": "3217",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) said to her \"O `Aisha رضی اللہ عنہا ' This is Gabriel and he sends his (greetings) salutations to you.\" `Aisha رضی اللہ عنہا said, \"Salutations (Greetings) to him, and Allah's Mercy and Blessings be on him,\" and addressing the Prophet (ﷺ) she said, \"You see what I don't see.\" She meant the prophet (ﷺ).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک مرتبہ فرمایا ” اے عائشہ ! یہ جبرائیل علیہ السلام آئے ہیں ، تم کو سلام کہہ رہے ہیں ۔ ‘ ‘ عائشہ رضی اللہ عنہا نے جواب میں کہا ، کہ وعلیہ السلام ورحمۃ اللہ وبرکاتہ ۔ آپ وہ چیزیں دیکھتے ہیں جنہیں میں نہیں دیکھ سکتی ، عائشہ رضی اللہ عنہا کی مراد نبی کریم صلی اللہ علیہ وسلم سے تھی ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے ہشام نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں ابوسلمہ نے اور انہیں عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهَا ‏ \"‏ يَا عَائِشَةُ، هَذَا جِبْرِيلُ يَقْرَأُ عَلَيْكِ السَّلاَمَ ‏\"‏‏.‏ فَقَالَتْ وَعَلَيْهِ السَّلاَمُ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ‏.‏ تَرَى مَا لاَ أَرَى‏.‏ تُرِيدُ النَّبِيَّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3074,
                "hadithNumber": "3218",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) asked Gabriel, \"Why don't you visit us more often than you do?\" Then the following Holy Verse was revealed (in this respect):-- \"And we (angels) descend not but by the order of your Lord. To Him belong what is before us and what is behind us, and what is between those two and your Lord was never forgetful.\" (19.64)",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے حضرت جبرائیل علیہ السلام سے ایک مرتبہ فرمایا ، ہم سے ملاقات کے لیے جتنی مرتبہ آپ آتے ہیں اس سے زیادہ کیوں نہیں آتے ؟ بیان کیا کہ اس پر یہ آیت نازل ہوئی ” اور ہم نہیں اترتے لیکن تیرے رب کے حکم سے ، اسی کا ہے جو کچھ کہ ہمارے سامنے ہے اور جو کچھ ہمارے پیچھے ہے ‘ ‘ آخر آیت تک ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے عمر بن ذر نے بیان کیا ( دوسری سند ) امام بخاری نے کہا کہ مجھ سے یحییٰ بن جعفر نے بیان کیا ، کہا ہم سے وکیع نے بیان کیا ، ان سے عمر بن ذر نے ، ان سے ان کے والد نے ، ان سے سعید بن جبیر نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عُمَرُ بْنُ ذَرٍّ، ح قَالَ حَدَّثَنِي يَحْيَى بْنُ جَعْفَرٍ، حَدَّثَنَا وَكِيعٌ، عَنْ عُمَرَ بْنِ ذَرٍّ، عَنْ أَبِيهِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِجِبْرِيلَ ‏\"‏ أَلاَ تَزُورُنَا أَكْثَرَ مِمَّا تَزُورُنَا ‏\"‏ قَالَ فَنَزَلَتْ ‏{‏وَمَا نَتَنَزَّلُ إِلاَّ بِأَمْرِ رَبِّكَ لَهُ مَا بَيْنَ أَيْدِينَا وَمَا خَلْفَنَا‏}‏ الآيَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3075,
                "hadithNumber": "3219",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Gabriel read the Qur'an to me in one way (i.e. dialect) and I continued asking him to read it in different ways till he read it in seven different ways.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جبرائیل علیہ السلام نے قرآن مجید مجھے ( عرب کے ) ایک ہی محاورے کے مطابق پڑھ کر سکھایا تھا ، لیکن میں اس میں برابر اضافہ کی خواہش کا اظہار کرتا رہا ، تاآنکہ عرب کے سات محاوروں پر اس کا نزول ہوا ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی ادریس نے بیان کیا ، کہا کہ مجھ سے سلیمان بن بلال نے بیان کیا ، ان سے یونس بن یزید نے ، ان سے ابن شہاب زبیری نے ، ان سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أَقْرَأَنِي جِبْرِيلُ عَلَى حَرْفٍ، فَلَمْ أَزَلْ أَسْتَزِيدُهُ حَتَّى انْتَهَى إِلَى سَبْعَةِ أَحْرُفٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3076,
                "hadithNumber": "3220",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) was the most generous of all the people, and he used to be more generous in the month of Ramadan when Gabriel used to meet him. Gabriel used to meet him every night in Ramadan to study the Holy Qur'an carefully together. Allah's Messenger (ﷺ) used to become more generous than the fast wind when he met Gabriel. Abdullah bin Mubarak the same from Mamar. And Hadrat Abu Hurairah رضی اللہ عنہ and Hadrat Fatima رضی اللہ عنہا report the prophet's words: \"أَنَّ جِبْرِيلَ كَانَ يُعَارِضُهُ الْقُرْآنَ\" .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سب سے زیادہ سخی تھے اور آپ کی سخاوت رمضان شریف کے مہینے میں اور بڑھ جاتی ، جب حضرت جبرائیل علیہ السلام آپ سے ملاقات کے لیے ہر روز آنے لگتے ۔ حضرت جبرائیل علیہ السلام آپ صلی اللہ علیہ وسلم سے رمضان کی ہر رات میں ملاقات کے لیے آتے اور آپ سے قرآن کا دور کیا کرتے تھے ۔ آنحضرت صلی اللہ علیہ وسلم خصوصاً اس دور میں جب حضرت جبرائیل علیہ السلام روزانہ آپ سے ملاقات کے لیے آتے تو آپ خیرات و برکات میں تیز چلنے والی ہوا سے بھی زیادہ سخی ہو جاتے تھے اور عبداللہ بن مبارک سے روایت ہے ، ان سے معمر نے اسی اسناد کے ساتھ اسی طرح بیان کیا اور حضرت ابوہریرہ رضی اللہ عنہ اور حضرت فاطمہ رضی اللہ عنہا نے نقل کیا نبی کریم صلی اللہ علیہ وسلم سے کہ حضرت جبرائیل علیہ السلام آنحضرت صلی اللہ علیہ وسلم کے ساتھ قرآن مجید کا دور کیا کرتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس نے خبر دی ، ان سے زہری نے بیان کیا ، کہا مجھ سے عبیداللہ بن عبداللہ نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَجْوَدَ النَّاسِ، وَكَانَ أَجْوَدَ مَا يَكُونُ فِي رَمَضَانَ حِينَ يَلْقَاهُ جِبْرِيلُ، وَكَانَ جِبْرِيلُ يَلْقَاهُ فِي كُلِّ لَيْلَةٍ مِنْ رَمَضَانَ، فَيُدَارِسُهُ الْقُرْآنَ، فَلَرَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ يَلْقَاهُ جِبْرِيلُ أَجْوَدُ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ‏.‏ وَعَنْ عَبْدِ اللَّهِ حَدَّثَنَا مَعْمَرٌ بِهَذَا الإِسْنَادِ نَحْوَهُ‏.‏ وَرَوَى أَبُو هُرَيْرَةَ وَفَاطِمَةُ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّ جِبْرِيلَ كَانَ يُعَارِضُهُ الْقُرْآنَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3077,
                "hadithNumber": "3221",
                "englishNarrator": "Narrated Ibn Shihab:",
                "hadithEnglish": "Once `Umar bin `Abdul `Aziz delayed the `Asr prayer a little. `Urwa said to him, \"Gabriel descended and led the prayer in front of the Prophet (ﷺ) \" On that `Umar said, \"O `Urwa! Be sure of what you say.\" \"Urwa, \"I heard Bashir bin Abi Masud narrating from Ibn Masud who heard Allah's Messenger (ﷺ) saying, 'Gabriel descended and led me in prayer; and then prayed with him again, and then prayed with him again, and then prayed with him again, and then prayed with him again, counting with his fingers five prayers.\"",
                "hadithUrdu": "حضرت عمر بن عبدالعزیز رحمہ اللہ نے ایک دن عصر کی نماز کچھ دیر کر کے پڑھائی ۔ اس پر عروہ بن زبیر رحمہ اللہ نے ان سے کہا ۔ لیکن جبرائیل علیہ السلام ( نماز کا طریقہ آنحضرت صلی اللہ علیہ وسلم کو سکھانے کے لیے ) نازل ہوئے اور رسول اللہ صلی اللہ علیہ وسلم کے آگے ہو کر آپ کو نماز پڑھائی ۔ حضرت عمرو بن عبدالعزیز نے کہا ، عروہ ! آپ کو معلوم بھی ہے آپ کیا کہہ رہے ہیں ؟ عروہ نے کہا کہ ( اور سن لو ) میں نے بشیر بن ابی مسعود سے سنا اور انہوں نے ابومسعود رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے کہ حضرت جبرائیل علیہ السلام نازل ہوئے اور انہوں نے مجھے نماز پڑھائی ۔ میں نے ان کے ساتھ نماز پڑھی ، پھر ( دوسرے وقت کی ) ان کے ساتھ میں نے نماز پڑھی ، پھر ان کے ساتھ میں نے نماز پڑھی ، پھر میں نے ان کے ساتھ نماز پڑھی ، پھر میں نے ان کے ساتھ نماز پڑھی ، اپنی انگلیوں پر آپ نے پانچوں نمازوں کو گن کر بتایا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ان سے ابن شہاب نے",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، أَخَّرَ الْعَصْرَ شَيْئًا فَقَالَ لَهُ عُرْوَةُ أَمَا إِنَّ جِبْرِيلَ قَدْ نَزَلَ فَصَلَّى أَمَامَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَقَالَ عُمَرُ اعْلَمْ مَا تَقُولُ يَا عُرْوَةُ‏.‏ قَالَ سَمِعْتُ بَشِيرَ بْنَ أَبِي مَسْعُودٍ يَقُولُ سَمِعْتُ أَبَا مَسْعُودٍ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ نَزَلَ جِبْرِيلُ فَأَمَّنِي، فَصَلَّيْتُ مَعَهُ، ثُمَّ صَلَّيْتُ مَعَهُ، ثُمَّ صَلَّيْتُ مَعَهُ، ثُمَّ صَلَّيْتُ مَعَهُ، ثُمَّ صَلَّيْتُ مَعَهُ ‏\"‏‏.‏ يَحْسُبُ بِأَصَابِعِهِ خَمْسَ صَلَوَاتٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "60",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 60,
                    "chapterNumber": "60",
                    "chapterEnglish": "Beginning of Creation",
                    "chapterUrdu": "اس بیان میں کہ مخلوق کی پیدائش کیونکر شروع ہوئی",
                    "chapterArabic": "كتاب بدء الخلق",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 3051,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=122",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=120",
                "label": "120",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=121",
                "label": "121",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=122",
                "label": "122",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=123",
                "label": "123",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=124",
                "label": "124",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=125",
                "label": "125",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=126",
                "label": "126",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=124",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=124",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=122",
        "to": 3075,
        "total": 40465
    }
}