{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 46,
        "data": [
            {
                "id": 1126,
                "hadithNumber": "1170",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to offer thirteen rak`at in the night prayer and on hearing the Adhan for the morning prayer, he used to offer two light rak`at.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم رات میں تیرہ رکعتیں پڑھتے تھے ۔ پھر جب صبح کی اذان سنتے تو دو ہلکی رکعتیں ( سنت فجر ) پڑھ لیتے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے باپ ( عروہ بن زبیر ) نے اور انہیں حضرت عائشہ صدیقہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِاللَّيْلِ ثَلاَثَ عَشْرَةَ رَكْعَةً، ثُمَّ يُصَلِّي إِذَا سَمِعَ النِّدَاءَ بِالصُّبْحِ رَكْعَتَيْنِ خَفِيفَتَيْنِ‏.‏",
                "headingArabic": "مَا يُقْرَأُ فِي رَكْعَتَيِ الْفَجْرِ",
                "headingUrdu": "فجر کی نماز سے پہلے دو رکعت پڑھنا",
                "headingEnglish": "To offer two Rak'at before the Fajr prayer",
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1127,
                "hadithNumber": "1171",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) used to make the two rak`at before the Fajr prayer so light that I would wonder whether he recited Al-Fatiha (or not).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ( دوسری سند ) اور ہم سے احمد بن یونس نے بیان کیا ، کہا کہ ہم سے زہیر نے بیان کیا ، کہا کہ ہم سے یحی بن سعید انصاری نے بیان کیا ، ان سے محمد بن عبدالرحمٰن نے ، ان سے عمرہ بنت عبدالرحمٰن نے اور ان سے حضرت عائشہ صدیقہ رضی اللہ عنہا نے کہ نبی کریم صلی اللہ علیہ وسلم صبح کی ( فرض ) نماز سے پہلے کی دو ( سنت ) رکعتوں کو بہت مختصر رکھتے تھے ۔ آپ نے ان میں سورۃ الفاتحہ بھی پڑھی یا نہیں میں یہ بھی نہیں کہہ سکتی ۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا ، انہوں نے کہا کہ ہم سے محمد بن جعفر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے محمد بن عبدالرحمٰن نے ، ان سے ان کی پھوپھی عمرہ بنت عبدالرحمٰن نے اور ان سے حضرت عائشہ صدیقہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَمَّتِهِ، عَمْرَةَ عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم ح وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا يَحْيَى ـ هُوَ ابْنُ سَعِيدٍ ـ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَمْرَةَ عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُخَفِّفُ الرَّكْعَتَيْنِ اللَّتَيْنِ قَبْلَ صَلاَةِ الصُّبْحِ حَتَّى إِنِّي لأَقُولُ هَلْ قَرَأَ بِأُمِّ الْكِتَابِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1128,
                "hadithNumber": "1162",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) used to teach us the way of doing Istikhara (Istikhara means to ask Allah to guide one to the right sort of action concerning any job or a deed), in all matters as he taught us the Suras of the Qur'an. He said, \"If anyone of you thinks of doing any job he should offer a two rak`at prayer other than the compulsory ones and say (after the prayer): -- 'Allahumma inni astakhiruka bi'ilmika, Wa astaqdiruka bi-qudratika, Wa as'alaka min fadlika Al-`azlm Fa-innaka taqdiru Wala aqdiru, Wa ta'lamu Wala a'lamu, Wa anta 'allamu l-ghuyub. Allahumma, in kunta ta'lam anna hadha-lamra Khairun li fi dini wa ma'ashi wa'aqibati `Amri (or 'ajili `Amri wa'ajilihi) Faqdirhu wa yas-sirhu li thumma barik li Fihi, Wa in kunta ta'lamu anna hadha-lamra shar-run li fi dini wa ma'ashi wa'aqibati `Amri (or fi'ajili `Amri wa ajilihi) Fasrifhu anni was-rifni anhu. Waqdir li al-khaira haithu kana Thumma ardini bihi.' (O Allah! I ask guidance from Your knowledge, And Power from Your Might and I ask for Your great blessings. You are capable and I am not. You know and I do not and You know the unseen. O Allah! If You know that this job is good for my religion and my subsistence and in my Hereafter--(or said: If it is better for my present and later needs)--Then You ordain it for me and make it easy for me to get, And then bless me in it, and if You know that this job is harmful to me In my religion and subsistence and in the Hereafter--(or said: If it is worse for my present and later needs)--Then keep it away from me and let me be away from it. And ordain for me whatever is good for me, And make me satisfied with it). The Prophet (ﷺ) added that then the person should name (mention) his need.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ہمیں اپنے تمام معاملات میں استخارہ کرنے کی اسی طرح تعلیم دیتے تھے جس طرح قرآن کی کوئی سورت سکھلاتے ۔ آپ صلی اللہ علیہ وسلم فرماتے کہ جب کوئی اہم معاملہ تمہارے سامنے ہو تو فرض کے علاوہ دو رکعت نفل پڑھنے کے بعد یہ دعا پڑھے «اللهم إني أستخيرك بعلمك وأستقدرك بقدرتك ،‏‏‏‏ وأسألك من فضلك العظيم ،‏‏‏‏ فإنك تقدر ولا أقدر وتعلم ولا أعلم وأنت علام الغيوب ،‏‏‏‏ اللهم إن كنت تعلم أن هذا الأمر خير لي في ديني ومعاشي وعاقبة أمري («أو قال») عاجل أمري وآجله فاقدره لي ويسره لي ثم بارك لي فيه ، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري أو قال في عاجل أمري وآجله فاصرفه عني واصرفني عنه ،‏‏‏‏ واقدر لي الخير» ( ترجمہ ) ” اے میرے اللہ ! میں تجھ سے تیرے علم کی بدولت خیر طلب کرتا ہوں اور تیری قدرت کی بدولت تجھ سے طاقت مانگتا ہوں اور تیرے فضل عظیم کا طلبگار ہوں کہ قدرت تو ہی رکھتا ہے اور مجھے کوئی قدرت نہیں ۔ علم تجھ ہی کو ہے اور میں کچھ نہیں جانتا اور تو تمام پوشیدہ باتوں کو جاننے والا ہے ۔ اے میرے اللہ ! اگر تو جانتا ہے کہ یہ کام جس کے لیے استخارہ کیا جا رہا ہے میرے دین دنیا اور میرے کام کے انجام کے اعتبار سے میرے لیے بہتر ہے یا ( آپ نے یہ فرمایا کہ ) میرے لیے وقتی طور پر اور انجام کے اعتبار سے یہ ( خیر ہے ) تو اسے میرے لیے نصیب کر اور اس کا حصول میرے لیے آسان کر اور پھر اس میں مجھے برکت عطا کر اور اگر تو جانتا ہے کہ یہ کام میرے دین ، دنیا اور میرے کام کے انجام کے اعتبار سے برا ہے ۔ یا ( آپ صلی اللہ علیہ وسلم نے یہ کہا کہ ) میرے معاملہ میں وقتی طور پر اور انجام کے اعتبار سے ( برا ہے ) تو اسے مجھ سے ہٹا دے اور مجھے بھی اس سے ہٹا دے ۔ پھر میرے لیے خیر مقدر فرما دے ، جہاں بھی وہ ہو اور اس سے میرے دل کو مطمئن بھی کر دے “ ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کام کی جگہ اس کام کا نام لے ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، کہا کہ ہم سے عبدالرحمٰن بن ابی الموال نے بیان کیا ، ان سے محمد بن منکدر نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِي، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعَلِّمُنَا الاِسْتِخَارَةَ فِي الأُمُورِ كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ يَقُولُ ‏ \"‏ إِذَا هَمَّ أَحَدُكُمْ بِالأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ مِنْ غَيْرِ الْفَرِيضَةِ ثُمَّ لِيَقُلِ اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ وَتَعْلَمُ وَلاَ أَعْلَمُ وَأَنْتَ عَلاَّمُ الْغُيُوبِ، اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي ـ أَوْ قَالَ عَاجِلِ أَمْرِي وَآجِلِهِ ـ فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي ـ أَوْ قَالَ فِي عَاجِلِ أَمْرِي وَآجِلِهِ ـ فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِي الْخَيْرَ حَيْثُ كَانَ ثُمَّ أَرْضِنِي بِهِ ـ قَالَ ـ وَيُسَمِّي حَاجَتَهُ ‏\"‏‏.‏",
                "headingArabic": "مَا جَاءَ فِي التَّطَوُّعِ مَثْنَى مَثْنَى",
                "headingUrdu": "فجر کی دو رکعت (سنت) میں جو پڑھی جاتی ہے؟",
                "headingEnglish": "What is recited in the two Rak'a (Sunna) of the Fajr",
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1129,
                "hadithNumber": "1163",
                "englishNarrator": "Narrated Abu Qatada bin Rabi Al-Ansari رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If anyone of you enters a Mosque, he should not sit until he has offered a tworak` at prayer.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب کوئی تم میں سے مسجد میں آئے تو نہ بیٹھے جب تک دو رکعت ( تحیۃ المسجد کی ) نہ پڑھ لے ۔",
                "urduNarrator": "ہم سے مکی بن ابراہیم نے بیان کیا ، ان سے عبداللہ بن سعید نے ، ان سے عامر بن عبداللہ بن زبیر نے بیان کیا ، انہوں نے عمرو بن سلیم زرقی سے ، انہوں نے ابوقتادہ بن ربعی انصاری صحابی رضی اللہ عنہ سے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، سَمِعَ أَبَا قَتَادَةَ بْنَ رِبْعِيٍّ الأَنْصَارِيّ َ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلاَ يَجْلِسْ حَتَّى يُصَلِّيَ رَكْعَتَيْنِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1130,
                "hadithNumber": "1164",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) led us and offered a two rak`at prayer and then went away.",
                "hadithUrdu": "ہمیں رسول اللہ صلی اللہ علیہ وسلم نے ( ہمارے گھر میں جب دعوت میں آئے تھے ) دو رکعت نماز پڑھائی اور پھر واپس تشریف لے گئے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک نے خبر دی ، انہیں اسحاق بن عبداللہ بن ابی طلحہ نے اور انہیں انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ صَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم رَكْعَتَيْنِ ثُمَّ انْصَرَفَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1131,
                "hadithNumber": "1165",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما:",
                "hadithEnglish": "I offered with Allah's Messenger (ﷺ) a two rak`at prayer before the Zuhr prayer and two rak`at after the Zuhr prayer, two rak`at after Jumua, Maghrib and `Isha' prayers.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ظہر سے پہلے دو رکعت سنت پڑھی اور ظہر کے بعد دو رکعت اور جمعہ کے بعد دو رکعت اور مغرب کے بعد دو رکعت اور عشاء کے بعد بھی دو رکعت ( نماز سنت ) پڑھی ہے ۔",
                "urduNarrator": "ہم سے یحی بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث نے عقیل سے بیان کیا ، عقیل سے ابن شہاب نے ، انہوں نے کہا کہ مجھے سالم نے خبر دی اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے ، آپ نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَالِمٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم رَكْعَتَيْنِ قَبْلَ الظُّهْرِ، وَرَكْعَتَيْنِ بَعْدَ الظُّهْرِ، وَرَكْعَتَيْنِ بَعْدَ الْجُمُعَةِ، وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ، وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1132,
                "hadithNumber": "1166",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "While delivering a sermon, Allah's Messenger (ﷺ) said, \"If anyone of you comes while the Imam is delivering the sermon or has come out for it, he should offer a two rak`at prayer.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے جمعہ کا خطبہ دیتے ہوئے فرمایا کہ جو شخص بھی ( مسجد میں ) آئے اور امام خطبہ دے رہا ہو یا خطبہ کے لیے نکل چکا ہو تو وہ دو رکعت نماز ( تحیۃ المسجد کی ) پڑھ لے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہمیں شعبہ نے خبر دی ، انہیں عمرو بن دینار نے خبر دی ، کہا کہ میں نے جابر بن عبداللہ انصاری رضی اللہ عنہما سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، قَالَ أَخْبَرَنَا شُعْبَةُ، أَخْبَرَنَا عَمْرُو بْنُ دِينَارٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ يَخْطُبُ ‏ \"‏ إِذَا جَاءَ أَحَدُكُمْ وَالإِمَامُ يَخْطُبُ ـ أَوْ قَدْ خَرَجَ ـ فَلْيُصَلِّ رَكْعَتَيْنِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1133,
                "hadithNumber": "1167",
                "englishNarrator": "Narrated Mujahid:",
                "hadithEnglish": "Somebody came to the house of Ibn `Umar رضی اللہ عنہما and told him that Allah's Messenger (ﷺ)s had entered the Ka`ba. Ibn `Umar said, \"I went in front of the Ka`ba and found that Allah's Messenger (ﷺ) had come out of the Ka`ba and I saw Bilal standing by the side of the gate of the Ka`ba. I said, 'O Bilal! Has Allah's Apostle prayed inside the Ka`ba?' Bilal replied in the affirmative. I said, 'Where (did he pray)?' He replied, '(He prayed) Between these two pillars and then he came out and offered a two rak`at prayer in front of the Ka`ba.' \" Abu `Abdullah said: Abu Huraira رضی اللہ عنہ said, \"The Prophet (ﷺ) advised me to offer two rak`at of Duha prayer (prayer to be offered after sunrise and before midday). \" Itban (bin Malik) said, \"Allah's Messenger (ﷺ) and Abu Bakr, came to me after sunrise and we aligned behind the Prophet (ﷺ) and offered two rak`at.\"",
                "hadithUrdu": "عبداللہ بن عمر رضی اللہ عنہما ( مکہ شریف میں ) اپنے گھر آئے ۔ کسی نے کہا بیٹھے کیا ہو آنحضرت صلی اللہ علیہ وسلم یہ آ گئے بلکہ کعبہ کے اندر بھی تشریف لے جا چکے ہیں ۔ عبداللہ نے کہا یہ سن کر میں آیا ۔ دیکھا تو آنحضرت صلی اللہ علیہ وسلم کعبہ سے باہر نکل چکے ہیں اور بلال رضی اللہ عنہ دروازے پر کھڑے ہیں ۔ میں نے ان سے پوچھا کہ اے بلال ! رسول اللہ صلی اللہ علیہ وسلم نے کعبہ میں نماز پڑھی ؟ انہوں نے کہا کہ ہاں پڑھی تھی ۔ میں نے پوچھا کہ کہاں پڑھی تھی ؟ انہوں نے بتایا کہ یہاں ان دو ستونوں کے درمیان ۔ پھر آپ باہر تشریف لائے اور دو رکعتیں کعبہ کے دروازے کے سامنے پڑھیں اور ابوہریرہ رضی اللہ عنہ نے کہا کہ مجھے نبی کریم صلی اللہ علیہ وسلم نے چاشت کی دو رکعتوں کی وصیت کی تھی اور عتبان نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر اور عمر رضی اللہ عنہما صبح دن چڑھے میرے گھر تشریف لائے ۔ ہم نے آپ صلی اللہ علیہ وسلم کے پیچھے صف بنا لی اور آنحضور صلی اللہ علیہ وسلم نے دو رکعت نماز پڑھائی ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے سیف بن سلیمان نے بیان کیا کہ میں نے مجاہد سے سنا ، انہوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سَيْفُ بْنُ سُلَيْمَانَ الْمَكِّيُّ، سَمِعْتُ مُجَاهِدًا، يَقُولُ أُتِيَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ فِي مَنْزِلِهِ فَقِيلَ لَهُ هَذَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَدْ دَخَلَ الْكَعْبَةَ قَالَ فَأَقْبَلْتُ فَأَجِدُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ خَرَجَ، وَأَجِدُ بِلاَلاً عِنْدَ الْبَابِ قَائِمًا فَقُلْتُ يَا بِلاَلُ، صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْكَعْبَةِ قَالَ نَعَمْ‏.‏ قُلْتُ فَأَيْنَ قَالَ بَيْنَ هَاتَيْنِ الأُسْطُوَانَتَيْنِ‏.‏ ثُمَّ خَرَجَ فَصَلَّى رَكْعَتَيْنِ فِي وَجْهِ الْكَعْبَةِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ أَوْصَانِي النَّبِيُّ صلى الله عليه وسلم بِرَكْعَتَىِ الضُّحَى‏.‏ وَقَالَ عِتْبَانُ غَدَا عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ ـ رضى الله عنه ـ بَعْدَ مَا امْتَدَّ النَّهَارُ وَصَفَفْنَا وَرَاءَهُ فَرَكَعَ رَكْعَتَيْنِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1134,
                "hadithNumber": "1172, 1173",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I performed prayer along with the prophet (ﷺ), so he (ﷺ) performed two units before the Zuhr and two units after the Maghrib, two units after the Isha, two units after the Friday prayer, and would perform Sunnah units of the Maghrib and the Isha at home. Ibn-e-Abu Zinad, Musa bin Uqbah ,Nafi'i have reported \"بَعْدَ الْعِشَاءِ فِي أَهْلِهِ‏\" . Katheer bin Ferqad and Ayyub corroborated him from Nafi'i.\r\nHe said that his sister, Hadrat Hafsah, narrated the Hadith to him: The prophet (ﷺ) would perform two short units after the sunrise and at that hour I did not use to enter the prophet's house. Katheer bin  Ferqad and Ayyub  corroborated him from Nafi'i and Ibn-e-Abu Zinad from Musa bin Uqbah and he reported \"بَعْدَ الْعِشَاءِ فِي أَهْلِهِ‏\" from Nafi'i.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ ظہر سے پہلے دو رکعت سنت ، ظہر کے بعد دو رکعت سنت ، مغرب کے بعد دو رکعت سنت ، عشاء کے بعد دو رکعت سنت اور جمعہ کے بعد دو رکعت سنت پڑھی ہیں اور مغرب اور عشاء کی سنتیں آپ گھر میں پڑھتے تھے ۔ \r\nابوالزناد نے موسیٰ بن عقبہ کے واسطہ سے بیان کیا اور ان سے نافع نے کہ عشاء کے بعد اپنے گھر میں ( سنت پڑھتے تھے ) ان کی روایت کی متابعت کثیر بن فرقد اور ایوب نے نافع کے واسطہ سے کی ہے ۔ ان سے ( ابن عمر رضی اللہ عنہما نے بیان کیا کہ ) میری بہن حفصہ رضی اللہ عنہا نے مجھ سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم فجر ہونے کے بعد دو ہلکی رکعتیں ( سنت فجر ) پڑھتے اور یہ ایسا وقت ہوتا کہ میں نبی کریم صلی اللہ علیہ وسلم کے پاس نہیں جاتی تھی ۔ عبیداللہ کے ساتھ اس حدیث کو کثیر بن فرقد اور ایوب نے بھی نافع سے روایت کیا اور ابن ابی الزناد نے اس حدیث کو موسیٰ بن عقبہ سے ، انہوں نے نافع سے روایت کیا ۔ اس میں «في بيته» کے بدل «في أهله‏» ہے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، انہوں نے کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے عبیداللہ عمری نے بیان کیا ، انہوں نے کہا کہ مجھے نافع نے عبداللہ بن عمر رضی اللہ عنہماسے خبر دی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنَا نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم سَجْدَتَيْنِ قَبْلَ الظُّهْرِ، وَسَجْدَتَيْنِ بَعْدَ الظُّهْرِ، وَسَجْدَتَيْنِ بَعْدَ الْمَغْرِبِ، وَسَجْدَتَيْنِ بَعْدَ الْعِشَاءِ، وَسَجْدَتَيْنِ بَعْدَ الْجُمُعَةِ، فَأَمَّا الْمَغْرِبُ وَالْعِشَاءُ فَفِي بَيْتِهِ‏.‏ قَالَ ابْنُ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ بَعْدَ الْعِشَاءِ فِي أَهْلِهِ‏.‏ تَابَعَهُ كَثِيرُ بْنُ فَرْقَدٍ وَأَيُّوبُ عَنْ نَافِعٍ‏.‏ وَحَدَّثَتْنِي أُخْتِي، حَفْصَةُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي سَجْدَتَيْنِ خَفِيفَتَيْنِ بَعْدَ مَا يَطْلُعُ الْفَجْرُ، وَكَانَتْ سَاعَةً لاَ أَدْخُلُ عَلَى النَّبِيِّ صلى الله عليه وسلم فِيهَا‏.‏ تَابَعَهُ كَثِيرُ بْنُ فَرْقَدٍ وَأَيُّوبُ عَنْ نَافِعٍ‏.‏ وَقَالَ ابْنُ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ بَعْدَ الْعِشَاءِ فِي أَهْلِهِ‏.‏",
                "headingArabic": "التَّطَوُّعِ بَعْدَ الْمَكْتُوبَةِ",
                "headingUrdu": "فرض نمازوں کے بعد نوافل پڑھنا",
                "headingEnglish": "To offer the Nawafil after the compulsory (congregational) Salat (prayers)",
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1135,
                "hadithNumber": "1174",
                "englishNarrator": "Narrated  Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "I offered with Allah's Messenger (ﷺ) eight rak`at (of Zuhr and `Asr prayers) together and seven rak`at (the Maghrib and the `Isha' prayers) together.' \" I said, \"O Abu Ash-shatha! I think he must have prayed the Zuhr late and the `Asr early; the `Isha early and the Maghrib late.\" Abu Ash-sha'tha' said, \"I also think so.\" (See Hadith No. 518 Vol. 1).",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ آٹھ رکعت ایک ساتھ ( ظہر اور عصر ) اور سات رکعت ایک ساتھ ( مغرب اور عشاء ملا کر ) پڑھیں ۔ ( بیچ میں سنت وغیرہ کچھ نہیں ) ابوالشعثاء سے میں نے کہا میرا خیال ہے کہ آپ صلی اللہ علیہ وسلم نے ظہر آخر وقت میں اور عصر اول وقت میں پڑھی ہو گی ۔ اسی طرح مغرب آخر وقت میں پڑھی ہو گی اور عشاء اول وقت میں ۔ ابوالشعثاء نے کہا کہ میرا بھی یہی خیال ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے عمرو بن دینار سے بیان کیا ، انہوں نے کہا کہ میں نے ابوالشعثاء جابر بن عبداللہ سے سنا ، انہوں نے بیان کیا کہ میں نے ابن عباس رضی اللہ عنہما سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ أَبَا الشَّعْثَاءِ، جَابِرًا قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ثَمَانِيًا جَمِيعًا وَسَبْعًا جَمِيعًا‏.‏ قُلْتُ يَا أَبَا الشَّعْثَاءِ أَظُنُّهُ أَخَّرَ الظُّهْرَ وَعَجَّلَ الْعَصْرَ وَعَجَّلَ الْعِشَاءَ وَأَخَّرَ الْمَغْرِبَ‏.‏ قَالَ وَأَنَا أَظُنُّهُ‏.‏",
                "headingArabic": "مَنْ لَمْ يَتَطَوَّعْ بَعْدَ الْمَكْتُوبَةِ",
                "headingUrdu": "جس نے فرض نماز کے بعد نماز نہیں پڑھی۔",
                "headingEnglish": "Whoever did not offer the Salat after the compulsory (congregational) Salat (prayers",
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1136,
                "hadithNumber": "1175",
                "englishNarrator": "Narrated  Ibn `Umar:",
                "hadithEnglish": "\"Do you offer the Duha prayer?\" He replied in the negative. I further asked, \"Did `Umar use to pray it?\" He (Ibn `Umar) replied in the negative. I again asked, \"Did Abu Bakr رضی اللہ عنہ use to pray it?\" He replied in the negative. I again asked, \"Did the Prophet (ﷺ) use to pray it?\" Ibn `Umar replied, \"I don't think he did.\"",
                "hadithUrdu": "کیا آپ چاشت کی نماز پڑھتے ہیں ؟ انہوں نے فرمایا کہ نہیں ۔ میں نے پوچھا اور عمر پڑھتے تھے ؟ آپ نے فرمایا کہ نہیں ۔ میں نے پوچھا اور ابوبکر رضی اللہ عنہ ؟ فرمایا نہیں ۔ میں نے پوچھا اور نبی کریم صلی اللہ علیہ وسلم ؟ فرمایا نہیں ۔ میرا خیال یہی ہے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحی بن سعید قطان نے بیان کیا ، ان سے شعبہ بن حجاج نے ، ان سے توبہ بن کیسان نے ، ان سے مورق بن مشمرج نے ، انہوں نے بیان کیا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے پوچھا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ تَوْبَةَ، عَنْ مُوَرِّقٍ، قَالَ قُلْتُ لاِبْنِ عُمَرَ ـ رضى الله عنهما ـ أَتُصَلِّي الضُّحَى قَالَ لاَ‏.‏ قُلْتُ فَعُمَرُ‏.‏ قَالَ لاَ‏.‏ قُلْتُ فَأَبُو بَكْرٍ‏.‏ قَالَ لاَ‏.‏ قُلْتُ فَالنَّبِيُّ صلى الله عليه وسلم قَالَ لاَ إِخَالُهُ‏.‏",
                "headingArabic": "صَلاَةِ الضُّحَى فِي السَّفَرِ",
                "headingUrdu": "سفر میں صلاۃ الوداع پڑھنا",
                "headingEnglish": "To offer the Salat-ud-Duha in journey",
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1137,
                "hadithNumber": "1176",
                "englishNarrator": "Narrated `Abdur Rahman bin Abi Laila:",
                "hadithEnglish": "Only Um Hani رضی اللہ عنہا narrated to me that she had seen the Prophet (ﷺ) offering the Duha prayer. She said, \"On the day of the conquest of Mecca, the Prophet (ﷺ) entered my house, took a bath and offered eight rak`at (of Duha prayers. I had never seen the Prophet (ﷺ) offering such a light prayer but he performed bowing and prostrations perfectly .",
                "hadithUrdu": "مجھ سے ام ہانی رضی اللہ عنہا کے سوا کسی ( صحابی ) نے یہ نہیں بیان کیا کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم کو چاشت کی نماز پڑھتے دیکھا ہے ۔ صرف ام ہانی رضی اللہ عنہا نے فرمایا کہ فتح مکہ کے دن آپ صلی اللہ علیہ وسلم ان کے گھر تشریف لائے ، آپ صلی اللہ علیہ وسلم نے غسل کیا اور پھر آٹھ رکعت ( چاشت کی ) نماز پڑھی ۔ تو میں نے ایسی ہلکی پھلکی نماز کبھی نہیں دیکھی ۔ البتہ آپ صلی اللہ علیہ وسلم رکوع اور سجدہ پوری طرح ادا کرتے تھے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے عمرو بن مرہ نے بیان کیا ، انہوں نے کہا کہ میں نے عبدالرحمٰن بن ابی لیلی سے سنا ، وہ کہتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى، يَقُولُ مَا حَدَّثَنَا أَحَدٌ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم يُصَلِّي الضُّحَى غَيْرَ أُمِّ هَانِئٍ فَإِنَّهَا قَالَتْ إِنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ بَيْتَهَا يَوْمَ فَتْحِ مَكَّةَ فَاغْتَسَلَ وَصَلَّى ثَمَانِيَ رَكَعَاتٍ فَلَمْ أَرَ صَلاَةً قَطُّ أَخَفَّ مِنْهَا، غَيْرَ أَنَّهُ يُتِمُّ الرُّكُوعَ وَالسُّجُودَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1138,
                "hadithNumber": "1177",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I never saw the Prophet (ﷺ) offering the Duha prayer but I always offer it.",
                "hadithUrdu": "میں نے تو رسول اللہ صلی اللہ علیہ وسلم کو چاشت کی نماز پڑھتے نہیں دیکھا مگر میں خود پڑھتی ہوں ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا کہ ہم سے ابن ابی ذئب نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے عروہ بن زبیر نے ، ان سے حضرت عائشہ صدیقہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم سَبَّحَ سُبْحَةَ الضُّحَى، وَإِنِّي لأُسَبِّحُهَا‏.‏",
                "headingArabic": "مَنْ لَمْ يُصَلِّ الضُّحَى وَرَآهُ وَاسِعًا",
                "headingUrdu": "جس نے نماز ظہر نہ پڑھی اور اسے جائز سمجھا (پڑھنا)",
                "headingEnglish": "Whoever did not offer the Duha prayer and thought it permissible (to offer it)",
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1139,
                "hadithNumber": "1178",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "My friend (the Prophet) advised me to do three things and I shall not leave them till I die, these are: To fast three days every month, to offer the Duha prayer, and to offer witr before sleeping.",
                "hadithUrdu": "مجھے میرے جانی دوست ( نبی کریم صلی اللہ علیہ وسلم ) نے تین چیزوں کی وصیت کی ہے کہ موت سے پہلے ان کو نہ چھوڑوں ۔ ہر مہینہ میں تین دن روزے ۔ چاشت کی نماز اور وتر پڑھ کر سونا ۔",
                "urduNarrator": "ہم سے مسلم بن ابرہیم نے بیان کیا ، انہوں نے کہا ہمیں شعبہ نے خبر دی ، انہوں نے کہا ہم سے عباس جریری نے جو فروخ کے بیٹے تھے بیان کیا ، ان سے ابوعثمان نہدی نے اور ان سے ابوہریرہ رضی اللہ عنہ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا شُعْبَةُ، حَدَّثَنَا عَبَّاسٌ الْجُرَيْرِيُّ ـ هُوَ ابْنُ فَرُّوخَ ـ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه قَالَ أَوْصَانِي خَلِيلِي بِثَلاَثٍ لاَ أَدَعُهُنَّ حَتَّى أَمُوتَ صَوْمِ ثَلاَثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ، وَصَلاَةِ الضُّحَى، وَنَوْمٍ عَلَى وِتْرٍ‏.‏",
                "headingArabic": "صَلاَةِ الضُّحَى فِي الْحَضَرِ",
                "headingUrdu": "سفر میں نہ ہونے کی صورت میں صلاۃ الوداع پڑھنا",
                "headingEnglish": "To offer Salat-ud-Duha when not traveling",
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1140,
                "hadithNumber": "1179",
                "englishNarrator": "Narrated  Anas bin Malik al-Ansari رضی اللہ عنہ :",
                "hadithEnglish": "\"An Ansari man, who was very fat, said to the Prophet, 'I am unable to present myself for the prayer with you.' He prepared a meal for the Prophet (ﷺ) and invited him to his house. He washed one side of a mat with water and the Prophet (ﷺ) offered two Rakat on it.\" So and so, the son of so and so, the son of Al-Jarud asked Anas, \"Did the Prophet (ﷺ) use to offer the Duha prayer?\" Anas replied, \"I never saw him praying (the Duha prayer) except on that day.\"",
                "hadithUrdu": "انصار میں سے ایک شخص ( عتبان بن مالک ) نے جو بہت موٹے آدمی تھے ، رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا کہ میں آپ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھنے کی طاقت نہیں رکھتا ( مجھ کو گھر پر نماز پڑھنے کی اجازت دیجئیے تو ) انہوں نے اپنے گھر نبی کریم صلی اللہ علیہ وسلم کے لیے کھانا پکوایا اور آپ صلی اللہ علیہ وسلم کو اپنے گھر بلایا اور ایک چٹائی کے کنارے کو آپ صلی اللہ علیہ وسلم کے لیے پانی سے صاف کیا ، آپ صلی اللہ علیہ وسلم نے اس پر دو رکعت نماز پڑھی ۔ اور فلاں بن فلاں بن جارود نے حضرت انس رضی اللہ عنہ سے پوچھا کہ کیا نبی کریم صلی اللہ علیہ وسلم چاشت کی نماز پڑھا کرتے تھے ؟ تو آپ نے فرمایا کہ میں نے اس روز کے سوا آپ صلی اللہ علیہ وسلم کو کبھی یہ نماز پڑھتے نہیں دیکھا ۔",
                "urduNarrator": "ہم سے علی بن جعد نے بیان کیا کہ ہم کوشعبہ نے خبر دی ، ان سے انس بن سیرین نے بیان کیا کہ میں نے انس بن مالک انصاری رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَنَسِ بْنِ سِيرِينَ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ الأَنْصَارِيَّ، قَالَ قَالَ رَجُلٌ مِنَ الأَنْصَارِ ـ وَكَانَ ضَخْمًا ـ لِلنَّبِيِّ صلى الله عليه وسلم إِنِّي لاَ أَسْتَطِيعُ الصَّلاَةَ مَعَكَ‏.‏ فَصَنَعَ لِلنَّبِيِّ صلى الله عليه وسلم طَعَامًا، فَدَعَاهُ إِلَى بَيْتِهِ، وَنَضَحَ لَهُ طَرَفَ حَصِيرٍ بِمَاءٍ فَصَلَّى عَلَيْهِ رَكْعَتَيْنِ‏.‏ وَقَالَ فُلاَنُ بْنُ فُلاَنِ بْنِ جَارُودٍ لأَنَسٍ ـ رضى الله عنه ـ أَكَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الضُّحَى فَقَالَ مَا رَأَيْتُهُ صَلَّى غَيْرَ ذَلِكَ الْيَوْمِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1141,
                "hadithNumber": "1180, 1181",
                "englishNarrator": "Narrated Ibn 'Umar رضی اللہ عنہما :",
                "hadithEnglish": "I remember ten Rakat of Nawafil from the Prophet, two Rakat before the Zuhr prayer and two after it; two Rakat after Maghrib prayer in his house, and two Rakat after 'Isha' prayer in his house, and two Rakat before the Fajr prayer and at that time nobody would enter the house of the Prophet.\r\nHafsa رضی اللہ عنہا told me that When the Moadhdhin would pronounce call to prayer at dawn, he ﷺ would perform two units",
                "hadithUrdu": "مجھے نبی کریم صلی اللہ علیہ وسلم سے دس رکعت سنتیں یاد ہیں ۔ دو رکعت سنت ظہر سے پہلے ، دو رکعت سنت ظہر کے بعد ، دو رکعت سنت مغرب کے بعد اپنے گھر میں ، دو رکعت سنت عشاء کے بعد اپنے گھر میں اور دو رکعت سنت صبح کی نماز سے پہلے اور یہ وہ وقت ہوتا تھا جب آپ صلی اللہ علیہ وسلم کے پاس کوئی نہیں جاتا تھا ۔ مجھ کو ام المؤمنین حضرت حفصہ رضی اللہ عنہا نے بتلایا کہ مؤذن جب اذان دیتا اور فجر ہو جاتی تو آپ صلی اللہ علیہ وسلم دو رکعتیں پڑھتے ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے بیان کیا ، ان سے نافع نے ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ حَفِظْتُ مِنَ النَّبِيِّ صلى الله عليه وسلم عَشْرَ رَكَعَاتٍ رَكْعَتَيْنِ قَبْلَ الظُّهْرِ، وَرَكْعَتَيْنِ بَعْدَهَا، وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ فِي بَيْتِهِ، وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ فِي بَيْتِهِ، وَرَكْعَتَيْنِ قَبْلَ صَلاَةِ الصُّبْحِ، وَكَانَتْ سَاعَةً لاَ يُدْخَلُ عَلَى النَّبِيِّ صلى الله عليه وسلم فِيهَا‏.‏حَدَّثَتْنِي حَفْصَةُ، أَنَّهُ كَانَ إِذَا أَذَّنَ الْمُؤَذِّنُ وَطَلَعَ الْفَجْرُ صَلَّى رَكْعَتَيْنِ‏.‏",
                "headingArabic": "الرَّكْعَتَيْنِ قَبْلَ الظُّهْرِ",
                "headingUrdu": "ظہر کی نماز سے پہلے دو رکعت پڑھنا",
                "headingEnglish": "To offer two Rak'a before the Zuhr prayer",
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1142,
                "hadithNumber": "1182",
                "englishNarrator": "Narrated Aisha:",
                "hadithEnglish": "The Prophet (ﷺ) never missed four rak`at before the Zuhr prayer and two rak`at before the Fajr prayer.\r\nIbn-u-Abi Adiyy and Amr corroborated him from shobah.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ظہر سے پہلے چار رکعت سنت اور صبح کی نماز سے پہلے دو رکعت سنت نماز پڑھنی نہیں چھوڑتے تھے ۔\r\n یحییٰ کے ساتھ اس حدیث کو ابن ابی عدی اور عمرو بن مرزوق نے بھی شعبہ سے روایت کیا ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، کہا کہ ہم سے شعبہ نے ، ان سے ابرہیم بن محمد بن منتشر نے ، ان سے ان کے باپ محمد بن منتشر نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لاَ يَدَعُ أَرْبَعًا قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ قَبْلَ الْغَدَاةِ‏.‏ تَابَعَهُ ابْنُ أَبِي عَدِيٍّ وَعَمْرٌو عَنْ شُعْبَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1143,
                "hadithNumber": "1183",
                "englishNarrator": "Narrated `Abdullah Al-Muzni رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Pray before the Maghrib (compulsory) prayer.\" He (said it thrice) and in the third time, he said, \"Whoever wants to offer it can do so.\" He said so because he did not like the people to take it as a tradition.",
                "hadithUrdu": "ان سے نبی کریم صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ مغرب کے فرض سے پہلے ( سنت کی دو رکعتیں ) پڑھا کرو ۔ تیسری مرتبہ آپ صلی اللہ علیہ وسلم نے یوں فرمایا کہ جس کا جی چاہے کیونکہ آپ صلی اللہ علیہ وسلم کو یہ بات پسند نہ تھی کہ لوگ اسے لازمی سمجھ بیٹھیں ۔",
                "urduNarrator": "ہم سے ابو معمر نے بیان کیا ، کہا کہ ہم سے عبدالوارث نے بیان کیا ، ان سے حسین معلم نے ، ان سے عبداللہ بن بریدہ نے ، انہوں نے کہا کہ مجھ سے عبداللہ بن مغفل مزنی رضی اللہ عنہ نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْحُسَيْنِ، عَنِ ابْنِ بُرَيْدَةَ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ الْمُزَنِيُّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ صَلُّوا قَبْلَ صَلاَةِ الْمَغْرِبِ ‏\"‏‏.‏ ـ قَالَ فِي الثَّالِثَةِ ـ لِمَنْ شَاءَ كَرَاهِيَةَ أَنْ يَتَّخِذَهَا النَّاسُ سُنَّةً‏.‏",
                "headingArabic": "الصَّلاَةِ قَبْلَ الْمَغْرِبِ",
                "headingUrdu": "نماز مغرب سے پہلے (اختیاری) نماز",
                "headingEnglish": "The (optional) salat before the Maghrib prayers",
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1144,
                "hadithNumber": "1184",
                "englishNarrator": "Narrated Marthad bin `Abdullah Al-Yazani:",
                "hadithEnglish": "I went to `Uqba bin 'Amir Al-Juhani  رضی اللہ عنہ and said, \"Is it not surprising that Abi Tamim offers two rak`at before the Maghrib prayer?\" `Uqba said, \"We used to do so in the lifetime of Allah's Messenger (ﷺ).\" I asked him, \"What prevents you from offering it now?\" He replied, \"Business.\"",
                "hadithUrdu": "میں عقبہ بن عامر جہنی صحابی رضی اللہ عنہ کے پاس آیا اور عرض کیا آپ کو ابوتمیم عبداللہ بن مالک پر تعجب نہیں آیا کہ وہ مغرب کی نماز فرض سے پہلے دو رکعت نفل پڑھتے ہیں ۔ اس پر عقبہ نے فرمایا کہ ہم بھی رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں اسے پڑھتے تھے ۔ میں نے کہا پھر اب اس کے چھوڑنے کی کیا وجہ ہے ؟ انہوں نے فرمایا کہ دنیا کے کاروبار مانع ہیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یزید نے بیان کیا ، کہا کہ ہم سے سعید بن ابی ایوب نے بیان کیا ، کہا کہ مجھ سے یزید بن ابی حبیب نے بیان کیا ، انہوں نے کہا کہ میں نے مرثد بن عبداللہ یزنی سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، قَالَ سَمِعْتُ مَرْثَدَ بْنَ عَبْدِ اللَّهِ الْيَزَنِيَّ، قَالَ أَتَيْتُ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ فَقُلْتُ أَلاَ أُعْجِبُكَ مِنْ أَبِي تَمِيمٍ يَرْكَعُ رَكْعَتَيْنِ قَبْلَ صَلاَةِ الْمَغْرِبِ‏.‏ فَقَالَ عُقْبَةُ إِنَّا كُنَّا نَفْعَلُهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قُلْتُ فَمَا يَمْنَعُكَ الآنَ قَالَ الشُّغْلُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1145,
                "hadithNumber": "1185, 1186",
                "englishNarrator": "Narrated Mahmud bin Ar-rabi' Al-Ansari رضی اللہ عنہ :",
                "hadithEnglish": "He remembered Allah's Messenger (ﷺ) and he also remembered a mouthful of water which he had thrown on his face, after taking it from a well that was in their house.\r\nMahmud said that he had heard `Itban bin Malik, who was present with Allah's Messenger (ﷺ) in the battle of Badr saying, \"I used to lead my people at Bani Salim in the prayer and there was a valley between me and those people. Whenever it rained it used to be difficult for me to cross it to go to their mosque. So I went to Allah's Messenger (ﷺ) and said, 'I have weak eyesight and the valley between me and my people flows during the rainy season and it becomes difficult for me to cross it; I wish you would come to my house and pray at a place so that I could take that place as a praying place.' Allah's Messenger (ﷺ) said, 'I will do so.' So Allah's Messenger (ﷺ) and Abu Bakr came to my house in the (next) morning after the sun had risen high. Allah's Messenger (ﷺ) asked my permission to let him in and I admitted him. He did not sit before saying, 'Where do you want us to offer the prayer in your house?' I pointed to the place where I wanted him to pray. So Allah's Messenger (ﷺ) stood up for the prayer and started the prayer with Takbir and we aligned in rows behind him; and he offered two rak`at, and finished them with Taslim, and we also performed Taslim with him. I detained him for a meal called \"Khazir\" which I had prepared for him.--(\"Khazir\" is a special type of dish prepared from barley flour and meat soup)-- When the neighbors got the news that Allah's Messenger (ﷺ) was in my house, they poured it till there were a great number of men in the house. One of them said, 'What is wrong with Malik, for I do not see him?' One of them replied, 'He is a hypocrite and does not love Allah and His Apostle.' On that Allah's Apostle said, 'Don't say this. Haven't you seen that he said, 'None has the right to be worshipped but Allah for Allah's sake only.' The man replied, 'Allah and His Apostle know better; but by Allah, we never saw him but helping and talking with the hypocrites.' Allah's Messenger (ﷺ) replied, 'No doubt, whoever says. None has the right to be worshipped but Allah, and by that he wants the pleasures of Allah, then Allah will save him from Hell.\" Mahmud added, \"I told the above narration to some people, one of whom was Abu Aiyub, the companion of Allah's Messenger (ﷺ) in the battle in which he (Abu Aiyub) died and Yazid bin Mu'awiya was their leader in Roman Territory. Abu Aiyub denounced the narration and said, 'I doubt that Allah's Messenger (ﷺ) ever said what you have said.' I felt that too much, and I vowed to Allah that if I remained alive in that holy battle, I would (go to Medina and) ask `Itban bin Malik if he was still living in the mosque of his people. So when he returned, I assumed Ihram for Hajj or `Umra and then I proceeded on till I reached Medina. I went to Bani Salim and `Itban bin Malik, who was by then an old blind man, was leading his people in the prayer. When he finished the prayer, I greeted him and introduced myself to him and then asked him about that narration. He told that narration again in the same manner as he had narrated it the first time.\"",
                "hadithUrdu": "انہیں نبی کریم صلی اللہ علیہ وسلم یاد ہیں اور آپ صلی اللہ علیہ وسلم کی وہ کلی بھی یاد ہے جو آپ صلی اللہ علیہ وسلم نے ان کے گھر کے کنویں سے پانی لے کر ان کے منہ میں کی تھی ۔ محمود نے کہا کہ میں نے عتبان بن مالک انصاری رضی اللہ عنہ سے سناجو بدر کی لڑائی میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ شریک تھے ، وہ کہتے تھے کہ میں اپنی قوم بنی سالم کو نماز پڑھایا کرتا تھا میرے ( گھر ) اور قوم کی مسجد کے بیچ میں ایک نالہ تھا ، اور جب بارش ہوتی تو اسے پار کر کے مسجد تک پہنچنا میرے لیے مشکل ہو جاتا تھا ۔ چنانچہ میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ صلی اللہ علیہ وسلم سے میں نے کہا کہ میری آنکھیں خراب ہو گئی ہیں اور ایک نالہ ہے جو میرے اور میری قوم کے درمیان پڑتا ہے ، وہ بارش کے دنوں میں بہنے لگ جاتا ہے اور میرے لیے اس کا پار کرنا مشکل ہو جاتا ہے ۔ میری یہ خواہش ہے کہ آپ صلی اللہ علیہ وسلم تشریف لا کر میرے گھر کسی جگہ نماز پڑھ دیں تاکہ میں اسے اپنے لیے نماز پڑھنے کی جگہ مقرر کر لوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہاری یہ خواہش جلد ہی پوری کر وں گا ۔ پھر دوسرے ہی دن آپ صلی اللہ علیہ وسلم حضرت ابوبکر رضی اللہ عنہ کو ساتھ لے کر صبح تشریف لے آئے اور آپ صلی اللہ علیہ وسلم نے اجازت چاہی اور میں نے اجازت دے دی ۔ آپ صلی اللہ علیہ وسلم تشریف لا کر بیٹھے بھی نہیں بلکہ پوچھا کہ تم اپنے گھر میں کس جگہ میرے لیے نماز پڑھنا پسند کرو گے ۔ میں جس جگہ کو نماز پڑھنے کے لیے پسند کر چکا تھا اس کی طرف میں نے اشارہ کر دیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے وہاں کھڑے ہو کر تکبیر تحریمہ کہی اور ہم سب نے آپ صلی اللہ علیہ وسلم کے پیچھے صف باندھ لی ۔ آپ صلی اللہ علیہ وسلم نے ہمیں دو رکعت نماز پڑھائی پھر سلام پھیرا ۔ ہم نے بھی آپ کے ساتھ سلام پھیرا ۔ میں نے حلیم کھانے کے لیے آپ صلی اللہ علیہ وسلم کو روک لیا جو تیار ہو رہا تھا ۔ محلہ والوں نے جو سنا کہ رسول اللہ صلی اللہ علیہ وسلم میرے گھر تشریف فرما ہیں تو لوگ جلدی جلدی جمع ہونے شروع ہو گئے اور گھر میں ایک خاصا مجمع ہو گیا ۔ ان میں سے ایک شخص بولا ۔ مالک کو کیا ہو گیا ہے ! یہاں دکھائی نہیں دیتا ۔ اس پر دوسرا بولا وہ تو منافق ہے ۔ اسے خدا اور رسول سے محبت نہیں ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے اس پر فرمایا ۔ ایسا مت کہو ، دیکھتے نہیں کہ وہ «لا إله إلا الله‏» پڑھتا ہے اور اس سے اس کا مقصد اللہ تعالیٰ کی خوشنودی ہے ۔ تب وہ کہنے لگا کہ ( اصل حال ) تو اللہ اور رسول کو معلوم ہے ۔ لیکن واللہ ! ہم تو ان کی بات چیت اور میل جول ظاہر میں منافقوں ہی سے دیکھتے ہیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا لیکن اللہ تعالیٰ نے ہر اس آدمی پر دوزخ حرام کر دی ہے جس نے «لا إله إلا الله‏» خدا کی رضا اور خوشنودی کے لیے کہہ لیا ۔ محمود بن ربیع نے بیان کیا کہ میں نے یہ حدیث ایک ایسی جگہ میں بیان کی جس میں آنحضرت صلی اللہ علیہ وسلم کے مشہور صحابی حضرت ابوایوب انصاری رضی اللہ عنہ بھی موجود تھے ۔ یہ روم کے اس جہاد کا ذکر ہے جس میں آپ کی موت واقع ہوئی تھی ۔ فوج کے سردار یزید بن معاویہ تھے ۔ ابوایوب رضی اللہ عنہ نے اس حدیث سے انکار کیا اور فرمایا کہ خدا کی قسم ! میں نہیں سمجھتا کہ رسول اللہ صلی اللہ علیہ وسلم نے ایسی بات کبھی بھی کہی ہو ۔ آپ کی یہ گفتگو مجھ کو بہت ناگوار گزری اور میں نے اللہ تعالیٰ کی منت مانی کہ اگر میں اس جہاد سے سلامتی کے ساتھ لوٹا تو واپسی پر اس حدیث کے بارے میں عتبان بن مالک رضی اللہ عنہ سے ضرور پوچھوں گا ۔ اگر میں نے انہیں ان کی قوم کی مسجد میں زندہ پایا ۔ آخر میں جہاد سے واپس ہوا ۔ پہلے تو میں نے حج اور عمرہ کا احرام باندھا پھر جب مدینہ واپسی ہوئی تو میں قبیلہ بنو سالم میں آیا ۔ حضرت عتبان رضی اللہ عنہ جو بوڑھے اور نابینا ہو گئے تھے ، اپنی قوم کونماز پڑھاتے ہوئے ملے ۔ سلام پھیرنے کے بعد میں نے حاضر ہو کر آپ کو سلام کیا اور بتلایا کہ میں فلاں ہوں ۔ پھر میں نے اس حدیث کے متعلق دریافت کیا تو آپ نے مجھ سے اس مرتبہ بھی اس طرح یہ حدیث بیان کی جس طرح پہلے بیان کی تھی ۔",
                "urduNarrator": "ہم سے اسحاق بن راہویہ نے بیان کیا ، کہا کہ ہم سے یعقوب بن ابراہیم نے بیان کیا ، کہا کہ ہم سے ہمارے باپ ابراہیم بن سعد نے بیان کیا ، ان سے ابن شہاب نے کہا کہ مجھے محمود بن ربیع انصاری رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ الأَنْصَارِيُّ، أَنَّهُ عَقَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم، وَعَقَلَ مَجَّةً مَجَّهَا فِي وَجْهِهِ مِنْ بِئْرٍ كَانَتْ فِي دَارِهِمْ‏.‏ فَزَعَمَ مَحْمُودٌ أَنَّهُ سَمِعَ عِتْبَانَ بْنَ مَالِكٍ الأَنْصَارِيّ َ ـ رضى الله عنه ـ وَكَانَ مِمَّنْ شَهِدَ بَدْرًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ كُنْتُ أُصَلِّي لِقَوْمِي بِبَنِي سَالِمٍ، وَكَانَ يَحُولُ بَيْنِي وَبَيْنَهُمْ وَادٍ إِذَا جَاءَتِ الأَمْطَارُ فَيَشُقُّ عَلَىَّ اجْتِيَازُهُ قِبَلَ مَسْجِدِهِمْ، فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ لَهُ إِنِّي أَنْكَرْتُ بَصَرِي، وَإِنَّ الْوَادِيَ الَّذِي بَيْنِي وَبَيْنَ قَوْمِي يَسِيلُ إِذَا جَاءَتِ الأَمْطَارُ فَيَشُقُّ عَلَىَّ اجْتِيَازُهُ، فَوَدِدْتُ أَنَّكَ تَأْتِي فَتُصَلِّي مِنْ بَيْتِي مَكَانًا أَتَّخِذُهُ مُصَلًّى‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سَأَفْعَلُ ‏\"‏‏.‏ فَغَدَا عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ ـ رضى الله عنه ـ بَعْدَ مَا اشْتَدَّ النَّهَارُ فَاسْتَأْذَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَذِنْتُ لَهُ فَلَمْ يَجْلِسْ حَتَّى قَالَ ‏\"‏ أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ مِنْ بَيْتِكَ ‏\"‏‏.‏ فَأَشَرْتُ لَهُ إِلَى الْمَكَانِ الَّذِي أُحِبُّ أَنْ أُصَلِّيَ فِيهِ، فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَكَبَّرَ وَصَفَفْنَا وَرَاءَهُ، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ سَلَّمَ وَسَلَّمْنَا حِينَ سَلَّمَ، فَحَبَسْتُهُ عَلَى خَزِيرٍ يُصْنَعُ لَهُ فَسَمِعَ أَهْلُ الدَّارِ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي بَيْتِي فَثَابَ رِجَالٌ مِنْهُمْ حَتَّى كَثُرَ الرِّجَالُ فِي الْبَيْتِ‏.‏ فَقَالَ رَجُلٌ مِنْهُمْ مَا فَعَلَ مَالِكٌ لاَ أَرَاهُ‏.‏ فَقَالَ رَجُلٌ مِنْهُمْ ذَاكَ مُنَافِقٌ لاَ يُحِبُّ اللَّهَ وَرَسُولَهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَقُلْ ذَاكَ أَلاَ تَرَاهُ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يَبْتَغِي بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ فَقَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ أَمَّا نَحْنُ فَوَاللَّهِ لاَ نَرَى وُدَّهُ وَلاَ حَدِيثَهُ إِلاَّ إِلَى الْمُنَافِقِينَ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَإِنَّ اللَّهَ قَدْ حَرَّمَ عَلَى النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ يَبْتَغِي بِذَلِكَ وَجْهَ اللَّهِ ‏\"‏‏.‏ قَالَ مَحْمُودٌ فَحَدَّثْتُهَا قَوْمًا فِيهِمْ أَبُو أَيُّوبَ صَاحِبُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَتِهِ الَّتِي تُوُفِّيَ فِيهَا وَيَزِيدُ بْنُ مُعَاوِيَةَ عَلَيْهِمْ بِأَرْضِ الرُّومِ، فَأَنْكَرَهَا عَلَىَّ أَبُو أَيُّوبَ قَالَ وَاللَّهِ مَا أَظُنُّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ مَا قُلْتَ قَطُّ‏.‏ فَكَبُرَ ذَلِكَ عَلَىَّ فَجَعَلْتُ لِلَّهِ عَلَىَّ إِنْ سَلَّمَنِي حَتَّى أَقْفُلَ مِنْ غَزْوَتِي أَنْ أَسْأَلَ عَنْهَا عِتْبَانَ بْنَ مَالِكٍ ـ رضى الله عنه ـ إِنْ وَجَدْتُهُ حَيًّا فِي مَسْجِدِ قَوْمِهِ، فَقَفَلْتُ فَأَهْلَلْتُ بِحَجَّةٍ أَوْ بِعُمْرَةٍ، ثُمَّ سِرْتُ حَتَّى قَدِمْتُ الْمَدِينَةَ فَأَتَيْتُ بَنِي سَالِمٍ، فَإِذَا عِتْبَانُ شَيْخٌ أَعْمَى يُصَلِّي لِقَوْمِهِ فَلَمَّا سَلَّمَ مِنَ الصَّلاَةِ سَلَّمْتُ عَلَيْهِ وَأَخْبَرْتُهُ مَنْ أَنَا، ثُمَّ سَأَلْتُهُ عَنْ ذَلِكَ الْحَدِيثِ فَحَدَّثَنِيهِ كَمَا حَدَّثَنِيهِ أَوَّلَ مَرَّةٍ‏.‏",
                "headingArabic": "صَلاَةِ النَّوَافِلِ جَمَاعَةً",
                "headingUrdu": "نوافل باجماعت ادا کرنا",
                "headingEnglish": "To offer Nawafil in congregation",
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1146,
                "hadithNumber": "1187",
                "englishNarrator": "Narrated Ibn `Uma رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Offer some of your prayers in your houses and do not make them graves.\"\r\nAbdul Wahab corroborated him from Ayyub.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے گھروں میں بھی کچھ نمازیں پڑھا کرو اور انہیں بالکل قبریں نہ بنا لو ( کہ جہاں نماز ہی نہ پڑھی جاتی ہو )\r\n وہیب کے ساتھ اس حدیث کو عبدالوہاب ثقفی نے بھی ایوب سے روایت کیا ہے ۔",
                "urduNarrator": "ہم سے عبدا لاعلی بن حماد نے بیان کیا ، کہا کہ ہم سے وہیب بن خالد نے بیان کیا ، ان سے ایوب سختیانی اور عبیداللہ بن عمر نے ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، وَعُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اجْعَلُوا فى بُيُوتِكُمْ مِنْ صَلاَتِكُمْ وَلاَ تَتَّخِذُوهَا قُبُورًا ‏\"‏‏.‏ تَابَعَهُ عَبْدُ الْوَهَّابِ عَنْ أَيُّوبَ‏.‏",
                "headingArabic": "التَّطَوُّعِ فِي الْبَيْتِ",
                "headingUrdu": "نوافل کی نماز گھر پر ادا کرنا",
                "headingEnglish": "To offer the Nawafil prayers at home",
                "chapterId": "20",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 20,
                    "chapterNumber": "20",
                    "chapterEnglish": "Prayer at Night (Tahajjud)",
                    "chapterUrdu": "تہجد کا بیان",
                    "chapterArabic": "كتاب التهجد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1147,
                "hadithNumber": "1188",
                "englishNarrator": "Narrated Quza'a:",
                "hadithEnglish": "I heard Abu Said رضی اللہ عنہ saying four words. He said, \"I heard the Prophet (ﷺ) (saying the following narrative).\" He had participated in twelve holy battles with the Prophet.",
                "hadithUrdu": "میں نے ابوسعید رضی اللہ عنہ سے چار باتیں سنیں اور انہوں نے بتلایا کہ میں نے انہیں نبی کریم صلی اللہ علیہ وسلم سے سنا تھا ، آپ نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ بارہ جہاد کئے تھے ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، انہوں نے کہا کہ مجھے عبدالملک نے قزعہ سے خبر دی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، عَنْ قَزَعَةَ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ ـ رضى الله عنه ـ أَرْبَعًا قَالَ سَمِعْتُ مِنَ النَّبِيِّ، صلى الله عليه وسلم وَكَانَ غَزَا مَعَ النَّبِيِّ صلى الله عليه وسلم ثِنْتَىْ عَشْرَةَ غَزْوَةً ح‏.‏",
                "headingArabic": "فَضْلِ الصَّلاَةِ فِي مَسْجِدِ مَكَّةَ وَالْمَدِينَةِ",
                "headingUrdu": "مکہ مکرمہ اور مدینہ منورہ کی مسجد میں نماز پڑھنے کی فضیلت",
                "headingEnglish": "The superiority of offering As-Salat in the Mosque of Makkah and Al-Madina",
                "chapterId": "21",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 21,
                    "chapterNumber": "21",
                    "chapterEnglish": "Virtues of Prayer at Masjid Makkah and Madinah",
                    "chapterUrdu": "مکہ و مدینہ میں نماز کی فضیلت",
                    "chapterArabic": "كتاب فضل الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1148,
                "hadithNumber": "1189",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Do not set out on a journey except for three Mosques i.e. Al-Masjid-AI-Haram, the Mosque of Allah's Messenger (ﷺ) , and the Mosque of Al-Aqsa, (Mosque of Jerusalem).\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تین مسجدوں کے سوا کسی کے لیے کجاوے نہ باندھے جائیں ۔ ( یعنی سفر نہ کیا جائے ) ایک مسجدالحرام ، دوسری رسول اللہ صلی اللہ علیہ وسلم کی مسجد ( مسجدنبوی ) اور تیسری مسجدالاقصیٰ یعنی بیت المقدس ۔",
                "urduNarrator": "( دوسری سند ) ہم سے علی بن مدینی نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے زہری نے ، ان سے سعید بن مسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تُشَدُّ الرِّحَالُ إِلاَّ إِلَى ثَلاَثَةِ مَسَاجِدَ الْمَسْجِدِ الْحَرَامِ، وَمَسْجِدِ الرَّسُولِ صلى الله عليه وسلم وَمَسْجِدِ الأَقْصَى ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "21",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 21,
                    "chapterNumber": "21",
                    "chapterEnglish": "Virtues of Prayer at Masjid Makkah and Madinah",
                    "chapterUrdu": "مکہ و مدینہ میں نماز کی فضیلت",
                    "chapterArabic": "كتاب فضل الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1149,
                "hadithNumber": "1190",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"One prayer in my Mosque is better than one thousand prayers in any other mosque excepting Al-Masjid-AI-Haram.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میری اس مسجد میں نماز مسجدالحرام کے سوا تمام مسجدوں میں نماز سے ایک ہزار درجہ زیادہ افضل ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک نے زید بن رباح اور عبیداللہ بن ابی عبداللہ اغرسے خبر دی ، انہیں ابوعبدللہ اغر نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ رَبَاحٍ، وَعُبَيْدِ اللَّهِ بْنِ أَبِي عَبْدِ اللَّهِ الأَغَرِّ، عَنْ أَبِي عَبْدِ اللَّهِ الأَغَرِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ صَلاَةٌ فِي مَسْجِدِي هَذَا خَيْرٌ مِنْ أَلْفِ صَلاَةٍ فِيمَا سِوَاهُ إِلاَّ الْمَسْجِدَ الْحَرَامَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "21",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 21,
                    "chapterNumber": "21",
                    "chapterEnglish": "Virtues of Prayer at Masjid Makkah and Madinah",
                    "chapterUrdu": "مکہ و مدینہ میں نماز کی فضیلت",
                    "chapterArabic": "كتاب فضل الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1150,
                "hadithNumber": "1191, 1192",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "Ibn `Umar رضی اللہ عنہما never offered the Duha prayer except on two occasions: \r\n(1) Whenever he reached Mecca; and he always used to reach Mecca in the forenoon. He would perform Tawaf round the Ka`ba and then offer two rak`at at the rear of Maqam Ibrahim. \r\n(2) Whenever he visited Quba, for he used to visit it every Saturday. When he entered the Mosque, he disliked to leave it without offering a prayer. Ibn `Umar رضی اللہ عنہما narrated that Allah's Messenger (ﷺ) used to visit the Mosque of Quba (sometime) walking and (sometime) riding. And he (i.e. Ibn `Umar) used to say, \"I do only what my companions used to do and I don't forbid anybody to pray at any time during the day or night except that one should not intend to pray at sunrise or sunset.\"",
                "hadithUrdu": "حضرت عبداللہ بن عمر رضی اللہ عنہما چاشت کی نماز صرف دو دن پڑھتے تھے ۔ جب مکہ آتے کیونکہ آپ مکہ میں چاشت ہی کے وقت آتے تھے اس وقت پہلے آپ طواف کرتے اور پھر مقام ابراہیم کے پیچھے دو رکعت پڑھتے ۔ دوسرے جس دن آپ مسجد قباء میں تشریف لاتے آپ کا یہاں ہر ہفتہ کو آنے کا معمول تھا ۔ جب آپ مسجد کے اندر آتے تو نماز پڑھے بغیر باہر نکلنا برا جانتے ۔ آپ بیان کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم یہاں سوار اور پیدل دونوں طرح آیا کرتے تھے ۔نافع نے بیان کیا کہ ابن عمر رضی اللہ عنہما فرمایا کرتے تھے کہ میں اسی طرح کرتا ہوں جیسے میں نے اپنے ساتھیوں ( صحابہ رضی اللہ عنہم ) کو کرتے دیکھا ہے ۔ لیکن تمہیں رات یا دن کے کسی حصے میں نماز پڑھنے سے نہیں روکتا ۔ صرف اتنی بات ہے کہ قصد کر کے تم سورج نکلتے یا ڈوبتے وقت نہ پڑھو ۔",
                "urduNarrator": "ہم سے یعقوب بن ابراہیم نے بیان کیا ، انہوں نے کہا کہ ہم سے اسماعیل بن علیہ نے بیان کیا ، انہوں نے کہا ہمیں ایوب سختیانی نے خبر دی اور انہیں نافع نے کہ",
                "hadithArabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ ـ هُوَ الدَّوْرَقِيُّ ـ حَدَّثَنَا ابْنُ عُلَيَّةَ، أَخْبَرَنَا أَيُّوبُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ لاَ يُصَلِّي مِنَ الضُّحَى إِلاَّ فِي يَوْمَيْنِ يَوْمَ يَقْدَمُ بِمَكَّةَ، فَإِنَّهُ كَانَ يَقْدَمُهَا ضُحًى، فَيَطُوفُ بِالْبَيْتِ، ثُمَّ يُصَلِّي رَكْعَتَيْنِ خَلْفَ الْمَقَامِ، وَيَوْمَ يَأْتِي مَسْجِدَ قُبَاءٍ، فَإِنَّهُ كَانَ يَأْتِيهِ كُلَّ سَبْتٍ، فَإِذَا دَخَلَ الْمَسْجِدَ كَرِهَ أَنْ يَخْرُجَ مِنْهُ حَتَّى يُصَلِّيَ فِيهِ‏.‏ قَالَ وَكَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَزُورُهُ رَاكِبًا وَمَاشِيًا‏.‏قَالَ وَكَانَ يَقُولُ إِنَّمَا أَصْنَعُ كَمَا رَأَيْتُ أَصْحَابِي يَصْنَعُونَ، وَلاَ أَمْنَعُ أَحَدًا أَنْ يُصَلِّيَ فِي أَىِّ سَاعَةٍ شَاءَ مِنْ لَيْلٍ أَوْ نَهَارٍ، غَيْرَ أَنْ لاَ تَتَحَرَّوْا طُلُوعَ الشَّمْسِ وَلاَ غُرُوبَهَا‏.‏",
                "headingArabic": "مَسْجِدِ قُبَاءٍ",
                "headingUrdu": "مسجد قبا (مسجد قبا)",
                "headingEnglish": "The Masjid Quba (the Mosque of Quba)",
                "chapterId": "21",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 21,
                    "chapterNumber": "21",
                    "chapterEnglish": "Virtues of Prayer at Masjid Makkah and Madinah",
                    "chapterUrdu": "مکہ و مدینہ میں نماز کی فضیلت",
                    "chapterArabic": "كتاب فضل الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1126,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=45",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=43",
                "label": "43",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=44",
                "label": "44",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=45",
                "label": "45",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=46",
                "label": "46",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=47",
                "label": "47",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=48",
                "label": "48",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=49",
                "label": "49",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=47",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=47",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=45",
        "to": 1150,
        "total": 40465
    }
}