{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 248,
        "data": [
            {
                "id": 6178,
                "hadithNumber": "6441",
                "englishNarrator": "Narrated Hakim bin Hizam:",
                "hadithEnglish": "I asked the Prophet (for some money) and he gave me, and then again I asked him and he gave me, and then again I asked him and he gave me and he then said, \"This wealth is (like) green and sweet (fruit), and whoever takes it without greed, Allah will bless it for him, but whoever takes it with greed, Allah will not bless it for him, and he will be like the one who eats but is never satisfied. And the upper (giving) hand is better than the lower (taking) hand.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے مانگاتو آنحضرت صلی اللہ علیہ وسلم نے مجھے عطاء فرمایا ۔ میں نے پھر مانگا اور آنحضرت صلی اللہ علیہ وسلم نے پھر عطاء فرمایا ۔ پھر میں نے مانگا اور آنحضرت صلی اللہ علیہ وسلم نے پھر عطاء فرمایا ۔ پھر فرمایا کہ یہ مال ۔ اور بعض اوقات سفیان نے یوں بیان کیا کہ ( حکیم رضی اللہ عنہ نے بیان کیا ) اے حکیم ! یہ مال سرسبز اور خوشگوار نظر آتا ہے پس جو شخص اسے نیک نیتی سے لے اس میں برکت ہوتی ہے اور جو لالچ کے ساتھ لیتا ہے تو اس کے مال میں برکت نہیں ہوتی بلکہ وہ اس شخص جیسا ہو جاتا ہے جو کھاتا جا تا ہے لیکن اس کا پیٹ نہیں بھرتا اور اوپر کا ہاتھ نیچے کے ہاتھ سے بہتر ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا کہ میں نے زہری سے سنا ، وہ کہتے تھے کہ مجھے عروہ اور سعید بن مسیب نے خبر دی ، انہیں حکیم بن حزام نے ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، يَقُولُ أَخْبَرَنِي عُرْوَةُ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ حَكِيمِ بْنِ حِزَامٍ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم فَأَعْطَانِي، ثُمَّ سَأَلْتُهُ فَأَعْطَانِي، ثُمَّ سَأَلْتُهُ فَأَعْطَانِي، ثُمَّ قَالَ ‏ \"‏ هَذَا الْمَالُ ـ وَرُبَّمَا قَالَ سُفْيَانُ قَالَ لِي يَا حَكِيمُ ـ إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ، فَمَنْ أَخَذَهُ بِطِيبِ نَفْسٍ بُورِكَ لَهُ فِيهِ، وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ، وَكَانَ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ، وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم: «هَذَا الْمَالُ خَضِرَةٌ حُلْوَةٌ»",
                "headingUrdu": "\"دولت سبز میٹھی ہے.\"",
                "headingEnglish": "\"Wealth is green sweet.\"",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6179,
                "hadithNumber": "6442",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Who among you considers the wealth of his heirs dearer to him than his own wealth?\" They replied, \"O Allah's Messenger (ﷺ)! There is none among us but loves his own wealth more.\" The Prophet (ﷺ) said, \"So his wealth is whatever he spends (in Allah's Cause) during his life (on good deeds) while the wealth of his heirs is whatever he leaves after his death.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم میں کون ہے جسے اپنے مال سے زیادہ اپنے وارث کا مال پیارا ہو ۔ صحابہ نے عرض کیا یا رسول اللہ ! ہم میں کوئی ایسانہیں جسے مال زیادہ پیارا نہ ہو ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، پھر اس کا مال وہ ہے جو اس نے ( موت سے ) پہلے ( اللہ کے راستہ میں خرچ ) کیا اور اس کے وارث کا مال وہ ہے جو وہ چھوڑ کر مرا ۔",
                "urduNarrator": "مجھ سے عمر بن حفص نے بیان کیا ، کہا مجھ سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا کہ مجھ سے ابراہیم تیمی نے بیان کیا ، ان سے حارث بن سوید نے کہ عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عُمَرُ بْنُ حَفْصٍ، حَدَّثَنِي أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ التَّيْمِيُّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، قَالَ عَبْدُ اللَّهِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَيُّكُمْ مَالُ وَارِثِهِ أَحَبُّ إِلَيْهِ مِنْ مَالِهِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ مَا مِنَّا أَحَدٌ إِلاَّ مَالُهُ أَحَبُّ إِلَيْهِ‏.‏ قَالَ ‏\"‏ فَإِنَّ مَالَهُ مَا قَدَّمَ، وَمَالُ وَارِثِهِ مَا أَخَّرَ ‏\"‏‏.‏",
                "headingArabic": "مَا قَدَّمَ مِنْ مَالِهِ فَهْوَ لَهُ",
                "headingUrdu": "اپنے مال سے جو خرچ کرے گا وہ اس کے لیے بہتر ہوگا۔",
                "headingEnglish": "Whatever one spends from his money will be better for him",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6180,
                "hadithNumber": "6443",
                "englishNarrator": "Narrated Abu Dhar رضی اللہ عنہ :",
                "hadithEnglish": "Once I went out at night and found Allah's Messenger (ﷺ) walking all alone accompanied by nobody, and I thought that perhaps he disliked that someone should accompany him. So I walked in the shade, away from the moonlight, but the Prophet (ﷺ) looked behind and saw me and said, \"Who is that?\" I replied, \"Abu Dhar, let Allah get me sacrificed for you!\" He said, \"O Abu Dhar, come here!\" So I accompanied him for a while and then he said, \"The rich are in fact the poor (little rewarded) on the Day of Resurrection except him whom Allah gives wealth which he gives (in charity) to his right, left, front and back, and does good deeds with it. I walked with him a little longer. Then he said to me, \"Sit down here.\" So he made me sit in an open space surrounded by rocks, and said to me, \"Sit here till I come back to you.\" He went towards Al-Harra till I could not see him, and he stayed away for a long period, and then I heard him saying, while he was coming, \"Even if he had committed theft, and even if he had committed illegal sexual intercourse?\" When he came, I could not remain patient and asked him, \"O Allah's Prophet! Let Allah get me sacrificed for you! Whom were you speaking to by the side of Al-Harra? I did not hear anybody responding to your talk.\" He said, \"It was Gabriel who appeared to me beside Al-Harra and said, 'Give the good news to your followers that whoever dies without having worshipped anything besides Allah, will enter Paradise.' I said, 'O Gabriel! Even if he had committed theft or committed illegal sexual intercourse?' He said, 'Yes.' I said, 'Even if he has committed theft or committed illegal sexual intercourse?' He said, 'Yes.' I said, 'Even if he has committed theft or committed illegal sexual intercourse?' He said, 'Yes.' \"And though he imbibies. Habeeb bin Abu Thabit, Aamash and Abdul Aziz bin Rafi reported it from Zaid bin Wahab. Imam Bukhari said: The Hadith  which Abu Sualih has reported from Abu Derda is Mursal and is not authentic. We have mentioned it only for  awareness. The authentic one is that of Hadrat Abu Dharr. It was said to Imam Bukhari: Ata bin Yasar has also reported it from Hadrat Abu Derda. He, thereupon, replied: That is Mursal, too. Hadrat Abu Dharr's Hadith is the authentic one. He further said: Add this to Hadrat Abu Derda's Hadith: When this to Hadrat Abu Derda's Hadith: When someone dies and pronounce ''لاَ إِلَهَ إِلاَّ اللَّ'' while dying.",
                "hadithUrdu": "ایک روز میں باہر نکلاتو دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم تنہا چل رہے تھے اور آپ کے ساتھ کوئی بھی نہ تھا ۔ ابوذررضی اللہ عنہ کہتے ہیں کہ اس سے میں سمجھا کہ آنحضرت صلی اللہ علیہ وسلم اسے پسند نہیں فرمائیں گے کہ آپ کے ساتھ اس وقت کوئی رہے ۔ اس لئے میں چاند کے سائے میں آنحضرت صلی اللہ علیہ وسلم کے پیچھے پیچھے چلنے لگا ۔ اس کے بعد آپ مڑے تو مجھے دیکھا اور دریافت فرمایا کون ہے ؟ میں نے عرض کیا ابوذر ! اللہ مجھے آپ پر قربان کرے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، ابوذر ! یہاں آؤ ۔ بیان کیا کہ پھر میں تھوڑی دیر تک آپ کے ساتھ چلتا رہا ۔ اس کے بعد آپ نے فرمایا کہ جو لوگ ( دنیا میں ) زیادہ مال و دولت جمع کئے ہوئے ہیں قیامت کے دن وہی خسارے میں ہوں گے ۔ سوائے ان کے جنہیں اللہ تعالیٰ نے مال دیاہو اور انہوں نے اسے دائیں بائیں ، آگے پیچھے خرچ کیا ہو اور اسے بھلے کاموں میں لگایا ہو ۔ ( ابوذر رضی اللہ عنہ نے ) بیان کیا کہ پھر تھوڑی دیر تک میں آپ کے ساتھ چلتا رہا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہاں بیٹھ جاؤ ۔ آنحضرت صلی اللہ علیہ وسلم نے مجھے ایک ہموار زمین پر بٹھا دیا جس کے چاروں طرف پتھر تھے اور فرمایا کہ یہاں اس وقت تک بیٹھے رہو جب تک میں تمہارے پاس لوٹ آؤں ۔ پھر آپ پتھریلی زمین کی طرف چلے گئے اور نظروں سے اوجھل ہو گئے ۔ آپ وہاں رہے اور دیر تک وہیں رہے ۔ پھر میں نے آپ سے سنا ، آپ یہ کہتے ہوئے تشریف لا رہے تھے ” چاہے چوری ہو ، چاہے زنا ہو “ ابوذر کہتے ہیں کہ جب آنحضرت صلی اللہ علیہ وسلم تشریف لائے تو مجھ سے صبر نہیں ہو سکا اور میں نے عرض کیا اے اللہ کے نبی ! اللہ آپ پر مجھے قربان کرے ۔ اس پتھریلی زمین کے کنارے آپ کس سے باتیں کر رہے تھے ۔ میں نے تو کسی دوسرے کو آپ سے بات کرتے نہیں دیکھا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ” یہ جبرائیل علیہ السلام تھے ۔ پتھریلی زمین ( حرہ ) کے کنارے وہ مجھ سے ملے اور کہا کہ اپنی امت کو خوشخبری سنا دو کہ جو بھی اس حال میں مرے گا کہ اللہ کے ساتھ کسی چیز کو شریک نہ ٹھہراتا ہو تو وہ جنت میں جائے گا ۔ میں نے عرض کیا اے جبرائیل ! خواہ اس نے چوری کی ہو ، زناکیا ہو ؟ جبرائیل علیہ السلام نے کہا ہاں ، خواہ اس نے شراب ہی پی ہو ۔ “ نضرنے بیان کیا کہ ہمیں شعبہ نے خبر دی ( کہا ) ہم سے حبیب بن ابی ثابت ، اعمش اور عبد العزیز بن رفیع نے بیان کیا ، ان سے زید بن وہب نے اسی طرح بیان کیا ۔ امام بخاری رحمہ اللہ نے کہا ابوصالح نے جو اسی باب میں ابودرداء سے روایت کی ہے وہ منقطع ہے ( ابوصالح نے ابودرداء سے نہیں سنا ) اور صحیح نہیں ہے ہم نے یہ بیان کر دیا تاکہ اس حدیث کا حال معلوم ہو جائے اور صحیح ابوذر کی حدیث ہے ( جو اوپر مذکورہوئی ) کسی نے امام بخاری سے پوچھا عطاء بن یسار نے بھی تو یہ حدیث ابودرداء سے روایت کی ہے ۔ انہوں نے کہا وہ بھی منقطع ہے اور صحیح نہیں ہے ۔ آخر صحیح وہی ابوذر کی حدیث نکلی ۔ امام بخاری نے کہا ابودرداء کی حدیث کو چھوڑو ( وہ سند لینے کے لائق نہیں ہے کیونکہ وہ منقطع ہے ) امام بخاری رحمہ اللہ نے کہا کہ ابوذر کی حدیث کا مطلب یہ ہے کہ مرتے وقت آدمی لا الٰہ الا اللہ کہے اور توحید پر خاتمہ ہو ( تو وہ ایک نہ ایک دن ضرور جنت میں جائے گا گو کتنا ہی گنہگار ہو ) ۔ بعض نسخوں میں یہ ہے ھذا اذا تاب وقال لاالٰہ الا اللہ عند الموت یعنی ابوذرکی حدیث اس شخص کے بارے میں ہے جو گناہ سے توبہ کرے اور مرتے وقت لا الٰہ الا اللہ کہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے عبد العزیز بن رفیع نے ، ان سے زید بن وہب نے اور ان سے ابوذرغفاری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ قَالَ خَرَجْتُ لَيْلَةً مِنَ اللَّيَالِي فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْشِي وَحْدَهُ، وَلَيْسَ مَعَهُ إِنْسَانٌ ـ قَالَ ـ فَظَنَنْتُ أَنَّهُ يَكْرَهُ أَنْ يَمْشِيَ مَعَهُ أَحَدٌ ـ قَالَ ـ فَجَعَلْتُ أَمْشِي فِي ظِلِّ الْقَمَرِ فَالْتَفَتَ فَرَآنِي فَقَالَ ‏\"‏ مَنْ هَذَا ‏\"‏‏.‏ قُلْتُ أَبُو ذَرٍّ جَعَلَنِي اللَّهُ فِدَاءَكَ‏.‏ قَالَ ‏\"‏ يَا أَبَا ذَرٍّ تَعَالَهْ ‏\"‏‏.‏ قَالَ فَمَشَيْتُ مَعَهُ سَاعَةً فَقَالَ ‏\"‏ إِنَّ الْمُكْثِرِينَ هُمُ الْمُقِلُّونَ يَوْمَ الْقِيَامَةِ، إِلاَّ مَنْ أَعْطَاهُ اللَّهُ خَيْرًا، فَنَفَحَ فِيهِ يَمِينَهُ وَشِمَالَهُ وَبَيْنَ يَدَيْهِ وَوَرَاءَهُ، وَعَمِلَ فِيهِ خَيْرًا ‏\"‏‏.‏ قَالَ فَمَشَيْتُ مَعَهُ سَاعَةً فَقَالَ لِي ‏\"‏ اجْلِسْ هَا هُنَا ‏\"‏‏.‏ قَالَ فَأَجْلَسَنِي فِي قَاعٍ حَوْلَهُ حِجَارَةٌ فَقَالَ لِي ‏\"‏ اجْلِسْ هَا هُنَا حَتَّى أَرْجِعَ إِلَيْكَ ‏\"‏‏.‏ قَالَ فَانْطَلَقَ فِي الْحَرَّةِ حَتَّى لاَ أَرَاهُ فَلَبِثَ عَنِّي فَأَطَالَ اللُّبْثَ، ثُمَّ إِنِّي سَمِعْتُهُ وَهْوَ مُقْبِلٌ وَهْوَ يَقُولُ ‏\"‏ وَإِنْ سَرَقَ وَإِنْ زَنَى ‏\"‏‏.‏ قَالَ فَلَمَّا جَاءَ لَمْ أَصْبِرْ حَتَّى قُلْتُ يَا نَبِيَّ اللَّهِ جَعَلَنِي اللَّهُ فِدَاءَكَ مَنْ تُكَلِّمُ فِي جَانِبِ الْحَرَّةِ مَا سَمِعْتُ أَحَدًا يَرْجِعُ إِلَيْكَ شَيْئًا‏.‏ قَالَ ‏\"‏ ذَلِكَ جِبْرِيلُ ـ عَلَيْهِ السَّلاَمُ ـ عَرَضَ لِي فِي جَانِبِ الْحَرَّةِ، قَالَ بَشِّرْ أُمَّتَكَ أَنَّهُ مَنْ مَاتَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ، قُلْتُ يَا جِبْرِيلُ وَإِنْ سَرَقَ وَإِنْ زَنَى قَالَ نَعَمْ‏.‏ قَالَ قُلْتُ وَإِنْ سَرَقَ وَإِنْ زَنَى قَالَ نَعَمْ، وَإِنْ شَرِبَ الْخَمْرَ. قَالَ النَّضْرُ أَخْبَرَنَا شُعْبَةُ، وَحَدَّثَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ، وَالأَعْمَشُ، وَعَبْدُ الْعَزِيزِ بْنُ رُفَيْعٍ، حَدَّثَنَا زَيْدُ بْنُ وَهْبٍ، بِهَذَا‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ حَدِيثُ أَبِي صَالِحٍ عَنْ أَبِي الدَّرْدَاءِ، مُرْسَلٌ، لاَ يَصِحُّ، إِنَّمَا أَرَدْنَا لِلْمَعْرِفَةِ، وَالصَّحِيحُ حَدِيثُ أَبِي ذَرٍّ‏.‏ قِيلَ لأَبِي عَبْدِ اللَّهِ حَدِيثُ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي الدَّرْدَاءِ قَالَ مُرْسَلٌ أَيْضًا لاَ يَصِحُّ، وَالصَّحِيحُ حَدِيثُ أَبِي ذَرٍّ‏.‏ وَقَالَ اضْرِبُوا عَلَى حَدِيثِ أَبِي الدَّرْدَاءِ هَذَا‏.‏ إِذَا مَاتَ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ عِنْدَ الْمَوْتِ‏.‏",
                "headingArabic": "الْمُكْثِرُونَ هُمُ الْمُقِلُّونَ",
                "headingUrdu": "امیر دراصل غریب ہیں۔",
                "headingEnglish": "The rich are in fact the poor",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6181,
                "hadithNumber": "6444",
                "englishNarrator": "Narrated Abu Dhar رضی اللہ عنہ :",
                "hadithEnglish": "While I was walking with the Prophet (ﷺ) in the Harra of Medina, Uhud came in sight. The Prophet (ﷺ) said, \"O Abu Dhar!\" I said, \"Labbaik, O Allah's Messenger (ﷺ)!\" He said, \"I would not like to have gold equal to this mountain of Uhud, unless nothing of it, not even a single Dinar of it remains with me for more than three days, except something which I will keep for repaying debts. I would have spent all of it (distributed it) amongst Allah's Slaves like this, and like this, and like this.\" The Prophet (ﷺ) pointed out with his hand towards his right, his left and his back (while illustrating it). He proceeded with his walk and said, \"The rich are in fact the poor (little rewarded) on the Day of Resurrection except those who spend their wealth like this, and like this, and like this, to their right, left and back, but such people are few in number.\" Then he said to me, \"Stay at your place and do not leave it till I come back.\" Then he proceeded in the darkness of the night till he went out of sight, and then I heard a loud voice, and was afraid that something might have happened to the Prophet (ﷺ) .1 intended to go to him, but I remembered what he had said to me, i.e. 'Don't leave your place till I come back to you,' so I remained at my place till he came back to me. I said, \"O Allah's Messenger (ﷺ)! I heard a voice and I was afraid.\" So I mentioned the whole story to him. He said, \"Did you hear it?\" I replied, \"Yes.\" He said, \"It was Gabriel who came to me and said, 'Whoever died without joining others in worship with Allah, will enter Paradise.' I asked (Gabriel), 'Even if he had committed theft or committed illegal sexual intercourse? Gabriel said, 'Yes, even if he had committed theft or committed illegal sexual intercourse.\"",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ کے ساتھ مدینہ کے پتھریلے علاقہ میں چل رہا تھا کہ احد پہاڑ ہمارے سامنے آ گیا ۔ آنحضرت صلی اللہ علیہ سلم نے دریافت فرمایا ابوذر ! میں نے عرض کیا حاضر ہوں یا رسول اللہ ! آپ صلی اللہ علیہ وسلم نے فرمایا مجھے اس سے بالکل خوشی نہیں ہو گی کہ میرے پاس اس احد کے برابر سونا ہو اور اس پر تین دن اس طرح گذر جائیں کہ اس میں سے ایک دینار بھی باقی رہ جائے سوا اس تھوڑی سی رقم کے جو میں قرض کی ادائیگی کے لئے چھوڑ دوں بلکہ میں اسے اللہ کے بندوں میں اس طرح خرچ کروں اپنی دائیں طرف سے ، بائیں طرف سے اور پیچھے سے ۔ پھر آنحضرت صلی اللہ علیہ وسلم چلتے رہے ، اس کے بعد فرمایا زیادہ مال جمع رکھنے والے ہی قیامت کے دن مفلس ہوں گے سوا اس شخص کے جو اس مال کو اس اس طرح دائیں طرف سے ، بائیں طرف سے اور پیچھے سے خرچ کرے اور ایسے لوگ کم ہیں ۔ پھر مجھ سے فرمایا ، یہیں ٹھہرے رہو ، یہا ں سے اس وقت تک نہ جانا جب تک میں آنہ جاؤں ۔ پھر آنحضرت صلی اللہ علیہ وسلم رات کی تاریکی میں چلے گئے اور نظروں سے اوجھل ہو گئے ۔ اس کے بعد میں نے آواز سنی جو بلند تھی ۔ مجھے ڈر لگا کہ کہیں آنحضرت صلی اللہ علیہ وسلم کو کوئی دشواری نہ پیش آ گئی ہو ۔ میں نے آپ کی خدمت میں پہنچنے کا ارادہ کیا لیکن آپ کا ارشاد یاد آیا کہ اپنی جگہ سے نہ ہٹنا ، جب تک میں نہ آ جاؤں ۔ چنانچہ جب تک آنحضرت صلی اللہ علیہ وسلم تشریف نہیں لائے میں وہاں سے نہیں ہٹا ۔ پھر آپ آئے میں نے عرض کیا یا رسول اللہ ! میں نے ایک آواز سنی تھی ، مجھے ڈر لگا لیکن پھر آپ کا ارشاد یاد آیا ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کیا تم نے سنا تھا ؟ میں نے عرض کیا ، جی ہاں ۔ فرمایا کہ وہ جبرائیل علیہ السلام تھے اور انہوں نے کہا کہ آپ کی امت کا جو شخص اس حال میں مر جائے کہ اس نے اللہ کے ساتھ کسی کو شریک نہ کیا ہو تو جنت میں جائے گا ۔ میں نے پوچھا خواہ اس نے زنا اور چوری بھی کی ہو ؟ انہوں نے کہا ہاں زنا اور چوری ہی کیوں نہ کی ہو ۔",
                "urduNarrator": "ہم سے حسن بن ربیع نے بیان کیا ، کہا ہم سے ابوالاحوص ( سلام بن سلیم ) نے بیان کیا ، ان سے اعمش نے ، ان سے زید بن وہب نے کہ حضرت ابوذرغفار ی رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنِ الأَعْمَشِ، عَنْ زَيْدِ بْنِ وَهْبٍ، قَالَ قَالَ أَبُو ذَرٍّ كُنْتُ أَمْشِي مَعَ النَّبِيِّ صلى الله عليه وسلم فِي حَرَّةِ الْمَدِينَةِ فَاسْتَقْبَلَنَا أُحُدٌ فَقَالَ ‏\"‏ يَا أَبَا ذَرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ مَا يَسُرُّنِي أَنَّ عِنْدِي مِثْلَ أُحُدٍ هَذَا ذَهَبًا، تَمْضِي عَلَىَّ ثَالِثَةٌ وَعِنْدِي مِنْهُ دِينَارٌ، إِلاَّ شَيْئًا أُرْصِدُهُ لِدَيْنٍ، إِلاَّ أَنْ أَقُولَ بِهِ فِي عِبَادِ اللَّهِ هَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ وَمِنْ خَلْفِهِ‏.‏ ثُمَّ مَشَى فَقَالَ ‏\"‏ إِنَّ الأَكْثَرِينَ هُمُ الأَقَلُّونَ يَوْمَ الْقِيَامَةِ إِلاَّ مَنْ قَالَ هَكَذَا وَهَكَذَا وَهَكَذَا ـ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ وَمِنْ خَلْفِهِ ـ وَقَلِيلٌ مَا هُمْ ‏\"‏‏.‏ ثُمَّ قَالَ لِي ‏\"‏ مَكَانَكَ لاَ تَبْرَحْ حَتَّى آتِيَكَ ‏\"‏‏.‏ ثُمَّ انْطَلَقَ فِي سَوَادِ اللَّيْلِ حَتَّى تَوَارَى فَسَمِعْتُ صَوْتًا قَدِ ارْتَفَعَ، فَتَخَوَّفْتُ أَنْ يَكُونَ قَدْ عَرَضَ لِلنَّبِيِّ صلى الله عليه وسلم فَأَرَدْتُ أَنْ آتِيَهُ فَذَكَرْتُ قَوْلَهُ لِي ‏\"‏ لاَ تَبْرَحْ حَتَّى آتِيَكَ ‏\"‏ فَلَمْ أَبْرَحْ حَتَّى أَتَانِي، قُلْتُ يَا رَسُولَ اللَّهِ لَقَدْ سَمِعْتُ صَوْتًا تَخَوَّفْتُ، فَذَكَرْتُ لَهُ فَقَالَ ‏\"‏ وَهَلْ سَمِعْتَهُ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ ذَاكَ جِبْرِيلُ أَتَانِي فَقَالَ مَنْ مَاتَ مِنْ أُمَّتِكَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ ‏\"‏ وَإِنْ زَنَى وَإِنْ سَرَقَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ مَا أُحِبُّ أَنَّ لِي مِثْلَ أُحُدٍ ذَهَبًا ‏\"‏",
                "headingUrdu": "’’مجھے اس پہاڑ کے برابر سونا پسند نہیں ہوگا‘‘۔",
                "headingEnglish": "\"It would not please me to have gold equal to this mountain of Uhud\"",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6182,
                "hadithNumber": "6445",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah Apostle said, \"If I had gold equal to the mountain of Uhud, it would not please me that anything of it should remain with me after three nights (i.e., I would spend all of it in Allah's Cause) except what I would keep for repaying debts.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اگر میرے پاس احد پہاڑ کے برابر بھی سونا ہو تو مجھے اس میں خوشی ہو گی کہ تین دن بھی مجھ پر اس حال میں نہ گزرنے پائیں کہ اس میں سے میرے پاس کچھ بھی باقی بچے ۔ البتہ اگر کسی کا قرض دورکرنے کے لئے کچھ رکھ چھوڑوں تو یہ اور بات ہے ۔",
                "urduNarrator": "مجھ سے احمد بن شبیب نے بیان کیا ، کہامجھ سے میرے والد نے بیان کیا ، ان سے یونس نے اور لیث بن سعد نے بیان کیا کہ مجھ سے یونس نے بیان کیا ، ان سے ابن شہاب زہری نے ، ان سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ شَبِيبٍ، حَدَّثَنَا أَبِي، عَنْ يُونُسَ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ كَانَ لِي مِثْلُ أُحُدٍ ذَهَبًا لَسَرَّنِي أَنْ لاَ تَمُرَّ عَلَىَّ ثَلاَثُ لَيَالٍ وَعِنْدِي مِنْهُ شَىْءٌ، إِلاَّ شَيْئًا أُرْصِدُهُ لِدَيْنٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6183,
                "hadithNumber": "6446",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Riches does not mean, having a great amount of property, but riches is selfcontentment.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تونگری یہ نہیں ہے کہ سامان زیادہ ہو ، بلکہ امیری یہ ہے کہ دل غنی ہو ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے ابوبکر بن عیاش نے بیان کیا ، کہا ہم سے ابو حصین نے بیان کیا ، ان سے ابوصالح ذکوان نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا أَبُو حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيْسَ الْغِنَى عَنْ كَثْرَةِ الْعَرَضِ، وَلَكِنَّ الْغِنَى غِنَى النَّفْسِ ‏\"‏‏.‏",
                "headingArabic": "الْغِنَى غِنَى النَّفْسِ‏",
                "headingUrdu": "حقیقی دولت خود قناعت ہے۔",
                "headingEnglish": "True riches is self-contentment",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6184,
                "hadithNumber": "6447",
                "englishNarrator": "Narrated Sahl bin Sa`d As-Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "A man passed by Allah's Messenger (ﷺ) and the Prophet (ﷺ) asked a man sitting beside him, \"What is your opinion about this (passer-by)?\" He replied, \"This (passer-by) is from the noble class of people. By Allah, if he should ask for a lady's hand in marriage, he ought to be given her in marriage, and if he intercedes for somebody, his intercession will be accepted. Allah's Messenger (ﷺ) kept quiet, and then another man passed by and Allah's Messenger (ﷺ) asked the same man (his companion) again, \"What is your opinion about this (second) one?\" He said, \"O Allah's Messenger (ﷺ)! This person is one of the poor Muslims. If he should ask a lady's hand in marriage, no-one will accept him, and if he intercedes for somebody, no one will accept his intercession, and if he talks, no-one will listen to his talk.\" Then Allah's Messenger (ﷺ) said, \"This (poor man) is better than such a large number of the first type (i.e. rich men) as to fill the earth.\"",
                "hadithUrdu": "ایک شخص رسول کریم صلی اللہ علیہ وسلم کے سامنے سے گزرا تو آنحضرت صلی اللہ علیہ وسلم نے ایک دوسرے شخص ابوذرغفاری رضی اللہ عنہ سے جو آپ کے قریب بیٹھے ہوئے تھے ، پوچھا کہ اس شخص ( گزرے والے ) کے متعلق تم کیا کہتے ہو ؟ انہوں نے کہا کہ یہ معزز لوگوں میں سے ہے اور اللہ کی قسم یہ اس قابل ہے کہ اگر یہ پیغام نکاح بھیجے تو اس سے نکاح کر دیا جائے ۔ اگر یہ سفارش کرے تو ان کی سفارش قبول کر لی جائے ۔ بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم یہ سن کر خاموش ہو گئے ۔ اس کے بعد ایک دوسرے صاحب گزرے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے ان کے متعلق بھی پوچھا کہ ان کے بارے میں تمہاری کیا رائے ہے ؟ انہوں نے کہا ، یا رسول اللہ ! یہ صاحب مسلمانوں کے غریب طبقہ سے ہیں اور یہ ایسے ہیں کہ اگریہ نکاح کاپیغام بھیجیں تو ان کا نکاح نہ کیا جائے ، اگر یہ کسی کی سفارش کریں تو ان کی سفارش قبول نہ کی جائے اور اگر کچھ کہیں تو ان کی بات نہ سنی جائے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس کے بعد فرمایا ۔ اللہ کے نزدیک یہ پچھلا محتاج شخص اگلے مالدا ر شخص سے گو ویسے آدمی زمین بھر کر ہوں ، بہتر ہے ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے عبد العزیز بن ابی حازم نے بیان کیا ، ان سے ان کے والد نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّهُ قَالَ مَرَّ رَجُلٌ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لِرَجُلٍ عِنْدَهُ جَالِسٍ ‏\"‏ مَا رَأْيُكَ فِي هَذَا ‏\"‏‏.‏ فَقَالَ رَجُلٌ مِنْ أَشْرَافِ النَّاسِ، هَذَا وَاللَّهِ حَرِيٌّ إِنْ خَطَبَ أَنْ يُنْكَحَ، وَإِنْ شَفَعَ أَنْ يُشَفَّعَ‏.‏ قَالَ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ مَرَّ رَجُلٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا رَأْيُكَ فِي هَذَا ‏\"‏‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا رَجُلٌ مِنْ فُقَرَاءِ الْمُسْلِمِينَ، هَذَا حَرِيٌّ إِنْ خَطَبَ أَنْ لاَ يُنْكَحَ، وَإِنْ شَفَعَ أَنْ لاَ يُشَفَّعَ، وَإِنْ قَالَ أَنْ لاَ يُسْمَعَ لِقَوْلِهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا خَيْرٌ مِنْ مِلْءِ الأَرْضِ مِثْلَ هَذَا ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ الْفَقْرِ",
                "headingUrdu": "غریب ہونے کی فضیلت",
                "headingEnglish": "The superiority of being poor",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6185,
                "hadithNumber": "6448",
                "englishNarrator": "Narrated  Khabbab رضی اللہ عنہ :",
                "hadithEnglish": "\"We migrated with the Prophet (ﷺ) for Allah's Sake and our wages became due on Allah. Some of us died without having received anything of the wages, and one of them was Mus`ab bin `Umar رضی اللہ عنہ , who was martyred on the day of the battle of Uhud, leaving only one sheet (to shroud him in). If we covered his head with it, his feet became uncovered, and if we covered his feet with it, his head became uncovered. So the Prophet (ﷺ) ordered us to cover his head with it and put some Idhkhir (a kind of grass) over his feet. On the other hand, some of us have had the fruits (of our good deed) and are plucking them (in this world).",
                "hadithUrdu": "ہم نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ اللہ تعالیٰ کی رضا حاصل کرنے کے لئے ہجرت کی ۔ چنانچہ ہمارا اجر اللہ کے ذمہ رہا ۔ پس ہم میں سے کوئی تو گزر گیا اور اپنا اجر ( اس دنیا میں ) نہیں لیا ۔ حضرت مصعب بن عمیر رضی اللہ عنہ ( انہی ) میں سے تھے ، وہ جنگ احد کے موقع پر شہید ہو گئے تھے اور ایک چادر چھوڑی تھی ( اس چادرکا ان کو کفن دیا گیا تھا ) اس چادرسے ہم اگر ان کا سر ڈھکتے تو ان کے پاؤں کھل جاتے اور پاؤں ڈھکتے تو سر کھل جاتا ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے ہمیں حکم دیا کہ ہم ان کا سر ڈھک دیں اور پاؤں پر اذخر گھاس ڈال دیں اور کوئی ہم میں سے ایسے ہوئے جن کے پھل خوب پکے اور وہ مزے سے چن چن کر کھا رہے ہیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، کہا ہم سے اعمش نے ، کہا کہ میں نے ابووائل سے سنا ، کہا کہ ہم نے خباب بن ارت رضی اللہ عنہ سے سنا ، انہوں نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، قَالَ عُدْنَا خَبَّابًا فَقَالَ هَاجَرْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم نُرِيدُ وَجْهَ اللَّهِ، فَوَقَعَ أَجْرُنَا عَلَى اللَّهِ، فَمِنَّا مَنْ مَضَى لَمْ يَأْخُذْ مِنْ أَجْرِهِ، مِنْهُمْ مُصْعَبُ بْنُ عُمَيْرٍ قُتِلَ يَوْمَ أُحُدٍ، وَتَرَكَ نَمِرَةً فَإِذَا غَطَّيْنَا رَأْسَهُ بَدَتْ رِجْلاَهُ، وَإِذَا غَطَّيْنَا رِجْلَيْهِ بَدَا رَأْسُهُ، فَأَمَرَنَا النَّبِيُّ صلى الله عليه وسلم أَنْ نُغَطِّيَ رَأْسَهُ، وَنَجْعَلَ عَلَى رِجْلَيْهِ مِنَ الإِذْخِرِ، وَمِنَّا مَنْ أَيْنَعَتْ لَهُ ثَمَرَتُهُ فَهْوَ يَهْدُبُهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6186,
                "hadithNumber": "6449",
                "englishNarrator": "Narrated `Imran bin Husain رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I looked into Paradise and found that the majority of its dwellers were the poor people, and I looked into the (Hell) Fire and found that the majority of its dwellers were women.\"Ayyub and Auf have also reported it. Abu Raja has reported it from Hadrat Ibn-e-Abbas رضی اللہ عنہما .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں جنت میں جھانکا تو اس میں رہنے والے اکثر غریب لوگ تھے اور میں نے دوزخ میں جھانکا تو اس کی رہنے والیاں اکثر عورتیں تھیں ۔ ابورجاء کے ساتھ اس حدیث کو ایوب سختیانی اور عوف اعرابی نے بھی روایت کیا ہے اورصخر بن جویریہ اور حماد بن نجیح دونوں اس حدیث کو ابورجاء سے ، انہوں نے حضرت ابن عباس رضی اللہ عنہماسے روایت کیا ۔",
                "urduNarrator": "ہم سے ابو ولید نے بیان کیا ، کہا ہم سے سلم بن زریر نے بیان کیا ، کہا ہم سے ابو رجاء عمران بن تمیم نے بیان کیا ، ان سے عمران بن حصین رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا سَلْمُ بْنُ زَرِيرٍ، حَدَّثَنَا أَبُو رَجَاءٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ اطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ، وَاطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏‏.‏ تَابَعَهُ أَيُّوبُ وَعَوْفٌ، وَقَالَ صَخْرٌ وَحَمَّادُ بْنُ نَجِيحٍ عَنْ أَبِي رَجَاءٍ عَنِ ابْنِ عَبَّاسٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6187,
                "hadithNumber": "6450",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) did not eat at a table till he died, and he did not eat a thin nicely baked wheat bread till he died.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے کبھی میز پر کھانا نہیں کھایا ۔ یہاں تک کہ آپ صلی اللہ علیہ وسلم کی وفات ہو گئی اور نہ وفات تک آپ صلی اللہ علیہ وسلم نے کبھی باریک چپاتی تناول فرمائی ۔",
                "urduNarrator": "ہم سے ابو معمر عبداللہ بن محمد بن عمرو بن حجاج نے بیان کیا ، کہا ہم سے عبدالوارث بن سعید نے بیان کیا ، کہا ہم سے سعید بن ابی عروبہ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمْ يَأْكُلِ النَّبِيُّ صلى الله عليه وسلم عَلَى خِوَانٍ حَتَّى مَاتَ، وَمَا أَكَلَ خُبْزًا مُرَقَّقًا حَتَّى مَاتَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6188,
                "hadithNumber": "6451",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "When the Prophet (ﷺ) died, nothing which can be eaten by a living creature was left on my shelf except some barley grain. I ate of it for a period and when I measured it, it finished.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی وفات ہوئی تو میرے توشہ خانہ میں کوئی غلہ نہ تھا جو کسی جاندار کے کھانے کے قابل ہوتا ، سوا تھوڑے سے جو کے میرے توشہ خانہ میں تھے ، میں ان میں ہی سے کھاتی رہی آخر اکتا کر جب بہت دن ہو گئے تو میں نے انہیں ناپا تو وہ ختم ہو گئے ۔",
                "urduNarrator": "ہم سے ابوبکر عبداللہ بن ابی شیبہ نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَقَدْ تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم وَمَا فِي رَفِّي مِنْ شَىْءٍ يَأْكُلُهُ ذُو كَبِدٍ، إِلاَّ شَطْرُ شَعِيرٍ فِي رَفٍّ لِي، فَأَكَلْتُ مِنْهُ حَتَّى طَالَ عَلَىَّ، فَكِلْتُهُ، فَفَنِيَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6189,
                "hadithNumber": "6452",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "By Allah except Whom none has the right to- be worshipped, (sometimes) I used to lay (sleep) on the ground on my liver (abdomen) because of hunger, and (sometimes) I used to bind a stone over my belly because of hunger. One day I sat by the way from where they (the Prophet (ﷺ) and his companions) used to come out. When Abu Bakr رضی اللہ عنہ passed by, I asked him about a Verse from Allah's Book and I asked him only that he might satisfy my hunger, but he passed by and did not do so. Then `Umar رضی اللہ عنہ passed by me and I asked him about a Verse from Allah's Book, and I asked him only that he might satisfy my hunger, but he passed by without doing so. Finally Abu-l-Qasim (the Prophet (ﷺ) ) passed by me and he smiled when he saw me, for he knew what was in my heart and on my face. He said, \"O Aba Hirr (Abu Huraira)!\" I replied, \"Labbaik, O Allah's Messenger (ﷺ)!\" He said to me, \"Follow me.\" He left and I followed him. Then he entered the house and I asked permission to enter and was admitted. He found milk in a bowl and said, \"From where is this milk?\" They said, \"It has been presented to you by such-and-such man (or by such and such woman).\" He said, \"O Aba Hirr!\" I said, \"Labbaik, O Allah's Messenger (ﷺ)!\" He said, \"Go and call the people of Suffa to me.\" These people of Suffa were the guests of Islam who had no families, nor money, nor anybody to depend upon, and whenever an object of charity was brought to the Prophet, he would send it to them and would not take anything from it, and whenever any present was given to him, he used to send some for them and take some of it for himself. The order of the Prophet upset me, and I said to myself, \"How will this little milk be enough for the people of As- Suffa? though I was more entitled to drink from that milk in order to strengthen myself\", but behold! The Prophet (ﷺ) came to order me to give that milk to them. I wondered what will remain of that milk for me, but anyway, I could not but obey Allah and His Apostle so I went to the people of As-Suffa and called them, and they came and asked the Prophet's permission to enter. They were admitted and took their seats in the house. The Prophet (ﷺ) said, \"O Aba-Hirr!\" I said, \"Labbaik, O Allah's Messenger (ﷺ)!\" He said, \"Take it and give it to them.\" So I took the bowl (of milk) and started giving it to one man who would drink his fill and return it to me, whereupon I would give it to another man who, in his turn, would drink his fill and return it to me, and I would then offer it to another man who would drink his fill and return it to me. Finally, after the whole group had drunk their fill, I reached the Prophet (ﷺ) who took the bowl and put it on his hand, looked at me and smiled and said. \"O Aba Hirr!\" I replied, \"Labbaik, O Allah's Messenger (ﷺ)!\" He said, \"There remain you and I.\" I said, \"You have said the truth, O Allah's Messenger (ﷺ)!\" He said, \"Sit down and drink.\" I sat down and drank. He said, \"Drink,\" and I drank. He kept on telling me repeatedly to drink, till I said, \"No. by Allah Who sent you with the Truth, I have no space for it (in my stomach).\" He said, \"Hand it over to me.\" When I gave him the bowl, he praised Allah and pronounced Allah's Name on it and drank the remaining milk.",
                "hadithUrdu": "” اللہ کی قسم جس کے سوا کوئی معبود نہیں میں ( زمانہ نبوی میں ) بھوک کے مارے زمین پر اپنے پیٹ کے بل لیٹ جاتا تھا اور کبھی میں بھوک کے مارے اپنے پیٹ پر پتھر باندھا کرتا تھا ۔ ایک دن میں اس راستے پر بیٹھ گیا جس سے صحابہ نکلتے تھے ۔ حضرت ابوبکر صدیق رضی اللہ عنہ گزر ے اور میں نے ان سے کتاب اللہ کی ایک آیت کے بارے میں پوچھا ، میرے پوچھنے کا مقصد صرف یہ تھا کہ وہ مجھے کچھ کھلا دیں مگر وہ چلے گئے اور کچھ نہیں کیا ۔ پھر حضرت عمر رضی اللہ عنہ میرے پاس سے گزرے ، میں نے ان سے بھی قرآن مجید کی ایک آیت پوچھی اور پوچھنے کا مقصد صرف یہ تھا کہ وہ مجھے کچھ کھلا دیں مگر وہ بھی گزر گئے اور کچھ نہیں کیا ۔ اس کے بعد حضور اکرم صلی اللہ علیہ وسلم گزرے اور آپ نے جب مجھے دیکھا تو آپ مسکرا دئیے اور آپ میرے دل کی بات سمجھ گئے اور میرے چہرے کو آپ نے تاڑلیا ۔ پھر آپ نے فرمایا اباہر ! میں نے عرض کیا لبیک ، یا رسول اللہ ! فرمایا میرے ساتھ آ جاؤ اور آپ چلنے لگے ۔ میں آنحضرت صلی اللہ علیہ وسلم کے پیچھے چل دیا ۔ پھر آنحضرت صلی اللہ علیہ وسلم اندر گھر میں تشریف لے گئے ۔ پھر میں نے اجازت چاہی اور مجھے اجازت ملی ۔ جب آپ داخل ہوئے تو ایک پیالے دودھ ملا ۔ دریافت فرمایا کہ یہ دودھ کہاں سے آیا ہے ؟ کہا فلاں یا فلانی نے آنحضرت صلی اللہ علیہ وسلم کے لئے تحفہ میں بھیجا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اباہر ! میں نے عرض کیا لبیک ، یا رسول اللہ ! فرمایا ، اہل صفہ کے پاس جاؤ اور انہیں بھی میرے پاس بلا لاؤ ۔ کہا کہ اہل صفہ اسلام کے مہمان ہیں ، وہ نہ کسی کے گھر پناہ ڈھونڈھتے ، نہ کسی کے مال میں اور نہ کسی کے پاس ! جب آنحضرت صلی اللہ علیہ وسلم کے پاس صدقہ آتا تو اسے آنحضرت صلی اللہ علیہ وسلم انہیں کے پاس بھیج دیتے اور خود اس میں سے کچھ نہ رکھتے ۔ البتہ جب آپ کے پاس تحفہ آتا تو انہیں بلا بھیجتے اور خود بھی اس میں سے کچھ کھاتے اور انہیں بھی شریک کرتے ۔ چنانچہ مجھے یہ بات ناگوار گزری اور میں نے سوچا کہ یہ دودھ ہے ہی کتنا کہ سارے صفہ والوں میں تقسیم ہو ، اس کا حقدار میں تھا کہ اسے پی کر کچھ قوت حاصل کرتا ۔ جب صفہ والے آئیں گے تو آنحضرت صلی اللہ علیہ وسلم مجھ سے فرمائیں گے اور میں انہیں اسے دے دوں گا ۔ مجھے تو شاید اس دودھ میں سے کچھ بھی نہیں ملے گا لیکن اللہ اور اس کے رسول کی حکم برداری کے سوا کوئی اور چارہ بھی نہیں تھا ۔ چنانچہ میں ان کے پاس آیا اور آنحضرت صلی اللہ علیہ وسلم کی دعوت پہنچائی ، وہ آ گئے اور اجازت چاہی ۔ انہیں اجازت مل گئی پھر وہ گھر میں اپنی اپنی جگہ بیٹھ گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا : اباہر ! میں نے عرض کیا لبیک ، یا رسول اللہ ! فرمایا لواور اسے ان سب حاضرین کو دے دو ۔ بیان کیا کہ پھر میں نے پیالہ پکڑ لیا اور ایک ایک کو دینے لگا ۔ ایک شخص دودھ پی کر جب سیراب ہو جاتا تو مجھے پیالہ واپس کر دیتا پھر دوسرے شخص کو دیتا وہ بھی سیراب ہو کر پیتا پھر پیالہ مجھ کو واپس کر دیتا اور اسی طرح تیسرا پی کر پھر مجھے پیالہ واپس کر دیتا ۔ اس طرح میں نبی کریم صلی اللہ علیہ وسلم تک پہنچا لوگ پی کر سیراب ہو چکے تھے ۔ آخر میں آنحضرت صلی اللہ علیہ وسلم نے پیالہ پکڑا اور اپنے ہاتھ پر رکھ کر آپ صلی اللہ علیہ وسلم نے میری طرف دیکھا اورمسکرا کر فرمایا ، اباہر ! میں نے عرض کیا ، لبیک ، یا رسول اللہ ! فرمایا ، اب میں اور تم باقی رہ گئے ہیں ، میں نے عرض کیا یا رسول اللہ ! آپ نے سچ فرمایا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا بیٹھ جاؤ اور پیو ۔ میں بیٹھ گیا اور میں نے دودھ پیا اور آنحضرت صلی اللہ علیہ وسلم برابر فرماتے رہے کہ اور پیو آخر مجھے کہنا پڑا ، نہیں اس ذات کی قسم جس نے آپ کو حق کے ساتھ بھیجا ہے ، اب بالکل گنجائش نہیں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر مجھے دے دو ، میں نے پیالہ آنحضرت صلہی اللہ علیہ وسلم کو دے دیا آپ صلی اللہ علیہ وسلم نے اللہ کی حمد بیان کی اور بسم اللہ پڑھ کر بچا ہوا خود پی گئے ۔",
                "urduNarrator": "مجھ سے ابونعیم نے یہ حدیث آدھی کے قریب بیان کی اور آدھی دوسرے شخص نے ، کہا ہم سے عمر بن ذرنے بیان کیا ، کہا ہم سے مجاہد نے بیان کیا کہ حضرت ابوہریرہ رضی اللہ عنہ کہا کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو نُعَيْمٍ، بِنَحْوٍ مِنْ نِصْفِ هَذَا الْحَدِيثِ حَدَّثَنَا عُمَرُ بْنُ ذَرٍّ، حَدَّثَنَا مُجَاهِدٌ، أَنَّ أَبَا هُرَيْرَةَ، كَانَ يَقُولُ آللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ إِنْ كُنْتُ لأَعْتَمِدُ بِكَبِدِي عَلَى الأَرْضِ مِنَ الْجُوعِ، وَإِنْ كُنْتُ لأَشُدُّ الْحَجَرَ عَلَى بَطْنِي مِنَ الْجُوعِ، وَلَقَدْ قَعَدْتُ يَوْمًا عَلَى طَرِيقِهِمُ الَّذِي يَخْرُجُونَ مِنْهُ، فَمَرَّ أَبُو بَكْرٍ، فَسَأَلْتُهُ عَنْ آيَةٍ مِنْ كِتَابِ اللَّهِ، مَا سَأَلْتُهُ إِلاَّ لِيُشْبِعَنِي، فَمَرَّ وَلَمْ يَفْعَلْ، ثُمَّ مَرَّ بِي عُمَرُ فَسَأَلْتُهُ عَنْ آيَةٍ مِنْ كِتَابِ اللَّهِ، مَا سَأَلْتُهُ إِلاَّ لِيُشْبِعَنِي، فَمَرَّ فَلَمْ يَفْعَلْ، ثُمَّ مَرَّ بِي أَبُو الْقَاسِمِ صلى الله عليه وسلم فَتَبَسَّمَ حِينَ رَآنِي وَعَرَفَ، مَا فِي نَفْسِي وَمَا فِي وَجْهِي ثُمَّ قَالَ ‏\"‏ أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ الْحَقْ ‏\"‏‏.‏ وَمَضَى فَتَبِعْتُهُ، فَدَخَلَ فَاسْتَأْذَنَ، فَأَذِنَ لِي، فَدَخَلَ فَوَجَدَ لَبَنًا فِي قَدَحٍ فَقَالَ ‏\"‏ مِنْ أَيْنَ هَذَا اللَّبَنُ ‏\"‏‏.‏ قَالُوا أَهْدَاهُ لَكَ فُلاَنٌ أَوْ فُلاَنَةُ‏.‏ قَالَ ‏\"‏ أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ الْحَقْ إِلَى أَهْلِ الصُّفَّةِ فَادْعُهُمْ لِي ‏\"‏‏.‏ قَالَ وَأَهْلُ الصُّفَّةِ أَضْيَافُ الإِسْلاَمِ، لاَ يَأْوُونَ إِلَى أَهْلٍ وَلاَ مَالٍ، وَلاَ عَلَى أَحَدٍ، إِذَا أَتَتْهُ صَدَقَةٌ بَعَثَ بِهَا إِلَيْهِمْ، وَلَمْ يَتَنَاوَلْ مِنْهَا شَيْئًا، وَإِذَا أَتَتْهُ هَدِيَّةٌ أَرْسَلَ إِلَيْهِمْ، وَأَصَابَ مِنْهَا وَأَشْرَكَهُمْ فِيهَا، فَسَاءَنِي ذَلِكَ فَقُلْتُ وَمَا هَذَا اللَّبَنُ فِي أَهْلِ الصُّفَّةِ كُنْتُ أَحَقُّ أَنَا أَنْ أُصِيبَ مِنْ هَذَا اللَّبَنِ شَرْبَةً أَتَقَوَّى بِهَا، فَإِذَا جَاءَ أَمَرَنِي فَكُنْتُ أَنَا أُعْطِيهِمْ، وَمَا عَسَى أَنْ يَبْلُغَنِي مِنْ هَذَا اللَّبَنِ، وَلَمْ يَكُنْ مِنْ طَاعَةِ اللَّهِ وَطَاعَةِ رَسُولِهِ صلى الله عليه وسلم بُدٌّ، فَأَتَيْتُهُمْ فَدَعَوْتُهُمْ فَأَقْبَلُوا، فَاسْتَأْذَنُوا فَأَذِنَ لَهُمْ، وَأَخَذُوا مَجَالِسَهُمْ مِنَ الْبَيْتِ قَالَ ‏\"‏ يَا أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ خُذْ فَأَعْطِهِمْ ‏\"‏‏.‏ قَالَ فَأَخَذْتُ الْقَدَحَ فَجَعَلْتُ أُعْطِيهِ الرَّجُلَ فَيَشْرَبُ حَتَّى يَرْوَى، ثُمَّ يَرُدُّ عَلَىَّ الْقَدَحَ، فَأُعْطِيهِ الرَّجُلَ فَيَشْرَبُ حَتَّى يَرْوَى، ثُمَّ يَرُدُّ عَلَىَّ الْقَدَحَ فَيَشْرَبُ حَتَّى يَرْوَى، ثُمَّ يَرُدُّ عَلَىَّ الْقَدَحَ، حَتَّى انْتَهَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَقَدْ رَوِيَ الْقَوْمُ كُلُّهُمْ، فَأَخَذَ الْقَدَحَ فَوَضَعَهُ عَلَى يَدِهِ فَنَظَرَ إِلَىَّ فَتَبَسَّمَ فَقَالَ ‏\"‏ أَبَا هِرٍّ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ بَقِيتُ أَنَا وَأَنْتَ ‏\"‏‏.‏ قُلْتُ صَدَقْتَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ اقْعُدْ فَاشْرَبْ ‏\"‏‏.‏ فَقَعَدْتُ فَشَرِبْتُ‏.‏ فَقَالَ ‏\"‏ اشْرَبْ ‏\"‏‏.‏ فَشَرِبْتُ، فَمَا زَالَ يَقُولُ ‏\"‏ اشْرَبْ ‏\"‏‏.‏ حَتَّى قُلْتُ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ، مَا أَجِدُ لَهُ مَسْلَكًا‏.‏ قَالَ ‏\"‏ فَأَرِنِي ‏\"‏‏.‏ فَأَعْطَيْتُهُ الْقَدَحَ فَحَمِدَ اللَّهَ وَسَمَّى، وَشَرِبَ الْفَضْلَةَ‏.‏",
                "headingArabic": "كَيْفَ كَانَ عَيْشُ النَّبِيِّ صلى الله عليه وسلم وَأَصْحَابِهِ، وَتَخَلِّيهِمْ مِنَ الدُّنْيَا",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم اور صحابہ کرام رضی اللہ عنہم کس طرح زندگی گزارتے تھے۔",
                "headingEnglish": "How the Prophet (saws) and his Companions used to live",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6190,
                "hadithNumber": "6453",
                "englishNarrator": "Narrated Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "I was the first man among the Arabs to throw an arrow for Allah's Cause. We used to fight in Allah's Cause while we had nothing to eat except the leaves of the Hubla and the Sumur trees (desert trees) so that we discharged excrement like that of sheep (i.e. unmixed droppings). Today the (people of the) tribe of Bani Asad teach me the laws of Islam. If so, then I am lost, and all my efforts of that hard time had gone in vain.",
                "hadithUrdu": "میں سب سے پہلا عرب ہوں جس نے اللہ کے راستے میں تیر چلائے ۔ ہم نے اس حال میں وقت گزارا ہے کہ جہاد کر رہے ہیں اور ہمارے پاس کھانے کی کوئی چیز حبلہ کے پتوں اور اس ببول کے سوا کھانے کے لئے نہیں تھی اور بکری کی مینگنیوں کی طرح ہم پاخانہ کیا کرتے تھے ۔ اب یہ بنو اسد کے لوگ مجھ کو اسلام سکھلا کر درست کرنا چاہتے ہیں پھر تو میں بالکل بدنصیب ٹھہرا اور میرا سارا کیا کرایا اکارت گیا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے اسماعیل بن ابی خالد نے ، ان سے قیس نے بیان کیا ، کہا کہ میں نے سعد بن ابی وقاص رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، حَدَّثَنَا قَيْسٌ، قَالَ سَمِعْتُ سَعْدًا، يَقُولُ إِنِّي لأَوَّلُ الْعَرَبِ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ، وَرَأَيْتُنَا نَغْزُو، وَمَا لَنَا طَعَامٌ إِلاَّ وَرَقُ الْحُبْلَةِ وَهَذَا السَّمُرُ، وَإِنَّ أَحَدَنَا لَيَضَعُ كَمَا تَضَعُ الشَّاةُ، مَا لَهُ خِلْطٌ، ثُمَّ أَصْبَحَتْ بَنُو أَسَدٍ تُعَزِّرُنِي عَلَى الإِسْلاَمِ، خِبْتُ إِذًا وَضَلَّ سَعْيِي‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6191,
                "hadithNumber": "6454",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The family of Muhammad had never eaten their fill of wheat bread for three successive days since they had migrated to Medina till the death of the Prophet.",
                "hadithUrdu": "محمد صلی اللہ علیہ وسلم کے گھر والوں کو مدینہ آنے کے بعد کبھی تین دن تک برابر گیہوں کی روٹی کھانے کے لئے نہیں ملی ، یہاں تک کی آنحضرت صلی اللہ علیہ وسلم کی رو ح قبض ہو گئی ۔",
                "urduNarrator": "مجھ سے عثمان بن ابی شیبہ نے بیان کیا ، کہامجھ سے جریر بن عبدالحمید نے ، ان سے منصور نے ، ان سے ابراہیم نے ، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنِي عُثْمَانُ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ مَا شَبِعَ آلُ مُحَمَّدٍ صلى الله عليه وسلم مُنْذُ قَدِمَ الْمَدِينَةَ مِنْ طَعَامِ بُرٍّ ثَلاَثَ لَيَالٍ تِبَاعًا حَتَّى قُبِضَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6192,
                "hadithNumber": "6455",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The family of Muhammad did not eat two meals on one day, but one of the two was of dates.",
                "hadithUrdu": "حضرت نبی کریم صلی اللہ علیہ وسلم کے گھرانہ نے اگر کبھی ایک دن میں دو مرتبہ کھا نا کھایا تو ضرور اس میں ایک وقت صرف کھجوریں ہوتی تھیں ۔",
                "urduNarrator": "مجھ سے اسحاق بن ابراہیم بن عبدالرحمٰن بغوی نے بیان کیا ، کہا ہم سے اسحاق ازرق نے بیان کیا ، ان سے مسعر بن کدام نے ، ان سے ہلال نے ، ان سے عروہ بن زبیر نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا إِسْحَاقُ ـ هُوَ الأَزْرَقُ ـ عَنْ مِسْعَرِ بْنِ كِدَامٍ، عَنْ هِلاَلٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا أَكَلَ آلُ مُحَمَّدٍ صلى الله عليه وسلم أَكْلَتَيْنِ فِي يَوْمٍ، إِلاَّ إِحْدَاهُمَا تَمْرٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6193,
                "hadithNumber": "6456",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The bed mattress of the Prophet (ﷺ) was made of a leather case stuffed with palm fibres.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کا بستر چمڑے کا تھا اور اس میں کھجور کی چھال بھری ہوئی تھی ۔",
                "urduNarrator": "مجھ سے احمد بن رجاء نے بیان کیا ، کہا ہم سے نضر نے بیان کیا ، ان سے ہشام بن عروہ نے کہا کہ مجھے میرے والد نے خبر دی اور ان سے عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا النَّضْرُ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، قَالَتْ كَانَ فِرَاشُ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ أَدَمٍ، وَحَشْوُهُ مِنْ لِيفٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6194,
                "hadithNumber": "6457",
                "englishNarrator": "Narrated Qatada:",
                "hadithEnglish": "We used to go to Anas bin Malik رضی اللہ عنہ and see his baker standing (preparing the bread). Anas رضی اللہ عنہ said, \"Eat. I have not known that the Prophet (ﷺ) ever saw a thin well-baked loaf of bread till he died, and he never saw a roasted sheep with his eyes.\"",
                "hadithUrdu": "ہم انس بن مالک رضی اللہ عنہ کی خدمت میں حاضر ہوتے ، ان کا نان بائی وہیں موجو د ہوتا ( جو روٹیاں پکا پکا کر دیتا جاتا ) حضرت انس رضی اللہ عنہ لوگو ں سے کہتے کہ کھاؤ ، میں نے کبھی نبی کریم صلی اللہ علیہ وسلم کو پتلی روٹی کھاتے نہیں دیکھا اور نہ آنحضرت صلی اللہ علیہ وسلم نے کبھی اپنی آنکھ سے سموچی بھنی ہوئی بکری دیکھی ۔ یہاں تک کہ آپ کا انتقال ہو گیا ( صلی اللہ علیہ وسلم ) الف الف مرۃ بعد دکل ذرۃ ۔",
                "urduNarrator": "ہم سے ہدبہ بن خالد نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، کہاکہ",
                "hadithArabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، حَدَّثَنَا قَتَادَةُ، قَالَ كُنَّا نَأْتِي أَنَسَ بْنَ مَالِكٍ وَخَبَّازُهُ قَائِمٌ وَقَالَ كُلُوا فَمَا أَعْلَمُ النَّبِيَّ صلى الله عليه وسلم رَأَى رَغِيفًا مُرَقَّقًا، حَتَّى لَحِقَ بِاللَّهِ، وَلاَ رَأَى شَاةً سَمِيطًا بِعَيْنِهِ قَطُّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6195,
                "hadithNumber": "6458",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "A complete month would pass by during which we would not make a fire (for cooking), and our food used to be only dates and water unless we were given a present of some meat.",
                "hadithUrdu": "ہمارے اوپر ایسا مہینہ بھی گزر جاتا تھا کہ چولھا نہیں جلتا تھا ۔ صرف کھجور اور پانی ہوتا تھا ۔ ہاں اگر کبھی کسی جگہ سے کچھ تھوڑا سا گوشت آ جا تا ۔ تو اس کو بھی کھا لیتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، کہامجھ کو میرے والد نے خبر دی اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ يَأْتِي عَلَيْنَا الشَّهْرُ مَا نُوقِدُ فِيهِ نَارًا، إِنَّمَا هُوَ التَّمْرُ وَالْمَاءُ، إِلاَّ أَنْ نُؤْتَى بِاللُّحَيْمِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6196,
                "hadithNumber": "6459",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "She said to `Urwa, \"O, the son of my sister! We used to see three crescents in two months, and no fire used to be made in the houses of Allah's Messenger (ﷺ) (i.e. nothing used to be cooked).\" `Urwa said, \"What used to sustain you?\" `Aisha رضی اللہ عنہا said, \"The two black things i.e. dates and water, except that Allah's Messenger (ﷺ) had neighbors from the Ansar who had some milch she-camels, and they used to give the Prophet (ﷺ) some milk from their house, and he used to make us drink it.\"",
                "hadithUrdu": "انہوں نے عروہ سے کہا ، بیٹے ! ہم دومہینو ں میں تین چاند دیکھ لیتے ہیں اور رسول اللہ صلی اللہ علیہ وسلم ( کی بیویوں ) کے گھروں میں چولھا نہیں جلتا تھا ۔ میں نے پوچھا پھر آپ لوگ زندہ کس چیز پر رہتی تھیں ؟ بتلا یا کہ صرف دو کالی چیزوں پر ، کھجور اور پانی ۔ ہاں ، آنحضرت صلی اللہ علیہ وسلم کے کچھ انصاری پڑوسی تھے جن کے یہاں دوہیل اونٹنیاں تھیں وہ اپنے گھروں سے آنحضرت صلی اللہ علیہ وسلم کے لئے دودھ بھیج دیتے اور آپ ہمیں وہی دودھ پلا دیتے تھے ۔",
                "urduNarrator": "ہم سے عبد العزیز بن عبداللہ اویسی نے بیان کیا ، انہوں نے کہا ہم سے ابن ابی حازم نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، ان سے یزید بن رومان نے بیان کیا ، ان سے عروہ بن زبیر نے اور ان سے ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے بیان کیا ،",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الأُوَيْسِيُّ، حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ لِعُرْوَةَ ابْنَ أُخْتِي إِنْ كُنَّا لَنَنْظُرُ إِلَى الْهِلاَلِ ثَلاَثَةَ أَهِلَّةٍ فِي شَهْرَيْنِ، وَمَا أُوقِدَتْ فِي أَبْيَاتِ رَسُولِ اللَّهِ صلى الله عليه وسلم نَارٌ‏.‏ فَقُلْتُ مَا كَانَ يُعِيشُكُمْ قَالَتِ الأَسْوَدَانِ التَّمْرُ وَالْمَاءُ إِلاَّ أَنَّهُ قَدْ كَانَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم جِيرَانٌ مِنَ الأَنْصَارِ كَانَ لَهُمْ مَنَائِحُ، وَكَانُوا يَمْنَحُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْ أَبْيَاتِهِمْ، فَيَسْقِينَاهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6197,
                "hadithNumber": "6460",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"O Allah! Give food to the family of Muhammad.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے دعا کی ۔ ” اے اللہ ! آل محمد کو اتنی روزی دے کہ وہ زندہ رہ سکیں “ ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا ہم سے محمد بن فضیل نے بیان کیا ، ان سے ان کے والد نے ، ا ن سے عمارہ نے ، ان سے ابوزرعہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اللَّهُمَّ ارْزُقْ آلَ مُحَمَّدٍ قُوتًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6198,
                "hadithNumber": "6461",
                "englishNarrator": "Narrated Masruq:",
                "hadithEnglish": "I asked `Aisha ہ رضی اللہ عنہا \"What deed was the most beloved to the Prophet?\" She said, \"The regular constant one.\" I said, \"At what time did he use to get up at night (for the Tahajjud night prayer)?' She said, \"He used to get up on hearing (the crowing of) the cock (the last third of the night).",
                "hadithUrdu": "میں نے عائشہ رضی اللہ عنہا سے پوچھا ، کون سی عبادت نبی کریم صلی اللہ علیہ وسلم کو زیادہ پسند تھی ۔ فرمایا کہ جس پر ہمیشگی ہو سکے ۔ کہا کہ میں نے پوچھا آپ رات کو تہجد کے لئے کب اٹھتے تھے ؟ بتلایا کہ جب مرغ کی آواز سن لیتے ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، کہا ہم سے ہمارے والد عثمان بن حبلہ نے خبر دی ، انہیں شعبہ نے ، ان سے اشعث نے بیان کیا کہ میں نے اپنے والد ابوالشعثاء سلیم بن اسود سے سنا ، انہوں نے بیان کیا کہ میں نے مسروق سے سنا ، کہاکہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا أَبِي، عَنْ شُعْبَةَ، عَنْ أَشْعَثَ، قَالَ سَمِعْتُ أَبِي قَالَ، سَمِعْتُ مَسْرُوقًا، قَالَ سَأَلْتُ عَائِشَةَ ـ رضى الله عنها ـ أَىُّ الْعَمَلِ كَانَ أَحَبَّ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَتِ الدَّائِمُ‏.‏ قَالَ قُلْتُ فَأَىَّ حِينٍ كَانَ يَقُومُ قَالَتْ كَانَ يَقُومُ إِذَا سَمِعَ الصَّارِخَ‏.‏",
                "headingArabic": "الْقَصْدِ وَالْمُدَاوَمَةِ عَلَى الْعَمَلِ",
                "headingUrdu": "درمیانی راستہ اختیار کرنا، اور اعمال کی پابندی",
                "headingEnglish": "The adoption of a middle course, and the regularity of deeds",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6199,
                "hadithNumber": "6462",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The most beloved action to Allah's Messenger (ﷺ) was that whose doer did it continuously and regularly.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کو سب سے زیادہ پسندیدہ وہ عمل تھا جس کو آدمی ہمیشہ کرتا رہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، ان سے امام مالک نے ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ كَانَ أَحَبُّ الْعَمَلِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الَّذِي يَدُومُ عَلَيْهِ صَاحِبُهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6200,
                "hadithNumber": "6463",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The deeds of anyone of you will not save you (from the (Hell) Fire).\" They said, \"Even you (will not be saved by your deeds), O Allah's Messenger (ﷺ)?\" He said, \"No, even I (will not be saved) unless and until Allah bestows His Mercy on me. Therefore, do good deeds properly, sincerely and moderately, and worship Allah in the forenoon and in the afternoon and during a part of the night, and always adopt a middle, moderate, regular course whereby you will reach your target (Paradise).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تم سے کسی شخص کو اس کا عمل نجات نہیں دلا سکے گا ۔ صحابہ نے عرض کی اور آپ کو بھی نہیں یا رسول اللہ ؟ فرمایا اور مجھے بھی نہیں ، سوا اس کے کہ اللہ تعالیٰ مجھے اپنی رحمت کے سایہ میں لے لے ۔ پس تم کو چاہئے کہ درستی کے ساتھ عمل کرو اور میانہ روی اختیار کرو ۔ صبح اورشام ، اسی طرح رات کو ذرا سا چل لیا کرو اور اعتدال کے ساتھ چلا کرو منزل مقصود کو پہنچ جاؤ گے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے ابن ابی ذئب نے بیان کیا ، ان سے سعید مقبری نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَنْ يُنَجِّيَ أَحَدًا مِنْكُمْ عَمَلُهُ ‏\"‏‏.‏ قَالُوا وَلاَ أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَلاَ أَنَا، إِلاَّ أَنْ يَتَغَمَّدَنِي اللَّهُ بِرَحْمَةٍ، سَدِّدُوا وَقَارِبُوا، وَاغْدُوا وَرُوحُوا، وَشَىْءٌ مِنَ الدُّلْجَةِ‏.‏ وَالْقَصْدَ الْقَصْدَ تَبْلُغُوا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6201,
                "hadithNumber": "6464",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Do good deeds properly, sincerely and moderately and know that your deeds will not make you enter Paradise, and that the most beloved deed to Allah is the most regular and constant even if it were little.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا درمیانی چال اختیار کرو اور بلند پروازی نہ کرو اور عمل کرتے رہو ، تم میں سے کسی کا عمل اسے جنت میں نہیں داخل کر سکے گا ، میرے نزدیک سب سے پسندیدہ عمل وہ ہے جس پر ہمیشگی کی جائے ۔ خواہ کم ہی کیوں نہ ہو ۔",
                "urduNarrator": "ہم سے عبد العزیز بن عبداللہ نے بیان کیا ، کہا ہم سے سلیمان نے بیان کیا ، ان سے موسیٰ بن عقبہ نے ، ان سے ابوسلمہ بن عبدالرحمٰن نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ سَدِّدُوا وَقَارِبُوا، وَاعْلَمُوا أَنْ لَنْ يُدْخِلَ أَحَدَكُمْ عَمَلُهُ الْجَنَّةَ، وَأَنَّ أَحَبَّ الأَعْمَالِ أَدْوَمُهَا إِلَى اللَّهِ، وَإِنْ قَلَّ ‏\"‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6202,
                "hadithNumber": "6465",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) was asked, \"What deeds are loved most by Allah?\" He said, \"The most regular constant deeds even though they may be few.\" He added, 'Don't take upon yourselves, except the deeds which are within your ability.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سے پوچھا گیا کون سا عمل اللہ کے نزدیک زیادہ پسندیدہ ہے ؟ فرمایا جس پر ہمیشگی کی جائے ، خواہ وہ تھوڑی ہی ہو اور فرمایا نیک کام کرنے میں اتنی ہی تکلیف اٹھاؤ جتنی طاقت ہے ( جو ہمیشہ نبھ سکے ) ۔",
                "urduNarrator": "مجھ سے محمد بن عرعرہ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے سعد بن ابراہیم نے ، ان سے ابوسلمہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ سُئِلَ النَّبِيُّ صلى الله عليه وسلم أَىُّ الأَعْمَالِ أَحَبُّ إِلَى اللَّهِ قَالَ ‏\"‏ أَدْوَمُهَا وَإِنْ قَلَّ ‏\"‏‏.‏ وَقَالَ ‏\"‏ اكْلَفُوا مِنَ الأَعْمَالِ مَا تُطِيقُونَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 6176,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=247",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=245",
                "label": "245",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=246",
                "label": "246",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=247",
                "label": "247",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=248",
                "label": "248",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=249",
                "label": "249",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=250",
                "label": "250",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=251",
                "label": "251",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=249",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=249",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=247",
        "to": 6200,
        "total": 40465
    }
}