{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 18,
        "data": [
            {
                "id": 426,
                "hadithNumber": "433",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Do not enter (the places) of these people where Allah's punishment had fallen unless you do so weeping. If you do not weep, do not enter (the places of these people) because Allah's curse and punishment which fell upon them may fall upon you.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، ان عذاب والوں کے آ ثار سے اگر تمہارا گزر ہو تو روتے ہوئے گزرو ، اگر تم اس موقع پر رو نہ سکو تو ان سے گزرو ہی نہیں ۔ ایسا نہ ہو کہ تم پر بھی ان کا سا عذاب آ جائے ۔",
                "urduNarrator": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، انھوں نے کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، انھوں نے عبداللہ بن دینار کے واسطہ سے بیان کیا ، انھوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَدْخُلُوا عَلَى هَؤُلاَءِ الْمُعَذَّبِينَ إِلاَّ أَنْ تَكُونُوا بَاكِينَ، فَإِنْ لَمْ تَكُونُوا بَاكِينَ فَلاَ تَدْخُلُوا عَلَيْهِمْ، لاَ يُصِيبُكُمْ مَا أَصَابَهُمْ ‏\"‏‏.‏",
                "headingArabic": "الصَّلاَةِ فِي مَوَاضِعِ الْخَسْفِ وَالْعَذَابِ",
                "headingUrdu": "(اس بارے میں کیا کہا جاتا ہے) ان جگہوں پر نماز پڑھنا جہاں زمین دھنس گئی تھی اور اللہ کا عذاب نازل ہوا تھا۔",
                "headingEnglish": "(What is said about) offering Salat (Prayer) at the places where the earth had sunk down and Allah's punishment had fallen",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 427,
                "hadithNumber": "434",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا  :",
                "hadithEnglish": "Um Salama رضی اللہ عنہا told Allah's Messenger (ﷺ) about a church which she had seen in Ethiopia and which was called Mariya. She told him about the pictures which she had seen in it. Allah's Messenger (ﷺ) said, \"If any righteous pious man dies amongst them, they would build a place of worship at his grave and make these pictures in it; they are the worst creatures in the sight of Allah.\"",
                "hadithUrdu": "حضرت ام سلمہ رضی اللہ عنہا نے آنحضرت صلی اللہ علیہ وسلم سے ایک گرجا کا ذکر کیا جس کو انھوں نے حبش کے ملک میں دیکھا اس کا نام ماریہ تھا ۔ اس میں جو مورتیں دیکھی تھیں وہ بیان کیں ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ یہ ایسے لوگ تھے کہ اگر ان میں کوئی نیک بندہ ( یا یہ فرمایا کہ ) نیک آدمی مر جاتا تو اس کی قبر پر مسجد بناتے اور اس میں یہ بت رکھتے ۔ یہ لوگ اللہ کے نزدیک ساری مخلوقات سے بدتر ہیں ۔",
                "urduNarrator": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، انھوں نے کہا ہم کو عبدہ بن سلیمان نے خبر دی ، انھوں نے ہشام بن عروہ سے ، انھوں نے اپنے باپ عروہ بن زبیر سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، قَالَ أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ أُمَّ سَلَمَةَ، ذَكَرَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم كَنِيسَةً رَأَتْهَا بِأَرْضِ الْحَبَشَةِ يُقَالُ لَهَا مَارِيَةُ، فَذَكَرَتْ لَهُ مَا رَأَتْ فِيهَا مِنَ الصُّوَرِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أُولَئِكَ قَوْمٌ إِذَا مَاتَ فِيهِمُ الْعَبْدُ الصَّالِحُ ـ أَوِ الرَّجُلُ الصَّالِحُ ـ بَنَوْا عَلَى قَبْرِهِ مَسْجِدًا، وَصَوَّرُوا فِيهِ تِلْكَ الصُّوَرَ، أُولَئِكَ شِرَارُ الْخَلْقِ عِنْدَ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": "الصَّلاَةِ فِي الْبِيعَةِ",
                "headingUrdu": "چرچ یا مندر وغیرہ میں نماز پڑھنا۔",
                "headingEnglish": "To offer As-Salat (the prayer) in a church or in a temple etc.",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 428,
                "hadithNumber": "435, 436",
                "englishNarrator": "Narrated `Aisha and `Abdullah bin `Abbas رضی اللہ عنہم :",
                "hadithEnglish": "When the last moment of the life of Allah's Messenger (ﷺ) came he started putting his 'Khamisa' on his face and when he felt hot and short of breath he took it off his face and said, \"May Allah curse the Jews and Christians for they built the places of worship at the graves of their Prophets.\" The Prophet (ﷺ) was warning (Muslims) of what those had done.",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم مرض الوفات میں مبتلا ہوئے تو آپ صلی اللہ علیہ وسلم اپنی چادر کو باربار چہرے پر ڈالتے ۔ جب کچھ افاقہ ہوتا تو اپنے مبارک چہرے سے چادر ہٹا دیتے ۔ آپ صلی اللہ علیہ وسلم نے اسی اضطراب و پریشانی کی حالت میں فرمایا ، یہود و نصاریٰ پر اللہ کی پھٹکار ہو کہ انھوں نے اپنے انبیاء کی قبروں کو مسجد بنا لیا ۔ آپ صلی اللہ علیہ وسلم یہ فرما کر امت کو ایسے کاموں سے ڈراتے تھے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، انھوں نے کہا ہم کو شعیب نے خبر دی زہری سے ، انھوں نے کہا کہ مجھے عبیداللہ بن عبداللہ بن عتبہ نے خبر دی کہ حضرت عائشہ اور حضرت عبداللہ بن عباس رضی اللہ عنہم نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ ، قَالَ : أَخْبَرَنَا شُعَيْبٌ ، عَنِ الزُّهْرِيِّ ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ ، أَنَّ عَائِشَةَ ، وَعَبْدَ اللَّهِ بْنَ عَبَّاسٍ ، قَالَا : لَمَّا نَزَلَ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَفِقَ يَطْرَحُ خَمِيصَةً لَهُ عَلَى وَجْهِهِ ، فَإِذَا اغْتَمَّ بِهَا كَشَفَهَا عَنْ وَجْهِهِ ، فَقَالَ : وَهُوَ كَذَلِكَ ، لَعْنَةُ اللَّهِ عَلَى الْيَهُودِ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ يُحَذِّرُ مَا صَنَعُوا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 429,
                "hadithNumber": "437",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"May Allah's curse be on the Jews for they built the places of worship at the graves of their Prophets.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، یہودیوں پر اللہ کی لعنت ہو انھوں نے اپنے انبیاء کی قبروں کو مساجد بنا لیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، انھوں نے مالک کے واسطے سے ، انھوں نے ابن شہاب سے ، انھوں نے سعید بن مسیب سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ قَاتَلَ اللَّهُ الْيَهُودَ اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 430,
                "hadithNumber": "438",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"I have been given five things which were not given to any amongst the Prophets before me. These are: \r\n1. Allah made me victorious by awe (by His frightening my enemies) for a distance of one month's journey. \r\n2. The earth has been made for me (and for my followers) a place for praying and a thing to perform Tayammum. Therefore my followers can pray wherever the time of a prayer is due. \r\n3. The booty has been made Halal (lawful) for me (and was not made so for anyone else). \r\n4. Every Prophet used to be sent to his nation exclusively but I have been sent to all mankind. \r\n5. I have been given the right of intercession (on the Day of Resurrection.)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ مجھے پانچ ایسی چیزیں عطا کی گئی ہیں جو مجھ سے پہلے انبیاء کو نہیں دی گئی تھیں ۔ \r\n( 1 ) ایک مہینے کی راہ سے میرا رعب ڈال کر میری مدد کی گئی ۔ \r\n( 2 ) میرے لیے تمام زمین میں نماز پڑھنے اور پاکی حاصل کرنے کی اجازت ہے ۔ اس لیے میری امت کے جس آدمی کی نماز کا وقت ( جہاں بھی ) آ جائے اسے ( وہیں ) نماز پڑھ لینی چاہیے ۔ \r\n( 3 ) میرے لیے مال غنیمت حلال کیا گیا ۔ \r\n( 4 ) پہلے انبیاء خاص اپنی قوموں کی ہدایت کے لیے بھیجے جاتے تھے ۔ لیکن مجھے دنیا کے تمام انسانوں کی ہدایت کے لیے بھیجا گیا ہے ۔ \r\n( 5 ) مجھے شفاعت عطا کی گئی ہے ۔",
                "urduNarrator": "ہم سے محمد بن سنان نے بیان کیا ، انھوں نے کہا ہم سے ہشیم نے بیان کیا ، انھوں نے کہا ہم سے ابوالحکم سیار نے بیان کیا ، انھوں نے کہا ہم سے یزید فقیر نے ، کہا ہم سے جابر بن عبداللہ رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ حَدَّثَنَا سَيَّارٌ ـ هُوَ أَبُو الْحَكَمِ ـ قَالَ حَدَّثَنَا يَزِيدُ الْفَقِيرُ، قَالَ حَدَّثَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أُعْطِيتُ خَمْسًا لَمْ يُعْطَهُنَّ أَحَدٌ مِنَ الأَنْبِيَاءِ قَبْلِي، نُصِرْتُ بِالرُّعْبِ مَسِيرَةَ شَهْرٍ، وَجُعِلَتْ لِيَ الأَرْضُ مَسْجِدًا وَطَهُورًا، وَأَيُّمَا رَجُلٍ مِنْ أُمَّتِي أَدْرَكَتْهُ الصَّلاَةُ فَلْيُصَلِّ، وَأُحِلَّتْ لِيَ الْغَنَائِمُ، وَكَانَ النَّبِيُّ يُبْعَثُ إِلَى قَوْمِهِ خَاصَّةً، وَبُعِثْتُ إِلَى النَّاسِ كَافَّةً، وَأُعْطِيتُ الشَّفَاعَةَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ جُعِلَتْ لِيَ الأَرْضُ مَسْجِدًا وَطَهُورًا ‏\"‏",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے کہ زمین کو میرے لیے مسجد (نماز پڑھنے کی جگہ) اور پاک کرنے والی چیز (تیمم کرنے کے لیے) بنایا گیا ہے۔",
                "headingEnglish": "The sayings of the Prophet (pbuh) \"The earth has been made for me a Masjid (place for praying) and a thing to purify (to perform Tayammum).\"",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 431,
                "hadithNumber": "439",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "There was a black slave girl belonging to an 'Arab tribe and they manumitted her but she remained with them. The slave girl said, \"Once one of their girls (of that tribe) came out wearing a red leather scarf decorated with precious stones. It fell from her or she placed it somewhere. A kite passed by that place, saw it Lying there and mistaking it for a piece of meat, flew away with it. Those people searched for it but they did not find it. So they accused me of stealing it and started searching me and even searched my private parts.\" The slave girl further said, \"By Allah! while I was standing (in that state) with those people, the same kite passed by them and dropped the red scarf and it fell amongst them. I told them, 'This is what you accused me of and I was innocent and now this is it.' \" `Aisha added: That slave girl came to Allah's Messenger (ﷺ) and embraced Islam. She had a tent or a small room with a low roof in the mosque. Whenever she called on me, she had a talk with me and whenever she sat with me, she would recite the following: \"The day of the scarf (band) was one of the wonders of our Lord, verily He rescued me from the disbelievers' town. `Aisha added: \"Once I asked her, 'What is the matter with you? Whenever you sit with me, you always recite these poetic verses.' On that she told me the whole story. \"",
                "hadithUrdu": "عرب کے کسی قبیلہ کی ایک کالی لونڈی تھی ۔ انھوں نے اسے آزاد کر دیا تھا اور وہ انہیں کے ساتھ رہتی تھی ۔ اس نے بیان کیا کہ ایک دفعہ ان کی ایک لڑکی ( جو دلہن تھی ) نہانے کو نکلی ، اس کا کمربند سرخ تسموں کا تھا اس نے وہ کمربند اتار کر رکھ دیا یا اس کے بدن سے گر گیا ۔ پھر اس طرف سے ایک چیل گزری جہاں کمربند پڑا تھا ۔ چیل اسے ( سرخ رنگ کی وجہ سے ) گوشت سمجھ کر جھپٹ لے گئی ۔ بعد میں قبیلہ والوں نے اسے بہت تلاش کیا ، لیکن کہیں نہ ملا ۔ ان لوگوں نے اس کی تہمت مجھ پر لگا دی اور میری تلاشی لینی شروع کر دی ، یہاں تک کہ انھوں نے اس کی شرمگاہ تک کی تلاشی لی ۔ اس نے بیان کیا کہ اللہ کی قسم میں ان کے ساتھ اسی حالت میں کھڑی تھی کہ وہی چیل آئی اور اس نے ان کا وہ کمربند گرا دیا ۔ وہ ان کے سامنے ہی گرا ۔ میں نے ( اسے دیکھ کر ) کہا یہی تو تھا جس کی تم مجھ پر تہمت لگاتے تھے ۔ تم لوگوں نے مجھ پر اس کا الزام لگایا تھا حالانکہ میں اس سے پاک تھی ۔ یہی تو ہے وہ کمربند ! اس ( لونڈی ) نے کہا کہ اس کے بعد میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور اسلام لائی ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ اس کے لیے مسجدنبوی میں ایک بڑا خیمہ لگا دیا گیا ۔ ( یا یہ کہا کہ ) چھوٹا سا خیمہ لگا دیا گیا ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ وہ لونڈی میرے پاس آتی اور مجھ سے باتیں کیا کرتی تھی ۔ جب بھی وہ میرے پاس آتی تو یہ ضرور کہتی کہ کمربند کا دن ہمارے رب کی عجیب نشانیوں میں سے ہے ۔ اسی نے مجھے کفر کے ملک سے نجات دی ۔ حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ میں نے اس سے کہا ، آخر بات کیا ہے ؟ جب بھی تم میرے پاس بیٹھتی ہو تو یہ بات ضرور کہتی ہو ۔ آپ نے بیان کیا کہ پھر اس نے مجھے یہ قصہ سنایا ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے ہشام کے واسطہ سے ، انھوں نے اپنے باپ سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ وَلِيدَةً، كَانَتْ سَوْدَاءَ لِحَىٍّ مِنَ الْعَرَبِ، فَأَعْتَقُوهَا، فَكَانَتْ مَعَهُمْ قَالَتْ فَخَرَجَتْ صَبِيَّةٌ لَهُمْ عَلَيْهَا وِشَاحٌ أَحْمَرُ مِنْ سُيُورٍ قَالَتْ فَوَضَعَتْهُ أَوْ وَقَعَ مِنْهَا، فَمَرَّتْ بِهِ حُدَيَّاةٌ وَهْوَ مُلْقًى، فَحَسِبَتْهُ لَحْمًا فَخَطَفَتْهُ قَالَتْ فَالْتَمَسُوهُ فَلَمْ يَجِدُوهُ قَالَتْ فَاتَّهَمُونِي بِهِ قَالَتْ فَطَفِقُوا يُفَتِّشُونَ حَتَّى فَتَّشُوا قُبُلَهَا قَالَتْ وَاللَّهِ إِنِّي لَقَائِمَةٌ مَعَهُمْ، إِذْ مَرَّتِ الْحُدَيَّاةُ فَأَلْقَتْهُ قَالَتْ فَوَقَعَ بَيْنَهُمْ قَالَتْ فَقُلْتُ هَذَا الَّذِي اتَّهَمْتُمُونِي بِهِ ـ زَعَمْتُمْ ـ وَأَنَا مِنْهُ بَرِيئَةٌ، وَهُوَ ذَا هُوَ قَالَتْ فَجَاءَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَسْلَمَتْ‏.‏ قَالَتْ عَائِشَةُ فَكَانَ لَهَا خِبَاءٌ فِي الْمَسْجِدِ أَوْ حِفْشٌ قَالَتْ فَكَانَتْ تَأْتِينِي فَتَحَدَّثُ عِنْدِي قَالَتْ فَلاَ تَجْلِسُ عِنْدِي مَجْلِسًا إِلاَّ قَالَتْ وَيَوْمَ الْوِشَاحِ مِنْ أَعَاجِيبِ رَبِّنَا أَلاَ إِنَّهُ مِنْ بَلْدَةِ الْكُفْرِ أَنْجَانِي قَالَتْ عَائِشَةُ فَقُلْتُ لَهَا مَا شَأْنُكِ لاَ تَقْعُدِينَ مَعِي مَقْعَدًا إِلاَّ قُلْتِ هَذَا قَالَتْ فَحَدَّثَتْنِي بِهَذَا الْحَدِيثِ‏.‏",
                "headingArabic": "نَوْمِ الْمَرْأَةِ فِي الْمَسْجِدِ",
                "headingUrdu": "عورت کا مسجد میں سونا (اور اس میں رہنا)",
                "headingEnglish": "Sleeping of a woman in the mosque (and residing in it)",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 432,
                "hadithNumber": "440",
                "englishNarrator": "Narrated Nafi `Abdullah bin `Umar رضی اللہ عنہما said:",
                "hadithEnglish": "I used to sleep in the mosque of the Prophet (ﷺ) while I was young and unmarried.",
                "hadithUrdu": "وہ اپنی نوجوانی میں جب کہ ان کے بیوی بچے نہیں تھے نبی کریم صلی اللہ علیہ وسلم کی مسجد میں سویا کرتے تھے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، انھوں نے کہا کہ ہم سے یحییٰ نے عبیداللہ کے واسطہ سے بیان کیا ، انھوں نے کہا کہ مجھ کو نافع نے بیان کیا ، کہا کہ مجھے عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ، أَنَّهُ كَانَ يَنَامُ وَهْوَ شَابٌّ أَعْزَبُ لاَ أَهْلَ لَهُ فِي مَسْجِدِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "نَوْمِ الرِّجَالِ فِي الْمَسْجِدِ",
                "headingUrdu": "مسجد میں مردوں کا سونا",
                "headingEnglish": "Sleeping of a men in the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 433,
                "hadithNumber": "441",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) went to Fatima's house but did not find `Ali there. So he asked, \"Where is your cousin?\" She replied, \"There was something between us and he got angry with me and went out. He did not sleep (midday nap) in the house.\" Allah's Messenger (ﷺ) asked a person to look for him. That person came and said, \"O Allah's Messenger (ﷺ)! He (Ali) is sleeping in the mosque.\" Allah's Messenger (ﷺ) went there and `Ali was lying. His upper body cover had fallen down to one side of his body and he was covered with dust. Allah's Messenger (ﷺ) started cleaning the dust from him saying: \"Get up! O Aba Turab. Get up! O Aba Turab (literally means: O father of dust).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم فاطمہ رضی اللہ عنہا کے گھر تشریف لائے دیکھا کہ حضرت علی رضی اللہ عنہ گھر میں موجود نہیں ہیں ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے چچا کے بیٹے کہاں ہیں ؟ انھوں نے بتایا کہ میرے اور ان کے درمیان کچھ ناگواری پیش آ گئی اور وہ مجھ پر خفا ہو کر کہیں باہر چلے گئے ہیں اور میرے یہاں قیلولہ بھی نہیں کیا ہے ۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص سے کہا کہ علی رضی اللہ عنہ کو تلاش کرو کہ کہاں ہیں ؟ وہ آئے اور بتایا کہ مسجد میں سوئے ہوئے ہیں ۔ پھر نبی کریم صلی اللہ علیہ وسلم تشریف لائے ۔ حضرت علی رضی اللہ عنہ لیٹے ہوئے تھے ، چادر آپ صلی اللہ علیہ وسلم کے پہلو سے گر گئی تھی اور جسم پر مٹی لگ گئی تھی ۔ رسول اللہ صلی اللہ علیہ وسلم جسم سے دھول جھاڑ رہے تھے اور فرما رہے تھے اٹھو ابوتراب اٹھو ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے عبدالعزیز بن ابی حازم نے بیان کیا ، انھوں نے اپنے باپ ابوحازم سہل بن دینار سے ، انھوں نے سہل بن سعد رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْتَ فَاطِمَةَ، فَلَمْ يَجِدْ عَلِيًّا فِي الْبَيْتِ فَقَالَ ‏\"‏ أَيْنَ ابْنُ عَمِّكِ ‏\"‏‏.‏ قَالَتْ كَانَ بَيْنِي وَبَيْنَهُ شَىْءٌ، فَغَاضَبَنِي فَخَرَجَ فَلَمْ يَقِلْ عِنْدِي‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لإِنْسَانٍ ‏\"‏ انْظُرْ أَيْنَ هُوَ ‏\"‏‏.‏ فَجَاءَ فَقَالَ يَا رَسُولَ اللَّهِ، هُوَ فِي الْمَسْجِدِ رَاقِدٌ، فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ مُضْطَجِعٌ، قَدْ سَقَطَ رِدَاؤُهُ عَنْ شِقِّهِ، وَأَصَابَهُ تُرَابٌ، فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْسَحُهُ عَنْهُ وَيَقُولُ ‏\"‏ قُمْ أَبَا تُرَابٍ، قُمْ أَبَا تُرَابٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 434,
                "hadithNumber": "442",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ  :",
                "hadithEnglish": "I saw seventy of As-Suffa men and none of them had a Rida' (a garment covering the upper part of the body). They had either Izars (only) or sheets which they tied round their necks. Some of these sheets reached the middle of their legs and some reached their heels and they used to gather them with their hands lest their private parts should become naked.",
                "hadithUrdu": "آپ نے فرمایا کہ میں نے ستر اصحاب صفہ کو دیکھا کہ ان میں کوئی ایسا نہ تھا جس کے پاس چادر ہو ۔ فقط تہہ بند ہوتا ، یا رات کو اوڑھنے کا کپڑا جنھیں یہ لوگ اپنی گردنوں سے باندھ لیتے ۔ یہ کپڑے کسی کے آدھی پنڈلی تک آتے اور کسی کے ٹخنوں تک ۔ یہ حضرات ان کپڑوں کو اس خیال سے کہ کہیں شرمگاہ نہ کھل جائے اپنے ہاتھوں سے سمیٹے رہتے تھے ۔",
                "urduNarrator": "ہم سے یوسف بن عیسیٰ نے بیان کیا ، کہا ہم سے ابن فضیل نے اپنے والد کے واسطہ سے ، انھوں نے ابوحازم سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ رَأَيْتُ سَبْعِينَ مِنْ أَصْحَابِ الصُّفَّةِ، مَا مِنْهُمْ رَجُلٌ عَلَيْهِ رِدَاءٌ، إِمَّا إِزَارٌ وَإِمَّا كِسَاءٌ، قَدْ رَبَطُوا فِي أَعْنَاقِهِمْ، فَمِنْهَا مَا يَبْلُغُ نِصْفَ السَّاقَيْنِ، وَمِنْهَا مَا يَبْلُغُ الْكَعْبَيْنِ، فَيَجْمَعُهُ بِيَدِهِ، كَرَاهِيَةَ أَنْ تُرَى عَوْرَتُهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 435,
                "hadithNumber": "443",
                "englishNarrator": "Narrated Jabir bin `Abdullah:",
                "hadithEnglish": "I went to the Prophet (ﷺ) in the mosque (the sub-narrator Mas`ar thought that Jabir had said, \"In the forenoon.\") He ordered me to pray two rak`at. He owed me some money and he repaid it to me and gave more than what was due to me.",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ آپ صلی اللہ علیہ وسلم اس وقت مسجد میں تشریف فرما تھے ۔ مسعر نے کہا میرا خیال ہے کہ محارب نے چاشت کا وقت بتایا تھا ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ ( پہلے ) دو رکعت نماز پڑھ اور میرا آنحضرت صلی اللہ علیہ وسلم پر کچھ قرض تھا ۔ جسے آپ صلی اللہ علیہ وسلم نے ادا کیا اور زیادہ ہی دیا ۔",
                "urduNarrator": "ہم سے خلاد بن یحییٰ نے بیان کیا ، کہا ہم سے مسعر نے ، کہا ہم سے محارب بن دثار نے جابر بن عبداللہ کے واسطہ سے ، وہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا مِسْعَرٌ، قَالَ حَدَّثَنَا مُحَارِبُ بْنُ دِثَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَهُوَ فِي الْمَسْجِدِ ـ قَالَ مِسْعَرٌ أُرَاهُ قَالَ ضُحًى ـ فَقَالَ ‏ \"‏ صَلِّ رَكْعَتَيْنِ ‏\"‏‏.‏ وَكَانَ لِي عَلَيْهِ دَيْنٌ فَقَضَانِي وَزَادَنِي‏.‏",
                "headingArabic": "الصَّلاَةِ إِذَا قَدِمَ مِنْ سَفَرٍ",
                "headingUrdu": "سفر سے واپسی پر نماز پڑھنا",
                "headingEnglish": "To offer As-Salat (the prayer) whe returning from a journey",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 436,
                "hadithNumber": "444",
                "englishNarrator": "Narrated Abu Qatada Al-Aslami رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If anyone of you enters a mosque, he should pray two rak`at before sitting.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تم میں سے کوئی شخص مسجد میں داخل ہو تو بیٹھنے سے پہلے دو رکعت نماز پڑھ لے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا انھوں نے کہا کہ ہمیں امام مالک نے عامر بن عبداللہ بن زبیر سے یہ خبر پہنچائی ، انھوں نے عمرو بن سلیم زرقی کے واسطہ سے بیان کیا ، انھوں نے ابوقتادہ سلمی رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، عَنْ أَبِي قَتَادَةَ السَّلَمِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلْيَرْكَعْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ ‏\"‏‏.‏",
                "headingArabic": "إِذَا دَخَلَ الْمَسْجِدَ فَلْيَرْكَعْ رَكْعَتَيْنِ",
                "headingUrdu": "اگر کوئی مسجد میں داخل ہو تو بیٹھنے سے پہلے دو رکعت (تحیۃ المسجد) پڑھے۔",
                "headingEnglish": "If one entered a mosque, one should offer two Rak'a (Tahayyat-al-Masjid) before sitting",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 437,
                "hadithNumber": "445",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The angels keep on asking Allah's forgiveness for anyone of you, as long as he is at his Musalla (praying place) and he does not pass wind (Hadath). They say, 'O Allah! Forgive him, O Allah! be Merciful to him.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تک تم اپنے مصلے پر جہاں تم نے نماز پڑھی تھی ، بیٹھے رہو اور ریاح خارج نہ کرو تو ملائکہ تم پر برابر درود بھیجتے رہتے ہیں ۔ کہتے ہیں «اللهم اغفر له اللهم ارحمه» ’’ اے اللہ ! اس کی مغفرت کیجیئے ، اے اللہ ! اس پر رحم کیجیئے ۔‘‘",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا کہ کہا ہمیں مالک نے ابوالزناد سے ، انھوں نے اعرج سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمَلاَئِكَةُ تُصَلِّي عَلَى أَحَدِكُمْ مَا دَامَ فِي مُصَلاَّهُ الَّذِي صَلَّى فِيهِ، مَا لَمْ يُحْدِثْ، تَقُولُ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ ‏\"‏‏.‏",
                "headingArabic": "الْحَدَثِ فِي الْمَسْجِدِ",
                "headingUrdu": "مسجد میں(خروج ریح سے) بے وضو ہونا",
                "headingEnglish": "Al-Hadath (passing wind) in the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 438,
                "hadithNumber": "446",
                "englishNarrator": "Narrated `Abdullah bin `Umar:",
                "hadithEnglish": "In the lifetime of Allah's Messenger (ﷺ) the mosque was built of adobes, its roof of the leaves of date-palms and its pillars of the stems of date-palms. Abu Bakr did not alter it. `Umar expanded it on the same pattern as it was in the lifetime of Allah's Messenger (ﷺ) by using adobes, leaves of date-palms and changing the pillars into wooden ones. `Uthman changed it by expanding it to a great extent and built its walls with engraved stones and lime and made its pillars of engraved stones and its roof of teak wood.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں مسجدنبوی کچی اینٹوں سے بنائی گئی تھی ۔ اس کی چھت کھجور کی شاخوں کی تھی اور ستون اسی کی کڑیوں کے ۔ حضرت ابوبکر رضی اللہ عنہ نے اس میں کسی قسم کی زیادتی نہیں کی ۔ البتہ حضرت عمر رضی اللہ عنہ نے اسے بڑھایا اور اس کی تعمیر رسول اللہ صلی اللہ علیہ وسلم کی بنائی ہوئی بنیادوں کے مطابق کچی اینٹوں اور کھجوروں کی شاخوں سے کی اور اس کے ستون بھی کڑیوں ہی کے رکھے ۔ پھر حضرت عثمان رضی اللہ عنہ نے اس کی عمارت کو بدل دیا اور اس میں بہت سی زیادتی کی ۔ اس کی دیواریں منقش پتھروں اور گچھ سے بنائیں ۔ اس کے ستون بھی منقش پتھروں سے بنوائے اور چھت ساگوان سے بنائی ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، انھوں نے کہا ہم سے یعقوب بن ابراہیم بن سعید نے بیان کیا ، انھوں نے کہا مجھ سے میرے والد ابراہیم بن سعید نے صالح بن کیسان کے واسطے سے ، ہم سے نافع نے ، عبداللہ بن عمر رضی اللہ عنہما کے واسطہ سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحِ بْنِ كَيْسَانَ، قَالَ حَدَّثَنَا نَافِعٌ، أَنَّ عَبْدَ اللَّهِ، أَخْبَرَهُ أَنَّ الْمَسْجِدَ كَانَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم مَبْنِيًّا بِاللَّبِنِ، وَسَقْفُهُ الْجَرِيدُ، وَعُمُدُهُ خَشَبُ النَّخْلِ، فَلَمْ يَزِدْ فِيهِ أَبُو بَكْرٍ شَيْئًا، وَزَادَ فِيهِ عُمَرُ وَبَنَاهُ عَلَى بُنْيَانِهِ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم بِاللَّبِنِ وَالْجَرِيدِ، وَأَعَادَ عُمُدَهُ خَشَبًا، ثُمَّ غَيَّرَهُ عُثْمَانُ، فَزَادَ فِيهِ زِيَادَةً كَثِيرَةً، وَبَنَى جِدَارَهُ بِالْحِجَارَةِ الْمَنْقُوشَةِ وَالْقَصَّةِ، وَجَعَلَ عُمُدَهُ مِنْ حِجَارَةٍ مَنْقُوشَةٍ، وَسَقَفَهُ بِالسَّاجِ‏.‏",
                "headingArabic": "بُنْيَانِ الْمَسْجِدِ",
                "headingUrdu": "مسجد نبوی کی تعمیر",
                "headingEnglish": "The construction of (the prophet's pbuh) mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 439,
                "hadithNumber": "447",
                "englishNarrator": "Narrated `Ikrima Ibn `Abbas رضی اللہ عنہما said to me and to his son `Ali:",
                "hadithEnglish": "\"Go to Abu Sa`id and listen to what he narrates.\" So we went and found him in a garden looking after it. He picked up his Rida', wore it and sat down and started narrating till the topic of the construction of the mosque reached. He said, \"We were carrying one adobe at a time while `Ammar was carrying two. The Prophet (ﷺ) saw him and started removing the dust from his body and said, \"May Allah be Merciful to `Ammar. He will be inviting them (i.e. his murderers, the rebellious group) to Paradise and they will invite him to Hell-fire.\" `Ammar said, \"I seek refuge with Allah from affliction.\"",
                "hadithUrdu": "ابو سعید خدری رضی اللہ عنہ کی خدمت میں جاؤ اور ان کی احادیث سنو ۔ ہم گئے ۔ دیکھا کہ ابوسعید رضی اللہ عنہ اپنے باغ کو درست کر رہے تھے ۔ ہم کو دیکھ کر آپ نے اپنی چادر سنبھالی اور گوٹ مار کر بیٹھ گئے ۔ پھر ہم سے حدیث بیان کرنے لگے ۔ جب مسجدنبوی کے بنانے کا ذکر آیا تو آپ نے بتایا کہ ہم تو ( مسجد کے بنانے میں حصہ لیتے وقت ) ایک ایک اینٹ اٹھاتے ۔ لیکن عمار دو دو اینٹیں اٹھا رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں دیکھا تو ان کے بدن سے مٹی جھاڑنے لگے اور فرمایا ، افسوس ! عمار کو ایک باغی جماعت قتل کرے گی ۔ جسے عمار جنت کی دعوت دیں گے اور وہ جماعت عمار کو جہنم کی دعوت دے رہی ہو گی ۔ ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ حضرت عمار رضی اللہ عنہ کہتے تھے کہ میں فتنوں سے خدا کی پناہ مانگتا ہوں ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے عبدالعزیز بن مختار نے بیان کیا ، کہا کہ ہم سے خالد حذاء نے عکرمہ سے ، انھوں نے بیان کیا کہ مجھ سے اور اپنے صاحبزادے علی سے ابن عباس رضی اللہ عنہما نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ، قَالَ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ عِكْرِمَةَ، قَالَ لِي ابْنُ عَبَّاسٍ وَلاِبْنِهِ عَلِيٍّ انْطَلِقَا إِلَى أَبِي سَعِيدٍ فَاسْمَعَا مِنْ حَدِيثِهِ‏.‏ فَانْطَلَقْنَا فَإِذَا هُوَ فِي حَائِطٍ يُصْلِحُهُ، فَأَخَذَ رِدَاءَهُ فَاحْتَبَى، ثُمَّ أَنْشَأَ يُحَدِّثُنَا حَتَّى أَتَى ذِكْرُ بِنَاءِ الْمَسْجِدِ فَقَالَ كُنَّا نَحْمِلُ لَبِنَةً لَبِنَةً، وَعَمَّارٌ لَبِنَتَيْنِ لَبِنَتَيْنِ، فَرَآهُ النَّبِيُّ صلى الله عليه وسلم فَيَنْفُضُ التُّرَابَ عَنْهُ وَيَقُولُ ‏ \"‏ وَيْحَ عَمَّارٍ تَقْتُلُهُ الْفِئَةُ الْبَاغِيَةُ، يَدْعُوهُمْ إِلَى الْجَنَّةِ، وَيَدْعُونَهُ إِلَى النَّارِ ‏\"‏‏.‏ قَالَ يَقُولُ عَمَّارٌ أَعُوذُ بِاللَّهِ مِنَ الْفِتَنِ‏.‏",
                "headingArabic": "التَّعَاوُنِ فِي بِنَاءِ الْمَسْجِدِ",
                "headingUrdu": "مسجد کی تعمیر میں تعاون کرنا",
                "headingEnglish": "To co-operate in building a mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 440,
                "hadithNumber": "448",
                "englishNarrator": "Narrated Sahl رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent someone to a woman telling her to \"Order her slave, carpenter, to prepare a wooden pulpit for him to sit on.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک عورت کے پاس ایک آدمی بھیجا کہ وہ اپنے بڑھئی غلام سے کہے کہ میرے لیے ( منبر ) لکڑیوں کے تختوں سے بنا دے جن پر میں بیٹھا کروں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا کہ کہا ہم سے عبدالعزیز نے ابوحازم کے واسطہ سے ، انھوں نے سہل رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلٍ، قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى امْرَأَةٍ أَنْ مُرِي غُلاَمَكِ النَّجَّارَ يَعْمَلْ لِي أَعْوَادًا أَجْلِسُ عَلَيْهِنَّ‏.‏",
                "headingArabic": "الاِسْتِعَانَةِ بِالنَّجَّارِ وَالصُّنَّاعِ فِي أَعْوَادِ الْمِنْبَرِ وَالْمَسْجِدِ",
                "headingUrdu": "لکڑی کا منبر بنانے یا مسجد بنانے میں بڑھئی اور فنی ہاتھ (فنکار) کا استعمال",
                "headingEnglish": "Employing the carpenter and the technical hand (artsan) in making the wooden pulpit or building the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 441,
                "hadithNumber": "449",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہما :",
                "hadithEnglish": "A woman said, \"O Allah's Messenger (ﷺ)! Shall I get something constructed for you to sit on as I have a slave who is a carpenter?\" He replied, \"Yes, if you like.\" So she had that pulpit constructed.",
                "hadithUrdu": "ایک عورت نے کہا یا رسول اللہ صلی اللہ علیہ وسلم ! کیا میں آپ کے لیے کوئی ایسی چیز نہ بنا دوں جس پر آپ صلی اللہ علیہ وسلم بیٹھا کریں ۔ میرا ایک بڑھئی غلام بھی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا اگر تو چاہے تو منبر بنوا دے ۔",
                "urduNarrator": "ہم سے خلاد بن یحییٰ نے بیان کیا ، انھوں نے کہا کہ ہم سے عبدالواحد بن ایمن نے اپنے والد کے واسطے سے بیان کیا ، انھوں نے جابر بن عبداللہ رضی اللہ  عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا خَلاَّدٌ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، أَنَّ امْرَأَةً، قَالَتْ يَا رَسُولَ اللَّهِ، أَلاَ أَجْعَلُ لَكَ شَيْئًا تَقْعُدُ عَلَيْهِ، فَإِنَّ لِي غُلاَمًا نَجَّارًا قَالَ ‏ \"‏ إِنْ شِئْتِ ‏\"‏‏.‏ فَعَمِلَتِ الْمِنْبَرَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 442,
                "hadithNumber": "450",
                "englishNarrator": "Narrated `Uthman bin `Affan:",
                "hadithEnglish": "when people argued too much about his intention to reconstruct the mosque of Allah's Messenger (ﷺ), \"You have talked too much. I heard the Prophet (ﷺ) saying, 'Whoever built a mosque, (Bukair thought that `Asim, another sub-narrator, added, \"Intending Allah's Pleasure\"), Allah would build for him a similar place in Paradise.' \"",
                "hadithUrdu": "مسجدنبوی کی تعمیر کے متعلق لوگوں کی باتوں کو سن کر آپ نے فرمایا کہ تم لوگوں نے بہت زیادہ باتیں کی ہیں ۔ حالانکہ میں نے نبی اکرم صلی اللہ علیہ وسلم سے سنا ہے کہ جس نے مسجد بنائی بکیر ( راوی ) نے کہا میرا خیال ہے کہ آپ نے یہ بھی فرمایا کہ اس سے مقصود اللہ تعالیٰ کی رضا ہو ، تو اللہ تعالیٰ ایسا ہی ایک مکان جنت میں اس کے لیے بنائے گا ۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا انھوں نے کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، انھوں نے کہا کہ مجھ سے عمرو بن حارث نے بیان کیا ، انھوں نے کہا ہم سے بکیر بن عبداللہ نے بیان کیا ، ان سے عاصم بن عمرو بن قتادہ نے بیان کیا ، انھوں نے عبیداللہ بن اسود خولانی سے سنا ، انھوں نے حضرت عثمان بن عفان رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، حَدَّثَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، أَنَّ بُكَيْرًا، حَدَّثَهُ أَنَّ عَاصِمَ بْنَ عُمَرَ بْنِ قَتَادَةَ حَدَّثَهُ أَنَّهُ، سَمِعَ عُبَيْدَ اللَّهِ الْخَوْلاَنِيَّ، أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ، يَقُولُ عِنْدَ قَوْلِ النَّاسِ فِيهِ حِينَ بَنَى مَسْجِدَ الرَّسُولِ صلى الله عليه وسلم إِنَّكُمْ أَكْثَرْتُمْ، وَإِنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ بَنَى مَسْجِدًا ـ قَالَ بُكَيْرٌ حَسِبْتُ أَنَّهُ قَالَ ـ يَبْتَغِي بِهِ وَجْهَ اللَّهِ، بَنَى اللَّهُ لَهُ مِثْلَهُ فِي الْجَنَّةِ ‏\"‏‏.‏",
                "headingArabic": "مَنْ بَنَى مَسْجِدًا",
                "headingUrdu": "(فضیلت) جس نے مسجد بنائی",
                "headingEnglish": "(The superiority of) whoever built a mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 443,
                "hadithNumber": "451",
                "englishNarrator": "Narrated `Jabir bin `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "\"A man passed through the mosque carrying arrows. Allah's Apostle said to him, 'Hold them by their heads.' \"",
                "hadithUrdu": "ایک شخص مسجدنبوی میں آیا اور وہ تیر لیے ہوئے تھا ، رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا کہ ان کی نوکیں تھامے رکھو ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، انھوں نے کہا کہ میں نے عمرو بن دینار سے پوچھا کیا تم نے جابر بن عبداللہ سے یہ حدیث سنی ہے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ قُلْتُ لِعَمْرٍو أَسَمِعْتَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ مَرَّ رَجُلٌ فِي الْمَسْجِدِ وَمَعَهُ سِهَامٌ، فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَمْسِكْ بِنِصَالِهَا ‏\"‏‏.‏",
                "headingArabic": "يَأْخُذُ بِنُصُولِ النَّبْلِ إِذَا مَرَّ فِي الْمَسْجِدِ",
                "headingUrdu": "مسجد سے گزرتے وقت (بہتر) تیروں کو (ہاتھ سے) پکڑنا چاہیے۔",
                "headingEnglish": "While passing through a mosque, (one should better) hold the arrowheads (with the hand)",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 444,
                "hadithNumber": "452",
                "englishNarrator": "Narrated Abu Burda bin `Abdullah (on the authority of his father):",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever passes through our mosques or markets with arrows should hold them by their heads lest he should injure a Muslim.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا اگر کوئی شخص ہماری مساجد یا ہمارے بازاروں میں تیر لیے ہوئے چلے تو ان کے پھل تھامے رہے ، ایسا نہ ہو کہ اپنے ہاتھوں سے کسی مسلمان کو زخمی کر دے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہ کہا ہم سے عبدالواحد بن زیاد نے کہ کہا ہم سے ابوبردہ بن عبداللہ نے ۔ انھوں نے کہا کہ میں نے اپنے والد ( ابوموسیٰ اشعری صحابی ) سے سنا وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا أَبُو بُرْدَةَ بْنُ عَبْدِ اللَّهِ، قَالَ سَمِعْتُ أَبَا بُرْدَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ مَرَّ فِي شَىْءٍ مِنْ مَسَاجِدِنَا أَوْ أَسْوَاقِنَا بِنَبْلٍ، فَلْيَأْخُذْ عَلَى نِصَالِهَا، لاَ يَعْقِرْ بِكَفِّهِ مُسْلِمًا ‏\"‏‏.‏",
                "headingArabic": "الْمُرُورِ فِي الْمَسْجِدِ",
                "headingUrdu": "مسجد سے گزرنا (جائز ہے)",
                "headingEnglish": "Passing through the mosque (is permissible)",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 445,
                "hadithNumber": "453",
                "englishNarrator": "Narrated Hassan bin Thabit Al-Ansari:",
                "hadithEnglish": "I asked Abu Huraira رضی اللہ عنہ \"By Allah! Tell me the truth whether you heard the Prophet (ﷺ) saying, 'O Hassan! Reply on behalf of Allah's Messenger (ﷺ). O Allah! Help him with the Holy Spirit.\" Abu Huraira رضی اللہ عنہ said, \"Yes . \"",
                "hadithUrdu": "میں تمہیں اللہ کا واسطہ دیتا ہوں کہ کیا تم نے رسول اللہ صلی اللہ علیہ وسلم کو یہ کہتے ہوئے نہیں سنا تھا کہ اے حسان ! اللہ کے رسول صلی اللہ علیہ وسلم کی طرف سے ( مشرکوں کو اشعار میں ) جواب دو اور اے اللہ ! حسان کی روح القدس کے ذریعہ مدد کر ۔ ابوہریرہ رضی اللہ عنہ نے فرمایا ، ہاں ( میں گواہ ہوں ۔ بیشک میں نے حضور صلی اللہ علیہ وسلم سے یہ سنا ہے ) ۔",
                "urduNarrator": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا کہ ہمیں شعیب بن ابی حمزہ نے زہری کے واسطے سے کہا کہ مجھے ابوسلمہ ( اسماعیل یا عبداللہ ) ابن عبدالرحمٰن بن عوف نے ، انھوں نے حسان بن ثابت انصاری رضی اللہ عنہ سے سنا ، وہ حضرت ابوہریرہ رضی اللہ عنہ کو اس بات پر گواہ بنا رہے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ الْحَكَمُ بْنُ نَافِعٍ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ سَمِعَ حَسَّانَ بْنَ ثَابِتٍ الأَنْصَارِيَّ، يَسْتَشْهِدُ أَبَا هُرَيْرَةَ أَنْشُدُكَ اللَّهَ هَلْ سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ يَا حَسَّانُ، أَجِبْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم، اللَّهُمَّ أَيِّدْهُ بِرُوحِ الْقُدُسِ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ نَعَمْ‏.‏",
                "headingArabic": "الشِّعْرِ فِي الْمَسْجِدِ",
                "headingUrdu": "مسجد میں اشعار پڑھنے کے بارے میں کیا کہا جاتا ہے؟",
                "headingEnglish": "(What is said about) reciting poetry in the mosque?",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 446,
                "hadithNumber": "454, 455",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "One day I saw Allah's Messenger (ﷺ) at the door of my house while some Ethiopians were playing in the mosque (displaying their skill with spears). Allah's Messenger (ﷺ) was screening me with his Rida' so as to enable me to see their display. \n(`Urwa said that `Aisha رضی اللہ عنہا said, \"I saw the Prophet (ﷺ) and the Ethiopians were playing with their spears.\")",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کو ایک دن اپنے حجرہ کے دروازے پر دیکھا ۔ اس وقت حبشہ کے کچھ لوگ مسجد میں ( نیزوں سے ) کھیل رہے تھے ( ہتھیار چلانے کی مشق کر رہے تھے ) رسول اللہ صلی اللہ علیہ وسلم نے مجھے اپنی چادر میں چھپا لیا تاکہ میں ان کا کھیل دیکھ سکوں۔\r\nابراہیم بن المنذر سے روایت میں یہ زیادتی منقول ہے کہ انھوں نے کہا ہم سے ابن وہب نے بیان کیا ، کہا کہ مجھے یونس نے ابن شہاب کے واسطے سے خبر دی ، انھوں نے عروہ سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے کہمیں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا جب کہ حبشہ کے لوگ چھوٹے نیزوں ( بھالوں ) سے مسجد میں کھیل رہے تھے ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، انھوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ، انھوں نے کہا ہم سے صالح بن کیسان نے بیان کیا ، انھوں نے کہا ہم سے ابن شہاب نے بیان کیا ، انھوں نے کہا کہ مجھے عروہ بن زبیر نے خبر دی کہ حضرت عائشہ رضی اللہ عنہا نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، قَالَتْ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَوْمًا عَلَى باب حُجْرَتِي، وَالْحَبَشَةُ يَلْعَبُونَ فِي الْمَسْجِدِ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَسْتُرُنِي بِرِدَائِهِ، أَنْظُرُ إِلَى لَعِبِهِمْ‏.\r\nزَادَ إِبْرَاهِيمُ بْنُ الْمُنْذِرِ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَالْحَبَشَةُ يَلْعَبُونَ بِحِرَابِهِمْ‏.‏",
                "headingArabic": "أَصْحَابِ الْحِرَابِ فِي الْمَسْجِدِ",
                "headingUrdu": "مسجد میں نیزہ بازوں کا (اپنے نیزوں کے ساتھ) موجودگی (جائز ہے)",
                "headingEnglish": "The presence of spearmen (with their spears) in the mosque (is permissible)",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 447,
                "hadithNumber": "456",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Barira came to seek my help regarding her manumission. I told herself you like I would pay your price to your masters but your Wala' (allegiance) would be for me.\" Her masters said, \"If you like, you can pay what remains (of the price of her manumission), (Sufyan the sub-narrator once said), or if you like you can manumit her, but her (inheritance) Al-Wala would be for us. \"When Allah's Messenger (ﷺ) came, I spoke to him about it. He said, \"Buy her and manumit her. No doubt Al-Wala' is for the manumitted.\" Then Allah's Messenger (ﷺ) stood on the pulpit (or Allah's Messenger (ﷺ) ascended the pulpit as Sufyan once said), and said, \"What about some people who impose conditions which are not present in Allah's Book (Laws)? Whoever imposes conditions which are not in Allah's Book (Laws), his conditions will be invalid even if he imposed them a hundred times.\"",
                "hadithUrdu": "بریرہ رضی اللہ عنہ ( لونڈی ) ان سے اپنی کتابت کے بارے میں مدد لینے آئیں ۔ حضرت عائشہ رضی اللہ عنہا نے کہا تم چاہو تو میں تمہارے مالکوں کو یہ رقم دے دوں ( اور تمہیں آزاد کرا دوں ) اور تمہارا ولاء کا تعلق مجھ سے قائم ہو ۔ اور بریرہ کے آقاؤں نے کہا ( عائشہ رضی اللہ عنہا سے ) کہ اگر آپ چاہیں تو جو قیمت باقی رہ گئی ہے وہ دے دیں اور ولاء کا تعلق ہم سے قائم رہے گا ۔ رسول اللہ صلی اللہ علیہ وسلم جب تشریف لائے تو میں نے آپ صلی اللہ علیہ وسلم سے اس امر کا ذکر کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم بریرہ کو خرید کر آزاد کرو اور ولاء کا تعلق تو اسی کو حاصل ہو سکتا ہے جو آزاد کرائے ۔ پھر رسول اللہ صلی اللہ علیہ وسلم منبر پر تشریف لائے ۔ سفیان نے ( اس حدیث کو بیان کرتے ہوئے ) ایک مرتبہ یوں کہا کہ پھر رسول اللہ صلی اللہ علیہ وسلم منبر پر چڑھے اور فرمایا ۔ ان لوگوں کا کیا حال ہو گا جو ایسی شرائط کرتے ہیں جن کا تعلق کتاب اللہ سے نہیں ہے ۔ جو شخص بھی کوئی ایسی شرط کرے جو کتاب اللہ میں نہ ہو اس کی کوئی حیثیت نہیں ہو گی ، اگرچہ وہ سو مرتبہ کر لے ۔ اس حدیث کی روایت مالک نے یحییٰ کے واسطہ سے کی ، وہ عمرہ سے کہ بریرہ اور انھوں نے منبر پر چڑھنے کا ذکر نہیں کیا الخ ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا کہ کہا ہم سے سفیان بن عیینہ نے یحییٰ بن سعید انصاری کے واسطہ سے ، انھوں نے عمرہ بنت عبدالرحمٰن سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے ۔ آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ أَتَتْهَا بَرِيرَةُ تَسْأَلُهَا فِي كِتَابَتِهَا فَقَالَتْ إِنْ شِئْتِ أَعْطَيْتُ أَهْلَكِ وَيَكُونُ الْوَلاَءُ لِي‏.‏ وَقَالَ أَهْلُهَا إِنْ شِئْتِ أَعْطَيْتِهَا مَا بَقِيَ ـ وَقَالَ سُفْيَانُ مَرَّةً إِنْ شِئْتِ أَعْتَقْتِهَا وَيَكُونُ الْوَلاَءُ لَنَا ـ فَلَمَّا جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَكَّرَتْهُ ذَلِكَ فَقَالَ ‏\"‏ ابْتَاعِيهَا فَأَعْتِقِيهَا، فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ ـ وَقَالَ سُفْيَانُ مَرَّةً فَصَعِدَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ ـ فَقَالَ ‏\"‏ مَا بَالُ أَقْوَامٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ، مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَلَيْسَ لَهُ، وَإِنِ اشْتَرَطَ مِائَةَ مَرَّةٍ ‏\"‏‏.‏ قَالَ عَلِيٌّ قَالَ يَحْيَى وَعَبْدُ الْوَهَّابِ عَنْ يَحْيَى عَنْ عَمْرَةَ‏.‏ وَقَالَ جَعْفَرُ بْنُ عَوْنٍ عَنْ يَحْيَى قَالَ سَمِعْتُ عَمْرَةَ قَالَتْ سَمِعْتُ عَائِشَةَ‏.‏ رَوَاهُ مَالِكٌ عَنْ يَحْيَى عَنْ عَمْرَةَ أَنَّ بَرِيرَةَ‏.‏ وَلَمْ يَذْكُرْ صَعِدَ الْمِنْبَرَ‏.‏",
                "headingArabic": "ذِكْرِ الْبَيْعِ وَالشِّرَاءِ عَلَى الْمِنْبَرِ فِي الْمَسْجِدِ",
                "headingUrdu": "مسجد میں منبر پر خرید و فروخت کا ذکر",
                "headingEnglish": "Mentioning about sales and purchases on the pulpit in the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 448,
                "hadithNumber": "457",
                "englishNarrator": "Narrated Ka`b رضی اللہ عنہ :",
                "hadithEnglish": "In the mosque l asked Ibn Abi Hadrad to pay the debts which he owed to me and our voices grew louder. Allah's Messenger (ﷺ) heard that while he was in his house. So he came to us raising the curtain of his room and said, \"O Ka`b!\" I replied, \"Labaik, O Allah's Messenger (ﷺ)!\" He said, \"O Ka`b! reduce your debt to one half,\" gesturing with his hand. I said, \"O Allah's Messenger (ﷺ)! I have done so.\" Then Allah's Apostle said (to Ibn Abi Hadrad), \"Get up and pay the debt to him.\"",
                "hadithUrdu": "انھوں نے مسجدنبوی میں عبداللہ ابن ابی حدرد سے اپنے قرض کا تقاضا کیا اور دونوں کی گفتگو بلند آوازوں سے ہونے لگی ۔ یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم نے بھی اپنے حجرے سے سن لیا ۔ آپ پردہ ہٹا کر باہر تشریف لائے اور پکارا ۔ کعب ، کعب ( رضی اللہ عنہ ) بولے ، جی حضور فرمائیے کیا ارشاد ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم اپنے قرض میں سے اتنا کم کر دو ۔ آپ کا اشارہ تھا کہ آدھا کم کر دیں ۔ انھوں نے کہا یا رسول اللہ ! میں نے ( بخوشی ) ایسا کر دیا ۔ پھر آپ نے ابن ابی حدرد سے فرمایا اچھا اب اٹھو اور اس کا قرض ادا کرو ۔ ( جو آدھا معاف کر دیا گیا ہے ) ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انھوں نے کہا ہم سے عثمان بن عمر عبدی نے بیان کیا ، انھوں نے کہا کہ مجھے یونس بن یزید نے زہری کے واسطہ سے ، انھوں نے عبداللہ بن کعب بن مالک سے ، انھوں نے اپنے باپ کعب بن مالک سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ كَعْبٍ، أَنَّهُ تَقَاضَى ابْنَ أَبِي حَدْرَدٍ دَيْنًا كَانَ لَهُ عَلَيْهِ فِي الْمَسْجِدِ، فَارْتَفَعَتْ أَصْوَاتُهُمَا حَتَّى سَمِعَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ فِي بَيْتِهِ، فَخَرَجَ إِلَيْهِمَا حَتَّى كَشَفَ سِجْفَ حُجْرَتِهِ فَنَادَى ‏\"‏ يَا كَعْبُ ‏\"‏‏.‏ قَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ ضَعْ مِنْ دَيْنِكَ هَذَا ‏\"‏‏.‏ وَأَوْمَأَ إِلَيْهِ أَىِ الشَّطْرَ قَالَ لَقَدْ فَعَلْتُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ قُمْ فَاقْضِهِ ‏\"‏‏.‏",
                "headingArabic": "التَّقَاضِي وَالْمُلاَزَمَةِ فِي الْمَسْجِدِ",
                "headingUrdu": "مقروض سے مطالبہ کرنا کہ اس کا مقروض ہے اور مقروض کو مسجد میں پکڑنا",
                "headingEnglish": "Asking a debtor to repay what he owes and catching the debtor in the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 449,
                "hadithNumber": "458",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "A black man or a black woman used to sweep the mosque and he or she died. The Prophet (ﷺ) asked about her (or him). He was told that she (or he) had died. He said, \"Why did you not inform me? Show me his grave (or her grave).\" So he went to her (his) grave and offered her (his) funeral prayer.\"",
                "hadithUrdu": "ایک حبشی مرد یا حبشی عورت مسجدنبوی میں جھاڑو دیا کرتی تھی ۔ ایک دن اس کا انتقال ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے اس کے متعلق دریافت فرمایا ۔ لوگوں نے بتایا کہ وہ تو انتقال کر گئی ۔ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ تم نے مجھے کیوں نہ بتایا ، پھر آپ صلی اللہ علیہ وسلم قبر پر تشریف لائے اور اس پر نماز پڑھی ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، انھوں نے کہا ہم سے حماد بن زید نے بیان کیا ، انھوں نے ثابت سے ، انھوں نے ابورافع سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، أَسْوَدَ ـ أَوِ امْرَأَةً سَوْدَاءَ ـ كَانَ يَقُمُّ الْمَسْجِدَ، فَمَاتَ، فَسَأَلَ النَّبِيُّ صلى الله عليه وسلم عَنْهُ فَقَالُوا مَاتَ‏.‏ قَالَ ‏ \"‏ أَفَلاَ كُنْتُمْ آذَنْتُمُونِي بِهِ دُلُّونِي عَلَى قَبْرِهِ ‏\"‏‏.‏ ـ أَوْ قَالَ قَبْرِهَا ـ فَأَتَى قَبْرَهُ فَصَلَّى عَلَيْهِ‏.‏",
                "headingArabic": "كَنْسِ الْمَسْجِدِ وَالْتِقَاطِ الْخِرَقِ وَالْقَذَى وَالْعِيدَانِ",
                "headingUrdu": "مسجد کا رونا (صفائی) اور اس سے چیتھڑے، گندگی اور لاٹھیاں ہٹانا",
                "headingEnglish": "weeping (cleaning) of the mosque and removing rags, dirt and sticks from it",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 450,
                "hadithNumber": "459",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "When the verses of Surat \"Al-Baqara\"' about the usury Riba were revealed, the Prophet (ﷺ) went to the mosque and recited them in front of the people and then banned the trade of alcohol.",
                "hadithUrdu": "جب سورۃ البقرہ کی سود سے متعلق آیات نازل ہوئیں تو نبی کریم صلی اللہ علیہ وسلم مسجد میں تشریف لے گئے اور ان آیات کی لوگوں کے سامنے تلاوت فرمائی ۔ پھر فرمایا کہ شراب کی تجارت حرام ہے ۔",
                "urduNarrator": "ہم سے عبدان بن عبداللہ بن عثمان نے ابوحمزہ محمد بن میمون کے واسطہ سے بیان کیا ، انھوں نے اعمش سے ، انھوں نے مسلم سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے ۔ آپ فرماتی ہیں کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا أُنْزِلَ الآيَاتُ مِنْ سُورَةِ الْبَقَرَةِ فِي الرِّبَا، خَرَجَ النَّبِيُّ صلى الله عليه وسلم إِلَى الْمَسْجِدِ، فَقَرَأَهُنَّ عَلَى النَّاسِ، ثُمَّ حَرَّمَ تِجَارَةَ الْخَمْرِ‏.‏",
                "headingArabic": "تَحْرِيمِ تِجَارَةِ الْخَمْرِ فِي الْمَسْجِدِ",
                "headingUrdu": "شراب کی تجارت پر پابندی کا حکم مسجد میں مسئلہ تھا۔",
                "headingEnglish": "The order of banning the trade of alcoholic drinks was issues in the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 426,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=17",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=15",
                "label": "15",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=16",
                "label": "16",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=17",
                "label": "17",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=18",
                "label": "18",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=19",
                "label": "19",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=20",
                "label": "20",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=21",
                "label": "21",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=19",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=19",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=17",
        "to": 450,
        "total": 40465
    }
}