{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 128,
        "data": [
            {
                "id": 3178,
                "hadithNumber": "3327",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The first group of people who will enter Paradise, will be glittering like the full moon and those who will follow them, will glitter like the most brilliant star in the sky. They will not urinate, relieve nature, spit, or have any nasal secretions. Their combs will be of gold, and their sweat will smell like musk. The aloes-wood will be used in their centers. Their wives will be houris. All of them will look alike and will resemble their father Adam (in stature), sixty cubits tall.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، سب سے پہلا گروہ جو جنت میں داخل ہو گا ان کی صورتیں ایسی روشن ہوں گی جیسے چودھویں کا چاند روشن ہوتا ہے ، پھر جو لوگ اس کے بعد داخل ہوں گے وہ آسمان کے سب سے زیادہ روشن ستارے کی طرح چمکتے ہوں گے ۔ نہ تو ان لوگوں کو پیشاب کی ضرورت ہو گی نہ پاخانہ کی ، نہ وہ تھوکیں گے نہ ناک سے آلائش نکالیں گے ۔ ان کے کنگھے سونے کے ہوں گے اور ان کا پسینہ مشک کی طرح ہو گا ۔ ان کی انگیٹھیوں میں خوشبودار عود جلتا ہو گا ، یہ نہایت پاکیزہ خوشبودار عود ہو گا ۔ ان کی بیویاں بڑی آنکھوں والی حوریں ہوں گی ۔ سب کی صورتیں ایک ہوں گی ۔ یعنی اپنے والد آدم علیہ السلام کے قد و قامت پر ساٹھ ساٹھ ہاتھ اونچے ہوں گے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے عمارہ نے ان سے ابوزرعہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ أَوَّلَ زُمْرَةٍ يَدْخُلُونَ الْجَنَّةَ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ، ثُمَّ الَّذِينَ يَلُونَهُمْ عَلَى أَشَدِّ كَوْكَبٍ دُرِّيٍّ فِي السَّمَاءِ إِضَاءَةً، لاَ يَبُولُونَ وَلاَ يَتَغَوَّطُونَ وَلاَ يَتْفِلُونَ وَلاَ يَمْتَخِطُونَ، أَمْشَاطُهُمُ الذَّهَبُ، وَرَشْحُهُمُ الْمِسْكُ، وَمَجَامِرُهُمُ الأَلُوَّةُ الأَنْجُوجُ عُودُ الطِّيبِ، وَأَزْوَاجُهُمُ الْحُورُ الْعِينُ، عَلَى خَلْقِ رَجُلٍ وَاحِدٍ عَلَى صُورَةِ أَبِيهِمْ آدَمَ، سِتُّونَ ذِرَاعًا فِي السَّمَاءِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3179,
                "hadithNumber": "3328",
                "englishNarrator": "Narrated \"Um Sulaim رضی اللہ عنہما :",
                "hadithEnglish": "Um Salama رضی اللہ عنہما said, 'O Allah's Messenger (ﷺ)! Allah does not refrain from saying the truth! Is it obligatory for a woman to take a bath after she gets nocturnal discharge?' He said, 'Yes, if she notices the water (i.e. discharge).' Um Salama رضی اللہ عنہما smiled and said, 'Does a woman get discharge?' Allah's Apostle said. 'Then why does a child resemble (its mother)?\"",
                "hadithUrdu": "ام سلیم رضی اللہ عنہا نے عرض کیا ، یا رسول اللہ ! اللہ تعالیٰ حق بات سے نہیں شرماتا ، تو کیا اگر عورت کو احتلام ہو تو اس پر بھی غسل ہو گا ؟ آپ نے فرمایا کہ ہاں بشرطیکہ وہ تری دیکھ لے ، ام المؤمنین ام سلمہ رضی اللہ عنہا کو اس بات پر ہنسی آ گئی اور فرمانے لگیں ، کیا عورت کو بھی احتلام ہوتا ہے ؟ آپ نے فرمایا ، ( اگر ایسا نہیں ہے ) تو پھر بچے میں ( ماں کی ) مشابہت کہاں سے آتی ہے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے باپ نے ، ان سے زینب بنت ابی سلمہ نے ، ان سے ( ام المؤمنین ) ام سلمہ رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّ أُمَّ سُلَيْمٍ، قَالَتْ يَا رَسُولَ اللَّهِ، إِنَّ اللَّهَ لاَ يَسْتَحْيِي مِنَ الْحَقِّ، فَهَلْ عَلَى الْمَرْأَةِ الْغُسْلُ إِذَا احْتَلَمَتْ قَالَ ‏\"‏ نَعَمْ، إِذَا رَأَتِ الْمَاءَ ‏\"‏‏.‏ فَضَحِكَتْ أُمُّ سَلَمَةَ، فَقَالَتْ تَحْتَلِمُ الْمَرْأَةُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَبِمَا يُشْبِهُ الْوَلَدُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3180,
                "hadithNumber": "3329",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When `Abdullah bin Salam رضی اللہ عنہ heard the arrival of the Prophet (ﷺ) at Medina, he came to him and said, \"I am going to ask you about three things which nobody knows except a prophet: What is the first portent of the Hour? What will be the first meal taken by the people of Paradise? Why does a child resemble its father, and why does it resemble its maternal uncle\" Allah's Messenger (ﷺ) said, \"Gabriel has just now told me of their answers.\" `Abdullah رضی اللہ عنہ said, \"He (i.e. Gabriel), from amongst all the angels, is the enemy of the Jews.\" Allah's Messenger (ﷺ) said, \"The first portent of the Hour will be a fire that will bring together the people from the east to the west; the first meal of the people of Paradise will be Extra-lobe (caudate lobe) of fish-liver. As for the resemblance of the child to its parents: If a man has sexual intercourse with his wife and gets discharge first, the child will resemble the father, and if the woman gets discharge first, the child will resemble her.\" On that `Abdullah bin Salam said, \"I testify that you are the Messenger of Allah.\" `Abdullah bin Salam     رضی اللہ عنہ further said, \"O Allah's Messenger (ﷺ)! The Jews are liars, and if they should come to know about my conversion to Islam before you ask them (about me), they would tell a lie about me.\" The Jews came to Allah's Messenger (ﷺ) and `Abdullah رضی اللہ عنہ went inside the house. Allah's Apostle asked (the Jews), \"What kind of man is `Abdullah bin Salam رضی اللہ عنہ amongst you?\" They replied, \"He is the most learned person amongst us, and the best amongst us, and the son of the best amongst us.\" Allah's Messenger (ﷺ) said, \"What do you think if he embraces Islam (will you do as he does)?\" The Jews said, \"May Allah save him from it.\" Then `Abdullah bin Salam رضی اللہ عنہ came out in front of them saying, \"I testify that None has the right to be worshipped but Allah and that Muhammad is the Apostle of Allah.\" Thereupon they said, \"He is the evilest among us, and the son of the evilest amongst us,\" and continued talking badly of him.",
                "hadithUrdu": "حضرت عبداللہ بن سلام رضی اللہ عنہ کو جب رسول کریم صلی اللہ علیہ وسلم کے مدینہ تشریف لانے کی خبر ملی تو وہ آپ کی خدمت میں آئے اور کہا کہ میں آپ سے تین چیزوں کے بارے میں پوچھوں گا ۔ جنہیں نبی کے سوا اور کوئی نہیں جانتا ۔ قیامت کی سب سے پہلی علامت کیا ہے ؟ وہ کون سا کھانا ہے جو سب سے پہلے جنتیوں کو کھانے کے لیے دیا جائے گا ؟ اور کس چیز کی وجہ سے بچہ اپنے باپ کے مشابہ ہوتا ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جبرائیل علیہ السلام نے ابھی ابھی مجھے آ کر اس کی خبر دی ہے ۔ اس پر حضرت عبداللہ رضی اللہ عنہ نے کہا کہ ملائکہ میں تو یہی تو یہودیوں کے دشمن ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، قیامت کی سب سے پہلی علامت ایک آگ کی صورت میں ظاہر ہو گی جو لوگوں کو مشرق سے مغرب کی طرف ہانک لے جائے گی ، سب سے پہلا کھانا جو اہل جنت کی دعوت کے لیے پیش کیا جائے گا ، وہ مچھلی کی کلیجی پر جو ٹکڑا ٹکا رہتا ہے وہ ہو گا اور بچے کی مشابہت کا جہاں تک تعلق ہے تو جب مرد عورت کے قریب جاتا ہے اس وقت اگر مرد کی منی پہل کر جاتی ہے تو بچہ اسی کی شکل و صورت پر ہوتا ہے ۔ اگر عورت کی منی پہل کر جاتی ہے تو پھر بچہ عورت کی شکل و صورت پر ہوتا ہے ( یہ سن کر ) حضرت عبداللہ بن سلام رضی اللہ عنہ بول اٹھے ” میں گواہی دیتا ہوں کہ آپ اللہ کے رسول ہیں ۔ “ پھر عرض کیا ، یا رسول اللہ ! یہود انتہا کی جھوٹی قوم ہے ۔ اگر آپ کے دریافت کرنے سے پہلے میرے اسلام قبول کرنے کے بارے میں انہیں علم ہو گیا تو آپ صلی اللہ علیہ وسلم کے سامنے مجھ پر ہر طرح کی تہمتیں دھرنی شروع کر دیں گے ۔ چنانچہ کچھ یہودی آئے اور حضرت عبداللہ رضی اللہ عنہ کے گھر کے اندر چھپ کر بیٹھ گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے پوچھا تم لوگوں میں عبداللہ بن سلام کون صاحب ہیں ؟ سارے یہودی کہنے لگے وہ ہم میں سب سے بڑے عالم اور سب سے بڑے عالم کے صاحب زادے ہیں ۔ ہم میں سب سے زیادہ بہتر اور ہم میں سب سے بہتر کے صاحب زادے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا ، اگر عبداللہ مسلمان ہو جائیں تو پھر تمہارا کیا خیال ہو گا ؟ انہوں نے کہا ، اللہ تعالیٰ انہیں اس سے محفوظ رکھے ۔ اتنے میں حضرت عبداللہ رضی اللہ عنہ باہر تشریف لائے اور کہا ، میں گواہی دیتا ہوں کہ اللہ کے سوا اور کوئی معبود نہیں اور میں گواہی دیتا ہوں کہ محمد اللہ کے سچے رسول ہیں ۔ اب وہ سب ان کے متعلق کہنے لگے کہ ہم میں سب سے بدترین اور سب سے بدترین کا بیٹا ہے ، وہیں وہ ان کی برائی کرنے لگے ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو مروان فزاری نے خبر دی ۔ انہیں حمید نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا الْفَزَارِيُّ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ بَلَغَ عَبْدَ اللَّهِ بْنَ سَلاَمٍ مَقْدَمُ رَسُولِ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ، فَأَتَاهُ، فَقَالَ إِنِّي سَائِلُكَ عَنْ ثَلاَثٍ لاَ يَعْلَمُهُنَّ إِلاَّ نَبِيٌّ، ‏{‏قَالَ مَا‏}‏ أَوَّلُ أَشْرَاطِ السَّاعَةِ وَمَا أَوَّلُ طَعَامٍ يَأْكُلُهُ أَهْلُ الْجَنَّةِ وَمِنْ أَىِّ شَىْءٍ يَنْزِعُ الْوَلَدُ إِلَى أَبِيهِ وَمِنْ أَىِّ شَىْءٍ يَنْزِعُ إِلَى أَخْوَالِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَبَّرَنِي بِهِنَّ آنِفًا جِبْرِيلُ ‏\"‏‏.‏ قَالَ فَقَالَ عَبْدُ اللَّهِ ذَاكَ عَدُوُّ الْيَهُودِ مِنَ الْمَلاَئِكَةِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَّا أَوَّلُ أَشْرَاطِ السَّاعَةِ فَنَارٌ تَحْشُرُ النَّاسَ مِنَ الْمَشْرِقِ إِلَى الْمَغْرِبِ‏.‏ وَأَمَّا أَوَّلُ طَعَامٍ يَأْكُلُهُ أَهْلُ الْجَنَّةِ فَزِيَادَةُ كَبِدِ حُوتٍ‏.‏ وَأَمَّا الشَّبَهُ فِي الْوَلَدِ فَإِنَّ الرَّجُلَ إِذَا غَشِيَ الْمَرْأَةَ فَسَبَقَهَا مَاؤُهُ كَانَ الشَّبَهُ لَهُ، وَإِذَا سَبَقَ مَاؤُهَا كَانَ الشَّبَهُ لَهَا ‏\"‏‏.‏ قَالَ أَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ‏.‏ ثُمَّ قَالَ يَا رَسُولَ اللَّهِ إِنَّ الْيَهُودَ قَوْمٌ بُهُتٌ، إِنْ عَلِمُوا بِإِسْلاَمِي قَبْلَ أَنْ تَسْأَلَهُمْ بَهَتُونِي عِنْدَكَ، فَجَاءَتِ الْيَهُودُ وَدَخَلَ عَبْدُ اللَّهِ الْبَيْتَ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَىُّ رَجُلٍ فِيكُمْ عَبْدُ اللَّهِ بْنُ سَلاَمٍ ‏\"‏‏.‏ قَالُوا أَعْلَمُنَا وَابْنُ أَعْلَمِنَا وَأَخْبَرُنَا وَابْنُ أَخْيَرِنَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفَرَأَيْتُمْ إِنْ أَسْلَمَ عَبْدُ اللَّهِ ‏\"‏‏.‏ قَالُوا أَعَاذَهُ اللَّهُ مِنْ ذَلِكَ‏.‏ فَخَرَجَ عَبْدُ اللَّهِ إِلَيْهِمْ فَقَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ‏.‏ فَقَالُوا شَرُّنَا وَابْنُ شَرِّنَا‏.‏ وَوَقَعُوا فِيهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3181,
                "hadithNumber": "3330",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"But for the Israelis, meat would not decay and but for Eve, wives would never betray their husbands.\"",
                "hadithUrdu": "اگر قوم بنی اسرائیل نہ ہوتی تو گوشت نہ سڑا کرتا اور اگر حواء نہ ہوتیں تو عورت اپنے شوہر سے دغا نہ کرتی ۔",
                "urduNarrator": "ہم سے بشر بن محمد نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ( عبدالرزاق کی ) روایت کی طرح کہ",
                "hadithArabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ يَعْنِي ‏ \"‏ لَوْلاَ بَنُو إِسْرَائِيلَ لَمْ يَخْنَزِ اللَّحْمُ، وَلَوْلاَ حَوَّاءُ لَمْ تَخُنْ أُنْثَى زَوْجَهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3182,
                "hadithNumber": "3331",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah 's Apostle said (ﷺ), \"Treat women nicely, for a women is created from a rib, and the most curved portion of the rib is its upper portion, so, if you should try to straighten it, it will break, but if you leave it as it is, it will remain crooked. So treat women nicely.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، عورتوں کے بارے میں میری وصیت کا ہمیشہ خیال رکھنا ، کیونکہ عورت پسلی سے پیدا کی گئی ہے ۔ پسلی میں بھی سب سے زیادہ ٹیڑھا اوپر کا حصہ ہوتا ہے ۔ اگر کوئی شخص اسے بالکل سیدھی کرنے کی کوشش کرے تو انجام کار توڑ کے رہے گا اور اگر اسے وہ یونہی چھوڑ دے گا تو پھر ہمیشہ ٹیڑھی ہی رہ جائے گی ۔ پس عورتوں کے بارے میں میری نصیحت مانو ، عورتوں سے اچھا سلوک کرو ۔",
                "urduNarrator": "ہم سے ابوکریب اور موسیٰ بن حزام نے بیان کیا ، کہا کہ ہم سے حسین بن علی نے بیان کیا ، ان سے زائدہ نے ، ان سے میسرہ اشجعی نے ، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَمُوسَى بْنُ حِزَامٍ، قَالاَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ مَيْسَرَةَ الأَشْجَعِيِّ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اسْتَوْصُوا بِالنِّسَاءِ، فَإِنَّ الْمَرْأَةَ خُلِقَتْ مِنْ ضِلَعٍ، وَإِنَّ أَعْوَجَ شَىْءٍ فِي الضِّلَعِ أَعْلاَهُ، فَإِنْ ذَهَبْتَ تُقِيمُهُ كَسَرْتَهُ، وَإِنْ تَرَكْتَهُ لَمْ يَزَلْ أَعْوَجَ، فَاسْتَوْصُوا بِالنِّسَاءِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3183,
                "hadithNumber": "3332",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ), the true and truly inspired said, \"(as regards your creation), every one of you is collected in the womb of his mother for the first forty days, and then he becomes a clot for another forty days, and then a piece of flesh for another forty days. Then Allah sends an angel to write four items: He writes his deeds, time of his death, means of his livelihood, and whether he will be wretched or blessed (in religion). Then the soul is breathed into his body. So a man may do deeds characteristic of the people of the (Hell) Fire, so much so that there is only the distance of a cubit between him and it, and then what has been written (by the angel) surpasses, and so he starts doing deeds characteristic of the people of Paradise and enters Paradise. Similarly, a person may do deeds characteristic of the people of Paradise, so much so that there is only the distance of a cubit between him and it, and then what has been written (by the angel) surpasses, and he starts doing deeds of the people of the (Hell) Fire and enters the (Hell) Fire.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے بیان فرمایا اور آپ سچوں کے سچے تھے کہ انسان کی پیدائش اس کی ماں کے پیٹ میں پہلے چالیس دن تک پوری کی جاتی ہے ۔ پھر وہ اتنے ہی دنوں تک علقہ یعنی غلیظ اور جامد خون کی صورت میں رہتا ہے ۔ پھر اتنے ہی دنوں کے لیے مضغہ ( گوشت کا لوتھڑا ) کی شکل اختیار کر لیتا ہے ۔ پھر ( چوتھے چلہ میں ) اللہ تعالیٰ ایک فرشتہ کو چار باتوں کا حکم دے کر بھیجتا ہے ۔ پس وہ فرشتہ اس کے عمل ، اس کی مدت زندگی ، روزی اور یہ کہ وہ نیک ہے یا بد ، کو لکھ لیتا ہے ۔ اس کے بعد اس میں روح پھونکی جاتی ہے ۔ پس انسان ( زندگی بھر ) دوزخیوں کے کام کرتا رہتا ہے ۔ اور جب اس کے اور دوزخ کے درمیان صرف ایک ہاتھ کا فاصلہ رہ جاتا ہے تو اس کی تقدیر سامنے آتی ہے اور وہ جنتیوں کے کام کرنے لگتا ہے اور جنت میں چلا جاتا ہے ۔ اسی طرح ایک شخص جنتیوں کے کام کرتا رہتا ہے اور جب اس کے اور جنت کے درمیان صرف ایک ہاتھ کا فاصلہ رہ جاتا ہے تو اس کی تقدیر سامنے آتی ہے اور وہ دوزخیوں کے کام شروع کر دیتا ہے اور وہ دوزخ میں چلا جاتا ہے ۔",
                "urduNarrator": "ہم سے عمر بن حفص نے بیان کیا ، کہا ہم سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا ہم سے زید بن وہب نے بیان کیا ، کہا ہم سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا زَيْدُ بْنُ وَهْبٍ، حَدَّثَنَا عَبْدُ اللَّهِ، حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ الصَّادِقُ الْمَصْدُوقُ ‏ \"‏ إِنَّ أَحَدَكُمْ يُجْمَعُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا، ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يَبْعَثُ اللَّهُ إِلَيْهِ مَلَكًا بِأَرْبَعِ كَلِمَاتٍ، فَيُكْتَبُ عَمَلُهُ وَأَجَلُهُ وَرِزْقُهُ وَشَقِيٌّ أَوْ سَعِيدٌ، ثُمَّ يُنْفَخُ فِيهِ الرُّوحُ، فَإِنَّ الرَّجُلَ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ، فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ، فَيَدْخُلُ الْجَنَّةَ، وَإِنَّ الرَّجُلَ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ، حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ، فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُ النَّارَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3184,
                "hadithNumber": "3333",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah has appointed an angel in the womb, and the angel says, 'O Lord! A drop of discharge (i.e. of semen), O Lord! a clot, O Lord! a piece of flesh.' And then, if Allah wishes to complete the child's creation, the angel will say. 'O Lord! A male or a female? O Lord! wretched or blessed (in religion)? What will his livelihood be? What will his age be?' The angel writes all this while the child is in the womb of its mother.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے ماں کے رحم کے لیے ایک فرشتہ مقرر کر دیا ہے وہ فرشتہ عرض کرتا ہے ، اے رب ! یہ نطفہ ہے ، اے رب یہ مضغہ ہے ۔ اے رب ! یہ علقہ ہے ۔ پھر جب اللہ تعالیٰ اسے پیدا کرنے کا ارادہ کرتا ہے تو فرشتہ پوچھتا ہے اے رب ! یہ مرد ہے یا اے رب ! یہ عورت ہے ، اے رب ! یہ بد ہے یا نیک ؟ اس کی روزی کیا ہے ؟ اور مدت زندگی کتنی ہے ؟ چنانچہ اسی کے مطابق ماں کے پیٹ ہی میں سب کچھ فرشتہ رکھ لیتا ہے ۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے عبیداللہ بن ابی بکر بن انس نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ اللَّهَ وَكَّلَ فِي الرَّحِمِ مَلَكًا فَيَقُولُ يَا رَبِّ نُطْفَةٌ، يَا رَبِّ عَلَقَةٌ، يَا رَبِّ مُضْغَةٌ، فَإِذَا أَرَادَ أَنْ يَخْلُقَهَا قَالَ يَا رَبِّ، أَذَكَرٌ أَمْ يَا رَبِّ أُنْثَى يَا رَبِّ شَقِيٌّ أَمْ سَعِيدٌ فَمَا الرِّزْقُ فَمَا الأَجَلُ فَيُكْتَبُ كَذَلِكَ فِي بَطْنِ أُمِّهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3185,
                "hadithNumber": "3334",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah will say to that person of the (Hell) Fire who will receive the least punishment, 'If you had everything on the earth, would you give it as a ransom to free yourself (i.e. save yourself from this Fire)?' He will say, 'Yes.' Then Allah will say, 'While you were in the backbone of Adam, I asked you much less than this, i.e. not to worship others besides Me, but you insisted on worshipping others besides me.' \"",
                "hadithUrdu": "اللہ تعالیٰ ( قیامت کے دن ) اس شخص سے پوچھے گا جسے دوزخ کا سب سے ہلکا عذاب کیا گیا ہو گا ۔ اگر دنیا میں تمہاری کوئی چیز ہوتی تو کیا تو اس عذاب سے نجات پانے کے لیے اسے بدلے میں دے سکتا تھا ؟ وہ شخص کہے گا کہ جی ہاں اس پر اللہ تعالیٰ فرمائے گا کہ جب تو آدم کی پیٹھ میں تھا تو میں نے تجھ سے اس سے بھی معمولی چیز کا مطالبہ کیا تھا ( روز ازل میں ) کہ میرا کسی کو بھی شریک نہ ٹھہرانا ، لیکن ( جب تو دنیا میں آیا تو ) اسی شرک کا عمل اختیار کیا ۔",
                "urduNarrator": "ہم سے قیس بن حفص نے بیان کیا ، کہا ہم سے خالد بن حارث نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابوعمران جونی نے اور ان سے حضرت انس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ أَنَسٍ، يَرْفَعُهُ ‏ \"‏ أَنَّ اللَّهَ، يَقُولُ لأَهْوَنِ أَهْلِ النَّارِ عَذَابًا لَوْ أَنَّ لَكَ مَا فِي الأَرْضِ مِنْ شَىْءٍ كُنْتَ تَفْتَدِي بِهِ قَالَ نَعَمْ‏.‏ قَالَ فَقَدْ سَأَلْتُكَ مَا هُوَ أَهْوَنُ مِنْ هَذَا وَأَنْتَ فِي صُلْبِ آدَمَ أَنْ لاَ تُشْرِكَ بِي‏.‏ فَأَبَيْتَ إِلاَّ الشِّرْكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3186,
                "hadithNumber": "3335",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Whenever a person is murdered unjustly, there is a share from the burden of the crime on the first son of Adam for he was the first to start the tradition of murdering.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب بھی کوئی انسان ظلم سے قتل کیا جاتا ہے تو آدم علیہ السلام کے سب سے پہلے بیٹے ( قابیل ) کے نامہ اعمال میں بھی اس قتل کا گناہ لکھا جاتا ہے ۔ کیونکہ قتل ناحق کی بنا سب سے پہلے اسی نے قائم کی تھی ۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، ان سے اعمش نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن مرہ نے بیان کیا ، ان سے مسروق نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تُقْتَلُ نَفْسٌ ظُلْمًا إِلاَّ كَانَ عَلَى ابْنِ آدَمَ الأَوَّلِ كِفْلٌ مِنْ دَمِهَا، لأَنَّهُ أَوَّلُ مَنْ سَنَّ الْقَتْلَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3187,
                "hadithNumber": "3336",
                "englishNarrator": "Narrated Aishah رضی اللہ عنہا :",
                "hadithEnglish": "I heard the Prophet (ﷺ), \"Souls are like recruited troops: Those who are like qualities are inclined to each other, but those who have dissimilar qualities, differ.\" Yahya bi Ayyub, too, has reported it from Yahya bin Saeed.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے کہ روحوں کے جھنڈ کے جھنڈ الگ الگ تھے ۔ پھر وہاں جن روحوں میں آپس میں پہچان تھی ان میں یہاں بھی محبت ہوتی ہے اور جو وہاں غیر تھیں یہاں بھی وہ خلاف رہتی ہیں اور یحییٰ بن ایوب نے بھی اس حدیث کو روایت کیا ، کہا مجھ سے یحییٰ بن سعید نے بیان کیا ، آخر تک ۔",
                "urduNarrator": "امام بخاری نے کہا کہ لیث بن سعد نے روایت کیا یحییٰ بن سعید انصاری سے ، ان سے عمرہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "قَالَ قَالَ اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، رضى الله عنها قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الأَرْوَاحُ جُنُودٌ مُجَنَّدَةٌ، فَمَا تَعَارَفَ مِنْهَا ائْتَلَفَ، وَمَا تَنَاكَرَ مِنْهَا اخْتَلَفَ ‏\"‏‏.‏ وَقَالَ يَحْيَى بْنُ أَيُّوبَ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ بِهَذَا‏.‏",
                "headingArabic": "الأَرْوَاحُ جُنُودٌ مُجَنَّدَةٌ",
                "headingUrdu": "روحیں بھرتی ہونے والے فوجیوں کی طرح ہیں۔",
                "headingEnglish": "Souls are like recruited troops",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3188,
                "hadithNumber": "3337",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Once Allah's Messenger (ﷺ) stood amongst the people, glorified and praised Allah as He deserved and then mentioned the Dajjal saying, \"l warn you against him (i.e. the Dajjal) and there was no prophet but warned his nation against him. No doubt, Noah warned his nation against him but I tell you about him something of which no prophet told his nation before me. You should know that he is one-eyed, and Allah is not one-eyed.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم لوگوں میں خطبہ سنانے کھڑے ہوئے ۔ پہلے اللہ تعالیٰ کی ، اس کی شان کے مطابق ثنا بیان کی ، پھر دجال کا ذکر فرمایا اور فرمایا کہ میں تمہیں دجال کے فتنے سے ڈراتا ہوں اور کوئی نبی ایسا نہیں گزرا جس نے اپنی قوم کو اس سے نہ ڈرایا ہو ۔ نوح علیہ السلام نے بھی اپنی قوم کو اس سے ڈرایا تھا ۔ لیکن میں تمہیں اس کے بارے میں ایک ایسی بات بتاتا ہوں جو کسی نبی نے بھی اپنی قوم کو نہیں بتائی تھی ، تمہیں معلوم ہونا چاہئے کہ دجال کانا ہو گا اور اللہ تعالیٰ اس عیب سے پاک ہے ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں یونس نے ، انہیں زہری نے کہ سالم نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ سَالِمٌ وَقَالَ ابْنُ عُمَرَ ـ رضى الله عنهما قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي النَّاسِ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ، ثُمَّ ذَكَرَ الدَّجَّالَ، فَقَالَ ‏ \"‏ إِنِّي لأُنْذِرُكُمُوهُ، وَمَا مِنْ نَبِيٍّ إِلاَّ أَنْذَرَهُ قَوْمَهُ، لَقَدْ أَنْذَرَ نُوحٌ قَوْمَهُ، وَلَكِنِّي أَقُولُ لَكُمْ فِيهِ قَوْلاً لَمْ يَقُلْهُ نَبِيٌّ لِقَوْمِهِ، تَعْلَمُونَ أَنَّهُ أَعْوَرُ، وَأَنَّ اللَّهَ لَيْسَ بِأَعْوَرَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ عَزَّ وَجَلَّ: {وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَى قَوْمِهِ}",
                "headingUrdu": "اللہ عزوجل کا فرمان: ’’اور ہم نے نوح کو ان کی قوم کی طرف بھیجا‘‘۔",
                "headingEnglish": "The Statement of Allah Aza Wajal: \"And indeed We sent Nuh to his people...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3189,
                "hadithNumber": "3338",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Shall I not tell you about the Dajjal a story of which no prophet told his nation? The Dajjall is one-eyed and will bring with him what will resemble Hell and Paradise, and what he will call Paradise will be actually Hell; so I warn you (against him) as Noah warned his nation against him.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، کیوں نہ میں تمہیں دجال کے متعلق ایک ایسی بات بتا دوں جو کسی نبی نے اپنی قوم کو اب تک نہیں بتائی ۔ وہ کانا ہو گا اور جنت اور جہنم جیسی چیز لائے گا ۔ پس جسے وہ جنت کہے گا درحقیقت وہی دوزخ ہو گی اور میں تمہیں اس کے فتنے سے اسی طرح ڈراتا ہوں ، جیسے نوح علیہ السلام نے اپنی قوم کو ڈرایا تھا ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، ہم سے شیبان نے بیان کیا ، ان سے یحییٰ نے ، ان سے ابوسلمہ نے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، آپ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَلاَ أُحَدِّثُكُمْ حَدِيثًا عَنِ الدَّجَّالِ مَا حَدَّثَ بِهِ نَبِيٌّ قَوْمَهُ، إِنَّهُ أَعْوَرُ، وَإِنَّهُ يَجِيءُ مَعَهُ بِمِثَالِ الْجَنَّةِ وَالنَّارِ، فَالَّتِي يَقُولُ إِنَّهَا الْجَنَّةُ‏.‏ هِيَ النَّارُ، وَإِنِّي أُنْذِرُكُمْ كَمَا أَنْذَرَ بِهِ نُوحٌ قَوْمَهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3190,
                "hadithNumber": "3339",
                "englishNarrator": "Narrated Abu Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Noah and his nation will come (on the Day of Resurrection and Allah will ask (Noah), \"Did you convey (the Message)?' He will reply, 'Yes, O my Lord!' Then Allah will ask Noah's nation, 'Did Noah convey My Message to you?' They will reply, 'No, no prophet came to us.' Then Allah will ask Noah, 'Who will stand a witness for you?' He will reply, 'Muhammad and his followers (will stand witness for me).' So, I and my followers will stand as witnesses for him (that he conveyed Allah's Message).\" That is, (the interpretation) of the Statement of Allah: \"Thus we have made you a just and the best nation that you might be witnesses Over mankind ..\" (2.143)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( قیامت کے دن ) نوح علیہ السلام بارگاہ الٰہی میں حاضر ہوں گے ۔ اللہ تعالیٰ دریافت فرمائے گا ، کیا ( میرا پیغام ) تم نے پہنچا دیا تھا ؟ نوح علیہ السلام عرض کریں گے میں نے تیرا پیغام پہنچا دیا تھا ، اے رب العزت ! اب اللہ تعالیٰ ان کی امت سے دریافت فرمائے گا ، کیا ( نوح علیہ السلام نے ) تم تک میرا پیغام پہنچا دیا تھا ؟ وہ جواب دیں گے نہیں ، ہمارے پاس تیرا کوئی نبی نہیں آیا ۔ اس پر اللہ تعالیٰ نوح علیہ السلام سے دریافت فرمائے گا ، اس کے لیے آپ کی طرف سے کوئی گواہی بھی دے سکتا ہے ؟ وہ عرض کریں گے کہ محمد صلی اللہ علیہ وسلم اور ان کی امت ( کے لوگ میرے گواہ ہیں ) چنانچہ ہم اس بات کی شہادت دیں گے کہ نوح علیہ السلام نے پیغام خداوندی اپنی قوم تک پہنچایا تھا اور یہی مفہوم اللہ جل ذکرہ کے اس ارشاد کا ہے کہ ” اور اسی طرح ہم نے تمہیں امت وسط بنایا ‘ تاکہ تم لوگوں پر گواہی دو “ ۔ اور وسط کے معنی درمیانی کے ہیں ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، ہم سے عبدالواحد بن زیاد نے بیان کیا ، ہم سے اعمش نے بیان کیا ، ان سے ابوصالح نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَجِيءُ نُوحٌ وَأُمَّتُهُ فَيَقُولُ اللَّهُ تَعَالَى هَلْ بَلَّغْتَ فَيَقُولُ نَعَمْ، أَىْ رَبِّ‏.‏ فَيَقُولُ لأُمَّتِهِ هَلْ بَلَّغَكُمْ فَيَقُولُونَ لاَ، مَا جَاءَنَا مِنْ نَبِيٍّ‏.‏ فَيَقُولُ لِنُوحٍ مَنْ يَشْهَدُ لَكَ فَيَقُولُ مُحَمَّدٌ صلى الله عليه وسلم وَأُمَّتُهُ، فَنَشْهَدُ أَنَّهُ قَدْ بَلَّغَ، وَهْوَ قَوْلُهُ جَلَّ ذِكْرُهُ ‏{‏وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ‏}‏ وَالْوَسَطُ الْعَدْلُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3191,
                "hadithNumber": "3340",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "We were in the company of the Prophet (ﷺ) at a banquet and a cooked (mutton) forearm was set before him, and he used to like it. He ate a morsel of it and said, \"I will be the chief of all the people on the Day of Resurrection. Do you know how Allah will gather all the first and the last (people) in one level place where an observer will be able to see (all) of them and they will be able to hear the announcer, and the sun will come near to them. Some People will say: Don't you see, in what condition you are and the state to which you have reached? Why don't you look for a person who can intercede for you with your Lord? Some people will say: Appeal to your father, Adam.' They will go to him and say: 'O Adam! You are the father of all mankind, and Allah created you with His Own Hands, and ordered the angels to prostrate for you, and made you live in Paradise. Will you not intercede for us with your Lord? Don't you see in what (miserable) state we are, and to what condition we have reached?' On that Adam will reply, 'My Lord is so angry as He has never been before and will never be in the future; (besides), He forbade me (to eat from) the tree, but I disobeyed (Him), (I am worried about) myself! Myself! Go to somebody else; go to Noah.' They will go to Noah and say; 'O Noah! You are the first amongst the messengers of Allah to the people of the earth, and Allah named you a thankful slave. Don't you see in what a (miserable) state we are and to what condition we have reached? Will you not intercede for us with your Lord? Noah will reply: 'Today my Lord has become so angry as he had never been before and will never be in the future Myself! Myself! Go to the Prophet (Muhammad). The people will come to me, and I will prostrate myself underneath Allah's Throne. Then I will be addressed: 'O Muhammad! Raise your head; intercede, for your intercession will be accepted, and ask (for anything). for you will be given. \" Muhammad bin Obaid said: I have not remembered the complete Hadith.",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک دعوت میں شریک تھے ۔ آپ صلی اللہ علیہ وسلم کی خدمت میں دستی کا گوشت پیش کیا گیا جو آپ کو بہت مرغوب تھا ۔ آپ نے اس دستی کی ہڈی کا گوشت دانتوں سے نکال کر کھایا ۔ پھر فرمایا کہ میں قیامت کے دن لوگوں کا سردار ہوں گا ۔ تمہیں معلوم ہے کہ کس طرح اللہ تعالیٰ ( قیامت کے دن ) تمام مخلوق کو ایک چٹیل میدان میں جمع کرے گا ؟ اس طرح کہ دیکھنے والا سب کو ایک ساتھ دیکھ سکے گا ۔ آواز دینے والے کی آواز ہر جگہ سنی جا سکے گی اور سورج بالکل قریب ہو جائے گا ۔ ایک شخص اپنے قریب کے دوسرے شخص سے کہے گا ، دیکھتے نہیں کہ سب لوگ کیسی پریشانی میں مبتلا ہیں ؟ اور مصیبت کس حد تک پہنچ چکی ہے ؟ کیوں نہ کسی ایسے شخص کی تلاش کی جائے جو اللہ پاک کی بارگاہ میں ہم سب کی شفاعت کے لیے جائے ۔ کچھ لوگوں کا مشورہ ہو گا کہ دادا آدم علیہ السلام اس کے لیے مناسب ہیں ۔ چنانچہ لوگ ان کی خدمت میں حاضر ہوں گے اور عرض کریں گے ، اے باوا آدم ! آپ انسانوں کے دادا ہیں ۔ اللہ پاک نے آپ کو اپنے ہاتھ سے پیدا کیا تھا ، اپنی روح آپ کے اندر پھونکی تھی ، ملائکہ کو حکم دیا تھا اور انہوں نے آپ کو سجدہ کیا تھا اور جنت میں آپ کو ( پیدا کرنے کے بعد ) ٹھہرایا تھا ۔ آپ اپنے رب کے حضور میں ہماری شفاعت کر دیں ۔ آپ خود ملاحظہ فرما سکتے ہیں کہ ہم کس درجہ الجھن اور پریشانی میں مبتلا ہیں ۔ وہ فرمائیں گے کہ ( گناہ گاروں پر ) اللہ تعالیٰ آج اس درجہ غضبناک ہے کہ کبھی اتنا غضبناک نہیں ہوا تھا اور نہ آئندہ کبھی ہو گا اور مجھے پہلے ہی درخت ( جنت ) کے کھانے سے منع کر چکا تھا لیکن میں اس فرمان کو بجا لانے میں کوتاہی کر گیا ۔ آج تو مجھے اپنی ہی پڑی ہے ( نفسی نفسی ) تم لوگ کسی اور کے پاس جاؤ ۔ ہاں ، نوح علیہ السلام کے پاس جاؤ ۔ چنانچہ سب لوگ نوح علیہ السلام کی خدمت میں حاضر ہوں گے اور عرض کریں گے ، اے نوح علیہ السلام ! آپ ( آدم علیہ السلام کے بعد ) روئے زمین پر سب سے پہلے نبی ہیں اور اللہ تعالیٰ نے آپ کو ” عبدشکور “ کہہ کر پکارا ہے ۔ آپ ملاحظہ فرما سکتے ہیں کہ آج ہم کیسی مصیبت و پریشانی میں مبتلا ہیں ؟ آپ اپنے رب کے حضور میں ہماری شفاعت کر دیجئیے ۔ وہ بھی یہی جواب دیں گے کہ میرا رب آج اس درجہ غضبناک ہے کہ اس سے پہلے کبھی ایسا غضبناک نہیں ہوا تھا اور نہ کبھی اس کے بعد اتنا غضبناک ہو گا ۔ آج تو مجھے خود اپنی ہی فکر ہے ۔ ( نفسی نفسی ) تم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں جاؤ چنانچہ وہ لوگ میرے پاس آئیں گے ۔ میں ( ان کی شفاعت کے لیے ) عرش کے نیچے سجدے میں گر پڑوں گا ۔ پھر آواز آئے گی ، اے محمد ! سر اٹھاؤ اور شفاعت کرو ، تمہاری شفاعت قبول کی جائے گی ۔ مانگو تمہیں دیا جائے گا ۔ محمد بن عبیداللہ نے بیان کیا کہ ساری حدیث میں یاد نہ رکھ سکا ۔",
                "urduNarrator": "مجھ سے اسحاق بن نصر نے بیان کیا ، ہم سے محمد بن عبید نے بیان کیا ، ہم سے ابوحیان یحییٰ بن سعید نے بیان کیا ، ان سے ابوزرعہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا أَبُو حَيَّانَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي دَعْوَةٍ، فَرُفِعَ إِلَيْهِ الذِّرَاعُ، وَكَانَتْ تُعْجِبُهُ، فَنَهَسَ مِنْهَا نَهْسَةً وَقَالَ ‏ \"‏ أَنَا سَيِّدُ الْقَوْمِ يَوْمَ الْقِيَامَةِ، هَلْ تَدْرُونَ بِمَنْ يَجْمَعُ اللَّهُ الأَوَّلِينَ وَالآخِرِينَ فِي صَعِيدٍ وَاحِدٍ فَيُبْصِرُهُمُ النَّاظِرُ وَيُسْمِعُهُمُ الدَّاعِي، وَتَدْنُو مِنْهُمُ الشَّمْسُ، فَيَقُولُ بَعْضُ النَّاسِ أَلاَ تَرَوْنَ إِلَى مَا أَنْتُمْ فِيهِ، إِلَى مَا بَلَغَكُمْ، أَلاَ تَنْظُرُونَ إِلَى مَنْ يَشْفَعُ لَكُمْ إِلَى رَبِّكُمْ فَيَقُولُ بَعْضُ النَّاسِ أَبُوكُمْ آدَمُ، فَيَأْتُونَهُ فَيَقُولُونَ يَا آدَمُ أَنْتَ أَبُو الْبَشَرِ، خَلَقَكَ اللَّهُ بِيَدِهِ وَنَفَخَ فِيكَ مِنْ رُوحِهِ، وَأَمَرَ الْمَلاَئِكَةَ فَسَجَدُوا لَكَ، وَأَسْكَنَكَ الْجَنَّةَ، أَلاَ تَشْفَعُ لَنَا إِلَى رَبِّكَ أَلاَ تَرَى مَا نَحْنُ فِيهِ وَمَا بَلَغَنَا فَيَقُولُ رَبِّي غَضِبَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ، وَلاَ يَغْضَبُ بَعْدَهُ مِثْلَهُ، وَنَهَانِي عَنِ الشَّجَرَةِ فَعَصَيْتُهُ، نَفْسِي نَفْسِي، اذْهَبُوا إِلَى غَيْرِي، اذْهَبُوا إِلَى نُوحٍ‏.‏ فَيَأْتُونَ نُوحًا فَيَقُولُونَ يَا نُوحُ أَنْتَ أَوَّلُ الرُّسُلِ إِلَى أَهْلِ الأَرْضِ، وَسَمَّاكَ اللَّهُ عَبْدًا شَكُورًا، أَمَا تَرَى إِلَى مَا نَحْنُ فِيهِ أَلاَ تَرَى إِلَى مَا بَلَغَنَا أَلاَ تَشْفَعُ لَنَا إِلَى رَبِّكَ فَيَقُولُ رَبِّي غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ، وَلاَ يَغْضَبُ بَعْدَهُ مِثْلَهُ، نَفْسِي نَفْسِي، ائْتُوا النَّبِيَّ صلى الله عليه وسلم، فَيَأْتُونِي، فَأَسْجُدُ تَحْتَ الْعَرْشِ فَيُقَالُ يَا مُحَمَّدُ ارْفَعْ رَأْسَكَ وَاشْفَعْ تُشَفَّعْ، وَسَلْ تُعْطَهُ ‏\"‏‏.‏ قَالَ مُحَمَّدُ بْنُ عُبَيْدٍ لاَ أَحْفَظُ سَائِرَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3192,
                "hadithNumber": "3341",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) recited the following Verse) in the usual tone: 'Fahal-Min-Muddalkir.' (54.15)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ( آیت ) » فہل من مدکر « مشہور قرآت کے مطابق ( ادغام کے ساتھ ) تلاوت فرمائی تھی ۔",
                "urduNarrator": "ہم سے نصر بن علی بن نصر نے بیان کیا ، انہوں نے کہا ہم کو ابواحمد نے خبر دی ، انہیں سفیان نے انہیں ابواسحاق نے انہیں اسود بن یزید نے اور انہیں عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيِّ بْنِ نَصْرٍ، أَخْبَرَنَا أَبُو أَحْمَدَ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَرَأَ ‏{‏فَهَلْ مِنْ مُدَّكِرٍ‏}‏ مِثْلَ قِرَاءَةِ الْعَامَّةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3193,
                "hadithNumber": "3342",
                "englishNarrator": "Narrated Abu Dhar رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"While I was at Makkah, the roof of my house was opened and Jibril descended, opened my chest, and washed it with Zamzam water. Then he brought a golden tray full of wisdom and faith, and having poured its contents into my chest, he closed it. Then he took my hand and ascended with me to the heaven. When Jibril reached the nearest heaven, he said to the gatekeeper of the heaven, 'Open (the gate).' The gatekeeper asked, 'who is it?' Jibril answered, 'Jibril'. He asked, 'Is there anyone with you?' Jibril replied, 'Muhammad (ﷺ) is with me.' He asked, 'Has he been called?', Jibril said, 'Yes'. So, the gate was opened and we went over the nearest heaven, and there we saw a man sitting with Aswida (a large number of people) of his right and Aswida on his left. When he looked towards his right, he laughed and when he looked towards his left he wept. He said (to me), 'Welcome, O pious Prophet and pious son'. I said, 'Who is this man O Jibril?' Jibril replied, 'He is Adam, and the people on his right and left are the souls of his offspring. Those on the right are the people of Paradise, and those on the left are the people of the (Hell) Fire. So, when he looks to the right, he laughs, and when he looks to the left he weeps.' Then Jibril ascended with me till he reached the second heaven and said to the gatekeeper, 'Open (the gate).' The gatekeeper said to him the same as the gatekeeper of the first heaven has said, and he opened the gate.\" Anas رضی اللہ عنہ added: Abu Dhar رضی اللہ عنہ mentioned that Prophet (ﷺ) met Idris, Musa (Moses), 'Isa (Jesus) and Ibrahim (Abraham) over the heavens, but he did not specify their places (i.e., on which heavens each of them was), but he mentioned that he (the Prophet (ﷺ)) had met Adam on the nearest heaven, and Ibrahim on the sixth. Anas رضی اللہ عنہ said, \"When Jibril and the Prophet (ﷺ) passed by Idris, the latter said, 'Welcome, O pious Prophet and pious brother!' the Prophet (ﷺ) asked, 'Who is he?' Jibril said, 'He is Idris.' \" The Prophet (ﷺ) added, \"Then I passed by Musa who said, 'Welcome, O pious Prophet and pious brother!' I said, 'Who is he?' Jibril said, 'He is Musa.' Then I passed by 'Isa who said, 'Welcome, O pious Prophet and pious brother!' I said, 'Who is he?' He replied, 'He is 'Isa.' Then I passed by the Prophet (ﷺ) Ibrahim who said, 'Welcome, O pious Prophet and pious son!' I said, 'Who is he?' Jibril replied, 'He is Ibrahim'.\" Narrated Ibn 'Abbas and Abu Haiyya Al-Ansari: The Prophet (ﷺ) said, \"Then Jibril ascended with me to a place where I heard the creaking of pens.\" Ibn Hazm and Anas bin Malik state the Prophet (ﷺ) said, \"Allah enjoined fifty Salat (prayers) on me. When I returned with this order of Allah, I passed by Musa who asked me, 'What has Allah enjoined on your followers?' I replied, 'He has enjoined fifty Salat (prayers) on them.' On the Musa said to me, 'Go back to your Lord (and appeal for reduction), for your followers will not be able to bear it.' So, I returned to my Lord and asked for some reduction, and He reduced it to half. When I passed by Musa again and informed him about it, he once more said to me, 'Go back to your Lord, for your followers will not be able to bear it.' So, I returned to my Lord similarly as before, and half of it was reduced. I again passed by Musa and he said to me, 'Go back to your Lord, for your followers will not be able to bear it.' I again returned to my Lord and He said, 'These are five (Salat-prayers) and they are all (equal to) fifty (in reward), for My Word does not change.' I returned to Musa, he again told me to return to my Lord (for further reduction) but I said to him 'I feel shy of asking my Lord now.' Then Jibril took me till we reached Sidrat-ul-Muntaha (i.e., lote tree of utmost boundary) which was shrouded in colors indescribable. Then I was admitted into Paradise where I found small tents (made) of pearls and its earth was musk (a kind of perfume).\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میرے گھر کی چھت کھولی گئی ۔ میرا قیام ان دنوں مکہ میں تھا ۔ پھر جبرائیل علیہ السلام اترے اور میرا سینہ چاک کیا اور اسے زمزم کے پانی سے دھویا ۔ اس کے بعد سونے کا ایک طشت لائے جو حکمت اور ایمان سے لبریز تھا ، اسے میرے سینے میں انڈیل دیا ۔ پھر میرا ہاتھ پکڑ کر آسمان کی طرف لے کر چلے ، جب آسمان دنیا پر پہنچے تو جبرائیل علیہ السلام نے آسمان کے داروغہ سے کہا کہ دروازہ کھولو ، پوچھا کہ کون صاحب ہیں ؟ انہوں نے جواب دیا کہ میں جبرائیل ، پھر پوچھا کہ آپ کے ساتھ کوئی اور بھی ہے ؟ جواب دیا کہ میرے ساتھ محمد صلی اللہ علیہ وسلم ہیں ، پوچھا کہ انہیں لانے کے لیے آپ کو بھیجا گیا تھا ۔ جواب دیا کہ ہاں ، اب دروازہ کھلا ، جب ہم آسمان پر پہنچے تو وہاں ایک بزرگ سے ملاقات ہوئی ، کچھ انسانی روحیں ان کے دائیں طرف تھیں اور کچھ بائیں طرف ، جب وہ دائیں طرف دیکھتے تو ہنس دیتے اور جب بائیں طرف دیکھتے تو رو پڑتے ۔ انہوں نے کہا خوش آمدید ، نیک نبی نیک بیٹے ! میں نے پوچھا ، جبرائیل ! یہ صاحب کون بزرگ ہیں ؟ تو انہوں نے بتایا کہ یہ آدم علیہ السلام ہیں اور یہ انسانی روحیں ان کے دائیں اور بائیں طرف تھیں ان کی اولاد بنی آدم کی روحیں تھیں ان کے جو دائیں طرف تھیں وہ جنتی تھیں اور جو بائیں طرف تھیں وہ دوزخی تھیں ، اسی لیے جب وہ دائیں طرف دیکھتے تو مسکراتے اور جب بائیں طرف دیکھتے تو روتے تھے ، پھر جبرائیل علیہ السلام مجھے اوپر لے کر چڑھے اور دوسرے آسمان پر آئے ، اس آسمان کے داروغہ سے بھی انہوں نے کہا کہ دروازہ کھولو ، انہوں نے بھی اسی طرح کے سوالات کئے جو پہلے آسمان پر ہو چکے تھے ، پھر دروازہ کھولا ، انس رضی اللہ عنہ نے بیان کیا کہ حضرت ابوذر رضی اللہ عنہ نے تفصیل سے بتایا کہ آنحضرت صلی اللہ علیہ وسلم نے مختلف آسمانوں پر ادریس ، موسیٰ عیسیٰ اور ابراہیم علیہم السلام کو پایا ، لیکن انہوں نے ان انبیاء کرام کے مقامات کی کوئی تخصیص نہیں کی ، صرف اتنا کہا کہ آنحضرت صلی اللہ علیہ وسلم نے آدم علیہ السلام کو آسمان دنیا ( پہلے آسمان پر ) پایا اور ابراہیم علیہ السلام کو چھٹے پر اور حضرت انس رضی اللہ عنہ نے بیان کیا کہ پھر جب جبرائیل علیہ السلام ادریس علیہ السلام کے پاس سے گزرے تو انہوں نے کہا خوش آمدید ، نیک نبی نیک بھائی ، میں نے پوچھا کہ یہ کون صاحب ہیں ؟ جبرائیل علیہ السلام نے بتایا کہ یہ ادریس علیہ السلام ہیں ، پھر میں عیسیٰ علیہ السلام کے پاس سے گزرا ، انہوں نے بھی کہا خوش آمدید نیک نبی نیک بھائی ، میں نے پوچھا یہ کون صاحب ہیں ؟ تو بتایا کہ عیسیٰ علیہ السلام ۔ پھر ابراہیم علیہ السلام کے پاس سے گزرا تو انہوں نے فرمایا کہ خوش آمدید نیک نبی اور نیک بیٹے ، میں نے پوچھا یہ کون صاحب ہیں ؟ جواب دیا کہ یہ ابراہیم علیہ السلام ہیں ، ابن شہاب سے زہری نے بیان کیا اور مجھے ایوب بن حزم نے خبر دی کہ ابن عباس رضی اللہ عنہما اور ابوحیہ انصاری رضی اللہ عنہم بیان کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا پھر مجھے اوپر لے کر چڑھے اور میں اتنے بلند مقام پر پہنچ گیا جہاں سے قلم کے لکھنے کی آواز صاف سننے لگی تھی ، ابوبکر بن حزم نے بیان کیا اور انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا پھر اللہ تعالیٰ نے پچاس وقت کی نمازیں مجھ پر فرض کیں ۔ میں اس فریضہ کے ساتھ واپس ہوا اور جب موسیٰ علیہ السلام کے پاس سے گزرا تو انہوں نے پوچھا کہ آپ کی امت پر کیا چیز فرض کی گئی ہے ؟ میں نے جواب دیا کہ پچاس وقت کی نمازیں ان پر فرض ہوئی ہیں ۔ انہوں نے کہا کہ آپ اپنے رب کے پاس واپس جائیں ، کیونکہ آپ کی امت میں اتنی نمازوں کی طاقت نہیں ہے ، چنانچہ میں واپس ہوا اور رب العالمین کے دربار میں مراجعت کی ، اس کے نتیجے میں اس کا ایک حصہ کم کر دیا گیا ، پھر میں موسیٰ علیہ السلام کے پاس آیا اور اس مرتبہ بھی انہوں نے کہا کہ اپنے رب سے پھر مراجعت کریں پھر انہوں نے اپنی تفصیلات کا ذکر کیا کہ رب العالمین نے ایک حصہ کی پھر کمی کر دی ، پھر میں موسیٰ علیہ السلام کے پاس آیا اور انہیں خبر کی ، انہوں نے کہا کہ آپ اپنے رب سے مراجعت کریں ، کیونکہ آپ کی امت میں اس کی بھی طاقت نہیں ہے ، پھر میں واپس ہوا اور اپنے رب سے پھر مراجعت کی ، اللہ تعالیٰ نے اس مرتبہ فرما دیا کہ نمازیں پانچ وقت کی کر دی گئیں اور ثواب پچاس نمازوں کا ہی باقی رکھا گیا ، ہمارا قول بدلا نہیں کرتا ۔ پھر میں موسیٰ علیہ السلام کے پاس آیا تو انہوں نے اب بھی اسی پر زور دیا کہ اپنے رب سے آپ کو پھر مراجعت کرنی چاہئے ۔ لیکن میں نے کہا کہ مجھے اللہ پاک سے باربار درخواست کرتے ہوئے اب شرم آتی ہے ۔ پھر جبرائیل علیہ السلام مجھے لے کر آگے بڑھے اور سدرۃالمنتہیٰ کے پاس لائے جہاں مختلف قسم کے رنگ نظر آئے ، جنہوں نے اس درخت کو چھپا رکھا تھا میں نہیں جانتا کہ وہ کیا تھے ۔ اس کے بعد مجھے جنت میں داخل کیا گیا تو میں نے دیکھا کہ موتی کے گنبد بنے ہوئے ہیں اور اس کی مٹی مشک کی طرح خوشبودار تھی ۔",
                "urduNarrator": "عبدان نے کہا کہ ہمیں عبداللہ نے خبر دی ، انہیں یونس نے خبر دی اور انہیں زہری نے ، ( دوسری سند ) اور ہم سے احمد بن صالح نے بیان کیا ، کہا ہم سے عنبسہ نے ، ان سے یونس نے ، ان سے ابن شہاب نے بیان کیا اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ ابوذر رضی اللہ عنہ بیان کرتے تھے کہ",
                "hadithArabic": "قَالَ عَبْدَانُ أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، ح حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَنْبَسَةُ، حَدَّثَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ قَالَ أَنَسٌ كَانَ أَبُو ذَرٍّ ـ رضى الله عنه ـ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ فُرِجَ سَقْفُ بَيْتِي وَأَنَا بِمَكَّةَ، فَنَزَلَ جِبْرِيلُ، فَفَرَجَ صَدْرِي، ثُمَّ غَسَلَهُ بِمَاءِ زَمْزَمَ، ثُمَّ جَاءَ بِطَسْتٍ مِنْ ذَهَبٍ مُمْتَلِئٍ حِكْمَةً وَإِيمَانًا فَأَفْرَغَهَا فِي صَدْرِي، ثُمَّ أَطْبَقَهُ ثُمَّ أَخَذَ بِيَدِي، فَعَرَجَ بِي إِلَى السَّمَاءِ، فَلَمَّا جَاءَ إِلَى السَّمَاءِ الدُّنْيَا، قَالَ جِبْرِيلُ لِخَازِنِ السَّمَاءِ افْتَحْ‏.‏ قَالَ مَنْ هَذَا قَالَ هَذَا جِبْرِيلُ‏.‏ قَالَ مَعَكَ أَحَدٌ قَالَ مَعِيَ مُحَمَّدٌ‏.‏ قَالَ أُرْسِلَ إِلَيْهِ قَالَ نَعَمْ، فَافْتَحْ‏.‏ فَلَمَّا عَلَوْنَا السَّمَاءَ إِذَا رَجُلٌ عَنْ يَمِينِهِ أَسْوِدَةٌ، وَعَنْ يَسَارِهِ أَسْوِدَةٌ، فَإِذَا نَظَرَ قِبَلَ يَمِينِهِ ضَحِكَ، وَإِذَا نَظَرَ قِبَلَ شِمَالِهِ بَكَى فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالاِبْنِ الصَّالِحِ‏.‏ قُلْتُ مَنْ هَذَا يَا جِبْرِيلُ قَالَ هَذَا آدَمُ، وَهَذِهِ الأَسْوِدَةُ عَنْ يَمِينِهِ، وَعَنْ شِمَالِهِ نَسَمُ بَنِيهِ، فَأَهْلُ الْيَمِينِ مِنْهُمْ أَهْلُ الْجَنَّةِ، وَالأَسْوِدَةُ الَّتِي عَنْ شِمَالِهِ أَهْلُ النَّارِ، فَإِذَا نَظَرَ قِبَلَ يَمِينِهِ ضَحِكَ، وَإِذَا نَظَرَ قِبَلَ شِمَالِهِ بَكَى، ثُمَّ عَرَجَ بِي جِبْرِيلُ، حَتَّى أَتَى السَّمَاءَ الثَّانِيَةَ، فَقَالَ لِخَازِنِهَا افْتَحْ‏.‏ فَقَالَ لَهُ خَازِنُهَا مِثْلَ مَا قَالَ الأَوَّلُ، فَفَتَحَ ‏\"‏‏.‏ قَالَ أَنَسٌ فَذَكَرَ أَنَّهُ وَجَدَ فِي السَّمَوَاتِ إِدْرِيسَ وَمُوسَى وَعِيسَى وَإِبْرَاهِيمَ، وَلَمْ يُثْبِتْ لِي كَيْفَ مَنَازِلُهُمْ، غَيْرَ أَنَّهُ قَدْ ذَكَرَ أَنَّهُ وَجَدَ آدَمَ فِي السَّمَاءِ الدُّنْيَا، وَإِبْرَاهِيمَ فِي السَّادِسَةِ‏.‏ وَقَالَ أَنَسٌ فَلَمَّا مَرَّ جِبْرِيلُ بِإِدْرِيسَ‏.‏ قَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالأَخِ الصَّالِحِ‏.‏ فَقُلْتُ مَنْ هَذَا قَالَ هَذَا إِدْرِيسُ، ثُمَّ مَرَرْتُ بِمُوسَى فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالأَخِ الصَّالِحِ‏.‏ قُلْتُ مَنْ هَذَا قَالَ هَذَا مُوسَى‏.‏ ثُمَّ مَرَرْتُ بِعِيسَى، فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالأَخِ الصَّالِحِ‏.‏ قُلْتُ مَنْ هَذَا قَالَ عِيسَى‏.‏ ثُمَّ مَرَرْتُ بِإِبْرَاهِيمَ، فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالاِبْنِ الصَّالِحِ‏.‏ قُلْتُ مَنْ هَذَا قَالَ هَذَا إِبْرَاهِيمُ‏.‏ قَالَ وَأَخْبَرَنِي ابْنُ حَزْمٍ أَنَّ ابْنَ عَبَّاسٍ وَأَبَا حَبَّةَ الأَنْصَارِيَّ كَانَا يَقُولاَنِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ثُمَّ عُرِجَ بِي حَتَّى ظَهَرْتُ لِمُسْتَوًى أَسْمَعُ صَرِيفَ الأَقْلاَمِ ‏\"‏‏.‏ قَالَ ابْنُ حَزْمٍ وَأَنَسُ بْنُ مَالِكٍ ـ رضى الله عنهما ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَفَرَضَ اللَّهُ عَلَىَّ خَمْسِينَ صَلاَةً، فَرَجَعْتُ بِذَلِكَ حَتَّى أَمُرَّ بِمُوسَى، فَقَالَ مُوسَى مَا الَّذِي فُرِضَ عَلَى أُمَّتِكَ قُلْتُ فَرَضَ عَلَيْهِمْ خَمْسِينَ صَلاَةً‏.‏ قَالَ فَرَاجِعْ رَبَّكَ، فَإِنَّ أُمَّتَكَ لاَ تُطِيقُ ذَلِكَ‏.‏ فَرَجَعْتُ فَرَاجَعْتُ رَبِّي فَوَضَعَ شَطْرَهَا، فَرَجَعْتُ إِلَى مُوسَى، فَقَالَ رَاجِعْ رَبَّكَ، فَذَكَرَ مِثْلَهُ، فَوَضَعَ شَطْرَهَا، فَرَجَعْتُ إِلَى مُوسَى، فَأَخْبَرْتُهُ فَقَالَ رَاجِعْ رَبَّكَ، فَإِنَّ أُمَّتَكَ لاَ تُطِيقُ ذَلِكَ، فَرَجَعْتُ فَرَاجَعْتُ رَبِّي فَقَالَ هِيَ خَمْسٌ، وَهْىَ خَمْسُونَ، لاَ يُبَدَّلُ الْقَوْلُ لَدَىَّ‏.‏ فَرَجَعْتُ إِلَى مُوسَى، فَقَالَ رَاجِعْ رَبَّكَ‏.‏ فَقُلْتُ قَدِ اسْتَحْيَيْتُ مِنْ رَبِّي، ثُمَّ انْطَلَقَ، حَتَّى أَتَى السِّدْرَةَ الْمُنْتَهَى، فَغَشِيَهَا أَلْوَانٌ لاَ أَدْرِي مَا هِيَ، ثُمَّ أُدْخِلْتُ ‏{‏الْجَنَّةَ‏}‏ فَإِذَا فِيهَا جَنَابِذُ اللُّؤْلُؤِ وَإِذَا تُرَابُهَا الْمِسْكُ ‏\"‏‏.‏",
                "headingArabic": "ذِكْرِ إِدْرِيسَ عَلَيْهِ السَّلاَمُ وَقَوْلِ اللَّهِ تَعَالَى: {وَرَفَعْنَاهُ مَكَانًا عَلِيًّا}",
                "headingUrdu": "ادریس علیہ السلام کا حوالہ",
                "headingEnglish": "The reference to Idris alayhis-salam",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3194,
                "hadithNumber": "3343",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I have been made victorious with As-Saba (i.e. an easterly wind) and the people of 'Ad were destroyed by Ad-Dabur (i.e. a westerly wind).\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( غزوہ خندق کے موقع پر ) پروا ہوا سے میری مدد کی گئی اور قوم عاد پچھوا ہوا سے ہلاک کر دی گئی تھی ۔",
                "urduNarrator": "ہم سے محمد بن عرعرہ نے بیان کیا ، ہم سے شعبہ نے بیان کیا ، ان سے حکم نے ، ان سے مجاہد نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ نُصِرْتُ بِالصَّبَا، وَأُهْلِكَتْ عَادٌ بِالدَّبُورِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَإِلَى عَادٍ أَخَاهُمْ هُودًا قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ}، وَقَوْلِهِ: {إِذْ أَنْذَرَ قَوْمَهُ بِالأَحْقَافِ} إِلَى قَوْلِهِ تَعَالَى: {كَذَلِكَ نَجْزِي الْقَوْمَ الْمُجْرِمِينَ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور عاد کی طرف ہم نے ان کے بھائی ہود کو بھیجا‘‘۔",
                "headingEnglish": "The Statement of Allah Taa'la: \"And to 'Ad (people, We sent), their brother Hud.\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3195,
                "hadithNumber": "3344",
                "englishNarrator": "Narrated Abu Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "`Ali رضی اللہ عنہ sent a piece of gold to the Prophet (ﷺ) who distributed it among four persons: Al-Aqra' bin H`Abis Al-Hanzali from the tribe of Mujashi, 'Uyaina bin Badr Al-Fazari, Zaid at-Ta'i who belonged to (the tribe of) Bani Nahban, and 'Alqama bin Ulatha Al-`Amir who belonged to (the tribe of) Bani Kilab. So the Quraish and the Ansar became angry and said, \"He (i.e. the Prophet, ) gives the chief of Najd and does not give us.\" The Prophet (ﷺ) said, \"I give them) so as to attract their hearts (to Islam).\" Then a man with sunken eyes, prominent checks, a raised forehead, a thick beard and a shaven head, came (in front of the Prophet (ﷺ) ) and said, \"Be afraid of Allah, O Muhammad!\" The Prophet (ﷺ) ' said \"Who would obey Allah if I disobeyed Him? (Is it fair that) Allah has trusted all the people of the earth to me while, you do not trust me?\" Somebody who, I think was Khalid bin Al-Walid, requested the Prophet (ﷺ) to let him chop that man's head off, but he prevented him. When the man left, the Prophet (ﷺ) said, \"Among the off-spring of this man will be some who will recite the Qur'an but the Qur'an will not reach beyond their throats (i.e. they will recite like parrots and will not understand it nor act on it), and they will renegade from the religion as an arrow goes through the game's body. They will kill the Muslims but will not disturb the idolaters. If I should live up to their time' I will kill them as the people of 'Ad were killed (i.e. I will kill all of them).\"",
                "hadithUrdu": "حضرت علی رضی اللہ عنہ نے ( یمن سے ) نبی کریم صلی اللہ علیہ وسلم کی خدمت میں کچھ سونا بھیجا تو آپ نے اسے چار آدمیوں میں تقسیم کر دیا ، اقرع بن حابس حنظلی ثم المجاشعی ، عیینہ بن بدر فزاری ، زید طائی بنی نبہان والے اور علقمہ بن علاثہ عامری بنو کلاب والے ، اس پر قریش اور انصار کے لوگوں کو غصہ آیا اور کہنے لگے کہ آنحضرت صلی اللہ علیہ وسلم نے نجد کے بڑوں کو تو دیا لیکن ہمیں نظرانداز کر دیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں صرف ان کے دل ملانے کے لیے انہیں دیتا ہوں ( کیونکہ ابھی حال ہی میں یہ لوگ مسلمان ہوئے ہیں ) پھر ایک شخص سامنے آیا ، اس کی آنکھیں دھنسی ہوئی تھیں ، کلے پھولے ہوئے تھے ، پیشانی بھی اٹھی ہوئی ، ڈاڑھی بہت گھنی تھی اور سر منڈا ہوا تھا ۔ اس نے کہا اے محمد ! اللہ سے ڈرو ( صلی اللہ علیہ وسلم ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، اگر میں ہی اللہ کی نافرمانی کروں گا تو پھر اس کی فرمانبرداری کون کرے گا ؟ اللہ تعالیٰ نے مجھے روئے زمین پر دیانت دار بنا کر بھیجا ہے ۔ کیا تم مجھے امین نہیں سمجھتے ؟ اس شخص کی اس گستاخی پر ایک صحابی نے اس کے قتل کی اجازت چاہی ، میرا خیال ہے کہ یہ حضرت خالد بن ولید تھے ، لیکن آنحضرت صلی اللہ علیہ وسلم نے انہیں اس سے روک دیا ، پھر وہ شخص وہاں سے چلنے لگا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا اس شخص کی نسل سے یا ( آپ صلی اللہ علیہ وسلم نے فرمایا کہ ) اس شخص کے بعد اسی کی قوم سے ایسے لوگ جھوٹے مسلمان پیدا ہوں گے ، جو قرآن کی تلاوت تو کریں گے ، لیکن قرآن مجید ان کے حلق سے نیچے نہیں اترے گا ، دین سے وہ اس طرح نکل جائیں گے جیسے تیر کمان سے نکل جاتاہے ، یہ مسلمانوں کو قتل کریں گے اور بت پرستوں کو چھوڑ دیں گے ، اگر میری زندگی اس وقت تک باقی رہے تو میں ان کو اس طرح قتل کروں گا جیسے قوم عاد کا ( عذاب الٰہی سے ) قتل ہوا تھا کہ ایک بھی باقی نہ بچا ۔",
                "urduNarrator": "( حضرت امام بخاری رحمہ اللہ نے کہا ) کہ ابن کثیر نے بیان کیا ، ان سے سفیان ثوری نے ، ان سے ان کے والد نے ، ان سے ابن ابی نعیم نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "قَالَ وَقَالَ ابْنُ كَثِيرٍ عَنْ سُفْيَانَ، عَنْ أَبِيهِ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ بَعَثَ عَلِيٌّ ـ رضى الله عنه ـ إِلَى النَّبِيِّ صلى الله عليه وسلم بِذُهَيْبَةٍ فَقَسَمَهَا بَيْنَ الأَرْبَعَةِ الأَقْرَعِ بْنِ حَابِسٍ الْحَنْظَلِيِّ ثُمَّ الْمُجَاشِعِيِّ، وَعُيَيْنَةَ بْنِ بَدْرٍ الْفَزَارِيِّ، وَزَيْدٍ الطَّائِيِّ ثُمَّ أَحَدِ بَنِي نَبْهَانَ، وَعَلْقَمَةَ بْنِ عُلاَثَةَ الْعَامِرِيِّ ثُمَّ أَحَدِ بَنِي كِلاَبٍ، فَغَضِبَتْ قُرَيْشٌ وَالأَنْصَارُ، قَالُوا يُعْطِي صَنَادِيدَ أَهْلِ نَجْدٍ وَيَدَعُنَا‏.‏ قَالَ ‏\"‏ إِنَّمَا أَتَأَلَّفُهُمْ ‏\"‏‏.‏ فَأَقْبَلَ رَجُلٌ غَائِرُ الْعَيْنَيْنِ مُشْرِفُ الْوَجْنَتَيْنِ، نَاتِئُ الْجَبِينِ، كَثُّ اللِّحْيَةِ، مَحْلُوقٌ فَقَالَ اتَّقِ اللَّهَ يَا مُحَمَّدُ‏.‏ فَقَالَ ‏\"‏ مَنْ يُطِعِ اللَّهَ إِذَا عَصَيْتُ، أَيَأْمَنُنِي اللَّهُ عَلَى أَهْلِ الأَرْضِ فَلاَ تَأْمَنُونِي ‏\"‏‏.‏ فَسَأَلَهُ رَجُلٌ قَتْلَهُ ـ أَحْسِبُهُ خَالِدَ بْنَ الْوَلِيدِ ـ فَمَنَعَهُ، فَلَمَّا وَلَّى قَالَ ‏\"‏ إِنَّ مِنْ ضِئْضِئِ هَذَا ـ أَوْ فِي عَقِبِ هَذَا ـ قَوْمٌ يَقْرَءُونَ الْقُرْآنَ، لاَ يُجَاوِزُ حَنَاجِرَهُمْ، يَمْرُقُونَ مِنَ الدِّينِ مُرُوقَ السَّهْمِ مِنَ الرَّمِيَّةِ، يَقْتُلُونَ أَهْلَ الإِسْلاَمِ، وَيَدَعُونَ أَهْلَ الأَوْثَانِ، لَئِنْ أَنَا أَدْرَكْتُهُمْ لأَقْتُلَنَّهُمْ قَتْلَ عَادٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3196,
                "hadithNumber": "3345",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "I heard the Prophet (ﷺ) reciting: \"Fahal Min Muddakir.\" (See Hadith No. 557)",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آپ آیت فہل من مدکر کی تلاوت فرما رہے تھے ۔",
                "urduNarrator": "ہم سے خالد بن یزید نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے ابواسحاق نے ان سے اسود نے کہا کہ میں نے حضرت عبداللہ بن مسعود رضی اللہ عنہما سے سنا ، وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا خَالِدُ بْنُ يَزِيدَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ ‏{‏فَهَلْ مِنْ مُدَّكِرٍ ‏}‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3197,
                "hadithNumber": "3346",
                "englishNarrator": "Narrated Zainab bint Jahsh:",
                "hadithEnglish": "The Prophet (ﷺ) once came to her in a state of fear and said, \"None has the right to be worshipped but Allah. Woe unto the Arabs from a danger that has come near. An opening has been made in the wall of Gog and Magog like this,\" making a circle with his thumb and index finger. Zainab bint Jahsh رضی اللہ عنہا said, \"O Allah's Messenger (ﷺ)! Shall we be destroyed even though there are pious persons among us?\" He said, \"Yes, when the evil person will increase.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ان کے یہاں تشریف لائے آپ کچھ گھبرائے ہوئے تھے ۔ پھر آپ نے فرمایا کہ اللہ کے سوا اور کوئی معبود نہیں ، ملک عرب میں اس برائی کی وجہ سے بربادی آ جائے گی جس کے دن قریب آنے کو ہیں ، آج یاجوج ماجوج نے دیوار میں اتنا سوراخ کر دیا ہے پھر آنحضرت صلی اللہ علیہ وسلم نے انگوٹھے اور اس کے قریب کی انگلی سے حلقہ بنا کر بتلایا ۔ ام المؤمنین حضرت زینب بنت جحش رضی اللہ عنہا نے بیان کیا کہ میں نے سوال کیا یا رسول اللہ ! کیا ہم اس کے باوجود ہلاک کر دئیے جائیں گے کہ ہم میں نیک لوگ بھی موجود ہوں گے ؟ آپ نے فرمایا کہ جب فسق و فجور بڑھ جائے گا ( تو یقیناً بربادی ہو گی ) ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عروہ بن زبیر نے اور ان سے حضرت زینب بنت ابی سلمہ رضی اللہ عنہا نے ، ان سے ام حبیبہ بنت ابی سفیان نے ، ان سے زینب بنت جحش رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ، حَدَّثَتْهُ عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَ، عَنْ زَيْنَبَ ابْنَةِ جَحْشٍ ـ رضى الله عنهن أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَيْهَا فَزِعًا يَقُولُ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدِ اقْتَرَبَ فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ ‏\"‏‏.‏ وَحَلَّقَ بِإِصْبَعِهِ الإِبْهَامِ وَالَّتِي تَلِيهَا‏.‏ قَالَتْ زَيْنَبُ ابْنَةُ جَحْشٍ فَقُلْتُ يَا رَسُولَ اللَّهِ أَنَهْلِكُ وَفِينَا الصَّالِحُونَ قَالَ ‏\"‏ نَعَمْ، إِذَا كَثُرَ الْخُبْثُ ‏\"‏‏.‏",
                "headingArabic": "قِصَّةِ يَأْجُوجَ وَمَأْجُوجَ",
                "headingUrdu": "یاجوج ماجوج کا قصہ",
                "headingEnglish": "The story of Gog and Magog",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3198,
                "hadithNumber": "3347",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah has made an opening in the wall of the Gog and Magog (people) like this, and he made with his hand (with the help of his fingers).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ پاک نے یاجوج ماجوج کی دیوار سے اتنا کھول دیا ہے ، پھر آپ نے اپنی انگلیوں سے نوے کا عدد بنا کر بتلایا ۔",
                "urduNarrator": "ہمیں مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے وہیب نے ، ان سے ابن طاوس نے ، ان سے ان کے والد طاوس نے ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ فَتَحَ اللَّهُ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلَ هَذَا ‏\"‏‏.‏ وَعَقَدَ بِيَدِهِ تِسْعِينَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3199,
                "hadithNumber": "3348",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah will say (on the Day of Resurrection), 'O Adam.' Adam will reply, 'Labbaik wa Sa`daik', and all the good is in Your Hand.' Allah will say: 'Bring out the people of the fire.' Adam will say: 'O Allah! How many are the people of the Fire?' Allah will reply: 'From every one thousand, take out nine-hundred-and ninety-nine.' At that time children will become hoary headed, every pregnant female will have a miscarriage, and one will see mankind as drunken, yet they will not be drunken, but dreadful will be the Wrath of Allah.\" The companions of the Prophet (ﷺ) asked, \"O Allah's Apostle! Who is that (excepted) one?\" He said, \"Rejoice with glad tidings; one person will be from you and one-thousand will be from Gog and Magog.\" The Prophet (ﷺ) further said, \"By Him in Whose Hands my life is, hope that you will be one-fourth of the people of Paradise.\" We shouted, \"Allahu Akbar!\" He added, \"I hope that you will be one-third of the people of Paradise.\" We shouted, \"Allahu Akbar!\" He said, \"I hope that you will be half of the people of Paradise.\" We shouted, \"Allahu Akbar!\" He further said, \"You (Muslims) (compared with non Muslims) are like a black hair in the skin of a white ox or like a white hair in the skin of a black ox (i.e. your number is very small as compared with theirs).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ ( قیامت کے دن ) فرمائے گا ، اے آدم ! آدم علیہ السلام عرض کریں گے میں اطاعت کے لیے حاضر ہوں ، مستعد ہوں ، ساری بھلائیاں صرف تیرے ہی ہاتھ میں ہیں ۔ اللہ تعالیٰ فرمائے گا ، جہنم میں جانے والوں کو ( لوگوں میں سے الگ ) نکال لو ۔ حضرت آدم علیہ السلام عرض کریں گے ۔ اے اللہ ! جہنمیوں کی تعداد کتنی ہے ؟ اللہ تعالیٰ فرمائے گا کہ ہر ایک ہزار میں سے نو سو ننانوے ۔ اس وقت ( کی ہولناکی اور وحشت سے ) بچے بوڑھے ہو جائیں گے اور ہر حاملہ عورت اپنا حمل گرا دے گی ۔ اس وقت تم ( خوف و دہشت سے ) لوگوں کو مدہوشی کے عالم میں دیکھو گے ، حالانکہ وہ بیہوش نہ ہوں گے ۔ لیکن اللہ کا عذاب بڑا ہی سخت ہو گا ۔ صحابہ نے عرض کیا یا رسول اللہ ! وہ ایک شخص ہم میں سے کون ہو گا ؟ حضور صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں بشارت ہو ، وہ ایک آدمی تم میں سے ہو گا اور ایک ہزار دوزخی یاجوج ماجوج کی قوم سے ہوں گے ۔ پھر حضور صلی اللہ علیہ وسلم نے فرمایا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ، مجھے امید ہے کہ تم ( امت مسلمہ ) تمام جنت والوں کے ایک تہائی ہو گے ۔ پھر ہم نے اللہ اکبر کہا تو آپ نے فرمایا کہ مجھے امید ہے کہ تم تمام جنت والوں کے آدھے ہو گے پھر ہم نے اللہ اکبر کہا ، پھر آپ نے فرمایا کہ ( محشر میں ) تم لوگ تمام انسانوں کے مقابلے میں اتنے ہو گے جتنے کسی سفید بیل کے جسم پر ایک سیاہ بال ، یا جتنے کسی سیاہ بیل کے جسم پر ایک سفید بال ہوتا ہے ۔",
                "urduNarrator": "مجھ سے اسحاق بن نصر نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے اعمش نے ، ان سے ابوصالح نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الأَعْمَشِ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ يَقُولُ اللَّهُ تَعَالَى يَا آدَمُ‏.‏ فَيَقُولُ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ فِي يَدَيْكَ‏.‏ فَيَقُولُ أَخْرِجْ بَعْثَ النَّارِ‏.‏ قَالَ وَمَا بَعْثُ النَّارِ قَالَ مِنْ كُلِّ أَلْفٍ تِسْعَمِائَةٍ وَتِسْعَةً وَتِسْعِينَ، فَعِنْدَهُ يَشِيبُ الصَّغِيرُ، وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا، وَتَرَى النَّاسَ سُكَارَى، وَمَا هُمْ بِسُكَارَى، وَلَكِنَّ عَذَابَ اللَّهِ شَدِيدٌ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَأَيُّنَا ذَلِكَ الْوَاحِدُ قَالَ ‏\"‏ أَبْشِرُوا فَإِنَّ مِنْكُمْ رَجُلٌ، وَمِنْ يَأْجُوجَ وَمَأْجُوجَ أَلْفٌ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ، إِنِّي أَرْجُو أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ فَكَبَّرْنَا‏.‏ فَقَالَ ‏\"‏ أَرْجُو أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ فَكَبَّرْنَا‏.‏ فَقَالَ ‏\"‏ أَرْجُو أَنْ تَكُونُوا نِصْفَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ فَكَبَّرْنَا‏.‏ فَقَالَ ‏\"‏ مَا أَنْتُمْ فِي النَّاسِ إِلاَّ كَالشَّعَرَةِ السَّوْدَاءِ فِي جِلْدِ ثَوْرٍ أَبْيَضَ، أَوْ كَشَعَرَةٍ بَيْضَاءَ فِي جِلْدِ ثَوْرٍ أَسْوَدَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3200,
                "hadithNumber": "3349",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"You will be gathered (on the Day of Judgment), bare-footed, naked and not circumcised.\" He then recited:--'As We began the first creation, We, shall repeat it: A Promise We have undertaken: Truly we shall do it.' (21.104) He added, \"The first to be dressed on the Day of Resurrection, will be Abraham, and some of my companions will be taken towards the left side (i.e. to the (Hell) Fire), and I will say: 'My companions! My companions!' It will be said: 'They renegade from Islam after you left them.' Then I will say as the Pious slave of Allah (i.e. Jesus) said. 'And I was a witness Over them while I dwelt amongst them. When You took me up You were the Watcher over them, And You are a witness to all things. If You punish them. They are Your slaves And if You forgive them, Verily you, only You are the All-Mighty, the All-Wise.\" (5.120-121)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم لوگ حشر میں ننگے پاؤں ، ننگے جسم اور بن ختنہ اٹھائے جاؤ گے ۔ پھر آپ نے اس آیت کی تلاوت کی کہ ” جیسا کہ ہم نے پیدا کیا تھا پہلی مرتبہ ، ہم ایسے ہی لوٹائیں گے ۔ یہ ہماری طرف سے ایک وعدہ ہے جس کو ہم پورا کر کے رہیں گے ( سورۃ انبیاء ) اور انبیاء میں سب سے پہلے حضرت ابراہیم علیہ السلام کو کپڑا پہنایا جائے گا اور میرے اصحاب میں سے بعض کو جہنم کی طرف لے جایا جائے گا تو میں پکار اٹھوں گا کہ یہ تو میرے اصحاب ہیں ، میرے اصحاب ! لیکن مجھے بتایا جائے گا کہ آپ کی وفات کے بعد ان لوگوں نے پھر کفر اختیار کر لیا تھا ۔ اس وقت میں بھی وہی جملہ کہوں گا جو نیک بندے ( عیسیٰ علیہ السلام ) کہیں گے کہ ” جب تک میں ان کے ساتھ تھا ۔ ان پر نگران تھا ، اللہ تعالیٰ کے ارشاد الحکیم تک ۔ “",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان ثوری نے خبر دی ، ان سے مغیرہ بن نعمان نے بیان کیا ، کہا کہ مجھ سے سعید بن جبیر نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا الْمُغِيرَةُ بْنُ النُّعْمَانِ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّكُمْ مَحْشُورُونَ حُفَاةً عُرَاةً غُرْلاً ـ ثُمَّ قَرَأَ – ‏{‏كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْدًا عَلَيْنَا إِنَّا كُنَّا فَاعِلِينَ‏}‏ وَأَوَّلُ مَنْ يُكْسَى يَوْمَ الْقِيَامَةِ إِبْرَاهِيمُ، وَإِنَّ أُنَاسًا مِنْ أَصْحَابِي يُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ فَأَقُولُ أَصْحَابِي أَصْحَابِي‏.‏ فَيَقُولُ، إِنَّهُمْ لَمْ يَزَالُوا مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ مُنْذُ فَارَقْتَهُمْ‏.‏ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ ‏{‏وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ‏}‏ إِلَى قَوْلِهِ ‏{‏الْحَكِيمُ ‏}‏‏\"‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَاتَّخَذَ اللَّهُ إِبْرَاهِيمَ خَلِيلاً}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان: ’’اور اللہ تعالیٰ نے ابراہیم کو خلیل بنایا۔‘‘",
                "headingEnglish": "The Statement of Allah Taa'la: \"...And Allah did take Ibrahim as a Khalil.\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3201,
                "hadithNumber": "3350",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"On the Day of Resurrection Abraham will meet his father Azar whose face will be dark and covered with dust.(The Prophet (ﷺ) Abraham will say to him): 'Didn't I tell you not to disobey me?' His father will reply: 'Today I will not disobey you.' 'Abraham will say: 'O Lord! You promised me not to disgrace me on the Day of Resurrection; and what will be more disgraceful to me than cursing and dishonoring my father?' Then Allah will say (to him):' 'I have forbidden Paradise for the disbelievers.\" Then he will be addressed, 'O Abraham! Look! What is underneath your feet?' He will look and there he will see a Dhabh (an animal,) blood-stained, which will be caught by the legs and thrown in the (Hell) Fire.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ حضرت ابراہیم علیہ السلام اپنے والد آذر سے قیامت کے دن جب ملیں گے تو ان کے ( والد کے ) چہرے پر سیاہی اور غبار ہو گا ۔ حضرت ابراہیم علیہ السلام کہیں گے کہ کیا میں نے آپ سے نہیں کہا تھا کہ میری مخالفت نہ کیجئے ۔ وہ کہیں گے کہ آج میں آپ کی مخالفت نہیں کرتا ۔ حضرت ابراہیم علیہ السلام عرض کریں گے کہ اے رب ! تو نے وعدہ فرمایا تھا کہ مجھے قیامت کے دن رسوا نہیں کرے گا ۔ آج اس رسوائی سے بڑھ کر اور کون سی رسوائی ہو گی کہ میرے والد تیری رحمت سے سب سے زیادہ دور ہیں ۔ اللہ تعالیٰ فرمائے گا کہ میں نے جنت کافروں پر حرام قرار دی ہے ۔ پھر کہا جائے گا کہ اے ابراہیم ! تمہارے قدموں کے نیچے کیا چیز ہے ؟ وہ دیکھیں گے تو ایک ذبح کیا ہوا جانور خون میں لتھڑا ہوا وہاں پڑا ہو گا اور پھر اس کے پاؤں پکڑ کر اسے جہنم میں ڈال دیا جائے گا ۔",
                "urduNarrator": "ہم سے اسماعیل بن عبداللہ نے بیان کیا کہ مجھے میرے بھائی عبدالحمید نے خبر دی ، انہیں ابن ابی ذئب نے ، انہیں سعید مقبری نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ أَخْبَرَنِي أَخِي عَبْدُ الْحَمِيدِ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَلْقَى إِبْرَاهِيمُ أَبَاهُ آزَرَ يَوْمَ الْقِيَامَةِ، وَعَلَى وَجْهِ آزَرَ قَتَرَةٌ وَغَبَرَةٌ، فَيَقُولُ لَهُ إِبْرَاهِيمُ أَلَمْ أَقُلْ لَكَ لاَ تَعْصِنِي فَيَقُولُ أَبُوهُ فَالْيَوْمَ لاَ أَعْصِيكَ‏.‏ فَيَقُولُ إِبْرَاهِيمُ يَا رَبِّ، إِنَّكَ وَعَدْتَنِي أَنْ لاَ تُخْزِيَنِي يَوْمَ يُبْعَثُونَ، فَأَىُّ خِزْىٍ أَخْزَى مِنْ أَبِي الأَبْعَدِ فَيَقُولُ اللَّهُ تَعَالَى إِنِّي حَرَّمْتُ الْجَنَّةَ عَلَى الْكَافِرِينَ، ثُمَّ يُقَالُ يَا إِبْرَاهِيمُ مَا تَحْتَ رِجْلَيْكَ فَيَنْظُرُ فَإِذَا هُوَ بِذِيخٍ مُلْتَطِخٍ، فَيُؤْخَذُ بِقَوَائِمِهِ فَيُلْقَى فِي النَّارِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3202,
                "hadithNumber": "3351",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) entered the Ka`ba and found in it the pictures of (Prophet) Abraham and Mary. On that he said' \"What is the matter with them ( i.e. Quraish)? They have already heard that angels do not enter a house in which there are pictures; yet this is the picture of Abraham. And why is he depicted as practicing divination by arrows?\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم بیت اللہ میں داخل ہوئے تو اس میں حضرت ابراہیم اور حضرت مریم علیہما السلام کی تصویریں دیکھیں ، آپ نے فرمایا کہ قریش کو کیا ہو گیا ؟ حالانکہ انہیں معلوم ہے کہ فرشتے کسی ایسے گھر میں داخل نہیں ہوتے جس میں تصویریں رکھی ہوں ، یہ حضرت ابراہیم علیہ السلام کی تصویر ہے اور وہ بھی پانسہ پھینکتے ہوئے ۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھے عمرو بن حارث نے خبر دی ، ان سے بکیر نے بیان کیا ، ان سے ابن عباس کے مولیٰ کریب نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، أَنَّ بُكَيْرًا، حَدَّثَهُ عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ دَخَلَ النَّبِيُّ صلى الله عليه وسلم الْبَيْتَ فَوَجَدَ فِيهِ صُورَةَ إِبْرَاهِيمَ وَصُورَةَ مَرْيَمَ فَقَالَ ‏ \"‏ أَمَا لَهُمْ، فَقَدْ سَمِعُوا أَنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ صُورَةٌ، هَذَا إِبْرَاهِيمُ مُصَوَّرٌ فَمَا لَهُ يَسْتَقْسِمُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 3176,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=127",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=125",
                "label": "125",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=126",
                "label": "126",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=127",
                "label": "127",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=128",
                "label": "128",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=129",
                "label": "129",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=130",
                "label": "130",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=131",
                "label": "131",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=129",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=129",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=127",
        "to": 3200,
        "total": 40465
    }
}