{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 197,
        "data": [
            {
                "id": 4903,
                "hadithNumber": "5129",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When Hafsa رضی اللہ عنہما , `Umar's daughter became a widow because of the death of her (husband) Ibn Hudhafa As-Sahmi who was one of the companion of the Prophet (ﷺ) and the one of the Badr warriors and died at Medina, `Umar رضی اللہ عنہما said, \"I met `Uthman bin `Affan رضی اللہ عنہ and gave him an offer, saying, 'If you wish, I will marry Hafsa to you.' He said. 'I will think it over' I waited for a few days, then he met me and said, 'I have made up my mind not to marry at present' \"`Umar رضی اللہ عنہ added, \"Then I met Abu Bakr رضی اللہ عنہ and said to him, 'If you wish, I will marry Hafsa to you.' \"",
                "hadithUrdu": "جب حفصہ بنت عمر رضی اللہ عنہما ابن حذافہ سہمی سے بیوہ ہوئیں ۔ ابن حذافہ رضی اللہ عنہما نبی کریم صلی اللہ علیہ وسلم کے اصحاب میں سے تھے اور بدر کی جنگ میں شریک تھے ان کی وفات مدینہ منورہ میں ہوئی تھی تو حضرت عمر رضی اللہ عنہ نے بیان کیا کہ میں حضرت عثمان بن عفان رضی اللہ عنہ سے ملااور انہیں پیش کش کی اور کہا کہ اگر آپ چاہیں تو میں حفصہ رضی اللہ عنہا کا نکاح آپ سے کروں ۔ انہوں نے جواب دیا کہ میں اس معاملہ میں غور کروں گا چند دن میں نے انتظار کیا اس کے بعد وہ مجھ سے ملے اور کہا کہ میں اس نتیجہ پر پہنچا ہوں کہ ابھی نکا ح نہ کروں ۔ حضرت عمر رضی اللہ عنہ نے بیان کیا کہ پھر میں حضرت ابوبکر رضی اللہ عنہ سے ملا اور ان سے کہا کہ اگر آپ چاہیں تو میں حفصہ کا نکاح آپ سے کروں ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے ہشام نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، کہا ہم سے زہری نے بیان کیا ، کہا کہ مجھے سالم نے خبر دی ، انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، حَدَّثَنَا الزُّهْرِيُّ، قَالَ أَخْبَرَنِي سَالِمٌ، أَنَّ ابْنَ عُمَرَ، أَخْبَرَهُ أَنَّ عُمَرَ حِينَ تَأَيَّمَتْ حَفْصَةُ بِنْتُ عُمَرَ مِنِ ابْنِ حُذَافَةَ السَّهْمِيِّ ـ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْ أَهْلِ بَدْرٍ تُوُفِّيَ بِالْمَدِينَةِ ـ فَقَالَ عُمَرُ لَقِيتُ عُثْمَانَ بْنَ عَفَّانَ فَعَرَضْتُ عَلَيْهِ فَقُلْتُ إِنْ شِئْتَ أَنْكَحْتُكَ حَفْصَةَ‏.‏ فَقَالَ سَأَنْظُرُ فِي أَمْرِي‏.‏ فَلَبِثْتُ لَيَالِيَ ثُمَّ لَقِيَنِي فَقَالَ بَدَا لِي أَنْ لاَ أَتَزَوَّجَ يَوْمِي هَذَا‏.‏ قَالَ عُمَرُ فَلَقِيتُ أَبَا بَكْرٍ فَقُلْتُ إِنْ شِئْتَ أَنْكَحْتُكَ حَفْصَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4904,
                "hadithNumber": "5130",
                "englishNarrator": "Narrated Al-Hasan:",
                "hadithEnglish": "concerning the Verse: 'Do not prevent them' (2.232) Ma'qil bin Yasar  رضی اللہ عنہ told me that it was revealed in his connection. He said, \"I married my sister to a man and he divorced her, and when her days of 'Idda (three menstrual periods) were over, the man came again and asked for her hand, but I said to him, 'I married her to you and made her your bed (your wife) and favored you with her, but you divorced her. Now you come to ask for her hand again? No, by Allah, she will never go back to you (again)!' That man was not a bad man and his wife wanted to go back to him. So Allah revealed this Verse: 'Do not prevent them.' (2.232) So I said, 'Now I will do it (let her go back to him), O Allah's Messenger (ﷺ).\"So he married her to him again.",
                "hadithUrdu": "آیت ” فلا تعضلوھن “ کی تفسیر میں بیان کیا کہ مجھ سے معقل بن یسار رضی اللہ عنہ نے بیان کیا کہ یہ آیت میرے ہی بارے میں نازل ہوئی تھی میں نے اپنی ایک بہن کا نکاح ایک شخص سے کر دیا تھا ۔ اس نے اسے طلاق دے دی لیکن جب عدت پوری ہوئی تو وہ شخص ( ابو البداح ) میری بہن سے پھر نکاح کا پیغام لے کر آیا ۔ میں نے اس سے کہا کہ میں نے تم سے اس کا ( اپنی بہن ) کا نکاح کیا اسے تمہاری بیوی بنایا اور تمہیں عزت دی لیکن تم نے اسے طلاق دیدی اور اب پھر تم نکاح کاپیغام لے کر آئے ہو ۔ ہرگز نہیں اللہ کی قسم ! اب میں تمہیں کبھی اسے نہیں دوں گا ۔ وہ شخص ابو البداح کچھ برا آدمی نہ تھا اور عورت بھی اس کے یہاں واپس جانا چاہتی تھی اس لئے اللہ تعالیٰ نے یہ آیت نازل کی کہ ” تم عورتوں کو مت روکو “ میں نے عرض کیا کہ یا رسول اللہ ! اب میں کر دوں گا ۔ بیان کیا کہ پھر انہوں نے اپنی بہن کا نکاح اس شخص سے کر دیا ۔",
                "urduNarrator": "ہم سے احمد بن عمرو نے بیان کیا ، کہا کہ مجھ سے میرے والد حفص بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے ابراہیم بن طہمان نے بیان کیا ، ان سے یونس نے ، ان سے حسن بصری نے",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي عَمْرٍو، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، ‏{‏فَلاَ تَعْضُلُوهُنَّ‏}‏ قَالَ حَدَّثَنِي مَعْقِلُ بْنُ يَسَارٍ، أَنَّهَا نَزَلَتْ فِيهِ قَالَ زَوَّجْتُ أُخْتًا لِي مِنْ رَجُلٍ فَطَلَّقَهَا، حَتَّى إِذَا انْقَضَتْ عِدَّتُهَا جَاءَ يَخْطُبُهَا، فَقُلْتُ لَهُ زَوَّجْتُكَ وَفَرَشْتُكَ وَأَكْرَمْتُكَ، فَطَلَّقْتَهَا، ثُمَّ جِئْتَ تَخْطُبُهَا، لاَ وَاللَّهِ لاَ تَعُودُ إِلَيْكَ أَبَدًا، وَكَانَ رَجُلاً لاَ بَأْسَ بِهِ وَكَانَتِ الْمَرْأَةُ تُرِيدُ أَنَّ تَرْجِعَ إِلَيْهِ فَأَنْزَلَ اللَّهُ هَذِهِ الآيَةَ ‏{‏فَلاَ تَعْضُلُوهُنَّ‏}‏ فَقُلْتُ الآنَ أَفْعَلُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ فَزَوَّجَهَا إِيَّاهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4905,
                "hadithNumber": "5131",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "(regarding His Statement): 'They ask your instruction concerning the women. Say: Allah instructs you about them ...' (4.127) It is about the female orphan who is under the guardianship of a man with whom she shares her property and he does not want to marry her and dislikes that someone else should marry her, lest he should share the property with him, so he prevents her from marrying. So Allah forbade such a guardian to do so (i.e. to prevent her from marrying).",
                "hadithUrdu": "آیت یستفتونک فی النساء الایۃ اور آپ سے عورتوں کے بارے میں مسئلہ پوچھتے ہیں ، آپ کہہ دیجئیے کہ اللہ ان کے بارے میں تمہیں مسئلہ بتاتا ہے آخر آیت تک فرمایا کہ یہ آیت یتیم لڑکی کے بارے میں نازل ہوئی ، جو کسی مرد کی پرورش میں ہو ۔ وہ مرد اس کے مال کے مال میں بھی شریک ہو اور اس سے خود نکاح کرنا چاہتا ہو اور اس کا نکاح کسی دوسرے سے کرنا پسند نہ کرتا ہو کہ کہیں دوسرا شخص اس کے مال میں حصہ دار نہ بن جائے اس غرض سے وہ لڑکی کو روکے رکھے تو اللہ تعالیٰ نے لوگوں کو اس سے منع کیا ہے ۔",
                "urduNarrator": "ہم سے ابن سلام نے بیان کیا ، کہا ہم کو ابومعاویہ نے خبر دی ، کہا ہم سے ہشا م نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے",
                "hadithArabic": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ فِي قَوْلِهِ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ‏}‏ إِلَى آخِرِ الآيَةِ، قَالَتْ هِيَ الْيَتِيمَةُ تَكُونُ فِي حَجْرِ الرَّجُلِ، قَدْ شَرِكَتْهُ فِي مَالِهِ، فَيَرْغَبُ عَنْهَا أَنْ يَتَزَوَّجَهَا، وَيَكْرَهُ أَنْ يُزَوِّجَهَا غَيْرَهُ، فَيَدْخُلَ عَلَيْهِ فِي مَالِهِ، فَيَحْبِسُهَا، فَنَهَاهُمُ اللَّهُ عَنْ ذَلِكَ‏.‏",
                "headingArabic": "إِذَا كَانَ الْوَلِيُّ هُوَ الْخَاطِبَ",
                "headingUrdu": "اگر ولی خود مدعی ہے۔",
                "headingEnglish": "If the guardian himself is the suitor",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4906,
                "hadithNumber": "5132",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "While we were sitting in the company of the Prophet (ﷺ) a woman came to him and presented herself (for marriage) to him. The Prophet (ﷺ) looked at her, lowering his eyes and raising them, but did not give a reply. One of his companions said, \"Marry her to me O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) asked (him), \"Have you got anything?\" He said, \"I have got nothing.\" The Prophet (ﷺ) said, \"Not even an iron ring?\" He Sa`d, \"Not even an iron ring, but I will tear my garment into two halves and give her one half and keep the other half.\" The Prophet; said, \"No. Do you know some of the Qur'an (by heart)?\" He said, \"Yes.\" The Prophet (ﷺ) said, \"Go, I have agreed to marry her to you with what you know of the Qur'an (as her Mahr).\"",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بیٹھے ہوئے تھے کہ ایک خاتون آئیں اور اپنے آپ کو آنحضرت صلی اللہ علیہ وسلم کے لئے پیش کیا ۔ آنحضور صلی اللہ علیہ وسلم نے انہیں نظر نیچی او پر کر کے دیکھا اور کوئی جواب نہیں دیا پھر آپ کے صحابہ میں سے ایک صحابی نے عرض کیا یا رسول اللہ ! ان کا نکاح مجھ سے کرا دیجئیے ۔ آنحضور صلی اللہ علیہ وسلم نے دریافت فرمایا ، تمہارے پاس کوئی چیز ہے ؟ انہوں نے عرض کیا کہ میرے پاس تو کچھ نہیں ۔ آنحضور صلی علیہ وسلم نے دریافت فرمایا لوہے کی انگوٹھی بھی نہیں ؟ انہوں نے عرض کیا کہ لوہے کی ایک انگوٹھی بھی نہیں ہے ۔ البتہ میں اپنی یہ چادرپھاڑ کے آدھی انہیں دے دوں گا اور آدھی خود رکھوں گا ۔ آنحضور صلی اللہ علیہ وسلم نے فرمایا نہیں ، تمہارے پاس کچھ قرآن بھی ہے ؟ انہوں نے عرض کیا کہ ہے ۔ آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ پھر جاؤ میں نے تمہارا نکاح ان سے اس قرآن مجید کی وجہ سے کیا جو تمہارے ساتھ ہے ۔",
                "urduNarrator": "ہم سے احمد بن مقدام نے بیان کیا ، کہا ہم سے فضیل بن سلیمان نے بیان کیا ، کہا ہم سے ابو حاز م نے بیان کیا ، کہا ہم سے سہل بن سعد رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ الْمِقْدَامِ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا أَبُو حَازِمٍ، حَدَّثَنَا سَهْلُ بْنُ سَعْدٍ، كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم جُلُوسًا فَجَاءَتْهُ امْرَأَةٌ تَعْرِضُ نَفْسَهَا عَلَيْهِ فَخَفَّضَ فِيهَا النَّظَرَ وَرَفَعَهُ فَلَمْ يُرِدْهَا، فَقَالَ رَجُلٌ مِنْ أَصْحَابِهِ زَوِّجْنِيهَا يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ أَعِنْدَكَ مِنْ شَىْءٍ ‏\"‏‏.‏ قَالَ مَا عِنْدِي مِنْ شَىْءٍ‏.‏ قَالَ ‏\"‏ وَلاَ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ قَالَ وَلاَ خَاتَمًا مِنَ حَدِيدٍ وَلَكِنْ أَشُقُّ بُرْدَتِي هَذِهِ فَأُعْطِيهَا النِّصْفَ، وَآخُذُ النِّصْفَ‏.‏ قَالَ ‏\"‏ لاَ، هَلْ مَعَكَ مِنَ الْقُرْآنِ شَىْءٌ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَقَدْ زَوَّجْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4907,
                "hadithNumber": "5133",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) married her when she was six years old and he consummated his marriage when she was nine years old, and then she remained with him for nine years (i.e., till his death).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے جب ان کا نکاح کیا تو ان کی عمر چھ سال تھی اور جب ان سے صحبت کی تو اس وقت ان کی عمر نو برس کی تھی اور وہ نو برس آپ کے پاس رہیں ۔",
                "urduNarrator": "ہم سے محمد بن یوسف بیکندی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم تَزَوَّجَهَا وَهْىَ بِنْتُ سِتِّ سِنِينَ، وَأُدْخِلَتْ عَلَيْهِ وَهْىَ بِنْتُ تِسْعٍ، وَمَكَثَتْ عِنْدَهُ تِسْعًا‏.‏",
                "headingArabic": "إِنْكَاحِ الرَّجُلِ وَلَدَهُ الصِّغَارَ",
                "headingUrdu": "اپنے چھوٹے بچوں کی شادی کرنا",
                "headingEnglish": "Giving one's young children in marriage",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4908,
                "hadithNumber": "5134",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) married her when she was six years old and he consummated his marriage when she was nine years old. Hisham said: I have been informed that `Aisha رضی اللہ عنہا remained with the Prophet (ﷺ) for nine years (i.e. till his death).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ان سے نکاح کیا تو ان کی عمر چھ سال تھی اور جب ان سے صحبت کی تو ان کی عمر نو سال تھی ۔ ہشام بن عروہ نے کہا کہ مجھے خبر دی گئی ہے کہ وہ آنحضرت صلی اللہ علیہ وسلم کے ساتھ نو سال تک رہیں ۔",
                "urduNarrator": "ہم سے معلی بن اسد نے بیان کیا ، کہا ہم سے وہب نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم تَزَوَّجَهَا وَهْىَ بِنْتُ سِتِّ سِنِينَ، وَبَنَى بِهَا وَهْىَ بِنْتُ تِسْعِ سِنِينَ‏.‏ قَالَ هِشَامٌ وَأُنْبِئْتُ أَنَّهَا كَانَتْ عِنْدَهُ تِسْعَ سِنِينَ‏.‏",
                "headingArabic": "تَزْوِيجِ الأَبِ ابْنَتَهُ مِنَ الإِمَامِ",
                "headingUrdu": "بیٹی کی اس کے باپ کی طرف سے کسی حکمران سے شادی کرنا",
                "headingEnglish": "The marrying of a daughter by her father to a ruler",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4909,
                "hadithNumber": "5135",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "A woman came to Allah's Messenger (ﷺ) and said, \"I present myself (to you) (for marriage). She stayed for a long while, then a man said, \"If you are not in need of her then marry her to me.\" The Prophet (ﷺ) said, \"Have you got anything m order to pay her Mahr?\" He said, \"I have nothing with me except my Izar (waist sheet).\" The Prophet (ﷺ) said, \"If you give her your Izar, you will have no Izar to wear, (so go) and search for something. He said, \"I could not find anything.\" The Prophet (ﷺ) said, \"Try (to find something), even if it were an iron ring But he was not able to find (even that) The Prophet (ﷺ) said (to him). \"Do you memorize something of the Qur'an?\" \"Yes. ' he said, \"such Sura and such Sura,\" naming those Suras The Prophet (ﷺ) said, \"We have married her to you for what you know of the Qur'an (by heart).",
                "hadithUrdu": "ایک عورت رسول اللہ صلی اللہ علیہ وسلم کے پاس آئی اور کہا کہ میں اپنے آپ کو آپ کے لئے ہبہ کرتی ہوں ۔ پھر وہ دیر تک کھڑی رہی ۔ اتنے میں ایک مرد نے کہا کہ اگر آنحضور صلی اللہ علیہ وسلم کو اس کی ضرورت نہ ہو تو اس کا نکاح مجھ سے فرما دیں ۔ آپ نے دریافت فرمایا کہ تمہارے پاس انہیں مہر میں دینے کے لئے کوئی چیز ہے ؟ اس نے کہا کہ میرے پاس اس تہمد کے سوا اور کچھ نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر تم اپنا یہ تہمد اس کو دے دوگے تو تمہارے پاس پہننے کے لئے تہمد بھی نہیں رہے گا ۔ کوئی اور چیز تلاش کر لو ۔ اس مرد نے کہا کہ میرے پاس کچھ بھی نہیں ۔ آپ نے فرمایا کہ کچھ تو تلاش کرو ، ایک لوہے کی انگوٹھی ہی سہی ! اسے وہ بھی نہیں ملی تو آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ۔ کیا تمہارے پاس کچھ قرآن مجید ہے ؟ انہوں نے عرض کیا کہ جی ہاں ! فلاں فلاں سورتیں ہیں ، ان سورتوں کا انہوں نے نام لیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر ہم نے تیرا نکاح اس عورت سے ان سورتوں کے کے بدلے کیا جو تم کو یاد ہیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم سے امام مالک نے خبر دی ، انہیں ابوحازم مسلم بن دینار نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ إِنِّي وَهَبْتُ مِنْ نَفْسِي‏.‏ فَقَامَتْ طَوِيلاً فَقَالَ رَجُلٌ زَوِّجْنِيهَا، إِنْ لَمْ تَكُنْ لَكَ بِهَا حَاجَةٌ‏.‏ قَالَ ‏\"‏ هَلْ عِنْدَكَ مِنْ شَىْءٍ تُصْدِقُهَا ‏\"‏‏.‏ قَالَ مَا عِنْدِي إِلاَّ إِزَارِي‏.‏ فَقَالَ ‏\"‏ إِنْ أَعْطَيْتَهَا إِيَّاهُ جَلَسْتَ لاَ إِزَارَ لَكَ، فَالْتَمِسْ شَيْئًا ‏\"‏‏.‏ فَقَالَ مَا أَجِدُ شَيْئًا‏.‏ فَقَالَ ‏\"‏ الْتَمِسْ وَلَوْ خَاتَمًا مِنْ حَدِيدِ ‏\"‏‏.‏ فَلَمْ يَجِدْ‏.‏ فَقَالَ ‏\"‏ أَمَعَكَ مِنَ الْقُرْآنِ شَىْءٌ ‏\"‏‏.‏ قَالَ نَعَمْ سُورَةُ كَذَا وَسُورَةُ كَذَا لِسُوَرٍ سَمَّاهَا‏.‏ فَقَالَ ‏\"‏ زَوَّجْنَاكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏",
                "headingArabic": "السُّلْطَانُ وَلِيٌّ بِقَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «زَوَّجْنَاكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ»",
                "headingUrdu": "حاکم کو ولی سمجھا جاتا ہے۔",
                "headingEnglish": "The ruler is regarded as a guardian",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4910,
                "hadithNumber": "5136",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A matron should not be given in marriage except after consulting her; and a virgin should not be given in marriage except after her permission.\" The people asked, \"O Allah's Messenger (ﷺ)! How can we know her permission?\" He said, \"Her silence (indicates her permission).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا بیوہ عورت کا نکاح اس وقت تک نہ کیا جائے جب تک اس کی اجاز ت نہ لی جائے اور کنواری عورت کا نکاح اس وقت تک نہ کیا جائے جب تک اس کی اجازت نہ مل جائے ۔ صحابہ نے کہا کہ یا رسول اللہ ! کنواری عورت اذن کیونکر دے گی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اس کی صور ت یہ ہے کہ وہ خاموش رہ جائے ۔ یہ خاموشی اس کا اذن سمجھی جائے گی ۔",
                "urduNarrator": "ہم سے معاذ بن فضالہ نے بیان کیا ، کہا ہم سے ہشام دستوائی نے ، ان سے یحییٰ بن ابی بشیر نے ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ، حَدَّثَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تُنْكَحُ الأَيِّمُ حَتَّى تُسْتَأْمَرَ وَلاَ تُنْكَحُ الْبِكْرُ حَتَّى تُسْتَأْذَنَ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَكَيْفَ إِذْنُهَا قَالَ ‏\"‏ أَنْ تَسْكُتَ ‏\"‏‏.‏",
                "headingArabic": "لاَ يُنْكِحُ الأَبُ وَغَيْرُهُ الْبِكْرَ وَالثَّيِّبَ إِلاَّ بِرِضَاهَا",
                "headingUrdu": "باپ یا سرپرست کنواری یا ا بیوہ کو اس کی رضامندی کے بغیر نکاح میں نہیں دے سکتے",
                "headingEnglish": "The father or the guardian cannot give a virgin or matron in marriage without her consent",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4911,
                "hadithNumber": "5137",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I said, \"O Allah's Messenger (ﷺ)! A virgin feels shy.\" He said, \"Her consent is (expressed by) her silence.\"",
                "hadithUrdu": "انہوں نے عرض کیا یا رسول اللہ ! کنواری لڑکی ( کہتے ہوئے ) شرماتی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس کا خاموش ہو جانا ہی اس کی رضامندی ہے ۔",
                "urduNarrator": "ہم سے عمرو بن ربیع بن طارق نے بیان کیا ، کہا کہ مجھے لیث بن سعد نے خبر دی ، انہیں ابن ابی ملیکہ نے ، انہیں حضرت عائشہ رضی اللہ عنہا کے غلام ابی عمرو ذکوان نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ الرَّبِيعِ بْنِ طَارِقٍ، قَالَ أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ أَبِي عَمْرٍو، مَوْلَى عَائِشَةَ عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ الْبِكْرَ تَسْتَحِي‏.‏ قَالَ ‏ \"‏ رِضَاهَا صَمْتُهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4912,
                "hadithNumber": "5138",
                "englishNarrator": "Narrated Khansa bint Khidam Al-Ansariya رضی اللہ عنہا :",
                "hadithEnglish": "Her father gave her in marriage when she was a matron and she disliked that marriage. So she went to Allah's Messenger (ﷺ) and he declared that marriage invalid.",
                "hadithUrdu": "ان کے والد نے ان کا نکاح کر دیا تھا ، وہ ثیبہ تھیں ، انہیں یہ نکاح منظور نہیں تھا ، اس لئے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں ، آنحضرت صلی اللہ علیہ وسلم نے اس نکاح کو فسخ کر دیا ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے عبدالرحمٰن بن قاسم نے ، ان سے ان کے والد نے ، ان سے عبدالرحمٰن اورمجمع نے جو دونوںیزید بن حارثہ کے بیٹے ہیں ، ان سے خنساء بنت خذام انصاریہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَبْدِ الرَّحْمَنِ، وَمُجَمِّعٍ، ابْنَىْ يَزِيدَ بْنِ جَارِيَةَ عَنْ خَنْسَاءَ بِنْتِ خِذَامٍ الأَنْصَارِيَّةِ، أَنَّ أَبَاهَا، زَوَّجَهَا وَهْىَ ثَيِّبٌ، فَكَرِهَتْ ذَلِكَ فَأَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَدَّ نِكَاحَهُ‏.‏",
                "headingArabic": "إِذَا زَوَّجَ ابْنَتَهُ وَهْىَ كَارِهَةٌ فَنِكَاحُهُ مَرْدُودٌ",
                "headingUrdu": "اگر کوئی مرد اپنی بیٹی کو نکاح میں دے دے جبکہ وہ اس کے خلاف ہو تو ایسا نکاح باطل ہے۔",
                "headingEnglish": "If a man gives his daughter in marriage while she is averse to it, then such marriage is invalid",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4913,
                "hadithNumber": "5139",
                "englishNarrator": "Narrated `Abdur-Rahman bin Yazid and Majammi bin Yazid:",
                "hadithEnglish": "The same ,Hadith above: A man called Khidam married a daughter of his (to somebody) against her consent.",
                "hadithUrdu": "خذام نامی ایک صحابی نے اپنی لڑکی کا نکاح کر دیا تھا ۔ پھر پچھلی حدیث کی طرح بیان کیا ۔",
                "urduNarrator": "ہم سے اسحاق بن راہویہ نے بیان کیا ، کہا ہم کو یزید بن ہارون نے خبر دی ، کہا ہم کو یحییٰ بن سعید انصاری نے خبر دی ، ان سے قاسم بن محمد نے بیان کیا ، ان سے عبدالرحمٰن بن یزید اور مجمع بن یزید نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا يَزِيدُ، أَخْبَرَنَا يَحْيَى، أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، حَدَّثَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ وَمُجَمِّعَ بْنَ يَزِيدَ حَدَّثَاهُ أَنَّ رَجُلاً يُدْعَى خِذَامًا أَنْكَحَ ابْنَةً لَهُ‏.‏ نَحْوَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4914,
                "hadithNumber": "5140",
                "englishNarrator": "Narrated 'Urwa bin Az-Zubair:",
                "hadithEnglish": "that he asked `Aisha رضی اللہ عنہا , saying to her, \"O Mother! (In what connection was this Verse revealed): 'If you fear that you shall not be able to deal justly with orphan girls (to the end of the verse) that your right hands possess?\" (4.3) Aisha رضی اللہ عنہا said, \"O my nephew! It was about the female orphan under the protection of her guardian who was interested in her beauty and wealth and wanted to marry her with a little or reduced Mahr. So such guardians were forbidden to marry female orphans unless they deal with them justly and give their full Mahr; and they were ordered to marry women other than them.\"`Aisha رضی اللہ عنہا added, \"(Later) the people asked Allah's Messenger (ﷺ), for instructions, and then Allah revealed: 'They ask your instruction concerning the women . . . And yet whom you desire to marry.' (4.127) So Allah revealed to them in this Verse that-if a female orphan had wealth and beauty, they desired to marry her and were interested in her noble descent and the reduction of her Mahr; but if she was not desired by them because of her lack in fortune and beauty they left her and married some other woman. So, as they used to leave her when they had no interest in her, they had no right to marry her if they had the desire to do so, unless they deal justly with her and gave her a full amount of Mahr.\"",
                "hadithUrdu": "انہوں نے حضرت عائشہ رضی اللہ عنہا سے سوال کیا کہ اے ام المؤمنین ! اور اگر تمہیں خوف ہو کہ تم یتیموں کے بارے میں انصاف کرسکوگے تو اسے ” ماملکت ایمانکم “ تک کہ اس آیت میں کیا حکم بیان ہوا ہے ؟ حضرت عائشہ رضی اللہ عنہا نے کہا میرے بھانجے ! اس آیت میں اس یتیم لڑکی کا حکم یبان ہوا ہے جو اپنے ولی کی پرورش میں ہو اور ولی کو اس کے حسن اور اس کے مال کی وجہ سے اس کی طرف توجہ ہو اور وہ اس کا مہر کم کر کے اس سے نکاح کرنا چاہتا ہو تو ایسے لوگوں کو ایسی یتیم لڑکیوں سے نکاح سے ممانعت کی گئی ہے سوائے اس صورت کے کہ وہ ان کے مہر کے بارے میں انصاف کریں ( اور اگر انصاف نہیں کر سکتے تو انہیں ان کے سوادوسری عورتوںسے نکاح کا حکم دیا گیا ہے ۔ حضرت عائشہ رضی اللہ عنہا نے کہا کہ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے بعد مسئلہ پوچھا تو اللہ تعالیٰ نے آیت ” اور آپ سے عورتوںکے بارے میں پوچھتے ہیں ، سے “ وترغبون تک نازل کی ۔ اللہ تعالیٰ نے اس آیت میں یہ حکم نازل کیا کہ یتیم لڑکیاں جب صاحب مال اور صاحب جمال ہوتی ہیں تب تو مہر میں کمی کر کے اس سے نکاح کرنا رشتہ لگانا پسند کرتے ہیں اور جب دولت مند ی یا خوبصورتی نہیں رکھتی اس وقت اس کو چھوڑ کر دوسری عورتوں سے نکاح کر دیتے ہیں ( یہ کیا بات ) ان کو چاہئے کہ جیسے مال و دولت اور حسن وجمال نہ ہونے کی صورت میں اس کو چھوڑ دیتے ہیں ایسے ہی اس وقت بھی چھوڑ دیں جب وہ مالدا ر اور خوبصورت ہو البتہ اگر انصاف سے چلیں اور اس کا پورا مہر مقرر کریں تو خیر نکاح کر لیں ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے اور ( دوسری سند ) اور لیث نے بیان کیا کہ مجھ سے عقیل نے بیان کیا ، ان سے ابن شہاب زہری نے ، کہا مجھ کو عروہ بن زبیر نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ قَالَ لَهَا يَا أُمَّتَاهْ ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى‏}‏ إِلَى ‏{‏مَا مَلَكَتْ أَيْمَانُكُمْ‏}‏ قَالَتْ عَائِشَةُ يَا ابْنَ أُخْتِي هَذِهِ الْيَتِيمَةُ تَكُونُ فِي حَجْرِ وَلِيِّهَا، فَيَرْغَبُ فِي جَمَالِهَا وَمَالِهَا، وَيُرِيدُ أَنْ يَنْتَقِصَ مِنْ صَدَاقِهَا، فَنُهُوا عَنْ نِكَاحِهِنَّ‏.‏ إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ فِي إِكْمَالِ الصَّدَاقِ وَأُمِرُوا بِنِكَاحِ مَنْ سِوَاهُنَّ مِنَ النِّسَاءِ، قَالَتْ عَائِشَةُ اسْتَفْتَى النَّاسُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدَ ذَلِكَ فَأَنْزَلَ اللَّهُ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ‏}‏ إِلَى ‏{‏وَتَرْغَبُونَ‏}‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ لَهُمْ فِي هَذِهِ الآيَةِ أَنَّ الْيَتِيمَةَ إِذَا كَانَتْ ذَاتَ مَالٍ وَجَمَالٍ، رَغِبُوا فِي نِكَاحِهَا وَنَسَبِهَا وَالصَّدَاقِ، وَإِذَا كَانَتْ مَرْغُوبًا عَنْهَا فِي قِلَّةِ الْمَالِ وَالْجَمَالِ، تَرَكُوهَا وَأَخَذُوا غَيْرَهَا مِنَ النِّسَاءِ ـ قَالَتْ ـ فَكَمَا يَتْرُكُونَهَا حِينَ يَرْغَبُونَ عَنْهَا، فَلَيْسَ لَهُمْ أَنْ يَنْكِحُوهَا إِذَا رَغِبُوا فِيهَا، إِلاَّ أَنْ يُقْسِطُوا لَهَا وَيُعْطُوهَا حَقَّهَا الأَوْفَى مِنَ الصَّدَاقِ‏.‏",
                "headingArabic": "تَزْوِيجِ الْيَتِيمَةِ",
                "headingUrdu": "یتیم لڑکی کا نکاح میں دینا",
                "headingEnglish": "The giving of an orphan girl in marriage",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4915,
                "hadithNumber": "5141",
                "englishNarrator": "Narrated Sahl رضی اللہ عنہ :",
                "hadithEnglish": "A woman came to the Prophet,, and presented herself to him (for marriage). He said, \"I am not in need of women these days.\" Then a man said, \"O Allah's Messenger (ﷺ)! Marry her to me.\" The Prophet (ﷺ) asked him, \"What have you got?\" He said, \"I have got nothing.\" The Prophet (ﷺ) said, \"Give her something, even an iron ring.\" He said, \"I have got nothing.\" The Prophet (ﷺ) asked (him), \"How much of the Qur'an do you know (by heart)?\" He said, \"So much and so much.\" The Prophet (ﷺ) said, \"I have married her to you for what you know of the Qur'an.\"",
                "hadithUrdu": "ایک عورت رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئی اور اس نے اپنے آپ کوآنحضرت صلی اللہ علیہ وسلم سے نکاح کے لئے پیش کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مجھے اب عورت کی ضرورت نہیں ہے ۔ اس پر ایک صحابی نے عرض کیا یا رسول اللہ ! ان کا نکاح مجھ سے کر دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہارے پاس کیا ہے ؟ انہوں نے کہا کہ میرے پاس تو کچھ بھی نہیں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اس عورت کو کچھ دو خواہ لوہے کی ایک انگوٹھی ہی سہی ۔ انہوں نے کہا کہ حضور ( صلی اللہ علیہ وسلم ) میرے پاس کچھ بھی نہیں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا تمہیں قرآن کتنا یاد ہے ؟ عرض کیا فلاں فلاں سورتیں یاد ہیں آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر میں نے انہیں تمہارے نکاح میں دیا ۔ اس قرآن کے بدلے جو تم کو یاد ہے ۔",
                "urduNarrator": "ہم سے ابو النعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ابوحازم نے ، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلٍ، أَنَّ امْرَأَةً، أَتَتِ النَّبِيَّ صلى الله عليه وسلم فَعَرَضَتْ عَلَيْهِ نَفْسَهَا فَقَالَ ‏\"‏ مَا لِي الْيَوْمَ فِي النِّسَاءِ مِنْ حَاجَةٍ ‏\"‏‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ زَوِّجْنِيهَا‏.‏ قَالَ ‏\"‏ مَا عِنْدَكَ ‏\"‏‏.‏ قَالَ مَا عِنْدِي شَىْءٌ‏.‏ قَالَ ‏\"‏ أَعْطِهَا وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ قَالَ مَا عِنْدِي شَىْءٌ‏.‏ قَالَ ‏\"‏ فَمَا عِنْدَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏ قَالَ عِنْدِي كَذَا وَكَذَا‏.‏ قَالَ ‏\"‏ فَقَدْ مَلَّكْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏",
                "headingArabic": "إِذَا قَالَ الْخَاطِبُ لِلْوَلِيِّ زَوِّجْنِي فُلاَنَةَ. فَقَالَ قَدْ زَوَّجْتُكَ بِكَذَا وَكَذَا. جَازَ النِّكَاحُ، وَإِنْ لَمْ يَقُلْ لِلزَّوْجِ أَرَضِيتَ أَوْ قَبِلْتَ",
                "headingUrdu": "اگر دعویٰ کرنے والا کہے کہ \"میری شادی فلاں سے کر دو\" اور ولی کہے کہ میں نے فلاں مہر کے لیے تم سے اس کا نکاح کیا ہے۔",
                "headingEnglish": "If the suitor says, \"Marry me to so-and-so,\" and the guardian says, \"I have married her to you for such Mahr\"",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4916,
                "hadithNumber": "5142",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) decreed that one should not try to cancel a bargain already agreed upon between some other persons (by offering a bigger price). And a man should not ask for the hand of a girl who is already engaged to his Muslim brother, unless the first suitor gives her up, or allows him to ask for her hand.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا ہے کہ ہم کسی کے بھاو پر بھاو لگائیں اور کسی شخص کو اپنے کسی ( دینی ) بھائی کے پیغام نکاح پر پیغام بھیجیں یہاں تک کہ پیغام بھیجنے والا اپنا ارادہ بدل دے یا اسے پیغام نکاح بھیجنے کی اجازت دے د ے تو جائز ہے ۔",
                "urduNarrator": "ہم سے مکی بن ابراہیم نے بیان کیا ، کہا ہم سے جریج نے بیان کیا ، کہا کہ میں نے نافع سے سنا ، انہوں نے بیان کیا کہ عبداللہ بن عمر رضی اللہ عنہما بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ نَافِعًا، يُحَدِّثُ أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ يَقُولُ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَبِيعَ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ، وَلاَ يَخْطُبَ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ، حَتَّى يَتْرُكَ الْخَاطِبُ قَبْلَهُ، أَوْ يَأْذَنَ لَهُ الْخَاطِبُ‏.‏",
                "headingArabic": "لاَ يَخْطُبُ عَلَى خِطْبَةِ أَخِيهِ، حَتَّى يَنْكِحَ أَوْ يَدَعَ",
                "headingUrdu": "اپنے بھائی کی پیشکش پر اس وقت تک پیشکش نہ بھیجیں جب تک کہ وہ شادی نہ کر لے یا ترک نہ کر دے۔",
                "headingEnglish": "Don't send offer over your brother's offer until he marries or forsakes",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4917,
                "hadithNumber": "5143, 5144",
                "englishNarrator": "Narrated Abu Huraira:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Beware of suspicion (about others), as suspicion is the falsest talk, and do not spy upon each other, and do not listen to the evil talk of the people about others' affairs, and do not have enmity with one another, but be brothers. And none should ask for the hand of a girl who is already engaged to his (Muslim) brother, but one should wait till the first suitor marries her or leaves her.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ بدگمانی سے بچتے رہو کیونکہ بدگمانی سب سے جھوٹی بات ہے ( اور لوگوں کے رازوں کی ) کھود کرید نہ کیا کرو اور نہ ( لوگوں کی نجی گفتگووں کو ) کان لگا کر سنو ، آپس میں دشمنی نہ پیدا کرو بلکہ بھائی بھائی بن کر رہو  ، اور کوئی شخص اپنے بھائی کے پیغام پر پیغام نہ بھیجے یہاں تک کہ وہ نکاح کرے یا چھوڑدے ۔",
                "urduNarrator": "ہم سے یحی بن بکیر نے بیان کیا ، کہا ہم سے لیس بن سعد نے بیان کیا ، ان سے جعفر بن ربیعہ ، ان سے اعرج نے بیان کیا اور ان سے حضرت ابوہریرہ نے بیان کیا وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنِ الأَعْرَجِ، قَالَ قَالَ أَبُو هُرَيْرَةَ يَأْثُرُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِيَّاكُمْ وَالظَّنَّ، فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ، وَلاَ تَجَسَّسُوا، وَلاَ تَحَسَّسُوا، وَلاَ تَبَاغَضُوا، وَكُونُوا إِخْوَانًا ‏\"‏‏.‏وَلَا يَخْطُبُ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ حَتَّى يَنْكِحَ أَوْ يَتْرُكَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4918,
                "hadithNumber": "5145",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"When Hafsa رضی اللہ عنہا became a widow,\" `Umar رضی اللہ عنہ said, \"I met Abu Bakr رضی اللہ عنہ and said to him, 'If you wish I will marry Hafsa bint `Umar رضی اللہ عنہما to you.' I waited for a few days then Allah's Messenger (ﷺ) asked for her hand. Later Abu Bakr رضی اللہ عنہ met me and said, 'Nothing stopped me from returning to you concerning your offer except that I knew that Allah's Messenger (ﷺ) had mentioned (his wish to marry) her, and I could never let out the secret of Allah's Messenger (ﷺ) . If he had left her, I would have accepted her.' \" Similarly Younus, Musa bin Uqbah, Ibn-e-Abi Ateeq reported from Zuhri.",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ نے بیان کیا کہ میری بیٹی حفصہ رضی اللہ عنہا بیوہ ہوئیں تو میں حضرت ابوبکر صدیق رضی اللہ عنہ سے ملا اور ان سے کہا کہ اگر آپ چاہیں تو میں آپ کا نکاح عزیزہ حفصہ بنت عمر رضی اللہ عنہما سے کر دوں ۔ پھر کچھ دنوں کے بعد رسول کریم صلی اللہ علیہ وسلم نے ان کے نکاح کا پیغام بھیجا اس کے  بعدحضرت ابوبکر رضی اللہ عنہ مجھ سے ملے اور کہا آپ نے جو صورت میرے سامنے رکھی تھی اس کا جواب میں نے صرف اس وجہ سے نہیں دیا تھا کہ مجھے معلوم تھا رسول کریم صلی اللہ علیہ وسلم نے ان کا ذکر کیا ہے ۔ میں نہیں چاہتا کہ آپ کا راز کھولوں ہاں آنحضرت صلی اللہ علیہ وسلم انہیں چھوڑ دیتے تو میں ان کو قبول کر لیتا ۔ شعیب کے ساتھ اس حدیث کو یو نس بن یزید اور موسیٰ بن عقبہ اور محمد بن ابی عتیق نے بھی زہری سے ر وایت کیا ہے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زھری نے ، کہا کہ مجھے سالم بن عبداللہ نے خبر دی ، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ، وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يُحَدِّثُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ حِينَ تَأَيَّمَتْ حَفْصَةُ قَالَ عُمَرُ لَقِيتُ أَبَا بَكْرٍ فَقُلْتُ إِنْ شِئْتَ أَنْكَحْتُكَ حَفْصَةَ بِنْتَ عُمَرَ‏.‏ فَلَبِثْتُ لَيَالِيَ ثُمَّ خَطَبَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَقِيَنِي أَبُو بَكْرٍ فَقَالَ إِنَّهُ لَمْ يَمْنَعْنِي أَنْ أَرْجِعَ إِلَيْكَ فِيمَا عَرَضْتَ إِلاَّ أَنِّي قَدْ عَلِمْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ ذَكَرَهَا فَلَمْ أَكُنْ لأُفْشِيَ سِرَّ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَوْ تَرَكَهَا لَقَبِلْتُهَا‏.‏ تَابَعَهُ يُونُسُ وَمُوسَى بْنُ عُقْبَةَ وَابْنُ أَبِي عَتِيقٍ عَنِ الزُّهْرِيِّ‏.‏",
                "headingArabic": "تَفْسِيرِ تَرْكِ الْخِطْبَةِ",
                "headingUrdu": "منگنی کے منسوخ ہونے کے معنی۔",
                "headingEnglish": "The meaning of the cancelling of the engagement.",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4919,
                "hadithNumber": "5146",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Two men came from the east and delivered speeches, and the Prophet (ﷺ) said, \"Some eloquent speech has the influence of magic.\" (e.g., some people refuse to do something and then a good eloquent speaker addresses them and then they agree to do that very thing after his speech)",
                "hadithUrdu": "دو آدمی مدینہ کے مشرق کی طرف سے آئے ، وہ مسلمان ہو گئے اور خطبہ دیا ، نہایت فصیح و بلیغ ۔ رسول اللہ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ بعض تقریر جادو کی اثر کرتی ہے ۔(مثال کے طور پر، کچھ لوگ کچھ کرنے سے انکار کرتے ہیں اور پھر ایک اچھا فصیح مقرر ان سے مخاطب ہوتا ہے اور پھر وہ اس کی تقریر کے بعد وہی کام کرنے پر راضی ہو جاتے ہیں)",
                "urduNarrator": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے زید بن اسلم نے کہا کہ میں نے حضرت ابن عمر رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ زَيْدِ بْنِ أَسْلَمَ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ جَاءَ رَجُلاَنِ مِنَ الْمَشْرِقِ فَخَطَبَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ مِنَ الْبَيَانِ لَسِحْرً‏\"‏‏.‏",
                "headingArabic": "الْخُطْبَةِ",
                "headingUrdu": "الخطبہ (نکاح کے لیے)",
                "headingEnglish": "Al-Khutba (for Nikah)",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4920,
                "hadithNumber": "5147",
                "englishNarrator": "Narrated Ar-Rabi` رضی اللہ عنہا (the daughter of Muawwidh bin Afra):",
                "hadithEnglish": "After the consummation of my marriage, the Prophet (ﷺ) came and sat on my bed as far from me as you are sitting now, and our little girls started beating the tambourines and reciting elegiac verses mourning my father who had been killed in the battle of Badr. One of them said, \"Among us is a Prophet who knows what will happen tomorrow.\" On that the Prophet said, \"Leave this (saying) and keep on saying the verses which you had been saying before.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور جب میں دلہن بنا کر بٹھائی گئی آنحضرت صلی اللہ علیہ وسلم اندر تشریف لائے اور میر ے بستر پر بیٹھے اسی طرح جیسے تم اس وقت میرے پاس بیٹھے ہوئے ہو ۔ پھر ہمارے یہاں کی کچھ لڑکیاں دف بجانے لگیں اور میرے باپ اور چچا جو جنگ بدر میں شہید ہوئے تھے ، ان کا مرثیہ پڑھنے لگیں ۔ اتنے میں ان میں سے ایک لڑکی نے پڑھا ، اور ہم میں ایک نبی ہے جو ان باتوں کی خبر رکھتا ہے جو کچھ کل ہونے والی ہیں ۔ ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ چھوڑ دو ۔ اس کے سوا جو کچھ تم پڑھ رہی تھیں وہ پڑھو ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے بشر بن مفضل نے بیان کیا ، کہا ہم سے خالد بن ذکوان نے بیان کیا ، کہ ربیع بنت معوذ ابن عفراء رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا خَالِدُ بْنُ ذَكْوَانَ، قَالَ قَالَتِ الرُّبَيِّعُ بِنْتُ مُعَوِّذٍ ابْنِ عَفْرَاءَ‏.‏ جَاءَ النَّبِيُّ صلى الله عليه وسلم فَدَخَلَ حِينَ بُنِيَ عَلَىَّ، فَجَلَسَ عَلَى فِرَاشِي كَمَجْلِسِكَ مِنِّي، فَجَعَلَتْ جُوَيْرِيَاتٌ لَنَا يَضْرِبْنَ بِالدُّفِّ وَيَنْدُبْنَ مَنْ قُتِلَ مِنْ آبَائِي يَوْمَ بَدْرٍ، إِذْ قَالَتْ إِحْدَاهُنَّ وَفِينَا نَبِيٌّ يَعْلَمُ مَا فِي غَدٍ‏.‏ فَقَالَ ‏ \"‏ دَعِي هَذِهِ، وَقُولِي بِالَّذِي كُنْتِ تَقُولِينَ ‏\"‏‏.‏",
                "headingArabic": "ضَرْبِ الدُّفِّ فِي النِّكَاحِ وَالْوَلِيمَةِ",
                "headingUrdu": "شادی کی تقریب اور شادی کی ضیافت کے دوران دف بجانا۔",
                "headingEnglish": "Beating the tambourine during marriage ceremony and the wedding banquet.",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4921,
                "hadithNumber": "5148",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "`Abdur Rahman bin `Auf رضی اللہ عنہ married a woman and gave her gold equal to the weight of a date stone (as Mahr). When the Prophet (ﷺ) noticed the signs of cheerfulness of the marriage (on his face) and asked him about it, he said, \"I have married a woman and gave (her) gold equal to a date stone in weight (as Mahr). Qatadah has reported from Hadrat Anas رضی اللہ عنہ That Hadrat Abdur Rehman bin Auf رضی اللہ عنہ married a woman in lieu of gold equal to the size of a date-stone.",
                "hadithUrdu": "حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے ایک خاتون سے ایک گٹھلی کے وزن کے برابر ( سونے کے مہر پر ) نکاح کیا ۔ پھر نبی کریم صلی اللہ علیہ وسلم شادی کی خوشی ان میں دیکھی تو ان سے پوچھا ۔ انہوں نے عرض کیا کہ میں نے ایک عورت سے ایک گٹھلی کے برابر سونا  دے کر نکاح کیا ہے اور قتادہ نے حضرت انس رضی اللہ عنہ سے یہ روایت اس طرح نقل کی ہے کہ حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے ایک عورت سے ۔ ایک گٹھلی کے وزن کے برابر سونے پر نکاح کیا تھا ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عبد العزیز بن صہیب نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، تَزَوَّجَ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ، فَرَأَى النَّبِيُّ صلى الله عليه وسلم بَشَاشَةَ الْعُرْسِ فَسَأَلَهُ فَقَالَ إِنِّي تَزَوَّجْتُ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ‏.‏ وَعَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ تَزَوَّجَ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏وَآتُوا النِّسَاءَ صَدُقَاتِهِنَّ نِحْلَةً‏}‏",
                "headingUrdu": "’’اور عورتوں کو ان کا مہر خوش دلی سے دو۔‘‘",
                "headingEnglish": "\"And give to the women their Mahr with a good heart...\"",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4922,
                "hadithNumber": "5149",
                "englishNarrator": "Narrated Sahl bin Sa`d As-Sa`idi:",
                "hadithEnglish": "While I was (sitting) among the people in the company of Allah's Messenger (ﷺ) a woman stood up and said, \"O Allah's Messenger (ﷺ)! She has given herself in marriage to you; please give your opinion of her.\" The Prophet did not give her any reply. She again stood up and said, \"O Allah's Messenger (ﷺ)! She has given herself (in marriage) to you; so please give your opinion of her. The Prophet (ﷺ) did not give her any reply. She again stood up for the third time and said, \"She has given herself in marriage to you: so give your opinion of her.\" So a man stood up and said, \"O Allah's Messenger (ﷺ)! Marry her to me.\" The Prophet asked him, \"Have you got anything?\" He said, \"No.\" The Prophet (ﷺ) said, \"Go and search for something, even if it were an iron ring.\" The man went and searched and then returned saying, \"I could not find anything, not even an iron ring.\" Then the Prophet (ﷺ) said, \"Do you know something of the Qur'an (by heart)?\" He replied, \"I know (by heart) such Sura and such Sura.\" The Prophet (ﷺ) said, \"Go! I have married her to you for what you know of the Qur'an (by heart).",
                "hadithUrdu": "میں لوگوں کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا اس میں ایک خاتون کھڑی ہوئیں اور عرض کیا کہ یا رسول اللہ ! میں اپنے آپ کو آپ کے لئے ہبہ کرتی ہوں آپ اب جو چاہیں کریں ۔ حضور اکرم صلی اللہ علیہ وسلم نے انہیں کوئی جواب نہیں دیا ۔ وہ پھر کھڑی ہوئی اور عرض کیا کہ یا رسول اللہ ! میں نے اپنے آپ کو آپ کے لئے ہبہ کر دیا ہے حضور جو چاہیں کریں ۔ حضور اکرم صلی اللہ علیہ وسلم نے اس مرتبہ بھی کوئی جواب نہیں دیا ۔ وہ تیسری مرتبہ کھڑی ہوئیں اور کہا کہ انہوں نے اپنے آپ کوحضور صلی اللہ علیہ وسلم کے لئے ہبہ کر دیا ، حضور جو چاہیں کریں ۔ اس کے بعد ایک صحابی کھڑے ہوئے اور عرض کیا یا رسول اللہ ! ان کا نکاح مجھ سے کر دیجئیے ۔ حضور اکرم صلی اللہ علیہ وسلم نے ان سے دریافت فرمایا تمہارے پاس کچھ ہے ؟ انہوں نے عرض کیا کہ نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ اور تلاش کرو ایک لوہے کی انگوٹھی بھی اگر مل جائے لے آؤ ۔ وہ گئے اور تلاش کیا ، پھر واپس آ کر عرض کیا کہ میں نے کچھ نہیں پایا ، لوہے کی ایک انگوٹھی بھی نہیں ملی ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا تمہارے پاس کچھ قرآن ہے ؟ انہوں نے عرض کیا کہ جی ہاں ۔ میرے پاس فلاں فلاں سورتیں ہیں آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر جاؤ میں نے تمہارا نکاح ان سے اس قرآن پر کیا جو تم کو یاد ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے ، کہا میں نے ابوحازم سے سنا ، وہ کہتے تھے کہ میں نے سہل بن سعد ساعدی سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، سَمِعْتُ أَبَا حَازِمٍ، يَقُولُ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، يَقُولُ إِنِّي لَفِي الْقَوْمِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ قَامَتِ امْرَأَةٌ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّهَا قَدْ وَهَبَتْ نَفْسَهَا لَكَ فَرَ فِيهَا رَأْيَكَ فَلَمْ يُجِبْهَا شَيْئًا ثُمَّ قَامَتْ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّهَا قَدْ وَهَبَتْ نَفْسَهَا لَكَ فَرَ فِيهَا رَأْيَكَ فَلَمْ يُجِبْهَا شَيْئًا ثُمَّ قَامَتِ الثَّالِثَةَ فَقَالَتْ إِنَّهَا قَدْ وَهَبَتْ نَفْسَهَا لَكَ فَرَ فِيهَا رَأْيَكَ فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ أَنْكِحْنِيهَا‏.‏ قَالَ ‏\"‏ هَلْ عِنْدَكَ مِنْ شَىْءٍ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَاطْلُبْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ فَذَهَبَ فَطَلَبَ ثُمَّ جَاءَ فَقَالَ مَا وَجَدْتُ شَيْئًا وَلاَ خَاتَمًا مِنْ حَدِيدٍ‏.‏ فَقَالَ ‏\"‏ هَلْ مَعَكَ مِنَ الْقُرْآنِ شَىْءٌ ‏\"‏‏.‏ قَالَ مَعِي سُورَةُ كَذَا وَسُورَةُ كَذَا‏.‏ قَالَ ‏\"‏ اذْهَبْ فَقَدْ أَنْكَحْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏",
                "headingArabic": "التَّزْوِيجِ عَلَى الْقُرْآنِ وَبِغَيْرِ صَدَاقٍ‏.‏",
                "headingUrdu": "کسی مرد سے اس لیے شادی کرنا جو اسے قرآن کا علم ہے۔",
                "headingEnglish": "To marry (a lady to) a man for what he knows of the Qur'an",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4923,
                "hadithNumber": "5150",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said to a man, \"Marry, even with (a Mahr equal to) an iron ring.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک آدمی سے فرمایا نکاح کر ، خواہ لوہے کی ایک انگوٹھی پر ہی ہو ۔",
                "urduNarrator": "ہم سے یحییٰ نے بیان کیا ، کہا ہم سے وکیع نے بیان کیا ، ان سے سفیان نے ان سے ابوحازم نے اور ان سے صحابی حضرت سہل بن سعد رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِرَجُلٍ ‏ \"‏ تَزَوَّجْ وَلَوْ بِخَاتَمٍ مِنْ حَدِيدٍ ‏\"‏‏.‏",
                "headingArabic": "الْمَهْرِ بِالْعُرُوضِ وَخَاتَمٍ مِنْ حَدِيدٍ",
                "headingUrdu": "مہر کو مادی چیزوں کی صورت میں دینا",
                "headingEnglish": "To give Mahr in the form of material things",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4924,
                "hadithNumber": "5151",
                "englishNarrator": "Narrated `Uqba رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said: \"The stipulations most entitled to be abided by are those with which you are given the right to enjoy the (women's) private parts (i.e. the stipulations of the marriage contract).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تمام شرطوں میں وہ شرطیں سب سے زیادہ پوری کی جانے کے لائق ہیں جن کے ذریعہ تم نے شرمگاہوں کو حلال کیا ہے ۔ یعنی نکاح کی شرطیں ضرور پوری کرنی ہو گی ۔",
                "urduNarrator": "ہم سے ابو الولید ہشام بن عبدالملک نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے یزید بن ابی حبیب نے ، ان سے ابو الخیر اور ان سے حضرت عقبہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَحَقُّ مَا أَوْفَيْتُمْ مِنَ الشُّرُوطِ أَنْ تُوفُوا بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ ‏\"‏‏.‏",
                "headingArabic": "الشُّرُوطِ فِي النِّكَاحِ‏",
                "headingUrdu": "شادی کی شرائط (معاہدہ)",
                "headingEnglish": "The conditions stipulated in marriage (contract)",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4925,
                "hadithNumber": "5152",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"It is not lawful for a woman (at the time of wedding) to ask for the divorce of her sister (i.e. the other wife of her would-be husband) in order to have everything for herself, for she will take only what has been written for her.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کسی عورت کے لئے جائز نہیں کہ اپنی کسی ( سوکن ) بہن کی طلاق کی شرط اس لئے لگائے تاکہ اس کے حصہ کا پیالہ بھی خود انڈیل لے کیونکہ اسے وہی ملے گا جو اس کے مقدر میں ہو گا ۔",
                "urduNarrator": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا ، کہا ان سے زکریا نے جو ابو زائدہ کے صاحبزادے ہیں ، ان سے سعد بن ابراہیم نے ، ان سے ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ زَكَرِيَّاءَ ـ هُوَ ابْنُ أَبِي زَائِدَةَ ـ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تَسْأَلُ طَلاَقَ أُخْتِهَا لِتَسْتَفْرِغَ صَحْفَتَهَا، فَإِنَّمَا لَهَا مَا قُدِّرَ لَهَا ‏\"‏‏.‏",
                "headingArabic": "الشُّرُوطِ الَّتِي لاَ تَحِلُّ فِي النِّكَاحِ‏",
                "headingUrdu": "عقد نکاح میں شرائط جائز نہیں۔",
                "headingEnglish": "Conditions not lawful in the marriage contract",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4926,
                "hadithNumber": "5153",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "`Abdur-Rahman bin `Auf رضی اللہ عنہ came to Allah's Messenger (ﷺ) and he had marks of Sufra (yellow perfume). Allah's Messenger (ﷺ) asked him (about those marks). `AbdurRahman bin `Auf told him that he had married a woman from the Ansar. The Prophet (ﷺ) asked, \"How much Mahr did you pay her?\" He said, \"I paid gold equal to the weight of a date stone.\" Allah's Messenger (ﷺ) said to him, \"Give a wedding banquet, even if with one sheep.\"",
                "hadithUrdu": "عبدالرحمن بن عوف رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو ان کے اوپر زرد رنگ کا نشان تھا ۔ حضور اکرم صلی اللہ علیہ وسلم نے اس کے متعلق پوچھا تو انہوں نے بتایا کہ انہوں نے انصارکی ایک عورت سے نکاح کیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا اسے مہر کتنا دیا ہے ؟ انہوں نے کہا کہ ایک گٹھلی کے برابر سونا ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ پھر ولیمہ کر خواہ ایک بکری ہی کا ہو ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، ان کو مالک نے خبر دی ، انہیں حمید طویل نے اور انہیں انس بن مالک  رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، رضى الله عنه أَنَّ عَبْدَ، الرَّحْمَنِ بْنَ عَوْفٍ جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَبِهِ أَثَرُ صُفْرَةٍ فَسَأَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ أَنَّهُ تَزَوَّجَ امْرَأَةً مِنَ الأَنْصَارِ قَالَ ‏\"‏ كَمْ سُقْتَ إِلَيْهَا ‏\"‏‏.‏ قَالَ زِنَةَ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏",
                "headingArabic": "الصُّفْرَةِ لِلْمُتَزَوِّجِ",
                "headingUrdu": "دولہا کے لیے پیلے رنگ کا عطر",
                "headingEnglish": "Yellow coloured perfume for a bridegroom",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4927,
                "hadithNumber": "5154",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) offered a wedding banquet on the occasion of his marriage to Zainab  رضی اللہ عنہا , and provided a good meal for the Muslims. Then he went out as was his custom on marrying, he came to the dwelling places of the mothers of the Believers (i.e. his wives) invoking good (on them), and they were invoking good (on him). Then he departed (and came back) and saw two men (still sitting there). So he left again. I do not remember whether I informed him or he was informed (by somebody else) of their departure).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے زینب بنت جحش رضی اللہ عنہا کے ساتھ نکاح پر دعوت ولیمہ کی اور مسلمانوںکے لئے کھانے کا انتظام کیا ۔ ( کھانے سے فراغت کے بعد ) آنحضرت صلی اللہ علیہ وسلم باہر تشریف لے گئے ، جیسا کہ نکاح کے بعد آپ کا دستور تھا ۔ پھر آپ امہات المؤمنین کے حجروں میں تشریف لے گئے ۔ آپ نے ان کے لئے دعا کی اور انہوں نے آپ کے لئے دعا کی ۔ پھر آپ واپس تشریف لائے تو دو صحابہ کو دیکھا ( کہ ابھی بیٹھے ہوئے تھے ) اس لئے آپ پھر تشریف لے گئے ( انس رضی اللہ عنہ نے بیان کیا کہ ) مجھے پوری طرح یاد نہیں کہ میں نے خود آنحضرت صلی اللہ علیہ وسلم کو خبر دی یا کسی اور نے خبر دی کہ وہ دونوں صحابی بھی چلے گئے ہیں ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے حمیدی نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ أَوْلَمَ النَّبِيُّ صلى الله عليه وسلم بِزَيْنَبَ فَأَوْسَعَ الْمُسْلِمِينَ خَيْرًا فَخَرَجَ ـ كَمَا يَصْنَعُ إِذَا تَزَوَّجَ ـ فَأَتَى حُجَرَ أُمَّهَاتِ الْمُؤْمِنِينَ يَدْعُو وَيَدْعُونَ ‏{‏لَهُ‏}‏ ثُمَّ انْصَرَفَ فَرَأَى رَجُلَيْنِ فَرَجَعَ لاَ أَدْرِي آخْبَرْتُهُ أَوْ أُخْبِرَ بِخُرُوجِهِمَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4901,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=196",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=194",
                "label": "194",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=195",
                "label": "195",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=196",
                "label": "196",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=197",
                "label": "197",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=198",
                "label": "198",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=199",
                "label": "199",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=200",
                "label": "200",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=198",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=198",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=196",
        "to": 4925,
        "total": 40465
    }
}