{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 79,
        "data": [
            {
                "id": 1952,
                "hadithNumber": "2034",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) intended to practice I`tikaf and when he reached the place where he intended to perform I`tikaf, he saw some tents, the tents of `Aisha, Hafsa and Zainab. So, he said, \"Do you consider that they intended to do righteousness by doing this?\" And then he went away and did not perform I`tikaf (in Ramadan) but performed it in the month of Shawwal for ten days.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اعتکاف کا ارادہ کیا ۔ جب آپ صلی اللہ علیہ وسلم اس جگہ تشریف لائے ( یعنی مسجد میں ) جہاں آپ صلی اللہ علیہ وسلم نے اعتکاف کا ارادہ کیا تھا ۔ تو وہاں کئی خیمے موجود تھے ۔ عائشہ رضی اللہ عنہا کا بھی ، حفصہ رضی اللہ عنہا کا بھی اور زینب رضی اللہ عنہا کا بھی ، اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کیا تم یہ سمجھتے ہو کہ انہوں نے ثواب کی نیت سے ایسا کیا ہے ، پھر آپ صلی اللہ علیہ وسلم واپس تشریف لے گئے اور اعتکاف نہیں کیا بلکہ شوال کے عشرہ میں اعتکاف کیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہم کو امام مالک نے خبر دی ، انہیں یحییٰ بن سعید نے ، انہیں عمرہ بنت عبدالرحمٰن نے اور انہیں ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَرَادَ أَنْ يَعْتَكِفَ، فَلَمَّا انْصَرَفَ إِلَى الْمَكَانِ الَّذِي أَرَادَ أَنْ يَعْتَكِفَ إِذَا أَخْبِيَةٌ خِبَاءُ عَائِشَةَ، وَخِبَاءُ حَفْصَةَ، وَخِبَاءُ زَيْنَبَ، فَقَالَ ‏ \"‏ آلْبِرَّ تَقُولُونَ بِهِنَّ ‏\"‏‏.‏ ثُمَّ انْصَرَفَ، فَلَمْ يَعْتَكِفْ، حَتَّى اعْتَكَفَ عَشْرًا مِنْ شَوَّالٍ‏.‏",
                "headingArabic": "الأَخْبِيَةِ فِي الْمَسْجِدِ",
                "headingUrdu": "مسجد میں خیمے۔",
                "headingEnglish": "Tents in mosque.",
                "chapterId": "34",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 34,
                    "chapterNumber": "34",
                    "chapterEnglish": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)",
                    "chapterUrdu": "اعتکاف کے مسائل کا بیان",
                    "chapterArabic": "كتاب الاعتكاف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1953,
                "hadithNumber": "2035",
                "englishNarrator": "Narrated Safiya رضی اللہ عنہا :",
                "hadithEnglish": "She went to Allah's Messenger (ﷺ) to visit him in the mosque while he was in I`tikaf in the last ten days of Ramadan. She had a talk with him for a while, then she got up in order to return home. The Prophet (ﷺ) accompanied her. When they reached the gate of the mosque, opposite the door of Um-Salama, two Ansari men were passing by and they greeted Allah's Apostle . He told them: Do not run away! And said, \"She is (my wife) Safiya bint Huyai رضی اللہ عنہا .\" Both of them said, \"Subhan Allah, (How dare we think of any evil) O Allah's Messenger (ﷺ)!\" And they felt it. The Prophet said (to them), \"Satan reaches everywhere in the human body as blood reaches in it, (everywhere in one's body). I was afraid lest Satan might insert an evil thought in your minds.\"",
                "hadithUrdu": "وہ رمضان کے آخری عشرہ میں جب رسول اللہ صلی اللہ علیہ وسلم اعتکاف میں بیٹھے ہوئے تھے ، آپ صلی اللہ علیہ وسلم سے ملنے مسجد میں آئیں تھوڑی دیر تک باتیں کیں پھر واپس ہونے کے لیے کھڑی ہوئیں ۔ نبی کریم صلی اللہ علیہ وسلم بھی انہیں پہنچانے کے لیے کھڑے ہوئے ۔ جب وہ ام سلمہ رضی اللہ عنہا کے دروزے سے قریب والے مسجد کے دروازے پر پہنچیں ، تو دو انصاری آدمی ادھر سے گزرے اور نبی کریم صلی اللہ علیہ وسلم کو سلام کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کسی سوچ کی ضرورت نہیں ، یہ تو ( میری بیوی ) صفیہ بنت حیی ( رضی اللہ عنہا ) ہیں ۔ ان دونوں صحابیوں نے عرض کیا ، سبحان اللہ ! یا رسول اللہ ! ان پر آپ کا جملہ بڑا شاق گزرا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ شیطان خون کی طرح انسان کے بدن میں دوڑتا رہتا ہے ۔ مجھے خطرہ ہوا کہ کہیں تمہارے دلوں میں وہ کوئی بدگمانی نہ ڈال دے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا کہ ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا کہ مجھے امام زین العابدین علی بن حسین نے خبر دی ، اور انہیں نبی کریم صلی اللہ علیہ وسلم کی پاک بیوی حضرت صفیہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَلِيُّ بْنُ الْحُسَيْنِ ـ رضى الله عنهما ـ أَنَّ صَفِيَّةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّهَا جَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم تَزُورُهُ فِي اعْتِكَافِهِ فِي الْمَسْجِدِ، فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ، فَتَحَدَّثَتْ عِنْدَهُ سَاعَةً، ثُمَّ قَامَتْ تَنْقَلِبُ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم مَعَهَا يَقْلِبُهَا، حَتَّى إِذَا بَلَغَتْ باب الْمَسْجِدِ عِنْدَ باب أُمِّ سَلَمَةَ مَرَّ رَجُلاَنِ مِنَ الأَنْصَارِ، فَسَلَّمَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُمَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَلَى رِسْلِكُمَا إِنَّمَا هِيَ صَفِيَّةُ بِنْتُ حُيَىٍّ ‏\"‏‏.‏ فَقَالاَ سُبْحَانَ اللَّهِ يَا رَسُولَ اللَّهِ‏.‏ وَكَبُرَ عَلَيْهِمَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ الشَّيْطَانَ يَبْلُغُ مِنَ الإِنْسَانِ مَبْلَغَ الدَّمِ، وَإِنِّي خَشِيتُ أَنْ يَقْذِفَ فِي قُلُوبِكُمَا شَيْئًا ‏\"‏‏.‏",
                "headingArabic": "هَلْ يَخْرُجُ الْمُعْتَكِفُ لِحَوَائِجِهِ إِلَى باب الْمَسْجِدِ",
                "headingUrdu": "معتکف کا مسجد کے دروازے پر جانا۔",
                "headingEnglish": "Mu'takif going to the gate of the mosque.",
                "chapterId": "34",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 34,
                    "chapterNumber": "34",
                    "chapterEnglish": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)",
                    "chapterUrdu": "اعتکاف کے مسائل کا بیان",
                    "chapterArabic": "كتاب الاعتكاف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1954,
                "hadithNumber": "2036",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri  رضی اللہ عنہ :",
                "hadithEnglish": "\"Did you hear Allah's Messenger (ﷺ) talking about the Night of Qadr?\" He replied in the affirmative and said, \"Once we were in I`tikaf with Allah's Messenger (ﷺ) in the middle ten days of (Ramadan) and we came out of it in the morning of the twentieth, and Allah's Messenger (ﷺ)delivered a sermon on the 20th (of Ramadan) and said, 'I was informed (of the date) of the Night of Qadr (in my dream) but had forgotten it. So, look for it in the odd nights of the last ten nights of the month of Ramadan. I saw myself prostrating in mud and water on that night (as a sign of the Night of Qadr). So, whoever had been in I`tikaf with Allah's Messenger (ﷺ) should return for it.' The people returned to the mosque (for I`tikaf). There was no trace of clouds in the sky. But all of a sudden a cloud came and it rained. Then the prayer was established (they stood for the prayer) and Allah's Messenger (ﷺ) prostrated in mud and water and I saw mud over the forehead and the nose of the Prophet.",
                "hadithUrdu": "کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے شب قدر کا ذکر سنا ہے ؟ انہوں نے کہا کہ ہاں ! ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رمضان کے دوسرے عشرے میں اعتکاف کیا تھا ، ابوسعید رضی اللہ عنہ نے بیان کیا کہ پھر بیس کی صبح کو ہم نے اعتکاف ختم کر دیا ۔ اسی صبح کو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں خطاب فرمایا کہ مجھے شب قدر دکھائی گئی تھی ، لیکن پھر بھلا دی گئی ، اس لیے اب اسے آخری عشرے کی طاق راتوں میں تلاش کرو ۔ میں نے ( خواب میں ) دیکھا ہے کہ میں کیچڑ ، پانی میں سجدہ کر رہا ہوں اور جن لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( اس سال ) اعتکاف کیا تھا وہ پھر دوبارہ کریں ۔ چنانچہ وہ لوگ مسجد میں دوبارہ آ گئے ۔ آسمان میں کہیں بادل کا ایک ٹکڑا بھی نہیں تھا کہ اچانک بادل آیا اور بارش شروع ہو گئی ۔ پھر نماز کی تکبیر ہوئی اوررسول اللہ صلی اللہ علیہ وسلم نے کیچڑ میں سجدہ کیا ۔ میں نے خود آپ کی ناک اور پیشانی پر کیچڑ لگا ہوا دیکھا ۔",
                "urduNarrator": "مجھ سے عبداللہ بن منیر نے بیان کیا ، انہوں نے ہارون بن اسماعیل سے سنا ، انہوں نے کہا کہ ہم سے علی بن مبارک نے بیان کیا کہا کہ مجھ سے یحییٰ بن ابی کثیر نے بیان کیا ، انہوں نے کہا کہ میں نے ابوسلمہ بن عبدالرحمٰن سے سنا ، انہوں نے کہامیں نے ابو سعید خدری رضی اللہ عنہ سے سنا ، میں نے ان سے پوچھا تھا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ هَارُونَ بْنَ إِسْمَاعِيلَ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، قَالَ سَأَلْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ قُلْتُ هَلْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ لَيْلَةَ الْقَدْرِ قَالَ نَعَمِ، اعْتَكَفْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْعَشْرَ الأَوْسَطَ مِنْ رَمَضَانَ ـ قَالَ ـ فَخَرَجْنَا صَبِيحَةَ عِشْرِينَ، قَالَ فَخَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم صَبِيحَةَ عِشْرِينَ فَقَالَ ‏ \"‏ إِنِّي أُرِيتُ لَيْلَةَ الْقَدْرِ، وَإِنِّي نُسِّيتُهَا، فَالْتَمِسُوهَا فِي الْعَشْرِ الأَوَاخِرِ فِي وِتْرٍ، فَإِنِّي رَأَيْتُ أَنِّي أَسْجُدُ فِي مَاءٍ وَطِينٍ، وَمَنْ كَانَ اعْتَكَفَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلْيَرْجِعْ ‏\"‏‏.‏ فَرَجَعَ النَّاسُ إِلَى الْمَسْجِدِ، وَمَا نَرَى فِي السَّمَاءِ قَزَعَةً ـ قَالَ ـ فَجَاءَتْ سَحَابَةٌ فَمَطَرَتْ، وَأُقِيمَتِ الصَّلاَةُ، فَسَجَدَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الطِّينِ وَالْمَاءِ، حَتَّى رَأَيْتُ الطِّينَ فِي أَرْنَبَتِهِ وَجَبْهَتِهِ‏.‏",
                "headingArabic": "الاِعْتِكَافِ وَخَرَجَ النَّبِيُّ صلى الله عليه وسلم صَبِيحَةَ عِشْرِينَ",
                "headingUrdu": "بیسویں (رمضان المبارک) کی صبح اعتکاف سے نکلنا",
                "headingEnglish": "Coming out of I'tikaf in the morning of the twentieth (of Ramadan)",
                "chapterId": "34",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 34,
                    "chapterNumber": "34",
                    "chapterEnglish": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)",
                    "chapterUrdu": "اعتکاف کے مسائل کا بیان",
                    "chapterArabic": "كتاب الاعتكاف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1955,
                "hadithNumber": "2037",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "One of the wives of Allah's Messenger (ﷺ) practiced I`tikaf with him while she ad bleeding in between her periods and she would see red (blood) or yellowish traces, and sometimes we put a tray beneath her when she offered the prayer.",
                "hadithUrdu": "رسول اللہ علیہ وسلم کے ساتھ آپ صلی اللہ علیہ وسلم کی بیویوں میں سے ایک خاتون ( ام سلمہ رضی اللہ عنہا ) نے جو مستحاضہ تھیں ، اعتکاف کیا ۔ وہ سرخی اور زردی ( یعنی استحاضہ کا خون ) دیکھتی تھیں ۔ اکثر طشت ہم ان کے نیچے رکھ دیتے اور وہ نماز پڑھتی رہتیں ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، کہا کہ ہم سے یزید بن زریع نے بیان کیا ، ان سے خالد نے ، ان سے عکرمہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اعْتَكَفَتْ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم امْرَأَةٌ مِنْ أَزْوَاجِهِ مُسْتَحَاضَةٌ، فَكَانَتْ تَرَى الْحُمْرَةَ وَالصُّفْرَةَ، فَرُبَّمَا وَضَعْنَا الطَّسْتَ تَحْتَهَا وَهْىَ تُصَلِّي‏.‏",
                "headingArabic": "اعْتِكَافِ الْمُسْتَحَاضَةِ",
                "headingUrdu": "اس عورت کا اعتکاف جس کو ماہواری کے درمیان خون آتا ہو۔",
                "headingEnglish": "I'tikaf of a woman who has bleeding in between her periods",
                "chapterId": "34",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 34,
                    "chapterNumber": "34",
                    "chapterEnglish": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)",
                    "chapterUrdu": "اعتکاف کے مسائل کا بیان",
                    "chapterArabic": "كتاب الاعتكاف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1956,
                "hadithNumber": "2038",
                "englishNarrator": "Narrated `Ali bin Al-Husain رضی اللہ عنہ (from Safiya the Prophet's wife):",
                "hadithEnglish": "The wives of the Prophet (ﷺ) were with him in the mosque (while he was in I`tikaf) and then they departed and the Prophet (ﷺ) said to Safiya bint Huyai رضی اللہ عنہا , \"Don't hurry up, for I shall accompany you,\" (and her dwelling was in the house of Usama  رضی اللہ عنہ). The Prophet (ﷺ) went out and in the meantime two Ansari men met him and they looked at the Prophet (ﷺ) and passed by. The Prophet (ﷺ) said to them, \"Come here. She is (my wife) Safiya bint Huyai.\" They replied, \"Subhan Allah, (How dare we think of evil) O Allah's Apostle! (we never expect anything bad from you).\" The Prophet (ﷺ) replied, \"Satan circulates in the human being as blood circulates in the body, and I was afraid lest Satan might insert an evil thought in your minds.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی پاک بیوی حضرت صفیہ رضی اللہ عنہا نے انہیں خبر دی ( دوسری سند ) اور امام بخاری نے کہا کہ ہم سے عبداللہ بن محمد نے بیان کیا کہا کہ ہم سے ہشام نے بیان کیا ، انہیں معمر نے خبر دی ، انہیں زہری نے ، انہیں علی بن حسین رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم مسجد میں ( اعتکاف میں ) تھے آپ کے پاس ازواج مطہرات بیٹھی تھیں ۔ جب وہ چلنے لگیں تو آپ نے صفیہ بنت حیی رضی اللہ عنہا سے فرمایا کہ جلدی نہ کر ، میں تمہیں چھوڑنے چلتا ہوں ۔ ان کا حجرہ دار اسامہ رضی اللہ عنہ میں تھا ، چنانچہ جب رسول اللہ صلی اللہ علیہ وسلم ان کے ساتھ نکلے تو دو انصاری صحابیوں سے آپ صلی اللہ علیہ وسلم کی ملاقات ہوئی ۔ ان دونوں حضرات نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا اور جلدی سے آگے بڑھ جانا چاہا ۔ لیکن آپ نے فرمایا ٹھہرو ! ادھر سنو ! یہ صفیہ بنت حیی ہیں ( جو میری بیوی ہیں ) ان حضرات نے عرض کی ، سبحان اللہ ! یا رسول اللہ ! آپ نے فرمایا کہ شیطان ( انسان کے جسم میں ) خون کی طرح دوڑتا ہے اور مجھے خطرہ یہ ہوا کہ کہیں تمہارے دلوں میں بھی کوئی ( بری ) بات نہ ڈال دے ۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ مجھ سے لیث نے بیان کیا ، ان سے عبدالرحمٰن بن خالد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے امام زین العابدین علی بن حسین رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ـ رضى الله عنهما ـ أَنَّ صَفِيَّةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ‏.‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا هِشَامٌ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ كَانَ النَّبِيُّ صلى الله عليه وسلم فِي الْمَسْجِدِ، وَعِنْدَهُ أَزْوَاجُهُ، فَرُحْنَ، فَقَالَ لِصَفِيَّةَ بِنْتِ حُيَىٍّ ‏\"‏ لاَ تَعْجَلِي حَتَّى أَنْصَرِفَ مَعَكِ ‏\"‏‏.‏ وَكَانَ بَيْتُهَا فِي دَارِ أُسَامَةَ، فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم مَعَهَا، فَلَقِيَهُ رَجُلاَنِ مِنَ الأَنْصَارِ، فَنَظَرَا إِلَى النَّبِيِّ صلى الله عليه وسلم ثُمَّ أَجَازَا وَقَالَ لَهُمَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَعَالَيَا، إِنَّهَا صَفِيَّةُ بِنْتُ حُيَىٍّ ‏\"‏‏.‏ قَالاَ سُبْحَانَ اللَّهِ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ إِنَّ الشَّيْطَانَ يَجْرِي مِنَ الإِنْسَانِ مَجْرَى الدَّمِ، وَإِنِّي خَشِيتُ أَنْ يُلْقِيَ فِي أَنْفُسِكُمَا شَيْئًا ‏\"‏‏.‏",
                "headingArabic": "زِيَارَةِ الْمَرْأَةِ زَوْجَهَا فِي اعْتِكَافِهِ",
                "headingUrdu": "اعتکاف میں بیوی کا شوہر سے ملنا",
                "headingEnglish": "The visit of the wife to her husband in I'tikaf",
                "chapterId": "34",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 34,
                    "chapterNumber": "34",
                    "chapterEnglish": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)",
                    "chapterUrdu": "اعتکاف کے مسائل کا بیان",
                    "chapterArabic": "كتاب الاعتكاف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1957,
                "hadithNumber": "2039",
                "englishNarrator": "Narrated `Ali bin Al-Husain رضی اللہ عنہ from Safiya:",
                "hadithEnglish": "Safiya رضی اللہ عنہا went to the Prophet (ﷺ) while he was in I`tikaf. When she returned, the Prophet (ﷺ) accompanied her walking. An Ansari man saw him. When the Prophet (ﷺ) noticed him, he called him and said, \"Come here. She is Safiya. (Sufyan a sub-narrator perhaps said that the Prophet (ﷺ) had said, \"This is Safiya\"). And Satan circulates in the body of Adam's offspring as his blood circulates in it.\" (A sub-narrator asked Sufyan, \"Did Safiya visit him at night?\" He said, \"Of course, at night.\")",
                "hadithUrdu": "صفیہ رضی اللہ عنہا نبی کریم صلی اللہ علیہ وسلم کے یہاں آئیں ۔ آپ صلی اللہ علیہ وسلم اس وقت اعتکاف میں تھے ۔ پھر جب وہ واپس ہونے لگیں تو آپ بھی ان کے ساتھ ( تھوڑی دور تک انہیں چھوڑنے ) آئے ۔ ( آتے ہوئے ) ایک انصاری صحابی رضی اللہ عنہ نے آپ کو دیکھا ۔ جب آنحضرت صلی اللہ علیہ وسلم کی نظر ان پر پڑی ، تو فوراً آپ صلی اللہ علیہ وسلم نے انہیں بلایا ، کہ سنو ! یہ ( میری بیوی ) صفیہ رضی اللہ عنہا ہیں ۔ ( سفیان نے ہی صفیہ کے بجائے بعض اوقات «هذه صفية» کے الفاظ کہے ۔ ( اس کی وضاحت اس لیے ضرور ی سمجھی ) کہ شیطان انسان کے جسم میں خون کی طرح دوڑتا رہتا ہے ۔ میں ( علی بن عبداللہ ) نے سفیان سے پوچھا کہ غالباً وہ رات کو آئی ہوں گی ؟ تو انہوں نے فرمایا کہ رات کے سوا اور وقت ہی کون سا ہو سکتا تھا ۔",
                "urduNarrator": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ مجھے میرے بھائی نے خبر دی ، انہیں سلیمان نے ، انہیں محمد بن ابی عتیق نے ، انہیں ابن شہاب نے ، انہیں علی بن حسین رضی اللہ عنہ نے کہ صفیہ رضی اللہ عنہا نے انہیں خبر دی ( دوسری سند ) اور ہم سے علی بن عبداللہ نے بیان کیا ، ان سے سفیان بن عیینہ نے بیان کیا ، کہا کہ میں نے زہری سے سنا ۔ وہ علی بن حسین رضی اللہ عنہ سے خبر دیتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ أَخْبَرَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ أَبِي عَتِيقٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ ـ رضى الله عنهما ـ أَنَّ صَفِيَّةَ، أَخْبَرَتْهُ‏.‏ حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، يُخْبِرُ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ، أَنَّ صَفِيَّةَ ـ رضى الله عنها ـ أَتَتِ النَّبِيَّ صلى الله عليه وسلم وَهْوَ مُعْتَكِفٌ، فَلَمَّا رَجَعَتْ مَشَى مَعَهَا، فَأَبْصَرَهُ رَجُلٌ مِنَ الأَنْصَارِ، فَلَمَّا أَبْصَرَهُ دَعَاهُ فَقَالَ ‏ \"‏ تَعَالَ هِيَ صَفِيَّةُ ـ وَرُبَّمَا قَالَ سُفْيَانُ هَذِهِ صَفِيَّةُ ـ فَإِنَّ الشَّيْطَانَ يَجْرِي مِنَ ابْنِ آدَمَ مَجْرَى الدَّمِ ‏\"‏‏.‏ قُلْتُ لِسُفْيَانَ أَتَتْهُ لَيْلاً قَالَ وَهَلْ هُوَ إِلاَّ لَيْلٌ",
                "headingArabic": "هَلْ يَدْرَأُ الْمُعْتَكِفُ عَنْ نَفْسِهِ",
                "headingUrdu": "کیا معتکف کے لیے اپنا دفاع کرنا جائز ہے؟",
                "headingEnglish": "Is it permissible for the Mu'takif to defend himself.",
                "chapterId": "34",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 34,
                    "chapterNumber": "34",
                    "chapterEnglish": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)",
                    "chapterUrdu": "اعتکاف کے مسائل کا بیان",
                    "chapterArabic": "كتاب الاعتكاف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1958,
                "hadithNumber": "2040",
                "englishNarrator": "Narrated Abu Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "We practiced I`tikaf with Allah's Messenger (ﷺ) in the middle ten days (of Ramadan). In the morning of the twentieth (of Ramadan) we shifted our baggage, but Allah's Messenger (ﷺ) came to us and said, \"Whoever was m I`tikaf should return to his place of I`tikaf, for I saw (i.e. was informed about the date of) this Night (of Qadr) and saw myself prostrating in mud and water.\" When I returned to my place the sky was overcast with clouds and it rained. By Him Who sent Muhammad with the Truth, the sky was covered with clouds from the end of that day, and the mosque which was roofed with leafstalks of date palm trees (leaked with rain) and I saw the trace of mud and water over the nose of the Prophet (ﷺ) and its tip.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رمضان کے دوسرے عشرے میں اعتکاف کے لیے بیٹھے ۔ بیسویں کی صبح کو ہم نے اپنا سامان ( مسجدسے ) اٹھا لیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم تشریف لائے اور فرمایا کہ جس نے ( دوسرے عشرہ میں ) اعتکاف کیا ہے وہ دوبارہ اعتکاف کی جگہ چلے ، کیونکہ میں نے آج کی رات ( شب قدر کو ) خواب میں دیکھا ہے میں نے یہ بھی دیکھا کہ میں کیچڑ میں سجدہ کر رہا ہوں ۔ پھر جب اپنے اعتکاف کی جگہ ( مسجد میں ) آپ دوبارہ آ گئے تو اچانک بادل منڈلائے ، اور بارش ہوئی ۔ اس ذات کی قسم جس نے حضور اکرم صلی اللہ علیہ وسلم کو حق کے ساتھ بھیجا ! آسمان پر اسی دن کے آخری حصہ میں بادل ہوا تھا ۔ مسجد کھجور کی شاخوں سے بنی ہوئی تھی ( اس لیے چھت سے پانی ٹپکا ) جب آپ صلی اللہ علیہ وسلم نے نماز صبح ادا کی ، تو میں نے دیکھا کہ آپ کی ناک اور پیشانی پر کیچڑ کا اثر تھا ۔",
                "urduNarrator": "ہم سے عبدالرحمٰن بن بشر نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابن جریج نے بیان کیا ، ان سے ابن ابی نجیح کے ماموں سلیمان احول نے ، ان سے ابوسلمہ نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے ۔ سفیان نے کہا اور ہم سے محمد بن عمرو نے بیان کیا ، ان سے ابوسلمہ نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے ، سفیان نے یہ بھی کہا کہ مجھے یقین کے ساتھ یاد ہے کہ ابن ابی لبید نے ہم سے یہ حدیث بیان کی تھی ، ان سے ابوسلمہ نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ سُلَيْمَانَ الأَحْوَلِ، خَالِ ابْنِ أَبِي نَجِيحٍ عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ،‏.‏ قَالَ سُفْيَانُ وَحَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ،‏.‏ قَالَ وَأَظُنُّ أَنَّ ابْنَ أَبِي لَبِيدٍ، حَدَّثَنَا عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ قَالَ اعْتَكَفْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْعَشْرَ الأَوْسَطَ، فَلَمَّا كَانَ صَبِيحَةَ عِشْرِينَ نَقَلْنَا مَتَاعَنَا فَأَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ كَانَ اعْتَكَفَ فَلْيَرْجِعْ إِلَى مُعْتَكَفِهِ فَإِنِّي رَأَيْتُ هَذِهِ اللَّيْلَةَ، وَرَأَيْتُنِي أَسْجُدُ فِي مَاءٍ وَطِينٍ ‏\"‏‏.‏ فَلَمَّا رَجَعَ إِلَى مُعْتَكَفِهِ، وَهَاجَتِ السَّمَاءُ، فَمُطِرْنَا فَوَالَّذِي بَعَثَهُ بِالْحَقِّ لَقَدْ هَاجَتِ السَّمَاءُ مِنْ آخِرِ ذَلِكَ الْيَوْمِ، وَكَانَ الْمَسْجِدُ عَرِيشًا، فَلَقَدْ رَأَيْتُ عَلَى أَنْفِهِ وَأَرْنَبَتِهِ أَثَرَ الْمَاءِ وَالطِّينِ‏.‏",
                "headingArabic": "مَنْ خَرَجَ مِنَ اعْتِكَافِهِ عِنْدَ الصُّبْحِ",
                "headingUrdu": "جو شخص صبح اپنے اعتکاف سے نکلا۔",
                "headingEnglish": "Whoever went out of his I'tikaf in the morning",
                "chapterId": "34",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 34,
                    "chapterNumber": "34",
                    "chapterEnglish": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)",
                    "chapterUrdu": "اعتکاف کے مسائل کا بیان",
                    "chapterArabic": "كتاب الاعتكاف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1959,
                "hadithNumber": "2041",
                "englishNarrator": "Narrated `Amra bint `Abdur-Rahman from `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to practice I`tikaf every year in the month of Ramadan. And after offering the morning prayer, he used to enter the place of his I`tikaf. `Aisha رضی اللہ عنہا asked his permission to let her practice I`tikaf and he allowed her, and so she pitched a tent in the mosque. When Hafsa heard of that, she also pitched a tent (for herself), and when Zainab رضی اللہ عنہا heard of that, she too pitched another tent. When, in the morning, Allah's Messenger (ﷺ) had finished the morning prayer, he saw four tents and asked, \"What is this?\" He was informed about it. He then said, \"What made them do this? Is it righteousness? Remove the tents, for I do not want to see them.\" So, the tents were removed. The Prophet (ﷺ) did not perform I`tikaf that year in the month of Ramadan, but did it in the last ten days of Shawwal.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ہر رمضان میں اعتکاف کیا کرتے ۔ آپ صبح کی نماز پڑھنے کے بعد اس جگہ جاتے جہاں آپ کو اعتکاف کے لیے بیٹھنا ہوتا ۔ راوی نے کہا کہ حضرت عائشہ رضی اللہ عنہا نے بھی آپ سے اعتکاف کرنے کی اجازت چاہی ۔ آپ نے انہیں اجازت دے دی ، اس لیے انہوں نے ( اپنے لیے بھی مسجد میں ) ایک خیمہ لگا لیا ۔ حفصہ رضی اللہ عنہا ( زوجہ مطہرہ نبی کریم صلی اللہ علیہ وسلم ) نے سنا تو انہوں نے بھی ایک خیمہ لگا لیا ۔ زینب رضی اللہ عنہا ( زوجہ مطہرہ نبی کریم صلی اللہ علیہ وسلم ) نے سنا تو انہوں نے بھی ایک خیمہ لگا لیا ۔ صبح کو جب آنحضرت صلی اللہ علیہ وسلم نماز پڑھ کر لوٹے تو چار خیمے دیکھے ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ، یہ کیا ہے ؟ آپ صلی اللہ علیہ وسلم کو حقیقت حال کی اطلاع دی گئی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا انہوں نے ثواب کی نیت سے یہ نہیں کیا ، ( بلکہ صرف ایک دوسری کی ریس سے یہ کیا ہے ) انہیں اکھاڑ دو ۔ میں انہیں اچھا نہیں سمجھتا ، چنانچہ وہ اکھاڑ دیئے گئے اور آپ نے بھی ( اس سال ) رمضان میں اعتکاف نہیں کیا ۔ بلکہ شوال کے آخری عشرہ میں اعتکاف کیا ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا کہ ہم کو محمد بن فضیل بن غزوان نے خبر دی ، انہیں یحییٰ بن سعید نے ، انہیں عمرو بنت عبدالرحمٰن نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا مُحَمَّدُ بْنُ فُضَيْلِ بْنِ غَزْوَانَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعْتَكِفُ فِي كُلِّ رَمَضَانَ، وَإِذَا صَلَّى الْغَدَاةَ دَخَلَ مَكَانَهُ الَّذِي اعْتَكَفَ فِيهِ ـ قَالَ ـ فَاسْتَأْذَنَتْهُ عَائِشَةُ أَنْ تَعْتَكِفَ فَأَذِنَ لَهَا فَضَرَبَتْ فِيهِ قُبَّةً، فَسَمِعَتْ بِهَا حَفْصَةُ، فَضَرَبَتْ قُبَّةً، وَسَمِعَتْ زَيْنَبُ بِهَا، فَضَرَبَتْ قُبَّةً أُخْرَى، فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الْغَدِ أَبْصَرَ أَرْبَعَ قِبَابٍ، فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏‏.‏ فَأُخْبِرَ خَبَرَهُنَّ، فَقَالَ ‏\"‏ مَا حَمَلَهُنَّ عَلَى هَذَا آلْبِرُّ انْزِعُوهَا فَلاَ أَرَاهَا ‏\"‏‏.‏ فَنُزِعَتْ، فَلَمْ يَعْتَكِفْ فِي رَمَضَانَ حَتَّى اعْتَكَفَ فِي آخِرِ الْعَشْرِ مِنْ شَوَّالٍ‏.‏",
                "headingArabic": "الاِعْتِكَافِ فِي شَوَّالٍ",
                "headingUrdu": "شوال کے مہینے میں اعتکاف",
                "headingEnglish": "I'tikaf in the month of Shawwal",
                "chapterId": "34",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 34,
                    "chapterNumber": "34",
                    "chapterEnglish": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)",
                    "chapterUrdu": "اعتکاف کے مسائل کا بیان",
                    "chapterArabic": "كتاب الاعتكاف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1960,
                "hadithNumber": "2042",
                "englishNarrator": "Narrated `Umar bin Al-Khattab رضی اللہ عنہ :",
                "hadithEnglish": "\"O Allah's Messenger (ﷺ)! I vowed in the Pre-Islamic period to perform I`tikaf in Al-Masjid-al-Haram for one night.\" The Prophet (ﷺ) said, \"Fulfill your vow.\" So, he performed I`tikaf for one night.",
                "hadithUrdu": "یا رسول اللہ ! میں نے جاہلیت میں نذر مانی تھی کہ ایک رات کا مسجدالحرام میں اعتکاف کروں گا ۔ حضور صلی اللہ علیہ وسلم نے فرمایا کہ پھر اپنی نذر پوری کر ۔ چنانچہ عمر رضی اللہ عنہ نے ایک رات بھر اعتکاف کیا ۔",
                "urduNarrator": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، انہوں نے اپنے بھائی ( عبدالحمید ) سے ، ان سے سلیمان نے ، ان سے عبیداللہ بن عمر نے ، ان سے نافع نے ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا ، ان سے عمر بن خطاب رضی اللہ عنہ نے کہ انہوں نے پوچھا ،",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، عَنْ أَخِيهِ، عَنْ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ لَيْلَةً فِي الْمَسْجِدِ الْحَرَامِ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَوْفِ نَذْرَكَ ‏\"‏‏.‏ فَاعْتَكَفَ لَيْلَةً‏.‏",
                "headingArabic": "مَنْ لَمْ يَرَ عَلَيْهِ صَوْمًا إِذَا اعْتَكَفَ",
                "headingUrdu": "بغیر روزے کے اعتکاف",
                "headingEnglish": "I'tikaf without fasting",
                "chapterId": "34",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 34,
                    "chapterNumber": "34",
                    "chapterEnglish": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)",
                    "chapterUrdu": "اعتکاف کے مسائل کا بیان",
                    "chapterArabic": "كتاب الاعتكاف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1961,
                "hadithNumber": "2043",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "`Umar رضی اللہ عنہما had vowed in the Pre-Islamic period to perform I`tikaf in Al-Masjid-al-Haram. (A subnarrator thinks that `Umar vowed to perform I`tikaf for one night.) Allah's Messenger (ﷺ) said to `Umar, \"Fulfill your vow.\"",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ نے زمانہ جاہلیت میں مسجدالحرام میں اعتکاف کی نذر مانی تھی ، عبید نے بیان کیا کہ میرا خیال ہے کہ انہوں نے رات بھر کا ذکر کیا تھا ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اپنی نذر پوری کر ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا کہ ہم سے ابواسامہ نے بیان کیا ، ان سے عبیداللہ نے ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ ـ رضى الله عنه ـ نَذَرَ فِي الْجَاهِلِيَّةِ أَنْ يَعْتَكِفَ فِي الْمَسْجِدِ الْحَرَامِ ـ قَالَ أُرَاهُ قَالَ ـ لَيْلَةً قَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَوْفِ بِنَذْرِكَ ‏\"‏‏.‏",
                "headingArabic": "إِذَا نَذَرَ فِي الْجَاهِلِيَّةِ أَنْ يَعْتَكِفَ ثُمَّ أَسْلَمَ",
                "headingUrdu": "زمانہ جاہلیت میں اعتکاف کی نذر مانیں۔",
                "headingEnglish": "Vow in the pre-Islamic period to perform I'tikaf",
                "chapterId": "34",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 34,
                    "chapterNumber": "34",
                    "chapterEnglish": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)",
                    "chapterUrdu": "اعتکاف کے مسائل کا بیان",
                    "chapterArabic": "كتاب الاعتكاف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1962,
                "hadithNumber": "2044",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) used to perform I`tikaf every year in the month of Ramadan for ten days, and when it was the year of his death, he stayed in I`tikaf for twenty days.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ہر سال رمضان میں دس دن کا اعتکاف کیا کرتے تھے ۔ لیکن جس سال آپ صلی اللہ علیہ وسلم کا انتقال ہوا ، اس سال آپ صلی اللہ علیہ وسلم نے بیس دن کا اعتکاف کیا تھا ۔",
                "urduNarrator": "ہم سے عبداللہ بن ابی شبیہ نے بیان کیا ، کہا کہ ہم سے ابوبکر بن عیاش نے بیان کیا ، ان سے ابوحصین عثمان بن عاصم نے ، ان سے ابوصالح سمان نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو بَكْرٍ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَعْتَكِفُ فِي كُلِّ رَمَضَانَ عَشْرَةَ أَيَّامٍ، فَلَمَّا كَانَ الْعَامُ الَّذِي قُبِضَ فِيهِ اعْتَكَفَ عِشْرِينَ يَوْمًا‏.‏",
                "headingArabic": "الاِعْتِكَافِ فِي الْعَشْرِ الأَوْسَطِ مِنْ رَمَضَانَ",
                "headingUrdu": "رمضان کے درمیانی عشرہ میں اعتکاف کرنا",
                "headingEnglish": "I'tikaf in the middle ten days of Ramadan",
                "chapterId": "34",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 34,
                    "chapterNumber": "34",
                    "chapterEnglish": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)",
                    "chapterUrdu": "اعتکاف کے مسائل کا بیان",
                    "chapterArabic": "كتاب الاعتكاف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1963,
                "hadithNumber": "2045",
                "englishNarrator": "Narrated `Amra bint `Abdur-Rahman from `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) mentioned that he would practice I`tikaf in the last ten days of Ramadan. `Aisha asked his permission to perform I`tikaf and he permitted her. Hafsa asked `Aisha رضی اللہ عنہا to take his permission for her, and she did so. When Zainab bint Jahsh رضی اللہ عنہا saw that, she ordered a tent to be pitched for her and it was pitched for her. Allah's Messenger (ﷺ) used to proceed to his tent after the prayer. So, he saw the tents ans asked, \"What is this?\" He was told that those were the tents of Aisha, Hafsa, and Zainab. Allah's Apostle said, \"Is it righteousness which they intended by doing so? I am not going to perform I`tikaf.\" So he returned home. When the fasting month was over, he performed Itikar for ten days in the month of Shawwal.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے رمضان کے آخری عشرے میں اعتکاف کے لیے ذکر کیا ۔ عائشہ رضی اللہ عنہا نے بھی آپ صلی اللہ علیہ وسلم سے اجازت مانگی ۔ آپ نے انہیں اجازت دے دی ، پھر حفصہ رضی اللہ عنہا نے عائشہ رضی اللہ عنہا سے کہا کہ ان کے لیے بھی اجازت لے دیں چنانچہ انہوں نے ایسا کر دیا ۔ جب زینب بنت حجش رضی اللہ عنہا نے دیکھا تو انہوں نے بھی خیمہ لگانے کے لیے کہا ، اور ان کے لیے بھی خیمہ لگا دیا گیا ۔ انہوں نے ذکر کیا کہ رسول اللہ صلی اللہ علیہ وسلم صبح کی نماز کے بعد اپنے خیمہ میں تشرف لے جاتے آج آپ کو بہت خیمے دکھائی دیئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ کیا ہے ؟ لوگوں نے بتایا کہ عائشہ ، حفصہ ، اور زینب رضی اللہ عنھن کے خیمے ہیں ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ ، بھلا کیا ان کی ثواب کی نیت ہے اب میں بھی اعتکاف نہیں کروں گا ۔ پھر جب ماہ رمضان ختم ہو گیا تو آپ صلی اللہ علیہ وسلم نے شوال میں اعتکاف کیا ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل ابوالحسن نے بیان کیا ، انہوں نے کہا کہ ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں اوزاعی نے خبر دی ، کہا کہ مجھ سے یحییٰ بن سعید نے بیان کیا ، کہا کہ مجھ سے عمرو بنت عبدالرحمٰن نے بیان کیا ، ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَتْنِي عَمْرَةُ بِنْتُ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ أَنْ يَعْتَكِفَ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ، فَاسْتَأْذَنَتْهُ عَائِشَةُ فَأَذِنَ لَهَا، وَسَأَلَتْ حَفْصَةُ عَائِشَةَ أَنْ تَسْتَأْذِنَ لَهَا فَفَعَلَتْ فَلَمَّا رَأَتْ ذَلِكَ زَيْنَبُ ابْنَةُ جَحْشٍ أَمَرَتْ بِبِنَاءٍ فَبُنِيَ لَهَا قَالَتْ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا صَلَّى انْصَرَفَ إِلَى بِنَائِهِ فَبَصُرَ بِالأَبْنِيَةِ فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏‏.‏ قَالُوا بِنَاءُ عَائِشَةَ وَحَفْصَةَ وَزَيْنَبَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ آلْبِرَّ أَرَدْنَ بِهَذَا مَا أَنَا بِمُعْتَكِفٍ ‏\"‏‏.‏ فَرَجَعَ، فَلَمَّا أَفْطَرَ اعْتَكَفَ عَشْرًا مِنْ شَوَّالٍ‏.‏",
                "headingArabic": "مَنْ أَرَادَ أَنْ يَعْتَكِفَ ثُمَّ بَدَا لَهُ أَنْ يَخْرُجَ",
                "headingUrdu": "جس نے اعتکاف کی نیت کی اور پھر اپنا ارادہ بدل لیا۔",
                "headingEnglish": "Whoever intended I'tikaf and then changed his mind",
                "chapterId": "34",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 34,
                    "chapterNumber": "34",
                    "chapterEnglish": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)",
                    "chapterUrdu": "اعتکاف کے مسائل کا بیان",
                    "chapterArabic": "كتاب الاعتكاف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1964,
                "hadithNumber": "2046",
                "englishNarrator": "Narrated ` Aisha رضی اللہ عنہا :",
                "hadithEnglish": "During her menses used to comb of the Prophet (ﷺ) while he used to be in I`tikaf in the mosque. He would stretch out his head towards her while she was in her chamber.",
                "hadithUrdu": "وہ حائضہ ہوتی تھیں اور رسول اللہ صلی اللہ علیہ وسلم مسجد میں اعتکاف میں ہوتے تھے ، پھر بھی وہ آپ کے سر میں اپنے حجرہ ہی میں کنگھا کرتی تھیں ۔ آپ اپنا سرمبارک ان کی طرف بڑھا دیتے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، ان سے ہشام نے بیان کیا ، انہیں معمر نے خبر دی ، انہیں زہری نے ، انہیں عروہ نے اور انہیں عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا كَانَتْ تُرَجِّلُ النَّبِيَّ صلى الله عليه وسلم وَهِيَ حَائِضٌ وَهْوَ مُعْتَكِفٌ فِي الْمَسْجِدِ وَهْىَ فِي حُجْرَتِهَا، يُنَاوِلُهَا رَأْسَهُ‏.‏",
                "headingArabic": "الْمُعْتَكِفِ يُدْخِلُ رَأْسَهُ الْبَيْتَ لِلْغَسْلِ",
                "headingUrdu": "معتکف اپنا سر دھونے کے لیے گھر میں چھوڑ سکتا ہے۔",
                "headingEnglish": "A Mu'takif can let his head in the house for washing",
                "chapterId": "34",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 34,
                    "chapterNumber": "34",
                    "chapterEnglish": "Retiring to a Mosque for Remembrance of Allah (I'tikaf)",
                    "chapterUrdu": "اعتکاف کے مسائل کا بیان",
                    "chapterArabic": "كتاب الاعتكاف",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1965,
                "hadithNumber": "2047",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "You people say that Abu Huraira رضی اللہ عنہ tells many narrations from Allah's Messenger (ﷺ) and you also wonder why the emigrants and Ansar do not narrate from Allah's Messenger (ﷺ) as Abu Huraira does. My emigrant brothers were busy in the market while I used to stick to Allah's Messenger (ﷺ) content with what fills my stomach; so I used to be present when they were absent and I used to remember when they used to forget, and my Ansari brothers used to be busy with their properties and I was one of the poor men of Suffa. I used to remember the narrations when they used to forget. No doubt, Allah's Messenger (ﷺ) once said, \"Whoever spreads his garment till I have finished my present speech and then gathers it to himself, will remember whatever I will say.\" So, I spread my colored garment which I was wearing till Allah's Messenger (ﷺ) had finished his saying, and then I gathered it to my chest. So, I did not forget any of that narrations.",
                "hadithUrdu": "ابوہریرہ ( رضی اللہ عنہ ) تو رسول اللہ صلی اللہ علیہ وسلم سے احادیث بہت زیادہ بیان کرتا ہے ، اور یہ بھی کہتے ہو کہ مہاجرین و انصار ابوہریرہ ( رضی اللہ عنہ ) کی طرح کیوں حدیث نہیں بیان کرتے ؟ اصل وجہ یہ ہے کہ میرے بھائی مہاجرین بازار کی خریدوفروخت میں مشغول رہا کرتے تھے ۔ اور میں اپنا پیٹ بھرنے کے بعد پھر برابر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر رہتا ، اس لیے جب یہ بھائی غیر حاضر ہوتے تو میں اس وقت بھی حاضر رہتا اور میں ( وہ باتیں آپ سے سن کر ) یاد کر لیتا جسے ان حضرات کو ( اپنے کاروبار کی مشغولیت کی وجہ سے یا تو سننے کا موقعہ نہیں ملتا تھا یا ) وہ بھول جایا کرتے تھے ۔ اسی طرح میرے بھائی انصار اپنے اموال ( کھیتوں اور باغوں ) میں مشغول رہتے ، لیکن میں صفہ میں مقیم مسکینوں میں سے ایک مسکین آدمی تھا ۔ جب یہ حضرات انصار بھولتے تو میں اسے یاد رکھتا ۔ ایک مرتبہ رسول کریم صلی اللہ علیہ وسلم نے ایک حدیث بیان کرتے ہوئے فرمایا تھا کہ جو کوئی اپنا کپڑا پھیلائے اور اس وقت تک پھیلائے رکھے جب تک اپنی یہ گفتگو نہ پوری کر لوں ، پھر ( جب میری گفتگو پوری ہو جائے تو ) اس کپڑے کو سمیٹ لے تو وہ میری باتوں کو ( اپنے دل و دماغ میں ہمیشہ ) یاد رکھے گا ، چنانچہ میں نے اپنا کمبل اپنے سامنے پھیلا دیا ، پھر جب رسول اللہ صلی اللہ علیہ وسلم نے اپنا مقالہ مبارک ختم فرمایا ، تو میں نے اسے سمیٹ کر اپنے سینے سے لگا لیا اور اس کے بعد پھر کبھی میں آپ کی کوئی حدیث نہیں بھولا ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، ان سے شعیب نے بیان کیا ، ان سے زہری نے ، کہا کہ مجھے سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن نے خبر دی کہ ابوہریر رضی اللہ عنہ نے کہا ، تم لوگ کہتے ہو کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ إِنَّكُمْ تَقُولُونَ إِنَّ أَبَا هُرَيْرَةَ يُكْثِرُ الْحَدِيثَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَتَقُولُونَ مَا بَالُ الْمُهَاجِرِينَ وَالأَنْصَارِ لاَ يُحَدِّثُونَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ أَبِي هُرَيْرَةَ وَإِنَّ إِخْوَتِي مِنَ الْمُهَاجِرِينَ كَانَ يَشْغَلُهُمْ صَفْقٌ بِالأَسْوَاقِ، وَكُنْتُ أَلْزَمُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى مِلْءِ بَطْنِي، فَأَشْهَدُ إِذَا غَابُوا وَأَحْفَظُ إِذَا نَسُوا، وَكَانَ يَشْغَلُ إِخْوَتِي مِنَ الأَنْصَارِ عَمَلُ أَمْوَالِهِمْ، وَكُنْتُ امْرَأً مِسْكِينًا مِنْ مَسَاكِينِ الصُّفَّةِ أَعِي حِينَ يَنْسَوْنَ، وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَدِيثٍ يُحَدِّثُهُ ‏ \"‏ إِنَّهُ لَنْ يَبْسُطَ أَحَدٌ ثَوْبَهُ حَتَّى أَقْضِيَ مَقَالَتِي هَذِهِ، ثُمَّ يَجْمَعَ إِلَيْهِ ثَوْبَهُ إِلاَّ وَعَى مَا أَقُولُ ‏\"‏‏.‏ فَبَسَطْتُ نَمِرَةً عَلَىَّ، حَتَّى إِذَا قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم مَقَالَتَهُ جَمَعْتُهَا إِلَى صَدْرِي، فَمَا نَسِيتُ مِنْ مَقَالَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم تِلْكَ مِنْ شَىْءٍ‏.‏",
                "headingArabic": "مَا جَاءَ فِي قَوْلِ اللَّهِ تَعَالَى: {فَإِذَا قُضِيَتِ الصَّلاَةُ فَانْتَشِرُوا فِي الأَرْضِ وَابْتَغُوا مِنْ فَضْلِ اللَّهِ وَاذْكُرُوا اللَّهَ كَثِيرًا لَعَلَّكُمْ تُفْلِحُونَ وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا قُلْ مَا عِنْدَ اللَّهِ خَيْرٌ مِنَ اللَّهْوِ وَمِنَ التِّجَارَةِ وَاللَّهُ خَيْرُ الرَّازِقِينَ}",
                "headingUrdu": "اللہ تعالیٰ کے اس فرمان میں کیا آیا ہے: ’’پھر جب نماز ختم ہو جائے تو تم زمین میں پھیل جاؤ اور اللہ کا فضل تلاش کرو۔‘‘",
                "headingEnglish": "What has come in the Statement of Allah Ta'ala: \"Then when the Salat is ended, you may disperse through the land, and seek the Bounty of Allah ...\"",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1966,
                "hadithNumber": "2048",
                "englishNarrator": "Narrated `Abdur Rahman bin `Auf رضی اللہ عنہ :",
                "hadithEnglish": "\"When we came to Medina as emigrants, Allah's Messenger (ﷺ) established a bond of brotherhood between me and Sa`d bin Ar-Rabi`. Sa`d bin Ar-Rabi` رضی اللہ عنہ said (to me), 'I am the richest among the Ansar, so I will give you half of my wealth and you may look at my two wives and whichever of the two you may choose I will divorce her, and when she has completed the prescribed period (before marriage) you may marry her.' `Abdur-Rahman رضی اللہ عنہ replied, \"I am not in need of all that. Is there any marketplace where trade is practiced?' He replied, \"The market of Qainuqa.\" `Abdur- Rahman رضی اللہ عنہ went to that market the following day and brought some dried buttermilk (yogurt) and butter, and then he continued going there regularly. Few days later, `Abdur-Rahman came having traces of yellow (scent) on his body. Allah's Messenger (ﷺ) asked him whether he had got married. He replied in the affirmative. The Prophet (ﷺ) said, 'Whom have you married?' He replied, 'A woman from the Ansar.' Then the Prophet (ﷺ) asked, 'How much did you pay her?' He replied, '(I gave her) a gold piece equal in weigh to a date stone (or a date stone of gold)! The Prophet (ﷺ) said, 'Give a Walima (wedding banquet) even if with one sheep .' \"",
                "hadithUrdu": "جب ہم مدینہ آئے تو رسول اللہ صلی اللہ علیہ وسلم نے میرے اور سعد بن ربیع انصاری کے درمیان بھائی چارہ کرا دیا ۔ سعد بن ربیع رضی اللہ عنہ نے کہا کہ میں انصار کے سب سے زیادہ مالدار لوگوں میں سے ہوں ۔ اس لیے اپنا آدھا مال میں آپ کو دیتا ہوں اور آپ خود دیکھ لیں کہ میری دو بیویوں میں سے آپ کو کون زیادہ پسند ہے ۔ میں آپ کے لیے انہیں اپنے سے الگ کر دوں گا ( یعنی طلاق دے دوں گا ) جب ان کی عدت پوری ہو جائے تو آپ ان سے نکاح کر لیں ۔ بیان کیا کہ اس پر عبدالرحمٰن رضی اللہ عنہ نے فرمایا ، مجھے ان کی ضرورت نہیں ۔ کیا یہاں کوئی بازار ہے جہاں کاروبار ہوتا ہو ؟ سعد رضی اللہ عنہ نے ” سوق قینقاع “ کا نام لیا ۔ بیان کیا کہ جب صبح ہوئی تو عبدالرحمٰن رضی اللہ عنہ پنیر اور گھی لائے ۔ راوی نے بیان کیا کہ پھر وہ تجارت کے لیے بازار آنے جانے لگے ۔ کچھ دنوں کے بعد ایک دن وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو زرد رنگ کا نشان ( کپڑے یا جسم پر ) تھا ۔ رسول اللہ نے دریافت فرمایا کیا تم نے شادی کر لی ہے ؟ انہوں نے کہا کہ ہاں ، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کس سے ؟ بولے کہ ایک انصاری خاتون سے ۔ دریافت فرمایا اور مہر کتنا دیا ہے ؟ عرض کیا کہ ایک گٹھلی برابر سونا دیا ہے یا ( یہ کہا کہ ) سونے کی ایک گٹھلی دی ہے ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اچھا تو ولیمہ کر خواہ ایک بکری ہی کا ہو ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، ان سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والد سعد نے بیان کیا ، ان سے ان کے دادا ( ابرہیم بن عبدالرحمٰن بن عوف رضی اللہ عنہ ) نے بیان کیا کہ عبدالرحمٰن بن عوف رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ ـ رضى الله عنه ـ لَمَّا قَدِمْنَا الْمَدِينَةَ آخَى رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنِي وَبَيْنَ سَعْدِ بْنِ الرَّبِيعِ فَقَالَ سَعْدُ بْنُ الرَّبِيعِ إِنِّي أَكْثَرُ الأَنْصَارِ مَالاً، فَأَقْسِمُ لَكَ نِصْفَ مَالِي، وَانْظُرْ أَىَّ زَوْجَتَىَّ هَوِيتَ نَزَلْتُ لَكَ عَنْهَا، فَإِذَا حَلَّتْ تَزَوَّجْتَهَا‏.‏ قَالَ فَقَالَ عَبْدُ الرَّحْمَنِ لاَ حَاجَةَ لِي فِي ذَلِكَ، هَلْ مِنْ سُوقٍ فِيهِ تِجَارَةٌ قَالَ سُوقُ قَيْنُقَاعَ‏.‏ قَالَ فَغَدَا إِلَيْهِ عَبْدُ الرَّحْمَنِ، فَأَتَى بِأَقِطٍ وَسَمْنٍ ـ قَالَ ـ ثُمَّ تَابَعَ الْغُدُوَّ، فَمَا لَبِثَ أَنْ جَاءَ عَبْدُ الرَّحْمَنِ عَلَيْهِ أَثَرُ صُفْرَةٍ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَزَوَّجْتَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ وَمَنْ ‏\"‏‏.‏ قَالَ امْرَأَةً مِنَ الأَنْصَارِ‏.‏ قَالَ ‏\"‏ كَمْ سُقْتَ ‏\"‏‏.‏ قَالَ زِنَةَ نَوَاةٍ مِنْ ذَهَبٍ أَوْ نَوَاةً مِنْ ذَهَبٍ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1967,
                "hadithNumber": "2049",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When `Abdur-Rahman bin `Auf رضی اللہ عنہ came to Medina, the Prophet (ﷺ) established a bond of brotherhood between him and Sa`d bin Ar-Rabi al-Ansari رضی اللہ عنہ . Sa`d رضی اللہ عنہ was a rich man, so he said to `Abdur-Rahman رضی اللہ عنہ , \"I will give you half of my property and will help you marry.\" `Abdur-Rahman رضی اللہ عنہ said (to him), \"May Allah bless you in your family and property. Show me the market.\" So `Abdur-Rahman رضی اللہ عنہ did not return from the market) till he gained some dried buttermilk (yogurt) and butter (through trading). He brought that to his house-hold. We stayed for sometime (or as long as Allah wished), and then `Abdur-Rahman رضی اللہ عنہ came, scented with yellowish perfume. The Prophet (ﷺ) said (to him) \"What is this?\" He replied, \"I got married to an Ansari woman.\" The Prophet (ﷺ) asked, \"What did you pay her?\" He replied, \"A gold stone or gold equal to the weight of a date stone.\" The Prophet (ﷺ) said (to him), \"Give a wedding banquet even if with one sheep.\"",
                "hadithUrdu": "جب عبدالرحمٰن بن عوف رضی اللہ عنہ مدینہ آئے ، تو رسول اللہ صلی اللہ علیہ وسلم نے ان کا بھائی چارہ سعد بن ربیع انصاری رضی اللہ عنہ سے کرا دیا ۔ سعد رضی اللہ عنہ مالدار آدمی تھے ۔ انہوں نے عبدالرحمٰن رضی اللہ عنہ سے کہا میں اور آپ میرے مال سے آدھا آدھا لے لیں ۔ اور میں ( اپنی ایک بیوی سے ) آپ کی شادی کرا دوں ۔ عبدالرحمٰن رضی اللہ عنہ نے اس کے جواب میں کہا اللہ تعالیٰ آپ کے اہل اور آپ کے مال میں برکت عطا فرمائے ، مجھے تو آپ بازار کا راستہ بتا دیجئیے ، پھر وہ بازار سے اس وقت تک واپس نہ ہوئے جب تک نفع میں کافی پنیر اور گھی نہ بچا لیا ۔ اب وہ اپنے گھر والوں کے پاس آئے کچھ دن گزرے ہوں گے یا اللہ نے جتنا چاہا ۔ اس کے بعد وہ آئے کہ ان پر زردی کا نشان تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا یہ زردی کیسی ہے ؟ عرض کیا ، یا رسول اللہ ! میں نے ایک انصاری عورت سے شادی کر لی ہے ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ انہیں مہر میں کیا دیا ہے ؟ عرض کیا ” سونے کی ایک گٹھلی “ یا ( یہ کہا کہ ) ” ایک گٹھلی برابر سونا “ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا اب ولیمہ کر ، اگرچہ ایک بکری ہی کا ہو ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، ان سے زہیر نے بیان کیا ، ان سے حمید نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَدِمَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ الْمَدِينَةَ فَآخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُ وَبَيْنَ سَعْدِ بْنِ الرَّبِيعِ الأَنْصَارِيِّ، وَكَانَ سَعْدٌ ذَا غِنًى، فَقَالَ لِعَبْدِ الرَّحْمَنِ أُقَاسِمُكَ مَالِي نِصْفَيْنِ، وَأُزَوِّجُكَ‏.‏ قَالَ بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ، دُلُّونِي عَلَى السُّوقِ‏.‏ فَمَا رَجَعَ حَتَّى اسْتَفْضَلَ أَقِطًا وَسَمْنًا، فَأَتَى بِهِ أَهْلَ مَنْزِلِهِ، فَمَكَثْنَا يَسِيرًا ـ أَوْ مَا شَاءَ اللَّهُ ـ فَجَاءَ وَعَلَيْهِ وَضَرٌ مِنْ صُفْرَةٍ، فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَهْيَمْ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ تَزَوَّجْتُ امْرَأَةً مِنَ الأَنْصَارِ‏.‏ قَالَ ‏\"‏ مَا سُقْتَ إِلَيْهَا ‏\"‏‏.‏ قَالَ نَوَاةً مِنْ ذَهَبٍ، أَوْ وَزْنَ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ قَالَ ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1968,
                "hadithNumber": "2050",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "`Ukaz, Majanna and Dhul-Majaz were marketplaces in the Pre-Islamic period of ignorance. When Islam came, Muslims felt that marketing there might be a sin. So, the Divine Inspiration came: \"There is no harm for you to seek the bounty of your Lord (in the seasons of Hajj).\" (2.198) Ibn `Abbas رضی اللہ عنہما recited the Verse in this way.",
                "hadithUrdu": "عکاظ مجنہ ، اور ذوالمجاز عہد جاہلیت کے بازار تھے ۔ جب اسلام آیا تو ایسا ہوا کہ مسلمان لوگ ( خریدوفروخت کے لیے ان بازاروں میں جانا ) گناہ سمجھنے لگے ۔ اس لیے یہ آیت نازل ہوئی ” تمہارے لیے اس میں کوئی حرج نہیں اگر تم اپنے رب کے فضل ( یعنی رزق حلال ) کی تلاش کرو حج کے موسم میں “ یہ ابن عباس رضی اللہ عنہما کی قرآت ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَتْ عُكَاظٌ وَمِجَنَّةُ وَذُو الْمَجَازِ أَسْوَاقًا فِي الْجَاهِلِيَّةِ، فَلَمَّا كَانَ الإِسْلاَمُ فَكَأَنَّهُمْ تَأَثَّمُوا فِيهِ فَنَزَلَتْ ‏{‏لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلاً مِنْ رَبِّكُمْ ‏}‏ فِي مَوَاسِمِ الْحَجِّ، قَرَأَهَا ابْنُ عَبَّاسٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1969,
                "hadithNumber": "2051",
                "englishNarrator": "Narrated An-Nu`man bin Bashir رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said \"Both legal and illegal things are obvious, and in between them are (suspicious) doubtful matters. So whoever forsakes those doubtful things lest he may commit a sin, will definitely avoid what is clearly illegal; and whoever indulges in these (suspicious) doubtful things bravely, is likely to commit what is clearly illegal. Sins are Allah's Hima (i.e. private pasture) and whoever pastures (his sheep) near it, is likely to get in it at any moment.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا حلال بھی کھلا ہوا ہے اور حرام بھی ظاہر ہے لیکن ان دونوں کے درمیان کچھ مشتبہ چیزیں ہیں ۔ پس جو شخص ان چیزوں کو چھوڑے جن کے گناہ ہونے یا نہ ہونے میں شبہ ہے وہ ان چیزوں کو تو ضروری ہی چھوڑ دے گا جن کا گناہ ہونا ظاہر ہے لیکن جو شخص شبہ کی چیزوں کے کرنے کی جرات کرے گا تو قریب ہے کہ وہ ان گناہوں میں مبتلا ہو جائے جو بالکل واضح طور پر گناہ ہیں ( لوگو یاد رکھو ) گناہ اللہ تعالیٰ کی چراگاہ ہے جو ( جانور بھی ) چراگاہ کے اردگرد چرے گا اس کا چراگاہ کے اندر چلا جانا غیر ممکن نہیں ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ ہم سے ابراہیم بن ابی عدی نے بیان کیا ، ان سے عبداللہ بن عون نے ، ان سے شعبی نے ، انہوں نے نعمان بن بشیر رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ( دوسری سند امام بخاری نے کہا ) اور ہم سے علی بن عبداللہ نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابوفروہ نے ، ان سے شعبی نے ، کہا کہ میں نے نعمان بن بشیر رضی اللہ عنہ سے سنا ، اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ( تیسری سند ) اور ہم سے عبداللہ بن محمد نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابوفروہ نے ، انہوں نے شعبی سے سنا ، انہوں نے نعمان بن بشیر رضی اللہ عنہ سے سنا اور انہوں نبی کریم صلی اللہ علیہ وسلم سے ( چوتھی سند ) اور ہم سے محمد بن کثیر نے بیان کیا ، کہا کہ ہم کو سفیان ثوری نے خبر دی ، انہیں ابوفروہ نے ، انہیں شعبی نے اور ان سے سے نعمان بن بشیر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنِ الشَّعْبِيِّ، سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ ـ رضى الله عنه ـ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ أَبِي فَرْوَةَ، عَنِ الشَّعْبِيِّ، قَالَ سَمِعْتُ النُّعْمَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ أَبِي فَرْوَةَ، سَمِعْتُ الشَّعْبِيَّ، سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي فَرْوَةَ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ الْحَلاَلُ بَيِّنٌ، وَالْحَرَامُ بَيِّنٌ وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَةٌ، فَمَنْ تَرَكَ مَا شُبِّهَ عَلَيْهِ مِنَ الإِثْمِ كَانَ لِمَا اسْتَبَانَ أَتْرَكَ، وَمَنِ اجْتَرَأَ عَلَى مَا يَشُكُّ فِيهِ مِنَ الإِثْمِ أَوْشَكَ أَنْ يُوَاقِعَ مَا اسْتَبَانَ، وَالْمَعَاصِي حِمَى اللَّهِ، مَنْ يَرْتَعْ حَوْلَ الْحِمَى يُوشِكْ أَنْ يُوَاقِعَهُ ‏\"‏‏.‏",
                "headingArabic": "الْحَلاَلُ بَيِّنٌ وَالْحَرَامُ بَيِّنٌ وَبَيْنَهُمَا مُشَبَّهَاتٌ",
                "headingUrdu": "قانونی، غیر قانونی اور مشکوک چیزیں",
                "headingEnglish": "Legal, illegal, and doubtful things",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1970,
                "hadithNumber": "2052",
                "englishNarrator": "Narrated `Uqba bin Al-Harith رضی اللہ عنہ :",
                "hadithEnglish": "A black woman came and claimed that she had suckled both of them (i.e. `Uqba and his wife). So, he mentioned that to the Prophet (ﷺ) who turned his face from him and smiled and said, \"How (can you keep your wife), and it was said (that both of you were suckled by the same woman)?\" His wife was the daughter of Abu Ihab-al-Tamimi.",
                "hadithUrdu": "ایک سیاہ فام خاتون آئیں اور دعویٰ کیا کہ انہوں نے ان دونوں ( عقبہ اور ان کی بیوی ) کو دودھ پلایا ہے ۔ عقبہ نے اس امر کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے اپنا چہرہ مبارک پھیر لیا اور مسکرا کر فرمایا ۔ اب جب کہ ایک بات کہہ دی گئی تو تم دونوں ایک ساتھ کس طرح رہ سکتے ہو ۔ ان کے نکاح میں ابواہاب تمیمی کی صاحب زادی تھیں ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، کہا کہ ہم کو سفیان ثوری نے خبر دی ، انہیں عبداللہ بن عبدالرحمٰن بن ابی حسین نے خبر دی ، ان سے عبداللہ بن ابی ملیکہ نے بیان کیا ، ان سے عقبہ بن حارث رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ ـ رضى الله عنه ـ أَنَّ امْرَأَةً، سَوْدَاءَ جَاءَتْ، فَزَعَمَتْ أَنَّهَا أَرْضَعَتْهُمَا، فَذَكَرَ لِلنَّبِيِّ فَأَعْرَضَ عَنْهُ، وَتَبَسَّمَ النَّبِيُّ صلى الله عليه وسلم‏.‏ قَالَ ‏ \"‏ كَيْفَ وَقَدْ قِيلَ ‏\"‏‏.‏ وَقَدْ كَانَتْ تَحْتَهُ ابْنَةُ أَبِي إِهَابٍ التَّمِيمِيِّ‏.‏",
                "headingArabic": "تَفْسِيرِ الْمُشَبَّهَاتِ",
                "headingUrdu": "مشکوک (غیر واضح) چیزوں کی وضاحت",
                "headingEnglish": "Explanation of doubtful (unclear) things",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1971,
                "hadithNumber": "2053",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "`Utba bin Abu Waqqas took a firm promise from his brother Sa`d bin Abu Waqqas to take the son of the slave-girl of Zam`a into his custody as he was his (i.e. `Utba's) son. In the year of the Conquest (of Mecca) Sa`d bin Abu Waqqas رضی اللہ عنہ took him, and said that he was his brother's son, and his brother took a promise from him to that effect. 'Abu bin Zam`a got up and said, \"He is my brother and the son of the slave-girl of my father and was born on my father's bed.\" Then they both went to the Prophet (ﷺ) Sa`d رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! He is the son of my brother and he has taken a promise from me that I will take him.\" 'Abu bin Zam`a said, \"(He is) my brother and the son of my father's slave-girl and was born on my father's bed.\" Allah's Messenger (ﷺ) said, \"The boy is for you. O 'Abu bin Zam`a.\" Then the Prophet (ﷺ) said, \"The son is for the bed (i.e. the man on whose bed he was born) and stones (disappointment and deprivation) for the one who has done illegal sexual intercourse.\" The Prophet (ﷺ) told his wife Sauda bint Zam`a to screen herself from that boy as he noticed a similarity between the boy and `Utba. So, the boy did not see her till he died.",
                "hadithUrdu": "عتبہ بن ابی وقاص ( کافر ) نے اپنے بھائی سعد بن ابی وقاص ( مسلمان ) کو ( مرتے وقت ) وصیت کی تھی کہ زمعہ کی باندی کا لڑکا میرا ہے ۔ اس لیے اسے تم اپنے قبضہ میں لے لینا ۔ انہوں نے کہا کہ فتح مکہ کے سال سعد رضی اللہ عنہ بن ابی وقاص نے اسے لے لیا ، اور کہا کہ یہ میرے بھائی کا لڑکا ہے اور وہ اس کے متعلق مجھے وصیت کر گئے ہیں ، لیکن عبد بن زمعہ نے اٹھ کر کہا کہ میرے باپ کی لونڈی کا بچہ ہے ، میرے باپ کے بستر پر پیدا ہوا ہے ۔ آخر دونوں یہ مقدمہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں لے گئے ۔ سعد رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! یہ میرے بھائی کا لڑکا ہے اور مجھے اس کی انہوں نے وصیت کی تھی ۔ اور عبد بن زمعہ نے عرض کیا ، یہ میرا بھائی ہے اور میرے باپ کی لونڈی کا لڑکا ہے ۔ انہیں کے بستر پر اس کی پیدائش ہوئی ہے ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، عبد بن زمعہ ! لڑکا تو تمہارے ہی ساتھ رہے گا ۔ اس کے بعد فرمایا ، بچہ اسی کا ہوتا ہے جو جائز شوہر یا مالک ہو جس کے بستر پر وہ پیدا ہوا ہو ۔ اور حرام کار کے حصہ میں پتھر وں کی سزا ہے ۔ پھر سودہ بنت زمعہ رضی اللہ عنہا سے جو آنحضرت صلی اللہ علیہ وسلم کی بیوی تھیں ، فرمایا کہ اس لڑکے سے پردہ کیا کر ، کیونکہ آپ صلی اللہ علیہ وسلم نے عتبہ کی شباہت اس لڑکے میں محسوس کر لی تھی ۔ اس کے بعد اس لڑکے نے سودہ رضی اللہ عنہ کو کبھی نہ دیکھا یہاں تک کہ وہ اللہ تعالیٰ سے جا ملا ۔",
                "urduNarrator": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، کہا کہ ہم سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ بن زبیر رضی اللہ عنہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ عُتْبَةُ بْنُ أَبِي وَقَّاصٍ عَهِدَ إِلَى أَخِيهِ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّ ابْنَ وَلِيدَةِ زَمْعَةَ مِنِّي فَاقْبِضْهُ‏.‏ قَالَتْ فَلَمَّا كَانَ عَامَ الْفَتْحِ أَخَذَهُ سَعْدُ بْنُ أَبِي وَقَّاصٍ وَقَالَ ابْنُ أَخِي، قَدْ عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَامَ عَبْدُ بْنُ زَمْعَةَ، فَقَالَ أَخِي، وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَتَسَاوَقَا إِلَى النَّبِيِّ صلى الله عليه وسلم‏.‏ فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ، ابْنُ أَخِي، كَانَ قَدْ عَهِدَ إِلَىَّ فِيهِ‏.‏ فَقَالَ عَبْدُ بْنُ زَمْعَةَ أَخِي وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ ‏\"‏‏.‏ ثُمَّ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْوَلَدُ لِلْفِرَاشِ، وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏ ثُمَّ قَالَ لِسَوْدَةَ بِنْتِ زَمْعَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ احْتَجِبِي مِنْهُ ‏\"‏‏.‏ لِمَا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ، فَمَا رَآهَا حَتَّى لَقِيَ اللَّهَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1972,
                "hadithNumber": "2054",
                "englishNarrator": "Narrated `Adi bin Hatim رضی اللہ عنہ :",
                "hadithEnglish": "I asked Allah's Messenger (ﷺ) about Al Mirad (i.e. a sharp-edged piece of wood or a piece of wood provided with a piece of iron used for hunting). He replied, \"If the game is hit by its sharp edge, eat it, and if it is hit by its broad side, do not eat it, for it has been beaten to death.\" I asked, \"O Allah's Messenger (ﷺ)! I release my dog by the name of Allah and find with it at the game, another dog on which I have not mentioned the name of Allah, and I do not know which one of them caught the game.\" Allah's Messenger (ﷺ) said (to him), 'Don't eat it as you have mentioned the name of Allah on your dog and not on the other dog.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے «معراض» ( تیر کے شکار ) کے متعلق پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر اس کے دھار کی طرف سے لگے تو کھا ۔ اگر چوڑائی سے لگے تو مت کھا ۔ کیونکہ وہ مردار ہے ، میں نے عرض کیا یا رسول اللہ ! میں اپنا کتا ( شکار کے لیے ) چھوڑتا ہوں اور بسم اللہ پڑھ لیتا ہوں ، پھر اس کے ساتھ مجھے ایک ایسا کتا اور ملتا ہے جس پر میں نے بسم اللہ نہیں پڑھی ہے ۔ میں یہ فیصلہ نہیں کر پاتاکہ دونوں میں کون سے کتے نے شکار پکڑا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، ایسے شکار کا گوشت نہ کھا ۔ کیونکہ تو نے بسم اللہ تو اپنے کتے کے لیے پڑھی ہے ۔ دوسرے کے لیے تو نہیں پڑھی ۔",
                "urduNarrator": "ہم سے ابوالولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے عبداللہ بن ابی سفر نے خبر دی ، انہیں شعبی نے ، ان سے عدی بن حاتم رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ ـ رضى الله عنه ـ قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنِ الْمِعْرَاضِ فَقَالَ ‏\"‏ إِذَا أَصَابَ بِحَدِّهِ فَكُلْ، وَإِذَا أَصَابَ بِعَرْضِهِ فَلاَ تَأْكُلْ، فَإِنَّهُ وَقِيذٌ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ أُرْسِلُ كَلْبِي وَأُسَمِّي، فَأَجِدُ مَعَهُ عَلَى الصَّيْدِ كَلْبًا آخَرَ لَمْ أُسَمِّ عَلَيْهِ، وَلاَ أَدْرِي أَيُّهُمَا أَخَذَ‏.‏ قَالَ ‏\"‏ لاَ تَأْكُلْ، إِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى الآخَرِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1973,
                "hadithNumber": "2055",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) passed by a fallen date and said, \"Were it not for my doubt that this might have been given in charity, I would have eaten it.\" And narrated Abu Huraira رضی اللہ عنہ the Prophet (ﷺ) said, \"I found a datefruit fallen on my bed.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک گری ہوئی کھجور پر گزرے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر اس کے صدقہ ہونے کا شبہ نہ ہوتا تو میں اسے کھا لیتا ۔ اور ہمام بن منبہ نے ابوہریرہ رضی اللہ عنہ سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں اپنے بستر پر پڑی ہوئی ایک کھجور پاتا ہوں ۔",
                "urduNarrator": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ، ان سے منصور نے ، ان سے طلحہ بن مصرف نے ، ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ طَلْحَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِتَمْرَةٍ مَسْقُوطَةٍ فَقَالَ ‏\"‏ لَوْلاَ أَنْ تَكُونَ صَدَقَةً لأَكَلْتُهَا ‏\"‏‏.‏ وَقَالَ هَمَّامٌ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَجِدُ تَمْرَةً سَاقِطَةً عَلَى فِرَاشِي ‏\"‏‏.‏",
                "headingArabic": "مَا يُتَنَزَّهُ مِنَ الشُّبُهَاتِ",
                "headingUrdu": "کن مشتبہ (غیر واضح) چیزوں سے بچنا چاہیے؟",
                "headingEnglish": "What doubtful (unclear) things should be avoided?",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1974,
                "hadithNumber": "2056",
                "englishNarrator": "Narrated `Abbas bin Tamim that his uncle said:",
                "hadithEnglish": "\"The Prophet (ﷺ) was asked: If a person feels something during his prayer; should one interrupt his prayer?\" The Prophet (ﷺ) said: No! You should not give it up unless you hear a sound or smell something.\" Narrated Ibn Abi Hafsa: Az-Zuhri said, \"There is no need of repeating ablution unless you detect a smell or hear a sound.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے سامنے ایک ایسے شخص کا ذکر آیا جسے نماز میں کچھ شبہ ہوا نکلنے کا ہو جاتا ہے ۔ آیا اسے نماز توڑ دینی چاہئے ؟ فرمایا کہ نہیں ۔ جب تک وہ آواز نہ سن لے یا بدبو نہ محسوس کر لے ( اس وقت تک نماز نہ توڑے ) ابن ابی حفصہ نے زہری سے بیان کیا ( ایسے شخص پر ) وضو واجب نہیں جب تک حدث کی بدبو نہ محسوس کرے یا آواز نہ سن لے ۔",
                "urduNarrator": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے زہری نے ، ان سے عباد بن تمیم نے اور ان سے ان کے چچا عبداللہ بن زید مازنی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، قَالَ شُكِيَ إِلَى النَّبِيِّ صلى الله عليه وسلم الرَّجُلُ يَجِدُ فِي الصَّلاَةِ شَيْئًا، أَيَقْطَعُ الصَّلاَةَ قَالَ ‏ \"‏ لاَ، حَتَّى يَسْمَعَ صَوْتًا أَوْ يَجِدَ رِيحًا ‏\"‏‏.‏ وَقَالَ ابْنُ أَبِي حَفْصَةَ عَنِ الزُّهْرِيِّ لاَ وُضُوءَ إِلاَّ فِيمَا وَجَدْتَ الرِّيحَ أَوْ سَمِعْتَ الصَّوْتَ‏.‏",
                "headingArabic": "مَنْ لَمْ يَرَ الْوَسَاوِسَ وَنَحْوَهَا مِنَ الْمُشَبَّهَاتِ",
                "headingUrdu": "جو تاریک تجاویز پر غور نہیں کرتا",
                "headingEnglish": "Whoever does not consider dark suggestions",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1975,
                "hadithNumber": "2057",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Some people said, \"O Allah's Messenger (ﷺ)! Meat is brought to us by some people and we are not sure whether the name of Allah has been mentioned on it or not (at the time of slaughtering the animals).\" Allah's Messenger (ﷺ) said (to them), \"Mention the name of Allah and eat it.\"",
                "hadithUrdu": "کچھ لوگوں نے عرض کیا یا رسول اللہ ! بہت سے لوگ ہمارے یہاں گوشت لاتے ہیں ۔ ہمیں یہ معلوم نہیں کہ اللہ کا نام انہوں نے ذبح کے وقت لیا تھا یا نہیں ؟ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم بسم اللہ پڑھ کے اسے کھا لیا کرو ۔",
                "urduNarrator": "ہم سے احمد بن مقدام عجلی نے بیان کیا ، انہوں نے کہا کہ ہم سے محمد بن عبدالرحمٰن طفاوی نے بیان کیا ، انہوں نے کہا کہ ہم سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد ( عروہ بن زبیر ) نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ الْمِقْدَامِ الْعِجْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الطُّفَاوِيُّ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ،، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ قَوْمًا، قَالُوا يَا رَسُولَ اللَّهِ، إِنَّ قَوْمًا يَأْتُونَنَا بِاللَّحْمِ لاَ نَدْرِي أَذَكَرُوا اسْمَ اللَّهِ عَلَيْهِ أَمْ لاَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ سَمُّوا اللَّهَ عَلَيْهِ وَكُلُوهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1976,
                "hadithNumber": "2058",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "While we were offering the prayer with the Prophet (ﷺ) a caravan carrying food came from Sham. The people looked towards the caravan (and went to it) and only twelve persons remained with the Prophet. So, the Divine Inspiration came; \"But when they see some bargain or some amusement, they disperse headlong to it.\" (62.11)",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جمعہ کی نماز پڑھ رہے تھے ۔ ( یعنی خطبہ سن رہے تھے ) کہ ملک شام سے کچھ اونٹ کھانے کا سامان تجارت لے کر آئے ۔ ( سب نمازی ) لوگ ان کی طرف متوجہ ہو گئے اور رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بارہ آدمیوں کے سوا اور کوئی باقی نہ رہا ۔ اس پر یہ آیت نازل ہوئی «وإذا رأوا تجارة أو لهوا انفضوا إليها‏» ” جب وہ مال تجارت یا کوئی تماشا دیکھتے ہیں تو اس کی طرف دوڑ پڑتے ہیں ۔ “",
                "urduNarrator": "ہم سے طلق بن غنام نے بیان کیا ، کہا کہ ہم سے زائدہ بن قدامہ نے بیان کیا ، ان سے حصین نے ، ان سے سالم بن ابی الجعد نے کہ مجھ سے جابر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا طَلْقُ بْنُ غَنَّامٍ، حَدَّثَنَا زَائِدَةُ، عَنْ حُصَيْنٍ، عَنْ سَالِمٍ، قَالَ حَدَّثَنِي جَابِرٌ ـ رضى الله عنه ـ قَالَ بَيْنَمَا نَحْنُ نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم إِذْ أَقْبَلَتْ مِنَ الشَّأْمِ عِيرٌ، تَحْمِلُ طَعَامًا، فَالْتَفَتُوا إِلَيْهَا، حَتَّى مَا بَقِيَ مَعَ النَّبِيِّ صلى الله عليه وسلم إِلاَّ اثْنَا عَشَرَ رَجُلاً فَنَزَلَتْ ‏{‏وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا‏}‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا}",
                "headingUrdu": "اللہ عَزَّوَجَلَّ کا فرمان ہے: ’’اور جب کوئی سامانِ تجارت یا کوئی تماشا دیکھتے ہیں تو اُس کی طرف لپک جاتے ہیں۔‘‘",
                "headingEnglish": "The Statement of Allah azza wajal: \"And when they see some merchandise or some amusement they disperse headlong to it ...\"",
                "chapterId": "35",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 35,
                    "chapterNumber": "35",
                    "chapterEnglish": "Sales and Trade",
                    "chapterUrdu": "خرید و فروخت کے مسائل کا بیان",
                    "chapterArabic": "كتاب البيوع",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1951,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=78",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=76",
                "label": "76",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=77",
                "label": "77",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=78",
                "label": "78",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=79",
                "label": "79",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=80",
                "label": "80",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=81",
                "label": "81",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=82",
                "label": "82",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=80",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=80",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=78",
        "to": 1975,
        "total": 40465
    }
}