{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 26,
        "data": [
            {
                "id": 626,
                "hadithNumber": "642",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Once the Iqama was pronounced and the Prophet (ﷺ) was talking to a man (in a low voice) in a corner of the mosque and he did not lead the prayer till (some of) the people had slept (dozed in a sitting posture) .",
                "hadithUrdu": "نماز کے لیے تکبیر ہو چکی تھی اور نبی کریم صلی اللہ علیہ وسلم کسی شخص سے مسجد کے ایک گوشے میں چپکے چپکے کان میں باتیں کر رہے تھے ۔ پھر آپ صلی اللہ علیہ وسلم نماز کے لیے جب تشریف لائے تو لوگ سو رہے تھے ۔",
                "urduNarrator": "ہم سے ابومعمر عبداللہ بن عمرو نے بیان کیا ، کہا کہ ہم سے عبدالوارث بن سعید نے بیان کیا ، کہا کہ ہم سے عبدالعزیز بن صہیب نے حضرت انس رضی اللہ عنہ سے بیان کیا ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، عَنْ أَنَسٍ، قَالَ أُقِيمَتِ الصَّلاَةُ وَالنَّبِيُّ صلى الله عليه وسلم يُنَاجِي رَجُلاً فِي جَانِبِ الْمَسْجِدِ، فَمَا قَامَ إِلَى الصَّلاَةِ حَتَّى نَامَ الْقَوْمُ‏.‏",
                "headingArabic": "الإِمَامِ تَعْرِضُ لَهُ الْحَاجَةُ بَعْدَ الإِقَامَةِ",
                "headingUrdu": "گر امام کو اقامت کے بعد کوئی مسئلہ درپیش ہو۔",
                "headingEnglish": "If the Imam is confronted with a problem after the Iqama",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 627,
                "hadithNumber": "643",
                "englishNarrator": "Narrated Anas bin Malik:",
                "hadithEnglish": "Once Iqama was pronounced a man came to the Prophet (ﷺ) and detained him (from the prayer).",
                "hadithUrdu": "تکبیر ہو چکی تھی ۔ اتنے میں ایک شخص نبی کریم صلی اللہ علیہ وسلم سے راستہ میں ملا اور آپ صلی اللہ علیہ وسلم کو نماز کے لیے تکبیر کہی جانے کے بعد بھی روکے رکھا ۔",
                "urduNarrator": "ہم سے عیاش بن ولید نے بیان کیا ، کہا کہ ہم سے عبدالاعلیٰ نے بیان کیا ، کہا کہ ہم سے حمید طویل نے بیان کیا ، کہا کہ میں نے ثابت بنانی سے ایک شخص کے متعلق مسئلہ دریافت کیا جو نماز کے لیے تکبیر ہونے کے بعد گفتگو کرتا رہے ۔ اس پر انھوں نے انس بن مالک رضی اللہ عنہ سے بیان کیا کہ انھوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا حُمَيْدٌ، قَالَ سَأَلْتُ ثَابِتًا الْبُنَانِيَّ عَنِ الرَّجُلِ، يَتَكَلَّمُ بَعْدَ مَا تُقَامُ الصَّلاَةُ فَحَدَّثَنِي عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ أُقِيمَتِ الصَّلاَةُ فَعَرَضَ لِلنَّبِيِّ صلى الله عليه وسلم رَجُلٌ فَحَبَسَهُ بَعْدَ مَا أُقِيمَتِ الصَّلاَةُ‏.‏",
                "headingArabic": "الْكَلاَمِ إِذَا أُقِيمَتِ الصَّلاَةُ",
                "headingUrdu": "اقامہ کے بعد بات کرنا",
                "headingEnglish": "To talk after the Iqama",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 628,
                "hadithNumber": "644",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"By Him in Whose Hand my soul is I was about to order for collecting firewood (fuel) and then order Someone to pronounce the Adhan for the prayer and then order someone to lead the prayer then I would go from behind and burn the houses of men who did not present themselves for the (compulsory congregational) prayer. By Him, in Whose Hands my soul is, if anyone of them had known that he would get a bone covered with good meat or two (small) pieces of meat present in between two ribs, he would have turned up for the `Isha' prayer.'",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے میں نے ارادہ کر لیا تھا کہ لکڑیوں کے جمع کرنے کا حکم دوں ۔ پھر نماز کے لیے کہوں ، اس کے لیے اذان دی جائے پھر کسی شخص سے کہوں کہ وہ امامت کرے اور میں ان لوگوں کی طرف جاؤں ( جو نماز باجماعت میں حاضر نہیں ہوتے ) پھر انہیں ان کے گھروں سمیت جلا دوں ۔ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے اگر یہ جماعت میں نہ شریک ہونے والے لوگ اتنی بات جان لیں کہ انہیں مسجد میں ایک اچھے قسم کی گوشت والی ہڈی مل جائے گی یا دو عمدہ کھر ہی مل جائیں گے تو یہ عشاء کی جماعت کے لیے مسجد میں ضرور حاضر ہو جائیں",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک نے ابوالزناد سے خبر دی ، انھوں نے اعرج سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَقَدْ هَمَمْتُ أَنْ آمُرَ بِحَطَبٍ فَيُحْطَبَ، ثُمَّ آمُرَ بِالصَّلاَةِ فَيُؤَذَّنَ لَهَا، ثُمَّ آمُرَ رَجُلاً فَيَؤُمَّ النَّاسَ، ثُمَّ أُخَالِفَ إِلَى رِجَالٍ فَأُحَرِّقَ عَلَيْهِمْ بُيُوتَهُمْ، وَالَّذِي نَفْسِي بِيَدِهِ لَوْ يَعْلَمُ أَحَدُهُمْ أَنَّهُ يَجِدُ عَرْقًا سَمِينًا أَوْ مِرْمَاتَيْنِ حَسَنَتَيْنِ لَشَهِدَ الْعِشَاءَ ‏\"‏‏.‏",
                "headingArabic": "وُجُوبِ صَلاَةِ الْجَمَاعَةِ",
                "headingUrdu": "باجماعت نماز (نماز) فرض ہے۔",
                "headingEnglish": "Congregational Salat (prayer) is obligatory.",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 629,
                "hadithNumber": "645",
                "englishNarrator": "Narrated `Abdullah bin `Umar  رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The prayer in congregation is twenty seven times superior to the prayer offered by person alone.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جماعت کے ساتھ نماز اکیلے نماز پڑھنے سے ستائیس درجہ زیادہ فضیلت رکھتی ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا کہ ہمیں امام مالک نے خبر دی ، انھوں نے نافع سے ، انھوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ صَلاَةُ الْجَمَاعَةِ تَفْضُلُ صَلاَةَ الْفَذِّ بِسَبْعٍ وَعِشْرِينَ دَرَجَةً ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ صَلاَةِ الْجَمَاعَةِ",
                "headingUrdu": "باجماعت نماز کی فضیلت",
                "headingEnglish": "Superiority of the congregational Salat (prayer)",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 630,
                "hadithNumber": "646",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri  رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The prayer in congregation is twenty five times superior to the prayer offered by person alone.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم فرماتے تھے کہ جماعت سے نماز تنہا نماز پڑھنے سے پچیس درجہ زیادہ فضیلت رکھتی ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا کہ مجھ سے لیث نے بیان کیا ، انھوں نے کہا کہ مجھ سے یزید بن ہاد نے بیان کیا ، انھوں نے عبداللہ بن خباب سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے کہ انھوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا اللَّيْثُ، حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ صَلاَةُ الْجَمَاعَةِ تَفْضُلُ صَلاَةَ الْفَذِّ بِخَمْسٍ وَعِشْرِينَ دَرَجَةً ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 631,
                "hadithNumber": "647",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The reward of the prayer offered by a person in congregation is twenty five times greater than that of the prayer offered in one's house or in the market (alone). And this is because if he performs ablution and does it perfectly and then proceeds to the mosque with the sole intention of praying, then for every step he takes towards the mosque, he is upgraded one degree in reward and his one sin is taken off (crossed out) from his accounts (of deeds). When he offers his prayer, the angels keep on asking Allah's Blessings and Allah's forgiveness for him as long as he is (staying) at his Musalla. They say, 'O Allah! Bestow Your blessings upon him, be Merciful and kind to him.' And one is regarded in prayer as long as one is waiting for the prayer.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ آدمی کی جماعت کے ساتھ نماز گھر میں یا بازار میں پڑھنے سے پچیس درجہ زیادہ بہتر ہے ۔ وجہ یہ ہے کہ جب ایک شخص وضو کرتا ہے اور اس کے تمام آداب کو ملحوظ رکھ کر اچھی طرح وضو کرتا ہے پھر مسجد کا راستہ پکڑتا ہے اور سوا نماز کے اور کوئی دوسرا ارادہ اس کا نہیں ہوتا ، تو ہر قدم پر اس کا ایک درجہ بڑھتا ہے اور ایک گناہ معاف کیا جاتا ہے اور جب نماز سے فارغ ہو جاتا ہے تو فرشتے اس وقت تک اس کے لیے برابر دعائیں کرتے رہتے ہیں جب تک وہ اپنے مصلے پر بیٹھا رہے ۔ کہتے ہیں «اللهم صل عليه ،‏‏‏‏ اللهم ارحمه‏» اے اللہ ! اس پر اپنی رحمتیں نازل فرما ۔ اے اللہ ! اس پر رحم کر اور جب تک تم نماز کا انتظار کرتے رہو گویا تم نماز ہی میں مشغول ہو ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انھوں نے کہا کہ ہم سے عبدالواحد نے بیان کیا ، انھوں نے کہا کہ ہم سے اعمش نے بیان کیا ، انھوں نے کہا کہ میں نے ابوصالح سے سنا ، انھوں نے کہا کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ صَلاَةُ الرَّجُلِ فِي الْجَمَاعَةِ تُضَعَّفُ عَلَى صَلاَتِهِ فِي بَيْتِهِ وَفِي سُوقِهِ خَمْسًا وَعِشْرِينَ ضِعْفًا، وَذَلِكَ أَنَّهُ إِذَا تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ، ثُمَّ خَرَجَ إِلَى الْمَسْجِدِ لاَ يُخْرِجُهُ إِلاَّ الصَّلاَةُ، لَمْ يَخْطُ خَطْوَةً إِلاَّ رُفِعَتْ لَهُ بِهَا دَرَجَةٌ، وَحُطَّ عَنْهُ بِهَا خَطِيئَةٌ، فَإِذَا صَلَّى لَمْ تَزَلِ الْمَلاَئِكَةُ تُصَلِّي عَلَيْهِ مَا دَامَ فِي مُصَلاَّهُ اللَّهُمَّ صَلِّ عَلَيْهِ، اللَّهُمَّ ارْحَمْهُ‏.‏ وَلاَ يَزَالُ أَحَدُكُمْ فِي صَلاَةٍ مَا انْتَظَرَ الصَّلاَةَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 632,
                "hadithNumber": "648",
                "englishNarrator": "Narrated Abu Huraira :",
                "hadithEnglish": "\"I heard Allah's Messenger (ﷺ) saying, 'The reward of a prayer in congregation is twenty five times greater than that of a prayer offered by a person alone. The angels of the night and the angels of the day gather at the time of Fajr prayer.' \" \r\nAbu Huraira then added, \"Recite the Holy Book if you wish, for \"Indeed, the recitation of the Qur'an in the early dawn (Fajr prayer) is ever witnessed.\" (17:78).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ جماعت سے نماز اکیلے پڑھنے سے پچیس درجہ زیادہ بہتر ہے ۔ اور رات دن کے فرشتے فجر کی نماز میں جمع ہوتے ہیں ۔ پھر ابوہریرہ رضی اللہ عنہ نے فرمایا کہ اگر تم پڑھنا چاہو تو ( سورۃ بنی اسرائیل ) کی یہ آیت پڑھو «إن قرآن الفجر كان مشهودا‏» یعنی فجر میں قرآن پاک کی تلاوت پر فرشتے حاضر ہوتے ہیں ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، ، انہوں نے کہا کہ ہم سے شعیب نے ، انھوں نے کہا ہم سے زہری نے بیان کیا ، انھوں نے کہا کہ مجھے سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن نے خبر دی کہ حضرت ابوہریرہ رضی اللہ عنہ نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ تَفْضُلُ صَلاَةُ الْجَمِيعِ صَلاَةَ أَحَدِكُمْ وَحْدَهُ بِخَمْسٍ وَعِشْرِينَ جُزْءًا، وَتَجْتَمِعُ مَلاَئِكَةُ اللَّيْلِ وَمَلاَئِكَةُ النَّهَارِ فِي صَلاَةِ الْفَجْرِ ‏\"‏‏.‏ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ فَاقْرَءُوا إِنْ شِئْتُمْ ‏{‏إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا‏}‏",
                "headingArabic": "فَضْلِ صَلاَةِ الْفَجْرِ فِي جَمَاعَةٍ",
                "headingUrdu": "فجر (صبح) کی نماز باجماعت ادا کرنے کی فضیلت۔",
                "headingEnglish": "Superiority of the Fajr (early morning) prayer in congregation.",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 633,
                "hadithNumber": "649",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The reward of the congregational prayer is twenty seven times greater (than that of the prayer offered by a person alone).",
                "hadithUrdu": "جماعت کی نماز اکیلے کی نماز سے ستائیس درجہ زیادہ فضیلت رکھتی ہے ۔",
                "urduNarrator": "شعیب نے فرمایا کہ مجھ سے نافع نے ابن عمر رضی اللہ عنہما کے واسطہ سے اس طرح حدیث بیان کی کہ",
                "hadithArabic": "قَالَ شُعَيْبٌ وَحَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ تَفْضُلُهَا بِسَبْعٍ وَعِشْرِينَ دَرَجَةً‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 634,
                "hadithNumber": "650",
                "englishNarrator": "Narrated Um Ad-Darda:",
                "hadithEnglish": "\"Abu Ad-Darda' entered the house in an angry mood. I said to him. 'What makes you angry?' He replied, 'By Allah! I do not find the followers of Muhammad doing those good things (which they used to do before) except the offering of congregational prayer.\" (This happened in the last days of Abu Ad-Darda' during the rule of `Uthman) .",
                "hadithUrdu": "( ایک مرتبہ ) ابودرداء آئے ، بڑے ہی خفا ہو رہے تھے ۔ میں نے پوچھا کہ کیا بات ہوئی ، جس نے آپ کو غضبناک بنا دیا ۔ فرمایا : خدا کی قسم ! حضرت محمد صلی اللہ علیہ وسلم کی شریعت کی کوئی بات اب میں نہیں پاتا ۔ سوا اس کے کہ جماعت کے ساتھ یہ لوگ نماز پڑھ لیتے ہیں ۔",
                "urduNarrator": "ہم سے عمر بن حفص نے بیان کیا ، کہا کہ مجھ سے میرے باپ نے بیان کیا ، کہا کہ ہم سے اعمش نے بیان کیا ، کہا کہ میں نے سالم سے سنا ۔ کہا کہ میں نے ام الدرداء سے سنا ، آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ سَالِمًا، قَالَ سَمِعْتُ أُمَّ الدَّرْدَاءِ، تَقُولُ دَخَلَ عَلَىَّ أَبُو الدَّرْدَاءِ وَهْوَ مُغْضَبٌ فَقُلْتُ مَا أَغْضَبَكَ فَقَالَ وَاللَّهِ مَا أَعْرِفُ مِنْ أُمَّةِ مُحَمَّدٍ صلى الله عليه وسلم شَيْئًا إِلاَّ أَنَّهُمْ يُصَلُّونَ جَمِيعًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 635,
                "hadithNumber": "651",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ reports that the prophet (ﷺ) said:",
                "hadithEnglish": "\"The people who get tremendous reward for the prayer are those who are farthest away (from the mosque) and then those who are next farthest and so on. Similarly one who waits to pray with the Imam has greater reward than one who prays and goes to bed. \"",
                "hadithUrdu": "نماز میں ثواب کے لحاظ سے سب سے بڑھ کر وہ شخص ہوتا ہے ، جو ( مسجد میں نماز کے لیے ) زیادہ سے زیادہ دور سے آئے اور جو شخص نماز کے انتظار میں بیٹھا رہتا ہے اور پھر امام کے ساتھ پڑھتا ہے اس شخص سے اجر میں بڑھ کر ہے جو ( پہلے ہی ) پڑھ کر سو جائے ۔",
                "urduNarrator": "ہم سے محمد بن علاء نے بیان کیا ، کہا کہ ہم سے ابواسامہ نے برید بن عبداللہ سے بیان کیا ، انھوں نے ابوبردہ سے ، انھوں نے ابوموسیٰ رضی اللہ عنہ سے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَعْظَمُ النَّاسِ أَجْرًا فِي الصَّلاَةِ أَبْعَدُهُمْ فَأَبْعَدُهُمْ مَمْشًى، وَالَّذِي يَنْتَظِرُ الصَّلاَةَ حَتَّى يُصَلِّيَهَا مَعَ الإِمَامِ أَعْظَمُ أَجْرًا مِنَ الَّذِي يُصَلِّي ثُمَّ يَنَامُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 636,
                "hadithNumber": "652, 653, 654",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"While a man was going on a way, he saw a thorny branch and removed it from the way and Allah became pleased by his action and forgave him for that.\" Then the Prophet (ﷺ) said, \"Five are martyrs: One who dies of plague, one who dies of an Abdominal disease, one who dies of drowning, one who is buried alive (and) dies and one who is killed in Allah's cause.\" (The Prophet (ﷺ) further said, \"If the people knew the reward for pronouncing the Adhan and for standing in the first row (in the congregational prayer) and found no other way to get it except by drawing lots they would do so, and if they knew the reward of offering the Zuhr prayer early (in its stated time), they would race for it and if they knew the reward for `Isha' and Fajr prayers in congregation, they would attend them even if they were to crawl.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ایک شخص کہیں جا رہا تھا ۔ راستے میں اس نے کانٹوں کی بھری ہوئی ایک ٹہنی دیکھی ، پس اسے راستے سے دور کر دیا ۔ اللہ تعالیٰ ( صرف اسی بات پر ) راضی ہو گیا اور اس کی بخشش کر دی۔پھر آپ نے فرمایا کہ شہداء پانچ قسم کے ہوتے ہیں ۔ طاعون میں مرنے والے ، پیٹ کے عارضے ( ہیضے وغیرہ ) میں مرنے والے اور ڈوب کر مرنے والے اور جو دیوار وغیرہ کسی بھی چیز سے دب کر مر جائے اور خدا کے راستے میں ( جہاد کرتے ہوئے ) شہید ہونے والے اور آپ نے فرمایا کہ اگر لوگوں کو معلوم ہو جائے کہ اذان دینے اور پہلی صف میں شریک ہونے کا ثواب کتنا ہے اور پھر اس کے سوا کوئی چارہ کار نہ ہو کہ قرعہ ڈالا جائے تو لوگ ان کے لیے قرعہ ہی ڈالا کریں ۔ اور اگر لوگوں کو یہ معلوم ہو جائے کہ ظہر کی نماز کے لیے سویرے جانے میں کیا ثواب ہے تو اس کے لیے ایک دوسرے پر سبقت لے جانے کی کوشش کریں اور اگر یہ جان جائیں کہ عشاء اور صبح کی نماز کے فضائل کتنے ہیں ، تو گھٹنوں کے بل گھسٹتے ہوئے ان کے لیے آئیں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے امام مالک سے بیان کیا ، انھوں نے ابوبکر بن عبدالرحمٰن کے غلام سمی نامی سے ، انھوں نے ابوصالح سمان سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ وَجَدَ غُصْنَ شَوْكٍ عَلَى الطَّرِيقِ فَأَخَّرَهُ، فَشَكَرَ اللَّهُ لَهُ، فَغَفَرَ لَهُ ‏\"‏‏.ثُمَّ قَالَ ‏\"‏ الشُّهَدَاءُ خَمْسَةٌ الْمَطْعُونُ، وَالْمَبْطُونُ، وَالْغَرِيقُ، وَصَاحِبُ الْهَدْمِ، وَالشَّهِيدُ فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏ وَقَالَ ‏\"‏ لَوْ يَعْلَمُ النَّاسُ مَا فِي النِّدَاءِ وَالصَّفِّ الأَوَّلِ ثُمَّ لَمْ يَجِدُوا إِلاَّ أَنْ يَسْتَهِمُوا لاَسْتَهَمُوا عَلَيْهِ ‏\"‏‏.‏ ‏\"‏ وَلَوْ يَعْلَمُونَ مَا فِي التَّهْجِيرِ لاَسْتَبَقُوا إِلَيْهِ، وَلَوْ يَعْلَمُونَ مَا فِي الْعَتَمَةِ وَالصُّبْحِ لأَتَوْهُمَا وَلَوْ حَبْوًا ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ التَّهْجِيرِ إِلَى الظُّهْرِ",
                "headingUrdu": "ظہر کی نماز جلدی پڑھنے کی فضیلت",
                "headingEnglish": "The superiority of offering the Zuhr prayer early",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 637,
                "hadithNumber": "655, 656",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "\"The Prophet (ﷺ) said, 'O Bani Salima! Don't you think that for every step of yours (that you take towards the mosque) there is a reward (while coming for prayer)?\" Mujahid said: \"Regarding Allah's Statement: \"We record that which they have sent before (them), and their traces\" (36.12). 'Their traces' means 'their steps.' \" And Anas رضی اللہ عنہ said that the people of Bani Salima wanted to shift to a place near the Prophet (ﷺ) but Allah's Messenger (ﷺ) disliked  that Al-Madina (city) should become naked [i.e., with empty outskirts - without inhabitants. i.e., the leaving of their houses (empty)] and said, \"(0 Ban! Salima!) Don't you think that you will get the reward for your traces (every step) of yours (that you take towards the Prophet's mosque) there is a reward while coming for the five compulsory Salat.\" Mujahid said, \"Their traces mean their foot-steps and their going on foot.\" \r\nthe idea of leaving their houses uninhabited and said, \"Don't you think that you will get the reward for your footprints.\" Mujahid said, \"Their foot prints mean their foot steps and their going on foot.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اے بنوسلمہ والو ! کیا تم اپنے قدموں کا ثواب نہیں چاہتے ؟ اورمجاہد نے اللہ تعا لٰی کےفرمان ‏{‏وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ‏}‏ میں آثَارَهُمْ سےنشانات قدم مراد لیے ہیں اور ابن ابی مریم نے بیان میں یہ زیادہ کہا ہے کہ مجھے یحییٰ بن ایوب نے خبر دی ، کہا کہ مجھ سے حمید طویل نے بیان کیا ، کہا کہ مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ بنوسلمہ والوں نے یہ ارادہ کیا کہ اپنے مکان ( جو مسجد سے دور تھے ) چھوڑ دیں اور آنحضرت صلی اللہ علیہ وسلم کے قریب آ رہیں ۔ ( تاکہ باجماعت کے لیے مسجدنبوی کا ثواب حاصل ہو ) لیکن آنحضرت صلی اللہ علیہ وسلم کو مدینہ کا اجاڑ دینا برا معلوم ہوا ۔ آپ نے فرمایا کہ تم لوگ اپنے قدموں کا ثواب نہیں چاہتے ؟ مجاہد نے کہا ( سورۃ یٰسین میں ) «وآثارهم» سے قدم مراد ہیں ۔ یعنی زمین پر چلنے سے پاؤں کے نشانات ۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن حوشب نے بیان کیا ، انھوں نے کہا کہ ہم سے عبدالوہاب ثقفی نے بیان کیا ، انھوں نے کہا کہ مجھ سے حمید طویل نے انس بن مالک رضی اللہ عنہ سے بیان کیا ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَوْشَبٍ ، قَالَ : حَدَّثَنَا عَبْدُ الْوَهَّابِ ، قَالَ : حَدَّثَنَا حُمَيْدٌ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، قَالَ : قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : يَا بَنِي سَلِمَةَ ، أَلَا تَحْتَسِبُونَ آثَارَكُمْ؟.وَقَالَ مُجَاهِدٌ فِي قَوْلِهِ ‏{‏وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ‏}‏ قَالَ خُطَاهُمْ‏.‏ وَقَالَ ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنِي حُمَيْدٌ، حَدَّثَنِي أَنَسٌ، أَنَّ بَنِي سَلِمَةَ، أَرَادُوا أَنْ يَتَحَوَّلُوا، عَنْ مَنَازِلِهِمْ، فَيَنْزِلُوا قَرِيبًا مِنَ النَّبِيِّ صلى الله عليه وسلم قَالَ فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُعْرُوا ‏{‏الْمَدِينَةَ‏}‏ فَقَالَ ‏\"‏ أَلاَ تَحْتَسِبُونَ آثَارَكُمْ ‏\"‏‏.‏ قَالَ مُجَاهِدٌ خُطَاهُمْ آثَارُهُمْ أَنْ يُمْشَى فِي الأَرْضِ بِأَرْجُلِهِمْ‏.‏",
                "headingArabic": "احْتِسَابِ الآثَارِ",
                "headingUrdu": "نیکی کی طرف ہر قدم کا صلہ ملتا ہے۔",
                "headingEnglish": "Every step towards good deeds is rewarded",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 638,
                "hadithNumber": "657",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"No prayer is heavier upon the hypocrites than the Fajr and the `Isha' prayers and if they knew what is in them (in reward), they would have attended them, even if (it was) crawling. Certainly, I felt the urge to order the Mu'adh-dhin (call-maker) so that he would pronounce Iqama, then order a man to lead the people (in prayer), then take a flame of fire so that I burn (the houses) upon those who had not left for the prayer yet.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ منافقوں پر فجر اور عشاء کی نماز سے زیادہ اور کوئی نماز بھاری نہیں اور اگر انہیں معلوم ہوتا کہ ان کا ثواب کتنا زیادہ ہے ( اور چل نہ سکتے ) تو گھٹنوں کے بل گھسیٹ کر آتے اور میرا تو ارادہ ہو گیا تھا کہ مؤذن سے کہوں کہ وہ تکبیر کہے ، پھر میں کسی کو نماز پڑھانے کے لیے کہوں اور خود آگ کی چنگاریاں لے کر ان سب کے گھروں کو جلا دوں جو ابھی تک نماز کے لیے نہیں نکلے ۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا کہ ہم سے میرے باپ نے بیان کیا ، انھوں نے کہا کہ ہم سے اعمش نے بیان کیا ، انھوں نے کہا کہ مجھ سے ابوصالح ذکوان نے بیان کیا ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کیا ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي أَبُو صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَيْسَ صَلاَةٌ أَثْقَلَ عَلَى الْمُنَافِقِينَ مِنَ الْفَجْرِ وَالْعِشَاءِ، وَلَوْ يَعْلَمُونَ مَا فِيهِمَا لأَتَوْهُمَا وَلَوْ حَبْوًا، لَقَدْ هَمَمْتُ أَنْ آمُرَ الْمُؤَذِّنَ فَيُقِيمَ، ثُمَّ آمُرَ رَجُلاً يَؤُمُّ النَّاسَ، ثُمَّ آخُذَ شُعَلاً مِنْ نَارٍ فَأُحَرِّقَ عَلَى مَنْ لاَ يَخْرُجُ إِلَى الصَّلاَةِ بَعْدُ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ الْعِشَاءِ فِي الْجَمَاعَةِ",
                "headingUrdu": "عشاء کی نماز باجماعت ادا کرنے کی فضیلت",
                "headingEnglish": "The superiority of the 'Isha' prayer in congregation",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 639,
                "hadithNumber": "658",
                "englishNarrator": "Narrated Malik bin Huwairith:",
                "hadithEnglish": "The Prophet (ﷺ) said (to two persons), \"Whenever the prayer time becomes due, you should pronounce Adhan and then Iqama and the older of you should lead the prayer.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا جب نماز کا وقت آ جائے تو تم دونوں اذان دو اور اقامت کہو ، پھر جو تم میں بڑا ہے وہ امام بنے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یزید بن زریع نے بیان کیا ، کہا کہ ہم سے خالد حذاء نے ابوقلابہ عبداللہ بن زید سے ، انھوں نے مالک بن حویرث سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ، عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا حَضَرَتِ الصَّلاَةُ فَأَذِّنَا وَأَقِيمَا، ثُمَّ لِيَؤُمَّكُمَا أَكْبَرُكُمَا ‏\"‏‏.‏",
                "headingArabic": "اثْنَانِ فَمَا فَوْقَهُمَا جَمَاعَةٌ",
                "headingUrdu": "دو یا دو سے زیادہ افراد کو ایک جماعت سمجھا جاتا ہے (نماز باجماعت کے لیے)",
                "headingEnglish": "Two or more than two persons are considered as a group (for the congregational prayers)",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 640,
                "hadithNumber": "659",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The angels keep on asking for Allah's Blessing and Forgiveness for anyone of you as long as he is at his Musalla (praying place) and does not do Hadath (passes wind). The angels say, 'O Allah! Forgive him and be Merciful to him.' Each one of you is in the prayer as long as he is waiting for the prayer and nothing but the prayer detains him from going to his family.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ملائکہ تم میں سے اس نمازی کے لیے اس وقت تک یوں دعا کرتے رہتے ہیں ۔ جب تک ( نماز پڑھنے کے بعد ) وہ اپنے مصلے پر بیٹھا رہے «اللهم اغفر له ،‏‏‏‏ ‏‏‏‏ اللهم ارحمه‏» کہ اے اللہ ! اس کی مغفرت کر ۔ اے اللہ ! اس پر رحم کر ۔ تم میں سے وہ شخص جو صرف نماز کی وجہ سے رکا ہوا ہے ۔ گھر جانے سے سوا نماز کے اور کوئی چیز اس کے لیے مانع نہیں ، تو اس کا ( یہ سارا وقت ) نماز ہی میں شمار ہو گا ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا امام مالک سے ، انھوں نے ابوالزناد سے ، انھوں نے اعرج سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمَلاَئِكَةُ تُصَلِّي عَلَى أَحَدِكُمْ مَا دَامَ فِي مُصَلاَّهُ مَا لَمْ يُحْدِثْ اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ارْحَمْهُ‏.‏ لاَ يَزَالُ أَحَدُكُمْ فِي صَلاَةٍ مَا دَامَتِ الصَّلاَةُ تَحْبِسُهُ، لاَ يَمْنَعُهُ أَنْ يَنْقَلِبَ إِلَى أَهْلِهِ إِلاَّ الصَّلاَةُ ‏\"‏‏.‏",
                "headingArabic": "مَنْ جَلَسَ فِي الْمَسْجِدِ يَنْتَظِرُ الصَّلاَةَ، وَفَضْلِ الْمَسَاجِدِ",
                "headingUrdu": "(ایک کل کا ثواب) جو اس نماز کے لیے سفید کرتا ہے۔",
                "headingEnglish": "(The reward of a person) who waits for As-Salat (the prayer) in the mosque and the superiority of mosques",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 641,
                "hadithNumber": "660",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah will give shade, to seven, on the Day when there will be no shade but His. (These seven persons are) a just ruler, a youth who has been brought up in the worship of Allah (i.e. worships Allah sincerely from childhood), a man whose heart is attached to the mosques (i.e. to pray the compulsory prayers in the mosque in congregation), two persons who love each other only for Allah's sake and they meet and part in Allah's cause only, a man who refuses the call of a charming woman of noble birth for illicit intercourse with her and says: I am afraid of Allah, a man who gives charitable gifts so secretly that his left hand does not know what his right hand has given (i.e. nobody knows how much he has given in charity), and a person who remembers Allah in seclusion and his eyes are then flooded with tears.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ سات طرح کے آدمی ہوں گے ۔ جن کو اللہ اس دن اپنے سایہ میں جگہ دے گا ۔ جس دن اس کے سایہ کے سوا اور کوئی سایہ نہ ہو گا ۔ اول انصاف کرنے والا بادشاہ ، دوسرے وہ نوجوان جو اپنے رب کی عبادت میں جوانی کی امنگ سے مصروف رہا ، تیسرا ایسا شخص جس کا دل ہر وقت مسجد میں لگا رہتا ہے ، چوتھے دو ایسے شخص جو اللہ کے لیے باہم محبت رکھتے ہیں اور ان کے ملنے اور جدا ہونے کی بنیاد یہی «للهى» ( اللہ کے لیے محبت ) محبت ہے ، پانچواں وہ شخص جسے کسی باعزت اور حسین عورت نے ( برے ارادہ سے ) بلایا لیکن اس نے کہہ دیا کہ میں اللہ سے ڈرتا ہوں ، چھٹا وہ شخص جس نے صدقہ کیا ، مگر اتنے پوشیدہ طور پر کہ بائیں ہاتھ کو بھی خبر نہیں ہوئی کہ داہنے ہاتھ نے کیا خرچ کیا ۔ ساتواں وہ شخص جس نے تنہائی میں اللہ کو یاد کیا اور ( بے ساختہ ) آنکھوں سے آنسو جاری ہو گئے ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے عبیداللہ بن عمر عمری سے بیان کیا ، کہا کہ مجھ سے خبیب بن عبدالرحمٰن نے بیان کیا حفص بن عاصم سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ سَبْعَةٌ يُظِلُّهُمُ اللَّهُ فِي ظِلِّهِ يَوْمَ لاَ ظِلَّ إِلاَّ ظِلُّهُ الإِمَامُ الْعَادِلُ، وَشَابٌّ نَشَأَ فِي عِبَادَةِ رَبِّهِ، وَرَجُلٌ قَلْبُهُ مُعَلَّقٌ فِي الْمَسَاجِدِ، وَرَجُلاَنِ تَحَابَّا فِي اللَّهِ اجْتَمَعَا عَلَيْهِ وَتَفَرَّقَا عَلَيْهِ، وَرَجُلٌ طَلَبَتْهُ امْرَأَةٌ ذَاتُ مَنْصِبٍ وَجَمَالٍ فَقَالَ إِنِّي أَخَافُ اللَّهَ‏.‏ وَرَجُلٌ تَصَدَّقَ أَخْفَى حَتَّى لاَ تَعْلَمَ شِمَالُهُ مَا تُنْفِقُ يَمِينُهُ، وَرَجُلٌ ذَكَرَ اللَّهَ خَالِيًا فَفَاضَتْ عَيْنَاهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 642,
                "hadithNumber": "661",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "\"Did Allah's Messenger (ﷺ) wear a ring?\" He said, \"Yes. Once he delayed the `Isha' prayer till midnight and after the prayer, he faced us and said, 'The people prayed and have slept and you remained in prayer as long as you waited for it.' \" Anas رضی اللہ عنہ added, \"As if I were just now observing the glitter of his ring.\"",
                "hadithUrdu": "کیا رسول اللہ صلی اللہ علیہ وسلم نے کوئی انگوٹھی پہنی ہے ؟ آپ نے فرمایا کہ ہاں ! ایک رات عشاء کی نماز میں آپ صلی اللہ علیہ وسلم نے آدھی رات تک دیر کی ۔ نماز کے بعد ہماری طرف متوجہ ہوئے اور فرمایا ، لوگ نماز پڑھ کر سو چکے ہوں گے ۔ اور تم لوگ اس وقت تک نماز ہی کی حالت میں تھے جب تک تم نماز کا انتظار کرتے رہے ۔ حضرت انس رضی اللہ عنہ نے فرمایا جیسے اس وقت میں آپ صلی اللہ علیہ وسلم کی انگوٹھی کی چمک دیکھ رہا ہوں ( یعنی آپ صلی اللہ علیہ وسلم کی انگوٹھی کی چمک کا سماں میری آنکھوں میں ہے ) ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے اسماعیل بن جعفر نے بیان کیا حمید طویل سے ، انھوں نے کہا کہ انس بن مالک رضی اللہ عنہ سے دریافت کیا گیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، قَالَ سُئِلَ أَنَسٌ هَلِ اتَّخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَاتَمًا فَقَالَ نَعَمْ، أَخَّرَ لَيْلَةً صَلاَةَ الْعِشَاءِ إِلَى شَطْرِ اللَّيْلِ، ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ بَعْدَ مَا صَلَّى فَقَالَ ‏ \"‏ صَلَّى النَّاسُ وَرَقَدُوا وَلَمْ تَزَالُوا فِي صَلاَةٍ مُنْذُ انْتَظَرْتُمُوهَا ‏\"‏‏.‏ قَالَ فَكَأَنِّي أَنْظُرُ إِلَى وَبِيصِ خَاتَمِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 643,
                "hadithNumber": "662",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah will prepare for him who goes to the mosque (every) morning and in the afternoon (for the congregational prayer) an honorable place in Paradise with good hospitality for (what he has done) every morning and afternoon goings.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص مسجد میں صبح شام بار بار حاضری دیتا ہے ۔ اللہ تعالیٰ جنت میں اس کی مہمانی کا سامان کرے گا ۔ وہ صبح شام جب بھی مسجد میں جائے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا کہ ہم سے یزید بن ہارون واسطی نے بیان کیا ، کہا کہ ہمیں محمد بن مطرف نے زید بن اسلم سے خبر دی ، انھوں نے عطاء بن یسار سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انھوں نے حضرت نبی کریم صلی اللہ علیہ وسلم سے",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ مُطَرِّفٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ غَدَا إِلَى الْمَسْجِدِ وَرَاحَ أَعَدَّ اللَّهُ لَهُ نُزُلَهُ مِنَ الْجَنَّةِ كُلَّمَا غَدَا أَوْ رَاحَ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ مَنْ غَدَا إِلَى الْمَسْجِدِ وَمَنْ رَاحَ",
                "headingUrdu": "مسجد جانے کی فضیلت (ہر صبح) دوپہر اور شام کو",
                "headingEnglish": ": The superiority of going to the mosque (every) morning and in the afternoon and evening [for the congregational Salat (prayers)]",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 644,
                "hadithNumber": "663",
                "englishNarrator": "Narrated Malik Ibn Buhaina:",
                "hadithEnglish": "Allah's Messenger (ﷺ) passed by a man praying two rak`at after the Iqama (had been pronounced). When Allah's Messenger (ﷺ) completed the prayer, the people gathered around him (the Prophet) or that man and Allah's Messenger (ﷺ) said to him (protesting), Are there four rak`at in Fajr prayer? Are there four rak`at in Fajr prayer?\"\r\nGhundar and Muadh corroborated him from shoban in Malik's Hadith; and reported it Ibn-e-Ishaq,  Sa'd from Hadrat Abdullah bin Buhainah; and reported it Hammad, Sa'd, Hafs from Maalik.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کا گزر ایک شخص پر ہوا ( دوسری سند ) امام بخاری نے کہا کہ مجھ سے عبدالرحمٰن بن بشر نے بیان کیا ، کہا کہ ہم سے بہز بن اسد نے بیان کیا ۔ کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے سعد بن ابراہیم نے خبر دی ، کہا کہ میں نے حفص بن عاصم سے سنا ، کہا کہ میں نے قبیلہ ازد کے ایک صاحب سے جن کا نام مالک بن بحینہ رضی اللہ عنہ تھا ، سنا کہ رسول اللہ صلی اللہ علیہ وسلم کی نظر ایک ایسے نمازی پر پڑی جو تکبیر کے بعد دو رکعت نماز پڑھ رہا تھا ۔ آنحضور صلی اللہ علیہ وسلم جب نماز سے فارغ ہو گئے تو لوگ اس شخص کے اردگرد جمع ہو گئے اور آنحضور صلی اللہ علیہ وسلم نے فرمایا کیا صبح کی چار رکعتیں پڑھتا ہے ؟ کیا صبح کی چار رکعتیں ہو گئیں ؟ \r\nاس حدیث کی متابعت غندر اور معاذ نے شعبہ سے کی ہے جو مالک سے روایت کرتے ہیں ۔ ابن اسحاق نے سعد سے ، انھوں نے حفص سے ، وہ عبداللہ بن بحینہ سے اور حماد نے کہا کہ ہمیں سعد نے حفص کے واسطہ سے خبر دی اور وہ مالک کے واسطہ سے ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ ہم سے ابراہیم بن سعد نے اپنے باپ سعد بن ابراہیم سے بیان کیا ، انھوں نے حفص بن عاصم سے ، انھوں نے عبداللہ بن مالک بن بحینہ سے ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ ابْنِ بُحَيْنَةَ، قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِرَجُلٍ‏.‏ قَالَ وَحَدَّثَنِي عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي سَعْدُ بْنُ إِبْرَاهِيمَ، قَالَ سَمِعْتُ حَفْصَ بْنَ عَاصِمٍ، قَالَ سَمِعْتُ رَجُلاً، مِنَ الأَزْدِ يُقَالُ لَهُ مَالِكٌ ابْنُ بُحَيْنَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى رَجُلاً وَقَدْ أُقِيمَتِ الصَّلاَةُ يُصَلِّي رَكْعَتَيْنِ، فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاَثَ بِهِ النَّاسُ، وَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الصُّبْحَ أَرْبَعًا، الصُّبْحَ أَرْبَعًا ‏\"‏‏.‏ تَابَعَهُ غُنْدَرٌ وَمُعَاذٌ عَنْ شُعْبَةَ فِي مَالِكٍ‏.‏ وَقَالَ ابْنُ إِسْحَاقَ عَنْ سَعْدٍ عَنْ حَفْصٍ عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ‏.‏ وَقَالَ حَمَّادٌ أَخْبَرَنَا سَعْدٌ عَنْ حَفْصٍ عَنْ مَالِكٍ‏.‏",
                "headingArabic": "إِذَا أُقِيمَتِ الصَّلاَةُ فَلاَ صَلاَةَ إِلاَّ الْمَكْتُوبَةَ",
                "headingUrdu": "اس لازمی نماز کے لیے اقامت کہے جانے کے بعد فرض نماز کے علاوہ کوئی نماز (پڑھنی نہیں ہے)",
                "headingEnglish": "No Salat (prayer) (is to be offered) except the compulsory Salat after the Iqama has been pronounced for that compulsory Salat",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 645,
                "hadithNumber": "664",
                "englishNarrator": "Narrated Al-Aswad:",
                "hadithEnglish": "\"We were with `Aisha discussing the regularity of offering the prayer and dignifying it. She said, 'When Allah's Messenger (ﷺ) fell sick with the fatal illness and when the time of prayer became due and Adhan was pronounced, he said, 'Tell Abu Bakr to lead the people in prayer.' He was told that Abu Bakr was a softhearted man and would not be able to lead the prayer in his place. The Prophet (ﷺ) gave the same order again but he was given the same reply. He gave the order for the third time and said, 'You (women) are the companions of Joseph. Tell Abu Bakr to lead the prayer.' So Abu Bakr came out to lead the prayer. In the meantime the condition of the Prophet (ﷺ) improved a bit and he came out with the help of two men one on each side. As if I was observing his legs dragging on the ground owing to the disease. Abu Bakr wanted to retreat but the Prophet (ﷺ) beckoned him to remain at his place and the Prophet (ﷺ) was brought till he sat beside Abu Bakr.\" Al-A`mash was asked, \"Was the Prophet (ﷺ) praying and Abu Bakr following him, and were the people following Abu Bakr in that prayer?\" Al- A`mash replied in the affirmative with a nod of his head. Abu Muawiya said, \"The Prophet (ﷺ) was sitting on the left side of Abu Bakr who was praying while standing.\"",
                "hadithUrdu": "ہم حضرت عائشہ رضی اللہ عنہا کی خدمت میں حاضر تھے ۔ ہم نے نماز میں ہمیشگی اور اس کی تعظیم کا ذکر کیا ۔ حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم کے مرض الموت میں جب نماز کا وقت آیا اور اذان دی گئی تو فرمایا کہ ابوبکر سے کہو کہ لوگوں کو نماز پڑھائیں ۔ اس وقت آپ صلی اللہ علیہ وسلم سے کہا گیا کہ ابوبکر بڑے نرم دل ہیں ۔ اگر وہ آپ صلی اللہ علیہ وسلم کی جگہ کھڑے ہوں گے تو نماز پڑھانا ان کے لیے مشکل ہو جائے گی ۔ آپ صلی اللہ علیہ وسلم نے پھر وہی حکم فرمایا ، اور آپ صلی اللہ علیہ وسلم کے سامنے پھر وہی بات دہرا دی گئی ۔ تیسری مرتبہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم تو بالکل یوسف کی ساتھ والی عورتوں کی طرح ہو ۔ ( کہ دل میں کچھ ہے اور ظاہر کچھ اور کر رہی ہو ) ابوبکر سے کہو کہ وہ نماز پڑھائیں ۔ آخر ابوبکر رضی اللہ عنہ نماز پڑھانے کے لیے تشریف لائے ۔ اتنے میں نبی کریم صلی اللہ علیہ وسلم نے مرض میں کچھ کمی محسوس کی اور دو آدمیوں کا سہارا لے کر باہر تشریف لے گئے ۔ گویا میں اس وقت آپ صلی اللہ علیہ وسلم کے قدموں کو دیکھ رہی ہوں کہ تکلیف کی وجہ سے زمین پر لکیر کرتے جاتے تھے ۔ ابوبکر رضی اللہ عنہ نے یہ دیکھ کر چاہا کہ پیچھے ہٹ جائیں ۔ لیکن آنحضور صلی اللہ علیہ وسلم نے اشارہ سے انہیں اپنی جگہ رہنے کے لیے کہا ۔ پھر ان کے قریب آئے اور بازو میں بیٹھ گئے ۔ جب اعمش نے یہ حدیث بیان کی ، ان سے پوچھا گیا کہ کیا نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھائی ۔ اور ابوبکر رضی اللہ عنہ نے آپ کی اقتداء کی اور لوگوں نے ابوبکر رضی اللہ عنہ کی نماز کی اقتداء کی ؟ حضرت اعمش نے سر کے اشارہ سے بتلایا کہ ہاں ۔ ابوداؤد طیالسی نے اس حدیث کا ایک ٹکڑا شعبہ سے روایت کیا ہے اور شعبہ نے اعمش سے اور ابومعاویہ نے اس روایت میں یہ زیادہ کیا کہ آنحضرت صلی اللہ علیہ وسلم حضرت ابوبکر رضی اللہ عنہ کے بائیں طرف بیٹھے ۔ پس ابوبکر رضی اللہ عنہ کھڑے ہو کر نماز پڑھ رہے تھے ۔",
                "urduNarrator": "ہم سے عمرو بن حفص بن غیاث نے بیان کیا ، کہا کہ مجھ سے میرے باپ حفص بن غیاث نے بیان کیا ، کہا کہ ہم سے اعمش نے ابراہیم نخعی سے بیان کیا کہ حضرت اسود بن یزید نخعی نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، قَالَ الأَسْوَدُ قَالَ كُنَّا عِنْدَ عَائِشَةَ ـ رضى الله عنها ـ فَذَكَرْنَا الْمُوَاظَبَةَ عَلَى الصَّلاَةِ وَالتَّعْظِيمَ لَهَا، قَالَتْ لَمَّا مَرِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَرَضَهُ الَّذِي مَاتَ فِيهِ، فَحَضَرَتِ الصَّلاَةُ فَأُذِّنَ، فَقَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ‏\"‏‏.‏ فَقِيلَ لَهُ إِنَّ أَبَا بَكْرٍ رَجُلٌ أَسِيفٌ، إِذَا قَامَ فِي مَقَامِكَ لَمْ يَسْتَطِعْ أَنْ يُصَلِّيَ بِالنَّاسِ، وَأَعَادَ فَأَعَادُوا لَهُ، فَأَعَادَ الثَّالِثَةَ فَقَالَ ‏\"‏ إِنَّكُنَّ صَوَاحِبُ يُوسُفَ، مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ‏\"‏‏.‏ فَخَرَجَ أَبُو بَكْرٍ فَصَلَّى، فَوَجَدَ النَّبِيُّ صلى الله عليه وسلم مِنْ نَفْسِهِ خِفَّةً، فَخَرَجَ يُهَادَى بَيْنَ رَجُلَيْنِ كَأَنِّي أَنْظُرُ رِجْلَيْهِ تَخُطَّانِ مِنَ الْوَجَعِ، فَأَرَادَ أَبُو بَكْرٍ أَنْ يَتَأَخَّرَ، فَأَوْمَأَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم أَنْ مَكَانَكَ، ثُمَّ أُتِيَ بِهِ حَتَّى جَلَسَ إِلَى جَنْبِهِ‏.‏ قِيلَ لِلأَعْمَشِ وَكَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي وَأَبُو بَكْرٍ يُصَلِّي بِصَلاَتِهِ، وَالنَّاسُ يُصَلُّونَ بِصَلاَةِ أَبِي بَكْرٍ فَقَالَ بِرَأْسِهِ نَعَمْ‏.‏ رَوَاهُ أَبُو دَاوُدَ عَنْ شُعْبَةَ عَنِ الأَعْمَشِ بَعْضَهُ‏.‏ وَزَادَ أَبُو مُعَاوِيَةَ جَلَسَ عَنْ يَسَارِ أَبِي بَكْرٍ فَكَانَ أَبُو بَكْرٍ يُصَلِّي قَائِمًا‏.‏",
                "headingArabic": "حَدِّ الْمَرِيضِ أَنْ يَشْهَدَ الْجَمَاعَةَ",
                "headingUrdu": "مریض کے لیے باجماعت نماز میں شرکت کی حد مقرر ہے؟",
                "headingEnglish": "The limit set for a patient to attend the congregational Salat (prayer)?",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 646,
                "hadithNumber": "665",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"When the Prophet (ﷺ) became seriously ill and his disease became aggravated he asked for permission from his wives to be nursed in my house and he was allowed. He came out with the help of two men and his legs were dragging on the ground. He was between Al-`Abbas and another man.\" 'Ubaidullah said, \"I told Ibn `Abbas what `Aisha رضی اللہ عنہا had narrated and he said, 'Do you know who was the (second) man whose name `Aisha\r\nرضی اللہ عنہا did not mention'\" I said, 'No.' Ibn `Abbas said, 'He was `Ali Ibn Abi Talib.' \"",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم بیمار ہو گئے اور تکلیف زیادہ بڑھ گئی تو آپ صلی اللہ علیہ وسلم نے اپنی بیویوں سے اس کی اجازت لی کہ بیماری کے دن میرے گھر میں گزاریں ۔ انھوں نے اس کی آپ صلی اللہ علیہ وسلم کو اجازت دے دی ۔ پھر آپ صلی اللہ علیہ وسلم باہر تشریف لے گئے ۔ آپ صلی اللہ علیہ وسلم کے قدم زمین پر لکیر کر رہے تھے ۔ آپ صلی اللہ علیہ وسلم اس وقت عباس رضی اللہ عنہ اور ایک اور شخص کے بیچ میں تھے ( یعنی دونوں حضرات کا سہارا لیے ہوئے تھے ) عبیداللہ راوی نے بیان کیا کہ میں نے یہ حدیث حضرت عائشہ رضی اللہ عنہا کی عبداللہ بن عباس رضی اللہ عنہما سے بیان کی ، تو آپ نے فرمایا اس شخص کو بھی جانتے ہو ، جن کا نام حضرت عائشہ رضی اللہ عنہا نے نہیں لیا ۔ میں نے کہا کہ نہیں ! آپ نے فرمایا کہ وہ دوسرے آدمی حضرت علی رضی اللہ عنہ تھے ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہمیں ہشام بن یوسف نے خبر دی معمر سے ، انھوں نے زہری سے ، کہا کہ مجھے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے خبر دی کہ حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، قَالَ قَالَتْ عَائِشَةُ لَمَّا ثَقُلَ النَّبِيُّ صلى الله عليه وسلم وَاشْتَدَّ وَجَعُهُ اسْتَأْذَنَ أَزْوَاجَهُ أَنْ يُمَرَّضَ فِي بَيْتِي فَأَذِنَّ لَهُ، فَخَرَجَ بَيْنَ رَجُلَيْنِ تَخُطُّ رِجْلاَهُ الأَرْضَ، وَكَانَ بَيْنَ الْعَبَّاسِ وَرَجُلٍ آخَرَ‏.‏ قَالَ عُبَيْدُ اللَّهِ فَذَكَرْتُ ذَلِكَ لاِبْنِ عَبَّاسٍ مَا قَالَتْ عَائِشَةُ فَقَالَ لِي وَهَلْ تَدْرِي مَنِ الرَّجُلُ الَّذِي لَمْ تُسَمِّ عَائِشَةُ قُلْتُ لاَ‏.‏ قَالَ هُوَ عَلِيُّ بْنُ أَبِي طَالِبٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 647,
                "hadithNumber": "666",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "Once on a very cold and stormy night, Ibn `Umar pronounced the Adhan for the prayer and then said, \"Pray in your homes.\" He (Ibn `Umar) added. \"On very cold and rainy nights Allah's Messenger (ﷺ) used to order the Mu'adh-dhin to say, 'Pray in your homes.' \"",
                "hadithUrdu": "حضرت عبداللہ بن عمر رضی اللہ عنہما نے ایک ٹھنڈی اور برسات کی رات میں اذان دی ، پھر یوں پکار کر کہہ دیا «ألا صلوا في الرحال‏» کہ لوگو ! اپنی قیام گاہوں پر ہی نماز پڑھ لو ۔ پھر فرمایا کہ نبی کریم صلی اللہ علیہ وسلم سردی و بارش کی راتوں میں مؤذن کو حکم دیتے تھے کہ وہ اعلان کر دے کہ لوگو اپنی قیام گاہوں پر ہی نماز پڑھ لو ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک نے نافع سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، أَذَّنَ بِالصَّلاَةِ فِي لَيْلَةٍ ذَاتِ بَرْدٍ وَرِيحٍ ثُمَّ قَالَ أَلاَ صَلُّوا فِي الرِّحَالِ‏.‏ ثُمَّ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْمُرُ الْمُؤَذِّنَ إِذَا كَانَتْ لَيْلَةٌ ذَاتُ بَرْدٍ وَمَطَرٍ يَقُولُ أَلاَ صَلُّوا فِي الرِّحَالِ‏.‏",
                "headingArabic": "الرُّخْصَةِ فِي الْمَطَرِ وَالْعِلَّةِ أَنْ يُصَلِّيَ فِي رَحْلِهِ",
                "headingUrdu": "بارش کے وقت یا کوئی عذر ہو تو گھر میں نماز پڑھنا جائز ہے",
                "headingEnglish": "It is permissible to pray at one's dwelling during rain or if there is a genuine excuse",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 648,
                "hadithNumber": "667",
                "englishNarrator": "Narrated Mahmud bin Rabi` Al-Ansari:",
                "hadithEnglish": "`Itban bin Malik used to lead his people (tribe) in prayer and was a blind man, he said to Allah's Apostle , \"O Allah's Messenger (ﷺ)! At times it is dark and flood water is flowing (in the valley) and I am blind man, so please pray at a place in my house so that I can take it as a Musalla (praying place).\" So Allah's Messenger (ﷺ) went to his house and said, \"Where do you like me to pray?\" 'Itban pointed to a place in his house and Allah's Messenger (ﷺ), offered the prayer there.",
                "hadithUrdu": "''عتبان بن مالک انصاری رضی اللہ عنہ نابینا تھے اور وہ اپنی قوم کے امام تھے ۔ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا کہ یا رسول اللہ ! اندھیری اور سیلاب کی راتیں ہوتی ہیں اور میں اندھا ہوں ، اس لیے آپ میرے گھر میں کسی جگہ نماز پڑھ لیجیئے تاکہ میں وہیں اپنی نماز کی جگہ بنا لوں ۔ پھر رسول اللہ صلی اللہ علیہ وسلم ان کے گھر تشریف لائے اور پوچھا کہ تم کہاں نماز پڑھنا پسند کرو گے ۔ انھوں نے گھر میں ایک جگہ بتلا دی اور رسول اللہ صلی اللہ علیہ وسلم نے وہاں نماز پڑھی ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی عتبان نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، انہوں نے کہا ہم سے ابن شہاب نے بیان کیا ، انہوں نے محمود بن ربیع انصاری سے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ مَحْمُودِ بْنِ الرَّبِيعِ الأَنْصَارِيِّ، أَنَّ عِتْبَانَ بْنَ مَالِكٍ، كَانَ يَؤُمُّ قَوْمَهُ وَهْوَ أَعْمَى، وَأَنَّهُ قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ، إِنَّهَا تَكُونُ الظُّلْمَةُ وَالسَّيْلُ وَأَنَا رَجُلٌ ضَرِيرُ الْبَصَرِ، فَصَلِّ يَا رَسُولَ اللَّهِ فِي بَيْتِي مَكَانًا أَتَّخِذُهُ مُصَلًّى، فَجَاءَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ ‏\"‏‏.‏ فَأَشَارَ إِلَى مَكَانٍ مِنَ الْبَيْتِ، فَصَلَّى فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 649,
                "hadithNumber": "668",
                "englishNarrator": "Narrated `Abdullah bin Al-Harith:",
                "hadithEnglish": "Ibn `Abbas addressed us on a (rainy and) muddy day and when the Mu'adh-dhin said, \"Come for the prayer\" Ibn `Abbas ordered him to say, \"Pray in your homes.\" The people began to look at one another with surprise as if they did not like it. Ibn `Abbas said, \"It seems that you thought ill of it but no doubt it was done by one who was better than I (i.e. the Prophet). It (the prayer) is a strict order and I disliked to bring you out.\" Ibn `Abbas narrated the same as above but he said, \"I did not like you to make you sinful (in refraining from coming to the mosque) and to come (to the mosque) covered with mud up to the knees.\"",
                "hadithUrdu": "ہمیں ایک دن ابن عباس رضی اللہ عنہما نے جب کہ بارش کی وجہ سے کیچڑ ہو رہی تھی خطبہ سنایا ۔ پھر مؤذن کو حکم دیا اور جب وہ «حى على الصلاة‏» پر پہنچا تو آپ نے فرمایا کہ آج یوں پکار دو «الصلاة في الرحال» کہ نماز اپنی قیام گاہوں پر پڑھ لو ۔ لوگ ایک دوسرے کو ( حیرت کی وجہ سے ) دیکھنے لگے ۔ جیسے اس کو انھوں نے ناجائز سمجھا ۔ ابن عباس رضی اللہ عنہما نے فرمایا کہ ایسا معلوم ہوتا ہے کہ تم نے شاید اس کو برا جانا ہے ۔ ایسا تو مجھ سے بہتر ذات یعنی رسول اللہ صلی اللہ علیہ وسلم نے بھی کیا تھا ۔ بیشک جمعہ واجب ہے مگر میں نے یہ پسند نہیں کیا کہ «حى على الصلاة‏» کہہ کر تمہیں باہر نکالوں ( اور تکلیف میں مبتلا کروں ) اور حماد عاصم سے ، وہ عبداللہ بن حارث سے ، وہ ابن عباس رضی اللہ عنہما سے ، اسی طرح روایت کرتے ہیں ۔ البتہ انھوں نے اتنا اور کہا کہ ابن عباس رضی اللہ عنہما نے فرمایا کہ مجھے اچھا معلوم نہیں ہوا کہ تمہیں گنہگار کروں اور تم اس حالت میں آؤ کہ تم مٹی میں گھٹنوں تک آلودہ ہو گئے ہو ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالوہاب بصریٰ نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، کہا کہ ہم سے عبدالحمید صاحب الزیادی نے بیان کیا کہ کہا میں نے عبداللہ بن حارث بن نوفل سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ، صَاحِبُ الزِّيَادِيِّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ، قَالَ خَطَبَنَا ابْنُ عَبَّاسٍ فِي يَوْمٍ ذِي رَدْغٍ، فَأَمَرَ الْمُؤَذِّنَ لَمَّا بَلَغَ حَىَّ عَلَى الصَّلاَةِ‏.‏ قَالَ قُلِ الصَّلاَةُ فِي الرِّحَالِ، فَنَظَرَ بَعْضُهُمْ إِلَى بَعْضٍ، فَكَأَنَّهُمْ أَنْكَرُوا فَقَالَ كَأَنَّكُمْ أَنْكَرْتُمْ هَذَا إِنَّ هَذَا فَعَلَهُ مَنْ هُوَ خَيْرٌ مِنِّي ـ يَعْنِي النَّبِيَّ صلى الله عليه وسلم ـ إِنَّهَا عَزْمَةٌ، وَإِنِّي كَرِهْتُ أَنْ أُحْرِجَكُمْ‏.‏ وَعَنْ حَمَّادٍ عَنْ عَاصِمٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنِ ابْنِ عَبَّاسٍ نَحْوَهُ، غَيْرَ أَنَّهُ قَالَ كَرِهْتُ أَنْ أُؤَثِّمَكُمْ، فَتَجِيئُونَ تَدُوسُونَ الطِّينَ إِلَى رُكَبِكُمْ‏.‏",
                "headingArabic": "هَلْ يُصَلِّي الإِمَامُ بِمَنْ حَضَرَ وَهَلْ يَخْطُبُ يَوْمَ الْجُمُعَةِ فِي الْمَطَرِ",
                "headingUrdu": "کیا امام صرف ان لوگوں کے ساتھ نماز پڑھ سکتا ہے جو (نماز کے لیے) موجود ہوں؟ اور اگر بارش ہو رہی ہو تو کیا جمعہ کے دن خطبہ دیا جا سکتا ہے؟",
                "headingEnglish": "Can the Imam offer the Salat (prayer) with only those who are present (for the prayer)? And can be deliver a Khutba (religious talk) on Friday if it is raining?",
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 650,
                "hadithNumber": "669",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "A cloud came and it rained till the roof started leaking and in those days the roof used to be of the branches of date-palms. Iqama was pronounced and I saw Allah's Messenger (ﷺ)s prostrating in water and mud and even I saw the mark of mud on his forehead.",
                "hadithUrdu": "ایک بادل کا ایک ٹکڑا آیا اور برسا یہاں تک کہ ( مسجد کی چھت ) ٹپکنے لگی جو کھجور کی شاخوں سے بنائی گئی تھی ۔ پھر نماز کے لیے تکبیر ہوئی ۔ میں نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم کیچڑ اور پانی میں سجدہ کر رہے تھے ۔ کیچڑ کا نشان آپ کی پیشانی پر بھی میں نے دیکھا ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا کہ ہم سے ہشام دستوائی نے یحییٰ بن کثیر سے بیان کیا ، انہوں نے ابوسلمہ بن عبدالرحمٰن سے ، انہوں نے کہا کہ میں نے ابو سعید خدری رضی اللہ عنہ سے ( شب قدر کو ) پوچھا ۔ آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ سَأَلْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ فَقَالَ جَاءَتْ سَحَابَةٌ فَمَطَرَتْ حَتَّى سَالَ السَّقْفُ، وَكَانَ مِنْ جَرِيدِ النَّخْلِ، فَأُقِيمَتِ الصَّلاَةُ، فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَسْجُدُ فِي الْمَاءِ وَالطِّينِ، حَتَّى رَأَيْتُ أَثَرَ الطِّينِ فِي جَبْهَتِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "10",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 10,
                    "chapterNumber": "10",
                    "chapterEnglish": "Call to Prayers (Adhaan)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں",
                    "chapterArabic": "كتاب الأذان",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 626,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=25",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=23",
                "label": "23",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=24",
                "label": "24",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=25",
                "label": "25",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=26",
                "label": "26",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=27",
                "label": "27",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=28",
                "label": "28",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=29",
                "label": "29",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=27",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=27",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=25",
        "to": 650,
        "total": 40465
    }
}