{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 31,
        "data": [
            {
                "id": 751,
                "hadithNumber": "771",
                "englishNarrator": "Narrated Saiyar bin Salama:",
                "hadithEnglish": "My father and I went to Abu Barza-al-Aslami رضی اللہ عنہ to ask him about the stated times for the prayers. He replied, \"The Prophet (ﷺ) used to offer the Zuhr prayer when the sun just declined from its highest position at noon; the `Asr at a time when if a man went to the farthest place in Medina (after praying) he would find the sun still hot (bright). (The sub narrator said: I have forgotten what Abu Barza said about the Maghrib prayer). The Prophet (ﷺ) never found any harm in delaying the `Isha' prayer to the first third of the night and he never liked to sleep before it and to talk after it. He used to offer the morning prayer at a time when after finishing it one could recognize the person sitting beside him and used to recite between 60 to 100 verses in one or both the rak`at.\"",
                "hadithUrdu": "میں اپنے باپ کے ساتھ ابوبرزہ اسلمی صحابی رضی اللہ عنہ کے پاس گیا ۔ ہم نے آپ سے نماز کے وقتوں کے متعلق پوچھا تو انھوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم ظہر کی نماز سورج ڈھلنے پر پڑھتے تھے ۔ عصر جب پڑھتے تو مدینہ کے انتہائی کنارہ تک ایک شخص چلا جاتا ۔ لیکن سورج اب بھی باقی رہتا ۔ مغرب کے متعلق جو کچھ آپ نے کہا وہ مجھے یاد نہیں رہا اور عشاء کے لیے تہائی رات تک دیر کرنے میں کوئی حرج محسوس نہیں کرتے تھے اور آپ اس سے پہلے سونے کو اور اس کے بعد بات چیت کرنے کو ناپسند کرتے تھے ۔ جب نماز صبح سے فارغ ہوتے تو ہر شخص اپنے قریب بیٹھے ہوئے کو پہچان سکتا تھا ۔ آپ دونوں رکعات میں یا ایک میں ساٹھ سے لے کر سو تک آیتیں پڑھتے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انھوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے سیار ابن سلامہ نے بیان کیا ، انھوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا سَيَّارُ بْنُ سَلاَمَةَ، قَالَ دَخَلْتُ أَنَا وَأَبِي، عَلَى أَبِي بَرْزَةَ الأَسْلَمِيِّ فَسَأَلْنَاهُ عَنْ وَقْتِ الصَّلَوَاتِ، فَقَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الظُّهْرَ حِينَ تَزُولُ الشَّمْسُ، وَالْعَصْرَ وَيَرْجِعُ الرَّجُلُ إِلَى أَقْصَى الْمَدِينَةِ وَالشَّمْسُ حَيَّةٌ، وَنَسِيتُ مَا قَالَ فِي الْمَغْرِبِ، وَلاَ يُبَالِي بِتَأْخِيرِ الْعِشَاءِ إِلَى ثُلُثِ اللَّيْلِ وَلاَ يُحِبُّ النَّوْمَ قَبْلَهَا، وَلاَ الْحَدِيثَ بَعْدَهَا، وَيُصَلِّي الصُّبْحَ فَيَنْصَرِفُ الرَّجُلُ فَيَعْرِفُ جَلِيسَهُ، وَكَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ أَوْ إِحْدَاهُمَا مَا بَيْنَ السِّتِّينَ إِلَى الْمِائَةِ‏.‏",
                "headingArabic": "الْقِرَاءَةِ فِي الْفَجْرِ",
                "headingUrdu": "فجر کی نماز میں قرآن کی تلاوت",
                "headingEnglish": "The recitation of the Qur'an in the Fajr prayer",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 752,
                "hadithNumber": "772",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Qur'an is recited in every prayer and in those prayers in which Allah's Messenger (ﷺ) recited aloud for us, we recite aloud in the same prayers for you; and the prayers in which the Prophet (ﷺ) recited quietly, we recite quietly. If you recite \"Al-Fatiha\" only it is sufficient but if you recite something else in addition, it is better.",
                "hadithUrdu": "ہر نماز میں قرآن مجید کی تلاوت کی جائے گی ۔ جن میں نبی کریم صلی اللہ علیہ وسلم نے ہمیں قرآن سنایا تھا ہم بھی تمہیں ان میں سنائیں گے اور جن نمازوں میں آپ صلی اللہ علیہ وسلم نے آہستہ قرآت کی ہم بھی ان میں آہستہ ہی قرآت کریں گے اور اگر سورۃ الفاتحہ ہی پڑھو جب بھی کافی ہے ، لیکن اگر زیادہ پڑھ لو تو اور بہتر ہے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے اسماعیل بن ابراہیم نے بیان کیا ، کہا کہ ہمیں عبدالملک ابن جریج نے خبر دی ، کہا کہ مجھے عطاء بن ابی رباح نے خبر دی کہ انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، وہ فرماتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ فِي كُلِّ صَلاَةٍ يُقْرَأُ، فَمَا أَسْمَعَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَسْمَعْنَاكُمْ، وَمَا أَخْفَى عَنَّا أَخْفَيْنَا عَنْكُمْ، وَإِنْ لَمْ تَزِدْ عَلَى أُمِّ الْقُرْآنِ أَجْزَأَتْ، وَإِنْ زِدْتَ فَهُوَ خَيْرٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 753,
                "hadithNumber": "773",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) set out with the intention of going to Suq `Ukaz (market of `Ukaz) along with some of his companions. At the same time, a barrier was put between the devils and the news of heaven. Fire commenced to be thrown at them. The Devils went to their people, who asked them, \"What is wrong with you?\" They said, \"A barrier has been placed between us and the news of heaven. And fire has been thrown at us.\" They said, \"The thing which has put a barrier between you and the news of heaven must be something which has happened recently. Go eastward and westward and see what has put a barrier between you and the news of heaven.\" Those who went towards Tuhama came across the Prophet at a place called Nakhla and it was on the way to Suq `Ukaz and the Prophet (ﷺ) was offering the Fajr prayer with his companions. When they heard the Qur'an they listened to it and said, \"By Allah, this is the thing which has put a barrier between us and the news of heaven.\" They went to their people and said, \"O our people; verily we have heard a wonderful recital (Qur'an) which shows the true path; we believed in it and would not ascribe partners to our Lord.\" Allah revealed the following verses to his Prophet (Sura 'Jinn') (72): \"Say: It has been revealed to me.\" And what was revealed to him was the conversation of the Jinns.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک مرتبہ چند صحابہ رضی اللہ عنہم کے ساتھ عکاظ کے بازار کی طرف گئے ۔ ان دنوں شیاطین کو آسمان کی خبریں لینے سے روک دیا گیا تھا اور ان پر انگارے ( شہاب ثاقب ) پھینکے جانے لگے تھے ۔ تو وہ شیاطین اپنی قوم کے پاس آئے اور پوچھا کہ بات کیا ہوئی ۔ انھوں نے کہا کہ ہمیں آسمان کی خبریں لینے سے روک دیا گیا ہے اور ( جب ہم آسمان کی طرف جاتے ہیں تو ) ہم پر شہاب ثاقب پھینکے جاتے ہیں ۔ شیاطین نے کہا کہ آسمان کی خبریں لینے سے روکنے کی کوئی نئی وجہ ہوئی ہے ۔ اس لیے تم مشرق و مغرب میں ہر طرف پھیل جاؤ اور اس سبب کو معلوم کرو جو تمہیں آسمان کی خبریں لینے سے روکنے کا سبب ہوا ہے ۔ وجہ معلوم کرنے کے لیے نکلے ہوئے شیاطین تہامہ کی طرف گئے جہاں نبی کریم صلی اللہ علیہ وسلم عکاظ کے بازار کو جاتے ہوئے مقام نخلہ میں اپنے اصحاب کے ساتھ نماز فجر پڑھ رہے تھے ۔ جب قرآن مجید انہوں نے سنا تو غور سے اس کی طرف کان لگا دئیے ۔ پھر کہا ۔ خدا کی قسم یہی ہے جو آسمان کی خبریں سننے سے روکنے کا باعث بنا ہے ۔ پھر وہ اپنی قوم کی طرف لوٹے اور کہا قوم کے لوگو ! ہم نے حیرت انگیز قرآن سنا جو سیدھے راستے کی طرف ہدایت کرتا ہے ۔ اس لیے ہم اس پر ایمان لاتے ہیں اور اپنے رب کے ساتھ کسی کو شریک نہیں ٹھہراتے ۔ اس پر نبی کریم صلی اللہ علیہ وسلم پر یہ آیت نازل ہوئی «قل أوحي إلى‏» ( آپ کہیئے کہ مجھے وحی کے ذریعہ بتایا گیا ہے ) اور آپ پر جنوں کی گفتگو وحی کی گئی تھی ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، انہوں نے کہا کہ ہم سے ابوعوانہ وضاح یشکری نے ابوبشر سے بیان کیا ، انہوں نے سعید بن جبیر سے ، انہوں نے حضرت عبداللہ بن عباس رضی اللہ عنہما سے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ انْطَلَقَ النَّبِيُّ صلى الله عليه وسلم فِي طَائِفَةٍ مِنْ أَصْحَابِهِ عَامِدِينَ إِلَى سُوقِ عُكَاظٍ، وَقَدْ حِيلَ بَيْنَ الشَّيَاطِينِ وَبَيْنَ خَبَرِ السَّمَاءِ، وَأُرْسِلَتْ عَلَيْهِمُ الشُّهُبُ، فَرَجَعَتِ الشَّيَاطِينُ إِلَى قَوْمِهِمْ‏.‏ فَقَالُوا مَا لَكُمْ فَقَالُوا حِيلَ بَيْنَنَا وَبَيْنَ خَبَرِ السَّمَاءِ، وَأُرْسِلَتْ عَلَيْنَا الشُّهُبُ‏.‏ قَالُوا مَا حَالَ بَيْنَكُمْ وَبَيْنَ خَبَرِ السَّمَاءِ إِلاَّ شَىْءٌ حَدَثَ، فَاضْرِبُوا مَشَارِقَ الأَرْضِ وَمَغَارِبَهَا، فَانْظُرُوا مَا هَذَا الَّذِي حَالَ بَيْنَكُمْ وَبَيْنَ خَبَرِ السَّمَاءِ فَانْصَرَفَ أُولَئِكَ الَّذِينَ تَوَجَّهُوا نَحْوَ تِهَامَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ بِنَخْلَةَ، عَامِدِينَ إِلَى سُوقِ عُكَاظٍ وَهْوَ يُصَلِّي بِأَصْحَابِهِ صَلاَةَ الْفَجْرِ، فَلَمَّا سَمِعُوا الْقُرْآنَ اسْتَمَعُوا لَهُ فَقَالُوا هَذَا وَاللَّهِ الَّذِي حَالَ بَيْنَكُمْ وَبَيْنَ خَبَرِ السَّمَاءِ‏.‏ فَهُنَالِكَ حِينَ رَجَعُوا إِلَى قَوْمِهِمْ وَقَالُوا يَا قَوْمَنَا ‏{‏إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا * يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ وَلَنْ نُشْرِكَ بِرَبِّنَا أَحَدًا‏}‏ فَأَنْزَلَ اللَّهُ عَلَى نَبِيِّهِ صلى الله عليه وسلم ‏{‏قُلْ أُوحِيَ إِلَىَّ‏}‏ وَإِنَّمَا أُوحِيَ إِلَيْهِ قَوْلُ الْجِنِّ‏.‏",
                "headingArabic": "الْجَهْرِ بِقِرَاءَةِ صَلاَةِ الْفَجْرِ",
                "headingUrdu": "فجر کی نماز میں بلند آواز سے پڑھنا۔",
                "headingEnglish": "To recite aloud in the Fajr (early morning) prayer.",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 754,
                "hadithNumber": "774",
                "englishNarrator": "Narrated Ibn `Abbas:",
                "hadithEnglish": "The Prophet (ﷺ) recited aloud in the prayers in which he was ordered to do so and quietly in the prayers in which he was ordered to do so. And your Lord is not forgetful. Verily there was a good example for you in the ways of the Prophet.\r\nAnas said:\r\nHadrat Anas رضی اللہ عنہ One of the Ansar used to lead the Ansar in Salat in the Quba' mosque and it was his habit to recite Qul Huwal-lahu Ahad whenever he wanted to recite something in Salat. When he finished that Surah, he would recite another one with it. He followed the same procedure in each Rak'a. His companions discussed this with him and said, \"You recite this Surah and do not consider it sufficient and then you recite another. So would you recite it alone or leave it and recite some other.\" He said, \"I will never leave it and if you want me to be your Imam on this condition then it is all right ; otherwise I will leave you.\" They knew that he was the best amongst them and they did not like someone else to lead them in Salat. When the Prophet (ﷺ) went to them as usual, they informed him about it. The Prophet (ﷺ) addressed him and said, \"O so-and-so, what forbids you from doing what your companions ask you to do ? Why do you read this Surah particularly in every Rak'a ?\" He repiled, \"I love this Surah.\" The Prophet (ﷺ) said, \"Your love for this Surah will make you enter Paradise.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کو جن نمازوں میں بلند آواز سے قرآن مجید پڑھنے کا حکم ہوا تھا ۔ آپ صلی اللہ علیہ وسلم نے ان میں بلند آواز سے پڑھا اور جن میں آہستہ سے پڑھنے کا حکم ہوا تھا ان میں آپ صلی اللہ علیہ وسلم نے آہستہ سے پڑھا اور تیرا رب بھولنے والا نہیں اور رسول اللہ صلی اللہ علیہ وسلم کی زندگی تمہارے لیے بہترین نمونہ ہے ۔\r\nعبیداللہ بن عمر نے ثابت رضی اللہ عنہ سے انہوں نے حضرت انس رضی اللہ عنہ سے نقل کیا کہ انصار میں سے ایک شخص ( کلثوم بن ہدم ) قباء کی مسجد میں لوگوں کی امامت کیا کرتا تھا ۔ وہ جب بھی کوئی سورۃ ( سورۃ الفاتحہ کے بعد ) شروع کرتا تو پہلے «قل هو الله أحد‏» پڑھ لیتا ۔ پھر کوئی دوسری سورۃ پڑھتا ۔ ہر رکعت میں اس کا یہی عمل تھا ۔ اس کے ساتھیوں نے اس سلسلے میں اس پر اعتراض کیا اور کہا کہ تم پہلے یہ سورۃ پڑھتے ہو اور صرف اسی کو کافی خیال نہیں کرتے بلکہ دوسری سورۃ بھی ( اس کے ساتھ ) ضرور پڑھتے ہو ۔ یا تو تمہیں صرف اسی کو پڑھنا چاہئے ورنہ اسے چھوڑ دینا چاہئے اور بجائے اس کے کوئی دوسری سورۃ پڑھنی چاہئے ۔ اس شخص نے کہا کہ میں اسے نہیں چھوڑ سکتا اب اگر تمہیں پسند ہے کہ میں تمہیں نماز پڑھاؤں تو برابر پڑھتا رہوں گا ورنہ میں نماز پڑھانا چھوڑ دوں گا ۔ لوگ سمجھتے تھے کہ یہ ان سب سے افضل ہیں اس لیے وہ نہیں چاہتے تھے کہ ان کے علاوہ کوئی اور شخص نماز پڑھائے ۔ جب نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو ان لوگوں نے آپ کو واقعہ کی خبر دی ۔ آپ صلی اللہ علیہ وسلم نے ان کو بلا کر پوچھا کہ اے فلاں ! تمہارے ساتھی جس طرح کہتے ہیں اس پر عمل کرنے سے تم کو کون سی رکاوٹ ہے اور ہر رکعت میں اس سورۃ کو ضروری قرار دے لینے کا سبب کیا ہے ۔ انھوں نے کہا کہ حضور ! میں اس سورۃ سے محبت رکھتا ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس سورۃ کی محبت تمہیں جنت میں لے جائے گی ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے اسماعیل بن علیہ نے بیان کیا ، کہا کہ ہم سے ایوب سختیانی نے عکرمہ سے بیان کیا ، انہوں نے ابن عباس رضی اللہ عنہما سے ، آپ نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ ، قَالَ : حَدَّثَنَا إِسْمَاعِيلُ ، قَالَ : حَدَّثَنَا أَيُّوبُ ، عَنْ عِكْرِمَةَ ، عَنِ ابْنِ عَبَّاسٍ ، قَالَ : قَرَأَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيمَا أُمِرَ وَسَكَتَ فِيمَا أُمِرَ ، وَمَا كَانَ رَبُّكَ نَسِيًّا لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ .\r\nوَقَالَ عُبَيْدُ اللَّهِ عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ كَانَ رَجُلٌ مِنَ الأَنْصَارِ يَؤُمُّهُمْ فِي مَسْجِدِ قُبَاءٍ، وَكَانَ كُلَّمَا افْتَتَحَ سُورَةً يَقْرَأُ بِهَا لَهُمْ فِي الصَّلاَةِ مِمَّا يَقْرَأُ بِهِ افْتَتَحَ بِ ـ ‏{‏قُلْ هُوَ اللَّهُ أَحَدٌ‏}‏ حَتَّى يَفْرُغَ مِنْهَا، ثُمَّ يَقْرَأُ سُورَةً أُخْرَى مَعَهَا، وَكَانَ يَصْنَعُ ذَلِكَ فِي كُلِّ رَكْعَةٍ، فَكَلَّمَهُ أَصْحَابُهُ فَقَالُوا إِنَّكَ تَفْتَتِحُ بِهَذِهِ السُّورَةِ، ثُمَّ لاَ تَرَى أَنَّهَا تُجْزِئُكَ حَتَّى تَقْرَأَ بِأُخْرَى، فَإِمَّا أَنْ تَقْرَأَ بِهَا وَإِمَّا أَنْ تَدَعَهَا وَتَقْرَأَ بِأُخْرَى‏.‏ فَقَالَ مَا أَنَا بِتَارِكِهَا، إِنْ أَحْبَبْتُمْ أَنْ أَؤُمَّكُمْ بِذَلِكَ فَعَلْتُ، وَإِنْ كَرِهْتُمْ تَرَكْتُكُمْ‏.‏ وَكَانُوا يَرَوْنَ أَنَّهُ مِنْ أَفْضَلِهِمْ، وَكَرِهُوا أَنْ يَؤُمَّهُمْ غَيْرُهُ، فَلَمَّا أَتَاهُمُ النَّبِيُّ صلى الله عليه وسلم أَخْبَرُوهُ الْخَبَرَ فَقَالَ ‏\"‏ يَا فُلاَنُ مَا يَمْنَعُكَ أَنْ تَفْعَلَ مَا يَأْمُرُكَ بِهِ أَصْحَابُكَ وَمَا يَحْمِلُكَ عَلَى لُزُومِ هَذِهِ السُّورَةِ فِي كُلِّ رَكْعَةٍ ‏\"‏‏.‏ فَقَالَ إِنِّي أُحِبُّهَا‏.‏ فَقَالَ ‏\"‏ حُبُّكَ إِيَّاهَا أَدْخَلَكَ الْجَنَّةَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 755,
                "hadithNumber": "775",
                "englishNarrator": "Narrated Abu Wa'il:",
                "hadithEnglish": "A man came to Ibn Mas`ud رضی اللہ عنہما and said, \"I recited the Mufassal (Suras) at night in one rak`a.\" Ibn Mas`ud said, \"This recitation is (too quick) like the recitation of poetry. I know the identical Suras which the Prophet (ﷺ) used to recite in pairs.\" Ibn Mas`ud then mentioned 20 Mufassal Suras including two Suras from the family of (i.e. those verses which begin with) Ha, Meem [??] (which the Prophet (ﷺ) used to recite) in each rak`a.",
                "hadithUrdu": "ایک شخص عبداللہ بن مسعود رضی اللہ عنہما کی خدمت میں حاضر ہوا اور کہا کہ میں نے رات ایک رکعت میں مفصل کی سورۃ پڑھی ۔ آپ نے فرمایا کہ کیا اسی طرح ( جلدی جلدی ) پڑھی جیسے شعر پڑھے جاتے ہیں ۔ میں ان ہم معنی سورتوں کو جانتا ہوں جنہیں نبی کریم صلی اللہ علیہ وسلم ایک ساتھ ملا کر پڑھتے تھے ۔ آپ نے مفصل کی بیس سورتوں کا ذکر کیا ۔ ہر رکعت کے لیے دو دو سورتیں ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے عمرو بن مرہ نے بیان کیا ، انہوں نے کہا کہ میں نے ابووائل شقیق بن مسلم سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، قَالَ جَاءَ رَجُلٌ إِلَى ابْنِ مَسْعُودٍ فَقَالَ قَرَأْتُ الْمُفَصَّلَ اللَّيْلَةَ فِي رَكْعَةٍ‏.‏ فَقَالَ هَذًّا كَهَذِّ الشِّعْرِ لَقَدْ عَرَفْتُ النَّظَائِرَ الَّتِي كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرِنُ بَيْنَهُنَّ فَذَكَرَ عِشْرِينَ سُورَةً مِنَ الْمُفَصَّلِ سُورَتَيْنِ فِي كُلِّ رَكْعَةٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 756,
                "hadithNumber": "776",
                "englishNarrator": "Narrated `Abdullah bin Abi Qatada has reported from his father:",
                "hadithEnglish": "\"The Prophet (ﷺ) uses to recite Al-Fatiha followed by another Sura in the first two rak`at of the prayer and used to recite only Al-Fatiha in the last two rak`at of the Zuhr prayer. Sometimes a verse or so was audible and he used to prolong the first rak`a more than the second and used to do the same in the `Asr and Fajr prayers.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ظہر کی دو پہلی رکعتوں میں سورۃ الفاتحہ اور دو سورتیں پڑھتے تھے اور آخری دو رکعات میں صرف سورۃ الفاتحہ پڑھتے ۔ کبھی کبھی ہمیں ایک آیت سنا بھی دیا کرتے تھے اور پہلی رکعت میں قرآت دوسری رکعت سے زیادہ کرتے تھے ۔ عصر اور صبح کی نماز میں بھی آپ کا یہی معمول تھا ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا کہ ہم سے ہمام بن یحییٰ نے بیان کیا ، انہوں نے یحییٰ بن ابی کثیر کے واسطے سے بیان کیا ، انہوں نے عبداللہ بن ابی قتادہ سے ، انہوں نے اپنے باپ ابوقتادہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا هَمَّامٌ، عَنْ يَحْيَى، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي الظُّهْرِ فِي الأُولَيَيْنِ بِأُمِّ الْكِتَابِ وَسُورَتَيْنِ، وَفِي الرَّكْعَتَيْنِ الأُخْرَيَيْنِ بِأُمِّ الْكِتَابِ، وَيُسْمِعُنَا الآيَةَ، وَيُطَوِّلُ فِي الرَّكْعَةِ الأُولَى مَا لاَ يُطَوِّلُ فِي الرَّكْعَةِ الثَّانِيَةِ، وَهَكَذَا فِي الْعَصْرِ وَهَكَذَا فِي الصُّبْحِ‏.‏",
                "headingArabic": "يَقْرَأُ فِي الأُخْرَيَيْنِ بِفَاتِحَةِ الْكِتَابِ",
                "headingUrdu": "چار رکعت نماز میں آخری دو رکعتوں میں صرف سورہ فاتحہ پڑھنا",
                "headingEnglish": "To recite only Surah Al-Fathiha in the last two Rak'a during a four Rak'a Salat (prayer)",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 757,
                "hadithNumber": "777",
                "englishNarrator": "Narrated Abu Ma`mar:",
                "hadithEnglish": "We said to Khabbab رضی اللہ عنہ \"Did Allah's Messenger (ﷺ) used to recite in Zuhr and `Asr prayers?\" He replied in the affirmative. We said, \"How did you come to know about it?\" He said, \"By the movement of his beard.\"",
                "hadithUrdu": "کیا رسول اللہ صلی اللہ علیہ وسلم ظہر اور عصر میں قرآن مجید پڑھتے تھے ؟ انھوں نے جواب دیا کہ ہاں ! ہم نے پوچھا کہ آپ کو معلوم کس طرح ہوتا تھا ۔ انھوں نے بتایا کہ آپ صلی اللہ علیہ وسلم کی ریش مبارک کے ہلنے سے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے جریر بن عبدالحمید نے اعمش سے بیان کیا ، وہ عمارہ بن عمیر سے ، وہ ابومعمر عبداللہ بن مخبرہ سے ، انہوں نے بیان کیا کہ ہم نے خباب بن ارت رضی اللہ عنہ سے کہا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ أَبِي مَعْمَرٍ، قُلْتُ لِخَبَّابٍ أَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ قَالَ نَعَمْ‏.‏ قُلْنَا مِنْ أَيْنَ عَلِمْتَ قَالَ بِاضْطِرَابِ لِحْيَتِهِ‏.‏",
                "headingArabic": "مَنْ خَافَتَ الْقِرَاءَةَ فِي الظُّهْرِ وَالْعَصْرِ",
                "headingUrdu": "ظہر اور عصر کی نمازوں میں خاموشی سے (قرآن) پڑھنا",
                "headingEnglish": "To recite (the Qur'an) quietly in the Zuhr and 'Asr prayers",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 758,
                "hadithNumber": "778",
                "englishNarrator": "Narrated `Abdullah bin Abi Qatada رضی اللہ عنہ has reported from his father:",
                "hadithEnglish": "\"The Prophet (ﷺ) used to recite Al-Fatiha along with another Sura in the first two rak`at of the Zuhr and `Asr prayers. A verse or so was audible at times and he used to prolong the first rak`a.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ظہر اور عصر کی دو پہلی رکعتوں میں سورۃ الفاتحہ اور کوئی اور سورۃ پڑھتے تھے ۔ کبھی کبھی آپ صلی اللہ علیہ وسلم کوئی آیت ہمیں سنا بھی دیا کرتے تھے ۔ پہلی رکعت میں قرآت زیادہ طویل کرتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن یوسف فریابی نے بیان کیا ، انہوں نے کہا کہ ہم سے امام عبدالرحمٰن اوزاعی نے بیان کیا ، انہوں نے کہا کہ مجھ سے یحییٰ بن ابی کثیر نے بیان کیا ، انہوں نے کہا کہ مجھ سے عبداللہ بن ابی قتادہ نے بیان کیا ، وہ اپنے والد ابوقتادہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَأُ بِأُمِّ الْكِتَابِ وَسُورَةٍ مَعَهَا فِي الرَّكْعَتَيْنِ الأُولَيَيْنِ مِنْ صَلاَةِ الظُّهْرِ وَصَلاَةِ الْعَصْرِ، وَيُسْمِعُنَا الآيَةَ أَحْيَانًا، وَكَانَ يُطِيلُ فِي الرَّكْعَةِ الأُولَى‏.‏",
                "headingArabic": "إِذَا أَسْمَعَ الإِمَامُ الآيَةَ",
                "headingUrdu": "(خاموشی سے نماز میں) اگر امام کوئی آیت پڑھے یا اس طرح سنے۔",
                "headingEnglish": "(In a quiet prayer) if the Imam recites a Verse or so audibly",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 759,
                "hadithNumber": "779",
                "englishNarrator": "Narrated `Abdullah bin Abi Qatada has reported from his father:",
                "hadithEnglish": "\"The Prophet (ﷺ) used to prolong the first rak`a of the Zuhr prayer and shorten the second one and used to do the same in the Fajr prayer.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ظہر کی پہلی رکعت میں ( قرآت ) طویل کرتے تھے اور دوسری رکعت میں مختصر ۔ صبح کی نماز میں بھی آپ صلی اللہ علیہ وسلم اسی طرح کرتے تھے ۔",
                "urduNarrator": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، انہوں نے کہا کہ ہم سے ہشام دستوائی نے بیان کیا ، انہوں نے یحییٰ بن ابی کثیر سے بیان کیا ، انہوں نے عبداللہ بن ابی قتادہ سے ، انہوں نے اپنے والد ابوقتادہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُطَوِّلُ فِي الرَّكْعَةِ الأُولَى مِنْ صَلاَةِ الظُّهْرِ، وَيُقَصِّرُ فِي الثَّانِيَةِ، وَيَفْعَلُ ذَلِكَ فِي صَلاَةِ الصُّبْحِ‏.‏",
                "headingArabic": "يُطَوِّلُ فِي الرَّكْعَةِ الأُولَى",
                "headingUrdu": "پہلی رکعت کو طول دینا",
                "headingEnglish": "To prolong the first Rak'a",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 760,
                "hadithNumber": "780",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Say Amin\" when the Imam says it and if the Amin of any one of you coincides with that of the angels then all his past sins will be forgiven.\" Ibn Shihab said, \"Allah's Messenger (ﷺ) used to Say \"Amin.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب امام «آمين» کہے تو تم بھی «آمين» کہو ۔ کیونکہ جس کی «آمين» ملائکہ کے آمین کے ساتھ ہو گئی اس کے پچھلے تمام گناہ معاف کر دئیے جائیں گے ۔ ابن شہاب نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم «آمين» کہتے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک نے خبر دی انہوں نے ابن شہاب سے ، انہوں نے سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن کے واسطے سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُمَا أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا أَمَّنَ الإِمَامُ فَأَمِّنُوا فَإِنَّهُ مَنْ وَافَقَ تَأْمِينُهُ تَأْمِينَ الْمَلاَئِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏ وَقَالَ ابْنُ شِهَابٍ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ آمِينَ ‏\"‏‏.‏",
                "headingArabic": "جَهْرِ الإِمَامِ بِالتَّأْمِينِ",
                "headingUrdu": "امام کا بلند آواز سے آمین کہنا",
                "headingEnglish": "Saying of Amin aloud by the Imam",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 761,
                "hadithNumber": "781",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If any one of you says, \"Amin\" and the angels in the heavens say \"Amin\" and the former coincides with the latter, all his past sins will be forgiven.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب کوئی تم میں سے «آمين» کہے اور فرشتوں نے بھی اسی وقت آسمان پر «آمين» کہی ۔ اس طرح ایک کی «آمين» دوسرے کے «آمين» کے ساتھ مل گئی تو اس کے پچھلے تمام گناہ معاف ہو جاتے ہیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک نے ابوالزناد سے خبر دی ، انہوں نے اعرج سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا قَالَ أَحَدُكُمْ آمِينَ‏.‏ وَقَالَتِ الْمَلاَئِكَةُ فِي السَّمَاءِ آمِينَ‏.‏ فَوَافَقَتْ إِحْدَاهُمَا الأُخْرَى، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ التَّأْمِينِ",
                "headingUrdu": "امین کہنے کی فضیلت",
                "headingEnglish": "Superiority of saying Amin",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 762,
                "hadithNumber": "782",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Say Amen when the Imam says 'Ghairi l-maghdubi `alaihim wala d-daalleen' (not the path of those who earn Your Anger (such as Jews) nor of those who go astray (such as Christians)); all the past sins of the person whose saying (of Amin) coincides with that of the angels, will be forgiven\".\r\nMuhammad bin Amr رضی اللہ عنہ has corroborated somayy from Abu Salamah رضی اللہ عنہ he from prophet (ﷺ) and Noaim Mujmir رضی اللہ عنہ has also corroborated somayy from Hadrat Abu Hurrairah رضی اللہ عنہ .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب «غير المغضوب عليهم ولا الضالين‏» کہے تو تم بھی «آمين» کہو کیونکہ جس نے فرشتوں کے ساتھ «آمين» کہی اس کے پچھلے تمام گناہ معاف کر دیئے جاتے ہیں۔\r\n سمی کے ساتھ اس حدیث کو محمد بن عمرو نے ابوسلمہ سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے روایت کیا ۔ اور نعیم مجمر نے بھی ابوہریرہ رضی اللہ عنہ سے ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، انہوں نے امام مالک رحمہ اللہ سے ، انہوں نے ابوبکر بن عبدالرحمٰن کے غلام سمی سے ، انہوں نے ابوصالح سمان سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا قَالَ الإِمَامُ ‏{‏غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلاَ الضَّالِّينَ‏}‏ فَقُولُوا آمِينَ‏.‏ فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلاَئِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏ تَابَعَهُ مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَنُعَيْمٌ الْمُجْمِرُ عَنْ أَبِي هُرَيْرَةَ رضى الله عنه‏.‏",
                "headingArabic": "جَهْرِ الْمَأْمُومِ بِالتَّأْمِينِ",
                "headingUrdu": "پیروکاروں کی طرف سے بلند آواز سے امین کہنا",
                "headingEnglish": "Saying of Amin aloud by the followers",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 763,
                "hadithNumber": "783",
                "englishNarrator": "Narrated Abu Bakra رضی اللہ عنہ :",
                "hadithEnglish": "I reached the Prophet (ﷺ) in the mosque while he was bowing in prayer and I too bowed before joining the row mentioned it to the Prophet (ﷺ) and he said to me, \"May Allah increase your love for the good. But do not repeat it again (bowing in that way).",
                "hadithUrdu": "وہ رسول اللہ صلی اللہ علیہ وسلم کی طرف ( نماز پڑھنے کے لیے ) گئے ۔ آپ صلی اللہ علیہ وسلم اس وقت رکوع میں تھے ۔ اس لیے صف تک پہنچنے سے پہلے ہی انہوں نے رکوع کر لیا ، پھر اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا کہ اللہ تمہارا شوق اور زیادہ کرے لیکن دوبارہ ایسا نہ کرنا ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسمعیل نے بیان کیا ، کہا کہ ہم سے ہمام بن یحییٰ نے زیادہ بن حسان اعلم سے بیان کیا ، انہوں نے حضرت حسن رحمہ اللہ علیہ سے ، انہوں نے حضرت ابوبکرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا هَمَّامٌ، عَنِ الأَعْلَمِ ـ وَهْوَ زِيَادٌ ـ عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، أَنَّهُ انْتَهَى إِلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ رَاكِعٌ، فَرَكَعَ قَبْلَ أَنْ يَصِلَ إِلَى الصَّفِّ، فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ زَادَكَ اللَّهُ حِرْصًا وَلاَ تَعُدْ ‏\"‏‏.‏",
                "headingArabic": "إِذَا رَكَعَ دُونَ الصَّفِّ",
                "headingUrdu": "اگر کوئی شخص صفوں کے پیچھے رکوع کرے، [مسجد میں داخل ہونے اور نماز کی صف میں شامل ہونے سے پہلے]",
                "headingEnglish": "If someone bowed behind the rows, [on entering the mosque and before joining the rows of Salat (prayer)]",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 764,
                "hadithNumber": "784",
                "englishNarrator": "Narrated `Imran bin Husain:",
                "hadithEnglish": "I offered the prayer with `Ali رضی اللہ عنہ in Basra and he made us remember the prayer which we used to pray with Allah's Messenger (ﷺ). `Ali رضی اللہ عنہ said Takbir on each rising and bowing.",
                "hadithUrdu": "انہوں نے حضرت علی رضی اللہ عنہ کے ساتھ بصرہ میں ایک مرتبہ نماز پڑھی ۔ پھر کہا کہ ہمیں انہوں نے وہ نماز یاد دلا دی جو کہ ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ پڑھا کرتے تھے ۔ پھر کہا کہ حضرت علی رضی اللہ عنہ جب سر اٹھاتے اور جب سر جھکاتے اس وقت تکبیر کہتے ۔",
                "urduNarrator": "ہم سے اسحاق بن شاہین واسطی نے بیان کیا ، انہوں نے کہا کہ ہم سے خالد بن عبداللہ طحان نے سعید بن ایاس جریری سے بیان کیا ، انہوں نے ابوالعلاء یزید بن عبداللہ سے ، انہوں نے مطرف بن عبداللہ سے ، انہوں نے عمران بن حصین سے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ الْوَاسِطِيُّ، قَالَ حَدَّثَنَا خَالِدٌ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي الْعَلاَءِ، عَنْ مُطَرِّفٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، قَالَ صَلَّى مَعَ عَلِيٍّ ـ رضى الله عنه ـ بِالْبَصْرَةِ فَقَالَ ذَكَّرَنَا هَذَا الرَّجُلُ صَلاَةً كُنَّا نُصَلِّيهَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَذَكَرَ أَنَّهُ كَانَ يُكَبِّرُ كُلَّمَا رَفَعَ وَكُلَّمَا وَضَعَ‏.‏",
                "headingArabic": "إِتْمَامِ التَّكْبِيرِ فِي الرُّكُوعِ",
                "headingUrdu": "رکوع پر اتمام تکبیر (یعنی تعداد تکبیر ختم کرنا یا تکبیر پوری طرح کہنا)۔ [دیکھئے فتح الباری]",
                "headingEnglish": "Itmam At-Takbir (i.e., to end the number of Takbir or to say the Takbir perfectly) on bowing. [See Fath Al-Bari]",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 765,
                "hadithNumber": "785",
                "englishNarrator": "Narrated Abu Salama رضی اللہ عنہ :",
                "hadithEnglish": "When Abu Huraira رضی اللہ عنہ led us in prayer he used to say Takbir on each bowing and rising. On the completion of the prayer he used to say, \"My prayer is more similar to the prayer of Allah's Messenger (ﷺ) than that of anyone of you.\"",
                "hadithUrdu": "انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ آپ لوگوں کو نماز پڑھاتے تھے تو جب بھی وہ جھکتے اور جب بھی وہ اٹھتے تکبیر ضرور کہتے ۔ پھر جب فارغ ہوتے تو فرماتے کہ میں نماز پڑھنے میں تم سب لوگوں سے زیادہ رسول اللہ صلی اللہ علیہ وسلم کی نماز سے مشابہت رکھنے والا ہوں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک رحمہ اللہ علیہ نے ابن شہاب سے خبر دی ، انہوں نے ابوسلمہ بن عبدالرحمٰن سے ،",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يُصَلِّي بِهِمْ، فَيُكَبِّرُ كُلَّمَا خَفَضَ وَرَفَعَ، فَإِذَا انْصَرَفَ قَالَ إِنِّي لأَشْبَهُكُمْ صَلاَةً بِرَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 766,
                "hadithNumber": "786",
                "englishNarrator": "Narrated Mutarrif bin `Abdullah:",
                "hadithEnglish": "`Imran bin Husain and I offered the prayer behind `Ali bin Abi Talib رضی اللہ عنہ . When `Ali prostrated, he said the Takbir, when he raised his head, he said the Takbir and when he got up for the third rak`a he said the Takbir. On completion of the prayer `Imran took my hand and said, \"This (i.e. `Ali) made me remember the prayer of Muhammad\" Or he said, \"He led us in a prayer like that of Muhammad.\"",
                "hadithUrdu": "میں نے اور عمران بن حصین نے علی بن ابی طالب رضی اللہ عنہ کے پیچھے نماز پڑھی ۔ تو وہ جب بھی سجدہ کرتے تو تکبیر کہتے ۔ اسی طرح جب سر اٹھاتے تو تکبیر کہتے ۔ جب دو رکعات کے بعد اٹھتے تو تکبیر کہتے ۔ جب نماز ختم ہوئی تو عمران بن حصین نے میرا ہاتھ پکڑ کر کہا کہ حضرت علی رضی اللہ عنہ نے آج حضرت محمد صلی اللہ علیہ وسلم کی نماز یاد دلائی ، یا یہ کہا کہ اس شخص نے ہم کو آنحضرت صلی اللہ علیہ وسلم کی نماز کی طرح آج نماز پڑھائی ۔",
                "urduNarrator": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا ، انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا ، انہوں نے غیلان بن جریر سے بیان کیا ، انہوں نے مطرف بن عبداللہ بن شخیر سے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ، قَالَ صَلَّيْتُ خَلْفَ عَلِيِّ بْنِ أَبِي طَالِبٍ ـ رضى الله عنه ـ أَنَا وَعِمْرَانُ بْنُ حُصَيْنٍ،، فَكَانَ إِذَا سَجَدَ كَبَّرَ، وَإِذَا رَفَعَ رَأْسَهُ كَبَّرَ، وَإِذَا نَهَضَ مِنَ الرَّكْعَتَيْنِ كَبَّرَ، فَلَمَّا قَضَى الصَّلاَةَ أَخَذَ بِيَدِي عِمْرَانُ بْنُ حُصَيْنٍ فَقَالَ قَدْ ذَكَّرَنِي هَذَا صَلاَةَ مُحَمَّدٍ صلى الله عليه وسلم‏.‏ أَوْ قَالَ لَقَدْ صَلَّى بِنَا صَلاَةَ مُحَمَّدٍ صلى الله عليه وسلم‏.‏",
                "headingArabic": "إِتْمَامِ التَّكْبِيرِ فِي السُّجُودِ",
                "headingUrdu": "سجدے میں اتمام تکبیر (یعنی تکبیروں کی تعداد کو ختم کرنا یا تکبیر پوری طرح کہنا)۔ [دیکھئے فتح الباری]",
                "headingEnglish": "Itmam At-Takbir (i.e., to end the number of Takbir, or to say the Takbir perfectly) on prostrating. [See Fath Al-Bari]",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 767,
                "hadithNumber": "787",
                "englishNarrator": "Narrated `Ikrima:",
                "hadithEnglish": "I saw a person praying at Muqam-Ibrahim (the place of Abraham by the Ka`ba) and he was saying Takbir on every bowing, rising, standing and sitting. I asked Ibn `Abbas رضی اللہ عنہما (about this prayer). He admonished me saying: \"Isn't that the prayer of the Prophet?\"",
                "hadithUrdu": "میں نے ایک شخص کو مقام ابراہیم میں ( نماز پڑھتے ہوئے ) دیکھا کہ ہر جھکنے اور اٹھنے پر وہ تکبیر کہتا تھا ۔ اسی طرح کھڑے ہوتے وقت اور بیٹھتے وقت بھی ۔ میں نے ابن عباس رضی اللہ عنہما کو اس کی اطلاع دی ۔ آپ نے فرمایا ، ارے تیری ماں مرے ! کیا یہ رسول اللہ صلی اللہ علیہ وسلم کی سی نماز نہیں ہے ۔",
                "urduNarrator": "ہم سے عمرو بن عون نے بیان کیا ، کہا کہ ہمیں ہشیم بن بشیر نے ابوبشر حفص بن ابی وحشیہ سے خبر دی ، انہوں نے عکرمہ سے ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، قَالَ حَدَّثَنَا هُشَيْمٌ، عَنْ أَبِي بِشْرٍ، عَنْ عِكْرِمَةَ، قَالَ رَأَيْتُ رَجُلاً عِنْدَ الْمَقَامِ يُكَبِّرُ فِي كُلِّ خَفْضٍ وَرَفْعٍ وَإِذَا قَامَ وَإِذَا وَضَعَ، فَأَخْبَرْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنه ـ قَالَ أَوَلَيْسَ تِلْكَ صَلاَةَ النَّبِيِّ صلى الله عليه وسلم لاَ أُمَّ لَكَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 768,
                "hadithNumber": "788",
                "englishNarrator": "Narrated `Ikrima:",
                "hadithEnglish": "I prayed behind an old at Mecca and he said twenty two Takbirs (during the prayer). I told Ibn `Abbas رضی اللہ عنہما that he (i.e. that Sheikh) was foolish. Ibn `Abbas رضی اللہ عنہما admonished me and said, \"This is the Sunnah of Abul-Qasim.\"\r\nMusa, Abaan and Qatadah have also reported it from Ikrimah.",
                "hadithUrdu": "میں نے مکہ میں ایک بوڑھے کے پیچھے ( ظہر کی ) نماز پڑھی ۔ انہوں نے ( تمام نماز میں ) بائیس تکبیریں کہیں ۔ اس پر میں نے ابن عباس رضی اللہ عنہما سے کہا کہ یہ بوڑھا بالکل بے عقل معلوم ہوتا ہے ابن عباس رضی اللہ عنہما نے فرمایا تمہاری ماں تمہیں روئے یہ تو ابوالقاسم صلی اللہ علیہ وسلم کی سنت ہے ۔ \r\nاور موسیٰ بن اسماعیل نے یوں بھی بیان کیا کہ ہم سے ابان نے بیان کیا ، کہ کہا ہم سے قتادہ نے ، انہوں نے کہا کہ ہم سے عکرمہ نے یہ حدیث بیان کی ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے ہمام بن یحییٰ نے قتادہ سے بیان کیا ، وہ عکرمہ سے ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ أَخْبَرَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، قَالَ صَلَّيْتُ خَلْفَ شَيْخٍ بِمَكَّةَ فَكَبَّرَ ثِنْتَيْنِ وَعِشْرِينَ تَكْبِيرَةً، فَقُلْتُ لاِبْنِ عَبَّاسٍ إِنَّهُ أَحْمَقُ‏.‏ فَقَالَ ثَكِلَتْكَ أُمُّكَ، سُنَّةُ أَبِي الْقَاسِمِ صلى الله عليه وسلم‏.‏ وَقَالَ مُوسَى حَدَّثَنَا أَبَانُ حَدَّثَنَا قَتَادَةُ حَدَّثَنَا عِكْرِمَةُ‏.‏",
                "headingArabic": "التَّكْبِيرِ إِذَا قَامَ مِنَ السُّجُودِ",
                "headingUrdu": "سجدے سے اٹھنے پر تکبیر کہنا",
                "headingEnglish": "Saying the Takbir on raising from the prostration",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 769,
                "hadithNumber": "789",
                "englishNarrator": "And narrated Abu Huraira:",
                "hadithEnglish": "Whenever Allah's Messenger (ﷺ) stood for the prayer, he said Takbir on starting the prayer and then on bowing. On rising from bowing he said, \"Sami`a llahu liman hamidah,\" and then while standing straight he used to say, \"Rabbana laka-l hamd\" (Al- Laith said, \"(The Prophet (ﷺ) said), 'Wa laka l-hamd'.\" He used to say Takbir on prostrating and on raising his head from prostration; again he would Say Takbir on prostrating and raising his head. He would then do the same in the whole of the prayer till it was completed. On rising from the second rak`a (after sitting for at-Tahiyyat), he used to say Takbir.",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم جب نماز کے لیے کھڑے ہوتے تو تکبیر کہتے ۔ پھر جب رکوع کرتے تب بھی تکبیر کہتے تھے ۔ پھر جب سر اٹھاتے تو «سمع الله لمن حمده‏» کہتے اور کھڑے ہی کھڑے «ربنا لك الحمد‏» کہتے ۔ پھر جب ( دوسرے ) سجدہ کے لیے جھکتے تب تکبیر کہتے اور جب سجدہ سے سر اٹھاتے تب بھی تکبیر کہتے ۔ اسی طرح آپ تمام نماز پوری کر لیتے تھے ۔ قعدہ اولیٰ سے اٹھنے پر بھی تکبیر کہتے تھے ۔ ( اس حدیث میں ) عبداللہ بن صالح نے لیث کے واسطے سے ( بجائے «ربنا لك الحمد‏» کے ) «ربنا ولك الحمد‏» نقل کیا ہے ۔ ( «ربنا لك الحمد‏» کہے یا «ربنا ولك الحمد‏» واؤ کے ساتھ ہر دو طریقہ درست ہے ) ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے عقیل بن خالد کے واسطے سے بیان کیا ، انہوں نے ابن شہاب سے ، انہوں نے کہا کہ مجھے ابوبکر بن عبدالرحمٰن بن حارث نے خبری دی کہ انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا قَامَ إِلَى الصَّلاَةِ يُكَبِّرُ حِينَ يَقُومُ، ثُمَّ يُكَبِّرُ حِينَ يَرْكَعُ، ثُمَّ يَقُولُ سَمِعَ اللَّهُ لَمِنْ حَمِدَهُ‏.‏ حِينَ يَرْفَعُ صُلْبَهُ مِنَ الرَّكْعَةِ، ثُمَّ يَقُولُ وَهُوَ قَائِمٌ رَبَّنَا لَكَ الْحَمْدُ ـ قَالَ عَبْدُ اللَّهِ ‏{‏بْنُ صَالِحٍ عَنِ اللَّيْثِ‏}‏ وَلَكَ الْحَمْدُ ـ ثُمَّ يُكَبِّرُ حِينَ يَهْوِي، ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأْسَهُ، ثُمَّ يُكَبِّرُ حِينَ يَسْجُدُ، ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأْسَهُ، ثُمَّ يَفْعَلُ ذَلِكَ فِي الصَّلاَةِ كُلِّهَا حَتَّى يَقْضِيَهَا، وَيُكَبِّرُ حِينَ يَقُومُ مِنَ الثِّنْتَيْنِ بَعْدَ الْجُلُوسِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 770,
                "hadithNumber": "790",
                "englishNarrator": "Narrated Mus`ab bin Sa`d:",
                "hadithEnglish": "I offered prayer beside my father and approximated both my hands and placed them in between the knees. My father told me not to do so and said, \"We used to do the same but we were forbidden (by the Prophet) to do it and were ordered to place the hands on the knees.\"",
                "hadithUrdu": "میں نے اپنے والد کے پہلو میں نماز پڑھی اور اپنی دونوں ہتھیلیوں کو ملا کر رانوں کے درمیان رکھ لیا ۔ اس پر میرے باپ نے مجھے ٹوکا اور فرمایا کہ ہم بھی پہلے اسی طرح کرتے تھے ۔ لیکن بعد میں اس سے روک دئیے گئے اور حکم ہوا کہ ہم اپنے ہاتھوں کو گھٹنوں پر رکھیں ۔",
                "urduNarrator": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ابویعفور اکبر سے ، انہوں نے بیان کیا کہ میں نے مصعب بن سعد سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي يَعْفُورٍ، قَالَ سَمِعْتُ مُصْعَبَ بْنَ سَعْدٍ، يَقُولُ صَلَّيْتُ إِلَى جَنْبِ أَبِي فَطَبَّقْتُ بَيْنَ كَفَّىَّ ثُمَّ وَضَعْتُهُمَا بَيْنَ فَخِذَىَّ، فَنَهَانِي أَبِي وَقَالَ كُنَّا نَفْعَلُهُ فَنُهِينَا عَنْهُ، وَأُمِرْنَا أَنْ نَضَعَ أَيْدِيَنَا عَلَى الرُّكَبِ‏.‏",
                "headingArabic": "وَضْعِ الأَكُفِّ عَلَى الرُّكَبِ فِي الرُّكُوعِ",
                "headingUrdu": "رکوع کرتے وقت دونوں ہاتھ (ہتھیلیوں) کو دونوں گھٹنوں پر رکھنا۔",
                "headingEnglish": "To put the hands (palms) on both knees while bowing.",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 771,
                "hadithNumber": "791",
                "englishNarrator": "Narrated Zaid bin Wahb:",
                "hadithEnglish": "Hudhaifa رضی اللہ عنہ saw a person who was not performing the bowing and prostration perfectly. He said to him, \"You have not prayed and if you should die you would die on a religion other than that of Muhammad (ﷺ) .\"",
                "hadithUrdu": "حذیفہ بن یمان رضی اللہ عنہ نے ایک شخص کو دیکھا کہ نہ رکوع پوری طرح کرتا ہے نہ سجدہ ۔ اس لیے آپ نے اس سے کہا کہ تم نے نماز ہی نہیں پڑھی اور اگر تم مر گئے تو تمہاری موت اس سنت پر نہیں ہو گی جس پر اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم کو پیدا کیا تھا ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، سلیمان بن اعمش کے واسطہ سے کہا میں نے زید بن وہب سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، قَالَ سَمِعْتُ زَيْدَ بْنَ وَهْبٍ، قَالَ رَأَى حُذَيْفَةُ رَجُلاً لاَ يُتِمُّ الرُّكُوعَ وَالسُّجُودَ قَالَ مَا صَلَّيْتَ، وَلَوْ مُتَّ مُتَّ عَلَى غَيْرِ الْفِطْرَةِ الَّتِي فَطَرَ اللَّهُ مُحَمَّدًا صلى الله عليه وسلم‏.‏",
                "headingArabic": "إِذَا لَمْ يُتِمَّ الرُّكُوعَ",
                "headingUrdu": "رکوع بالکل ٹھیک نہ کرنا",
                "headingEnglish": "Not performing bowing perfectly",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 772,
                "hadithNumber": "792",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "The bowing, the prostration the sitting in between the two prostrations and the standing after the bowing of the Prophet (ﷺ) but not qiyam (standing in the prayer) and qu`ud (sitting in the prayer) used to be approximately equal (in duration).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے رکوع و سجود ، دونوں سجدوں کے درمیان کا وقفہ اور جب رکوع سے سر اٹھاتے تو تقریباً سب برابر تھے ۔ سوا قیام اور تشہد کے قعود کے ۔",
                "urduNarrator": "ہم سے بدل بن محبر نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، انہوں نے کہا کہ مجھے حکم نے ابن ابی لیلیٰ سے خبر دی ، انہوں نے براء بن عازب رضی اللہ عنہ سے ، انہوں نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي الْحَكَمُ، عَنِ ابْنِ أَبِي لَيْلَى، عَنِ الْبَرَاءِ، قَالَ كَانَ رُكُوعُ النَّبِيِّ صلى الله عليه وسلم وَسُجُودُهُ وَبَيْنَ السَّجْدَتَيْنِ وَإِذَا رَفَعَ مِنَ الرُّكُوعِ، مَا خَلاَ الْقِيَامَ وَالْقُعُودَ، قَرِيبًا مِنَ السَّوَاءِ‏.‏",
                "headingArabic": "حَدِّ إِتْمَامِ الرُّكُوعِ وَالاِعْتِدَالِ فِيهِ وَالاِطْمَأْنِينَةِ",
                "headingUrdu": "اور رکوع کے مکمل ہونے کی حد اور پیٹھ سیدھی رکھنے کے بارے میں کیا کہا جاتا ہے اور جس سکون کے ساتھ کیا جاتا ہے؟",
                "headingEnglish": "And what is said regarding the limit of the completion of bowing and of keeping the back straight and the calmness with which it is performed.",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 773,
                "hadithNumber": "793",
                "englishNarrator": "Narrated Abu Huraira  رضی اللہ عنہ :",
                "hadithEnglish": "Once the Prophet (ﷺ) entered the mosque, a man came in, offered the prayer and greeted the Prophet. The Prophet returned his greeting and said to him, \"Go back and pray again for you have not prayed.\" The man offered the prayer again, came back and greeted the Prophet. He said to him thrice, \"Go back and pray again for you have not prayed.\" The man said, \"By Him Who has sent you with the truth! I do not know a better way of praying. Kindly teach Me how to pray.\" He said, \"When you stand for the prayer, say Takbir and then recite from the Qur'an what you know and then bow with calmness till you feel at ease, then rise from bowing till you stand straight. Afterwards prostrate calmly till you feel at ease and then raise (your head) and sit with Calmness till you feel at ease and then prostrate with calmness till you feel at ease in prostration and do the same in the whole of your prayer.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم مسجد میں تشریف لے گئے ۔ اتنے میں ایک شخص آیا اور نماز پڑھنے لگا ۔ نماز کے بعد اس نے آ کر نبی کریم صلی اللہ علیہ وسلم کو سلام کیا ۔ آپ صلی اللہ علیہ وسلم نے سلام کا جواب دے کر فرمایا کہ واپس جا کر دوبارہ نماز پڑھ ، کیونکہ تو نے نماز نہیں پڑھی ۔ چنانچہ اس نے دوبارہ نماز پڑھی اور واپس آ کر پھر آپ صلی اللہ علیہ وسلم کو سلام کیا ، آپ نے اس مرتبہ بھی یہی فرمایا کہ دوبارہ جا کر نماز پڑھ ، کیونکہ تو نے نماز نہیں پڑھی ۔ تین بار اسی طرح ہوا ۔ آخر اس شخص نے کہا کہ اس ذات کی قسم ! جس نے آپ کو مبعوث کیا ۔ میں تو اس سے اچھی نماز نہیں پڑھ سکتا ۔ اس لیے آپ مجھے سکھلائیے ۔ آپ نے فرمایا جب تو نماز کے لیے کھڑا ہو تو ( پہلے ) تکبیر کہہ پھر قرآن مجید سے جو کچھ تجھ سے ہو سکے پڑھ ، اس کے بعد رکوع کر اور پوری طرح رکوع میں چلا جا ۔ پھر سر اٹھا اور پوری طرح کھڑا ہو جا ۔ پھر جب تو سجدہ کرے تو پوری طرح سجدہ میں چلا جا ۔ پھر ( سجدہ سے ) سر اٹھا کر اچھی طرح بیٹھ جا ۔ دوبارہ بھی اسی طرح سجدہ کر ۔ یہی طریقہ نماز کے تمام ( رکعتوں میں ) اختیار کر ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے عبیداللہ عمری سے بیان کیا ، انہوں نے کہا کہ مجھ سے سعید بن ابی سعید مقبری نے اپنے والد سے بیان کیا ، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ الْمَسْجِدَ فَدَخَلَ رَجُلٌ فَصَلَّى ثُمَّ جَاءَ فَسَلَّمَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَرَدَّ النَّبِيُّ صلى الله عليه وسلم عَلَيْهِ السَّلاَمَ فَقَالَ ‏\"‏ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏ فَصَلَّى، ثُمَّ جَاءَ فَسَلَّمَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏‏.‏ ثَلاَثًا‏.‏ فَقَالَ وَالَّذِي بَعَثَكَ بِالْحَقِّ فَمَا أُحْسِنُ غَيْرَهُ فَعَلِّمْنِي‏.‏ قَالَ ‏\"‏ إِذَا قُمْتَ إِلَى الصَّلاَةِ فَكَبِّرْ، ثُمَّ اقْرَأْ مَا تَيَسَّرَ مَعَكَ مِنَ الْقُرْآنِ، ثُمَّ ارْكَعْ حَتَّى تَطْمَئِنَّ رَاكِعًا، ثُمَّ ارْفَعْ حَتَّى تَعْتَدِلَ قَائِمًا، ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا، ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ جَالِسًا، ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا، ثُمَّ افْعَلْ ذَلِكَ فِي صَلاَتِكَ كُلِّهَا ‏\"‏‏.‏",
                "headingArabic": "أَمْرِ النَّبِيِّ صلى الله عليه وسلم الَّذِي لاَ يُتِمُّ رُكُوعَهُ بِالإِعَادَةِ",
                "headingUrdu": "جس شخص نے اپنا رکوع ٹھیک نہ کیا ہو اس کے لیے رسول اللہ صلی اللہ علیہ وسلم کا حکم ہے کہ وہ اپنی نماز کو دوبارہ پڑھے۔",
                "headingEnglish": "The order of the Prophet (pbuh) to a person who did not perform his bowing perfectly that he should repeat his Salat (prayer)",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 774,
                "hadithNumber": "794",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) used to say in his bowing and prostrations, \"Subhanaka l-lahumma Rabbana wa bihamdika; Allahumma ghfir li.' (Exalted [from unbecoming attributes] Are you O Allah our Lord, and by Your praise [do I exalt you]. O Allah! Forgive me).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم رکوع اور سجدہ میں «سبحانك اللهم ربنا وبحمدك ،‏‏‏‏ اللهم اغفر لي» پڑھا کرتے تھے ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، انہوں نے کہا منصور بن معتمر نے بیان کیا ، انہوں نے ابوالضحیٰ مسلم بن صبیح سے ، انہوں نے مسروق سے ، انہوں نے عائشہ رضی اللہ عنہا سے ، انہوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ فِي رُكُوعِهِ وَسُجُودِهِ ‏ \"‏ سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي ‏\"‏‏.‏",
                "headingArabic": "الدُّعَاءِ فِي الرُّكُوعِ",
                "headingUrdu": "رکوع میں دعا۔",
                "headingEnglish": "Invocation in bowing.",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 775,
                "hadithNumber": "795",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "When the Prophet (ﷺ) said, \"Sami`a l-lahu liman hamidah,\" (Allah heard those who sent praises to Him), he would say, \"Rabbana wa laka l-hamd.\" On bowing and raising his head from it the Prophet (ﷺ) used to say Takbir. He also used to say Takbir on rising after the two prostrations. (See Hadith No. 656).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب «سمع الله لمن حمده» کہتے تو اس کے بعد «اللهم ربنا ولك الحمد» بھی کہتے ۔ اسی طرح جب آپ صلی اللہ علیہ وسلم رکوع کرتے اور سر اٹھاتے تو تکبیر کہتے ۔ دونوں سجدوں سے کھڑے ہوتے وقت بھی آپ صلی اللہ علیہ وسلم «الله أكبر» کہا کرتے تھے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا کہ ہم سے ابن ابی ذئب نے بیان کیا ، انہوں نے سعید مقبری سے بیان کیا ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَالَ ‏\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏\"‏‏.‏ قَالَ ‏\"‏ اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ ‏\"‏‏.‏ وَكَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ يُكَبِّرُ، وَإِذَا قَامَ مِنَ السَّجْدَتَيْنِ قَالَ ‏\"‏ اللَّهُ أَكْبَرُ ‏\"‏‏.‏",
                "headingArabic": "مَا يَقُولُ الإِمَامُ وَمَنْ خَلْفَهُ إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ",
                "headingUrdu": "رکوع سے سر اٹھانے پر امام اور مقلدین کیا کہتے ہیں؟",
                "headingEnglish": "What the Imam and the followers say on raising their heads from bowing.",
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 751,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=30",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=28",
                "label": "28",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=29",
                "label": "29",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=30",
                "label": "30",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=31",
                "label": "31",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=32",
                "label": "32",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=33",
                "label": "33",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=34",
                "label": "34",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=32",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=32",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=30",
        "to": 775,
        "total": 40465
    }
}