{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 289,
        "data": [
            {
                "id": 7206,
                "hadithNumber": "7517",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The night Allah's Messenger (ﷺ) was taken for a journey from the sacred mosque (of Mecca) Al-Ka`ba: Three persons came to him (in a dreamy while he was sleeping in the Sacred Mosque before the Divine Inspiration was revealed to Him. One of them said, \"Which of them is he?\" The middle (second) angel said, \"He is the best of them.\" The last (third) angle said, \"Take the best of them.\" Only that much happened on that night and he did not see them till they came on another night, i.e. after The Divine Inspiration was revealed to him. (Fath-ul-Bari Page 258, Vol. 17) and he saw them, his eyes were asleep but his heart was not----and so is the case with the prophets: their eyes sleep while their hearts do not sleep. So those angels did not talk to him till they carried him and placed him beside the well of Zamzam. From among them Gabriel took charge of him. Gabriel cut open (the part of his body) between his throat and the middle of his chest (heart) and took all the material out of his chest and `Abdomen and then washed it with Zamzam water with his own hands till he cleansed the inside of his body, and then a gold tray containing a gold bowl full of belief and wisdom was brought and then Gabriel stuffed his chest and throat blood vessels with it and then closed it (the chest). He then ascended with him to the heaven of the world and knocked on one of its doors. The dwellers of the Heaven asked, 'Who is it?' He said, \"Gabriel.\" They said, \"Who is accompanying you?\" He said, \"Muhammad.\" They said, \"Has he been called?\" He said, \"Yes\" They said, \"He is welcomed.\" So the dwellers of the Heaven became pleased with his arrival, and they did not know what Allah would do to the Prophet (ﷺ) on earth unless Allah informed them. The Prophet (ﷺ) met Adam over the nearest Heaven. Gabriel said to the Prophet, \"He is your father; greet him.\" The Prophet (ﷺ) greeted him and Adam returned his greeting and said, \"Welcome, O my Son! O what a good son you are!\" Behold, he saw two flowing rivers, while he was in the nearest sky. He asked, \"What are these two rivers, O Gabriel?\" Gabriel said, \"These are the sources of the Nile and the Euphrates.\" Then Gabriel took him around that Heaven and behold, he saw another river at the bank of which there was a palace built of pearls and emerald. He put his hand into the river and found its mud like musk Adhfar. He asked, \"What is this, O Gabriel?\" Gabriel said, \"This is the Kauthar which your Lord has kept for you.\" Then Gabriel ascended (with him) to the second Heaven and the angels asked the same questions as those on the first Heaven, i.e., \"Who is it?\" Gabriel replied, \"Gabriel\". They asked, \"Who is accompanying you?\" He said, \"Muhammad.\" They asked, \"Has he been sent for?\" He said, \"Yes.\" Then they said, \"He is welcomed.'' Then he (Gabriel) ascended with the Prophet (ﷺ) to the third Heaven, and the angels said the same as the angels of the first and the second Heavens had said. Then he ascended with him to the fourth Heaven and they said the same; and then he ascended with him to the fifth Heaven and they said the same; and then he ascended with him to the sixth Heaven and they said the same; then he ascended with him to the seventh Heaven and they said the same. On each Heaven there were prophets whose names he had mentioned and of whom I remember Idris on the second Heaven, Aaron on the fourth Heavens another prophet whose name I don't remember, on the fifth Heaven, Abraham on the sixth Heaven, and Moses on the seventh Heaven because of his privilege of talking to Allah directly. Moses said (to Allah), \"O Lord! I thought that none would be raised up above me.\" But Gabriel ascended with him (the Prophet) for a distance above that, the distance of which only Allah knows, till he reached the Lote Tree (beyond which none may pass) and then the Irresistible, the Lord of Honor and Majesty approached and came closer till he (Gabriel) was about two bow lengths or (even) nearer. (It is said that it was Gabriel who approached and came closer to the Prophet. (Fate Al-Bari Page 263, 264, Vol. 17). Among the things which Allah revealed to him then, was: \"Fifty prayers were enjoined on his followers in a day and a night.\" Then the Prophet (ﷺ) descended till he met Moses, and then Moses stopped him and asked, \"O Muhammad ! What did your Lord en join upon you?\" The Prophet (ﷺ) replied,\" He enjoined upon me to perform fifty prayers in a day and a night.\" Moses said, \"Your followers cannot do that; Go back so that your Lord may reduce it for you and for them.\" So the Prophet (ﷺ) turned to Gabriel as if he wanted to consult him about that issue. Gabriel told him of his opinion, saying, \"Yes, if you wish.\" So Gabriel ascended with him to the Irresistible and said while he was in his place, \"O Lord, please lighten our burden as my followers cannot do that.\" So Allah deducted for him ten prayers where upon he returned to Moses who stopped him again and kept on sending him back to his Lord till the enjoined prayers were reduced to only five prayers. Then Moses stopped him when the prayers had been reduced to five and said, \"O Muhammad! By Allah, I tried to persuade my nation, Bani Israel to do less than this, but they could not do it and gave it up. However, your followers are weaker in body, heart, sight and hearing, so return to your Lord so that He may lighten your burden.\" The Prophet (ﷺ) turned towards Gabriel for advice and Gabriel did not disapprove of that. So he ascended with him for the fifth time. The Prophet (ﷺ) said, \"O Lord, my followers are weak in their bodies, hearts, hearing and constitution, so lighten our burden.\" On that the Irresistible said, \"O Muhammad!\" the Prophet replied, \"Labbaik and Sa`daik.\" Allah said, \"The Word that comes from Me does not change, so it will be as I enjoined on you in the Mother of the Book.\" Allah added, \"Every good deed will be rewarded as ten times so it is fifty (prayers) in the Mother of the Book (in reward) but you are to perform only five (in practice).\" The Prophet (ﷺ) returned to Moses who asked, \"What have you done?\" He said, \"He has lightened our burden: He has given us for every good deed a tenfold reward.\" Moses said, \"By Allah! I tried to make Bani Israel observe less than that, but they gave it up. So go back to your Lord that He may lighten your burden further.\" Allah's Messenger (ﷺ) said, \"O Moses! By Allah, I feel shy of returning too many times to my Lord.\" On that Gabriel said, \"Descend in Allah's Name.\" The Prophet (ﷺ) then woke while he was in the Sacred Mosque (at Mecca). The transmitter says: When he ﷺ arose, he was in Masjid-e-Haram.",
                "hadithUrdu": "جس رات رسول اللہ صلی اللہ علیہ وسلم کو مسجد کعبہ سے معراج کے لیے لے جایا گیا کہ وحی آنے سے پہلے آپ کے پاس فرشتے آئے ۔ آنحضرت صلی اللہ علیہ وسلم مسجدالحرام میں سوئے ہوئے تھے ۔ ان میں سے ایک نے پوچھا کہ وہ کون ہیں ؟ دوسرے نے جواب دیا کہ وہ ان میں سب سے بہتر ہیں تیسرے نے کہا کہ ان میں جو سب سے بہتر ہیں انہیں لے لو ۔ اس رات کو بس اتنا ہی واقعہ پیش آیا اور آنحضرت صلی اللہ علیہ وسلم نے اس کے بعد انہیں نہیں دیکھا ۔ یہاں تک کہ وہ دوسری رات آئے جب کہ آپ کا دل دیکھ رہا تھا اور آپ کی آنکھیں سو رہی تھیں ۔ لیکن دل نہیں سو رہا تھا ۔ انبیاء کا یہی حال ہوتا ہے ۔ ان کی آنکھیں سوتی ہیں لیکن ان کے دل نہیں سوتے ۔ چنانچہ انہوں نے آپ سے بات نہیں کی ۔ بلکہ آپ کو اٹھا کر زمزم کے کنویں کے پاس لائے ۔ یہاں جبرائیل علیہ السلام نے آپ کا کام سنبھا لا اور آپ کے گلے سے دل کے نیچے تک سینہ چاک کیا اور سینے اور پیٹ کو پاک کر کے زمزم کے پانی سے اسے اپنے ہاتھ سے دھویا یہاں تک کہ آپ کا پیٹ صاف ہو گیا ۔ پھر آپ کے پا سونے کا طشت لایا گیا جس میں سونے کا ایک برتن ایمان وحکمت سے بھرا ہوا تھا ۔ اس سے آپ کے سینے اور حلق کی رگوں کو سیا اور اسے برابر کر دیا ۔ پھر آپ کو لے کر آسمان دنیا پر چڑھے اور اس کے دروازوں میں سے ایک دروازے پر دستک دی ۔ آسمان والوں نے ان سے پوچھا آپ کون ہیں ؟ انہوں نے کہا کہ جبرائیل انہوں نے پوچھا اور آپ کے ساتھ کون ہے ؟ جواب دیا کہ میرے ساتھ محمد صلی اللہ علیہ وسلم ہیں ۔ پوچھا کیا انہیں بلایا گیا ہے ؟ جواب دیا کہ ہاں ۔ آسمان والوں نے کہا خوب اچھے آئے اور اپنے ہی لوگوں میں آئے ہو ۔ آسمان والے اس سے خوش ہوئے ۔ ان میں سے کسی کو معلوم نہیں ہوتا کہ اللہ تعالیٰ زمین میں کیا کرنا چاہتا ہے جب تک وہ انہیں بتا نہ دے ۔ آنحضرت صلی اللہ علیہ وسلم نے آسمان دنیا پر آدم علیہ السلام کو پایا ۔ جبرائیل علیہ السلام نے آپ سے کہا کہ یہ آپ کے بزرگ ترین دادا آدم ہیں آپ انہیں سلام کیجئے ۔ آدم علیہ السلام نے سلام کا جواب دیا ۔ کہا کہ خوب اچھے آئے اور اپنے ہی لوگوں میں آئے ہو ۔ مبارک ہو اپنے بیٹے کو ‘ آپ کیا ہی اچھے بیٹے ہیں ۔ آپ نے آسمان دنیا میں دو نہریں دیکھیں جو بہہ رہی تھیں ۔ پوچھا اے جبرائیل ! یہ نہریں کیسی ہیں ؟ جبرائیل علیہ السلام نے جواب دیا کہ یہ نیل اور فرات کا منبع ہے ۔ پھر آپ آسمان پر اور چلے تو دیکھا کہ ایک دوسری نہر ہے جس کے اوپر موتی اور زبر جد کا محل ہے ۔ اس پر اپنا ہاتھ مارا تو وہ مشک ہے ۔ پوچھا جبرائیل ! یہ کیا ہے ؟ جواب دیا کہ یہ کوثر ہے جسے اللہ نے آپ کے لیے محفوظ رکھا ہے ۔ پھر آپ دوسرے آسمان پر چڑھے ۔ فرشتوں نے یہاں بھی وہی سوال کیا جو پہلے آسمان پر کیا تھا ۔ کون ہیں ؟ کہا جریل ۔ پوچھا آپ کے ساتھ کون ہیں ؟ کہا محمد صلی اللہ علیہ وسلم ۔ پوچھا کیا انہیں بلایا گیا ہے ؟ انہوں نے کہا کہ ہاں ۔ فرشتے بولے انہیں مرحبا اور بشارت ہو ۔ پھر آپ کو لے کر تیسرے آسمان پر چڑھے اور یہاں بھی وہی سوال کیا جو پہلے اور دوسرے آسمان پر کیا تھا ۔ پھر چوتھے آسمان پر لے کر چڑھے اور یہاں بھی وہی سوال کیا ۔ پھر پانچویں آسمان پر آپ کو لے کر چڑھے اور یہاں بھی وہی سوال کیا پھر چھٹے آسمان پر آپ کو لے کر چڑھے اور یہاں بھی وہی سوال کیا ۔ پھر آپ کو لے کر ساتویں آسمان پر چڑھے اور یہاں بھی وہی سوال کیا ۔ ہر آسمان پر انبیاء ہیں جن کے نام آپ نے لیے ۔ مجھے یہ یاد ہے کہ ادریس علیہ السلام دوسرے آسمان پر ‘ ہارون علیہ السلام چوتھے آسمان پر ‘ اور دوسرے نبی پانچویں آسمان پر ۔ جن کے نام مجھے یاد نہیں اور ابراہیم علیہ السلام چھٹے آسمان پر اور موسیٰ علیہ السلام ساتویں آسمان پر ۔ یہ انہیں اللہ تعالیٰ نے شرف ہم کلامی کی وجہ سے فضیلت ملی تھی ۔ موسیٰ علیہ السلام نے کہا میرے رب ! میرا خیال نہیں تھا کہ کسی کو مجھ سے بڑھایا جائے گا ۔ پھر جبرائیل علیہ السلام انہیں لے کر اس سے بھی اوپر گئے جس کا علم اللہ کے سوا اور کسی کو نہیں یہاں تک کہ آپ کو سدرۃالمنتہیٰ پر لے کر آئے اور رب العزت تبارک وتعالیٰ سے قریب ہوئے اور اتنے قریب جیسے کمان کے دونوں کنارے یا اس سے بھی قریب ۔ پھر اللہ نے اور دوسری باتوں کے ساتھ آپ کی امت پر دن اور رات میں پچاس نمازوں کی وحی کی ۔ پھر آپ اترے اور جب موسیٰ علیہ السلام کے پاس پہنچے تو انہوں نے آپ کو روک لیا اور پوچھا اے محمد صلی اللہ علیہ وسلم ! آپ کے رب نے آپ سے کیا عہد لیا ہے ؟ فرمایا کہ میرے رب نے مجھ سے دن اور رات میں پچاس نمازوں کا عہد لیا ہے ۔ موسیٰ علیہ السلام نے فرمایا کہ آپ کی امت میں اس کی طاقت نہیں ۔ واپس جائیے اور اپنی اور اپنی امت کی طرف سے کمی کی درخواست کیجئے ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم جبرائیل علیہ السلام کی طرف متوجہ ہوئے اور انہوں نے بھی اشارہ کیا کہ ہاں اگر چاہیں تو بہتر ہے ۔ چنانچہ آپ پھر انہیں لے کر اللہ تعالیٰ کی بار گاہ میں حاضر ہوئے اور اپنے مقام پر کھڑے ہو کر عرض کیا اے رب ! ہم سے کمی کر دے کیونکہ میری امت اس کی طاقت نہیں رکھتی ۔ چنانچہ اللہ تعالیٰ نے دس نمازوں کی کمی کر دی ۔ پھر آپ موسیٰ علیہ السلام کے پاس آئے تو انہوں نے آپ کو روکا ۔ موسیٰ علیہ السلام آپ کو اسی طرح برابر اللہ رب العزت کے پاس واپس کرتے رہے ۔ یہاں تک کہ پانچ نمازیں ہو گئیں ۔ پانچ نمازوں پر بھی انہوں نے آنحضرت صلی اللہ علیہ وسلم کو روکا اور کہا اے محمد صلی اللہ علیہ وسلم میں نے اپنی قوم بنی اسرائیل کا تجرہ بہ اس سے کم پر کیا ہے وہ ناتواں ثابت ہوئے اور انہوں نے چھوڑ دیا ۔ آپ کی امت تو جسم ‘ دل ‘ بدن ‘ نظر اور کان ہر اعتبار سے کمزور ہے ‘ آپ واپس جائیے اور اللہ رب العزت اس میں بھی کمی کر دے گا ۔ ہر مرتبہ آنحضرت صلی اللہ علیہ وسلم جبرائیل علیہ السلام کی طرف متوجہ ہوتے تھے تاکہ ان سے مشورہ لیں اور جبرائیل علیہ السلام اسے ناپسند نہیں کرتے تھے ۔ جب وہ آپ کو پانچویں مرتبہ بھی لے گئے تو عرض کیا ۔ اے میر رب ! میری امت جسم ‘ دل ‘ نگاہ اور بند ہر حیثیت سے کمزور ہے ‘ پس ہم سے اور کمی کر دے ۔ اللہ تعالیٰ نے اس پر فرمایا کہ وہ قول میرے یہاں بدلا نہیں جاتا جیسا کہ میں نے تم پر ام الکتاب میں فرض کیا ہے ۔ اور فرمایا کہ ہر نیکی کا ثواب دس گنا ہ ہے پس یہ ام الکتاب میں پچاس نمازیں ہیں لیکن تم پر فرض پانچ ہی ہیں ۔ چنانچہ آپ موسیٰ علیہ السلام کے پاس واپس آئے اور انہوں نے پوچھا کیا ہوا ؟ آپ نے کہا کہ ہم سے یہ تخفیف کی کہ ہر نیکی کے بدلے دس کا ثواب ملے گا ۔ موسیٰ علیہ السلام نے کہا کہ میں نے بنی اسرائیل کو اس سے کم پر آزمایا ہے اور انہوں نے چھوڑ دیا ۔ پس آپ واپس جائیے اور مزید کمی کرائیے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر کہا اے موسیٰ ! واللہ مجھے اپنے رب سے اب شرم آتی ہے کیونکہ باربار آ جا چکا ہوں ۔ انہوں نے کہا کہ پھر اللہ کا نام لے کر اتر جاؤ ۔ پھر جب آپ بیدار ہوئے تو مسجدالحرام میں تھے ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم مسجدالحرام ہی میں تھے کہ جا اٹھے جاگ اٹھنے سے یہ مراد ہے کہ وہ حالت معراج کی جاتی رہی اور آپ اپنی حالت میں آ گئے ۔",
                "urduNarrator": "ہم سے عبد العزیز بن عبداللہ اویسی نے بیان کیا ‘ انہوں نے کہا مجھ سے سلیمان بن بلال نے بیان کیا ‘ ان سے شریک بن عبداللہ بن ابی نے بیان کیا ‘ انہوں نے بیان کیا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا ‘ انہوں نے وہ واقعہ بیان کیا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنِي سُلَيْمَانُ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ قَالَ سَمِعْتُ ابْنَ مَالِكٍ، يَقُولُ لَيْلَةَ أُسْرِيَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ مَسْجِدِ الْكَعْبَةِ أَنَّهُ جَاءَهُ ثَلاَثَةُ نَفَرٍ قَبْلَ أَنْ يُوحَى إِلَيْهِ وَهْوَ نَائِمٌ فِي الْمَسْجِدِ الْحَرَامِ، فَقَالَ أَوَّلُهُمْ أَيُّهُمْ هُوَ فَقَالَ أَوْسَطُهُمْ هُوَ خَيْرُهُمْ‏.‏ فَقَالَ آخِرُهُمْ خُذُوا خَيْرَهُمْ‏.‏ فَكَانَتْ تِلْكَ اللَّيْلَةَ، فَلَمْ يَرَهُمْ حَتَّى أَتَوْهُ لَيْلَةً أُخْرَى فِيمَا يَرَى قَلْبُهُ، وَتَنَامُ عَيْنُهُ وَلاَ يَنَامُ قَلْبُهُ وَكَذَلِكَ الأَنْبِيَاءُ تَنَامُ أَعْيُنُهُمْ وَلاَ تَنَامُ قُلُوبُهُمْ، فَلَمْ يُكَلِّمُوهُ حَتَّى احْتَمَلُوهُ فَوَضَعُوهُ عِنْدَ بِئْرِ زَمْزَمَ فَتَوَلاَّهُ مِنْهُمْ جِبْرِيلُ فَشَقَّ جِبْرِيلُ مَا بَيْنَ نَحْرِهِ إِلَى لَبَّتِهِ حَتَّى فَرَغَ مِنْ صَدْرِهِ وَجَوْفِهِ، فَغَسَلَهُ مِنْ مَاءِ زَمْزَمَ بِيَدِهِ، حَتَّى أَنْقَى جَوْفَهُ، ثُمَّ أُتِيَ بِطَسْتٍ مِنْ ذَهَبٍ فِيهِ تَوْرٌ مِنْ ذَهَبٍ مَحْشُوًّا إِيمَانًا وَحِكْمَةً، فَحَشَا بِهِ صَدْرَهُ وَلَغَادِيدَهُ ـ يَعْنِي عُرُوقَ حَلْقِهِ ـ ثُمَّ أَطْبَقَهُ ثُمَّ عَرَجَ بِهِ إِلَى السَّمَاءِ الدُّنْيَا فَضَرَبَ بَابًا مِنْ أَبْوَابِهَا فَنَادَاهُ أَهْلُ السَّمَاءِ مَنْ هَذَا فَقَالَ جِبْرِيلُ‏.‏ قَالُوا وَمَنْ مَعَكَ قَالَ مَعِي مُحَمَّدٌ‏.‏ قَالَ وَقَدْ بُعِثَ قَالَ نَعَمْ‏.‏ قَالُوا فَمَرْحَبًا بِهِ وَأَهْلاً‏.‏ فَيَسْتَبْشِرُ بِهِ أَهْلُ السَّمَاءِ، لاَ يَعْلَمُ أَهْلُ السَّمَاءِ بِمَا يُرِيدُ اللَّهُ بِهِ فِي الأَرْضِ حَتَّى يُعْلِمَهُمْ، فَوَجَدَ فِي السَّمَاءِ الدُّنْيَا آدَمَ فَقَالَ لَهُ جِبْرِيلُ هَذَا أَبُوكَ فَسَلِّمْ عَلَيْهِ‏.‏ فَسَلَّمَ عَلَيْهِ وَرَدَّ عَلَيْهِ آدَمُ وَقَالَ مَرْحَبًا وَأَهْلاً بِابْنِي، نِعْمَ الاِبْنُ أَنْتَ‏.‏ فَإِذَا هُوَ فِي السَّمَاءِ الدُّنْيَا بِنَهَرَيْنِ يَطَّرِدَانِ فَقَالَ مَا هَذَانِ النَّهَرَانِ يَا جِبْرِيلُ قَالَ هَذَا النِّيلُ وَالْفُرَاتُ عُنْصُرُهُمَا‏.‏ ثُمَّ مَضَى بِهِ فِي السَّمَاءِ فَإِذَا هُوَ بِنَهَرٍ آخَرَ عَلَيْهِ قَصْرٌ مِنْ لُؤْلُؤٍ وَزَبَرْجَدٍ فَضَرَبَ يَدَهُ فَإِذَا هُوَ مِسْكٌ قَالَ مَا هَذَا يَا جِبْرِيلُ قَالَ هَذَا الْكَوْثَرُ الَّذِي خَبَأَ لَكَ رَبُّكَ‏.‏ ثُمَّ عَرَجَ إِلَى السَّمَاءِ الثَّانِيَةِ فَقَالَتِ الْمَلاَئِكَةُ لَهُ مِثْلَ مَا قَالَتْ لَهُ الأُولَى مَنْ هَذَا قَالَ جِبْرِيلُ‏.‏ قَالُوا وَمَنْ مَعَكَ قَالَ مُحَمَّدٌ صلى الله عليه وسلم‏.‏ قَالُوا وَقَدْ بُعِثَ إِلَيْهِ قَالَ نَعَمْ‏.‏ قَالُوا مَرْحَبًا بِهِ وَأَهْلاً‏.‏ ثُمَّ عَرَجَ بِهِ إِلَى السَّمَاءِ الثَّالِثَةِ وَقَالُوا لَهُ مِثْلَ مَا قَالَتِ الأُولَى وَالثَّانِيَةُ، ثُمَّ عَرَجَ بِهِ إِلَى الرَّابِعَةِ فَقَالُوا لَهُ مِثْلَ ذَلِكَ، ثُمَّ عَرَجَ بِهِ إِلَى السَّمَاءِ الْخَامِسَةِ فَقَالُوا مِثْلَ ذَلِكَ، ثُمَّ عَرَجَ بِهِ إِلَى السَّمَاءِ السَّادِسَةِ فَقَالُوا لَهُ مِثْلَ ذَلِكَ، ثُمَّ عَرَجَ بِهِ إِلَى السَّمَاءِ السَّابِعَةِ فَقَالُوا لَهُ مِثْلَ ذَلِكَ، كُلُّ سَمَاءٍ فِيهَا أَنْبِيَاءُ قَدْ سَمَّاهُمْ فَأَوْعَيْتُ مِنْهُمْ إِدْرِيسَ فِي الثَّانِيَةِ، وَهَارُونَ فِي الرَّابِعَةِ، وَآخَرَ فِي الْخَامِسَةِ لَمْ أَحْفَظِ اسْمَهُ، وَإِبْرَاهِيمَ فِي السَّادِسَةِ، وَمُوسَى فِي السَّابِعَةِ بِتَفْضِيلِ كَلاَمِ اللَّهِ، فَقَالَ مُوسَى رَبِّ لَمْ أَظُنَّ أَنْ يُرْفَعَ عَلَىَّ أَحَدٌ‏.‏ ثُمَّ عَلاَ بِهِ فَوْقَ ذَلِكَ بِمَا لاَ يَعْلَمُهُ إِلاَّ اللَّهُ، حَتَّى جَاءَ سِدْرَةَ الْمُنْتَهَى وَدَنَا الْجَبَّارُ رَبُّ الْعِزَّةِ فَتَدَلَّى حَتَّى كَانَ مِنْهُ قَابَ قَوْسَيْنِ أَوْ أَدْنَى فَأَوْحَى اللَّهُ فِيمَا أَوْحَى إِلَيْهِ خَمْسِينَ صَلاَةً عَلَى أُمَّتِكَ كُلَّ يَوْمٍ وَلَيْلَةٍ‏.‏ ثُمَّ هَبَطَ حَتَّى بَلَغَ مُوسَى فَاحْتَبَسَهُ مُوسَى فَقَالَ يَا مُحَمَّدُ مَاذَا عَهِدَ إِلَيْكَ رَبُّكَ قَالَ عَهِدَ إِلَىَّ خَمْسِينَ صَلاَةً كُلَّ يَوْمٍ وَلَيْلَةٍ‏.‏ قَالَ إِنَّ أُمَّتَكَ لاَ تَسْتَطِيعُ ذَلِكَ فَارْجِعْ فَلْيُخَفِّفْ عَنْكَ رَبُّكَ وَعَنْهُمْ‏.‏ فَالْتَفَتَ النَّبِيُّ صلى الله عليه وسلم إِلَى جِبْرِيلَ كَأَنَّهُ يَسْتَشِيرُهُ فِي ذَلِكَ، فَأَشَارَ إِلَيْهِ جِبْرِيلُ أَنْ نَعَمْ إِنْ شِئْتَ‏.‏ فَعَلاَ بِهِ إِلَى الْجَبَّارِ فَقَالَ وَهْوَ مَكَانَهُ يَا رَبِّ خَفِّفْ عَنَّا، فَإِنَّ أُمَّتِي لاَ تَسْتَطِيعُ هَذَا‏.‏ فَوَضَعَ عَنْهُ عَشْرَ صَلَوَاتٍ ثُمَّ رَجَعَ إِلَى مُوسَى فَاحْتَبَسَهُ، فَلَمْ يَزَلْ يُرَدِّدُهُ مُوسَى إِلَى رَبِّهِ حَتَّى صَارَتْ إِلَى خَمْسِ صَلَوَاتٍ، ثُمَّ احْتَبَسَهُ مُوسَى عِنْدَ الْخَمْسِ فَقَالَ يَا مُحَمَّدُ وَاللَّهِ لَقَدْ رَاوَدْتُ بَنِي إِسْرَائِيلَ قَوْمِي عَلَى أَدْنَى مِنْ هَذَا فَضَعُفُوا فَتَرَكُوهُ فَأُمَّتُكَ أَضْعَفُ أَجْسَادًا وَقُلُوبًا وَأَبْدَانًا وَأَبْصَارًا وَأَسْمَاعًا، فَارْجِعْ فَلْيُخَفِّفْ عَنْكَ رَبُّكَ، كُلَّ ذَلِكَ يَلْتَفِتُ النَّبِيُّ صلى الله عليه وسلم إِلَى جِبْرِيلَ لِيُشِيرَ عَلَيْهِ وَلاَ يَكْرَهُ ذَلِكَ جِبْرِيلُ، فَرَفَعَهُ عِنْدَ الْخَامِسَةِ فَقَالَ يَا رَبِّ إِنَّ أُمَّتِي ضُعَفَاءُ أَجْسَادُهُمْ وَقُلُوبُهُمْ وَأَسْمَاعُهُمْ وَأَبْدَانُهُمْ فَخَفِّفْ عَنَّا فَقَالَ الْجَبَّارُ يَا مُحَمَّدُ‏.‏ قَالَ لَبَّيْكَ وَسَعْدَيْكَ‏.‏ قَالَ إِنَّهُ لاَ يُبَدَّلُ الْقَوْلُ لَدَىَّ، كَمَا فَرَضْتُ عَلَيْكَ فِي أُمِّ الْكِتَابِ ـ قَالَ ـ فَكُلُّ حَسَنَةٍ بِعَشْرِ أَمْثَالِهَا، فَهْىَ خَمْسُونَ فِي أُمِّ الْكِتَابِ وَهْىَ خَمْسٌ عَلَيْكَ‏.‏ فَرَجَعَ إِلَى مُوسَى فَقَالَ كَيْفَ فَعَلْتَ فَقَالَ خَفَّفَ عَنَّا أَعْطَانَا بِكُلِّ حَسَنَةٍ عَشْرَ أَمْثَالِهَا‏.‏ قَالَ مُوسَى قَدْ وَاللَّهِ رَاوَدْتُ بَنِي إِسْرَائِيلَ عَلَى أَدْنَى مِنْ ذَلِكَ فَتَرَكُوهُ، ارْجِعْ إِلَى رَبِّكَ فَلْيُخَفِّفْ عَنْكَ أَيْضًا‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَا مُوسَى قَدْ وَاللَّهِ اسْتَحْيَيْتُ مِنْ رَبِّي مِمَّا اخْتَلَفْتُ إِلَيْهِ‏.‏ قَالَ فَاهْبِطْ بِاسْمِ اللَّهِ‏.‏ قَالَ وَاسْتَيْقَظَ وَهْوَ فِي مَسْجِدِ الْحَرَامِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7207,
                "hadithNumber": "7518",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah will say to the people of Paradise, \"O the people of Paradise!\" They will say, 'Labbaik, O our Lord, and Sa`daik, and all the good is in Your Hands!' Allah will say, \"Are you satisfied?' They will say, 'Why shouldn't we be satisfied, O our Lord as You have given us what You have not given to any of Your created beings?' He will say, 'Shall I not give you something better than that?' They will say, 'O our Lord! What else could be better than that?' He will say, 'I bestow My Pleasure on you and will never be angry with you after that.' \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ جنت والوں سے کہے گا اے جنت والو ! وہ بولیں گے حاضر تیری خدمت کے لیے مستعد ‘ ساری بھلائی تیرے دونوں ہاتھوں میں ہے ۔ اللہ تعالیٰ پوچھے گا کیا تم خوش ہو ؟ وہ جواب دیں گے کیوں نہیں ہم خوش ہوں گے اے رب ! اور تو نے ہمیں وہ چیزیں عطا کی ہیں جو کسی مخلوق کو نہیں عطا کیں ۔ اللہ تعالیٰ فرمائے گا کیا میں تمہیں اس سے افضل انعام نہ دوں ؟ جنتی پوچھیں گے اے رب ! اس سے افضل کیا چیز ہو سکتی ہے اللہ تعالیٰ فرمائے گا کہ میں اپنی خوشی تم پر اتار تا ہوں اور اب کبھی تم سے ناراض نہیں ہوں گا ۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا ‘ انہوں نے کہا مجھ سے عبداللہ بن وہب نے بیان کیا ‘ انہوں نے کہا کہ مجھے امام مالک نے بیان کیا ‘ ان سے زید بن اسلم نے بیان کیا ‘ ان سے عطا ء بن یسار نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ يَقُولُ لأَهْلِ الْجَنَّةِ يَا أَهْلَ الْجَنَّةِ‏.‏ فَيَقُولُونَ لَبَّيْكَ رَبَّنَا وَسَعْدَيْكَ وَالْخَيْرُ فِي يَدَيْكَ‏.‏ فَيَقُولُ هَلْ رَضِيتُمْ فَيَقُولُونَ وَمَا لَنَا لاَ نَرْضَى يَا رَبِّ وَقَدْ أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِنْ خَلْقِكَ‏.‏ فَيَقُولُ أَلاَ أُعْطِيكُمْ أَفْضَلَ مِنْ ذَلِكَ‏.‏ فَيَقُولُونَ يَا رَبِّ وَأَىُّ شَىْءٍ أَفْضَلُ مِنْ ذَلِكَ فَيَقُولُ أُحِلُّ عَلَيْكُمْ رِضْوَانِي فَلاَ أَسْخَطُ عَلَيْكُمْ بَعْدَهُ أَبَدًا ‏\"‏‏.‏",
                "headingArabic": "كَلاَمِ الرَّبِّ مَعَ أَهْلِ الْجَنَّةِ",
                "headingUrdu": "اہل جنت سے رب کی گفتگو",
                "headingEnglish": "The Talk of the Lord to the people of Paradise",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7208,
                "hadithNumber": "7519",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Once the Prophet (ﷺ) was preaching while a bedouin was sitting there. The Prophet (ﷺ) said, \"A man from among the people of Paradise will request Allah to allow him to cultivate the land Allah will say to him, 'Haven't you got whatever you desire?' He will reply, 'yes, but I like to cultivate the land (Allah will permit him and) he will sow the seeds, and within seconds the plants will grow and ripen and (the yield) will be harvested and piled in heaps like mountains. On that Allah will say (to him), \"Take, here you are, O son of Adam, for nothing satisfies you.' \"On that the bedouin said, \"O Allah's Messenger (ﷺ)! Such man must be either from Quraish or from Ansar, for they are farmers while we are not.\" On that Allah's Messenger (ﷺ) smiled .",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم ایک دن گفتگو کر رہے تھے ‘ اس وقت آپ کے پاس ایک بدوی تھا کہ اہل جنت میں سے ایک شخص نے اللہ تعالیٰ سے کھیتی کی اجازت چاہی تو اللہ تعالیٰ نے کہا کہ کیا وہ سب کچھ تمہارے پاس نہیں ہے جو تم چاہتے ہو ؟ وہ کہے گا کہ ضرور لیکن میں چاہتا ہوں کہ کھیتی کروں ۔ چنانچہ بہت جلدی وہ بیج ڈالے گا اور پلک جھپکنے تک اس کا اگنا ‘ برابر کٹنا اور پہاڑوں کی طرح غلے کے انبار لگ جانا ہو جائے گا ۔ اللہ تعالیٰ کہے گا ابن آدم ! اس لے لے ‘ تیرے پیٹ کو کوئی چیز نہیں بھر سکتی ۔ دیہاتی نے کہا یا رسول اللہ ! اس کا مزہ تو قریشی یا انصاری ہی اٹھایں گے کیونکہ وہی کھیتی باڑی والے ہیں ‘ ہم تو کسان ہیں نہیں ۔ آنحضرت صلی اللہ علیہ وسلم کو یہ بات سن کر ہنسی آ گئی ۔",
                "urduNarrator": "ہم سے محمد بن سنان نے بیان کیا ‘ انہوں نے کہا ہم سے فلیح بن سلیمان نے بیان کیا ‘ انہوں نے کہا ہم سے ہلال بن علی نے بیان کیا ‘ ان سے عطاء بن یسار نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحٌ، حَدَّثَنَا هِلاَلٌ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَوْمًا يُحَدِّثُ وَعِنْدَهُ رَجُلٌ مِنْ أَهْلِ الْبَادِيَةِ ‏ \"‏ أَنَّ رَجُلاً مِنْ أَهْلِ الْجَنَّةِ اسْتَأْذَنَ رَبَّهُ فِي الزَّرْعِ فَقَالَ أَوَ لَسْتَ فِيمَا شِئْتَ‏.‏ قَالَ بَلَى وَلَكِنِّي أُحِبُّ أَنْ أَزْرَعَ‏.‏ فَأَسْرَعَ وَبَذَرَ فَتَبَادَرَ الطَّرْفَ نَبَاتُهُ وَاسْتِوَاؤُهُ وَاسْتِحْصَادُهُ وَتَكْوِيرُهُ أَمْثَالَ الْجِبَالِ فَيَقُولُ اللَّهُ تَعَالَى دُونَكَ يَا ابْنَ آدَمَ فَإِنَّهُ لاَ يُشْبِعُكَ شَىْءٌ ‏\"‏‏.‏ فَقَالَ الأَعْرَابِيُّ يَا رَسُولَ اللَّهِ لاَ تَجِدُ هَذَا إِلاَّ قُرَشِيًّا أَوْ أَنْصَارِيًّا فَإِنَّهُمْ أَصْحَابُ زَرْعٍ، فَأَمَّا نَحْنُ فَلَسْنَا بِأَصْحَابِ زَرْعٍ‏.‏ فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7209,
                "hadithNumber": "7520",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "I asked Allah's Messenger (ﷺ) \"What is the biggest sin in the sight of Allah?\" He said, \"To set up rivals unto Allah though He alone created you.\" I said, \"In fact, that is a tremendous sin,\" and added, \"What next?\" He said, \"To kill your son being afraid that he may share your food with you.\" I further asked, \"What next?\" He said, \"To commit illegal sexual intercourse with the wife of your neighbor.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ کون سا گناہ اللہ کے یہاں سب سے بڑا ہے ؟ فرمایا یہ کہ تم اللہ کے ساتھ کسی کو شریک نہ ٹھہراؤ حالانکہ اسی نے تمہیں پیدا کیا ہے ۔ میں نے کہا یہ تو بہت بڑا گناہ ہے ۔ میں نے عرض کیا پھر کون سا ؟ فرمایایہ کہ تم اپنے بچے کو اس خطرہ کی وجہ سے قتل کر دو کہ وہ تمہارے ساتھ کھائے گا ۔ میں نے عرض کیا کہ پھر کون ؟ فرمایایہ کہ تم اپنے پڑوسی کی بیوی سے زنا کرو ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے جریر نے بیان کیا ‘ ان سے منصور نے ‘ ان سے ابووائل نے ‘ ان سے عمرو بن شرجیل نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَمْرِو بْنِ شُرَحْبِيلَ، عَنْ عَبْدِ اللَّهِ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم أَىُّ الذَّنْبِ أَعْظَمُ عِنْدَ اللَّهِ قَالَ ‏\"‏ أَنْ تَجْعَلَ لِلَّهِ نِدًّا وَهْوَ خَلَقَكَ ‏\"‏‏.‏ قُلْتُ إِنَّ ذَلِكَ لَعَظِيمٌ‏.‏ قُلْتُ ثُمَّ أَىّ قَالَ ‏\"‏ ثُمَّ أَنْ تَقْتُلَ وَلَدَكَ تَخَافُ أَنْ يَطْعَمَ مَعَكَ ‏\"‏‏.‏ قُلْتُ ثُمَّ أَىّ قَالَ ‏\"‏ ثُمَّ أَنْ تُزَانِيَ بِحَلِيلَةِ جَارِكَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏فَلاَ تَجْعَلُوا لِلَّهِ أَنْدَادًا‏}",
                "headingUrdu": "’’پھر اللہ کا ہمسر نہ بناؤ جب تک تم جانتے ہو۔‘‘",
                "headingEnglish": "“….Then do not set up rivals unto Allah while you know.”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7210,
                "hadithNumber": "7521",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "Two person of Bani Thaqif and one from Quarish (or two persons from Quraish and one from Bani Thaqif) who had fat bellies but little wisdom, met near the Ka`ba. One of them said, \"Did you see that Allah hears what we say? \" The other said, \"He hears us if we speak aloud, but He does not hear if we speak in stealthy quietness (softly).\" The third fellow said, \"If He hears when we speak aloud, then He surely hears us if we speak in stealthy quietness (softly).\" So Allah revealed the Verse:-- 'And you have not been screening against yourselves, lest your ears, and your eyes and your skins should testify against you...\" (41.22)",
                "hadithUrdu": "خانہ کعبہ کے پاس دو ثقفی اور ایک قریشی یا ( یہ کہا کہ ) دو قریشی اور ایک ثقفی جمع ہوئے جن کے پیٹ کی چربی بہت تھی ( توند بڑی تھی ) اور جن میں سوجھ بوجھ کی بڑی کمی تھی ۔ ان میں سے ایک نے کہا کہ تمہارا خیال ہے کہ اللہ وہ سب کچھ سنتا ہے جو ہم کہتے ہیں ۔ دوسرے نے کہا کہ جب ہم زور سے بولتے ہیں تو سنتا ہے لیکن اگر ہم آہستہ بولیں تو نہیں سنتا ۔تیسرے ساتھی نے کہا، \"اگر وہ سنتا ہے جب ہم بلند آواز سے بولتے ہیں، تو وہ ضرور ہماری سنتا ہے اگر ہم چپکے چپکے (آہستگی سے) بولیں توبھی وہ سن سکتاہے۔\" اس پر اللہ نے یہ آیت نازل کی تم جو دنیا میں چھپ کر گناہ کرتے تھے تو اس ڈر سے نہیں کہ تیرے کان تمہاری آنکھیں اور تمہارے چمڑے تمہارے خلاف قیامت کے دن گواہی دیں گے آخر تک ۔",
                "urduNarrator": "ہم سے حمیدی نے بیان کیا ‘ انہوں نے کہا ہم سے سفیان نے بیان کیا ‘ انہوں نے کہا ہم سے منصور نے بیان کیا ‘ ان سے مجاہد نے بیان کیا ‘ ان سے ابو معمر نے بیان کیا اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا مَنْصُورٌ، عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ اجْتَمَعَ عِنْدَ الْبَيْتِ ثَقَفِيَّانِ وَقُرَشِيٌّ، أَوْ قُرَشِيَّانِ وَثَقَفِيٌّ، كَثِيرَةٌ شَحْمُ بُطُونِهِمْ قَلِيلَةٌ فِقْهُ قُلُوبِهِمْ فَقَالَ أَحَدُهُمْ أَتَرَوْنَ أَنَّ اللَّهَ يَسْمَعُ مَا نَقُولُ قَالَ الآخَرُ يَسْمَعُ إِنْ جَهَرْنَا وَلاَ يَسْمَعُ إِنْ أَخْفَيْنَا وَقَالَ الآخَرُ إِنْ كَانَ يَسْمَعُ إِذَا جَهَرْنَا فَإِنَّهُ يَسْمَعُ إِذَا أَخْفَيْنَا‏.‏ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلاَ أَبْصَارُكُمْ وَلاَ جُلُودُكُمْ‏}‏ الآيَةَ‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلاَ أَبْصَارُكُمْ وَلاَ جُلُودُكُمْ وَلَكِنْ ظَنَنْتُمْ أَنَّ اللَّهَ لاَ يَعْلَمُ كَثِيرًا مِمَّا تَعْمَلُونَ}",
                "headingUrdu": "’’اور تم اپنے آپ کو چھپائے ہوئے نہیں رہے کہ کہیں تمہارے کان اور تمہاری آنکھیں اور تمہاری کھالیں تمہارے خلاف گواہی نہ دیں بلکہ تم نے یہ خیال کیا کہ تم جو کچھ کر رہے ہو اس میں سے زیادہ تر اللہ کو معلوم نہیں۔‘‘",
                "headingEnglish": "“And you have not been hiding yourselves, lest your ears, and your eyes and your skins testify against you, but you thought that Allah knew not much of what you were doing.”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7211,
                "hadithNumber": "7522",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"How can you ask the people of the Scriptures about their Books while you have Allah's Book (the Qur'an) which is the most recent of the Books revealed by Allah, and you read it in its pure undistorted form?\"",
                "hadithUrdu": "تم اہل کتاب سے ان کی کتابوں کے مسائل کے بارے میں کیونکر سوال کرتے ہو ‘ تمہارے پاس خود اللہ کی کتاب موجود ہے جو زمانہ کے اعتبار سے بھی تم سے سب سے زیادہ قریب ہے ‘ تم اسے پڑھتے ہو ‘ وہ خالص ہے اس میں کوئی ملاوٹ نہیں ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ کہا ہم سے حاتم بن وردان نے بیان کیا ‘ کہا ہم سے ایوب نے بیا کیا ‘ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَاتِمُ بْنُ وَرْدَانَ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَيْفَ تَسْأَلُونَ أَهْلَ الْكِتَابِ عَنْ كُتُبِهِمْ وَعِنْدَكُمْ كِتَابُ اللَّهِ أَقْرَبُ الْكُتُبِ عَهْدًا بِاللَّهِ، تَقْرَءُونَهُ مَحْضًا لَمْ يُشَبْ",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ‏}‏",
                "headingUrdu": "\"....ہر روز وہ کسی نہ کسی معاملے میں ہوتا ہے!\"",
                "headingEnglish": "“….Every day He is in some affair!”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7212,
                "hadithNumber": "7523",
                "englishNarrator": "Narrated `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"O the group of Muslims! How can you ask the people of the Scriptures about anything while your Book which Allah has revealed to your Prophet contains the most recent news from Allah and is pure and not distorted? Allah has told you that the people of the Scriptures have changed some of Allah's Books and distorted it and wrote something with their own hands and said, 'This is from Allah, so as to have a minor gain for it. Won't the knowledge that has come to you stop you from asking them? No, by Allah, we have never seen a man from them asking you about that (the Book Al-Qur'an ) which has been revealed to you.",
                "hadithUrdu": "اے مسلمانو ! تم اہل کتاب سے کسی مسئلہ میں کیوں پوچھتے ہو ۔ تمہاری کتاب جو اللہ تعالیٰ نے تمہارے نبی کریم صلی اللہ علیہ وسلم پر نازل کی ہے وہ اللہ کے یہاں سے بالکل تازہ آئی ہے ‘ خالص ‘ ہے اس میں کوئی ملاوٹ نہیں ہوئی اور اللہ تعالیٰ نے خود تمہیں بتا دیا ہے کہ اہل کتاب نے اللہ کی کتابوں کو بد ل ڈالا ۔ وہ ہاتھ سے ایک کتاب لکھتے اور دعویٰ کرتے کہ یہ اللہ کی طرف سے ہے تاکہ اس کے ذریعہ سے تھوڑی پونچی حاصل کریں ‘ تم کو جو خدا نے قرآن و حدیث کا علم دیا ہے کیا وہ تم کو اس سے منع نہیں کرتاکہ تم دین کی باتیں اہل کتاب سے پوچھو ۔ خدا کی قسم ہم تو ان کے کسی آدمی کو نہیں دیکھتے کہ جو کچھ تمہارے اوپر نازل ہوا ہے اس کے متعلق وہ تم سے پوچھتے ہوں ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ‘ انہیں زہری نے ‘ انہیں عبیداللہ بن عبداللہ نے خبر دی اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، قَالَ يَا مَعْشَرَ الْمُسْلِمِينَ كَيْفَ تَسْأَلُونَ أَهْلَ الْكِتَابِ عَنْ شَىْءٍ وَكِتَابُكُمُ الَّذِي أَنْزَلَ اللَّهُ عَلَى نَبِيِّكُمْ صلى الله عليه وسلم أَحْدَثُ الأَخْبَارِ بِاللَّهِ مَحْضًا لَمْ يُشَبْ وَقَدْ حَدَّثَكُمُ اللَّهُ أَنَّ أَهْلَ الْكِتَابِ قَدْ بَدَّلُوا مِنْ كُتُبِ اللَّهِ وَغَيَّرُوا فَكَتَبُوا بِأَيْدِيهِمْ، قَالُوا هُوَ مِنْ عِنْدِ اللَّهِ‏.‏ لِيَشْتَرُوا بِذَلِكَ ثَمَنًا قَلِيلاً، أَوَ لاَ يَنْهَاكُمْ مَا جَاءَكُمْ مِنَ الْعِلْمِ عَنْ مَسْأَلَتِهِمْ، فَلاَ وَاللَّهِ مَا رَأَيْنَا رَجُلاً مِنْهُمْ يَسْأَلُكُمْ عَنِ الَّذِي أُنْزِلَ عَلَيْكُمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7213,
                "hadithNumber": "7524",
                "englishNarrator": "Narrated Sa`id bin Jubair reported from Ibn `Abbas رضی اللہ عنہما:",
                "hadithEnglish": "(regarding the explanation of the Verse: 'Do not move your tongue concerning (the Qur'an) to make haste therewith) . He said, \"The Prophet (ﷺ) used to undergo great difficulty in receiving the Divine Inspiration and used to move his lips.' Ibn `Abbas رضی اللہ عنہما said (to Sa`id), \"I move them (my lips) as Allah's Messenger (ﷺ) used to move his lips.\" And Sa`id said (to me), \"I move my lips as I saw Ibn `Abbas رضی اللہ عنہما moving his lips,\" and then he moved his lips. So Allah revealed:-- '(O Muhammad!) Do not move your tongue concerning (the Qur'an) to make haste therewith. It is for Us to collect it and give you (O Muhammad) the ability to recite it. (i.e., to collect it in your chest and then you recite it).' (75.16-17) But when We have recited it, to you (O Muhammad through Gabriel) then follow you its recital.' (75.18) This means, \"You should listen to it and keep quiet and then it is upon Us to make you recite it.\" The narrator added, \"So Allah's Messenger (ﷺ) used to listen whenever Gabriel came to him, and when Gabriel left, the Prophet (ﷺ) would recite the Qur'an as Gabriel had recited it to him.\"",
                "hadithUrdu": "سورۃ القیامہ میں اللہ تعالیٰ کا ارشاد ” لاتحرک بہ لسانک “ کے متعلق کہ وحی نازل ہوتی ہے تو آنحضرت صلی اللہ علیہ وسلم پر اس کا بہت بار پڑتا ہے اور آپ اپنے ہونٹ ہلاتے ۔ مجھ سے ابن عباس رضی اللہ عنہما نے کہا کہ میں تمہیں ہلا کے دکھا تا ہوں جس طرح آنحضرت صلی اللہ علیہ وسلم ہلاتے تھے ۔ سعید نے کہا کہ جس طرح ابن عباس رضی اللہ عنہما ہونٹ ہلا کر دکھا تے تھے ‘ میں تمہارے سامنے اسی طرح ہلا تا ہوں ۔ چنانچہ انہوں نے اپنے ہونٹ ہلائے ۔ ( ابن عباس رضی اللہ عنہما نے بیان کیا کہ ) اس پر اللہ تعالیٰ نے یہ آیت نازل کی کہ ” لا تحرک بہ لسانک لتعجل بہ ان علینا جمعہ وقرانہ “ یعنی تمہارے سینے میں قرآن کا جما دینا اور اس کو پڑھا دینا ہمارا کام ہے جب ہم ( جبرائیل علیہ السلام کی زبان پر ) اس کو پڑھ چکیں اس وقت تم اس کے پڑھنے کی پیروی کرو ۔ مطلب یہ ہے کہ جبرائیل علیہ السلام کے پڑھتے وقت کان لگا کر سنتے رہو اور خاموش رہو ‘ یہ ہمارا ذمہ ہے ہم تم سے ویسا ہی پڑھوا دیں گے ۔ ابن عباس رضی اللہ عنہما نے کہا کہ اس آیت کے اتر نے کے بعد جب حضرت جبرائیل علیہ السلام آتے ( قرآن ) سناتے ) تو آپ کان لگا کر سنتے ۔ جب جبرائیل علیہ السلام چلے جاتے تو آپ لوگوں کو اسی طرح پڑھ کر سنا دیتے جیسے جبرائیل علیہ السلام نے آپ کو پڑھ کر سنایا تھا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے ابو عوانہ نے بیان کیا ‘ ان سے موسیٰ ابن ابی عائشہ نے ‘ ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ تَعَالَى ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ‏}‏ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعَالِجُ مِنَ التَّنْزِيلِ شِدَّةً، وَكَانَ يُحَرِّكُ شَفَتَيْهِ ـ فَقَالَ لِي ابْنُ عَبَّاسٍ أُحَرِّكُهُمَا لَكَ كَمَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحَرِّكُهُمَا فَقَالَ سَعِيدٌ أَنَا أُحَرِّكُهُمَا كَمَا كَانَ ابْنُ عَبَّاسٍ يُحَرِّكُهُمَا فَحَرَّكَ شَفَتَيْهِ ـ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ * إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ‏}‏ قَالَ جَمْعُهُ فِي صَدْرِكَ ثُمَّ تَقْرَؤُهُ‏.‏ ‏{‏فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ‏}‏ قَالَ فَاسْتَمِعْ لَهُ وَأَنْصِتْ ثُمَّ إِنَّ عَلَيْنَا أَنْ تَقْرَأَهُ‏.‏ قَالَ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَتَاهُ جِبْرِيلُ ـ عَلَيْهِ السَّلاَمُ ـ اسْتَمَعَ فَإِذَا انْطَلَقَ جِبْرِيلُ قَرَأَهُ النَّبِيُّ صلى الله عليه وسلم كَمَا أَقْرَأَهُ‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ‏}‏",
                "headingUrdu": "’’اپنی زبان کو اس کے ساتھ جلدی کرنے کے لیے حرکت نہ کرو۔‘‘",
                "headingEnglish": "“Move not your tongue concerning to make haste therewith.”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7214,
                "hadithNumber": "7525",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "regarding the explanation of the Verse:-- '(O Muhammad!) Neither say your prayer aloud, nor say it in a low tone.' (17.110) This Verse was revealed while Allah's Messenger (ﷺ) was hiding himself at Mecca. At that time, when he led his companions in prayer, he used to raise his voice while reciting the Qur'an; and if the pagans heard him, they would abuse the Qur'an, its Revealer, and the one who brought it. So Allah said to His Prophet: \"Neither say your prayer aloud. i.e., your recitation (of Qur'an) lest the pagans should hear (it) and abuse the Qur'an\" nor say it in a low tone, \"lest your voice should fail to reach your companions, \"but follow a way between.\" (17.110)",
                "hadithUrdu": "اللہ تعالیٰ کے ارشاد ” ولا تجھر بصلاتک ولا تخافت بھا “ کے بارے میں کہ یہ آیت جب نازل ہوئی تو رسول کریم صلی اللہ علیہ وسلم مکہ میں چھپ کر ( اعمال اسلام ادا کرتے تھے ) لیکن جب اپنے صحابہ کو نماز پڑھاتے تو قرآن مجید بلند آواز سے پڑھتے ‘ جب مشرکین سنتے تو قرآن مجید کو ‘ اس کے اتارنے والے کو اور اسے لے کر آنے والے کو گالی دیتے ۔ چنانچہ اللہ تعالیٰ نے اپنے نبی سے کہا کہ اپنی قرآت میں آواز بلند نہ کریں کہ مشرکین سنیں اور پھر قرآن کو گالی دیں اور نہ اتنا آہستہ ہی پڑھیں کہ آپ کے صحابہ بھی نہ سن سکیں بلکہ ان کے درمیان کا راستہ اختیار کریں ۔",
                "urduNarrator": "مجھ سے عمرو بن زرارہ نے بیان کیا ‘ ان سے ہشیم نے بیان کیا ‘ انہوں نے کہا ہم کو ابو بشر نے خبر دی ‘ انہیں سعید بن جبیر نے اور انہیں حضرت عبداللہ بن عباس رضی اللہ عنہما نے ۔",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ زُرَارَةَ، عَنْ هُشَيْمٍ، أَخْبَرَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ فِي قَوْلِهِ تَعَالَى ‏{‏وَلاَ تَجْهَرْ بِصَلاَتِكَ وَلاَ تُخَافِتْ بِهَا‏}‏ قَالَ نَزَلَتْ وَرَسُولُ اللَّهِ صلى الله عليه وسلم مُخْتَفٍ بِمَكَّةَ، فَكَانَ إِذَا صَلَّى بِأَصْحَابِهِ رَفَعَ صَوْتَهُ بِالْقُرْآنِ، فَإِذَا سَمِعَهُ الْمُشْرِكُونَ سَبُّوا الْقُرْآنَ وَمَنْ أَنْزَلَهُ وَمَنْ جَاءَ بِهِ، فَقَالَ اللَّهُ لِنَبِيِّهِ صلى الله عليه وسلم ‏{‏وَلاَ تَجْهَرْ بِصَلاَتِكَ‏}‏ أَىْ بِقِرَاءَتِكَ، فَيَسْمَعَ الْمُشْرِكُونَ، فَيَسُبُّوا الْقُرْآنَ ‏{‏وَلاَ تُخَافِتْ بِهَا‏}‏ عَنْ أَصْحَابِكَ فَلاَ تُسْمِعُهُمْ ‏{‏وَابْتَغِ بَيْنَ ذَلِكَ سَبِيلاً‏}‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏وَأَسِرُّوا قَوْلَكُمْ أَوِ اجْهَرُوابِهِ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ أَلاَ يَعْلَمُ مَنْ خَلَقَ وَهُوَ اللَّطِيفُ الْخَبِيرُ}",
                "headingUrdu": "\"اور چاہے آپ اپنی بات کو خفیہ رکھیں یا اسے ظاہر کریں۔ بے شک وہ سینوں کی باتوں کو جاننے والا ہے۔‘‘",
                "headingEnglish": "“And whether you keep your talk secret or disclose it. Verily, He is the All-Knower of what is in the breasts (of men)….”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7215,
                "hadithNumber": "7526",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Verse:-- '(O Muhammad!) Neither say your prayer aloud nor say it in a low tone.' (17.110) was revealed in connection with the invocations.",
                "hadithUrdu": "آیت ولا تجھر بصلاتک ولا تخافت بھا “ دعا کے بارے میں نازل ہوئی ۔ یعنی دعا نہ بہت چلا کر مانگ نہ آہستہ بلکہ درمیانہ راستہ اختیار کر ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ ان سے ہشام نے ‘ ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ نَزَلَتْ هَذِهِ الآيَةُ ‏{‏وَلاَ تَجْهَرْ بِصَلاَتِكَ وَلاَ تُخَافِتْ بِهَا‏}‏ فِي الدُّعَاءِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7216,
                "hadithNumber": "7527",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) said, 'Whoever does not recite Qur'an in a nice voice is not from us,' and others said extra,\" (that means) to recite it aloud.\" And other said, that means to recite it aloud.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو خوش آوازی سے قرآن نہیں پڑھتا وہ ہم مسلمانوں کے طریق پر نہیں ہے اور (ابوہریرہ رضی اللہ عنہ کے سوا) دوسرے لوگوں نے اس حدیث میں اتنا زیادہ کیا ہے یعنی اس کو پکار کر نہ پڑھے ۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا ‘ کہا ہم سے ابو عاصم نے ‘ کہا ہم کو ابن جریج نے خبر دی ‘ کہا ہم کو ابن شہاب نے خبر دی ‘ انہیں ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَيْسَ مِنَّا مَنْ لَمْ يَتَغَنَّ بِالْقُرْآنِ ‏\"‏‏.‏ وَزَادَ غَيْرُهُ ‏\"‏ يَجْهَرُ بِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7217,
                "hadithNumber": "7528",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Not to wish to be the like of except the like of two men: a man whom Allah has given the Qur'an and he recites it during the hours of the night and the hours of the day, in which case one may say, \"If I were given the same as this man has been given, I would do the same as he is doing.' The other is a man whom Allah has given wealth and he spends it in the right way, in which case one may say, 'If I were given the same as he has been given, I would do the same as he is doing.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا رشک صرف دو آدمیوں پر کیا جا سکتا ہے ۔ ایک اس پر جسے اللہ نے قرآن کا علم دیا اور وہ اس کی تلاوت رات دن کرتا ہے تو ایک دیکھنے والا کہتا ہے کہ کاش مجھے بھی اسی جیسا قرآن کا علم ہوتا تو میں بھی اس کی طرح تلاوت کرتا رہتا اور دوسرا وہ شخص ہے جسے اللہ نے مال دیا اور وہ اسے اس کے حق میں خرچ کرتا ہے جسے دیکھنے والا کہتا ہے کہ کاش مجھے بھی اللہ اتنا مال دیتا تو میں بھی اسی طرح خرچ کرتا جیسے یہ کرتا ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے جریر نے بیان کیا ‘ ان سے اعمش نے ‘ ان سے ابوصالح نے اور ان سے ابوہریر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَحَاسُدَ إِلاَّ فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ الْقُرْآنَ فَهْوَ يَتْلُوهُ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ، فَهْوَ يَقُولُ لَوْ أُوتِيتُ مِثْلَ مَا أُوتِيَ هَذَا، لَفَعَلْتُ كَمَا يَفْعَلُ‏.‏ وَرَجُلٌ آتَاهُ اللَّهُ مَالاً فَهْوَ يُنْفِقُهُ فِي حَقِّهِ فَيَقُولُ لَوْ أُوتِيتُ مِثْلَ مَا أُوتِيَ عَمِلْتُ فِيهِ مِثْلَ مَا يَعْمَلُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏{‏رَجُلٌ آتَاهُ اللَّهُ الْقُرْآنَ فَهْوَ يَقُومُ بِهِ آنَاءَ اللَّيْلِ وَالنَّهَارِ، وَرَجُلٌ يَقُولُ لَوْ أُوتِيتُ مِثْلَ مَا أُوتِيَ هَذَا فَعَلْتُ كَمَا يَفْعَلُ»",
                "headingUrdu": "’’اگر مجھے وہی دیا گیا جو اس آدمی کو دیا گیا ہے تو میں بھی وہی کروں گا جو وہ کر رہا ہے۔‘‘",
                "headingEnglish": "‘If I have been given what this man has been given, I would do the same as he is doing.’",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7218,
                "hadithNumber": "7529",
                "englishNarrator": "Narrated Salim's father رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Not to wish to be the like of except the like of two (persons): a man whom Allah has given the knowledge of the Qur'an and he recites it during the hours of the night and the hours of the day; and a man whom Allah has given wealth and he spends it (in Allah's Cause) during the hours of the night and during the hours of the day.\" I heard it many a time from Sufyan but he did not mention the word ''الْخَبَرَ '' though it is amongst the authentic Ahadith of him.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا رشک کے قابل تو دو ہی آدمی ہیں ۔ ایک وہ جسے اللہ نے قرآن دیا اور وہ اس کی تلاوت رات دن کرتا رہتا ہے اور دوسرا وہ جسے اللہ نے مال دیا ہو اور وہ اسے رات و دن خرچ کرتا رہا ۔ علی بن عبداللہ نے کہا کہ میں نے یہ حدیث سفیان بن عیینہ سے کئی بار سنی ۔ ” اخبرنا “ کے لفظوں کے ساتھ انہیں کہتا سنا باوجود اس کے ان کی یہ حدیث صحیح اور متصل ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا‘ان سے زہری نے بیان کیا ‘ ان سے سالم نے اور ان سے ان کے والد رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ الزُّهْرِيُّ عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ حَسَدَ إِلاَّ فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ الْقُرْآنَ فَهْوَ يَتْلُوهُ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ، وَرَجُلٌ آتَاهُ اللَّهُ مَالاً فَهْوَ يُنْفِقُهُ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ ‏\"‏‏.‏ سَمِعْتُ سُفْيَانَ مِرَارًا لَمْ أَسْمَعْهُ يَذْكُرُ الْخَبَرَ وَهْوَ مِنْ صَحِيحِ حَدِيثِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7219,
                "hadithNumber": "7530",
                "englishNarrator": "Narrated Al-Mughira رضی اللہ عنہ :",
                "hadithEnglish": "Our Prophet has informed us our Lord's Message that whoever of us is martyred, will go to Paradise.",
                "hadithUrdu": "ہمارے نبی کریم صلی اللہ علیہ وسلم نے ہمیں اپنے رب کے پیغامات میں سے یہ پیغام پہنچایا کہ ہم میں سے جو ( فی سبیل اللہ ) قتل کیا جائے گا وہ جنت میں جائے گا ۔",
                "urduNarrator": "ہم سے فضل بن یعقوب نے بیان کیا ‘ انہوں نے کہا ہم سے عبداللہ بن جعفر الرقی نے بیان کیا ‘ ان سے معتمر بن سلیمان نے بیان کیا ‘ ان سے سعید بن عبیداللہ ثقفی نے بیان کیا ‘ ان سے بکر بن عبداللہ مزنی اور زیاد بن جبیر بن حیہ نے بیان کیا ‘ ان سے مغیرہ بن شعبہ رضی اللہ عنہ نے ( ایران کی فوج کے سامنے ) کہا کہ",
                "hadithArabic": "حَدَّثَنَا الْفَضْلُ بْنُ يَعْقُوبَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدِ اللَّهِ الثَّقَفِيُّ، حَدَّثَنَا بَكْرُ بْنُ عَبْدِ اللَّهِ الْمُزَنِيُّ، وَزِيَادُ بْنُ جُبَيْرِ بْنِ حَيَّةَ، عَنْ جُبَيْرِ بْنِ حَيَّةَ، قَالَ الْمُغِيرَةُ أَخْبَرَنَا نَبِيُّنَا، صلى الله عليه وسلم عَنْ رِسَالَةِ، رَبِّنَا ‏ \"‏ أَنَّهُ مَنْ قُتِلَ مِنَّا صَارَ إِلَى الْجَنَّةِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَاأُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ وَإِنْ لَمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسَالاَتِهِ}",
                "headingUrdu": "\"اے رسول! جو آپ کے رب کی طرف سے آپ پر نازل کیا گیا ہے اس کا اعلان کریں۔ اور اگر تم نے ایسا نہیں کیا تو تم نے اس کا پیغام نہیں پہنچایا۔‘‘",
                "headingEnglish": "“O Messenger! Proclaim which has been sent down to you from your Lord. And if you do not, then you have not conveyed His Message…”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7220,
                "hadithNumber": "7531",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Whoever tells you that the Prophet (ﷺ) concealed anything. Masrooq states that Hadrat Aishah رضی اللہ عنہا said: Don't testify him who says to you that the prophet ﷺ concealed anything if the revelation, for Allah said: 'O Apostle Muhammad! Proclaim (the Message) which has been sent down to you from your Lord, and if you do it not, then you have not conveyed His Message.' (5.67)",
                "hadithUrdu": "اگر کوئی تم سے یہ بیان کرتا ہے کہ محمد صلی اللہ علیہ وسلم نے کوئی چیز چھپائی ( دوسری سند ) اور محمد بن یوسف فریابی نے بیان کیا ‘ کہا ہم سے ابوعامر عقدی نے بیان کیا ‘ کہا ہم سے شعبہ بن حجاج نے ‘ ان سے اسماعیل بن ابی خالد نے ‘ ان سے شعبی نے ‘ ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ اگر تم سے کوئی یہ بیان کرتا ہے کہ نبی کریم صلی اللہ علیہ وسلم نے وحی میں کچھ چھپا لیا تو اس کی تصدیق نہ کرنا ( وہ جھوٹا ہے ) کیونکہ اللہ تعالیٰ خود فرماتا ہے کہ ” اے رسول ! پہنچا دیجئیے وہ پیغام جو آپ کے پاس آپ کے رب کی طرف سے نازل ہوا ہے اور اگر آپ نے یہ نہیں کیا تو آپ اپنے رب کا پیغام نہیں پہنچایا ۔ “",
                "urduNarrator": "ہم سے محمد بن یوسف فریابی نے بیان کیا ‘ کہا ہم سے سفیان ثوری نے بیان کیا ‘ کہا ہم سے اسماعیل نے ‘ ان سے شعبی نے ‘ ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَنْ حَدَّثَكَ أَنَّ مُحَمَّدًا صلى الله عليه وسلم كَتَمَ شَيْئًا وَقَالَ مُحَمَّدٌ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ حَدَّثَنَا شُعْبَةُ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ عَنِ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ مَنْ حَدَّثَكَ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَتَمَ شَيْئًا مِنَ الْوَحْىِ، فَلاَ تُصَدِّقْهُ، إِنَّ اللَّهَ تَعَالَى يَقُولُ ‏{‏يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ وَإِنْ لَمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسَالَتَهُ‏}‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7221,
                "hadithNumber": "7532",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "A man said, \"O Allah's Messenger (ﷺ)! Which sin is the biggest in Allah's Sight?\" The Prophet (ﷺ) said, \"To set up rivals unto Allah though He Alone created you.\" That man said, \"What is next?\" The Prophet (ﷺ) said, \"To kill your son lest he should share your food with you.'' The man said, \"What is next?\" The Prophet said, \"To commit illegal sexual intercourse with the wife of your neighbor.\" Then Allah revealed in confirmation of that: \"And those who invoke not with Allah any other god, nor kill such life as Allah has made sacred except for just cause, nor commit illegal sexual intercourse and whoever does this shall receive the punishment..... (25.68)",
                "hadithUrdu": "ایک صاحب نے عرض کیا یا رسول اللہ ! کون سا گناہ اللہ کے نزدیک سب سے بڑا ہے ؟ فرمایا کہ تم اللہ کی عبادت میں کسی کو بھی ساجھی بناؤ حالانکہ تمہیں اللہ نے پیدا کیا ہے ۔ پوچھا پھر کون سا ؟ فرمایا یہ کہ تم اپنے بچے کو اس خوف سے مار ڈالو کہ وہ تمہارے ساتھ کھائے گا ۔ پوچھا پھر کون سا ؟ فرمایا یہ کہ تم اپنے پڑوسی کی بیوی سے زنا کرو ۔ چنانچہ اللہ تعالیٰ نے سورۃ الفرقان میں اس کی تصدیق میں قرآن نازل فرمایا ” اور وہ لوگ جو اللہ کے ساتھ کسی دوسرے معبود باطل کو نہیں پکارتے اور جو کسی ایسے کی جان نہیں لیتے جسے اللہ نے حرام کیا ہے سوا حق کے اور جو زنا نہیں کرتے اور جو کوئی ایسا کرے گا وہ گناہ سے بھڑ جائے گا ۔ “",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے جریر نے بیان کیا ‘ ان سے اعمش نے ‘ ان سے ابووائل نے ‘ان سے عمرو بن شرجیل نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَمْرِو بْنِ شُرَحْبِيلَ، قَالَ قَالَ عَبْدُ اللَّهِ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَىُّ الذَّنْبِ أَكْبَرُ عِنْدَ اللَّهِ قَالَ ‏\"‏ أَنْ تَدْعُوَ لِلَّهِ نِدًّا، وَهْوَ خَلَقَكَ ‏\"‏‏.‏ قَالَ ثُمَّ أَىّ قَالَ ‏\"‏ ثُمَّ أَنْ تَقْتُلَ وَلَدَكَ، أَنْ يَطْعَمَ مَعَكَ ‏\"‏‏.‏ قَالَ ثُمَّ أَىّ قَالَ ‏\"‏ أَنْ تُزَانِيَ حَلِيلَةَ جَارِكَ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ تَصْدِيقَهَا ‏{‏وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلاَ يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ وَلاَ يَزْنُونَ وَمَنْ يَفْعَلْ ذَلِكَ‏}‏ الآيَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7222,
                "hadithNumber": "7533",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Your stay (in this world) in comparison to the stay of the nations preceding you, is like the period between `Asr prayer and the sun set (in comparison to a whole day). The people of the Torah were given the Torah and they acted on it till midday and then they were unable to carry on. And they were given (a reward equal to) one Qirat each. Then the people of the Gospel were given the Gospel and they acted on it till `Asr Prayer and then they were unable to carry on, so they were given la reward equal to) one Qirat each. Then you were given the Qur'an and you acted on it till sunset, therefore you were given (a reward equal to) two Qirats each. On that, the people of the Scriptures said, 'These people (Muslims) did less work than we but they took a bigger reward.' Allah said (to them). 'Have I done any oppression to you as regards your rights?' They said, \"No.\" Then Allah said, 'That is My Blessing which I grant to whomsoever I will.' \"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا گذشتہ امتوں کے مقابلہ میں تمہارا وجود ایسا ہے جیسے عصر اور مغرب کے درمیان کا وقت ۔ اہل توریت کو توریت دی گئی تو انہوں نے اس پر عمل کیا یہاں تک کہ دن آدھا ہو گیا اور وہ عاجز ہ ہو گئے ۔ پھر انہیں ایک ایک قیراط دیا گیا ۔ پھر اہل انجیل کو انجیل دی گئی اور انہوں نے اس پر عمل کیا یہاں تک کہ عصر کی نماز کا وقت ہو گیا ۔ انہیں بھی ایک ایک قیراط دیا گیا ۔ پھر تمہیں قرآن دیا گیا اور تم نے اس پر عمل کیا یہاں تک کہ مغرب کا وقت ہو گیا ۔ تمہیں دو دو قیراط دئیے گئے ۔ اس پر کتاب نے کہا کہ یہ ہم سے عمل میں کم ہیں اور اجر میں زیادہ ۔ اللہ تعالیٰ نے فرمایا کیا میں نے تمہارا حق دینے میں کوئی ظلم کیا ہے ؟ انہوں نے جواب دیا کہ نہیں ۔ اللہ تعالیٰ نے فرمایا کہ پھر یہ میرا فضل ہے میں جسے چاہوں دوں ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ‘ انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی ‘ انہیں یونس نے خبر دی ‘ انہیں زہری نے ‘انہیں سالم نے خبر دی اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَالِمٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا بَقَاؤُكُمْ فِيمَنْ سَلَفَ مِنَ الأُمَمِ كَمَا بَيْنَ صَلاَةِ الْعَصْرِ إِلَى غُرُوبِ الشَّمْسِ، أُوتِيَ أَهْلُ التَّوْرَاةِ التَّوْرَاةَ فَعَمِلُوا بِهَا حَتَّى انْتَصَفَ النَّهَارُ، ثُمَّ عَجَزُوا فَأُعْطُوا قِيرَاطًا قِيرَاطًا، ثُمَّ أُوتِيَ أَهْلُ الإِنْجِيلِ الإِنْجِيلَ فَعَمِلُوا بِهِ حَتَّى صُلِّيَتِ الْعَصْرُ، ثُمَّ عَجَزُوا فَأُعْطُوا قِيرَاطًا قِيرَاطًا، ثُمَّ أُوتِيتُمُ الْقُرْآنَ فَعَمِلْتُمْ بِهِ حَتَّى غَرَبَتِ الشَّمْسُ، فَأُعْطِيتُمْ قِيرَاطَيْنِ قِيرَاطَيْنِ، فَقَالَ أَهْلُ الْكِتَابِ هَؤُلاَءِ أَقَلُّ مِنَّا عَمَلاً وَأَكْثَرُ أَجْرًا‏.‏ قَالَ اللَّهُ هَلْ ظَلَمْتُكُمْ مِنْ حَقِّكُمْ شَيْئًا قَالُوا لاَ‏.‏ قَالَ فَهْوَ فَضْلِي أُوتِيهِ مَنْ أَشَاءُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏قُلْ فَأْتُوا بِالتَّوْرَاةِ فَاتْلُوهَا}",
                "headingUrdu": "’’کہو تورات لاؤ اور پڑھو…‘‘",
                "headingEnglish": "“…Say Bring here the Taurat and recite it…”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7223,
                "hadithNumber": "7534",
                "englishNarrator": "Narrated Ibn Mas`ud رضی اللہ عنہما :",
                "hadithEnglish": "A man asked the Prophet (ﷺ) \"What deeds are the best?\" The Prophet (ﷺ) said: \"(1) To perform the (daily compulsory) prayers at their (early) stated fixed times, (2) to be good and dutiful to one's own parents, (3) and to participate in Jihad in Allah's Cause.\"",
                "hadithUrdu": "ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا ۔ کون سا عمل سب سے افضل ہے ؟ فرمایا کہ اپنے وقت پر نماز پڑھنا اور والدین کے ساتھ نیک معاملہ کرنا ‘ پھر اللہ کے راستے میں جہاد کرنا ۔",
                "urduNarrator": "مجھ سے سلیمان بن حرب نے بیان کیا ‘ انہوں نے کہا ہم سے شعبہ بن حجاج نے بیان کیا ‘ ان سے ولید بن عیزار نے ( دوسری سند ) اور امام بخاری نے کہا کہ مجھ سے عباد بن یعقوب اسدی نے بیان کیا ‘ انہوں نے کہا ہم کو عباد بن العوام نے خبر دی ‘ انہیں شیبانی نے اور انہیں عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنِي سُلَيْمَانُ، حَدَّثَنَا شُعْبَةُ، عَنِ الْوَلِيدِ،‏.‏ وَحَدَّثَنِي عَبَّادُ بْنُ يَعْقُوبَ الأَسَدِيُّ، أَخْبَرَنَا عَبَّادُ بْنُ الْعَوَّامِ، عَنِ الشَّيْبَانِيِّ، عَنِ الْوَلِيدِ بْنِ الْعَيْزَارِ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ أَنَّ رَجُلاً، سَأَلَ النَّبِيَّ صلى الله عليه وسلم أَىُّ الأَعْمَالِ أَفْضَلُ قَالَ ‏ \"‏ الصَّلاَةُ لِوَقْتِهَا، وَبِرُّ الْوَالِدَيْنِ، ثُمَّ الْجِهَادُ فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": "وَسَمَّى النَّبِيُّ صلى الله عليه وسلم الصَّلاَةَ عَمَلاً",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے نماز کو عمل قرار دیا اور فرمایا: جو شخص اپنی نماز میں سورۃ فاتحہ نہیں پڑھتا اس کی نماز باطل ہے۔",
                "headingEnglish": "The Prophet (saws) called As-Salat a deed and said, “Whoever does not recite Al-Fatiha of the Book in his Salat, his Salat is invalid",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7224,
                "hadithNumber": "7535",
                "englishNarrator": "Narrated `Amr bin Taghlib رضی اللہ عنہ :",
                "hadithEnglish": "\"Some property was given to the Prophet (ﷺ) and he gave it to some people and withheld it from some others. Then he came to know that they (the latter) were dissatisfied. So the Prophet said, 'I give to one man and leave (do not give) another, and the one to whom I do not give is dearer to me than the one to whom I give. I give to some people because of the impatience and discontent present in their hearts, and leave other people because of the content and goodness Allah has bestowed on them, and one of them is `Amr bin Taghlib.\" `Amr bin Taghlib رضی اللہ عنہ said, \"The sentence which Allah's Messenger (ﷺ) said in my favor is dearer to me than the possession of nice red camels.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے پاس مال آیا اور آپ نے اس میں سے کچھ لوگوں کو دیا اور کچھ کو نہیں دیا ۔ پھر آنحضرت صلی اللہ علیہ وسلم کو معلوم ہوا کہ اس پر کچھ لوگ ناراض ہوئے ہیں تو آپ نے فرمایا کہ میں ایک شخص کو دیتا ہوں اور دوسرے کو نہیں دیتا اور جسے نہیں دیتا وہ مجھے اس سے زیادہ عزیز ہوتا ہے جسے دیتا ہوں ۔ میں کچھ لوگوں کو اس لئے دیتا ہوں کہ ان کے دلوں میں گھبراہٹ اور بے چینی ہے اور دوسرے لوگوں پر اعتماد کرتا ہوں کہ اللہ نے ان کے دلوں کو بے نیازی اور بھلائی عطا فرمائی ہے ۔ انہیں میں سے عمرو بن تغلب بھی ہیں ۔ عمرو رضی اللہ عنہ نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم کے اس کلمہ کے مقابلہ میں مجھے لا ل لال اونٹ ملتے تو اتنی خوشی نہ ہوتی ۔",
                "urduNarrator": "ہم سے ابو النعمان نے بیان کیا ‘ کہا ہم سے جریر بن حازم نے بیان کیا ‘ ان سے امام حسن بصری نے ‘ان سے عمرو بن تغلب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنِ الْحَسَنِ، حَدَّثَنَا عَمْرُو بْنُ تَغْلِبَ، قَالَ أَتَى النَّبِيَّ صلى الله عليه وسلم مَالٌ فَأَعْطَى قَوْمًا وَمَنَعَ آخَرِينَ فَبَلَغَهُ أَنَّهُمْ عَتَبُوا فَقَالَ ‏ \"‏ إِنِّي أُعْطِي الرَّجُلَ وَأَدَعُ الرَّجُلَ، وَالَّذِي أَدَعُ أَحَبُّ إِلَىَّ مِنَ الَّذِي أُعْطِي، أُعْطِي أَقْوَامًا لِمَا فِي قُلُوبِهِمْ مِنَ الْجَزَعِ وَالْهَلَعِ، وَأَكِلُ أَقْوَامًا إِلَى مَا جَعَلَ اللَّهُ فِي قُلُوبِهِمْ مِنَ الْغِنَى وَالْخَيْرِ مِنْهُمْ عَمْرُو بْنُ تَغْلِبَ ‏\"‏‏.‏ فَقَالَ عَمْرٌو مَا أُحِبُّ أَنَّ لِي بِكَلِمَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم حُمْرَ النَّعَمِ‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏إِنَّ الإِنْسَانَ خُلِقَ هَلُوعًا * إِذَا مَسَّهُ الشَّرُّ جَزُوعًا * وَإِذَا مَسَّهُ الْخَيْرُ مَنُوعًا}",
                "headingUrdu": "’’بے شک انسان بہت بے صبرا پیدا کیا گیا ہے۔ جب برائی اسے چھوتی ہے تو چڑچڑا ہوتا ہے۔ اور بخل کرتے ہوئے جب اسے کوئی بھلائی پہنچتی ہے۔\"",
                "headingEnglish": "“Verily, man was created very impatient. Irritable when evil touches him. And niggardly when good touches him.”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7225,
                "hadithNumber": "7536",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"My Lord says, 'If My slave comes nearer to me for a span, I go nearer to him for a cubit; and if he comes nearer to Me for a cubit, I go nearer to him for the span of outstretched arms; and if he comes to Me walking, I go to him running.' \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اپنے رب سے روایت کیا کہ اللہ پاک فرماتا ہے کہ جب بندہ مجھ سے ایک بالشت قریب ہوتا ہے تو میں ایک ہاتھ اس سے قریب ہوتا ہوں اور جب بندہ مجھ سے ایک ہاتھ قریب ہوتا ہے تو میں اس سے دو ہاتھ قریب ہوتا ہوں اور جب وہ میرے پاس پیدل چل کر آتا ہے تو میں دوڑ کر آ جاتا ہوں ۔",
                "urduNarrator": "مجھ سے محمد بن عبد الرحیم نے بیان کیا ‘ کہا ہم سے ابوزید بن ربیع ہروی نے ‘ کہا ہم سے شعبہ نے ‘ ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا أَبُو زَيْدٍ، سَعِيدُ بْنُ الرَّبِيعِ الْهَرَوِيُّ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم يَرْوِيهِ عَنْ رَبِّهِ، قَالَ ‏ \"‏ إِذَا تَقَرَّبَ الْعَبْدُ إِلَىَّ شِبْرًا تَقَرَّبْتُ إِلَيْهِ ذِرَاعًا، وَإِذَا تَقَرَّبَ مِنِّي ذِرَاعًا تَقَرَّبْتُ مِنْهُ بَاعًا، وَإِذَا أَتَانِي مَشْيًا أَتَيْتُهُ هَرْوَلَةً ‏\"‏‏.‏",
                "headingArabic": "ذِكْرِ النَّبِيِّ صلى الله عليه وسلم وَرِوَايَتِهِ عَنْ رَبِّهِ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنے رب کے ارشادات کا ذکر کیا اور بیان کیا۔",
                "headingEnglish": "What the Prophet (saws) mentioned and narrated of his Lord’s Sayings",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7226,
                "hadithNumber": "7537",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Perhaps the Prophet (ﷺ) mentioned the following (as Allah's Saying): \"If My slave comes nearer to Me for a span, I go nearer to him for a cubit; and if he comes nearer to Me for a cubit; I go nearer to him for the span of outstretched arms. Motamir states that he heard it from his father, he from Hadrat Anas رضی اللہ عنہ that the prophet ﷺ reports it from his Lord.",
                "hadithUrdu": "اکثر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ( اللہ تعالیٰ فرماتا ہے کہ ) جب بندہ مجھ سے ایک بالشت قریب ہوتا ہے تو میں اس سے ایک ہاتھ قریب ہو جاتا ہوں اور جب وہ ایک ہاتھ قریب آتا ہے تو میں اس سے دو ہاتھ قریب ہوتا ہوں ۔ اور معتمر نے کہا کہ میں نے اپنے والد سے سنا ‘ انہوں نے انس رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم اپنے رب عزوجل سے روایت کرتے تھے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘ ان سے یحییٰ نے ‘ ان سے تمیمی نے ‘ ان سے انس بن مالک رضی اللہ عنہ نے اور ان سے ابوہریر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنِ التَّيْمِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ـ رُبَّمَا ذَكَرَ النَّبِيَّ صلى الله عليه وسلم ـ قَالَ ‏ \"‏ إِذَا تَقَرَّبَ الْعَبْدُ مِنِّي شِبْرًا تَقَرَّبْتُ مِنْهُ ذِرَاعًا وَإِذَا تَقَرَّبَ مِنِّي ذِرَاعًا تَقَرَّبْتُ مِنْهُ بَاعًا أَوْ بُوعًا ‏\"‏‏.‏ وَقَالَ مُعْتَمِرٌ سَمِعْتُ أَبِي، سَمِعْتُ أَنَسًا، ‏{‏عَنْ أَبِي هُرَيْرَةَ،‏}‏ عَنِ النَّبِيِّ صلى الله عليه وسلم يَرْوِيهِ عَنْ رَبِّهِ، عَزَّ وَجَلَّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7227,
                "hadithNumber": "7538",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said that your Lord said, \"Every (sinful) deed can be expiated; and the fast is for Me, so I will give the reward for it; and the smell which comes out of the mouth of a fasting person, is better in Allah's Sight than the smell of musk.\" (See Hadith No. 584)",
                "hadithUrdu": "ان سے نبی کریم صلی اللہ علیہ وسلم نے ‘ اللہ تعالیٰ سے روایت کرتے ہیں کہ پروردگار نے فرمایا ہر گناہ کا ایک کفارہ ہے ( جس سے وہ گناہ معاف ہو جاتا ہے ) اور روز خاص میرے لیے ہے اور میں ہی اس کی جزا دوں گا اور روزہ دار کے منہ کی بو اللہ کے نزدیک مشک کی خوشبو سے بڑھ کر ہے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ کہا ہم سے محمد بن زیاد نے بیان کیا ‘ کہا کہ میں نے ابویرہ رضی اللہ عنہ سے سنا‘",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم يَرْوِيهِ عَنْ رَبِّكُمْ، قَالَ ‏ \"‏ لِكُلِّ عَمَلٍ كَفَّارَةٌ، وَالصَّوْمُ لِي وَأَنَا أَجْزِي بِهِ، وَلَخَلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7228,
                "hadithNumber": "7539",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said that his Lord said: \"It does not befit a slave that he should say that he is better than Jonah (Yunus) bin Matta him to his father.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اپنے پروردگار سے روایت کیا پروردگار نے فرمایا کہ کسی بندے کے لئے مناسب نہیں کہ یہ کہے کہ میں یونس بن متی سے بہتر ہوں اور آپ نے یونس کو ان کے باپ کی طرف نسبت دی ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے قتادہ نے ( دوسری سند ) اور امام بخاری نے کہا کہ مجھ سے خلفیہ بن خیاط نے بیان کیا ‘ کہا ہم سے یزید بن زریع نے بیان کیا ‘ ان سے سعید نے ‘ ان سے قتادہ نے ‘ ان سے ابو العالیہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ،‏.‏ وَقَالَ لِي خَلِيفَةُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم فِيمَا يَرْوِيهِ عَنْ رَبِّهِ قَالَ ‏ \"‏ لاَ يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ إِنَّهُ خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏‏.‏ وَنَسَبَهُ إِلَى أَبِيهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7229,
                "hadithNumber": "7540",
                "englishNarrator": "Narrated `Abdullah bin Al-Maghaffal Al-Muzani رضی اللہ عنہ :",
                "hadithEnglish": "\"I saw Allah's Messenger (ﷺ) on the day of the Conquest of Mecca, riding his she-camel and reciting Surat-al-Fath (48) or part of Surat-al-Fath. He recited it in a vibrating and pleasant voice. Then Mu'awiya recited as `Abdullah bin Mughaffal had done and said, \"Were I not afraid that the people would crowd around me, I would surely recite in a vibrating pleasant voice as Ibn Mughaffal did, imitating the Prophet.\" I asked Muawiya, \"How did he recite in that tone?\" He said thrice, \"A, A , A.\"",
                "hadithUrdu": "میں نے فتح مکہ کے دن رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ اپنی ایک اونٹنی پر سوار تھے اور سورۃ الفتح پڑھ رہے تھے یا سورۃ الفتح میں سے کچھ آیات پڑھ رہے تھے ۔ انہوں نے بیان کیا کہ پھر آپ نے اس میں ترجیع کی ۔ شعبہ نے کہا یہ حدیث بیان کر کے معاویہ نے اس طرح آواز دہرا کر قرآت کی جیسے عبداللہ بن مغفل کیا کرتے تھے اور معاویہ نے کہا اگر مجھ کو اس کا خیال نہ ہوتا کہ لوگ تمہارے پاس جمع ہو کر ہجوم کریں گے تو میں اسی طرح آواز دہرا کر قرآت کرتا جس طرح عبداللہ بن مغفل نے آنحضرت صلی اللہ علیہ وسلم کی طرح آواز دہرانے کو نقل کیا تھا ۔ شعبہ نے کہا میں نے معاویہ سے پوچھا ابن مغفل کیوں کر آواز دہراتے تھے ؟ انہوں نے کہا آآآ تین تین بار مد کے ساتھ آواز دہراتے تھے ۔",
                "urduNarrator": "ہم سے احمد بن ابی سریح نے بیان کیا ‘ کہا ہم کو شبابہ نے خبر دی ‘ کہا ہم سے شعبہ نے بیان کیا ‘ان سے معاویہ بن قرہ نے ‘ ان سے عبداللہ بن مغفل مزنی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي سُرَيْجٍ، أَخْبَرَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ الْمُزَنِيِّ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَوْمَ الْفَتْحِ عَلَى نَاقَةٍ لَهُ يَقْرَأُ سُورَةَ الْفَتْحِ، أَوْ مِنْ سُورَةِ الْفَتْحِ ـ قَالَ ـ فَرَجَّعَ فِيهَا ـ قَالَ ـ ثُمَّ قَرَأَ مُعَاوِيَةُ يَحْكِي قِرَاءَةَ ابْنِ مُغَفَّلٍ وَقَالَ ‏ \"‏ لَوْلاَ أَنْ يَجْتَمِعَ النَّاسُ عَلَيْكُمْ لَرَجَّعْتُ كَمَا رَجَّعَ ابْنُ مُغَفَّلٍ ‏\"‏‏.‏ يَحْكِي النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ لِمُعَاوِيَةَ كَيْفَ كَانَ تَرْجِيعُهُ قَالَ آ آ آ ثَلاَثَ مَرَّاتٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7230,
                "hadithNumber": "7541",
                "englishNarrator": "Narrated Abu Sufyan bin Harb:",
                "hadithEnglish": "Heraclius called for his translator and then asked for the letter of the Prophet (ﷺ), and the former read it (thus): \r\n\"In the Name of Allah, the Most Gracious, the Merciful. (This letter is) from Muhammad bin 'Abdullah, to Heraclius.\r\n \"...O people of the Scripture (Jews and Christians): Come to a word that is just between us and you that we worship none but Allah...\" (V.3:64)",
                "hadithUrdu": "ہرقل نے اپنے ترجمان کو بلایا ۔ پھر نبی کریم صلی اللہ علیہ وسلم کا خط منگوایا اور اسے پڑھا ۔ شروع اللہ کے نام سے جو بہت نہایت رحم کرنے والا بڑا مہربان ہے ۔ اللہ کے بندے اور اس کے رسول محمد صلی اللہ علیہ وسلم کی طرف سے ہرقل کی جانب ۔ پھر یہ آیت لکھی تھی کہ اے کتاب والو ! اس بات پر آ جاؤ جو ہم میں تم میں یکساں مانی جاتی ہے آخر آیت تک ۔",
                "urduNarrator": "اور ابن عباس رضی اللہ عنہما نے بیان کیا کہ مجھے ابوسفیان بن حرب نے خبر دی کہ",
                "hadithArabic": "وَقَالَ ابْنُ عَبَّاسٍ أَخْبَرَنِي أَبُو سُفْيَانَ بْنُ حَرْبٍ، أَنَّ هِرَقْلَ، دَعَا تَرْجُمَانَهُ، ثُمَّ دَعَا بِكِتَابِ النَّبِيِّ صلى الله عليه وسلم فَقَرَأَهُ ‏\"‏ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ مِنْ مُحَمَّدٍ عَبْدِ اللَّهِ وَرَسُولِهِ إِلَى هِرَقْلَ، وَ‏{‏يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ ‏}‏‏\"‏ الآيَةَ‏.‏",
                "headingArabic": "مَا يَجُوزُ مِنْ تَفْسِيرِ التَّوْرَاةِ وَغَيْرِهَا مِنْ كُتُبِ اللَّهِ بِالْعَرَبِيَّةِ وَغَيْرِهَا",
                "headingUrdu": "تورات اور دیگر مقدس کتابوں کی تفسیر کے حوالے سے کیا جائز ہے؟",
                "headingEnglish": "What is allowed as regards the interpretation of the Taurat and other Holy Books",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7201,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=288",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=286",
                "label": "286",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=287",
                "label": "287",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=288",
                "label": "288",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=289",
                "label": "289",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=290",
                "label": "290",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=291",
                "label": "291",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=292",
                "label": "292",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=290",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=290",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=288",
        "to": 7225,
        "total": 40465
    }
}