{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 73,
        "data": [
            {
                "id": 1802,
                "hadithNumber": "1878",
                "englishNarrator": "Narrated Usama رضی اللہ عنہما :",
                "hadithEnglish": "Once the Prophet (ﷺ) stood at the top of a (looked out from upon one) castle amongst the castles (or the high buildings) of Medina and said, \"Do you see what I see? (No doubt) I see the spots where afflictions will take place among your houses (and these afflictions will be) as numerous as the spots where raindrops fall.\" This tradition has been followed by Muammar and Sulaiman bin Kathir on the authority of Zuhri.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم مدینہ کے محلات میں سے ایک محل یعنی اونچے مکان پر چڑھے پھر فرمایا کہ جو کچھ میں دیکھ رہا ہوں کیا تمہیں نظر آ رہا ہے ؟ میں بوندوں کے گرنے کی جگہ کی طرح تمہارے گھروں پر فتنوں کے نازل ہونے کی جگہوں کو دیکھ رہا ہوں ۔ اس روایت کی متابعت معمر اور سلیمان بن کثیر نے زہری کے واسطہ سے کی ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابن شہاب زہری نے ، کہا کہ مجھے عروہ نے خبر دی اور انہوں نے اسامہ بن زید رضی اللہ عنہما سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، سَمِعْتُ أُسَامَةَ ـ رضى الله عنه ـ قَالَ أَشْرَفَ النَّبِيُّ صلى الله عليه وسلم عَلَى أُطُمٍ مِنْ آطَامِ الْمَدِينَةِ فَقَالَ ‏ \"‏ هَلْ تَرَوْنَ مَا أَرَى إِنِّي لأَرَى مَوَاقِعَ الْفِتَنِ خِلاَلَ بُيُوتِكُمْ كَمَوَاقِعِ الْقَطْرِ ‏\"‏‏.‏ تَابَعَهُ مَعْمَرٌ وَسُلَيْمَانُ بْنُ كَثِيرٍ عَنِ الزُّهْرِيِّ‏.‏",
                "headingArabic": "آطَامِ الْمَدِينَةِ",
                "headingUrdu": "المدینہ کی اونچی عمارتیں۔",
                "headingEnglish": "The high buildings of Al-Madina",
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1803,
                "hadithNumber": "1879",
                "englishNarrator": "Narrated Abu Bakra رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The terror caused by Al-Masih Ad-Dajjal will not enter Medina and at that time Medina will have seven gates and there will be two angels at each gate guarding them.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مدینہ پر دجال کا رعب بھی نہیں پڑے گا اس دور میں مدینہ کے سات دورازے ہوں گے اور ہر دروازے پر دو فرشتے ہوں گے ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والد نے ، ان سے ان کے دادا نے اور ان سے ابوبکرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَدْخُلُ الْمَدِينَةَ رُعْبُ الْمَسِيحِ الدَّجَّالِ، لَهَا يَوْمَئِذٍ سَبْعَةُ أَبْوَابٍ، عَلَى كُلِّ باب مَلَكَانِ ‏\"‏‏.‏",
                "headingArabic": "لاَ يَدْخُلُ الدَّجَّالُ الْمَدِينَةَ",
                "headingUrdu": "دجال مدینہ میں داخل نہیں ہو سکے گا۔",
                "headingEnglish": "Ad-Dajjal will not be able to enter Al-Madina",
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1804,
                "hadithNumber": "1880",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"There are angels guarding the entrances (or roads) of Medina, neither plague nor Ad-Dajjal will be able to enter it.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ مدینہ کے راستوں پر فرشتے ہیں نہ اس میں طاعون آ سکتا ہے نہ دجال ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا کہ مجھے سے امام مالک نے بیان کیا ، ان سے نعیم بن عبداللہ المجمر نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ ‏ \"‏ عَلَى أَنْقَابِ الْمَدِينَةِ مَلاَئِكَةٌ، لاَ يَدْخُلُهَا الطَّاعُونُ وَلاَ الدَّجَّالُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1805,
                "hadithNumber": "1881",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"There will be no town which Ad-Dajjal will not enter except Mecca and Medina, and there will be no entrance (road) (of both Mecca and Medina) but the angels will be standing in rows guarding it against him, and then Medina will shake with its inhabitants thrice (i.e. three earthquakes will take place) and Allah will expel all the non-believers and the hypocrites from it.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا کوئی ایسا شہر نہیں ملے گا جسے دجال پامال نہ کرے گا ، سوائے مکہ اور مدینہ کے ، ان کے ہر راستے پر صف بستہ فرشتے کھڑے ہوں گے جو ان کی حفاظت کریں گے پھر مدینہ کی زمین تین مرتبہ کانپے گی جس سے ایک ایک کافر اور منافق کو اللہ تعالیٰ اس میں سے باہر کر دے گا ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، ان سے ولید نے بیان کیا ، ان سے ابوعمرو اوزاعی نے بیان کیا ، ان سے اسحٰق نے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا أَبُو عَمْرٍو، حَدَّثَنَا إِسْحَاقُ، حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيْسَ مِنْ بَلَدٍ إِلاَّ سَيَطَؤُهُ الدَّجَّالُ، إِلاَّ مَكَّةَ وَالْمَدِينَةَ، لَيْسَ لَهُ مِنْ نِقَابِهَا نَقْبٌ إِلاَّ عَلَيْهِ الْمَلاَئِكَةُ صَافِّينَ، يَحْرُسُونَهَا، ثُمَّ تَرْجُفُ الْمَدِينَةُ بِأَهْلِهَا ثَلاَثَ رَجَفَاتٍ، فَيُخْرِجُ اللَّهُ كُلَّ كَافِرٍ وَمُنَافِقٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1806,
                "hadithNumber": "1882",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) told us a long narrative about Ad-Dajjal, and among the many things he mentioned, was his saying, \"Ad-Dajjal will come and it will be forbidden for him to pass through the entrances of Medina. He will land in some of the salty barren areas (outside) Medina; on that day the best man or one of the best men will come up to him and say, 'I testify that you are the same Dajjal whose description was given to us by Allah's Messenger (ﷺ) .' Ad-Dajjal will say to the people, 'If I kill this man and bring him back to life again, will you doubt my claim?' They will say, 'No.' Then Ad-Dajjal will kill that man and bring him back to life. That man will say, 'Now I know your reality better than before.' Ad-Dajjal will say, 'I want to kill him but I cannot.' \"",
                "hadithUrdu": "ہم سے رسول اللہ صلی اللہ علیہ وسلم نے دجال کے متعلق ایک لمبی حدیث بیان کی ، آپ صلی اللہ علیہ وسلم نے اپنی حدیث میں یہ بھی فرمایا تھا کہ دجال مدینہ کی ایک کھاری شور زمین تک پہنچے گا اس پر مدینہ میں داخلہ تو حرام ہو گا ۔ ( مدینہ سے ) اس دن ایک شخص اس کی طرف نکل کر بڑھے گا ، یہ لوگوں میں ایک بہترین نیک مرد ہو گا یا ( یہ فرمایا کہ ) بزرگ ترین لوگوں میں سے ہو گا وہ شخص کہے گا کہ میں گواہی دیتا ہوں کہ تو وہی دجال ہے جس کے متعلق ہمیں رسول اللہ صلی اللہ علیہ وسلم نے اطلاع دی تھی دجال کہے گا کیا میں اسے قتل کر کے پھر زندہ کر ڈالوں تو تم لوگوں کو میرے معاملہ میں کوئی شبہ رہ جائے گا ؟ اس کے حواری کہیں گے نہیں ، چنانچہ دجال انہیں قتل کر کے پھر زندہ کر دے گا ۔ جب دجال انہیں زندہ کر دے گا تو وہ بندہ کہے گا بخدا اب تو مجھ کو پورا حال معلوم ہو گیا کہ تو ہی دجال ہے دجال کہے گا لاؤ اسے پھر قتل کر دوں لیکن اس مرتبہ وہ قابو نہ پا سکے گا ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، انہوں نے بیان کیا کہ مجھے عبیداللہ بن عتبہ نے خبر دی کہ ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حَدِيثًا طَوِيلاً عَنِ الدَّجَّالِ، فَكَانَ فِيمَا حَدَّثَنَا بِهِ أَنْ قَالَ ‏ \"‏ يَأْتِي الدَّجَّالُ ـ وَهُوَ مُحَرَّمٌ عَلَيْهِ أَنْ يَدْخُلَ نِقَابَ الْمَدِينَةِ ـ بَعْضَ السِّبَاخِ الَّتِي بِالْمَدِينَةِ، فَيَخْرُجُ إِلَيْهِ يَوْمَئِذٍ رَجُلٌ، هُوَ خَيْرُ النَّاسِ ـ أَوْ مِنْ خَيْرِ النَّاسِ ـ فَيَقُولُ أَشْهَدُ أَنَّكَ الدَّجَّالُ، الَّذِي حَدَّثَنَا عَنْكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَدِيثَهُ، فَيَقُولُ الدَّجَّالُ أَرَأَيْتَ إِنْ قَتَلْتُ هَذَا ثُمَّ أَحْيَيْتُهُ، هَلْ تَشُكُّونَ فِي الأَمْرِ فَيَقُولُونَ لاَ‏.‏ فَيَقْتُلُهُ، ثُمَّ يُحْيِيهِ فَيَقُولُ حِينَ يُحْيِيهِ وَاللَّهِ مَا كُنْتُ قَطُّ أَشَدَّ بَصِيرَةً مِنِّي الْيَوْمَ، فَيَقُولُ الدَّجَّالُ أَقْتُلُهُ فَلاَ أُسَلَّطُ عَلَيْهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1807,
                "hadithNumber": "1883",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "A bedouin came to the Prophet (ﷺ) and gave a pledge of allegiance for embracing Islam. The next day he came with fever and said (to the Prophet (ﷺ) ), \"Please cancel my pledge (of embracing Islam and of emigrating to Medina).\" The Prophet (ﷺ) refused (that request) three times and said, \"Medina is like a furnace, it expels out the impurities (bad persons) and selects the good ones and makes them perfect.\"",
                "hadithUrdu": "ایک اعرابی نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر اسلام پر بیعت کی ، دوسرے دن آیا تو اسے بخار چڑھا ہوا تھا کہنے لگا کہ میری بیعت توڑ دیجئیے ! تین بار اس نے یہی کہا آپ صلی اللہ علیہ وسلم نے انکار کیا پھر فرمایا کہ مدینہ کی مثال بھٹی کی سی ہے کہ میل کچیل کو دور کر کے خالص جوہر کو نکھار دیتی ہے ۔",
                "urduNarrator": "ہم سے عمرو بن عباس نے بیان کیا ، کہا ہم سے عبدالرحمٰن نے بیان کیا ، ان سے سفیان نے بیان کیا ، ان سے محمد بن منکدر نے اور ان سے جابر رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ ـ رضى الله عنه ـ جَاءَ أَعْرَابِيٌّ النَّبِيَّ صلى الله عليه وسلم فَبَايَعَهُ عَلَى الإِسْلاَمِ، فَجَاءَ مِنَ الْغَدِ مَحْمُومًا، فَقَالَ أَقِلْنِي، فَأَبَى ثَلاَثَ مِرَارٍ، فَقَالَ ‏ \"‏ الْمَدِينَةُ كَالْكِيرِ، تَنْفِي خَبَثَهَا، وَيَنْصَعُ طَيِّبُهَا ‏\"‏‏.‏",
                "headingArabic": "الْمَدِينَةُ تَنْفِي الْخَبَثَ",
                "headingUrdu": "المدینہ تمام برے اور برے لوگوں کو نکال دیتا ہے۔",
                "headingEnglish": "Al-Madina expels all the evil and bad persons",
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1808,
                "hadithNumber": "1884",
                "englishNarrator": "Narrated Zaid bin Thabit رضی اللہ عنہ :",
                "hadithEnglish": "When the Prophet (ﷺ) went out for (the battle of) Uhud, some of his companions (hypocrites) returned (home). A party of the believers remarked that they would kill those (hypocrites) who had returned, but another party said that they would not kill them. So, this Divine Inspiration was revealed: \"Then what is the matter with you that you are divided into two parties concerning the hypocrites.\" (4.88) The Prophet (ﷺ) said, \"Medina expels the bad persons from it, as fire expels the impurities of iron.\"",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ سلم جنگ احد کے لیے نکلے تو جو لوگ آپ صلی اللہ علیہ وسلم کے ساتھ تھے ان میں سے کچھ لوگ واپس آ گئے ( یہ منافقین تھے ) پھر بعض نے تو یہ کہا کہ ہم چل کر انہیں قتل کر دیں گے اور ایک جماعت نے کہا کہ قتل نہ کرنا چاہئے اس پر یہ آیت نازل ہوئی «فما لكم في المنافقين فئتين‏» اور نبی کریم صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ مدینہ ( برے ) لوگوں کو اس طرح دور کر دیتا ہے جس طرح آگ میل کچیل دور کر دیتی ہے ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عدی بن ثابت نے ، ان سے عبداللہ بن یزید نے بیان کیا کہ میں نے زید بن ثابت رضی اللہ عنہ سے سنا ، آپ فرما رہے تھے کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ سَمِعْتُ زَيْدَ بْنَ ثَابِتٍ ـ رضى الله عنه ـ يَقُولُ لَمَّا خَرَجَ النَّبِيُّ صلى الله عليه وسلم إِلَى أُحُدٍ رَجَعَ نَاسٌ مِنْ أَصْحَابِهِ فَقَالَتْ فِرْقَةٌ نَقْتُلُهُمْ‏.‏ وَقَالَتْ فِرْقَةٌ لاَ نَقْتُلُهُمْ‏.‏ فَنَزَلَتْ ‏{‏فَمَا لَكُمْ فِي الْمُنَافِقِينِ فِئَتَيْنِ‏}‏ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّهَا تَنْفِي الرِّجَالَ كَمَا تَنْفِي النَّارُ خَبَثَ الْحَدِيدِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1809,
                "hadithNumber": "1885",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"O Allah! Bestow on Medina twice the blessings You bestowed on Mecca.\" Uthman bin Umer has corroborated him from Younus.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کے اے اللہ ! جتنی مکہ میں برکت عطا فرمائی ہے مدینہ میں اس سے دگنی برکت کر ۔ جریر کے ساتھ اس روایت کی متابعت عثمان بن عمر نے یونس کے واسطہ کے ساتھ کی ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا ہم سے وہب بن جریر نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، انہوں نے یونس بن شہاب سے سنا اور انہوں نے انس رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، سَمِعْتُ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ اللَّهُمَّ اجْعَلْ بِالْمَدِينَةِ ضِعْفَىْ مَا جَعَلْتَ بِمَكَّةَ مِنَ الْبَرَكَةِ ‏\"‏‏.‏ تَابَعَهُ عُثْمَانُ بْنُ عُمَرَ عَنْ يُونُسَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1810,
                "hadithNumber": "1886",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Whenever the Prophet (ﷺ) returned from a journey and observed the walls of Medina, he would make his Mount go fast, and if he was on an animal (i.e. a horse), he would make it gallop because of his love for Medina.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب کبھی سفر سے واپس آتے اور مدینہ کی دیواروں کو دیکھتے تو اپنی سواری تیز فرما دیتے اور اگر کسی جانور کی پشت پر ہوتے تو مدینہ کی محبت میں اسے ایڑ لگاتے ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا قَدِمَ مِنْ سَفَرٍ، فَنَظَرَ إِلَى جُدُرَاتِ الْمَدِينَةِ أَوْضَعَ رَاحِلَتَهُ، وَإِنْ كَانَ عَلَى دَابَّةٍ، حَرَّكَهَا مِنْ حُبِّهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1811,
                "hadithNumber": "1887",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "(The people of) Bani Salama intended to shift near the mosque (of the Prophet) but Allah's Messenger (ﷺ) disliked to see Medina vacated and said, \"O the people of Bani Salama! Don't you think that you will be rewarded for your footsteps which you take towards the mosque?\" So, they stayed at their old places.",
                "hadithUrdu": "اپنے دور والے مکانات چھوڑ کر مسجد نبوی سے قریب اقامت اختیار کر لیں لیکن رسول اللہ صلی اللہ علیہ وسلم نے یہ پسند نہ کیا کہ مدینہ کے کسی حصہ سے بھی رہائش ترک کی جائے ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے بنو سلمہ ! تم اپنے قدموں کا ثواب نہیں چاہتے ، چنانچہ بنوسلمہ نے ( اپنی اصلی اقامت گاہ میں ) رہائش باقی رکھی ۔",
                "urduNarrator": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، کہا کہ ہمیں مروان بن معاویہ فزاری نے خبر دی ، انہیں حمید طویل نے خبر دی اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ بنو سلمہ نے چاہا کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا الْفَزَارِيُّ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أَرَادَ بَنُو سَلِمَةَ أَنْ يَتَحَوَّلُوا، إِلَى قُرْبِ الْمَسْجِدِ، فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُعْرَى الْمَدِينَةُ، وَقَالَ ‏ \"‏ يَا بَنِي سَلِمَةَ‏.‏ أَلاَ تَحْتَسِبُونَ آثَارَكُمْ ‏\"‏‏.‏ فَأَقَامُوا‏.‏",
                "headingArabic": "كَرَاهِيَةِ النَّبِيِّ صلى الله عليه وسلم أَنْ تُعْرَى الْمَدِينَةُ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی یہ ناپسندیدگی کہ مدینہ خالی کر دیا جائے۔",
                "headingEnglish": "The dislike of the Prophet (saws) that Al-Madina should be vacated",
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1812,
                "hadithNumber": "1888",
                "englishNarrator": "Narrated Abu Huraira رضى الله عنه :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"There is a garden from the gardens of Paradise between my house and my pulpit, and my pulpit is on my Lake Fount (Al-Kauthar).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میرے گھر اور میرے منبر کے درمیان ( والی جگہ ) جنت کے باغوں میں سے ایک باغ ہے اور میرا منبر قیامت کے دن میرے حوض ( کوثر ) پر ہو گا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، ان سے یحییٰ قطان نے بیان کیا ، ان سے عبیداللہ بن عمر نے بیان کیا کہ مجھ سے خبیب بن عبدالرحمٰن نے بیان کیا ، ان سے حفص بن عاصم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، قَالَ حَدَّثَنِي خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ، وَمِنْبَرِي عَلَى حَوْضِي ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1813,
                "hadithNumber": "1889",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) reached Medina, Abu Bakr and Bilal رضی اللہ عنہما became ill. When Abu Bakr's fever got worse, he would recite (this poetic verse): \"Everybody is staying alive with his People, yet Death is nearer to him than His shoe laces.\" And Bilal, when his fever deserted him, would recite: \"Would that I could stay overnight in A valley wherein I would be Surrounded by Idhkhir and Jalil (kinds of goodsmelling grass). Would that one day I could Drink the water of the Majanna, and Would that (The two mountains) Shama and Tafil would appear to me!\" The Prophet (ﷺ) said, \"O Allah! Curse Shaiba bin Rabi`a and `Utba bin Rabi`a and Umaiya bin Khalaf as they turned us out of our land to the land of epidemics.\" Allah's Messenger (ﷺ) then said, \"O Allah! Make us love Medina as we love Mecca or even more than that. O Allah! Give blessings in our Sa and our Mudd (measures symbolizing food) and make the climate of Medina suitable for us, and divert its fever towards Aljuhfa.\" Aisha رضی اللہ عنہا added: When we reached Medina, it was the most unhealthy of Allah's lands, and the valley of Bathan (the valley of Medina) used to flow with impure colored water.",
                "hadithUrdu": "جب رسول کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو ابوبکر اور بلال رضی اللہ عنہما بخار میں مبتلا ہو گئے ، ابوبکر رضی اللہ عنہ جب بخار میں مبتلا ہوئے تو یہ شعر پڑھتے :  ہر آدمی اپنے گھر والوں میں صبح کرتا ہے حالانکہ اس کی موت اس کی جوتی کے تسمہ سے بھی زیادہ قریب ہے ۔ اور بلال رضی اللہ عنہ کا جب بخار اترتا تو آپ بلند آواز سے یہ اشعار پڑھتے :  کاش ! میں ایک رات مکہ کی وادی میں گزار سکتا اور میرے چاروں طرف اذخر اور جلیل ( گھاس ) ہوتیں ۔  کاش ! ایک دن میں مجنہ کے پانی پر پہنچتا اور کاش ! میں شامہ اور طفیل ( پہاڑوں ) کو دیکھ سکتا ۔ کہا کہ اے میرے اللہ ! شیبہ بن ربیعہ ، عتبہ بن ربیعہ اور امیہ بن خلف مردودوں پر لعنت کر ۔ انہوں نے اپنے وطن سے اس وبا کی زمین میں نکالا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے یہ سن کر فرمایا اے اللہ ! ہمارے دلوں میں مدینہ کی محبت اسی طرح پیدا کر دے جس طرح مکہ کی محبت ہے بلکہ اس سے بھی زیادہ ! اے اللہ ! ہمارے صاع اور ہمارے مد میں برکت عطا فرما اور مدینہ کی آب و ہوا ہمارے لیے صحت خیز کر دے یہاں کے بخار کو جحیفہ میں بھیج دے ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ جب ہم مدینہ آئے تو یہ خدا کی سب سے زیادہ وبا والی سر زمین تھی ۔ انہوں نے کہا مدینہ میں بطحان نامی ایک نالہ سے ذرا ذرا بدمزہ اور بدبودار پانی بہا کرتا تھا ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وُعِكَ أَبُو بَكْرٍ وَبِلاَلٌ، فَكَانَ أَبُو بَكْرٍ إِذَا أَخَذَتْهُ الْحُمَّى يَقُولُ كُلُّ امْرِئٍ مُصَبَّحٌ فِي أَهْلِهِ وَالْمَوْتُ أَدْنَى مِنْ شِرَاكِ نَعْلِهِ وَكَانَ بِلاَلٌ إِذَا أُقْلِعَ عَنْهُ الْحُمَّى يَرْفَعُ عَقِيرَتَهُ يَقُولُ أَلاَ لَيْتَ شِعْرِي هَلْ أَبِيتَنَّ لَيْلَةً بِوَادٍ وَحَوْلِي إِذْخِرٌ وَجَلِيلُ وَهَلْ أَرِدَنْ يَوْمًا مِيَاهَ مَجَنَّةٍ وَهَلْ يَبْدُوَنْ لِي شَامَةٌ وَطَفِيلُ قَالَ اللَّهُمَّ الْعَنْ شَيْبَةَ بْنَ رَبِيعَةَ، وَعُتْبَةَ بْنَ رَبِيعَةَ، وَأُمَيَّةَ بْنَ خَلَفٍ، كَمَا أَخْرَجُونَا مِنْ أَرْضِنَا إِلَى أَرْضِ الْوَبَاءِ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَحُبِّنَا مَكَّةَ أَوْ أَشَدَّ، اللَّهُمَّ بَارِكْ لَنَا فِي صَاعِنَا، وَفِي مُدِّنَا، وَصَحِّحْهَا لَنَا وَانْقُلْ حُمَّاهَا إِلَى الْجُحْفَةِ ‏\"‏‏.‏ قَالَتْ وَقَدِمْنَا الْمَدِينَةَ، وَهْىَ أَوْبَأُ أَرْضِ اللَّهِ‏.‏ قَالَتْ فَكَانَ بُطْحَانُ يَجْرِي نَجْلاً‏.‏ تَعْنِي مَاءً آجِنًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1814,
                "hadithNumber": "1890",
                "englishNarrator": "Narrated `Umar رضی اللہ عنہ :",
                "hadithEnglish": "O Allah! Grant me martyrdom in Your cause, and let my death be in the city of Your Apostle.\" Ibn-e-Jurai, Rauh bin Qasim, Zaid bin Aslam, her mother, Hadrat Hafsa bin Umer رضی اللہ عنہ reports: I heard from Hadrat Umer رضی اللہ عنہ the same. Hisham, Zaid, his father, Hadrat Hafsah رضی اللہ عنہا reports: I heard from Hadrat Umer  رضی اللہ عنہ .",
                "hadithUrdu": "اے اللہ ! مجھے اپنے راستے میں شہادت عطا کر اور میری موت اپنے رسول صلی اللہ علیہ وسلم کے شہر میں مقدر کر دے ۔ ابن زریع نے روح بن قاسم سے ، انہوں نے زید بن اسلم سے ، انہوں نے اپنی والدہ سے ، انہوں نے حفصہ بنت عمر رضی اللہ عنہما سے بیان کیا کہ میں نے عمر رضی اللہ عنہ سے اسی طرح سنا تھا ، ہشام نے بیان کیا ، ان سے زید نے ، ان سے ان کے والد نے ، ان سے حفصہ رضی اللہ عنہا نے کہ میں نے عمر رضی اللہ عنہ سے سنا پھر یہی حدیث روایت کی ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، ان سے خالد بن یزید نے ، ان سے سعید بن ابی ہلال نے ، ان سے زید بن اسلم نے ، ان سے ان کے والد نے اور ان سے عمر رضی اللہ عنہ نے جو فرمایا کرتے تھے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ خَالِدِ بْنِ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، عَنْ عُمَرَ ـ رضى الله عنه ـ قَالَ اللَّهُمَّ ارْزُقْنِي شَهَادَةً فِي سَبِيلِكَ، وَاجْعَلْ مَوْتِي فِي بَلَدِ رَسُولِكَ صلى الله عليه وسلم‏.‏ وَقَالَ ابْنُ زُرَيْعٍ عَنْ رَوْحِ بْنِ الْقَاسِمِ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أُمِّهِ، عَنْ حَفْصَةَ بِنْتِ عُمَرَ ـ رضى الله عنهما ـ قَالَتْ سَمِعْتُ عُمَرَ، نَحْوَهُ‏.‏ وَقَالَ هِشَامٌ عَنْ زَيْدٍ، عَنْ أَبِيهِ، عَنْ حَفْصَةَ، سَمِعْتُ عُمَرَ، رضى الله عنه‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "30",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 30,
                    "chapterNumber": "30",
                    "chapterEnglish": "Virtues of Madinah",
                    "chapterUrdu": "مدینہ کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل المدينة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1815,
                "hadithNumber": "1891",
                "englishNarrator": "Narrated Talha bin 'Ubaidullah رضی اللہ عنہ :",
                "hadithEnglish": "A bedouin with unkempt hair came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Inform me what Allah has made compulsory for me as regards the prayers.\" He replied: \"You have to offer perfectly the five compulsory prayers in a day and night (24 hours), unless you want to pray Nawafil.\" The bedouin further asked, \"Inform me what Allah has made compulsory for me as regards fasting.\" He replied, \"You have to fast during the whole month of Ramadan, unless you want to fast more as Nawafil.\" The bedouin further asked, \"Tell me how much Zakat Allah has enjoined on me.\" Thus, Allah's Messenger (ﷺ) informed him about all the rules (i.e. fundamentals) of Islam. The bedouin then said, \"By Him Who has honored you, I will neither perform any Nawafil nor will I decrease what Allah has enjoined on me. Allah's Messenger (ﷺ) said, \"If he is saying the truth, he will succeed (or he will be granted Paradise).",
                "hadithUrdu": "ایک اعرابی پریشان حال بال بکھرے ہوئے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اس نے پوچھا یا رسول اللہ صلی اللہ ! بتائیے مجھ پر اللہ تعالیٰ نے کتنی نمازیں فرض کی ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پانچ نمازیں ، یہ اور بات ہے کہ تم اپنی طرف سے نفل پڑھ لو ، پھر اس نے کہا بتائیے اللہ تعالیٰ نے مجھ پرر وزے کتنے فرض کئے ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ رمضان کے مہینے کے ، یہ اور بات ہے کہ تم خود اپنے طور پر کچھ نفلی روزے اور بھی رکھ لو ، پھر اس نے پوچھا اور بتائیے زکوٰۃ کس طرح مجھ پر اللہ تعالیٰ نے فرض کی ہے ؟ آپ صلی اللہ علیہ وسلم نے اسے شرع اسلام کی باتیں بتا دیں ۔ جب اس اعرابی نے کہا اس ذات کی قسم جس نے آپ صلی اللہ علیہ وسلم کو عزت دی نہ میں اس میں اس سے جو اللہ تعالیٰ نے مجھ پر فرض کر دیا ہے کچھ بڑھاؤں گا اور نہ گھٹاؤں گا ، اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اگر اس نے سچ کہا ہے تو یہ مراد کو پہنچایا ( آپ صلی اللہ علیہ وسلم نے یہ فرمایا کہ ) اگر سچ کہا ہے تو جنت میں جائے گا ۔",
                "urduNarrator": "ہم سے قتبیہ بن سعید نے بیان کیا ، ان سے اسماعیل بن جعفر نے بیان کیا ، ان سے ابوسہیل نے ، ان سے ان کے والد مالک نے اور ان سے طلحہ بن عبیداللہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ أَبِي سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ، أَنَّ أَعْرَابِيًّا، جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ثَائِرَ الرَّأْسِ فَقَالَ يَا رَسُولَ اللَّهِ أَخْبِرْنِي مَاذَا فَرَضَ اللَّهُ عَلَىَّ مِنَ الصَّلاَةِ فَقَالَ ‏\"‏ الصَّلَوَاتِ الْخَمْسَ، إِلاَّ أَنْ تَطَّوَّعَ شَيْئًا ‏\"‏‏.‏ فَقَالَ أَخْبِرْنِي مَا فَرَضَ اللَّهُ عَلَىَّ مِنَ الصِّيَامِ فَقَالَ ‏\"‏ شَهْرَ رَمَضَانَ، إِلاَّ أَنْ تَطَّوَّعَ شَيْئًا ‏\"‏‏.‏ فَقَالَ أَخْبِرْنِي بِمَا فَرَضَ اللَّهُ عَلَىَّ مِنَ الزَّكَاةِ فَقَالَ فَأَخْبَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم شَرَائِعَ الإِسْلاَمِ‏.‏ قَالَ وَالَّذِي أَكْرَمَكَ لاَ أَتَطَوَّعُ شَيْئًا، وَلاَ أَنْقُصُ مِمَّا فَرَضَ اللَّهُ عَلَىَّ شَيْئًا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفْلَحَ إِنْ صَدَقَ، أَوْ دَخَلَ الْجَنَّةَ إِنْ صَدَقَ ‏\"‏‏.‏",
                "headingArabic": "وُجُوبِ صَوْمِ رَمَضَانَ",
                "headingUrdu": "(ماہ) رمضان میں روزے فرض ہیں۔",
                "headingEnglish": "Fasting is obligatory in (the month of) Ramadan",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1816,
                "hadithNumber": "1892",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) observed the fast on the 10th of Muharram ('Ashura), and ordered (Muslims) to fast on that day, but when the fasting of the month of Ramadan was prescribed, the fasting of the 'Ashura' was abandoned. `Abdullah رضی اللہ عنہما did not use to fast on that day unless it coincided with his routine fasting by chance.",
                "hadithUrdu": "رسول اللہ صلی للہ علیہ وسلم نے یوم عاشورہ کا روزہ رکھا تھا اور آپ صلی اللہ علیہ وسلم نے اس کے رکھنے کا صحابہ رضی اللہ عنہم کو ابتداء اسلام میں حکم دیا تھا ، جب ماہ رمضان کے روزے فرض ہو گئے تو عاشورہ کا روزہ بطور فرض چھوڑ دیا گیا ، عبداللہ بن عمر رضی اللہ عنہما عاشورہ کے دن روزہ نہ رکھتے مگر جب ان کے روزے کا دن ہی یوم عاشورہ آن پڑتا ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے اسماعیل بن علیہ نے بیان کیا ان سے ایوب نے ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ صَامَ النَّبِيُّ صلى الله عليه وسلم عَاشُورَاءَ، وَأَمَرَ بِصِيَامِهِ‏.‏ فَلَمَّا فُرِضَ رَمَضَانُ تُرِكَ‏.‏ وَكَانَ عَبْدُ اللَّهِ لاَ يَصُومُهُ، إِلاَّ أَنْ يُوَافِقَ صَوْمَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1817,
                "hadithNumber": "1893",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "(The tribe of) Quraish used to fast on the day of Ashura' in the Pre-Islamic period, and then Allah's Apostle ordered (Muslims) to fast on it till the fasting in the month of Ramadan was prescribed; whereupon the Prophet (ﷺ) said, \"He who wants to fast (on 'Ashura') may fast, and he who does not want to fast may not fast.\"",
                "hadithUrdu": "قریش زمانہ جاہلیت میں عاشورہ کا روزہ رکھتے تھے ، پھر رسول اللہ صلی اللہ علیہ وسلم نے بھی اس دن روزہ کا حکم دیا یہاں تک کہ رمضان کے روزے فرض ہو گئے ، پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جس کا جی چاہے یوم عاشورہ کا روزہ رکھے اور جس کا جی چاہے نہ رکھے ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، ان سے یزید بن ابی حبیب نے اور ان سے عراک بن مالک نے بیان کیا ، انہیں عروہ نے خبر دی کہ ام المؤمنین عائشہ رضی اللہ عنہا نے فرمایا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، أَنَّ عِرَاكَ بْنَ مَالِكٍ، حَدَّثَهُ أَنَّ عُرْوَةَ أَخْبَرَهُ عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ قُرَيْشًا، كَانَتْ تَصُومُ يَوْمَ عَاشُورَاءَ فِي الْجَاهِلِيَّةِ، ثُمَّ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِصِيَامِهِ حَتَّى فُرِضَ رَمَضَانُ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ شَاءَ فَلْيَصُمْهُ، وَمَنْ شَاءَ أَفْطَرَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1818,
                "hadithNumber": "1894",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Fasting is a shield (or a screen or a shelter). So, the person observing fasting should avoid sexual relation with his wife and should not behave foolishly and impudently, and if somebody fights with him or abuses him, he should tell him twice, 'I am fasting.\" The Prophet (ﷺ) added, \"By Him in Whose Hands my soul is, the smell coming out from the mouth of a fasting person is better in the sight of Allah than the smell of musk. (Allah says about the fasting person), 'He has left his food, drink and desires for My sake. The fast is for Me. So I will reward (the fasting person) for it and the reward of good deeds is multiplied ten times.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا روزہ دوزخ سے بچنے کے لیے ایک ڈھال ہے اس لیے ( روزہ دار ) نہ فحش باتیں کرے اور نہ جہالت کی باتیں اور اگر کوئی شخص اس سے لڑے یا اسے گالی دے تو اس کا جواب صرف یہ ہونا چاہئے کہ میں روزہ دار ہوں ، ( یہ الفاظ ) دو مرتبہ ( کہہ دے ) اس ذات کی قسم ! جس کے ہاتھ میں میری جان ہے روزہ دار کے منہ کی بو اللہ کے نزدیک کستوری کی خوشبو سے بھی زیادہ پسندیدہ اور پاکیزہ ہے ، ( اللہ تعالیٰ فرماتا ہے ) بندہ اپنا کھانا پینا اور اپنی شہوت میرے لیے چھوڑ دیتا ہے ، روزہ میرے لیے ہے اور میں ہی اس کا بدلہ دوں گا اور ( دوسری ) نیکیوں کا ثواب بھی اصل نیکی کے دس گنا ہوتا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک نے ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الصِّيَامُ جُنَّةٌ، فَلاَ يَرْفُثْ وَلاَ يَجْهَلْ، وَإِنِ امْرُؤٌ قَاتَلَهُ أَوْ شَاتَمَهُ فَلْيَقُلْ إِنِّي صَائِمٌ‏.‏ مَرَّتَيْنِ، وَالَّذِي نَفْسِي بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ تَعَالَى مِنْ رِيحِ الْمِسْكِ، يَتْرُكُ طَعَامَهُ وَشَرَابَهُ وَشَهْوَتَهُ مِنْ أَجْلِي، الصِّيَامُ لِي، وَأَنَا أَجْزِي بِهِ، وَالْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ الصَّوْمِ",
                "headingUrdu": "صوم کی فضیلت",
                "headingEnglish": "The superiority of As-Saum (the fasting)",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1819,
                "hadithNumber": "1895",
                "englishNarrator": "Narrated Abu Wail from Hudhaifa رضی اللہ عنہ :",
                "hadithEnglish": "`Umar رضی اللہ عنہ asked the people, \"Who remembers the narration of the Prophet (ﷺ) about the affliction?\" Hudhaifa رضی اللہ عنہ said, \"I heard the Prophet (ﷺ) saying, 'The affliction of a person in his property, family and neighbors is expiated by his prayers, fasting, and giving in charity.\" `Umar رضی اللہ عنہ said, \"I do not ask about that, but I ask about those afflictions which will spread like the waves of the sea.\" Hudhaifa رضی اللہ عنہ replied, \"There is a closed gate in front of those afflictions.\" `Umar رضی اللہ عنہ asked, \"Will that gate be opened or broken?\" He replied, \"It will be broken.\" `Umar رضی اللہ عنہ said, \"Then the gate will not be closed again till the Day of Resurrection.\" We said to Masruq, \"Would you ask Hudhaifa whether `Umar رضی اللہ عنہ knew what that gate symbolized?\" He asked him and he replied \"He (`Umar رضی اللہ عنہ) knew it as one knows that there will be night before tomorrow, morning.",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ نے پوچھا فتنہ کے متعلق رسول اللہ صلی اللہ علیہ وسلم کی حدیث کسی کو یاد ہے ؟ حذیفہ رضی اللہ عنہ نے بیان کیا کہ میں نے سنا ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ انسان کے لیے اس کے بال بچے ، اس کا مال اور اس کے پڑوسی فتنہ ( آزمائش و امتحان ) ہیں جس کا کفارہ نماز روزہ اور صدقہ بن جاتا ہے ۔ عمر رضی اللہ عنہ نے کہا کہ میں اس کے متعلق نہیں پوچھتا میری مراد تو اس فتنہ سے ہے جو سمندر کی موجوں کی طرح امنڈ آئے گا ۔ اس پر حذیفہ رضی اللہ عنہ نے کہا کہ آپ کے اور اس فتنہ کے درمیان ایک بند دروازہ ہے ۔ ( یعنی آپ کے دور میں وہ فتنہ شروع نہیں ہو گا ) عمر رضی اللہ عنہ نے پوچھا وہ دروازہ کھل جائے گا یا توڑ دیا جائے گا ؟ حذیفہ رضی اللہ عنہ نے بتایا کہ توڑ دیا جائے گا ۔ عمر رضی اللہ عنہ نے فرمایا کہ پھر تو قیامت تک کبھی بند نہ ہو پائے گا ۔ ہم نے مسروق سے کہا آپ حذیفہ رضی اللہ عنہ سے پوچھئے کہ کیا عمر رضی اللہ عنہ کو معلوم تھا کہ وہ دروازہ کون ہے ، چنانچہ مسروق نے پوچھا تو آپ رضی اللہ عنہ نے فرمایا ہاں ! بالکل اس طرح ( انہیں علم تھا ) جیسے رات کے بعد دن کے آنے کا علم ہوتا ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، ان سے سفیان بن عیینہ نے بیان کیا ، ان سے جامع بن راشد نے بیان کیا ، ان سے ابووائل نے اور ان سے حذیفہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا جَامِعٌ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، قَالَ قَالَ عُمَرُ ـ رضى الله عنه ـ مَنْ يَحْفَظُ حَدِيثًا عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الْفِتْنَةِ قَالَ حُذَيْفَةُ أَنَا سَمِعْتُهُ يَقُولُ ‏ \"‏ فِتْنَةُ الرَّجُلِ فِي أَهْلِهِ وَمَالِهِ وَجَارِهِ تُكَفِّرُهَا الصَّلاَةُ وَالصِّيَامُ وَالصَّدَقَةُ ‏\"‏‏.‏ قَالَ لَيْسَ أَسْأَلُ عَنْ ذِهِ، إِنَّمَا أَسْأَلُ عَنِ الَّتِي تَمُوجُ كَمَا يَمُوجُ الْبَحْرُ‏.‏ قَالَ وَإِنَّ دُونَ ذَلِكَ بَابًا مُغْلَقًا‏.‏ قَالَ فَيُفْتَحُ أَوْ يُكْسَرُ قَالَ يُكْسَرُ‏.‏ قَالَ ذَاكَ أَجْدَرُ أَنْ لاَ يُغْلَقَ إِلَى يَوْمِ الْقِيَامَةِ‏.‏ فَقُلْنَا لِمَسْرُوقٍ سَلْهُ أَكَانَ عُمَرُ يَعْلَمُ مَنِ الْبَابُ فَسَأَلَهُ فَقَالَ نَعَمْ، كَمَا يَعْلَمُ أَنَّ دُونَ غَدٍ اللَّيْلَةَ‏.‏",
                "headingArabic": "الصَّوْمُ كَفَّارَةٌ",
                "headingUrdu": "صوم (روزہ) گناہوں کا کفارہ ہے",
                "headingEnglish": "As-Saum (the fasting) is an expiation (for sins)",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1820,
                "hadithNumber": "1896",
                "englishNarrator": "Narrated Sahl  رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"There is a gate in Paradise called Ar-Raiyan, and those who observe fasts will enter through it on the Day of Resurrection and none except them will enter through it. It will be said, 'Where are those who used to observe fasts?' They will get up, and none except them will enter through it. After their entry the gate will be closed and nobody will enter through it.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا جنت کا ایک دروازہ ہے جسے ریان کہتے ہیں قیامت کے دن اس دروازہ سے صرف روزہ دار ہی جنت میں داخل ہوں گے ، ان کے سوا اور کوئی اس میں سے نہیں داخل ہو گا ، پکارا جائے گا کہ روزہ دار کہاں ہے ؟ وہ کھڑے ہو جائیں گے ان کے سوا اس سے اور کوئی نہیں اندر جانے پائے گا اور جب یہ لوگ اندر چلے جائیں گے تو یہ دروازہ بند کر دیا جائے گا پھر اس سے کوئی اندر نہ جا سکے گا ۔",
                "urduNarrator": "ہم سے خالد بن مخلد نے بیان کیا ، کہا ہم سے سلیمان بن بلال نے بیان کیا ، کہا کہ مجھ سے ابوحازم سلمہ ابن دینار نے بیان کیا اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ فِي الْجَنَّةِ بَابًا يُقَالُ لَهُ الرَّيَّانُ، يَدْخُلُ مِنْهُ الصَّائِمُونَ يَوْمَ الْقِيَامَةِ، لاَ يَدْخُلُ مِنْهُ أَحَدٌ غَيْرُهُمْ يُقَالُ أَيْنَ الصَّائِمُونَ فَيَقُومُونَ، لاَ يَدْخُلُ مِنْهُ أَحَدٌ غَيْرُهُمْ، فَإِذَا دَخَلُوا أُغْلِقَ، فَلَمْ يَدْخُلْ مِنْهُ أَحَدٌ ‏\"‏‏.‏",
                "headingArabic": "الرَّيَّانُ لِلصَّائِمِينَ",
                "headingUrdu": "الریان صوم دیکھنے والوں کے لیے ہے۔",
                "headingEnglish": "Ar-Raiyan is for people observing Saum",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1821,
                "hadithNumber": "1897",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Whoever gives two kinds (of things or property) in charity for Allah's Cause, will be called from the gates of Paradise and will be addressed, 'O slaves of Allah! Here is prosperity.' So, whoever was amongst the people who used to offer their prayers, will be called from the gate of the prayer; and whoever was amongst the people who used to participate in Jihad, will be called from the gate of Jihad; and whoever was amongst those who used to observe fasts, will be called from the gate of Ar-Raiyan; whoever was amongst those who used to give in charity, will be called from the gate of charity.\" Abu Bakr       رضی اللہ عنہ said, \"Let my parents be sacrificed for you, O Allah's Messenger (ﷺ)! No distress or need will befall him who will be called from those gates. Will there be any one who will be called from all these gates?\" The Prophet (ﷺ) replied, \"Yes, and I hope you will be one of them.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو اللہ کے راستے میں دو چیزیں خرچ کرے گا اسے فرشتے جنت کے دروازوں سے بلائیں گے کہ اے اللہ کے بندے ! یہ دروازہ اچھا ہے پھر جو شخص نمازی ہو گا اسے نماز کے دروازہ سے بلایا جائے گا جو مجاہد ہو گا اسے جہاد کے دروازے سے بلایا جائے جو روزہ دار ہو گا اسے «باب الريان» سے بلایا جائے گا اور جو زکوٰۃ ادا کرنے والا ہو گا اسے زکوٰۃ کے دروازہ سے بلایا جائے گا ۔ اس پر ابوبکر رضی اللہ عنہ نے پوچھا میرے ماں باپ آپ صلی اللہ علیہ وسلم پر فدا ہوں یا رسول اللہ صلی اللہ علیہ وسلم ! جو لوگ ان دروازوں ( میں سے کسی ایک دروازہ ) سے بلائے جائیں گے مجھے ان سے بحث نہیں ، آپ یہ فرمائیں کہ کیا کوئی ایسا بھی ہو گا جسے ان سب دروازوں سے بلایا جائے گا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اور مجھے امید ہے کہ آپ بھی انہیں میں سے ہوں گے ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، انہوں نے کہا کہ مجھ سے معین بن عیسیٰ نے بیان کیا ، کہا مجھ سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے ، ان سے حمید بن عبدالرحمٰن نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنِي مَعْنٌ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَنْفَقَ زَوْجَيْنِ فِي سَبِيلِ اللَّهِ نُودِيَ مِنْ أَبْوَابِ الْجَنَّةِ يَا عَبْدَ اللَّهِ، هَذَا خَيْرٌ‏.‏ فَمَنْ كَانَ مِنْ أَهْلِ الصَّلاَةِ دُعِيَ مِنْ باب الصَّلاَةِ، وَمَنْ كَانَ مِنْ أَهْلِ الْجِهَادِ دُعِيَ مِنْ باب الْجِهَادِ، وَمَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ باب الرَّيَّانِ، وَمَنْ كَانَ مِنْ أَهْلِ الصَّدَقَةِ دُعِيَ مِنْ باب الصَّدَقَةِ ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ ـ رضى الله عنه ـ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ، مَا عَلَى مَنْ دُعِيَ مِنْ تِلْكَ الأَبْوَابِ مِنْ ضَرُورَةٍ، فَهَلْ يُدْعَى أَحَدٌ مِنْ تِلْكَ الأَبْوَابِ كُلِّهَا قَالَ ‏\"‏ نَعَمْ‏.‏ وَأَرْجُو أَنْ تَكُونَ مِنْهُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1822,
                "hadithNumber": "1898",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"When Ramadan begins, the gates of Paradise are opened.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب رمضان آتا ہے تو جنت کے دروازے کھول دیئے جاتے ہیں ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے ابوسہل نافع بن مالک نے ، ان سے ان کے والد نے ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ أَبِي سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا جَاءَ رَمَضَانُ فُتِحَتْ أَبْوَابُ الْجَنَّةِ ‏\"‏‏.‏",
                "headingArabic": "هَلْ يُقَالُ رَمَضَانُ أَوْ شَهْرُ رَمَضَانَ وَمَنْ رَأَى كُلَّهُ وَاسِعًا",
                "headingUrdu": "کیا اسے \"رمضان\" کہنا چاہیے یا \"رمضان کا مہینہ\"؟ اور جس کا گمان ہو کہ دونوں جائز ہیں۔",
                "headingEnglish": "Should it be said \"Ramadan\" or \"the month of Ramadan\"? And whoever thinks that both are permissible",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1823,
                "hadithNumber": "1899",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"When the month of Ramadan starts, the gates of the heaven are opened and the gates of Hell are closed and the devils are chained.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب رمضان کا مہینہ آتا ہے تو آسمان کے تمام دروازے کھول دیئے جاتے ہیں ، جہنم کے دروازے بند کر دیئے جاتے ہیں اور شیاطین کو زنجیروں سے جکڑ دیا جاتا ہے ۔",
                "urduNarrator": "مجھ سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ مجھ سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ان سے ابن شہاب زہری نے بیان کیا کہ مجھے بنوتمیم کے مولیٰ ابوسہیل بن ابی انس نے خبر دی ، ان سے ان کے والد نے بیان کیا ، اور انہوں نے ابوہریرہ رضی اللہ عنہ کو کہتے سنا کہ",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي ابْنُ أَبِي أَنَسٍ، مَوْلَى التَّيْمِيِّينَ أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا دَخَلَ شَهْرُ رَمَضَانَ فُتِّحَتْ أَبْوَابُ السَّمَاءِ، وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ، وَسُلْسِلَتِ الشَّيَاطِينُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1824,
                "hadithNumber": "1900",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"When you see the crescent (of the month of Ramadan), start fasting, and when you see the crescent (of the month of Shawwal), stop fasting; and if the sky is overcast (and you can't see it) then regard the month of Ramadan as of 30 days.\" Others have reported from Uqail and Younus with reference to Laith: For the new moon of Ramadan.",
                "hadithUrdu": "میں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب رمضان کا چاند دیکھو تو روزہ شروع کر دو اور جب شوال کا چاند دیکھو تو روزہ افطار کر دو اور اگر ابر ہو تو اندازہ سے کام کرو ۔ ( یعنی تیس روزے پورے کر لو ) اور بعض نے لیث سے بیان کیا کہ مجھ سے عقیل اور یونس نے بیان کیا کہ ” رمضان کا چاند “ مراد ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے بیان کیا کہ مجھے سالم نے خبر دی کہ ابن عمر رضی اللہ عنہما نے کہا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَالِمٌ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا رَأَيْتُمُوهُ فَصُومُوا، وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا، فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ ‏\"‏‏.‏ وَقَالَ غَيْرُهُ عَنِ اللَّيْثِ حَدَّثَنِي عُقَيْلٌ وَيُونُسُ لِهِلاَلِ رَمَضَانَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1825,
                "hadithNumber": "1901",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever established prayers on the night of Qadr out of sincere faith and hoping for a reward from Allah, then all his previous sins will be forgiven; and whoever fasts in the month of Ramadan out of sincere faith, and hoping for a reward from Allah, then all his previous sins will be forgiven.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جو کوئی شب قدر میں ایمان کے ساتھ اور حصول ثواب کی نیت سے عبادت میں کھڑا ہو اس کے تمام اگلے گناہ بخش دیئے جائیں گے اور جس نے رمضان کے روزے ایمان کے ساتھ اور ثواب کی نیت سے رکھے اس کے اگلے تمام گناہ معاف کر دیئے جائیں گے ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے ہشام دستوائی نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ، وَمَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏",
                "headingArabic": "مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا وَنِيَّةً",
                "headingUrdu": "جس نے رمضان کے روزے ایمان کے ساتھ سچی نیت کے ساتھ رکھے",
                "headingEnglish": "Whoever observed fast in Ramadan out of sincere Faith with honest intention",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1826,
                "hadithNumber": "1902",
                "englishNarrator": "Narrated Ibn `Abbas:",
                "hadithEnglish": "The Prophet (ﷺ) was the most generous amongst the people, and he used to be more so in the month of Ramadan when Gabriel visited him, and Gabriel used to meet him on every night of Ramadan till the end of the month. The Prophet (ﷺ) used to recite the Holy Qur'an to Gabriel, and when Gabriel met him, he used to be more generous than a fast wind (which causes rain and welfare).",
                "hadithUrdu": "عبداللہ بن عباس رضی اللہ عنہما نے کہا نبی کریم صلی اللہ علیہ وسلم سخاوت اور خیر کے معاملہ میں سب سے زیادہ سخی تھے اور آپ صلی اللہ علیہ وسلم کی سخاوت اس وقت اور زیادہ بڑھ جاتی تھی جب جبرائیل علیہ السلام آپ صلی اللہ علیہ وسلم سے رمضان میں ملتے ، جبرائیل علیہ السلام آنحضرت صلی اللہ علیہ وسلم سے رمضان شریف کی ہر رات میں ملتے یہاں تک کہ رمضان گزر جاتا ۔ نبی کریم صلی اللہ علیہ وسلم جبرائیل علیہ السلام سے قرآن کا دور کرتے تھے ، جب حضرت جبرائیل علیہ السلام آپ صلی اللہ علیہ وسلم سے ملنے لگتے تو آپ صلی اللہ علیہ وسلم چلتی ہوا سے بھی زیادہ بھلائی پہنچانے میں سخی ہو جایا کرتے تھے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ، انہیں ابن شہاب نے خبر دی ، انہیں عبیداللہ بن عبداللہ بن عتبہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم أَجْوَدَ النَّاسِ بِالْخَيْرِ، وَكَانَ أَجْوَدُ مَا يَكُونُ فِي رَمَضَانَ، حِينَ يَلْقَاهُ جِبْرِيلُ، وَكَانَ جِبْرِيلُ ـ عَلَيْهِ السَّلاَمُ ـ يَلْقَاهُ كُلَّ لَيْلَةٍ فِي رَمَضَانَ حَتَّى يَنْسَلِخَ، يَعْرِضُ عَلَيْهِ النَّبِيُّ صلى الله عليه وسلم الْقُرْآنَ، فَإِذَا لَقِيَهُ جِبْرِيلُ ـ عَلَيْهِ السَّلاَمُ ـ كَانَ أَجْوَدَ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1801,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=72",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=70",
                "label": "70",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=71",
                "label": "71",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=72",
                "label": "72",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=73",
                "label": "73",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=74",
                "label": "74",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=75",
                "label": "75",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=76",
                "label": "76",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=74",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=74",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=72",
        "to": 1825,
        "total": 40465
    }
}