{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 36,
        "data": [
            {
                "id": 876,
                "hadithNumber": "901",
                "englishNarrator": "Narrated Muhammad bin Seereen:",
                "hadithEnglish": "On a rainy day Ibn `Abbas said to his Mu'adh-dhin, \"After saying, 'Ash-hadu anna Muhammadan Rasulullah' (I testify that Muhammad is Allah's Messenger (ﷺ)), do not say 'Haiya 'Alas-Salat' (come for the prayer) but say 'Pray in your houses'.\" (The man did so). But the people disliked it. Ibn `Abbas said, \"It was done by one who was much better than I (i.e. the Prophet (p.b.u.h) ). No doubt, the Jumua prayer is compulsory but I dislike to put you to task by bringing you out walking in mud and slush.\"",
                "hadithUrdu": "عبداللہ بن عباس رضی اللہ عنہما نے اپنے مؤذن سے ایک دفعہ بارش کے دن کہا کہ «أشهد أن محمدا رسول الله‏» کے بعد «حى على الصلاة‏» ( نماز کی طرف آؤ ) نہ کہنا بلکہ یہ کہنا کہ «صلوا في بيوتكم‏» ( اپنے گھروں میں نماز پڑھ لو ) لوگوں نے اس بات پر تعجب کیا تو آپ نے فرمایا کہ اسی طرح مجھ سے بہتر انسان ( رسول اللہ صلی اللہ علیہ وسلم ) نے کیا تھا ۔ بیشک جمعہ فرض ہے اور میں مکروہ جانتا ہوں کہ تمہیں گھروں سے باہر نکال کر مٹی اور کیچڑ پھسلوان میں چلاؤں ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ۔ انہوں نے کہا کہ ہم سے اسماعیل بن علیہ بیان کیا ، انہوں نے کہا کہ ہمیں صاحب الزیادی عبدالحمید نے خبر دی ، کہا کہ ہم سے محمد بن سیرین کے چچازاد بھائی عبداللہ بن حارث نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ أَخْبَرَنِي عَبْدُ الْحَمِيدِ، صَاحِبُ الزِّيَادِيِّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ ابْنُ عَمِّ، مُحَمَّدِ بْنِ سِيرِينَ قَالَ ابْنُ عَبَّاسٍ لِمُؤَذِّنِهِ فِي يَوْمٍ مَطِيرٍ إِذَا قُلْتَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ‏.‏ فَلاَ تَقُلْ حَىَّ عَلَى الصَّلاَةِ‏.‏ قُلْ صَلُّوا فِي بُيُوتِكُمْ‏.‏ فَكَأَنَّ النَّاسَ اسْتَنْكَرُوا، قَالَ فَعَلَهُ مَنْ هُوَ خَيْرٌ مِنِّي، إِنَّ الْجُمُعَةَ عَزْمَةٌ، وَإِنِّي كَرِهْتُ أَنْ أُخْرِجَكُمْ، فَتَمْشُونَ فِي الطِّينِ وَالدَّحْضِ‏.‏",
                "headingArabic": "الرُّخْصَةِ إِنْ لَمْ يَحْضُرِ الْجُمُعَةَ فِي الْمَطَرِ",
                "headingUrdu": "اگر بارش ہو رہی ہو تو جمعہ میں شرکت نہ کرنا۔",
                "headingEnglish": "Not to attend the Jumu'ah (prayer) if it is raining.",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 877,
                "hadithNumber": "902",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا (the wife of the Prophet):",
                "hadithEnglish": "The people used to come from their abodes and from Al-`Awali (i.e. outskirts of Medina up to a distance of four miles or more from Medina). They used to pass through dust and used to be drenched with sweat and covered with dust; so sweat used to trickle from them. One of them came to Allah's Messenger (ﷺ) who was in my house. The Prophet (ﷺ) said to him, \"I wish that you keep yourself clean on this day of yours (i.e. take a bath).\"",
                "hadithUrdu": "لوگ جمعہ کی نماز پڑھنے اپنے گھروں سے اور اطراف مدینہ گاؤں سے ( مسجدنبوی میں ) باری باری آیا کرتے تھے ۔ لوگ گردوغبار میں چلے آتے ، گرد میں اٹے ہوئے اور پسینہ میں شرابور ۔ اس قدر پسینہ ہوتا کہ تھمتا ( رکتا ) نہیں تھا ۔ اسی حالت میں ایک آدمی رسول کریم صلی اللہ علیہ وسلم کے پاس آیا ۔ آپ نے فرمایا کہ تم لوگ اس دن ( جمعہ میں ) غسل کر لیا کرتے تو بہتر ہوتا ۔",
                "urduNarrator": "ہم سے احمد بن صالح نے بیان کیا ، انہوں نے کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، انہوں نے کہا کہ مجھے عمرو بن حارث نے خبر دی ، ان سے عبیداللہ بن ابی جعفر نے کہ محمد بن جعفر بن زبیر نے ان سے بیان کیا ، ان سے عروہ بن زبیر نے اور ان سے حضرت عائشہ رضی اللہ عنہا نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ نے ، آپ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، أَنَّ مُحَمَّدَ بْنَ جَعْفَرِ بْنِ الزُّبَيْرِ، حَدَّثَهُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ النَّاسُ يَنْتَابُونَ يَوْمَ الْجُمُعَةِ مِنْ مَنَازِلِهِمْ وَالْعَوَالِي، فَيَأْتُونَ فِي الْغُبَارِ، يُصِيبُهُمُ الْغُبَارُ وَالْعَرَقُ، فَيَخْرُجُ مِنْهُمُ الْعَرَقُ، فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم إِنْسَانٌ مِنْهُمْ وَهْوَ عِنْدِي، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَوْ أَنَّكُمْ تَطَهَّرْتُمْ لِيَوْمِكُمْ هَذَا ‏\"‏‏.‏",
                "headingArabic": "مِنْ أَيْنَ تُؤْتَى الْجُمُعَةُ وَعَلَى مَنْ تَجِبُ",
                "headingUrdu": "جمعہ کی نماز کس پر فرض ہے؟",
                "headingEnglish": "For whom is the Jumu'ah (prayer) compulsory?",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 878,
                "hadithNumber": "903",
                "englishNarrator": "Narrated Yahya bin Sa`id:",
                "hadithEnglish": "I asked `Amra about taking a bath on Fridays. She replied, \" Aisha رضی اللہ عنہا said, 'The people used to work (for their livelihood) and whenever they went for the Jumua prayer, they used to go to the mosque in the same shape as they had been in work. So they were asked to take a bath on Friday.' \"",
                "hadithUrdu": "انہوں نے عمرہ بنت عبدالرحمٰن سے جمعہ کے دن غسل کے بارے میں پوچھا ۔ انہوں نے بیان کیا کہ حضرت عائشہ رضی اللہ عنہا فرماتی تھیں کہ لوگ اپنے کاموں میں مشغول رہتے اور جمعہ کے لیے اسی حالت ( میل کچیل ) میں چلے آتے ، اس لیے ان سے کہا گیا کہ کاش تم لوگ ( کبھی ) غسل کر لیا کرتے ۔",
                "urduNarrator": "ہم سے عبدان عبداللہ بن عثمان نے بیان کیا ، کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ، کہا کہ ہمیں یحی بن سعید نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، أَنَّهُ سَأَلَ عَمْرَةَ عَنِ الْغُسْلِ، يَوْمَ الْجُمُعَةِ فَقَالَتْ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ كَانَ النَّاسُ مَهَنَةَ أَنْفُسِهِمْ، وَكَانُوا إِذَا رَاحُوا إِلَى الْجُمُعَةِ رَاحُوا فِي هَيْئَتِهِمْ فَقِيلَ لَهُمْ لَوِ اغْتَسَلْتُمْ‏.‏",
                "headingArabic": "وَقْتُ الْجُمُعَةِ إِذَا زَالَتِ الشَّمْسُ",
                "headingUrdu": "جمعہ (نماز) کا وقت اس وقت ہوتا ہے جب سورج ڈوب جاتا ہے (یعنی دوپہر کے بعد)",
                "headingEnglish": "The time for the Jumu'ah (prayer) is due when the sun declines (i.e. just after mid-day)",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 879,
                "hadithNumber": "904",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) used to offer the Jumua prayer immediately after midday.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جمعہ کی نماز اس وقت پڑھتے جب سورج ڈھل جاتا ۔",
                "urduNarrator": "ہم سے سریج بن نعمان نے بیان کیا ، انہوں نے کہا کہ ہم سے فلیح بن سلیمان نے بیان کیا ، ان سے عثمان ابن عبدالرحمٰن بن عثمان تیمی نے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ، قَالَ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي الْجُمُعَةَ حِينَ تَمِيلُ الشَّمْسُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 880,
                "hadithNumber": "905",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "We used to offer the Jumua prayer early and then have an afternoon nap.",
                "hadithUrdu": "ہم جمعہ سویرے پڑھ لیا کرتے اور جمعہ کے بعد آرام کرتے تھے ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ، کہا کہ ہمیں حمید طویل نے انس بن مالک رضی اللہ عنہ سے خبر دی ۔ آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا حُمَيْدٌ، عَنْ أَنَسٍ، قَالَ كُنَّا نُبَكِّرُ بِالْجُمُعَةِ، وَنَقِيلُ بَعْدَ الْجُمُعَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 881,
                "hadithNumber": "906",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) used to offer the prayer earlier if it was very cold; and if it was very hot he used to delay the prayer, i.e. the Jumua prayer.\r\nYounus bin Bukair said: Abu Khaldah told us \"The pray\" and did not mention \"Friday\" . Bishr bin Thabit said that Abu Khaldah narrated  a Hadith to him:  \"A chief led us in the Friday prayer\" . Then he said to Hadrat Anas\r\n رضی اللہ عنہ : How did the prophet (ﷺ) perform the Zuhr prayer?",
                "hadithUrdu": "اگر سردی زیادہ پڑتی تو نبی کریم صلی اللہ علیہ وسلم نماز سویرے پڑھ لیتے ۔ لیکن جب گرمی زیادہ ہوتی تو ٹھنڈے وقت نماز پڑھتے ۔ آپ کی مراد جمعہ کی نماز سے تھی ۔ \r\nیونس بن بکیر نے کہا کہ ہمیں ابوخلدہ نے خبر دی ۔ انہوں نے صرف نماز کہا ۔ جمعہ کا ذکر نہیں کیا اور بشر بن ثابت نے کہا کہ ہم سے ابوخلدہ نے بیان کیا کہ امیر نے ہمیں جمعہ کی نماز پڑھائی ۔ پھر حضرت انس رضی اللہ عنہ سے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم ظہر کی نماز کس وقت پڑھتے تھے ؟",
                "urduNarrator": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا ، انہوں نے کہا کہ ہم سے حرمی بن عمارہ نے بیان کیا ، انہوں نے کہا کہ ہم سے ابوخلدہ جن کا نام خالد بن دینار ہے ، نے بیان کیا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا ، آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، قَالَ حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، قَالَ حَدَّثَنَا أَبُو خَلْدَةَ ـ هُوَ خَالِدُ بْنُ دِينَارٍ ـ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا اشْتَدَّ الْبَرْدُ بَكَّرَ بِالصَّلاَةِ، وَإِذَا اشْتَدَّ الْحَرُّ أَبْرَدَ بِالصَّلاَةِ، يَعْنِي الْجُمُعَةَ‏.‏ قَالَ يُونُسُ بْنُ بُكَيْرٍ أَخْبَرَنَا أَبُو خَلْدَةَ فَقَالَ بِالصَّلاَةِ، وَلَمْ يَذْكُرِ الْجُمُعَةَ‏.‏ وَقَالَ بِشْرُ بْنُ ثَابِتٍ حَدَّثَنَا أَبُو خَلْدَةَ قَالَ صَلَّى بِنَا أَمِيرٌ الْجُمُعَةَ ثُمَّ قَالَ لأَنَسٍ ـ رضى الله عنه ـ كَيْفَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الظُّهْرَ",
                "headingArabic": "إِذَا اشْتَدَّ الْحَرُّ يَوْمَ الْجُمُعَةِ",
                "headingUrdu": "اگر جمعہ کے دن بہت گرمی پڑ جائے۔",
                "headingEnglish": "If it becomes very hot on Fridays",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 882,
                "hadithNumber": "907",
                "englishNarrator": "Narrated Abayah bin Rifaah:",
                "hadithEnglish": "I was going to perform the Friday prayer, Hadrat Abu Abs رضی اللہ عنہ met me. He said that he  heard Allah\"s Apostle (ﷺ) saying: Whosever's feet get dusty in the way of Allah, Allah declares him forbidden for Hell.",
                "hadithUrdu": "میں جمعہ کے لیے جا رہا تھا ۔ راستے میں ابوعبس رضی اللہ عنہ سے میری ملاقات ہوئی ، انہوں نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ جس کے قدم خدا کی راہ میں غبارآلود ہو گئے اللہ تعالیٰ اسے دوزخ پر حرام کر دے گا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا کہ ہم سے ولید بن مسلم نے بیان کیا ، کہا کہ ہم سے یزید بن ابی مریم نے بیان کیا ، کہا کہ ہم سے عبایہ بن رفاعہ بن رافع بن خدیج نے بیان کیا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ حَدَّثَنَا عَبَايَةُ بْنُ رِفَاعَةَ، قَالَ أَدْرَكَنِي أَبُو عَبْسٍ وَأَنَا أَذْهَبُ، إِلَى الْجُمُعَةِ فَقَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنِ اغْبَرَّتْ قَدَمَاهُ فِي سَبِيلِ اللَّهِ حَرَّمَهُ اللَّهُ عَلَى النَّارِ ‏\"‏‏.‏",
                "headingArabic": "الْمَشْىِ إِلَى الْجُمُعَةِ",
                "headingUrdu": "بغیر جلدی چلنے کے لیے",
                "headingEnglish": "To go walking unhurriedly",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 883,
                "hadithNumber": "908",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"If the prayer is started do not run for it but just walk for it calmly and pray whatever you get, and complete whatever is missed. \"",
                "hadithUrdu": "آپ نے رسول اللہ صلی اللہ علیہ وسلم کو یہ کہتے ہوئے سنا کہ جب نماز کے لیے تکبیر کہی جائے تو دوڑتے ہوئے مت آؤ بلکہ ( اپنی معمولی رفتار سے ) آؤ پورے اطمینان کے ساتھ پھر نماز کا جو حصہ ( امام کے ساتھ ) پالو اسے پڑھ لو اور جو رہ جائے تو اسے بعد میں پورا کرو ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے ابن ابی ذئب نے بیان کیا ، کہا کہ ہم سے زہری نے سعید اور ابوسلمہ سے بیان کیا ، ان سے ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ( دوسری سند سے بیان کیا ) امام بخاری نے کہا اور ہم سے ابوالیمان نے بیان کیا ، کہا کہ ہمیں شعیب نے خبر دی ، انہیں زہری نے اور انہیں ابوسلمہ بن عبدالرحمٰن نے خبر دی ، وہ ابوہریرہ رضی اللہ عنہ سے روایت کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، قَالَ الزُّهْرِيُّ عَنْ سَعِيدٍ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَحَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا أُقِيمَتِ الصَّلاَةُ فَلاَ تَأْتُوهَا تَسْعَوْنَ، وَأْتُوهَا تَمْشُونَ عَلَيْكُمُ السَّكِينَةُ، فَمَا أَدْرَكْتُمْ فَصَلُّوا، وَمَا فَاتَكُمْ فَأَتِمُّوا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 884,
                "hadithNumber": "909",
                "englishNarrator": "Narrated `Abdullah bin Abi Qatada on the authority of his father:",
                "hadithEnglish": "The Prophet (p.b.u.h) said, \"Do not stand up (for prayer) unless you see me, and observe calmness and solemnity\".",
                "hadithUrdu": "آپ نے فرمایا جب تک مجھے دیکھ نہ لو صف بندی کے لیے کھڑے نہ ہوا کرو اور آہستگی سے چلنا لازم کر لو ۔",
                "urduNarrator": "ہم سے عمرو بن علی فلاس نے بیان کیا ، کہا کہ ہم سے ابو قتیبہ بن قتیبہ نے بیان کیا ، کہا کہ ہم سے علی بن مبارک نے یحییٰ بن ابی کثیر سے بیان کیا ، ان سے عبداللہ بن ابی قتادہ نے ( امام بخاری رحمہ اللہ کہتے ہیں کہ مجھے یقین ہے کہ ) عبداللہ نے اپنے باپ ابوقتادہ سے روایت کی ہے ، وہ نبی کریم صلی اللہ علیہ وسلم سے راوی ہیں کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنِي أَبُو قُتَيْبَةَ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ ـ لاَ أَعْلَمُهُ إِلاَّ عَنْ أَبِيهِ ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَقُومُوا حَتَّى تَرَوْنِي، وَعَلَيْكُمُ السَّكِينَةُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 885,
                "hadithNumber": "910",
                "englishNarrator": "Narrated Salman Al-Farsi رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) (p.b.u.h) said, \"Anyone who takes a bath on Friday and cleans himself as much as he can and puts oil (on his hair) or scents himself; and then proceeds for the prayer and does not force his way between two persons (assembled in the mosque for the Friday prayer), and prays as much as is written for him and remains quiet when the Imam delivers the Khutba, all his sins in between the present and the last Friday will be forgiven.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے جمعہ کے دن غسل کیا اور خوب پاکی حاصل کی اور تیل یا خوشبو استعمال کی ، پھر جمعہ کے لیے چلا اور دو آدمیوں کے بیچ میں نہ گھسا اور جتنی اس کی قسمت میں تھی ، نماز پڑھی ، پھر جب امام باہر آیا اور خطبہ شروع کیا تو خاموش ہو گیا ، اس کے اس جمعہ سے دوسرے جمعہ تک کے تمام گناہ بخش دیئے جائیں گے ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی انہوں نے کہا کہ ہمیں ابن ابی ذئب نے خبر دی ، انہیں سعید مقبری نے ، انہیں ان کے باپ ابوسعید نے ، انہیں عبداللہ بن ودیعہ نے ، انہیں سلمان فارسی رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنِ ابْنِ وَدِيعَةَ، عَنْ سَلْمَانَ الْفَارِسِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ، وَتَطَهَّرَ بِمَا اسْتَطَاعَ مِنْ طُهْرٍ، ثُمَّ ادَّهَنَ أَوْ مَسَّ مِنْ طِيبٍ، ثُمَّ رَاحَ فَلَمْ يُفَرِّقْ بَيْنَ اثْنَيْنِ، فَصَلَّى مَا كُتِبَ لَهُ، ثُمَّ إِذَا خَرَجَ الإِمَامُ أَنْصَتَ، غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الأُخْرَى ‏\"‏‏.‏",
                "headingArabic": "لاَ يُفَرَّقُ بَيْنَ اثْنَيْنِ يَوْمَ الْجُمُعَةِ",
                "headingUrdu": "جمعہ کے دن دو آدمیوں کو الگ نہیں کرنا چاہیے۔",
                "headingEnglish": "One should not separate two persons on Fridays",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 886,
                "hadithNumber": "911",
                "englishNarrator": "Narrated \"Ibn `Umar:",
                "hadithEnglish": "'The Prophet (ﷺ) forbade that a man should make another man to get up to sit in his place' \". I said to Nafi`, 'Is it for Jumua prayer only?' He replied, \"For Jumua prayer and any other (prayer).\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا ہے کہ کوئی شخص اپنے مسلمان بھائی کو اٹھا کر اس کی جگہ خود بیٹھ جائے ۔ میں نے نافع سے پوچھا کہ کیا یہ جمعہ کے لیے ہے تو انہوں نے جواب دیا کہ جمعہ اور غیر جمعہ سب کے لیے یہی حکم ہے ۔",
                "urduNarrator": "ہم سے محمد بن سلام بیکندی رحمہ اللہ نے بیان کیا ، کہا کہ ہمیں مخلد بن یزید نے خبر دی ، کہا کہ ہمیں ابن جریج نے خبر دی ، کہا کہ میں نے نافع سے سنا ، انہوں نے کہا میں نے حضرت عبداللہ بن عمر سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، قَالَ أَخْبَرَنَا مَخْلَدُ بْنُ يَزِيدَ، قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ نَافِعًا، يَقُولُ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يُقِيمَ الرَّجُلُ أَخَاهُ مِنْ مَقْعَدِهِ وَيَجْلِسَ فِيهِ‏.‏ قُلْتُ لِنَافِعٍ الْجُمُعَةَ قَالَ الْجُمُعَةَ وَغَيْرَهَا‏.‏",
                "headingArabic": "لاَ يُقِيمُ الرَّجُلُ أَخَاهُ يَوْمَ الْجُمُعَةِ وَيَقْعُدُ فِي مَكَانِهِ",
                "headingUrdu": "آدمی کو چاہیے کہ اپنے بھائی کو اپنی جگہ پر نہ بٹھائے۔",
                "headingEnglish": "A man should not make his brother get up to sit in his place",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 887,
                "hadithNumber": "912",
                "englishNarrator": "Narrated As-Saib bin Yazid:",
                "hadithEnglish": "In the lifetime of the Prophet, Abu Bakr and `Umar, the Adhan for the Jumua prayer used to be pronounced when the Imam sat on the pulpit. But during the Caliphate of `Uthman رضی اللہ عنہ when the Muslims increased in number, a third Adhan at Az-Zaura' was added. Abu `Abdullah said, \"Az-Zaura' is a place in the market of Medina.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم اور حضرت ابوبکر اور حضرت عمر رضی اللہ عنہما کے زمانے میں جمعہ کی پہلی اذان اس وقت دی جاتی تھی جب امام منبر پر خطبہ کے لیے بیٹھتے لیکن حضرت عثمان رضی اللہ عنہ کے زمانہ میں جب مسلمانوں کی کثرت ہو گئی تو وہ مقام زوراء سے ایک اور اذان دلوانے لگے ۔ ابوعبداللہ امام بخاری رحمہ اللہ فرماتے ہیں کہ زوراء مدینہ کے بازار میں ایک جگہ ہے ۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا ، انہوں نے کہا کہ ہم سے ابن ابی ذئب نے زہری کے واسطے سے بیان کیا ، ان سے سائب بن یزید نے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنِ السَّائِبِ بْنِ يَزِيدَ، قَالَ كَانَ النِّدَاءُ يَوْمَ الْجُمُعَةِ أَوَّلُهُ إِذَا جَلَسَ الإِمَامُ عَلَى الْمِنْبَرِ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ ـ رضى الله عنهما ـ فَلَمَّا كَانَ عُثْمَانُ ـ رضى الله عنه ـ وَكَثُرَ النَّاسُ زَادَ النِّدَاءَ الثَّالِثَ عَلَى الزَّوْرَاءِ‏.‏",
                "headingArabic": "الأَذَانِ يَوْمَ الْجُمُعَةِ",
                "headingUrdu": "جمعہ کے دن اذان (نماز جمعہ کے لیے)",
                "headingEnglish": "Adhan on Friday (for the Jumu'ah prayer)",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 888,
                "hadithNumber": "913",
                "englishNarrator": "Narrated As-Saib bin Yazid:",
                "hadithEnglish": "The person who increased the number of Adhans for the Jumua prayers to three was `Uthman bin `Affan رضی اللہ عنہ and it was when the number of the (Muslim) people of Medina had increased. In the lifetime of the Prophet (ﷺ) there was only one Mu'adh-dhin and the Adhan used to be pronounced only after the Imam had taken his seat (i.e. on the pulpit).",
                "hadithUrdu": "جمعہ میں تیسری اذان حضرت عثمان بن عفان رضی اللہ عنہ نے بڑھائی جبکہ مدینہ میں لوگ زیادہ ہو گئے تھے جب کہ نبی کریم صلی اللہ علیہ وسلم کے ایک ہی مؤذن تھے ۔ ( آپ صلی اللہ علیہ وسلم کے دور میں ) جمعہ کی اذان اس وقت دی جاتی جب امام منبر پر بیٹھتا ۔",
                "urduNarrator": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، انہوں نے کہا کہ ہم سے عبد العزیز بن ابوسلمہ ماجشون نے بیان کیا ، انہوں نے کہا ہم سے زہری نے بیان کیا ، ان سے سائب بن یزید نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ الْمَاجِشُونُ، عَنِ الزُّهْرِيِّ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّ الَّذِي، زَادَ التَّأْذِينَ الثَّالِثَ يَوْمَ الْجُمُعَةِ عُثْمَانُ بْنُ عَفَّانَ ـ رضى الله عنه ـ حِينَ كَثُرَ أَهْلُ الْمَدِينَةِ، وَلَمْ يَكُنْ لِلنَّبِيِّ صلى الله عليه وسلم مُؤَذِّنٌ غَيْرَ وَاحِدٍ، وَكَانَ التَّأْذِينُ يَوْمَ الْجُمُعَةِ حِينَ يَجْلِسُ الإِمَامُ، يَعْنِي عَلَى الْمِنْبَرِ‏.‏",
                "headingArabic": "الْمُؤَذِّنِ الْوَاحِدِ يَوْمَ الْجُمُعَةِ",
                "headingUrdu": "جمعہ کے دن ایک موذن",
                "headingEnglish": "One Mu'adh-dhin on Friday",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 889,
                "hadithNumber": "914",
                "englishNarrator": "Narrated Abu Umama bin Sahl bin Hunaif:",
                "hadithEnglish": "I heard Muawiya bin Abi Sufyan رضی اللہ عنہما (repeating the statements of the Adhan) while he was sitting on the pulpit. When the Mu'adh-dhin pronounced the Adhan saying, \"Allahu-Akbar, Allahu Akbar\", Muawiya said: \"Allah Akbar, Allahu Akbar.\" And when the Mu'adh-dhin said, \"Ash-hadu an la ilaha illal-lah (I testify that none has the right to be worshipped but Allah)\", Muawiya said, \"And (so do) I\". When he said, \"Ash-hadu anna Muhammadan Rasulullah\" (I testify that Muhammad is Allah's Apostle), Muawiya said, \"And (so do) I\". When the Adhan was finished, Muawiya said, \"O people, when the Mu'adh-dhin pronounced the Adhan I heard Allah's Messenger (ﷺ) on this very pulpit saying what you have just heard me saying\".",
                "hadithUrdu": "میں نے معاویہ بن ابی سفیان رضی اللہ عنہما کو دیکھا آپ منبر پر بیٹھے ، مؤذن نے اذان دی «الله أكبر الله أكبر‏» معاویہ رضی اللہ عنہ نے جواب دیا «الله أكبر الله أكبر‏» مؤذن نے کہا «أشهد أن لا إله إلا الله‏» معاویہ نے جواب دیا «وأنا‏» اور میں بھی توحید کی گواہی دیتا ہوں مؤذن نے کہا «أشهد أن محمدا رسول الله‏» معاویہ نے جواب دیا «وأنا‏» اور میں بھی محمد صلی اللہ علیہ وسلم کی رسالت کی گواہی دیتا ہوں جب مؤذن اذان کہہ چکا تو آپ نے کہا حاضرین ! میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا اسی جگہ یعنی منبر پر آپ بیٹھے تھے مؤذن نے اذان دی تو آپ یہی فرما رہے تھے جو تم نے مجھ کو کہتے سنا ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا ، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا کہ ہمیں ابوبکر بن عثمان بن سہل بن حنیف نے خبر دی ، انہیں ابوامامہ بن سہل بن حنیف نے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا أَبُو بَكْرِ بْنُ عُثْمَانَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ،، وَهُوَ جَالِسٌ عَلَى الْمِنْبَرِ، أَذَّنَ الْمُؤَذِّنُ قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ‏.‏ قَالَ مُعَاوِيَةُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ‏.‏ قَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ فَقَالَ مُعَاوِيَةُ وَأَنَا‏.‏ فَقَالَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ‏.‏ فَقَالَ مُعَاوِيَةُ وَأَنَا‏.‏ فَلَمَّا أَنْ قَضَى التَّأْذِينَ قَالَ يَا أَيُّهَا النَّاسُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى هَذَا الْمَجْلِسِ حِينَ أَذَّنَ الْمُؤَذِّنُ يَقُولُ مَا سَمِعْتُمْ مِنِّي مِنْ مَقَالَتِي‏.‏",
                "headingArabic": "يُؤَذِّنُ الإِمَامُ عَلَى الْمِنْبَرِ إِذَا سَمِعَ النِّدَاءَ",
                "headingUrdu": "امام جب اذان سنتا ہے تو اسے دہراتا ہے۔",
                "headingEnglish": "The Imam repeats the wordings of the Adhan when he hears it",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 890,
                "hadithNumber": "915",
                "englishNarrator": "Narrated As-Sa'ib bin Yazid I:",
                "hadithEnglish": "`Uthman bin `Affan رضی اللہ عنہ introduced the second Adhan on Fridays when the number of the people in the mosque increased. Previously the Adhan on Fridays used to be pronounced only after the Imam had taken his seat (on the pulpit).",
                "hadithUrdu": "جمعہ کی دوسری اذان کا حکم حضرت عثمان بن عفان رضی اللہ عنہ نے اس وقت دیا جب نمازی بہت زیادہ ہو گئے تھے اور جمعہ کے دن اذان اس وقت ہوتی جب امام منبر پر بیٹھا کرتا تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے عقیل کے واسطے سے بیان کیا ، ان سے ابن شہاب نے کہ سائب بن یزید نے انہیں خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ السَّائِبَ بْنَ يَزِيدَ، أَخْبَرَهُ أَنَّ التَّأْذِينَ الثَّانِيَ يَوْمَ الْجُمُعَةِ أَمَرَ بِهِ عُثْمَانُ حِينَ كَثُرَ أَهْلُ الْمَسْجِدِ، وَكَانَ التَّأْذِينُ يَوْمَ الْجُمُعَةِ حِينَ يَجْلِسُ الإِمَامُ‏.‏",
                "headingArabic": "الْجُلُوسِ عَلَى الْمِنْبَرِ عِنْدَ التَّأْذِينِ",
                "headingUrdu": "اذان کے وقت منبر پر بیٹھنا",
                "headingEnglish": "To sit on the pulpit while Adhan is pronounced",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 891,
                "hadithNumber": "916",
                "englishNarrator": "Narrated As-Saib bin Yazid رضی اللہ عنہ :",
                "hadithEnglish": "\"In the lifetime of Allah's Messenger (ﷺ), and Abu Bakr and `Umar رضی اللہ عنہما , the Adhan for the Jumua prayer used to be pronounced after the Imam had taken his seat on the pulpit. But when the people increased in number during the caliphate of `Uthman رضی اللہ عنہما , he introduced a third Adhan (on Friday for the Jumua prayer) and it was pronounced at Az-Zaura' and that new state of affairs remained so in the succeeding years.",
                "hadithUrdu": "جمعہ کی پہلی اذان رسول اللہ صلی اللہ علیہ وسلم اور حضرت ابوبکر اور حضرت عمر رضی اللہ عنہما کے زمانے میں اس وقت دی جاتی تھی جب امام منبر پر بیٹھتا ۔ جب حضرت عثمان بن عفان رضی اللہ عنہ کا دور آیا اور نمازیوں کی تعداد بڑھ گئی تو آپ نے جمعہ کے دن ایک تیسری اذان کا حکم دیا ، یہ اذان مقام زوراء پر دی گئی اور بعد میں یہی دستور قائم رہا ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا کہ ہم کو یونس بن یزید نے زہری سے خبر دی ، انہوں نے کہا کہ میں نے سائب بن یزید رضی اللہ عنہ سے یہ سنا تھا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، يَقُولُ إِنَّ الأَذَانَ يَوْمَ الْجُمُعَةِ كَانَ أَوَّلُهُ حِينَ يَجْلِسُ الإِمَامُ يَوْمَ الْجُمُعَةِ عَلَى الْمِنْبَرِ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَعُمَرَ ـ رضى الله عنهما ـ فَلَمَّا كَانَ فِي خِلاَفَةِ عُثْمَانَ ـ رضى الله عنه ـ وَكَثُرُوا، أَمَرَ عُثْمَانُ يَوْمَ الْجُمُعَةِ بِالأَذَانِ الثَّالِثِ، فَأُذِّنَ بِهِ عَلَى الزَّوْرَاءِ، فَثَبَتَ الأَمْرُ عَلَى ذَلِكَ‏.‏",
                "headingArabic": "التَّأْذِينِ عِنْدَ الْخُطْبَةِ",
                "headingUrdu": "خطبہ دینے سے پہلے اذان",
                "headingEnglish": "Adhan before delivering the Khutba",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 892,
                "hadithNumber": "917",
                "englishNarrator": "Narrated Abu Hazim bin Dinar:",
                "hadithEnglish": "Some people went to Sahl bin Sa`d As-Sa`idi رضی اللہ عنہ and told him that they had different opinions regarding the wood of the pulpit. They asked him about it and he said, \"By Allah, I know of what wood the pulpit was made, and no doubt I saw it on the very first day when Allah's Messenger (ﷺ) took his seat on it. Allah's Messenger (ﷺ) sent for such and such an Ansari woman (and Sahl mentioned her name) and said to her, 'Order your slave-carpenter to prepare for me some pieces of wood (i.e. pulpit) on which I may sit at the time of addressing the people.' So she ordered her slave-carpenter and he made it from the tamarisk of the forest and brought it (to the woman). The woman sent that (pulpit) to Allah's Messenger (ﷺ) who ordered it to be placed here. Then I saw Allah's Messenger (ﷺ) praying on it and then bowed on it. Then he stepped back, got down and prostrated on the ground near the foot of the pulpit and again ascended the pulpit. After finishing the prayer he faced the people and said, 'I have done this so that you may follow me and learn the way I pray.' \"",
                "hadithUrdu": "کچھ لوگ حضرت سہل بن سعد ساعدی رضی اللہ عنہ کے پاس آئے ۔ ان کا آپس میں اس پر اختلاف تھا کہ منبرنبوی علی صاحبہا الصلوۃ والسلام کی لکڑی کس درخت کی تھی ۔ اس لیے سعد رضی اللہ عنہ سے اس کے متعلق دریافت کیا گیا آپ نے فرمایا خدا گواہ ہے میں جانتا ہوں کہ منبرنبوی کس لکڑی کا تھا ۔ پہلے دن جب وہ رکھا گیا اور سب سے پہلے جب اس پر رسول اللہ صلی اللہ علیہ وسلم بیٹھے تو میں اس کو بھی جانتا ہوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے انصار کی فلاں عورت کے پاس جن کا حضرت سعد رضی اللہ عنہ نے نام بھی بتایا تھا ۔ آدمی بھیجا کہ وہ اپنے بڑھئی غلام سے میرے لیے لکڑی جوڑ دینے کے لیے کہیں ۔ تاکہ جب مجھے لوگوں سے کچھ کہنا ہو تو اس پر بیٹھا کروں چنانچہ انہوں نے اپنے غلام سے کہا اور وہ غابہ کے جھاؤ کی لکڑی سے اسے بنا کر لایا ۔ انصاری خاتون نے اسے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھیج دیا ۔ آنحضور صلی اللہ علیہ وسلم نے اسے یہاں رکھوایا میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم نے اسی پر ( کھڑے ہو کر ) نماز پڑھائی ۔ اسی پر کھڑے کھڑے تکبیر کہی ۔ اسی پر رکوع کیا ۔ پھر الٹے پاؤں لوٹے اور منبر کی جڑ میں سجدہ کیا اور پھر دوبارہ اسی طرح کیا جب آپ نماز سے فارغ ہوئے تو لوگوں کو خطاب فرمایا ۔ لوگو ! میں نے یہ اس لیے کیا کہ تم میری پیروی کرو اور میری طرح نماز پڑھنی سیکھ لو ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا کہ ہم سے یعقوب بن عبدالرحمٰن بن محمد بن عبداللہ بن عبد القاری قرشی اسکندرانی نے بیان کیا ، انہوں نے کہا کہ ہم سے ابوحازم بن دینار نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدٍ الْقَارِيُّ الْقُرَشِيُّ الإِسْكَنْدَرَانِيُّ، قَالَ حَدَّثَنَا أَبُو حَازِمِ بْنُ دِينَارٍ، أَنَّ رِجَالاً، أَتَوْا سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، وَقَدِ امْتَرَوْا فِي الْمِنْبَرِ مِمَّ عُودُهُ فَسَأَلُوهُ عَنْ ذَلِكَ فَقَالَ وَاللَّهِ إِنِّي لأَعْرِفُ مِمَّا هُوَ، وَلَقَدْ رَأَيْتُهُ أَوَّلَ يَوْمٍ وُضِعَ، وَأَوَّلَ يَوْمٍ جَلَسَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى فُلاَنَةَ ـ امْرَأَةٍ قَدْ سَمَّاهَا سَهْلٌ ـ ‏\"‏ مُرِي غُلاَمَكِ النَّجَّارَ أَنْ يَعْمَلَ لِي أَعْوَادًا أَجْلِسُ عَلَيْهِنَّ إِذَا كَلَّمْتُ النَّاسَ ‏\"‏‏.‏ فَأَمَرَتْهُ فَعَمِلَهَا مِنْ طَرْفَاءِ الْغَابَةِ ثُمَّ جَاءَ بِهَا، فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَمَرَ بِهَا فَوُضِعَتْ هَا هُنَا، ثُمَّ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى عَلَيْهَا، وَكَبَّرَ وَهْوَ عَلَيْهَا، ثُمَّ رَكَعَ وَهْوَ عَلَيْهَا، ثُمَّ نَزَلَ الْقَهْقَرَى فَسَجَدَ فِي أَصْلِ الْمِنْبَرِ ثُمَّ عَادَ، فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\"‏ أَيُّهَا النَّاسُ إِنَّمَا صَنَعْتُ هَذَا لِتَأْتَمُّوا وَلِتَعَلَّمُوا صَلاَتِي ‏\"‏‏.‏",
                "headingArabic": "الْخُطْبَةِ عَلَى الْمِنْبَرِ",
                "headingUrdu": "منبر پر خطبہ دینا",
                "headingEnglish": "(to deliver) the Khutba on the pulpit",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 893,
                "hadithNumber": "918",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) used to stand by a stem of a date-palm tree (while delivering a sermon). When the pulpit was placed for him we heard that stem crying like a pregnant she-camel till the Prophet (ﷺ) got down from the pulpit and placed his hand over it.\r\nSulaiman, Yahya, Hafs  bin Obaidullah bin Anas heard it from Hadrat Jaabir.",
                "hadithUrdu": "ایک کھجور کا تنا تھا جس پر نبی کریم صلی اللہ علیہ وسلم ٹیک لگا کر کھڑے ہوا کرتے تھے ۔ جب آپ صلی اللہ علیہ وسلم کے لیے منبر بن گیا ( آپ صلی اللہ علیہ وسلم نے اس تنے پر ٹیک نہیں لگایا ) تو ہم نے اس سے رونے کی آواز سنی جیسے دس مہینے کی گابھن اونٹنی آواز کرتی ہے ۔ نبی کریم صلی اللہ علیہ وسلم نے منبر سے اتر کر اپنا ہاتھ اس پر رکھا ( تب وہ آواز موقوف ہوئی ) \r\nاور سلیمان نے یحییٰ سے یوں حدیث بیان کی کہ مجھے حفص بن عبیداللہ بن انس نے خبر دی اور انہوں نے جابر سے سنا ۔",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا کہ ہم سے محمد بن جعفر بن ابی کثیر نے بیان کیا ، کہا کہ مجھے یحییٰ بن سعید نے خبر دی ، کہا کہ مجھے حفص بن عبداللہ بن انس نے خبر دی ، انہوں نے جابر بن عبداللہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ، قَالَ أَخْبَرَنِي ابْنُ أَنَسٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ كَانَ جِذْعٌ يَقُومُ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم فَلَمَّا وُضِعَ لَهُ الْمِنْبَرُ سَمِعْنَا لِلْجِذْعِ مِثْلَ أَصْوَاتِ الْعِشَارِ حَتَّى نَزَلَ النَّبِيُّ صلى الله عليه وسلم فَوَضَعَ يَدَهُ عَلَيْهِ‏.‏ قَالَ سُلَيْمَانُ عَنْ يَحْيَى أَخْبَرَنِي حَفْصُ بْنُ عُبَيْدِ اللَّهِ بْنِ أَنَسٍ أَنَّهُ سَمِعَ جَابِرًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 894,
                "hadithNumber": "919",
                "englishNarrator": "Narrated Salim that his father said:",
                "hadithEnglish": "\"I heard the Prophet (ﷺ) delivering the Khutba on the pulpit and he said, 'Whoever comes for the Jumua prayer should take a bath (before coming).' \"",
                "hadithUrdu": "میں نے نبی کریم صلی الہ علیہ وسلم سے سنا ۔ آپ صلی اللہ علیہ وسلم نے منبر پر خطبہ دیتے ہوئے فرمایا کہ جو جمعہ کے لیے آئے وہ پہلے غسل کر لیا کرے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا کہ ہم سے ابن ابی ذئب نے بیان کیا ، ان سے زہری نے ، ان سے سالم نے ، ان سے ان کے باپ ( ابن عمر رضی اللہ عنہما ) نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ عَلَى الْمِنْبَرِ فَقَالَ ‏ \"‏ مَنْ جَاءَ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 895,
                "hadithNumber": "920",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) used to deliver the Khutba while standing and then he would sit, then stand again as you do now-a-days.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کھڑے ہو کر خطبہ دیتے تھے ۔ پھر بیٹھ جاتے اور پھر کھڑے ہوتے جیسے تم لوگ بھی آج کل کرتے ہو ۔",
                "urduNarrator": "ہم سے عبیداللہ بن عمر قواریری نے بیان کیا ، انہوں نے کہا کہ ہم سے خالد بن حارث نے بیان کیا ، انہوں نے کہا کہ ہم سے عبیداللہ بن عمر نے نافع سے بیان کیا ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ قَائِمًا ثُمَّ يَقْعُدُ ثُمَّ يَقُومُ، كَمَا تَفْعَلُونَ الآنَ‏.‏",
                "headingArabic": "الْخُطْبَةِ قَائِمًا",
                "headingUrdu": "کھڑے ہو کر خطبہ دینا",
                "headingEnglish": "To deliver the Khutba while standing",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 896,
                "hadithNumber": "921",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "One day the Prophet (ﷺ) sat on the pulpit and we sat around him.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک دن منبر پر تشریف فرما ہوئے اور ہم سب آپ صلی اللہ علیہ وسلم کے ارد گرد بیٹھ گئے ۔",
                "urduNarrator": "ہم سے معاذ بن فضالہ نے بیان کیا ، کہا کہ ہم سے ہشام دستوائی نے یحی بن ابی کثیر سے بیان کیا ، ان سے ہلال بن ابی میمونہ نے ، انہوں نے کہا ہم سے عطاء بن یسار نے بیان کیا ، انہوں نے ابو سعید خدری رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ هِلاَلِ بْنِ أَبِي مَيْمُونَةَ، حَدَّثَنَا عَطَاءُ بْنُ يَسَارٍ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، قَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم جَلَسَ ذَاتَ يَوْمٍ عَلَى الْمِنْبَرِ وَجَلَسْنَا حَوْلَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 897,
                "hadithNumber": "922",
                "englishNarrator": "Narrated Asma' bint Abi Bakr رضی اللہ عنہما :",
                "hadithEnglish": "\"I went to 'Aishah رضی اللہ عنہما and the people were offering Salat. I asked her, 'What is wrong with the people ?' She pointed towards the sky with her head. I asked her, 'Is there a sign ?' 'Aishah nodded with her head meaning 'Yes'.\" Asma' رضی اللہ عنہما added, \"Allah's Messenger (ﷺ) prolonged the Salat to such an extent that I fainted. There was a waterskin by my side and I opened it and poured some water on my head. When Allah's Messenger (ﷺ) finished Salat, and the solar eclipse had cleared, the Prophet (ﷺ) addressed the people and praised Allah as He deserves and said, 'Amma ba'du'.\" Asma' further said, \"Some Ansari women started talking, so I turned to them in order to make them quiet. I asked 'Aishah what the Prophet (ﷺ) had said. 'Aishah said: 'He said, 'I have seen things at this place of mine which were never shown to me before; (I have seen) even Paradise and Hell. And, no doubt it has been revealed to me that you (people) will be put in trial in your graves like or nearly like the trial of Masih Ad-Dajjal. (The angels) will come to everyone of you and ask him, 'What do you know about this man (Prophet Muhammad (ﷺ)) ?\" The faithful believer or firm believer (Hisham was in doubt which word the Prophet (ﷺ) used), will say, 'He is Allah's Messenger (ﷺ) and he is Muhammad (ﷺ) who came to us with clear evidences and guidance. So we believed him, accepted his teachings and followed and trusted his teaching.' Then the angels will tell him to sleep (in peace) as they have come to know that he was a believer. But the hypocrite or a doubtful person (Hisham is not sure as to which word the Prophet (ﷺ) used), will be asked what he knew about this man (Prophet Muhammed (ﷺ)). He will say, 'I do not know but I heard the people saying something (about him) so I said the same' \" Hisham added, \"Fatima told me that she remembered that narration completely by heart except that she said about the hypocrite or a doubtful person that he will be punished severely.\"",
                "hadithUrdu": "میں عائشہ رضی اللہ عنہا کے پاس گئی ۔ لوگ نماز پڑھ رہے تھے ۔ میں نے ( اس بے وقت نماز پر تعجب سے پوچھا کہ ) یہ کیا ہے ؟ حضرت عائشہ رضی اللہ عنہا نے سر سے آسمان کی طرف اشارہ کیا ۔ میں نے پوچھا کیا کوئی نشانی ہے ؟ انہوں نے سر کے اشارہ سے ہاں کہا ( کیونکہ سورج گہن ہو گیا تھا ) اسماء رضی اللہ عنہا نے کہا کہ نبی کریم صلی اللہ علیہ وسلم دیر تک نماز پڑھتے رہے ۔ یہاں تک کہ مجھ کو غشی آنے لگی ۔ قریب ہی ایک مشک میں پانی بھرا رکھا تھا ۔ میں اسے کھول کر اپنے سر پر پانی ڈالنے لگی ۔ پھر جب سورج صاف ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے نماز ختم کر دی ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے خطبہ دیا ۔ پہلے اللہ تعالیٰ کی اس کی شان کے مناسب تعریف بیان کی ۔ اس کے بعد فرمایا «امابعد» ! اتنا فرمانا تھا کہ کچھ انصاری عورتیں شور کرنے لگیں ۔ اس لیے میں ان کی طرف بڑھی کہ انہیں چپ کراؤں ( تاکہ رسول اللہ صلی اللہ علیہ وسلم کی بات اچھی طرح سن سکوں مگر میں آپ کا کلام نہ سن سکی ) تو پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم نے کیا فرمایا ؟ انہوں نے بتایا کہ آپ نے فرمایا کہ بہت سی چیزیں جو میں نے اس سے پہلے نہیں دیکھی تھیں ، آج اپنی اس جگہ سے میں نے انہیں دیکھ لیا ۔ یہاں تک کہ جنت اور دوزخ تک میں نے آج دیکھی ۔ مجھے وحی کے ذریعہ یہ بھی بتایا گیا کہ قبروں میں تمہاری ایسی آزمائش ہو گی جیسے کانے دجال کے سامنے یا اس کے قریب قریب ۔ تم میں سے ہر ایک کے پاس فرشتہ آئے گا اور پوچھے گا کہ تو اس شخص کے بارے میں کیا اعتقاد رکھتا تھا ؟ مومن یا یہ کہا کہ یقین والا ( ہشام کو شک تھا ) کہے گا کہ وہ محمد رسول اللہ صلی اللہ علیہ وسلم ہیں ، ہمارے پاس ہدایت اور واضح دلائل لے کر آئے ، اس لیے ہم ان پر ایمان لائے ، ان کی دعوت قبول کی ، ان کی اتباع کی اور ان کی تصدیق کی ۔ اب اس سے کہا جائے گا کہ تو تو صالح ہے ، آرام سے سو جا ۔ ہم پہلے ہی جانتے تھے کہ تیرا ان پر ایمان ہے ۔ ہشام نے شک کے اظہار کے ساتھ کہا کہ رہا منافق یا شک کرنے والا تو جب اس سے پوچھا جائے گا کہ تو اس شخص کے بارے میں کیا کہتا ہے تو وہ جواب دے گا کہ مجھے نہیں معلوم میں نے لوگوں کو ایک بات کہتے سنا اسی کے مطابق میں نے بھی کہا ۔ ہشام نے بیان کیا کہ فاطمہ بنت منذر نے جو کچھ کہا تھا ۔ میں نے وہ سب یاد رکھا ۔ لیکن انہوں نے قبر میں منافقوں پر سخت عذاب کے بارے میں جو کچھ کہا وہ مجھے یاد نہیں رہا ۔",
                "urduNarrator": "اور محمود بن غیلان ( امام بخاری رحمہ اللہ کے استاذ ) نے کہا کہ ہم سے ابواسامہ نے بیان کیا کہ ہم سے ہشام بن عروہ نے بیان کیا ، کہ مجھے فاطمہ بنت منذر نے خبر دی ، ان سے اسماء بنت ابی بکر رضی اللہ عنہما نے ، انہوں نے کہا کہ",
                "hadithArabic": "وَقَالَ مَحْمُودٌ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، قَالَ أَخْبَرَتْنِي فَاطِمَةُ بِنْتُ الْمُنْذِرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، قَالَتْ دَخَلْتُ عَلَى عَائِشَةَ ـ رضى الله عنها ـ وَالنَّاسُ يُصَلُّونَ قُلْتُ مَا شَأْنُ النَّاسِ فَأَشَارَتْ بِرَأْسِهَا إِلَى السَّمَاءِ‏.‏ فَقُلْتُ آيَةٌ فَأَشَارَتْ بِرَأْسِهَا أَىْ نَعَمْ‏.‏ قَالَتْ فَأَطَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم جِدًّا حَتَّى تَجَلاَّنِي الْغَشْىُ وَإِلَى جَنْبِي قِرْبَةٌ فِيهَا مَاءٌ فَفَتَحْتُهَا فَجَعَلْتُ أَصُبُّ مِنْهَا عَلَى رَأْسِي، فَانْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ تَجَلَّتِ الشَّمْسُ، فَخَطَبَ النَّاسَ، وَحَمِدَ اللَّهَ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ ‏\"‏‏.‏ قَالَتْ وَلَغِطَ نِسْوَةٌ مِنَ الأَنْصَارِ، فَانْكَفَأْتُ إِلَيْهِنَّ لأُسَكِّتَهُنَّ فَقُلْتُ لِعَائِشَةَ مَا قَالَ قَالَتْ قَالَ ‏\"‏ مَا مِنْ شَىْءٍ لَمْ أَكُنْ أُرِيتُهُ إِلاَّ قَدْ رَأَيْتُهُ فِي مَقَامِي هَذَا حَتَّى الْجَنَّةَ وَالنَّارَ، وَإِنَّهُ قَدْ أُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ مِثْلَ ـ أَوْ قَرِيبَ مِنْ ـ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، يُؤْتَى أَحَدُكُمْ، فَيُقَالُ لَهُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَأَمَّا الْمُؤْمِنُ ـ أَوْ قَالَ الْمُوقِنُ شَكَّ هِشَامٌ ـ فَيَقُولُ هُوَ رَسُولُ اللَّهِ، هُوَ مُحَمَّدٌ صلى الله عليه وسلم جَاءَنَا بِالْبَيِّنَاتِ وَالْهُدَى فَآمَنَّا وَأَجَبْنَا وَاتَّبَعْنَا وَصَدَّقْنَا‏.‏ فَيُقَالُ لَهُ نَمْ صَالِحًا، قَدْ كُنَّا نَعْلَمُ إِنْ كُنْتَ لَتُؤْمِنُ بِهِ‏.‏ وَأَمَّا الْمُنَافِقُ ـ أَوْ قَالَ الْمُرْتَابُ شَكَّ هِشَامٌ ـ فَيُقَالُ لَهُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَيَقُولُ لاَ أَدْرِي، سَمِعْتُ النَّاسَ يَقُولُونَ شَيْئًا فَقُلْتُهُ ‏\"‏‏.‏ قَالَ هِشَامٌ فَلَقَدْ قَالَتْ لِي فَاطِمَةُ فَأَوْعَيْتُهُ، غَيْرَ أَنَّهَا ذَكَرَتْ مَا يُغَلِّظُ عَلَيْهِ‏.‏",
                "headingArabic": "مَنْ قَالَ فِي الْخُطْبَةِ بَعْدَ الثَّنَاءِ أَمَّا بَعْدُ",
                "headingUrdu": "خطبہ میں \"امابعدو\" کہنا",
                "headingEnglish": "Saying \"Ammaba'du\" in the Khutba",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 898,
                "hadithNumber": "923",
                "englishNarrator": "Narrated `Amr bin Taghlib رضی اللہ عنہ :",
                "hadithEnglish": "Some property or something was brought to Allah's Messenger (ﷺ) and he distributed it. He gave to some men and ignored the others. Later he got the news of his being admonished by those whom he had ignored. So he glorified and praised Allah and said, \"Amma ba'du. By Allah, I may give to a man and ignore another, although the one whom I ignore is more beloved to me than the one whom I give. But I give to some people as I feel that they have no patience and no contentment in their hearts and I leave those who are patient and self-content with the goodness and wealth which Allah has put into their hearts and `Amr bin Taghlib is one of them.\" `Amr added, By Allah! Those words of Allah's Apostle are more beloved to me than the best red camels.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پاس کچھ مال آیا یا کوئی چیز آئی ۔ آپ نے بعض صحابہ کو اس میں سے عطا کیا اور بعض کو کچھ نہیں دیا ۔ پھر آپ کو معلوم ہوا کہ جن لوگوں کو آپ نے نہیں دیا تھا انہیں اس کا رنج ہوا ، اس لیے آپ نے اللہ کی حمد و تعریف کی پھر فرمایا «امابعد» ! خدا کی قسم میں بعض لوگوں کو دیتا ہوں اور بعض کو نہیں دیتا لیکن میں جس کو نہیں دیتا وہ میرے نزدیک ان سے زیادہ محبوب ہیں جن کو میں دیتا ہوں ۔ میں تو ان لوگوں کو دیتا ہوں جن کے دلوں میں بےصبری اور لالچ پاتا ہوں لیکن جن کے دل اللہ تعالیٰ نے خیر اور بےنیاز بنائے ہیں ، میں ان پر بھروسہ کرتا ہوں ۔ عمرو بن تغلب بھی ان ہی لوگوں میں سے ہیں ۔ خدا کی قسم میرے لیے رسول اللہ صلی اللہ علیہ وسلم کا یہ ایک کلمہ سرخ اونٹوں سے زیادہ محبوب ہے ۔",
                "urduNarrator": "ہم سے محمد بن معمر نے بیان کیا ، کہا کہ ہم سے ابو عاصم نے جریر بن حازم سے بیان کیا ، انہوں نے کہا کہ میں نے امام حسن بصری سے سنا ، انہوں نے بیان کیا کہ ہم نے عمرو بن تغلب رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ جَرِيرِ بْنِ حَازِمٍ، قَالَ سَمِعْتُ الْحَسَنَ، يَقُولُ حَدَّثَنَا عَمْرُو بْنُ تَغْلِبَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِمَالٍ أَوْ سَبْىٍ فَقَسَمَهُ، فَأَعْطَى رِجَالاً وَتَرَكَ رِجَالاً فَبَلَغَهُ أَنَّ الَّذِينَ تَرَكَ عَتَبُوا، فَحَمِدَ اللَّهَ ثُمَّ أَثْنَى عَلَيْهِ، ثُمَّ قَالَ ‏ \"‏ أَمَّا بَعْدُ، فَوَاللَّهِ إِنِّي لأُعْطِي الرَّجُلَ، وَأَدَعُ الرَّجُلَ، وَالَّذِي أَدَعُ أَحَبُّ إِلَىَّ مِنَ الَّذِي أُعْطِي وَلَكِنْ أُعْطِي أَقْوَامًا لِمَا أَرَى فِي قُلُوبِهِمْ مِنَ الْجَزَعِ وَالْهَلَعِ، وَأَكِلُ أَقْوَامًا إِلَى مَا جَعَلَ اللَّهُ فِي قُلُوبِهِمْ مِنَ الْغِنَى وَالْخَيْرِ، فِيهِمْ عَمْرُو بْنُ تَغْلِبَ ‏\"‏‏.‏ فَوَاللَّهِ مَا أُحِبُّ أَنَّ لِي بِكَلِمَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم حُمْرَ النَّعَمِ‏.‏ تَابَعَهُ يُونُسُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 899,
                "hadithNumber": "924",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Once in the middle of the night Allah's Messenger (ﷺ) went out and prayed in the mosque and some men prayed with him. The next morning the people spoke about it and so more people gathered and prayed with him (in the second night). They circulated the news in the morning, and so, on the third night the number of people increased greatly. Allah's Messenger (ﷺ) came out and they prayed behind him. On the fourth night the mosque was overwhelmed by the people till it could not accommodate them. Allah's Messenger (ﷺ) came out only for the Fajr prayer and when he finished the prayer, he faced the people and recited \"Tashah-hud\" (I testify that none has the right to be worshipped but Allah and that Muhammad is His Apostle), and then said, \"Amma ba'du. Verily your presence (in the mosque at night) was not hidden from me, but I was afraid that this prayer (Prayer of Tahajjud) might be made compulsory and you might not be able to carry it out.\"\r\nYounus corroborated him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے رات کے وقت اٹھ کر مسجد میں نماز پڑھی اور چند صحابہ بھی آپ صلی اللہ علیہ وسلم کی اقتداء میں نماز پڑھنے کھڑے ہو گئے ۔ صبح کو ان صحابہ ( رضوان اللہ علیہم اجمعین ) نے دوسرے لوگوں سے اس کا ذکر کیا چنانچہ ( دوسرے دن ) اس سے بھی زیادہ جمع ہو گئے اور آپ صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی ۔ دوسری صبح کو اس کا چرچا اور زیادہ ہوا پھر کیا تھا تیسری رات بڑی تعداد میں لوگ جمع ہو گئے اور جب رسول اللہ صلی اللہ علیہ وسلم اٹھے تو صحابہ رضی اللہ عنہم نے آپ صلی اللہ علیہ وسلم کے پیچھے نماز شروع کر دی ۔ چوتھی رات جو آئی تو مسجد میں نمازیوں کی کثرت سے تل رکھنے کی بھی جگہ نہیں تھی ۔ لیکن آج رات نبی کریم صلی اللہ علیہ وسلم نے یہ نماز نہ پڑھائی اور فجر کی نماز کے بعد لوگوں سے فرمایا ، پہلے آپ نے کلمہ شہادت پڑھا پھر فرمایا ۔ «امابعد» ! مجھے تمہاری اس حاضری سے کوئی ڈر نہیں لیکن میں اس بات سے ڈرا کہ کہیں یہ نماز تم پر فرض نہ کر دی جائے ، پھر تم سے یہ ادا نہ ہو سکے ۔\r\n اس روایت کی متابعت یونس نے کی ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث نے عقیل سے بیان کیا ، ان سے ابن شہاب نے ، انہوں نے کہا کہ مجھے عروہ نے خبر دی کہ حضرت عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ ذَاتَ لَيْلَةٍ مِنْ جَوْفِ اللَّيْلِ، فَصَلَّى فِي الْمَسْجِدِ، فَصَلَّى رِجَالٌ بِصَلاَتِهِ فَأَصْبَحَ النَّاسُ فَتَحَدَّثُوا، فَاجْتَمَعَ أَكْثَرُ مِنْهُمْ فَصَلَّوْا مَعَهُ، فَأَصْبَحَ النَّاسُ فَتَحَدَّثُوا فَكَثُرَ أَهْلُ الْمَسْجِدِ مِنَ اللَّيْلَةِ الثَّالِثَةِ، فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّوْا بِصَلاَتِهِ، فَلَمَّا كَانَتِ اللَّيْلَةُ الرَّابِعَةُ عَجَزَ الْمَسْجِدُ عَنْ أَهْلِهِ حَتَّى خَرَجَ لِصَلاَةِ الصُّبْحِ، فَلَمَّا قَضَى الْفَجْرَ أَقْبَلَ عَلَى النَّاسِ، فَتَشَهَّدَ ثُمَّ قَالَ ‏ \"‏ أَمَّا بَعْدُ فَإِنَّهُ لَمْ يَخْفَ عَلَىَّ مَكَانُكُمْ، لَكِنِّي خَشِيتُ أَنْ تُفْرَضَ عَلَيْكُمْ فَتَعْجِزُوا عَنْهَا ‏\"‏‏.‏ تَابَعَهُ يُونُسُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 900,
                "hadithNumber": "925",
                "englishNarrator": "Narrated Abu Hummaid As-Sa`idi:",
                "hadithEnglish": "One night Allah's Messenger (ﷺ) stood up after the prayer and recited \"Tashah-hud\" and then praised Allah as He deserved and said, To proceed! Abu Muaviyah and Abu Usamah corroborated him from Hisham, he from his father and he from Abu Humaid that the prophet ﷺ said: To proceed! And Adani corroborated him about 'To proceed!' from Sufyan,",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نماز عشاء کے بعد کھڑے ہوئے ۔ پہلے آپ نے کلمہ شہادت پڑھا ، پھر اللہ تعالیٰ کے لائق اس کی تعریف کی ، پھر فرمایا «امابعد» ! زہری کے ساتھ اس روایت کی متابعت ابومعاویہ اور ابواسامہ نے ہشام سے کی ، انہوں نے اپنے والد عروہ سے اس کی روایت کی ، انہوں نے ابوحمید سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ آپ صلی اللہ علیہ وسلم نے فرمایا «امابعد» ! اور ابوالیمان کے ساتھ اس حدیث کو عدنی  نے بھی سفیان سے روایت کیا ۔ اس میں صرف «امابعد» ہے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا کہ ہمیں شعیب نے زہری سے خبر دی ، انہوں نے کہا کہ مجھے عروہ نے ابو حمید ساعدی رضی اللہ عنہ سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ عَشِيَّةً بَعْدَ الصَّلاَةِ، فَتَشَهَّدَ وَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ ‏\"‏‏.‏ تَابَعَهُ أَبُو مُعَاوِيَةَ وَأَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ أَبِي حُمَيْدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَمَّا بَعْدُ ‏\"‏‏.‏ تَابَعَهُ الْعَدَنِيُّ عَنْ سُفْيَانَ فِي أَمَّا بَعْدُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 876,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=35",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=33",
                "label": "33",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=34",
                "label": "34",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=35",
                "label": "35",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=36",
                "label": "36",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=37",
                "label": "37",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=38",
                "label": "38",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=39",
                "label": "39",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=37",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=37",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=35",
        "to": 900,
        "total": 40465
    }
}