{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 49,
        "data": [
            {
                "id": 1201,
                "hadithNumber": "1244",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "When my father was martyred, I lifted the sheet from his face and wept and the people forbade me to do so but the Prophet (ﷺ) did not forbid me. Then my aunt Fatima رضی اللہ عنہا began weeping and the Prophet (ﷺ) said, \"It is all the same whether you weep or not. The angels were shading him continuously with their wings till you shifted him (from the field). \"\r\nIbn-e-Jurail corroborated him and said that Ibn-e-Munkadir told him and he heard from Hadrat Jabir  رضی اللہ عنہ.",
                "hadithUrdu": "جب میرے والد شہید کر دیئے گئے تو میں ان کے چہرے پر پڑا ہو کپڑا کھولتا اور روتا تھا ۔ دوسرے لوگ تو مجھے اس سے روکتے تھے لیکن نبی کریم صلی اللہ علیہ وسلم کچھ نہیں کہہ رہے تھے ۔ آخر میری چچی فاطمہ رضی اللہ عنہا بھی رونے لگیں تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ روؤ یا چپ رہو ۔ جب تک تم لوگ میت کو اٹھاتے نہیں ملائکہ تو برابر اس پر اپنے پروں کا سایہ کئے ہوئے ہیں ۔\r\n اس روایت کی متابعت شعبہ کے ساتھ ابن جریج نے کی ، انہیں ابن منکدر نے خبر دی اور انہوں نے جابر رضی اللہ عنہ سے سنا ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، انہوں نے کہا کہ ہم سے غندر نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، انہوں نے کہا کہ میں نے محمد بن منکدر سے سنا ، انہوں نے کہا کہ میں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ لَمَّا قُتِلَ أَبِي جَعَلْتُ أَكْشِفُ الثَّوْبَ عَنْ وَجْهِهِ أَبْكِي، وَيَنْهَوْنِي عَنْهُ وَالنَّبِيُّ صلى الله عليه وسلم لاَ يَنْهَانِي، فَجَعَلَتْ عَمَّتِي فَاطِمَةُ تَبْكِي، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ تَبْكِينَ أَوْ لاَ تَبْكِينَ، مَا زَالَتِ الْمَلاَئِكَةُ تُظِلُّهُ بِأَجْنِحَتِهَا حَتَّى رَفَعْتُمُوهُ ‏\"‏‏.‏ تَابَعَهُ ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ الْمُنْكَدِرِ سَمِعَ جَابِرًا ـ رضى الله عنه ـ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1202,
                "hadithNumber": "1245",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) informed (the people) about the death of An-Najashi on the very day he died. He went towards the Musalla (praying place) and the people stood behind him in rows. He said four Takbirs (i.e. offered the Funeral prayer).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے نجاشی کی وفات کی خبر اسی دن دی جس دن اس کی وفات ہوئی تھی ۔ پھر آپ صلی اللہ علیہ وسلم نماز پڑھنے کی جگہ گئے ۔ اور لوگوں کے ساتھ صف باندھ کر ( جنازہ کی نماز میں ) چار تکبیریں کہیں ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے مالک نے بیان کیا ، ان سے ابن شہاب نے ، ان سے سعید بن مسیب نے ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَعَى النَّجَاشِيَّ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ، خَرَجَ إِلَى الْمُصَلَّى، فَصَفَّ بِهِمْ وَكَبَّرَ أَرْبَعًا‏.‏",
                "headingArabic": "الرَّجُلِ يَنْعَى إِلَى أَهْلِ الْمَيِّتِ بِنَفْسِهِ",
                "headingUrdu": "وہ شخص جو میت کے رشتہ داروں کو (اس کی موت کی) خود اطلاع دیتا ہے۔",
                "headingEnglish": "A man who informs the relatives of the deceased person (of his death) by himself",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1203,
                "hadithNumber": "1246",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Zaid took over the flag and was martyred. Then it was taken by Jafar who was martyred as well. Then `Abdullah bin Rawaha took the flag but he too was martyred and at that time the eyes of Allah's Messenger (ﷺ) were full of tears. Then Khalid bin Al-Walid took the flag without being nominated as a chief (before hand) and was blessed with victory.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ زید نے جھنڈا سنبھالا لیکن وہ شہید ہو گئے ۔ پھر جعفر نے سنبھالا اور وہ بھی شہید ہو گئے ۔ پھر عبداللہ بن رواحہ نے سنبھالا اور وہ بھی شہید ہو گئے ۔ اس وقت رسول اللہ صلی اللہ علیہ وسلم کی آنکھوں میں آنسو بہ رہے تھے ۔ ( آپ صلی اللہ علیہ وسلم نے فرمایا ) اور پھر خالد بن ولید نے خود اپنے طور پر جھنڈا اٹھا لیا اور ان کو فتح حاصل ہوئی ۔",
                "urduNarrator": "ہم سے ابو معمر نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالوارث نے بیان کیا ، ان سے ایوب نے ، ان سے حمیدبن بلال نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَخَذَ الرَّايَةَ زَيْدٌ فَأُصِيبَ، ثُمَّ أَخَذَهَا جَعْفَرٌ فَأُصِيبَ، ثُمَّ أَخَذَهَا عَبْدُ اللَّهِ بْنُ رَوَاحَةَ فَأُصِيبَ ـ وَإِنَّ عَيْنَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم لَتَذْرِفَانِ ـ ثُمَّ أَخَذَهَا خَالِدُ بْنُ الْوَلِيدِ مِنْ غَيْرِ إِمْرَةٍ فَفُتِحَ لَهُ ‏\"‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1204,
                "hadithNumber": "1247",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "A person died and Allah's Messenger (ﷺ) used to visit him. He died at night and (the people) buried him at night. In the morning they informed the Prophet (about his death). He said, \"What prevented you from informing me?\" They replied, \"It was night and it was a dark night and so we disliked to trouble you.\" The Prophet (ﷺ) went to his grave and offered the (funeral) prayer.",
                "hadithUrdu": "ایک شخص کی وفات ہو گئی ۔ رسول اللہ صلی اللہ علیہ وسلم اس کی عیادت کو جایا کرتے تھے ۔ چونکہ ان کا انتقال رات میں ہوا تھا اس لیے رات ہی میں لوگوں نے انہیں دفن کر دیا اور جب صبح ہوئی تو آنحضور صلی اللہ علیہ وسلم کو خبر دی ، آپ صلی اللہ علیہ وسلم نے فرمایا ( کہ جنازہ تیار ہوتے وقت ) مجھے بتانے میں ( کیا ) رکاوٹ تھی ؟ لوگوں نے کہا کہ رات تھی اور اندھیرا بھی تھا ۔ اس لیے ہم نے مناسب نہیں سمجھا کہ کہیں آپ کو تکلیف ہو ۔ پھر آنحضور صلی اللہ علیہ وسلم اس کی قبر پر تشریف لائے اور نماز پڑھی ۔",
                "urduNarrator": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، انہیں ابومعاویہ نے خبر دی ، انہیں ابواسحاق شیبانی نے ، انہیں شعبی نے ، ان سے ابن عباس رضی اللہ عنہما نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ أَبِي إِسْحَاقَ الشَّيْبَانِيِّ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ مَاتَ إِنْسَانٌ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُهُ فَمَاتَ بِاللَّيْلِ فَدَفَنُوهُ لَيْلاً، فَلَمَّا أَصْبَحَ أَخْبَرُوهُ فَقَالَ ‏ \"‏ مَا مَنَعَكُمْ أَنْ تُعْلِمُونِي ‏\"‏‏.‏ قَالُوا كَانَ اللَّيْلُ فَكَرِهْنَا ـ وَكَانَتْ ظُلْمَةٌ ـ أَنْ نَشُقَّ عَلَيْكَ‏.‏ فَأَتَى قَبْرَهُ فَصَلَّى عَلَيْهِ‏.‏",
                "headingArabic": "الإِذْنِ بِالْجَنَازَةِ",
                "headingUrdu": "جنازے کی خبر پہنچانا (جلوس)",
                "headingEnglish": "Conveying the news of funeral (procession)",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1205,
                "hadithNumber": "1248",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A Muslim whose three children die before the age of puberty will be granted Paradise by Allah due to his mercy for them.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کسی مسلمان کے اگر تین بچے مر جائیں جو بلوغت کو نہ پہنچے ہوں تو اللہ تعالیٰ اس رحمت کے نتیجے میں جو ان بچوں سے وہ رکھتا ہے مسلمان ( بچے کے باپ اور ماں ) کو بھی جنت میں داخل کرے گا ۔",
                "urduNarrator": "ہم سے ابو معمر نے بیان کیا ، کہا کہ ہم سے عبدالوارث نے ، ان سے عبد العزیز نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَا مِنَ النَّاسِ مِنْ مُسْلِمٍ يُتَوَفَّى لَهُ ثَلاَثٌ لَمْ يَبْلُغُوا الْحِنْثَ، إِلاَّ أَدْخَلَهُ اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَتِهِ إِيَّاهُمْ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ مَنْ مَاتَ لَهُ وَلَدٌ فَاحْتَسَبَ",
                "headingUrdu": "اس شخص کی برتری جس کا بچہ مر جائے۔",
                "headingEnglish": "The superiority of the person whose child dies",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1206,
                "hadithNumber": "1249, 1250",
                "englishNarrator": "Narrated Abu Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "The women requested the Prophet, \"Please fix a day for us (to preach).\" So the Prophet (ﷺ) preached to them and said, \"A woman whose three children died would be screened from the Hell Fire by them,\" Hearing that, a woman asked, \"If two died?\" The Prophet (ﷺ) replied, \"Even two would screen her from the (Hell) Fire. \" And Abu Huraira رضی اللہ عنہ added, \"Those children should be below the age of puberty.",
                "hadithUrdu": "عورتوں نے نبی کریم صلی اللہ علیہ وسلم سے درخواست کی کہ ہمیں بھی نصیحت کرنے کے لیے آپ ایک دن خاص فرما دیجئیے ۔ آنحضور صلی اللہ علیہ وسلم نے ( ان کی درخواست منظور فرماتے ہوئے ایک خاص دن میں ) ان کو وعظ فرمایا اور بتلایا کہ جس عورت کے تین بچے مر جائیں تو وہ اس کے لیے جہنم سے پناہ بن جاتے ہیں ۔ اس پر ایک عورت نے پوچھا ، حضور ! اگر کسی کے دو ہی بچے مریں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ دو بچوں پر بھی ۔شریک نے ابن اصبہانی سے بیان کیا کہ ان سے ابوصالح نے بیان کیا اور ان سے ابوسعید اور ابوہریرہ رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے ۔حضرت ابوہریرہ رضی اللہ عنہ نے یہ بھی کہا کہ وہ بچے مراد ہیں جو ابھی بلوغت کو نہ پہنچے ہوں ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا کہ ہم سے شعبہ نے ، ان سے عبدالرحمٰن بن عبداللہ اصبہانی نے ، ان سے ذکوان نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الأَصْبَهَانِيِّ، عَنْ ذَكْوَانَ، عَنْ أَبِي سَعِيدٍ، رضى الله عنه أَنَّ النِّسَاءَ، قُلْنَ لِلنَّبِيِّ صلى الله عليه وسلم اجْعَلْ لَنَا يَوْمًا‏.‏ فَوَعَظَهُنَّ، وَقَالَ ‏\"‏ أَيُّمَا امْرَأَةٍ مَاتَ لَهَا ثَلاَثَةٌ مِنَ الْوَلَدِ كَانُوا حِجَابًا مِنَ النَّارِ ‏\"‏‏.‏ قَالَتِ امْرَأَةٌ وَاثْنَانِ‏.‏ قَالَ ‏\"‏ وَاثْنَانِ ‏\"‏‏.‏وَقَالَ شَرِيكٌ عَنِ ابْنِ الأَصْبَهَانِيِّ، حَدَّثَنِي أَبُو صَالِحٍ، عَنْ أَبِي سَعِيدٍ، وَأَبِي، هُرَيْرَةَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ أَبُو هُرَيْرَةَ ‏\"‏ لَمْ يَبْلُغُوا الْحِنْثَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1207,
                "hadithNumber": "1251",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"No Muslim whose three children died will go to the Fire except for Allah's oath (i.e. everyone has to pass over the bridge above the lake of fire).\"\r\nAbu Abdullah Imam Bukhari (may Allah have mercy on him) says: (The Qur'anic verse is this) Each one of you will have to pass through Hellfire.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کسی کے اگر تین بچے مر جائیں تو وہ دوزخ میں نہیں جائے گا اور اگر جائے گا بھی تو صرف قسم پوری کرنے کے لیے ۔ \r\nابوعبداللہ امام بخاری رحمہ اللہ فرماتے ہیں ۔ ( قرآن کی آیت یہ ہے ) تم میں سے ہر ایک کو دوزخ کے اوپر سے گزرنا ہو گا ۔",
                "urduNarrator": "ہم سے علی نے بیان کیا ، ان سے سفیان نے ، انہوں نے کہا کہ میں نے زہری سے سنا ، انہوں نے سعید بن مسیب سے سنا اور انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَمُوتُ لِمُسْلِمٍ ثَلاَثَةٌ مِنَ الْوَلَدِ، فَيَلِجَ النَّارَ إِلاَّ تَحِلَّةَ الْقَسَمِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ ‏{‏وَإِنْ مِنْكُمْ إِلاَّ وَارِدُهَا‏}‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1208,
                "hadithNumber": "1252",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) passed by a woman who was sitting and weeping beside a grave and said to her, \"Fear Allah and be patient.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک عورت کے پاس سے گزرے جو ایک قبر پر بیٹھی ہوئی رو رہی تھی ۔ آپ صلی اللہ علیہ وسلم نے اس سے فرمایا کہ اللہ سے ڈر اور صبر کر ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے ثابت نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِامْرَأَةٍ عِنْدَ قَبْرٍ وَهِيَ تَبْكِي فَقَالَ ‏ \"‏ اتَّقِي اللَّهَ وَاصْبِرِي ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ الرَّجُلِ لِلْمَرْأَةِ عِنْدَ الْقَبْرِ اصْبِرِي",
                "headingUrdu": "مرد کا قبر میں عورت سے کہنا کہ \"صبر کرو\"",
                "headingEnglish": "The saying of a man to a woman at the grave, \"Be patient\"",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1209,
                "hadithNumber": "1253",
                "englishNarrator": "Narrated Um 'Atiyya al-Ansariya رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) came to us when his daughter died and said, \"Wash her thrice or five times or more, if you see it necessary, with water and Sidr and then apply camphor or some camphor at the end; and when you finish, notify me.\" So when we finished it, we informed him and he gave us his waist-sheet and told us to shroud the dead body in it.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم کی بیٹی ( زینب یا ام کلثوم رضی اللہ عنہما ) کی وفات ہوئی آپ صلی اللہ علیہ وسلم وہاں تشریف لائے اور فرمایا کہ تین یا پانچ مرتبہ غسل دے دو اور اگر مناسب سمجھو تو اس سے بھی زیادہ دے سکتی ہو ۔ غسل کے پانی میں بیری کے پتے ملا لو اور آخر میں کافور یا ( یہ کہا کہ ) کچھ کافور کا استعمال کر لینا اور غسل سے فارغ ہونے پر مجھے خبر دے دینا ۔ چنانچہ ہم نے جب غسل دے لیا تو آپ صلی اللہ علیہ وسلم کو خبر دیدی ۔ آپ صلی اللہ علیہ وسلم نے ہمیں اپنا ازار دیا اور فرمایا کہ اسے ان کی قمیص بنا دو ۔ آپ صلی اللہ علیہ وسلم کی مراد اپنے ازار سے تھی ۔",
                "urduNarrator": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ایوب سختیانی نے اور ان سے محمد بن سیرین نے ، ان سے ام عطیہ انصاری رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ الأَنْصَارِيَّةِ ـ رضى الله عنها ـ قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ تُوُفِّيَتِ ابْنَتُهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مَنْ ذَلِكَ إِنْ رَأَيْتُنَّ ذَلِكَ بِمَاءٍ وَسِدْرٍ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَعْطَانَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏ تَعْنِي إِزَارَهُ‏.‏",
                "headingArabic": "غُسْلِ الْمَيِّتِ وَوُضُوئِهِ بِالْمَاءِ وَالسِّدْرِ",
                "headingUrdu": "میت کا غسل اور اس کا پانی اور سدر سے وضو",
                "headingEnglish": "The bath of a dead and his ablution with water and Sidr",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1210,
                "hadithNumber": "1254",
                "englishNarrator": "Narrated Um 'Atiyya رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) came to us and we were giving a bath to his (dead) daughter and said, \"Wash her three, five or more times with water and Sidr and sprinkle camphor on her at the end; and when you finish, notify me.\" So when we finished, we informed him and he gave us his waist-sheet and told us to shroud her in it. Aiyub said that Hafsa narrated to him a narration similar to that of Muhammad in which it was said that the bath was to be given for an odd number of times, and the numbers 3, 5 or 7 were mentioned. It was also said that they were to start with the right side and with the parts which were washed in ablution, and that Um 'Atiyya also mentioned, \"We combed her hair and divided them in three braids.\"",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کی بیٹی کو غسل دے رہی تھیں کہ آپ صلی اللہ علیہ وسلم تشریف لائے اور فرمایا کہ تین یا پانچ مرتبہ غسل دو یا اس سے بھی زیادہ ، پانی اور بیری کے پتوں سے اور آخر میں کافور بھی استعمال کرنا ۔ پھر فارغ ہو کر مجھے خبر دے دینا ۔ جب ہم فارغ ہوئے تو آپ صلی اللہ علیہ وسلم کو خبر کر دی ۔ آپ صلی اللہ علیہ وسلم نے اپنا ازار عنایت فرمایا اور فرمایا کہ یہ اندر اس کے بدن پر لپیٹ دو ۔ایوب نے کہا کہ حفصہ نے ان سے محمد کی طرح ایک روایت بیان کی جس میں کہا گیا تھا کہ طاق تعداد میں غسل دیا جائے اور 3، 5 یا 7 کا ذکر ہے۔ یہ بھی کہا گیا کہ وہ دائیں طرف سے شروع کریں اور ان حصوں سے جو وضو میں دھوئے جاتے تھے اور ام عطیہ نے یہ بھی کہا کہ ہم نے ان کے بالوں میں کنگھی کی اور انہیں تین چوٹیوں میں تقسیم کیا۔",
                "urduNarrator": "ہم سے محمد نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالوہاب ثقفی نے بیان کیا ، ان سے ایوب نے ، ان سے محمد نے ، ان سے ام عطیہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ نَغْسِلُ ابْنَتَهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ بِمَاءٍ وَسِدْرٍ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ، فَأَلْقَى إِلَيْنَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏ فَقَالَ أَيُّوبُ وَحَدَّثَتْنِي حَفْصَةُ بِمِثْلِ حَدِيثِ مُحَمَّدٍ وَكَانَ فِي حَدِيثِ حَفْصَةَ ‏\"‏ اغْسِلْنَهَا وِتْرًا ‏\"‏‏.‏ وَكَانَ فِيهِ ‏:‏ ‏\"‏ ثَلاَثًا أَوْ خَمْسًا أَوْ سَبْعًا ‏\"‏‏.‏ وَكَانَ فِيهِ أَنَّهُ قَالَ ‏\"‏ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا ‏\"‏‏.‏ وَكَانَ فِيهِ أَنَّ أُمَّ عَطِيَّةَ قَالَتْ وَمَشَطْنَاهَا ثَلاَثَةَ قُرُونٍ‏.‏",
                "headingArabic": "مَا يُسْتَحَبُّ أَنْ يُغْسَلَ وِتْرًا",
                "headingUrdu": "(میت کو) طاق مرتبہ دھونا مستحب ہے۔",
                "headingEnglish": "It is desirable to wash (the dead body) for an odd number of times",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1211,
                "hadithNumber": "1255",
                "englishNarrator": "Narrated Um 'Atiyya رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) , concerning his (dead) daughter's bath, said, \"Start with the right side, and the parts which are washed in ablution.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیٹی کے غسل کے وقت فرمایا تھا کہ دائیں طرف سے اور اعضاء وضو سے غسل شروع کرنا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ ہم سے اسماعیل بن ابراہیم نے بیان کیا ، انہوں نے کہا کہ ہم سے خالد نے بیان کیا ، ان سے حفصہ بنت سیرین نے اور ان سے ام عطیہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا خَالِدٌ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي غَسْلِ ابْنَتِهِ ‏ \"‏ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا ‏\"‏‏.‏",
                "headingArabic": "يُبْدَأُ بِمَيَامِنِ الْمَيِّتِ",
                "headingUrdu": "میت کو غسل دیتے وقت داہنی طرف سے شروع کرنا",
                "headingEnglish": "To start from the right side while giving a bath to a dead body",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1212,
                "hadithNumber": "1256",
                "englishNarrator": "Narrated Um 'Atiyya رضی اللہ عنہا :",
                "hadithEnglish": "When we washed the deceased daughter of the Prophet, he said to us, while we were washing her, \"Start the bath from the right side and from the parts which are washed in ablution.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی کو ہم غسل دے رہی تھیں ۔ جب ہم نے غسل شروع کر دیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ غسل دائیں طرف سے اور اعضاء وضو سے شروع کرو ۔",
                "urduNarrator": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، کہا کہ ہم سے وکیع نے بیان کیا ، ان سے سفیان نے ، ان سے خالدحذاء نے ، ان سے حفصہ بنت سیرین نے اور ان سے ام عطیہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا غَسَّلْنَا بِنْتَ النَّبِيِّ صلى الله عليه وسلم قَالَ لَنَا وَنَحْنُ نَغْسِلُهَا ‏ \"‏ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ ‏\"‏‏.‏",
                "headingArabic": "مَوَاضِعِ الْوُضُوءِ مِنَ الْمَيِّتِ",
                "headingUrdu": "(شروع کے لیے) میت کے وہ حصے جو وضو میں دھوئے جاتے ہیں۔",
                "headingEnglish": "(To start with) the parts of the dead body which are washed in ablution",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1213,
                "hadithNumber": "1257",
                "englishNarrator": "Narrated Um 'Atiyya رضی اللہ عنہا :",
                "hadithEnglish": "The daughter of the Prophet (ﷺ) expired, and he said to us, \"Wash her three or five times, or more if you see it necessary, and when you finish, notify me.\" So, (when we finished) we informed him and he unfastened his waist-sheet and told us to shroud her in it.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی ایک صاحبزادی کا انتقال ہو گیا ۔ اس موقع پر آپ صلی اللہ علیہ وسلم نے ہمیں فرمایا کہ تم اسے تین یا پانچ مرتبہ غسل دو اور اگر مناسب سمجھو تو اس سے زیادہ مرتبہ بھی غسل دے سکتی ہو ۔ پھر فارغ ہو کر مجھے خبر دینا ۔ چنانچہ جب ہم غسل دے چکیں تو آپ صلی اللہ علیہ وسلم کو خبر دی اور آپ صلی اللہ علیہ وسلم نے اپنا ازار عنایت فرمایا اور فرمایا کہ اسے اس کے بدن سے لپیٹ دو ۔",
                "urduNarrator": "ہم سے عبدالرحمٰن بن حماد نے بیان کیا ، کہا کہ ہم کو ابن عون نے خبر دی ، انہیں محمد نے ، ان سے ام عطیہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حَمَّادٍ، أَخْبَرَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ تُوُفِّيَتْ بِنْتُ النَّبِيِّ صلى الله عليه وسلم فَقَالَ لَنَا ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَنَزَعَ مِنْ حِقْوِهِ إِزَارَهُ وَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏",
                "headingArabic": "هَلْ تُكَفَّنُ الْمَرْأَةُ فِي إِزَارِ الرَّجُلِ",
                "headingUrdu": "کیا عورت کو مرد کی چادر میں کفن دیا جا سکتا ہے؟",
                "headingEnglish": "Can a woman be shrouded in the waist-sheet of a man?",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1214,
                "hadithNumber": "1258, 1259",
                "englishNarrator": "Narrated Um 'Atiyya رضی اللہ عنہا :",
                "hadithEnglish": "\"One of the daughters of the Prophet (ﷺ) died and he came out and said, 'Wash her three or five times or more, if you think it necessary, with water and Sidr, and last of all put camphor (or some camphor) and when you finish, inform me.' \" Um Atiyya added, \"When we finished we informed him and he gave us his waist-sheet and said, 'Shroud her in it.' \" And Um 'Atiyya (in another narration) added, \"The Prophet (ﷺ) said, 'Wash her three, five or seven times or more, if you think it necessary.' \" Hafsa رضی اللہ عنہا said that Um 'Atiyya had also said, \"We entwined her hair into three braids.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی ایک بیٹی کا انتقال ہو گیا تھا ۔ اس لیے آپ صلی اللہ علیہ وسلم باہر تشریف لائے اور فرمایا کہ اسے تین یا پانچ مرتبہ غسل دے دو اور اگر تم مناسب سمجھو تو اس سے بھی زیادہ پانی اور بیری کے پتوں سے نہلاؤ اور آخر میں کافور یا ( یہ کہا کہ ) کچھ کافور کا بھی استعمال کرنا ۔ پھر فارغ ہو کر مجھے خبر دینا ۔ ام عطیہ رضی اللہ عنہا نے بیان کیا کہ جب ہم فارغ ہوئے تو ہم نے کہلا بھجوایا ۔ آپ صلی اللہ علیہ وسلم نے اپنا تہبند ہمیں دیا اور فرمایا کہ اسے اندر جسم پر لپیٹ دو ۔ ایوب نے حفصہ بنت سیرین سے روایت کی ، ان سے ام عطیہ نے اسی طرح حدیث بیان کی، ان سے ام عطیہ نے اسی طرح حدیث بیان کی ۔ اور ام عطیہ رضی اللہ عنہا نے اس روایت میں یوں کہا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تین یا پانچ یا سات مرتبہ یا اگر تم مناسب سمجھو تو اس سے بھی زیادہ غسل دے سکتی ہو ۔ حفصہ رضی اللہ عنہا نے بیان کیا کہ ام عطیہ رضی اللہ عنہا نے فرمایا کہ ہم نے ان کے سر کے بال تین لٹوں میں تقسیم کر دیئے تھے ۔",
                "urduNarrator": "ہم سے حامد بن عمر نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب نے ، ان سے محمد نے اور ان سے ام عطیہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ تُوُفِّيَتْ إِحْدَى بَنَاتِ النَّبِيِّ صلى الله عليه وسلم فَخَرَجَ، فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ بِمَاءٍ وَسِدْرٍ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ قَالَتْ فَلَمَّا فَرَغْنَا آذَنَّاهُ، فَأَلْقَى إِلَيْنَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏ وَعَنْ أَيُّوبَ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنهما ـ بِنَحْوِهِ وَقَالَتْ إِنَّهُ قَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ سَبْعًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ‏\"‏‏.‏ قَالَتْ حَفْصَةُ قَالَتْ أُمُّ عَطِيَّةَ ـ رضى الله عنها ـ وَجَعَلْنَا رَأْسَهَا ثَلاَثَةَ قُرُونٍ‏.‏",
                "headingArabic": "يَجْعَلُ الْكَافُورَ فِي آخِرِهِ",
                "headingUrdu": "میت پر کافور چھڑکنا",
                "headingEnglish": "To sprinkle camphor on the dead body",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1215,
                "hadithNumber": "1260",
                "englishNarrator": "Narrated Um 'Atiyya رضی اللہ عنہا :",
                "hadithEnglish": "They had entwined the hair of the daughter of Allah's Messenger (ﷺ) in three braids. They first undid her hair, washed and then entwined it in three braids.\"",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی کے بالوں کو تین لٹوں میں تقسیم کر دیا تھا ۔ پہلے بال کھولے گئے پھر انہیں دھو کر ان کی تین چٹیاں کر دی گئیں ۔",
                "urduNarrator": "ہم سے احمد بن صالح نے بیان کیا ، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیاانہیں ابن جریج نے خبر دی ، ان سے ایوب نے بیان کیا کہ میں نے حفصہ بنت سیرین سے سنا ، انہوں نے کہا کہ حضرت ام عطیہ رضی اللہ عنہا نے ہم سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَيُّوبُ وَسَمِعْتُ حَفْصَةَ بِنْتَ سِيرِينَ، قَالَتْ حَدَّثَتْنَا أُمُّ عَطِيَّةَ ـ رضى الله عنها ـ أَنَّهُنَّ جَعَلْنَ رَأْسَ بِنْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم ثَلاَثَةَ قُرُونٍ نَقَضْنَهُ ثُمَّ غَسَلْنَهُ ثُمَّ جَعَلْنَهُ ثَلاَثَةَ قُرُونٍ‏.‏",
                "headingArabic": "نَقْضِ شَعَرِ الْمَرْأَةِ",
                "headingUrdu": "(مردہ) عورت کے بال اکھاڑنا",
                "headingEnglish": "To undo the hair of a (dead) female",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1216,
                "hadithNumber": "1261",
                "englishNarrator": "Narrated Ibn Seereen:",
                "hadithEnglish": "Um 'Atiyya (an Ansari woman who gave the pledge of allegiance to the Prophet (ﷺ) ) came to Basra to visit her son, but she could not find him. She narrated to us, \"The Prophet (ﷺ) came to us while we were giving bath to his (dead) daughter, he said: 'Wash her three times, five times or more, if you think it necessary, with water and Sidr, and last of all put camphor, and when you finish, notify me.' \" Um 'Atiyya added, \"After finishing, we informed him and he gave us his waist sheet and told us to shroud her in it and did not say more than that.\"I do not know which daughter of the Prophet (ﷺ) she was (Ayub said this) and he said that \"الإِشْعَارَ \" means to wrap the corpse in it. Ibn Sirin, also used to say the same thing that it should be wrapped around a woman's body and not tied as a garment.",
                "hadithUrdu": "ام عطیہ رضی اللہ عنہا کے یہاں انصار کی ان خواتین میں سے جنہوں نے نبی کریم صلی اللہ علیہ وسلم سے بیعت کی تھی ، ایک عورت آئی ، بصرہ میں انہیں اپنے ایک بیٹے کی تلاش تھی ۔ لیکن وہ نہ ملا ۔ پھر اس نے ہم سے یہ حدیث بیان کی کہ ہم رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی کو غسل دے رہی تھیں کہ آپ صلی اللہ علیہ وسلم تشریف لائے اور فرمایا کہ تین یا پانچ مرتبہ غسل دے دو اور اگر مناسب سمجھو تو اس سے بھی زیادہ دے سکتی ہو ۔ غسل پانی اور بیری کے پتوں سے ہونا چاہیے اور آخر میں کافور بھی استعمال کر لینا ۔ غسل سے فارغ ہو کر مجھے خبر کرا دینا ۔ انہوں نے بیان کیا کہ جب ہم غسل دے چکیں ( تو اطلاع دی ) اور آپ صلی اللہ علیہ وسلم نے ازار عنایت کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے اندر بدن سے لپیٹ دو ۔ اس سے زیادہ آپ صلی اللہ علیہ وسلم نے کچھ نہیں فرمایا ۔ مجھے یہ نہیں معلوم کہ یہ آپ صلی اللہ علیہ وسلم کی کون سی بیٹی تھیں ( یہ ایوب نے کہا ) اور انہوں نے بتایا کہ «إشعار» کا مطلب یہ ہے کہ اس میں نعش لپیٹ دی جائے ۔ ابن سیرین رحمہ اللہ بھی یہی فرمایا کرتے تھے کہ عورت کے بدن پر اسے لپیٹا جائے ازار کے طور پر نہ باندھا جائے ۔",
                "urduNarrator": "ہم سے احمد نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا ، انہیں ابن جریج نے خبر دی ، انہیں ایوب نے خبر دی ، کہا کہ میں نے ابن سیرین سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَنَّ أَيُّوبَ، أَخْبَرَهُ قَالَ سَمِعْتُ ابْنَ سِيرِينَ، يَقُولُ جَاءَتْ أُمُّ عَطِيَّةَ ـ رضى الله عنها ـ امْرَأَةٌ مِنَ الأَنْصَارِ مِنَ اللاَّتِي بَايَعْنَ، قَدِمَتِ الْبِصْرَةَ، تُبَادِرُ ابْنًا لَهَا فَلَمْ تُدْرِكْهُ ـ فَحَدَّثَتْنَا قَالَتْ دَخَلَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم وَنَحْنُ نَغْسِلُ ابْنَتَهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ذَلِكَ بِمَاءٍ وَسِدْرٍ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ قَالَتْ فَلَمَّا فَرَغْنَا أَلْقَى إِلَيْنَا حَقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏ وَلَمْ يَزِدْ عَلَى ذَلِكَ، وَلاَ أَدْرِي أَىُّ بَنَاتِهِ‏.‏ وَزَعَمَ أَنَّ الإِشْعَارَ الْفُفْنَهَا فِيهِ، وَكَذَلِكَ كَانَ ابْنُ سِيرِينَ يَأْمُرُ بِالْمَرْأَةِ أَنْ تُشْعَرَ وَلاَ تُؤْزَرَ‏.‏",
                "headingArabic": "كَيْفَ الإِشْعَارُ لِلْمَيِّتِ",
                "headingUrdu": "میت کو کفن کیسے دیا جائے؟",
                "headingEnglish": "How to shroud a dead body",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1217,
                "hadithNumber": "1262",
                "englishNarrator": "Narrated Um 'Atiyya رضى الله عنها :",
                "hadithEnglish": "We entwined the hair of the dead daughter of the Prophet (ﷺ) into three braids. Waki said that Sufyan said, \"One braid was entwined in front and the other two were entwined on the sides of the head.\"",
                "hadithUrdu": "ہم نے آنحضرت صلی اللہ علیہ وسلم کی بیٹی کے سر کے بال گوندھ کر ان کی تین چٹیاں کر دیں اور وکیع نے سفیان سے یوں روایت کیا ، ایک پیشانی کی طرف کے بالوں کی چٹیا اور دو ادھر ادھر کے بالوں کی ۔",
                "urduNarrator": "ہم سے قبیصہ نے حدیث بیان کی ، ان سے سفیان نے بیان کیا ، ان سے ہشام نے ، ان سے ام ہذیل نے اور ان سے ام عطیہ نے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أُمِّ الْهُذَيْلِ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ ضَفَرْنَا شَعَرَ بِنْتِ النَّبِيِّ صلى الله عليه وسلم‏.‏ تَعْنِي ثَلاَثَةَ قُرُونٍ‏.‏ وَقَالَ وَكِيعٌ قَالَ سُفْيَانُ نَاصِيَتَهَا وَقَرْنَيْهَا‏.‏",
                "headingArabic": "هَلْ يُجْعَلُ شَعَرُ الْمَرْأَةِ ثَلاَثَةَ قُرُونٍ",
                "headingUrdu": "(مردہ) عورت کے سر کے بالوں کو تین چوٹیوں میں باندھنا",
                "headingEnglish": "To entwine the head-hair of a (dead) woman in three braids",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1218,
                "hadithNumber": "1263",
                "englishNarrator": "Narrated Um 'Atiyya رضی اللہ عنہا :",
                "hadithEnglish": "One of the daughters of the Prophet (ﷺ) expired and he came to us and said, \"Wash her with Sidr (water) for odd number of times, i.e. three, five or more, if you think it necessary, and in the last, put camphor or (some camphor on her), and when you finish, notify me.\" So when we finished we informed him. He gave his waist-sheet to us (to shroud her). We entwined the hair (of the deceased girl) in three braids and made them fall at her back.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی ایک صاحبزادی کا انتقال ہو گیا تو نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور فرمایا کہ ان کو پانی اور بیری کے پتوں سے تین یا پانچ مرتبہ غسل دے دو ۔ اگر تم مناسب سمجھو تو اس سے زیادہ بھی دے سکتی ہو اور آخر میں کافور یا ( آپ صلی اللہ علیہ وسلم نے یہ فرمایا کہ ) تھوڑی سی کافور استعمال کرو پھر جب غسل دے چکو تو مجھے خبر دو ۔ چنانچہ فارغ ہو کر ہم نے آپ صلی اللہ علیہ وسلم کو خبر دی تو آپ صلی اللہ علیہ وسلم نے ( ان کے کفن کے لیے ) اپنا ازار عنایت کیا ۔ ہم نے اس کے سر کے بالوں کی تین چٹیاں کر کے انہیں پیچھے کی طرف ڈال دیا تھا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے ہشام بن حسان نے بیان کیا ، کہا کہ ہم سے حفصہ نے بیان کیا ، ان سے ام عطیہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامِ بْنِ حَسَّانَ، قَالَ حَدَّثَتْنَا حَفْصَةُ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ تُوُفِّيَتْ إِحْدَى بَنَاتِ النَّبِيِّ صلى الله عليه وسلم فَأَتَانَا النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ اغْسِلْنَهَا بِالسِّدْرِ وِتْرًا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ذَلِكَ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ، فَأَلْقَى إِلَيْنَا حِقْوَهُ، فَضَفَرْنَا شَعَرَهَا ثَلاَثَةَ قُرُونٍ وَأَلْقَيْنَاهَا خَلْفَهَا‏.‏",
                "headingArabic": "يُلْقَى شَعَرُ الْمَرْأَةِ خَلْفَهَا",
                "headingUrdu": "(مردہ) عورت کے بال اس کی پشت پر گرنا",
                "headingEnglish": "To make the hair of a (dead) woman fall at her back",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1219,
                "hadithNumber": "1264",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) was shrouded in three Yemenite white Suhuliya (pieces of cloth) of cotton, and in them there was neither a shirt nor a turban.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو یمن کے تین سفید سوتی دھلے ہوئے کپڑوں میں کفن دیا گیا ان میں نہ قمیص تھی نہ عمامہ ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا ، انہوں نے کہا کہ ہم کو عبداللہ نے خبر دی ، انہوں نے کہا کہ ہمیں ہشام بن عروہ نے خبر دی ، انہیں ان کے باپ عروہ بن زبیر نے اور انہیں ( ان کی خالہ ) ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ يَمَانِيَةٍ بِيضٍ سَحُولِيَّةٍ مِنْ كُرْسُفٍ، لَيْسَ فِيهِنَّ قَمِيصٌ وَلاَ عِمَامَةٌ‏.‏",
                "headingArabic": "الثِّيَابِ الْبِيضِ لِلْكَفَنِ",
                "headingUrdu": "کفن کے لیے سفید کپڑا",
                "headingEnglish": "White cloth for the shroud",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1220,
                "hadithNumber": "1265",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "While a man was riding (his Mount) in `Arafat, he fell down from it (his Mount) and broke his neck (and died). The Prophet (ﷺ) said, \"Wash him with water and Sidr and shroud him in two pieces of cloth, and neither perfume him, nor cover his head, for he will be resurrected on the Day of Resurrection saying, 'Labbaik,' (i.e. like a pilgrim).\"",
                "hadithUrdu": "ایک شخص میدان عرفہ میں ( احرام باندھے ہوئے ) کھڑا ہوا تھا کہ اپنی سواری سے گر پڑا اور سواری نے انہیں کچل دیا ۔ یا ( «وقصته‏» کے بجائے یہ لفظ ) «أوقصته» کہا ۔ نبی کریم صلی اللہ علیہ وسلم نے ان کے لیے فرمایا کہ پانی اور بیری کے پتوں سے غسل دے کر دو کپڑوں میں انہیں کفن دو اور یہ بھی ہدایت فرمائی کہ انہیں خوشبو نہ لگاؤ اور نہ ان کا سر چھپاؤ ۔ کیونکہ یہ قیامت کے دن لبیک کہتا ہوا اٹھے گا ۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، کہا کہ ہم سے حماد نے ، ان سے ایوب نے ، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہمانے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهم ـ قَالَ بَيْنَمَا رَجُلٌ وَاقِفٌ بِعَرَفَةَ إِذْ وَقَعَ عَنْ رَاحِلَتِهِ فَوَقَصَتْهُ ـ أَوْ قَالَ فَأَوْقَصَتْهُ ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلاَ تُحَنِّطُوهُ وَلاَ تُخَمِّرُوا رَأْسَهُ، فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا ‏\"‏‏.‏",
                "headingArabic": "الْكَفَنِ فِي ثَوْبَيْنِ",
                "headingUrdu": "کپڑے کے دو ٹکڑوں میں کفن دینا",
                "headingEnglish": "Shrouding in two pieces of cloth",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1221,
                "hadithNumber": "1266",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "While a man was at `Arafat (for Hajj) with Allah's Messenger (ﷺ) the fell down from his Mount and broke his neck (and died). So Allah's Messenger (ﷺ) said, \"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him nor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be saying 'Labbaik.\"",
                "hadithUrdu": "ایک شخص نبی کریم صلی اللہ علیہ وسلم کے ساتھ میدان عرفہ میں وقوف کئے ہوئے تھا کہ وہ اپنے اونٹ سے گر پڑا اور اونٹ نے انہیں کچل دیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں پانی اور بیری کے پتوں سے غسل دے کر دو کپڑوں کا کفن دو ، خوشبو نہ لگاؤ اور نہ سر ڈھکو کیونکہ اللہ تعالیٰ قیامت کے دن انہیں لبیک کہتے ہوئے اٹھائے گا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا کہ ہم سے حماد بن زید نے بیان کیا ، انہوں نے کہا کہ ہم سے ایوب نے ، ان سے سعید بن جبیر نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ بَيْنَمَا رَجُلٌ وَاقِفٌ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِعَرَفَةَ إِذْ وَقَعَ مِنْ رَاحِلَتِهِ فَأَقْصَعَتْهُ ـ أَوْ قَالَ فَأَقْعَصَتْهُ ـ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلاَ تُحَنِّطُوهُ وَلاَ تُخَمِّرُوا رَأْسَهُ، فَإِنَّ اللَّهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا ‏\"‏‏.‏",
                "headingArabic": "الْحَنُوطِ لِلْمَيِّتِ",
                "headingUrdu": "ہنوت کے ساتھ میت کو خوشبو لگانا",
                "headingEnglish": "The perfuming of a dead body with Hanut",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1222,
                "hadithNumber": "1267",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "A man was killed by his camel while we were with the Prophet (ﷺ) and he was a Muhrim. So the Prophet (ﷺ) said, \"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him nor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be saying 'Labbaik' . \"",
                "hadithUrdu": "ایک مرتبہ ہم لوگ نبی کریم صلی اللہ علیہ وسلم کے ساتھ احرام باندھے ہوئے تھے کہ ایک شخص کی گردن اس کے اونٹ نے توڑ ڈالی ۔ تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا کہ انہیں پانی اور بیری کے پتوں سے غسل دے دو اور کپڑوں کا کفن دو اور خوشبو نہ لگاؤ نہ ان کے سر کو ڈھکو ۔ اس لیے کہ اللہ تعالیٰ انہیں اٹھائے گا ۔ اس حالت میں کہ وہ لبیک پکارتا ہو گا ۔",
                "urduNarrator": "ہم سے ابو النعمان نے بیان کیا ، انہوں نے کہا کہ ہم کو ابو عوانہ نے خبر دی ، انہیں ابو بشر جعفر نے ، انہیں سعید بن جبیر نے ، انہیں حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهم ـ أَنَّ رَجُلاً، وَقَصَهُ بَعِيرُهُ، وَنَحْنُ مَعَ النَّبِيِّ صلى الله عليه وسلم وَهْوَ مُحْرِمٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلاَ تُمِسُّوهُ طِيبًا، وَلاَ تُخَمِّرُوا رَأْسَهُ، فَإِنَّ اللَّهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ مُلَبِّدًا ‏\"‏‏.‏",
                "headingArabic": "كَيْفَ يُكَفَّنُ الْمُحْرِمُ",
                "headingUrdu": "محرم کو کفن کیسے پہنایا جائے؟",
                "headingEnglish": "How to shroud a Muhrim",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1223,
                "hadithNumber": "1268",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "A man fell from his Mount and died while he was with the Prophet (ﷺ) at `Arafat. The Prophet (ﷺ) said, \"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him nor cover his head, for he will be resurrected on the Day of Resurrection saying, 'Labbaik'.\"Ayyub said (i.e.) saying Talbiyyah (will go together) and Amr quoted the word «Milbiyya» (after «Milbiy» in his tradition). (i.e. speaking back).",
                "hadithUrdu": "ایک شخص نبی کریم صلی اللہ علیہ وسلم کے ساتھ میدان عرفات میں کھڑا ہوا تھا ، اچانک وہ اپنی سواری سے گر پڑا ۔ ایوب نے کہا اونٹنی نے اس کی گردن توڑ ڈالی ۔ اور عمرو نے یوں کہا کہ اونٹنی نے اس کو گرتے ہی مار ڈالا اور اس کا انتقال ہو گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے پانی اور بیری کے پتوں سے غسل دو اور دو کپڑوں کا کفن دو اور خوشبو نہ لگاؤ نہ سر ڈھکو کیونکہ قیامت میں یہ اٹھایا جائے گا ۔ ایوب نے کہا کہ ( یعنی ) تلبیہ کہتے ہوئے ( اٹھایا جائے گا ) اور عمرو نے ( اپنی روایت میں «ملبی» کے بجائے ) «ملبيا» کا لفظ نقل کیا ۔ ( یعنی لبیک کہتا ہوا اٹھے گا ) ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، ان سے حماد بن زید نے ، ان سے عمرو اور ایوب نے ، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، وَأَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهم ـ قَالَ كَانَ رَجُلٌ وَاقِفٌ مَعَ النَّبِيِّ صلى الله عليه وسلم بِعَرَفَةَ فَوَقَعَ عَنْ رَاحِلَتِهِ ـ قَالَ أَيُّوبُ فَوَقَصَتْهُ، وَقَالَ عَمْرٌو فَأَقْصَعَتْهُ ـ فَمَاتَ فَقَالَ ‏ \"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلاَ تُحَنِّطُوهُ وَلاَ تُخَمِّرُوا رَأْسَهُ، فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ ـ قَالَ أَيُّوبُ يُلَبِّي، وَقَالَ عَمْرٌو ـ مُلَبِّيًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1224,
                "hadithNumber": "1269",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When `Abdullah bin Ubai (the chief of hypocrites) died, his son came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Please give me your shirt to shroud him in it, offer his funeral prayer and ask for Allah's forgiveness for him.\" So Allah's Messenger (ﷺ) gave his shirt to him and said, \"Inform me (When the funeral is ready) so that I may offer the funeral prayer.\" So, he informed him and when the Prophet intended to offer the funeral prayer, `Umar رضی اللہ عنہ took hold of his hand and said, \"Has Allah not forbidden you to offer the funeral prayer for the hypocrites? The Prophet (ﷺ) said, \"I have been given the choice for Allah says: '(It does not avail) Whether you (O Muhammad) ask forgiveness for them (hypocrites), or do not ask for forgiveness for them. Even though you ask for their forgiveness seventy times, Allah will not forgive them. (9.80)\" So the Prophet (ﷺ) offered the funeral prayer and on that the revelation came: \"And never (O Muhammad) pray (funeral prayer) for any of them (i.e. hypocrites) that dies.\" (9. 84)",
                "hadithUrdu": "جب عبداللہ بن ابی ( منافق ) کی موت ہوئی تو اس کا بیٹا ( عبداللہ صحابی ) نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آیا اور عرض کی کہ یا رسول اللہ ! والد کے کفن کے لیے آپ اپنی قمیص عنایت فرمائیے اور ان پر نماز پڑھئے اور مغفرت کی دعا کیجئے ۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے اپنی قمیص ( غایت مروت کی وجہ سے ) عنایت کی اور فرمایا کہ مجھے بتانا میں نماز جنازہ پڑھوں گا ۔ عبداللہ نے اطلاع بھجوائی ۔ جب آپ صلی اللہ علیہ وسلم نماز پڑھا نے کے لیے آگے بڑھے تو عمر رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کو پیچھے سے پکڑ لیا اور عرض کیا کہ کیا اللہ تعالیٰ نے آپ کو منافقین کی نماز جنازہ پڑھنے سے منع نہیں کیا ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے اختیار دیا گیا ہے جیسا کہ ارشاد باری ہے ” تو ان کے لیے استغفار کر یا نہ کر اور اگر تو ستر مرتبہ بھی استغفار کرے تو بھی اللہ انہیں ہرگز معاف نہیں کرے گا “ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھائی ۔ اس کے بعد یہ آیت اتری ” کسی بھی منافق کی موت پر اس کی نماز جنازہ کبھی نہ پڑھانا “ ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے عبیداللہ عمری نے کہا کہ مجھ سے نافع نے عبداللہ بن عمر رضی اللہ عنہما سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عَبْدَ، اللَّهِ بْنَ أُبَىٍّ لَمَّا تُوُفِّيَ جَاءَ ابْنُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَعْطِنِي قَمِيصَكَ أُكَفِّنْهُ فِيهِ، وَصَلِّ عَلَيْهِ وَاسْتَغْفِرْ لَهُ، فَأَعْطَاهُ النَّبِيُّ صلى الله عليه وسلم قَمِيصَهُ فَقَالَ ‏\"‏ آذِنِّي أُصَلِّي عَلَيْهِ ‏\"‏‏.‏ فَآذَنَهُ، فَلَمَّا أَرَادَ أَنْ يُصَلِّيَ عَلَيْهِ جَذَبَهُ عُمَرُ ـ رضى الله عنه ـ فَقَالَ أَلَيْسَ اللَّهُ نَهَاكَ أَنْ تُصَلِّيَ عَلَى الْمُنَافِقِينَ فَقَالَ ‏\"‏ أَنَا بَيْنَ خِيرَتَيْنِ قَالَ ‏{‏اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ‏}‏ ‏\"‏‏.‏ فَصَلَّى عَلَيْهِ فَنَزَلَتْ ‏{‏وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا‏}‏",
                "headingArabic": "الْكَفَنِ فِي الْقَمِيصِ الَّذِي يُكَفُّ أَوْ لاَ يُكَفُّ ، وَمَنْ كُفِّنَ بِغَيْرِ قَمِيصٍ",
                "headingUrdu": "کسی کو قمیض میں کفن دینا، سلی ہوئی یا بغیر سلی ہوئی",
                "headingEnglish": "To shroud one in a shirt, stitched or unstitched",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1225,
                "hadithNumber": "1270",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) came to (the grave of) `Abdullah bin Ubai after his body was buried. The body was brought out and then the Prophet (ﷺ) put his saliva over the body and clothed it in his shirt.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو عبداللہ بن ابی کو دفن کیا جا رہا تھا ۔ آپ صلی اللہ علیہ وسلم نے اسے قبر سے نکلوایا اور اپنا لعاب دہن اس کے منہ میں ڈالا اور اپنی قمیص پہنائی ۔",
                "urduNarrator": "ہم سے مالک بن اسماعیل نے بیان کیا ، ان سے ابن عیینہ نے بیان کیا ، ان سے عمرونے ، انہوں نے جابر رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، سَمِعَ جَابِرًا ـ رضى الله عنه ـ قَالَ أَتَى النَّبِيُّ صلى الله عليه وسلم عَبْدَ اللَّهِ بْنَ أُبَىٍّ بَعْدَ مَا دُفِنَ فَأَخْرَجَهُ، فَنَفَثَ فِيهِ مِنْ رِيقِهِ وَأَلْبَسَهُ قَمِيصَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1201,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=48",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=46",
                "label": "46",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=47",
                "label": "47",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=48",
                "label": "48",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=49",
                "label": "49",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=50",
                "label": "50",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=51",
                "label": "51",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=52",
                "label": "52",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=50",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=50",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=48",
        "to": 1225,
        "total": 40465
    }
}