{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 203,
        "data": [
            {
                "id": 5053,
                "hadithNumber": "5284",
                "englishNarrator": "Narrated Al-Aswad:",
                "hadithEnglish": "Aisha رضی اللہ عنہا intended to buy Barira رضی اللہ عنہ , but her masters stipulated that her wala wound be for them. Aisha رضی اللہ عنہا mentioned that to the Prophet (ﷺ) who said (to `Aisha رضی اللہ عنہا ), \"Buy and manumit her, for the wala is for the one who manumits.\" Once some me; was brought to the Prophet (ﷺ) and was said, \"This meat was given in charity to Barira رضی اللہ عنہا . \" The Prophet (ﷺ) said, \"It an object of charity for Barira رضی اللہ عنہا and present for us.\" Narrated Adam: Shu`ba relate the same Hadith and added: Barira  رضی اللہ عنہا was given the option regarding her husband.",
                "hadithUrdu": "عائشہ رضی اللہ عنہا نے بریرہ رضی اللہ عنہ کو خریدنے کا ارادہ کیا لیکن ان کے مالکوں نے کہا کہ وہ اسی شرط پر انہیں بیچ سکتے ہیں کہ بریرہ کا ترکہ ہم لیں اور ان کے ساتھ ولاء ( آزادی کے بعد ) انہیں سے قائم ہو ۔ عائشہ رضی اللہ عنہا نے جب اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا کہ انہیں خریدکر آزاد کر دو ترکہ تو اسی کو ملے گا جو لونڈی غلام کو آزاد کرے اور ولاء بھی اسی کے ساتھ قائم ہو سکتی ہے جو آزاد کرے اور نبی کریم صلی اللہ علیہ وسلم کے سامنے گوشت لایا گیا پھر کہا کہ یہ گوشت بریرہ رضی اللہ عنہا کو صدقہ کیا گیا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ ان کے لیے صدقہ ہے اور ہمارے لیے ان کا تحفہ ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن رجاء نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں حکم نے ، انہیں ابراہیم نخعی سے اور وہ اسود سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، أَخْبَرَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، أَنَّ عَائِشَةَ، أَرَادَتْ أَنْ تَشْتَرِيَ، بَرِيرَةَ، فَأَبَى مَوَالِيهَا إِلاَّ أَنْ يَشْتَرِطُوا الْوَلاَءَ، فَذَكَرَتْ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ اشْتَرِيهَا وَأَعْتِقِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ وَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِلَحْمٍ فَقِيلَ إِنَّ هَذَا مَا تُصُدِّقَ عَلَى بَرِيرَةَ، فَقَالَ ‏\"‏ هُوَ لَهَا صَدَقَةٌ، وَلَنَا هَدِيَّةٌ ‏\"‏‏. حَدَّثَنَا آدَمُ حَدَّثَنَا شُعْبَةُ وَزَادَ فَخُيِّرَتْ مِنْ زَوْجِهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5054,
                "hadithNumber": "5285",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "Whenever Ibn `Umar رضی اللہ عنہما was asked about marrying a Christian lady or a Jewess, he would say: \"Allah has made it unlawful for the believers to marry ladies who ascribe partners in worship to Allah, and I do not know of a greater thing, as regards to ascribing partners in worship, etc. to Allah, than that a lady should say that Jesus is her Lord although he is just one of Allah's slaves.\"",
                "hadithUrdu": "ابن عمر رضی اللہ عنہما سے اگر یہودی یا انصاری عورتوں سے نکاح کے متعلق سوال کیا جاتا تو وہ کہتے کہ اللہ تعالیٰ نے مشرک عورتوں سے نکاح مومنوں کے لیے حرام قرار دیا ہے اور میں نہیں سمجھتا کہ اس سے بڑھ کر اور کیا شرک ہو گا کہ ایک عورت یہ کہے کہ اس کے رب حضرت عیسیٰ علیہ السلام ہیں حالانکہ وہ اللہ کے مقبول بندوں میں سے ایک مقبول بندے ہیں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے نافع نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ إِذَا سُئِلَ عَنْ نِكَاحِ النَّصْرَانِيَّةِ، وَالْيَهُودِيَّةِ، قَالَ إِنَّ اللَّهَ حَرَّمَ الْمُشْرِكَاتِ عَلَى الْمُؤْمِنِينَ، وَلاَ أَعْلَمُ مِنَ الإِشْرَاكِ شَيْئًا أَكْبَرَ مِنْ أَنْ تَقُولَ الْمَرْأَةُ رَبُّهَا عِيسَى، وَهْوَ عَبْدٌ مِنْ عِبَادِ اللَّهِ‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَلاَ تَنْكِحُوا الْمُشْرِكَاتِ حَتَّى يُؤْمِنَّ وَلأَمَةٌ مُؤْمِنَةٌ خَيْرٌ مِنْ مُشْرِكَةٍ وَلَوْ أَعْجَبَتْكُمْ}",
                "headingUrdu": "’’مشرکات سے اس وقت تک نکاح نہ کرو جب تک وہ ایمان نہ لے آئیں۔‘‘",
                "headingEnglish": "\"Do not marry Al-Mushirkat till they believe...\"",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5055,
                "hadithNumber": "5286",
                "englishNarrator": "Narrated Ibn 'Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The pagans were of two kinds as regards their relationship to the Prophet and the Believers. Some of them were those with whom the Prophet was at war and used to fight against, and they used to fight him; the others were those with whom the Prophet (ﷺ) made a treaty, and neither did the Prophet (ﷺ) fight them, nor did they fight him. If a lady from the first group of pagans emigrated towards the Muslims, her hand would not be asked in marriage unless she got the menses and then became clean. When she became clean, it would be lawful for her to get married, and if her husband emigrated too before she got married, then she would be returned to him. If any slave or female slave emigrated from them to the Muslims, then they would be considered free persons (not slaves) and they would have the same rights as given to other emigrants. The narrator then mentioned about the pagans involved with the Muslims in a treaty, the same as occurs in Mujahid's narration. If a male slave or a female slave emigrated from such pagans as had made a treaty with the Muslims, they would not be returned, but their prices would be paid (to the pagans).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم اور مومنین کے لیے مشرکین دو طرح کے تھے ۔ ایک تو مشرکین لڑائی کرنے والوں سے کہ آنحضرت صلی اللہ علیہ وسلم ان سے جنگ کرتے تھے اور وہ آنحضرت صلی اللہ علیہ وسلم سے جنگ کرتے تھے ۔ دوسرے عہد و پیمان کرنے والے مشرکین کہ آنحضرت صلی اللہ علیہ وسلم ان سے جنگ نہیں کرتے تھے اور نہ وہ آنحضرت صلی اللہ علیہ وسلم سے جنگ کرتے تھے اور جب اہل کتاب حرب کی کوئی عورت ( اسلام قبول کرنے کے بعد ) ہجرت کر کے ( مدینہ منورہ ) آتی تو انہیں اس وقت تک پیغام نکاح نہ دیا جاتا یہاں تک کہ انہیں حیض آتا اور پھر وہ اس سے پاک ہوتیں ، پھر جب وہ پاک ہو جاتیں تو ان سے نکاح جائز ہو جاتا ، پھر اگر ان کے شوہر بھی ، ان کے کسی دوسرے شخص سے نکاح کر لینے سے پہلے ہجرت کر کے آ جاتے تو یہ انہیں کو ملتیں اور اگر مشرکین میں سے کوئی غلام یا لونڈی مسلمان ہو کر ہجرت کرتی تو وہ آزاد سمجھے جاتے اور ان کے وہی حقوق ہوتے جو تمام مہاجرین کے تھے ۔ پھر عطاء نے معاہد مشرکین کے سلسلے میں مجاہد کی حدیث کی طرح سے صورت حال بیان کی کہ اگر معاہد مشرکین کی کوئی غلام یا لونڈی ہجرت کر کے آجاتی تو انہیں ان کے مالک مشرکین کو واپس نہیں کیا جاتا تھا ۔ البتہ جو ان کی قیمت ہوتی وہ واپس کر دی جاتی تھی ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں ابن جریج نے کہ عطاء راسانی نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنِ ابْنِ جُرَيْجٍ، وَقَالَ، عَطَاءٌ عَنِ ابْنِ عَبَّاسٍ، كَانَ الْمُشْرِكُونَ عَلَى مَنْزِلَتَيْنِ مِنَ النَّبِيِّ صلى الله عليه وسلم وَالْمُؤْمِنِينَ، كَانُوا مُشْرِكِي أَهْلِ حَرْبٍ يُقَاتِلُهُمْ وَيُقَاتِلُونَهُ، وَمُشْرِكِي أَهْلِ عَهْدٍ لاَ يُقَاتِلُهُمْ وَلاَ يُقَاتِلُونَهُ، وَكَانَ إِذَا هَاجَرَتِ امْرَأَةٌ مِنْ أَهْلِ الْحَرْبِ لَمْ تُخْطَبْ حَتَّى تَحِيضَ وَتَطْهُرَ، فَإِذَا طَهُرَتْ حَلَّ لَهَا النِّكَاحُ، فَإِنْ هَاجَرَ زَوْجُهَا قَبْلَ أَنْ تَنْكِحَ رُدَّتْ إِلَيْهِ، وَإِنْ هَاجَرَ عَبْدٌ مِنْهُمْ أَوْ أَمَةٌ فَهُمَا حُرَّانِ وَلَهُمَا مَا لِلْمُهَاجِرِينَ‏.‏ ثُمَّ ذَكَرَ مِنْ أَهْلِ الْعَهْدِ مِثْلَ حَدِيثِ مُجَاهِدٍ وَإِنْ هَاجَرَ عَبْدٌ أَوْ أَمَةٌ لِلْمُشْرِكِينَ أَهْلِ الْعَهْدِ لَمْ يُرَدُّوا، وَرُدَّتْ أَثْمَانُهُمْ‏.‏",
                "headingArabic": "نِكَاحِ مَنْ أَسْلَمَ مِنَ الْمُشْرِكَاتِ وَعِدَّتِهِنَّ",
                "headingUrdu": "مشرک سے شادی کرنا جس نے اسلام قبول کر لیا تھا۔ اور ان کی عدت۔",
                "headingEnglish": "Marrying Al-Mushrikat who had embraced Islam; and their 'Idda.",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5056,
                "hadithNumber": "5287",
                "englishNarrator": "Narrated Ibn 'Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Qariba, The daughter of Abi Umaiyya, was the wife of 'Umar bin Al-Khattab رضی اللہ عنہ . 'Umar divorced her and then Mu'awiyya bin Abi Sufyan رضی اللہ عنہ married her. Similarly, Um Al-Hakam, the daughter of Abi Sufyan was the wife of 'Iyad bin Ghanm Al-Fihri. He divorced her and then 'Abdullah bin 'Uthman Al-Thaqafi married her.",
                "hadithUrdu": "قریبہ بنت ابی امیہ عمر بن خطاب رضی اللہ عنہ کے نکاح میں تھیں ، پھر عمر رضی اللہ عنہ نے ( مشرکین سے نکاح کی مخالفت کی آیت کے بعد ) انہیں طلاق دے دی تو معاویہ بن ابی سفیان رضی اللہ عنہ نے ان سے نکاح کر لیا اور ام الحکم بنت ابی سفیان عیاض بن غنم فہری کے نکاح میں تھیں ، اس وقت اس نے انہیں طلاق دے دی ( اور وہ مدینہ ہجرت کر کے آ گئیں ) اورعبداللہ بن عثمان ثقفی نے ان سے نکاح کیا ۔",
                "urduNarrator": "اور عطاء نے حضرت ابن عباس رضی اللہ عنہما سے بیان کیا کہ",
                "hadithArabic": "وَقَالَ عَطَاءٌ عَنِ ابْنِ عَبَّاسٍ، كَانَتْ قَرِيبَةُ بِنْتُ أَبِي أُمَيَّةَ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ فَطَلَّقَهَا، فَتَزَوَّجَهَا مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ، وَكَانَتْ أُمُّ الْحَكَمِ ابْنَةُ أَبِي سُفْيَانَ تَحْتَ عِيَاضِ بْنِ غَنْمٍ الْفِهْرِيِّ فَطَلَّقَهَا، فَتَزَوَّجَهَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ الثَّقَفِيُّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5057,
                "hadithNumber": "5288",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا (the wife of the Prophet) :",
                "hadithEnglish": "When believing women came to the Prophet (ﷺ) as emigrants, he used to test them in accordance with the order of Allah. 'O you who believe! When believing women come to you as emigrants, examine them . . .' (60.10) So if anyone of those believing women accepted the above mentioned conditions, she accepted the conditions of faith. When they agreed on those conditions and confessed that with their tongues, Allah's Messenger (ﷺ) would say to them, \"Go, I have accepted your oath of allegiance (for Islam). By Allah, and hand of Allah's Messenger (ﷺ) never touched the hand of any woman, but he only used to take their pledge of allegiance orally. By Allah, Allah's Messenger (ﷺ) did not take the pledge of allegiance of the women except in accordance with what Allah had ordered him. When he accepted their pledge of allegiance he would say to them, \"I have accepted your oath of allegiance.\"",
                "hadithUrdu": "مومن عورتیں جب ہجرت کر کے نبی کریم صلی اللہ علیہ وسلم کے پاس آتی تھیں تو آنحضرت صلی اللہ علیہ وسلم انہیں آزماتے تھے بوجہ اللہ تعالیٰ کے اس ارشاد کے کہ ” اے وہ لوگو ! جو ایمان لے آئے ہو ، جب مومن عورتیں تمہارے پاس ہجرت کر کے آئیں تو انہیں آزماؤ آخر آیت تک ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر ان ( ہجرت کرنے والی ) مومن عورتوں میں سے جو اس شرط کا اقرار کر لیتی ( جس کا ذکر اسی سورۃ الممتحنہ میں ہے کہ ” اللہ کا کسی کو شریک نہ ٹھہراؤ گی ) تو وہ آزمائش میں پوری سمجھی جا تی تھی ۔ چنانچہ جب وہ اس کا اپنی زبان سے اقرار کر لیتیں تو رسول اللہ صلی اللہ علیہ وسلم ان سے فرماتے کہ اب جاؤ میں نے تم سے عہد لے لیا ہے ۔ ہرگز نہیں ! واللہ ! آنحضرت صلی اللہ علیہ وسلم کے ہاتھ نے ( بیعت لیتے وقت ) کسی عورت کا ہاتھ کبھی نہیں چھوا ۔ آنحضرت صلی اللہ علیہ وسلم ان سے صرف زبان سے ( بیعت لیتے تھے ) واللہ آنحضرت صلی اللہ علیہ وسلم نے عورتوں سے صرف انہیں چیزوں کا عہد لیا جن کااللہ نے آپ کو حکم دیا تھا ۔ بیعت لینے کے بعد آپ ان سے فرماتے کہ میں نے تم سے عہد لے لیا ہے ۔ یہ آپ صرف زبان سے کہتے کہ میں نے تم سے بیعت لے لی ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے اور ابراہیم بن المنذر نے بیان کیا کہ مجھ سے عبداللہ ابن وہب نے بیان کیا ، ان سے یونس نے بیان کیا کہ ابن شہاب نے بیان کیا کہ مجھے عروہ بن زبیر نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ،‏.‏ وَقَالَ إِبْرَاهِيمُ بْنُ الْمُنْذِرِ حَدَّثَنِي ابْنُ وَهْبٍ، حَدَّثَنِي يُونُسُ، قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَتِ الْمُؤْمِنَاتُ إِذَا هَاجَرْنَ إِلَى النَّبِيِّ صلى الله عليه وسلم يَمْتَحِنُهُنَّ بِقَوْلِ اللَّهِ تَعَالَى ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ فَامْتَحِنُوهُنَّ‏}‏ إِلَى آخِرِ الآيَةِ قَالَتْ عَائِشَةُ فَمَنْ أَقَرَّ بِهَذَا الشَّرْطِ مِنَ الْمُؤْمِنَاتِ فَقَدْ أَقَرَّ بِالْمِحْنَةِ، فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَقْرَرْنَ بِذَلِكَ مِنْ قَوْلِهِنَّ قَالَ لَهُنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْطَلِقْنَ فَقَدْ بَايَعْتُكُنَّ ‏\"‏، لاَ وَاللَّهِ مَا مَسَّتْ يَدُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَدَ امْرَأَةٍ قَطُّ، غَيْرَ أَنَّهُ بَايَعَهُنَّ بِالْكَلاَمِ، وَاللَّهِ مَا أَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى النِّسَاءِ إِلاَّ بِمَا أَمَرَهُ اللَّهُ يَقُولُ لَهُنَّ إِذَا أَخَذَ عَلَيْهِنَّ ‏\"‏ قَدْ بَايَعْتُكُنَّ ‏\"‏‏.‏ كَلاَمًا‏.‏",
                "headingArabic": "إِذَا أَسْلَمَتِ الْمُشْرِكَةُ أَوِ النَّصْرَانِيَّةُ تَحْتَ الذِّمِّيِّ أَوِ الْحَرْبِيِّ‏.‏",
                "headingUrdu": "اگر کوئی مشرک یا عیسائی عورت مسلمان ہو جائے اور وہ ذمی یا مشرک کی بیوی ہو مسلمانوں سے جنگ میں؟",
                "headingEnglish": "If an idolatress or a Christian woman becomes a Muslim while she is the wife of Dhimmi or a Mushrik at war with the Muslims?",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5058,
                "hadithNumber": "5289",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) took an oath that he would abstain from his wives, and at that time his leg had been sprained (dislocated). So he stayed in the Mashruba (an attic room) of his for 29 days. Then he came down, and they (the people) said, \"O Allah's Messenger (ﷺ)! You took an oath to abstain from your wives for one month.\" He said, \"The month is of twenty nine days.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی ازواج مطہرات سے ایلاء کیا تھا ۔ آنحضرت صلی اللہ علیہ وسلم کے پاؤں میں موچ آ گئی تھی ۔ اس لیے آپ نے اپنے بالا خانہ میں انتیس دن تک قیام فرمایا ، پھر آپ وہاں سے اترے ۔ لوگوں نے کہا کہ یا رسول اللہ ! آپ نے ایک مہینہ کا ایلاء کیا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مہینہ انتیس دن کا بھی ہوتا ہے ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، ان سے ان کے بھائی عبدالحمید نے ، ان سے سلیمان بن بلال نے ، ان سے حمید طویل نے کہ انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، عَنْ أَخِيهِ، عَنْ سُلَيْمَانَ، عَنْ حُمَيْدٍ الطَّوِيلِ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ آلَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ نِسَائِهِ، وَكَانَتِ انْفَكَّتْ رِجْلُهُ فَأَقَامَ فِي مَشْرُبَةٍ لَهُ تِسْعًا وَعِشْرِينَ، ثُمَّ نَزَلَ فَقَالُوا يَا رَسُولَ اللَّهِ آلَيْتَ شَهْرًا‏.‏ فَقَالَ ‏ \"‏ الشَّهْرُ تِسْعٌ وَعِشْرُونَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {لِلَّذِينَ يُؤْلُونَ مِنْ نِسَائِهِمْ تَرَبُّصُ أَرْبَعَةِ أَشْهُرٍ} إِلَى قَوْلِهِ: {سَمِيعٌ عَلِيمٌ} {فَإِنْ فَاءُوا} رَجَعُوا",
                "headingUrdu": "\"جو لوگ اپنی بیویوں سے ہمبستری نہ کرنے کی قسم کھاتے ہیں، انہیں چار مہینے انتظار کرنا چاہیے۔\"",
                "headingEnglish": "\"Those who take an oath, not to have sexual relations with their wives, must wait four months.\"",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5059,
                "hadithNumber": "5290",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "Ibn `Umar رضی اللہ عنہما used to say about the Ila (which Allah defined (in the Holy Book), \"If the period of Ila expires, then the husband has either to retain his wife in a handsome manner or to divorce her as Allah has ordered.\"",
                "hadithUrdu": "ابن عمر رضی اللہ عنہما اس ایلاء کے بارے میں جس کا ذکر اللہ تعالیٰ نے کیا ہے ، فرماتے تھے کہ مدت پوری ہونے کے بعد کسی کے لیے جائز نہیں ، سوا اس کے کہ قاعدہ کے مطابق ( اپنی بیوی کو ) اپنے پاس ہی روک لے یا پھر طلاق دے ، جیسا کہ اللہ تعالیٰ نے حکم دیا ہے",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے نافع نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، رضى الله عنهما كَانَ يَقُولُ فِي الإِيلاَءِ الَّذِي سَمَّى اللَّهُ لاَ يَحِلُّ لأَحَدٍ بَعْدَ الأَجَلِ إِلاَّ أَنْ يُمْسِكَ بِالْمَعْرُوفِ، أَوْ يَعْزِمَ بِالطَّلاَقِ، كَمَا أَمَرَ اللَّهُ عَزَّ وَجَلَّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5060,
                "hadithNumber": "5291",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"When the period of four months has expired, the husband should be put in prison so that he should divorce his wife, but the divorce does not occur unless the husband himself declares it. This has been mentioned by `Uthman, `Ali, Abu Ad-Darda, `Aisha and twelve other companions of the Prophet (ﷺ) .\"",
                "hadithUrdu": "جب چار مہینے گذر جائیں تو اسے قاضی کے سامنے پیش کیا جائے گا ، یہاں تک کہ وہ طلاق دیدے ، اور طلاق اس وقت تک نہیں ہوتی جب تک طلاق دی نہ جائے ، اور حضرت عثمان ، علی ، ابودرداء اور عائشہ اور بارہ دوسرے صحابہ رضوان اللہ علیہم سے بھی ایسا ہی منقول ہے ۔",
                "urduNarrator": "مجھ سے اسماعیل نے بیان کہا کہ ان سے امام مالک نے بیان کیا ، ان سے نافع نے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "وَقَالَ لِي إِسْمَاعِيلُ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، إِذَا مَضَتْ أَرْبَعَةُ أَشْهُرٍ يُوقَفُ حَتَّى يُطَلِّقَ، وَلاَ يَقَعُ عَلَيْهِ الطَّلاَقُ حَتَّى يُطَلِّقَ‏.‏ وَيُذْكَرُ ذَلِكَ عَنْ عُثْمَانَ وَعَلِيٍّ وَأَبِي الدَّرْدَاءِ وَعَائِشَةَ وَاثْنَىْ عَشَرَ رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5061,
                "hadithNumber": "5292",
                "englishNarrator": "Narrated Yazid (the Maula of Munba'ith):",
                "hadithEnglish": "The Prophet (ﷺ) was asked regarding the case of a lost sheep. He said, \"You should take it, because it is for you, or for your brother, or for the wolf.\" Then he was asked about a lost camel. He got angry and his face became red and he said (to the questioner), \"You have nothing to do with it; it has its feet and its water container with it; it can go on drinking water and eating trees till its owner meets it.\" And then the Prophet (ﷺ) was asked about a Luqata (money found by somebody). He said, \"Remember and recognize its tying material and its container, and make public announcement about it for one year. If somebody comes and identifies it (then give it to him), otherwise add it to your property.\" Sufyan  says that he met Rabiah says: I have remembered nothing saves this. Then, I said: Has Yazeed, the slave freed by Munbaith, reported this Hadith about a lost thing from Hadrat Zaid bin Khalid? He replied: Yes! Yahya, Rabiah, Yazeed, the slave freed by Munbaith, reported it from Hadrat Zaid bin Khalid . Sufyan narrates: I met Rabiah and inquired of him about it.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سے کھوئی ہوئی بکری کے متعلق سوال کیا گیا تو آپ نے فرمایا کہ اسے پکڑ لو ، کیونکہ یا وہ تمہاری ہو گی ( اگر ایک سال تک اعلان کے بعداس کا مالک نہ ملا ) ۔ تمہارے کسی بھائی کی ہو گی یا پھر بھیڑ یے کی ہو گی ( اگر انہی جنگلوں میں پھرتی رہی ) اور انحضرت صلی اللہ علیہ وسلم سے کھوئے ہوئے اونٹ کے متعلق سوال کیا گیا تو آپ غصہ ہو گئے اور غصہ کی وجہ سے آپ کے دونوں رخسار سرخ ہو گئے اور آپ نے فرمایا ، تمہیں اس سے کیا غرض ! اس کے پاس ( مضبوط ) کھر ہیں ( جس کی وجہ سے چلنے میں اسے کوئی دشواری نہیں ہو گی ) اس کے پاس مشکیزہ ہے جس سے وہ پانی پیتا رہے گا اور درخت کے پتے کھاتا رہے گا ، یہاں تک کہ اس کا مالک اسے پالے گا اور نبی کریم صلی اللہ علیہ وسلم سے لقطہٰ کے متعلق سوال کیا گیا تو آپ نے فرمایا کہ اس کی رسی کا ( جس سے وہ بندھا ہو ) اور اس کے ظرف کا ( جس میں وہ رکھا ہو ) اعلان کرو اور اس کا ایک سال تک اعلان کرو ، پھر اگر کوئی ایسا شخص آ جائے جو اسے پہچانتا ہو ( اور اس کا مالک ہو تو اسے دے دو ) ورنہ اسے اپنے مال کے ساتھ ملا لو ۔ سفیان بن عیینہ نے بیان کیا کہ پھر میں ربیعہ بن عبدالرحمٰن سے ملا اور مجھے ان سے اس کے سوا اور کوئی چیز محفوظ نہیں ہے ۔ میں نے ان سے پوچھا تھا کہ گم شدہ چیزوں کے بارے میں منبعث کے مولیٰ یزید کی حدیث کے بارے میں آپ کا کیا خیال ہے ؟ کیا وہ زید بن خالد سے منقول ہے ؟ تو انہوں نے کہا کہ ہاں ( سفیان نے بیان کیا کہ ہاں ) یحییٰ نے بیان کیا کہ ربیعہ نے منبعث کے مولیٰ یزید سے بیان کیا ، ان سے زید بن خالد نے ۔ سفیان نے بیان کیا کہ پھر میں نے ربیعہ سے ملاقات کی اور ان سے اس کے متعلق پوچھا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے کہا ، ان سے سفیان بن عیینہ نے ، ان سے یحییٰ بن سعید نے ، ان سے منبعث کے مولیٰ یزید نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ عَنْ ضَالَّةِ الْغَنَمِ فَقَالَ ‏\"‏ خُذْهَا، فَإِنَّمَا هِيَ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏‏.‏ وَسُئِلَ عَنْ ضَالَّةِ الإِبِلِ، فَغَضِبَ وَاحْمَرَّتْ وَجْنَتَاهُ، وَقَالَ ‏\"‏ مَا لَكَ وَلَهَا، مَعَهَا الْحِذَاءُ وَالسِّقَاءُ، تَشْرَبُ الْمَاءَ، وَتَأْكُلُ الشَّجَرَ، حَتَّى يَلْقَاهَا رَبُّهَا ‏\"‏‏.‏ وَسُئِلَ عَنِ اللُّقَطَةِ فَقَالَ ‏\"‏ اعْرِفْ وِكَاءَهَا وَعِفَاصَهَا، وَعَرِّفْهَا سَنَةً، فَإِنْ جَاءَ مَنْ يَعْرِفُهَا، وَإِلاَّ فَاخْلِطْهَا بِمَالِكَ ‏\"‏‏.‏ قَالَ سُفْيَانُ فَلَقِيتُ رَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ ـ قَالَ سُفْيَانُ وَلَمْ أَحْفَظْ عَنْهُ شَيْئًا غَيْرَ هَذَا ـ فَقُلْتُ أَرَأَيْتَ حَدِيثَ يَزِيدَ مَوْلَى الْمُنْبَعِثِ فِي أَمْرِ الضَّالَّةِ، هُوَ عَنْ زَيْدِ بْنِ خَالِدٍ قَالَ نَعَمْ‏.‏ قَالَ يَحْيَى وَيَقُولُ رَبِيعَةُ عَنْ يَزِيدَ مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ‏.‏ قَالَ سُفْيَانُ فَلَقِيتُ رَبِيعَةَ فَقُلْتُ لَهُ‏.‏",
                "headingArabic": "حُكْمِ الْمَفْقُودِ فِي أَهْلِهِ وَمَالِهِ",
                "headingUrdu": "گمشدہ شخص کی جائیداد اور خاندان سے متعلق ضوابط",
                "headingEnglish": "The regulations concerning the property and family of a lost person",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5062,
                "hadithNumber": "5293",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) performed the Tawaf (around the Ka`ba while riding his camel, and every time he reached the corner (of the Black Stone) he pointed at it with his hand and said, \"Allahu Akbar.\" (Zainab  رضی اللہ عنہا said: The Prophet (ﷺ) said, \"An opening has been made in the wall of Gog and Magog like this and this,\" forming the number 90 (with his thumb and index finger).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے بیت اللہ کا طواف اپنے اونٹ پر سوار ہو کر کیا اور آنحضرت صلی اللہ علیہ وسلم جب بھی رکن کے پاس آتے تو اس کی طرف اشارہ کر کے تکبیر کہتے اور زینب بنت جحش رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، یاجوج ماجوج کے دیوار میں اتنا سوراخ ہو گیا ہے اور آپ نے اپنی انگلیوں سے نوے کا عدد بنایا ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے ابوعامر عبدالملک بن عمرو نے بیان کیا ، کہا ہم سے ابراہیم بن طہمان نے بیان کیا ، ان سے خالد حذاء نے ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ طَافَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى بَعِيرِهِ، وَكَانَ كُلَّمَا أَتَى عَلَى الرُّكْنِ أَشَارَ إِلَيْهِ، وَكَبَّرَ‏.‏ وَقَالَتْ زَيْنَبُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ فُتِحَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ ‏\"‏‏.‏ وَعَقَدَ تِسْعِينَ‏.‏",
                "headingArabic": "الإِشَارَةِ فِي الطَّلاَقِ وَالأُمُورِ",
                "headingUrdu": "طلاق کے فیصلے کے اظہار کے لیے اشاروں کا استعمال",
                "headingEnglish": "Using gestures to express the decision of divorce",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5063,
                "hadithNumber": "5294",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Abul Qasim (the Prophet (ﷺ) ) said, \"There is an hour (or a moment) of particular significance on Friday. If it happens that a Muslim is offering a prayer and invoking Allah for some good at that very moment, Allah will grant him his request.\" (The sub-narrator placed the top of his finger on the palm of the other hand between the middle finger and the little one.)",
                "hadithUrdu": "ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا جمعہ میں ایک گھڑی ایسی آتی ہے جو مسلمان بھی اس وقت کھڑا نماز پڑھے اور اللہ سے کوئی خیر مانگے تو اللہ اسے ضرور دے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے ( اس ساعت کی وضاحت کرتے ہوئے ) اپنے دست مبارک سے اشارہ کیا اور اپنی انگلیوں کو درمیانی انگلی اور چھوٹی انگلی کے بیچ میں رکھا جس سے ہم نے سمجھا کہ آپ اس ساعت کو بہت مختصر ہونے کو بتا رہے ہیں ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، ان سے بشر بن مفضل نے بیان کیا ، ان سے سلمہ بن علقمہ نے بیان کیا ، ان سے محمد بن سیرین نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا سَلَمَةُ بْنُ عَلْقَمَةَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏ \"‏ فِي الْجُمُعَةِ سَاعَةٌ لاَ يُوَافِقُهَا مُسْلِمٌ قَائِمٌ يُصَلِّي، فَسَأَلَ اللَّهَ خَيْرًا، إِلاَّ أَعْطَاهُ ‏\"‏‏.‏ وَقَالَ بِيَدِهِ، وَوَضَعَ أَنْمَلَتَهُ عَلَى بَطْنِ الْوُسْطَى وَالْخِنْصَرِ‏.‏ قُلْنَا يُزَهِّدُهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5064,
                "hadithNumber": "5295",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "During the lifetime of Allah's Messenger (ﷺ) a Jew attacked a girl and took some silver ornaments she was wearing and crushed her head. Her relative brought her to the Prophet (ﷺ) while she was in her last breaths, and she was unable to speak. Allah's Messenger (ﷺ) asked her, \"Who has hit you? So-and so?\", mentioning somebody other than her murderer. She moved her head, indicating denial. The Prophet (ﷺ) mentioned another person other than the murderer, and she again moved her head indicating denial. Then he asked, \"Was it so-and-so?\", mentioning the name of her killer. She nodded, agreeing. Then Allah's Messenger (ﷺ); ordered that the head of that Jew be crushed between two stones.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں ایک یہودی نے ایک لڑکی پر ظلم کیا ، اس کے چاندی کے زیورات جو وہ پہنے ہوئے تھی چھین لیے اور اس کا سر کچل دیا ۔ لڑکی کے گھر والے اسے آنحضرت صلی اللہ علیہ وسلم کے پاس لائے تو اس کی زندگی کی بس آخری گھڑی باقی تھی اور وہ بول نہیں سکتی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے اس سے پوچھا کہ تمہیں کس نے مارا ہے ؟ فلاں نے ؟ آنحضرت صلی اللہ علیہ وسلم نے اس واقعہ سے غیر متعلق آدمی کا نام لیا ۔ اس لیے اس نے اپنے سر کے اشارہ سے کہا کہ نہیں ۔ بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے ایک دوسرے شخص کا نام لیا اور وہ بھی اس واقعہ سے غیر متعلق تھا تو لڑکی نے سر کے اشارہ سے کہا کہ نہیں ، پھر آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کہ فلاں نے تمہیں مارا ہے ؟ تو اس لڑکی نے سر کے اشارہ سے ہاں کہا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم ؛ حکم دیا کہ اس یہودی کا سر دو پتھروں کے درمیان کچل دیا جائے۔",
                "urduNarrator": "اور اویسی نے بیان کیا ، ان سے ابراہیم بن سعد نے بیان کیا ، ان سے شعبہ بن حجاج نے ، ان سے ہشام بن یزید نے ، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ الأُوَيْسِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ شُعْبَةَ بْنِ الْحَجَّاجِ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ عَدَا يَهُودِيٌّ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى جَارِيَةٍ، فَأَخَذَ أَوْضَاحًا كَانَتْ عَلَيْهَا وَرَضَخَ رَأْسَهَا، فَأَتَى بِهَا أَهْلُهَا رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْىَ فِي آخِرِ رَمَقٍ، وَقَدْ أُصْمِتَتْ، فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَتَلَكِ فُلاَنٌ ‏\"‏‏.‏ لِغَيْرِ الَّذِي قَتَلَهَا، فَأَشَارَتْ بِرَأْسِهَا أَنْ لاَ، قَالَ فَقَالَ لِرَجُلٍ آخَرَ غَيْرِ الَّذِي قَتَلَهَا، فَأَشَارَتْ أَنْ لاَ، فَقَالَ ‏\"‏ فَفُلاَنٌ ‏\"‏‏.‏ لِقَاتِلِهَا فَأَشَارَتْ أَنْ نَعَمْ، فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُضِخَ رَأْسُهُ بَيْنَ حَجَرَيْنِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5065,
                "hadithNumber": "5296",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"Afflictions will emerge from here,\" pointing towards the East.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آپ فرما رہے تھے کہ فتنہ ادھر سے اٹھے گا اور آپ نے مشرق کی طرف اشارہ کیا ۔",
                "urduNarrator": "ہم سے قبیصہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے عبداللہ بن دینار نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْفِتْنَةُ مِنْ هَا هُنَا ‏\"‏‏.‏ وَأَشَارَ إِلَى الْمَشْرِقِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5066,
                "hadithNumber": "5297",
                "englishNarrator": "Narrated `Abdullah bin Abi A'ufa:",
                "hadithEnglish": "We were with Allah's Messenger (ﷺ) on a journey, and when the sun set, he said to a man, \"Get down and prepare a drink of Sawiq for me.\" The man said, \"O Allah's Messenger (ﷺ)! Will you wait till it is evening?\" Allah's Messenger (ﷺ) again said, \"Get down and prepare a drink of Sawiq.\" The man said, \"O Allah's Apostle! Will you wait till it is evening, for it is still daytime. \" The Prophet (ﷺ) again said, \"Get down and prepare a drink of Sawiq.\" So the third time the man got down and prepared a drink of sawiq for him. Allah's Messenger (ﷺ) drank thereof and pointed with his hand towards the East, saying, \"When you see the night falling from this side, then a fasting person should break his fast.\"",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے ۔ جب سورج ڈوب گیا تو آنحضرت صلی اللہ علیہ وسلم نے ایک صحابی ( حضرت بلال رضی اللہ عنہ ) سے فرمایا کہ اتر کر میرے لیے ستو گھول ( کیونکہ آپ روزہ سے تھے ) انہوں نے عرض کیا یا رسول اللہ ! اگر اندھیرا ہونے دیں تو بہتر ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے پھر فرمایا کہ اتر کر ستو گھول ۔ انہوں نے عرض کیا یا رسول اللہ ! اگر آپ اور اندھیرا ہو لینے دیں تو بہتر ہے ، ابھی دن باقی ہے ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اتر و اور ستو گھول لو ۔ آخر تیسری مر تبہ کہنے پرانہوں نے اتر کر آنحضرت صلی اللہ علیہ وسلم کا ستو گھولا ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے پیا ، پھر آپ نے اپنے ہاتھ سے مشرق کی طرف اشارہ کیا اور فرمایا کہ جب تم دیکھو کہ رات ادھر سے آ رہی ہے تو روزہ دار کو افطار کر لینا چاہیئے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے ابواسحاق شیبانی نے اور ان سے عبداللہ بن ابی اوفی نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، عَنْ أَبِي إِسْحَاقَ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ كُنَّا فِي سَفَرٍ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا غَرَبَتِ الشَّمْسُ قَالَ لِرَجُلٍ ‏\"‏ انْزِلْ فَاجْدَحْ لِي ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ لَوْ أَمْسَيْتَ‏.‏ ثُمَّ قَالَ ‏\"‏ انْزِلْ فَاجْدَحْ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ لَوْ أَمْسَيْتَ إِنَّ عَلَيْكَ نَهَارًا‏.‏ ثُمَّ قَالَ ‏\"‏ انْزِلْ فَاجْدَحْ ‏\"‏‏.‏ فَنَزَلَ فَجَدَحَ لَهُ فِي الثَّالِثَةِ، فَشَرِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ أَوْمَأَ بِيَدِهِ إِلَى الْمَشْرِقِ فَقَالَ ‏\"‏ إِذَا رَأَيْتُمُ اللَّيْلَ قَدْ أَقْبَلَ مِنْ هَا هُنَا فَقَدْ أَفْطَرَ الصَّائِمُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5067,
                "hadithNumber": "5298",
                "englishNarrator": "Narrated 'Abdullah bin رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The call (or the Adhan) of Bila should not stop you from taking the Suhur-meals for Bilal calls (or pronounces the Adhan) so that the one who is offering the night prayer should take a rest, and he does not indicate the daybreak or dawn.\" The narrator, Yazid, described (how dawn breaks) by stretching out his hands and then separating them wide apart.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، تم میں سے کسی کو ( سحری کھانے سے ) بلال کی پکار نہ روکے ، یا آپ نے فرمایا کہ ” ان کی اذان “ کیونکہ وہ پکارتے ہیں ، یا فرمایا ، اذان دیتے ہیں تاکہ اس وقت نماز پڑھنے والا رک جائے ۔ اس کا اعلان سے یہ مقصود نہیں ہوتا کہ صبح صادق ہو گئی ۔ اس وقت یزید بن زریع نے اپنے دونوں ہاتھ بلند کئے ( صبح کاذب کی صورت بتانے کے لیے ) پھر ایک ہاتھ کو دوسرے پر پھیلایا ( صبح صادق کی صورت کے اظہار کے لیے ) ۔",
                "urduNarrator": "ہم سے عبداللہ بن سلمہ نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، ان سے سلیمان تیمی نے ، ان سے ابوعثمان نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَمْنَعَنَّ أَحَدًا مِنْكُمْ نِدَاءُ بِلاَلٍ ـ أَوْ قَالَ أَذَانُهُ ـ مِنْ سَحُورِهِ، فَإِنَّمَا يُنَادِي أَوْ قَالَ يُؤَذِّنُ لِيَرْجِعَ قَائِمُكُمْ ‏\"‏‏.‏ وَلَيْسَ أَنْ يَقُولَ كَأَنَّهُ يَعْنِي الصُّبْحَ أَوِ الْفَجْرَ، وَأَظْهَرَ يَزِيدُ يَدَيْهِ ثُمَّ مَدَّ إِحْدَاهُمَا مِنَ الأُخْرَى‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5068,
                "hadithNumber": "5299",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, The example of a miser and a generous person is like that of two persons wearing iron cloaks from the breast upto the neck When the generous person spends, the iron cloak enlarges and spread over his skin so much so that it covers his fingertips and obliterates his tracks. As for the miser, as soon as he thinks of spending every ring of the iron cloak sticks to its place (against his body) and he tries to expand it, but it does not expand. The Prophet (ﷺ) pointed with his hand towards his throat.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، بخیل اورسخی کی مثال دو آدمیوں جیسی ہے جن پرلو ہے کی دو زرہیں سینے سے گردن تک ہیں ۔ سخی جب بھی کوئی چیز خرچ کرتا ہے تو زرہ اس کے چمڑے پر ڈھیلی ہو جاتی ہے اور اس کے پاؤں کی انگلیوں تک پہنچ جاتی ہے ( اور پھیل کر اتنی بڑھ جاتی ہے کہ ) اس کے نشان قدم کو مٹاتی چلتی ہے لیکن بخیل جب بھی خرچ کا ارادہ کرتا ہے تو اس کی زرہ کا ہر حلقہ اپنی اپنی جگہ چمٹ جاتا ہے ، وہ اسے ڈھیلا کرنا چاہتا ہے لیکن وہ ڈھیلا نہیں ہوتا ۔ اس وقت آپ نے اپنی انگلی سے اپنے حلق کی طرف اشارہ کیا ۔",
                "urduNarrator": "اور لیث نے بیان کیا کہ ان سے جعفر بن ربیعہ نے بیان کیا ، ان سے عبدالرحمٰن بن ہرمز نے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، سَمِعْتُ أَبَا هُرَيْرَةَ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَثَلُ الْبَخِيلِ وَالْمُنْفِقِ كَمَثَلِ رَجُلَيْنِ عَلَيْهِمَا جُبَّتَانِ مِنْ حَدِيدٍ، مِنْ لَدُنْ ثَدْيَيْهِمَا إِلَى تَرَاقِيهِمَا، فَأَمَّا الْمُنْفِقُ فَلاَ يُنْفِقُ شَيْئًا إِلاَّ مَادَّتْ عَلَى جِلْدِهِ حَتَّى تُجِنَّ بَنَانَهُ وَتَعْفُوَ أَثَرَهُ، وَأَمَّا الْبَخِيلُ فَلاَ يُرِيدُ يُنْفِقُ إِلاَّ لَزِمَتْ كُلُّ حَلْقَةٍ مَوْضِعَهَا، فَهْوَ يُوسِعُهَا فَلاَ تَتَّسِعُ ‏\"‏‏.‏ وَيُشِيرُ بِإِصْبَعِهِ إِلَى حَلْقِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5069,
                "hadithNumber": "5300",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Shall I tell you of the best families among the Ansar?\" They (the people) said, \"Yes, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, \"The best are Banu- An-Najjar, and after them are Banu `Abdil Ash-hal, and after them are Banu Al-Harith bin Al-Khazraj, and after them are Banu Sa`ida.\" The Prophet (ﷺ) then moved his hand by closing his fingers and then opening them like one throwing something, and then said, \"Anyhow, there is good in all the families of the Ansar. \"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تمہیں بتاؤں کہ قبیلہ انصار کا سب سے بہتر گھرانہ کو ن سا ہے ؟ صحابہ نے عرض کیا کہ ضرور بتائیے یا رسول اللہ ! آپ نے فرمایا کہ بنو نجار کا ۔ اس کے بعد ان کا مرتبہ ہے جو ان سے قریب ہیں یعنی بنو عبد الاشہل کا ، ان کے بعد وہ ہیں جو ان سے قریب ہیں ، بنی الحارث بن خزرج کا ۔ اس کے بعد وہ ہیں جو ان سے قریب ہیں ، بنو ساعد ہ کا ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے اپنے ہاتھ سے اشارہ کیا اور اپنی مٹھی بند کی ، پھر اسے اس طرح کھولا جیسے کوئی اپنے ہاتھ کی چیز کو پھینکتا ہے پھر فرمایا کہ انصار کے ہر گھرانہ میں خیر ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے یحییٰ بن سعید انصاری نے اور انہوں نے انس بن مالک انصاری رضی اللہ عنہ سے سنا ، بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ الأَنْصَارِيِّ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ أُخْبِرُكُمْ بِخَيْرِ دُورِ الأَنْصَارِ ‏\"‏‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ بَنُو النَّجَّارِ، ثُمَّ الَّذِينَ يَلُونَهُمْ بَنُو عَبْدِ الأَشْهَلِ، ثُمَّ الَّذِينَ يَلُونَهُمْ بَنُو الْحَارِثِ بْنِ الْخَزْرَجِ، ثُمَّ الَّذِينَ يَلُونَهُمْ بَنُو سَاعِدَةَ ‏\"‏‏.‏ ثُمَّ قَالَ بِيَدِهِ، فَقَبَضَ أَصَابِعَهُ، ثُمَّ بَسَطَهُنَّ كَالرَّامِي بِيَدِهِ ثُمَّ قَالَ ‏\"‏ وَفِي كُلِّ دُورِ الأَنْصَارِ خَيْرٌ ‏\"‏‏.‏",
                "headingArabic": "اللِّعَانِ",
                "headingUrdu": "ال لعان",
                "headingEnglish": "Al-Li'an",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5070,
                "hadithNumber": "5301",
                "englishNarrator": "Narrated Sahl bin Sa`d As-Sa`idi رضی اللہ عنہ :",
                "hadithEnglish": "(a companion of Allah's Messenger (ﷺ)) Allah's Messenger (ﷺ), holding out his middle and index fingers, said, \"My advent and the Hour's are like this (or like these),\" namely, the period between his era and the Hour is like the distance between those two fingers, i.e., very short.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، میری بعثت قیامت سے اتنی قریب ہے جیسے اس کی اس سے ( یعنی شہادت کی انگلی بیچ کی انگلی سے ) یا آنحضرت صلی اللہ علیہ وسلم نے فرمایا ( راوی کو شک تھا ) کہ جیسے یہ دونوں انگلیاں ہیں اور آپ نے شہادت کی اور بیچ کی انگلیوں کو ملا کر بتایا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا کہ ابوحازم نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے صحابی سہل بن سعد ساعدی رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ أَبُو حَازِمٍ سَمِعْتُهُ مِنْ، سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ صَاحِبِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بُعِثْتُ أَنَا وَالسَّاعَةَ كَهَذِهِ مِنْ هَذِهِ أَوْ كَهَاتَيْنِ ‏\"‏‏.‏ وَقَرَنَ بَيْنَ السَّبَّابَةِ وَالْوُسْطَى‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5071,
                "hadithNumber": "5302",
                "englishNarrator": "Narrated Ibn `Umar:",
                "hadithEnglish": "The Prophet (holding out his ten fingers thrice), said, \"The month is thus and thus and thus,\" namely thirty days. Then (holding out his ten fingers twice and then nine fingers), he said, \"It may be thus and thus and thus,\" namely twenty nine days. He meant once thirty days and once twenty nine days.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، مہینہ اتنے ، اتنے اور اتنے دنوں کا ہوتا ہے ۔ آپ کی مراد تیس دن سے تھی ۔ پھر فرمایا اور اتنے ، اتنے اور اتنے دنوں کا بھی ہوتا ہے ۔ آپ کا اشارہ انتیس دنوں کی طرف تھا ۔ ایک مرتبہ آپ نے تیس کی طرف اشارہ کیا اور دوسری مرتبہ انتیس کی طرف ۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے جبلہ بن سحیم نے بیان کیا ، انہوں نے حضرت ابن عمر رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا جَبَلَةُ بْنُ سُحَيْمٍ، سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏ يَعْنِي ثَلاَثِينَ، ثُمَّ قَالَ ‏\"‏ وَهَكَذَا وَهَكَذَا وَهَكَذَا ‏\"‏‏.‏ يَعْنِي تِسْعًا وَعِشْرِينَ يَقُولُ، مَرَّةً ثَلاَثِينَ وَمَرَّةً تِسْعًا وَعِشْرِينَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5072,
                "hadithNumber": "5303",
                "englishNarrator": "Narrated Abu Masud رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) pointed with his hand towards Yemen and said twice, \"Faith is there,\" and then pointed towards the East, and said, \"Verily, sternness and mercilessness are the qualities of those who are busy with their camels and pay no attention to their religion, where the two sides of the head of Satan will appear,\" namely, the tribes of Rabl'a and Muqar.",
                "hadithUrdu": "اور نبی کریم صلی اللہ علیہ وسلم نے اپنے ہاتھ سے یمن کی طرف اشارہ کر کے فرمایا کہ بر کتیں ادھر ہیں ۔ دو مرتبہ ( آنحضرت صلی اللہ علیہ وسلم نے یہ فرمایا ) ہاں اور سختی اور قساوت قلب ان کی کرخت آواز والوں میں ہے جہاں سے شیطان کی دونوں سینگیں طلوع ہوتی ہیں ۔ یعنی ربیعہ اور مضر میں ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے اسماعیل نے ، ان سے قیس نے اور ان سے ابومسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ وَأَشَارَ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ نَحْوَ الْيَمَنِ ‏ \"‏ الإِيمَانُ هَا هُنَا ـ مَرَّتَيْنِ ـ أَلاَ وَإِنَّ الْقَسْوَةَ وَغِلَظَ الْقُلُوبِ فِي الْفَدَّادِينَ حَيْثُ يَطْلُعُ قَرْنَا الشَّيْطَانِ رَبِيعَةَ وَمُضَرَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5073,
                "hadithNumber": "5304",
                "englishNarrator": "Narrated Sahl رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"I and the one who looks after an orphan will be like this in Paradise,\" showing his middle and index fingers and separating them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، میں اور یتیم کی پر ورش کرنے والا جنت میں اس طرح ہوں گے اور آپ نے شہادت کی انگلی اور بیچ کی انگلی سے اشارہ کیا اور ان دونوں انگلیوں کے درمیان تھوڑی سی جگہ کھلی رکھی ۔",
                "urduNarrator": "ہم سے عمرو بن زرارہ نے بیان کیا ، کہا کہ ہم کو عبدالعزیز بن ابی حازم نے خبر دی ، انہیں ان کے والد نے اور ان سے سہل رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنَا وَكَافِلُ الْيَتِيمِ فِي الْجَنَّةِ هَكَذَا ‏\"‏‏.‏ وَأَشَارَ بِالسَّبَّابَةِ وَالْوُسْطَى، وَفَرَّجَ بَيْنَهُمَا شَيْئًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5074,
                "hadithNumber": "5305",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "A man came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! A black child has been born for me.\" The Prophet asked him, \"Have you got camels?\" The man said, \"Yes.\" The Prophet (ﷺ) asked him, \"What color are they?\" The man replied, \"Red.\" The Prophet (ﷺ) said, \"Is there a grey one among them?' The man replied, \"Yes.\" The Prophet (ﷺ) said, \"Whence comes that?\" He said, \"May be it is because of heredity.\" The Prophet (ﷺ) said, \"May be your latest son has this color because of heredity.\"",
                "hadithUrdu": "ایک صحابی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا یا رسول اللہ ! میرے یہاں تو کالا کلوٹا بچہ پیدا ہوا ہے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا تمہارے پاس کچھ اونٹ بھی ہیں ؟ انہوں نے کہا جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، ان کے رنگ کیسے ہیں ؟ انہوں نے کہا کہ سرخ رنگ کے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، ان میں کوئی سیاہی مائل سفید اونٹ بھی ہے ؟ انہوں نے کہا کہ جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ پھر یہ کہاں سے آ گیا ؟ انہوں نے کہا کہ اپنی نسل کے کسی بہت پہلے کے اونٹ پر یہ پڑا ہو گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسی طرح تمہارا یہ لڑکا بھی اپنی نسل کے کسی دور کے رشتہ دار پر پڑا ہو گا ۔",
                "urduNarrator": "ہم سے یحییٰ نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے ، ان سے سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ وُلِدَ لِي غُلاَمٌ أَسْوَدُ‏.‏ فَقَالَ ‏\"‏ هَلْ لَكَ مِنْ إِبِلٍ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ مَا أَلْوَانُهَا ‏\"‏‏.‏ قَالَ حُمْرٌ‏.‏ قَالَ ‏\"‏ هَلْ فِيهَا مِنْ أَوْرَقَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَأَنَّى ذَلِكَ ‏\"‏‏.‏ قَالَ لَعَلَّهُ نَزَعَهُ عِرْقٌ‏.‏ قَالَ ‏\"‏ فَلَعَلَّ ابْنَكَ هَذَا نَزَعَهُ ‏\"‏‏.‏",
                "headingArabic": "إِذَا عَرَّضَ بِنَفْىِ الْوَلَدِ",
                "headingUrdu": "اگر شوہر کو کسی بچے پر اپنی ولدیت کا شبہ ہو۔",
                "headingEnglish": "If a husband suspects his paternity to a child.",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5075,
                "hadithNumber": "5306",
                "englishNarrator": "Narrated `Abdullah:",
                "hadithEnglish": "An Ansari man accused his wife (of committing illegal sexual intercourse). The Prophet (ﷺ) made both of them takes the oath of Lian, and separated them from each other (by divorce).",
                "hadithUrdu": "قبیلہ انصار کے ایک صحابی نے اپنی بیوی پر تہمت لگائی تو نبی کریم صلی اللہ علیہ وسلم نے دونوں میاں بیوی سے قسم کھلوائی اور پھر دونوں میں جدائی کرا دی ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے جویریہ نے بیان کیا ، ان سے نافع نے بیان کیا اور ان سے عبداللہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلُ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ رَجُلاً مِنَ الأَنْصَارِ قَذَفَ امْرَأَتَهُ فَأَحْلَفَهُمَا النَّبِيُّ صلى الله عليه وسلم ثُمَّ فَرَّقَ بَيْنَهُمَا‏.‏",
                "headingArabic": "إِحْلاَفِ الْمُلاَعِنِ",
                "headingUrdu": "لعان کے معاملے میں ملوث افراد کو حلف اٹھانے کا حکم دینا۔",
                "headingEnglish": "Commanding those who are involved in a case of Li'an to take the oath.",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5076,
                "hadithNumber": "5307",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Hilal bin Umaiyya accused his wife of illegal sexual intercourse and came to the Prophet (ﷺ) to bear witness (against her), (taking the oath of Lian). The Prophet (ﷺ) was saying, \"Allah knows that either of you is a liar. Will anyone of you repent (to Allah)?\" Then the lady got up and gave her witness.",
                "hadithUrdu": "ہلال بن امیہ نے اپنی بیوی پر تہمت لگائی ، پھر وہ آئے اور گواہی دی ۔ نبی کریم صلی اللہ علیہ وسلم نے اس وقت فرمایا ، اللہ خوب جانتا ہے کہ تم میں سے ایک جھوٹا ہے ، تو کیا تم میں سے کوئی ( جو واقعی گناہ کا مرتکب ہوا ہو ) رجوع کرے گا ؟ اس کے بعد ان کی بیوی کھڑی ہوئیں اور انہوں نے گواہی دی ۔ اپنے بری ہونے کی ۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے ہشام بن حسان نے ، کہا کہ ہم سے عکرمہ نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ هِشَامِ بْنِ حَسَّانَ، حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ هِلاَلَ بْنَ أُمَيَّةَ، قَذَفَ امْرَأَتَهُ، فَجَاءَ فَشَهِدَ وَالنَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ اللَّهَ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ، فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏‏.‏ ثُمَّ قَامَتْ فَشَهِدَتْ‏.‏",
                "headingArabic": "يَبْدَأُ الرَّجُلُ بِالتَّلاَعُنِ",
                "headingUrdu": "آدمی لعان کا عمل شروع کرے۔",
                "headingEnglish": "The man should start the process of Li'an.",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5077,
                "hadithNumber": "5308",
                "englishNarrator": "Narrated Uwaimir Al-Ajlani came to `Asim bin Ad Al-Ansari:",
                "hadithEnglish": "\"O `Asim! Suppose a man saw another man with his wife, would he kill him whereupon you would kill him; or what should he do? Please, O `Asim, ask about this on my behalf.\" `Asim  رضی اللہ عنہ asked Allah's Messenger (ﷺ) about it. Allah's Messenger (ﷺ), disliked that question and considered it disgraceful. What `Asim heard from Allah's Messenger (ﷺ) was hard on him. When `Asim  رضی اللہ عنہ returned to his family, 'Uwaimir came to him and said, \"O `Asim! What did Allah's Messenger (ﷺ). say to you?\" `Asim رضی اللہ عنہ said to 'Uwaimir, \"You never bring me any good. Allah's Messenger (ﷺ) disliked the problem which I asked him about.\" 'Uwaimir said, \"By Allah, I will not give up this matter until I ask the Prophet (ﷺ) about it.\" So 'Uwaimir proceeded till he came to Allah's Messenger (ﷺ) in the midst of people, and said, \"O Allah's Messenger (ﷺ)! If a man sees another man with his wife, would he kill him, whereupon you would kill him, or what should he do?\" Allah's Messenger (ﷺ) said, \"Allah has revealed some decree as regards you and your wives case. Go and bring her.\" So they carried out the process of Lian while I was present among the people with Allah's Messenger (ﷺ). When they had finished their Lian, 'Uwaimir said, \"O Allah's Messenger (ﷺ)! If I should now keep her with me as a wife, then I have told a lie.\" So he divorced her thrice before Allah's Messenger (ﷺ) ordered him. (Ibn Shihab said: So divorce was the tradition for all those who were involved in a case of Lian.)",
                "hadithUrdu": "عاصم آپ کا کیاخیال ہے کہ ایک شخص اگر اپنی بیوی کے ساتھ کسی غیر مرد کو دیکھے تو کیا اسے قتل کر دے گا لیکن پھر آپ لوگ اسے بھی قتل کر دیں گے ۔ آخر اسے کیا کرنا چاہیئے ؟ عاصم ، میرے لیے یہ مسئلہ پوچھ دو ۔ چنانچہ عاصم رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے یہ مسئلہ پوچھا ۔ آنحضرت نے اس طرح کے سوالات کو ناپسند فرمایا اور اظہار نا گواری کیا ۔ عاصم رضی اللہ عنہ نے اس سلسلے میں آنحضرت صلی اللہ علیہ وسلم سے جو کچھ سنا اس کا بہت اثر لیا ۔ پھر جب گھر واپس آئے تو عویمر ان کے پاس آئے اور پوچھا ۔ عاصم ! آپ کو رسول اللہ صلی اللہ علیہ وسلم نے کیا جواب دیا ۔ عاصم رضی اللہ عنہ نے کہا ، عویمر تم نے میرے ساتھ اچھا معاملہ نہیں کیا ، جو مسئلہ تم نے پوچھا تھا ، آنحضرت صلی اللہ علیہ وسلم نے اسے ناپسند فرمایا ۔ عویمر رضی اللہ عنہ نے کہا کہ اللہ کی قسم جب تک میں یہ مسئلہ آنحضرت صلی اللہ علیہ وسلم سے معلوم نہ کر لوں ، باز نہیں آؤں گا ۔ چنانچہ عویمر رضی اللہ عنہ حضور صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ، آنحضرت صلی اللہ علیہ وسلم اس وقت صحابہ کے درمیان میں موجود تھے ۔ انہوں نے عرض کیا یا رسول اللہ ! آپ کا اس شخص کے متعلق کیا ارشاد ہے جو اپنی بیوی کے ساتھ کسی غیر مرد کو دیکھے ، کیا اسے قتل کر دے ؟ لیکن پھر آپ لوگ اسے ( قصاص ) میں قتل کر دیں گے ، تو پھر اسے کیا کرنا چاہیئے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے اور تمہاری بیوی کے بارے میں ابھی وحی نازل ہوئی ہے ۔ جاؤ اور اپنی بیوی کو لے کر آؤ ۔ سہل نے بیان کیا کہ پھر ان دونوں نے لعان کیا ۔ میں بھی آنحضرت صلی اللہ علیہ وسلم کے پاس اس وقت موجود تھا ۔ جب لعان سے فارغ ہوئے تو عویمر رضی اللہ عنہ نے کہا کہ یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! اگر اب بھی میں اسے ( اپنی بیوی کو ) اپنے ساتھ رکھتا ہوں تو اس کا مطلب یہ ہے کہ میں جھوٹا ہوں ۔ چنانچہ انہوں نے انہیں تین طلاقیں آنحضرت صلی اللہ علیہ وسلم کے حکم سے پہلے ہی دے دیں ۔ ابن شہاب نے بیان کیا کہ پھر لعان کرنے والوں کے لیے سنت طریقہ مقرر ہو گیا ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی ایاس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے اور انہیں سہل بن سعد ساعدی نے خبر دی کہ عویمر عجلانی ، عاصم بن عدی انصاری کے پاس آئے اور ان سے کہا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، أَخْبَرَهُ أَنَّ عُوَيْمِرًا الْعَجْلاَنِيَّ جَاءَ إِلَى عَاصِمِ بْنِ عَدِيٍّ الأَنْصَارِيِّ فَقَالَ لَهُ يَا عَاصِمُ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ فَتَقْتُلُونَهُ، أَمْ كَيْفَ يَفْعَلُ سَلْ لِي يَا عَاصِمُ عَنْ ذَلِكَ‏.‏ فَسَأَلَ عَاصِمٌ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسَائِلَ وَعَابَهَا، حَتَّى كَبُرَ عَلَى عَاصِمٍ مَا سَمِعَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَجَعَ عَاصِمٌ إِلَى أَهْلِهِ جَاءَهُ عُوَيْمِرٌ فَقَالَ يَا عَاصِمُ مَاذَا قَالَ لَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ عَاصِمٌ لِعُوَيْمِرٍ لَمْ تَأْتِنِي بِخَيْرٍ، قَدْ كَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسْأَلَةَ الَّتِي سَأَلْتُهُ عَنْهَا‏.‏ فَقَالَ عُوَيْمِرٌ وَاللَّهِ لاَ أَنْتَهِي حَتَّى أَسْأَلَهُ عَنْهَا‏.‏ فَأَقْبَلَ عُوَيْمِرٌ حَتَّى جَاءَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَسَطَ النَّاسِ فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ قَدْ أُنْزِلَ فِيكَ وَفِي صَاحِبَتِكَ فَاذْهَبْ فَأْتِ بِهَا ‏\"‏‏.‏ قَالَ سَهْلٌ فَتَلاَعَنَا وَأَنَا مَعَ النَّاسِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا فَرَغَا مِنْ تَلاَعُنِهِمَا قَالَ عُوَيْمِرٌ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ إِنْ أَمْسَكْتُهَا‏.‏ فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ ابْنُ شِهَابٍ فَكَانَتْ سُنَّةَ الْمُتَلاَعِنَيْنِ‏.‏",
                "headingArabic": "اللِّعَانِ وَمَنْ طَلَّقَ بَعْدَ اللِّعَانِ",
                "headingUrdu": "لعان، اور لعان کے عمل کے بعد طلاق۔",
                "headingEnglish": "Al-Li'an, and divorce after the process of Li'an.",
                "chapterId": "69",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 69,
                    "chapterNumber": "69",
                    "chapterEnglish": "Divorce",
                    "chapterUrdu": "طلاق کے مسائل کا بیان",
                    "chapterArabic": "كتاب الطلاق",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5051,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=202",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=200",
                "label": "200",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=201",
                "label": "201",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=202",
                "label": "202",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=203",
                "label": "203",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=204",
                "label": "204",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=205",
                "label": "205",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=206",
                "label": "206",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=204",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=204",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=202",
        "to": 5075,
        "total": 40465
    }
}