{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 176,
        "data": [
            {
                "id": 4378,
                "hadithNumber": "4599",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Regarding the Verse: \"Because of the inconvenience of rain or because you are ill.\" (4.102) (It was revealed in connection with) `Abdur-Rahman bin `Auf رضی اللہ عنہ who was wounded.",
                "hadithUrdu": "آیت «إن كان بكم أذى من مطر أو كنتم مرضى‏» کے سلسلے میں بتلایا کہ عبدالرحمٰن بن عوف رضی اللہ عنہ زخمی ہو گئے تھے ان سے متعلق یہ آیت نازل ہوئی۔",
                "urduNarrator": "ہم سے ابوالحسن محمد بن مقاتل نے بیان کیا، انہوں نے کہا ہم کو حجاج بن محمد اعور نے خبر دی، ان سے ابن جریج نے بیان کیا، انہیں یعلیٰ بن مسلم نے خبر دی، انہیں سعید بن جبیر نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي يَعْلَى، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏إِنْ كَانَ بِكُمْ أَذًى مِنْ مَطَرٍ أَوْ كُنْتُمْ مَرْضَى‏}‏ قَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفِ كَانَ جَرِيحًا‏.‏",
                "headingArabic": "‏{‏وَلاَ جُنَاحَ عَلَيْكُمْ إِنْ كَانَ بِكُمْ أَذًى مِنْ مَطَرٍ أَوْ كُنْتُمْ مَرْضَى أَنْ تَضَعُوا أَسْلِحَتَكُمْ‏}‏",
                "headingUrdu": "\"لیکن تم پر کوئی گناہ نہیں اگر تم بارش کی تکلیف کی وجہ سے اپنے بازوؤں کو چھوڑ دو...\" (V.4:102)",
                "headingEnglish": "\"But there is no sin on you if you put away your arms because of the inconvenience of rain…\" (V.4:102)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4379,
                "hadithNumber": "4600",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہ :",
                "hadithEnglish": "Regarding the Verse:--\"They ask your instruction concerning the women. Say: Allah instructs you about them and yet whom you desire to marry.\" (4.127) (has been revealed regarding the case of) a man who has an orphan girl, and he is her guardian and her heir. The girl shares with him all his property, even a date-palm (garden), but he dislikes to marry her and dislikes to give her in marriage to somebody else who would share with him the property she is sharing with him, and for this reason that guardian prevents that orphan girl from marrying. So, this Verse was revealed: (And Allah's statement:) \"If a woman fears cruelty or desertion on her husband's part.\" (4.128)",
                "hadithUrdu": "آیت «ويستفتونك في النساء قل الله يفتيكم فيهن‏» ”لوگ آپ سے عورتوں کے بارے میں فتویٰ مانگتے ہیں۔ آپ کہہ دیں کہ اللہ تمہیں ان کے بارے میں ( وہی ) فتویٰ دیتا ہے“ آیت «وترغبون أن تنكحوهن‏» تک۔ انہوں نے بیان کیا کہ یہ آیت ایسے شخص کے بارے میں نازل ہوئی کہ اگر اس کی پرورش میں کوئی یتیم لڑکی ہو اور وہ اس کا ولی اور وارث بھی ہو اور لڑکی اس کے مال میں بھی حصہ دار ہو۔ یہاں تک کہ کھجور کے درخت میں بھی۔ اب وہ شخص خود اس لڑکی سے نکاح کرنا چاہے، کیونکہ اسے یہ پسند نہیں کہ کسی دوسرے سے اس کا نکاح کر دے کہ وہ اس کے اس مال میں حصہ دار بن جائے، جس میں لڑکی حصہ دار تھی، اس وجہ سے اس لڑکی کا کسی دوسرے شخص سے نکاح نہ ہونے دے تو ایسے شخص کے بارے میں یہ آیت نازل ہوئی تھی۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا، کہا ہم سے ابواسامہ حماد بن اسامہ نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ‏}‏ إِلَى قَوْلِهِ ‏{‏وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏‏.‏ قَالَتْ هُوَ الرَّجُلُ تَكُونُ عِنْدَهُ الْيَتِيمَةُ، هُوَ وَلِيُّهَا وَوَارِثُهَا، فَأَشْرَكَتْهُ فِي مَالِهِ حَتَّى فِي الْعِذْقِ، فَيَرْغَبُ أَنْ يَنْكِحَهَا، وَيَكْرَهُ أَنْ يُزَوِّجَهَا رَجُلاً، فَيَشْرَكُهُ فِي مَالِهِ بِمَا شَرِكَتْهُ فَيَعْضُلَهَا فَنَزَلَتْ هَذِهِ الآيَةُ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ وَمَا يُتْلَى عَلَيْكُمْ فِي الْكِتَابِ فِي يَتَامَى النِّسَاءِ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’وہ تم سے عورتوں کے بارے میں شرعی احکام پوچھتے ہیں، کہو: اللہ تمہیں ان کے بارے میں اور یتیم لڑکیوں کے بارے میں کتاب میں جو کچھ تم کو پڑھا گیا ہے اس کے بارے میں حکم دیتا ہے‘‘۔ (V.4:127)",
                "headingEnglish": "Allah's Statement: \"They ask your legal instruction concerning women, say: Allah instructs you about them, and about what is recited unto you in the Book concerning orphan girls.. .\" (V.4:127)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4380,
                "hadithNumber": "4601",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Regarding the Verse:--\"If a woman fears cruelty or desertion on her husband's part.\" (4.128) It is about a man who has a woman (wife) and he does not like her and wants to divorce her but she says to him, \"I make you free as regards myself.\" So this Verse was revealed in this connection.",
                "hadithUrdu": "آیت «وإن امرأة خافت من بعلها نشوزا أو إعراضا‏‏‏.‏» ”اور کسی عورت کو اپنے شوہر کی طرف سے زیادتی یا بے رغبتی کا خوف ہو“ کے متعلق کہا کہ ایسا مرد جس کے ساتھ اس کی بیوی رہتی ہے، لیکن شوہر کو اس کی طرف کوئی خاص توجہ نہیں، بلکہ وہ اسے جدا کر دینا چاہتا ہے، اس پر عورت کہتی ہے کہ میں اپنی باری اور اپنا ( نان نفقہ ) معاف کر دیتی ہوں ( تم مجھے طلاق نہ دو ) تو ایسی صورت کے متعلق یہ آیت اسی باب میں اتری۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو ہشام بن عروہ نے خبر دی، انہیں ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ ‏{‏وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا‏}‏‏.‏ قَالَتِ الرَّجُلُ تَكُونُ عِنْدَهُ الْمَرْأَةُ لَيْسَ بِمُسْتَكْثِرٍ مِنْهَا يُرِيدُ أَنْ يُفَارِقَهَا فَتَقُولُ أَجْعَلُكَ مِنْ شَأْنِي فِي حِلٍّ‏.‏ فَنَزَلَتْ هَذِهِ الآيَةُ فِي ذَلِكَ‏.‏",
                "headingArabic": "‏{‏وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا‏}‏",
                "headingUrdu": "\"اگر ایک عورت کو اپنے شوہر کی طرف سے ظلم یا انحطاط کا خوف ہو...\" (V.4:128)",
                "headingEnglish": "\"If a woman fears cruelty or desertion on her husband's part...\" (V.4:128)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4381,
                "hadithNumber": "4602",
                "englishNarrator": "Narrated Al-Aswad:",
                "hadithEnglish": "While we were sitting in a circle in `Abdullah's gathering, Hudhaifa رضی اللہ عنہ came and stopped before us, and greeted us and then said, \"People better than you became hypocrites.\" Al-Aswad said: I testify the uniqueness of Allah! Allah says: \"Verily! The hypocrites will be in the lowest depths of the Fire.\" (4.145) On that `Abdullah رضی اللہ عنہ smiled and Hudhaifa رضی اللہ عنہ sat somewhere in the Mosque. `Abdullah رضی اللہ عنہ then got up and his companions (sitting around him) dispersed. Hudhaifa رضی اللہ عنہ then threw a pebble at me (to attract my attention). I went to him and he said, \"I was surprised at `Abdullah's smile though he understood what I said. Verily, people better than you became hypocrite and then repented and Allah forgave them.\"",
                "hadithUrdu": "ہم عبداللہ بن مسعود رضی اللہ عنہ کے حلقہ درس میں بیٹھے ہوئے تھے کہ حذیفہ رضی اللہ عنہ تشریف لائے اور ہمارے پاس کھڑے ہو کر سلام کیا۔ پھر کہا نفاق میں وہ جماعت مبتلا ہو گئی جو تم سے بہتر تھی۔ اس پر اسود بولے، سبحان اللہ، اللہ تعالیٰ تو فرماتا ہے «إن المنافقين في الدرك الأسفل من النار‏» کہ ”منافق دوزخ کے سب سے نچلے درجے میں ہوں گے۔“ عبداللہ بن مسعود رضی اللہ عنہ مسکرانے لگے اور حذیفہ رضی اللہ عنہ مسجد کے کونے میں جا کر بیٹھ گئے۔ اس کے بعد عبداللہ بن مسعود رضی اللہ عنہ اٹھ گئے اور آپ کے شاگرد بھی اِدھر اُدھر چلے گئے۔ پھر حذیفہ رضی اللہ عنہ نے مجھ پر کنکری پھینکی ( یعنی مجھ کو بلایا ) میں حاضر ہو گیا تو کہا کہ مجھے عبداللہ بن مسعود رضی اللہ عنہ کی ہنسی پر حیرت ہوئی حالانکہ جو کچھ میں نے کہا تھا اسے وہ خوب سمجھتے تھے۔ یقیناً نفاق میں ایک جماعت کو مبتلا کیا گیا تھا جو تم سے بہتر تھی، اس لیے کہ پھر انہوں نے توبہ کر لی اور اللہ نے بھی ان کی توبہ قبول کر لی۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا ان سے ان کے باپ نے بیان کیا، ان سے اعمش نے بیان کیا، کہا کہ مجھ سے ابراہیم نے بیان کیا، ان سے اسود نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ، عَنِ الأَسْوَدِ، قَالَ كُنَّا فِي حَلْقَةِ عَبْدِ اللَّهِ فَجَاءَ حُذَيْفَةُ حَتَّى قَامَ عَلَيْنَا، فَسَلَّمَ ثُمَّ قَالَ لَقَدْ أُنْزِلَ النِّفَاقُ عَلَى قَوْمٍ خَيْرٍ مِنْكُمْ‏.‏ قَالَ الأَسْوَدُ سُبْحَانَ اللَّهِ، إِنَّ اللَّهَ يَقُولُ ‏{‏إِنَّ الْمُنَافِقِينَ فِي الدَّرَكِ الأَسْفَلِ مِنَ النَّارِ‏}‏ فَتَبَسَّمَ عَبْدُ اللَّهِ، وَجَلَسَ حُذَيْفَةُ فِي نَاحِيَةِ الْمَسْجِدِ، فَقَامَ عَبْدُ اللَّهِ فَتَفَرَّقَ أَصْحَابُهُ، فَرَمَانِي بِالْحَصَا، فَأَتَيْتُهُ فَقَالَ حُذَيْفَةُ عَجِبْتُ مِنْ ضَحِكِهِ، وَقَدْ عَرَفَ مَا قُلْتُ، لَقَدْ أُنْزِلَ النِّفَاقُ عَلَى قَوْمٍ كَانُوا خَيْرًا مِنْكُمْ، ثُمَّ تَابُوا فَتَابَ اللَّهُ عَلَيْهِمْ‏.‏",
                "headingArabic": "‏{‏إِنَّ الْمُنَافِقِينَ فِي الدَّرَكِ الأَسْفَلِ‏}‏",
                "headingUrdu": "’’بے شک منافق دوزخ کے سب سے نچلے درجے میں ہوں گے‘‘ (4:145)",
                "headingEnglish": "\"Verily, the hypocrites will be in the lowest depths (grade) of the Fire...\" (V.4:145)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4382,
                "hadithNumber": "4603",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"None has the right to say that I am better than Jonah bin Matta.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”کسی کے لیے مناسب نہیں کہ مجھے یونس بن متی سے بہتر کہے۔“",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، ان سے سفیان ثوری نے بیان کیا، کہا ہم سے اعمش نے بیان کیا، ان سے ابووائل نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي الأَعْمَشُ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا يَنْبَغِي لأَحَدٍ أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏إِنَّا أَوْحَيْنَا إِلَيْكَ‏}‏ إِلَى قَوْلِهِ ‏{‏وَيُونُسَ وَهَارُونَ وَسُلَيْمَانَ‏}‏",
                "headingUrdu": "ارشادِ باری تعالیٰ ہے: ’’بے شک ہم نے آپ کی طرف وحی بھیجی ہے، (یہاں تک) ... جس طرح ہم نے نوح (علیہ السلام) اور یونس (علیہ السلام)، ہارون (علیہ السلام) اور سلیمان (علیہ السلام) پر وحی بھیجی تھی۔ )...\" (V.4:163)",
                "headingEnglish": "Allah's Statement: \"Verily, We have sent revelation to you, (O Muhammad ﷺ ) ... (till) ... as We sent revelation to Nuh (Noah) and Yunus (Jonah), Hãrün (Aaron) and Sulaimãn (Solomon)...\" (V.4:163)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4383,
                "hadithNumber": "4604",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever says that I am better than Jonah bin Matta, is a liar.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”جو شخص یہ کہتا ہے میں یونس بن متی سے بہتر ہوں اس نے جھوٹ کہا۔“",
                "urduNarrator": "ہم سے محمد بن سنان نے بیان کیا، انہوں نے کہا ہم سے فلیح نے بیان کیا، ان سے ہلال نے بیان کیا، ان سے عطاء بن یسار نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحٌ، حَدَّثَنَا هِلاَلٌ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ قَالَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى فَقَدْ كَذَبَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4384,
                "hadithNumber": "4605",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "The last Sura that was revealed was Bara'a, and the last Verse that was revealed was: \"They ask you for a legal verdict, Say: Allah's directs (thus) about those who leave no descendants or ascendants as heirs.\" (4.176)",
                "hadithUrdu": "سب سے آخر میں جو سورت نازل ہوئی وہ سورۃ برات ہے اور ( احکام میراث کے سلسلے میں ) سب سے آخر میں جو آیت نازل ہوئی وہ «يستفتونك قل الله یفتیکم فى الکلالة» ہے۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے ابواسحاق نے اور انہوں نے براء بن عازب رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ قَالَ آخِرُ سُورَةٍ نَزَلَتْ بَرَاءَةَ، وَآخِرُ آيَةٍ نَزَلَتْ ‏{‏يَسْتَفْتُونَكَ ‏}‏",
                "headingArabic": "{‏يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلاَلَةِ إِنِ امْرُؤٌ هَلَكَ لَيْسَ لَهُ وَلَدٌ وَلَهُ أُخْتٌ فَلَهَا نِصْفُ مَا تَرَكَ وَهُوَ يَرِثُهَا إِنْ لَمْ يَكُنْ لَهَا وَلَدٌ‏}",
                "headingUrdu": "\"وہ آپ سے قانونی فیصلہ مانگتے ہیں، آپ کہہ دیجئے: اللہ کلال کے بارے میں (اس طرح) حکم دیتا ہے، جو نہ اولاد چھوڑتا ہے اور نہ ہی وارث چھوڑتا ہے)، اگر کوئی آدمی مر جائے تو بہن چھوڑے، لیکن اولاد نہ ہو۔ اسے نصف وراثت ملے گی، اگر (ایسی میت) ایسی عورت تھی جس نے کوئی بچہ نہ چھوڑا ہو، تو اس کا بھائی اس کی میراث لے لے گا...\" (V.4:176)",
                "headingEnglish": "\"They ask you for a legal verdict. Say: 'Allah directs (thus) about Al-Kalal,a (those who leave neither descendants nor ascendants as heirs). If it is a man that dies, leaving a sister, but no child, she shall have half the inheritance. If (such a deceased was) a woman who left no child, her brother takes her inheritance...\" (V.4:176)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4385,
                "hadithNumber": "4606",
                "englishNarrator": "Narrated Tariq bin Shihab:",
                "hadithEnglish": "The Jews said to `Umar رضی اللہ عنہ , \"You (i.e. Muslims) recite a Verse, and had it been revealed to us, we would have taken the day of its revelation as a day of celebration.\" `Umar رضی اللہ عنہ said, \"I know very well when and where it was revealed, and where Allah's Messenger (ﷺ) was when it was revealed. (It was revealed on) the day of `Arafat (Hajj Day), and by Allah, I was at `Arafat\" Sufyan, a sub-narrator said: I am in doubt whether the Verse:-- \"This day I have perfected your religion for you.\" was revealed on a Friday or not.",
                "hadithUrdu": "یہودیوں نے عمر رضی اللہ عنہ سے کہا کہ آپ لوگ ایک ایسی آیت کی تلاوت کرتے ہیں کہ اگر ہمارے یہاں وہ نازل ہوئی ہوتی تو ہم ( جس دن وہ نازل ہوئی ہوتی ) اس دن عید منایا کرتے۔ عمر رضی اللہ عنہ نے کہا، میں خوب اچھی طرح جانتا ہوں کہ یہ آیت «اليوم أكملت لكم دينكم‏» کہاں اور کب نازل ہوئی تھی اور جب عرفات کے دن نازل ہوئی تو نبی کریم صلی اللہ علیہ وسلم کہاں تشریف رکھتے تھے۔ اللہ کی قسم! ہم اس وقت میدان عرفات میں تھے۔ سفیان ثوری نے کہا کہ مجھے شک ہے کہ وہ جمعہ کا دن تھا یا اور کوئی دوسرا دن۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے قیس بن اسلم نے اور ان سے طارق بن شہاب نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ قَيْسٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، قَالَتِ الْيَهُودُ لِعُمَرَ إِنَّكُمْ تَقْرَءُونَ آيَةً لَوْ نَزَلَتْ فِينَا لاَتَّخَذْنَاهَا عِيدًا‏.‏ فَقَالَ عُمَرُ إِنِّي لأَعْلَمُ حَيْثُ أُنْزِلَتْ، وَأَيْنَ أُنْزِلَتْ، وَأَيْنَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ أُنْزِلَتْ يَوْمَ عَرَفَةَ، وَإِنَّا وَاللَّهِ بِعَرَفَةَ ـ قَالَ سُفْيَانُ وَأَشُكُّ كَانَ يَوْمَ الْجُمُعَةِ أَمْ لاَ – ‏{‏الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ‏}‏",
                "headingArabic": "قَوْلِهِ ‏{‏الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ‏}‏",
                "headingUrdu": "اللہ کا فرمان: ’’آج میں نے تمہارے لیے تمہارا دین مکمل کر دیا ہے‘‘ (V.5:3)",
                "headingEnglish": "Allah's Statement: \"This day, I have perfected your religion for you...\" (V.5:3)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4386,
                "hadithNumber": "4607",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The wife of the Prophet (ﷺ) : We set out with Allah's Messenger (ﷺ) on one of his journeys, and when we were at Baida' or at Dhat-al-Jaish, a necklace of mine was broken (and lost). Allah's Messenger (ﷺ) stayed there to look for it, and so did the people along with him. Neither were they at a place of water, nor did they have any water with them. So the people went to Abu Bakr As-Siddiq رضی اللہ عنہ and said, \"Don't you see what `Aisha رضی اللہ عنہا has done? She has made Allah's Messenger (ﷺ) and the people, stay where there is no water and they have no water with them.\" Abu Bakr رضی اللہ عنہ came while Allah's Messenger (ﷺ) was sleeping with his head on my thigh. He said (to me), \"You have detained Allah's Messenger (ﷺ) and the people where there is no water, and they have no water with them.\" So he admonished me and said what Allah wished him to say, and he hit me on my flanks with his hand. Nothing prevented me from moving (because of pain! but the position of Allah's Messenger (ﷺ) on my thigh. So Allah's Messenger (ﷺ) got up when dawn broke and there was no water, so Allah revealed the Verse of Tayammum. Usaid bin Hudair said, \"It is not the first blessing of yours, O the family of Abu Bakr رضی اللہ عنہ .\" Then we made the camel on which I was riding, got up, and found the necklace under it.",
                "hadithUrdu": "ایک سفر میں ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ روانہ ہوئے۔ جب ہم مقام بیداء یا ذات الجیش تک پہنچے تو میرا ہار گم ہو گیا۔ اس لیے رسول اللہ صلی اللہ علیہ وسلم نے اسے تلاش کروانے کے لیے وہیں قیام کیا اور صحابہ رضی اللہ عنہم نے بھی آپ صلی اللہ علیہ وسلم کے ساتھ قیام کیا۔ وہاں کہیں پانی نہیں تھا اور صحابہ رضی اللہ عنہم کے ساتھ بھی پانی نہیں تھا۔ لوگ ابوبکر صدیق رضی اللہ عنہ کے پاس آئے اور کہنے لگے، ملاحظہ نہیں فرماتے، عائشہ رضی اللہ عنہا نے کیا کر رکھا ہے اور نبی کریم صلی اللہ علیہ وسلم کو یہیں ٹھہرا لیا اور ہمیں بھی، حالانکہ یہاں کہیں پانی نہیں ہے اور نہ کسی کے پاس پانی ہے۔ ابوبکر رضی اللہ عنہ ( میرے یہاں ) آئے۔ نبی کریم صلی اللہ علیہ وسلم سر مبارک میری ران پر رکھ کر سو گئے تھے اور کہنے لگے تم نے نبی کریم صلی اللہ علیہ وسلم کو اور سب کو روک لیا، حالانکہ یہاں کہیں پانی نہیں ہے اور نہ کسی کے ساتھ پانی ہے۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ ابوبکر صدیق رضی اللہ عنہ مجھ پر بہت خفا ہوئے اور جو اللہ کو منظور تھا مجھے کہا، سنا اور ہاتھ سے میری کوکھ میں کچوکے لگائے۔ میں نے صرف اس خیال سے کوئی حرکت نہیں کی کہ نبی کریم صلی اللہ علیہ وسلم میری ران پر اپنا سر رکھے ہوئے تھے۔ پھر نبی کریم صلی اللہ علیہ وسلم اٹھے اور صبح تک کہیں پانی کا نام و نشان نہیں تھا، پھر اللہ تعالیٰ نے تیمم کی آیت اتاری تو اسید بن حضیر نے کہا کہ آل ابی بکر! یہ تمہاری کوئی پہلی برکت نہیں ہے۔ بیان کیا کہ پھر ہم نے وہ اونٹ اٹھایا جس پر میں سوار تھی تو ہار اسی کے نیچے مل گیا۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا، ان سے عبدالرحمٰن بن قاسم نے بیان کیا، ان سے ان کے والد قاسم بن محمد نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ، حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ أَوْ بِذَاتِ الْجَيْشِ انْقَطَعَ عِقْدٌ لِي، فَأَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْتِمَاسِهِ، وَأَقَامَ النَّاسُ مَعَهُ، وَلَيْسُوا عَلَى مَاءٍ، وَلَيْسَ مَعَهُمْ مَاءٌ فَأَتَى النَّاسُ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ فَقَالُوا أَلاَ تَرَى مَا صَنَعَتْ عَائِشَةُ أَقَامَتْ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَبِالنَّاسِ، وَلَيْسُوا عَلَى مَاءٍ، وَلَيْسَ مَعَهُمْ مَاءٌ، فَجَاءَ أَبُو بَكْرٍ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَاضِعٌ رَأْسَهُ عَلَى فَخِذِي قَدْ نَامَ، فَقَالَ حَبَسْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالنَّاسَ، وَلَيْسُوا عَلَى مَاءٍ، وَلَيْسَ مَعَهُمْ مَاءٌ قَالَتْ عَائِشَةُ فَعَاتَبَنِي أَبُو بَكْرٍ، وَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ، وَجَعَلَ يَطْعُنُنِي بِيَدِهِ فِي خَاصِرَتِي، وَلاَ يَمْنَعُنِي مِنَ التَّحَرُّكِ إِلاَّ مَكَانُ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى فَخِذِي، فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى أَصْبَحَ عَلَى غَيْرِ مَاءٍ، فَأَنْزَلَ اللَّهُ آيَةَ التَّيَمُّمِ فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ مَا هِيَ بِأَوَّلِ بَرَكَتِكُمْ يَا آلَ أَبِي بَكْرٍ‏.‏ قَالَتْ فَبَعَثْنَا الْبَعِيرَ الَّذِي كُنْتُ عَلَيْهِ فَإِذَا الْعِقْدُ تَحْتَهُ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور تم پانی نہ پاؤ، پھر پاک مٹی سے تیمم کرو‘‘ (V.5:6)",
                "headingEnglish": "Allah's Statement: \"...And you find no water, then perform Tayammum with clean earth...\" (V.5:6)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4387,
                "hadithNumber": "4608",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "A necklace of mine was lost at Al-Baida' and we were on our way to Medina. The Prophet (ﷺ) made his camel kneel down and dismounted and laid his head on my lap and slept. Abu Bakr رضی اللہ عنہ came to me and hit me violently on the chest and said, \"You have detained the people because of a necklace.\" I kept as motionless as a dead person because of the position of Allah's Messenger (ﷺ) ; (on my lap) although Abu Bakr رضی اللہ عنہ had hurt me (with the slap). Then the Prophet (ﷺ) woke up and it was the time for the morning (prayer). Water was sought, but in vain; so the following Verse was revealed:-- \"O you who believe! When you intend to offer prayer..\" (5.6) Usaid bin Hudair رضی اللہ عنہ said, \"Allah has blessed the people for your sake, O the family of Abu Bakr. You are but a blessing for them.\"",
                "hadithUrdu": "میرا ہار مقام بیداء میں گم ہو گیا تھا۔ ہم مدینہ واپس آ رہے تھے، نبی کریم صلی اللہ علیہ وسلم نے وہیں اپنی سواری روک دی اور اتر گئے، پھر نبی کریم صلی اللہ علیہ وسلم سر مبارک میری گود میں رکھ کر سو رہے تھے کہ ابوبکر رضی اللہ عنہ اندر آ گئے اور میرے سینے پر زور سے ہاتھ مار کر فرمایا کہ ایک ہار کے لیے تم نے نبی کریم صلی اللہ علیہ وسلم کو روک لیا لیکن نبی کریم صلی اللہ علیہ وسلم کے آرام کے خیال سے میں بےحس و حرکت بیٹھی رہی حالانکہ مجھے تکلیف ہوئی تھی۔ پھر نبی کریم صلی اللہ علیہ وسلم بیدار ہوئے اور صبح کا وقت ہوا اور پانی کی تلاش ہوئی لیکن کہیں پانی کا نام و نشان نہ تھا۔ اسی وقت یہ آیت اتری «يا أيها الذين آمنوا إذا قمتم إلى الصلاة‏» الخ۔ اسید بن حضیر رضی اللہ عنہ نے کہا: اے آل ابی بکر! تمہیں اللہ تعالیٰ نے لوگوں کے لیے باعث برکت بنایا ہے۔ یقیناً تم لوگوں کے لیے باعث برکت ہو۔ تمہارا ہار گم ہوا اللہ نے اس کی وجہ سے تیمم کی آیت نازل فرما دی جو قیامت تک مسلمانوں کے لیے آسانی اور برکت ہے۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا، کہا کہ مجھے عمرو بن حارث نے خبر دی، ان سے عبدالرحمٰن بن قاسم نے بیان کیا، ان سے ان کے والد قاسم نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، حَدَّثَهُ عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ سَقَطَتْ قِلاَدَةٌ لِي بِالْبَيْدَاءِ وَنَحْنُ دَاخِلُونَ الْمَدِينَةَ، فَأَنَاخَ النَّبِيُّ صلى الله عليه وسلم وَنَزَلَ، فَثَنَى رَأْسَهُ فِي حَجْرِي رَاقِدًا، أَقْبَلَ أَبُو بَكْرٍ فَلَكَزَنِي لَكْزَةً شَدِيدَةً وَقَالَ حَبَسْتِ النَّاسَ فِي قِلاَدَةٍ‏.‏ فَبِي الْمَوْتُ لِمَكَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَدْ أَوْجَعَنِي، ثُمَّ إِنَّ النَّبِيَّ صلى الله عليه وسلم اسْتَيْقَظَ وَحَضَرَتِ الصُّبْحُ فَالْتُمِسَ الْمَاءُ فَلَمْ يُوجَدْ فَنَزَلَتْ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلاَةِ‏}‏ الآيَةَ‏.‏ فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ لَقَدْ بَارَكَ اللَّهُ لِلنَّاسِ فِيكُمْ يَا آلَ أَبِي بَكْرٍ، مَا أَنْتُمْ إِلاَّ بَرَكَةٌ لَهُمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4388,
                "hadithNumber": "4609",
                "englishNarrator": "Narrated `Abdullah (bin Masud) رضی اللہ عنہ :",
                "hadithEnglish": "On the day of Badr, Al-Miqdad رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! We do not say to you as the children of Israel said to Moses, 'Go you and your Lord and fight you two; we are sitting here, (5.24) but (we say). \"Proceed, and we are with you.\" That seemed to delight Allah's Messenger (ﷺ) greatly. Wakee, Sufyan, Mukhariq reported it from Tariq bin Shihab that Hadrat Miqdad  رضی اللہ عنہ said the same to the Prophet ﷺ .",
                "hadithUrdu": "جنگ بدر کے موقع پر مقداد بن اسود رضی اللہ عنہ نے کہا تھا: یا رسول اللہ! ہم آپ سے وہ بات نہیں کہیں گے جو بنی اسرائیل نے موسیٰ علیہ السلام سے کہی تھی «فاذهب أنت وربك فقاتلا إنا ها هنا قاعدون‏» کہ ”آپ خود اور آپ کے خدا چلے جائیں اور آپ دونوں لڑ بھڑ لیں۔ ہم تو یہاں سے ٹلنے کے نہیں۔“ نہیں! آپ چلئے، ہم آپ کے ساتھ جان دینے کو حاضر ہیں۔ رسول اللہ صلی اللہ علیہ وسلم کو ان کی اس بات سے خوشی ہوئی۔ اس حدیث کو وکیع نے بھی سفیان ثوری سے، انہوں نے مخارق سے، انہوں نے طارق سے روایت کیا ہے کہ مقداد رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے یہ عرض کیا ( جو اوپر بیان ہوا ) ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے اسرائیل نے بیان کیا، ان سے مخارق نے، ان سے طارق بن شہاب نے اور انہوں نے ابن مسعود رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ میں مقداد بن اسود رضی اللہ عنہ کے قریب موجود تھا ( دوسری سند ) اور مجھ سے حمدان بن عمر نے بیان کیا، کہا ہم سے ابوالنضر ( ہاشم بن قاسم ) نے بیان کیا، کہا ہم سے عبیداللہ بن عبدالرحمٰن اشجعی نے بیان کیا، ان سے سفیان ثوری نے، ان سے مخارق بن عبداللہ نے، ان سے طارق بن شہاب نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ مُخَارِقٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، سَمِعْتُ ابْنَ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ شَهِدْتُ مِنَ الْمِقْدَادِ ح وَحَدَّثَنِي حَمْدَانُ بْنُ عُمَرَ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا الأَشْجَعِيُّ عَنْ سُفْيَانَ عَنْ مُخَارِقٍ عَنْ طَارِقٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ الْمِقْدَادُ يَوْمَ بَدْرٍ يَا رَسُولَ اللَّهِ إِنَّا لاَ نَقُولُ لَكَ كَمَا قَالَتْ بَنُو إِسْرَائِيلَ لِمُوسَى ‏{‏فَاذْهَبْ أَنْتَ وَرَبُّكَ فَقَاتِلاَ إِنَّا هَا هُنَا قَاعِدُونَ‏}‏ وَلَكِنِ امْضِ وَنَحْنُ مَعَكَ‏.‏ فَكَأَنَّهُ سُرِّيَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَرَوَاهُ وَكِيعٌ عَنْ سُفْيَانَ عَنْ مُخَارِقٍ عَنْ طَارِقٍ أَنَّ الْمِقْدَادَ قَالَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏فَاذْهَبْ أَنْتَ وَرَبُّكَ فَقَاتِلاَ إِنَّا هَا هُنَا قَاعِدُونَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’تو تم اور تمہارا رب جاؤ اور تم دونوں لڑو، ہم یہیں بیٹھے ہیں۔‘‘ (V.5:24)",
                "headingEnglish": "The Statement of Allah:\"...So go you and your Lord and fight you two, we are sitting right here.\" (V.5:24)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4389,
                "hadithNumber": "4610",
                "englishNarrator": "Narrated Abu Qilaba:",
                "hadithEnglish": "He was sitting behind `Umar bin `Abdul `Aziz and the people mentioned and mentioned (about at-Qasama) and they said (various things), and said that the Caliphs had permitted it. `Umar bin `Abdul `Aziz turned towards Abu Qilaba who was behind him and said. \"What do you say, O `Abdullah bin Zaid?\" or said, \"What do you say, O Abu Qilaba?\" Abu Qilaba said, \"I do not know that killing a person is lawful in Islam except in three cases: a married person committing illegal sexual intercourse, one who has murdered somebody unlawfully, or one who wages war against Allah and His Apostle.\" 'Anbasa said, \"Anas رضی اللہ عنہ narrated to us such-and-such.\" Abu Qilaba said, \"Anas narrated to me in this concern, saying, some people came to the Prophet (ﷺ) and they spoke to him saying, 'The climate of this land does not suit us.' The Prophet (ﷺ) said, 'These are camels belonging to us, and they are to be taken out to the pasture. So take them out and drink of their milk and urine.' So they took them and set out and drank of their urine and milk, and having recovered, they attacked the shepherd, killed him and drove away the camels.' Why should there be any delay in punishing them as they murdered (a person) and waged war against Allah and His Apostle and frightened Allah's Messenger (ﷺ) ?\" Anbasa said, \"I testify the uniqueness of Allah!\" Abu Qilaba said, \"Do you suspect me?\" 'Anbasa said, \"No, Anas رضی اللہ عنہ narrated that (Hadith) to us.\" Then 'Anbasa added, \"O the people of such-and-such (country), you will remain in good state as long as Allah keeps this (man) and the like of this (man) amongst you.\"",
                "hadithUrdu": "وہ ( امیرالمؤمنین ) عمر بن عبدالعزیز رحمہ اللہ خلیفہ کے پیچھے بیٹھے ہوئے تھے ( مجلس میں قسامت کا ذکر آ گیا ) لوگوں نے کہا کہ قسامت میں قصاص لازم ہو گا۔ آپ سے پہلے خلفاء راشدین نے بھی اس میں قصاص لیا ہے۔ پھر عمر بن عبدالعزیز رحمہ اللہ ابوقلابہ کی طرف متوجہ ہوئے وہ پیچھے بیٹھے ہوئے تھے اور پوچھا: عبداللہ بن زید تمہاری کیا رائے ہے، یا یوں کہا کہ ابوقلابہ! آپ کی کیا رائے ہے؟ میں نے کہا کہ مجھے تو کوئی ایسی صورت معلوم نہیں ہے کہ اسلام میں کسی شخص کا قتل جائز ہو، سوا اس کے کہ کسی نے شادی شدہ ہونے کے باوجود زنا کیا ہو، یا ناحق کسی کو قتل کیا ہو، یا ( پھر ) اللہ اور اس کے رسول سے لڑا ہو ( مرتد ہو گیا ہو ) ۔ اس پر عنبسہ نے کہا کہ ہم سے انس رضی اللہ عنہ نے اس طرح حدیث بیان کی تھی۔ ابوقلابہ بولے کہ مجھ سے بھی انہوں نے یہ حدیث بیان کی تھی۔ بیان کیا کہ کچھ لوگ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور اسلام پر بیعت کرنے کے بعد نبی کریم صلی اللہ علیہ وسلم سے کہا کہ ہمیں اس شہر مدینہ کی آب و ہوا موافق نہیں آئی۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ ہمارے یہ اونٹ چرنے جا رہے ہیں تم بھی ان کے ساتھ چلے جاؤ اور ان کا دودھ اور پیشاب پیو ( کیونکہ ان کے مرض کا یہی علاج تھا ) چنانچہ وہ لوگ ان اونٹوں کے ساتھ چلے گئے اور ان کا دودھ اور پیشاب پیا۔ جس سے انہیں صحت حاصل ہو گئی۔ اس کے بعد انہوں نے ( نبی کریم صلی اللہ علیہ وسلم کے چرواہے ) کو پکڑ کر قتل کر دیا اور اونٹ لے کر بھاگے۔ اب ایسے لوگوں سے بدلہ لینے میں کیا تامل ہو سکتا تھا۔ انہوں نے ایک شخص کو قتل کیا اور اللہ اور اس کے رسول سے لڑے اور نبی کریم صلی اللہ علیہ وسلم کو خوفزدہ کرنا چاہا۔ عنبسہ نے اس پر کہا: سبحان اللہ! میں نے کہا، کیا تم مجھے جھٹلانا چاہتے ہو؟ انہوں نے کہا کہ ( نہیں ) یہی حدیث انس رضی اللہ عنہ نے مجھ سے بھی بیان کی تھی۔ میں نے اس پر تعجب کیا کہ تم کو حدیث خوب یاد رہتی ہے۔ ابوقلابہ نے بیان کیا کہ عنبسہ نے کہا، اے شام والو! جب تک تمہارے یہاں ابوقلابہ یا ان جیسے عالم موجود رہیں گے، تم ہمیشہ اچھے رہو گے۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے محمد بن عبداللہ انصاری نے بیان کیا، کہا ہم سے عبداللہ بن عون نے بیان کیا، کہا کہ مجھ سے سلمان ابورجاء، ابوقلابہ کے غلام نے بیان کیا اور ان سے ابوقلابہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، حَدَّثَنَا ابْنُ عَوْنٍ، قَالَ حَدَّثَنِي سَلْمَانُ أَبُو رَجَاءٍ، مَوْلَى أَبِي قِلاَبَةَ عَنْ أَبِي قِلاَبَةَ، أَنَّهُ كَانَ جَالِسًا خَلْفَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، فَذَكَرُوا وَذَكَرُوا فَقَالُوا وَقَالُوا قَدْ أَقَادَتْ بِهَا الْخُلَفَاءُ، فَالْتَفَتَ إِلَى أَبِي قِلاَبَةَ وَهْوَ خَلْفَ ظَهْرِهِ، فَقَالَ مَا تَقُولُ يَا عَبْدَ اللَّهِ بْنَ زَيْدٍ أَوْ قَالَ مَا تَقُولُ يَا أَبَا قِلاَبَةَ قُلْتُ مَا عَلِمْتُ نَفْسًا حَلَّ قَتْلُهَا فِي الإِسْلاَمِ إِلاَّ رَجُلٌ زَنَى بَعْدَ إِحْصَانٍ، أَوْ قَتَلَ نَفْسًا بِغَيْرِ نَفْسٍ، أَوْ حَارَبَ اللَّهَ وَرَسُولَهُ صلى الله عليه وسلم‏.‏ فَقَالَ عَنْبَسَةُ حَدَّثَنَا أَنَسٌ بِكَذَا وَكَذَا‏.‏ قُلْتُ إِيَّاىَ حَدَّثَ أَنَسٌ قَالَ قَدِمَ قَوْمٌ عَلَى النَّبِيِّ صلى الله عليه وسلم فَكَلَّمُوهُ فَقَالُوا قَدِ اسْتَوْخَمْنَا هَذِهِ الأَرْضَ‏.‏ فَقَالَ ‏ \"‏ هَذِهِ نَعَمٌ لَنَا تَخْرُجُ، فَاخْرُجُوا فِيهَا، فَاشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا ‏\"‏‏.‏ فَخَرَجُوا فِيهَا فَشَرِبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا وَاسْتَصَحُّوا، وَمَالُوا عَلَى الرَّاعِي فَقَتَلُوهُ، وَاطَّرَدُوا النَّعَمَ، فَمَا يُسْتَبْطَأُ مِنْ هَؤُلاَءِ قَتَلُوا النَّفْسَ وَحَارَبُوا اللَّهَ وَرَسُولَهُ، وَخَوَّفُوا رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏ فَقَالَ سُبْحَانَ اللَّهِ‏.‏ فَقُلْتُ تَتَّهِمُنِي قَالَ حَدَّثَنَا بِهَذَا أَنَسٌ‏.‏ قَالَ وَقَالَ يَا أَهْلَ كَذَا إِنَّكُمْ لَنْ تَزَالُوا بِخَيْرٍ مَا أُبْقِيَ هَذَا فِيكُمْ أَوْ مِثْلُ هَذَا‏.‏",
                "headingArabic": "‏{‏إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ وَيَسْعَوْنَ فِي الأَرْضِ فَسَادًا أَنْ يُقَتَّلُوا أَوْ يُصَلَّبُوا‏}‏ إِلَى قَوْلِهِ ‏{‏أَوْ يُنْفَوْا مِنَ الأَرْضِ‏}‏",
                "headingUrdu": "’’جو لوگ اللہ اور اس کے رسول سے جنگ کرتے ہیں اور زمین میں فساد برپا کرتے ہیں ان کی سزا صرف یہ ہے کہ وہ قتل کیے جائیں یا سولی پر چڑھائے جائیں یا ان کے ہاتھ پاؤں مخالف سمت سے کاٹے جائیں‘‘ (آیت 5:33) )",
                "headingEnglish": "\"The recompense of those who wage war against Allah and His Messenger, and do mischief in the land is only that they shall be killed or crucified or their hands and feet be cut off from opposite sides...\" (V.5:33)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4390,
                "hadithNumber": "4611",
                "englishNarrator": "Narrated Anas (bin Malik) رضی اللہ عنہ :",
                "hadithEnglish": "Ar-Rubai (the paternal aunt of Anas bin Malik رضی اللہ عنہ) broke the incisor tooth of young Ansari girl. Her family demanded the Qisas and they came to the Prophet (ﷺ) who passed the judgment of Qisas. Anas bin An-Nadr رضی اللہ عنہ (the paternal uncle of Anas bin Malik رضی اللہ عنہ ) said, \"O Allah's Messenger (ﷺ)! By Allah, her tooth will not be broken.\" The Prophet (ﷺ) said, \"O Anas! (The law prescribed in) Allah's Book is Qisas.\" But the people (i.e. the relatives of the girl) gave up their claim and accepted a compensation. On that Allah's Apostle said, \"Some of Allah's worshippers are such that if they take an oath, Allah will fulfill it for them.\"",
                "hadithUrdu": "ربیع نے جو انس رضی اللہ عنہ کی پھوپھی تھیں، انصار کی ایک لڑکی کے آگے کے دانت توڑ دیئے۔ لڑکی والوں نے قصاص چاہا اور نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے۔ نبی کریم صلی اللہ علیہ وسلم نے بھی قصاص کا حکم دیا۔ انس بن مالک رضی اللہ عنہ کے چچا انس بن نضر رضی اللہ عنہ نے کہا: نہیں اللہ کی قسم! ان کا دانت نہ توڑ ا جائے گا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انس! لیکن کتاب اللہ کا حکم قصاص ہی کا ہے۔ پھر لڑکی والے معافی پر راضی ہو گئے اور دیت لینا منظور کر لیا۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے بہت سے بندے ایسے ہیں کہ اگر وہ اللہ کا نام لے کر قسم کھا لیں تو اللہ ان کی قسم سچی کر دیتا ہے۔",
                "urduNarrator": "مجھ سے محمد بن سلام نے بیان کیا، انہوں نے کہا ہم کو مروان بن معاویہ فزاری نے خبر دی، انہیں حمید طویل نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا الْفَزَارِيُّ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَسَرَتِ الرُّبَيِّعُ ـ وَهْىَ عَمَّةُ أَنَسِ بْنِ مَالِكٍ ـ ثَنِيَّةَ جَارِيَةٍ مِنَ الأَنْصَارِ، فَطَلَبَ الْقَوْمُ الْقِصَاصَ، فَأَتَوُا النَّبِيَّ صلى الله عليه وسلم فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم بِالْقِصَاصِ‏.‏ فَقَالَ أَنَسُ بْنُ النَّضْرِ عَمُّ أَنَسِ بْنِ مَالِكٍ لاَ وَاللَّهِ لاَ تُكْسَرْ سِنُّهَا يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أَنَسُ كِتَابُ اللَّهِ الْقِصَاصُ ‏\"‏‏.‏ فَرَضِيَ الْقَوْمُ وَقَبِلُوا الأَرْشَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَالْجُرُوحَ قِصَاصٌ‏}‏",
                "headingUrdu": "اللہ کا فرمان: \"...اور زخم، برابر کے لیے برابر (A1-قصاص یعنی سزا میں مساوات کا قانون)...\" (V.5:45)",
                "headingEnglish": "Allah's Statement: \"...And wounds, equal for equal (A1-Qisas i.e., the law of equality in punishment)...\" (V.5:45)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4391,
                "hadithNumber": "4612",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Whoever tells that Muhammad concealed part of what was revealed to him, is a liar, for Allah says:-- \"O Apostle (Muhammad)! Proclaim (the Message) which has been sent down to you from your Lord.\" (5.67)",
                "hadithUrdu": "جو شخص بھی تم سے یہ کہتا ہے کہ اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم پر جو کچھ نازل کیا تھا، اس میں سے آپ نے کچھ چھپا لیا تھا، تو وہ جھوٹا ہے۔ اللہ تعالیٰ نے خود فرمایا ہے «يا أيها الرسول بلغ ما أنزل إليك‏» کہ ”اے پیغمبر! جو کچھ آپ پر آپ کے پروردگار کی طرف سے نازل ہوا ہے، یہ ( سب ) آپ ( لوگوں تک ) پہنچا دیں۔“",
                "urduNarrator": "ہم سے محمد بن یوسف فریابی نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے اسماعیل بن ابی خالد نے، ان سے شعبی نے، ان سے مسروق نے کہ ان سے عائشہ رضی اللہ عنہا نے کہا،",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَنْ حَدَّثَكَ أَنَّ مُحَمَّدًا صلى الله عليه وسلم كَتَمَ شَيْئًا مِمَّا أُنْزِلَ عَلَيْهِ، فَقَدْ كَذَبَ، وَاللَّهُ يَقُولُ ‏{‏يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنْزِلَ إِلَيْكَ‏}‏ الآيَةَ‏.‏",
                "headingArabic": "‏{‏يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ‏}‏",
                "headingUrdu": "\"اے رسول (صلی اللہ علیہ وآلہ وسلم) آپ اس (پیغام) کا اعلان کریں جو آپ کے رب کی طرف سے آپ پر نازل کیا گیا ہے ...\" (آیت 5:67)",
                "headingEnglish": "\"O Messenger (Muhammad ﷺ)! Proclaim (the Message) which has been sent down to you from your Lord...\" (V.5:67)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4392,
                "hadithNumber": "4613",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "This Verse: \"Allah will not punish you for what is unintentional in your oaths.\" (5.89) was revealed about a man's state men (during his talk), \"No, by Allah,\" and \"Yes, by Allah.\"",
                "hadithUrdu": "آیت «لا يؤاخذكم الله باللغو في أيمانكم‏» ”اللہ تم سے تمہاری فضول قسموں پر پکڑ نہیں کرتا۔“ کسی کے اس طرح قسم کھانے کے بارے میں نازل ہوئی تھی کہ نہیں، اللہ کی قسم، ہاں اللہ کی قسم!۔",
                "urduNarrator": "ہم سے علی بن سلمہ نے بیان کیا، کہا ہم سے مالک بن سعید نے بیان کیا، کہا ہم سے ہشام نے بیان کیا، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ سَلَمَةَ، حَدَّثَنَا مَالِكُ بْنُ سُعَيْرٍ، حَدَّثَنَا هِشَامٌ، عَنِ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أُنْزِلَتْ هَذِهِ الآيَةُ ‏{‏لاَ يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ‏}‏ فِي قَوْلِ الرَّجُلِ لاَ وَاللَّهِ، وَبَلَى وَاللَّهِ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏لاَ يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اللہ تمہیں تمہاری غیر ارادی قسموں کی سزا نہیں دے گا‘‘ (V.5:89)",
                "headingEnglish": "Allah's Statement: \"Allah will not punish you for what is unintentional in your oaths...\" (V.5:89)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4393,
                "hadithNumber": "4614",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Her father (Abu Bakr رضی اللہ عنہ) never broke his oath till Allah revealed the order of the legal expiation for oath. Abu Bakr رضی اللہ عنہ said, \"If I ever take an oath (to do something) and later find that to do something else is better, then I accept Allah's permission and do that which is better, (and do the legal expiation for my oath ) \".",
                "hadithUrdu": "ان کے والد ابوبکر صدیق رضی اللہ عنہ اپنی قسم کے خلاف کبھی نہیں کیا کرتے تھے۔ لیکن جب اللہ تعالیٰ نے قسم کے کفارہ کا حکم نازل کر دیا تو ابوبکر رضی اللہ عنہ نے کہا کہ اب اگر اس کے ( یعنی جس کے لیے قسم کھا رکھی تھی ) سوا دوسری چیز مجھے اس سے بہتر معلوم ہوتی ہے تو میں اللہ تعالیٰ کی دی ہوئی رخصت پر عمل کرتا ہوں اور وہی کام کرتا ہوں جو بہتر ہوتا ہے۔",
                "urduNarrator": "ہم سے احمد بن ابی رجاء نے بیان کیا، کہا ہم سے نضر بن شمیل نے بیان کیا، ان سے ہشام بن عروہ نے بیان کیا، کہا مجھ کو میرے والد نے خبر دی اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا النَّضْرُ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ أَبَاهَا، كَانَ لاَ يَحْنَثُ فِي يَمِينٍ حَتَّى أَنْزَلَ اللَّهُ كَفَّارَةَ الْيَمِينِ‏.‏ قَالَ أَبُو بَكْرٍ لاَ أَرَى يَمِينًا أُرَى غَيْرَهَا خَيْرًا مِنْهَا، إِلاَّ قَبِلْتُ رُخْصَةَ اللَّهِ، وَفَعَلْتُ الَّذِي هُوَ خَيْرٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4394,
                "hadithNumber": "4615",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "We used to participate in the holy wars carried on by the Prophet (ﷺ) and we had no women (wives) with us. So we said (to the Prophet (ﷺ) ). \"Shall we castrate ourselves?\" But the Prophet (ﷺ) forbade us to do that and thenceforth he allowed us to marry a woman (temporarily) by giving her even a garment, and then he recited: \"O you who believe! Do not make unlawful the good things which Allah has made lawful for you.\"",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہو کر جہاد کیا کرتے تھے اور ہمارے ساتھ ہماری بیویاں نہیں ہوتی تھیں۔ اس پر ہم نے عرض کیا کہ ہم اپنے آپ کو خصی کیوں نہ کر لیں۔ لیکن نبی کریم صلی اللہ علیہ وسلم نے ہمیں اس سے روک دیا اور اس کے بعد ہمیں اس کی اجازت دی کہ ہم کسی عورت سے کپڑے ( یا کسی بھی چیز ) کے بدلے میں نکاح کر سکتے ہیں۔ پھر عبداللہ رضی اللہ عنہ نے یہ آیت پڑھی «يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم» ”اے ایمان والو! اپنے اوپر ان پاکیزہ چیزوں کو حرام نہ کرو جو اللہ نے تمہارے لیے جائز کی ہیں۔“",
                "urduNarrator": "ہم سے عمرو بن عون نے بیان کیا، کہا ہم سے خالد بن عبداللہ طحان نے بیان کیا، ان سے اسماعیل بن ابی خالد نے، ان سے قیس بن ابی حازم نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا خَالِدٌ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ عَبْدِ اللَّهِ، رضى الله عنه قَالَ كُنَّا نَغْزُو مَعَ النَّبِيِّ صلى الله عليه وسلم وَلَيْسَ مَعَنَا نِسَاءٌ فَقُلْنَا أَلاَ نَخْتَصِي فَنَهَانَا عَنْ ذَلِكَ، فَرَخَّصَ لَنَا بَعْدَ ذَلِكَ أَنْ نَتَزَوَّجَ الْمَرْأَةَ بِالثَّوْبِ، ثُمَّ قَرَأَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تُحَرِّمُوا طَيِّبَاتِ مَا أَحَلَّ اللَّهُ لَكُمْ ‏}‏",
                "headingArabic": "‏{‏لاَ تُحَرِّمُوا طَيِّبَاتِ مَا أَحَلَّ اللَّهُ لَكُمْ‏}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"اے ایمان والو! طیبات کو حرام نہ کرو جو اللہ نے تمہارے لیے حلال کیا ہے۔\" (آیت 5:87) )",
                "headingEnglish": "The Statement of Allah: \"O you who believe! Make not unlawful the Tayyibãt (all that is good as regards foods, things, deeds, beliefs, persons) which Allah has made lawful to you...\" (V.5:87)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4395,
                "hadithNumber": "4616",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "(The Verse of) prohibiting alcoholic drinks was revealed when there were in Medina five kinds of (alcoholic) drinks none of which was produced from grapes.",
                "hadithUrdu": "جب شراب کی حرمت نازل ہوئی تو مدینہ میں اس وقت پانچ قسم کی شراب استعمال ہوتی تھی۔ لیکن انگوری شراب کا استعمال نہیں ہوتا تھا ( بہرحال وہ بھی حرام قرار پائی ) ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا ہم کو محمد بن بشر نے خبر دی، ان سے عبدالعزیز بن عمر بن عبدالعزیز نے بیان کیا، کہا کہ مجھ سے نافع نے بیان کیا اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَزَلَ تَحْرِيمُ الْخَمْرِ وَإِنَّ فِي الْمَدِينَةِ يَوْمَئِذٍ لَخَمْسَةَ أَشْرِبَةٍ، مَا فِيهَا شَرَابُ الْعِنَبِ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏إِنَّمَا الْخَمْرُ وَالْمَيْسِرُ وَالأَنْصَابُ وَالأَزْلاَمُ رِجْسٌ مِنْ عَمَلِ الشَّيْطَانِ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"نشہ آور چیزیں (ہر قسم کی شراب)، جوا، الانساب اور العظیم (قسمت کے حصول یا فیصلہ کے لیے تیر) شیطان کا مکروہ کام ہے...\" (آیت 5:90)",
                "headingEnglish": "Allah's Statement: \"Intoxicants (all kinds of alcoholic drinks), gambling, Al-Ansab and Al-AzIam (arrows for seeking luck or a decision) are an abomination of Satan's handiwork...\" (V.5:90)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4396,
                "hadithNumber": "4617",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "We had no alcoholic drink except that which was produced from dates and which you call Fadikh. While I was standing offering drinks to Abu Talha رضی اللہ عنہ and so-and-so and so-and-so, a man cam and said, \"Has the news reached you? They said, \"What is that?\" He said. \"Alcoholic drinks have been prohibited. They said, \"Spill (the contents of these pots, O Anas! \"Then they neither asked about it (alcoholic drinks) nor returned it after the news from that man.",
                "hadithUrdu": "ہم لوگ تمہاری «فضيخ» ( کھجور سے بنائی ہوئی شراب ) کے سوا اور کوئی شراب استعمال نہیں کرتے تھے، یہی جس کا نام تم نے «فضيخ» رکھ رکھا ہے۔ میں کھڑا ابوطلحہ رضی اللہ عنہ کو پلا رہا تھا اور فلاں اور فلاں کو، کہ ایک صاحب آئے اور کہا: تمہیں کچھ خبر بھی ہے؟ لوگوں نے پوچھا کیا بات ہے؟ انہوں نے بتایا کہ شراب حرام قرار دی جا چکی ہے۔ فوراً ہی ان لوگوں نے کہا: انس رضی اللہ عنہ اب ان شراب کے مٹکوں کو بہا دو۔ انہوں نے بیان کیا کہ ان کی اطلاع کے بعد ان لوگوں نے اس میں سے ایک قطرہ بھی نہ مانگا اور نہ پھر اس کا استعمال کیا۔",
                "urduNarrator": "ہم سے یعقوب بن ابراہیم نے بیان کیا، کہا ہم سے ابن علیہ نے بیان کیا، کہا ہم سے عبدالعزیز بن صہیب نے بیان کیا، کہا کہ مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، قَالَ قَالَ أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ مَا كَانَ لَنَا خَمْرٌ غَيْرُ فَضِيخِكُمْ هَذَا الَّذِي تُسَمُّونَهُ الْفَضِيخَ‏.‏ فَإِنِّي لَقَائِمٌ أَسْقِي أَبَا طَلْحَةَ وَفُلاَنًا وَفُلاَنًا إِذْ جَاءَ رَجُلٌ فَقَالَ وَهَلْ بَلَغَكُمُ الْخَبَرُ فَقَالُوا وَمَا ذَاكَ قَالَ حُرِّمَتِ الْخَمْرُ‏.‏ قَالُوا أَهْرِقْ هَذِهِ الْقِلاَلَ يَا أَنَسُ‏.‏ قَالَ فَمَا سَأَلُوا عَنْهَا وَلاَ رَاجَعُوهَا بَعْدَ خَبَرِ الرَّجُلِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4397,
                "hadithNumber": "4618",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "Some people drank alcoholic beverages in the morning (of the day) of the Uhud battle and on the same day they were killed as martyrs, and that was before wine was prohibited.",
                "hadithUrdu": "غزوہ احد میں بہت سے صحابہ رضی اللہ عنہم نے صبح صبح شراب پی تھی اور اسی دن وہ سب شہید کر دیئے گئے تھے۔ اس وقت شراب حرام نہیں ہوئی تھی ( اس لیے وہ گنہگار نہیں ٹھہرے ) ۔",
                "urduNarrator": "ہم سے صدقہ بن فضل نے بیان کیا، کہا ہم کو ابن عیینہ نے خبر دی، انہیں عمرو نے اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ جَابِرٍ، قَالَ صَبَّحَ أُنَاسٌ غَدَاةَ أُحُدٍ الْخَمْرَ فَقُتِلُوا مِنْ يَوْمِهِمْ جَمِيعًا شُهَدَاءَ، وَذَلِكَ قَبْلَ تَحْرِيمِهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4398,
                "hadithNumber": "4619",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I heard `Umar رضی اللہ عنہ while he was on the pulpit of the Prophet (ﷺ) saying, \"Now then O people! The revelation about the prohibition of alcoholic drinks was revealed; and alcoholic drinks are extracted from five things: Grapes, dates, honey, wheat and barley. And the alcoholic drink is that which confuses and stupefies the mind.\"",
                "hadithUrdu": "میں نے عمر رضی اللہ عنہ سے سنا، وہ نبی کریم صلی اللہ علیہ وسلم کے منبر پر کھڑے فرما رہے تھے۔ امابعد! اے لوگو! جب شراب کی حرمت نازل ہوئی تو وہ پانچ چیزوں سے تیار کی جاتی تھی۔ انگور، کھجور، شہد، گیہوں اور جَو سے اور شراب ہر وہ پینے کی چیز ہے جو عقل کو زائل کر دے۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم حنظلی نے بیان کیا، انہوں نے کہا ہم کو عیسیٰ اور ابن ادریس نے خبر دی، انہیں ابوحیان نے، انہیں شعبی نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا عِيسَى، وَابْنُ، إِدْرِيسَ عَنْ أَبِي حَيَّانَ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عُمَرَ، قَالَ سَمِعْتُ عُمَرَ ـ رضى الله عنه ـ عَلَى مِنْبَرِ النَّبِيِّ صلى الله عليه وسلم يَقُولُ أَمَّا بَعْدُ أَيُّهَا النَّاسُ إِنَّهُ نَزَلَ تَحْرِيمُ الْخَمْرِ وَهْىَ مِنْ خَمْسَةٍ، مِنَ الْعِنَبِ وَالتَّمْرِ وَالْعَسَلِ وَالْحِنْطَةِ وَالشَّعِيرِ، وَالْخَمْرُ مَا خَامَرَ الْعَقْلَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4399,
                "hadithNumber": "4620",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The alcoholic drink which was spilled was Al-Fadikh. I used to offer alcoholic drinks to the people at the residence of Abu Talha رضی اللہ عنہ . Then the order of prohibiting Alcoholic drinks was revealed, and the Prophet ordered somebody to announce that: Abu Talha رضی اللہ عنہ said to me, \"Go out and see what this voice (this announcement ) is.\" I went out and (on coming back) said, \"This is somebody announcing that alcoholic beverages have been prohibited.\" Abu Talha رضی اللہ عنہ said to me, \"Go and spill it (i.e. the wine),\" Then it (alcoholic drinks) was seen flowing through the streets of Medina. At that time the wine was Al-Fadikh. The people said, \"Some people (Muslims) were killed (during the battle of Uhud) while wine was in their stomachs.\" So Allah revealed: \"On those who believe and do good deeds there is no blame for what they ate (in the past).\" (5.93)",
                "hadithUrdu": "( حرمت نازل ہونے کے بعد ) جو شراب بہائی گئی تھی وہ «فضيخ‏.‏» کی تھی۔ امام بخاری رحمہ اللہ نے بیان کیا کہ مجھ سے محمد نے ابوالنعمان سے اس زیادتی کے ساتھ بیان کیا کہ انس رضی اللہ عنہ نے کہا: میں صحابہ کی ایک جماعت کو ابوطلحہ رضی اللہ عنہ کے گھر شراب پلا رہا تھا کہ شراب کی حرمت نازل ہوئی۔ نبی کریم صلی اللہ علیہ وسلم نے منادی کو حکم دیا اور انہوں نے اعلان کرنا شروع کیا۔ ابوطلحہ رضی اللہ عنہ نے کہا: باہر جا کے دیکھو یہ آواز کیسی ہے۔ بیان کیا کہ میں باہر آیا اور کہا کہ ایک منادی اعلان کر رہا ہے کہ ”خبردار ہو جاؤ، شراب حرام ہو گئی ہے۔“ یہ سنتے ہی انہوں نے مجھ کو کہا کہ جاؤ اور شراب بہا دو۔ راوی نے بیان کیا، مدینہ کی گلیوں میں شراب بہنے لگی۔ راوی نے بیان کیا کہ ان دنوں «فضيخ‏.‏» شراب استعمال ہوتی تھی۔ بعض لوگوں نے شراب کو جو اس طرح بہتے دیکھا تو کہنے لگے معلوم ہوتا ہے کہ کچھ لوگوں نے شراب سے اپنا پیٹ بھر رکھا تھا اور اسی حالت میں انہیں قتل کر دیا گیا ہے۔ بیان کیا کہ پھر اللہ تعالیٰ نے یہ آیت نازل کی «ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا‏» ”جو لوگ ایمان رکھتے ہیں اور نیک کام کرتے رہتے ہیں، ان پر اس چیز میں کوئی گناہ نہیں جس کو انہوں نے کھا لیا۔“",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، کہا ہم سے ثابت نے، ان سے انس بن مالک  رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ الْخَمْرَ، الَّتِي أُهْرِيقَتِ الْفَضِيخُ‏.‏ وَزَادَنِي مُحَمَّدٌ عَنْ أَبِي النُّعْمَانِ قَالَ كُنْتُ سَاقِيَ الْقَوْمِ فِي مَنْزِلِ أَبِي طَلْحَةَ فَنَزَلَ تَحْرِيمُ الْخَمْرِ، فَأَمَرَ مُنَادِيًا فَنَادَى‏.‏ فَقَالَ أَبُو طَلْحَةَ اخْرُجْ فَانْظُرْ مَا هَذَا الصَّوْتُ قَالَ فَخَرَجْتُ فَقُلْتُ هَذَا مُنَادٍ يُنَادِي أَلاَ إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ‏.‏ فَقَالَ لِي اذْهَبْ فَأَهْرِقْهَا‏.‏ قَالَ فَجَرَتْ فِي سِكَكِ الْمَدِينَةِ‏.‏ قَالَ وَكَانَتْ خَمْرُهُمْ يَوْمَئِذٍ الْفَضِيخَ فَقَالَ بَعْضُ الْقَوْمِ قُتِلَ قَوْمٌ وَهْىَ فِي بُطُونِهِمْ قَالَ فَأَنْزَلَ اللَّهُ ‏{‏لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ فِيمَا طَعِمُوا‏}‏‏.‏",
                "headingArabic": "‏{‏لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ فِيمَا طَعِمُوا‏}‏ إِلَى قَوْلِهِ ‏{‏وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ‏}‏",
                "headingUrdu": "\"جو لوگ ایمان لائے اور نیک عمل کرتے رہے، ان پر اس چیز کا کوئی گناہ نہیں جو انہوں نے (ماضی میں) کھایا...\" (5:93)",
                "headingEnglish": "\"Those who believe and do righteous good deeds, there is no sin on them for what they ate (in the past)...\" (V.5:93)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4400,
                "hadithNumber": "4621",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) delivered a sermon the like of which I had never heard before. He said, \"If you but knew what I know then you would have laughed little and wept much.\" On hearing that, the companions of the Prophet (ﷺ) covered their faces and the sound of their weeping was heard. A man said, \"Who is my father?\" The Prophet (ﷺ) said, \"So-and-so.\" So this Verse was revealed: \"Ask not about things which, if made plain to you, may cause you trouble.\" (5.101) Nadr and Rauh bin Obadah have also reported it from Shobah.",
                "hadithUrdu": "ایک مرتبہ رسول اللہ صلی اللہ علیہ وسلم نے ایسا خطبہ دیا کہ میں نے ویسا خطبہ کبھی نہیں سنا تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا جو کچھ میں جانتا ہوں اگر تمہیں بھی معلوم ہوتا تو تم ہنستے کم اور روتے زیادہ۔ بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم کے صحابہ رضی اللہ عنہم نے اپنے چہرے چھپا لیے، باوجود ضبط کے ان کے رونے کی آواز سنائی دے رہی تھی۔ ایک صحابی نے اس موقع پر پوچھا: میرے والد کون ہیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ فلاں۔ اس پر یہ آیت نازل ہوئی «لا تسألوا عن أشياء إن تبد لكم تسؤكم‏» کہ ”ایسی باتیں مت پوچھو کہ اگر تم پر ظاہر کر دی جائیں تو تمہیں ناگوار گزریں۔“ اس کی روایت نضر اور روح بن عبادہ نے شعبہ سے کی ہے۔",
                "urduNarrator": "ہم سے منذر بن ولید بن عبدالرحمٰن جارودی نے بیان کیا، کہا ہم سے ہمارے والد نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے موسیٰ بن انس نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُنْذِرُ بْنُ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ الْجَارُودِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ مُوسَى بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم خُطْبَةً مَا سَمِعْتُ مِثْلَهَا قَطُّ، قَالَ ‏\"‏ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلاً وَلَبَكَيْتُمْ كَثِيرًا ‏\"‏‏.‏ قَالَ فَغَطَّى أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم وُجُوهَهُمْ لَهُمْ خَنِينٌ، فَقَالَ رَجُلٌ مَنْ أَبِي قَالَ فُلاَنٌ فَنَزَلَتْ هَذِهِ الآيَةُ ‏{‏لاَ تَسْأَلُوا عَنْ أَشْيَاءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ‏}‏‏.‏ رَوَاهُ النَّضْرُ وَرَوْحُ بْنُ عُبَادَةَ عَنْ شُعْبَةَ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏لاَ تَسْأَلُوا عَنْ أَشْيَاءَ، إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"... ایسی چیزوں کے بارے میں مت پوچھو جو اگر تم پر واضح کر دی جائیں تو تمہیں پریشانی کا باعث بنیں\" (V.5:101)",
                "headingEnglish": "Allah's Statement: \"...Ask not about things which, if made plain to you, may cause you trouble...\" (V.5:101)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4401,
                "hadithNumber": "4622",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Some people were asking Allah's Messenger (ﷺ) questions mockingly. A man would say, \"Who is my father?\" Another man whose she-camel had gone astray would say, \"Where is my she-camel? \"So Allah revealed this Verse in this connection: \"O you who believe! Ask not about things which, if made plain to you, may cause you trouble.\" (5.101)",
                "hadithUrdu": "بعض لوگ رسول اللہ صلی اللہ علیہ وسلم سے مذاقاً سوالات کیا کرتے تھے۔ کوئی شخص یوں پوچھتا کہ میرا باپ کون ہے؟ کسی کی اگر اونٹنی گم ہو جاتی تو وہ یہ پوچھتے کہ میری اونٹنی کہاں ہو گی؟ ایسے ہی لوگوں کے لیے اللہ تعالیٰ نے یہ آیت نازل کی «يا أيها الذين آمنوا لا تسألوا عن أشياء إن تبد لكم تسؤكم‏» کہ ”اے ایمان والو! ایسی باتیں مت پوچھو کہ اگر تم پر ظاہر کر دی جائیں تو تمہیں ناگوار گزرے۔“ یہاں تک کہ پوری آیت پڑھ کر سنائی۔",
                "urduNarrator": "ہم سے فضل بن سہل نے بیان کیا، کہا ہم سے ابوالنضر نے بیان کیا، کہا ہم سے ابوخیثمہ نے بیان کیا، ان سے ابوجویریہ نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْفَضْلُ بْنُ سَهْلٍ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا أَبُو خَيْثَمَةَ، حَدَّثَنَا أَبُو الْجُوَيْرِيَةِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ قَوْمٌ يَسْأَلُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتِهْزَاءً، فَيَقُولُ الرَّجُلُ مَنْ أَبِي وَيَقُولُ الرَّجُلُ تَضِلُّ نَاقَتُهُ أَيْنَ نَاقَتِي فَأَنْزَلَ اللَّهُ فِيهِمْ هَذِهِ الآيَةَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَسْأَلُوا عَنْ أَشْيَاءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ‏}‏ حَتَّى فَرَغَ مِنَ الآيَةِ كُلِّهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4402,
                "hadithNumber": "4623",
                "englishNarrator": "Narrated Sa`id bin Al-Musaiyab:",
                "hadithEnglish": "Bahira is a she-camel whose milk is kept for the idols and nobody is allowed to milk it; Sa'iba was the she-camel which they used to set free for their gods and nothing was allowed to be carried on it. Abu Huraira رضی اللہ عنہ said: Allah's Messenger (ﷺ) said, \"I saw `Amr bin 'Amir Al-Khuza`i (in a dream) dragging his intestines in the Fire, and he was the first person to establish the tradition of setting free the animals (for the sake of their deities),\" Wasila is the she-camel which gives birth to a she-camel as its first delivery, and then gives birth to another she-camel as its second delivery. People (in the Pre-lslamic periods of ignorance) used to let that she camel loose for their idols if it gave birth to two she-camels successively without giving birth to a male camel in between. 'Ham' was the male camel which was used for copulation. When it had finished the number of copulations assigned for it, they would let it loose for their idols and excuse it from burdens so that nothing would be carried on it, and they called it the 'Hami.' Abdul yaman, Shoaib, Zuhri, Saeed bin Mosayyab, Hadrat Abu Huraira رضی اللہ عنہ said, \"I heard the Prophet (ﷺ) saying so.\" Ibn-e-Haad, Ibn-e-Shihab, Saeed, Hadrat Abu Hurairah رضی اللہ عنہ say that they heard from the prophet ﷺ.",
                "hadithUrdu": "«بحيرة» اس اونٹنی کو کہتے تھے جس کا دودھ بتوں کے لیے روک دیا جاتا اور کوئی شخص اس کے دودھ کو دوہنے کا مجاز نہ سمجھا جاتا اور «سائبة» اس اونٹنی کو کہتے تھے جسے وہ اپنے دیوتاؤں کے نام پر آزاد چھوڑ دیتے اور اس سے باربرداری و سواری وغیرہ کا کام نہ لیتے۔ سعید راوی نے بیان کیا کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے عمرو بن عامر خزاعی کو دیکھا کہ وہ اپنی آنتوں کو جہنم میں گھسیٹ رہا تھا، اس نے سب سے پہلے سانڈ چھوڑنے کی رسم نکالی تھی۔ اور «وصيلة» اس جوان اونٹنی کو کہتے تھے جو پہلی مرتبہ مادہ بچہ جنتی اور پھر دوسری مرتبہ بھی مادہ ہی جنتی، اسے بھی وہ بتوں کے نام پر چھوڑ دیتے تھے لیکن اسی صورت میں جبکہ وہ برابر دو مرتبہ مادہ بچہ جنتی اور اس درمیان میں کوئی نر بچہ نہ ہوتا۔ اور «حام» وہ نر اونٹ جو مادہ پر شمار سے کئی دفعہ چڑھتا ( اس کے نطفے سے دس بچے پیدا ہو جاتے ) جب وہ اتنی صحبتیں کر چکتا تو اس کو بھی بتوں کے نام پر چھوڑ دیتے اور بوجھ لادنے سے معاف کر دیتے ( نہ سواری کرتے ) اس کا نام «حام» رکھتے اور ابوالیمان ( حکم بن نافع ) نے کہا ہم کو شعیب نے خبر دی، انہوں نے زہری سے سنا، کہا میں نے سعید بن مسیب سے یہی حدیث سنی جو اوپر گزری۔ سعید نے کہا ابوہریرہ رضی اللہ عنہ نے کہا میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ( وہی عمرو بن عامر خزاعی کا قصہ جو اوپر گزرا ) اور یزید بن عبداللہ بن ہاد نے بھی اس حدیث کو ابن شہاب سے روایت کیا۔ انہوں نے سعید بن مسیب سے، انہوں نے ابوہریرہ رضی اللہ عنہ سے، کہا میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے صالح بن کیسان نے، ان سے ابن شہاب نے اور ان سے سعید بن مسیب نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ الْبَحِيرَةُ الَّتِي يُمْنَعُ دَرُّهَا لِلطَّوَاغِيتِ فَلاَ يَحْلُبُهَا أَحَدٌ مِنَ النَّاسِ‏.‏ وَالسَّائِبَةُ كَانُوا يُسَيِّبُونَهَا لآلِهَتِهِمْ لاَ يُحْمَلُ عَلَيْهَا شَىْءٌ‏.‏ قَالَ وَقَالَ أَبُو هُرَيْرَةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ رَأَيْتُ عَمْرَو بْنَ عَامِرٍ الْخُزَاعِيَّ يَجُرُّ قُصْبَهُ فِي النَّارِ، كَانَ أَوَّلَ مَنْ سَيَّبَ السَّوَائِبَ ‏\"‏‏.‏ وَالْوَصِيلَةُ النَّاقَةُ الْبِكْرُ تُبَكِّرُ فِي أَوَّلِ نِتَاجِ الإِبِلِ، ثُمَّ تُثَنِّي بَعْدُ بِأُنْثَى‏.‏ وَكَانُوا يُسَيِّبُونَهُمْ لِطَوَاغِيتِهِمْ إِنْ وَصَلَتْ إِحْدَاهُمَا بِالأُخْرَى لَيْسَ بَيْنَهُمَا ذَكَرٌ‏.‏ وَالْحَامِ فَحْلُ الإِبِلِ يَضْرِبُ الضِّرَابَ الْمَعْدُودَ، فَإِذَا قَضَى ضِرَابَهُ وَدَعُوهُ لِلطَّوَاغِيتِ وَأَعْفَوْهُ مِنَ الْحَمْلِ فَلَمْ يُحْمَلْ عَلَيْهِ شَىْءٌ وَسَمَّوْهُ الْحَامِيَ‏.‏ وَقَالَ لي أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، سَمِعْتُ سَعِيدًا، قَالَ يُخْبِرُهُ بِهَذَا قَالَ وَقَالَ أَبُو هُرَيْرَةَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم نَحْوَهُ‏.‏ وَرَوَاهُ ابْنُ الْهَادِ عَنِ ابْنِ شِهَابٍ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "‏{‏مَا جَعَلَ اللَّهُ مِنْ بَحِيرَةٍ وَلاَ سَائِبَةٍ وَلاَ وَصِيلَةٍ وَلاَ حَامٍ‏}‏",
                "headingUrdu": "’’اللہ نے بحیرہ یا سائبہ، وصیلہ یا حام جیسی چیزیں قائم نہیں کیں۔‘‘ (آیت 5:103)",
                "headingEnglish": "'Allah has not instituted things like Bahirah or a Sã'ibah, or a Wasilah or a Ham...\" (V.5:103)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4376,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=175",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=173",
                "label": "173",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=174",
                "label": "174",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=175",
                "label": "175",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=176",
                "label": "176",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=177",
                "label": "177",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=178",
                "label": "178",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=179",
                "label": "179",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=177",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=177",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=175",
        "to": 4400,
        "total": 40465
    }
}