{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 19,
        "data": [
            {
                "id": 451,
                "hadithNumber": "460",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "\"A man or a woman used to clean the mosque.\" (A sub-narrator said, 'Most probably a woman..') Then he narrated the Hadith of the Prophet",
                "hadithUrdu": "ایک عورت یا مرد مسجد میں جھاڑو دیا کرتا تھا ۔ ابورافع نے کہا ، میرا خیال ہے کہ وہ عورت ہی تھی ۔ پھر انھوں نے نبی کریم صلی اللہ علیہ وسلم کی حدیث نقل کی کہ آپ صلی اللہ علیہ وسلم نے اس کی قبر پر نماز پڑھی ۔",
                "urduNarrator": "ہم سے احمد بن واقد نے بیان کیا کہ ، کہا ہم سے حماد بن زید نے ثابت بنانی کے واسطہ سے ، انھوں نے ابورافع سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ وَاقِدٍ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ امْرَأَةً ـ أَوْ رَجُلاً ـ كَانَتْ تَقُمُّ الْمَسْجِدَ ـ وَلاَ أُرَاهُ إِلاَّ امْرَأَةً ـ فَذَكَرَ حَدِيثَ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ صَلَّى عَلَى قَبْرِهِ‏.‏",
                "headingArabic": "الْخَدَمِ لِلْمَسْجِدِ",
                "headingUrdu": "مسجد کے خادم",
                "headingEnglish": "Servants for the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 452,
                "hadithNumber": "461",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "\"The Prophet (ﷺ) said, \"Last night a big demon (afreet) from the Jinns came to me and wanted to interrupt my prayers (or said something similar) but Allah enabled me to overpower him. I wanted to fasten him to one of the pillars of the mosque so that all of you could See him in the morning but I remembered the statement of my brother Solomon (as stated in Quran): My Lord! Forgive me and bestow on me a kingdom such as shall not belong to anybody after me (38.35).\" The sub narrator Rauh said, \"He (the demon) was dismissed humiliated.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ گذشتہ رات ایک سرکش جن اچانک میرے پاس آیا ۔ یا اسی طرح کی کوئی بات آپ نے فرمائی ، وہ میری نماز میں خلل ڈالنا چاہتا تھا ۔ لیکن اللہ تبارک و تعالیٰ نے مجھے اس پر قابو دے دیا اور میں نے سوچا کہ مسجد کے کسی ستون کے ساتھ اسے باندھ دوں تاکہ صبح کو تم سب بھی اسے دیکھو ۔ پھر مجھے اپنے بھائی سلیمان کی یہ دعا یاد آ گئی ( جو سورۃ ص میں ہے ) ’’ اے میرے رب ! مجھے ایسا ملک عطا کرنا جو میرے بعد کسی کو حاصل نہ ہو ‘‘ ۔ راوی حدیث روح نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے اس شیطان کو ذلیل کر کے دھتکار دیا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، انھوں نے کہا ہم سے روح بن عبادہ اور محمد بن جعفر نے شعبہ کے واسطہ سے بیان کیا ، انھوں نے محمد بن زیاد سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے انھوں نے نبی کریم صلی اللہ علیہ وسلم سے",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَخْبَرَنَا رَوْحٌ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ عِفْرِيتًا مِنَ الْجِنِّ تَفَلَّتَ عَلَىَّ الْبَارِحَةَ ـ أَوْ كَلِمَةً نَحْوَهَا ـ لِيَقْطَعَ عَلَىَّ الصَّلاَةَ، فَأَمْكَنَنِي اللَّهُ مِنْهُ، فَأَرَدْتُ أَنْ أَرْبِطَهُ إِلَى سَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ، حَتَّى تُصْبِحُوا وَتَنْظُرُوا إِلَيْهِ كُلُّكُمْ، فَذَكَرْتُ قَوْلَ أَخِي سُلَيْمَانَ رَبِّ هَبْ لِي مُلْكًا لاَ يَنْبَغِي لأَحَدٍ مِنْ بَعْدِي ‏\"‏‏.‏ قَالَ رَوْحٌ فَرَدَّهُ خَاسِئًا‏.‏",
                "headingArabic": "الأَسِيرِ أَوِ الْغَرِيمِ يُرْبَطُ فِي الْمَسْجِدِ",
                "headingUrdu": "قیدی یا مقروض کو مسجد میں باندھنا",
                "headingEnglish": "To fasten a prisoner or a debtor in the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 453,
                "hadithNumber": "462",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) sent some horsemen to Najd and they brought a man called Thumama bin Uthal from Bani Hanifa. They fastened him to one of the pillars of the mosque. The Prophet (ﷺ) came and ordered them to release him. He went to a (garden of) date-palms near the mosque, took a bath and entered the mosque again and said, \"None has the right to be worshipped but Allah and Muhammad is His Apostle\" (i.e. he embraced Islam).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کچھ سوار نجد کی طرف بھیجے ( جو تعداد میں تیس تھے ) یہ لوگ بنو حنیفہ کے ایک شخص کو جس کا نام ثمامہ بن اثال تھا پکڑ کر لائے ۔ انھوں نے اسے مسجد کے ایک ستون میں باندھ دیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ۔ اور ( تیسرے روز ثمامہ کی نیک طبیعت دیکھ کر ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ ثمامہ کو چھوڑ دو ۔ ( رہائی کے بعد ) وہ مسجدنبوی سے قریب ایک کھجور کے باغ تک گئے ۔ اور وہاں غسل کیا ۔ پھر مسجد میں داخل ہوئے اور کہا «أشهد أن لا إله إلا الله وأن محمدا رسول الله‏» میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں اور یہ کہ محمد اللہ کے سچے رسول ہیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، انھوں نے کہا مجھ سے سعید بن ابی سعید مقبری نے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي سَعِيدٍ، سَمِعَ أَبَا هُرَيْرَةَ، قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم خَيْلاً قِبَلَ نَجْدٍ، فَجَاءَتْ بِرَجُلٍ مِنْ بَنِي حَنِيفَةَ يُقَالُ لَهُ ثُمَامَةُ بْنُ أُثَالٍ، فَرَبَطُوهُ بِسَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ، فَخَرَجَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ أَطْلِقُوا ثُمَامَةَ ‏\"‏‏.‏ فَانْطَلَقَ إِلَى نَخْلٍ قَرِيبٍ مِنَ الْمَسْجِدِ، فَاغْتَسَلَ ثُمَّ دَخَلَ الْمَسْجِدَ فَقَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ‏.‏",
                "headingArabic": "الاِغْتِسَالِ إِذَا أَسْلَمَ، وَرَبْطِ الأَسِيرِ أَيْضًا فِي الْمَسْجِدِ",
                "headingUrdu": "اسلام قبول کرنے پر غسل کرنا اور قیدی کو مسجد میں باندھنا",
                "headingEnglish": "To take a bath on embracing Islam and fasten a prisoner in the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 454,
                "hadithNumber": "463",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "On the day of Al-Khandaq (battle of the Trench), the medial arm vein of (Sa`d bin Mu`ad رضی اللہ عنہ) was injured and the Prophet (ﷺ) pitched a tent in the mosque to look after him. There was another tent for Banu Ghaffar in the mosque and the blood started flowing from Sa`d's tent to the tent of Bani Ghaffar. They shouted, \"O occupants of the tent! What is coming from you to us?\" They found that Sa`d' wound was bleeding profusely and Sa`d died in his tent.",
                "hadithUrdu": "غزوہ خندق میں سعد ( رضی اللہ عنہ ) کے بازو کی ایک رگ ( اکحل ) میں زخم آیا تھا ۔ ان کے لیے نبی کریم صلی اللہ علیہ وسلم نے مسجد میں ایک خیمہ نصب کرا دیا تاکہ آپ قریب رہ کر ان کی دیکھ بھال کیا کریں ۔ مسجد ہی میں بنی غفار کے لوگوں کا بھی ایک خیمہ تھا ۔ سعد رضی اللہ عنہ کے زخم کا خون ( جو رگ سے بکثرت نکل رہا تھا ) بہہ کر جب ان کے خیمہ تک پہنچا تو وہ ڈر گئے ۔ انھوں نے کہا کہ اے خیمہ والو ! تمہاری طرف سے یہ کیسا خون ہمارے خیمہ تک آ رہا ہے ۔ پھر انہیں معلوم ہوا کہ یہ خون سعد رضی اللہ عنہ کے زخم سے بہہ رہا ہے ۔ حضرت سعد رضی اللہ عنہ کا اسی زخم کی وجہ سے انتقال ہو گیا ۔",
                "urduNarrator": "ہم سے زکریابن یحییٰ نے بیان کیا کہ کہا ہم سے عبداللہ بن نمیر نے کہ کہا ہم سے ہشام بن عروہ نے اپنے باپ عروہ بن زبیر کے واسطہ سے بیان کیا ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا زَكَرِيَّاءُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ أُصِيبَ سَعْدٌ يَوْمَ الْخَنْدَقِ فِي الأَكْحَلِ، فَضَرَبَ النَّبِيُّ صلى الله عليه وسلم خَيْمَةً فِي الْمَسْجِدِ لِيَعُودَهُ مِنْ قَرِيبٍ، فَلَمْ يَرُعْهُمْ ـ وَفِي الْمَسْجِدِ خَيْمَةٌ مِنْ بَنِي غِفَارٍ ـ إِلاَّ الدَّمُ يَسِيلُ إِلَيْهِمْ فَقَالُوا يَا أَهْلَ الْخَيْمَةِ، مَا هَذَا الَّذِي يَأْتِينَا مِنْ قِبَلِكُمْ فَإِذَا سَعْدٌ يَغْذُو جُرْحُهُ دَمًا، فَمَاتَ فِيهَا‏.‏",
                "headingArabic": "الْخَيْمَةِ فِي الْمَسْجِدِ لِلْمَرْضَى وَغَيْرِهِمْ",
                "headingUrdu": "مریضوں کے لیے مسجد میں خیمہ لگانا وغیرہ",
                "headingEnglish": "To pitch a tent in the mosque for patients, etc",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 455,
                "hadithNumber": "464",
                "englishNarrator": "Narrated Um Salama:",
                "hadithEnglish": "I complained to Allah's Messenger (ﷺ) that I was sick. He told me to perform the Tawaf behind the people while riding. So I did so and Allah's Messenger (ﷺ) was praying beside the Ka`ba and reciting the Sura starting with \"Wat-tur wa kitabin mastur.\"",
                "hadithUrdu": "میں نے رسول کریم صلی اللہ علیہ وسلم سے ( حجۃ الوداع میں ) اپنی بیماری کا شکوہ کیا ( میں نے کہا کہ میں پیدل طواف نہیں کر سکتی ) تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ لوگوں کے پیچھے رہ اور سوار ہو کر طواف کر ۔ پس میں نے طواف کیا اور رسول اللہ صلی اللہ علیہ وسلم اس وقت بیت اللہ کے قریب نماز میں آیت «والطور و کتاب مسطور» کی تلاوت کر رہے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہمیں امام مالک رحمہ اللہ علیہ نے محمد بن عبدالرحمٰن بن نوفل سے خبر دی ، انھوں نے عروہ بن زبیر سے ۔ انھوں نے زینب بنت ابی سلمہ سے ، انھوں نے ام المؤمنین ام سلمہ سے ، وہ کہتی ہیں کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ، عَنْ عُرْوَةَ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ شَكَوْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنِّي أَشْتَكِي‏.‏ قَالَ ‏ \"‏ طُوفِي مِنْ وَرَاءِ النَّاسِ وَأَنْتِ رَاكِبَةٌ ‏\"‏‏.‏ فَطُفْتُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي إِلَى جَنْبِ الْبَيْتِ، يَقْرَأُ بِالطُّورِ وَكِتَابٍ مَسْطُورٍ‏.‏",
                "headingArabic": "إِدْخَالِ الْبَعِيرِ فِي الْمَسْجِدِ لِلْعِلَّةِ",
                "headingUrdu": "ضرورت پڑنے پر اونٹ کو مسجد کے اندر لے جانا",
                "headingEnglish": "To take the camel inside the mosque if necessary",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 456,
                "hadithNumber": "465",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Two of the companions of the Prophet (ﷺ) departed from him on a dark night and were led by two lights like lamps (going in front of them from Allah as a miracle) lighting the way in front of them, and when they parted, each of them was accompanied by one of these lights till he reached their (respective) houses.",
                "hadithUrdu": "دو شخص نبی کریم صلی اللہ علیہ وسلم کے پاس سے نکلے ، ایک عباد بن بشر اور دوسرے صاحب میرے خیال کے مطابق اسید بن حضیر تھے ۔ رات تاریک تھی اور دونوں اصحاب کے پاس روشن چراغ کی طرح کوئی چیز تھی جس سے ان کے آگے آگے روشنی پھیل رہی تھی پس جب وہ دونوں اصحاب ایک دوسرے سے جدا ہوئے تو ہر ایک کے ساتھ ایک ایک چراغ رہ گیا جو گھر تک ساتھ رہا ۔",
                "urduNarrator": "ہم سے محمد بن مثنی نے بیان کیا انھوں نے کہا ہم سے معاذ بن ہشام نے بیان کیا ، انھوں نے کہا مجھ سے میرے والد نے قتادہ کے واسطہ سے بیان کیا ، کہا ہم سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، قَالَ حَدَّثَنَا أَنَسٌ، أَنَّ رَجُلَيْنِ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم خَرَجَا مِنْ عِنْدِ النَّبِيِّ صلى الله عليه وسلم فِي لَيْلَةٍ مُظْلِمَةٍ، وَمَعَهُمَا مِثْلُ الْمِصْبَاحَيْنِ يُضِيآنِ بَيْنَ أَيْدِيهِمَا، فَلَمَّا افْتَرَقَا صَارَ مَعَ كُلِّ وَاحِدٍ مِنْهُمَا وَاحِدٌ حَتَّى أَتَى أَهْلَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 457,
                "hadithNumber": "466",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) delivered a sermon and said, \"Allah gave a choice to one of (His) slaves either to choose this world or what is with Him in the Hereafter. He chose the latter.\" Abu Bakr رضی اللہ عنہ wept. I said to myself, \"Why is this Sheikh weeping, if Allah gave choice to one (of His) slaves either to choose this world or what is with Him in the Here after and he chose the latter?\" And that slave was Allah's Messenger (ﷺ) himself. Abu Bakr رضی اللہ عنہ knew more than us. The Prophet (ﷺ) said, \"O Abu Bakr! Don't weep. The Prophet (ﷺ) added: Abu- Bakr has favored me much with his property and company. If I were to take a Khalil from mankind I would certainly have taken Abu Bakr but the Islamic brotherhood and friendship is sufficient. Close all the gates in the mosque except that of Abu Bakr رضی اللہ عنہ .",
                "hadithUrdu": "ایک دفعہ رسول کریم صلی اللہ علیہ وسلم نے خطبہ میں فرمایا کہ اللہ تعالیٰ نے اپنے ایک بندے کو دنیا اور آخرت کے رہنے میں اختیار دیا ( کہ وہ جس کو چاہے اختیار کرے ) بندے نے وہ پسند کیا جو اللہ کے پاس ہے یعنی آخرت ۔ یہ سن کر ابوبکر رضی اللہ عنہ رونے لگے ، میں نے اپنے دل میں کہا کہ اگر خدا نے اپنے کسی بندے کو دنیا اور آخرت میں سے کسی کو اختیار کرنے کو کہا اور اس بندے نے آخرت پسند کر لی تو اس میں ان بزرگ کے رونے کی کیا وجہ ہے ۔ لیکن یہ بات تھی کہ بندے سے مراد رسول اللہ صلی اللہ علیہ وسلم ہی تھے اور ابوبکر رضی اللہ عنہ ہم سب سے زیادہ جاننے والے تھے ۔ آنحضور صلی اللہ علیہ وسلم نے ان سے فرمایا ۔ ابوبکر آپ روئیے مت ۔ اپنی صحبت اور اپنی دولت کے ذریعہ تمام لوگوں سے زیادہ مجھ پر احسان کرنے والے آپ ہی ہیں اور اگر میں کسی کو خلیل بناتا تو ابوبکر کو بناتا ۔ لیکن ( جانی دوستی تو اللہ کے سوا کسی سے نہیں ہو سکتی ) اس کے بدلہ میں اسلام کی برادری اور دوستی کافی ہے ۔ مسجد میں ابوبکر رضی اللہ عنہ کی طرف کے دروازے کے سوا تمام دروازے بند کر دئیے جائیں ۔",
                "urduNarrator": "ہم سے محمد بن سنان نے بیان کیا ، کہ کہا ہم سے فلیح بن سلیمان نے ، کہا ہم سے ابونضر سالم بن ابی امیہ نے عبید بن حنین کے واسطہ سے ، انھوں نے بسر بن سعید سے ، انھوں نے ابو سعید خدری رضی اللہ عنہ سے ، انھوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، قَالَ حَدَّثَنَا فُلَيْحٌ، قَالَ حَدَّثَنَا أَبُو النَّضْرِ، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ خَطَبَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ إِنَّ اللَّهَ خَيَّرَ عَبْدًا بَيْنَ الدُّنْيَا وَبَيْنَ مَا عِنْدَهُ، فَاخْتَارَ مَا عِنْدَ اللَّهِ ‏\"‏‏.‏ فَبَكَى أَبُو بَكْرٍ ـ رضى الله عنه ـ فَقُلْتُ فِي نَفْسِي مَا يُبْكِي هَذَا الشَّيْخَ إِنْ يَكُنِ اللَّهُ خَيَّرَ عَبْدًا بَيْنَ الدُّنْيَا وَبَيْنَ مَا عِنْدَهُ فَاخْتَارَ مَا عِنْدَ اللَّهِ، فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم هُوَ الْعَبْدَ، وَكَانَ أَبُو بَكْرٍ أَعْلَمَنَا‏.‏ قَالَ ‏\"‏ يَا أَبَا بَكْرٍ لاَ تَبْكِ، إِنَّ أَمَنَّ النَّاسِ عَلَىَّ فِي صُحْبَتِهِ وَمَالِهِ أَبُو بَكْرٍ، وَلَوْ كُنْتُ مُتَّخِذًا خَلِيلاً مِنْ أُمَّتِي لاَتَّخَذْتُ أَبَا بَكْرٍ، وَلَكِنْ أُخُوَّةُ الإِسْلاَمِ وَمَوَدَّتُهُ، لاَ يَبْقَيَنَّ فِي الْمَسْجِدِ باب إِلاَّ سُدَّ إِلاَّ باب أَبِي بَكْرٍ ‏\"‏‏.‏",
                "headingArabic": "الْخَوْخَةِ وَالْمَمَرِّ فِي الْمَسْجِدِ",
                "headingUrdu": "الخواخہ (ایک چھوٹا دروازہ) اور مسجد میں ایک راستہ",
                "headingEnglish": "Al-Khaukhah (a small door) and a path in the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 458,
                "hadithNumber": "467",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) in his fatal illness came out with a piece of cloth tied round his head and sat on the pulpit. After thanking and praising Allah he said, \"There is no one who had done more favor to me with life and property than Abu Bakr bin Abi Quhafa. If I were to take a Khalil, I would certainly have taken Abu- Bakr but the Islamic brotherhood is superior. Close all the small doors in this mosque except that of Abu Bakr.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنے مرض وفات میں باہر تشریف لائے ۔ سر پہ پٹی بندھی ہوئی تھی ۔ آپ صلی اللہ علیہ وسلم منبر پر بیٹھے ، اللہ کی حمد و ثنا کی اور فرمایا ، کوئی شخص بھی ایسا نہیں جس نے ابوبکر بن ابوقحافہ سے زیادہ مجھ پر اپنی جان و مال کے ذریعہ احسان کیا ہو اور اگر میں کسی کو انسانوں میں سے جانی دوست بناتا تو ابوبکر ( رضی اللہ عنہ ) کو بناتا ۔ لیکن اسلام کا تعلق افضل ہے ۔ دیکھو ابوبکر ( رضی اللہ عنہ ) کی کھڑکی چھوڑ کر اس مسجد کی تمام کھڑکیاں بند کر دی جائیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد جعفی نے بیان کیا ، انھوں نے کہا ہم سے وہب بن جریر نے بیان کیا ، انھوں نے کہا مجھ سے میرے باپ جریر بن حازم نے بیان کیا ، انھوں نے کہا میں نے یعلیٰ بن حکیم سے سنا ، وہ عکرمہ سے نقل کرتے تھے ، وہ حضرت عبداللہ بن عباس رضی اللہ عنہما سے ، انھوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ يَعْلَى بْنَ حَكِيمٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ عَاصِبٌ رَأْسَهُ بِخِرْقَةٍ، فَقَعَدَ عَلَى الْمِنْبَرِ، فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏ \"‏ إِنَّهُ لَيْسَ مِنَ النَّاسِ أَحَدٌ أَمَنَّ عَلَىَّ فِي نَفْسِهِ وَمَالِهِ مِنْ أَبِي بَكْرِ بْنِ أَبِي قُحَافَةَ، وَلَوْ كُنْتُ مُتَّخِذًا مِنَ النَّاسِ خَلِيلاً لاَتَّخَذْتُ أَبَا بَكْرٍ خَلِيلاً، وَلَكِنْ خُلَّةُ الإِسْلاَمِ أَفْضَلُ، سُدُّوا عَنِّي كُلَّ خَوْخَةٍ فِي هَذَا الْمَسْجِدِ غَيْرَ خَوْخَةِ أَبِي بَكْرٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 459,
                "hadithNumber": "468",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"The Prophet (ﷺ) arrived at Mecca and sent for `Uthman bin Talha. He opened the gate of the Ka`ba and the Prophet, Bilal, Usama bin Zaid and `Uthman bin Talha entered the Ka`ba and then they closed its door (from inside). They stayed there for an hour, and then came out.\" Ibn `Umar added, \"I quickly went to Bilal and asked him (whether the Prophet (ﷺ) had prayed). Bilal replied, 'He prayed in it.' I asked, 'Where?' He replied, 'Between the two pillars.' \"Ibn `Umar added, \"I forgot to ask how many rak`at he (the Prophet) had prayed in the Ka`ba.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب مکہ تشریف لائے ( اور مکہ فتح ہوا ) تو آپ نے عثمان بن طلحہ رضی اللہ عنہ کو بلوایا ۔ ( جو کعبہ کے متولی ، چابی بردار تھے ) انھوں نے دروازہ کھولا تو نبی کریم صلی اللہ علیہ وسلم ، بلال ، اسامہ بن زید اور عثمان بن طلحہ چاروں اندر تشریف لے گئے ۔ پھر دروازہ بند کر دیا گیا اور وہاں تھوڑی دیر تک ٹھہر کر باہر آئے ۔ ابن عمر رضی اللہ عنہما نے فرمایا کہ میں نے جلدی سے آگے بڑھ کر بلال سے پوچھا ( کہ آنحضرت صلی اللہ علیہ وسلم نے کعبہ کے اندر کیا کیا ) انھوں نے بتایا کہ آنحضرت صلی اللہ علیہ وسلم نے اندر نماز پڑھی تھی ۔ میں نے پوچھا کس جگہ ؟ کہا کہ دونوں ستونوں کے درمیان ۔ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ یہ پوچھنا مجھے یاد نہ رہا کہ آپ نے کتنی رکعتیں پڑھی تھیں ۔",
                "urduNarrator": "ہم سے ابوالنعمان محمد بن فضل اور قتیبہ بن سعید نے بیان کیا کہ ہم سے حماد بن زید نے ایوب سختیانی کے واسطہ سے ، انھوں نے نافع سے ، انھوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، وَقُتَيْبَةُ، قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَدِمَ مَكَّةَ، فَدَعَا عُثْمَانَ بْنَ طَلْحَةَ، فَفَتَحَ الْبَابَ، فَدَخَلَ النَّبِيُّ صلى الله عليه وسلم وَبِلاَلٌ وَأُسَامَةُ بْنُ زَيْدٍ وَعُثْمَانُ بْنُ طَلْحَةَ، ثُمَّ أُغْلِقَ الْبَابُ، فَلَبِثَ فِيهِ سَاعَةً ثُمَّ خَرَجُوا‏.‏ قَالَ ابْنُ عُمَرَ فَبَدَرْتُ فَسَأَلْتُ بِلاَلاً فَقَالَ صَلَّى فِيهِ‏.‏ فَقُلْتُ فِي أَىٍّ قَالَ بَيْنَ الأُسْطُوَانَتَيْنِ‏.‏ قَالَ ابْنُ عُمَرَ فَذَهَبَ عَلَىَّ أَنْ أَسْأَلَهُ كَمْ صَلَّى‏.‏",
                "headingArabic": "الأَبْوَابِ وَالْغَلَقِ لِلْكَعْبَةِ وَالْمَسَاجِدِ",
                "headingUrdu": "کعبہ اور مساجد کے دروازے اور تالے",
                "headingEnglish": "The doors and locks of the Kabah and the mosques",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 460,
                "hadithNumber": "469",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent some horse men to Najd and they brought a man called Thumama bin Uthal from Bani Hanifa. They fastened him to one of the pillars of the mosque.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کچھ سواروں کو نجد کی طرف بھیجا تھا ۔ وہ لوگ بنو حنیفہ کے ایک شخص ثمامہ بن اثال کو ( بطور جنگی قیدی ) پکڑ لائے اور مسجد میں ایک ستون سے باندھ دیا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انھوں نے کہا کہ ہم سے لیث بن سعد نے سعید بن ابی سعید مقبری کے واسطہ سے بیان کیا انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْلاً قِبَلَ نَجْدٍ، فَجَاءَتْ بِرَجُلٍ مِنْ بَنِي حَنِيفَةَ يُقَالُ لَهُ ثُمَامَةُ بْنُ أُثَالٍ، فَرَبَطُوهُ بِسَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ‏.‏",
                "headingArabic": "دُخُولِ الْمُشْرِكِ الْمَسْجِدَ",
                "headingUrdu": "کافر کا مسجد میں داخل ہونا",
                "headingEnglish": "The entering of a pagan in the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 461,
                "hadithNumber": "470",
                "englishNarrator": "Narrated Al-Sa'ib bin Yazid:",
                "hadithEnglish": "I was standing in the mosque and somebody threw a gravel at me. I looked and found that he was `Umar bin Al-Khattab. He said to me, \"Fetch those two men to me.\" When I did, he said to them, \"Who are you? (Or) where do you come from?\" They replied, \"We are from Ta'if.\" `Umar said, \"Were you from this city (Medina) I would have punished you for raising your voices in the mosque of Allah's Messenger (ﷺ).\"",
                "hadithUrdu": "میں مسجدنبوی میں کھڑا ہوا تھا ، کسی نے میری طرف کنکری پھینکی ۔ میں نے جو نظر اٹھائی تو دیکھا کہ حضرت عمر بن خطاب رضی اللہ عنہ سامنے ہیں ۔ آپ نے فرمایا کہ یہ سامنے جو دو شخص ہیں انہیں میرے پاس بلا کر لاؤ ۔ میں بلا لایا ۔ آپ نے پوچھا کہ تمہارا تعلق کس قبیلہ سے ہے یا یہ فرمایا کہ تم کہاں رہتے ہو ؟ انھوں نے بتایا کہ ہم طائف کے رہنے والے ہیں ۔ آپ نے فرمایا کہ اگر تم مدینہ کے ہوتے تو میں تمہیں سزا دئیے بغیر نہ چھوڑتا ۔ رسول کریم صلی اللہ علیہ وسلم کی مسجد میں آواز اونچی کرتے ہو ؟",
                "urduNarrator": "ہم سے علی بن عبداللہ بن جعفر نے بیان کیا ، انھوں نے کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، انھوں نے کہا کہ ہم سے جعید بن عبدالرحمٰن نے بیان کیا ، انھوں نے کہا مجھ سے یزید بن خصیفہ نے بیان کیا ، انھوں نے سائب بن یزید سے بیان کیا ، انھوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا الْجُعَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ خُصَيْفَةَ، عَنِ السَّائِبِ بْنِ يَزِيدَ، قَالَ كُنْتُ قَائِمًا فِي الْمَسْجِدِ فَحَصَبَنِي رَجُلٌ، فَنَظَرْتُ فَإِذَا عُمَرُ بْنُ الْخَطَّابِ فَقَالَ اذْهَبْ فَأْتِنِي بِهَذَيْنِ‏.‏ فَجِئْتُهُ بِهِمَا‏.‏ قَالَ مَنْ أَنْتُمَا ـ أَوْ مِنْ أَيْنَ أَنْتُمَا قَالاَ مِنْ أَهْلِ الطَّائِفِ‏.‏ قَالَ لَوْ كُنْتُمَا مِنْ أَهْلِ الْبَلَدِ لأَوْجَعْتُكُمَا، تَرْفَعَانِ أَصْوَاتَكُمَا فِي مَسْجِدِ رَسُولِ اللَّهِ صلى الله عليه وسلم",
                "headingArabic": "رَفْعِ الصَّوْتِ فِي الْمَسَاجِدِ",
                "headingUrdu": "مسجد میں آواز بلند کرنا",
                "headingEnglish": "Raising the voice in the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 462,
                "hadithNumber": "471",
                "englishNarrator": "Narrated Ka`b bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "During the lifetime of Allah's Messenger (ﷺ) I asked Ibn Abi Hadrad in the mosque to pay the debts which he owed to me and our voices grew so loud that Allah's Messenger (ﷺ) heard them while he was in his house. So he came to us after raising the curtain of his room. The Prophet (ﷺ) said, \"O Ka`b bin Malik!\" I replied, \"Labaik, O Allah's Messenger (ﷺ).\" He gestured with his hand to me to reduce the debt to one half. I said, \"O Allah's Messenger (ﷺ) have done it.\" Allah's Messenger (ﷺ) said (to Ibn Hadrad), \"Get up and pay it.\"",
                "hadithUrdu": "انھوں نے عبداللہ ابن ابی حدرد رضی اللہ عنہ سے اپنے ایک قرض کے سلسلے میں رسول اللہ صلی اللہ علیہ وسلم کے دور میں مسجدنبوی کے اندر تقاضا کیا ۔ دونوں کی آواز کچھ اونچی ہو گئی یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم نے بھی اپنے حجرہ سے سن لیا ۔ آپ اٹھے اور حجرہ پر پڑے ہوئے پردہ کو ہٹایا ۔ آپ نے کعب بن مالک کو آواز دی ، اے کعب ! کعب بولے ۔ یا رسول اللہ ! حاضر ہوں ۔ آپ نے اپنے ہاتھ کے اشارے سے بتایا کہ وہ اپنا آدھا قرض معاف کر دے ۔ حضرت کعب نے عرض کی یا رسول اللہ ! میں نے معاف کر دیا ۔ آپ نے ابن ابی حدرد سے فرمایا اچھا اب چل اٹھ اس کا قرض ادا کر ۔",
                "urduNarrator": "ہم سے احمد بن صالح نے بیان کیا ، انھوں نے کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، انھوں نے کہا مجھے یونس بن یزید نے خبر دی ، انھوں نے ابن شہاب زہری کے واسطہ سے بیان کیا ، انھوں نے کہا کہ مجھ سے عبداللہ بن کعب بن مالک نے بیان کیا ، ان کو ان کے باپ کعب بن مالک رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ، أَنَّ كَعْبَ بْنَ مَالِكٍ، أَخْبَرَهُ أَنَّهُ، تَقَاضَى ابْنَ أَبِي حَدْرَدٍ دَيْنًا لَهُ عَلَيْهِ، فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ، فَارْتَفَعَتْ أَصْوَاتُهُمَا حَتَّى سَمِعَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ فِي بَيْتِهِ، فَخَرَجَ إِلَيْهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى كَشَفَ سِجْفَ حُجْرَتِهِ وَنَادَى ‏\"‏ يَا كَعْبُ بْنَ مَالِكٍ، يَا كَعْبُ ‏\"‏‏.‏ قَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ‏.‏ فَأَشَارَ بِيَدِهِ أَنْ ضَعِ الشَّطْرَ مِنْ دَيْنِكَ‏.‏ قَالَ كَعْبٌ قَدْ فَعَلْتُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُمْ فَاقْضِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 463,
                "hadithNumber": "472",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما:",
                "hadithEnglish": "\"While the Prophet (ﷺ) was on the pulpit, a man asked him how to offer the night prayers. He replied, 'Pray two rak`at at a time and then two and then two and so on, and if you are afraid of the dawn (the approach of the time of the Fajr prayer) pray one rak`a and that will be the witr for all the rak`at which you have offered.\" Ibn `Umar said, \"The last rak`at of the night prayer should be odd, for the Prophet (ﷺ) ordered it to be so.",
                "hadithUrdu": "ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا ( جبکہ ) اس وقت آپ صلی اللہ علیہ وسلم منبر پر تھے کہ رات کی نماز ( یعنی تہجد ) کس طرح پڑھنے کے لیے آپ فرماتے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ دو دو رکعت کر کے پڑھ اور جب صبح قریب ہونے لگے تو ایک رکعت پڑھ لے ۔ یہ ایک رکعت اس ساری نماز کو طاق بنا دے گی اور آپ صلی اللہ علیہ وسلم فرمایا کرتے تھے کہ رات کی آخری نماز کو طاق رکھا کرو کیونکہ نبی کریم صلی اللہ علیہ وسلم نے اس کا حکم دیا ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا کہ کہا ہم سے بشر بن مفضل نے عبیداللہ بن عمر سے ، انھوں نے نافع سے ، انھوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ سَأَلَ رَجُلٌ النَّبِيَّ صلى الله عليه وسلم وَهْوَ عَلَى الْمِنْبَرِ مَا تَرَى فِي صَلاَةِ اللَّيْلِ قَالَ ‏ \"‏ مَثْنَى مَثْنَى، فَإِذَا خَشِيَ الصُّبْحَ صَلَّى وَاحِدَةً، فَأَوْتَرَتْ لَهُ مَا صَلَّى ‏\"‏‏.‏ وَإِنَّهُ كَانَ يَقُولُ اجْعَلُوا آخِرَ صَلاَتِكُمْ وِتْرًا، فَإِنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ بِهِ‏.‏",
                "headingArabic": "الْحِلَقِ وَالْجُلُوسِ فِي الْمَسْجِدِ",
                "headingUrdu": "حلقوں میں مذہبی اجتماع اور مسجد میں بیٹھنا",
                "headingEnglish": "The religious gathering in circles and sitting in the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 464,
                "hadithNumber": "473",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "A man came to the Prophet (ﷺ) while he was delivering the sermon and asked him how to offer the night prayers. The Prophet (ﷺ) replied, 'Pray two rak`at at a time and then two and then two and so on and if you are afraid of dawn (the approach of the time of the Fajr prayer) pray one rak`a and that will be the witr for all the rak`at which you have prayed.\" Narrated 'Ubaidullah bin `Abdullah bin `Umar: A man called the Prophet (ﷺ) while he was in the mosque.",
                "hadithUrdu": "ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ آپ صلی اللہ علیہ وسلم اس وقت خطبہ دے رہے تھے آنے والے نے پوچھا کہ رات کی نماز کس طرح پڑھی جائے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا دو دو رکعت پھر جب طلوع صبح صادق کا اندیشہ ہو تو ایک رکعت وتر کی پڑھ لے تاکہ تو نے جو نماز پڑھی ہے اسے یہ رکعت طاق بنا دے اور امام بخاری نے فرمایا کہ ولید بن کثیر نے کہا کہ مجھ سے عبیداللہ بن عبداللہ عمری نے بیان کیا ، عبداللہ بن عمر رضی اللہ عنہما نے ان سے بیان کیا کہ ایک شخص نے نبی کریم صلی اللہ علیہ وسلم کو آواز دی جب کہ آپ صلی اللہ علیہ وسلم مسجد میں تشریف فرما تھے ۔",
                "urduNarrator": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا کہ کہا ہم سے حماد بن زید نے ، انھوں نے ایوب سختیانی سے ، انھوں نے ابن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ يَخْطُبُ فَقَالَ كَيْفَ صَلاَةُ اللَّيْلِ فَقَالَ ‏ \"‏ مَثْنَى مَثْنَى، فَإِذَا خَشِيتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ، تُوتِرُ لَكَ مَا قَدْ صَلَّيْتَ ‏\"‏‏.‏ قَالَ الْوَلِيدُ بْنُ كَثِيرٍ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ أَنَّ ابْنَ عُمَرَ حَدَّثَهُمْ أَنَّ رَجُلاً نَادَى النَّبِيَّ صلى الله عليه وسلم وَهُوَ فِي الْمَسْجِدِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 465,
                "hadithNumber": "474",
                "englishNarrator": "Narrated Abu Waqid al-Laithi:",
                "hadithEnglish": "While Allah's Messenger (ﷺ) was sitting in the mosque (with some people) three men came, two of them came in front of Allah's Messenger (ﷺ) and the third one went away, and then one of them found a place in the circle and sat there while the second man sat behind the gathering, and the third one went away. When Allah's Messenger (ﷺ) finished his preaching, he said, \"Shall I tell you about these three persons? One of them betook himself to Allah and so Allah accepted him and accommodated him; the second felt shy before Allah so Allah did the same for him and sheltered him in His Mercy (and did not punish him), while the third turned his face from Allah, and went away, so Allah turned His face from him likewise.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم مسجد میں تشریف فرما تھے کہ تین آدمی باہر سے آئے ۔ دو تو رسول اللہ صلی اللہ علیہ وسلم کی مجلس میں حاضری کی غرض سے آگے بڑھے لیکن تیسرا چلا گیا ۔ ان دو میں سے ایک نے درمیان میں خالی جگہ دیکھی اور وہاں بیٹھ گیا ۔ دوسرا شخص پیچھے بیٹھ گیا اور تیسرا تو واپس ہی جا رہا تھا ۔ جب رسول اللہ صلی اللہ علیہ وسلم وعظ سے فارغ ہوئے تو آپ صلی اللہ علیہ وسلم نے فرمایا کیا میں تمہیں ان تینوں کے متعلق ایک بات نہ بتاؤں ۔ ایک شخص تو خدا کی طرف بڑھا اور خدا نے اسے جگہ دی ( یعنی پہلا شخص ) رہا دوسرا تو اس نے ( لوگوں میں گھسنے سے ) شرم کی ، اللہ نے بھی اس سے شرم کی ، تیسرے نے منہ پھیر لیا ۔ اس لیے اللہ نے بھی اس کی طرف سے منہ پھیر لیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا کہ کہا ہمیں امام مالک نے خبر دی اسحاق بن عبداللہ ابن ابی طلحہ کے واسطے سے کہ عقیل بن ابی طالب کے غلام ابومرہ نے انہیں خبر دی ابوواقد لیثی حارث بن عوف صحابی کے واسطہ سے ، انھوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّ أَبَا مُرَّةَ، مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَخْبَرَهُ عَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ، قَالَ بَيْنَمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ فَأَقْبَلَ ثَلاَثَةُ نَفَرٍ، فَأَقْبَلَ اثْنَانِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَذَهَبَ وَاحِدٌ، فَأَمَّا أَحَدُهُمَا فَرَأَى فُرْجَةً فَجَلَسَ، وَأَمَّا الآخَرُ فَجَلَسَ خَلْفَهُمْ، فَلَمَّا فَرَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلاَ أُخْبِرُكُمْ عَنِ الثَّلاَثَةِ أَمَّا أَحَدُهُمْ فَأَوَى إِلَى اللَّهِ، فَآوَاهُ اللَّهُ، وَأَمَّا الآخَرُ فَاسْتَحْيَا، فَاسْتَحْيَا اللَّهُ مِنْهُ، وَأَمَّا الآخَرُ فَأَعْرَضَ، فَأَعْرَضَ اللَّهُ عَنْهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 466,
                "hadithNumber": "475",
                "englishNarrator": "Narrated `Abbad bin Tamim that his uncle:",
                "hadithEnglish": "\"I saw Allah's Messenger (ﷺ) lying flat (on his back) in the mosque with one leg on the other.\" Narrated Sa`id bin Al-Musaiyab that `Umar and `Uthman used to do the same.",
                "hadithUrdu": "انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو چت لیٹے ہوئے دیکھا ۔ آپ صلی اللہ علیہ وسلم اپنا ایک پاؤں دوسرے پر رکھے ہوئے تھے ۔ ابن شہاب زہری سے مروی ہے ، وہ سعید بن مسیب سے روایت کرتے ہیں کہ عمر اور عثمان رضی اللہ عنہما بھی اسی طرح لیٹتے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا امام مالک کے واسطہ سے ، انھوں نے ابن شہاب زہری سے ، انھوں نے عباد بن تمیم سے ، انھوں نے اپنے چچا ( عبداللہ بن زید بن عاصم مازنی رضی اللہ عنہ ) سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، أَنَّهُ رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم مُسْتَلْقِيًا فِي الْمَسْجِدِ، وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى‏.‏ وَعَنِ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ كَانَ عُمَرُ وَعُثْمَانُ يَفْعَلاَنِ ذَلِكَ‏.‏",
                "headingArabic": "الاِسْتِلْقَاءِ فِي الْمَسْجِدِ وَمَدِّ الرِّجْلِ",
                "headingUrdu": "مسجد میں (پیٹھ کے بل) چپٹا لیٹنا",
                "headingEnglish": "To lie flat (on the back) in the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 467,
                "hadithNumber": "476",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا,(the wife of the Prophet)",
                "hadithEnglish": "I had seen my parents following Islam since I attained the age of puberty. Not a day passed but the Prophet (ﷺ) visited us, both in the mornings and evenings. My father Abu Bakr thought of building a mosque in the courtyard of his house and he did so. He used to pray and recite the Qur'an in it. The pagan women and their children used to stand by him and look at him with surprise. Abu Bakr was a Softhearted person and could not help weeping while reciting the Qur'an. The chiefs of the Quraish pagans became afraid of that (i.e. that their children and women might be affected by the recitation of Qur'an).",
                "hadithUrdu": "میں نے جب سے ہوش سنبھالا تو اپنے ماں باپ کو مسلمان ہی پایا اور ہم پر کوئی دن ایسا نہیں گزرا جس میں رسول اللہ صلی اللہ علیہ وسلم صبح و شام دن کے دونوں وقت ہمارے گھر تشریف نہ لائے ہوں ۔ پھر ابوبکر رضی اللہ عنہ کی سمجھ میں ایک ترکیب آئی تو انھوں نے گھر کے سامنے ایک مسجد بنا لی ، وہ اس میں نماز پڑھتے اور قرآن مجید کی تلاوت کرتے ۔ مشرکین کی عورتیں اور ان کے بچے وہاں تعجب سے سنتے اور کھڑے ہو جاتے اور آپ کی طرف دیکھتے رہتے ۔ حضرت ابوبکر رضی اللہ عنہ بڑے رونے والے آدمی تھے ۔ جب قرآن کریم پڑھتے تو آنسوؤں پر قابو نہ رہتا ، قریش کے مشرک سردار اس صورت حال سے گھبرا گئے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انھوں نے کہا ہم سے لیث بن سعد نے عقیل کے واسطہ سے بیان کیا ، انھوں نے ابن شہاب زہری سے ، انھوں نے کہا مجھے عروہ بن زبیر نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ لَمْ أَعْقِلْ أَبَوَىَّ إِلاَّ وَهُمَا يَدِينَانِ الدِّينَ، وَلَمْ يَمُرَّ عَلَيْنَا يَوْمٌ إِلاَّ يَأْتِينَا فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم طَرَفَىِ النَّهَارِ بُكْرَةً وَعَشِيَّةً، ثُمَّ بَدَا لأَبِي بَكْرٍ فَابْتَنَى مَسْجِدًا بِفِنَاءِ دَارِهِ، فَكَانَ يُصَلِّي فِيهِ وَيَقْرَأُ الْقُرْآنَ، فَيَقِفُ عَلَيْهِ نِسَاءُ الْمُشْرِكِينَ، وَأَبْنَاؤُهُمْ يَعْجَبُونَ مِنْهُ وَيَنْظُرُونَ إِلَيْهِ، وَكَانَ أَبُو بَكْرٍ رَجُلاً بَكَّاءً لاَ يَمْلِكُ عَيْنَيْهِ إِذَا قَرَأَ الْقُرْآنَ، فَأَفْزَعَ ذَلِكَ أَشْرَافَ قُرَيْشٍ مِنَ الْمُشْرِكِينَ‏.‏",
                "headingArabic": "الْمَسْجِدِ يَكُونُ فِي الطَّرِيقِ مِنْ غَيْرِ ضَرَرٍ بِالنَّاسِ",
                "headingUrdu": "(اگر) سڑک پر مسجد بنائی جائے تو لوگوں کے لیے نقصان کا باعث نہ ہو۔",
                "headingEnglish": "(If) a mosque (is built) on a road, it should not be a cause of harm for the people",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 468,
                "hadithNumber": "477",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The prayer offered in congregation is twenty five times more superior (in reward) to the prayer offered alone in one's house or in a business center, because if one performs ablution and does it perfectly, and then proceeds to the mosque with the sole intention of praying, then for each step which he takes towards the mosque, Allah upgrades him a degree in reward and (forgives) crosses out one sin till he enters the mosque. When he enters the mosque he is considered in prayer as long as he is waiting for the prayer and the angels keep on asking for Allah's forgiveness for him and they keep on saying: 'O Allah! Be Merciful to him, O Allah! Forgive him, as long as he keeps on sitting at his praying place and does not pass wind. (See Hadith No. 620).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا ، جماعت کے ساتھ نماز پڑھنے میں گھر کے اندر یا بازار ( دوکان وغیرہ ) میں نماز پڑھنے سے پچیس گنا ثواب زیادہ ملتا ہے ۔ کیونکہ جب کوئی شخص تم میں سے وضو کرے اور اس کے آداب کا لحاظ رکھے پھر مسجد میں صرف نماز کی غرض سے آئے تو اس کے ہر قدم پر اللہ تعالیٰ ایک درجہ اس کا بلند کرتا ہے اور ایک گناہ اس سے معاف کرتا ہے ۔ اس طرح وہ مسجد کے اندر آئے گا ۔ مسجد میں آنے کے بعد جب تک نماز کے انتظار میں رہے گا ۔ اسے نماز ہی کی حالت میں شمار کیا جائے گا اور جب تک اس جگہ بیٹھا رہے جہاں اس نے نماز پڑھی ہے تو فرشتے اس کے لیے رحمت خداوندی کی دعائیں کرتے ہیں «اللهم اغفر له ،‏‏‏‏ ‏‏‏‏اللهم ارحمه» اے اللہ ! اس کو بخش دے ، اے اللہ ! اس پر رحم کر ۔ جب تک کہ ریح خارج کر کے ( وہ فرشتوں کو ) تکلیف نہ دے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے ابومعاویہ نے اعمش کے واسطہ سے ، انھوں نے ابوصالح ذکوان سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انھوں نے رسول کریم صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ صَلاَةُ الْجَمِيعِ تَزِيدُ عَلَى صَلاَتِهِ فِي بَيْتِهِ، وَصَلاَتِهِ فِي سُوقِهِ خَمْسًا وَعِشْرِينَ دَرَجَةً، فَإِنَّ أَحَدَكُمْ إِذَا تَوَضَّأَ فَأَحْسَنَ وَأَتَى الْمَسْجِدَ، لاَ يُرِيدُ إِلاَّ الصَّلاَةَ، لَمْ يَخْطُ خُطْوَةً إِلاَّ رَفَعَهُ اللَّهُ بِهَا دَرَجَةً، وَحَطَّ عَنْهُ خَطِيئَةً، حَتَّى يَدْخُلَ الْمَسْجِدَ، وَإِذَا دَخَلَ الْمَسْجِدَ كَانَ فِي صَلاَةٍ مَا كَانَتْ تَحْبِسُهُ، وَتُصَلِّي ـ يَعْنِي عَلَيْهِ ـ الْمَلاَئِكَةُ مَا دَامَ فِي مَجْلِسِهِ الَّذِي يُصَلِّي فِيهِ اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ارْحَمْهُ، مَا لَمْ يُحْدِثْ فِيهِ ‏\"‏‏.‏",
                "headingArabic": "الصَّلاَةِ فِي مَسْجِدِ السُّوقِ",
                "headingUrdu": "بازار میں واقع مسجد میں نماز پڑھنا",
                "headingEnglish": "To offer As-Salat (the prayers) in a mosque situated in a market",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 469,
                "hadithNumber": "478, 479",
                "englishNarrator": "Narrated Ibn `Umar or Ibn `Amr  رضی اللہ عنھما :",
                "hadithEnglish": "The Prophet (ﷺ) clasped his hands, by interlacing his fingers.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اپنی انگلیوں کو ایک دوسرے میں داخل کیا ۔",
                "urduNarrator": "ہم سے حامد بن عمر نے بشر بن مفضل کے واسطہ سے بیان کیا ، کہا ہم سے عاصم بن محمد نے ، کہا ہم سے واقد بن محمد نے اپنے باپ محمد بن زید کے واسطہ سے ، انھوں نے عبداللہ بن عمر یا عبداللہ بن عمرو بن عاص رضی اللہ عنھماے کہ",
                "hadithArabic": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ ، عَنْ بِشْرٍ حَدَّثَنَا عَاصِمٌ ، حَدَّثَنَا وَاقِدٌ ، عَنِ أَبِيهِ ، عَنْ ابْنِ عُمَرَ أَوْ ابْنِ عَمْرٍو ، شَبَكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَابِعَهُ.",
                "headingArabic": "تَشْبِيكِ الأَصَابِعِ فِي الْمَسْجِدِ وَغَيْرِهِ",
                "headingUrdu": "مسجد میں یا مسجد کے باہر انگلیوں کو آپس میں ملا کر ہاتھ باندھنا",
                "headingEnglish": "To clasp one's hands by interlocking the fingers in the mosque or outside the mosque",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 470,
                "hadithNumber": "480",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما that:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"O `Abdullah bin `Amr! What will be your condition when you will be left with the sediments of (worst) people?\" (They will be in conflict with each other).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ عبداللہ بن عمرو تمہارا کیا حال ہو گا جب تم برے لوگوں میں رہ جاؤ گے اس طرح ( یعنی آپ صلی اللہ علیہ وسلم نے ایک ہاتھ کی انگلیاں دوسرے ہاتھ میں کر کے دکھلائیں ) ۔",
                "urduNarrator": "اور عاصم بن علی نے کہا ، ہم سے عاصم بن محمد نے بیان کیا کہ میں نے اس حدیث کو اپنے باپ محمد بن زید سے سنا ۔ لیکن مجھے حدیث یاد نہیں رہی تھی ۔ تو میرے بھائی واقد نے اس کو درستی سے اپنے باپ سے روایت کر کے مجھے بتایا ۔ وہ کہتے ہیں کہ عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے",
                "hadithArabic": "وَقَالَ عَاصِمُ بْنُ عَلِيٍّ حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدٍ، سَمِعْتُ هَذَا الْحَدِيثَ، مِنْ أَبِي فَلَمْ أَحْفَظْهُ، فَقَوَّمَهُ لِي وَاقِدٌ عَنْ أَبِيهِ، قَالَ سَمِعْتُ أَبِي وَهُوَ، يَقُولُ قَالَ عَبْدُ اللَّهِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَا عَبْدَ اللَّهِ بْنَ عَمْرٍو، كَيْفَ بِكَ إِذَا بَقِيتَ فِي حُثَالَةٍ مِنَ النَّاسِ بِهَذَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 471,
                "hadithNumber": "481",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A faithful believer to a faithful believer is like the bricks of a wall, enforcing each other.\" While (saying that) the Prophet (ﷺ) clasped his hands, by interlacing his fingers.",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا ایک مومن دوسرے مومن کے لیے عمارت کی طرح ہے کہ اس کا ایک حصہ دوسرے حصہ کو قوت پہنچاتا ہے ۔ اور آپ صلی اللہ علیہ وسلم نے ایک ہاتھ کی انگلیوں کو دوسرے ہاتھ کی انگلیوں میں داخل کیا ۔",
                "urduNarrator": "ہم سے خلاد بن یحییٰ نے بیان کیا ، کہا ہم سے سفیان ثوری نے ابی بردہ بن عبداللہ بن ابی بردہ سے ، انھوں نے اپنے دادا ( ابوبردہ ) سے ، انھوں نے ابوموسیٰ اشعری رضی اللہ عنہ سے ۔ انھوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي بُرْدَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ جَدِّهِ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الْمُؤْمِنَ لِلْمُؤْمِنِ كَالْبُنْيَانِ، يَشُدُّ بَعْضُهُ بَعْضًا ‏\"‏‏.‏ وَشَبَّكَ أَصَابِعَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 472,
                "hadithNumber": "482",
                "englishNarrator": "Narrates Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) led us in one of the two `Isha' prayers (Abu Huraira named that prayer but I forgot it).\" Abu Huraira added, \"He prayed two rak`at and then finished the prayer with Taslim. He stood up near a piece of wood Lying across the mosque and leaned on it in such a way as if he was angry. Then he put his right hand over the left and clasped his hands by interlacing his fingers and then put his J right cheek on the back of his left hand. The people who were in haste left the mosque through its gates. They wondered whether the prayer was reduced. And amongst them were Abu Bakr and `Umar but they hesitated to ask the Prophet. A long-handed man called Dhul- Yadain asked the Prophet, 'O Allah's Messenger (ﷺ)! Have you forgotten or has the prayer been reduced?' The Prophet (ﷺ) replied, 'I have neither forgotten nor has the prayer been reduced' The Prophet (ﷺ) added, 'Is what Dhul Yadain has said true?' They (the people) said, 'Yes, it is true.' \r\n     The Prophet (ﷺ) stood up again and led the prayer, completing the remaining prayer, forgotten by him, and performed Taslim, and then said, 'Allahu Akbar.' And then he did a prostration as he used to prostrate or longer than that. He then raised his head saying, 'Allahu Akbar; he then again said, 'Allahu Akbar', and prostrated as he used to prostrate or longer than that. Then he raised his head and said, 'Allahu Akbar.' \" (The subnarrator added, \"I think that they asked (Ibn Seereen) whether the Prophet (ﷺ) completed the prayer with Taslim. He replied, \"I heard that `Imran bin Husain had said, 'Then he (the Prophet) did Taslim.\")",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے ہمیں دوپہر کے بعد کی دو نمازوں میں سے کوئی نماز پڑھائی ۔ ( ظہر یا عصر کی ) ابن سیرین نے کہا کہ حضرت ابوہریرہ رضی اللہ عنہ نے اس کا نام تو لیا تھا ۔ لیکن میں بھول گیا ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بتلایا کہ آپ صلی اللہ علیہ وسلم نے ہمیں دو رکعت نماز پڑھا کر سلام پھیر دیا ۔ اس کے بعد ایک لکڑی کی لاٹھی سے جو مسجد میں رکھی ہوئی تھی آپ صلی اللہ علیہ وسلم ٹیک لگا کر کھڑے ہو گئے ۔ ایسا معلوم ہوتا تھا کہ جیسے آپ بہت ہی خفا ہوں اور آپ صلی اللہ علیہ وسلم نے اپنے دائیں ہاتھ کو بائیں ہاتھ پر رکھا اور ان کی انگلیوں کو ایک دوسرے میں داخل کیا اور آپ نے اپنے دائیں رخسار مبارک کو بائیں ہاتھ کی ہتھیلی سے سہارا دیا ۔ جو لوگ نماز پڑھ کر جلدی نکل جایا کرتے تھے وہ مسجد کے دروازوں سے پار ہو گئے ۔ پھر لوگ کہنے لگے کہ کیا نماز کم کر دی گئی ہے ۔ حاضرین میں ابوبکر اور عمر ( رضی اللہ عنہما ) بھی موجود تھے ۔ لیکن انہیں بھی آپ سے بولنے کی ہمت نہ ہوئی ۔ انہیں میں ایک شخص تھے جن کے ہاتھ لمبے تھے اور انہیں ذوالیدین کہا جاتا تھا ۔ انھوں نے پوچھا یا رسول اللہ ! کیا آپ صلی اللہ علیہ وسلم بھول گئے یا نماز کم کر دی گئی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہ میں بھولا ہوں اور نہ نماز میں کوئی کمی ہوئی ہے ۔ پھر آپ صلی اللہ علیہ وسلم نے لوگوں سے پوچھا ۔ کیا ذوالیدین صحیح کہہ رہے ہیں ۔ حاضرین بولے کہ جی ہاں ! یہ سن کر آپ صلی اللہ علیہ وسلم آگے بڑھے اور باقی رکعتیں پڑھیں ۔ پھر سلام پھیرا پھر تکبیر کہی اور سہو کا سجدہ کیا ۔ معمول کے مطابق یا اس سے بھی لمبا سجدہ ۔ پھر سر اٹھایا اور تکبیر کہی ۔ پھر تکبیر کہی اور دوسرا سجدہ کیا ۔ معمول کے مطابق یا اس سے بھی طویل پھر سر اٹھایا اور تکبیر کہی ، لوگوں نے باربار ابن سیرین سے پوچھا کہ کیا پھر سلام پھیرا تو وہ جواب دیتے کہ مجھے خبر دی گئی ہے کہ عمران بن حصین کہتے تھے کہ پھر سلام پھیرا ۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا ، کہا ہم سے نضر بن شمیل نے ، انھوں نے کہا کہ ہمیں عبداللہ ابن عون نے خبر دی ، انھوں نے محمد بن سیرین سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، قَالَ حَدَّثَنَا ابْنُ شُمَيْلٍ، أَخْبَرَنَا ابْنُ عَوْنٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم إِحْدَى صَلاَتَىِ الْعَشِيِّ ـ قَالَ ابْنُ سِيرِينَ سَمَّاهَا أَبُو هُرَيْرَةَ وَلَكِنْ نَسِيتُ أَنَا ـ قَالَ فَصَلَّى بِنَا رَكْعَتَيْنِ ثُمَّ سَلَّمَ، فَقَامَ إِلَى خَشَبَةٍ مَعْرُوضَةٍ فِي الْمَسْجِدِ فَاتَّكَأَ عَلَيْهَا، كَأَنَّهُ غَضْبَانُ، وَوَضَعَ يَدَهُ الْيُمْنَى عَلَى الْيُسْرَى، وَشَبَّكَ بَيْنَ أَصَابِعِهِ، وَوَضَعَ خَدَّهُ الأَيْمَنَ عَلَى ظَهْرِ كَفِّهِ الْيُسْرَى، وَخَرَجَتِ السَّرَعَانُ مِنْ أَبْوَابِ الْمَسْجِدِ فَقَالُوا قَصُرَتِ الصَّلاَةُ‏.‏ وَفِي الْقَوْمِ أَبُو بَكْرٍ وَعُمَرُ، فَهَابَا أَنْ يُكَلِّمَاهُ، وَفِي الْقَوْمِ رَجُلٌ فِي يَدَيْهِ طُولٌ يُقَالُ لَهُ ذُو الْيَدَيْنِ قَالَ يَا رَسُولَ اللَّهِ، أَنَسِيتَ أَمْ قَصُرَتِ الصَّلاَةُ قَالَ ‏\"‏ لَمْ أَنْسَ، وَلَمْ تُقْصَرْ ‏\"‏‏.‏ فَقَالَ ‏\"‏ أَكَمَا يَقُولُ ذُو الْيَدَيْنِ ‏\"‏‏.‏ فَقَالُوا نَعَمْ‏.‏ فَتَقَدَّمَ فَصَلَّى مَا تَرَكَ، ثُمَّ سَلَّمَ، ثُمَّ كَبَّرَ وَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ، ثُمَّ رَفَعَ رَأْسَهُ وَكَبَّرَ، ثُمَّ كَبَّرَ وَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ، ثُمَّ رَفَعَ رَأْسَهُ وَكَبَّرَ‏.‏ فَرُبَّمَا سَأَلُوهُ ثُمَّ سَلَّمَ فَيَقُولُ نُبِّئْتُ أَنَّ عِمْرَانَ بْنَ حُصَيْنٍ قَالَ ثُمَّ سَلَّمَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 473,
                "hadithNumber": "483",
                "englishNarrator": "Narrated Musa bin `Uqba:",
                "hadithEnglish": "\"I saw Salim bin `Abdullah رضی اللہ عنہما looking for some places on the way and prayed there. He narrated that his father used to pray there, and had seen the Prophet (ﷺ) praying at those very places.\" \r\nNarrated Nafi` on the authority of Ibn `Umar who said, \"I used to pray at those places.\" Musa the narrator added, \"I asked Salim on which he said, 'I agree with Nafi` concerning those places, except the mosque situated at the place called Sharaf Ar-Rawha.\"",
                "hadithUrdu": "میں نے سالم بن عبداللہ بن عمر رضی اللہ عنہما کو دیکھا کہ وہ ( مدینہ سے مکہ تک ) راستے میں کئی جگہوں کو ڈھونڈھ کر وہاں نماز پڑھتے اور کہتے کہ ان کے باپ حضرت عبداللہ بن عمر رضی اللہ عنہما بھی ان مقامات پر نماز پڑھا کرتے تھے ۔ اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو ان مقامات پر نماز پڑھتے ہوئے دیکھا ہے اور موسیٰ بن عقبہ نے کہا کہ مجھ سے نافع نے ابن عمر رضی اللہ عنہما کے متعلق بیان کیا کہ وہ ان مقامات پر نماز پڑھا کرتے تھے ۔ اور میں نے سالم سے پوچھا تو مجھے خوب یاد ہے کہ انھوں نے بھی نافع کے بیان کے مطابق ہی تمام مقامات کا ذکر کیا ۔ فقط مقام شرف روحاء کی مسجد کے متعلق دونوں نے اختلاف کیا ۔",
                "urduNarrator": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا کہا ہم سے فضیل بن سلیمان نے ، کہا ہم سے موسیٰ بن عقبہ نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، قَالَ حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، قَالَ رَأَيْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ يَتَحَرَّى أَمَاكِنَ مِنَ الطَّرِيقِ فَيُصَلِّي فِيهَا، وَيُحَدِّثُ أَنَّ أَبَاهُ كَانَ يُصَلِّي فِيهَا، وَأَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم يُصَلِّي فِي تِلْكَ الأَمْكِنَةِ‏.‏ وَحَدَّثَنِي نَافِعٌ عَنِ ابْنِ عُمَرَ أَنَّهُ كَانَ يُصَلِّي فِي تِلْكَ الأَمْكِنَةِ‏.‏ وَسَأَلْتُ سَالِمًا، فَلاَ أَعْلَمُهُ إِلاَّ وَافَقَ نَافِعًا فِي الأَمْكِنَةِ كُلِّهَا إِلاَّ أَنَّهُمَا اخْتَلَفَا فِي مَسْجِدٍ بِشَرَفِ الرَّوْحَاءِ‏.‏",
                "headingArabic": "الْمَسَاجِدِ الَّتِي عَلَى طُرُقِ الْمَدِينَةِ",
                "headingUrdu": "وہ مساجد جو مدینہ کے راستے میں ہیں اور وہ مقامات جہاں رسول اللہ صلی اللہ علیہ وسلم نے نماز پڑھی تھی",
                "headingEnglish": "The mosques which are on the way to Al-Madina and the places where the Prophet ﷺ had offered Salat (Prayers)",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 474,
                "hadithNumber": "484",
                "englishNarrator": "Narrrated Abdullah bin Umer رضی اللہ عنہما :",
                "hadithEnglish": "When Allah's Apostle ﷺ would perform Umrah or Hajj, where there is Dhul Hulaifah Mosque he ﷺ would return from any battle, or Hajj or Umrah, he ﷺ would alight in the depression of the Valley.  When he ﷺ would go up from the depth of the valley, he would make his she-camel kneel down at batha that is located on the outskirts of the valley in eastwards. Then, he ﷺ would spend the whole night there till the morning emerged. This place is neither near to that Mosque which is made of stones nor on that mound where the Mosque has been built because there was a strait in that place. Hadrat Abdullah would perform prayer near to it and there were some mounds of sand at its bed. Allah's Apostle ﷺ would perform prayer there. Then, a flood came there from batha and it obliterated (the trace of: Irfan) that place where Hadrat Abdullah رضی اللہ عنہما would perform the prayer.",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم جب عمرہ کے قصد سے تشریف لے گئے اور حجۃ الوداع کے موقعہ پر جب حج کے لیے نکلے تو آپ صلی اللہ علیہ وسلم نے ذوالحلیفہ میں قیام فرمایا ۔ ذوالحلیفہ کی مسجد کے قریب آپ صلی اللہ علیہ وسلم ایک ببول کے درخت کے نیچے اترے اور جب آپ کسی جہاد سے واپس ہوتے اور راستہ ذوالحلیفہ سے ہو کر گزرتا یا حج یا عمرہ سے واپسی ہوتی تو آپ وادی عتیق کے نشیبی علاقہ میں اترتے ، پھر جب وادی کے نشیب سے اوپر چڑھتے تو وادی کے بالائی کنارے کے اس مشرقی حصہ پر پڑاؤ ہوتا جہاں کنکریوں اور ریت کا کشادہ نالا ہے ۔ ( یعنی بطحاء میں ) یہاں آپ صلی اللہ علیہ وسلم رات کو صبح تک آرام فرماتے ۔ یہ مقام اس مسجد کے قریب نہیں ہے جو پتھروں کی بنی ہے ، آپ اس ٹیلے پر بھی نہیں ہوتے جس پر مسجد بنی ہوئی ہے ۔ وہاں ایک گہرا نالہ تھا عبداللہ بن عمر رضی اللہ عنہما وہیں نماز پڑھتے ۔ اس کے نشیب میں ریت کے ٹیلے تھے اور رسول اللہ صلی اللہ علیہ وسلم وہاں نماز پڑھا کرتے تھے ۔ کنکریوں اور ریت کے کشادہ نالہ کی طرف سے سیلاب نے آ کر اس جگہ کے آثار و نشانات کو پاٹ دیا ہے ، جہاں حضرت عبداللہ بن عمر رضی اللہ عنہما نماز پڑھا کرتے تھے ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر حزامی نے بیان کیا ، کہا ہم سے انس بن عیاض نے ، کہا ہم سے موسیٰ بن عقبہ نے نافع سے ، ان کو عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، قَالَ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَنْزِلُ بِذِي الْحُلَيْفَةِ حِينَ يَعْتَمِرُ، وَفِي حَجَّتِهِ حِينَ حَجَّ، تَحْتَ سَمُرَةٍ فِي مَوْضِعِ الْمَسْجِدِ الَّذِي بِذِي الْحُلَيْفَةِ، وَكَانَ إِذَا رَجَعَ مِنْ غَزْوٍ كَانَ فِي تِلْكَ الطَّرِيقِ أَوْ حَجٍّ أَوْ عُمْرَةٍ هَبَطَ مِنْ بَطْنِ وَادٍ، فَإِذَا ظَهَرَ مِنْ بَطْنِ وَادٍ أَنَاخَ بِالْبَطْحَاءِ الَّتِي عَلَى شَفِيرِ الْوَادِي الشَّرْقِيَّةِ، فَعَرَّسَ ثَمَّ حَتَّى يُصْبِحَ، لَيْسَ عِنْدَ الْمَسْجِدِ الَّذِي بِحِجَارَةٍ، وَلاَ عَلَى الأَكَمَةِ الَّتِي عَلَيْهَا الْمَسْجِدُ، كَانَ ثَمَّ خَلِيجٌ يُصَلِّي عَبْدُ اللَّهِ عِنْدَهُ، فِي بَطْنِهِ كُثُبٌ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثَمَّ يُصَلِّي، فَدَحَا السَّيْلُ فِيهِ بِالْبَطْحَاءِ حَتَّى دَفَنَ ذَلِكَ الْمَكَانَ الَّذِي كَانَ عَبْدُ اللَّهِ يُصَلِّي فِيهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 475,
                "hadithNumber": "485",
                "englishNarrator": "Narrated Abdullah bin Umer رضی اللہ عنہما :",
                "hadithEnglish": "The prophet ﷺ performed the prayer at the place where the small Mosque is located that is near to the Mosque located on the height of Rauha. Hadrat Abdullah رضی اللہ عنہما knew that place where the prophet ﷺ perform prayer. He would say: When you stand up in the Mosque to perform prayer, that place lies in your right direction. When you are going to Makkah Mukarramah, the Mosque is located on the right side of the way. There is a stone's throw or a similar distance between this small Mosque and the big one.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اس جگہ نماز پڑھی جہاں اب شرف روحاء کی مسجد کے قریب ایک چھوٹی مسجد ہے ، عبداللہ بن عمر رضی اللہ عنہما اس جگہ کی نشاندہی کرتے تھے جہاں نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھی تھی ۔ کہتے تھے کہ یہاں تمہارے دائیں طرف جب تم مسجد میں ( قبلہ رو ہو کر ) نماز پڑھنے کے لیے کھڑے ہوتے ہو ۔ جب تم ( مدینہ سے ) مکہ جاؤ تو یہ چھوٹی سی مسجد راستے کے دائیں جانب پڑتی ہے ۔ اس کے اور بڑی مسجد کے درمیان ایک پتھر کی مار کا فاصلہ ہے یا اس سے کچھ کم زیادہ ۔",
                "urduNarrator": "اور عبداللہ بن عمر رضی اللہ عنہما نے نافع سے یہ بھی بیان کیا کہ",
                "hadithArabic": "وَأَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى حَيْثُ الْمَسْجِدُ الصَّغِيرُ الَّذِي دُونَ الْمَسْجِدِ الَّذِي بِشَرَفِ الرَّوْحَاءِ، وَقَدْ كَانَ عَبْدُ اللَّهِ يَعْلَمُ الْمَكَانَ الَّذِي كَانَ صَلَّى فِيهِ النَّبِيُّ صلى الله عليه وسلم يَقُولُ ثَمَّ عَنْ يَمِينِكَ حِينَ تَقُومُ فِي الْمَسْجِدِ تُصَلِّي، وَذَلِكَ الْمَسْجِدُ عَلَى حَافَةِ الطَّرِيقِ الْيُمْنَى، وَأَنْتَ ذَاهِبٌ إِلَى مَكَّةَ، بَيْنَهُ وَبَيْنَ الْمَسْجِدِ الأَكْبَرِ رَمْيَةٌ بِحَجَرٍ أَوْ نَحْوُ ذَلِكَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 451,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=18",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=16",
                "label": "16",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=17",
                "label": "17",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=18",
                "label": "18",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=19",
                "label": "19",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=20",
                "label": "20",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=21",
                "label": "21",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=22",
                "label": "22",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=20",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=20",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=18",
        "to": 475,
        "total": 40465
    }
}