{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 286,
        "data": [
            {
                "id": 7131,
                "hadithNumber": "7441",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent for the Ansar and gathered them in a tent and said to them, \"Be patient till you meet Allah and His Apostle, and I will be on the lake-Tank (Al-Kauthar).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے انصار کو بلا بھیجا اور انہیں ایک ڈیرے میں جمع کیا اور ان سے کہا کہ صبر کرو یہاں تک کہ تم اللہ اور اس کے رسول سے آ کر ملو ۔ میں حوض پر ہوں گا ۔",
                "urduNarrator": "ہم سے عبیداللہ بن سعد بن ابراہیم نے بیان کیا ‘ انہوں نے کہا مجھ سے میرے چچا نے بیان کیا ‘ ان سے ان کے والد نے بیان کیا ‘ ان سے صالح نے بیان کیا ‘ ان سے ابن شہاب نے بیان کیا ‘ ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ، حَدَّثَنِي عَمِّي، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَرْسَلَ إِلَى الأَنْصَارِ فَجَمَعَهُمْ فِي قُبَّةٍ وَقَالَ لَهُمُ ‏ \"‏ اصْبِرُوا حَتَّى تَلْقَوُا اللَّهَ وَرَسُولَهُ، فَإِنِّي عَلَى الْحَوْضِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7132,
                "hadithNumber": "7442",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Whenever the Prophet (ﷺ) offered his Tahajjud prayer, he would say, \"O Allah, our Lord! All the praises are for You; You are the Keeper (Establisher or the One Who looks after) of the Heavens and the Earth. All the Praises are for You; You are the Light of the Heavens and the Earth and whatever is therein. You are the Truth, and Your saying is the Truth, and Your promise is the Truth, and the meeting with You is the Truth, and Paradise is the Truth, and the (Hell) Fire is the Truth. O Allah! I surrender myself to You, and believe in You, and I put my trust in You (solely depend upon). And to You I complain of my opponents and with Your Evidence I argue. So please forgive the sins which I have done in the past or I will do in the future, and also those (sins) which I did in secret or in public, and that which You know better than I. None has the right to be worshipped but You.\" Imam Bukhari said: The report of Abu Zubair from Taus contains '' '' in place of '' قَيَّامٌ‏ '' . Mujahid says: The sustainer of everything is called '' الْقَيُّومُ '' . Hadrat Umer has read '' الْقَيَّامُ '' these both are the words of praise.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم رات کے وقت تہجد کی نماز میں یہ دعا کرتے تھے ۔ ” اے اللہ ! اے ہمارے رب ! حمد تیرے ہی لیے ہے ‘ تو آسمان و زمین کا تھامنے والا ہے اور ان سب کا جو ان میں ہیں اور تیرے ہی لیے حمد ہے ‘ تو آسمان و زمین کا نور ہے اور ان سب کا جو ان میں ہیں ۔ تو سچا ہے ۔ تیرا قول سچا ‘ تیرا وعدہ سچا ‘ تیری ملاقات سچی ہے ‘جنت سچ ہے ‘ دوزخ سچ ہے ‘ قیامت سچ ہے ۔ اے اللہ ! میں تیرے سامنے جھکا ‘ تجھ پر ایمان لایا ‘ تجھ پر بھروسہ کیا ‘ تیر ے پاس اپنے جھگڑے لے گیا اور تیری ہی مدد سے مقابلہ کیا ‘ پس تو مجھے معاف کر دے ‘ میرے وہ گناہ بھی جو میں پہلے کر چکا ہوں اور وہ بھی جو بعد میں کروں گا اور وہ بھی جو میں نے پوشیدہ طور پر کئے اور وہ بھی جو ظاہر طور پر کیا اور وہ بھی جن میں تو مجھ سے زیادہ جانتا ہے ۔ تیرے سوا اور کوئی معبود نہیں ۔ ابوعبداللہ حضرت امام بخاری رحمہ اللہ نے کہا کہ قیس بن سعد اور ابو الزبیر نے طاؤس کے حوالہ سے ” قیام “ بیان کیا اور مجاہد نے ” قیوم “ کہا یعنی ہر چیز کی نگرانی کرنے والا اور عمر رضی اللہ عنہ نے ” قیام “ پڑھا اور دونوں ہی مدح کے لیے ہیں ۔",
                "urduNarrator": "مجھ سے ثابت بن محمد نے بیان کیا ‘ انہوں نے کہا ہم سے سفیان نے بیان کیا ‘ ان سے ابن جریج نے بیان کیا ‘ ان سے سلیمان احول نے بیان کیا ‘ان سے طاؤس نے بیان کیا اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي ثَابِتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ سُلَيْمَانَ الأَحْوَلِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا تَهَجَّدَ مِنَ اللَّيْلِ قَالَ ‏ \"‏ اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ، أَنْتَ قَيِّمُ السَّمَوَاتِ وَالأَرْضِ، وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، أَنْتَ الْحَقُّ، وَقَوْلُكَ الْحَقُّ، وَوَعْدُكَ الْحَقُّ، وَلِقَاؤُكَ الْحَقُّ، وَالْجَنَّةُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالسَّاعَةُ حَقٌّ، اللَّهُمَّ لَكَ أَسْلَمْتُ، وَبِكَ آمَنْتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَإِلَيْكَ خَاصَمْتُ، وَبِكَ حَاكَمْتُ، فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَأَسْرَرْتُ وَأَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، لاَ إِلَهَ إِلاَّ أَنْتَ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ قَيْسُ بْنُ سَعْدٍ وَأَبُو الزُّبَيْرِ عَنْ طَاوُسٍ قَيَّامٌ‏.‏ وَقَالَ مُجَاهِدٌ الْقَيُّومُ الْقَائِمُ عَلَى كُلِّ شَىْءٍ‏.‏ وَقَرَأَ عُمَرُ الْقَيَّامُ، وَكِلاَهُمَا مَدْحٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7133,
                "hadithNumber": "7443",
                "englishNarrator": "Narrated `Adi bin Hatim رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"There will be none among you but his Lord will speak to him, and there will be no interpreter between them nor a screen to screen Him.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تم میں کوئی ایسا نہیں ہو گا جس سے اس کا رب کلام نہ کرے ۔ اس کے اور بندے کے درمیان کوئی ترجمان نہ ہو گا اور نہ کوئی حجاب ہو گا جو اسے چھپائے رکھے ۔",
                "urduNarrator": "ہم سے یوسف بن موسیٰ نے بیان کیا ‘ کہا ہم سے اسامہ نے بیان کیا ‘ کہا مجھ سے اعمش نے بیان کیا ‘ ان سے خیشمہ بن عبدالرحمٰن نے اور ان سے عدی بن حاتم رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنِي الأَعْمَشُ، عَنْ خَيْثَمَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ سَيُكَلِّمُهُ رَبُّهُ، لَيْسَ بَيْنَهُ وَبَيْنَهُ تُرْجُمَانٌ وَلاَ حِجَابٌ يَحْجُبُهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7134,
                "hadithNumber": "7444",
                "englishNarrator": "Narrated `Abdullah bin Qais:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"(There will be) two Paradises of silver and all the utensils and whatever is therein (will be of silver); and two Paradises of gold, and its utensils and whatever therein (will be of gold), and there will be nothing to prevent the people from seeing their Lord except the Cover of Majesty over His Face in the Paradise of Eden (eternal bliss).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا دو جنتیں ایسی ہوں گی جو خود اور اس میں سارا سامان چاندی کا ہو گا اور دو جنتیں ایسی ہوں گی جو خود اور اس کا سارا سامان سونے کا ہو گا اور جنت عدن میں قوم اور اللہ کے دیدار کے درمیان صرف چادر کبریائی رکاوٹ ہو گی جو اللہ رب العزت کے منہ پر پڑی ہو گی ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ انہوں نے کہا ہم سے عبد العزیز بن عبدالصمد نے بیان کیا ‘ ان سے ابو عمران نے ‘ ان سے ابوبکر بن عبداللہ بن قیس نے ‘ ان سے ان کی والد نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ، عَنْ أَبِي عِمْرَانَ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ جَنَّتَانِ مِنْ فِضَّةٍ آنِيَتُهُمَا وَمَا فِيهِمَا، وَجَنَّتَانِ مِنْ ذَهَبٍ آنِيَتُهُمَا وَمَا فِيهِمَا، وَمَا بَيْنَ الْقَوْمِ وَبَيْنَ أَنْ يَنْظُرُوا إِلَى رَبِّهِمْ إِلاَّ رِدَاءُ الْكِبْرِ عَلَى وَجْهِهِ فِي جَنَّةِ عَدْنٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7135,
                "hadithNumber": "7445",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever takes the property of a Muslim by taking a false oath, will meet Allah Who will be angry with him.\" Then the Prophet (ﷺ) recited the Verse:-- 'Verily those who purchase a small gain at the cost of Allah's Covenant and their oaths, they shall have no portion in the Hereafter, neither will Allah speak to them, nor look at them.' (3.77)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے کسی مسلمان کا مال جھوٹی قسم کھا کر مار لیا تو وہ اللہ سے اس حال میں ملے گا کہ وہ اس پر غضبناک ہو گا ۔ عبداللہ بن مسعود رضی اللہ عنہما نے کہا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے تصدیقاً قرآن مجید کی اس آیت کی تلاوت کی ۔ ” بلاشبہ جو لوگ اللہ کے عہد اور اس کی قسموں کو تھوڑی پونجی کے بدلے بیچتے ہیں یہی وہ لوگ ہیں جن کا آخرت میں کوئی حصہ نہیں اور اللہ ان سے بات نہیں کرے گا “ آخر آیت تک ( سورۃ آل عمران )",
                "urduNarrator": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا ‘ انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ انہوں نے کہا ہم سے عبدالملک بن اعین اور جامع بن ابی راشد نے ‘ ان سے ابووائل نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَبْدُ الْمَلِكُ بْنُ أَعْيَنَ، وَجَامِعُ بْنُ أَبِي رَاشِدٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنِ اقْتَطَعَ مَالَ امْرِئٍ مُسْلِمٍ بِيَمِينٍ كَاذِبَةٍ، لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏ قَالَ عَبْدُ اللَّهِ ثُمَّ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِصْدَاقَهُ مِنْ كِتَابِ اللَّهِ جَلَّ ذِكْرُهُ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً أُولَئِكَ لاَ خَلاَقَ لَهُمْ فِي الآخِرَةِ وَلاَ يُكَلِّمُهُمُ اللَّهُ‏}‏ الآيَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7136,
                "hadithNumber": "7446",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"(There are) three (types of persons to whom) Allah will neither speak to them on the Day of Resurrections, nor look at them (They are):--(1) a man who takes a false oath that he has been offered for a commodity a price greater than what he has actually been offered; (2) and a man who takes a false oath after the `Asr (prayer) in order to grab the property of a Muslim through it; (3) and a man who forbids others to use the remaining superfluous water. To such a man Allah will say on the Day of Resurrection, 'Today I withhold My Blessings from you as you withheld the superfluous part of that (water) which your hands did not create.' \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تین آدمی ایسے ہیں جن سے اللہ تعالیٰ قیامت کے دن بات نہیں کرے گا اور نہ ان کی طرف رحمت سے دیکھے گا ۔ ایک وہ جس نے کسی سامان کے متعلق قسم کھائی کہ اسے اس نے اتنے میں خریدا ہے ‘ حالانکہ وہ جھوٹا ہے ۔ دوسرا وہ شخص جس نے عصر کے بعد جھوٹی قسم اس لیے کھائی کہ کسی مسلمان کا مال ناحق مار لے اور تیسرا وہ شخص جس نے ضرورت سے فالتو پانی مانگنے والے کو نہیں دیا تو اللہ تعالیٰ قیامت کے دن اس سے کہے گا کہ جس طرح تو نے اس زائد ضرورت فالتو چیز سے دوسرے کو روکا جسے تیر ے ہاتھوں نے بنایا بھی نہیں تھا ‘ میں بھی تجھے اپنا فضل نہیں دوں گا ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے عمرو بن دینار نے ‘ ان سے ابوصالح سمان نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ وَلاَ يَنْظُرُ إِلَيْهِمْ رَجُلٌ حَلَفَ عَلَى سِلْعَةٍ لَقَدْ أَعْطَى بِهَا أَكْثَرَ مِمَّا أَعْطَى وَهْوَ كَاذِبٌ، وَرَجُلٌ حَلَفَ عَلَى يَمِينٍ كَاذِبَةٍ بَعْدَ الْعَصْرِ لِيَقْتَطِعَ بِهَا مَالَ امْرِئٍ مُسْلِمٍ، وَرَجُلٌ مَنَعَ فَضْلَ مَاءٍ فَيَقُولُ اللَّهُ يَوْمَ الْقِيَامَةِ، الْيَوْمَ أَمْنَعُكَ فَضْلِي، كَمَا مَنَعْتَ فَضْلَ مَا لَمْ تَعْمَلْ يَدَاكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7137,
                "hadithNumber": "7447",
                "englishNarrator": "Narrated Abu Bakra رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Time has come back to its original state which it had when Allah created the Heavens and the Earth, the year is twelve months, of which four are sacred; (and out of these four) three are in succession, namely, Dhul-Qa'da, Dhul-Hijja and Muharram, and (the fourth one) Rajab Mudar which is between Jumad (Ath-Tham) and Sha'ban.\" The Prophet (ﷺ) then asked us, \"Which month is this?\" We said, \"Allah and His Apostle know (it) better.\" He kept quiet so long that we thought he might call it by another name. Then he said, \"Isn't it Dhul-Hijja?\" We said, \"Yes.\" He asked \"What town is this?\" We said, \"Allah and His Apostle know (it) better.' Then he kept quiet so long that we thought he might call it by another name. He then said, \"Isn't it the (forbidden) town (Mecca)?\" We said, \"Yes.\" He asked, \"What is the day today?\" We said, \"Allah and His Apostle know (it) better. Then he kept quiet so long that we thought that he might call it by another name. Then he said, \"Isn't it the Day of An-Nahr (slaughtering of sacrifices)?\" We said, \"Yes.\" Then he said, \"Your blood (lives), your properties,\" (the sub narrator Muhammad, said: I think he also said): \"..and your honor) are as sacred to one another like the sanctity of this Day of yours, in this town of yours, in this month of yours. You shall meet your Lord and He will ask you about your deeds. Beware! Don't go astray after me by striking the necks of one another. Lo! It is incumbent upon those who are present to inform it to those who are absent for perhaps the informed one might comprehend it (understand it) better than some of the present audience.\" Whenever the sub-narrator Muhammad mentioned that statement, he would say, \"The Prophet (ﷺ) said the truth.\") And then the Prophet (ﷺ) added, \"No doubt! Haven't I conveyed Allah's Message to you! No doubt! Haven't I conveyed Allah's Message to you?\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا زمانہ اپنی اصلی قدیم ہیئت پر گھوم کر آ گیا ہے جس پر اللہ تعالیٰ نے زمین و آسمان کو پیدا کیا تھا ۔ سال بارہ مہینے کا ہوتا ہے جن میں چار مہینے حرمت والے مہینے ہیں ۔ تین مسلسل یعنی ذیقعدہ ‘ ذی الحجہ اور محرم اور رجب مضر جو جمادی الاخریٰ اور شعبان کے درمیان میں آتا ہے ۔ پھر آپ نے پوچھا کہ یہ کون سا مہینہ ہے ؟ ہم نے کہا کہ اللہ اور اس کے رسول کو زیادہ علم ہے ۔ آپ خاموش ہو گئے اور ہم نے سمجھا کہ آپ اس کا کوئی اور نام رکھیں گے لیکن آپ نے فرمایا کیا یہ ذی الحجہ نہیں ہے ؟ ہم نے کہا کیوں نہیں ۔ پھر فرمایا یہ کون سا شہر ہے ؟ ہم نے کہا اللہ اور اس کے رسول کو زیادہ علم ہے پھر آپ خاموش ہو گئے اور ہم نے سمجھا کہ آپ اس کا کوئی اور نام رکھیں گے لیکن آپ نے فرمایا کیا یہ بلدہ طیبہ ( مکہ ) نہیں ہے ؟ ہم نے عرض کیا کیوں نہیں ۔ پھر فرمایا یہ کون سا دن ہے ؟ ہم نے عرض کیا اللہ اور اس کے رسول کو زیادہ علم ہے ۔ پھر آپ خاموش ہو گئے ہم نے سمجھا کہ آپ صلی اللہ علیہ وسلم اس کا کوئی اور نام رکھیں گے لیکن آپ نے فرمایا کیا یہ یوم النحر ( قربانی کا دن ) نہیں ہے ؟ ہم نے کہا کیوں نہیں پھر فرمایا کہ پھر تمہارا خون اور تمہارے اموال ۔ محمد نے بیان کیا کہ مجھے خیال ہے کہ یہ بھی کہا کہ اور تمہاری عزت تم پر اسی طرح حرمت والے ہیں جیسے تمہارے اس دن کی حرمت تمہارے اس شہر اور اس مہینے میں ہے اور عنقریب تم اپنے رب سے ملو گے اور وہ تمہارے اعمال کے متعلق تم سے سوال کرے گا ۔ آگاہ ہو جاؤ کہ میرے بعد گمراہ نہ ہو جانا کہ ایک دوسر ے کو قتل کرنے لگو ۔ آگاہ ہو جاؤ ! جو موجود ہیں وہ غیر حاضروں کو میری یہ بات پہنچا دیں ۔ شاید کوئی جسے بات پہنچائی گئی ہو وہ یہاں سننے والے سے زیادہ محفوظ رکھنے والا ہو ۔ چنانچہ محمد بن سیرین جب اس کا ذکر کرتے تو کہتے کہ آنحضرت صلی اللہ علیہ وسلم نے سچ فرمایا ۔ پھر آپ نے فرمایا ہاں کیا میں نے پہنچا دیا ۔ ہاں ! کیا میں نے پہنچا دیا ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ‘ انہوں نے کہا ہم سے عبدالوہاب نے بیان کیا ‘ انہوں نے کہا ہم سے ایوب سختیانی نے بیان کیا ‘ ان سے محمد بن سیرین نے بیان کیا ‘ ان سے عبدالرحمٰن بن ابی بکر ہ نے بیان کیا اور ان سے ابو بکرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنِ ابْنِ أَبِي بَكْرَةَ، عَنْ أَبِي بَكْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الزَّمَانُ قَدِ اسْتَدَارَ كَهَيْئَتِهِ يَوْمَ خَلَقَ اللَّهُ السَّمَوَاتِ وَالأَرْضَ، السَّنَةُ اثْنَا عَشَرَ شَهْرًا، مِنْهَا أَرْبَعَةٌ حُرُمٌ ثَلاَثٌ مُتَوَالِيَاتٌ ذُو الْقَعَدَةِ وَذُو الْحَجَّةِ وَالْمُحَرَّمُ، وَرَجَبُ مُضَرَ الَّذِي بَيْنَ جُمَادَى وَشَعْبَانَ، أَىُّ شَهْرٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ يُسَمِّيهِ بِغَيْرِ اسْمِهِ قَالَ ‏\"‏ أَلَيْسَ ذَا الْحَجَّةِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ أَىُّ بَلَدٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ قَالَ ‏\"‏ أَلَيْسَ الْبَلْدَةَ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَأَىُّ يَوْمٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ قَالَ ‏\"‏ أَلَيْسَ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ ـ قَالَ مُحَمَّدٌ وَأَحْسِبُهُ قَالَ وَأَعْرَاضَكُمْ ـ عَلَيْكُمْ حَرَامٌ، كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا، وَسَتَلْقَوْنَ رَبَّكُمْ فَيَسْأَلُكُمْ عَنْ أَعْمَالِكُمْ، أَلاَ فَلاَ تَرْجِعُوا بَعْدِي ضُلاَّلاً، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ، أَلاَ لِيُبَلِّغِ الشَّاهِدُ الْغَائِبَ، فَلَعَلَّ بَعْضَ مَنْ يَبْلُغُهُ أَنْ يَكُونَ أَوْعَى مِنْ بَعْضِ مَنْ سَمِعَهُ ‏\"‏‏.‏ فَكَانَ مُحَمَّدٌ إِذَا ذَكَرَهُ قَالَ صَدَقَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ أَلاَ هَلْ بَلَّغْتُ أَلاَ هَلْ بَلَّغْتُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7138,
                "hadithNumber": "7448",
                "englishNarrator": "Narrated Usama رضی اللہ عنہ :",
                "hadithEnglish": "A son of one of the daughters of the Prophet (ﷺ) was dying, so she sent a person to call the Prophet. He sent (her a message), \"What ever Allah takes is for Him, and whatever He gives is for Him, and everything has a limited fixed term (in this world) so she should be patient and hope for Allah's reward.\" She then sent for him again, swearing that he should come. Allah's Messenger (ﷺ) got up, and so did Mu`adh bin Jabal, Ubai bin Ka`b and 'Ubada bin As-Samit رضی اللہ عنہ . When he entered (the house), they gave the child to Allah's Messenger (ﷺ) while its breath was disturbed in his chest. (The sub-narrator said: I think he said, \"...as if it was a water skin.\") Allah's Messenger (ﷺ) started weeping whereupon Sa`d bin 'Ubada رضی اللہ عنہ said, \"Do you weep?\" The Prophet (ﷺ) said, \"Allah is merciful only to those of His slaves who are merciful (to others).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی ایک صاحبزادی ( حضرت زینب رضی اللہ عنہا ) کا لڑکا جاں کنی کے عالم میں تھا تو انہوں نے آنحضرت صلی اللہ علیہ وسلم کو بلا بھیجا ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں کہلایا کہ اللہ ہی کا وہ ہے جو وہ لیتا ہے اور وہ بھی جسے وہ دیتا ہے اور سب کے لیے ایک مدت مقرر ہے ‘پس صبر کرو اور اسے ثواب کا کام سمجھو ۔ لیکن انہوں نے پھر دوبارہ بلا بھیجا اور قسم دلائی ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم اٹھے اور میں بھی آپ کے ساتھ چلا ۔ معاذ بن جبل ‘ ابی بن کعب اور عبادہ بن صامت رضی اللہ عنہ بھی ساتھ تھے ۔ جب ہم صاحبزادی کے گھر میں داخل ہوئے تو لوگوں نے بچے کو آنحضرت صلی اللہ علیہ وسلم کو گود میں دے دیا ۔ اس وقت بچہ کا سانس اکھڑ رہا تھا ۔ ایسا معلوم ہوتا تھا جیسا پرانی مشک ۔ آنحضرت صلی اللہ علیہ وسلم یہ دیکھ کر رودئیے تو سعد بن عبادہ رضی اللہ عنہ نے عرض کیا ‘ آپ روتے ہیں ! آنحضرت صلی اللہ علیہ وسلم نے فرمایا اللہ اپنے بندوں میں رحم کرنے والوں پر ہی رحم کھا تا ہے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے عبد الواحد بن زیاد نے بیان کیا ‘ کہا ہم سے عاصم احول نے بیان کیا ‘ ان سے ابوعثمان نہدی نے اور ان سے اسامہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا عَاصِمٌ، عَنْ أَبِي عُثْمَانَ، عَنْ أُسَامَةَ، قَالَ كَانَ ابْنٌ لِبَعْضِ بَنَاتِ النَّبِيِّ صلى الله عليه وسلم يَقْضِي، فَأَرْسَلَتْ إِلَيْهِ أَنْ يَأْتِيَهَا فَأَرْسَلَ ‏\"‏ إِنَّ لِلَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلٌّ إِلَى أَجَلٍ مُسَمًّى، فَلْتَصْبِرْ وَلْتَحْتَسِبْ ‏\"‏‏.‏ فَأَرْسَلَتْ إِلَيْهِ فَأَقْسَمَتْ عَلَيْهِ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقُمْتُ مَعَهُ وَمُعَاذُ بْنُ جَبَلٍ وَأُبَىُّ بْنُ كَعْبٍ وَعُبَادَةُ بْنُ الصَّامِتِ، فَلَمَّا دَخَلْنَا نَاوَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم الصَّبِيَّ وَنَفْسُهُ تَقَلْقَلُ فِي صَدْرِهِ ـ حَسِبْتُهُ قَالَ ـ كَأَنَّهَا شَنَّةٌ، فَبَكَى رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ سَعْدُ بْنُ عُبَادَةَ أَتَبْكِي فَقَالَ ‏\"‏ إِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ ‏\"‏‏.‏",
                "headingArabic": "مَا جَاءَ فِي قَوْلِ اللَّهِ تَعَالَى ‏{‏إِنَّ رَحْمَةَ اللَّهِ قَرِيبٌ مِنَ الْمُحْسِنِينَ}",
                "headingUrdu": "’’بے شک اللہ کی رحمت نیکی کرنے والوں کے قریب ہے۔‘‘",
                "headingEnglish": "“…Surely, Allah’s Mercy is near unto the good-doers.”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7139,
                "hadithNumber": "7449",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Paradise and Hell (Fire) quarrelled in the presence of their Lord. Paradise said, 'O Lord! What is wrong with me that only the poor and humble people enter me ?' Hell (Fire) said, I have been favored with the arrogant people.' So Allah said to Paradise, 'You are My Mercy,' and said to Hell, 'You are My Punishment which I inflict upon whom I wish, and I shall fill both of you.'\" The Prophet added, \"As for Paradise, (it will be filled with good people) because Allah does not wrong any of His created things, and He creates for Hell (Fire) whomever He will, and they will be thrown into it, and it will say thrice, 'Is there any more, till Allah (will put) His Foot over it and it will become full and its sides will come close to each other and it will say, 'Qat! Qat! Qat! (Enough! Enough! Enough!) .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جنت ودوزخ نے اپنے رب کے حضور میں جھگڑا کیا ۔ جنت نے کہا اے رب ! کیا حال ہے کہ مجھ میں کمزور اور گرے پڑے لوگ ہی داخل ہوں گے اور دوزخ نے کہا کہ مجھ میں تو داخلہ کے لیے متکبروں کو خاص کر دیا گیا ہے ۔ اس پر اللہ تعالیٰ نے جنت سے کہا کہ تو میری رحمت ہے اور جہنم سے کہا کہ تو میرا عذاب ہے ۔ تیرے ذریعہ میں جسے چاہتا ہوں اس میں مبتلا کرتا ہوں اور تم میں سے ہر ایک کی بھرتی ہونے والی ہے ۔ کہا کہ جہاں تک جنت کا تعلق ہے تو اللہ اپنی مخلوق میں کسی پر ظلم نہیں کرے گا اور دوزخ کی اس طرح سے کہ اللہ اپنی مخلوق میں سے جس کو چاہے گا دوزخ کے لئے پیدا کرے گا وہ اس میں ڈالی جائے گی اس کے بعد بھی دوزخ کہے گی اور کچھ مخلوق ہے ( میں ابھی خالی ہوں ) تین بار ایسا ہی ہو گا ۔ آخر پر وردگار اپنا پاؤں اس میں رکھ دے گا ۔ اس وقت وہ بھر جائے گی ۔ ایک پر ایک الٹ کر سمٹ جائے گی ۔ کہنے لگے گی بس بس بس میں بھر گئی ۔",
                "urduNarrator": "ہم سے عبیداللہ بن سعد بن ابراہیم نے بیان کیا ‘کہا ہم سے یعقوب بن ابراہیم نے ‘کہا مجھ سے میرے والد نے ‘ ان سے صالح بن کیسان نے ‘ ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ، حَدَّثَنَا يَعْقُوبُ، حَدَّثَنَا أَبِي، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ اخْتَصَمَتِ الْجَنَّةُ وَالنَّارُ إِلَى رَبِّهِمَا فَقَالَتِ الْجَنَّةُ يَا رَبِّ مَا لَهَا لاَ يَدْخُلُهَا إِلاَّ ضُعَفَاءُ النَّاسِ وَسَقَطُهُمْ‏.‏ وَقَالَتِ النَّارُ ـ يَعْنِي ـ أُوثِرْتُ بِالْمُتَكَبِّرِينَ‏.‏ فَقَالَ اللَّهُ تَعَالَى لِلْجَنَّةِ أَنْتِ رَحْمَتِي‏.‏ وَقَالَ لِلنَّارِ أَنْتِ عَذَابِي أُصِيبُ بِكِ مَنْ أَشَاءُ، وَلِكُلِّ وَاحِدَةٍ مِنْكُمَا مِلْؤُهَا ـ قَالَ ـ فَأَمَّا الْجَنَّةُ فَإِنَّ اللَّهَ لاَ يَظْلِمُ مِنْ خَلْقِهِ أَحَدًا، وَإِنَّهُ يُنْشِئُ لِلنَّارِ مَنْ يَشَاءُ فَيُلْقَوْنَ فِيهَا فَتَقُولُ هَلْ مِنْ مَزِيدٍ‏.‏ ثَلاَثًا، حَتَّى يَضَعَ فِيهَا قَدَمَهُ فَتَمْتَلِئُ وَيُرَدُّ بَعْضُهَا إِلَى بَعْضٍ وَتَقُولُ قَطْ قَطْ قَطْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7140,
                "hadithNumber": "7450",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Some people will be scorched by Hell (Fire) as a punishment for sins they have committed, and then Allah will admit them into Paradise by the grant of His Mercy. These people will be called, 'Al-Jahannamiyyin' (the people of Hell). Hadrat Anas رضی اللہ عنہ has reported from the prophet ﷺ.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ کچھ لوگ ان گناہوں کی وجہ سے جو انہوں نے کئے ہوں گے ‘ آگ سے جھلس جائیں گے ۔ یہ ان کی سزا ہو گی ۔ پھر اللہ اپنی رحمت سے انہیں جنت میں داخل کرے گا اور انہیں ” جھنمیین “ کہا جائے گا ۔ اور ہمام نے بیان کیا ‘ ان سے قتادہ نے ‘ ان سے انس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے یہی حدیث بیان کی ۔",
                "urduNarrator": "ہم سے حفص بن عمر حوضی نے بیان کیا ‘ کہا ہم سے ہشام دستوائی نے بیان کیا ‘ ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيُصِيبَنَّ أَقْوَامًا سَفْعٌ مِنَ النَّارِ بِذُنُوبٍ أَصَابُوهَا عُقُوبَةً، ثُمَّ يُدْخِلُهُمُ اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَتِهِ يُقَالُ لَهُمُ الْجَهَنَّمِيُّونَ ‏\"‏‏.‏ وَقَالَ هَمَّامٌ حَدَّثَنَا قَتَادَةٌ حَدَّثَنَا أَنَسٌ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7141,
                "hadithNumber": "7451",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "A Jewish Rabbi came to Allah's Messenger (ﷺ) and said, \"O Muhammad! Allah will put the Heavens on one finger and the earth on one finger, and the trees and the rivers on one finger, and the rest of the creation on one finger, and then will say, pointing out with His Hand, 'I am the King.' \"On that Allah's Apostle smiled and said, \"No just estimate have they made of Allah such as due to Him. (39.67)",
                "hadithUrdu": "ایک یہودی عالم رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور کہا ، اے محمد ! قیامت کے دن اللہ تعالیٰ آسمانوں کو ایک انگلی پر ، زمین کو ایک انگلی پر ، پہاڑوں کو ایک انگلی پر ، درخت اور نہروں کو ایک انگلی پر اور تمام مخلوقات کو ایک انگلی پر رکھے گا ۔ پھر اپنے ہاتھ سے اشارہ کر کے کہے گا کہ میں ہی بادشاہ ہوں ۔ اس پر آپ صلی اللہ علیہ وسلم ہنس دئیے اور یہ آیت پڑھی وما قدرو اللہ حق قدرہ جو سورۃ الزمر میں ہے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے اعمش نے ، ان سے ابراہیم نے ، ان سے علقمہ نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ جَاءَ حَبْرٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا مُحَمَّدُ إِنَّ اللَّهَ يَضَعُ السَّمَاءَ عَلَى إِصْبَعٍ، وَالأَرْضَ عَلَى إِصْبَعٍ، وَالْجِبَالَ عَلَى إِصْبَعٍ، وَالشَّجَرَ وَالأَنْهَارَ عَلَى إِصْبَعٍ، وَسَائِرَ الْخَلْقِ عَلَى إِصْبَعٍ، ثُمَّ يَقُولُ بِيَدِهِ أَنَا الْمَلِكُ فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ ‏{‏وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ‏}‏‏\"‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏إِنَّ اللَّهَ يُمْسِكُ السَّمَوَاتِ وَالأَرْضَ أَنْ تَزُولاَ}",
                "headingUrdu": "’’بے شک اللہ آسمانوں اور زمین کو اپنی گرفت میں رکھتا ہے کہ وہ اپنی جگہ سے ہٹ نہ جائیں۔‘‘",
                "headingEnglish": "“Verily, Allah grasps the heavens and the earth lest they move away from their places…”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7142,
                "hadithNumber": "7452",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Once I stayed overnight at the house of (my aunt ) Maimuna رضی اللہ عنہا while the Prophet (ﷺ) was with her, to see how was the night prayer of Allah s Apostle Allah's Messenger (ﷺ) talked to his wife for a while and then slept. When it was the last third of the night (or part of it), the Prophet (ﷺ) got up and looked towards the sky and recited the Verse:-- 'Verily! In the creation of the Heavens and the Earth....there are indeed signs for the men of understanding.' (3.190) Then He got up and performed the ablution, brushed his teeth and offered eleven rak`at. Then Bilal رضی اللہ عنہ pronounced the Adhan whereupon the Prophet (ﷺ) offered a two-rak`at (Sunna) prayer and went out to lead the people in Fajr (morning compulsory congregational prayer.",
                "hadithUrdu": "ایک رات میں نے ام المؤمنین میمونہ رضی اللہ عنہا کے گھر گزاری اس رات نبی کریم صلی اللہ علیہ وسلم انہیں کے پاس تھے ۔ میرا مقصد رات میں آنحضرت صلی اللہ علیہ وسلم کی نماز دیکھنا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے تھوڑی دیر تو اپنی اہلیہ کے ساتھ بات چیت کی ‘ پھر سو گئے ۔ جب رات کا آخری تہائی حصہ یابعض حصہ باقی رہ گیا تو آپ اٹھ بیٹھے اور آسمان کی طرف دیکھ کر یہ آیت پڑھی ۔ ” بلاشبہ آسمانوں اور زمین کی پیدائش میں عقل رکھنے والوں کے لیے نشانیاں ہیں “ پھر اٹھ کر آپ نے وضو کیا اور مسواک کی ۔ پھر گیارہ رکعتیں پڑھیں ۔ پھر بلال رضی اللہ عنہ نے نماز کے لیے اذان دی اور آپ نے دو رکعت نماز پڑھی ‘ پھر باہر آ گئے اور لوگوں کو صبح کی نماز پڑھائی ۔",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا ‘ انہوں نے کہا ہم کو محمد بن جعفر نے خبر دی ‘ انہوں نے کہا مجھے شریک بن عبداللہ بن ابی نمر نے خبر دی ‘ انہیں کریب نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنِي شَرِيكُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ بِتُّ فِي بَيْتِ مَيْمُونَةَ لَيْلَةً وَالنَّبِيُّ صلى الله عليه وسلم عِنْدَهَا لأَنْظُرَ كَيْفَ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم بِاللَّيْلِ، فَتَحَدَّثَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ أَهْلِهِ سَاعَةً ثُمَّ رَقَدَ، فَلَمَّا كَانَ ثُلُثُ اللَّيْلِ الآخِرُ أَوْ بَعْضُهُ قَعَدَ فَنَظَرَ إِلَى السَّمَاءِ فَقَرَأَ ‏{‏إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ‏}‏ إِلَى قَوْلِهِ ‏{‏لأُولِي الأَلْبَابِ‏}‏ ثُمَّ قَامَ فَتَوَضَّأَ وَاسْتَنَّ، ثُمَّ صَلَّى إِحْدَى عَشْرَةَ رَكْعَةً، ثُمَّ أَذَّنَ بِلاَلٌ بِالصَّلاَةِ فَصَلَّى رَكْعَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى لِلنَّاسِ الصُّبْحَ‏.‏",
                "headingArabic": "مَا جَاءَ فِي تَخْلِيقِ السَّمَوَاتِ وَالأَرْضِ وَغَيْرِهَا مِنَ الْخَلاَئِقِ",
                "headingUrdu": "آسمانوں، زمین اور دیگر مخلوقات کی تخلیق",
                "headingEnglish": "The creation of the heavens, earth and other created beings",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7143,
                "hadithNumber": "7453",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"When Allah created the creations, He wrote with Him on His Throne: 'My Mercy has preceded My Anger.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب اللہ تعالیٰ مخلوق کو پیدا کر چکا تو عرش کے اوپر اپنے پاس یہ لکھا کہ میری رحمت میرے غصہ سے آگے بڑھ گئی ہے ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا ہم سے امام مالک نے بیان کیا ‘ ان سے ابوالزناد نے ‘ ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَمَّا قَضَى اللَّهُ الْخَلْقَ كَتَبَ عِنْدَهُ فَوْقَ عَرْشِهِ، إِنَّ رَحْمَتِي سَبَقَتْ غَضَبِي ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ تَعَالَى ‏{‏وَلَقَدْ سَبَقَتْ كَلِمَتُنَا لِعِبَادِنَا الْمُرْسَلِينَ}",
                "headingUrdu": "’’اور بے شک ہمارا کلام ہمارے بندوں یعنی رسولوں کے لیے پرانا ہوچکا ہے۔‘‘",
                "headingEnglish": "“And, verily, Our Word has gone forth of old for Our slaves – the Messengers”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7144,
                "hadithNumber": "7454",
                "englishNarrator": "Narrated `Abdullah bin Mas`ud رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) the true and truly inspired, narrated to us, \"The creation of everyone of you starts with the process of collecting the material for his body within forty days and forty nights in the womb of his mother. Then he becomes a clot of thick blood for a similar period (40 days) and then he becomes like a piece of flesh for a similar period. Then an angel is sent to him (by Allah) and the angel is allowed (ordered) to write four things; his livelihood, his (date of) death, his deeds, and whether he will be a wretched one or a blessed one (in the Hereafter) and then the soul is breathed into him. So one of you may do (good) deeds characteristic of the people of Paradise so much that there is nothing except a cubit between him and Paradise but then what has been written for him decides his behavior and he starts doing (evil) deeds characteristic of the people of Hell (Fire) and (ultimately) enters Hell (Fire); and one of you may do (evil) deeds characteristic of the people of Hell (Fire) so much so that there is nothing except a cubit between him and Hell (Fire), then what has been written for him decides his behavior and he starts doing (good) deeds characteristic of the people of Paradise and ultimately) enters Paradise.\" (See Hadith No. 430, Vol. 4)",
                "hadithUrdu": "ہم سے رسول اللہ صلی اللہ علیہ وسلم نے بیان فرمایا جو صادق ومصدق ہیں کہ انسان کا نطفہ ماں کے پیٹ میں چالیس دن اور راتوں تک جمع رہتا ہے پھر وہ خون کی پھٹکی بن جاتا ہے ۔ پھر وہ گوشت کا لوتھڑا ہو جاتا ہے پھر اس کے بعد فرشتہ بھیجا جاتا ہے اور اسے چار چیزوں کا حکم ہوتا ہے ۔ چنانچہ وہ اس کی روزی ‘ اس کی موت ‘ اس کا عمل اور یہ کہ وہ بدبخت ہے یا نیک بخت لکھ لیتا ہے ۔ پھر اس میں روح پھونکتا ہے اور تم میں سے ایک شخص جنت والوں کے سے عمل کرتا ہے اور جب اس کے اور جنت کے درمیان صرف ایک ہاتھ کا فرق رہ جاتا ہے تو اس کی تقدیر غالب آتی ہے اور وہ دوزخ والوں کے عمل کرنے لگتا ہے اور دوزخ میں داخل ہوتا ہے ۔ اسی طرح ایک شخص دوزخ والوں کے عمل کرتا ہے اور جب اس کے اور دوزخ کے درمیان صرف ایک بالشت کا فاصلہ رہ جاتا ہے تو تقدیر غالب آتی ہے اور جنت والوں کے کام کرنے لگتا ہے ۔ پھر جنت میں داخل ہوتا ہے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ‘ انہوں نے کہا ہم سے شعبہ نے بیان کیا ‘ انہوں نے کہا ہم سے اعمش نے بیان کیا ‘ انہوں نے کہا زید بن وہب سے سنا اور انہوں نے عبداللہ بن مسعود رضی اللہ عنہما سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا الأَعْمَشُ، سَمِعْتُ زَيْدَ بْنَ وَهْبٍ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ ـ رضى الله عنه ـ حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ الصَّادِقُ الْمَصْدُوقُ ‏ \"‏ إِنَّ خَلْقَ أَحَدِكُمْ يُجْمَعُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا وَأَرْبَعِينَ لَيْلَةً، ثُمَّ يَكُونُ عَلَقَةً مِثْلَهُ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَهُ، ثُمَّ يُبْعَثُ إِلَيْهِ الْمَلَكُ فَيُؤْذَنُ بِأَرْبَعِ كَلِمَاتٍ، فَيَكْتُبُ رِزْقَهُ وَأَجَلَهُ وَعَمَلَهُ وَشَقِيٌّ أَمْ سَعِيدٌ ثُمَّ يَنْفُخُ فِيهِ الرُّوحَ، فَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ، حَتَّى لاَ يَكُونُ بَيْنَهَا وَبَيْنَهُ إِلاَّ ذِرَاعٌ، فَيَسْبِقُ عَلَيْهِ الْكِتَابُ، فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُ النَّارَ، وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ، حَتَّى مَا يَكُونُ بَيْنَهَا وَبَيْنَهُ إِلاَّ ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ، فَيَعْمَلُ عَمَلَ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7145,
                "hadithNumber": "7455",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"O Gabriel, what prevents you. from visiting us more often than you do?\" Then this Verse was revealed:--'And we angels descend not but by Command of your Lord. To Him belongs what is before us and what is behind us..' (19.64) So this was the answer to Muhammad.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اے جبرائیل ! آپ کو ہمارے پاس اس سے زیادہ آنے میں کیا رکاوٹ ہے جتنا آپ آتے رہتے ہیں ؟ اس پر یہ آیت سورۃ مریم کی نازل ہوئی ۔ ” اور ہم نازل نہیں ہوتے لیکن آپ کے رب کے حکم سے ‘ اسی کا ہے وہ سب کچھ جو ہمارے سامنے ہے اور جو ہمارے پیچھے ہے “ الآیہ ۔ بیان کیا کہ محمد صلی اللہ علیہ وسلم کو یہی جواب آیت میں اترا ۔",
                "urduNarrator": "ہم سے خلاد بن یحییٰ نے بیان کیا ‘ کہا ہم سے عمر بن زر نے بیان کیا ‘ کہا ہم نے اپنے والد ذربن عبداللہ سے سنا ‘ وہ سعید بن جبیر سے بیان کرتے تھے اور وہ ابن عباس رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا عُمَرُ بْنُ ذَرٍّ، سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ يَا جِبْرِيلُ مَا يَمْنَعُكَ أَنْ تَزُورَنَا أَكْثَرَ مِمَّا تَزُورُنَا ‏\"‏‏.‏ فَنَزَلَتْ ‏{‏وَمَا نَتَنَزَّلُ إِلاَّ بِأَمْرِ رَبِّكَ لَهُ مَا بَيْنَ أَيْدِينَا وَمَا خَلْفَنَا‏}‏ إِلَى آخِرِ الآيَةِ‏.‏ قَالَ هَذَا كَانَ الْجَوَابَ لِمُحَمَّدٍ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7146,
                "hadithNumber": "7456",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "While I was walking with Allah's Messenger (ﷺ) in one of the fields of Medina and he was walking leaning on a stick, he passed a group of Jews. Some of them said to the others, \"Ask him (the Prophet) about the spirit.\" Others said, \"Do not ask him.\" But they asked him and he stood leaning on the stick and I was standing behind him and I thought that he was being divinely inspired. Then he said, \"They ask you concerning the spirit say: The spirit, its knowledge is with My Lord. And of knowledge you (O men!) have been given only a little.\" ...(17.85) On that some of the Jews said to the others, \"Didn't we tell you not to ask?\"",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مدینہ کے ایک کھیت میں جا رہا تھا اور آپ صلی اللہ علیہ وسلم ایک کجھور کی چھڑی پر ٹیکا لیتے جاتے تھے ۔ پھر آپ یہودیوں کی ایک جماعت سے گزرے تو ان میں سے بعض نے بعض سے کہا کہ ان سے روح کے متعلق پوچھو اور بعض نے کہا کہ اس کے متعلق مت پوچھو ۔ آخر انہوں نے پوچھا تو آپ چھڑی پر ٹیک لگا کر کھڑے ہو گئے اور میں آپ کے پیچھے تھا ۔ میں نے سمجھ لیا کہ آپ پر وحی نازل ہو رہی ہے ۔ چنانچہ آپ نے یہ آیت پڑھی اور لوگ آپ سے روح کے متعلق پوچھتے ہیں ، کہہ دیجئیے کہ روح میرے رب کے امر مٰن سے اور تمہیں علم بہت تھوڑا دیا گیا ہے ۔ ( سورۃ بنی اسرائیل ) اس پر بعض یہودیوں نے اپنے ساتھیوں سے کہا کہ ہم نے کہا نہ تھا کہ مت پوچھو ۔",
                "urduNarrator": "ہم سے یحییٰ بن جعفر نے بیان کیا ، کہا ہم سے وکیع بن جراح نے بیان کیا ، ان سے اعمش نے ، ان سے ابراہیم نخعی نے ، ان سے علقمہ نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنْتُ أَمْشِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي حَرْثٍ بِالْمَدِينَةِ وَهْوَ مُتَّكِئٌ عَلَى عَسِيبٍ، فَمَرَّ بِقَوْمٍ مِنَ الْيَهُودِ فَقَالَ بَعْضُهُمْ لِبَعْضٍ سَلُوهُ عَنِ الرُّوحِ‏.‏ وَقَالَ بَعْضُهُمْ لاَ تَسْأَلُوهُ عَنِ الرُّوحِ‏.‏ فَسَأَلُوهُ فَقَامَ مُتَوَكِّئًا عَلَى الْعَسِيبِ وَأَنَا خَلْفَهُ، فَظَنَنْتُ أَنَّهُ يُوحَى إِلَيْهِ فَقَالَ ‏{‏وَيَسْأَلُونَكَ عَنِ الرُّوحِ قُلِ الرُّوحُ مِنْ أَمْرِ رَبِّي وَمَا أُوتِيتُمْ مِنَ الْعِلْمِ إِلاَّ قَلِيلاً‏}‏ فَقَالَ بَعْضُهُمْ لِبَعْضٍ قَدْ قُلْنَا لَكُمْ لاَ تَسْأَلُوهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7147,
                "hadithNumber": "7457",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Allah guarantees to the person who carries out Jihad for His Cause and nothing compelled him to go out but the Jihad in His Cause, and belief in His Words, that He will either admit him into Paradise or return him with his reward or the booty he has earned to his residence from where he went out.\" (See Hadith No. 555).",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا جس شخص نے اللہ کے راستہ میں جہاد کیا اور اس کے لیے نکلنے کا مقصد اس کے راستے میں جہاد اور اس کے کلام کی تصدیق کے سوا اور کچھ نہیں تھا تو اللہ اس کا ضامن ہے کہ اسے جنت میں داخل کرے ( اگر وہ شہید ہو گیا ) یا ثواب اور مال غنیمت کے ساتھ اسے وہیں واپس لوٹائے جہاں سے وہ آیا تھا ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا ہم سے امام مالک نے بیان کیا ‘ ان سے ابوالزناد نے ‘ ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ تَكَفَّلَ اللَّهُ لِمَنْ جَاهَدَ فِي سَبِيلِهِ، لاَ يُخْرِجُهُ إِلاَّ الْجِهَادُ فِي سَبِيلِهِ، وَتَصْدِيقُ كَلِمَاتِهِ، بِأَنْ يُدْخِلَهُ الْجَنَّةَ، أَوْ يَرْجِعَهُ إِلَى مَسْكَنِهِ الَّذِي خَرَجَ مِنْهُ، مَعَ مَا نَالَ مِنْ أَجْرٍ أَوْ غَنِيمَةٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7148,
                "hadithNumber": "7458",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "A man came to the Prophet (ﷺ) and said, \"A man fights for pride and haughtiness another fights for bravery, and another fights for showing off; which of these (cases) is in Allah's Cause?\" The Prophet (ﷺ) said, \"The one who fights that Allah's Word (Islam) should be superior, fights in Allah's Cause.\" (See Hadith No. 65, Vol. 4)",
                "hadithUrdu": "ایک شخص نبی کریم صلی اللہ علیہ وسلم کے پاس آیا اور کہا کہ کوئی شخص حمیت کی وجہ سے لڑتا ہے ‘ کوئی بہادری کی وجہ سے لڑتا ہے اور کوئی دکھاوے لے لیے لڑتا ہے ۔ تو ان میں سے کون اللہ کے راستے میں ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو اس لیے لڑتا ہے کہ اللہ کا کلمہ ہی بلند رہے ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے اعمش نے ‘ ان سے ابووائل نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ الرَّجُلُ يُقَاتِلُ حَمِيَّةً وَيُقَاتِلُ شَجَاعَةً وَيُقَاتِلُ رِيَاءً، فَأَىُّ ذَلِكَ فِي سَبِيلِ اللَّهِ قَالَ ‏ \"‏ مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هِيَ الْعُلْيَا، فَهْوَ فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7149,
                "hadithNumber": "7459",
                "englishNarrator": "Narrated Al-Mughira bin Shu`ba رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"Some people from my followers will continue to be victorious over others till Allah's Order (The Hour) is established.\" (See Hadith No. 414)",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ‘ آپ نے فرمایا کہ میری امت میں سے ایک گروہ دوسروں پر غالب رہے گا ‘ یہاں تک کہ ” امر اللہ “ یعنی ( قیامت ) آ جائے گی ۔",
                "urduNarrator": "ہم سے شہاب بن عباد نے بیان کے ‘ کہا ہم سے ابراہیم بن حمید نے بیان کیا ‘ ان سے اسماعیل نے ‘ ان سے قیس نے ‘ ان سے مغیرہ بن شعبہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا شِهَابُ بْنُ عَبَّادٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ حُمَيْدٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يَزَالُ مِنْ أُمَّتِي قَوْمٌ ظَاهِرِينَ عَلَى النَّاسِ، حَتَّى يَأْتِيَهُمْ أَمْرُ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏إِنَّمَا قَوْلُنَا لِشَىْءٍ‏ إذا أردناه أن نقول له كن فيكون}‏",
                "headingUrdu": "\"بے شک! کسی چیز کے لیے ہمارا کلام جب ہم اس کا ارادہ کرتے ہیں…‘‘",
                "headingEnglish": "“Verily! Our Word unto a thing when We intend it.…”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7150,
                "hadithNumber": "7460",
                "englishNarrator": "Narrated Muawiya رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"A group of my followers will keep on following Allah's Laws strictly and they will not be harmed by those who will disbelieve them or stand against them till Allah's Order (The Hour) will come while they will be in that state.\" Malik bin yokhamir states that he heard Hadrat Muadh bin Jabl رضی اللہ عنہ that they would be in Syria. Hadrat Moaviyah said: It is the caprice of Malik that he heard Hadrat Muadh رضی اللہ عنہ that they would be in Syria.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ‘ آپ نے فرمایا کہ میری امت میں سے ایک گروہ ہمیشہ قرآن و حدیث پر قائم رہے گا ‘ اسے جھٹلانے والے اور مخالفین کوئی نقصان نہیں پہنچا سکیں گے ‘ یہاں تک کہ ” امر اللہ “ ( قیامت ) آ جائے گی اور وہ اسی حال میں ہوں گے ۔ اس پر مالک ابن یخامر نے کہا کہ میں نے معاذ رضی اللہ عنہ سے سنا ‘ وہ کہتے تھے کہ یہ گروہ شام میں ہو گا ۔ اس پر معاویہ رضی اللہ عنہ نے کہا کہ یہ مالک رضی اللہ عنہ کہتے ہیں کہ معاذ رضی اللہ عنہ نے کہا تھا کہ یہ گروہ شام میں ہو گا ۔",
                "urduNarrator": "ہم سے حمیدی نے بیان کیا ‘ کہا ہم سے سے ولید بن مسلم نے بیان کیا ‘ کہا ہم سے ابن جابر نے بیان کیا ‘ کہا مجھ سے عمیر بن ہانی نے بیان کیا ‘ انہوں نے معاویہ رضی اللہ عنہ سے سنا ‘ بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا ابْنُ جَابِرٍ، حَدَّثَنِي عُمَيْرُ بْنُ هَانِئٍ، أَنَّهُ سَمِعَ مُعَاوِيَةَ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يَزَالُ مِنْ أُمَّتِي أُمَّةٌ قَائِمَةٌ بِأَمْرِ اللَّهِ، مَا يَضُرُّهُمْ مَنْ كَذَّبَهُمْ، وَلاَ مَنْ خَالَفَهُمْ، حَتَّى يَأْتِيَ أَمْرُ اللَّهِ وَهُمْ عَلَى ذَلِكَ ‏\"‏‏.‏ فَقَالَ مَالِكُ بْنُ يُخَامِرَ سَمِعْتُ مُعَاذًا يَقُولُ وَهُمْ بِالشَّأْمِ‏.‏ فَقَالَ مُعَاوِيَةُ هَذَا مَالِكٌ يَزْعُمُ أَنَّهُ سَمِعَ مُعَاذًا يَقُولُ وَهُمْ بِالشَّأْمِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7151,
                "hadithNumber": "7461",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) stood before Musailama (the liar) who was sitting with his companions then, and said to him, \"If you ask me for this piece (of palm-leaf stalk), even then I would not give it to you. You cannot avoid what Allah has ordained for you, and if you turn away from Islam, Allah will surely ruin you! \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم مسیلمہ کے پاس رکے ۔ وہ اپنے حامیوں کے ساتھ مدینہ میں آیا تھا اور اس سے فرمایا کہ اگر تو مجھ سے یہ لکڑی کا ٹکڑا بھی مانگے تو میں یہ بھی تجھ کو نہیں دے سکتا اور تمہارے بارے میں اللہ نے جو حکم دے رکھا ہے تو اس سے آگے نہیں بڑھ سکتا اور اگر تو نے اسلام سے پیٹھ پھیری تو اللہ تجھے ہلاک کر دے گا ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ‘ انہیں عبداللہ بن ابی حسین نے ‘ کہا ہم سے نافع بن جبیر نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي حُسَيْنٍ، حَدَّثَنَا نَافِعُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ وَقَفَ النَّبِيُّ صلى الله عليه وسلم عَلَى مُسَيْلِمَةَ فِي أَصْحَابِهِ فَقَالَ ‏ \"‏ لَوْ سَأَلْتَنِي هَذِهِ الْقِطْعَةَ مَا أَعْطَيْتُكَهَا، وَلَنْ تَعْدُوَ أَمْرَ اللَّهِ فِيكَ، وَلَئِنْ أَدْبَرْتَ لَيَعْقِرَنَّكَ اللَّهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7152,
                "hadithNumber": "7462",
                "englishNarrator": "Narrated Ibn Mas`ud رضی اللہ عنہما :",
                "hadithEnglish": "While I was walking in company with the Prophet (ﷺ) in one of the fields of Medina, the Prophet (ﷺ) was reclining on a palm leave stalk which he carried with him. We passed by a group of Jews. Some of them said to the others, \"Ask him about the spirit.\" The others said, \"Do not ask him, lest he would say something that you hate.\" Some of them said, \"We will ask him.\" So a man from among them stood up and said, 'O Abal-Qasim! What is the spirit?\" The Prophet (ﷺ) kept quiet and I knew that he was being divinely inspired. Then he said: \"They ask you concerning the Spirit, Say: The Spirit; its knowledge is with my Lord. And of knowledge you (mankind) have been given only a little.\" (17.85) Amash said: The same is in our recitation.",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ مدینہ کے ایک کھیت میں چل رہا تھا ۔ آنحضرت صلی اللہ علیہ وسلم اپنے ہاتھ کی چھڑی کا سہارا لیتے جاتے تھے ‘پھر ہم یہودیوں کی ایک جماعت کے پاس سے گزرے تو ان لوگوں نے آپس میں کہا کہ ان سے روح کے بارے میں پوچھو ۔ کچھ یہودیوں نے مشورہ دیا کہ نہ پوچھو ‘ کہیں کوئی ایسی بات نہ کہیں جس کا ( ان کی زبان سے سننا ) تم پسند نہ کرو ۔ لیکن بعض نے اصرار کیا کہ نہیں ! ہم پوچھیں گے ۔ چنانچہ ان میں سے ایک نے اٹھ کر کہا اے ابوالقاسم ! روح کیا چیز ہے ؟ آنحضرت صلی اللہ علیہ وسلم اس پر خاموش ہو گئے ۔ میں نے سمجھ لیا کہ آپ پر وحی نازل ہو رہی ہے ۔ پھر آپ نے یہ آیت پڑھی ” اور لوگ آپ سے روح کے بارے میں پوچھتے ہیں ۔ کہہ دیجئیے کہ روح میرے رب کے امر میں سے ہے اور تمہیں اس کا علم بہت تھوڑا دیا گیا ہے ۔ ( سورۃ بنی اسرائیل ) اعمش نے کہا کہ ہماری قرآت میں اسی طرح ہے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے عبد الواحد بن زیاد نے بیان کیا ‘ ان سے اعمش نے ‘ ان سے ابراہیم نخعی نے ‘ ان سے علقمہ بن قیس نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، عَنْ عَبْدِ الْوَاحِدِ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنِ ابْنِ مَسْعُودٍ، قَالَ بَيْنَا أَنَا أَمْشِي، مَعَ النَّبِيِّ صلى الله عليه وسلم فِي بَعْضِ حَرْثِ الْمَدِينَةِ وَهْوَ يَتَوَكَّأُ عَلَى عَسِيبٍ مَعَهُ، فَمَرَرْنَا عَلَى نَفَرٍ مِنَ الْيَهُودِ فَقَالَ بَعْضُهُمْ لِبَعْضٍ سَلُوهُ عَنِ الرُّوحِ‏.‏ فَقَالَ بَعْضُهُمْ لاَ تَسْأَلُوهُ أَنْ يَجِيءَ فِيهِ بِشَىْءٍ تَكْرَهُونَهُ‏.‏ فَقَالَ بَعْضُهُمْ لَنَسْأَلَنَّهُ‏.‏ فَقَامَ إِلَيْهِ رَجُلٌ مِنْهُمْ فَقَالَ يَا أَبَا الْقَاسِمِ مَا الرُّوحُ فَسَكَتَ عَنْهُ النَّبِيُّ صلى الله عليه وسلم فَعَلِمْتُ أَنَّهُ يُوحَى إِلَيْهِ فَقَالَ ‏{‏وَيَسْأَلُونَكَ عَنِ الرُّوحِ قُلِ الرُّوحُ مِنْ أَمْرِ رَبِّي وَمَا أُوتُوا مِنَ الْعِلْمِ إِلاَّ قَلِيلاً‏}‏‏.‏ قَالَ الأَعْمَشُ هَكَذَا فِي قِرِاءَتِنَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7153,
                "hadithNumber": "7463",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Allah guarantees (the person who carries out Jihad in His Cause and nothing compelled him to go out but Jihad in His Cause and the belief in His Word) that He will either admit him into Paradise (Martyrdom) or return him with reward or booty he has earned to his residence from where he went out.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے اللہ کے راستے میں جہاد کیا اور اپنے گھر سے صرف اس غرض سے نکلا کہ خالص اللہ کے راستے میں جہاد کرے اور اس کے کلمہ توحید کی تصدیق کرے تو اللہ تعالیٰ اس کی ضمانت لے لیتا ہے کہ اسے جنت میں داخل کرے گا یا پھر ثواب اور غنیمت کے ساتھ اس کے گھر واپس کرے گا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ انہوں نے کہا ہم کو امام مالک نے خبر دی ‘ انہیں ابوالزناد نے ‘ انہیں اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ تَكَفَّلَ اللَّهُ لِمَنْ جَاهَدَ فِي سَبِيلِهِ، لاَ يُخْرِجُهُ مِنْ بَيْتِهِ إِلاَّ الْجِهَادُ فِي سَبِيلِهِ، وَتَصْدِيقُ كَلِمَتِهِ أَنْ يُدْخِلَهُ الْجَنَّةَ، أَوْ يَرُدَّهُ إِلَى مَسْكَنِهِ بِمَا نَالَ مِنْ أَجْرٍ أَوْ غَنِيمَةٍ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {قُلْ لَوْ كَانَ الْبَحْرُ مِدَادًا لِكَلِمَاتِ رَبِّي لَنَفِدَ الْبَحْرُ قَبْلَ أَنْ تَنْفَدَ كَلِمَاتُ رَبِّي وَلَوْ جِئْنَا بِمِثْلِهِ مَدَدًا}",
                "headingUrdu": "’’کہہ دو کہ اگر میرے رب کے کلام کے لیے سمندر سیاہی بن جائے تو یقیناً سمندر ختم ہو جائے گا۔‘‘",
                "headingEnglish": "“Say: If the sea were ink for the Words of my Lord, surely the sea would be exhausted…”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7154,
                "hadithNumber": "7464",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Whenever anyone of you invoke Allah for something, he should be firm in his asking, and he should not say: 'If You wish, give me...' for none can compel Allah to do something against His Will.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تم دعا کرو تو عزم کے ساتھ کرو اور کوئی دعا میں یہ نہ کہے کہ اگر تو چاہے تو فلاں چیز مجھے عطا کر‘کیونکہ اللہ سے کوئی زبردستی کرنے والا نہیں ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘ انہوں نے کہا ہم سے عبدالوارث نے بیان کیا ‘ ان سے عبد العزیز نے بیان کیا ‘ ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا دَعَوْتُمُ اللَّهَ فَاعْزِمُوا فِي الدُّعَاءِ، وَلاَ يَقُولَنَّ أَحَدُكُمْ إِنْ شِئْتَ فَأَعْطِنِي، فَإِنَّ اللَّهَ لاَ مُسْتَكْرِهَ لَهُ ‏\"‏‏.‏",
                "headingArabic": "فِي الْمَشِيئَةِ وَالإِرَادَةِ",
                "headingUrdu": "(اللہ کی) خواہش اور مرضی",
                "headingEnglish": "(Allah’s) Wish and Will",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7155,
                "hadithNumber": "7465",
                "englishNarrator": "Narrated `Ali bin Abi Talib رضی اللہ عنہ :",
                "hadithEnglish": "One night Allah's Messenger (ﷺ) visited him and Fatima رضی اللہ عنہا , the daughter of Allah's Messenger (ﷺ) and said to them, \"Won 't you offer (night) prayer?.. `Ali رضی اللہ عنہ added: I said, \"O Allah's Messenger (ﷺ)! Our souls are in the Hand of Allah and when He Wishes to bring us to life, He does.\" Then Allah's Messenger (ﷺ) went away when I said so and he did not give any reply. Then I heard him on leaving while he was striking his thighs, saying, 'But man is, more quarrelsome than anything.' (18.54)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ان کے اور فاطمہ رضی اللہ عنہا کے گھر رات میں تشریف لائے اور ان سے کہا کیا تم لوگ نماز تہجد نہیں پڑھتے ۔ علی رضی اللہ عنہ نے کہا کہ میں نے عرض کیا یا رسول اللہ ! ہماری جانیں اللہ کے ہاتھ میں ہیں ‘ جب وہ ہمیں اٹھانا چاہے گا اٹھا دے گا ۔ جب میں نے یہ بات کہی تو آنحضرت صلی اللہ علیہ وسلم واپس چلے گے اور مجھے کوئی جواب نہیں دیا ۔ البتہ میں نے آپ کو واپس جاتے وقت یہ کہتے سنا ۔ آپ اپنی ران پر ہاتھ مار کر یہ فرما رہے تھے کہ ” انسان بڑا ہی بحث کرنے والا ہے ۔ “",
                "urduNarrator": "ہم سے ابو الیما ن نے بیان کیا ‘ انہوں نے کہا ہم کو شعیب نے خبر دی ‘ انہیں زہری نے ‘ ( دوسری سند ) اور ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ انہوں نے کہا مجھ سے میرے بھائی عبدالحمید نے بیان کیا ‘ ان سے سلیمان نے ‘ ان سے محمد بن ابی عتیق نے بیان کیا ‘ ان سے ابن شہاب نے بیان کیا ‘ ان سے علی بن حسین نے بیان کیا ‘ حسین بن علی رضی اللہ عنہ نے انہیں خبر دی اور نہیں علی بن ابی طالب رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ،‏.‏ وَحَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي أَخِي عَبْدُ الْحَمِيدِ، عَنْ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ أَبِي عَتِيقٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، أَنَّ حُسَيْنَ بْنَ عَلِيٍّ ـ عَلَيْهِمَا السَّلاَمُ ـ أَخْبَرَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَرَقَهُ وَفَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيْلَةً فَقَالَ لَهُمْ ‏\"‏ أَلاَ تُصَلُّونَ ‏\"‏‏.‏ قَالَ عَلِيٌّ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا أَنْفُسُنَا بِيَدِ اللَّهِ، فَإِذَا شَاءَ أَنْ يَبْعَثَنَا بَعَثَنَا، فَانْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ قُلْتُ ذَلِكَ، وَلَمْ يَرْجِعْ إِلَىَّ شَيْئًا، ثُمَّ سَمِعْتُهُ وَهْوَ مُدْبِرٌ يَضْرِبُ فَخِذَهُ وَيَقُولُ ‏\"‏ ‏{‏وَكَانَ الإِنْسَانُ أَكْثَرَ شَىْءٍ جَدَلاً‏}‏‏\"‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7126,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=285",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=283",
                "label": "283",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=284",
                "label": "284",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=285",
                "label": "285",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=286",
                "label": "286",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=287",
                "label": "287",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=288",
                "label": "288",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=289",
                "label": "289",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=287",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=287",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=285",
        "to": 7150,
        "total": 40465
    }
}