{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 170,
        "data": [
            {
                "id": 4228,
                "hadithNumber": "4438",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "`Abdur-Rahman bin Abu Bakr رضی اللہ عنہا entered upon the Prophet (ﷺ) while I was supporting the Prophet (ﷺ) on my chest. `Abdur Rahman رضی اللہ عنہا had a fresh Siwak then and he was cleaning his teeth with it. Allah's Messenger (ﷺ) looked at it, so I took the Siwak, cut it (chewed it with my teeth), shook it and made it soft (with water), and then gave it to the Prophet (ﷺ) who cleaned his teeth with it. I had never seen Allah's Messenger (ﷺ) cleaning his teeth in a better way. After finishing the brushing of his teeth, he lifted his hand or his finger and said thrice, \"O Allah! Let me be with the highest companions,\" and then died. `Aisha رضی اللہ عنہا used to say, \"He died while his head was resting between my chest and chin.\"",
                "hadithUrdu": "( ان کے بھائی ) عبدالرحمٰن بن ابی بکر رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے۔ نبی کریم صلی اللہ علیہ وسلم میرے سینے سے ٹیک لگائے ہوئے تھے۔ عبدالرحمٰن رضی اللہ عنہ کے ہاتھ میں ایک تازہ مسواک استعمال کے لیے تھی۔ آپ صلی اللہ علیہ وسلم اس مسواک کی طرف دیکھتے رہے۔ چنانچہ میں نے ان سے مسواک لے لی اور اسے اپنے دانتوں سے چبا کر اچھی طرح جھاڑنے اور صاف کرنے کے بعد نبی کریم صلی اللہ علیہ وسلم کو دے دی۔ آپ نے وہ مسواک استعمال کی جتنے عمدہ طریقہ سے آپ صلی اللہ علیہ وسلم اس وقت مسواک کر رہے تھے، میں نے آپ کو اتنی اچھی طرح مسواک کرتے کبھی نہیں دیکھا۔ مسواک سے فارغ ہونے کے بعد آپ نے اپنا ہاتھ یا اپنی انگلی اٹھائی اور فرمایا۔ «في الرفيق الأعلى» تین مرتبہ، اور آپ کا انتقال ہو گیا۔ عائشہ رضی اللہ عنہا کہا کرتی تھیں کہ نبی کریم صلی اللہ علیہ وسلم کی وفات ہوئی تو سر مبارک میری ہنسلی اور ٹھوڑی کے درمیان میں تھا۔",
                "urduNarrator": "ہم سے محمد بن یحییٰ ذہلی نے بیان کیا۔ کہا ہم سے عفان بن مسلم نے بیان کیا، ان سے صخر بن جویریہ نے، ان سے عبدالرحمٰن بن قاسم نے، ان سے ان کے والد (قاسم بن محمد) نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا عَفَّانُ، عَنْ صَخْرِ بْنِ جُوَيْرِيَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، دَخَلَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ عَلَى النَّبِيِّ صلى الله عليه وسلم وَأَنَا مُسْنِدَتُهُ إِلَى صَدْرِي، وَمَعَ عَبْدِ الرَّحْمَنِ سِوَاكٌ رَطْبٌ يَسْتَنُّ بِهِ، فَأَبَدَّهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بَصَرَهُ، فَأَخَذْتُ السِّوَاكَ فَقَصَمْتُهُ وَنَفَضْتُهُ وَطَيَّبْتُهُ، ثُمَّ دَفَعْتُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَاسْتَنَّ بِهِ، فَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَنَّ اسْتِنَانًا قَطُّ أَحْسَنَ مِنْهُ، فَمَا عَدَا أَنْ فَرَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَفَعَ يَدَهُ أَوْ إِصْبَعَهُ ثُمَّ قَالَ ‏ \"‏ فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏ ثَلاَثًا ثُمَّ قَضَى، وَكَانَتْ تَقُولُ مَاتَ بَيْنَ حَاقِنَتِي وَذَاقِنَتِي‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4229,
                "hadithNumber": "4439",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Whenever Allah's Messenger (ﷺ) became ill, he used to recite the Muawidhatan (i.e. the last two surahs of the Qur'an) and blow his breath over himself (after their recitation ) and rubbed his hands over his body. So when he was afflicted with his fatal illness. I started reciting the Muawidhatan and blowing my breath over him as he used to do and then I rubbed the hand of the Prophet (ﷺ) over his body.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب بیمار پڑتے تو اپنے اوپر معوذتین ( سورۃ الفلق اور سورۃ الناس ) پڑھ کر دم کر لیا کرتے تھے اور اپنے جسم پر اپنے ہاتھ پھیر لیا کرتے تھے، پھر جب وہ مرض آپ کو لاحق ہوا جس میں آپ کی وفات ہوئی تو میں معوذتین پڑھ کر آپ پر دم کیا کرتی تھی اور ہاتھ پر دم کر کے نبی کریم صلی اللہ علیہ وسلم کے جسم پر پھیرا کرتی تھی۔",
                "urduNarrator": "مجھ سے حبان بن موسیٰ مروزی نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، انہیں یونس نے خبر دی، انہیں ابن شہاب نے کہا کہ مجھے عروہ بن زبیر نے خبر دی اور انہیں عائشہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي حِبَّانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا اشْتَكَى نَفَثَ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ وَمَسَحَ عَنْهُ بِيَدِهِ فَلَمَّا اشْتَكَى وَجَعَهُ الَّذِي تُوُفِّيَ فِيهِ طَفِقْتُ أَنْفِثُ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ، الَّتِي كَانَ يَنْفِثُ، وَأَمْسَحُ بِيَدِ النَّبِيِّ صلى الله عليه وسلم عَنْهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4230,
                "hadithNumber": "4440",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I heard the Prophet (ﷺ) and listened to him before his death while he was leaning his back on me and saying, \"O Allah! Forgive me, and bestow Your Mercy on me, and let me meet the (highest) companions (of the Hereafter).\" (See the Qur'an (4:69) and Hadith #4435)",
                "hadithUrdu": "آپ نے نبی کریم صلی اللہ علیہ وسلم سے سنا، وفات سے کچھ پہلے نبی کریم صلی اللہ علیہ وسلم پشت سے ان کا سہارا لیے ہوئے تھے۔ آپ نے کان لگا کر سنا کہ نبی کریم صلی اللہ علیہ وسلم دعا کر رہے ہیں «اللهم اغفر لي وارحمني،‏‏‏‏ ‏‏‏‏ وألحقني بالرفيق» ”اے اللہ! میری مغفرت فرما، مجھ پر رحم کر اور میرے رفیقوں سے مجھے ملا۔“",
                "urduNarrator": "ہم سے معلی بن اسد نے بیان کیا، کہا ہم سے عبدالعزیز بن مختار نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، ان سے عباد بن عبداللہ بن زبیر نے اور انہیں عائشہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّهَا، سَمِعَتِ النَّبِيَّ صلى الله عليه وسلم وَأَصْغَتْ إِلَيْهِ قَبْلَ أَنْ يَمُوتَ، وَهْوَ مُسْنِدٌ إِلَىَّ ظَهْرَهُ يَقُولُ ‏ \"‏ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي، وَأَلْحِقْنِي بِالرَّفِيقِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4231,
                "hadithNumber": "4441",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"The Prophet (ﷺ) said during his fatal illness, \"Allah cursed the Jews for they took the graves of their prophets as places for worship.\" `Aisha رضی اللہ عنہا added, \"Had it not been for that (statement of the Prophet ) his grave would have been made conspicuous. But he was afraid that it might be taken as a place for worship.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اپنے مرض الموت میں فرمایا کہ اللہ تعالیٰ نے یہودیوں کو اپنی رحمت سے دور کر دیا کہ انہوں نے اپنے انبیاء کی قبروں کو سجدہ گاہ بنا لیا تھا۔ عائشہ رضی اللہ عنہا نے کہا کہ اگر یہ بات نہ ہوتی تو آپ صلی اللہ علیہ وسلم کی قبر بھی کھلی رکھی جاتی لیکن آپ کو یہ خطرہ تھا کہ کہیں آپ کی قبر کو بھی سجدہ نہ کیا جانے لگے۔",
                "urduNarrator": "ہم سے صلت بن محمد نے بیان کیا، کہا ہم سے ابوعوانہ وضاح یشکری نے بیان کیا، ان سے ہلال بن ابی حمید وزان نے، ان سے عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ هِلاَلٍ الْوَزَّانِ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم فِي مَرَضِهِ الَّذِي لَمْ يَقُمْ مِنْهُ ‏ \"‏ لَعَنَ اللَّهُ الْيَهُودَ، اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ لَوْلاَ ذَلِكَ لأُبْرِزَ قَبْرُهُ‏.‏ خَشِيَ أَنْ يُتَّخَذَ مَسْجِدًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4232,
                "hadithNumber": "4442",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا (the wife of the prophet):",
                "hadithEnglish": "\"When the ailment of Allah's Messenger (ﷺ) became aggravated, he requested his wives to permit him to be (treated) nursed in my house, and they gave him permission. He came out (to my house), walking between two men with his feet dragging on the ground, between `Abbas bin `Abdul--Muttalib رضی اللہ عنہ and another man\" 'Ubaidullah said, \"I told `Abdullah of what `Aisha رضی اللہ عنہا had said, `Abdullah bin `Abbas رضی اللہ عنہما said to me, 'Do you know who is the other man whom `Aisha رضی اللہ عنہا did not name?' I said, 'No.' Ibn `Abbas رضی اللہ عنہ said, 'It was `Ali bin Abu Talib رضی اللہ عنہ .\" `Aisha رضی اللہ عنہا, the wife of the Prophet (ﷺ) used to narrate saying, \"When Allah's Messenger (ﷺ) entered my house and his disease became aggravated, he said, \" Pour on me the water of seven water skins, the mouths of which have not been untied, so that I may give advice to the people.' So we let him sit in a big basin belonging to Hafsa رضی اللہ عنہا, the wife of the Prophet (ﷺ) and then started to pour water on him from these water skins till he started pointing to us with his hands intending to say, 'You have done your job.\" `Aisha added, \"Then he went out to the people and led them in prayer and preached to them.\"",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم کے لیے اٹھنا بیٹھنا دشوار ہو گیا اور آپ کے مرض نے شدت اختیار کر لی تو تمام ازواج مطہرات رضی اللہ عنہن سے آپ نے میرے گھر میں ایام مرض گزارنے کے لیے اجازت مانگی۔ سب نے جب اجازت دے دی تو آپ میمونہ رضی اللہ عنہا کے گھر سے نکلے، آپ دو آدمیوں کا سہارا لیے ہوئے تھے اور آپ کے پاؤں زمین سے گھسٹ رہے تھے۔ جن دو صحابہ کا آپ صلی اللہ علیہ وسلم سہارا لیے ہوئے تھے، ان میں ایک عباس بن عبدالمطلب رضی اللہ عنہ تھے اور ایک اور صاحب۔ عبیداللہ نے بیان کیا کہ پھر میں نے عائشہ رضی اللہ عنہا کی اس روایت کی خبر عبداللہ بن عباس رضی اللہ عنہما کو دی تو انہوں نے بتلایا، معلوم ہے وہ دوسرے صاحب جن کا نام عائشہ رضی اللہ عنہا نے نہیں لیا، کون ہیں؟ بیان کیا کہ میں نے عرض کیا مجھے تو نہیں معلوم ہے۔ انہوں نے بتلایا کہ وہ علی رضی اللہ عنہ تھے اور نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا بیان کرتی تھیں کہ نبی کریم صلی اللہ علیہ وسلم جب میرے گھر میں آ گئے اور تکلیف بہت بڑھ گئی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ سات مشکیزے پانی کے بھر کر لاؤ اور مجھ پر ڈال دو، ممکن ہے اس طرح میں لوگوں کو کچھ نصیحت کرنے کے قابل ہو جاؤں۔ چنانچہ ہم نے آپ کو آپ کی زوجہ مطہرہ حفصہ رضی اللہ عنہا کے ایک لگن میں بٹھایا اور انہیں مشکیزوں سے آپ پر پانی دھارنے لگے۔ آخر آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ کے اشارہ سے روکا کہ بس ہو چکا، بیان کیا کہ پھر آپ لوگوں کے مجمع میں گئے اور نماز پڑھائی اور لوگوں کو خطاب کیا۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا، کہا کہ مجھ سے لیث بن سعد نے بیان کیا کہ مجھ سے عقیل نے بیان کیا، ان سے ابن شہاب نے کہا کہ مجھے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے خبر دی اور ان سے ام المؤمنین عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ لَمَّا ثَقُلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاشْتَدَّ بِهِ وَجَعُهُ اسْتَأْذَنَ أَزْوَاجَهُ أَنْ يُمَرَّضَ فِي بَيْتِي، فَأَذِنَّ لَهُ، فَخَرَجَ وَهْوَ بَيْنَ الرَّجُلَيْنِ تَخُطُّ رِجْلاَهُ فِي الأَرْضِ، بَيْنَ عَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ وَبَيْنَ رَجُلٍ آخَرَ‏.‏ قَالَ عُبَيْدُ اللَّهِ فَأَخْبَرْتُ عَبْدَ اللَّهِ بِالَّذِي قَالَتْ عَائِشَةُ، فَقَالَ لِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍ هَلْ تَدْرِي مَنِ الرَّجُلُ الآخَرُ الَّذِي لَمْ تُسَمِّ عَائِشَةُ قَالَ قُلْتُ لاَ‏.‏ قَالَ ابْنُ عَبَّاسٍ هُوَ عَلِيٌّ‏.‏ وَكَانَتْ عَائِشَةُ زَوْجُ النَّبِيِّ صلى الله عليه وسلم تُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا دَخَلَ بَيْتِي وَاشْتَدَّ بِهِ وَجَعُهُ قَالَ ‏ \"‏ هَرِيقُوا عَلَىَّ مِنْ سَبْعِ قِرَبٍ لَمْ تُحْلَلْ أَوْكِيَتُهُنَّ لَعَلِّي أَعْهَدُ إِلَى النَّاسِ ‏\"‏‏.‏ فَأَجْلَسْنَاهُ فِي مِخْضَبٍ لِحَفْصَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم، ثُمَّ طَفِقْنَا نَصُبُّ عَلَيْهِ مِنْ تِلْكَ الْقِرَبِ، حَتَّى طَفِقَ يُشِيرُ إِلَيْنَا بِيَدِهِ أَنْ قَدْ فَعَلْتُنَّ قَالَتْ ثُمَّ خَرَجَ إِلَى النَّاسِ فَصَلَّى لَهُمْ وَخَطَبَهُمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4233,
                "hadithNumber": "4443, 4444",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا and `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"When Allah's Messenger (ﷺ) became ill seriously, he started covering his face with his woolen sheet, and when he felt short of breath, he removed it from his face and said, 'That is so! Allah's curse be on the Jews and the Christians, as they took the graves of their prophets as (places of worship),' intending to warn (the Muslims) of what they had done.\"",
                "hadithUrdu": "شدت مرض کے دنوں میں نبی کریم صلی اللہ علیہ وسلم اپنی چادر کھینچ کر باربار اپنے چہرے پر ڈالتے تھے، پھر جب دم گھٹنے لگتا تو چہرے سے ہٹا دیتے۔ آپ صلی اللہ علیہ وسلم اسی شدت کے عالم میں فرماتے تھے، یہود و نصاریٰ اللہ کی رحمت سے دور ہوئے کیونکہ انہوں نے اپنے انبیاء کی قبروں کو سجدہ گاہ بنا لیا تھا۔ اس طرح آپ صلی اللہ علیہ وسلم ( اپنی امت کو ) ان کا عمل اختیار کرنے سے بچتے رہنے کی تاکید فرما رہے تھے۔",
                "urduNarrator": "اور مجھے عبیداللہ بن عبداللہ بن عتبہ نے خبر دی اور ان سے عائشہ رضی اللہ عنہا اور عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "وَأَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَائِشَةَ، وَعَبْدَ اللَّهِ بْنَ عَبَّاسٍ، رضى الله عنهم قَالاَ لَمَّا نَزَلَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم طَفِقَ يَطْرَحُ خَمِيصَةً لَهُ عَلَى وَجْهِهِ، فَإِذَا اغْتَمَّ كَشَفَهَا عَنْ وَجْهِهِ وَهْوَ كَذَلِكَ يَقُولُ ‏ \"‏ لَعْنَةُ اللَّهِ عَلَى الْيَهُودِ وَالنَّصَارَى، اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏‏.‏ يُحَذِّرُ مَا صَنَعُوا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4234,
                "hadithNumber": "4445",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"I argued with Allah's Messenger (ﷺ) repeatedly about that matter (i.e. his order that Abu Bakr رضی اللہ عنہ should lead the people in prayer in his place when he was ill), and what made me argue so much, was, that it never occurred to my mind that after the Prophet, the people would ever love a man who had taken his place, and I felt that anybody standing in his place, would be a bad omen to the people, so I wanted Allah's Messenger (ﷺ) to give up the idea of choosing Abu Bakr رضی اللہ عنہ (to lead the people in prayer). Imam Bukhari said: Hadrat Ibn-e-Umer, Hadrat Abu Musa and Hadrat Ibn-e-Abbaas رضی اللہ عنہم have reported it from the prophet ﷺ.",
                "hadithUrdu": "میں نے اس معاملہ ( یعنی ایام مرض میں ابوبکر رضی اللہ عنہ کو امام بنانے ) کے سلسلے میں نبی کریم صلی اللہ علیہ وسلم سے باربار پوچھا۔ میں باربار آپ سے صرف اس لیے پوچھ رہی تھی کہ مجھے یقین تھا کہ جو شخص ( نبی کریم صلی اللہ علیہ وسلم کی زندگی میں ) آپ کی جگہ پر کھڑا ہو گا، لوگ اس سے کبھی محبت نہیں رکھ سکتے بلکہ میرا خیال تھا کہ لوگ اس سے بدفالی لیں گے، اس لیے میں چاہتی تھی کہ نبی کریم صلی اللہ علیہ وسلم ابوبکر رضی اللہ عنہ کو اس کا حکم نہ دیں۔ اس کی روایت ابن عمر، ابوموسیٰ اور ابن عباس رضی اللہ عنہم نے نبی کریم صلی اللہ علیہ وسلم سے کی ہے۔",
                "urduNarrator": "مجھے عبیداللہ نے خبر دی کہ عائشہ رضی اللہ عنہا نے کہا،",
                "hadithArabic": "أَخْبَرَنِي عُبَيْدُ اللَّهِ، أَنَّ عَائِشَةَ، قَالَتْ لَقَدْ رَاجَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ، وَمَا حَمَلَنِي عَلَى كَثْرَةِ مُرَاجَعَتِهِ إِلاَّ أَنَّهُ لَمْ يَقَعْ فِي قَلْبِي أَنْ يُحِبَّ النَّاسُ بَعْدَهُ رَجُلاً قَامَ مَقَامَهُ أَبَدًا، وَلاَ كُنْتُ أُرَى أَنَّهُ لَنْ يَقُومَ أَحَدٌ مَقَامَهُ إِلاَّ تَشَاءَمَ النَّاسُ بِهِ، فَأَرَدْتُ أَنْ يَعْدِلَ ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَبِي بَكْرٍ‏.‏ رَوَاهُ ابْنُ عُمَرَ وَأَبُو مُوسَى وَابْنُ عَبَّاسٍ ـ رضى الله عنهم ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4235,
                "hadithNumber": "4446",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) died while he was between my chest and chin, so I never dislike the death agony for anyone after the Prophet.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی وفات ہوئی تو آپ میری ہنسلی اور ٹھوڑی کے درمیان ( سر رکھے ہوئے ) تھے۔ آپ صلی اللہ علیہ وسلم ( کی شدت سکرات ) دیکھنے کے بعد اب میں کسی کے لیے بھی نزع کی شدت کو برا نہیں سمجھتی۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، کہا کہ مجھ سے یزید بن الہاد نے بیان کیا، ان سے عبدالرحمٰن بن قاسم نے، ان سے ان کے والد قاسم بن محمد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ مَاتَ النَّبِيُّ صلى الله عليه وسلم وَإِنَّهُ لَبَيْنَ حَاقِنَتِي وَذَاقِنَتِي، فَلاَ أَكْرَهُ شِدَّةَ الْمَوْتِ لأَحَدٍ أَبَدًا بَعْدَ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4236,
                "hadithNumber": "4447",
                "englishNarrator": "Narrated `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "`Ali bin Abu Talib رضی اللہ عنہ came out of the house of Allah's Messenger (ﷺ) during his fatal illness. The people asked, \"O Abu Hasan (i.e. `Ali)! How is the health of Allah's Messenger (ﷺ) this morning?\" `Ali رضی اللہ عنہ replied, \"He has recovered with the Grace of Allah.\" `Abbas bin `Abdul Muttalib رضی اللہ عنہ held him by the hand and said to him, \"In three days you, by Allah, will be ruled (by somebody else ), And by Allah, I feel that Allah's Apostle will die from this ailment of his, for I know how the faces of the offspring of `Abdul Muttalib رضی اللہ عنہ look at the time of their death. So let us go to Allah's Messenger (ﷺ) and ask him who will take over the Caliphate. If it is given to us we will know as to it, and if it is given to somebody else, we will inform him so that he may tell the new ruler to take care of us.\" `Ali  رضی اللہ عنہ said, \"By Allah, if we asked Allah's Apostle for it (i.e. the Caliphate) and he denied it us, the people will never give it to us after that. And by Allah, I will not ask Allah's Messenger (ﷺ) for it.\"",
                "hadithUrdu": "علی بن ابی طالب رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس سے باہر آئے۔ یہ اس مرض کا واقعہ ہے جس میں آپ صلی اللہ علیہ وسلم نے وفات پائی تھی۔ صحابہ رضی اللہ عنہم نے آپ سے پوچھا: ابوالحسن! نبی کریم صلی اللہ علیہ وسلم کا آج مزاج کیا ہے؟ صبح انہوں نے بتایا کہ الحمدللہ اب آپ کو افاقہ ہے۔ پھر عباس بن عبدالمطلب رضی اللہ عنہ نے علی رضی اللہ عنہ کا ہاتھ پکڑ کے کہا کہ تم، اللہ کی قسم تین دن کے بعد زندگی گزارنے پر تم مجبور ہو جاؤ گے۔ اللہ کی قسم، مجھے تو ایسے آثار نظر آ رہے ہیں کہ نبی کریم صلی اللہ علیہ وسلم اس مرض سے صحت نہیں پا سکیں گے۔ موت کے وقت بنو عبدالمطلب کے چہروں کی مجھے خوب شناخت ہے۔ اب ہمیں آپ کے پاس چلنا چاہئیے اور آپ سے پوچھنا چاہئیے کہ ہمارے بعد خلافت کسے ملے گی۔ اگر ہم اس کے مستحق ہیں تو ہمیں معلوم ہو جائے گا اور اگر کوئی دوسرا مستحق ہو گا تو وہ بھی معلوم ہو جائے گا اور آپ صلی اللہ علیہ وسلم ہمارے متعلق اپنے خلیفہ کو ممکن ہے کچھ وصیتیں کر دیں لیکن علی رضی اللہ عنہ نے کہا کہ اللہ کی قسم! اگر ہم نے اس وقت آپ سے اس کے متعلق کچھ پوچھا اور آپ نے انکار کر دیا تو پھر لوگ ہمیں ہمیشہ کے لیے اس سے محروم کر دیں گے۔ میں تو ہرگز آپ صلی اللہ علیہ وسلم سے اس کے متعلق کچھ نہیں پوچھوں گا۔",
                "urduNarrator": "مجھ سے اسحاق بن راہویہ نے بیان کیا، کہا ہم کو بشر بن شعیب بن ابی حمزہ نے خبر دی، کہا کہ مجھ سے میرے والد نے بیان کیا، ان سے زہری نے بیان کیا، انہیں عبداللہ بن کعب بن مالک انصاری نے خبر دی اور کعب بن مالک رضی اللہ عنہ ان تین صحابہ میں سے ایک تھے جن کی ( غزوہ تبوک میں شرکت نہ کرنے کی ) توبہ قبول ہوئی تھی۔ انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا بِشْرُ بْنُ شُعَيْبِ بْنِ أَبِي حَمْزَةَ، قَالَ حَدَّثَنِي أَبِي، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ الأَنْصَارِيُّ ـ وَكَانَ كَعْبُ بْنُ مَالِكٍ أَحَدَ الثَّلاَثَةِ الَّذِينَ تِيبَ عَلَيْهِمْ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ أَخْبَرَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ ـ رضى الله عنه ـ خَرَجَ مِنْ عِنْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي وَجَعِهِ الَّذِي تُوُفِّيَ فِيهِ، فَقَالَ النَّاسُ يَا أَبَا حَسَنٍ، كَيْفَ أَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ أَصْبَحَ بِحَمْدِ اللَّهِ بَارِئًا، فَأَخَذَ بِيَدِهِ عَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ، فَقَالَ لَهُ أَنْتَ وَاللَّهِ بَعْدَ ثَلاَثٍ عَبْدُ الْعَصَا، وَإِنِّي وَاللَّهِ لأُرَى رَسُولَ اللَّهِ صلى الله عليه وسلم سَوْفَ يُتَوَفَّى مِنْ وَجَعِهِ هَذَا، إِنِّي لأَعْرِفُ وُجُوهَ بَنِي عَبْدِ الْمُطَّلِبِ عِنْدَ الْمَوْتِ، اذْهَبْ بِنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَلْنَسْأَلْهُ فِيمَنْ هَذَا الأَمْرُ، إِنْ كَانَ فِينَا عَلِمْنَا ذَلِكَ، وَإِنْ كَانَ فِي غَيْرِنَا عَلِمْنَاهُ فَأَوْصَى بِنَا‏.‏ فَقَالَ عَلِيٌّ إِنَّا وَاللَّهِ لَئِنْ سَأَلْنَاهَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَمَنَعَنَاهَا لاَ يُعْطِينَاهَا النَّاسُ بَعْدَهُ، وَإِنِّي وَاللَّهِ لاَ أَسْأَلُهَا رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4237,
                "hadithNumber": "4448",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "While the Muslims were offering the Fajr prayer on Monday and Abu Bakr رضی اللہ عنہ was leading them in prayer, suddenly Allah's Messenger (ﷺ) lifted the curtain of `Aisha's dwelling and looked at them while they were in the rows of the prayers and smiled. Abu Bakr رضی اللہ عنہ retreated to join the row, thinking that Allah's Apostle wanted to come out for the prayer. The Muslims were about to be put to trial in their prayer (i.e. were about to give up praying) because of being overjoyed at seeing Allah's Messenger (ﷺ). But Allah's Apostle beckoned them with his hand to complete their prayer and then entered the dwelling and let fall the curtain.",
                "hadithUrdu": "پیر کے دن مسلمان فجر کی نماز پڑھ رہے تھے اور ابوبکر رضی اللہ عنہ نماز پڑھا رہے تھے کہ اچانک نبی کریم صلی اللہ علیہ وسلم نظر آئے۔ آپ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کے حجرہ کا پردہ اٹھا کر صحابہ رضی اللہ عنہم کو دیکھ رہے تھے۔ صحابہ رضی للہ عنہم نماز میں صف باندھے کھڑے ہوئے تھے۔ نبی کریم صلی اللہ علیہ وسلم دیکھ کر ہنس پڑے۔ ابوبکر رضی اللہ عنہ پیچھے ہٹنے لگے تاکہ صف میں آ جائیں۔ آپ نے سمجھا کہ نبی کریم صلی اللہ علیہ وسلم نماز کے لیے تشریف لانا چاہتے ہیں۔ انس رضی اللہ عنہ نے بیان کیا، قریب تھا کہ مسلمان اس خوشی کی وجہ سے جو نبی کریم صلی اللہ علیہ وسلم کو دیکھ کر انہیں ہوئی تھی کہ وہ اپنی نماز توڑنے ہی کو تھے لیکن آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ سے اشارہ کیا کہ نماز پوری کر لو، پھر آپ حجرہ کے اندر تشریف لے گئے اور پردہ ڈال لیا۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا، انہوں نے کہا کہ مجھ سے لیث نے بیان کیا، انہوں نے کہا کہ مجھ سے عقیل نے بیان کیا، ان سے ابن شہاب نے بیان کیا، انہوں نے کہا کہ مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّ الْمُسْلِمِينَ، بَيْنَا هُمْ فِي صَلاَةِ الْفَجْرِ مِنْ يَوْمِ الاِثْنَيْنِ وَأَبُو بَكْرٍ يُصَلِّي لَهُمْ لَمْ يَفْجَأْهُمْ إِلاَّ رَسُولُ اللَّهِ صلى الله عليه وسلم قَدْ كَشَفَ سِتْرَ حُجْرَةِ عَائِشَةَ، فَنَظَرَ إِلَيْهِمْ وَهُمْ فِي صُفُوفِ الصَّلاَةِ‏.‏ ثُمَّ تَبَسَّمَ يَضْحَكُ، فَنَكَصَ أَبُو بَكْرٍ عَلَى عَقِبَيْهِ لِيَصِلَ الصَّفَّ، وَظَنَّ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يُرِيدُ أَنْ يَخْرُجَ إِلَى الصَّلاَةِ فَقَالَ أَنَسٌ وَهَمَّ الْمُسْلِمُونَ أَنْ يَفْتَتِنُوا فِي صَلاَتِهِمْ فَرَحًا بِرَسُولِ اللَّهِ صلى الله عليه وسلم فَأَشَارَ إِلَيْهِمْ بِيَدِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أَتِمُّوا صَلاَتَكُمْ، ثُمَّ دَخَلَ الْحُجْرَةَ وَأَرْخَى السِّتْرَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4238,
                "hadithNumber": "4449",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "It was one of the favors of Allah towards me that Allah's Messenger (ﷺ) expired in my house on the day of my turn while he was leaning against my chest and Allah made my saliva mix with his saliva at his death. `Abdur-Rahman رضی اللہ عنہ entered upon me with a Siwak in his hand and I was supporting (the back of) Allah's Messenger (ﷺ) (against my chest ). I saw the Prophet (ﷺ) looking at it (i.e. Siwak) and I knew that he loved the Siwak, so I said ( to him ), \"Shall I take it for you ? \" He nodded in agreement. So I took it and it was too stiff for him to use, so I said, \"Shall I soften it for you ?\" He nodded his approval. So I softened it and he cleaned his teeth with it. In front of him there was a jug or a tin, (The sub-narrator, `Umar is in doubt as to which was right) containing water. He started dipping his hand in the water and rubbing his face with it, he said, \"None has the right to be worshipped except Allah. Death has its agonies.\" He then lifted his hands (towards the sky) and started saying, \"With the highest companion,\" till he expired and his hand dropped down.",
                "hadithUrdu": "اللہ کی بہت سی نعمتوں میں ایک نعمت مجھ پر یہ بھی ہے کہ رسول اللہ صلی اللہ علیہ وسلم کی وفات میرے گھر میں اور میری باری کے دن ہوئی۔ آپ اس وقت میرے سینے سے ٹیک لگائے ہوئے تھے۔ اور یہ کہ اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کی وفات کے وقت میرے اور آپ کے تھوک کو ایک ساتھ جمع کیا تھا کہ عبدالرحمٰن رضی اللہ عنہ گھر میں آئے تو ان کے ہاتھ میں مسواک تھی۔ آپ صلی اللہ علیہ وسلم مجھ پر ٹیک لگائے ہوئے تھے، میں نے دیکھا کہ آپ صلی اللہ علیہ وسلم اس مسواک کو دیکھ رہے ہیں۔ میں سمجھ گئی کہ آپ مسواک کرنا چاہتے ہیں، اس لیے میں نے آپ سے پوچھا، یہ مسواک آپ کے لیے لے لوں؟ آپ صلی اللہ علیہ وسلم نے سر کے اشارہ سے اثبات میں جواب دیا، میں نے وہ مسواک ان سے لے لی۔ آپ صلی اللہ علیہ وسلم اسے چبا نہ سکے، میں نے پوچھا آپ کے لیے میں اسے نرم کر دوں؟ آپ نے سر کے اشارہ سے اثبات میں جواب دیا۔ میں نے مسواک نرم کر دی۔ آپ کے سامنے ایک بڑا پیالہ تھا، چمڑے کا یا لکڑی کا ( راوی حدیث ) عمر کو اس سلسلے میں شک تھا، اس کے اندر پانی تھا، نبی کریم صلی اللہ علیہ وسلم باربار اپنے ہاتھ اس کے اندر داخل کرتے اور پھر انہیں اپنے چہرے پر پھیرتے اور فرماتے «لا إله إلا الله» ۔ موت کے وقت شدت ہوتی ہے پھر آپ صلی اللہ علیہ وسلم اپنا ہاتھ اٹھا کر کہنے لگے «في الرفيق الأعلى» یہاں تک کہ آپ رحلت فرما گئے اور آپ کا ہاتھ جھک گیا۔",
                "urduNarrator": "مجھ سے محمد بن عبید نے بیان کیا، کہا ہم سے عیسیٰ بن یونس نے بیان کیا، ان سے عمر بن سعید نے، انہیں ابن ابی ملیکہ نے خبر دی اور انہیں عائشہ رضی اللہ عنہا کے غلام ابوعمرو ذکوان نے کہ عائشہ رضی اللہ عنہا فرمایا کرتی تھیں،",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُمَرَ بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، أَنَّ أَبَا عَمْرٍو، ذَكْوَانَ مَوْلَى عَائِشَةَ أَخْبَرَهُ أَنَّ عَائِشَةَ كَانَتْ تَقُولُ إِنَّ مِنْ نِعَمِ اللَّهِ عَلَىَّ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تُوُفِّيَ فِي بَيْتِي وَفِي يَوْمِي، وَبَيْنَ سَحْرِي وَنَحْرِي، وَأَنَّ اللَّهَ جَمَعَ بَيْنَ رِيقِي وَرِيقِهِ عِنْدَ مَوْتِهِ، دَخَلَ عَلَىَّ عَبْدُ الرَّحْمَنِ وَبِيَدِهِ السِّوَاكُ وَأَنَا مُسْنِدَةٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَأَيْتُهُ يَنْظُرُ إِلَيْهِ، وَعَرَفْتُ أَنَّهُ يُحِبُّ السِّوَاكَ فَقُلْتُ آخُذُهُ لَكَ فَأَشَارَ بِرَأْسِهِ أَنْ نَعَمْ، فَتَنَاوَلْتُهُ فَاشْتَدَّ عَلَيْهِ وَقُلْتُ أُلَيِّنُهُ لَكَ فَأَشَارَ بِرَأْسِهِ أَنْ نَعَمْ، فَلَيَّنْتُهُ، وَبَيْنَ يَدَيْهِ رَكْوَةٌ ـ أَوْ عُلْبَةٌ يَشُكُّ عُمَرُ ـ فِيهَا مَاءٌ، فَجَعَلَ يُدْخِلُ يَدَيْهِ فِي الْمَاءِ فَيَمْسَحُ بِهِمَا وَجْهَهُ يَقُولُ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، إِنَّ لِلْمَوْتِ سَكَرَاتٍ ‏\"‏‏.‏ ثُمَّ نَصَبَ يَدَهُ فَجَعَلَ يَقُولُ ‏\"‏ فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏ حَتَّى قُبِضَ وَمَالَتْ يَدُهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4239,
                "hadithNumber": "4450",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) in his fatal illness, used to ask, 'Where will I be tomorrow? Where will I be tomorrow?\", seeking `Aisha's turn. His wives allowed him to stay wherever he wished. So he stayed at `Aisha's house till he expired while he was with her.\" `Aisha رضی اللہ عنہا added, \"The Prophet (ﷺ) expired on the day of my turn in my house and he was taken unto Allah while his head was against my chest and his saliva mixed with my saliva.\" `Aisha رضی اللہ عنہا added, \"Abdur-Rahman bin Abu Bakr رضی اللہ عنہما came in, carrying a Siwak he was cleaning his teeth with. Allah's Messenger (ﷺ) looked at it and I said to him, 'O `Abdur Rahman! Give me this Siwak.' So he gave it to me and I cut it, chewed it (it's end) and gave it to Allah's Messenger (ﷺ) who cleaned his teeth with it while he was resting against my chest.\"",
                "hadithUrdu": "مرض الموت میں رسول اللہ صلی اللہ علیہ وسلم پوچھتے رہتے تھے کہ کل میرا قیام کہاں ہو گا، کل میرا قیام کہاں ہو گا؟ آپ عائشہ رضی اللہ عنہا کی باری کے منتظر تھے، پھر ازواج مطہرات رضی اللہ عنہن نے عائشہ رضی اللہ عنہا کے گھر قیام کی اجازت دے دی اور آپ کی وفات انہیں کے گھر میں ہوئی۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ آپ کی وفات اسی دن ہوئی جس دن قاعدہ کے مطابق میرے یہاں آپ کے قیام کی باری تھی۔ رحلت کے وقت سر مبارک میرے سینے پر تھا اور میرا تھوک آپ کے تھوک کے ساتھ ملا تھا۔ انہوں نے بیان کیا کہ عبدالرحمٰن بن ابی بکر رضی اللہ عنہما داخل ہوئے اور ان کے ہاتھ میں استعمال کے قابل مسواک تھی۔ آپ صلی اللہ علیہ وسلم نے اس کی طرف دیکھا تو میں نے کہا: عبدالرحمٰن! یہ مسواک مجھے دے دو۔ انہوں نے مسواک مجھے دے دی۔ میں نے اسے اچھی طرح چبایا اور جھاڑ کر آپ صلی اللہ علیہ وسلم کو دی، پھر آپ نے وہ مسواک کی، اس وقت آپ میرے سینے سے ٹیک لگائے ہوئے تھے۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا، کہا مجھ سے سلیمان بن بلال نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، انہیں ان کے والد نے خبر دی اور انہیں عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَسْأَلُ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ يَقُولَ ‏ \"‏ أَيْنَ أَنَا غَدًا أَيْنَ أَنَا غَدًا ‏\"‏ يُرِيدُ يَوْمَ عَائِشَةَ، فَأَذِنَ لَهُ أَزْوَاجُهُ يَكُونُ حَيْثُ شَاءَ، فَكَانَ فِي بَيْتِ عَائِشَةَ حَتَّى مَاتَ عِنْدَهَا، قَالَتْ عَائِشَةُ فَمَاتَ فِي الْيَوْمِ الَّذِي كَانَ يَدُورُ عَلَىَّ فِيهِ فِي بَيْتِي، فَقَبَضَهُ اللَّهُ وَإِنَّ رَأْسَهُ لَبَيْنَ نَحْرِي وَسَحْرِي، وَخَالَطَ رِيقُهُ رِيقِي ـ ثُمَّ قَالَتْ ـ دَخَلَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ وَمَعَهُ سِوَاكٌ يَسْتَنُّ بِهِ فَنَظَرَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ لَهُ أَعْطِنِي هَذَا السِّوَاكَ يَا عَبْدَ الرَّحْمَنِ‏.‏ فَأَعْطَانِيهِ فَقَضِمْتُهُ، ثُمَّ مَضَغْتُهُ فَأَعْطَيْتُهُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَاسْتَنَّ بِهِ وَهْوَ مُسْتَنِدٌ إِلَى صَدْرِي‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4240,
                "hadithNumber": "4451",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) expired in my house and on the day of my turn, leaning against my chest. One of us (i.e. the Prophet's wives ) used to recite a prayer asking Allah to protect him from all evils when he became sick. So I started asking Allah to protect him from all evils (by reciting a prayer ). He raised his head towards the sky and said, \"With the highest companions, with the highest companions.\" `Abdur- Rahman bin Abu Bakr رضی اللہ عنہما passed carrying a fresh leaf-stalk of a date-palm and the Prophet (ﷺ) looked at it and I thought that the Prophet (ﷺ) was in need of it (for cleaning his teeth ). So I took it (from `Abdur Rahman) and chewed its head and shook it and gave it to the Prophet (ﷺ) who cleaned his teeth with it, in the best way he had ever cleaned his teeth, and then he gave it to me, and suddenly his hand dropped down or it fell from his hand (i.e. he expired). So Allah made my saliva mix with his saliva on his last day on earth and his first day in the Hereafter.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی وفات میرے گھر میں، میری باری کے دن ہوئی۔ آپ اس وقت میرے سینے سے ٹیک لگائے ہوئے تھے۔ جب آپ بیمار پڑے تو ہم آپ کی صحت کے لیے دعائیں کیا کرتے تھے۔ اس بیماری میں بھی میں آپ کے لیے دعا کرنے لگی لیکن آپ صلی اللہ علیہ وسلم فرما رہے تھے اور آپ کا سر آسمان کی طرف اٹھا ہوا تھا «في الرفيق الأعلى في الرفيق الأعلى» اور عبدالرحمٰن بن ابی بکر رضی اللہ عنہما آئے تو ان کے ہاتھ میں ایک تازہ ٹہنی تھی۔ آپ صلی اللہ علیہ وسلم نے اس کی طرف دیکھا تو میں سمجھ گئی کہ آپ صلی اللہ علیہ وسلم مسواک کرنا چاہتے ہیں۔ چنانچہ وہ ٹہنی میں نے ان سے لے لی۔ پہلے میں نے اسے چبایا، پھر صاف کر کے آپ کو دے دی۔ آپ صلی اللہ علیہ وسلم نے اس سے مسواک کی، جس طرح پہلے آپ مسواک کیا کرتے تھے اس سے بھی اچھی طرح سے۔ پھر آپ صلی اللہ علیہ وسلم نے وہ مسواک مجھے عنایت فرمائی اور آپ کا ہاتھ جھک گیا، یا ( راوی نے یہ بیان کیا کہ ) مسواک آپ کے ہاتھ سے چھوٹ گئی۔ اس طرح اللہ تعالیٰ نے میرے اور آپ صلی اللہ علیہ وسلم کے تھوک کو اس دن جمع کر دیا جو آپ کی دنیا کی زندگی کا سب سے آخری اور آخرت کی زندگی کا سب سے پہلا دن تھا۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ایوب نے، ان سے ابن ابی ملیکہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم فِي بَيْتِي وَفِي يَوْمِي، وَبَيْنَ سَحْرِي وَنَحْرِي، وَكَانَتْ إِحْدَانَا تُعَوِّذُهُ بِدُعَاءٍ إِذَا مَرِضَ، فَذَهَبْتُ أُعَوِّذُهُ، فَرَفَعَ رَأْسَهُ إِلَى السَّمَاءِ وَقَالَ ‏ \"‏ فِي الرَّفِيقِ الأَعْلَى فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏ وَمَرَّ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ وَفِي يَدِهِ جَرِيدَةٌ رَطْبَةٌ، فَنَظَرَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم فَظَنَنْتُ أَنَّ لَهُ بِهَا حَاجَةً فَأَخَذْتُهَا، فَمَضَغْتُ رَأْسَهَا وَنَفَضْتُهَا فَدَفَعْتُهَا إِلَيْهِ، فَاسْتَنَّ بِهَا كَأَحْسَنِ مَا كَانَ مُسْتَنًّا ثُمَّ نَاوَلَنِيهَا فَسَقَطَتْ يَدُهُ ـ أَوْ سَقَطَتْ مِنْ يَدِهِ ـ فَجَمَعَ اللَّهُ بَيْنَ رِيقِي وَرِيقِهِ فِي آخِرِ يَوْمٍ مِنَ الدُّنْيَا وَأَوَّلِ يَوْمٍ مِنَ الآخِرَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4241,
                "hadithNumber": "4452, 4453, 4454",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Abu Bakr رضی اللہ عنہ came from his house at As-Sunh on a horse. He dismounted and entered the Mosque, but did not speak to the people till he entered upon `Aisha رضی اللہ عنہاand went straight to Allah's Messenger (ﷺ) who was covered with Hibra cloth (i.e. a kind of Yemenite cloth). He then uncovered the Prophet's face and bowed over him and kissed him and wept, saying, \"Let my father and mother be sacrificed for you. By Allah, Allah will never cause you to die twice. As for the death which was written for you, has come upon you.\"\" Narrated Ibn `Abbas رضی اللہ عنہما : Abu Bakr رضی اللہ عنہ went out while `Umar bin Al-Khattab was talking to the people. Abu Bakr رضی اللہ عنہ said, \"Sit down, O `Umar!\" But `Umar refused to sit down. So the people came to Abu Bakr رضی اللہ عنہ and left `Umar. Abu Bakr رضی اللہ عنہ said, \"To proceed, if anyone amongst you used to worship Muhammad , then Muhammad is dead, but if (anyone of) you used to worship Allah, then Allah is Alive and shall never die. Allah said:--\"Muhammad is no more than an Apostle, and indeed (many) apostles have passed away before him..(till the end of the Verse )......Allah will reward to those who are thankful.\" (3.144) By Allah, it was as if the people never knew that Allah had revealed this Verse before till Abu Bakr recited it and all the people received it from him, and I heard everybody reciting it (then). Narrated Az-Zuhri: Sa`id bin Al-Musaiyab told me that `Umar said, \"By Allah, when I heard Abu Bakr reciting it, my legs could not support me and I fell down at the very moment of hearing him reciting it, declaring that the Prophet (ﷺ) had died.\"",
                "hadithUrdu": "ابوبکر رضی اللہ عنہ اپنی قیام گاہ، مسخ سے گھوڑے پر آئے اور آ کر اترے، پھر مسجد کے اندر گئے۔ کسی سے آپ نے کوئی بات نہیں کی۔ اس کے بعد آپ عائشہ رضی اللہ عنہا کے حجرہ میں آئے اور نبی کریم صلی اللہ علیہ وسلم کی طرف گئے، نعش مبارک ایک یمنی چادر سے ڈھکی ہوئی تھی۔ آپ نے چہرہ کھولا اور جھک کر چہرہ مبارک کو بوسہ دیا اور رونے لگے، پھر کہا میرے ماں باپ آپ پر قربان ہوں اللہ کی قسم! اللہ تعالیٰ آپ پر دو مرتبہ موت طاری نہیں کرے گا۔ جو ایک موت آپ کے مقدر میں تھی، وہ آپ پر طاری ہو چکی ہے۔ابن عباس رضی اللہ عنہما کہتے ہیں کہ ابوبکر رضی اللہ عنہ باہر نکلے جب عمر بن الخطاب رضی اللہ عنہ لوگوں سے باتیں کر رہے تھے، ابوبکر رضی اللہ عنہ نے کہا: بیٹھ جاؤ، عمر رضی اللہ عنہ، لیکن عمر رضی اللہ عنہ نے بیٹھنے سے انکار کر دیا، چنانچہ لوگ ابو کے پاس آئے۔ بکر نے اور عمر کو چھوڑ دیا، ابوبکر نے کہا: \"آگے بڑھو، اگر تم میں سے کوئی محمد کی عبادت کرتا تھا تو محمد مر ​​گیا، لیکن اگر تم میں سے کوئی اللہ کی عبادت کرتا تھا، تو اللہ زندہ ہے اور کبھی نہیں مرے گا. اللہ تعالیٰ نے فرمایا:-\"محمد صلی اللہ علیہ وسلم صرف ایک رسول ہیں، اور ان سے پہلے بہت سے رسول گزر چکے ہیں .. (آیت کے آخر تک) ...... اللہ شکر کرنے والوں کو جزا دے گا۔ \" (3.144) خدا کی قسم گویا لوگوں کو معلوم ہی نہ تھا کہ اللہ تعالیٰ نے اس آیت کو پہلے نازل کیا ہے یہاں تک کہ ابوبکر نے اسے پڑھا اور تمام لوگوں نے ان سے اس کو حاصل کیا اور میں نے سب کو اس کی تلاوت کرتے سنا۔ زہری نے بیان کیا کہ مجھ سے سعید بن المسیب نے بیان کیا کہ عمر رضی اللہ عنہ نے کہا کہ اللہ کی قسم جب میں نے ابوبکر رضی اللہ عنہ کو پڑھتے ہوئے سنا تو میری ٹانگیں میرا ساتھ نہ دے سکیں اور میں انہیں سنتے ہی گر پڑا۔ یہ اعلان کرتے ہوئے کہ رسول اللہ صلی اللہ علیہ وسلم کی وفات ہو گئی ہے۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے بیان کیا، ان سے ابن شہاب نے بیان کیا، انہیں ابوسلمہ نے خبر دی اور انہیں عائشہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ أَقْبَلَ عَلَى فَرَسٍ مِنْ مَسْكَنِهِ بِالسُّنْحِ حَتَّى نَزَلَ، فَدَخَلَ الْمَسْجِدَ فَلَمْ يُكَلِّمِ النَّاسَ حَتَّى دَخَلَ عَلَى عَائِشَةَ، فَتَيَمَّمَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْوَ مُغَشًّى بِثَوْبِ حِبَرَةٍ، فَكَشَفَ عَنْ وَجْهِهِ ثُمَّ أَكَبَّ عَلَيْهِ فَقَبَّلَهُ وَبَكَى‏.‏ ثُمَّ قَالَ بِأَبِي أَنْتَ وَأُمِّي، وَاللَّهِ لاَ يَجْمَعُ اللَّهُ عَلَيْكَ مَوْتَتَيْنِ، أَمَّا الْمَوْتَةُ الَّتِي كُتِبَتْ عَلَيْكَ فَقَدْ مُتَّهَا‏.قَالَ الزُّهْرِيُّ وَحَدَّثَنِي أَبُو سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ أَبَا بَكْرٍ، خَرَجَ وَعُمَرُ يُكَلِّمُ النَّاسَ فَقَالَ اجْلِسْ يَا عُمَرُ، فَأَبَى عُمَرُ أَنْ يَجْلِسَ‏.‏ فَأَقْبَلَ النَّاسُ إِلَيْهِ وَتَرَكُوا عُمَرَ، فَقَالَ أَبُو بَكْرٍ أَمَّا بَعْدُ مَنْ كَانَ مِنْكُمْ يَعْبُدُ مُحَمَّدًا صلى الله عليه وسلم فَإِنَّ مُحَمَّدًا قَدْ مَاتَ، وَمَنْ كَانَ مِنْكُمْ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَىٌّ لاَ يَمُوتُ، قَالَ اللَّهُ ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ‏}‏ إِلَى قَوْلِهِ ‏{‏الشَّاكِرِينَ‏}‏ وَقَالَ وَاللَّهِ لَكَأَنَّ النَّاسَ لَمْ يَعْلَمُوا أَنَّ اللَّهَ أَنْزَلَ هَذِهِ الآيَةَ حَتَّى تَلاَهَا أَبُو بَكْرٍ، فَتَلَقَّاهَا مِنْهُ النَّاسُ كُلُّهُمْ فَمَا أَسْمَعُ بَشَرًا مِنَ النَّاسِ إِلاَّ يَتْلُوهَا‏.‏ فَأَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ عُمَرَ قَالَ وَاللَّهِ مَا هُوَ إِلاَّ أَنْ سَمِعْتُ أَبَا بَكْرٍ تَلاَهَا فَعَقِرْتُ حَتَّى مَا تُقِلُّنِي رِجْلاَىَ، وَحَتَّى أَهْوَيْتُ إِلَى الأَرْضِ حِينَ سَمِعْتُهُ تَلاَهَا أَنَّ النَّبِيَّ صلى الله عليه وسلم قَدْ مَاتَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4242,
                "hadithNumber": "4455, 4456, 4457",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا and Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Abu Bakr رضی اللہ عنہ kissed the Prophet (ﷺ) after his death.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی وفات کے بعد ابوبکر رضی اللہ عنہ نے آپ کو بوسہ دیا تھا۔",
                "urduNarrator": "مجھ سے عبداللہ بن ابی شیبہ نے بیان کیا کہا ہم سے یحییٰ بن سعید نے بیان کیا، ان سے سفیان بن عیینہ نے، ان سے موسیٰ بن ابی عائشہ نے، ان سے عبیداللہ بن عبداللہ بن عتبہ نے اور ان سے عائشہ رضی اللہ عنہا اور ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ عَائِشَةَ، وَابْنِ، عَبَّاسٍ أَنَّ أَبَا بَكْر ٍ ـ رضى الله عنه ـ قَبَّلَ النَّبِيَّ صلى الله عليه وسلم بَعْدَ مَوْتِهِ‏.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4243,
                "hadithNumber": "4458",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "We poured medicine in one side of the Prophet's mouth during his illness and he started pointing to us, meaning to say, \"Don't pour medicine in my mouth.\" We said, \"(He says so) because a patient dislikes medicines.\" When he improved and felt a little better, he said, \"Didn't I forbid you to pour medicine in my mouth ?\" We said, \" ( We thought it was because of) the dislike, patients have for medicines. He said, \"Let everyone present in the house be given medicine by pouring it in his mouth while I am looking at him, except `Abbas رضی اللہ عنہ as he has not witnessed you (doing the same to me). Its authority: Abu Zinaad, Hisham, Urwah, Hadrat Aishah رضی اللہ عنہا from the prophet ﷺ.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے مرض میں ہم آپ کے منہ میں دوا دینے لگے تو آپ نے اشارہ سے دوا دینے سے منع کیا۔ ہم نے سمجھا کہ مریض کو دوا پینے سے ( بعض اوقات ) جو ناگواری ہوتی ہے یہ بھی اسی کا نتیجہ ہے ( اس لیے ہم نے اصرار کیا ) تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ گھر میں جتنے آدمی ہیں سب کے منہ میں میرے سامنے دوا ڈالی جائے۔ صرف عباس رضی اللہ عنہ اس سے الگ ہیں کہ وہ تمہارے ساتھ اس کام میں شریک نہیں تھے۔ اس کی روایت ابن ابی الزناد نے بھی کی، ان سے ہشام نے، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا۔ کہا ہم سے یحییٰ بن سعید نے بیان کیا عبداللہ بن ابی شیبہ کی حدیث کی طرح، لیکن انہوں نے اپنی اس روایت میں یہ اضافہ کیا کہ عائشہ رضی اللہ عنہا نے کہا",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا يَحْيَى، وَزَادَ، قَالَتْ عَائِشَةُ لَدَدْنَاهُ فِي مَرَضِهِ فَجَعَلَ يُشِيرُ إِلَيْنَا أَنْ لاَ تَلُدُّونِي فَقُلْنَا كَرَاهِيَةُ الْمَرِيضِ لِلدَّوَاءِ‏.‏ فَلَمَّا أَفَاقَ قَالَ ‏\"‏ أَلَمْ أَنْهَكُمْ أَنْ تَلُدُّونِي ‏\"‏‏.‏ قُلْنَا كَرَاهِيَةَ الْمَرِيضِ لِلدَّوَاءِ‏.‏ فَقَالَ ‏\"‏ لاَ يَبْقَى أَحَدٌ فِي الْبَيْتِ إِلاَّ لُدَّ ـ وَأَنَا أَنْظُرُ ـ إِلاَّ الْعَبَّاسَ، فَإِنَّهُ لَمْ يَشْهَدْكُمْ ‏\"‏‏.‏ رَوَاهُ ابْنُ أَبِي الزِّنَادِ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4244,
                "hadithNumber": "4459",
                "englishNarrator": "Narrated Al-Aswad:",
                "hadithEnglish": "It was mentioned in the presence of `Aisha رضی اللہ عنہا that the Prophet (ﷺ) had appointed `Ali رضی اللہ عنہ as successor by will. Thereupon she said, \"Who said so? I saw the Prophet, while I was supporting him against my chest. He asked for a tray, and then fell on one side and expired, and I did not feel it. So how (do the people say) he appointed `Ali رضی اللہ عنہ as his successor?\"",
                "hadithUrdu": "عائشہ رضی اللہ عنہا کے سامنے اس کا ذکر آیا کہ نبی کریم صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ کو کوئی ( خاص ) وصیت کی تھی؟ تو انہوں نے بتلایا کون کہتا ہے، میں خود نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھی، آپ میرے سینے سے ٹیک لگائے ہوئے تھے، آپ نے طشت منگوایا، پھر ایک طرف جھک گئے اور آپ کی وفات ہو گئی۔ اس وقت مجھے بھی کچھ معلوم نہیں ہوا، پھر علی رضی اللہ عنہ کو آپ نے کب وصی بنا دیا۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، کہا ہم کو ازہر بن سعد سمان نے خبر دی، کہا ہم کو عبداللہ بن عون نے خبر دی، انہیں ابراہیم نخعی نے اور ان سے اسود بن یزید نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، أَخْبَرَنَا أَزْهَرُ، أَخْبَرَنَا ابْنُ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ ذُكِرَ عِنْدَ عَائِشَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَوْصَى إِلَى عَلِيٍّ، فَقَالَتْ مَنْ قَالَهُ لَقَدْ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَإِنِّي لَمُسْنِدَتُهُ إِلَى صَدْرِي، فَدَعَا بِالطَّسْتِ فَانْخَنَثَ فَمَاتَ، فَمَا شَعَرْتُ، فَكَيْفَ أَوْصَى إِلَى عَلِيٍّ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4245,
                "hadithNumber": "4460",
                "englishNarrator": "Narrated Talha:",
                "hadithEnglish": "I asked `Abdullah bin Abu `Aufa رضی اللہ عنہ \"Did the Prophet (ﷺ) make a will? ' He replied, \"No.\" I further asked, \"How comes it that the making of a will was enjoined on the people or that they were ordered to make it? \" He said, \"The Prophet (ﷺ) made a will concerning Allah's Book.\"",
                "hadithUrdu": "میں نے عبداللہ بن ابی اوفی رضی اللہ عنہ سے پوچھا، کیا رسول اللہ صلی اللہ علیہ وسلم نے کسی کو وصی بنایا تھا۔ انہوں نے کہا کہ نہیں۔ میں نے پوچھا کہ لوگوں پر وصیت کرنا کیسے فرض ہے یا وصیت کرنے کا کیسے حکم ہے؟ انہوں نے بتایا کہ آپ نے کتاب اللہ کے مطابق عمل کرتے رہنے کی وصیت کی تھی۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے مالک بن مغول نے بیان کیا، ان سے طلحہ بن مصرف نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، عَنْ طَلْحَةَ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى ـ رضى الله عنهما ـ أَوْصَى النَّبِيُّ صلى الله عليه وسلم فَقَالَ لاَ‏.‏ فَقُلْتُ كَيْفَ كُتِبَ عَلَى النَّاسِ الْوَصِيَّةُ أَوْ أُمِرُوا بِهَا قَالَ أَوْصَى بِكِتَابِ اللَّهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4246,
                "hadithNumber": "4461",
                "englishNarrator": "Narrated 'Amir bin Al-Harith رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) did not leave a Dinar or a Dirham or a male or a female slave. He left only his white mule on which he used to ride, and his weapons, and a piece of land which he gave in charity for the needy travelers.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے نہ درہم چھوڑے تھے، نہ دینار، نہ کوئی غلام نہ باندی، سوا اپنے سفید خچر کے جس پر آپ صلی اللہ علیہ وسلم سوار ہوا کرتے تھے اور آپ کا ہتھیار اور کچھ وہ زمین جو آپ صلی اللہ علیہ وسلم نے اپنی زندگی میں مجاہدوں اور مسافروں کے لیے وقف کر رکھی تھی۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا ہم سے ابوالاحوص (سلام بن حکیم) نے بیان کیا، ان سے ابواسحاق نے، ان سے عمرو بن حارث رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ الْحَارِثِ، قَالَ مَا تَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم دِينَارًا وَلاَ دِرْهَمًا وَلاَ عَبْدًا وَلاَ أَمَةً، إِلاَّ بَغْلَتَهُ الْبَيْضَاءَ الَّتِي كَانَ يَرْكَبُهَا، وَسِلاَحَهُ، وَأَرْضًا جَعَلَهَا لاِبْنِ السَّبِيلِ صَدَقَةً‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4247,
                "hadithNumber": "4462",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When the ailment of the Prophet (ﷺ) got aggravated, he became unconscious whereupon Fatima رضی اللہ عنہا said, \"Oh, how distressed my father is!\" He said, \"Your father will have no more distress after today.\" When he expired, she said, \"O Father! Who has responded to the call of the Lord Who has invited him! O Father, whose dwelling place is the Garden of Paradise (i.e. Al-Firdaus)! O Father! We convey this news (of your death) to Gabriel.\" When he was buried, Fatima رضی اللہ عنہا said, \"O Anas! Do you feel pleased to throw earth over Allah's Messenger (ﷺ)?\"",
                "hadithUrdu": "شدت مرض کے زمانے میں نبی کریم صلی اللہ علیہ وسلم کی بے چینی بہت بڑھ گئی تھی۔ فاطمۃالزہراء رضی اللہ عنہا نے کہا: آہ، ابا جان کو کتنی بے چینی ہے۔ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ آج کے بعد تمہارے ابا جان کی یہ بے چینی نہیں رہے گی۔ پھر جب نبی کریم صلی اللہ علیہ وسلم کی وفات ہو گئی تو فاطمہ رضی اللہ عنہا کہتی تھیں، ہائے ابا جان! آپ اپنے رب کے بلاوے پر چلے گئے، ہائے ابا جان! آپ جنت الفردوس میں اپنے مقام پر چلے گئے۔ ہم جبرائیل علیہ السلام کو آپ کی وفات کی خبر سناتے ہیں۔ پھر جب نبی کریم صلی اللہ علیہ وسلم دفن کر دئیے گئے تو آپ رضی اللہ عنہا نے انس رضی اللہ عنہ سے کہا ”انس! تمہارے دل رسول اللہ صلی اللہ علیہ وسلم کی نعش پر مٹی ڈالنے کے لیے کس طرح آمادہ ہو گئے تھے۔“",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ثابت بنانی نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ لَمَّا ثَقُلَ النَّبِيُّ صلى الله عليه وسلم جَعَلَ يَتَغَشَّاهُ، فَقَالَتْ فَاطِمَةُ ـ عَلَيْهَا السَّلاَمُ ـ وَاكَرْبَ أَبَاهُ‏.‏ فَقَالَ لَهَا ‏ \"‏ لَيْسَ عَلَى أَبِيكِ كَرْبٌ بَعْدَ الْيَوْمِ ‏\"‏‏.‏ فَلَمَّا مَاتَ قَالَتْ يَا أَبَتَاهْ، أَجَابَ رَبًّا دَعَاهُ، يَا أَبَتَاهْ مَنْ جَنَّةُ الْفِرْدَوْسِ مَأْوَاهُ، يَا أَبَتَاهْ إِلَى جِبْرِيلَ نَنْعَاهْ‏.‏ فَلَمَّا دُفِنَ قَالَتْ فَاطِمَةُ ـ عَلَيْهَا السَّلاَمُ ـ يَا أَنَسُ، أَطَابَتْ أَنْفُسُكُمْ أَنْ تَحْثُوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم التُّرَابَ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4248,
                "hadithNumber": "4463",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "When the Prophet (ﷺ) was healthy, he used to say, \"No soul of a prophet is captured till he is shown his place in Paradise and then he is given the option.\" When death approached him while his head was on my thigh, he became unconscious and then recovered his consciousness. He then looked at the ceiling of the house and said, \"O Allah! (with) the highest companions.\" I said (to myself), \"Hence, he is not going to choose us.\" Then I realized that what he had said was the application of the narration which he used to mention to us when he was healthy. The last word he spoke was, \"O Allah! (with) the highest companion.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم حالت صحت میں فرمایا کرتے تھے کہ ہر نبی کی روح قبض کرنے سے پہلے انہیں جنت میں ان کی قیام گاہ دکھائی گئی، پھر اختیار دیا گیا۔ پھر جب آپ صلی اللہ علیہ وسلم بیمار ہوئے اور آپ کا سر مبارک میری ران پر تھا۔ اس وقت آپ پر غشی طاری ہو گئی۔ جب ہوش میں آئے تو آپ نے اپنی نظر گھر کی چھت کی طرف اٹھا لی اور فرمایا «اللهم الرفيق الأعلى» ”اے اللہ! مجھے اپنی بارگاہ میں انبیاء اور صدیقین سے ملا دے۔“ میں اسی وقت سمجھ گئی کہ اب آپ ہمیں پسند نہیں کر سکتے اور مجھے وہ حدیث یاد آ گئی جو آپ حالت صحت میں ہم سے بیان کیا کرتے تھے۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ آخری کلمہ جو زبان مبارک سے نکلا وہ یہی تھا کہ «اللهم الرفيق الأعلى» ۔",
                "urduNarrator": "ہم سے بشر بن محمد نے بیان کیا، کہا ہم سے عبداللہ بن مبارک نے بیان کیا، ان سے یونس نے بیان کیا، ان سے زہری نے بیان کیا، انہیں سعید بن مسیب نے کئی اہل علم کی موجودگی میں خبر دی اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ، قَالَ يُونُسُ قَالَ الزُّهْرِيُّ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، فِي رِجَالٍ مِنْ أَهْلِ الْعِلْمِ أَنَّ عَائِشَةَ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ وَهْوَ صَحِيحٌ ‏\"‏ إِنَّهُ لَمْ يُقْبَضْ نَبِيٌّ حَتَّى يَرَى مَقْعَدَهُ مِنَ الْجَنَّةِ، ثُمَّ يُخَيَّرَ ‏\"‏‏.‏ فَلَمَّا نَزَلَ بِهِ وَرَأْسُهُ عَلَى فَخِذِي غُشِيَ عَلَيْهِ، ثُمَّ أَفَاقَ، فَأَشْخَصَ بَصَرَهُ إِلَى سَقْفِ الْبَيْتِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ الرَّفِيقَ الأَعْلَى ‏\"‏‏.‏ فَقُلْتُ إِذًا لاَ يَخْتَارُنَا‏.‏ وَعَرَفْتُ أَنَّهُ الْحَدِيثُ الَّذِي كَانَ يُحَدِّثُنَا وَهْوَ صَحِيحٌ قَالَتْ فَكَانَتْ آخِرَ كَلِمَةٍ تَكَلَّمَ بِهَا ‏\"‏ اللَّهُمَّ الرَّفِيقَ الأَعْلَى ‏\"‏‏.‏",
                "headingArabic": "آخِرِ مَا تَكَلَّمَ النَّبِيُّ صلى الله عليه وسلم",
                "headingUrdu": "آخری بیان، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا",
                "headingEnglish": "The last statement, the Prophet (ﷺ) spoke",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4249,
                "hadithNumber": "4464, 4465",
                "englishNarrator": "Narrated `Aisha and Ibn `Abbas رضی اللہ عنہم :",
                "hadithEnglish": "The Prophet (ﷺ) stayed for ten years in Mecca with the Qur'an being revealed to him and he stayed in Medina for ten years.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ( بعثت کے بعد ) مکہ میں دس سال تک قیام کیا۔ جس میں آپ صلی اللہ علیہ وسلم پر وحی نازل ہوتی رہی اور مدینہ میں بھی دس سال تک آپ کا قیام رہا۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے شیبان بن عبدالرحمٰن نے بیان کیا، ان سے یحییٰ بن ابی کثیر نے، ان سے ابوسلمہ بن عبدالرحمٰن نے اور ان سے عائشہ اور ابن عباس رضی اللہ عنہم نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، وَابْنِ، عَبَّاسٍ رضى الله عنهم أَنَّ النَّبِيَّ صلى الله عليه وسلم لَبِثَ بِمَكَّةَ عَشْرَ سِنِينَ يُنْزَلُ عَلَيْهِ الْقُرْآنُ، وَبِالْمَدِينَةِ عَشْرًا‏.‏",
                "headingArabic": "وَفَاةِ النَّبِيِّ صلى الله عليه وسلم",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی وفات",
                "headingEnglish": "The death of the Prophet (saws)",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4250,
                "hadithNumber": "4466",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah 's Apostle died when he was sixty-three years of age. Ibn-e-Shihab narrates that Hadrat Saeed bin Mosayyab رضی اللہ عنہ has told me the same.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم کی وفات ہوئی تو آپ کی عمر تریسٹھ سال کی تھی۔ ابن شہاب نے کہا کہ مجھے سعید بن مسیب نے بھی اسی طرح خبر دی تھی۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، ان سے عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تُوُفِّيَ وَهْوَ ابْنُ ثَلاَثٍ وَسِتِّينَ‏.‏ قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ مِثْلَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4251,
                "hadithNumber": "4467",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) died while his armor was mortgaged to a Jew for thirty Sa's of barley.",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم کی وفات ہوئی تو آپ کی زرہ ایک یہودی کے یہاں تیس صاع جَو کے بدلے میں گروی رکھی ہوئی تھی۔",
                "urduNarrator": "ہم سے قبیصہ بن عتبہ نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے اعمش نے، ان سے ابراہیم نخعی نے، ان سے اسود بن یزید نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم وَدِرْعُهُ مَرْهُونَةٌ عِنْدَ يَهُودِيٍّ بِثَلاَثِينَ‏.‏ ‏{‏يَعْنِي صَاعًا مِنْ شَعِيرٍ‏}‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4252,
                "hadithNumber": "4468",
                "englishNarrator": "Narrated Salim's father:",
                "hadithEnglish": "The Prophet (ﷺ) appointed Usama رضی اللہ عنہما as the commander of the troops (to be sent to Syria). The Muslims spoke about Usama (unfavorably ). The Prophet (ﷺ) said, \" I have been informed that you spoke about Usama رضی اللہ عنہ . (Let it be known that ) he is the most beloved of all people to me.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اسامہ بن زید رضی اللہ عنہما کو ایک لشکر کا امیر بنایا تو بعض صحابہ رضی اللہ عنہم نے ان کی امارت پر اعتراض کیا۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مجھے معلوم ہوا ہے کہ تم اسامہ رضی اللہ عنہ پر اعتراض کر رہے ہو حالانکہ وہ مجھے سب سے زیادہ عزیز ہے۔",
                "urduNarrator": "ہم سے ابوعاصم ضحاک بن مخلد نے بیان کیا، کہا ہم سے فضیل بن سلیمان نے بیان کیا، ان سے موسیٰ بن عقبہ نے بیان کیا، ان سے سالم نے اور ان سے ان کے والد (عبداللہ بن عمر رضی اللہ عنہما) نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ الضَّحَّاكُ بْنُ مَخْلَدٍ، عَنِ الْفُضَيْلِ بْنِ سُلَيْمَانَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، اسْتَعْمَلَ النَّبِيُّ صلى الله عليه وسلم أُسَامَةَ ـ فَقَالُوا فِيهِ ـ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ قَدْ بَلَغَنِي أَنَّكُمْ قُلْتُمْ فِي أُسَامَةَ، وَإِنَّهُ أَحَبُّ النَّاسِ إِلَىَّ ‏\"‏‏.‏",
                "headingArabic": "بَعْثُ النَّبِيِّ صلى الله عليه وسلم أُسَامَةَ بْنَ زَيْدٍ ـ رضى الله عنهما ـ فِي مَرَضِهِ الَّذِيتُوُفِّيَ فِيهِ",
                "headingUrdu": "اسامہ بن زید رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم نے ان کی مہلک بیماری کے دوران بھیجا۔",
                "headingEnglish": "The dispatch of Usama bin Zaid رضي الله عنهما by the Prophet (saws) during his fatal illness",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4226,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=169",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=167",
                "label": "167",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=168",
                "label": "168",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=169",
                "label": "169",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=170",
                "label": "170",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=171",
                "label": "171",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=172",
                "label": "172",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=173",
                "label": "173",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=171",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=171",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=169",
        "to": 4250,
        "total": 40465
    }
}