{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 214,
        "data": [
            {
                "id": 5328,
                "hadithNumber": "5564",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) used to offer as sacrifices, two horned rams, black and white in color, and used to put his foot on their sides and slaughter them with his own hands.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سینگ والے دو چتکبرے مینڈھوں کی قربانی کیا کرتے تھے اور آنحضرت صلی اللہ علیہ وسلم اپنا پاؤں ان کی گردنوں کے اوپررکھتے اور انہیں اپنے ہاتھ سے ذبح کرتے تھے ۔",
                "urduNarrator": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے ، انہوں نے کہا کہ ہم سے حضرت انس رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسٌ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُضَحِّي بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ، وَوَضَعَ رِجْلَهُ عَلَى صَفْحَتِهِمَا، وَيَذْبَحُهُمَا بِيَدِهِ‏.‏",
                "headingArabic": "وَضْعِ الْقَدَمِ عَلَى صَفْحِ الذَّبِيحَةِ",
                "headingUrdu": "ذبح کے وقت جانور کے پہلو پر پاؤں رکھنا",
                "headingEnglish": "To put one's foot on the side of the animal at the time of slaughtering",
                "chapterId": "74",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 74,
                    "chapterNumber": "74",
                    "chapterEnglish": "Al-Adha Festival Sacrifice (Adaahi)",
                    "chapterUrdu": "قربانی کے مسائل کا بیان",
                    "chapterArabic": "كتاب الأضاحي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5329,
                "hadithNumber": "5565",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) offered as sacrifices, two horned rams, black and white in color. He slaughtered them with his own hands and mentioned Allah's Name over them and said Takbir and put his foot on their sides.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے سینگ والے دو چتکبرے مینڈھوں کی قربانی کی ۔ انہیں اپنے ہاتھ سے ذبح کیا ۔ بسم اللہ اور اللہ اکبر پڑھا اور اپنا پاؤں ان کی گردن کے اوپر رکھ کر ذبح کیا ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ ضَحَّى النَّبِيُّ صلى الله عليه وسلم بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ، ذَبَحَهُمَا بِيَدِهِ، وَسَمَّى وَكَبَّرَ وَوَضَعَ رِجْلَهُ عَلَى صِفَاحِهِمَا‏.‏",
                "headingArabic": "التَّكْبِيرِ عِنْدَ الذَّبْحِ",
                "headingUrdu": "ذبح کرتے وقت تکبیر کہنا",
                "headingEnglish": "To say Takbir while slaughtering",
                "chapterId": "74",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 74,
                    "chapterNumber": "74",
                    "chapterEnglish": "Al-Adha Festival Sacrifice (Adaahi)",
                    "chapterUrdu": "قربانی کے مسائل کا بیان",
                    "chapterArabic": "كتاب الأضاحي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5330,
                "hadithNumber": "5566",
                "englishNarrator": "Narrated Masruq:",
                "hadithEnglish": "that he came to `Aisha رضی اللہ عنہا and said to her, \"O Mother of the Believers! There is a man who sends a Hadi to Ka`ba and stays in his city and requests that his Hadi camel be garlanded while he remains in a state of Ihram from that day till the people finish their Ihram (after completing all the ceremonies of Hajj)\" (What do you say about it?) Masruq added, I heard the clapping of her hands behind the curtain. She said, \"I used to twist the garlands for the Hadi of Allah's Messenger (ﷺ) and he used to send his Hadi to Ka`ba but he never used to regard as unlawful what was lawful for men to do with their wives till the people returned (from the Hajj).",
                "hadithUrdu": "وہ حضرت عائشہ رضی اللہ عنہا کی خدمت میں آئے اور عرض کیا کہ ام المؤمنین ! اگر کوئی شخص قربانی کا جانور کعبہ میں بھیج دے اور خود اپنے شہر میں مقیم ہو اور جس کے ذریعے بھیجے اسے اس کی وصیت کر دے کہ اس کے جانور کے گلے میں ( نشانی کے طور پر ) ایک قلادہ پہنادیا جائے تو کیا اس دن سے وہ اس وقت تک کے لیے محرم ہو جائے گا جب تک حاجی اپنا احرام نہ کھول لیں ۔ بیان کیا کہ اس پر میں نے پردے کے پیچھے ام المؤمنین کے اپنے ایک ہاتھ سے دوسرے ہاتھ پر مارنے کی آواز سنی اور انہوں نے کہا میں نے خودنبی کریم صلی اللہ علیہ وسلم کے قربانی کے جانوروں کے قلادے باندھتی تھی ، آنحضرت صلی اللہ علیہ وسلم اسے کعبہ بھیجتے تھے لیکن لوگوں کے واپس ہونے تک آنحضرت صلی اللہ علیہ وسلم پر کوئی چیز حرام نہیں ہوتی تھی جو ان کے گھر کے دوسرے لوگوں کے لیے حلال ہو ۔",
                "urduNarrator": "ہم سے احمد بن محمد نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، انہیں اسماعیل نے خبر دی ، انہیں شعبی نے ، انہیں مسروق نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا إِسْمَاعِيلُ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، أَنَّهُ أَتَى عَائِشَةَ، فَقَالَ لَهَا يَا أُمَّ الْمُؤْمِنِينَ إِنَّ رَجُلاً يَبْعَثُ بِالْهَدْىِ إِلَى الْكَعْبَةِ، وَيَجْلِسُ فِي الْمِصْرِ، فَيُوصِي أَنْ تُقَلَّدَ بَدَنَتُهُ، فَلاَ يَزَالُ مِنْ ذَلِكَ الْيَوْمِ مُحْرِمًا حَتَّى يَحِلَّ النَّاسُ‏.‏ قَالَ فَسَمِعْتُ تَصْفِيقَهَا مِنْ وَرَاءِ الْحِجَابِ فَقَالَتْ لَقَدْ كُنْتُ أَفْتِلُ قَلاَئِدَ هَدْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَبْعَثُ هَدْيَهُ إِلَى الْكَعْبَةِ، فَمَا يَحْرُمُ عَلَيْهِ مِمَّا حَلَّ لِلرِّجَالِ مِنْ أَهْلِهِ، حَتَّى يَرْجِعَ النَّاسُ‏.‏",
                "headingArabic": "إِذَا بَعَثَ بِهَدْيِهِ لِيُذْبَحَ لَمْ يَحْرُمْ عَلَيْهِ شَىْءٌ",
                "headingUrdu": "اگر کوئی اپنے ہادی کو ذبح کرنے کے لیے بھیجے۔",
                "headingEnglish": "If someone sends his Hadi to be slaughtered",
                "chapterId": "74",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 74,
                    "chapterNumber": "74",
                    "chapterEnglish": "Al-Adha Festival Sacrifice (Adaahi)",
                    "chapterUrdu": "قربانی کے مسائل کا بیان",
                    "chapterArabic": "كتاب الأضاحي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5331,
                "hadithNumber": "5567",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "During the lifetime of the Prophet (ﷺ) we used to take with us the meat of the sacrifices (of Id al Adha) to Medina. (The narrator often said. The meat of the Hadi).",
                "hadithUrdu": "مدینہ پہنچنے تک ہم رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں قربانی کا گوشت جمع کرتے تھے اور کئی مرتبہ ( بجائے لحوم الاضاحی کے ) لحوم الھدی کا لفظ استعمال کیا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، ان سے سفیان نے بیان کیا کہ عمرو نے بیان کیا ، انہیں عطاء نے خبر دی ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو أَخْبَرَنِي عَطَاءٌ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كُنَّا نَتَزَوَّدُ لُحُومَ الأَضَاحِيِّ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم إِلَى الْمَدِينَةِ، وَقَالَ غَيْرَ مَرَّةٍ لُحُومَ الْهَدْىِ‏.‏",
                "headingArabic": "مَا يُؤْكَلُ مِنْ لُحُومِ الأَضَاحِيِّ وَمَا يُتَزَوَّدُ مِنْهَا",
                "headingUrdu": "قربانی کا گوشت کیا کھایا جا سکتا ہے اور سفری خوراک کے طور پر کیا لیا جا سکتا ہے۔",
                "headingEnglish": "What may be eaten of the meat of sacrifices and what may be taken as journey food",
                "chapterId": "74",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 74,
                    "chapterNumber": "74",
                    "chapterEnglish": "Al-Adha Festival Sacrifice (Adaahi)",
                    "chapterUrdu": "قربانی کے مسائل کا بیان",
                    "chapterArabic": "كتاب الأضاحي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5332,
                "hadithNumber": "5568",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Once he was not present (at the time of `Id-al-Adha) and when he came. some meat was presented to him. and the people said (to him), 'This is the meat of our sacrifices\" He said. 'Take it away; I shall not taste it. (In his narration) Abu Sa`id رضی اللہ عنہ added: I got up and went to my brother, Abu Qatada رضی اللہ عنہ (who was his maternal brother and was one of the warriors of the battle of Badr) and mentioned that to him He Sa`d. 'A new verdict was given in your absence (i.e., meat of sacrifices was allowed to be stored and eaten later on).",
                "hadithUrdu": "وہ سفر میں تھے جب واپس آئے تو ان کے سامنے گوشت لایا گیا ۔ کہا گیا کہ یہ ہماری قربانی کا گوشت ہے ۔ حضرت ابوسعید رضی اللہ عنہ نے کہا کہ اسے ہٹاؤ میں اسے نہیں چکھوں گا ۔ حضرت ابوسعید رضی اللہ عنہ نے بیان کیا کہ پھر اٹھ گیا اور گھر سے باہر نکل کر اپنے بھائی حضرت ابوقتادہ رضی اللہ عنہ کے پاس آیا وہ ماں کی طرف سے ان کے بھائی تھے اور بدر کی لڑائی میں شرکت کرنے والوں میں سے تھے ۔ میں نے ان سے اس کا ذکر کیا اور انہوں نے کہا کہ تمہارے بعد حکم بدل گیا ہے ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے سلیمان نے بیان کیا ، ان سے یحییٰ بن سعید نے ، ان سے قاسم نے ، انہیں ابن خزیمہ نے خبر دی ، انہوں نے حضرت ابوسعید رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ، أَنَّ ابْنَ خَبَّابٍ، أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا سَعِيدٍ، يُحَدِّثُ أَنَّهُ كَانَ غَائِبًا، فَقَدِمَ فَقُدِّمَ إِلَيْهِ لَحْمٌ‏.‏ قَالَ وَهَذَا مِنْ لَحْمِ ضَحَايَانَا‏.‏ فَقَالَ أَخِّرُوهُ لاَ أَذُوقُهُ‏.‏ قَالَ ثُمَّ قُمْتُ فَخَرَجْتُ حَتَّى آتِيَ أَخِي قَتَادَةَ ـ وَكَانَ أَخَاهُ لأُمِّهِ، وَكَانَ بَدْرِيًّا ـ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ إِنَّهُ قَدْ حَدَثَ بَعْدَكَ أَمْرٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "74",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 74,
                    "chapterNumber": "74",
                    "chapterEnglish": "Al-Adha Festival Sacrifice (Adaahi)",
                    "chapterUrdu": "قربانی کے مسائل کا بیان",
                    "chapterArabic": "كتاب الأضاحي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5333,
                "hadithNumber": "5569",
                "englishNarrator": "Narrated Salama bin Al-Aqua' رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever has slaughtered a sacrifice should not keep anything of Its meat after three days.\" When it was the next year the people said, \"O Allah's Messenger (ﷺ)! Shall we do as we did last year?\" He said, ' Eat of it and feed of it to others and store of it for in that year the people were having a hard time and I wanted you to help (the needy).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے تم میں سے قربانی کی تو تیسرے دن وہ اس حالت میں صبح کرے کہ اس کے گھر میں قربانی کے گوشت میں سے کچھ بھی باقی نہ ہو ۔ دوسرے سال صحابہ کرام رضی اللہ عنہم نے عرض کیا یا رسول اللہ ! کیا ہم اس سال بھی وہی کریں جو پچھلے سال کیا تھا ۔ ( کہ تین دن سے زیادہ قربانی کا گوشت بھی نہ رکھیں ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اب کھاؤ ، کھلاؤ اور جمع کرو ۔ پچھلے سال تو چونکہ لوگ تنگی میں مبتلا تھے ، اس لیے میں نے چاہا کہ تم لوگوں کی مشکلات میں ان کی مدد کرو ۔",
                "urduNarrator": "ہم سے ابو عاصم نے بیان کیا ، ان سے یزید بن ابی عبید نے اور ان سے سلمہ بن الاکوع رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ ضَحَّى مِنْكُمْ فَلاَ يُصْبِحَنَّ بَعْدَ ثَالِثَةٍ وَفِي بَيْتِهِ مِنْهُ شَىْءٌ ‏\"‏‏.‏ فَلَمَّا كَانَ الْعَامُ الْمُقْبِلُ قَالُوا يَا رَسُولَ اللَّهِ نَفْعَلُ كَمَا فَعَلْنَا عَامَ الْمَاضِي قَالَ ‏\"‏ كُلُوا وَأَطْعِمُوا وَادَّخِرُوا فَإِنَّ ذَلِكَ الْعَامَ كَانَ بِالنَّاسِ جَهْدٌ فَأَرَدْتُ أَنْ تُعِينُوا فِيهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "74",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 74,
                    "chapterNumber": "74",
                    "chapterEnglish": "Al-Adha Festival Sacrifice (Adaahi)",
                    "chapterUrdu": "قربانی کے مسائل کا بیان",
                    "chapterArabic": "كتاب الأضاحي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5334,
                "hadithNumber": "5570",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "We used to salt some of the meat of sacrifice and present it to the Prophet (ﷺ) at Medina. Once he said, \"Do not eat (of that meat) for more than three days.\" That was not a final order, but (that year) he wanted us to feed of it to others, Allah knows better.",
                "hadithUrdu": "مدینہ میں ہم قربانی کے گوشت میں نمک لگا کر رکھ دیتے تھے اور پھر اسے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھی پیش کرتے تھے پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ قربانی کا گوشت تین دن سے زیادہ نہ کھایا کرو ۔ یہ حکم ضروری نہیں تھا بلکہ آپ کا منشا یہ تھا کہ ہم قربانی کا گوشت ( ان لوگوں کو بھی جن کے یہاں قربانی نہ ہوئی ہو ) کھلائیں اور اللہ زیادہ جاننے والا ہے ۔",
                "urduNarrator": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے میرے بھائی نے بیان کیا ، ان سے سلیمان نے اور ان سے یحییٰ بن سعید نے ، ان سے عمرہ بنت عبدالرحمٰن نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ الضَّحِيَّةُ كُنَّا نُمَلِّحُ مِنْهُ، فَنَقْدَمُ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم بِالْمَدِينَةِ فَقَالَ ‏ \"‏ لاَ تَأْكُلُوا إِلاَّ ثَلاَثَةَ أَيَّامٍ ‏\"‏‏.‏ وَلَيْسَتْ بِعَزِيمَةٍ، وَلَكِنْ أَرَادَ أَنْ يُطْعِمَ مِنْهُ وَاللَّهُ أَعْلَمُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "74",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 74,
                    "chapterNumber": "74",
                    "chapterEnglish": "Al-Adha Festival Sacrifice (Adaahi)",
                    "chapterUrdu": "قربانی کے مسائل کا بیان",
                    "chapterArabic": "كتاب الأضاحي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5335,
                "hadithNumber": "5571",
                "englishNarrator": "Narrated Abu `Ubaid:",
                "hadithEnglish": "The freed slave of Ibn Azhar that he witnessed the Day of `Id-al-Adha with `Umar bin Al-Khattab رضی اللہ عنہ . `Umar رضی اللہ عنہ offered the `Id prayer before the sermon and then delivered the sermon before the people, saying, \"O people! Allah's Messenger (ﷺ) has forbidden you to fast (on the first day of) each of these two 'Ida, for one of them is the Day of breaking your fast, and the other is the one, on which you eat the meat of your sacrifices.\"",
                "hadithUrdu": "جو  ابن ازہر کے آزادکردہ غلام تھےوہ بقرعید کے دن حضرت عمر بن خطاب رضی اللہ عنہ کے ساتھ عیدگاہ میں موجود تھے ۔ حضرت عمر رضی اللہ عنہ نے خطبہ سے پہلے عید کی نماز پڑھائی پھر لوگوں کے سامنے خطبہ دیا اورخطبہ میں فرمایا اے لوگو ! رسول اللہ صلی اللہ علیہ وسلم نے تمہیں ان دو عیدوں میں روزہ رکھنے سے منع فرمایا ہے ایک وہ دن ہے جس دن تم ( رمضان کے ) روزے پورے کر کے افطار کرتے ہو ( عیدالفطر ) اور دوسرا تمہاری قربانی کا دن ہے ۔",
                "urduNarrator": "ہم سے حبان بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا کہ مجھے یونس نے خبر دی ، ان سے زہری نے ، انہوں نے کہا کہ مجھے ابو عبید نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا حِبَّانُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَبُو عُبَيْدٍ، مَوْلَى ابْنِ أَزْهَرَ أَنَّهُ شَهِدَ الْعِيدَ يَوْمَ الأَضْحَى مَعَ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ فَصَلَّى قَبْلَ الْخُطْبَةِ، ثُمَّ خَطَبَ النَّاسَ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ نَهَاكُمْ عَنْ صِيَامِ هَذَيْنِ الْعِيدَيْنِ، أَمَّا أَحَدُهُمَا فَيَوْمُ فِطْرِكُمْ مِنْ صِيَامِكُمْ وَأَمَّا الآخَرُ فَيَوْمٌ تَأْكُلُونَ نُسُكَكُمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "74",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 74,
                    "chapterNumber": "74",
                    "chapterEnglish": "Al-Adha Festival Sacrifice (Adaahi)",
                    "chapterUrdu": "قربانی کے مسائل کا بیان",
                    "chapterArabic": "كتاب الأضاحي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5336,
                "hadithNumber": "5572",
                "englishNarrator": "Narrated Abu `Ubaid:",
                "hadithEnglish": "Then I witnessed the `Id with `Uthman bin `Affan رضی اللہ عنہ , and that was on a Friday. He offered the prayer before the sermon, saying, \"O people! Today you have two 'Its (festivals) together, so whoever of those who live at Al-`Awali (suburbs) would like to wait for the Jumua prayer, he may wait, and whoever would like to return (home) Is granted my permission to do so.\"",
                "hadithUrdu": "پھر میں عثمان بن عفان رضی اللہ عنہ کے ساتھ ( ان کی خلافت کے زمانہ میں عیدگاہ میں ) حاضر تھا ۔ اس دن جمعہ بھی تھا ۔ آپ نے خطبہ سے پہلے نمازعید پڑھائی پھر خطبہ دیا اور فرمایا اے لوگو ! آج کے دن تمہارے لیے دو عیدیں جمع ہو گئیں ہیں ۔ ( عید اور جمعہ ) پس اطراف کے رہنے والوں میں سے جو شخص پسند کرے جمعہ کا بھی انتظار کرے اور اگر کوئی واپس جانا چاہے ( نمازعید کے بعد ہی ) تو وہ واپس جا سکتا ہے ، میں نے اسے اجازت دے دی ہے ۔",
                "urduNarrator": "ابو عبید نے بیان کیا کہ",
                "hadithArabic": "قَالَ أَبُو عُبَيْدٍ ثُمَّ شَهِدْتُ مَعَ عُثْمَانَ بْنِ عَفَّانَ فَكَانَ ذَلِكَ يَوْمَ الْجُمُعَةِ، فَصَلَّى قَبْلَ الْخُطْبَةِ ثُمَّ خَطَبَ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ هَذَا يَوْمٌ قَدِ اجْتَمَعَ لَكُمْ فِيهِ عِيدَانِ، فَمَنْ أَحَبَّ أَنْ يَنْتَظِرَ الْجُمُعَةَ مِنْ أَهْلِ الْعَوَالِي فَلْيَنْتَظِرْ، وَمَنْ أَحَبَّ أَنْ يَرْجِعَ فَقَدْ أَذِنْتُ لَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "74",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 74,
                    "chapterNumber": "74",
                    "chapterEnglish": "Al-Adha Festival Sacrifice (Adaahi)",
                    "chapterUrdu": "قربانی کے مسائل کا بیان",
                    "chapterArabic": "كتاب الأضاحي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5337,
                "hadithNumber": "5573",
                "englishNarrator": "Narrated Abu `Ubaid:",
                "hadithEnglish": "Then I witnessed (the 'Its) with `Ali bin Abi Talib رضی اللہ عنہ , and he too offered the `Id prayer before the sermon and then delivered the sermon before the people and said, \"Allah's Messenger (ﷺ) has forbidden you to eat the meat of your sacrifices for more than three days.\" And Muammar narrated from Zuhri and Abu Ubaidah from him in the same way.",
                "hadithUrdu": "پھر میں عید کی نماز میں حضرت علی بن ابی طالب رضی اللہ عنہ کے ساتھ آیا ۔ انہوں نے بھی نماز خطبہ سے پہلے پڑھائی پھر لوگوں کو خطبہ دیا اور کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے تمہیں اپنی قربانی کا گوشت تین دن سے زیادہ کھانے کی ممانعت کی ہے اور معمر نے زہری سے اور ان سے ابوعبیدہ نے اسی طرح بیان کیا ۔",
                "urduNarrator": "حضرت ابوعبید نے بیان کیاکہ",
                "hadithArabic": "قَالَ أَبُو عُبَيْدٍ ثُمَّ شَهِدْتُهُ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ، فَصَلَّى قَبْلَ الْخُطْبَةِ، ثُمَّ خَطَبَ النَّاسَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَاكُمْ أَنْ تَأْكُلُوا لُحُومَ نُسُكِكُمْ فَوْقَ ثَلاَثٍ‏.‏ وَعَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ عَنْ أَبِي عُبَيْدٍ نَحْوَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "74",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 74,
                    "chapterNumber": "74",
                    "chapterEnglish": "Al-Adha Festival Sacrifice (Adaahi)",
                    "chapterUrdu": "قربانی کے مسائل کا بیان",
                    "chapterArabic": "كتاب الأضاحي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5338,
                "hadithNumber": "5574",
                "englishNarrator": "Narrated Salim رضی اللہ عنہما :",
                "hadithEnglish": "`Abdullah bin `Umar رضی اللہ عنہما said, \"Allah's Messenger (ﷺ) said, \"Eat of the meat of sacrifices (of `Id al Adha) for three days.\" When `Abdullah departed from Mina, he used to eat (bread with) oil, lest he should eat of the meat of Hadi (which is regarded as unlawful after the three days of the `Id).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ قربانی کا گوشت تین دن تک کھاؤ ۔ حضرت عبداللہ بن عمر رضی اللہ عنہما منیٰ سے کوچ کرتے وقت روٹی زیتون کے تیل سے کھاتے کیونکہ وہ قربانی کے گوشت سے ( تین دن کے بعد ) پر ہیز کرتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن عبدالرحیم نے بیان کیا ، انہوں نے کہا ہم کو یعقوب بن ابراہیم بن سعد نے خبر دی ، انہیں ابن شہاب کے بھتیجے نے ، انہیں ان کے چچا ابن شہاب ( محمد بن مسلم ) نے ، انہیں سالم نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنِ ابْنِ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُوا مِنَ الأَضَاحِيِّ ثَلاَثًا ‏\"‏‏.‏ وَكَانَ عَبْدُ اللَّهِ يَأْكُلُ بِالزَّيْتِ حِينَ يَنْفِرُ مِنْ مِنًى، مِنْ أَجْلِ لُحُومِ الْهَدْىِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "74",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 74,
                    "chapterNumber": "74",
                    "chapterEnglish": "Al-Adha Festival Sacrifice (Adaahi)",
                    "chapterUrdu": "قربانی کے مسائل کا بیان",
                    "chapterArabic": "كتاب الأضاحي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5339,
                "hadithNumber": "5575",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Whoever drinks alcoholic drinks in the world and does not repent (before dying), will be deprived of it in the Hereafter.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے دنیا میں شراب پی اور پھر اس نے توبہ نہیں کی تو آخرت میں وہ اس سے محروم رہے گا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا، ثُمَّ لَمْ يَتُبْ مِنْهَا، حُرِمَهَا فِي الآخِرَةِ ‏\"‏‏.‏",
                "headingArabic": "وَقَوْلُ اللَّهِ تَعَالَى: {إِنَّمَا الْخَمْرُ وَالْمَيْسِرُ وَالأَنْصَابُ وَالأَزْلاَمُ رِجْسٌ مِنْ عَمَلِ الشَّيْطَانِ فَاجْتَنِبُوهُ لَعَلَّكُمْ تُفْلِحُونَ}",
                "headingUrdu": "’’نشہ، جوا، الانساب اور الاعلام شیطان کے کارناموں سے مکروہ ہیں‘‘۔",
                "headingEnglish": "\"Intoxicants, gambling, Al-Ansab and Al-Azlam are an abomination of Shaitan's handiwork ...\"",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5340,
                "hadithNumber": "5576",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "On the night Allah's Messenger (ﷺ) was taken on a night journey (Miraj) two cups, one containing wine and the other milk, were presented to him at Jerusalem. He looked at it and took the cup of milk. Gabriel said, \"Praise be to Allah Who guided you to Al-Fitra (the right path); if you had taken (the cup of) wine, your nation would have gone astray.\" Mamar, Ibn-e-Al Haad, Uthman bin Umer, and Zubaidi reported the same from Zuhri.",
                "hadithUrdu": "جس رات رسول اللہ صلی اللہ علیہ وسلم کو معراج کرائی گئی تو آپ صلی اللہ علیہ وسلم کو ( بیت المقدس کے شہر ) ایلیاء میں شراب اور دودھ دو پیالے پیش کئے گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں دیکھا پھر آپ صلی اللہ علیہ وسلم نے دودھ کا پیالہ لے لیا ۔ اس پر حضرت جبرائیل علیہ السلام نے کہا اس اللہ کے لیے تمام تعریفیں ہیں جس نے آپ صلی اللہ علیہ وسلم کو دین فطرت کی طرف چلنے کی ہدایت فرمائی ۔ اگر آپ صلی اللہ علیہ وسلم نے شراب کا پیالہ لے لیا ہوتا تو آپ صلی اللہ علیہ وسلم کی امت گمراہ ہو جاتی ۔ شعیب کے ساتھ اس حدیث کو معمر ، ابن الہاد ، عثمان بن عمر اور زبیدی نے زہری سے نقل کیا ہے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، کہا مجھ کو حضرت سعید بن مسیب نے خبر دی اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ لَيْلَةَ أُسْرِيَ بِهِ بِإِيلِيَاءَ بِقَدَحَيْنِ مِنْ خَمْرٍ، وَلَبَنٍ فَنَظَرَ إِلَيْهِمَا، ثُمَّ أَخَذَ اللَّبَنَ، فَقَالَ جِبْرِيلُ الْحَمْدُ لِلَّهِ الَّذِي هَدَاكَ لِلْفِطْرَةِ، وَلَوْ أَخَذْتَ الْخَمْرَ غَوَتْ أُمَّتُكَ‏.‏ تَابَعَهُ مَعْمَرٌ وَابْنُ الْهَادِ وَعُثْمَانُ بْنُ عُمَرَ وَالزُّبَيْدِيُّ عَنِ الزُّهْرِيِّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5341,
                "hadithNumber": "5577",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "I heard from Allah's Messenger (ﷺ) a narration which none other than I will narrate to you. The Prophet, said, \"From among the portents of the our are the following: General ignorance (in religious affairs) will prevail, (religious) knowledge will decrease, illegal sexual intercourse will prevail, alcoholic drinks will be drunk (in abundance), men will decrease and women will increase so much so that for every fifty women there will be one man to look after them.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے ایک حدیث سنی جو تم سے اب میرے سوا کوئی اور نہیں بیان کرے گا ۔ ( کیونکہ اب میرے سوا کوئی صحابی زندہ موجود نہیں رہا ہے ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ قیامت کی نشانیوں میں سے یہ ہے کہ جہالت غالب ہو جائے گی اور علم کم ہو جائے گا ، زناکاری بڑھ جائے گی ، شراب کثرت سے پی جانے لگے گی ، عورتیں بہت ہو جائیں گی ، یہاں تک کہ پچاس پچاس عورتوں کی نگرانی کرنے والا صرف ایک ہی مرد رہ جائے گا ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے ہشام دستوائی نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم حَدِيثًا لاَ يُحَدِّثُكُمْ بِهِ غَيْرِي قَالَ ‏ \"‏ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يَظْهَرَ الْجَهْلُ، وَيَقِلَّ الْعِلْمُ، وَيَظْهَرَ الزِّنَا، وَتُشْرَبَ الْخَمْرُ، وَيَقِلَّ الرِّجَالُ، وَيَكْثُرَ النِّسَاءُ، حَتَّى يَكُونَ لِخَمْسِينَ امْرَأَةً قَيِّمُهُنَّ رَجُلٌ وَاحِدٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5342,
                "hadithNumber": "5578",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"An adulterer, at the time he is committing illegal sexual intercourse is not a believer; and a person, at the time of drinking an alcoholic drink is not a believer; and a thief, at the time of stealing, is not a believer.\" Ibn Shihab said: `Abdul Malik bin Abi Bakr bin `Abdur-Rahman bin Al- Harith bin Hisham told me that Abu Bakr رضی اللہ عنہ used to narrate that narration to him on the authority of Abu Huraira رضی اللہ عنہ . He used to add that Abu Bakr رضی اللہ عنہ used to mention, besides the above cases, \"And he who robs (takes illegally something by force) while the people are looking at him, is not a believer at the time he is robbing (taking).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کوئی شخص جب زنا کرتا ہے تو عین زنا کرتے وقت وہ مومن نہیں ہوتا ۔ اسی طرح جب وہ شراب پیتا ہے تو عین شراب پیتے وقت وہ مومن نہیں ہوتا ۔ اسی طرح جب چور چوری کرتا ہے تو اس وقت وہ مومن نہیں ہوتا ۔ اورابن شہاب نے بیان کیا ، انہیں عبدالملک بن ابی بکر بن عبدالرحمٰن بن حارث بن ہشام نے خبر دی ، ان سے حضرت ابوبکر رضی اللہ عنہ بیان کرتے تھے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ پھر انہوں نے بیان کیا کہ حضرت ابوبکر بن عبدالرحمٰن حضرت ابوہریرہ رضی اللہ عنہ کی حدیث میں امور مذکورہ کے ساتھ اتنا اور زیادہ کرتے تھے کہ کوئی شخص ( دن دھاڑے ) اگر کسی بڑی پونجی پر اس طور ڈاکہ ڈالتا ہے کہ لوگ دیکھتے کے دیکھتے رہ جاتے ہیں تو وہ مومن رہتے ہوئے یہ لوٹ مار نہیں کرتا ۔",
                "urduNarrator": "ہم سے احمد بن صالح نے بیان کیا ، کہا ہم سے ابن وہب نے بیان کیا ، کہا کہ مجھے یونس نے خبر دی ، ان سے ابن شہاب نے بیان کیا ، کہا کہ میں نے ابوسلمہ بن عبدالرحمٰن اور ابن مسیب سے سنا ، وہ بیان کرتے تھے کہ حضرت ابوہریرہ رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، وَابْنَ الْمُسَيَّبِ، يَقُولاَنِ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهْوَ مُؤْمِنٌ، وَلاَ يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهْوَ مُؤْمِنٌ، وَلاَ يَسْرِقُ السَّارِقُ حِينَ يَسْرِقُ وَهْوَ مُؤْمِنٌ ‏\"‏‏.‏ قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ أَنَّ أَبَا بَكْرٍ كَانَ يُحَدِّثُهُ عَنْ أَبِي هُرَيْرَةَ ثُمَّ يَقُولُ كَانَ أَبُو بَكْرٍ يُلْحِقُ مَعَهُنَّ ‏\"‏ وَلاَ يَنْتَهِبُ نُهْبَةً ذَاتَ شَرَفٍ، يَرْفَعُ النَّاسُ إِلَيْهِ أَبْصَارَهُمْ فِيهَا حِينَ يَنْتَهِبُهَا وَهْوَ مُؤْمِنٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5343,
                "hadithNumber": "5579",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"Alcoholic drinks were prohibited (by Allah) when there was nothing of it (special kind of wine) in Medina.",
                "hadithUrdu": "جب شراب حرام کی گئی تو انگور کی شراب مدینہ منورہ میں نہیں ملتی تھی ۔",
                "urduNarrator": "ہم سے حسن بن صباح نے بیان کیا ، کہا ہم سے محمد بن سابق نے بیان کیا ، کہا ہم سے امام مالک نے جو مغول کے صاحبزادے ہیں ، بیان کیا ان سے نافع نے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ صَبَّاحٍ، حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ، حَدَّثَنَا مَالِكٌ ـ هُوَ ابْنُ مِغْوَلٍ ـ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ لَقَدْ حُرِّمَتِ الْخَمْرُ، وَمَا بِالْمَدِينَةِ مِنْهَا شَىْءٌ‏.‏",
                "headingArabic": "الْخَمْرُ مِنَ الْعِنَبِ",
                "headingUrdu": "انگور اور دیگر چیزوں سے تیار کردہ الکوحل مشروبات",
                "headingEnglish": "Alcoholic drinks prepared from grapes and other things",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5344,
                "hadithNumber": "5580",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "\"Alcoholic drinks were prohibited at the time we could rarely find wine made from grapes in Medina, for most of our liquors were made from unripe and ripe dates.",
                "hadithUrdu": "جب شراب ہم پر حرام کی گئی تو مدینہ منورہ میں انگور کی شراب بہت کم ملتی تھی ۔ عام استعمال کی شراب کچی اور پکی کھجور سے تیار کی جاتی تھی",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، انہوں نے کہا ہم سے ابو شہاب عبد ربہ بن نافع نے بیان کیا ، انہوں نے کہا کہ ہم سے یونس نے ، ان سے ثابت بنانی نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو شِهَابٍ عَبْدُ رَبِّهِ بْنُ نَافِعٍ، عَنْ يُونُسَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسٍ، قَالَ حُرِّمَتْ عَلَيْنَا الْخَمْرُ حِينَ حُرِّمَتْ وَمَا نَجِدُ ـ يَعْنِي بِالْمَدِينَةِ ـ خَمْرَ الأَعْنَابِ إِلاَّ قَلِيلاً، وَعَامَّةُ خَمْرِنَا الْبُسْرُ وَالتَّمْرُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5345,
                "hadithNumber": "5581",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "`Umar رضی اللہ عنہ stood up on the pulpit and said, \"Now then, prohibition of alcoholic drinks have been revealed, and these drinks are prepared from five things, i.e.. grapes, dates, honey, wheat or barley And an alcoholic drink is that, that disturbs the mind.",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ ممبر پر کھڑے ہوئے اور کہا امابعد ! جب شراب کی حرمت کا حکم نازل ہوا تو وہ پانچ چیزوں سے بنتی تھی ۔ انگور ، کھجور ، شہد ، گیہوں اور جو اور شراب ( خمر ) وہ ہے جو عقل کو زائل کر دے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، کہا ان سے ابو حیان نے ، کہا ہم سے عامر نے بیان کیا اور ان سے حضرت ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ أَبِي حَيَّانَ، حَدَّثَنَا عَامِرٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَامَ عُمَرُ عَلَى الْمِنْبَرِ فَقَالَ أَمَّا بَعْدُ نَزَلَ تَحْرِيمُ الْخَمْرِ وَهْىَ مِنْ خَمْسَةٍ الْعِنَبِ وَالتَّمْرِ وَالْعَسَلِ وَالْحِنْطَةِ وَالشَّعِيرِ، وَالْخَمْرُ مَا خَامَرَ الْعَقْلَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5346,
                "hadithNumber": "5582",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "I was serving Abu 'Ubaida, Abu Talha and Ubai bin Ka`b رضی اللہ عنہم with a drink prepared from ripe and unripe dates. Then somebody came to them and said, \"Alcoholic drinks have been prohibited.\" (On hearing that) Abu Talha رضی اللہ عنہ said, \"Get up. O Anas, and pour (throw) it out! So I poured (threw) it out.",
                "hadithUrdu": "میں ابوعبیدہ ، ابوطلحہ اور ابی بن کعب رضی اللہ عنہم کو کچی اور پکی کھجور سے تیار کی ہوئی شراب پلا رہا تھا کہ ایک آنے والے نے آ کر بتایا کہ شراب حرام کر دی گئی ہے ۔ اس وقت حضرت ابوطلحہ رضی اللہ عنہ نے کہا کہ انس اٹھو اور شراب کو بہا دو ۔ چنانچہ میں نے اسے بہا دیا ۔",
                "urduNarrator": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ مجھ سے مالک بن انس نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كُنْتُ أَسْقِي أَبَا عُبَيْدَةَ وَأَبَا طَلْحَةَ وَأُبَىَّ بْنَ كَعْبٍ مِنْ فَضِيخِ زَهْوٍ وَتَمْرٍ فَجَاءَهُمْ آتٍ فَقَالَ إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ‏.‏ فَقَالَ أَبُو طَلْحَةَ قُمْ يَا أَنَسُ فَأَهْرِقْهَا‏.‏ فَأَهْرَقْتُهَا‏.‏",
                "headingArabic": "نَزَلَ تَحْرِيمُ الْخَمْرِ وَهْىَ مِنَ الْبُسْرِ وَالتَّمْرِ",
                "headingUrdu": "کچی اور پکی کھجور سے تیار کردہ الکحل مشروبات کی ممانعت",
                "headingEnglish": "Prohibition of alcoholic drinks prepared from unripe and ripe dates",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5347,
                "hadithNumber": "5583",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "I, standing by a tribe, was serving my uncles wine and was the youngest of them all. It was said then: Wine has been forbidden. The people, whereupon, said: Spill it, so I spilled it. The reporter says that he inquired of Hadrat Anas رضی اللہ عنہ: What was their wine made of? He replisd; Fresh and dry dates. Abu Bakr bin Anas رضی اللہ عنہ said: It was their wine but Hadrat Anas رضی اللہ عنہ did not deny it. Some of my companions narrated it to me that they heard Hadrat Anas رضی اللہ عنہ say: This was their wine then.",
                "hadithUrdu": "ایک قبیلہ میں کھڑا میں اپنے چچاؤں کو کھجور کی شراب پلا رہا تھا میں ان میں سب سے کم عمر تھا ۔ کسی نے کہا کہ شراب حرام کر دی گئی ۔ ان حضرات نے کہا کہ اب اسے پھینک دو ۔ چنانچہ ہم نے شراب پھینک دی ۔ میں نے انس رضی اللہ عنہ سے پوچھا کہ وہ کس چیز کی شراب بنتی تھی ؟ فرمایا کہ تازہ پکی ہوئی اور کچی کھجوروں کی ۔ ابوبکر بن انس نے کہا کہ ان کی شراب ( کھجور کی ) ہوتی تھی تو حضرت انس رضی اللہ عنہ نے اس کا انکار نہیں کیا اور مجھ سے میرے بعض اصحاب نے بیان کیا کہ انہوں نے حضرت انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ اس زمانہ میں ان کی شراب اکثر کچی اور پکی کھجور سے تیار کی جاتی تھی ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے معمر نے بیان کیا ، ان سے ان کے والد نے کہ میں نے حضرت انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ أَنَسًا، قَالَ كُنْتُ قَائِمًا عَلَى الْحَىِّ أَسْقِيهِمْ ـ عُمُومَتِي وَأَنَا أَصْغَرُهُمُ ـ الْفَضِيخَ، فَقِيلَ حُرِّمَتِ الْخَمْرُ‏.‏ فَقَالُوا أَكْفِئْهَا‏.‏ فَكَفَأْتُهَا‏.‏ قُلْتُ لأَنَسٍ مَا شَرَابُهُمْ قَالَ رُطَبٌ وَبُسْرٌ‏.‏ فَقَالَ أَبُو بَكْرِ بْنُ أَنَسٍ وَكَانَتْ خَمْرَهُمْ‏.‏ فَلَمْ يُنْكِرْ أَنَسٌ‏.‏ وَحَدَّثَنِي بَعْضُ أَصْحَابِي أَنَّهُ سَمِعَ أَنَسًا يَقُولُ كَانَتْ خَمْرَهُمْ يَوْمَئِذٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5348,
                "hadithNumber": "5584",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Alcoholic drinks were prohibited. At that time these drinks used to be prepared from unripe and ripe dates.",
                "hadithUrdu": "جب شراب حرام کی گئی تو وہ کچی اور پختہ کھجوروں سے تیار کی جاتی تھی ۔",
                "urduNarrator": "ہم سے محمد بن ابی بکر مقدمی نے بیان کیا ، انہوں نے کہا ہم سے یوسف ابو معشر براء نے بیان کیا ، انہوں نے کہا کہ میں نے سعید بن عبداللہ سے سنا ، انہوں نے کہا کہ مجھ سے بکر بن عبداللہ نے بیان کیا اور انہوں نے کہا کہ مجھ سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا يُوسُفُ أَبُو مَعْشَرٍ الْبَرَّاءُ، قَالَ سَمِعْتُ سَعِيدَ بْنَ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي بَكْرُ بْنُ عَبْدِ اللَّهِ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُمْ أَنَّ الْخَمْرَ حُرِّمَتْ، وَالْخَمْرُ يَوْمَئِذٍ الْبُسْرُ وَالتَّمْرُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5349,
                "hadithNumber": "5585",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) was asked about Al-Bit. He said, \"All drinks that intoxicate are unlawful (to drink.)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے ” بتع “ کے متعلق پوچھا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو بھی پینے والی چیز نشہ لاوے وہ حرام ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں ابوسلمہ بن عبدالرحمٰن نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، قَالَتْ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْبِتْعِ فَقَالَ ‏ \"‏ كُلُّ شَرَابٍ أَسْكَرَ فَهْوَ حَرَامٌ ‏\"‏‏.‏",
                "headingArabic": "الْخَمْرُ مِنَ الْعَسَلِ وَهْوَ الْبِتْعُ",
                "headingUrdu": "شہد سے تیار الکحل مشروبات",
                "headingEnglish": "Alcoholic drinks prepared from honey",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5350,
                "hadithNumber": "5586",
                "englishNarrator": "Narrated 'Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) was asked about Al-Bit a liquor prepared from honey which the Yemenites used to drink. Allah's Messenger (ﷺ) said, \"All drinks that intoxicate are unlawful (to drink).\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے ” بتع “ کے متعلق سوال کیا گیا ۔ یہ مشروب شہد سے تیار کیا جاتا تھا اور یمن میں اس کا عام رواج تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو چیز بھی نشہ لانے والی ہو وہ حرام ہے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہوں نے کہا کہ مجھ کو ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْبِتْعِ وَهْوَ نَبِيذُ الْعَسَلِ، وَكَانَ أَهْلُ الْيَمَنِ يَشْرَبُونَهُ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُلُّ شَرَابٍ أَسْكَرَ فَهْوَ حَرَامٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5351,
                "hadithNumber": "5587",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Do not make drinks in Ad-Dubba' nor in Al-Muzaffat. Abu Huraira رضی اللہ عنہ used to add to them Al-Hantam and An-Naqir.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” دباء “ اور ” مزفت “ میں نبیذ نہ بنایا کرو اور حضرت ابوہریرہ رضی اللہ عنہ اس کے ساتھ ” حنتم “ اور ” نقیر “ کا بھی اضافہ کیا کرتے تھے ۔",
                "urduNarrator": "اور زہری سے روایت ہے ، کہا کہ مجھ سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَعَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَنْتَبِذُوا فِي الدُّبَّاءِ، وَلاَ فِي الْمُزَفَّتِ ‏\"‏‏.‏ وَكَانَ أَبُو هُرَيْرَةَ يُلْحِقُ مَعَهَا الْحَنْتَمَ وَالنَّقِيرَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5352,
                "hadithNumber": "5588",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "`Umar delivered a sermon on the pulpit of Allah's Messenger (ﷺ), saying, \"Alcoholic drinks were prohibited by Divine Order, and these drinks used to be prepared from five things, i.e., grapes, dates, wheat, barley and honey. Alcoholic drink is that, that disturbs the mind.\" `Umar added, \"I wish Allah's Apostle had not left us before he had given us definite verdicts concerning three matters, i.e., how much a grandfather may inherit (of his grandson), the inheritance of Al-Kalala (the deceased person among whose heirs there is no father or son), and various types of Riba(1 ) (usury) .'' Abu Hayyan asked Shabi. O Abu Amr! In sindh, some people prepare wine from rice. He, Thereupon, said: It was not prepared in prophet times or it was not in Hadrat Umer times. Hammad has reported the word ''Azzabeeb'' in place of ''Inab''",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے منبر پر خطبہ دیتے ہوئے کہا جب شراب کی حرمت کا حکم ہوا تو وہ پانچ چیزوں سے بنتی تھی ۔ انگور سے ، کھجور سے ، گیہوں سے ، جو اور شہد سے اور ” خمر “ ( شراب ) وہ ہے جو عقل کو مخمور کر دے اور تین مسائل ایسے ہیں کہ میری تمنا تھی کہ رسول اللہ صلی اللہ علیہ وسلم ہم سے جدا ہونے سے پہلے ہمیں ان کا حکم بتا جاتے ، دادا کا مسئلہ ، کلالہ کا مسئلہ اور سود کے چند مسائل ۔ ابو حیان نے بیان کیا کہ میں نے شعبی سے پوچھا اے ابوعمرو ! ایک شربت سندھ میں چاول سے بنایا جاتا ہے ۔ انہوں نے کہا کہ یہ چیز رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں نہیں پائی جاتی تھی یا کہا کہ حضرت عمر رضی اللہ عنہ کے زمانے میں نہ تھی اور فرج ابن منہال نے بھی اس حدیث کو حماد بن سلمہ سے بیان کیا اور ان سے ابو حیان نے اس میں ” انگور “ کے بجائے ” کشمش “ ہے ۔",
                "urduNarrator": "ہم سے احمد بن ابی رجاء نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے ابو حیان تمیمی نے ، ان سے شعبی نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا يَحْيَى، عَنْ أَبِي حَيَّانَ التَّيْمِيِّ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ خَطَبَ عُمَرُ عَلَى مِنْبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّهُ قَدْ نَزَلَ تَحْرِيمُ الْخَمْرِ، وَهْىَ مِنْ خَمْسَةِ أَشْيَاءَ الْعِنَبِ وَالتَّمْرِ وَالْحِنْطَةِ وَالشَّعِيرِ وَالْعَسَلِ، وَالْخَمْرُ مَا خَامَرَ الْعَقْلَ، وَثَلاَثٌ وَدِدْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يُفَارِقْنَا حَتَّى يَعْهَدَ إِلَيْنَا عَهْدًا الْجَدُّ وَالْكَلاَلَةُ وَأَبْوَابٌ مِنْ أَبْوَابِ الرِّبَا‏.‏ قَالَ قُلْتُ يَا أَبَا عَمْرٍو فَشَىْءٌ يُصْنَعُ بِالسِّنْدِ مِنَ الرُّزِّ‏.‏ قَالَ ذَاكَ لَمْ يَكُنْ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم أَوْ قَالَ عَلَى عَهْدِ عُمَرَ‏.‏ وَقَالَ حَجَّاجُ عَنْ حَمَّادٍ عَنْ أَبِي حَيَّانَ مَكَانَ الْعِنَبِ الزَّبِيبَ‏.‏",
                "headingArabic": "مَا جَاءَ فِي أَنَّ الْخَمْرَ مَا خَامَرَ الْعَقْلَ مِنَ الشَّرَابِ",
                "headingUrdu": "نشہ آورمشروب کوئی بھی مشروب ہے جو دماغ کو پریشان کرتا ہے۔",
                "headingEnglish": "Alcoholic drink is any drink that disturbs the mind",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5326,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=213",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=211",
                "label": "211",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=212",
                "label": "212",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=213",
                "label": "213",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=214",
                "label": "214",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=215",
                "label": "215",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=216",
                "label": "216",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=217",
                "label": "217",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=215",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=215",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=213",
        "to": 5350,
        "total": 40465
    }
}