{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 269,
        "data": [
            {
                "id": 6706,
                "hadithNumber": "6989",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"A good dream is a part of the forty six parts of prophetism.\"",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا کہ نیک خواب نبوت کے چھیالیس حصوں میں سے ایک حصہ ہے ۔",
                "urduNarrator": "ہم سے ابراہیم بن حمزہ نے بیان کیا ‘ انہوں نے کہا ہم سے ابراہیم بن ابی حازم اور عبد العزیز دراوری نے بیان کیا ‘ ان سے یزید بن عبداللہ نے بیان کیا ‘ ان سے عبداللہ بن خباب نے ‘ ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، وَالدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6707,
                "hadithNumber": "6990",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"Nothing is left of the prophetism except Al-Mubashshirat.\" They asked, \"What are Al-Mubashshirat?\" He replied, \"The true good dreams (that conveys glad tidings).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ‘ آپ نے فرمایا کہ نبوت میں سے صرف اب مبشرات باقی رہ گئی ہیں ۔ صحابہ نے پوچھا کہ مبشرات کیا ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اچھے خواب",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ انہوں نے کہا ہم کو شعیب نے خبر دی ‘ انہیں زہری نے ‘ کہا مجھ سے سعید بن مسیب نے بیان کیا ‘ ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لَمْ يَبْقَ مِنَ النُّبُوَّةِ إِلاَّ الْمُبَشِّرَاتُ ‏\"‏‏.‏ قَالُوا وَمَا الْمُبَشِّرَاتُ قَالَ ‏\"‏ الرُّؤْيَا الصَّالِحَةُ ‏\"‏‏.‏",
                "headingArabic": "الْمُبَشِّرَاتِ",
                "headingUrdu": "المبشرات",
                "headingEnglish": "Al-Mubashshirat",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6708,
                "hadithNumber": "6991",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہ :",
                "hadithEnglish": "Some people were shown the Night of Qadr as being in the last seven days (of the month of Ramadan). The Prophet (ﷺ) said, \"Seek it in the last seven days (of Ramadan).",
                "hadithUrdu": "کچھ لوگوں نے خواب میں شب قدر ( رمضان کی ) سات آخری تاریخوں میں دکھائی گئی اور کچھ لوگوں کو دکھائی گئی کہ وہ آخری دس تاریخوں میں ہو گی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے آخری سات تاریخوں میں تلاش کرو ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ‘ ان سے عقیل نے بیان کیا ‘ ان سے ابن شہاب نے بیان کیا ‘ ان سے سالم بن عبداللہ نے‘ان سے ابن عمر رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنه ـ أَنَّ أُنَاسًا، أُرُوا لَيْلَةَ الْقَدْرِ فِي السَّبْعِ الأَوَاخِرِ، وَأَنَّ أُنَاسًا أُرُوا أَنَّهَا فِي الْعَشْرِ الأَوَاخِرِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ الْتَمِسُوهَا فِي السَّبْعِ الأَوَاخِرِ ‏\"‏‏.‏",
                "headingArabic": "التَّوَاطُؤُ عَلَى الرُّؤْيَا",
                "headingUrdu": "اگر بہت سے لوگوں کا ایک ہی خواب ہو۔",
                "headingEnglish": "If a number of persons have the same dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6709,
                "hadithNumber": "6992",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If I stayed in prison as long as Joseph stayed and then the messenger came, I would respond to his call (to go out of the prison) .\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اگر میں اتنے دنوں قید میں رہتا جتنے دنوں یوسف علیہ السلام پڑے رہے اور پھر میرے پاس قاصد بلانے آتا تو میں اس کی دعوت قبول کر لیتا ۔",
                "urduNarrator": "ہم سے عبداللہ نے بیان کیا ‘ انہوں نے کہا ہم سے جویریہ نے بیان کیا ‘ ان سے امام مالک نے بیان کیا ‘ ان سے زہری نے بیان کیا ‘ انہیں سعید بن مسیب اور ابوعبیدہ نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَأَبَا، عُبَيْدٍ أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ لَبِثْتُ فِي السِّجْنِ مَا لَبِثَ يُوسُفُ، ثُمَّ أَتَانِي الدَّاعِي لأَجَبْتُهُ ‏\"‏‏.‏",
                "headingArabic": "رُؤْيَا أَهْلِ السُّجُونِ وَالْفَسَادِ وَالشِّرْكِ",
                "headingUrdu": "قیدیوں، بدکاروں اور مشرکین کے خواب",
                "headingEnglish": "The dreams of prisoners, evil-doers and Mushrikun",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6710,
                "hadithNumber": "6993",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"Whoever sees me in a dream will see me in his wakefulness, and Satan cannot imitate me in shape.\" Abu `Abdullah said, \"Ibn Seereen said, 'Only if he sees the Prophet (ﷺ) in his (real) shape.'\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ‘ آپ نے فرمایا کہ جس نے مجھے خواب میں دیکھا تو کسی دن مجھے بیداری میں بھی دیکھے گا اور شیطان میری صورت میں نہیں آ سکتا ۔ ابوعبداللہ ( حضرت امام بخاری رحمہ اللہ ) نے کہا کہ ابن سیرین نے بیان کیا کہ جب آنحضرت صلی اللہ علیہ وسلم کو کوئی شخص آپ کی صورت میں دیکھے ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ‘ کہا ہم کو عبداللہ نے خبر دی ‘ انہیں یونس نے ‘ انہیں زہری نے ‘ کہا مجھ سے ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ رَآنِي فِي الْمَنَامِ فَسَيَرَانِي فِي الْيَقَظَةِ، وَلاَ يَتَمَثَّلُ الشَّيْطَانُ بِي ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ ابْنُ سِيرِينَ إِذَا رَآهُ فِي صُورَتِهِ‏.‏",
                "headingArabic": "مَنْ رَأَى النَّبِيَّ صلى الله عليه وسلم فِي الْمَنَامِ",
                "headingUrdu": "جس نے رسول اللہ صلی اللہ علیہ وسلم کو خواب میں دیکھا",
                "headingEnglish": "Whoever saw the Prophet (saws) in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6711,
                "hadithNumber": "6994",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever has seen me in a dream, then no doubt, he has seen me, for Satan cannot imitate my shape.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے مجھے خواب میں دیکھا تو اس نے واقعی دیکھا کیونکہ شیطان میری صورت میں نہیں آ سکتا اور مومن کا خواب نبوت کے چھیالیس حصوں میں سے ایک جزو ہوتا ہے ۔",
                "urduNarrator": "ہم سے معلی بن اسد نے بیان کیا ‘ انہوں نے کہا ہم سے عبد العزیز بن مختار نے بیان کیا ‘ انہوں نے کہا ہم سے ثابت بنانی نے بیان کیا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي، فَإِنَّ الشَّيْطَانَ لاَ يَتَخَيَّلُ بِي، وَرُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6712,
                "hadithNumber": "6995",
                "englishNarrator": "Narrated Abu Qatada رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A good dream is from Allah, and a bad dream is from Satan. So whoever has seen (in a dream) something he dislikes, then he should spit without saliva, thrice on his left and seek refuge with Allah from Satan, for it will not harm him, and Satan cannot appear in my shape.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اچھے خواب اللہ کی طرف سے ہوتے ہیں اور برے خواب شیطان کی طرف سے پس جو شخص کوئی برا خواب دیکھے تو اپنے بائیں طرف کروٹ لے کر تین مرتبہ تھو تھو کرے اور شیطان سے اللہ کی پناہ مانگے وہ اس کو نقصان نہیں دے گا اور شیطان کبھی میری شکل میں نہیں آ سکتا ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے بیان کیا ‘ ان سے عبیداللہ بن ابی جعفر نے ‘ کہا مجھ کو حضرت ابوسلمہ رضی اللہ عنہ نے خبر دی اور ان سے ابوقتادہ رضی اللہ عنہ نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، أَخْبَرَنِي أَبُو سَلَمَةَ، عَنْ أَبِي قَتَادَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ الرُّؤْيَا الصَّالِحَةُ مِنَ اللَّهِ، وَالْحُلْمُ مِنَ الشَّيْطَانِ، فَمَنْ رَأَى شَيْئًا يَكْرَهُهُ فَلْيَنْفِثْ عَنْ شِمَالِهِ ثَلاَثًا، وَلْيَتَعَوَّذْ مِنَ الشَّيْطَانِ، فَإِنَّهَا لاَ تَضُرُّهُ، وَإِنَّ الشَّيْطَانَ لاَ يَتَرَاءَى بِي ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6713,
                "hadithNumber": "6996",
                "englishNarrator": "Narrated Abu Qatada رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever sees me (in a dream) then he indeed has seen the truth .\" Similarly, Younus and zuhri,s nephew have reporte it.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے مجھے دیکھا اس نے حق دیکھا ۔ اس روایت کی متابعت یونس نے اور زہری کے بھتیجے نے کی ۔",
                "urduNarrator": "ہم سے خالد بن خلی نے بیان کیا ‘ انہوں نے کہا ہم سے محمد بن حرب نے بیان کیا ‘ انہوں نے کہا مجھ سے زبیدی نے بیان کیا ‘ ان سے زہری نے بیان کیا ‘ ان سے حضرت ابوسلمہ رضی اللہ عنہ نے اور ان سے حضرت ابوقتادہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا خَالِدُ بْنُ خَلِيٍّ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنِي الزُّبَيْدِيُّ، عَنِ الزُّهْرِيِّ، قَالَ أَبُو سَلَمَةَ قَالَ أَبُو قَتَادَةَ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّ ‏\"‏‏.‏ تَابَعَهُ يُونُسُ وَابْنُ أَخِي الزُّهْرِيِّ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6714,
                "hadithNumber": "6997",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "He heard the Prophet (ﷺ) said, \"Who ever sees me (in a dream) then he indeed has seen the truth, as Satan cannot appear in my shape.\"",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم کو یہ فرماتے سنا کہ جس نے مجھے دیکھا اس نے حق دیکھا کیونکہ شیطان مجھ جیسا نہیں بن سکتا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ انہوں نے کہا ہم سے لیث نے بیان کیا ‘ انہوں نے کہا ہم سے ابن الہاد نے بیان کیا ‘ ان سے عبداللہ بن خباب نے بیان کیا ‘ ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا ‘",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّ، فَإِنَّ الشَّيْطَانَ لاَ يَتَكَوَّنُنِي‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6715,
                "hadithNumber": "6998",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I have been given the keys of eloquent speech and given victory with awe (cast into the hearts of the enemy), and while I was sleeping last night, the keys of the treasures of the earth were brought to me till they were put in my hand.\" Abu Huraira added: Allah's Messenger (ﷺ) left (this world) and now you people are carrying those treasures from place to place.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مجھے مفاتيح الكلم دئیے گئے ہیں اور رعب کے ذریعہ میری مدد کی گئی ہے اور گذشتہ رات میں سویا ہوا تھا کہ زمین کے خزانوں کی کنجیاں میرے پاس لائیں گئیں اور میرے سامنے انہیں رکھ دیا گیا ۔ حضرت ابوہریرہ رضی اللہ عنہ نے کہا کہ آنحضرت صلی اللہ علیہ وسلم تو اس دنیا سے تشریف لے گئے اور تم ان خزانوں کی کنجیوں کو الٹ پلٹ کر رہے ہو یا نکال رہے ہو یا لوٹ رہے ہو ۔",
                "urduNarrator": "ہم سے احمد بن مقدام العجلی نے بیان کیا ‘ کہا ہم سے محمد بن عبدالرحمٰن الطفاوی نے بیان کیا ‘ ان سے ایوب نے بیان کیا ‘ ان سے محمد نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ الْمِقْدَامِ الْعِجْلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الطُّفَاوِيُّ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أُعْطِيتُ مَفَاتِيحَ الْكَلِمِ، وَنُصِرْتُ بِالرُّعْبِ، وَبَيْنَمَا أَنَا نَائِمٌ الْبَارِحَةَ إِذْ أُتِيتُ بِمَفَاتِيحِ خَزَائِنِ الأَرْضِ حَتَّى وُضِعَتْ فِي يَدِي ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَذَهَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنْتُمْ تَنْتَقِلُونَهَا‏.‏",
                "headingArabic": "رُؤْيَا اللَّيْلِ",
                "headingUrdu": "رات کے خواب",
                "headingEnglish": "Night dreams",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6716,
                "hadithNumber": "6999",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"I saw myself (in a dream) near the Ka`ba last night, and I saw a man with whitish red complexion, the best you may see amongst men of that complexion having long hair reaching his earlobes which was the best hair of its sort, and he had combed his hair and water was dropping from it, and he was performing the Tawaf around the Ka`ba while he was leaning on two men or on the shoulders of two men. I asked, 'Who is this man?' Somebody replied, '(He is) Messiah, son of Mary.' Then I saw another man with very curly hair, blind in the right eye which looked like a protruding out grape. I asked, 'Who is this?' Somebody replied, '(He is) Messiah, Ad-Dajjal.'\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ رات مجھے کعبہ کے پاس ( خواب میں ) دکھایا گیا ۔ میں نے ایک گندمی رنگ کے آدمی کو دیکھا وہ گندمی رنگ کے کسی سب سے خوبصورت آدمی کی طرح تھے‘ان کے لمبے خوبصورت بال تھے ‘ ان سب سے خوبصورت بالوں کی طرح جو تم دیکھ سکے ہو گے ۔ ان میں انہوں نے کنگھا کیا ہوا تھا اور پانی ان سے ٹپک رہا تھا اور وہ دو آدمیوں کے سہارے یا ( یہ فرمایا کہ ) دو آدمیوں کے شانوں کے سہارے بیت اللہ کا طواف کر رہے تھے ۔ میں نے پوچھا کہ یہ کون صاحب ہیں ۔ مجھے بتایا گیا کہ یہ مسیح ابن مریم علیہما السلام ہیں ۔ پھر اچانک میں نے ایک گھنگھر یالے بال والے آدمی کو دیکھا جس کی ایک آنکھ کانی تھی اور انگور کے دانے کی طرح اٹھی ہوئی تھی ۔ میں نے پوچھا ‘ یہ کون ہے ؟ مجھے بتایا گیا کہ یہ مسیح دجال ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ‘ کہا ہم سے امام مالک نے ‘ ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أُرَانِي اللَّيْلَةَ عِنْدَ الْكَعْبَةِ فَرَأَيْتُ رَجُلاً آدَمَ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنْ أُدْمِ الرِّجَالِ، لَهُ لِمَّةٌ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنَ اللِّمَمِ، قَدْ رَجَّلَهَا تَقْطُرُ مَاءً، مُتَّكِئًا عَلَى رَجُلَيْنِ ـ أَوْ عَلَى عَوَاتِقِ رَجُلَيْنِ ـ يَطُوفُ بِالْبَيْتِ، فَسَأَلْتُ مَنْ هَذَا فَقِيلَ الْمَسِيحُ ابْنُ مَرْيَمَ‏.‏ ثُمَّ إِذَا أَنَا بِرَجُلٍ جَعْدٍ قَطَطٍ أَعْوَرِ الْعَيْنِ الْيُمْنَى كَأَنَّهَا عِنَبَةٌ طَافِيَةٌ، فَسَأَلْتُ مَنْ هَذَا فَقِيلَ الْمَسِيحُ الدَّجَّالُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6717,
                "hadithNumber": "7000",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "A man visited Allah,s Apostle ﷺ and submitted: Tonight I have been shown a dream and then he narrated the complete Hadith. Similarly, Solaiman bin Katheer, Zuhri's newphew, and Sufyan bin Husain has reported from Zuhri and he from Obaidullah, and he from Hadrat Ibn-e-Abbas or Hadrat Abu Hurairah رضی اللہ عنہ and they from the Holy prophet ﷺ. Hadrat  Abu Hurairah رضی اللہ عنہ has reported it from the prophet and Mamar first did not mention its authority but later he started mention it.",
                "hadithUrdu": "ایک صاحب رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئے اور کہا کہ میں نے رات کو خواب دیکھا ہے اور انہوں نے واقعہ بیان کیا اور اس روایت کی متابعت سلیمان بن کثیر ‘ زہری کے بھتیجے اور سفیان بن حسین نے زہری سے کی ‘ ان سے عبیداللہ نے بیان کیا اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا انہوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ‘ اور زبیدی نے زہری سے بیان کیا ‘ ان سے عبیداللہ نے اور ان سے ابن عباس اور ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اور شعیب اور اسحاق بن یحییٰ نے زہری سے بیان کیا کہ حضرت ابوہریرہ رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم سے بیان کرتے تھے اور معمر نے اسے متصلاً نہیں بیان کیا لیکن بعد میں متصلاً بیان کرنے لگے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ نے بیان کیا ‘ انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ‘ ان سے یونس نے بیان کیا ‘ ان سے ابن شہاب نے بیان کیا ‘ان سے عبیداللہ بن عبداللہ نے کہ حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَنَّ ابْنَ عَبَّاسٍ، كَانَ يُحَدِّثُ أَنَّ رَجُلاً، أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنِّي أُرِيتُ اللَّيْلَةَ فِي الْمَنَامِ، وَسَاقَ الْحَدِيثَ‏.‏ وَتَابَعَهُ سُلَيْمَانُ بْنُ كَثِيرٍ وَابْنُ أَخِي الزُّهْرِيِّ وَسُفْيَانُ بْنُ حُسَيْنٍ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ الزُّبَيْدِيُّ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ أَنَّ ابْنَ عَبَّاسٍ أَوْ أَبَا هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ شُعَيْبٌ وَإِسْحَاقُ بْنُ يَحْيَى عَنِ الزُّهْرِيِّ كَانَ أَبُو هُرَيْرَةَ يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم وَكَانَ مَعْمَرٌ لاَ يُسْنِدُهُ حَتَّى كَانَ بَعْدُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6718,
                "hadithNumber": "7001, 7002",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to visit Um Haram bint Milhan رضی اللہ عنہ she was the wife of `Ubada bin As-Samit. One day the Prophet (ﷺ) visited her and she provided him with food and started looking for lice in his head. Then Allah's Messenger (ﷺ) slept and afterwards woke up smiling. Um Haram asked, \"What makes you smile, O Allah's Messenger (ﷺ)?\" He said, \"Some of my followers were presented before me in my dream as fighters in Allah's Cause, sailing in the middle of the seas like kings on the thrones or like kings sitting on their thrones.\" (The narrator 'Is-haq is not sure as to which expression was correct). Um Haram added, 'I said, \"O Allah's Messenger (ﷺ)! Invoke Allah, to make me one of them;\" So Allah's Messenger (ﷺ) invoked Allah for her and then laid his head down (and slept). Then he woke up smiling (again). (Um Haram added): I said, \"What makes you smile, O Allah's Messenger (ﷺ)?\" He said, \"Some people of my followers were presented before me (in a dream) as fighters in Allah's Cause.\" He said the same as he had said before. I said, \"O Allah's Messenger (ﷺ)! Invoke Allah to make me from them.\" He said, \"You are among the first ones.\" Then Um Haram sailed over the sea during the Caliphate of Muawiya bin Abu Sufyan, and she fell down from her riding animal after coming ashore, and died.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم حضرت ام حرام بنت ملحان رضی اللہ عنہ کے ہاں تشریف لے جا یا کرتے تھے ‘ وہ حضرت عبادہ بن صامت کے نکاح میں تھیں ۔ ایک دن آپ ان کے یہاں گئے تو انہوں نے آپ کے سامنے کھانے کی چیز پیش کی اور آپ کا سر جھاڑنے لگیں ۔ اس عرصہ میں آنحضرت صلی اللہ علیہ وسلم سو گئے پھر بیدا ر ہوئے تو آپ مسکرا رہے تھے ۔انہوں نے کہا کہ میں نے اس پر پوچھا یا رسول اللہ ! آپ کیوں ہنس رہے ہیں ؟ آپ نے فرمایا کہ میری امت کے کچھ لوگ میرے سامنے اللہ کے راستے میں غزوہ کرتے ہوئے پیش کئے گئے ‘ اس دریا کی پشت پر ‘ وہ اس طرح سوار ہیں جیسے بادشاہ تخت پر ہوتے ہیں ۔ اسحاق کو شک تھا ( حدیث کے الفاظ ” ملوکاً علی الاسرۃ “ تھے یا ” مثل الملوک علی الاسرۃ “ ) انہوں نے کہا کہ میں نے اس پر عرض کیا یا رسول اللہ ! دعا کیجئے کہ اللہ مجھے بھی ان میں سے کر دے ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے ان کے لیے دعا کی پھر آپ نے سرمبارک رکھا ( اور سو گئے ) پھر بیدار ہوئے تو مسکرا رہے تھے ۔ میں نے عرض کیا یا رسول اللہ ! آپ کیوں ہنس رہے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میری امت کے کچھ لوگ میرے سامنے اللہ کے راستے میں غزوہ کرتے پیش کئے گئے ۔ جس طرح آنحضرت صلی اللہ علیہ وسلم نے پہلی مرتبہ فرمایا تھا ۔ بیان کیا کہ میں نے عرض کیا یا رسول اللہ ! اللہ سے دعا کریں کہ مجھے بھی ان میں سے کر دے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم سب سے پہلے لوگوں میں ہو گی ۔ چنانچہ ام حرام رضی اللہ عنہا معاویہ رضی اللہ عنہ کے زمانہ میں سمندری سفر پر گئیں اور جب سمندر سے باہر آئیں تو سواری سے گر کر شہید ہو گئیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ کہا ہم کو امام مالک نے خبر دی ‘ انہیں اسحاق بن عبداللہ بن ابی طلحہ نے اور انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْخُلُ عَلَى أُمِّ حَرَامٍ بِنْتِ مِلْحَانَ، وَكَانَتْ تَحْتَ عُبَادَةَ بْنِ الصَّامِتِ، فَدَخَلَ عَلَيْهَا يَوْمًا فَأَطْعَمَتْهُ، وَجَعَلَتْ تَفْلِي رَأْسَهُ، فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ اسْتَيْقَظَ وَهْوَ يَضْحَكُ‏.‏‏ قَالَتْ فَقُلْتُ مَا يُضْحِكُكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ نَاسٌ مِنْ أُمَّتِي عُرِضُوا عَلَىَّ، غُزَاةً فِي سَبِيلِ اللَّهِ، يَرْكَبُونَ ثَبَجَ هَذَا الْبَحْرِ، مُلُوكًا عَلَى الأَسِرَّةِ أَوْ مِثْلَ الْمُلُوكِ عَلَى الأَسِرَّةِ ‏\"‏‏.‏ شَكَّ إِسْحَاقُ‏.‏ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ، فَدَعَا لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ وَضَعَ رَأْسَهُ ثُمَّ اسْتَيْقَظَ وَهْوَ يَضْحَكُ‏.‏ فَقُلْتُ مَا يُضْحِكُكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ نَاسٌ مِنْ أُمَّتِي عُرِضُوا عَلَىَّ، غُزَاةً فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏ كَمَا قَالَ فِي الأُولَى‏.‏ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ قَالَ ‏\"‏ أَنْتِ مِنَ الأَوَّلِينَ ‏\"‏‏.‏ فَرَكِبَتِ الْبَحْرَ فِي زَمَانِ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ فَصُرِعَتْ عَنْ دَابَّتِهَا حِينَ خَرَجَتْ مِنَ الْبَحْرِ، فَهَلَكَتْ‏.‏",
                "headingArabic": "الرُّؤْيَا بِالنَّهَارِ",
                "headingUrdu": "دن کے وقت خواب",
                "headingEnglish": "Dreams in the daytime",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6719,
                "hadithNumber": "7003",
                "englishNarrator": "Narrated Kharija bin Zaid bin Thabit:",
                "hadithEnglish": "Um Al-`Ala رضی اللہ عنہا an Ansari woman who had given a pledge of allegiance to Allah's Messenger (ﷺ) told me:, \"The Muhajirln (emigrants) were distributed amongst us by drawing lots, and we got `Uthman bin Maz'un رضی اللہ عنہ in our share. We made him stay with us in our house. Then he suffered from a disease which proved fatal. When he died and was given a bath and was shrouded in his clothes. Allah's Messenger (ﷺ) came, I said, (addressing the dead body), 'O Aba As-Sa'ib! May Allah be Merciful to you! I testify that Allah has honored you.' Allah's Messenger (ﷺ) said, 'How do you know that Allah has honored him?\" I replied, 'Let my father be sacrificed for you, O Allah's Messenger (ﷺ)! On whom else shall Allah bestow. His honor?' Allah's Messenger (ﷺ) said, 'As for him, by Allah, death has come to him. By Allah, I wish him all good (from Allah). By Allah, in spite of the fact that I am Allah's Messenger (ﷺ), I do not know what Allah will do to me.\", Um Al-`Ala added, \"By Allah, I will never attest the righteousness of anybody after that.\"",
                "hadithUrdu": "انہیں ام علاء رضی اللہ عنہا نے جو ایک انصاری عورت تھیں جنہوں نے نبی کریم صلی اللہ علیہ وسلم سے بیعت کی تھی خبر دی کہ انہوں نے مہاجرین کے ساتھ سلسلہ اخوت قائم کرنے کے لیے قرعہ اندازی کی تو ہمارا قرعہ عثمان بن مظعون رضی اللہ عنہ کے نام نکلا ۔ پھر ہم نے انہیں اپنے گھر میں ٹھہرا یا ۔ اس کے بعد انہیں ایک بیماری ہو گئی جس میں ان کی وفات ہو گئی ۔ جب ان کی وفات ہو گئی تو انہیں غسل دیا گیا اور ان کے کپڑوں کا کفن دیا گیا تو رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ۔ میں نے کہا ابو السائب ( عثمان رضی اللہ عنہ ) تم پر اللہ کی رحمت ہو ‘ تمہارے متعلق میری گواہی ہے کہ تمہیں اللہ نے عزت بخشی ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا تمہیں کیسے معلوم ہوا کہ اللہ نے انہیں عزت بخشی ہے ۔ میں نے عرض کیا ‘ میرے ماں باپ آپ پر قربان ہوں یا رسول اللہ ! پھر اللہ کسے عزت بخشے گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا جہاں تک ان کا تعلق ہے تو یقینی چیز ( موت ) ان پر آ چکی ہے اور اللہ کی قسم میں بھی ان کے لیے بھلائی کی امید رکھتا ہوں اور اللہ کی قسم میں رسول اللہ ہونے کے باوجود حتمی طور پر نہیں جانتا کہ میرے ساتھ کیا کیا جائے گا ۔ انہوں نے اس کے بعد کہا کہ اللہ کی قسم اس کے بعد میں کبھی کسی کی برات نہیں کروں گی ۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ‘ کہا مجھ سے لیث بن سعد نے بیان کیا ‘ کہا مجھ سے عقیل نے بیان کیا ‘ ان سے ابن شہاب نے ‘ انہیں خارجہ بن ثابت نے خبر دی ‘",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنِي اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ، أَنَّ أُمَّ الْعَلاَءِ ـ امْرَأَةً مِنَ الأَنْصَارِ بَايَعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم ـ أَخْبَرَتْهُ أَنَّهُمُ اقْتَسَمُوا الْمُهَاجِرِينَ قُرْعَةً‏.‏ قَالَتْ فَطَارَ لَنَا عُثْمَانُ بْنُ مَظْعُونٍ، وَأَنْزَلْنَاهُ فِي أَبْيَاتِنَا، فَوَجِعَ وَجَعَهُ الَّذِي تُوُفِّيَ فِيهِ، فَلَمَّا تُوُفِّيَ غُسِّلَ وَكُفِّنَ فِي أَثْوَابِهِ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ رَحْمَةُ اللَّهِ عَلَيْكَ أَبَا السَّائِبِ، فَشَهَادَتِي عَلَيْكَ لَقَدْ أَكْرَمَكَ اللَّهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَمَا يُدْرِيكِ أَنَّ اللَّهَ أَكْرَمَهُ ‏\"‏‏.‏ فَقُلْتُ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ فَمَنْ يُكْرِمُهُ اللَّهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَّا هُوَ فَوَاللَّهِ لَقَدْ جَاءَهُ الْيَقِينُ، وَاللَّهِ إِنِّي لأَرْجُو لَهُ الْخَيْرَ، وَوَاللَّهِ مَا أَدْرِي وَأَنَا رَسُولُ اللَّهِ مَاذَا يُفْعَلُ بِي ‏\"‏‏.‏ فَقَالَتْ وَاللَّهِ لاَ أُزَكِّي بَعْدَهُ أَحَدًا أَبَدًا‏.‏",
                "headingArabic": "رُؤْيَا النِّسَاءِ",
                "headingUrdu": "خواتین کے خواب",
                "headingEnglish": "The dreams of women",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6720,
                "hadithNumber": "7004",
                "englishNarrator": "Narrated Az-Zuhri:",
                "hadithEnglish": "Regarding the above narration, The Prophet (ﷺ) said, \"I do not know what Allah will do to him (Uthman bin Maz'un رضی اللہ عنہ ).\" Um Al-`Ala said, \"I felt very sorry for that, and then I slept and saw in a dream a flowing spring for `Uthman bin Maz'un رضی اللہ عنہ , and told Allah's Messenger (ﷺ) of that, and he said, \"That flowing spring symbolizes his good deeds.\"",
                "hadithUrdu": "( آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ) میں نہیں جانتا کہ میرے ساتھ کیا کیا جائے گا ۔ انہوں نے بیان کیا کہ اس کا مجھے رنج ہوا ۔ ( کہ حضرت عثمان رضی اللہ عنہ کے متعلق کوئی بات یقین کے ساتھ معلوم نہیں ہے ) چنانچہ میں سو گئی اور میں نے خواب میں دیکھا کہ حضرت عثمان رضی اللہ عنہ کے لیے ایک جاری چشمہ ہے ۔ میں نے اس کی اطلاع آنحضرت صلی اللہ علیہ وسلم کو دی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ ان کا نیک عمل ہے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی اور انہیں زہری نے یہی حدیث بیان کی اور بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، بِهَذَا وَقَالَ ‏\"‏ مَا أَدْرِي مَا يُفْعَلُ بِهِ ‏\"‏‏.‏ قَالَتْ وَأَحْزَنَنِي فَنِمْتُ، فَرَأَيْتُ لِعُثْمَانَ عَيْنًا تَجْرِي، فَأَخْبَرْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ ذَلِكَ عَمَلُهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6721,
                "hadithNumber": "7005",
                "englishNarrator": "Narrated Abu Qatada Al-Ansari رضی اللہ عنہ :",
                "hadithEnglish": "(a companion of the Prophet (ﷺ) and one of his cavalry men) \"I heard Allah's Messenger (ﷺ) saying, \"A good dream is from Allah, and a bad dream is from Satan; so, if anyone of you had a bad dream which he disliked, then he should spit on his left and seek refuge with Allah from it, for it will not harm him.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے صحابی اور آپ کے شہسوار وں میں سے تھے ۔ انہوں نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آپ نے فرمایا کہ اچھے خواب اللہ کی طرف سے ہوتے ہیں اور برے شیطان کی طرف سے پس تم میں جو کوئی برا خواب دیکھے جو اسے ناپسند ہو تو اس چاہئے کہ اپنی بائیں طرف تھوکے اور اس سے اللہ کی پناہ مانگے وہ اسے ہرگز نقصان نہیں پہنچا سکے گا ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث نے بیان کیا ‘ ان سے عقیل نے ‘ ان سے ابن شہاب نے ‘ ان سے ابوسلمہ نے اور ان سے حضرت ابوقتادہ انصاری رضی اللہ عنہ نے جو",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، أَنَّ أَبَا قَتَادَةَ الأَنْصَارِيّ َ ـ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم وَفُرْسَانِهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الرُّؤْيَا مِنَ اللَّهِ، وَالْحُلْمُ مِنَ الشَّيْطَانِ، فَإِذَا حَلَمَ أَحَدُكُمُ الْحُلُمَ يَكْرَهُهُ فَلْيَبْصُقْ عَنْ يَسَارِهِ وَلْيَسْتَعِذْ بِاللَّهِ مِنْهُ، فَلَنْ يَضُرَّهُ ‏\"‏‏.‏",
                "headingArabic": "الْحُلْمُ مِنَ الشَّيْطَانِ",
                "headingUrdu": "ایک برا خواب شیطان کی طرف سے ہے۔",
                "headingEnglish": "A bad dream is from Satan",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6722,
                "hadithNumber": "7006",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"While I was sleeping, I was given a bowl full of milk (in a dream), and I drank of it to my fill until I noticed its wetness coming out of my nails, and then I gave the rest of it to `Umar رضی اللہ عنہ.\" They (the people) asked, \"What have you interpreted (about the dream)? O Allah's Apostle?\" He said, \"(It is Religious) knowledge.\"",
                "hadithUrdu": "میں نے رسول اللہ کریم صلی اللہ علیہ وسلم سے سنا ‘ آپ نے فرمایا کہ میں سویا ہوا تھا کہ میرے پاس دودھ کا ایک پیالہ لایا گیا اور میں نے اس کا دودھ پیا ۔ یہاں تک کہ اس کی سیرابی کا اثر میں نے اپنے ناخنوں میں ظاہر ہوتا دیکھا ۔ اس کے بعد میں نے اس کا بچا ہوا دے دیا ۔ آپ کا اشارہ حضرت عمر رضی اللہ عنہ کی طرف تھا ۔ صحابہ نے پوچھا آپ نے اس کی تعبیر کیا کی یا رسول اللہ ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ علم ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ‘ کہا ہم کو یونس نے خبر دی ‘ انہیں زہری نے ‘ انہیں حمزہ ابن عبداللہ نے خبر دی ‘ ان سے حضرت ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ، أَنَّ ابْنَ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ، فَشَرِبْتُ مِنْهُ، حَتَّى إِنِّي لأَرَى الرِّيَّ يَخْرُجُ مِنْ أَظْفَارِي، ثُمَّ أَعْطَيْتُ فَضْلِي ‏\"‏‏.‏ يَعْنِي عُمَرَ‏.‏ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْعِلْمَ ‏\"‏‏.‏",
                "headingArabic": "اللَّبَنِ",
                "headingUrdu": "دودھ",
                "headingEnglish": "The milk",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6723,
                "hadithNumber": "7007",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"While I was sleeping, I was given a bowl full of milk (in the dream) and I drank from it (to my fill) till I noticed its wetness coming out of my limbs. Then I gave the rest of it to `Umar bin Al-Khattab رضی اللہ عنہ .\" The persons sitting around him, asked, \"What have you interpreted (about the dream) O Allah's Messenger (ﷺ)?\" He said, \"(It is religious) knowledge.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ میں سویا ہوا تھا کہ میرے پاس دودھ کا ایک پیالہ لایا گیا اور میں نے اس میں سے پیا ‘ یہاں تک کہ میں نے سیرابی کا اثر اپنے اطراف میں نما یاں دیکھا ۔ پھر میں نے ا سکا بچا ہوا حضرت عمر بن خطاب رضی اللہ عنہ کو دیا جو صحابہ وہاں موجود تھے ‘ انہوں نے پوچھا کہ یا رسول اللہ ( صلی اللہ علیہ وسلم ) آپ نے اس کی تعبیر کیا کی ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ علم مراد ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ‘ ان سے یعقوب بن ابراہیم نے بیان کیا ‘ کہا ان سے میرے والد ابراہیم بن سعد نے بیان کیا ‘ ان سے صالح نے ‘ ان سے ابن شہاب نے ‘ ان سے حمزہ بن عبداللہ بن عمر نے بیان کیا اور انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ‘ کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ، فَشَرِبْتُ مِنْهُ، حَتَّى إِنِّي لأَرَى الرِّيَّ يَخْرُجُ مِنْ أَطْرَافِي، فَأَعْطَيْتُ فَضْلِي عُمَرَ بْنَ الْخَطَّابِ ‏\"‏‏.‏ فَقَالَ مَنْ حَوْلَهُ فَمَا أَوَّلْتَ ذَلِكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْعِلْمَ ‏\"‏‏.‏",
                "headingArabic": "إِذَا جَرَى اللَّبَنُ فِي أَطْرَافِهِ أَوْ أَظَافِيرِهِ",
                "headingUrdu": "(اگر کوئی خواب میں دیکھے) کہ اس کے اعضاء یا ناخن میں دودھ بہہ رہا ہے۔",
                "headingEnglish": "(If one sees in a dream) that milk is flowing in his limbs or nails",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6724,
                "hadithNumber": "7008",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"While I was sleeping, some people were displayed before me (in a dream). They were wearing shirts, some of which were merely covering their breasts, and some a bit longer. Then there passed before me, `Umar bin Al-Khattab رضی اللہ عنہ wearing a shirt he was dragging it (on the ground behind him.)\" They (the people) asked, \"What have you interpreted (about the dream) O Allah's Apostle?\" He said, \"The Religion.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میں سویا ہوا تھا کہ میں نے دیکھا کہ لوگ میرے سامنے پیش کئے جا رہے ہیں وہ قمیص پہنے ہوئے ہیں ۔ ان میں بعض کی قمیص تو صرف سینے تک کی ہے اور بعض کی اس سے بڑی ہے اور آنحضرت صلی اللہ علیہ وسلم حضرت عمر بن خطاب رضی اللہ عنہ کے پاس سے گزرے تو ان کی قمیص زمین سے گھسٹ رہی تھی ۔ صحابہ نے پوچھا یا رسول اللہ ! آپ نے اس کی کیا تعبیر کی ؟ آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ دین ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ‘ ان سے یعقوب بن ابراہیم نے بیان کیا ‘ ان سے ان کے والد نے ‘ ان سے صالح نے ‘ ان سے ابن شہاب نے بیان کیا ‘ان سے ابوامامہ بن سہل نے بیان کیا ‘ انہوں نے ابو سعید خدری رضی اللہ عنہ کو بیان کرتے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَبُو أُمَامَةَ بْنُ سَهْلٍ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَيْنَمَا أَنَا نَائِمٌ رَأَيْتُ النَّاسَ يُعْرَضُونَ عَلَىَّ، وَعَلَيْهِمْ قُمُصٌ، مِنْهَا مَا يَبْلُغُ الثَّدْىَ، وَمِنْهَا مَا يَبْلُغُ دُونَ ذَلِكَ، وَمَرَّ عَلَىَّ عُمَرُ بْنُ الْخَطَّابِ وَعَلَيْهِ قَمِيصٌ يَجُرُّهُ ‏\"‏‏.‏ قَالُوا مَا أَوَّلْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الدِّينَ ‏\"‏‏.‏",
                "headingArabic": "الْقَمِيصِ فِي الْمَنَامِ",
                "headingUrdu": "خواب میں ایک قمیض",
                "headingEnglish": "A shirt in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6725,
                "hadithNumber": "7009",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"While I was sleeping, I saw (in a dream) the people being displayed before me, wearing shirts, some of which (were so short that it) reached as far as their breasts and some reached below that. Then `Umar bin Al-Khattab رضی اللہ عنہ was shown to me and he was wearing a shirt which he was dragging (behind him).\" They asked. What have you interpreted (about the dream)? O Allah's Messenger (ﷺ)?\" He said, \"The religion.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ‘ آپ نے فرمایا کہ میں سویا ہوا تھا کہ میں نے لوگوں کو اپنے سامنے پیش ہوتے دیکھا ۔ وہ قمیص پہنے ہوئے تھے‘ان میں بعض کی قمیص تو سینے تک کی تھی اور بعض کی اس سے بڑی تھی اور میرے سامنے حضرت عمر بن خطاب رضی اللہ عنہ پیش کئے گئے تو ان کی قمیص ( زمین سے ) گھسٹ رہی تھی ۔ صحابہ نے پوچھا یا رسول اللہ ! آپ صلی اللہ علیہ وسلم نے اس کی تعبیر کیا کی ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ دین اس کی تعبیر ہے ۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ‘ کہا مجھ سے لیث بن سعد نے بیان کیا ‘ کہا مجھ سے عقیل نے بیان کیا ‘ کہا ان سے ابن شہاب نے ‘ کہا مجھ کو ابوامامہ بن سہل نے خبر دی اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنِي اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُ النَّاسَ عُرِضُوا عَلَىَّ، وَعَلَيْهِمْ قُمُصٌ، فَمِنْهَا مَا يَبْلُغُ الثَّدْىَ، وَمِنْهَا مَا يَبْلُغُ دُونَ ذَلِكَ، وَعُرِضَ عَلَىَّ عُمَرُ بْنُ الْخَطَّابِ وَعَلَيْهِ قَمِيصٌ يَجْتَرُّهُ ‏\"‏‏.‏ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الدِّينَ ‏\"‏‏.‏",
                "headingArabic": "جَرِّ الْقَمِيصِ فِي الْمَنَامِ",
                "headingUrdu": "خواب میں زمین پر گھسیٹنا",
                "headingEnglish": "Dragging on the ground in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6726,
                "hadithNumber": "7010",
                "englishNarrator": "Narrated Qais bin 'Ubada:",
                "hadithEnglish": "I was sitting in a gathering in which there was Sa`d bin Malik and Ibn `Umar رضی اللہ عنہما . `Abdullah bin Salam رضی اللہ عنہ passed in front of them and they said, \"This man is from the people of Paradise.\" I said to `Abdullah bin Salam, \"They said so-and-so.\" He replied, \"Subhan Allah! They ought not to have said things of which they have no knowledge, but I saw (in a dream) that a post was fixed in a green garden. At the top of the post there was a handhold and below it there was a servant. I was asked to climb (the post). So I climbed it till I got hold of the handhold.\" Then I narrated this dream to Allah's Messenger (ﷺ). Allah's Apostle said, \"`Abdullah will die while still holding the firm reliable handhold (i.e., Islam).",
                "hadithUrdu": "میں ایک حلقہ میں بیٹھا تھا جس میں حضرت سعد بن مالک اور حضرت عبداللہ بن عمر رضی اللہ عنہما بیٹھے ہوئے تھے ۔ وہاں سے حضرت عبداللہ بن سلام رضی اللہ عنہ گزرے تو لوگوں نے کہا کہ یہ اہل جنت میں سے ہیں ۔ میں نے ان سے کہا کہ وہ اس طرح کی بات کہہ رہے ہیں ۔ آپ نے فرمایا سبحان اللہ ان کے لیے مناسب نہیں کہ وہ ایسی بات کہیں جس کا انہیں علم نہیں ہے ۔ میں نے خواب میں دیکھا تھا کہ ایک ستون ایک ہرے بھرے باغ میں نصب کیا ہوا ہے اس ستون کے اوپر کے سرے پر ایک حلقہ ( عروہ ) لگا ہوا تھا اور نیچے منصف تھا ۔ منصف سے مراد خادم ہے پھر کہا گیا کہ اس پر چڑھ جاؤ میں چڑھ گیا اور میں نے حلقہ پکڑ لیا ‘ پھر میں نے اس کا تذکرہ رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا کہ عبداللہ کا جب انتقال ہو گیا تو وہ العروۃ الوثقیٰ کو پکڑے ہوئے ہوں گے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد الجعفی نے بیان کیا ‘ انہوں نے کہا ہم سے حرمی بن عمارہ نے بیان کیا ‘انہوں نے کہا ہم سے قرہ بن خالد نے بیان کیا ‘ ان سے محمد بن سیرین نے بیان کیا ‘ ان سے قیس بن عباد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ قَالَ قَيْسُ بْنُ عُبَادٍ كُنْتُ فِي حَلْقَةٍ فِيهَا سَعْدُ بْنُ مَالِكٍ وَابْنُ عُمَرَ فَمَرَّ عَبْدُ اللَّهِ بْنُ سَلاَمٍ فَقَالُوا هَذَا رَجُلٌ مِنْ أَهْلِ الْجَنَّةِ‏.‏ فَقُلْتُ لَهُ إِنَّهُمْ قَالُوا كَذَا وَكَذَا‏.‏ قَالَ سُبْحَانَ اللَّهِ مَا كَانَ يَنْبَغِي لَهُمْ أَنْ يَقُولُوا مَا لَيْسَ لَهُمْ بِهِ عِلْمٌ، إِنَّمَا رَأَيْتُ كَأَنَّمَا عَمُودٌ وُضِعَ فِي رَوْضَةٍ خَضْرَاءَ، فَنُصِبَ فِيهَا وَفِي رَأْسِهَا عُرْوَةٌ وَفِي أَسْفَلِهَا مِنْصَفٌ ـ وَالْمِنْصَفُ الْوَصِيفُ ـ فَقِيلَ ارْقَهْ‏.‏ فَرَقِيتُ حَتَّى أَخَذْتُ بِالْعُرْوَةِ‏.‏ فَقَصَصْتُهَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَمُوتُ عَبْدُ اللَّهِ وَهْوَ آخِذٌ بِالْعُرْوَةِ الْوُثْقَى ‏\"‏‏.‏",
                "headingArabic": "الْخُضَرِ فِي الْمَنَامِ وَالرَّوْضَةِ الْخَضْرَاءِ",
                "headingUrdu": "خواب میں سبز رنگ اور باغ",
                "headingEnglish": "Green colour and a garden in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6727,
                "hadithNumber": "7011",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said (to me), \"You were shown to me twice in (my) dream. Behold, a man was carrying you in a silken piece of cloth and said to me, \"She is your wife, so uncover her,' and behold, it was you. I would then say (to myself), 'If this is from Allah, then it must happen.' \"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ مجھے تم خواب میں دو مرتبہ دکھائی گئیں ۔ ایک شخص تمہیں ریشم کے ایک ٹکڑے میں اٹھائے لیے جا رہا تھا ‘اس نے مجھ سے کہا کہ یہ آپ کی بیوی ہیں ‘ ان کے ( چہرے سے ) پردہ ہٹاؤ ۔ میں نے پردہ اٹھایا کہ وہ تمہیں تھیں ۔ میں نے سوچا کہ اگر یہ خواب اللہ کی طرف سے ہے تو وہ خود ہی انجام تک پہنچائے گا ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ‘ ان سے ابواسامہ نے بیان کیا ‘ ان سے ہشام نے ‘ ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أُرِيتُكِ فِي الْمَنَامِ مَرَّتَيْنِ، إِذَا رَجُلٌ يَحْمِلُكِ فِي سَرَقَةِ حَرِيرٍ فَيَقُولُ هَذِهِ امْرَأَتُكَ‏.‏ فَأَكْشِفُهَا فَإِذَا هِيَ أَنْتِ فَأَقُولُ إِنْ يَكُنْ هَذَا مِنْ عِنْدِ اللَّهِ يُمْضِهِ ‏\"‏‏.‏",
                "headingArabic": "كَشْفِ الْمَرْأَةِ فِي الْمَنَامِ",
                "headingUrdu": "خواب میں عورت کا پردہ ہٹانا",
                "headingEnglish": "Removing the veil of a woman in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6728,
                "hadithNumber": "7012",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said to me, \"You were shown to me twice (in my dream) before I married you. I saw an angel carrying you in a silken piece of cloth, and I said to him, 'Uncover (her),' and behold, it was you. I said (to myself), 'If this is from Allah, then it must happen.' Then you were shown to me, the angel carrying you in a silken piece of cloth, and I said (to him), 'Uncover (her), and behold, it was you. I said (to myself), 'If this is from Allah, then it must happen.' \"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تم سے شادی کرنے سے پہلے مجھے تم دو مرتبہ دیکھائی گئیں ‘ میں نے دیکھا کہ ایک فرشتہ تمہیں ریشم کے ایک ٹکڑے میں اٹھائے ہوئے ہے ۔ میں نے اس سے کہا کہ کھولو اس نے کھولا تو وہ تم تھیں ۔ میں نے کہا کہ اگر یہ اللہ کے پاس سے ہے تو وہ خود ہی اسے انجام تک پہنچائے گا ۔ پھر میں نے تمہیں دیکھا کہ فرشتہ تمہیں ریشم کے ایک ٹکڑے میں اٹھائے ہوئے ہے ۔ میں نے کہا کہ کھولو ! اس نے کھولا تو اس میں تم تھیں ۔ پھر میں نے کہا کہ یہ تو اللہ کی طرف سے ہے جو ضرور پورا ہو گا ۔",
                "urduNarrator": "ہم سے محمد نے بیان کیا ‘ کہا ہم کو ابومعاویہ نے خبر دی ‘ کہا ہم کو ہشام نے خبر دی ‘ انہیں ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، أَخْبَرَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أُرِيتُكِ قَبْلَ أَنْ أَتَزَوَّجَكِ مَرَّتَيْنِ، رَأَيْتُ الْمَلَكَ يَحْمِلُكِ فِي سَرَقَةٍ مِنْ حَرِيرٍ فَقُلْتُ لَهُ اكْشِفْ‏.‏ فَكَشَفَ فَإِذَا هِيَ أَنْتِ، فَقُلْتُ إِنْ يَكُنْ هَذَا مِنْ عِنْدِ اللَّهِ يُمْضِهِ‏.‏ ثُمَّ أُرِيتُكِ يَحْمِلُكِ فِي سَرَقَةٍ مِنْ حَرِيرٍ فَقُلْتُ اكْشِفْ‏.‏ فَكَشَفَ فَإِذَا هِيَ أَنْتِ فَقُلْتُ إِنْ يَكُ هَذَا مِنْ عِنْدِ اللَّهِ يُمْضِهِ ‏\"‏‏.‏",
                "headingArabic": "ثِيَابِ الْحَرِيرِ فِي الْمَنَامِ",
                "headingUrdu": "خواب میں ریشمی لباس دیکھنا",
                "headingEnglish": "The seeing of silken garments in a dream",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6729,
                "hadithNumber": "7013",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"I have been sent with Jawami al-Kalim (i.e., the shortest expression carrying the widest meanings), and I was made victorious with awe (caste into the hearts of the enemy), and while I was sleeping, the keys of the treasures of the earth were brought to me and were put in my hand.\" Muhammad said, Jawami'-al-Kalim means that Allah expresses in one or two statements or thereabouts the numerous matters that used to be written in the books revealed before (the coming of) the Prophet (ﷺ) .",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ‘آپ نے فرمایا کہ میں جوامع الکلم کے ساتھ مبعوث کیا گیا ہوں اور میری مدد رعب کے ذریعہ کی گئی ہے اور میں سویا ہوا تھا کہ زمین کے خزانوں کی کنجیاں میرے پاس لائی گئیں اور میرے ہاتھ میں انہیں رکھ دیا گیا اور محمد نے بیان کیا کہ مجھ تک یہ بات پہنچی ہے کہ ” جوامع الکلم “ سے مراد یہ ہے کہ بہت سے امور جو آنحضرت صلی اللہ علیہ وسلم سے پہلے کتابوں میں لکھے ہوئے تھے ‘ ان کو اللہ تعالیٰ نے ایک یا دو امور یا اسی جیسے میں جمع کر دیا ہے ۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ‘ انہوں نے کہا ہم سے لیث نے بیان کیا ‘ ان سے عقیل نے بیان کیا ‘ ان سے ابن شہاب نے بیان کیا ‘ انہیں سعید بن مسیب نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ بُعِثْتُ بِجَوَامِعِ الْكَلِمِ، وَنُصِرْتُ بِالرُّعْبِ، وَبَيْنَا أَنَا نَائِمٌ أُتِيتُ بِمَفَاتِيحِ خَزَائِنِ الأَرْضِ، فَوُضِعَتْ فِي يَدِي ‏\"‏‏.‏ قَالَ مُحَمَّدٌ وَبَلَغَنِي أَنَّ جَوَامِعَ الْكَلِمِ أَنَّ اللَّهَ يَجْمَعُ الأُمُورَ الْكَثِيرَةَ الَّتِي كَانَتْ تُكْتَبُ فِي الْكُتُبِ قَبْلَهُ فِي الأَمْرِ الْوَاحِدِ وَالأَمْرَيْنِ‏.‏ أَوْ نَحْوَ ذَلِكَ‏.‏",
                "headingArabic": "الْمَفَاتِيحِ فِي الْيَدِ",
                "headingUrdu": "کسی کے ہاتھ میں چابیاں دیکھنا",
                "headingEnglish": "The seeing of keys in one’s hand",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6730,
                "hadithNumber": "7014",
                "englishNarrator": "Narrated `Abdullah bin Salam رضی اللہ عنہ :",
                "hadithEnglish": "(In a dream) I saw myself in a garden, and there was a pillar in the middle of the garden, and there was a handhold at the top of the pillar. I was asked to climb it. I said, \"I cannot.\" Then a servant came and lifted up my clothes and I climbed (the pillar), and then got hold of the handhold, and I woke up while still holding it. I narrated that to the Prophet (ﷺ) who said, \"The garden symbolizes the garden of Islam, and the handhold is the firm Islamic handhold which indicates that you will be adhering firmly to Islam until you die.\"",
                "hadithUrdu": "میں نے ( خواب ) دیکھا کہ گویا میں ایک باغ میں ہوں اور باغ کے بیچ میں ایک ستون ہے جس کے اوپر کے سرے پر ایک حلقہ ہے ۔ کہا گیا کہ اس پر چڑھ جاؤ ۔ میں نے کہا کہ میں اس کی طاقت نہیں رکھتا ۔ پھر میرے پاس خادم آیا اور اس نے میرے کپڑے چڑھا دئیے پھر میں اوپر چڑھ گیا اور میں نے حلقہ پکڑ لیا ‘ ابھی میں اسے پکڑے ہی ہوئے تھا کہ آنکھ کھل گئی ۔ پھر میں نے اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا کہ وہ باغ اسلام کا باغ تھا اور وہ ستون اسلام کا ستون تھا اور وہ حلقہ عروۃ الوثقیٰ تھا ۔ تم ہمیشہ اسلام پر مضبوطی سے جمے رہو گے یہاں تک کہ تمہاری وفات ہو جائے گی ۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد نے بیان کیا ‘ کہا ہم سے ازہر نے بیان کیا ‘ کہا ہم سے ابن عون نے ( دوسری سند ) حضرت امام بخاری نے کہا کہ اور مجھ سے خلیفہ نے بیان کیا ‘ ان سے معاذ نے بیان کیا ‘ ان سے ابن عون نے بیان کیا ‘ ان سے محمد نے ‘ ان سے قیس بن عباد نے بیان کیا اور ان سے حضرت عبداللہ بن سلام رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَزْهَرُ، عَنِ ابْنِ عَوْنٍ، ح وَحَدَّثَنِي خَلِيفَةُ، حَدَّثَنَا مُعَاذٌ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، حَدَّثَنَا قَيْسُ بْنُ عُبَادٍ، عَنْ عَبْدِ اللَّهِ بْنِ سَلاَمٍ، قَالَ رَأَيْتُ كَأَنِّي فِي رَوْضَةٍ، وَسَطَ الرَّوْضَةِ عَمُودٌ فِي أَعْلَى الْعَمُودِ عُرْوَةٌ، فَقِيلَ لِي ارْقَهْ‏.‏ قُلْتُ لاَ أَسْتَطِيعُ‏.‏ فَأَتَانِي وَصِيفٌ فَرَفَعَ ثِيَابِي فَرَقِيتُ، فَاسْتَمْسَكْتُ بِالْعُرْوَةِ، فَانْتَبَهْتُ وَأَنَا مُسْتَمْسِكٌ بِهَا، فَقَصَصْتُهَا عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ تِلْكَ الرَّوْضَةُ رَوْضَةُ الإِسْلاَمِ، وَذَلِكَ الْعَمُودُ عَمُودُ الإِسْلاَمِ، وَتِلْكَ الْعُرْوَةُ عُرْوَةُ الْوُثْقَى، لاَ تَزَالُ مُسْتَمْسِكًا بِالإِسْلاَمِ حَتَّى تَمُوتَ ‏\"‏‏.‏",
                "headingArabic": "التَّعْلِيقِ بِالْعُرْوَةِ وَالْحَلْقَةِ",
                "headingUrdu": "پکڑنا یا ہینڈ ہولڈ یا انگوٹھی لینا",
                "headingEnglish": "Taking hold or handhold or a ring",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 6701,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=268",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=266",
                "label": "266",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=267",
                "label": "267",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=268",
                "label": "268",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=269",
                "label": "269",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=270",
                "label": "270",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=271",
                "label": "271",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=272",
                "label": "272",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=270",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=270",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=268",
        "to": 6725,
        "total": 40465
    }
}