{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 284,
        "data": [
            {
                "id": 7081,
                "hadithNumber": "7387, 7388",
                "englishNarrator": "Narrated `Abdullah bin `Amr رضی اللہ عنہما :",
                "hadithEnglish": "Abu Bakr As-Siddiq رضی اللہ عنہ said to the Prophet (ﷺ) \"O Allah's Messenger (ﷺ)! Teach me an invocation with which I may invoke Allah in my prayers.\" The Prophet (ﷺ) said, \"Say: O Allah! I have wronged my soul very much (oppressed myself), and none forgives the sins but You; so please bestow Your Forgiveness upon me. No doubt, You are the Oft-Forgiving, Most Merciful.\"",
                "hadithUrdu": "ابوبکر صدیق رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے کہا یا رسول اللہ ! مجھے ایسی دعا سکھائیے جو میں اپنی نماز میں کیا کروں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ پڑھا کرو ” اے اللہ ! میں نے اپنی جان پر بہت ظلم کیا اور تیرے سوا گناہوں کو اور کوئی نہیں بخشتا ۔ پس میرے گناہ اپنے پاس سے بخش دے ۔ بلاشبہ تو بڑا مغفرت کرنے والا ‘ بڑا رحم کرنے والا ہے ۔ “",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا ‘ انہوں نے کہا مجھ سے ابن وہب نے بیان کیا ‘ انہوں نے کہا مجھ کو عمرو نے خبر دی ‘ انہیں یزید نے ‘ انہیں ابو الخیر نے ‘ انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، حَدَّثَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ يَزِيدَ، عَنْ أَبِي الْخَيْرِ، سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرٍو، أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ ـ رضى الله عنه ـ قَالَ لِلنَّبِيِّ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ عَلِّمْنِي دُعَاءً أَدْعُو بِهِ فِي صَلاَتِي‏.‏ قَالَ ‏ \"‏ قُلِ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ، فَاغْفِرْ لِي مِنْ عِنْدِكَ مَغْفِرَةً، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7082,
                "hadithNumber": "7389",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Gabriel called me and said, 'Allah has heard the statement of your people and what they replied to you.'\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جبرائیل علیہ السلام نے مجھے پکار کر کہا کہ اللہ نے آپ کی قوم کی بات سن لی اور وہ بھی سن لیا جو انہوں نے آپ کو جواب دیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ انہوں نے کہا ہم کو ابن وہب نے خبر دی ‘ انہوں نے کہا مجھ کو یونس نے خبر دی ‘ انہیں ابن شہاب نے ‘ ان سے عروہ نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُرْوَةُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ حَدَّثَتْهُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ جِبْرِيلَ عَلَيْهِ السَّلاَمُ نَادَانِي قَالَ إِنَّ اللَّهَ قَدْ سَمِعَ قَوْلَ قَوْمِكَ وَمَا رَدُّوا عَلَيْكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7083,
                "hadithNumber": "7390",
                "englishNarrator": "Narrated Jabir bin `Abdullah As-Salami رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to teach his companions to perform the prayer of Istikhara for each and every matter just as he used to teach them the Suras from the Qur'an He used to say, \"If anyone of you intends to do some thing, he should offer a two rak`at prayer other than the compulsory prayers, and after finishing it, he should say: O Allah! I consult You, for You have all knowledge, and appeal to You to support me with Your Power and ask for Your Bounty, for You are able to do things while I am not, and You know while I do not; and You are the Knower of the Unseen. O Allah If You know It this matter (name your matter) is good for me both at present and in the future, (or in my religion), in my this life and in the Hereafter, then fulfill it for me and make it easy for me, and then bestow Your Blessings on me in that matter. O Allah! If You know that this matter is not good for me in my religion, in my this life and in my coming Hereafter (or at present or in the future), then divert me from it and choose for me what is good wherever it may be, and make me be pleased with it.\" (See Hadith No. 391, Vol. 8)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنے صحابہ کو ہر مباح کام میں استخارہ کرنا سکھاتے تھے جس طرح آپ قرآن کی سورت سکھاتے تھے ۔ آپ فرماتے کہ جب تم میں سے کوئی کسی کام کا مقصد کرے تو اسے چاہئے کہ فرض کے سوا دو رکعت نفل نماز پڑھے ‘ پھر سلام کے بعد یہ دعا کرے ” اے اللہ ! میں تیرے علم کے طفیل ا سکام میں خیریت طلب کرتا ہوں اور تیری قدرت کے طفیل طاقت مانگتا ہوں اور تیرا فضل ۔ کیونکہ تجھے قدرت ہے اور مجھے نہیں ‘ تو جانتا ہے اور میں نہیں جانتا اور تو غیوب کا بہت جاننے والا ہے ۔ اے اللہ ! پس اگر تو یہ بات جانتا ہے ( اس وقت استخارہ کرنے والے کو اس کام کا نام لینا چاہئیے ) کہ اس کام میں میرے لیے دنیا وآخرت میں بھلائی ہے یا اس طرح فرمایا کہ ” میرے دین میں اور گزران میں اور میرے ہر انجام کے اعتبار سے بھلائی ہے تو اس پر مجھے قادر بنا دے اور میرے لیے اسے آسان کر دے ‘ پھر اس میں میرے لیے برکت عطا فرما ۔ اے اللہ ! اور اگر تو جانتا ہے کہ یہ کام میرے لئے برا ہے ۔ میرے دین اور گزراہ کے اعتبار سے اور میرے انجام کے اعتبار سے ‘ یا فرمایا کہ میری دنیا ودین کے اعتبار سے تو مجھے اس کام سے دور کر دے اور میرے لیے بھلائی مقدر کر دے جہاں بھی وہ ہو اور پھر مجھے اس پر راضی اور خوش رکھ ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ‘ کہا ہم سے معن بن عیسیٰ نے بیان کیا ‘ کہا مجھ سے عبدالرحمٰن بن ابی الموالی نے بیان کیا ‘ کہا کہ میں نے محمد بن المنکدر سے سنا ‘ وہ عبداللہ بن حسن بن حسن بن علی رضی اللہ عنہ سے بیان کرتے تھے ‘ انہوں نے کہا کہ مجھے جابر بن عبداللہ سلمیٰ رضی اللہ عنہ نے خبر دی ‘ انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا مَعْنُ بْنُ عِيسَى، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِي، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ الْمُنْكَدِرِ، يُحَدِّثُ عَبْدَ اللَّهِ بْنَ الْحَسَنِ يَقُولُ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ السَّلَمِيُّ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعَلِّمُ أَصْحَابَهُ الاِسْتِخَارَةَ فِي الأُمُورِ كُلِّهَا، كَمَا يُعَلِّمُ السُّورَةَ مِنَ الْقُرْآنِ يَقُولُ ‏ \"‏ إِذَا هَمَّ أَحَدُكُمْ بِالأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ مِنْ غَيْرِ الْفَرِيضَةِ ثُمَّ لِيَقُلِ اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ، فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ، وَتَعْلَمُ وَلاَ أَعْلَمُ، وَأَنْتَ عَلاَّمُ الْغُيُوبِ، اللَّهُمَّ فَإِنْ كُنْتَ تَعْلَمُ هَذَا الأَمْرَ ـ ثُمَّ تُسَمِّيهِ بِعَيْنِهِ ـ خَيْرًا لِي فِي عَاجِلِ أَمْرِي وَآجِلِهِ ـ قَالَ أَوْ فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي ـ فَاقْدُرْهُ لِي، وَيَسِّرْهُ لِي، ثُمَّ بَارِكْ لِي فِيهِ، اللَّهُمَّ وَإِنْ كُنْتَ تَعْلَمُ أَنَّهُ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي ـ أَوْ قَالَ فِي عَاجِلِ أَمْرِي وَآجِلِهِ ـ فَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ رَضِّنِي بِهِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏قُلْ هُوَ الْقَادِرُ‏}‏",
                "headingUrdu": "’’کہہ دو کہ وہ (اوپر سے تم پر عذاب بھیجنے) پر قادر ہے۔‘‘",
                "headingEnglish": "“Say: He has power to (send torment on you from above)…”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7084,
                "hadithNumber": "7391",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) frequently used to swear, \"No, by the One Who turns the hearts.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم قسم اس طرح کھاتے ” قسم اس کی جو دلوں کا پھیردینے والا ہے ۔ “",
                "urduNarrator": "مجھ سے سعید بن سلیمان نے بیان کیا ‘ ان سے عبداللہ ابن مبارک نے بیان کیا ‘ ان سے موسیٰ بن عقبہ نے ‘ ان سے سالم بن عبداللہ بن عمر نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي سَعِيدُ بْنُ سُلَيْمَانَ، عَنِ ابْنِ الْمُبَارَكِ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللَّهِ، قَالَ أَكْثَرُ مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَحْلِفُ ‏ \"‏ لاَ وَمُقَلِّبِ الْقُلُوبِ ‏\"‏‏.‏",
                "headingArabic": "مُقَلِّبِ الْقُلُوبِ وَقَوْلِ اللَّهِ تَعَالَى: {وَنُقَلِّبُ أَفْئِدَتَهُمْ وَأَبْصَارَهُمْ}",
                "headingUrdu": "دلوں کو پھیرنے والا",
                "headingEnglish": "The One Who turns the hearts",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7085,
                "hadithNumber": "7392",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Allah has ninety-nine Names, one-hundred less one; and he who memorized them all by heart will enter Paradise.\" To count something means to know it by heart.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ اللہ تعالیٰ کے ننانوے نام ہیں ۔ جو انہیں یاد کر لے گا وہ جنت میں جائے گا ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ انہوں نے کہا ہم کو شعیب نے خبر دی ‘ کہا ہم سے ابوالزناد نے بیان کیا ‘ ان سے اعرج نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ لِلَّهِ تِسْعَةً وَتِسْعِينَ اسْمًا مِائَةً إِلاَّ وَاحِدًا، مَنْ أَحْصَاهَا دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ ‏{‏أَحْصَيْنَاهُ‏}‏ حَفِظْنَاهُ‏.‏",
                "headingArabic": "إِنَّ لِلَّهِ مِائَةَ اسْمٍ إِلاَّ وَاحِدًا",
                "headingUrdu": "اللہ کے ایک سے کم سو نام ہیں۔",
                "headingEnglish": "Allah has one hundred Names less One",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7086,
                "hadithNumber": "7393",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"When anyone of you goes to bed, he should dust it off thrice with the edge of his garment, and say: O Lord in Your name, I place my side and raise it up. If you capture my soul, pardon it; and if you release it, proptect it as You guard Your upright bondsmen. Hadrat Abu Hurairah رضی اللہ عنہ has reported it from the prophet ﷺ with some addition. Zuhair, Abu Damrah and Ismail bin Zakariyya, Obaidullah, Saeed his father, Hadrat Abu Hurairah رضی اللہ عنہ reported from the prophet ﷺ. Hadrat Abu Hurairah has reported it from the prophet ﷺ.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص اپنے بستر پر جائے تو اسے چاہئے کہ اسے اپنے کپڑے کے کنارے سے تین مرتبہ صاف کر لے اور یہ دعا پڑھے ” اے میرے رب ! تیرا نام لے کر میں اپنی کروٹ رکھتا ہوں اور تیرے نام ہی کے ساتھ اسے اٹھاؤں گا ۔ اگر تو نے میری جان کو باقی رکھا تو اسے معاف کرنا اور اگر اسے ( اپنی طرف سوتے ہی میں ) اٹھا لیا تو اس کی حفاظت اس طرح کرنا جس طرح تو اپنے نیکوکار بندوں کی حفاظت کرتا ہے ۔ “ اس روایت کی متابعت یحییٰ اور بشر بن الفضل نے عبیداللہ سے کی ہے ۔ ان سے سعید نے اور ان سے ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے اور زہیر ‘ ابو ضمرہ اور اسماعیل بن زکریا نے عبیداللہ سے یہ اضافہ کیا کہ ان سے سعید نے ‘ ان سے ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا اور اس کی روایت ابن عجلان نے کی ‘ ان سے سعید نے ‘ ان سے ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ۔  اس کی متابعت محمد بن عبدالرحمٰن الداوردی اور اسامہ بن حفص نے کی ۔",
                "urduNarrator": "ہم سے عبد العزیز بن عبداللہ بن بیان کیا ‘ کہا مجھ سے امام مالک نے بیان کیا ‘ ان سے سعید ابن ابی سعیدمقبری نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنِي مَالِكٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا جَاءَ أَحَدُكُمْ فِرَاشَهُ فَلْيَنْفُضْهُ بِصَنِفَةِ ثَوْبِهِ ثَلاَثَ مَرَّاتٍ، وَلْيَقُلْ بِاسْمِكَ رَبِّ وَضَعْتُ جَنْبِي وَبِكَ أَرْفَعُهُ، إِنْ أَمْسَكْتَ نَفْسِي فَاغْفِرْ لَهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ ‏\"‏‏.‏ تَابَعَهُ يَحْيَى وَبِشْرُ بْنُ الْمُفَضَّلِ عَنْ عُبَيْدِ اللَّهِ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَزَادَ زُهَيْرٌ وَأَبُو ضَمْرَةَ وَإِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ عَنْ عُبَيْدِ اللَّهِ عَنْ سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَرَوَاهُ ابْنُ عَجْلاَنَ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "السُّؤَالِ بِأَسْمَاءِ اللَّهِ تَعَالَى، وَالاِسْتِعَاذَةِ بِهَا",
                "headingUrdu": "اللہ سے اس کے نام مانگنا اور ان سے پناہ مانگنا",
                "headingEnglish": "Asking Allah with His Names and seeking refuge with them",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7087,
                "hadithNumber": "7394",
                "englishNarrator": "Narrated Hudhaifah رضی اللہ عنہ :",
                "hadithEnglish": "When the Prophet (ﷺ) went to bed, he used to say, O Allah! In your name, In Your name, I die and live; and on awaking, he would say: All praise is due to Allah Who has resurrected us after causing us to die and to Him We will return.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب اپنے بستر پر لیٹنے جاتے تو یہ دعا کرتے ” اے اللہ ! تیرے نام کے ساتھ زندہ ہوں اور اسی کے ساتھ مروں گا “ اور جب صبح ہوتی تو یہ دعا کرتے ” تمام تعریف اس اللہ کے لیے ہے جس نے اس کے بعد زندہ کیا کہ ہم مر چکے تھے اور اسی کی طرف اٹھ کر جانا ہے ۔ “",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ’ ان سے عبدالملک بن عمیر نے ‘ ان سے ربعی بن حراش نے اور ان سے حذیفہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ، عَنْ رِبْعِيٍّ، عَنْ حُذَيْفَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَوَى إِلَى فِرَاشِهِ قَالَ ‏\"‏ اللَّهُمَّ بِاسْمِكَ أَحْيَا وَأَمُوتُ ‏\"‏‏.‏ وَإِذَا أَصْبَحَ قَالَ ‏\"‏ الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7088,
                "hadithNumber": "7395",
                "englishNarrator": "Narrated Abu Dharr رضی اللہ عنہ :",
                "hadithEnglish": "When the Prophet (ﷺ) went to bed at night, he used to say: In your name, I live and die, and on awaking, he ﷺ would say: All praise is due to Allah Who has resurrected us after causing us to die and to Him we have to return.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب رات میں لیٹنے جاتے تو کہتے ” ہم تیرے ہی نام سے مریں گے اور اسی سے زندہ ہوں گے “ اور جب بیدار ہوتے تو کہتے ” تمام تعریف اس اللہ کے لیے ہے جس نے ہمیں مارنے کے بعد زندہ کیا اور اسی کی طرف جانا ہے ۔ “",
                "urduNarrator": "ہم سے سعد بن حفص نے بیان کیا ‘کہا ہم سے شیبان نے بیان کیا ‘ ان سے منصور نے ‘ ان سے ربعی بن حراش نے ‘ ان سے خرشہ بن الحر نے اور ان سے ابوذر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ خَرَشَةَ بْنِ الْحُرِّ، عَنْ أَبِي ذَرٍّ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَخَذَ مَضْجَعَهُ مِنَ اللَّيْلِ قَالَ ‏ \"‏ بِاسْمِكَ نَمُوتُ وَنَحْيَا، فَإِذَا اسْتَيْقَظَ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7089,
                "hadithNumber": "7396",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, When anyone of you intends to approach his wife, he should invoke: In the name of Allah, O Allah! keep us secured from the Satan and keep him secured from the Satan what you will bestow on us. If any baby has been destined for them thereby, the Satan will never be able to harm them.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ جب تم میں سے کوئی اپنی بیوی کے پاس جانے کا ارادہ کرے اور یہ دعا پڑھ لے ” شروع اللہ کے نام سے ‘ اے اللہ ! ہمیں شیطان سے دور رکھنا اور تو جو ہمیں بچہ عطا کرے اسے بھی شیطان سے دور رکھنا “ تو اگر اسی صحبت میں ان دونوں سے کوئی بچہ نصیب ہوا تو شیطان اسے کبھی نقصان نہیں پہنچا سکے گا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے جریر نے بیان کیا ‘ ان سے منصور نے ‘ ان سے سالم نے ‘ ان سے کریب نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ أَنَّ أَحَدَكُمْ إِذَا أَرَادَ أَنْ يَأْتِيَ أَهْلَهُ فَقَالَ بِاسْمِ اللَّهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا‏.‏ فَإِنَّهُ إِنْ يُقَدَّرْ بَيْنَهُمَا وَلَدٌ فِي ذَلِكَ لَمْ يَضُرُّهُ شَيْطَانٌ أَبَدًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7090,
                "hadithNumber": "7397",
                "englishNarrator": "Narrated `Adi bin Hatim رضی اللہ عنہ :",
                "hadithEnglish": "I asked the Prophet, \"I send off (for a game) my trained hunting dogs; (what is your verdict concerning the game they hunt?\" He said, \"If you send off your trained hunting dogs and mention the Name of Allah, then, if they catch some game, eat (thereof). And if you hit the game with a mi'rad (a hunting tool) and it wounds it, you can eat (it).",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ میں اپنے سدھائے ہوئے کتے کو شکار کے لیے چھوڑ تا ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جب تم سدھائے ہوئے کتے چھوڑو اور ان کے ساتھ اللہ کا نام بھی لے لو ‘ پھر وہ کوئی شکار پکڑیں اور اسے کھائیں نہیں تو تم اسے کھا سکتے ہو اور جب شکار پر بن پھال کے تیر یعنی لکڑی سے کوئی شکار مارے لیکن وہ نوک سے لگ کر جانور کا گوشت چیر دے تو ایسا شکار بھی کھاؤ ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ‘ کہا ہم سے فضیل نے بیان کیا ‘ ان سے منصور نے ‘ ان سے ابراہیم نے ‘ ان سے ہمام نے ‘ ان سے عدی بن حاتم رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا فُضَيْلٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم قُلْتُ أُرْسِلُ كِلاَبِي الْمُعَلَّمَةَ‏.‏ قَالَ ‏ \"‏ إِذَا أَرْسَلْتَ كِلاَبَكَ الْمُعَلَّمَةَ وَذَكَرْتَ اسْمَ اللَّهِ فَأَمْسَكْنَ فَكُلْ، وَإِذَا رَمَيْتَ بِالْمِعْرَاضِ فَخَزَقَ فَكُلْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7091,
                "hadithNumber": "7398",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The people said to the Prophet (ﷺ) , \"O Allah's Messenger (ﷺ)! Here are people who have recently embraced Islam and they bring meat, and we do not know whether they had mentioned Allah's Name while slaughtering the animals or not.\" The Prophet (ﷺ) said, \"You should mention Allah's Name and eat.\"",
                "hadithUrdu": "لوگوں نے کہا یا رسول اللہ ! وہاں کے قبیلے ابھی حال ہی میں اسلام لائے اور وہ ہمیں گوشت لا کر دیتے ہیں ۔ ہمیں یقین نہیں ہوتا کہ ذبح کرتے وقت انہوں نے اللہ کا نام بھی لیا تھا یا نہیں ( تو کیا ہم اسے کھا سکتے ہیں ؟ ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم اس پر اللہ کا نام لے کر اسے کھا لیا کرو ۔ اس روایت کی متابعت محمد بن عبدالرحمٰن دراور دی اور اسامہ بن حفص نے کی ۔",
                "urduNarrator": "ہم سے یوسف بن موسیٰ نے بیان کیا ‘ انہوں نے کہا ہم سے ابوخالد احمر نے بیان کیا ‘ انہوں نے کہا کہ میں نے ہشام بن عروہ سنا ‘ وہ اپنے والد ( عروہ بن زبیر ) سے بیان کرتے تھے کہ ان سے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، قَالَ سَمِعْتُ هِشَامَ بْنَ عُرْوَةَ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَالُوا يَا رَسُولَ اللَّهِ إِنَّ هُنَا أَقْوَامًا حَدِيثًا عَهْدُهُمْ بِشِرْكٍ، يَأْتُونَا بِلُحْمَانٍ لاَ نَدْرِي يَذْكُرُونَ اسْمَ اللَّهِ عَلَيْهَا أَمْ لاَ‏.‏ قَالَ ‏ \"‏ اذْكُرُوا أَنْتُمُ اسْمَ اللَّهِ وَكُلُوا ‏\"‏‏.‏ تَابَعَهُ مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ وَالدَّرَاوَرْدِيُّ وَأُسَامَةُ بْنُ حَفْصٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7092,
                "hadithNumber": "7399",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) slaughtered two rams as sacrifice and mentioned Allah's Name and said, \"Allahu-Akbar\" while slaughtering).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے دو مینڈھوں کی قربانی کی اور ذبح کرتے وقت بسم اللہ اللہ اکبر پڑھا ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ‘ کہا ہم سے ہشام نے بیان کیا ‘ ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ ضَحَّى النَّبِيُّ صلى الله عليه وسلم بِكَبْشَيْنِ، يُسَمِّي وَيُكَبِّرُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7093,
                "hadithNumber": "7400",
                "englishNarrator": "Narrated Jundab رضی اللہ عنہ :",
                "hadithEnglish": "He witnessed the Prophet (ﷺ) on the Day of Nahr. The Prophet (ﷺ) offered prayer and then delivered a sermon saying, \"Whoever slaughtered his sacrifice before offering prayer, should slaughter another animal in place of the first; and whoever has not yet slaughtered any, should slaughter a sacrifice and mention Allah's Name while doing so.\"",
                "hadithUrdu": "وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ ذی الحجہ کی دسویں تاریخ کو موجود تھے آپ نے نماز پڑھائی پھر خطبہ دیا اور فرمایا جس نے نماز سے پہلے جانور ذبح کر لیا تو اس کی جگہ دوسرا جانور ذبح کرے اور جس نے ذبح ابھی نہ کیا ہو تو وہ اللہ کا نام لے کر ذبح کرے ۔",
                "urduNarrator": "ہم سے حفص بن عمر حوضی نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے اسود بن قیس نے اور ان سے جندب رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، عَنْ جُنْدَبٍ، أَنَّهُ شَهِدَ النَّبِيَّ صلى الله عليه وسلم يَوْمَ النَّحْرِ صَلَّى ثُمَّ خَطَبَ فَقَالَ ‏ \"‏ مَنْ ذَبَحَ قَبْلَ أَنْ يُصَلِّيَ فَلْيَذْبَحْ مَكَانَهَا أُخْرَى، وَمَنْ لَمْ يَذْبَحْ فَلْيَذْبَحْ بِاسْمِ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7094,
                "hadithNumber": "7401",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Do not swear by your fathers; and whoever wants to swear should swear by Allah.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ اپنے باب دادوں کی قسم نہ کھایا کرو ۔ اگر کسی کو قسم کھانی ہی ہو تو اللہ کے نام کی قسم کھائے ورنہ خاموش رہے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ‘ انہوں نے کہا ہم سے ورقاء نے بیان کیا ‘ ان سے عبداللہ بن دینار نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا وَرْقَاءُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تَحْلِفُوا بِآبَائِكُمْ، وَمَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللَّهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7095,
                "hadithNumber": "7402",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent ten persons to bring the enemy's secrets and Khubaib Al-Ansari رضی اللہ عنہ was one of them. 'Ubaidullah bin 'Iyad told me that the daughter of Al-Harith told him that when they gathered (to kill Khubaib Al Ansari رضی اللہ عنہ ) he asked for a razor to clean his pubic region, and when they had taken him outside the sanctuary of Mecca in order to kill him, he said in verse, \"I don't care if I am killed as a Muslim, on any side (of my body) I may be killed in Allah's Cause; for that is for the sake of Allah's very Self; and if He will, He will bestow His Blessings upon the torn pieces of my body.\" Then Ibn Al-Harith killed him, and the Prophet (ﷺ) informed his companions of the death of those (ten men) on the very day they were killed.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے عضل اور قارہ والوں کی درخواست پر ورس اکابر صحابہ کو جن میں خبیب رضی اللہ عنہ بھی تھے ‘ان کے ہاں بھیجا ۔ ابن شہاب نے کہا کہ مجھے عبیداللہ بن عیاض نے خبر دی کہ حارث کی صاحبزادی زینب نے انہیں بتایا کہ جب لوگ خبیب رضی اللہ عنہ کو قتل کرنے کے لیے آمادہ ہوئے ( اور قید میں تھے ) تو اسی زمانے میں انہوں نے ان سے صفائی کرنے کے لیے استرہ لیا تھا ‘ جب وہ لوگ خبیب رضی اللہ عنہ کو حرم سے باہر قتل کرنے لے گئے تو انہوں نے یہ اشعار کہے ۔  ” اور جب میں مسلمان ہونے کی حالت میں قتل کیا جا رہا ہوں تو مجھے اس کی پروا نہیں کہ مجھے کس پہلو پر قتل کیا جائے گا اور میرا یہ مرنا اللہ کے لیے ہے اور اگر وہ چاہے گا تو میرے ٹکڑے ٹکڑے کئے ہوئے اعضاء پر برکت نازل کرے گا ۔ “ پھر ابن الحارث نے انہیں قتل کر دیا اور نبی کریم صلی اللہ علیہ وسلم نے اپنے صحابہ کو اس حادثہ کی اطلاع اسی دن دی جس دن یہ حضرات شہید کئے گئے تھے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ‘ انہیں زہری نے ‘ انہیں عمرو بن ابی سفیان بن اسید بن جاریہ ثقفی نے خبر دی جو بنی زہرہ کے حلیف تھے اور ابوہریرہ رضی اللہ عنہ کے شاگردوں میں تھے کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عَمْرُو بْنُ أَبِي سُفْيَانَ بْنِ أَسِيدِ بْنِ جَارِيَةَ الثَّقَفِيُّ ـ حَلِيفٌ لِبَنِي زُهْرَةَ وَكَانَ مِنْ أَصْحَابِ أَبِي هُرَيْرَةَ ـ أَنَّ أَبَا هُرَيْرَةَ قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَشْرَةً مِنْهُمْ خُبَيْبٌ الأَنْصَارِيُّ، فَأَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عِيَاضٍ أَنَّ ابْنَةَ الْحَارِثِ أَخْبَرَتْهُ أَنَّهُمْ حِينَ اجْتَمَعُوا اسْتَعَارَ مِنْهَا مُوسَى يَسْتَحِدُّ بِهَا، فَلَمَّا خَرَجُوا مِنَ الْحَرَمِ لِيَقْتُلُوهُ قَالَ خُبَيْبٌ الأَنْصَارِيُّ وَلَسْتُ أُبَالِي حِينَ أُقْتَلُ مُسْلِمًا ** عَلَى أَيِّ شِقٍّ كَانَ لِلَّهِ مَصْرَعِي وَذَلِكَ فِي ذَاتِ الإِلَهِ وَإِنْ يَشَأْ ** يُبَارِكْ عَلَى أَوْصَالِ شِلْوٍ مُمَزَّعِ فَقَتَلَهُ ابْنُ الْحَارِثِ فَأَخْبَرَ النَّبِيُّ صلى الله عليه وسلم أَصْحَابَهُ خَبَرَهُمْ يَوْمَ أُصِيبُوا‏.‏",
                "headingArabic": "مَا يُذْكَرُ فِي الذَّاتِ وَالنُّعُوتِ وَأَسَامِي اللَّهِ",
                "headingUrdu": "عادات، اس کی صفات اور اس کے نام",
                "headingEnglish": "Adh-Dhat, His Qualities and His Names",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7096,
                "hadithNumber": "7403",
                "englishNarrator": "Narrated `Abdullah:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"There is none having a greater sense of Ghira than Allah, and for that reason He has forbidden shameful deeds and sins (illegal sexual intercourse etc.) And there is none who likes to be praised more than Allah does.\" (See Hadith No. 147, Vol. 7)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ کوئی بھی اللہ سے زیادہ غیرت مند نہیں اور اسی لیے اس نے فواحش کو حرام قرار دیا ہے اور اللہ سے زیادہ کوئی تعریف پسند کرنے والا نہیں ۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ‘ انہوں نے کہا مجھ سے میرے والد نے بیان کیا ‘ انہوں نے کہا ہم سے اعمش نے بیان کیا ‘ ان سے شقیق نے اور ان سے عبداللہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا مِنْ أَحَدٍ أَغْيَرُ مِنَ اللَّهِ، مِنْ أَجْلِ ذَلِكَ حَرَّمَ الْفَوَاحِشَ، وَمَا أَحَدٌ أَحَبَّ إِلَيْهِ الْمَدْحُ مِنَ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى {‏وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ‏}‏",
                "headingUrdu": "’’اور اللہ تمہیں اپنے خلاف خبردار کرتا ہے‘‘۔",
                "headingEnglish": "“…And Allah warns you against Himself…”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7097,
                "hadithNumber": "7404",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"When Allah created the Creation, He wrote in His Book--and He wrote (that) about Himself, and it is placed with Him on the Throne--'Verily My Mercy overcomes My Anger.'\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب اللہ تعالیٰ نے مخلوق کو پیدا کیا تو اپنی کتاب میں اسے لکھا ‘ اس نے اپنی ذات کے متعلق بھی لکھا اور یہ اب بھی عرش پر لکھا ہوا موجود ہے کہ ” میری رحمت میرے غضب پر غالب ہے “",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ‘ ان سے ابوحمزہ نے بیان کیا ‘ ان سے اعمش نے ‘ ان سے صالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَمَّا خَلَقَ اللَّهُ الْخَلْقَ كَتَبَ فِي كِتَابِهِ ـ هُوَ يَكْتُبُ عَلَى نَفْسِهِ، وَهْوَ وَضْعٌ عِنْدَهُ عَلَى الْعَرْشِ ـ إِنَّ رَحْمَتِي تَغْلِبُ غَضَبِي ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7098,
                "hadithNumber": "7405",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah says: 'I am just as My slave thinks I am, (i.e. I am able to do for him what he thinks I can do for him) and I am with him if He remembers Me. If he remembers Me in himself, I too, remember him in Myself; and if he remembers Me in a group of people, I remember him in a group that is better than they; and if he comes one span nearer to Me, I go one cubit nearer to him; and if he comes one cubit nearer to Me, I go a distance of two outstretched arms nearer to him; and if he comes to Me walking, I go to him running.' \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ فرماتا ہے کہ میں اپنے بندے کے گمان کے ساتھ ہوں اور جب وہ مجھے اپنے دل میں یاد کرتا ہے تو میں بھی اسے اپنے دل میں یاد کرتا ہوں اور جب وہ مجھے مجلس میں یاد کرتا ہے تو اسے اس سے بہتر فرشتوں کی مجلس میں اسے یاد کرتا ہوں اور اگر وہ مجھ سے ایک بالشت قریب آتا ہے تو میں اس سے ایک ہاتھ قریب ہو جاتا ہوں اور اگر وہ مجھ سے ایک ہاتھ قریب آتا ہے تو میں اس سے دو ہاتھ قریب ہو جاتا ہوں اور اگر وہ میری طرف چل کر آتا ہے تو میں اس کے پاس دوڑ کر آ جاتا ہوں ۔",
                "urduNarrator": "ہم سے عمر بن حفص نے بیان کیا ‘ کہا ہم سے ہمارے والد نے ‘ کہا ہم سے اعمش نے ‘ کہا میں نے ابوصالح سے سنا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، سَمِعْتُ أَبَا صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَقُولُ اللَّهُ تَعَالَى أَنَا عِنْدَ ظَنِّ عَبْدِي بِي، وَأَنَا مَعَهُ إِذَا ذَكَرَنِي، فَإِنْ ذَكَرَنِي فِي نَفْسِهِ ذَكَرْتُهُ فِي نَفْسِي، وَإِنْ ذَكَرَنِي فِي مَلأٍ ذَكَرْتُهُ فِي مَلأٍ خَيْرٍ مِنْهُمْ، وَإِنْ تَقَرَّبَ إِلَىَّ بِشِبْرٍ تَقَرَّبْتُ إِلَيْهِ ذِرَاعًا، وَإِنْ تَقَرَّبَ إِلَىَّ ذِرَاعًا تَقَرَّبْتُ إِلَيْهِ بَاعًا، وَإِنْ أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7099,
                "hadithNumber": "7406",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "when this Verse:--'Say (O Muhammad!): He has Power to send torments on you from above,' (6.65) was revealed; The Prophet (ﷺ) said, \"I take refuge with Your Face.\" Allah revealed:-- '..or from underneath your feet.' (6.65) The Prophet (ﷺ) then said, \"I seek refuge with Your Face!\" Then Allah revealed:--'...or confuse you in party-strife.' (6.65) Oh that, the Prophet (ﷺ) said, \"This is easier.\"",
                "hadithUrdu": "جب یہ آیت نازل ہوئی ۔ ” آپ کہہ دیجئیے کہ وہ قادر ہے اس پر کہ تم پر تمہارے اوپر سے عذاب نازل کرے “ تو نبی کریم صلی اللہ علیہ وسلم نے کہا ” میں تیرے منہ کی پناہ مانگتا ہوں ۔ “ پھر آیت کے یہ الفاظ نازل ہوئے جن کا ترجمہ یہ ہے کہ ” وہ تمہارے اوپر سے تم پر عذاب نازل کرے یا تمہارے پاؤں کے نیچے سے عذاب آ جائے ۔ “ تو آنحضرت صلی اللہ علیہ وسلم نے پھر یہ دعا کی کہ میں تیرے منہ کی پناہ چاہتا ہوں ۔ پھر یہ آیت نازل ہوئی جن کا ترجمہ یہ ہے ” یا تمہیں فرقہ بندی میں مبتلا کر دے ( کہ یہ بھی عذاب کی قسم ہے ) “ تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ آسان ہے بہ نسبت اگلے عذابوں کے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے حماد نے بیان کیا ‘ ان سے عمرو نے اور ان سے جابر بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرٍو، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏قُلْ هُوَ الْقَادِرُ عَلَى أَنْ يَبْعَثَ عَلَيْكُمْ عَذَابًا مِنْ فَوْقِكُمْ‏}‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَعُوذُ بِوَجْهِكَ ‏\"‏‏.‏ فَقَالَ ‏{‏أَوْ مِنْ تَحْتِ أَرْجُلِكُمْ‏}‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَعُوذُ بِوَجْهِكَ ‏\"‏‏.‏ قَالَ ‏{‏أَوْ يَلْبِسَكُمْ شِيَعًا‏}‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَذَا أَيْسَرُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏كُلُّ شَىْءٍ هَالِكٌ إِلاَّ وَجْهَهُ‏}",
                "headingUrdu": "’’ہر چیز فنا ہو جائے گی سوائے اس کے چہرے کے…‘‘",
                "headingEnglish": "“…..Everything will perish save His Face…”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7100,
                "hadithNumber": "7407",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "Ad-Dajjal was mentioned in the presence of the Prophet. The Prophet (ﷺ) said, \"Allah is not hidden from you; He is not one-eyed,\" and pointed with his hand towards his eye, adding, \"While Al-Masih Ad- Dajjal is blind in the right eye and his eye looks like a protruding grape.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے پاس دجال کا ذکر ہوا تو آپ نے فرمایا کہ تمہیں اچھی طرح معلوم ہے کہ اللہ کانا نہیں ہے اور آپ نے ہاتھ سے اپنی آنکھ کی طرف اشارہ کیا اور دجال مسیح کی دائیں آنکھ کانی ہو گی ۔ جیسے اس کی آنکھ پر انگور کا ایک اٹھا ہوا دانہ ہو ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ انہوں نے کہا ہم سے جویریہ نے بیان کیا ‘ ان سے نافع نے بیان کیا اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ ذُكِرَ الدَّجَّالُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ إِنَّ اللَّهَ لاَ يَخْفَى عَلَيْكُمْ، إِنَّ اللَّهَ لَيْسَ بِأَعْوَرَ ـ وَأَشَارَ بِيَدِهِ إِلَى عَيْنِهِ ـ وَإِنَّ الْمَسِيحَ الدَّجَّالَ أَعْوَرُ الْعَيْنِ الْيُمْنَى كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏وَلِتُصْنَعَ عَلَى عَيْنِي‏}‏ تُغَذَّى",
                "headingUrdu": "\"...تاکہ تم میری آنکھوں کے نیچے پرورش پاو۔",
                "headingEnglish": "“…In order that you may be brought up under My Eye.",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7101,
                "hadithNumber": "7408",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah did not send any prophet but that he warned his nation of the one-eyed liar (Ad-Dajjal). He is one-eyed while your Lord is not one-eyed, The word 'Kafir' (unbeliever) is written between his two eyes.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ نے جتنے نبی بھیجے ان سب نے جھوٹے کانے دجال سے اپنی قوم کو ڈرا یا ۔ وہ دجال کانا ہو گا اور تمہارے رب ( آنکھوں والا ہے ) کانا نہیں ہے ۔ اس دجال کی دو نوں آنکھوں کے درمیان لکھا ہوا ہو گا لفظ کافر ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ کہا ہم کو قتادہ نے خبر دی ‘ کہا میں نے انس رضی اللہ عنہ سے سنا اور ان سے",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا قَتَادَةُ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا بَعَثَ اللَّهُ مِنْ نَبِيٍّ إِلاَّ أَنْذَرَ قَوْمَهُ الأَعْوَرَ الْكَذَّابَ، إِنَّهُ أَعْوَرُ، وَإِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ، مَكْتُوبٌ بَيْنَ عَيْنَيْهِ كَافِرٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7102,
                "hadithNumber": "7409",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "During the battle with Bani Al-Mustaliq they (Muslims) captured some females and intended to have sexual relation with them without impregnating them. So they asked the Prophet (ﷺ) about coitus interrupt us. The Prophet (ﷺ) said, \"It is better that you should not do it, for Allah has written whom He is going to create till the Day of Resurrection.\" Qaza'a said, \"I heard Abu Sa`id رضی اللہ عنہ saying that the Prophet (ﷺ) said, 'No soul is ordained to be created but Allah will create it.\"",
                "hadithUrdu": "غزوہ بنو المصطلق میں انہیں باندیاں غنیمت میں ملیں تو انہوں نے چاہا کہ ان سے ہمبستر ی کریں لیکن حمل نہ ٹھہرے ۔ چنانچہ لوگوں نے آنحضرت صلی اللہ علیہ وسلم سے عزل کے متعلق پوچھا تو آپ نے فرمایا کہ اگر تم عزل بھی کرو تو کوئی قباحت نہیں مگر قیامت تک جس جان کے متعلق اللہ تعالیٰ نے پیدا ہونا لکھ دیا ہے وہ ضرور پیدا ہو کر رہے گی ( اس لیے تمہارا عزل کرنا بیکار ہے ۔ موجودہ جبری نسل بندی کا جواز اس سے نکالنا بالکل غلط ہے ۔ اور مجاہد نے قزعہ سے بیان کیا کہ انہوں نے ابو سعید خدری رضی اللہ عنہ سے سنا ‘ انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کوئی بھی جان جو پیدا ہوتی ہے ‘ اللہ تعالیٰ ضرور اسے پیدا کر کے رہے گا ۔",
                "urduNarrator": "ہم سے اسحاق نے بیان کیا ‘ کہا ہم سے عفان نے بیان کیا ‘ کہا ہم سے وہیب نے بیان کیا ‘ کہا ہم سے موسیٰ بن عقبہ نے بیان کیا ‘ کہا مجھ سے محمد بن یحییٰ بن حبان نے بیان کیا ‘ ان سے ابن محیریز نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مُوسَى ـ هُوَ ابْنُ عُقْبَةَ ـ حَدَّثَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ حَبَّانَ، عَنِ ابْنِ مُحَيْرِيزٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، فِي غَزْوَةِ بَنِي الْمُصْطَلِقِ أَنَّهُمْ أَصَابُوا سَبَايَا فَأَرَادُوا أَنْ يَسْتَمْتِعُوا بِهِنَّ وَلاَ يَحْمِلْنَ فَسَأَلُوا النَّبِيَّ صلى الله عليه وسلم عَنِ الْعَزْلِ فَقَالَ ‏\"‏ مَا عَلَيْكُمْ أَنْ لاَ تَفْعَلُوا، فَإِنَّ اللَّهَ قَدْ كَتَبَ مَنْ هُوَ خَالِقٌ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏ وَقَالَ مُجَاهِدٌ عَنْ قَزَعَةَ سَمِعْتُ أَبَا سَعِيدٍ فَقَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَيْسَتْ نَفْسٌ مَخْلُوقَةٌ إِلاَّ اللَّهُ خَالِقُهَا ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ ‏{‏هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ}",
                "headingUrdu": "\"وہ اللہ ہے، خالق، ہر چیز کا موجد، صورتوں کا عطا کرنے والا...\"",
                "headingEnglish": "“He is Allah, the Creator, the Inventor of all things, the Bestower of forms…”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7103,
                "hadithNumber": "7410",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah will gather the believers on the Day of Resurrection in the same way (as they are gathered in this life), and they will say, 'Let us ask someone to intercede for us with our Lord that He may relieve us from this place of ours.' Then they will go to Adam and say, 'O Adam! Don't you see the people (people's condition)? Allah created you with His Own Hands and ordered His angels to prostrate before you, and taught you the names of all the things. Please intercede for us with our Lord so that He may relieve us from this place of ours.' Adam will say, 'I am not fit for this undertaking' and mention to them the mistakes he had committed, and add, \"But you d better go to Noah as he was the first Apostle sent by Allah to the people of the Earth.' They will go to Noah who will reply, 'I am not fit for this undertaking,' and mention the mistake which he made, and add, 'But you'd better go to Abraham, Khalil Ar-Rahman.' They will go to Abraham who will reply, 'I am not fit for this undertaking,' and mention to them the mistakes he made, and add, 'But you'd better go to Moses, a slave whom Allah gave the Torah and to whom He spoke directly' They will go to Moses who will reply, 'I am not fit for this undertaking,' and mention to them the mistakes he made, and add, 'You'd better go to Jesus, Allah's slave and His Apostle and His Word (Be: And it was) and a soul created by Him.' They will go to Jesus who will say, 'I am not fit for this undertaking, but you'd better go to Muhammad whose sins of the past and the future had been forgiven (by Allah).' So they will come to me and I will ask the permission of my Lord, and I will be permitted (to present myself) before Him. When I see my Lord, I will fall down in (prostration) before Him and He will leave me (in prostration) as long as He wishes, and then it will be said to me, 'O Muhammad! Raise your head and speak, for you will be listened to; and ask, for you will be granted (your request); and intercede, for your intercession will be accepted.' I will then raise my head and praise my Lord with certain praises which He has taught me, and then I will intercede. Allah will allow me to intercede (for a certain kind of people) and will fix a limit whom I will admit into Paradise. I will come back again, and when I see my Lord (again), I will fall down in prostration before Him, and He will leave me (in prostration) as long as He wishes, and then He will say, 'O Muhammad! Raise your head and speak, for you will be listened to; and ask, for you will be granted (your request); and intercede, for your intercession will be accepted.' I will then praise my Lord with certain praises which He has taught me, and then I will intercede. Allah will allow me to intercede (for a certain kind of people) and will fix a limit to whom I will admit into Paradise, I will return again, and when I see my Lord, I will fall down (in prostration) and He will leave me (in prostration) as long as He wishes, and then He will say, 'O Muhammad! Raise your head and speak, for you will be listened to, and ask, for you will be granted (your request); and intercede, for your intercession will be accepted.' I will then praise my Lord with certain praises which He has taught me, and then I will intercede. Allah will allow me to intercede (for a certain kind of people) and will fix a limit to whom I will admit into Paradise. I will come back and say, 'O my Lord! None remains in Hell (Fire) but those whom Qur'an has imprisoned therein and for whom eternity in Hell (Fire) has become inevitable.' \" The Prophet (ﷺ) added, \"There will come out of Hell (Fire) everyone who says: 'La ilaha illal-lah,' and has in his heart good equal to the weight of a barley grain. Then there will come out of Hell (Fire) everyone who says: ' La ilaha illal-lah,' and has in his heart good equal to the weight of a wheat grain. Then there will come out of Hell (Fire) everyone who says: 'La ilaha illal-lah,' and has in his heart good equal to the weight of an atom (or a smallest ant).",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ قیامت کے دن اسی طرح جیسے ہم دنیا میں جمع ہوتے ہیں ، مومنوں کو اکٹھا کرے گا ( وہ گرمی وغیرہ سے پریشان ہو کر ) کہیں گے کاش ہم کسی کی سفارش اپنے مالک کے پاس لے جاتے تاکہ ہمیں اپنی اس حالت آرام ملتا ۔ چنانچہ سب مل کر آدم علیہ السلام کے پاس آئیں گے ۔ ان سے کہیں گے آدم ! آپ جوگوں کا حال نہیں دیکھتے کس بلا میں گرفتار ہیں ۔ آپ کو اللہ تعالیٰ نے ( خاص ) اپنے ہاتھ سے بنایا اور فرشتوں سے آپ کو سجدہ کرایا اور ہر چیز کے نام آپ کو بتلائے ( ہر لغت میں بولنا بات کرنا سکھلایا ) کچھ سفارش کیجئے تاکہ ہم لوگوں کو اس جگہ سے نجات ہو کر آرام ملے ۔ کہیں گے میں اس لائق نہیں ، ان کو وہ گناہ یاد آ جائے گا جو انہوں نے کیا تھا ( ممنوع درخت میں سے کھانا ) مگر تم لوگ ایسا کرو نوح علیہ السلام پیغمبر کے پاس جاؤ وہ پہلے پیغمبر ہیں جن اللہ تعالیٰ نے زمین والوں کی طرف بھیجا تھا ۔ آخر وہ لوگ سب نوح علیہ السلام کے پاس آئیں گے ، وہ بھی یہی جواب دیں گے ، میں اس لائق نہیں اپنی خطا جو انہوں نے ( دنیا میں ) کی تھی یاد کریں گے ۔ کہیں گے تم لوگ ایسا کرو ابراہیم پیغمبر کے پاس جاؤ جو اللہ کے خلیل ہیں ( ان کے پاس جائیں گے ) وہ بھی اپنی خطائیں یاد کر کے کہیں گے میں اس لائق نہیں تم موسیٰ علیہ السلام پیغمبر کے پاس جاؤ اللہ نے ان کو توراۃ عنائت فرمائی ، ان سے بول کر باتیں کیں ۔ یہ لوگ موسیٰ علیہ السلام کے پاس آئیں گے وہ بھی یہی کہیں گے میں اس لائق نہیں اپنی خطا جوانہوں نے دنیا میں کی تھی یاد کریں گے مگر تم ایسا کرو عیسیٰ پیغمبر کے پاس جاؤ وہ اللہ کے بندے ، اس کے رسول ، اس کے خاص کلمہ اور خاص روح ہیں ۔ یہ لوگ عیسیٰ علیہ السلام کے پاس آئیں گے وہ کہیں گے میں اس لائق نہیں تم ایسا کرو محمد صلی اللہ علیہ وسلم کے پاس جاؤ وہ اللہ کے ایسے بندے ہیں جن کی اگلی پچھلی خطائیں سب بخش دی گئی ہیں ۔ آخر یہ سب لوگ جمع ہو کر میرے پاس آئیں گے ۔ میں چلوں گا اور اپنے پروردگار کی بارگاہ میں حاضر ہونے کی اجازت مانگوں گا ، مجھ کو اجازت ملے گی ۔ میں اپنے پروردگار کو دیکھتے ہی سجدے میں گر پڑوں گا اور جب تک اس کو منظور ہے وہ مجھ کو سجدے ہی میں پڑا رہنے دے گا ۔ اس کے بعد حکم ہو گا ” محمد صلی اللہ علیہ وسلم اپنا سر اٹھاؤ اور عرض کرو تمہاری عرض سنی جائے گی تمہاری درخواست منظور ہو گی ، تمہاری سفارش مقبول ہو گی اس وقت میں اپنے مالک کی ایسی ایسی تعریفیں کروں گا جو وہ مجھ کو سکھا چکا ہے ۔ ( یا سکھلائے گا ) پھر لوگوں کی سفارش شروع کر دوں گا ۔ سفارش کی ایک حد مقرر کر دی جائے گی ۔ میں ان کو بہشت میں لے جاؤں گا ، پھر لوٹ کر اپنے پروردگار کے پاس حاضر ہوں گا اور اس کو دیکھتے ہی سجدے میں گر پڑوں گا جب تک پروردگار چاہے گا مجھ کو سجدے میں پڑا رہنے دے گا ۔ اس کے بعد ارشاد ہو گا ” محمد اپنا سر اٹھاؤ جو تم کہو گے سنا جائے گا اور سفارش کرو گے تو قبول ہو گی پھر میں اپنے پروردگار کی ایسی تعریفیں کروں گا جو اللہ نے مجھ کو سکھلائیں ( یا سکھلائے گا ) اس کے بعد سفارش کر دوں گا لیکن سفارش کی ایک حد مقرر کر دی جائے گی ۔ میں ان کو بہشت میں لے جاؤں گا پھر لوٹ کر اپنے پروردگار کے پاس حاضر ہوں گا اس کو دیکھتے ہی سجدے میں گر پڑوں گا جب تک پروردگار چائے گا مجھ کو سجدے میں پڑا رہنے دیے گا ۔ اس کے بعد ارشاد ہو گا محمد اپنا سر اٹھاؤ جو تم کہو گے سنا جائے گا اور سفارش کرو گے تو قبول ہو گی پھر میں اپنے پروردگار کی ایسی تعریفیں کروں گا جو اللہ نے مجھ کو سکھلائیں ( یا سکھلائے گا ) اس کے بعد سفارش شروع کر دوں گا لیکن سفارش کی ایک حد مقرر کر دی جائے گی ۔ میں ان کو بہشت میں لے جاؤں گا پھر لوٹ کر اپنے پروردگار کے پاس حاضر ہوں گا ۔ عرض کروں گا یا پاک پروردگار ! اب تو دوزخ میں ایسے ہی لوگ رہ گئے ہیں جو قرآن کے بموجب دوزخ ہی میں ہمیشہ رہنے کے لائق ہیں ( یعنی کافر اور مشرک ) انس رضی اللہ عنہ نے کہا آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، دوزخ سے وہ لوگ نکال لیے جائیں گے جنہوں نے ( دنیا میں ) لا الہٰ الا اللہ کہا ہو گا اور ان کے دل میں ایک جو برابر ایمان ہو گا پھر وہ لوگ بھی نکال لیے جائیں گے جنہوں نے لا الہٰ الا اللہ کہا ہو گا اور ان کے دل میں گیہوں برابر ایمان ہو گا ۔ ( گیہوں جو سے چھوٹا ہوتا ہے ) پھر وہ بھی نکال لیے جائیں گے جنہوں نے لا الہٰ الا اللہ کہا ہو گا اور ان کے دل میں چیونٹی برابر ( یا بھنگے برابر ) ایمان ہو گا ۔",
                "urduNarrator": "مجھ سے معاذبن فضالہ نے بیان کیا ، کہا ہم سے ہشام دستوائی نے ، انہوں نے قتادہ بن دعامہ سے ، انہوں نے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ يَجْمَعُ اللَّهُ الْمُؤْمِنِينَ يَوْمَ الْقِيَامَةِ كَذَلِكَ فَيَقُولُونَ لَوِ اسْتَشْفَعْنَا إِلَى رَبِّنَا حَتَّى يُرِيحَنَا مِنْ مَكَانِنَا هَذَا‏.‏ فَيَأْتُونَ آدَمَ فَيَقُولُونَ يَا آدَمُ أَمَا تَرَى النَّاسَ خَلَقَكَ اللَّهُ بِيَدِهِ وَأَسْجَدَ لَكَ مَلاَئِكَتَهُ وَعَلَّمَكَ أَسْمَاءَ كُلِّ شَىْءٍ، شَفِّعْ لَنَا إِلَى رَبِّنَا حَتَّى يُرِيحَنَا مِنْ مَكَانِنَا هَذَا‏.‏ فَيَقُولُ لَسْتُ هُنَاكَ ـ وَيَذْكُرُ لَهُمْ خَطِيئَتَهُ الَّتِي أَصَابَ ـ وَلَكِنِ ائْتُوا نُوحًا، فَإِنَّهُ أَوَّلُ رَسُولٍ بَعَثَهُ اللَّهُ إِلَى أَهْلِ الأَرْضِ‏.‏ فَيَأْتُونَ نُوحًا فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ خَطِيئَتَهُ الَّتِي أَصَابَ ـ وَلَكِنِ ائْتُوا إِبْرَاهِيمَ خَلِيلَ الرَّحْمَنِ‏.‏ فَيَأْتُونَ إِبْرَاهِيمَ فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ لَهُمْ خَطَايَاهُ الَّتِي أَصَابَهَا ـ وَلَكِنِ ائْتُوا مُوسَى عَبْدًا أَتَاهُ اللَّهُ التَّوْرَاةَ وَكَلَّمَهُ تَكْلِيمًا ـ فَيَأْتُونَ مُوسَى فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ لَهُمْ خَطِيئَتَهُ الَّتِي أَصَابَ ـ وَلَكِنِ ائْتُوا عِيسَى عَبْدَ اللَّهِ وَرَسُولَهُ وَكَلِمَتَهُ وَرُوحَهُ‏.‏ فَيَأْتُونَ عِيسَى فَيَقُولُ لَسْتُ هُنَاكُمْ وَلَكِنِ ائْتُوا مُحَمَّدًا صلى الله عليه وسلم عَبْدًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ‏.‏ فَيَأْتُونِي فَأَنْطَلِقُ فَأَسْتَأْذِنُ عَلَى رَبِّي فَيُؤْذَنُ لِي عَلَيْهِ، فَإِذَا رَأَيْتُ رَبِّي وَقَعْتُ لَهُ سَاجِدًا فَيَدَعُنِي مَا شَاءَ اللَّهُ أَنْ يَدَعَنِي ثُمَّ يُقَالُ لِي ارْفَعْ مُحَمَّدُ، وَقُلْ يُسْمَعْ، وَسَلْ تُعْطَهْ، وَاشْفَعْ تُشَفَّعْ‏.‏ فَأَحْمَدُ رَبِّي بِمَحَامِدَ عَلَّمَنِيهَا، ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا فَأُدْخِلُهُمُ الْجَنَّةَ، ثُمَّ أَرْجِعُ فَإِذَا رَأَيْتُ رَبِّي وَقَعْتُ سَاجِدًا، فَيَدَعُنِي مَا شَاءَ اللَّهُ أَنْ يَدَعَنِي ثُمَّ يُقَالُ ارْفَعْ مُحَمَّدُ، وَقُلْ يُسْمَعْ، وَسَلْ تُعْطَهْ، وَاشْفَعْ تُشَفَّعْ، فَأَحْمَدُ رَبِّي بِمَحَامِدَ عَلَّمَنِيهَا رَبِّي ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا فَأُدْخِلُهُمُ الْجَنَّةَ، ثُمَّ أَرْجِعُ فَإِذَا رَأَيْتُ رَبِّي وَقَعْتُ سَاجِدًا، فَيَدَعُنِي مَا شَاءَ اللَّهُ أَنْ يَدَعَنِي ثُمَّ يُقَالُ ارْفَعْ مُحَمَّدُ، قُلْ يُسْمَعْ، وَسَلْ تُعْطَهْ، وَاشْفَعْ تُشَفَّعْ، فَأَحْمَدُ رَبِّي بِمَحَامِدَ عَلَّمَنِيهَا، ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا فَأُدْخِلُهُمُ الْجَنَّةَ، ثُمَّ أَرْجِعُ فَأَقُولُ يَا رَبِّ مَا بَقِيَ فِي النَّارِ إِلاَّ مَنْ حَبَسَهُ الْقُرْآنُ وَوَجَبَ عَلَيْهِ الْخُلُودُ ‏\"‏‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ وَكَانَ فِي قَلْبِهِ مِنَ الْخَيْرِ مَا يَزِنُ شَعِيرَةً، ثُمَّ يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ وَكَانَ فِي قَلْبِهِ مِنَ الْخَيْرِ مَا يَزِنُ بُرَّةً، ثُمَّ يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ وَكَانَ فِي قَلْبِهِ مَا يَزِنُ مِنَ الْخَيْرِ ذَرَّةً ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏لِمَا خَلَقْتُ بِيَدَىَّ‏}‏",
                "headingUrdu": "جس کو میں نے اپنے دونوں ہاتھوں سے بنایا ہے...",
                "headingEnglish": "“..To one whom I have created with Both My Hands…”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7104,
                "hadithNumber": "7411",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Allah's Hand is full, and (its fullness) is not affected by the continuous spending, day and night.\" He also said, \"Do you see what He has spent since He created the Heavens and the Earth? Yet all that has not decreased what is in His Hand.\" He also said, \"His Throne is over the water and in His other Hand is the balance (of Justice) and He raises and lowers (whomever He will).\" (See Hadith No. 206, Vol. 6)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اللہ کا ہاتھ بھرا ہوا ہے ۔ اسے رات دن کی بخشش بھی کم نہیں کرتی ۔ آپ نے فرمایا کیا تمہیں معلوم ہے کہ جب اس نے آسمان و زمین پیدا کئے ہیں اس نے کتنا خرچ کیا ہے اس نے بھی اس میں کوئی کمی نہیں پیدا کی جو اس کے ہاتھ میں ہے اور فرمایا کہ اس کا عرش پانی پر ہے اور اس کے دوسرے ہاتھ میں ترازوہے ۔ جسے وہ جھکاتا اور اٹھاتا رہتا ہے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کی کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابو الزنادنے بیان کیا ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ يَدُ اللَّهِ مَلأَى لاَ يَغِيضُهَا نَفَقَةٌ، سَحَّاءُ اللَّيْلَ وَالنَّهَارَ ـ وَقَالَ ـ أَرَأَيْتُمْ مَا أَنْفَقَ مُنْذُ خَلَقَ السَّمَوَاتِ وَالأَرْضَ، فَإِنَّهُ لَمْ يَغِضْ مَا فِي يَدِهِ ـ وَقَالَ ـ عَرْشُهُ عَلَى الْمَاءِ وَبِيَدِهِ الأُخْرَى الْمِيزَانُ يَخْفِضُ وَيَرْفَعُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7105,
                "hadithNumber": "7412, 7413",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"On the Day of Resurrection, Allah will grasp the whole Earth by His Hand, and all the Heavens in His right, and then He will say, 'I am the King.' Saeed has reported it from Maalik. Hadrat Ibn-e-Umer رضی اللہ عنہا has reported from the prophet ﷺ likewise. \"Abu Huraira رضی اللہ عنہ said, \"Allah's Messenger (ﷺ) said,\" Allah will grasp the Earth...' \"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ قیامت کے دن زمین اس کی مٹھی میں ہو گی اور آسمان اس کے داہنے ہاتھ میں ہو گا ، پھر کہے گا کہ میں بادشاہ ہوں ۔ اس کی روایت سعید نے مالک سے کی ۔اور عمر بن حمزہ نے بیان کیا انہوں نے کہا کہ میں نے سالم سے سنا ، انہوں نے ابن عمر رضی اللہ عنہا سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے یہی حدیث ۔ ابوالیمان نے بیان کیا ، انہیں شعیب نے خبر دی ، انہیں زہری نے ، انہیں ابوسلمہ نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ اللہ زمین کو اپنی مٹھی میں لے لے گا ۔",
                "urduNarrator": "ہم سے مقدم بن محمد نے بیان کیا ، انہوں نے کہا ہم سے ہمارے چچا قاسم بن یحییٰ نے بیان کیا ، ان سے عبیداللہ نے بیان کیا ، ان سے نافع نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُقَدَّمُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي عَمِّي الْقَاسِمُ بْنُ يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ إِنَّ اللَّهَ يَقْبِضُ يَوْمَ الْقِيَامَةِ الأَرْضَ وَتَكُونُ السَّمَوَاتُ بِيَمِينِهِ ثُمَّ يَقُولُ أَنَا الْمَلِكُ ‏\"‏‏.‏ رَوَاهُ سَعِيدٌ عَنْ مَالِكٍ‏.‏ وَقَالَ عُمَرُ بْنُ حَمْزَةَ سَمِعْتُ سَالِمًا سَمِعْتُ ابْنَ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا‏.‏ وَقَالَ أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَقْبِضُ اللَّهُ الأَرْضَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7076,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=283",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=281",
                "label": "281",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=282",
                "label": "282",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=283",
                "label": "283",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=284",
                "label": "284",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=285",
                "label": "285",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=286",
                "label": "286",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=287",
                "label": "287",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=285",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=285",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=283",
        "to": 7100,
        "total": 40465
    }
}