{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 287,
        "data": [
            {
                "id": 7156,
                "hadithNumber": "7466",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The example of a believer is that of a fresh green plant the leaves of which move in whatever direction the wind forces them to move and when the wind becomes still, it stand straight. Such is the similitude of the believer: He is disturbed by calamities (but is like the fresh plant he regains his normal state soon). And the example of a disbeliever is that of a pine tree (which remains) hard and straight till Allah cuts it down when He will.\" (See Hadith No. 546 and 547, Vol. 7).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ مومن کی مثال کھیت کے نرم پودے کی سی ہے کہ جدھر ہوا چلتی ہے تو اس کے پتے ادھر جھک جاتے ہیں اور جب ہوا رک جاتی ہے تو پتے بھی برابر ہو جاتے ہیں ۔ اسی طرح مومن آزمائشوں میں بچایا جاتا ہے لیکن کافر کی مثال شمشاد کے سخت درخت جیسی ہے کہ ایک حالت پر کھڑا رہتا ہے یہاں تک کہ اللہ جب چاہتا ہے اسے اکھاڑ دیتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن سنان نے بیان کیا ‘ انہوں نے کہا ہم سے فلیح بن سلیمان نے ‘ انہوں نے کہا ہم سے ہلال بن علی نے ‘ ان سے عطاء بن یسار نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحٌ، حَدَّثَنَا هِلاَلُ بْنُ عَلِيٍّ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَثَلُ الْمُؤْمِنِ كَمَثَلِ خَامَةِ الزَّرْعِ، يَفِيءُ وَرَقُهُ مِنْ حَيْثُ أَتَتْهَا الرِّيحُ تُكَفِّئُهَا، فَإِذَا سَكَنَتِ اعْتَدَلَتْ، وَكَذَلِكَ الْمُؤْمِنُ يُكَفَّأُ بِالْبَلاَءِ، وَمَثَلُ الْكَافِرِ كَمَثَلِ الأَرْزَةِ صَمَّاءَ مُعْتَدِلَةً حَتَّى يَقْصِمَهَا اللَّهُ إِذَا شَاءَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7157,
                "hadithNumber": "7467",
                "englishNarrator": "Narrated `Abdullah bin `Umar  رضی اللہ عنہما :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) while he was standing on the pulpit, saying, \"The remaining period of your stay (on the earth) in comparison to the nations before you, is like the period between the `Asr prayer and sunset. The people of the Torah were given the Torah and they acted upon it till midday, and then they were worn out and were given for their labor, one Qirat each. Then the people of the Gospel were given the Gospel and they acted upon it till the time of the `Asr prayer, and then they were worn out and were given (for their labor), one Qirat each. Then you people were given the Qur'an and you acted upon it till sunset and so you were given two Qirats each (double the reward of the previous nations).\" Then the people of the Torah said, 'O our Lord! These people have done a little labor (much less than we) but have taken a greater reward.' Allah said, 'Have I withheld anything from your reward?' They said, 'No.' Then Allah said, 'That is My Favor which I bestow on whom I wish.' \"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ‘ آپ منبر پر کھڑے فرما رہے تھے کہ تمہارا زمانہ گزشتہ امتوں کے مقابلہ میں ایسا ہے جیسے عصر سے سورج ڈوبنے تک کا وقت ہوتا ہے ۔ توریت والوں کو توریت دی گئی اور انہوں نے اس پر عمل کیا ‘ یہاں تک کہ دن آدھا ہو گیا ۔ پھر وہ عاجز ہو گئے تو انہیں اس کے بدلے میں ایک قیراط دیا گیا ۔ پھر اہل انجیل کو انجیل دی گئی تو انہوں نے اس پر عصر کی نماز کے وقت تک عمل کیا اور پھر وہ عمل سے عاجز آ گئے تو انہیں بھی ایک ایک قیراط دیا گیا ۔ پھر تمہیں قرآن دیا گیا اور تم نے اس پر سورج ڈوبنے تک عمل کیا اور تمہیں اس کے بدلے میں دو دو قیراط دئیے گئے ۔ اہل توریت نے اس پر کہا کہ اے ہمارے رب ! یہ لوگ مسلمان سب سے کم کام کرنے والے اور سب سے زیادہ اجر پانے والے ہیں ۔ اللہ تعالیٰ نے اس پر فرمایا کہ کیا میں تمہیں اجر دینے میں کوئی نا انصافی کی ہے ؟ وہ بولے کہ نہیں ! تو اللہ تعالیٰ فرمایا کہ یہ تو میرا فضل ہے ‘ میں جس پر چاہتا ہوں کرتا ہوں ۔",
                "urduNarrator": "ہم سے حکم بن نافع نے بیان کیا ‘ انہوں نے کہا ہم کو شعیب نے خبر دی ‘ انہیں زہری نے ‘ کہا مجھ کو سالم بن عبداللہ نے خبر دی اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْوَ قَائِمٌ عَلَى الْمِنْبَرِ ‏ \"‏ إِنَّمَا بَقَاؤُكُمْ فِيمَا سَلَفَ قَبْلَكُمْ مِنَ الأُمَمِ، كَمَا بَيْنَ صَلاَةِ الْعَصْرِ إِلَى غُرُوبِ الشَّمْسِ، أُعْطِيَ أَهْلُ التَّوْرَاةِ التَّوْرَاةَ، فَعَمِلُوا بِهَا حَتَّى انْتَصَفَ النَّهَارُ، ثُمَّ عَجَزُوا، فَأُعْطُوا قِيرَاطًا قِيرَاطًا، ثُمَّ أُعْطِيَ أَهْلُ الإِنْجِيلِ الإِنْجِيلَ، فَعَمِلُوا بِهِ حَتَّى صَلاَةِ الْعَصْرِ، ثُمَّ عَجَزُوا، فَأُعْطُوا قِيرَاطًا قِيرَاطًا، ثُمَّ أُعْطِيتُمُ الْقُرْآنَ فَعَمِلْتُمْ بِهِ حَتَّى غُرُوبِ الشَّمْسِ، فَأُعْطِيتُمْ قِيرَاطَيْنِ قِيرَاطَيْنِ، قَالَ أَهْلُ التَّوْرَاةِ رَبَّنَا هَؤُلاَءِ أَقَلُّ عَمَلاً وَأَكْثَرُ أَجْرًا‏.‏ قَالَ هَلْ ظَلَمْتُكُمْ مِنْ أَجْرِكُمْ مِنْ شَىْءٍ قَالُوا لاَ‏.‏ فَقَالَ فَذَلِكَ فَضْلِي أُوتِيهِ مَنْ أَشَاءُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7158,
                "hadithNumber": "7468",
                "englishNarrator": "Narrated 'Ubada bin As-Samit رضی اللہ عنہ :",
                "hadithEnglish": "I, along with a group of people, gave the pledge of allegiance to Allah's Messenger (ﷺ). He said, \"I take your Pledge on the condition that you (1) will not join partners in worship with Allah, (2) will not steal, (3) will not commit illegal sexual intercourse, (4) will not kill your offspring, (5) will not slander, (6) and will not disobey me when I order you to do good. Whoever among you will abide by his pledge, his reward will be with Allah, and whoever commits any of those sins and receives the punishment in this world, that punishment will be an expiation for his sins and purification; but if Allah screens him, then it will be up to Allah to punish him if He will or excuse Him, if He will.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے ایک جماعت کے ساتھ بیعت کی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں تم سے اس بات پر بیعت لیتا ہوں کہ تم اللہ کے ساتھ کسی کو شریک نہیں ٹھہراؤ گے ‘ اسراف نہیں کرو گے ‘ زنا نہیں کرو گے ‘ اپنی اولاد کو قتل نہیں کرو گے اور من گھڑت بہتان کسی پر نہیں لگاؤ گے اور نیک کاموں میں میری نافرمانی نہیں کرو گے ۔ پس تم میں سے جو کوئی اس عہد کو پورا کرے گا اس کا اجبر اللہ پر ہے اور جس نے کہیں لغزش کی اور اسے دنیا میں ہی پکڑ لیا گیا تو یہ حد اس کے لئے کفارہ اور پا کی بن جائے گی اور جس کی اللہ نے پردہ پوشی کی تو پھر اللہ پر ہے جسے چاہے عذاب دے اور جسے چاہے اس کا گناہ بخش دے ۔",
                "urduNarrator": "ہم سے عبداللہ المسندی نے بیان کیا ‘ انہوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا ‘ انہوں نے کہا ہم کو معمر نے خبر دی ‘ انہیں زہری نے ‘ انہیں ابو ادریس نے اور ان سے عبادہ بن صامت رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ الْمُسْنَدِيُّ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي رَهْطٍ فَقَالَ ‏ \"‏ أُبَايِعُكُمْ عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا، وَلاَ تَسْرِقُوا، وَلاَ تَزْنُوا، وَلاَ تَقْتُلُوا أَوْلاَدَكُمْ، وَلاَ تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ وَلاَ تَعْصُونِي فِي مَعْرُوفٍ، فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَأُخِذَ بِهِ فِي الدُّنْيَا فَهْوَ لَهُ كَفَّارَةٌ وَطَهُورٌ، وَمَنْ سَتَرَهُ اللَّهُ فَذَلِكَ إِلَى اللَّهِ إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ غَفَرَ لَهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7159,
                "hadithNumber": "7469",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Prophet Solomon who had sixty wives, once said, \"Tonight I will have sexual relation (sleep) with all my wives so that each of them will become pregnant and bring forth (a boy who will grow into) a cavalier and will fight in Allah's Cause.\" So he slept with his wives and none of them (conceived and) delivered (a child) except one who brought a half (body) boy (deformed). Allah's Prophet said, \"If Solomon had said; 'If Allah Will,' then each of those women would have delivered a (would-be) cavalier to fight in Allah's Cause.\" (See Hadith No. 74 A, Vol. 4).",
                "hadithUrdu": "اللہ کے نبی سلیمان علیہ السلام کی ساٹھ بیویاں تھیں تو انہوں نے کہا کہ آج رات میں تمام بیویوں کے پاس جاؤں گا اور ہر بیوی حاملہ ہو گی اور پھر ایسا بچہ جنے گی جو شہسوار ہو گا اور اللہ کے راستے میں لڑے گا ۔ چنانچہ وہ اپنی تمام بیویوں کے پاس گئے ۔ لیکن صرف ایک بیوی کے یہاں بچہ پیدا ہوا اور وہ بھی ادھورا ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ اگر سلیمان علیہ السلام نے انشاءاللہ کہہ دیا ہوتا تو پھر ہر بیوی حاملہ ہوتی اور شہسوار جنتی جو اللہ کے راستے میں جہاد کرتا ۔",
                "urduNarrator": "ہم سے معلی بن اسد نے بیان کیا ‘ انہوں نے کہا ہم سے وہیب نے بیان کیا ‘ ان سے ایوب نے بیان کیا ‘ ان سے محمد نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ نَبِيَّ اللَّهِ سُلَيْمَانَ ـ عَلَيْهِ السَّلاَمُ ـ كَانَ لَهُ سِتُّونَ امْرَأَةً فَقَالَ لأَطُوفَنَّ اللَّيْلَةَ عَلَى نِسَائِي، فَلْتَحْمِلْنَ كُلُّ امْرَأَةٍ وَلْتَلِدْنَ فَارِسًا يُقَاتِلُ فِي سَبِيلِ اللَّهِ، فَطَافَ عَلَى نِسَائِهِ، فَمَا وَلَدَتْ مِنْهُنَّ إِلاَّ امْرَأَةٌ وَلَدَتْ شِقَّ غُلاَمٍ‏.‏ قَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ كَانَ سُلَيْمَانُ اسْتَثْنَى لَحَمَلَتْ كُلُّ امْرَأَةٍ مِنْهُنَّ، فَوَلَدَتْ فَارِسًا يُقَاتِلُ فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7160,
                "hadithNumber": "7470",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) entered upon a sick bedouin in whom he went to visit and said to him, \"Don't worry, Tahur (i.e., your illness will be a means of cleansing of your sins), if Allah Will.\" The bedouin said, \"Tahur! No, but it is a fever that is burning in the body of an old man and it will make him visit his grave.\" The Prophet (ﷺ) said, \"Then it is so.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ایک اعرابی کی عیادت کے لئے تشریف لے گئے اور اس سے کہا کہ کوئی مضائقہ نہیں یہ ( بیماری ) تمہارے لیے پاکی کا باعث ہے ۔ اس پر اس نے کہا کہ جناب یہ وہ بخار ہے جو ایک بڈھے پر جوش مار رہا ہے اور اسے قبر تک پہنچا کے رہے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر یونہی ہو گا ۔",
                "urduNarrator": "ہم سے محمد نے بیان کیا ‘ انہوں نے کہا ہم سے عبدالوہاب ثقفی نے بیان کیا ‘ انہوں نے کہا ہم سے خالد حذاء نے بیان کیا ‘ ان سے عکرمہ نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَى أَعْرَابِيٍّ يَعُودُهُ فَقَالَ ‏\"‏ لاَ بَأْسَ عَلَيْكَ طَهُورٌ، إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ قَالَ قَالَ الأَعْرَابِيُّ طَهُورٌ، بَلْ هِيَ حُمَّى تَفُورُ عَلَى شَيْخٍ كَبِيرٍ، تُزِيرُهُ الْقُبُورَ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَنَعَمْ إِذًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7161,
                "hadithNumber": "7471",
                "englishNarrator": "Narrated Abu Qatada:",
                "hadithEnglish": "When the people slept till so late that they did not offer the (morning) prayer, the Prophet (ﷺ) said, \"Allah captured your souls (made you sleep) when He willed, and returned them (to your bodies) when He willed.\" So the people got up and went to answer the call of nature, performed ablution, till the sun had risen and it had become white, then the Prophet (ﷺ) got up and offered the prayer.",
                "hadithUrdu": "جب سب لوگ سوئے اور نماز قضاء ہو گئی تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تمہاری روحوں کو جب چاہتا ہے روک دیتا ہے اور جب چاہتا ہے چھوڑ دیتا ہے ۔ پس تم اپنی ضرورتوں سے فارغ ہو کر وضو کرو ۔ آخر جب سورج پوری طرح طلوع ہو گیا اور خوب دن نکل آیا تو آپ کھڑے ہوئے اور نماز پڑھی ۔",
                "urduNarrator": "ہم سے ابن سلام نے بیان کیا ‘ کہا ہم کو ہشیم نے خبر دی ‘ انہیں حصین نے ‘ انہیں عبداللہ بن ابی قتادہ نے ‘ انہیں ان کے والد نے کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا هُشَيْمٌ، عَنْ حُصَيْنٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، حِينَ نَامُوا عَنِ الصَّلاَةِ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ قَبَضَ أَرْوَاحَكُمْ حِينَ شَاءَ، وَرَدَّهَا حِينَ شَاءَ ‏\"‏‏.‏ فَقَضَوْا حَوَائِجَهُمْ وَتَوَضَّئُوا إِلَى أَنْ طَلَعَتِ الشَّمْسُ وَابْيَضَّتْ فَقَامَ فَصَلَّى‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7162,
                "hadithNumber": "7472",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "\"A man from the Muslims and a man from the Jews quarrelled, and the Muslim said, \"By Him Who gave superiority to Muhammad over all the people!\" The Jew said, \"By Him Who gave superiority to Moses over all the people!' On that the Muslim lifted his hand and slapped the Jew. The Jew went to Allah's Messenger (ﷺ) and informed him of all that had happened between him and the Muslim. The Prophet (ﷺ) said, \"Do not give me superiority over Moses, for the people will fall unconscious on the Day of Resurrection, I will be the first to regain consciousness and behold, Moses will be standing there, holding the side of the Throne. I will not know whether he has been one of those who have fallen unconscious and then regained consciousness before me, or if he has been one of those exempted by Allah (from falling unconscious).\" (See Hadith No. 524, Vol. 8)",
                "hadithUrdu": "ایک مسلمان اور ایک یہودی نے آپس میں جھگڑا کیا ۔ مسلمان نے کہا کہ اس ذات کی قسم جس نے محمد صلی اللہ علیہ وسلم کو تمام دنیا میں چن لیا اور یہودی نے کہا کہ اس ذات کی قسم جس نے موسیٰ علیہ السلام کو تمام دنیا میں چن لیا اس پر مسلمان نے ہاتھ اٹھایا اور یہودی کو طمانچہ مار دیا ۔ یہودی آنحضرت صلی اللہ علیہ وسلم کے پاس آیا اور اس نے اپنا اور مسلمان کا معاملہ آپ سے ذکر کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا مجھے موسیٰ علیہ السلام پر ترجیح نہ دو ‘ تمام لوگ قیامت کے دن پہلا صور پھونکنے پر بیہوش کر دئیے جائیں گے ۔ پھر دوسرا صور پھونکنے پر میں سب سے پہلے بیدار ہوں گا لیکن میں دیکھوں گا کہ موسیٰ علیہ السلام عرش کا ایک کنارہ پکڑے ہوئے ہیں ۔ اب مجھے معلوم نہیں کہ کیا وہ ان میں تھے جنہیں بیہوش کیا گیا تھا اور مجھ سے پہلے ہی انہیں ہوش آ گیا یا انہیں اللہ تعالیٰ نے استشناء کر دیا تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن عزعہ نے بیان کیا ‘ انہوں نے کہا ہم سے ابراہیم نے بیان کیا ‘ ان سے ابن شہاب نے بیان کیا ‘ ان سے ابوسلمہ نے بیان کیا ‘ اور ان سے اعرج نے بیان کیا ( دوسری سند ) اور ہم سے اسماعیل نے بیان کیا ‘ انہوں نے کہا مجھ سے میرے بھائی نے بیان کیا ‘ ان سے سلیمان نے بیان کیا ‘ ان سے محمد بن ابی عتیق نے بیان کیا ‘  ان سے ابوسلمہ بن عبدالرحمٰن اور سعید بن مسیب نے بیان کیا کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا إِبْرَاهِيمُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَالأَعْرَجِ،‏.‏ وَحَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ أَبِي عَتِيقٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَسَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ اسْتَبَّ رَجُلٌ مِنَ الْمُسْلِمِينَ وَرَجُلٌ مِنَ الْيَهُودِ فَقَالَ الْمُسْلِمُ وَالَّذِي اصْطَفَى مُحَمَّدًا عَلَى الْعَالَمِينَ فِي قَسَمٍ يُقْسِمُ بِهِ، فَقَالَ الْيَهُودِيُّ وَالَّذِي اصْطَفَى مُوسَى عَلَى الْعَالَمِينَ، فَرَفَعَ الْمُسْلِمُ يَدَهُ عِنْدَ ذَلِكَ فَلَطَمَ الْيَهُودِيَّ، فَذَهَبَ الْيَهُودِيُّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ بِالَّذِي كَانَ مِنْ أَمْرِهِ وَأَمْرِ الْمُسْلِمِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تُخَيِّرُونِي عَلَى مُوسَى، فَإِنَّ النَّاسَ يَصْعَقُونَ يَوْمَ الْقِيَامَةِ فَأَكُونُ أَوَّلَ مَنْ يُفِيقُ، فَإِذَا مُوسَى بَاطِشٌ بِجَانِبِ الْعَرْشِ، فَلاَ أَدْرِي أَكَانَ فِيمَنْ صَعِقَ فَأَفَاقَ قَبْلِي أَوْ كَانَ مِمَّنِ اسْتَثْنَى اللَّهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7163,
                "hadithNumber": "7473",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Ad-Dajjal will come to Medina and find the angels guarding it. If Allah will, neither Ad-Dajjal nor plague will be able to come near it.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا دجال مدینہ تک آئے گا لیکن دیکھے گا کہ فرشتہ اس کی حفاظت کر رہے ہیں پس نہ تو دجال اس سے قریب ہو سکے گا اور نہ طاعون ‘ اگر اللہ نے چاہا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابی عیسیٰ نے بیان کیا ‘ انہوں نے کہا ہم کو یزید بن ہارون نے خبر دی ‘ انہیں شعبہ نے خبر دی ‘ انہیں قتادہ نے اور انہیں انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ أَبِي عِيسَى، أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْمَدِينَةُ يَأْتِيهَا الدَّجَّالُ فَيَجِدُ الْمَلاَئِكَةَ يَحْرُسُونَهَا فَلاَ يَقْرَبُهَا الدَّجَّالُ وَلاَ الطَّاعُونُ إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7164,
                "hadithNumber": "7474",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"For every Prophet there is one invocation which is definitely fulfilled by Allah, and I wish, if Allah will, to keep my that (special) invocation as to be the intercession for my followers on the Day of Resurrection.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہر نبی کی ایک دعا قبول ہوتی ہے تو میں چاہتا ہوں اگر اللہ نے چاہا کہ اپنی دعا قیامت کے دن اپنی امت کی شفاعت کے لئے محفوظ رکھوں ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ انہوں نے کہا ہم کو شعیب نے خبر دی ‘ انہیں زہری نے ‘ ان سے ابوسلمہ ابن عبدالرحمٰن نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لِكُلِّ نَبِيٍّ دَعْوَةٌ، فَأُرِيدُ إِنْ شَاءَ اللَّهُ أَنْ أَخْتَبِيَ دَعْوَتِي شَفَاعَةً لأُمَّتِي يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7165,
                "hadithNumber": "7475",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"While I was sleeping, I saw myself (in a dream) standing by a well. I drew from it as much water as Allah wished me to draw, and then Ibn Quhafa (Abu Bakr) رضی اللہ عنہ took the bucket from me and drew one or two buckets, and there was weakness in his drawing----may Allah forgive him! Then `Umar رضی اللہ عنہ took the bucket which turned into something like a big drum. I had never seen a powerful man among the people working as perfectly and vigorously as he did. (He drew so much water that) the people drank to their satisfaction and watered their camels that knelt down there. (See Hadith No. 16, Vol. 5)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میں سویا ہوا تھا کہ میں نے اپنے آپ کو ایک کنویں پر دیکھا ۔ پھر میں نے جنتا اللہ تعالیٰ نے چاہا اس میں سے پانی نکا لا ۔ اس کے بعد ابوبکر بن ابی قحافہ رضی اللہ عنہ نے ڈول لے لیااور انہوں نے بھی ایک دو ڈول پانی نکا لا البتہ ان کے کھینچنے میں کمزوری تھی اور اللہ انہیں معاف کرے ۔ پھر عمر رضی اللہ عنہ نے اسے لے لیا اور وہ ان کے ہاتھ میں ایک بڑا ڈول بن گیا ۔ میں نے کسی قوی و بہادر کو اس طرح ڈول پر ڈول نکالتے نہیں دیکھا ‘ یہاں تک کہ لوگوں نے ان کے چاروں طرف مویشیوں کے لیے باڑیں بنا لیں ۔",
                "urduNarrator": "ہم سے یسرہ بن صفوان بن جمیل : اللحمی نے بیان کیا ‘ کہا ہم سے ابراہیم بن سعد نے بیان کیا ‘ ان سے زہری نے ‘ ان سے سعید بن مسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا يَسَرَةُ بْنُ صَفْوَانَ بْنِ جَمِيلٍ اللَّخْمِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي عَلَى قَلِيبٍ فَنَزَعْتُ مَا شَاءَ اللَّهُ أَنْ أَنْزِعَ، ثُمَّ أَخَذَهَا ابْنُ أَبِي قُحَافَةَ فَنَزَعَ ذَنُوبًا أَوْ ذَنُوبَيْنِ وَفِي نَزْعِهِ ضَعْفٌ، وَاللَّهُ يَغْفِرُ لَهُ، ثُمَّ أَخَذَهَا عُمَرُ فَاسْتَحَالَتْ غَرْبًا، فَلَمْ أَرَ عَبْقَرِيًّا مِنَ النَّاسِ يَفْرِي فَرِيَّهُ، حَتَّى ضَرَبَ النَّاسُ حَوْلَهُ بِعَطَنٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7166,
                "hadithNumber": "7476",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "Whenever a beggar or a person in need of something came to the Prophet (ﷺ) , he used to say (to his companions), \"Intercede (for him) and you will be rewarded for that, and Allah will fulfill what He will through His Apostle's tongue.\"",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم کے پاس کوئی مانگنے والا آتا یا کوئی ضرور ت مند آتا تو آپ فرماتے کہ اس کی سفارش کرو تاکہ تمہیں بھی ثواب ملے ۔ اللہ اپنے رسول کی زبان پر وہی جاری کرتا ہے جو چاہتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن العلاء نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ ان سے برید نے ‘ ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَتَاهُ السَّائِلُ ـ وَرُبَّمَا قَالَ جَاءَهُ السَّائِلُ ـ أَوْ صَاحِبُ الْحَاجَةِ قَالَ ‏ \"‏ اشْفَعُوا فَلْتُؤْجَرُوا، وَيَقْضِي اللَّهُ عَلَى لِسَانِ رَسُولِهِ مَا شَاءَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7167,
                "hadithNumber": "7477",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"None of you should say: 'O Allah! Forgive me if You wish,' or 'Bestow Your Mercy on me if You wish,' or 'Provide me with means of subsistence if You wish,' but he should be firm in his request, for Allah does what He will and nobody can force Him (to do anything).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کوئی شخص اس طرح دعا نہ کرے کہ اے اللہ ! اگر تو چاہے تو میری مغفرت کر ‘ اگر تو چاہے تو مجھ پر رحم کر ‘ اگر تو چاہے تو مجھے روزی دے ۔ بلکہ پختگی کے ساتھ سوال کرنا چاہئیے کیونکہ اللہ جو چاہتا ہے کرتا ہے کوئی اس پر جبر کرنے والا نہیں ۔",
                "urduNarrator": "ہم سے یحییٰ نے بیان کیا ‘ انہوں نے کہا ہم سے عبدالرزاق نے بیان کیا ‘ ان سے معمر نے ‘ ان سے ہمانے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، سَمِعَ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَقُلْ أَحَدُكُمُ اللَّهُمَّ اغْفِرْ لِي إِنْ شِئْتَ، ارْحَمْنِي إِنْ شِئْتَ، ارْزُقْنِي إِنْ شِئْتَ، وَلْيَعْزِمْ مَسْأَلَتَهُ، إِنَّهُ يَفْعَلُ مَا يَشَاءُ، لاَ مُكْرِهَ لَهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7168,
                "hadithNumber": "7478",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "He differed with Al-Hurr bin Qais bin Hisn Al-Fazari about the companion of Moses, (i.e., whether he was Kha,dir or not). Ubai bin Ka`b Al-Ansari passed by them and Ibn `Abbas رضی اللہ عنہما called him saying, 'My friend (Hur) and I have differed about Moses' Companion whom Moses asked the way to meet. Did you hear Allah's Messenger (ﷺ) mentioning anything about him?\" Ubai said, \"Yes, I heard Allah's Apostle saying, \"While Moses was sitting in the company of some Israelites a man came to him and asked, 'Do you know Someone who is more learned than you (Moses)?' Moses said, 'No.' So Allah sent the Divine inspiration to Moses:-- 'Yes, Our Slave Khadir is more learned than you' Moses asked Allah how to meet him ( Khadir) So Allah made the fish as a sign for him and it was said to him, 'When you lose the fish, go back (to the place where you lose it) and you will meet him.' So Moses went on looking for the sign of the fish in the sea. The boy servant of Moses (who was accompanying him) said to him, 'Do you remember (what happened) when we betook ourselves to the rock? I did indeed forget to tell you (about) the fish. None but Satan made me forget to tell you about it' (18.63) Moses said: 'That is what we have been seeking.\" Sa they went back retracing their footsteps. (18.64). So they both found Kadir (there) and then happened what Allah mentioned about them (in the Qur'an)!' (See 18.60- 82)",
                "hadithUrdu": "وہ اور حربن قیس بن حصین الفزاری موسیٰ علیہ السلام کے ساتھی کے بارے میں اختلا ف کر رہے تھے کہ کیا وہ خضر علیہ السلام ہی تھے ۔ اتنے میں ابی بن کعب رضی اللہ عنہ کا ادھر سے گزر ہوا اور ابن عباس رضی اللہ عنہما نے انہیں بلایا اور ان سے کہا کہ میں اور میرا یہ ساتھی اس بارے میں شک میں ہیں کہ موسیٰ علیہ السلام کے وہ ” صاحب “ کون تھے جن سے ملاقات کے لیے حضرت موسیٰ علیہ السلام نے راستہ پوچھا تھا ۔ کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے اس سلسلہ میں کوئی حدیث سنی ہے انہوں نے کہا کہ ہاں ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ۔ آپ نے فرمایا کہ موسیٰ علیہ السلام بنی اسرائیل کے ایک مجمع میں تھے کہ ایک شخص نے آ کر پوچھا کیا آپ کسی ایسے شخص کو جانتے ہیں جو آپ سے زیادہ علم رکھتا ہو ؟ موسیٰ علیہ السلام نے کہا کہ نہیں ۔ چنانچہ آپ پر وحی نازل ہوئی کہ کیوں نہیں ہمارا بندہ خضر ہے ۔ موسیٰ علیہ السلام نے ان سے ملاقات کا راستہ معلوم کیا اور اللہ تعالیٰ نے اس کے لیے مچھلی کو نشان قرار دیا اور آپ سے کہا گیا کہ جب تم مچھلی کو گم پاؤ تو لوٹ جا کہ وہیں ان سے ملاقات ہو گی ۔ چنانچہ موسیٰ علیہ السلام مچھلی کا نشان دریا میں ڈھونڈنے لگے اور آپ کے ساتھی نے آپ کو بتایا کہ آپ کو معلوم ہے ۔ جب ہم نے چٹان پر ڈیرہ ڈالا تھا تو وہیں میں مچھلی بھول گیا اور مجھے شیطان نے اسے بھلا دیا ۔ موسیٰ علیہ السلام نے کہا کہ یہ جگہ وہی ہے جس کی تلاش میں ہم سر گرداں ہیں پس وہ دونوں اپنے قدموں کے نشانوں پر واپس لوٹے اور انہوں نے حضرت خضر علیہ السلام کو پا لیا ان ہی دونوں کا یہ قصہ ہے جو اللہ نے بیان فرمایا ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ‘ انہوں نے کہا ہم سے ابو حفص عمرو نے بیان کیا ‘ ان سے اوزاعی نے بیان کیا ان سے ابن شہاب نے بیا کیا ‘ ان سے عبیداللہ بن عبداللہ بن عقبہ بن مسعود نے بیان کیا اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو حَفْصٍ، عَمْرٌو حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ تَمَارَى هُوَ وَالْحُرُّ بْنُ قَيْسِ بْنِ حِصْنٍ الْفَزَارِيُّ فِي صَاحِبِ مُوسَى أَهُوَ خَضِرٌ، فَمَرَّ بِهِمَا أُبَىُّ بْنُ كَعْبٍ الأَنْصَارِيُّ، فَدَعَاهُ ابْنُ عَبَّاسٍ فَقَالَ إِنِّي تَمَارَيْتُ أَنَا وَصَاحِبِي هَذَا فِي صَاحِبِ مُوسَى الَّذِي سَأَلَ السَّبِيلَ إِلَى لُقِيِّهِ، هَلْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ شَأْنَهُ قَالَ نَعَمْ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ بَيْنَا مُوسَى فِي مَلإِ بَنِي إِسْرَائِيلَ إِذْ جَاءَهُ رَجُلٌ فَقَالَ هَلْ تَعْلَمُ أَحَدًا أَعْلَمَ مِنْكَ فَقَالَ مُوسَى لاَ‏.‏ فَأُوحِيَ إِلَى مُوسَى بَلَى عَبْدُنَا خَضِرٌ‏.‏ فَسَأَلَ مُوسَى السَّبِيلَ إِلَى لُقِيِّهِ، فَجَعَلَ اللَّهُ لَهُ الْحُوتَ آيَةً وَقِيلَ لَهُ إِذَا فَقَدْتَ الْحُوتَ فَارْجِعْ فَإِنَّكَ سَتَلْقَاهُ‏.‏ فَكَانَ مُوسَى يَتْبَعُ أَثَرَ الْحُوتِ فِي الْبَحْرِ فَقَالَ فَتَى مُوسَى لِمُوسَى أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ وَمَا أَنْسَانِيهِ إِلاَّ الشَّيْطَانُ أَنْ أَذْكُرَهُ، قَالَ مُوسَى ذَلِكَ مَا كُنَّا نَبْغِي، فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا فَوَجَدَا خَضِرًا، وَكَانَ مِنْ شَأْنِهِمَا مَا قَصَّ اللَّهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7169,
                "hadithNumber": "7479",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If Allah wills, tomorrow we will encamp in Khaif Bani Kinana, the place where the pagans took the oath of Kufr (disbelief) against the Prophet. He meant Al-Muhassab. (See Hadith 1589)",
                "hadithUrdu": "آپ نے ( حجۃ الوداع کے موقع پر ) فرمایا کہ ہم کل ان شاء للہ خیف بنو کنانہ میں قیام کریں گے جہاں ایک زمانہ میں کفار مکہ نے کفری ہی پرقائم رہنے کی آپس میں قسمیں کھائیں تھیں آپ کی مراد وادی محصب سے تھی ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم سے شعیب نے بیان کیا، وہ زہری کی سند سے، اورانہوں نے کہا ہم سے ابن وہب نے بیان کیا ‘ انہوں نے کہا مجھ کو یونس نے ابن شہاب سے خبر دی ‘ انہوں نے ابوسلمہ بن عبدالرحمٰن سے ‘ انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کیا ‘ انہوں نے حضرت رسول کریم صلی اللہ علیہ وسلم سے روایت کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ،‏.‏ وَقَالَ أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ نَنْزِلُ غَدًا إِنْ شَاءَ اللَّهُ بِخَيْفِ بَنِي كِنَانَةَ حَيْثُ تَقَاسَمُوا عَلَى الْكُفْرِ ‏\"‏‏.‏ يُرِيدُ الْمُحَصَّبَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7170,
                "hadithNumber": "7480",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) besieged the people of Ta'if, but he did not conquer it. He said, \"Tomorrow, if Allah will, we will return home. On this the Muslims said, \"Then we return without conquering it?\" He said, 'Then carry on fighting tomorrow.\" The next day many of them were injured. The Prophet (ﷺ) said, \"If Allah will, we will return home tomorrow.\" It seemed that statement pleased them whereupon Allah's Apostle smiled.",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے طائف والوں کو گھیر لیا ‘ اس کو فتح نہیں کیا ۔ آخر آپ نے فرمایا کل خدا نے چاہا تو ہم مدینہ کو لوٹ چلیں گے ۔ اس پر مسلمان بولے واہ ہم فتح کئے بغیر لوٹ جائیں ۔ آپ نے فرمایا ایسا ہے تو پھر کل سویرے لڑائی شروع کرو ۔ صبح کو مسلمان لڑنے لگے لیکن ( قلع فتح نہیں ہوا ) مسلمان زخمی ہوئے ۔ پھر آپ نے فرمایا صبح کو اللہ نے چاہا تو ہم مدینہ لوٹ چلیں گے ۔ اس پر مسلمان خوش ہوئے ۔ مسلمانوں کا یہ حال دیکھ کر آنحضرت صلی اللہ علیہ وسلم مسکرائے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے ‘ انہوں نے عمرو بن دینار سے ‘ انہوں نے ابو العاس ( سائب بن فروخ ) سے ‘ انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے ‘ انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ أَبِي الْعَبَّاسِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ حَاصَرَ النَّبِيُّ صلى الله عليه وسلم أَهْلَ الطَّائِفِ فَلَمْ يَفْتَحْهَا فَقَالَ ‏\"‏ إِنَّا قَافِلُونَ إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ فَقَالَ الْمُسْلِمُونَ نَقْفُلُ وَلَمْ نَفْتَحْ‏.‏ قَالَ ‏\"‏ فَاغْدُوا عَلَى الْقِتَالِ ‏\"‏‏.‏ فَغَدَوْا فَأَصَابَتْهُمْ جِرَاحَاتٌ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّا قَافِلُونَ غَدًا إِنْ شَاءَ اللَّهُ ‏\"‏، فَكَأَنَّ ذَلِكَ أَعْجَبَهُمْ فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7171,
                "hadithNumber": "7481",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"When Allah ordains something on the Heaven the angels beat with their wings in obedience to His Statement which sounds like that of a chain dragged over a rock. Ali and many other people said: '' صَفْوَانٍ '' (clear rock): He then issue this commad amongst the Angels. So, when the fear of their hearts melts, they say: What did your Lord enjoin? They reply: The truth, and he is the most High, the most Great. Ikrimah has repored it from Hadrat Abu Hurairah رضی اللہ عنہ . Ali said to Sufyan: Has Ikrimah heard from Hadrat Abu Hurairah رضی اللہ عنہ? He replied: Yes! I said to Sufyan; A man, it back to the prophet, says that Amr (bin Dinaar) with reference to Ikrimah that Hadrat Abu Hurairah رضی اللہ عنہ has read '' فُزِّعَ‏ '' . Sufyan states that Amr (bin Dinaar) has also read the same, but I don't know whether he has or has not heard so. Sufyan says: It is same in our mode of recitation.The Prophet (ﷺ) said, \"When Allah ordains something on the Heaven the angels beat with their wings in obedience to His Statement which sounds like that of a chain dragged over a rock. Ali and many other people said: '' صَفْوَانٍ '' (clear rock): He then issue this commad amongst the Angels. So, when the fear of their hearts melts, they say: What did your Lord enjoin? They reply: The truth, and he is the most High, the most Great. Ikrimah has repored it from Hadrat Abu Hurairah رضی اللہ عنہ . Ali said to Sufyan: Has Ikrimah heard from Hadrat Abu Hurairah رضی اللہ عنہ? He replied: Yes! I said to Sufyan; A man, it back to the prophet, says that Amr (bin Dinaar) with reference to Ikrimah that Hadrat Abu Hurairah رضی اللہ عنہ has read '' فُزِّعَ‏ '' . Sufyan states that Amr (bin Dinaar) has also read the same, but I don't know whether he has or has not heard so. Sufyan says: It is same in our mode of recitation.",
                "hadithUrdu": "آپ نے فرمایا جب اللہ تعالیٰ آسمان میں کوئی فیصلہ کرتا ہے تو فرشتے اس کے فرمان کے آگے عاجزی کا اظہار کرنے کے لئے اپنے بازو مارتے ہیں ( اور ان سے ایسی آواز نکلتی ہے ) جیسے پتھر پر زنجیر ماری گئی ہو علی بن عبداللہ مدینی نے کہا سفیان کے سوا دوسرے راویوں نے اس حدیث میں بجائے صفوان کے بہ فتحہ فاصفوان روایت کیا ہے اور ابوسفیان نے صفوان پر سکون فاء روایت کیا ہے دونوں کے معنی ایک ہی ہیں یعنی چکنا صاف پتھر اور ابن عامر نے فزع بہ صیغہ معروف پڑھا ہے ۔ بعضوں نے فرغ رائے مہملہ سے پڑھا ہے یعنی جب ان کے دلوں کو فراغت حاصل ہو جاتی ہے ۔ مطلب وہی ہے کہ ڈر جاتا رہا ہے پھر وہ حکم فرشتوں میں آتا ہے اور جب ان کے دلوں سے خوف دور ہو جاتا ہے تو وہ پوچھتے ہیں کہ تمہارے رب کے کیا کہا ؟ جواب دیتے ہیں کہ حق ‘ اللہ وہ بلند وعظیم ہے ۔ اور علی نے بیان کیا، ان سے سفیان نے ، ان سے عمرو نے، ان سے عکرمہ نے اور ان سے ابو ہریرہ  رضی اللہ عنہ نے یہی حدیث بیان کی کہ سفیان بن عیینہ نے بیان کیا، ان سے عمرو نے بیان کیا ، انہوں نے عکرمہ سے سنا اور ان سے ابو ہریرہ بنی اللہ نے بیان کیا، علی بن عبد اللہ مدینی نے کہا کہ میں نے سفیان بن عیینہ سے پوچھا کہ انہوں نے کہا کہ میں نے عکرمہ سے سنا، انہوں نے کہا کہ میں نے ابو ہریرہ  رضی اللہ عنہ بھی تیری سے سنا تو سفیان بن عیینہ نے اس کی تصدیق کی ۔ علی نے کہا میں نے سفیان بن عیینہ سے پوچھا کہ ایک شخص نے عمرو سے روایت کی ، انہوں نے عکرمہ سے اور انہوں نے ابو ہریرہ ہی ان سے بحوالہ رسول اللہ صلی اللہ علیہ وسلم  کے کہ آپ نے ” قزع“ پڑھا۔ سفیان بن عیینہ نے کہا کہ عمرو بن دینار رضی اللہ عنہ  نے بھی اسی طرح پڑھا تھا، مجھے معلوم نہیں کہ انہوں نے اسی طرح ان سے سنا تھا یا نہیں ۔ سفیان نے کہا کہ یہی ہماری قراءت ہے۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘کہا ہم سے سفیان بن عیینہ نے ‘ ان سے عمرو بن مرہ نے ‘ ان سے عکرمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے نقل کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا قَضَى اللَّهُ الأَمْرَ فِي السَّمَاءِ ضَرَبَتِ الْمَلاَئِكَةُ بِأَجْنِحَتِهَا خُضْعَانًا لِقَوْلِهِ، كَأَنَّهُ سِلْسِلَةٌ عَلَى صَفْوَانٍ ـ قَالَ عَلِيٌّ وَقَالَ غَيْرُهُ صَفَوَانٍ ـ يَنْفُذُهُمْ ذَلِكَ، فَإِذَا فُزِّعَ عَنْ قُلُوبِهِمْ قَالُوا مَاذَا قَالَ رَبُّكُمْ قَالُوا الْحَقَّ وَهُوَ الْعَلِيُّ الْكَبِيرُ ‏\"‏‏.‏ قَالَ عَلِيٌّ وَحَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرٌو، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ، بِهَذَا‏.‏ قَالَ سُفْيَانُ قَالَ عَمْرٌو سَمِعْتُ عِكْرِمَةَ، حَدَّثَنَا أَبُو هُرَيْرَةَ،‏.‏ قَالَ عَلِيٌّ قُلْتُ لِسُفْيَانَ قَالَ سَمِعْتُ عِكْرِمَةَ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، قَالَ نَعَمْ‏.‏ قُلْتُ لِسُفْيَانَ إِنَّ إِنْسَانًا رَوَى عَنْ عَمْرٍو عَنْ عِكْرِمَةَ عَنْ أَبِي هُرَيْرَةَ يَرْفَعُهُ أَنَّهُ قَرَأَ فُزِّعَ‏.‏ قَالَ سُفْيَانُ هَكَذَا قَرَأَ عَمْرٌو فَلاَ أَدْرِي سَمِعَهُ هَكَذَا أَمْ لاَ، قَالَ سُفْيَانُ وَهْىَ قِرَاءَتُنَا‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏وَلاَ تَنْفَعُ الشَّفَاعَةُ عِنْدَهُإِلاَّ لِمَنْ أَذِنَ لَهُ حَتَّى إِذَا فُزِّعَ عَنْ قُلُوبِهِمْ قَالُوا مَاذَا قَالَ رَبُّكُمْ قَالُوا الْحَقَّ وَهُوَ الْعَلِيُّ الْكَبِيرُ}",
                "headingUrdu": "’’اس کے پاس شفاعت نفع نہیں دیتی، سوائے اس کے جسے وہ اجازت دے‘‘۔",
                "headingEnglish": "“Intercession with Him profits not, except for him whom He permits….’",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7172,
                "hadithNumber": "7482",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Allah never listens to anything as He listens to the Prophet (ﷺ) reciting Qur'an in a pleasant sweet sounding voice.\" A companion of Abu Huraira رضی اللہ عنہ said, \"He means, reciting the Qur'an aloud.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ کسی بات کو اتنا متوجہ ہو کر نہیں سنتا جتنا نبی کریم صلی اللہ علیہ وسلم کا قرآن پڑھنا متوجہ ہو کر سنتا ہے جو خوش آوازی سے اس کو پڑھتا ہے ۔ ابوہریرہ رضی اللہ عنہ کے ایک ساتھی نے کہا اس حدیث میں یتغنیٰ بالقرآن کا یہ معنی ہے کہ اس کو پکار کر پڑھتا ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے ‘ ان سے عقیل نے ‘ ان سے ابن شہاب نے اور ان کو ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا أَذِنَ اللَّهُ لِشَىْءٍ مَا أَذِنَ لِلنَّبِيِّ صلى الله عليه وسلم يَتَغَنَّى بِالْقُرْآنِ ‏\"‏‏.‏ وَقَالَ صَاحِبٌ لَهُ يُرِيدُ أَنْ يَجْهَرَ بِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7173,
                "hadithNumber": "7483",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah will say (on the Day of Resurrection), 'O Adam!' Adam will reply, 'Labbaik wa Sa`daik! ' Then a loud Voice will be heard (Saying) 'Allah Commands you to take out the mission of the Hell Fire from your offspring.' \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ فرمائے گا اے آدم ! وہ کہیں گے ” لبیک وسعدیک “ پھر بلند آواز سے ندا دے گا کہ اللہ تمہیں حکم دیتا ہے کہ اپنی نسل میں سے دوزخ کا لشکر نکال ۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ‘ انہوں نے کہا ہم سے ہمارے والد نے بیان کیا ‘ انہوں نے کہا ہم سے اعمش نے بیان کیا ‘ ان سے ابوصالح نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَقُولُ اللَّهُ يَا آدَمُ‏.‏ فَيَقُولُ لَبَّيْكَ وَسَعْدَيْكَ‏.‏ فَيُنَادَى بِصَوْتٍ إِنَّ اللَّهَ يَأْمُرُكَ أَنْ تُخْرِجَ مِنْ ذُرِّيَّتِكَ بَعْثًا إِلَى النَّارِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7174,
                "hadithNumber": "7484",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I never felt so jealous of any woman as I felt of Khadija رضی اللہ عنہا , for Allah ordered him (the Prophet (ﷺ) ) to give Khadija the glad tidings of a palace in Paradise (for her).",
                "hadithUrdu": "جس قدر مجھے خدیجہ رضی اللہ عنہ پر غیرت آتی تھی اور کسی عورت پر نہیں آتی تھی اور ان کے رب نے حکم دیا تھا کہ نہیں جنت میں ایک گھر کی بشارت دے دیں ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ ان سے ہشام نے ‘ ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا غِرْتُ عَلَى امْرَأَةٍ مَا غِرْتُ عَلَى خَدِيجَةَ، وَلَقَدْ أَمَرَهُ رَبُّهُ أَنْ يُبَشِّرَهَا بِبَيْتٍ فِي الْجَنَّةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7175,
                "hadithNumber": "7485",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If Allah loves a person, He calls Gabriel, saying, 'Allah loves so and so, O Gabriel love him' So Gabriel would love him and then would make an announcement in the Heavens: 'Allah has loved so and-so therefore you should love him also.' So all the dwellers of the Heavens would love him, and then he is granted the pleasure of the people on the earth.\" (See Hadith No. 66, Vol. 8)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب اللہ تعالیٰ کسی بندہ سے محبت کرتا ہے تو جبرائیل علیہ السلام کو آواز دیتا ہے کہ اللہ فلاں سے محبت کرتا ہے تم بھی اس سے محبت کرو ۔ چنانچہ جبرائیل علیہ السلام بھی اس سے محبت کرتے ہیں ۔ پھر وہ آسمان میں آواز دیتے ہیں کہ اللہ فلاں سے محبت کرتا ہے تم بھی اس سے محبت کرو چنانچہ اہل آسمان بھی اس سے محبت کرنے لگتے ہیں اور اس طرح روئے زمین میں بھی اسے مقبولیت حاصل ہو جاتی ہے ۔",
                "urduNarrator": "مجھ سے اسحاق نے بیان کیا ‘ انہوں نے کہا ہم سے عبدالصمد نے بیان کے ‘ کہا ہم سے عبدالرحمٰن ابن عبداللہ بن دینار نے بیان کیا‘ان سے ان کے والد نے ‘ ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ ـ هُوَ ابْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ ـ عَنْ أَبِيهِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى إِذَا أَحَبَّ عَبْدًا نَادَى جِبْرِيلَ إِنَّ اللَّهَ قَدْ أَحَبَّ فُلاَنًا فَأَحِبَّهُ فَيُحِبُّهُ جِبْرِيلُ، ثُمَّ يُنَادِي جِبْرِيلُ فِي السَّمَاءِ إِنَّ اللَّهَ قَدْ أَحَبَّ فُلاَنًا فَأَحِبُّوهُ، فَيُحِبُّهُ أَهْلُ السَّمَاءِ وَيُوضَعُ لَهُ الْقَبُولُ فِي أَهْلِ الأَرْضِ ‏\"‏‏.‏",
                "headingArabic": "كَلاَمِ الرَّبِّ مَعَ جِبْرِيلَ وَنِدَاءِ اللَّهِ الْمَلاَئِكَةَ",
                "headingUrdu": "جبرائیل کے ساتھ رب کی گفتگو اور فرشتوں کے لیے اللہ کی پکار",
                "headingEnglish": "The Talk of the Lord with Jibril and Allah’s Call for the angels",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7176,
                "hadithNumber": "7486",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"There are angels coming to you in succession at night, and others during the day, and they all gather at the time of `Asr and Fajr prayers. Then the angels who have stayed with you overnight ascend (to the heaven) and He (Allah) asks them though He perfectly knows their affairs. 'In what state have you left my slaves?' They say, 'When we left them, they were praying and when we came to them they were praying.' \"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا تمہارے پاس رات اور دن کے فرشتے یکے بعد دیگرے آتے ہیں اور عصر اور فجر کی نمازیوں میں دو وقت کے فرشتے اکٹھے ہوتے ہیں ۔ پھر جب وہ فرشتے اوپر جاتے ہیں جنہوں نے رات تمہارے ساتھ گزاری ہے تو اللہ تعالیٰ ان سے پوچھتا ہے حالانکہ وہ بندوں کے احوال کا سب سے زیادہ جاننے والا ہے کہ تم نے میرے بندوں کو کس حال میں چھوڑ ا ؟ وہ جواب دیتے ہیں کہ ہم نے انہیں اس حال میں چھوڑا کہ وہ نماز پڑھ رہے تھے اور جب ہم ان کے پاس گئے جب بھی وہ نماز پڑھ رہے تھے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ ان سے مالک نے ‘ ان سے ابوالزناد نے ‘ ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ يَتَعَاقَبُونَ فِيكُمْ مَلاَئِكَةٌ بِاللَّيْلِ وَمَلاَئِكَةٌ بِالنَّهَارِ، وَيَجْتَمِعُونَ فِي صَلاَةِ الْعَصْرِ وَصَلاَةِ الْفَجْرِ، ثُمَّ يَعْرُجُ الَّذِينَ بَاتُوا فِيكُمْ فَيَسْأَلُهُمْ وَهْوَ أَعْلَمُ كَيْفَ تَرَكْتُمْ عِبَادِي فَيَقُولُونَ تَرَكْنَاهُمْ وَهُمْ يُصَلُّونَ، وَأَتَيْنَاهُمْ وَهُمْ يُصَلُّونَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7177,
                "hadithNumber": "7487",
                "englishNarrator": "Narrated Abu Dharr رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, Gabriel came to me and gave me the glad tidings that anyone who died without worshipping anything besides Allah, would enter Paradise. I asked (Gabriel), 'Even if he committed theft, and even if he committed illegal sexual intercourse?' He said, '(Yes), even if he committed theft, and even if he Committed illegal sexual intercourse.\"",
                "hadithUrdu": "نبی کریم نے فرمایا میرے پاس جبرائیل علیہ السلام آئے اور مجھے بشارت دی کہ جو شخص اس حال میں مرے گا کہ وہ اللہ کے ساتھ کسی کو شریک نہیں ٹہرا تا ہو گا تو وہ جنت میں جائے گا ۔ میں نے پوچھا گو اس نے چوری اور زنا بھی کی ہو ؟ فرمایا کہ گو اس نے چوری اور زنا کی ہو ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ‘ کہا ہم سے غندر نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے واصل نے بیان کیا ‘ ان سے معرور نے بیان کیا کہ میں نے ابوذر رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ وَاصِلٍ، عَنِ الْمَعْرُورِ، قَالَ سَمِعْتُ أَبَا ذَرٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ أَتَانِي جِبْرِيلُ فَبَشَّرَنِي أَنَّهُ مَنْ مَاتَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ قُلْتُ وَإِنْ سَرَقَ وَإِنْ زَنَى قَالَ ‏\"‏ وَإِنْ سَرَقَ وَإِنْ زَنَى ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7178,
                "hadithNumber": "7488",
                "englishNarrator": "Narrated Al-Bara' bin `Azib رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"O so-and-so, whenever you go to your bed (for sleeping) say, 'O Allah! I have surrendered myself over to you and have turned my face towards You, and leave all my affairs to You and depend on You and put my trust in You expecting Your reward and fearing Your punishment. There is neither fleeing from You nor refuge but with You. I believe in the Book (Qur'an) which You have revealed and in Your Prophet (Muhammad) whom You have sent.' If you then die on that night, then you will die as a Muslim, and if you wake alive in the morning then you will receive the reward.\" (See Hadith No. 323, Vol. 8)",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا اے فلان ! جب تم اپنے بستر پر جاؤ تو یہ دعا کرو ” اے اللہ ! میں نے اپنی جاؤ تیرے سپر د کر دی اور اپنا رخ تیری طرف موڑدیا اور اپنا معاملہ تیرے سپر د کر دیا اور تیری پناہ لی ‘ تیری طرف رغبت کی وجہ سے اور تجھ سے ڈر کر ۔ تیرے سوا کوئی پنا ہ اور نجات کی جگہ نہیں ‘ میں تیری کتاب پر ایمان لایا جو تو نے نازل کی اور تیرے نبی پر ایمان لایا جو تو نے بھیجے ۔ پس اگر تم آج رات مرگئے تو فطر ت پر مر و گے اور صبح کو زندہ اٹھے تو ثواب ملے گا ۔ “",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘انہوں نے کہا ہم سے ابوالاحوص نے بیان کیا ‘ انہوں نے کہا ہم سے ابواسحاق ہمدانی نے بیان کیا ‘ ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، حَدَّثَنَا أَبُو إِسْحَاقَ الْهَمْدَانِيُّ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَا فُلاَنُ إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَقُلِ اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ‏.‏ فَإِنَّكَ إِنْ مُتَّ فِي لَيْلَتِكَ مُتَّ عَلَى الْفِطْرَةِ، وَإِنْ أَصْبَحْتَ أَصَبْتَ أَجْرًا ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏أَنْزَلَهُ بِعِلْمِهِ وَالْمَلاَئِكَةُيَشْهَدُونَ}",
                "headingUrdu": "’’اس نے اپنے علم کے ساتھ نازل کیا ہے اور فرشتے گواہی دیتے ہیں‘‘۔",
                "headingEnglish": "“…He has sent it down with His Knowledge, and the angels bear witness….”",
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7179,
                "hadithNumber": "7489",
                "englishNarrator": "Narrated `Abdullah bin Abi `Aufa رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said on the Day of (the battle of) the Clans, \"O Allah! The Revealer of the Holy Book, The Quick Taker of Accounts! Defeat the clans and shake them.\" Hadrat Abdullah bin Abi Aufa رضی اللہ عنہ heard it from the prophet ﷺ with addition.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے غزؤہ خندق کے دن فرمایا ۔ ” اے اللہ ! کتاب قرآن کے نازل کرنے والے ! جلد حساب لینے والے ! ان دشمن جماعتو ں کو شکست دے اور ان کے پاؤں ڈگمگا دے ۔ ” حمیدی نے اسے یوں روایت کیا کہ ہم سے سفیان بن عیینہ نے بیان کیا ‘ کہا ہم سے اسماعیل بن ابی خالد نے بیان کیا اور انہوں نے عبداللہ بن ابی اوفی رضی اللہ عنہ سے سنا ‘ کہا میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘کہا ہم سے سفیان نے بیان کیا ‘ ان سے اسماعیل بن ابی خالد نے ‘ ان سے عبداللہ بن ابی اوفی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ الأَحْزَابِ ‏ \"‏ اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيعَ الْحِسَابِ، اهْزِمِ الأَحْزَابَ وَزَلْزِلْ بِهِمْ ‏\"‏‏.‏ زَادَ الْحُمَيْدِيُّ حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ أَبِي خَالِدٍ، سَمِعْتُ عَبْدَ اللَّهِ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7180,
                "hadithNumber": "7490",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "(regarding the Verse):-- 'Neither say your prayer aloud, nor say it in a low tone.' (17.110) This Verse was revealed while Allah's Messenger (ﷺ) was hiding himself in Mecca, and when he raised his voice while reciting the Qur'an, the pagans would hear him and abuse the Qur'an and its Revealer and to the one who brought it. So Allah said:-- 'Neither say your prayer aloud, nor say it in a low tone.' (17.110) That is, 'Do not say your prayer so loudly that the pagans can hear you, nor say it in such a low tone that your companions do not hear you.' But seek a middle course between those (extremes), i.e., let your companions hear, but do not relate the Qur'an loudly, so that they may learn it from you.",
                "hadithUrdu": "یہ اس وقت نازل ہوئی جب رسول اللہ صلی اللہ علیہ وسلم مکہ میں چھپ کر عبادت کیا کرتے تھے ۔ جب آپ نمازمیں آوازبلند کرتے تو مشرکین سنتے اور قرآن مجید اور اس کے نازل کرنے والے اللہ کو اور اس کے لانے والے جبرائیل علیہ السلام کو گالی دیتے ( اور آنحضرت صلی اللہ علیہ وسلم کو بھی ) اسی لیے اللہ تعالیٰ نے فرمایا کہ ” اپنی نمازمیں نہ آواز بلند کرو اور نہ بالکل آہستہ یعنی آواز اتنی بلند بھی نہ کر کہ مشرکین سن لیں اور اتنی آہستہ بھی نہ کر کہ آپ رکے ساتھی بھی نہ سن سکیں بلکہ ان کے درمیان کا راستہ اختیار کر ۔ مطلب یہ ہے کہ اتنی آواز سے پڑھ کہ تیرے اصحاب سن لیں اور قرآن سیکھ لیں ‘ اس سے زیادہ چلا کر نہ پڑھ ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘ ان سے ہشیم بن بشیر نے ‘ ان سے ابی بشر نے ‘ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے سورۃ بنی اسرائیل کی آیت ولاتجھر بصلاتک ولا تخافت بھا “ کے بارے میں کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ هُشَيْمٍ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏وَلاَ تَجْهَرْ بِصَلاَتِكَ وَلاَ تُخَافِتْ بِهَا‏}‏ قَالَ أُنْزِلَتْ وَرَسُولُ اللَّهِ صلى الله عليه وسلم مُتَوَارٍ بِمَكَّةَ، فَكَانَ إِذَا رَفَعَ صَوْتَهُ سَمِعَ الْمُشْرِكُونَ فَسَبُّوا الْقُرْآنَ وَمَنْ أَنْزَلَهُ وَمَنْ جَاءَ بِهِ‏.‏ وَقَالَ اللَّهُ تَعَالَى ‏{‏وَلاَ تَجْهَرْ بِصَلاَتِكَ وَلاَ تُخَافِتْ بِهَا‏}‏ لاَ تَجْهَرْ بِصَلاَتِكَ حَتَّى يَسْمَعَ الْمُشْرِكُونَ، وَلاَ تُخَافِتْ بِهَا عَنْ أَصْحَابِكَ فَلاَ تُسْمِعُهُمْ ‏{‏وَابْتَغِ بَيْنَ ذَلِكَ سَبِيلاً‏}‏ أَسْمِعْهُمْ وَلاَ تَجْهَرْ حَتَّى يَأْخُذُوا عَنْكَ الْقُرْآنَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "99",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 99,
                    "chapterNumber": "99",
                    "chapterEnglish": "Oneness, Uniqueness of Allah (Tawheed)",
                    "chapterUrdu": "اللہ کی توحید اس کی ذات اور صفات کے بیان میں",
                    "chapterArabic": "كتاب التوحيد",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7151,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=286",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=284",
                "label": "284",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=285",
                "label": "285",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=286",
                "label": "286",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=287",
                "label": "287",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=288",
                "label": "288",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=289",
                "label": "289",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=290",
                "label": "290",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=288",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=288",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=286",
        "to": 7175,
        "total": 40465
    }
}