{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 216,
        "data": [
            {
                "id": 5378,
                "hadithNumber": "5614",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) used to like sweet edible things (syrup, etc.) and honey.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم شیرینی اور شہد کو دوست رکھتے تھے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، کہا کہ مجھے ہشام نے خبر دی ، انہیں ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ أَخْبَرَنِي هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعْجِبُهُ الْحَلْوَاءُ وَالْعَسَلُ‏.‏",
                "headingArabic": "شَرَابِ الْحَلْوَاءِ وَالْعَسَلِ",
                "headingUrdu": "میٹھی کھانے کی چیزوں اور شہد کا پینا",
                "headingEnglish": "The drinking of sweet edible things and honey",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5379,
                "hadithNumber": "5615",
                "englishNarrator": "Narrated An-Nazzal:",
                "hadithEnglish": "Ali رضی اللہ عنہ came to the gate of the courtyard (of the Mosque) and drank (water) while he was standing and said, \"Some people dislike to drink while standing, but I saw the Prophet (ﷺ) doing (drinking water) as you have seen me doing now.\"",
                "hadithUrdu": "وہ حضرت علی رضی اللہ عنہ کی خدمت میں مسجد کوفہ کے صحن میں حاضر ہوئے پھر حضرت علی رضی اللہ عنہ نے کھڑے ہو کر پیا اور کہا کہ کچھ لوگ کھڑے ہو کر پانی پینے کو مکروہ سمجھتے ہیں حالانکہ میں نے رسول اللہ صلی اللہ علیہی وسلم کو اس طرح کرتے دیکھا ہے جس طرح تم نے مجھے اس وقت کھڑے ہو کر پانی پیتے دیکھا ہے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے مسعر نے بیان کیا ، ان سے عبدالملک بن میسرہ نے ، ان سے نزال نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مِسْعَرٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ، عَنِ النَّزَّالِ، قَالَ أَتَى عَلِيٌّ ـ رضى الله عنه ـ عَلَى باب الرَّحَبَةِ، فَشَرِبَ قَائِمًا فَقَالَ إِنَّ نَاسًا يَكْرَهُ أَحَدُهُمْ أَنْ يَشْرَبَ وَهْوَ قَائِمٌ، وَإِنِّي رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم فَعَلَ كَمَا رَأَيْتُمُونِي فَعَلْتُ‏.‏",
                "headingArabic": "الشُّرْبِ قَائِمًا",
                "headingUrdu": "کھڑے ہوکر پینا",
                "headingEnglish": "To drink while standing",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5380,
                "hadithNumber": "5616",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "He offered the Zuhr prayer and then sat down in the wide courtyard (of the Mosque) of Kufa in order to deal with the affairs of the people till the `Asr prayer became due. Then water was brought to him and he drank of it, washed his face, hands, head and feet. Then he stood up and drank the remaining water while he was standing. and said, \"Some people dislike to drink water while standing thought the Prophet did as I have just done.\"",
                "hadithUrdu": "انہوں نے ظہر کی نماز پڑھی پھر مسجد کوفہ کے صحن میں لوگوں کی ضرورتوں کے لیے بیٹھ گئے ۔ اس عرصہ میں عصر کی نماز کا وقت آ گیا پھر ان کے پاس پانی لایا گیا ۔ انہوں نے پانی پیا اور اپنا چہرہ اور ہاتھ دھوئے ، ان کے سر اور پاؤں ( کے دھونے کا بھی ) ذکر کیا ۔ پھر انہوں نے کھڑے ہو کر وضو کا بچا ہوا پانی پیا ، اس کے بعد کہا کہ کچھ لوگ کھڑے ہو کر پانی پینے کو برا سمجھتے ہیں حالانکہ نبی کریم صلی اللہ علیہ وسلم نے یو نہی کیا تھا جس طرح میں نے کیا ۔ وضو کا پانی کھڑے ہو کر پیا ۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے عبدالملک بن میسرہ نے بیان کیا ، انہوں نے نزال بن سبرہ سے سنا ، وہ حضرت علی رضی اللہ عنہ سے بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مَيْسَرَةَ، سَمِعْتُ النَّزَّالَ بْنَ سَبْرَةَ، يُحَدِّثُ عَنْ عَلِيٍّ ـ رضى الله عنه ـ أَنَّهُ صَلَّى الظُّهْرَ ثُمَّ قَعَدَ فِي حَوَائِجِ النَّاسِ فِي رَحَبَةِ الْكُوفَةِ حَتَّى حَضَرَتْ صَلاَةُ الْعَصْرِ، ثُمَّ أُتِيَ بِمَاءٍ فَشَرِبَ وَغَسَلَ وَجْهَهُ وَيَدَيْهِ وَذَكَرَ رَأْسَهُ وَرِجْلَيْهِ، ثُمَّ قَامَ فَشَرِبَ فَضْلَهُ وَهْوَ قَائِمٌ ثُمَّ قَالَ إِنَّ نَاسًا يَكْرَهُونَ الشُّرْبَ قَائِمًا وَإِنَّ النَّبِيَّ صلى الله عليه وسلم صَنَعَ مِثْلَ مَا صَنَعْتُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5381,
                "hadithNumber": "5617",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) drank Zamzam (water) while standing.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے زمزم کا پانی کھڑے ہو کر پیا ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے عاصم احول نے ، ان سے شعبی نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ شَرِبَ النَّبِيُّ صلى الله عليه وسلم قَائِمًا مِنْ زَمْزَمَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5382,
                "hadithNumber": "5618",
                "englishNarrator": "Narrated Um Al-Fadl (daughter of Al-Harith):",
                "hadithEnglish": "She sent a bowl of milk to the Prophet (ﷺ) while he was standing (at `Arafat) in the afternoon of the Day of `Arafat. He took it in his hands and drank it. Narrated Abu Nadr: The Prophet was on the back of his camel. The report of Imam Maalik from Abu Nadr Adds: He ﷺ was on his camel.",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم کے لیے دودھ کا ایک پیالہ بھیجا میدان عرفات میں ۔ وہ عرفہ کے دن کی شام کا وقت تھا اور آنحضرت صلی اللہ علیہ وسلم ( اپنی سواری پر ) سوار تھے ، آپ نے اپنے ہاتھ میں وہ پیالہ لیا اور اسے پی لیا ۔ مالک نے ابو النضر سے اپنے اونٹ پر کے الفاظ زیادہ کئے ۔",
                "urduNarrator": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالعزیز بن ابی سلمہ نے بیان کیا ، کہا ہم کو ابو النضر نے خبر دی ، انہیں حضرت ابن عباس رضی اللہ عنہما کے غلام عمیر نے اور انہیں ام فضل بنت حارث نے کہ",
                "hadithArabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، أَخْبَرَنَا أَبُو النَّضْرِ، عَنْ عُمَيْرٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ، أَنَّهَا أَرْسَلَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم بِقَدَحِ لَبَنٍ، وَهُوَ وَاقِفٌ عَشِيَّةَ عَرَفَةَ، فَأَخَذَ بِيَدِهِ فَشَرِبَهُ‏.‏ زَادَ مَالِكٌ عَنْ أَبِي النَّضْرِ عَلَى بَعِيرِهِ‏.‏",
                "headingArabic": "مَنْ شَرِبَ وَهْوَ وَاقِفٌ عَلَى بَعِيرِهِ",
                "headingUrdu": "اونٹ کی پیٹھ پر پینا",
                "headingEnglish": "To drink while on the back of camel",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5383,
                "hadithNumber": "5619",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Milk mixed with water was brought to Allah's Messenger (ﷺ) while a bedouin was on his right and Abu Bakr رضی اللہ عنہ was on his left. He drank (of it) and then gave (it) to the bedouin and said, 'The right\" \"The right (first).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں پانی ملا ہوا دودھ پیش کیا گیا آنحضرت صلی اللہ علیہ وسلم کے داہنی طرف ایک دیہاتی تھا اور بائیں طرف حضرت ابوبکر رضی اللہ عنہ ۔ آنحضرت صلی اللہ علیہ وسلم نے پی کر باقی دیہاتی کو دیا اور فرمایا کہ دائیں طرف سے پس دائیں طرف سے ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِلَبَنٍ قَدْ شِيبَ بِمَاءٍ، وَعَنْ يَمِينِهِ أَعْرَابِيٌّ وَعَنْ شِمَالِهِ أَبُو بَكْرٍ، فَشَرِبَ، ثُمَّ أَعْطَى الأَعْرَابِيَّ، وَقَالَ ‏ \"‏ الأَيْمَنَ الأَيْمَنَ ‏\"‏‏.‏",
                "headingArabic": "الأَيْمَنَ فَالأَيْمَنَ فِي الشُّرْبِ",
                "headingUrdu": "دائیں طرف والے کو پہلے پینا چاہیے۔",
                "headingEnglish": "The one on the right should drink first",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5384,
                "hadithNumber": "5620",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) was offered something to drink. He drank of it while on his right was a boy and on his left were some elderly people. He said to the boy, \"May I give these (elderly) people first?\" The boy said, \"By Allah, O Allah's Messenger (ﷺ)! I will not give up my share from you to somebody else.\" On that Allah's Messenger (ﷺ) placed the cup in the hand of that boy. The transmitter states: Allah Apostle ﷺ handed that thing over to him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک شربت لایا گیاآنحضرت صلی اللہ علیہ وسلم نے اس میں سے پیا ، آپ کے دائیں طرف ایک لڑکا بیٹھا ہو اتھا اور بائیں طرف بوڑھے لوگ ( حضرت خالد بن ولید رضی اللہ عنہ جیسے بیٹھے ہوئے ) تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے بچے سے کہا کیا تم مجھے اجازت دوگے کہ میں ان ( شیوخ ) کو ( پہلے ) دے دوں ۔ لڑکے نے کہا اللہ کی قسم یا رسول اللہ ! آپ کے جھوٹے میں سے ملنے والے اپنے حصہ کے معاملہ میں میں کسی پر ایثار نہیں کروں گا ۔ راوی نے بیان کیا کہ اس پر آنحضرت صلی اللہ علیہ وسلم نے لڑکے کے ہاتھ میں پیالہ دے دیا ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابوحازم بن دینار نے اور ان سے حضرت سہل بن سعد رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِشَرَابٍ فَشَرِبَ مِنْهُ، وَعَنْ يَمِينِهِ غُلاَمٌ وَعَنْ يَسَارِهِ الأَشْيَاخُ‏.‏ فَقَالَ لِلْغُلاَمِ ‏ \"‏ أَتَأْذَنُ لِي أَنْ أُعْطِيَ هَؤُلاَءِ ‏\"‏‏.‏ فَقَالَ الْغُلاَمُ وَاللَّهِ يَا رَسُولَ اللَّهِ لاَ أُوثِرُ بِنَصِيبِي مِنْكَ أَحَدًا‏.‏ قَالَ فَتَلَّهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي يَدِهِ‏.‏",
                "headingArabic": "هَلْ يَسْتَأْذِنُ الرَّجُلُ مَنْ عَنْ يَمِينِهِ، فِي الشُّرْبِ لِيُعْطِيَ الأَكْبَرَ",
                "headingUrdu": "دائیں طرف والے کی اجازت پہلے کسی بزرگ کو پینا",
                "headingEnglish": "The permission of the one on right to give the drink to an elder person first",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5385,
                "hadithNumber": "5621",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) and one of his companions entered upon an Ansari man. The Prophet (ﷺ) and his companion greeted (the man) and he replied, \"O Allah's Messenger (ﷺ)! Let my father and mother be sacrificed for you! It is hot,\" while he was watering his garden. The Prophet (ﷺ) asked him, \"If you have water kept overnight in a water skin, (give us), or else we will drink by putting our mouths in the basin.\" The man was watering the garden The man said, \"O Allah's Messenger (ﷺ)! I have water kept overnight in a water-skin. He went to the shade and poured some water into a bowl and milked some milk from a domestic goat in it. The Prophet (ﷺ) drank and then gave the bowl to the man who had come along with him to drink.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم قبیلہ انصار کے ایک صحابی کے یہاں تشریف لے گئے ۔ آنحضرت صلی اللہ علیہ وسلم کے ساتھ آپ کے ایک رفیق بھی تھے ۔ آنحضرت صلی اللہ علیہ وسلم اور آپ کے رفیق نے انہیں سلام کیا اور انہوں نے سلام کا جواب دی ۔ پھر عرض کیا کہ یا رسول اللہ ! میرے ماں باپ آپ صلی اللہ علیہ وسلم پر نثار ہوں یہ بڑی گرمی کا وقت ہے وہ اپنے باغ میں پانی دے رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اگر تمہارے پاس مشک میں رات کا رکھا ہوا پانی ہے ( تو وہ پلادو ) ورنہ ہم منہ لگا کر پی لیں گے ( یہیں سے ترجمہ باب نکلتا ہے ) وہ صاحب اس وقت بھی باغ میں پانی دے رہے تھے ۔ انہوں نے عرض کیا یا رسول اللہ ! میرے پاس مشک میں رات کا رکھا ہوا باسی پانی ہے پھر وہ چھپر میں گئے اور ایک پیالے میں باسی پانی لیا پھر اپنی ایک دودھ دینے والی بکری کا دودھ اس میں نکالا ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے پیا پھر وہ دوبارہ لائے اور اس مرتبہ آنحضرت صلی اللہ علیہ وسلم کے رفیق حضرت ابوبکر رضی اللہ عنہ نے پیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن صالح نے بیان کیا ، کہا ہم سے فلیح بن سلیمان نے بیان کیا ، ان سے سعید بن حارث نے اور ان سے حضرت جابر بن عبداللہ انصاری رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ سَعِيدِ بْنِ الْحَارِثِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَى رَجُلٍ مِنَ الأَنْصَارِ وَمَعَهُ صَاحِبٌ لَهُ، فَسَلَّمَ النَّبِيُّ صلى الله عليه وسلم وَصَاحِبُهُ، فَرَدَّ الرَّجُلُ فَقَالَ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي‏.‏ وَهْىَ سَاعَةٌ حَارَّةٌ، وَهْوَ يُحَوِّلُ فِي حَائِطٍ لَهُ ـ يَعْنِي الْمَاءَ ـ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنْ كَانَ عِنْدَكَ مَاءٌ بَاتَ فِي شَنَّةٍ وَإِلاَّ كَرَعْنَا ‏\"‏‏.‏ وَالرَّجُلُ يُحَوِّلُ الْمَاءَ فِي حَائِطٍ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ عِنْدِي مَاءٌ بَاتَ فِي شَنَّةٍ‏.‏ فَانْطَلَقَ إِلَى الْعَرِيشِ فَسَكَبَ فِي قَدَحٍ مَاءً، ثُمَّ حَلَبَ عَلَيْهِ مِنْ دَاجِنٍ لَهُ، فَشَرِبَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ أَعَادَ، فَشَرِبَ الرَّجُلُ الَّذِي جَاءَ مَعَهُ‏.‏",
                "headingArabic": "الْكَرْعِ فِي الْحَوْضِ",
                "headingUrdu": "بیسن کا پانی اس میں منہ ڈال کر پینا",
                "headingEnglish": "To drink water from a basin by putting mouth in it",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5386,
                "hadithNumber": "5622",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "I was waiting on my uncles, serving them with an alcoholic drink prepared from dates, and I was the youngest of them. (Suddenly) it was said that alcoholic drinks had been prohibited. So they said (to me), 'Throw it away.\" And I threw it away The sub-narrator said: I asked Anas what their drink was (made from), He replied, \"(From) ripe dates and unripe dates.\" When Hadrat Abu Bakr bin Anas رضی اللہ عنہ did not deny it. Some of my companion say: Hadrat Anas رضی اللہ عنہ was heard to say: At that time, it was their wine.",
                "hadithUrdu": "میں کھڑا ہوا اپنے قبیلہ میں اپنے چچاؤں کو کھجور کی شراب پلا رہا تھا ۔ میں ان میں سے سب سے چھوٹا تھا ، اتنے میں کسی نے کہا کہ شراب حرام کر دی گئی ( ابوطلحہ رضی اللہ عنہ نے ) کہا کہ شراب پھینک دو ۔ چنانچہ ہم نے پھینک دی ۔ سلیمان نے کہا کہ میں نے انس رضی اللہ عنہ سے پوچھا اس وقت لوگ کس چیز کی شراب پیتے تھے کہا کہ پکی اور کچی کھجور کی ۔ ابوبکر بن انس نے کہا کہ یہی ان کی شراب ہوتی تھی انس رضی اللہ عنہ نے اس کا انکار نہیں کیا ، بکر بن عبداللہ مزنی یا قتادہ نے کہا اور مجھ سے بعض لوگوں نے بیان کیا کہ انہوں نے انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ ” ان کی ان دنوں یہی ( فضیح ) ان کی شراب تھی ۔ “",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے معتمر نے ، ان سے ان کے والد نے ، کہ میں نے انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ قَالَ كُنْتُ قَائِمًا عَلَى الْحَىِّ أَسْقِيهِمْ ـ عُمُومَتِي وَأَنَا أَصْغَرُهُمُ ـ الْفَضِيخَ، فَقِيلَ حُرِّمَتِ الْخَمْرُ‏.‏ فَقَالَ أَكْفِئْهَا‏.‏ فَكَفَأْنَا‏.‏ قُلْتُ لأَنَسٍ مَا شَرَابُهُمْ قَالَ رُطَبٌ وَبُسْرٌ‏.‏ فَقَالَ أَبُو بَكْرِ بْنُ أَنَسٍ وَكَانَتْ خَمْرَهُمْ‏.‏ فَلَمْ يُنْكِرْ أَنَسٌ‏.‏ وَحَدَّثَنِي بَعْضُ أَصْحَابِي أَنَّهُ سَمِعَ أَنَسًا يَقُولُ كَانَتْ خَمْرَهُمْ يَوْمَئِذٍ‏.‏",
                "headingArabic": "خِدْمَةِ الصِّغَارِ الْكِبَارَ",
                "headingUrdu": "چھوٹے کو بڑے کی خدمت کرنی چاہیے۔",
                "headingEnglish": "The younger should serve the older",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5387,
                "hadithNumber": "5623",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"When night falls (or when it is evening), stop your children from going out, for the devils spread out at that time. But when an hour of the night has passed, release them and close the doors and mention Allah's Name, for Satan does not open a closed door. Tie the mouth of your waterskin and mention Allah's Name; cover your containers and utensils and mention Allah's Name. Cover them even by placing something across it, and extinguish your lamps. \"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ رات کی جب ابتداء ہو یا ( آپ نے فرمایا ) جب شام ہو تو اپنے بچوں کو روک لو ( اور گھر سے باہر نہ نکلنے دو ) کیونکہ اس وقت شیطان پھیل جاتے ہیں پھر جب رات کی ایک گھڑی گزرجائے تو انہیں چھوڑ دو اور دروازے بند کر لو اور اس وقت اللہ کا نام لو کیونکہ شیطان بند دروازے کو نہیں کھولتا اور اللہ کا نام لے کر اپنے مشکیزوں کا منہ باندھ دو ۔ اللہ کا نام لے کر اپنے برتنوں کو ڈھک دو ، خواہ کسی چیز کو چوڑائی میں رکھ کر ہی ڈھک سکو اور اپنے چراغ ( سونے سے پہلے ) بجھادیا کرو ۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا ، انہوں نے کہا ہم کو روح بن عبادہ نے خبر دی ، انہوں نے کہا ہم کو ابن جریج نے خبر دی ، انہوں نے کہا کہ مجھے عطاء نے خبر دی ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا كَانَ جُنْحُ اللَّيْلِ ـ أَوْ أَمْسَيْتُمْ ـ فَكُفُّوا صِبْيَانَكُمْ، فَإِنَّ الشَّيَاطِينَ تَنْتَشِرُ حِينَئِذٍ، فَإِذَا ذَهَبَ سَاعَةٌ مِنَ اللَّيْلِ فَحُلُّوهُمْ، فَأَغْلِقُوا الأَبْوَابَ وَاذْكُرُوا اسْمَ اللَّهِ، فَإِنَّ الشَّيْطَانَ لاَ يَفْتَحُ بَابًا مُغْلَقًا، وَأَوْكُوا قِرَبَكُمْ وَاذْكُرُوا اسْمَ اللَّهِ، وَخَمِّرُوا آنِيَتَكُمْ وَاذْكُرُوا اسْمَ اللَّهِ، وَلَوْ أَنْ تَعْرُضُوا عَلَيْهَا شَيْئًا وَأَطْفِئُوا، مَصَابِيحَكُمْ ‏\"‏‏.‏",
                "headingArabic": "تَغْطِيَةِ الإِنَاءِ",
                "headingUrdu": "برتن کو ڈھانپنا",
                "headingEnglish": "Covering the containers",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5388,
                "hadithNumber": "5624",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Extinguish the lamps when you go to bed; close your doors; tie the mouths of your water skins, and cover the food and drinks.\" I think he added, \". . . even with a stick you place across the container.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم جب سونے لگو تو چراغ بجھا دو ۔ دروازے بند کر دو ، مشکوں کے منہ باندھ دو اور کھانے پینے کے برتنوں کو ڈھانپ دو ۔ حضرت جابر رضی اللہ عنہ نے کہا کہ میرا خیال ہے کہ یہ بھی کہا خواہ لکڑی ہی کے ذریعہ سے ڈھک سکو جو اس کی چوڑائی میں بسم اللہ کہہ کر رکھ دی جائے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، ان سے عطاء بن ابی رباح نے اور ان سے حضرت جابر بن عبداللہ انصاری رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أَطْفِئُوا الْمَصَابِيحَ إِذَا رَقَدْتُمْ، وَغَلِّقُوا الأَبْوَابَ، وَأَوْكُوا الأَسْقِيَةَ، وَخَمِّرُوا الطَّعَامَ وَالشَّرَابَ ـ وَأَحْسِبُهُ قَالَ ـ وَلَوْ بِعُودٍ تَعْرُضُهُ عَلَيْهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5389,
                "hadithNumber": "5625",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) forbade the bending of the mouths of water skins for the sake of drinking from them.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے مشکوں میں ” اختناث “ سے منع فرمایا مشک کا منہ کھول کر اس میں منہ لگا کر پانی پینے سے روکا ۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا ، کہا ہم سے ابن ابی ذئب نے بیان کیا ، ان سے زہری نے ، ان سے عبیداللہ بن عبداللہ بن عتبہ نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ اخْتِنَاثِ الأَسْقِيَةِ‏.‏ يَعْنِي أَنْ تُكْسَرَ أَفْوَاهُهَا فَيُشْرَبَ مِنْهَا‏.‏",
                "headingArabic": "اخْتِنَاثِ الأَسْقِيَةِ",
                "headingUrdu": "ان سے پینے کی خاطر پانی کی کھالوں کا منہ موڑنا",
                "headingEnglish": "The bending of the mouths of the water-skins for the sake of drinking from them",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5390,
                "hadithNumber": "5626",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) forbidding the drinking of water by bending the mouths of water skins, i.e., drinking from the mouths directly. Abdullah has quoted from Mamar etc. that it means to drink water placing the mouth directly with the water skin.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ آپ نے مشکوں میں ( اختناث ) سے منع فرمایا ہے ۔ عبداللہ نے بیان کیا کہ معمر نے بیان کیا یا ان کے غیر نے کہ ” اختناث “ مشک سے منہ لگا کر پانی پینے کو کہتے ہیں ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس نے خبر دی ، ان سے زہری نے بیان کیا کہ مجھ سے عبیداللہ بن عبداللہ نے بیان کیا ، انہوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے سنا ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنِ اخْتِنَاثِ الأَسْقِيَةِ‏.‏ قَالَ عَبْدُ اللَّهِ قَالَ مَعْمَرٌ أَوْ غَيْرُهُ هُوَ الشُّرْبُ مِنْ أَفْوَاهِهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5391,
                "hadithNumber": "5627",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) forbade drinking directly from the mouth of a water skin or other leather containers. and forbade preventing one's neighbor from fixing a peg in (the wall of) one's house.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مشک کے منہ سے منہ لگا کر پانی پینے کی ممانعت کی تھی اور ( اس سے بھی آپ نے منع فرمایا تھا کہ ) کوئی شخص اپنے پڑوس کو اپنی دیوار میں کھونٹی وغیرہ گاڑنے سے روکے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا ہم سے ایوب نے بیان کیا کہ ہم سے عکرمہ نے کہا ، تمہیں میں چند چھوٹی چھوٹی باتیں نہ بتا دوں جنہیں ہم سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا تھا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَيُّوبُ، قَالَ لَنَا عِكْرِمَةُ أَلاَ أُخْبِرُكُمْ بِأَشْيَاءَ، قِصَارٍ حَدَّثَنَا بِهَا أَبُو هُرَيْرَةَ، نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الشُّرْبِ مِنْ فَمِ الْقِرْبَةِ أَوِ السِّقَاءِ، وَأَنْ يَمْنَعَ جَارَهُ أَنْ يَغْرِزَ خَشَبَهُ فِي دَارِهِ‏.‏",
                "headingArabic": "الشُّرْبِ مِنْ فَمِ السِّقَاءِ",
                "headingUrdu": "پانی والی مشک کے منہ سے پانی پینا",
                "headingEnglish": "To drink water from the mouth of a water-skin",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5392,
                "hadithNumber": "5628",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) forbade the drinking of water directly from the mouth of a water skin .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے مشک کے منہ سے پانی پینے کی ممانعت فرما دی تھی ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے اسماعیل نے بیان کیا ، کہا ہم کو ایوب نے خبر دی ، انہیں عکرمہ نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، أَخْبَرَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يُشْرَبَ مِنْ فِي السِّقَاءِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5393,
                "hadithNumber": "5629",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) forbade the drinking of water direct from the mouth of a water-skin.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے مشک کے منہ سے پانی پینے کو منع فرمایا تھا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے خالد حذاء نے بیان کیا ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ الشُّرْبِ مِنْ فِي السِّقَاءِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5394,
                "hadithNumber": "5630",
                "englishNarrator": "Narrated Abu Qatada:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"When you drink (water), do not breath in the vessel; and when you urinate, do not touch your penis with your right hand. And when you cleanse yourself after defecation, do not use your right hand.\"",
                "hadithUrdu": "رسول اللہ علیہ وسلم نے فرمایا جب تم میں سے کوئی شخص پانی پئے تو ( پینے کے ) برتن میں ( پانی پیتے ہوئے ) سانس نہ لے اور جب تم میں سے کوئی شخص پیشاب کرے تو داہنے ہاتھ کو ذکر پر نہ پھیرے اور جب استنجاء کرے تو داہنے ہاتھ سے نہ کرے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے شیبان نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے ، ان سے عبداللہ بن ابی قتادہ نے ، ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا شَرِبَ أَحَدُكُمْ فَلاَ يَتَنَفَّسْ فِي الإِنَاءِ، وَإِذَا بَالَ أَحَدُكُمْ فَلاَ يَمْسَحْ ذَكَرَهُ بِيَمِينِهِ، وَإِذَا تَمَسَّحَ أَحَدُكُمْ فَلاَ يَتَمَسَّحْ بِيَمِينِهِ ‏\"‏‏.‏",
                "headingArabic": "النَّهْىِ عَنِ التَّنَفُّسِ، فِي الإِنَاءِ",
                "headingUrdu": "برتن میں سانس لینا منع ہے (پیتے وقت)",
                "headingEnglish": "It is forbidden to breathe in the vessel (while drinking)",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5395,
                "hadithNumber": "5631",
                "englishNarrator": "Narrated Thumama bin `Abdullah:",
                "hadithEnglish": "Anas رضی اللہ عنہ used to breathe twice or thrice in the vessel (while drinking) and used to say that the Prophet; used to take three breaths while drinking.",
                "hadithUrdu": "حضرت انس رضی اللہ عنہ دو یا تین سانسوں میں پانی پیتے تھے اور کہتے تھے کہ رسول اللہ! پیتے وقت تین سانس لیتے تھے۔",
                "urduNarrator": "ہم سے ابو عاصم اورا بو نعیم نے بیان کیا ، انہوں نے کہا کہ ہم سے عروہ بن ثابت نے بیان کیا ، انہوں نے کہا کہ مجھےثمامہ بن عبداللہ نے خبر دی ، بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ، وَأَبُو نُعَيْمٍ قَالاَ حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ، قَالَ أَخْبَرَنِي ثُمَامَةُ بْنُ عَبْدِ اللَّهِ، قَالَ كَانَ أَنَسٌ يَتَنَفَّسُ فِي الإِنَاءِ مَرَّتَيْنِ أَوْ ثَلاَثًا، وَزَعَمَ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَنَفَّسُ ثَلاَثًا‏.‏",
                "headingArabic": "الشُّرْبِ بِنَفَسَيْنِ أَوْ ثَلاَثَةٍ",
                "headingUrdu": "پیتے وقت دو یا تین بار سانس لینا",
                "headingEnglish": "Breathing twice or thrice while drinking",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5396,
                "hadithNumber": "5632",
                "englishNarrator": "Narrated Ibn Abi Laila:",
                "hadithEnglish": "While Hudhaita رضی اللہ عنہ was at Mada'in, he asked for water. The chief of the village brought him a silver vessel. Hudhaifa threw it away and said, \"I have thrown it away because I told him not to use it, but he has not stopped using it. The Prophet (ﷺ) forbade us to wear clothes of silk or Dibaj, and to drink in gold or silver utensils, and said, 'These things are for them (unbelievers) in this world and for you (Muslims) in the Hereafter.' \"",
                "hadithUrdu": "حذیفہ بن یمان رضی اللہ عنہ مدائن میں تھے ۔ انہوں نے پانی مانگا تو ایک دیہاتی نے ان کو چاندی کے برتن میں پانی لا کر دیا ، انہوں نے برتن کو اس پرپھینک مارا پھر کہا میں نے برتن صرف اس وجہ سے پھینکا ہے کہ اس شخص کو میں اس سے منع کر چکا تھا لیکن یہ باز نہ آیا اور رسول کریم صلی اللہ علیہ وسلم نے ہمیں ریشم ودیبا کے پہننے سے اور سونے اور چاندی کے برتن میں کھانے پینے سے منع کیا تھا اور آپ نے ارشاد فرمایا تھا کہ یہ چیزیں ان کفار کے لیے دنیا میں ہیں اور تمہیں آخرت میں ملیں گے ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حکیم بن ابی لیلیٰ نے ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنِ ابْنِ أَبِي لَيْلَى، قَالَ كَانَ حُذَيْفَةُ بِالْمَدَايِنِ فَاسْتَسْقَى، فَأَتَاهُ دِهْقَانٌ بِقَدَحِ فِضَّةٍ، فَرَمَاهُ بِهِ فَقَالَ إِنِّي لَمْ أَرْمِهِ إِلاَّ أَنِّي نَهَيْتُهُ فَلَمْ يَنْتَهِ، وَإِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَانَا عَنِ الْحَرِيرِ وَالدِّيبَاجِ وَالشُّرْبِ فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ وَقَالَ ‏ \"‏ هُنَّ لَهُمْ فِي الدُّنْيَا وَهْىَ لَكُمْ فِي الآخِرَةِ ‏\"‏‏.‏",
                "headingArabic": "الشُّرْبِ فِي آنِيَةِ الذَّهَبِ",
                "headingUrdu": "سونے کے برتنوں میں پینا",
                "headingEnglish": "To drink in gold utensils",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5397,
                "hadithNumber": "5633",
                "englishNarrator": "Narrated Hudhaifa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Do not drink in gold or silver utensils, and do not wear clothes of silk or Dibaj, for these things are for them (unbelievers) in this world and for you in the Hereafter.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا تھا کہ سونے اور چاندی کے پیالہ میں نہ پیا کرو اور نہ ریشم ودیبا پہنا کرو کیونکہ یہ چیزیں ان (کافروں)کے لیے دینا میں ہیں اور تمہارے لیے آخرت میں ہیں ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے ابن عون نے بیان کیا ، ان سے مجاہد نے اور ان سے ابن ابی لیلیٰ نے بیان کیا کہ ہم حضرت حذیفہ رضی اللہ عنہ کے ساتھ نکلے پھر انہوں نے نبی کریم صلی اللہ علیہ وسلم کا ذکر کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ أَبِي لَيْلَى، قَالَ خَرَجْنَا مَعَ حُذَيْفَةَ وَذَكَرَ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَشْرَبُوا فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ، وَلاَ تَلْبَسُوا الْحَرِيرَ وَالدِّيبَاجَ، فَإِنَّهَا لَهُمْ فِي الدُّنْيَا وَلَكُمْ فِي الآخِرَةِ ‏\"‏‏.‏",
                "headingArabic": "آنِيَةِ الْفِضَّةِ",
                "headingUrdu": "چاندی کے برتن",
                "headingEnglish": "Silver utensils",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5398,
                "hadithNumber": "5634",
                "englishNarrator": "Narrated Um Salama (the wife of the Prophet) رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"He who drinks in silver utensils is only filling his `Abdomen with Hell Fire.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا جو شخص چاندی کے برتن میں کوئی چیز پیتا ہے تو وہ شخص اپنے پیٹ میں دوزخ کی آگ بھڑ کا رہا ہے ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک بن انس نے بیان کیا ، ان سے نافع نے ، ان سے زید بن عبداللہ بن عمر نے ، ان سے عبداللہ بن عبدالرحمٰن بن ابی بکر صدیق رضی اللہ عنہ نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت ام سلمہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، عَنْ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الَّذِي يَشْرَبُ فِي إِنَاءِ الْفِضَّةِ إِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5399,
                "hadithNumber": "5635",
                "englishNarrator": "Narrated Al-Bara' bin `Azib رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) ordered us to do seven things and forbade us from seven. He ordered us to visit the sick, to follow funeral processions, (to say) to a sneezer, (May Allah bestow His Mercy on you, if he says, Praise be to Allah), to accept invitations, to greet (everybody), to help the oppressed and to help others to fulfill their oaths. He forbade us to wear gold rings, to drink in silver (utensils), to use Mayathir (silken carpets placed on saddles), to wear Al-Qissi (a kind of silken cloth), to wear silk, Dibaj or Istabraq (two kinds of silk).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں سات چیزوں کا حکم دیا تھا اور سات چیزوں سے ہم کو منع فرمایا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے ہمیں بیمار کی عیادت کرنے ، جنازے کے پیچھے چلنے ، چھینکنے والے کے جواب میں ” یرحمک اللہ “ کہنے ، دعوت کرنے والے کی دعوت کو قبول کرنے ، سلام پھیلانے ، مظلوم کی مدد کرنے اور قسم کھانے کے بعد کفارہ ادا کرنے کا حکم فرمایا تھا اور آنحضرت صلی اللہ علیہ وسلم نے ہمیں سونے کی انگوٹھیوں سے ، چاندی میں پینے یا ( فرمایا ) چاندی کے برتن میں پینے سے ، میثر ( زین یا کجاوہ کے اوپر ریشم کا گدا ) کے استعمال کرنے سے اور قسی ( اطراف مصر میں تیار کیا جانے والا ایک کپڑا جس میں ریشم کے دھاگے بھی استعمال ہوتے تھے ) کے استعمال کرنے سے اور ریشم ودیبا اور استبرق پہننے سے منع فرمایا تھا ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے اشعث بن سلیم نے ، ان سے معاویہ بن سوید بن مقرن نے اور ان سے حضرت براء بن عازب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَشْعَثِ بْنِ سُلَيْمٍ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَبْعٍ، وَنَهَانَا عَنْ سَبْعٍ، أَمَرَنَا بِعِيَادَةِ الْمَرِيضِ، وَاتِّبَاعِ الْجِنَازَةِ، وَتَشْمِيتِ الْعَاطِسِ، وَإِجَابَةِ الدَّاعِي، وَإِفْشَاءِ السَّلاَمِ، وَنَصْرِ الْمَظْلُومِ وَإِبْرَارِ الْمُقْسِمِ، وَنَهَانَا عَنْ خَوَاتِيمِ الذَّهَبِ، وَعَنِ الشُّرْبِ فِي الْفِضَّةِ ـ أَوْ قَالَ آنِيَةِ الْفِضَّةِ ـ وَعَنِ الْمَيَاثِرِ وَالْقَسِّيِّ، وَعَنْ لُبْسِ الْحَرِيرِ وَالدِّيبَاجِ وَالإِسْتَبْرَقِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5400,
                "hadithNumber": "5636",
                "englishNarrator": "Narrated Um Al-Fadl رضی اللہ عنہا :",
                "hadithEnglish": "The people were in doubt whether the Prophet (ﷺ) was fasting on the Day of `Arafat or not, so a (wooden) drinking vessel full of milk was sent to him, and he drank it.",
                "hadithUrdu": "لوگوں نے عرفہ کے دن نبی کریم صلی اللہ علیہ وسلم کے روزے کے متعلق شبہ کیا تو آنحضرت صلی اللہ علیہ وسلم کی خدمت میں دودھ کا ایک کٹورہ پیش کیا گیا اور آپ نے اسے نوش فرمایا ۔",
                "urduNarrator": "مجھ سے عمرو بن عباس نے بیان کیا ، کہا ہم سے عبدالرحمٰن نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے سالم ابی النضر نے ، ان سے ام فضل کے غلام عمیر نے اور ان سے حضرت ام الفضل رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ سَالِمٍ أَبِي النَّضْرِ، عَنْ عُمَيْرٍ، مَوْلَى أُمِّ الْفَضْلِ عَنْ أُمِّ الْفَضْلِ، أَنَّهُمْ شَكُّوا فِي صَوْمِ النَّبِيِّ صلى الله عليه وسلم يَوْمَ عَرَفَةَ، فَبُعِثَ إِلَيْهِ بِقَدَحٍ مِنْ لَبَنٍ فَشَرِبَهُ‏.‏",
                "headingArabic": "الشُّرْبِ فِي الأَقْدَاحِ",
                "headingUrdu": "لکڑی کے برتنوں میں پینا",
                "headingEnglish": "To drink in wooden utensils",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5401,
                "hadithNumber": "5637",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "An Arab lady was mentioned to the Prophet (ﷺ) so he asked Abu Usaid As-Sa`idi رضی اللہ عنہ to send for her, and he sent for her and she came and stayed in the castle of Bani Sa`ida. The Prophet (ﷺ) came out and went to her and entered upon her. Behold, it was a lady sitting with a drooping head. When the Prophet (ﷺ) spoke to her, she said, \"I seek refuge with Allah from you.\" He said, \"I grant you refuge from me.\" They said to her, \"Do you know who this is?\" She said, \"No.\" They said, \"This is Allah's Messenger (ﷺ) who has come to command your hand in marriage.\" She said, \"I am very unlucky to lose this chance.\" Then the Prophet and his companions went towards the shed of Bani Sa`ida and sat there. Then he said, \"Give us water, O Sahl!\" So I took out this drinking bowl and gave them water in it. The sub-narrator added: Sahl رضی اللہ عنہ took out for us that very drinking bowl and we all drank from it. Later on `Umar bin `Abdul `Aziz requested Sahl to give it to him as a present, and he gave it to him as a present.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سے ایک عرب عورت کا ذکر کیا گیا پھر آپ نے حضرت اسید ساعدی رضی اللہ عنہ کو ان کے پاس انہیں لانے کے لیے کسی کو بھیجنے کا حکم دیا چنانچہ انہوں نے بھیجا اور وہ آئیں اور بنی ساعدہ کے قلعہ میں اتریں اور آنحضرت صلی اللہ علیہ وسلم بھی تشریف لائے اور ان کے پاس گئے ۔ آپ نے دیکھا کہ ایک عورت سر جھکائے بیٹھی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے جب ان سے گفتگو کی تو وہ کہنے لگیں کہ میں تم سے اللہ کی پناہ مانگتی ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ میں نے تجھ کو پناہ دی ! لوگوں نے بعد میں ان سے پوچھا ۔ تمہیں معلوم بھی ہے یہ کون تھے ۔ اس عورت نے جواب دیا کہ نہیں ۔ لوگوں نے کہا کہ یہ تو رسول اللہ صلی اللہ علیہ وسلم تھے تم سے نکاح کے لیے تشریف لائے تھے ۔ اس پر وہ بولیں کہ پھر تو میں بڑی بدبخت ہوں ( کہ آنحضور صلی اللہ علیہ وسلم کوناراض کر کے واپس کر دیا ) اسی دن حضور اکرم صلی اللہ علیہ وسلم تشریف لائے اور سقیفہ بنی ساعدہ میں اپنے صحابی کے ساتھ بیٹھے پھر فرمایا سہل ! پانی پلاؤ ۔ میں نے ان کے لیے یہ پیالہ نکالا اور انہیں اس میں پانی پلایا ۔ حضرت سہل رضی اللہ عنہ ہمارے لیے بھی وہی پیالہ نکال کر لائے اور ہم نے بھی اس میں پانی پیا ۔ راوی نے بیان کیا کہ پھر بعد میں خلیفہ عمر بن عبدالعزیز رحمہ اللہ نے ان سے یہ مانگ لیا تھا اور انہوں نے یہ ان کو ہبہ کر دیا تھا ۔",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابو غسان نے بیان کیا ، کہا کہ مجھ سے ابوحازم نے بیان کیا ، ان سے حضرت سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ قَالَ ذُكِرَ لِلنَّبِيِّ صلى الله عليه وسلم امْرَأَةٌ مِنَ الْعَرَبِ، فَأَمَرَ أَبَا أُسَيْدٍ السَّاعِدِيَّ أَنْ يُرْسِلَ إِلَيْهَا فَأَرْسَلَ إِلَيْهَا، فَقَدِمَتْ فَنَزَلَتْ فِي أُجُمِ بَنِي سَاعِدَةَ، فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم حَتَّى جَاءَهَا فَدَخَلَ عَلَيْهَا فَإِذَا امْرَأَةٌ مُنَكِّسَةٌ رَأْسَهَا، فَلَمَّا كَلَّمَهَا النَّبِيُّ صلى الله عليه وسلم قَالَتْ أَعُوذُ بِاللَّهِ مِنْكَ‏.‏ فَقَالَ ‏\"‏ قَدْ أَعَذْتُكِ مِنِّي ‏\"‏‏.‏ فَقَالُوا لَهَا أَتَدْرِينَ مَنْ هَذَا قَالَتْ لاَ‏.‏ قَالُوا هَذَا رَسُولُ اللَّهِ صلى الله عليه وسلم جَاءَ لِيَخْطُبَكِ‏.‏ قَالَتْ كُنْتُ أَنَا أَشْقَى مِنْ ذَلِكَ‏.‏ فَأَقْبَلَ النَّبِيُّ صلى الله عليه وسلم يَوْمَئِذٍ حَتَّى جَلَسَ فِي سَقِيفَةِ بَنِي سَاعِدَةَ هُوَ وَأَصْحَابُهُ، ثُمَّ قَالَ ‏\"‏ اسْقِنَا يَا سَهْلُ ‏\"‏‏.‏ فَخَرَجْتُ لَهُمْ بِهَذَا الْقَدَحِ فَأَسْقَيْتُهُمْ فِيهِ، فَأَخْرَجَ لَنَا سَهْلٌ ذَلِكَ الْقَدَحَ فَشَرِبْنَا مِنْهُ‏.‏ قَالَ ثُمَّ اسْتَوْهَبَهُ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ بَعْدَ ذَلِكَ فَوَهَبَهُ لَهُ‏.‏",
                "headingArabic": "الشُّرْبِ مِنْ قَدَحِ النَّبِيِّ صلى الله عليه وسلم وَآنِيَتِهِ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پیالے میں پینا",
                "headingEnglish": "To drink in the drinking bowl of the Prophet (saws)",
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5402,
                "hadithNumber": "5638",
                "englishNarrator": "Narrated `Asim al-Ahwal:",
                "hadithEnglish": "I saw the drinking bowl of the Prophet (ﷺ) with Anas bin Malik رضی اللہ عنہ , and it had been broken, and he had mended it with silver plates. That drinking bowl was quite wide and made of Nadar wood, Anas رضی اللہ عنہ said, \"I gave water to the Prophet (ﷺ) in that bowl more than so-and-so (for a long period).\" Ibn Seereen said: Around that bowl there was an iron ring, and Anas رضی اللہ عنہ wanted to replace it with a silver or gold ring, but Abu Talha رضی اللہ عنہ said to him, \"Do not change a thing that Allah's Messenger (ﷺ) has made.\" So Anas left it as it was.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کا پیالہ حضرت انس بن مالک رضی اللہ عنہ کے پاس دیکھا ہے وہ پھٹ گیا تھا تو حضرت انس رضی اللہ عنہ نے اسے چاندی سے جوڑدیا ۔ پھر حضرت عاصم نے بیان کیا کہ وہ عمدہ چوڑا پیالہ ہے ۔ چمکدارلکڑی کا بنا ہوا ۔ بیان کیا کہ حضرت انس رضی اللہ عنہ نے بتایا کہ میں نے اس پیالہ سے حضور اکرم صلی اللہ علیہ وسلم کو بارہا پلایا ہے ۔ راوی نے بیان کیا کہ ابن سیرین نے کہا کہ اس پیالہ میں لوہے کا ایک حلقہ تھا ۔ حضرت انس رضی اللہ عنہ نے چاہا کہ اس کی جگہ چاندی یا سونے کا حلقہ جڑوا دیں لیکن ابوطلحہ رضی اللہ عنہ نے ان سے کہا کہ جسے رسول اللہ صلی اللہ علیہ وسلم نے بنایا ہے اس میں ہرگز کوئی تبدیلی نہ کر ۔ چنانچہ انہوں نے یہ ارادہ چھوڑ دیا ۔",
                "urduNarrator": "ہم سے حسن بن مدرک نے بیان کیا ، انہوں نے کہا کہ مجھ سے یحییٰ بن حماد نے بیان کیا ، انہوں نے کہا ہم کو ابو عوانہ نے خبر دی ، ان سے عاصم احول نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ مُدْرِكٍ، قَالَ حَدَّثَنِي يَحْيَى بْنُ حَمَّادٍ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ عَاصِمٍ الأَحْوَلِ، قَالَ رَأَيْتُ قَدَحَ النَّبِيِّ صلى الله عليه وسلم عِنْدَ أَنَسِ بْنِ مَالِكٍ، وَكَانَ قَدِ انْصَدَعَ فَسَلْسَلَهُ بِفِضَّةٍ قَالَ وَهْوَ قَدَحٌ جَيِّدٌ عَرِيضٌ مِنْ نُضَارٍ‏.‏ قَالَ قَالَ أَنَسٌ لَقَدْ سَقَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي هَذَا الْقَدَحِ أَكْثَرَ مِنْ كَذَا وَكَذَا‏.‏ قَالَ وَقَالَ ابْنُ سِيرِينَ إِنَّهُ كَانَ فِيهِ حَلْقَةٌ مِنْ حَدِيدٍ فَأَرَادَ أَنَسٌ أَنْ يَجْعَلَ مَكَانَهَا حَلْقَةً مِنْ ذَهَبٍ أَوْ فِضَّةٍ فَقَالَ لَهُ أَبُو طَلْحَةَ لاَ تُغَيِّرَنَّ شَيْئًا صَنَعَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَتَرَكَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "75",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 75,
                    "chapterNumber": "75",
                    "chapterEnglish": "Drinks",
                    "chapterUrdu": "مشروبات کے بیان میں",
                    "chapterArabic": "كتاب الأشربة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5376,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=215",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=213",
                "label": "213",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=214",
                "label": "214",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=215",
                "label": "215",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=216",
                "label": "216",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=217",
                "label": "217",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=218",
                "label": "218",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=219",
                "label": "219",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=217",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=217",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=215",
        "to": 5400,
        "total": 40465
    }
}