{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 195,
        "data": [
            {
                "id": 4853,
                "hadithNumber": "5077",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I said, \"O Allah's Messenger (ﷺ)! Suppose you landed in a valley where there is a tree of which something has been eaten and then you found trees of which nothing has been eaten, of which tree would you let your camel graze?\" He said, \"(I will let my camel graze) of the one of which nothing has been eaten before.\" (The sub-narrator added: `Aisha meant that Allah's Messenger (ﷺ) had not married a virgin besides herself .)",
                "hadithUrdu": "میں نے عرض کیا یا رسول اللہ ! فرمائیے اگر آپ کسی وادی میں اتریں اور اس میں ایک درخت ایسا ہو جس میں اونٹ چر گئے ہوں اور ایک درخت ایسا ہو جس میں سے کچھ بھی نہ کھایا گیا ہو تو آپ اپنا اونٹ ان درختوںمیں سے کس درخت میں چرائیں گے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس درخت میں جس میں سے ابھی چرا یا نہیں گیا ہو ۔ ان کا اشارہ اس طرف تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان کے سوا کسی کنواری لڑکی سے نکاح نہیں کیا ۔",
                "urduNarrator": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا ، ان سے سلیمان بن بلال نے ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ لَوْ نَزَلْتَ وَادِيًا وَفِيهِ شَجَرَةٌ قَدْ أُكِلَ مِنْهَا، وَوَجَدْتَ شَجَرًا لَمْ يُؤْكَلْ مِنْهَا، فِي أَيِّهَا كُنْتَ تُرْتِعُ بَعِيرَكَ قَالَ ‏ \"‏ فِي الَّذِي لَمْ يُرْتَعْ مِنْهَا ‏\"‏‏.‏ تَعْنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَتَزَوَّجْ بِكْرًا غَيْرَهَا‏.‏",
                "headingArabic": "نِكَاحِ الأَبْكَارِ",
                "headingUrdu": "کنواریوں سے شادی کرنا",
                "headingEnglish": "To marry virgins",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4854,
                "hadithNumber": "5078",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said (to me), \"You have been shown to me twice in (my) dreams. A man was carrying you in a silken cloth and said to me, 'This is your wife.' I uncovered it; and behold, it was you. I said to myself, 'If this dream is from Allah, He will cause it to come true.' \"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا اے عائشہ ! مجھے خواب میں دو مرتبہ تم دکھائی گئیں ۔ ایک شخص ( جبرائیل ) تمہاری صورت حریر کے ایک ٹکڑے میں اٹھائے ہوئے ہے اور کہتا ہے کہ یہ آپ کی بیوی ہے میں نے جو اس کپڑے کو کھولا تو اس میں تم تھیں ۔ میں نے خیا ل کیا کہ اگر یہ خواب اللہ کی طرف سے ہے تو وہ اسے ضرور پورا کر کے رہے گا ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے اسامہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أُرِيتُكِ فِي الْمَنَامِ مَرَّتَيْنِ، إِذَا رَجُلٌ يَحْمِلُكِ فِي سَرَقَةِ حَرِيرٍ فَيَقُولُ هَذِهِ امْرَأَتُكَ، فَأَكْشِفُهَا فَإِذَا هِيَ أَنْتِ، فَأَقُولُ إِنْ يَكُنْ هَذَا مِنْ عِنْدِ اللَّهِ يُمْضِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4855,
                "hadithNumber": "5079",
                "englishNarrator": "Narrated Jabir bin `Abdullahرضی اللہ عنہما :",
                "hadithEnglish": "While we were returning from a Ghazwa (Holy Battle) with the Prophet, I started driving my camel fast, as it was a lazy camel A rider came behind me and pricked my camel with a spear he had with him, and then my camel started running as fast as the best camel you may see. Behold! The rider was the Prophet (ﷺ) himself. He said, 'What makes you in such a hurry?\" I replied, I am newly married \" He said, \"Did you marry a virgin or a matron? I replied, \"A matron.\" He said, \"Why didn't you marry a young girl so that you may play with her and she with you?\" When we were about to enter (Medina), the Prophet (ﷺ) said, \"Wait so that you may enter (Medina) at night so that the lady of unkempt hair may comb her hair and the one whose husband has been absent may shave her pubic region.",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک جہاد سے واپس ہو رہے تھے ۔ میں اپنے اونٹ کو ، جو سست تھا تیز چلانے کی کو شش کر رہا تھا ۔ اتنے میں میرے پیچھے سے ایک سوار مجھ سے آکرملا اور اپنا نیزہ میرے اونٹ کو چبھو دیا ۔ اس کی وجہ سے میرا اونٹ تیز چل پڑا جیسا کہ کسی عمدہ قسم کے اونٹ کی چال تم نے دیکھی ہو گی ۔ اچانک نبی کریم صلی اللہ علیہ وسلم مل گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا جلدی کیوں کر رہے ہو ؟ میں نے عرض کیا ابھی میری شادی نئی ہوئی ہے ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایاکنواری سے یا بیوہ سے ؟ میں نے عرض کیا کہ بیوہ سے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ کسی کنواری سے کیوں نہ کی تم اس کے ساتھ کھیل کود کرتے اور وہ تمہارے ساتھ کرتی ۔ بیان کیا کہ پھر جب ہم مدینہ میں داخل ہونے والے تھے تو آپ نے فرمایا کہ تھوڑی دیر ٹھہر جاؤ اور رات ہو جائے تب داخل ہو تاکہ پریشان بالوں والی کنگھا کر لیوے اورجن کے شوہرموجود نہیں تھے وہ اپنے بال صاف کر لیں ۔",
                "urduNarrator": "ہم سے ابو النعمان نے بیان کیا ، کہا ہم سے ہشیم نے بیان کیا ، کہا ہم سے سیا ر بن ابی سیار نے بیان کیا ، ان سے عامر شعبی نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا سَيَّارٌ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَفَلْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مِنْ غَزْوَةٍ فَتَعَجَّلْتُ عَلَى بَعِيرٍ لِي قَطُوفٍ، فَلَحِقَنِي رَاكِبٌ مِنْ خَلْفِي، فَنَخَسَ بَعِيرِي بِعَنَزَةٍ كَانَتْ مَعَهُ، فَانْطَلَقَ بَعِيرِي كَأَجْوَدِ مَا أَنْتَ رَاءٍ مِنَ الإِبِلِ، فَإِذَا النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا يُعْجِلُكَ ‏\"‏‏.‏ قُلْتُ كُنْتُ حَدِيثَ عَهْدٍ بِعُرُسٍ‏.‏ قَالَ ‏\"‏ بِكْرًا أَمْ ثَيِّبًا ‏\"‏‏.‏ قُلْتُ ثَيِّبٌ‏.‏ قَالَ ‏\"‏ فَهَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ ‏\"‏‏.‏ قَالَ فَلَمَّا ذَهَبْنَا لِنَدْخُلَ قَالَ ‏\"‏ أَمْهِلُوا حَتَّى تَدْخُلُوا لَيْلاً ـ أَىْ عِشَاءً ـ لِكَىْ تَمْتَشِطَ الشَّعِثَةُ وَتَسْتَحِدَّ الْمُغِيبَةُ ‏\"‏‏.‏",
                "headingArabic": "الثَّيِّبَاتِ",
                "headingUrdu": "شوہر دیدہ عورتوں سے نکاح",
                "headingEnglish": "The marrying of matrons",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4856,
                "hadithNumber": "5080",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "When I got married, Allah's Messenger (ﷺ) said to me, \"What type of lady have you married?\" I replied, \"I have married a matron' He said, \"Why, don't you have a liking for the virgins and for fondling them?\" Jabir also said: Allah's Messenger (ﷺ) said, \"Why didn't you marry a young girl so that you might play with her and she with you?' When I (Shobah) narrated this Hadith to Amr bin Dinaar, he said that he heard that Jabir bin Abdullah رضی اللہ عنہما say: Allah's Apostle said to me: Why don't you marry a young girl so that you may play with her, and she may play with you?'",
                "hadithUrdu": "میں نے شادی کی تو نبی کریم صلی اللہ علیہ وسلم نے مجھ سے دریافت فرمایا کہ کس سے شادی کی ہے ؟ میں نے عرض کیا کہ ایک عورت سے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کنواری سے کیوں نہ کی کہ اس کے ساتھ تم کھیل کو د کرتے ۔ محارب نے کہا کہ پھر میں نے آنحضرت صلی اللہ علیہ وسلم کا یہ ارشاد عمرو بن دینا ر سے بیان کیا تو انہوں نے کہا کہ میں نے حضرت جابر بن عبداللہ رضی اللہ عنہماسے سناہے ۔ مجھ سے انہوں نے آنحضرت صلی اللہ علیہ وسلم کا فرمان اس طرح بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا تم نے کسی کنواری عورت سے شادی کیوں نہ کی کہ تم اس کے ساتھ کھیل کود کرتے اور وہ تمہارے ساتھ کھیلتی ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے محارب بن دثار نے بیان کیا ، کہا کہ میں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے عرض کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَارِبٌ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، رضى الله عنهما يَقُولُ تَزَوَّجْتُ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا تَزَوَّجْتَ ‏\"‏‏.‏ فَقُلْتُ تَزَوَّجْتُ ثَيِّبًا‏.‏ فَقَالَ ‏\"‏ مَا لَكَ وَلِلْعَذَارَى وَلِعَابِهَا ‏\"‏‏.‏ فَذَكَرْتُ ذَلِكَ لِعَمْرِو بْنِ دِينَارٍ فَقَالَ عَمْرٌو سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4857,
                "hadithNumber": "5081",
                "englishNarrator": "Narrated 'Urwa:",
                "hadithEnglish": "The Prophet (ﷺ) asked Abu Bakr رضی اللہ عنہ for `Aisha's hand in marriage. Abu Bakr رضی اللہ عنہ said \"But I am your brother.\" The Prophet (ﷺ) said, \"You are my brother in Allah's religion and His Book, but she (Aisha) is lawful for me to marry.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے عائشہ سے شادی کے لئے ابوبکر صدیق رضی اللہ عنہ سے کہا ۔ ابوبکر رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم سے عرض کی کہ میں آپ کا بھائی ہوں ۔ ( تو عائشہ کیسے نکاح کریں گے ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے دین اور اس کی کتاب پر ایمان لانے کے رشتہ سے تم میرے بھائی ہو اور عائشہ میرے لئے حلال ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم سے لیث بن سعد نے ، ان سے یزید بن حبیب نے ، ان سے عراک بن مالک نے اور ان سے عروہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ، عَنْ عِرَاكٍ، عَنْ عُرْوَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَطَبَ عَائِشَةَ إِلَى أَبِي بَكْرٍ فَقَالَ لَهُ أَبُو بَكْرٍ إِنَّمَا أَنَا أَخُوكَ، فَقَالَ ‏ \"‏ أَنْتَ أَخِي فِي دِينِ اللَّهِ وَكِتَابِهِ وَهْىَ لِي حَلاَلٌ ‏\"‏‏.‏",
                "headingArabic": "تَزْوِيجِ الصِّغَارِ مِنَ الْكِبَارِ",
                "headingUrdu": "جوان عورت کا بوڑھے آدمی سے نکاح",
                "headingEnglish": "The marrying of young lady to an elderly man",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4858,
                "hadithNumber": "5082",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The best women are the riders of the camels and the righteous among the women of Quraish. They are the kindest women to their children in their childhood and the more careful women of the property of their husbands.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اونٹ پر سوار ہونے والی ( عرب ) عورتوں میں بہترین عورت قریش کی صالح عورت ہوتی ہے جو اپنے بچے سے بہت زیا دہ محبت کرنے والی اور اپنے شوہر کے مال اسباب میں اس کی بہت عمدہ نگہبان و نگراں ثابت ہوتی ہے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، ان سے ابوالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ خَيْرُ نِسَاءٍ رَكِبْنَ الإِبِلَ صَالِحُو نِسَاءِ قُرَيْشٍ، أَحْنَاهُ عَلَى وَلَدٍ فِي صِغَرِهِ وَأَرْعَاهُ عَلَى زَوْجٍ فِي ذَاتِ يَدِهِ ‏\"‏‏.‏",
                "headingArabic": "إِلَى مَنْ يَنْكِحُ‏",
                "headingUrdu": "شادی میں کس قسم کی عورتیں تلاش کرنی چاہئیں؟",
                "headingEnglish": "What type of women should one seek in marriage?",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4859,
                "hadithNumber": "5083",
                "englishNarrator": "Narrated Abu Burda's father:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, any man who has a slave girl whom he educates properly, teaches good manners, manumits and marries her, will get a double reward And if any man of the people of the Scriptures believes in his own prophet and then believes in me too, he will (also) get a double reward And any slave who fulfills his duty to his master and to his Lord, will (also) get a double reward.\" Shabi said:  Learn this Hadith from us in exchange for nothing wherease a journey to Madinah was undertaken for getting a Hadith briefer than it. Hadrat Abu Musa Ashari haas reported with an other authority: Manumitted her and then gave complete jointure.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : جس شخص کے پاس لونڈی ہو وہ اسے تعلیم دے اور خوب اچھی طرح دے ، اسے ادب سکھا ئے اور پوری کوشش اور محنت کے ساتھ سکھائے اور اس کے بعد اسے آزاد کر کے اس سے شادی کر لے تو اسے دہر اثواب ملتا ہے اور اہل کتاب میں سے جو شخص بھی اپنے نبی پر ایمان رکھتا ہو اور مجھ پر ایما ن لائے تو اسے دوہر ا ثواب ملتا ہے اور جو غلام اپنے آقا کے حقوق بھی ادا کرتا ہے اور اپنے رب کے حقوق بھی ادا کرتا ہے اسے دہرا ثواب ملتا ہے .عامر شعبی نے ( اپنے شاگرد سے اس حدیث کو سنا نے کے بعد کہا کہ بغیر کسی مشقت اورمحنت کے اسے سیکھ لو ۔ اس سے پہلے طالب علموں کو اس حدیث سے کم کے لئے بھی مدینہ تک کا سفر کرنا پڑتا تھا ۔ اور ابوبکرنے بیان کیا ابو حصین سے ، اس نے ابوبردہ سے ، اس نے اپنے والد سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ ” اس شخص نے باندی کو ( نکاح کرنے کے لئے ) آزادکر دیا اور یہی آزادی اس کا مہر مقرر کی ۔ “",
                "urduNarrator": "ہم سے موسیٰ بن اسمٰعیل نے بیان کیا ، کہا ہم سے عبد الوحد بن زیاد نے ، کہا ہم سے صالح بن صالح ہمدانی نے ، کہا ہم سے عامر شعبی نے ، کہا کہ مجھ سے ابوبردہ نے بیان کیا اپنے والد سے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا صَالِحُ بْنُ صَالِحٍ الْهَمْدَانِيُّ، حَدَّثَنَا الشَّعْبِيُّ، قَالَ حَدَّثَنِي أَبُو بُرْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيُّمَا رَجُلٍ كَانَتْ عِنْدَهُ وَلِيدَةٌ فَعَلَّمَهَا فَأَحْسَنَ تَعْلِيمَهَا، وَأَدَّبَهَا فَأَحْسَنَ تَأْدِيبَهَا، ثُمَّ أَعْتَقَهَا وَتَزَوَّجَهَا فَلَهُ أَجْرَانِ، وَأَيُّمَا رَجُلٍ مِنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ وَآمَنَ بِي فَلَهُ أَجْرَانِ، وَأَيُّمَا مَمْلُوكٍ أَدَّى حَقَّ مَوَالِيهِ وَحَقَّ رَبِّهِ فَلَهُ أَجْرَانِ ‏\"‏‏.‏ قَالَ الشَّعْبِيُّ خُذْهَا بِغَيْرِ شَىْءٍ قَدْ كَانَ الرَّجُلُ يَرْحَلُ فِيمَا دُونَهُ إِلَى الْمَدِينَةِ‏.‏ وَقَالَ أَبُو بَكْرٍ عَنْ أَبِي حَصِينٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ أَعْتَقَهَا ثُمَّ أَصْدَقَهَا ‏\"‏‏.‏",
                "headingArabic": "اتِّخَاذِ السَّرَارِيِّ",
                "headingUrdu": "عورتوں کو اسیر کرنا اور اپنی لونڈی کو آزاد کرنا",
                "headingEnglish": "Having female captives and manumitting one's own slave-girl",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4860,
                "hadithNumber": "5084",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said: Abraham did not tell lies except three. (One of them was) when Abraham passed by a tyrant and (his wife) Sara was accompanying him (Abu Huraira then mentioned the whole narration and said:) (The tyrant) gave her Hajar. Sara said, \"Allah saved me from the hands of the Kafir (i.e. infidel) and gave me Hajar to serve me.\" (Abu Huraira رضی اللہ عنہ added:) That (Hajar) is your mother, O Banu Ma'-As-Sama' (i.e., the Arabs).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا   حضرت ابراہیم علیہ السلام کی زبان سے تین مرتبہ کے سوا کبھی دین میں جھوٹ بات نہیں نکلی ۔ ایک مرتبہ آپ ایک ظالم بادشاہ کی حکومت سے گزر ے آپ کے ساتھ آپ کی بیوی سارہ علیہ السلام تھیں ۔ پھر پورا واقعہ بیان کیا ( کہ باد شاہ کے سامنے ) آپ نے سارہ علیہ السلام کو اپنی بہن ( یعنی دینی بہن ) کہا ۔ پھر اس بادشاہ نے سارہ علیہ السلام کو ہاجرہ ( ہاجرہ ) کو دے دیا ۔ ( بی بی سارہ علیہ السلام نے ابراہیم علیہ السلام سے ) کہا کہ اللہ تعالیٰ نے کافر کے ہاتھ کو روک دیا اور آجر ( ہاجرہ ) کو میری خدمت کے لئے دلوا دیا ۔ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ اے آسمان کے پانی کے بیٹو ! یعنی اے عرب والو ! یہی ہاجرہ علیہ السلام تمہاری ماں ہیں ۔",
                "urduNarrator": "ہم سے سعید بن تلید نے بیان کیا ، کہا کہ مجھے عبداللہ بن وہب نے خبر دی ، کہا کہ مجھے جریر بن حازم نے خبر د ی ، انہیں ایوب سختیانی نے ، انہیں محمد بن سیرین نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ ( دوسری سند ) ہم سے سلیمان بن حرب نے بیان کیا ، ان سے حماد بن زید نے ، ان سے ایوب سختیانی نے ، ان سے محمد بن سیرین نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ تَلِيدٍ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا سُلَيْمَانُ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ ‏{‏قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم‏}‏ ‏ \"‏ لَمْ يَكْذِبْ إِبْرَاهِيمُ إِلاَّ ثَلاَثَ كَذَبَاتٍ بَيْنَمَا إِبْرَاهِيمُ مَرَّ بِجَبَّارٍ وَمَعَهُ سَارَةُ ـ فَذَكَرَ الْحَدِيثَ ـ فَأَعْطَاهَا هَاجَرَ قَالَتْ كَفَّ اللَّهُ يَدَ الْكَافِرِ وَأَخْدَمَنِي آجَرَ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَتِلْكَ أُمُّكُمْ يَا بَنِي مَاءِ السَّمَاءِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4861,
                "hadithNumber": "5085",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) stayed for three days between Khaibar and Medina, and there he consummated his marriage to Safiyya bint Huyai رضی اللہ عنہا. I invited the Muslims to the wedding banquet in which neither meat nor bread was offered. He ordered for leather dining-sheets to be spread, and dates, dried yoghurt and butter were laid on it, and that was the Prophet's wedding banquet. The Muslims wondered, \"Is she (Saffiyya) considered as his wife or his slave girl?\" Then they said, \"If he orders her to veil herself, she will be one of the mothers of the Believers; but if he does not order her to veil herself, she will be a slave girl. So when the Prophet (ﷺ) proceeded from there, he spared her a space behind him (on his shecamel) and put a screening veil between her and the people.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے خیبر اور مدینہ کے درمیان تین دن تک قیام کیا اور یہیں ام المؤمنین حضرت صفیہ بنت حیی رضی اللہ عنہا کے ساتھ خلوت کی ۔ پھر میں نے آنحضرت صلی اللہ علیہ وسلم کے ولیمہ کی مسلمانوں کو دعوت دی ۔ اس دعوت ولیمہ میں نہ تو روٹی تھی اور نہ گوشت تھا ۔ دسترخوان بچھا نے کا حکم ہوا اور اس پر کھجور ، پنیر اور گھی رکھ دیا گیا اور یہی آنحضرت صلی اللہ علیہ وسلم کا ولیمہ تھا ۔ بعض مسلمانوں نے پوچھا کہ حضرت صفیہ امہات المؤمنین میں سے ہیں ( یعنی آنحضرت صلی اللہ علیہ وسلم نے ان سے نکاح کیا ہے ) یا لونڈی کی حیثیت سے آپ نے ان کے ساتھ خلوت کی ہے ؟ اس پرکچھ لوگو ں نے کہا کہ اگر آنحضرت صلی اللہ علیہ وسلم ان کے لئے پردہ کا انتظام فرمائیں تو اس سے ثابت ہو گا کہ وہ امہات المؤمنین میں سے ہیں اور اگر ان کے لئے پردہ کا اہتمام نہ کریں تو اس سے ثابت ہو گا کہ وہ لونڈی کی حیثیت سے آپ کے ساتھ ہیں ۔ پھر جب کوچ کرنے کا وقت ہوا تو آنحضرت صلی اللہ علیہ وسلم نے ان کے لئے اپنی سواری پر بیٹھنے کے لئے جگہ بنا ئی اور ان کے لئے پردہ ڈالا تاکہ لوگوں کو وہ نظر نہ آئیں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے اسمٰعیل بن جعفر نے بیان کیا ، ان سے حمیدی نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أَقَامَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ خَيْبَرَ وَالْمَدِينَةِ ثَلاَثًا يُبْنَى عَلَيْهِ بِصَفِيَّةَ بِنْتِ حُيَىٍّ فَدَعَوْتُ الْمُسْلِمِينَ إِلَى وَلِيمَتِهِ فَمَا كَانَ فِيهَا مِنْ خُبْزٍ وَلاَ لَحْمٍ، أُمِرَ بِالأَنْطَاعِ فَأَلْقَى فِيهَا مِنَ التَّمْرِ وَالأَقِطِ وَالسَّمْنِ فَكَانَتْ وَلِيمَتَهُ، فَقَالَ الْمُسْلِمُونَ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ أَوْ مِمَّا مَلَكَتْ يَمِينُهُ، فَقَالُوا إِنْ حَجَبَهَا فَهْىَ مِنْ أُمَّهَاتِ الْمُؤْمِنِينَ، وَإِنْ لَمْ يَحْجُبْهَا فَهْىَ مِمَّا مَلَكَتْ يَمِينُهُ، فَلَمَّا ارْتَحَلَ وَطَّى لَهَا خَلْفَهُ وَمَدَّ الْحِجَابَ بَيْنَهَا وَبَيْنَ النَّاسِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4862,
                "hadithNumber": "5086",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) manumitted Safiyya رضی اللہ عنہا and regarded her manumission as her Mahr.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے حضرت صفیہ رضی اللہ عنہا کو آزاد کیا اور ان کی آزادی کو ان کا مہر قرار دیا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت بنانی اورشعیب بن حبحاب نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، وَشُعَيْبِ بْنِ الْحَبْحَابِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَعْتَقَ صَفِيَّةَ، وَجَعَلَ عِتْقَهَا صَدَاقَهَا‏.‏",
                "headingArabic": "مَنْ جَعَلَ عِتْقَ الأَمَةِ صَدَاقَهَا",
                "headingUrdu": "لونڈی کو اس کی مہر کے طور پر چھوڑنا",
                "headingEnglish": "The manumission of a slave-girl as her Mahr",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4863,
                "hadithNumber": "5087",
                "englishNarrator": "Narrated Sahl bin Sa`d As-Sa`idi رضی اللہ عنہ :",
                "hadithEnglish": "A woman came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I have come to give you myself in marriage (without Mahr).\" Allah's Messenger (ﷺ) looked at her. He looked at her carefully and fixed his glance on her and then lowered his head. When the lady saw that he did not say anything, she sat down. A man from his companions got up and said, \"O Allah's Messenger (ﷺ)! If you are not in need of her, then marry her to me.\" The Prophet (ﷺ) said, \"Have you got anything to offer?\" The man said, \"No, by Allah, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said (to him), \"Go to your family and see if you have something.\" The man went and returned, saying, \"No, by Allah, I have not found anything.\" Allah's Apostle said, \"(Go again) and look for something, even if it is an iron ring.\" He went again and returned, saying, \"No, by Allah, O Allah's Messenger (ﷺ)! I could not find even an iron ring, but this is my Izar (waist sheet).\" He had no rida. He added, \"I give half of it to her.\" Allah's Messenger (ﷺ) said, \"What will she do with your Izar? If you wear it, she will be naked, and if she wears it, you will be naked.\" So that man sat down for a long while and then got up (to depart). When Allah's Messenger (ﷺ) saw him going, he ordered that he be called back. When he came, the Prophet (ﷺ) said, \"How much of the Qur'an do you know?\" He said, \"I know such Sura and such Sura,\" counting them. The Prophet (ﷺ) said, \"Do you know them by heart?\" He replied, \"Yes.\" The Prophet (ﷺ) said, \"Go, I marry her to you for that much of the Qur'an which you have.\"",
                "hadithUrdu": "ایک عورت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آئی اور عرض کیا کہ یا رسول اللہ ! میں آپ کی خدمت میں اپنے آپ کو آپ کے لئے وقف کرنے حاضر ہوئی ہوں ۔ راوی نے بیان کیا کہ پھر انحضرت صلی اللہ علیہ وسلم نے نظر اٹھا کر اسے دیکھا ۔ پھر آپ نے نظر کو نیچی کر لیا اور پھر اپنا سر جھکا لیا ۔ جب اس عورت نے دیکھا کہ آنحضرت صلی اللہ علیہ وسلم نے ان کے متعلق کوئی فیصلہ نہیں فرمایا تو وہ بیٹھ گئی ۔ اس کے بعد آپ صلی اللہ علیہ وسلم کے ایک صحابی کھڑے ہوئے اور عرض کیا یا رسول اللہ ! اگر آپ کو ان سے نکاح کی ضرورت نہیں ہے تو ان سے میرا نکاح کر دیجئیے ۔ آپ نے دریافت فرمایا تمہارے پاس ( مہر کے لئے ) کوئی چیز ہے ؟ انہوں نے عرض کیا کہ نہیں اللہ کی قسم یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اپنے گھر جا اور دیکھو ممکن ہے تمہیں کوئی چیز مل جائے ۔ وہ گئے اور واپس آ گئے اور عرض کیا اللہ کی قسم میں نے کچھ نہیں پایا ۔ آنحضرت صلی اللہ علیہ وسلم نے فر مایا اگر لوہے کی ایک انگوٹھی بھی مل جائے تو لے آؤ ۔ وہ گئے اور واپس آ گئے اور عرض کیا ۔ اللہ کی قسم ، یا رسول اللہ ! میرے پاس لوہے کی ایک انگوٹھی بھی نہیں البتہ میرے پاس ایک تہمد ہے ۔ انہیں ( خاتون کو ) اس میں سے آدھا دے دیجئیے ۔ حضرت سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ ا ن کے پاس چادر بھی نہیں تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا یہ تمہارے اس تہمد کا کیا کرے گی ۔ اگر تم اسے پہنو گے تو ان کے لئے اس میں سے کچھ نہیں بچے گا اور اگر وہ پہن لے تو تمہارے لئے کچھ نہیں رہے گا ۔ اس کے بعد وہ صحابی بیٹھ گئے ۔ کافی دیر تک بیٹھے رہنے کے بعد جب وہ کھڑے ہوئے تو آنحضرت صلی اللہ علیہ وسلم نے انہیں دیکھا کہ وہ واپس جا رہے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں بلوایا جب وہ آئے تو آپ نے دریافت فرمایا کہ تمہیں قرآن مجید کتنا یاد ہے ؟ انہوں نے عرض کیا کہ فلاں فلاں سورتیں یاد ہیں ۔ انہوں نے گن کر بتا ئیں ۔ آنحضرت صلی اللہ علیہ وسلم نے پو چھا کیا تم انہیں بغیر دیکھے پڑھ سکتے ہو ؟ انہوں نے عرض کیا کہ جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر جاؤ ۔ میں نے انہیں تمہارے نکاح میں دیا ۔ ان سورتوں کے بدلے جو تمہیں یاد ہیں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے عبد العزیز بن ابی حازم نے بیان کیا ، ان سے ان کے والد نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ جِئْتُ أَهَبُ لَكَ نَفْسِي قَالَ فَنَظَرَ إِلَيْهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَعَّدَ النَّظَرَ فِيهَا وَصَوَّبَهُ ثُمَّ طَأْطَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَأْسَهُ فَلَمَّا رَأَتِ الْمَرْأَةُ أَنَّهُ لَمْ يَقْضِ فِيهَا شَيْئًا جَلَسَتْ فَقَامَ رَجُلٌ مِنْ أَصْحَابِهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنْ لَمْ يَكُنْ لَكَ بِهَا حَاجَةٌ فَزَوِّجْنِيهَا‏.‏ فَقَالَ ‏\"‏ وَهَلْ عِنْدَكَ مِنْ شَىْءٍ ‏\"‏‏.‏ قَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ اذْهَبْ إِلَى أَهْلِكَ فَانْظُرْ هَلْ تَجِدُ شَيْئًا ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ لاَ وَاللَّهِ مَا وَجَدْتُ شَيْئًا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْظُرْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ وَلاَ خَاتَمًا مِنْ حَدِيدٍ وَلَكِنْ هَذَا إِزَارِي ـ قَالَ سَهْلٌ مَا لَهُ رِدَاءٌ فَلَهَا نِصْفُهُ ـ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا تَصْنَعُ بِإِزَارِكَ إِنْ لَبِسْتَهُ لَمْ يَكُنْ عَلَيْهَا مِنْهُ شَىْءٌ وَإِنْ لَبِسَتْهُ لَمْ يَكُنْ عَلَيْكَ شَىْءٌ ‏\"‏‏.‏ فَجَلَسَ الرَّجُلُ حَتَّى إِذَا طَالَ مَجْلِسُهُ قَامَ فَرَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مُوَلِّيًا فَأَمَرَ بِهِ فَدُعِيَ فَلَمَّا جَاءَ قَالَ ‏\"‏ مَاذَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏ قَالَ مَعِي سُورَةُ كَذَا وَسُورَةُ كَذَا عَدَّدَهَا‏.‏ فَقَالَ ‏\"‏ تَقْرَؤُهُنَّ عَنْ ظَهْرِ قَلْبِكَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَقَدْ مَلَّكْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏",
                "headingArabic": "تَزْوِيجِ الْمُعْسِرِ لِقَوْلِهِ تَعَالَى: {إِنْ يَكُونُوا فُقَرَاءَ يُغْنِهِمُ اللَّهُ مِنْ فَضْلِهِ}",
                "headingUrdu": "’’اگر وہ غریب ہوں گے تو اللہ انہیں اپنے فضل سے غنی کر دے گا۔‘‘",
                "headingEnglish": "\"If they be poor, Allah will enrich them out of His Bounty.\"",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4864,
                "hadithNumber": "5088",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Abu Hudhaifa bin `Utba bin Rabi`a bin `Abdi Shams who had witnessed the battle of Badr along with the Prophet (ﷺ) adopted Salim رضی اللہ عنہ as his son, to whom he married his niece, Hind bint Al-Walid bin `Utba bin Rabi`a; and Salim رضی اللہ عنہ was the freed slave of an Ansar woman, just as the Prophet (ﷺ) had adopted Zaid as his son. It was the custom in the Pre-lslamic Period that if somebody adopted a boy, the people would call him the son of the adoptive father and he would be the latter's heir. But when Allah revealed the Divine Verses: 'Call them by (the names of) their fathers . . . your freed-slaves,' (33.5) the adopted persons were called by their fathers' names. The one whose father was not known, would be regarded as a Maula and your brother in religion. Later on Sahla bint Suhail bin `Amr Al-Quraishi Al-`Amiri رضی اللہ عنہ -- and she was the wife of Abu- Hudhaifa bin `Utba رضی اللہ عنہ --came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! We used to consider Salim رضی اللہ عنہ as our (adopted) son, and now Allah has revealed what you know (regarding adopted sons).\" The sub-narrator then mentioned the rest of the narration.",
                "hadithUrdu": "ابوحذیفہ بن عتبہ بن ربیعہ بن عبد شمس ( مہشم ) نے جو ان صحابہ میں سے تھے جنہوں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ غزوہ بدر میں شرکت کی تھی ۔ سالم بن معقل رضی اللہ عنہ کو لے پالک بیٹا بنایا ، اور پھر ان کا نکاح اپنے بھائی کی لڑکی ہندہ بنت الولید بن عتبہ بن ربیعہ سے کر دیا ۔ پہلے سالم رضی اللہ عنہ ایک انصاری خاتون ( شبیعہ بنت یعار ) کے آزاد کردہ غلام تھے لیکن حذیفہ نے ان کو اپنا منہ بولا بیٹا بنایا تھا جیسا کہ نبی کریم صلی اللہ علیہ وسلم نے زید کو ( جو آپ ہی کے آزاد کردہ غلام تھے ) اپنا لے پالک بیٹا بنایا تھا جاہلیت کے زمانے میں یہ دستور تھا کہ اگر کوئی شخص کسی کو لے پالک بیٹا بنا لیتا تو لوگ اسے اسی کی طرف نسبت کر کے پکارا کرتے تھے اور لے پالک بیٹا اس کی میراث میں سے بھی حصہ پاتا آخر جب سورۃ الحجرات میں یہ آیت اتری کہ ” انہیں ان کے حقیقی باپوں کی طرف منسوب کر کے پکارو “ اللہ تعالیٰ کے فرمان ” وموالیکم “ تک تو لوگ انہیں ان کے باپوں کی طرف منسوب کر کے پکارنے لگے جس کے باپ کا علم نہ ہوتا تو اسے ” مولی “ اور دینی بھائی کہا جاتا ۔ پھر سہلہ بنت سہیل بن عمرو القرشی ثم العامدی رضی اللہ عنہا جو حضرت ابوحذیفہ رضی اللہ عنہ کی بیوی ہیں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا یا رسول اللہ ! ہم تو سالم کو اپنا حقیقی جیسا بیٹا سمجھتے تھے اب اللہ نے جو حکم اتارا وہ آپ کو معلوم ہے پھر آخر تک حدیث بیان کی ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے ، انہیں عروہ بن زبیرنے خبر دی اور انہیں عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ أَبَا حُذَيْفَةَ بْنَ عُتْبَةَ بْنِ رَبِيعَةَ بْنِ عَبْدِ شَمْسٍ،، وَكَانَ، مِمَّنْ شَهِدَ بَدْرًا مَعَ النَّبِيِّ صلى الله عليه وسلم تَبَنَّى سَالِمًا، وَأَنْكَحَهُ بِنْتَ أَخِيهِ هِنْدَ بِنْتَ الْوَلِيدِ بْنِ عُتْبَةَ بْنِ رَبِيعَةَ وَهْوَ مَوْلًى لاِمْرَأَةٍ مِنَ الأَنْصَارِ، كَمَا تَبَنَّى النَّبِيُّ صلى الله عليه وسلم زَيْدًا، وَكَانَ مَنْ تَبَنَّى رَجُلاً فِي الْجَاهِلِيَّةِ دَعَاهُ النَّاسُ إِلَيْهِ وَوَرِثَ مِنْ مِيرَاثِهِ حَتَّى أَنْزَلَ اللَّهُ ‏{‏ادْعُوهُمْ لآبَائِهِمْ‏}‏ إِلَى قَوْلِهِ ‏{‏وَمَوَالِيكُمْ‏}‏ فَرُدُّوا إِلَى آبَائِهِمْ، فَمَنْ لَمْ يُعْلَمْ لَهُ أَبٌ كَانَ مَوْلًى وَأَخًا فِي الدِّينِ، فَجَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلِ بْنِ عَمْرٍو الْقُرَشِيِّ ثُمَّ الْعَامِرِيِّ ـ وَهْىَ امْرَأَةُ أَبِي حُذَيْفَةَ ـ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَرَى سَالِمًا وَلَدًا وَقَدْ أَنْزَلَ اللَّهُ فِيهِ مَا قَدْ عَلِمْتَ فَذَكَرَ الْحَدِيثَ‏.‏",
                "headingArabic": "الأَكْفَاءِ فِي الدِّينِ",
                "headingUrdu": "میاں بیوی کا مذہب ایک ہونا چاہیے۔",
                "headingEnglish": "Husband and wife should have the same religion",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4865,
                "hadithNumber": "5089",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) entered upon Dubaa bint Az-Zubair رضی اللہ عنہما and said to her, \"Do you have a desire to perform the Hajj?\" She replied, \"By Allah, I feel sick.\" He said to her, \"Intend to perform Hajj and stipulate something by saying, 'O Allah, I will finish my Ihram at any place where You stop me (i.e. I am unable to go further).\" She was the wife of Al-Miqdad bin Al-Aswad رضی اللہ عنہ .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ضباعہ بنت زبیر رضی اللہ عنہما کے پاس گئے ( یہ زبیر عبدالمطلب کے بیٹے اور آنحضرت صلی اللہ علیہ وسلم کے چچا تھے ) اور ان سے فرمایا شاید تمہارا ارادہ حج کا ہے ؟ انہوں نے عرض کیا اللہ کی قسم میں تو اپنے آپ کو بیمار پاتی ہوں آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ پھربھی حج کا احرام باندھ لے ۔ البتہ شرط لگا لینا اور یہ کہہ لینا کہ اے اللہ ! میں اس وقت حلال ہو جاؤں گی جب تو مجھے ( مرض کی وجہ سے ) روک لے گا ۔ اور ( ضباعہ بنت زبیر قریشی رضی اللہ عنہا ) مقداد بن اسود رضی اللہ عنہ کے نکاح میں تھیں ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى ضُبَاعَةَ بِنْتِ الزُّبَيْرِ فَقَالَ لَهَا ‏\"‏ لَعَلَّكِ أَرَدْتِ الْحَجَّ ‏\"‏‏.‏ قَالَتْ وَاللَّهِ لاَ أَجِدُنِي إِلاَّ وَجِعَةً‏.‏ فَقَالَ لَهَا ‏\"‏ حُجِّي وَاشْتَرِطِي، قُولِي اللَّهُمَّ مَحِلِّي حَيْثُ حَبَسْتَنِي ‏\"‏‏.‏ وَكَانَتْ تَحْتَ الْمِقْدَادِ بْنِ الأَسْوَدِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4866,
                "hadithNumber": "5090",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A woman is married for four things, i.e., her wealth, her family status, her beauty and her religion. So you should marry the religious woman (otherwise) you will be a losers.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، عورت سے نکاح چار چیزوں کی بنیاد پر کیا جاتا ہے اس کے مال کی وجہ سے اور اس کے خاندانی شرف کی وجہ سے اور اس کی خوبصورتی کی وجہ سے اور اس کے دین کی وجہ سے اور تو دیندار عورت سے نکاح کر کے کامیابی حاصل کر ، اگر ایسا نہ کرے تو تیرے ہاتھوں کومٹی لگے گی ( یعنی اخیر میں تجھ کو ندامت ہو گی ) ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحی بن سعید قطان نے ، ان سے عبیداللہ عموی نے ، کہ مجھ سے سعید بن ابی سعید نے ، ان سے ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ   نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ تُنْكَحُ الْمَرْأَةُ لأَرْبَعٍ لِمَالِهَا وَلِحَسَبِهَا وَجَمَالِهَا وَلِدِينِهَا، فَاظْفَرْ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4867,
                "hadithNumber": "5091",
                "englishNarrator": "Narrated Sahl:",
                "hadithEnglish": "A man passed by Allah's Messenger (ﷺ) and Allah s Apostle asked (his companions) \"What do you say about this (man)?\" They replied \"If he asks for a lady's hand, he ought to be given her in marriage; and if he intercedes (for someone) his intercessor should be accepted; and if he speaks, he should be listened to.\" Allah's Messenger (ﷺ) kept silent, and then a man from among the poor Muslims passed by, an Allah's Apostle asked (them) \"What do you say about this man?\" They replied, \"If he asks for a lady's hand in marriage he does not deserve to be married, and he intercedes (for someone), his intercession should not be accepted; And if he speaks, he should not be listened to.' Allah's Messenger (ﷺ) said, \"This poor man is better than so many of the first as filling the earth.'",
                "hadithUrdu": "ایک صاحب ( جو مالدار تھے ) رسول اللہ صلی اللہ علیہ وسلم کے سامنے سے گزرے ۔ آنحضرت صلی اللہ علیہ وسلم نے اپنے پاس موجود صحابہ سے پوچھا کہ یہ کیسا شخص ہے ؟ صحابہ نے عرض کیا کہ یہ اس لائق ہے کہ اگر یہ نکاح کا پیغام بھیجے تو اس سے نکاح کیا جائے ، اگر کسی کی سفارش کرے تو اس کی سفارش قبول کی جائے ، اگر کوئی بات کہے تو غور سے سنی جائے ۔ سہل نے بیان کیا کہ حضور اکرم صلی اللہ علیہ وسلم اس پر چپ ہو رہے ۔ پھر ایک دوسرے صاحب گزرے ، جو مسلمانوں کے غریب اور محتاج لوگوں میں شمار کئے جاتے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کہ اس کے متعلق تمہارا کیا خیال ہے ؟ صحابہ نے عرض کیا کہ یہ اس قابل ہے کہ اگر کسی کے یہاں نکاح کا پیغام بھیجے تو اس سے نکاح نہ کیا جائے اگر کسی کی سفارش کرے تو اس کی سفارش قبول نہ کی جائے ، اگر کوئی بات کہے تو اس کی بات نہ سنی جائے ۔ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا ، یہ شخص اکیلا پہلے شخص کی طرح دنیا بھر سے بہتر ہے ۔",
                "urduNarrator": "ہم سے ابراہیم بن حمزہ نے بیان کیا ، کہا ہم سے عبد العزیز بن ابی حازم نے ، ان سے ان کے والد سلمہ بن دینار نے ، ان سے سہل بن سعد ساعدی نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، قَالَ مَرَّ رَجُلٌ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا تَقُولُونَ فِي هَذَا ‏\"‏‏.‏ قَالُوا حَرِيٌّ إِنْ خَطَبَ أَنْ يُنْكَحَ، وَإِنْ شَفَعَ أَنْ يُشَفَّعَ، وَإِنْ قَالَ أَنْ يُسْتَمَعَ‏.‏ قَالَ ثُمَّ سَكَتَ فَمَرَّ رَجُلٌ مِنَ فُقَرَاءِ الْمُسْلِمِينَ فَقَالَ ‏\"‏ مَا تَقُولُونَ فِي هَذَا ‏\"‏‏.‏ قَالُوا حَرِيٌّ إِنْ خَطَبَ أَنْ لاَ يُنْكَحَ وَإِنْ شَفَعَ أَنْ لاَ يُشَفَّعَ، وَإِنْ قَالَ أَنْ لاَ يُسْتَمَعَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا خَيْرٌ مِنْ مِلْءِ الأَرْضِ مِثْلَ هَذَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4868,
                "hadithNumber": "5092",
                "englishNarrator": "Narrated 'Urwa:",
                "hadithEnglish": "He asked `Aisha رضی اللہ عنہا regarding the Verse: 'If you fear that you shall not be able to deal justly with the orphans (4.3) She said, O my nephew! This Verse refers to the orphan girl who is under the guardianship of her guardian who likes her beauty and wealth and wishes to (marry her and) curtails her Mahr. Such guardians have been forbidden to marry them unless they do justice by giving them their full Mahr, and they have been ordered to marry other than them. The people asked for the verdict of Allah's Apostle after that, so Allah revealed: 'They ask your instruction concerning the women . . . whom you desire to marry.' (4.127) So Allah revealed to them that if the orphan girl had beauty and wealth, they desired to marry her and for her family status. They can only marry them if they give them their full Mahr. And if they had no desire to marry them because of their lack of wealth and beauty, they would leave them and marry other women. So, as they used to leave them, when they had no interest, in them, they were forbidden to marry them when they had such interest, unless they treated them justly and gave them their full Mahr Apostle said, 'If at all there is evil omen, it is in the horse, the woman and the house. a lady is to be warded off. And the Statement of Allah: 'Truly, among your wives and your children, there are enemies for you (i.e may stop you from the obedience of Allah)' (64.14)",
                "hadithUrdu": "انہوں نے عائشہ رضی اللہ عنہا سے آیت ” اور اگر تمہیں خوف ہو کہ یتیم لڑکیوں کے بارے میں تم انصاف نہیں کر سکو گے ۔ “ ( سورۃ نساء ) کے متعلق سوال کیا ۔ عائشہ رضی اللہ عنہا نے کہا میرے بھانجے اس آیت میں اس یتیم لڑکی کا حکم بیان ہوا ہے جو اپنے ولی کی پرورش میں ہو اور اس کا ولی اس کی خوبصورتی اور مالداری پر ریجھ کر یہ چاہے کہ اس سے نکاح کرے لیکن اس کے مہر میں کمی کرنے کا بھی ارادہ ہو ۔ ایسے ولی کو اپنی زیر پرورش یتیم لڑکی سے نکاح کرنے سے منع کیا گیا ہے جب وہ ان کا مہر انصاف سے پورا ادا کریں گے اگر وہ ایسا نہ کریں تو پھر آیت میں ایسے ولیوں کو حکم دیا گیا کہ وہ اپنی زیر پرورش یتیم لڑکی کے سوا کسی اور سے نکاح کر لیں ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ لوگوں نے رسول اللہ سے اس کے بعد سوال کیا تو اللہ تعالیٰ نے سورۃ نساء میں آیت ویستفتونک فی النساء سے وتر غبون ان تنکحوھن تک نازل کی ۔ اس آیت میں اللہ تعالیٰ نے یہ حکم دیا کہ یتیم لڑکیا ں اگر خوبصورت اور صاحب مال ہوں تو ان کے ولی بھی ان کے ساتھ نکاح کر لینا چاہتے ہیں ، اس کا خاندان پسند کرتے ہیں اور مہر پورا ادا کر کے ان سے نکاح کر لیتے ہیں ۔ لیکن ان میں حسن کی کمی ہو اور مال بھی نہ ہو تو پھر ان کی طرف رغبت نہیں ہو گی اور وہ انہیں چھوڑ کر دوسری عورتوں سے نکاح کر لیتے ہیں ۔ عائشہ رضی اللہ عنہا نے کہا کہ آیت کا مطلب یہ ہے کہ جیسے اس وقت یتیم لڑکی کو چھوڑ دیتے ہیں جب وہ نادار ہو اور خوبصورت نہ ہو ایسے ہی اس وقت بھی چھوڑ دینا چاہئے جب وہ مالدار اور خوبصورت ہو البتہ اگر اس کے حق میں انصاف کریں اور اس کا مہر پورا ادا کریں تب اس سے نکاح کر سکتے ہیں ۔",
                "urduNarrator": "مجھ سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے ، ان سے عقیل نے ، ان سے ابن شہاب نے ، انہیں عروہ بن زبیر نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى‏}‏ قَالَتْ يَا ابْنَ أُخْتِي هَذِهِ الْيَتِيمَةُ تَكُونُ فِي حَجْرِ وَلِيِّهَا فَيَرْغَبُ فِي جَمَالِهَا وَمَالِهَا، وَيُرِيدُ أَنْ يَنْتَقِصَ صَدَاقَهَا، فَنُهُوا عَنْ نِكَاحِهِنَّ إِلاَّ أَنْ يُقْسِطُوا فِي إِكْمَالِ الصَّدَاقِ، وَأُمِرُوا بِنِكَاحِ مَنْ سِوَاهُنَّ، قَالَتْ وَاسْتَفْتَى النَّاسُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدَ ذَلِكَ، فَأَنْزَلَ اللَّهُ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ‏}‏ إِلَى ‏{‏وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏ فَأَنْزَلَ اللَّهُ لَهُمْ أَنَّ الْيَتِيمَةَ إِذَا كَانَتْ ذَاتَ جَمَالٍ وَمَالٍ رَغِبُوا فِي نِكَاحِهَا وَنَسَبِهَا فِي إِكْمَالِ الصَّدَاقِ، وَإِذَا كَانَتْ مَرْغُوبَةً عَنْهَا فِي قِلَّةِ الْمَالِ وَالْجَمَالِ تَرَكُوهَا وَأَخَذُوا غَيْرَهَا مِنَ النِّسَاءِ، قَالَتْ فَكَمَا يَتْرُكُونَهَا حِينَ يَرْغَبُونَ عَنْهَا فَلَيْسَ لَهُمْ أَنْ يَنْكِحُوهَا إِذَا رَغِبُوا فِيهَا إِلاَّ أَنْ يُقْسِطُوا لَهَا وَيُعْطُوهَا حَقَّهَا الأَوْفَى فِي الصَّدَاقِ‏.‏",
                "headingArabic": "الأَكْفَاءِ فِي الْمَالِ، وَتَزْوِيجِ الْمُقِلِّ الْمُثْرِيَةَ",
                "headingUrdu": "غریب آدمی کی شادی ایک مالدار عورت سے",
                "headingEnglish": "The marriage of a poor man with a well-to-do lady",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4869,
                "hadithNumber": "5093",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Evil omen is in the women, the house and the horse.'",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا نحوست عورت میں ، گھر میں اور گھوڑے میں ہو سکتی ہے ۔ ( نحوست بے برکتی اگر ہو تو ان میں ہو سکتی ہے ۔ )",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عبداللہ بن عمر رضی اللہ عنہما کے صاحبزادے حمزہ اور سالم نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ، وَسَالِمٍ، ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الشُّؤْمُ فِي الْمَرْأَةِ وَالدَّارِ وَالْفَرَسِ ‏\"‏‏.‏",
                "headingArabic": "مَا يُتَّقَى مِنْ شُؤْمِ الْمَرْأَةِ",
                "headingUrdu": "عورت کی کون سی بری شگون ہے جس سے بچنا ہے۔",
                "headingEnglish": "What evil omen of a lady is to be warded off",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4870,
                "hadithNumber": "5094",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Evil omen was mentioned before the Prophet: The Prophet (ﷺ) said, \"If there is evil omen in anything, it is in the house, the woman and the horse.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم کے سامنے نحوست کا ذکر کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر نحوست کسی چیز میں ہو تو گھر ، عورت اور گھوڑے میں ہو سکتی ہے ۔",
                "urduNarrator": "ہم سے محمد بن منہال نے بیان کیا ، انہوں نے کہا ہم سے یزید بن زریع نے بیان کیا ، ان سے عمر ان بن عسقانی نے بیان کیا ، ان سے ان کے والد اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا عُمَرُ بْنُ مُحَمَّدٍ الْعَسْقَلاَنِيُّ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ ذَكَرُوا الشُّؤْمَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنْ كَانَ الشُّؤْمُ فِي شَىْءٍ فَفِي الدَّارِ وَالْمَرْأَةِ وَالْفَرَسِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4871,
                "hadithNumber": "5095",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If at all there is bad omen, it is in the horse, the woman, and the house.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اگر ( نحوست ) کسی چیز میں ہو تو گھوڑے ، عورت اور گھر میں ہو سکتی ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہیں امام مالک نے خبر دی ، انہیں ابوحازم نے اور انہیں سہل بن سعد ساعدی رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنْ كَانَ فِي شَىْءٍ فَفِي الْفَرَسِ وَالْمَرْأَةِ وَالْمَسْكَنِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4872,
                "hadithNumber": "5096",
                "englishNarrator": "Narrated Usama bin Zaid رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"After me I have not left any trial more severe to men than women.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا میں نے اپنے بعد مردوں کے لئے عورتوں کے فتنہ سے بڑھ کر نقصان دینے والا اور کوئی فتنہ نہیں چھوڑاہے ۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے سلیمان تیمی نے بیان کیا ، انہوں نے ابوعثمان نہدی سے سنا اور انہوں نے اسامہ بن زید رضی اللہ عنہما سے روایت کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، قَالَ سَمِعْتُ أَبَا عُثْمَانَ النَّهْدِيَّ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا تَرَكْتُ بَعْدِي فِتْنَةً أَضَرَّ عَلَى الرِّجَالِ مِنَ النِّسَاءِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4873,
                "hadithNumber": "5097",
                "englishNarrator": "Narrated `Aisha:",
                "hadithEnglish": "Three principles were established because of Barira: (i) When Banra was manumitted she was given the option (to remain with her slave husband or not). (ii) Allah's Messenger (ﷺ) said \"The Wala of the slave) is for the one who manumits (the slave). (iii) When Allah's Messenger (ﷺ) entered (the house), he saw a cooking pot on the fire but he was given bread and meat soup from the soup of the home. The Prophet (ﷺ) said, \"Didn't I see the cooking pot (on the fire)?\" It was said, \"That is the meat given in charity to Barira, and you do not eat the (things given in) charity.\" The Prophet (ﷺ) said, \"It is an object of charity for Barira, and it is a present for us.\"",
                "hadithUrdu": "بریرہ کے ساتھ تین سنت قائم ہوتی ہیں ، انہیں آزاد کیا اور پھر اختیار دیا گیا ( کہ اگر چاہیں تو اپنے شوہر سابقہ سے اپنا نکاح فسخ کر سکتی ہیں ) اور رسول کریم صلی اللہ علیہ وسلم نے ( حضرت بریرہ رضی اللہ عنہا کے بارے میں ) فرمایا کہ ” ولاء “ آزادکرانے والے کے ساتھ قائم ہوئی ہے اور حضور اکرم صلی اللہ علیہ وسلم گھر میں داخل ہوئے تو ایک ہانڈی ( گوشت کی ) چولہے پر تھی ۔ پھر آنحضرت صلی اللہ علیہ وسلم کے لئے روٹی اور گھر کا سالن لایا گیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ( چولہے پر ) ہانڈی ( گوشت کی ) بھی تو میں نے دیکھی تھی ۔ عرض کیا گیا کہ وہ ہانڈی اس گوشت کی تھی جو بریرہ رضی اللہ عنہا کو صدقہ میں ملاتھااور آپ صلی اللہ علیہ وسلم صدقہ نہیں کھاتے ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا وہ اس کے لئے صدقہ ہے اور اب ہمارے لئے ان کی طرف سے تحفہ ہے ۔ ہم اسے کھا سکتے ہیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی انہیں ربیعہ بن ابوعبدالرحمن نے انہیں قاسم بن محمد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ فِي بَرِيرَةَ ثَلاَثُ سُنَنٍ عَتَقَتْ فَخُيِّرَتْ، وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ وَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَبُرْمَةٌ عَلَى النَّارِ، فَقُرِّبَ إِلَيْهِ خُبْزٌ وَأُدْمٌ مِنْ أُدْمِ الْبَيْتِ فَقَالَ ‏\"‏ لَمْ أَرَ الْبُرْمَةَ ‏\"‏‏.‏ فَقِيلَ لَحْمٌ تُصُدِّقَ عَلَى بَرِيرَةَ، وَأَنْتَ لاَ تَأْكُلُ الصَّدَقَةَ قَالَ ‏\"‏ هُوَ عَلَيْهَا صَدَقَةٌ، وَلَنَا هَدِيَّةٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4874,
                "hadithNumber": "5098",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "(regarding) the Verse: 'And if you fear that you shall not be able to deal justly with the orphans...' (4.3) It is about the orphan girl who is in the custody of a man who is her guardian, and he intends to marry her because of her wealth, but he treats her badly and does not manage her property fairly and honestly. Such a man should marry women of his liking other than her, two or three or four.",
                "hadithUrdu": "اللہ تعالیٰ کے ارشاد ” اور اگر تمہیں خوف ہو کہ تم یتیموں کے بارے میں انصاف نہیں کرسکوگے ۔ “ کے بارے میں فرمایا کہ اس سے مراد یتیم لڑکی ہے جو اپنے ولی کی پرورش میں ہو ۔ ولی اس سے اس کے مال کی وجہ سے شادی کرتے اور اچھی طرح اس سے سلوک نہ کرتے اور نہ اس کے مال کے بارے میں انصاف کرتے ایسے شخصوں کو یہ حکم ہوا کہ اس یتیم لڑکی سے نکاح نہ کریں بلکہ اس کے سوا جو عورتیں بھلی لگیں ان سے نکاح کر لیں ۔ دو دو ، تین تین یا چار چار تک کی اجازت ہے ۔",
                "urduNarrator": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، کہا ہم کو عبدہ نے خبر دی ، انہیں ہشام نے ، انہیں ان کے والد نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ، تُقْسِطُوا فِي الْيَتَامَى‏}‏‏.‏ قَالَتِ الْيَتِيمَةُ تَكُونُ عِنْدَ الرَّجُلِ وَهْوَ وَلِيُّهَا، فَيَتَزَوَّجُهَا عَلَى مَالِهَا، وَيُسِيءُ صُحْبَتَهَا، وَلاَ يَعْدِلُ فِي مَالِهَا، فَلْيَتَزَوَّجْ مَا طَابَ لَهُ مِنَ النِّسَاءِ سِوَاهَا مَثْنَى وَثُلاَثَ وَرُبَاعَ‏.‏",
                "headingArabic": "لاَ يَتَزَوَّجُ أَكْثَرَ مِنْ أَرْبَعٍ",
                "headingUrdu": "چار سے زیادہ شادیاں نہ کریں (ایک وقت میں)",
                "headingEnglish": "Not to marry more than four (at a time)",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4875,
                "hadithNumber": "5099",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "(the wife of the Prophet) that while Allah's Messenger (ﷺ) was with her, she heard a voice of a man asking permission to enter the house of Hafsa رضی اللہ عنہا . `Aisha رضی اللہ عنہا added: I said, \"O Allah's Messenger (ﷺ)! This man is asking permission to enter your house.\" The Prophet (ﷺ) said, \"I think he is so-and-so,\" naming the foster-uncle of Hafsa. `Aisha رضی اللہ عنہا said, \"If so-and-so,\" naming her foster uncle, \"were living, could he enter upon me?\" The Prophet (ﷺ) said, \"Yes, for foster suckling relations make all those things unlawful which are unlawful through corresponding birth (blood) relations.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم ان کے یہاں تشریف رکھتے تھے اور آپ نے سنا کہ کوئی صاحب ام المؤمنین حفصہ رضی اللہ عنہا کے گھر میں اندر آنے کی اجازت چاہتے ہیں ۔ بیان کیا کہ میں نے عرض کیا یا رسول اللہ ! یہ شخص آپ کے گھر میں آنے کی اجازت چاہتا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، میرا خیا ل ہے کہ یہ فلاں شخص ہے ، آپ نے حفصہ رضی اللہ عنہا کے ایک دودھ کے چچا کانام لیا ۔ اس پر عائشہ رضی اللہ عنہا نے پوچھا ، کیا فلاں ، جو ان کے دودھ کے چچا تھے ، اگر زند ہ ہوتے تومیر ے یہاں آ جا سکتے تھے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں جیسے خون ملنے سے حرمت ہوتی ہے ، ویسے ہی دودھ پینے سے بھی حرمت ثابت ہو جاتی ہے ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے ، ان سے عبداللہ بن ابوبکرنے ، ان سے عمرہ بنت عبدالرحمٰن نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ عِنْدَهَا، وَأَنَّهَا سَمِعَتْ صَوْتَ رَجُلٍ يَسْتَأْذِنُ فِي بَيْتِ حَفْصَةَ، قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا رَجُلٌ يَسْتَأْذِنُ فِي بَيْتِكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أُرَاهُ فُلاَنًا ‏\"‏‏.‏ لِعَمِّ حَفْصَةَ مِنَ الرَّضَاعَةِ‏.‏ قَالَتْ عَائِشَةُ لَوْ كَانَ فُلاَنٌ حَيًّا، لِعَمِّهَا مِنَ الرَّضَاعَةِ دَخَلَ عَلَىَّ فَقَالَ ‏\"‏ نَعَمِ الرَّضَاعَةُ تُحَرِّمُ مَا تُحَرِّمُ الْوِلاَدَةُ ‏\"‏‏.‏",
                "headingArabic": "{وَأُمَّهَاتُكُمُ اللاَّتِي أَرْضَعْنَكُمْ}",
                "headingUrdu": "\".. آپ کی رضاعی مائیں جنہوں نے آپ کو دودھ پلایا۔\"",
                "headingEnglish": "\"..your foster-mothers who gave you suck.\"",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4876,
                "hadithNumber": "5100",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "It was said to the Prophet, \"Won't you marry the daughter of Hamza رضی اللہ عنہ ?\" He said, \"She is my foster niece (brother's daughter). \" Bishr bin Umer, Shobah, Qatadah reported same from Jabir bin Zaid.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سے کہا گیا کہ آنحضور صلی اللہ علیہ وسلم حضرت حمزہ رضی اللہ عنہ کی بیٹی سے نکاح کیوں نہیں کر لیتے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ میرے دودھ کے بھائی کی بیٹی ہے ۔ اور بشر بن عمر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، انہوں نے قتادہ سے سنا اور انہوں نے اسی طرح جابر بن زید سے سنا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے شعبہ نے ، ان سے قتادہ نے ، ان سے حضرت جابر بن زید نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قِيلَ لِلنَّبِيِّ صلى الله عليه وسلم أَلاَ تَزَوَّجُ ابْنَةَ حَمْزَةَ قَالَ ‏ \"‏ إِنَّهَا ابْنَةُ أَخِي مِنَ الرَّضَاعَةِ ‏\"‏‏.‏ وَقَالَ بِشْرُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ سَمِعْتُ قَتَادَةَ سَمِعْتُ جَابِرَ بْنَ زَيْدٍ مِثْلَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4877,
                "hadithNumber": "5101",
                "englishNarrator": "Narrated Um Habiba (daughter of Abu Sufyan) :",
                "hadithEnglish": "I said, \"O Allah's Messenger (ﷺ)! Marry my sister. the daughter of Abu Sufyan.\" The Prophet (ﷺ) said, \"Do you like that?\" I replied, \"Yes, for even now I am not your only wife and I like that my sister should share the good with me.\" The Prophet (ﷺ) said, \"But that is not lawful for me.\" I said, We have heard that you want to marry the daughter of Abu Salama.\" He said, \"(You mean) the daughter of Um Salama?\" I said, \"Yes.\" He said, \"Even if she were not my step-daughter, she would be unlawful for me to marry as she is my foster niece. I and Abu Salama were suckled by Thuwaiba. So you should not present to me your daughters or your sisters (in marriage).\" Narrated 'Urwa: Thuwaiba was the freed slave girl of Abu Lahb whom he had manumitted, and then she suckled the Prophet. When Abu Lahb died, one of his relatives saw him in a dream in a very bad state and asked him, \"What have you encountered?\" Abu Lahb said, \"I have not found any rest since I left you, except that I have been given water to drink in this (the space between his thumb and other fingers) and that is because of my manumitting Thuwaiba.\"",
                "hadithUrdu": "انہوں نے عرض کیا کہ یا رسول اللہ ! میری بہن ( ابوسفیان کی لڑکی ) سے نکاح کر لیجئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کیا تم اسے پسند کروگی ( کہ تمہاری سوکن بہن بنے ؟ ) میں نے عرض کیا ہاں میں توپسند کرتی ہوں اگر میں اکیلی آپ کی بیوی ہوتی تو پسند نہ کرتی ۔ پھر میری بہن اگر میرے ساتھ بھلائی میں شریک ہو تو میں کیونکر نہ چاہوںگی ( غیروں سے تو بہن ہی اچھی ہے ) آپ نے فرمایا وہ میرے لئے حلال نہیں ہے ۔ حضرت ام حبیبہ رضی اللہ عنہا نے کہا یا رسول اللہ ! لوگ کہتے ہیں آپ ابوسلمہ کی بیٹی سے جو ام سلمہ کے پیٹ سے ہے ، نکاح کرنے والے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا اگر وہ میری ربیبہ اور میری پرورش میں نہ ہوتی ( یعنی میری بیوی کی بیٹی نہ ہوتی ) جب بھی میرے لئے حلال نہ ہوتی ، وہ دوسرے رشتے سے میری دودھ بھتیجی ہے ، مجھ کواور ابوسلمہ کے باپ کو دونوںکو ثوبیہ نے دودھ پلایا ہے ۔ دیکھو ، ایسا مت کرو اپنی بیٹیوں اور بہنوں کو مجھ سے نکاح کرنے کے لئے نہ کہو ۔ حضرت عروہ راوی نے کہا ثوبیہ ابولہب کی لونڈی تھی ۔ ابولہب نے اس کوآزاد کر دیا تھا ۔ ( جب اس نے آنحضرت صلی اللہ علیہ وسلم کے پیدا ہونے کی خبر ابولہب کو دی تھی ) پھر اس نے آنحضرت صلی اللہ علیہ وسلم کو دودھ پلایا تھا جب ابولہب مر گیا تو اس کے کسی عزیز نے مرنے کے بعد اس کو خواب میں برے حال میں دیکھا تو پوچھا کیا حال ہے کیا گزری ؟ وہ کہنے لگا جب سے میں تم سے جدا ہوا ہوں کبھی آرام نہیں ملا مگر ایک ذراسا پانی ( پیر کے دن مل جاتا ہے ) ابولہب نے اس گڑھے کی طرف اشارہ کیا جو انگوٹھے اور کلمہ کے انگلی کے بیچ میں ہوتا ہے یہ بھی اس وجہ سے کہ میں نے ثوبیہ کو آزاد کر دیا تھا ۔",
                "urduNarrator": "ہم سے حکم بن نافع نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں عروہ بن زبیر نے خبر دی ، انہیں زینب بنت ابی سلمہ نے خبر دی اور انہیں ام المؤمنین ام حبیبہ بنت ابی سفیان نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ، أَخْبَرَتْهُ أَنَّ أُمَّ حَبِيبَةَ بِنْتَ أَبِي سُفْيَانَ أَخْبَرَتْهَا أَنَّهَا، قَالَتْ يَا رَسُولَ اللَّهِ انْكِحْ أُخْتِي بِنْتَ أَبِي سُفْيَانَ فَقَالَ ‏\"‏ أَوَتُحِبِّينَ ذَلِكَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ، لَسْتُ لَكَ بِمُخْلِيَةٍ، وَأَحَبُّ مَنْ شَارَكَنِي فِي خَيْرٍ أُخْتِي‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ ذَلِكَ لاَ يَحِلُّ لِي ‏\"‏‏.‏ قُلْتُ فَإِنَّا نُحَدَّثُ أَنَّكَ تُرِيدُ أَنْ تَنْكِحَ بِنْتَ أَبِي سَلَمَةَ‏.‏ قَالَ ‏\"‏ بِنْتَ أُمِّ سَلَمَةَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَقَالَ ‏\"‏ لَوْ أَنَّهَا لَمْ تَكُنْ رَبِيبَتِي فِي حَجْرِي مَا حَلَّتْ لِي إِنَّهَا لاَبْنَةُ أَخِي مِنَ الرَّضَاعَةِ، أَرْضَعَتْنِي وَأَبَا سَلَمَةَ ثُوَيْبَةُ فَلاَ تَعْرِضْنَ عَلَىَّ بَنَاتِكُنَّ وَلاَ أَخَوَاتِكُنَّ ‏\"‏‏.‏ قَالَ عُرْوَةُ وَثُوَيْبَةُ مَوْلاَةٌ لأَبِي لَهَبٍ كَانَ أَبُو لَهَبٍ أَعْتَقَهَا فَأَرْضَعَتِ النَّبِيَّ صلى الله عليه وسلم فَلَمَّا مَاتَ أَبُو لَهَبٍ أُرِيَهُ بَعْضُ أَهْلِهِ بِشَرِّ حِيبَةٍ قَالَ لَهُ مَاذَا لَقِيتَ قَالَ أَبُو لَهَبٍ لَمْ أَلْقَ بَعْدَكُمْ غَيْرَ أَنِّي سُقِيتُ فِي هَذِهِ بِعَتَاقَتِي ثُوَيْبَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4851,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=194",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=192",
                "label": "192",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=193",
                "label": "193",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=194",
                "label": "194",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=195",
                "label": "195",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=196",
                "label": "196",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=197",
                "label": "197",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=198",
                "label": "198",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=196",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=196",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=194",
        "to": 4875,
        "total": 40465
    }
}