{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 172,
        "data": [
            {
                "id": 4278,
                "hadithNumber": "4494",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "While some people were offering Fajr prayer at Quba mosque, someone came to them and said, \"Qur'anic literature\" has been revealed to Allah's Messenger (ﷺ) tonight, and he has been ordered to face the Ka`ba (of Mecca) so you too, should turn your faces towards it. Their faces were then towards Sham (Jerusalem), so they turned towards the Qibla (i.e. Ka`ba of Mecca).",
                "hadithUrdu": "ابھی لوگ مسجد قباء میں صبح کی نماز پڑھ ہی رہے تھے کہ ایک آنے والے صاحب آئے اور کہا کہ رات کو رسول اللہ صلی اللہ علیہ وسلم پر قرآن نازل ہوا ہے اور آپ کو کعبہ کی طرف منہ کرنے کا حکم ہوا ہے۔ اس لیے آپ لوگ بھی اسی طرف منہ کر لیں۔ وہ لوگ شام کی طرف منہ کر کے نماز پڑھ رہے تھے لیکن اسی وقت کعبہ کی طرف پھر گئے۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ان سے امام مالک نے، ان سے عبداللہ بن دینار نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ بَيْنَمَا النَّاسُ فِي صَلاَةِ الصُّبْحِ بِقُبَاءٍ إِذْ جَاءَهُمْ آتٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أُنْزِلَ عَلَيْهِ اللَّيْلَةَ، وَقَدْ أُمِرَ أَنْ يَسْتَقْبِلَ الْكَعْبَةَ، فَاسْتَقْبِلُوهَا‏.‏ وَكَانَتْ وُجُوهُهُمْ إِلَى الشَّأْمِ فَاسْتَدَارُوا إِلَى الْقِبْلَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4279,
                "hadithNumber": "4495",
                "englishNarrator": "Narrated `Urwa:",
                "hadithEnglish": "I said to `Aisha رضی اللہ عنہا, the wife of the Prophet, and I was at that time a young boy, \"How do you interpret the Statement of Allah: \"Verily, Safa and Marwa (i.e. two mountains at Mecca) are among the Symbols of Allah.\" So it is not harmful of those who perform the Hajj to the House of Allah) or perform the Umra, to ambulate (Tawaf) between them. In my opinion it is not sinful for one not to ambulate (Tawaf) between them.\" `Aisha رضی اللہ عنہا said, \"Your interpretation is wrong for as you say, the Verse should have been: \"So it is not harmful of those who perform the Hajj or Umra to the House, not to ambulate (Tawaf) between them.' This Verse was revealed in connection with the Ansar who (during the Pre-Islamic Period) used to visit Manat (i.e. an idol) after assuming their Ihram, and it was situated near Qudaid (i.e. a place at Mecca), and they used to regard it sinful to ambulate between Safa and Marwa after embracing Islam. When Islam came, they asked Allah's Messenger (ﷺ) about it, whereupon Allah revealed:-- \"Verily, Safa and Marwa (i.e. two mountains at Mecca) are among the Symbols of Allah. So it is not harmful of those who perform the Hajj of the House (of Allah) or perform the Umra, to ambulate (Tawaf) between them.\" (2.158)",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا سے پوچھا ( ان دنوں میں نوعمر تھا ) کہ اللہ تبارک و تعالیٰ کے اس ارشاد کے بارے میں آپ کا کیا خیال ہے «إن الصفا والمروة من شعائر الله فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما‏» ”صفا اور مروہ بیشک اللہ کی یادگار چیزوں میں سے ہیں۔ پس جو کوئی بیت اللہ کا حج کرے یا عمرہ کرے تو اس پر کوئی گناہ نہیں کہ ان دونوں کے درمیان آمدورفت ( یعنی سعی ) کرے۔“ میرا خیال ہے کہ اگر کوئی ان کی سعی نہ کرے تو اس پر بھی کوئی گناہ نہیں ہونا چاہئیے۔ عائشہ رضی اللہ عنہا نے کہا کہ ہرگز نہیں جیسا کہ تمہارا خیال ہے۔ اگر مسئلہ یہی ہوتا تو پھر واقعی ان کے سعی نہ کرنے میں کوئی گناہ نہ تھا۔ لیکن یہ آیت انصار کے بارے میں نازل ہوئی تھی ( اسلام سے پہلے ) انصار منات بت کے نام سے احرام باندھتے تھے، یہ بت مقام قدید میں رکھا ہوا تھا اور انصار صفا اور مروہ کی سعی کو اچھا نہیں سمجھتے تھے۔ جب اسلام آیا تو انہوں نے سعی کے متعلق آپ صلی اللہ علیہ وسلم سے پوچھا: اس پر اللہ تعالیٰ نے یہ آیت نازل کی «إن الصفا والمروة من شعائر الله فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما‏» ”صفا اور مروہ بیشک اللہ کی یادگار چیزوں میں سے ہیں، سو جو کوئی بیت اللہ کا حج کرے یا عمرہ کرے تو اس پر کوئی بھی گناہ نہیں کہ ان دونوں کے درمیان ( سعی ) کرے۔“",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں ہشام بن عروہ نے، ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ قُلْتُ لِعَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَأَنَا يَوْمَئِذٍ حَدِيثُ السِّنِّ أَرَأَيْتِ قَوْلَ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}‏ فَمَا أُرَى عَلَى أَحَدٍ شَيْئًا أَنْ لاَ يَطَّوَّفَ بِهِمَا‏.‏ فَقَالَتْ عَائِشَةُ كَلاَّ لَوْ كَانَتْ كَمَا تَقُولُ كَانَتْ فَلاَ جُنَاحَ عَلَيْهِ أَنْ لاَ يَطَّوَّفَ بِهِمَا، إِنَّمَا أُنْزِلَتْ هَذِهِ الآيَةُ فِي الأَنْصَارِ، كَانُوا يُهِلُّونَ لِمَنَاةَ، وَكَانَتْ مَنَاةُ حَذْوَ قُدَيْدٍ، وَكَانُوا يَتَحَرَّجُونَ أَنْ يَطُوفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَلَمَّا جَاءَ الإِسْلاَمُ سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَأَنْزَلَ اللَّهُ ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}‏",
                "headingArabic": "قَوْلِهِ ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيمٌ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے \"بے شک عاف اور المروہ (مکہ کے دو پہاڑ) اللہ کی نشانیوں میں سے ہیں...\" (آیت 2:158)",
                "headingEnglish": "The Statement of Allah \"Verily! A-afã and Al-Marwa (two mountains in Makkah) are of the Symbols of Allah...\" (V.2:158)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4280,
                "hadithNumber": "4496",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "\"We used to consider (i.e. going around) them a custom of the Pre-islamic period of Ignorance, so when Islam came, we gave up going around them. Then Allah revealed\" \"Verily, Safa and Marwa (i.e. two mountains at Mecca) are among the Symbols of Allah. So it is not harmful of those who perform the Hajj of the House (of Allah) or perform the Umra to ambulate (Tawaf) between them.\" (2.158)",
                "hadithUrdu": "اسے ہم جاہلیت کے کاموں میں سے سمجھتے تھے۔ جب اسلام آیا تو ہم ان کی سعی سے رک گئے، اس پر اللہ تعالیٰ نے یہ آیت نازل کی «إن الصفا والمروة» سے ارشاد «أن يطوف بهما‏» تک۔ یعنی بیشک صفا اور مروہ اللہ کی نشانیوں میں سے ہیں۔ پس ان کی سعی کرنے میں حج اور عمرہ کے دوران کوئی گناہ نہیں ہے۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے عاصم بن سلیمان نے بیان کیا اور انہوں نے انس بن مالک رضی اللہ عنہ سے صفا اور مروہ کے متعلق پوچھا۔ انہوں نے بتایا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمِ بْنِ سُلَيْمَانَ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ عَنِ الصَّفَا، وَالْمَرْوَةِ،‏.‏ فَقَالَ كُنَّا نَرَى أَنَّهُمَا مِنْ أَمْرِ الْجَاهِلِيَّةِ، فَلَمَّا كَانَ الإِسْلاَمُ أَمْسَكْنَا عَنْهُمَا، فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ ‏}‏ إِلَى قَوْلِهِ ‏{‏أَنْ يَطَّوَّفَ بِهِمَا‏}‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4281,
                "hadithNumber": "4497",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said one statement and I said another. The Prophet (ﷺ) said \"Whoever dies while still invoking anything other than Allah as a rival to Allah, will enter Hell (Fire).\" And I said, \"Whoever dies without invoking anything as a rival to Allah, will enter Paradise.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک کلمہ ارشاد فرمایا اور میں نے ایک اور بات کہی۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص اس حالت میں مر جائے کہ وہ اللہ کے سوا اوروں کو بھی اس کا شریک ٹھہراتا رہا ہو تو وہ جہنم میں جاتا ہے اور میں نے یوں کہا کہ جو شخص اس حالت میں مرے کہ اللہ کا کسی کو شریک نہ ٹھہراتا رہا تو وہ جنت میں جاتا ہے۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا، ان سے ابوحمزہ نے، ان سے اعمش نے، ان سے شقیق نے اور ان سے عبداللہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم كَلِمَةً وَقُلْتُ أُخْرَى قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ مَاتَ وَهْوَ يَدْعُو مِنْ دُونِ اللَّهِ نِدًّا دَخَلَ النَّارَ ‏\"‏‏.‏ وَقُلْتُ أَنَا مَنْ مَاتَ وَهْوَ لاَ يَدْعُو لِلَّهِ نِدًّا دَخَلَ الْجَنَّةَ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَمِنَ النَّاسِ مَنْ يَتَّخِذُ مِنْ دُونِ اللَّهِ أَنْدَادًا‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"اور انسانوں میں سے کچھ ایسے ہیں جو اللہ کے سوا دوسروں کو (اللہ کا) مدمقابل بناتے ہیں، وہ ان سے اس طرح محبت کرتے ہیں جس طرح اللہ سے محبت کرتے ہیں...\" (آیت 2:165)",
                "headingEnglish": "The Statement of Allah :\"And of mankind are some who take (for worship) others besides Allah as rivals (to Allah). They love them as they love Allah...\" (V.2:165)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4282,
                "hadithNumber": "4498",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The law of Qisas (i.e. equality in punishment) was prescribed for the children of Israel, but the Diya (i.e. blood money was not ordained for them). So Allah said to this Nation (i.e. Muslims): \"O you who believe! The law of Al-Qisas (i.e. equality in punishment) is prescribed for you in cases of murder: The free for the free, the slave for the slave, and the female for the female. But if the relatives (or one of them) of the killed (person) forgive their brother (i.e. the killers something of Qisas (i.e. not to kill the killer by accepting blood money in the case of intentional murder)----then the relatives (of the killed person) should demand blood-money in a reasonable manner and the killer must pay with handsome gratitude. This is an allevitation and a Mercy from your Lord, (in comparison to what was prescribed for the nations before you). So after this, whoever transgresses the limits (i.e. to kill the killer after taking the blood-money) shall have a painful torment.\" (2.178)",
                "hadithUrdu": "بنی اسرائیل میں قصاص یعنی بدلہ تھا لیکن دیت نہیں تھی۔ اس لیے اللہ تعالیٰ نے اس امت سے کہا کہ ”تم پر مقتولوں کے باب میں قصاص فرض کیا گیا، آزاد کے بدلے میں آزاد اور غلام کے بدلے میں غلام اور عورت کے بدلے میں عورت، ہاں جس کسی کو اس کے فریق مقتول کی طرف سے کچھ معافی مل جائے۔“ تو معافی سے مراد یہی دیت قبول کرنا ہے۔ سو مطالبہ معقول اور نرم طریقہ سے ہو اور مطالبہ کو اس فریق کے پاس خوبی سے پہنچایا جائے۔ یہ تمہارے پروردگار کی طرف سے رعایت اور مہربانی ہے۔“ یعنی اس کے مقابلہ میں جو تم سے پہلی امتوں پر فرض تھا۔ ”سو جو کوئی اس کے بعد بھی زیادتی کرے گا، اس کے لیے آخرت میں درد ناک عذاب ہو گا۔“ ( زیادتی سے مراد یہ ہے کہ ) دیت بھی لے لی اور پھر اس کے بعد قتل بھی کر دیا۔",
                "urduNarrator": "ہم سے حمیدی نے بیان کیا، انہوں نے کہا ہم سے سفیان نے بیان کیا، ان سے عمرو نے بیان کیا، انہوں نے کہا کہ میں نے مجاہد سے سنا، انہوں نے کہا کہ میں نے ابن عباس رضی اللہ عنہما سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرٌو، قَالَ سَمِعْتُ مُجَاهِدًا، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ كَانَ فِي بَنِي إِسْرَائِيلَ الْقِصَاصُ، وَلَمْ تَكُنْ فِيهِمُ الدِّيَةُ فَقَالَ اللَّهُ تَعَالَى لِهَذِهِ الأُمَّةِ ‏{‏كُتِبَ عَلَيْكُمُ الْقِصَاصُ فِي الْقَتْلَى الْحُرُّ بِالْحُرِّ وَالْعَبْدُ بِالْعَبْدِ وَالأُنْثَى بِالأُنْثَى فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَىْءٌ‏}‏ فَالْعَفْوُ أَنْ يَقْبَلَ الدِّيَةَ فِي الْعَمْدِ ‏{‏فَاتِّبَاعٌ بِالْمَعْرُوفِ وَأَدَاءٌ إِلَيْهِ بِإِحْسَانٍ‏}‏ يَتَّبِعُ بِالْمَعْرُوفِ وَيُؤَدِّي بِإِحْسَانٍ، ‏{‏ذَلِكَ تَخْفِيفٌ مِنْ رَبِّكُمْ‏}‏ وَرَحْمَةٌ مِمَّا كُتِبَ عَلَى مَنْ كَانَ قَبْلَكُمْ‏.‏ ‏{‏فَمَنِ اعْتَدَى بَعْدَ ذَلِكَ فَلَهُ عَذَابٌ أَلِيمٌ‏}‏ قَتَلَ بَعْدَ قَبُولِ الدِّيَةِ‏.‏",
                "headingArabic": "‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الْقِصَاصُ فِي الْقَتْلَى الْحُرُّ بِالْحُرِّ‏}‏ إِلَى قَوْلِهِ ‏{‏عَذَابٌ أَلِيمٌ‏}‏",
                "headingUrdu": "\"اے ایمان والو! تم پر القصاص (سزا میں برابری کا قانون) فرض کیا گیا ہے...\" (V.2:178)",
                "headingEnglish": "\"O you who believe! Al- Qisas (the Law of Equality in punishment) is prescribed for you...\" (V.2:178)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4283,
                "hadithNumber": "4499",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The prescribed Law of Allah is the equality in punishment (i.e. Al-Qisas).\" (In cases of murders, etc.)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کتاب اللہ کا حکم قصاص کا ہے۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ انصاری نے بیان کیا، کہا ہم سے حمیدی نے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، حَدَّثَنَا حُمَيْدٌ، أَنَّ أَنَسًا، حَدَّثَهُمْ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كِتَابُ اللَّهِ الْقِصَاصُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4284,
                "hadithNumber": "4500",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "That his aunt, Ar-Rubai' broke an incisor tooth of a girl. My aunt's family requested the girl's relatives for forgiveness but they refused; then they proposed a compensation, but they refused. Then they went to Allah's Messenger (ﷺ) and refused everything except Al-Qisas (i.e. equality in punishment). So Allah's Apostle passed the judgment of Al-Qisas (i.e. equality of punishment). Anas bin Al-Nadr  رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! Will the incisor tooth of Ar-Rubai رضی اللہ عنہا be broken? No, by Him Who sent you with the Truth, her incisor tooth will not be broken.\" Allah's Messenger (ﷺ) said, \"O Anas! The prescribed law of Allah is equality in punishment (i.e. Al-Qisas.)\" Thereupon those people became satisfied and forgave her. Then Allah's Messenger (ﷺ) said, \"Among Allah's Worshippers there are some who, if they took Allah's Oath (for something), Allah fulfill their oaths.\"",
                "hadithUrdu": "میری پھوپھی ربیع نے ایک لڑکی کے دانت توڑ دئیے، پھر اس لڑکی سے لوگوں نے معافی کی درخواست کی لیکن اس لڑکی کے قبیلے والے معافی دینے کو تیار نہیں ہوئے اور رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور قصاص کے سوا اور کسی چیز پر راضی نہیں تھے۔ چنانچہ آپ صلی اللہ علیہ وسلم نے قصاص کا حکم دے دیا۔ اس پر انس بن نضر رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! کیا ربیع رضی اللہ عنہا کے دانت توڑ دئیے جائیں گے، نہیں، اس ذات کی قسم جس نے آپ کو حق کے ساتھ مبعوث کیا ہے، ان کے دانت نہ توڑے جائیں گے۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ انس! کتاب اللہ کا حکم قصاص کا ہی ہے۔ پھر لڑکی والے راضی ہو گئے اور انہوں نے معاف کر دیا۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ کچھ اللہ کے بندے ایسے ہیں کہ اگر وہ اللہ کا نام لے کر قسم کھائیں تو اللہ ان کی قسم پوری کر ہی دیتا ہے۔",
                "urduNarrator": "مجھ سے عبداللہ بن منیر نے بیان کیا، کہا کہ میں نے عبداللہ بن بکر سہمی سے سنا، ان سے حمید نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ عَبْدَ اللَّهِ بْنَ بَكْرٍ السَّهْمِيَّ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، أَنَّ الرُّبَيِّعَ، عَمَّتَهُ كَسَرَتْ ثَنِيَّةَ جَارِيَةٍ، فَطَلَبُوا إِلَيْهَا الْعَفْوَ فَأَبَوْا، فَعَرَضُوا الأَرْشَ فَأَبَوْا، فَأَتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَبَوْا إِلاَّ الْقِصَاصَ، فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْقِصَاصِ، فَقَالَ أَنَسُ بْنُ النَّضْرِ يَا رَسُولَ اللَّهِ، أَتُكْسَرُ ثَنِيَّةُ الرُّبَيِّعِ لاَ وَالَّذِي بَعَثَكَ بِالْحَقِّ لاَ تُكْسَرُ ثَنِيَّتُهَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أَنَسُ كِتَابُ اللَّهِ الْقِصَاصُ ‏\"‏‏.‏ فَرَضِيَ الْقَوْمُ فَعَفَوْا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4285,
                "hadithNumber": "4501",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Fasting was observed on the day of 'Ashura' (i.e. 10th of Muharram) by the people of the Pre-lslamic Period. But when (the order of compulsory fasting) in the month of Ramadan was revealed, the Prophet said, \"It is up to one to fast on it (i.e. day of 'Ashura') or not.\"",
                "hadithUrdu": "عاشوراء کے دن جاہلیت میں ہم روزہ رکھتے تھے لیکن جب رمضان کے روزے نازل ہو گئے تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس کا جی چاہے عاشوراء کا روزہ رکھے اور جس کا جی چاہے نہ رکھے۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، ان سے عبیداللہ نے بیان کیا، انہیں نافع نے خبر دی اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ عَاشُورَاءُ يَصُومُهُ أَهْلُ الْجَاهِلِيَّةِ، فَلَمَّا نَزَلَ رَمَضَانُ قَالَ ‏ \"‏ مَنْ شَاءَ صَامَهُ، وَمَنْ شَاءَ لَمْ يَصُمْهُ ‏\"‏‏.‏",
                "headingArabic": "‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ‏}‏",
                "headingUrdu": "\"اے ایمان والو! تم پر صوم فرض کیا گیا ہے جیسا کہ تم سے پہلے لوگوں پر فرض کیا گیا تھا تاکہ تم متقی بن جاؤ (2:183)۔",
                "headingEnglish": "“O you who believe! Observing As-Saum (the fasting) is prescribed for you as it was prescribed for those before you that you, may become Al- Muttaqun (V.2:183).",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4286,
                "hadithNumber": "4502",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The people used to fast on the day of 'Ashura' before fasting in Ramadan was prescribed but when (the order of compulsory fasting in) Ramadan was revealed,  he ﷺ said: whosoever wishes, it was up to one to fast on it (i.e. 'Ashura') or not.",
                "hadithUrdu": "عاشوراء کا روزہ رمضان کے روزوں کے حکم سے پہلے رکھا جاتا تھا۔ پھر جب رمضان کے روزوں کا حکم نازل ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس کا جی چاہے عاشوراء کا روزہ رکھے اور جس کا جی چاہے نہ رکھے۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے ابن عیینہ نے بیان کیا، ان سے زہری نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ كَانَ عَاشُورَاءُ يُصَامُ قَبْلَ رَمَضَانَ، فَلَمَّا نَزَلَ رَمَضَانُ قَالَ ‏ \"‏ مَنْ شَاءَ صَامَ، وَمَنْ شَاءَ أَفْطَرَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4287,
                "hadithNumber": "4503",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "That Al-Ash'ath entered upon him while he was eating. Al-Ash'ath said, \"Today is 'Ashura.\" I said (to him), \"Fasting had been observed (on such a day) before (the order of compulsory fasting in) Ramadan was revealed. But when (the order of fasting in) Ramadan was revealed, fasting (on 'Ashura') was given up, so come and eat.\"",
                "hadithUrdu": "اشعث ان کے یہاں آئے، وہ اس وقت کھانا کھا رہے تھے، اشعث نے کہا کہ آج تو عاشوراء کا دن ہے۔ ابن مسعود رضی اللہ عنہ نے کہا کہ ان دنوں میں عاشوراء کا روزہ رمضان کے روزوں کے نازل ہونے سے پہلے رکھا جاتا تھا لیکن جب رمضان کے روزے کا حکم نازل ہوا تو یہ روزہ چھوڑ دیا گیا۔ آؤ تم بھی کھانے میں شریک ہو جاؤ۔",
                "urduNarrator": "مجھ سے محمود نے بیان کیا، کہا ہم کو عبیداللہ نے خبر دی، انہیں اسرائیل نے، انہیں منصور نے، انہیں ابراہیم نے، انہیں علقمہ نے اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مَحْمُودٌ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ دَخَلَ عَلَيْهِ الأَشْعَثُ وَهْوَ يَطْعَمُ فَقَالَ الْيَوْمُ عَاشُورَاءُ‏.‏ فَقَالَ كَانَ يُصَامُ قَبْلَ أَنْ يَنْزِلَ رَمَضَانُ، فَلَمَّا نَزَلَ رَمَضَانُ تُرِكَ، فَادْنُ فَكُلْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4288,
                "hadithNumber": "4504",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "During the Pre-lslamic Period of ignorance the Quraish used to observe fasting on the day of 'Ashura', and the Prophet (ﷺ) himself used to observe fasting on it too. But when he came to Medina, he fasted on that day and ordered the Muslims to fast on it. When (the order of compulsory fasting in ) Ramadan was revealed, fasting in Ramadan became an obligation, and fasting on 'Ashura' was given up, and who ever wished to fast (on it) did so, and whoever did not wish to fast on it, did not fast.",
                "hadithUrdu": "عاشوراء کے دن قریش زمانہ جاہلیت میں روزے رکھتے تھے اور نبی کریم صلی اللہ علیہ وسلم بھی اس دن روزہ رکھتے تھے۔ جب آپ صلی اللہ علیہ وسلم مدینہ تشریف لائے تو یہاں بھی آپ صلی اللہ علیہ وسلم نے اس دن روزہ رکھا اور صحابہ رضی اللہ عنہم کو بھی اس کے رکھنے کا حکم دیا، لیکن جب رمضان کے روزوں کا حکم نازل ہوا تو رمضان کے روزے فرض ہو گئے اور عاشوراء کے روزہ ( کی فرضیت ) باقی نہیں رہی۔ اب جس کا جی چاہے اس دن بھی روزہ رکھے اور جس کا جی چاہے نہ رکھے۔",
                "urduNarrator": "مجھ سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، کہا ہم سے ہشام نے بیان کیا، کہا کہ مجھے میرے والد نے خبر دی اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ يَوْمُ عَاشُورَاءَ تَصُومُهُ قُرَيْشٌ فِي الْجَاهِلِيَّةِ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم يَصُومُهُ، فَلَمَّا قَدِمَ الْمَدِينَةَ صَامَهُ وَأَمَرَ بِصِيَامِهِ، فَلَمَّا نَزَلَ رَمَضَانُ كَانَ رَمَضَانُ الْفَرِيضَةَ، وَتُرِكَ عَاشُورَاءُ، فَكَانَ مَنْ شَاءَ صَامَهُ، وَمَنْ شَاءَ لَمْ يَصُمْهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4289,
                "hadithNumber": "4505",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "He reciting the Divine Verse:-- \"And for those who can fast they had a choice either fast, or feed a poor for every day..\" (2.184) Ibn `Abbas رضی اللہ عنہما said, \"This Verse is not abrogated, but it is meant for old men and old women who have no strength to fast, so they should feed one poor person for each day of fasting (instead of fasting).",
                "hadithUrdu": "وہ یوں قرآت کر رہے تھے «وعلى الذين يطوقونه فدية طَعام مسكين» ( تفعیل سے ) «فدية طَعام مسكين» ۔“ ابن عباس رضی اللہ عنہما نے کہا کہ یہ آیت منسوخ نہیں ہے۔ اس سے مراد بہت بوڑھا مرد یا بہت بوڑھی عورت ہے۔ جو روزے کی طاقت نہ رکھتی ہو، انہیں چاہئیے کہ ہر روزہ کے بدلے ایک مسکین کو کھانا کھلا دیں۔",
                "urduNarrator": "مجھ سے اسحاق نے بیان کیا، انہوں نے کہا ہم کو روح نے خبر دی، انہوں نے کہا ہم سے زکریا بن اسحاق نے بیان کیا، انہوں نے کہا ہم سے عمرو بن دینار نے بیان کیا، ان سے عطاء نے اور انہوں نے عبداللہ بن عباس رضی اللہ عنہما سے سنا",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا رَوْحٌ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنْ عَطَاءٍ، سَمِعَ ابْنَ عَبَّاسٍ، يَقْرَأُ ‏{‏وَعَلَى الَّذِينَ يُطَوَّقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ ‏}‏‏.‏ قَالَ ابْنُ عَبَّاسٍ لَيْسَتْ بِمَنْسُوخَةٍ، هُوَ الشَّيْخُ الْكَبِيرُ وَالْمَرْأَةُ الْكَبِيرَةُ لاَ يَسْتَطِيعَانِ أَنْ يَصُومَا، فَلْيُطْعِمَانِ مَكَانَ كُلِّ يَوْمٍ مِسْكِينًا‏.‏",
                "headingArabic": "‏{‏أَيَّامًا مَعْدُودَاتٍ فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ فَمَنْ تَطَوَّعَ خَيْرًا فَهُوَ خَيْرٌ لَهُ وَأَنْ تَصُومُوا خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے کہ \"روزہ رکھنا مقررہ دنوں کے لیے، لیکن اگر تم میں سے کوئی بیمار ہو یا سفر پر ہو تو دوسرے دنوں میں اتنی ہی تعداد (قضاۃ) کرنی چاہیے۔ مشکل سے روزہ رکھیں (مثلاً بوڑھا آدمی وغیرہ) ان کے پاس (روزہ رکھنے کا اختیار ہے یا) مسکین (غریب) کو کھانا کھلانا ہے (ہر روز) لیکن جو شخص اپنی مرضی سے نیکی کرے تو بہتر ہے۔ اور اس کے لیے روزہ رکھنا تمہارے لیے بہتر ہے، اگر تم جانتے ہو۔\" (V.2:184)",
                "headingEnglish": "The Statement of Allah \"[Observing Saum (fasts)] for a fixed number of days but if any of you is ill, or on a journey, the same number (should be made up) from other days. And as for those who can fast with difficulty (e.g., an old man, etc.) they have (a choice, either to fast or) to feed a Miskin (poor person) (for every day). But whoever does good of his own accord, it is better for him. And that you fast is better for you, if only you know.\" (V.2:184)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4290,
                "hadithNumber": "4506",
                "englishNarrator": "Narrated Ibn `Umer رضی اللہ عنہما :",
                "hadithEnglish": "He recited: \"They had a choice, either fast or feed a poor for every day..\" and added, \"This Verse is abrogated.\"",
                "hadithUrdu": "انھوں نے یوں قرآت کی «فدية» بغیر تنوین «طَعام مساكين‏» بتلایا کہ یہ آیت منسوخ ہے۔",
                "urduNarrator": "ہم سے عیاش بن ولید نے بیان کیا، کہا ہم سے عبدالاعلیٰ نے بیان کیا، ان سے عبیداللہ نے بیان کیا، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ قَرَأَ ‏{‏فِدْيَةٌ طَعَامُ مَسَاكِينَ‏}‏ قَالَ هِيَ مَنْسُوخَةٌ‏.‏",
                "headingArabic": "‏{‏فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ‏}‏",
                "headingUrdu": "’’پس تم میں سے جو شخص (رمضان کی پہلی رات) کا چاند دیکھے، یعنی اپنے گھر میں موجود ہو، تو اسے چاہیے کہ اس مہینے کے روزے رکھے۔‘‘ (2:185)",
                "headingEnglish": "\"So whoever of you sights (the crescent on the first night of) the month (of Ramadan, i.e., is present at his home), he must observe Saum (fast) that month... (V.2:185)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4291,
                "hadithNumber": "4507",
                "englishNarrator": "Narrated Salama رضی اللہ عنہ :",
                "hadithEnglish": "When the Divine Revelation: \"For those who can fast, they had a choice either fast, or feed a poor for every day,\" (2.184) was revealed, it was permissible for one to give a ransom and give up fasting, till the Verse succeeding it was revealed and abrogated it. Imam Bukhari says: Bokair bin Abdullah died before Yazeed, his teacher.",
                "hadithUrdu": "جب یہ آیت نازل ہوئی۔ «وعلى الذين يطيقونه فدية طَعام مسكين‏» تو جس کا جی چاہتا تھا روزہ چھوڑ دیتا تھا اور اس کے بدلے میں فدیہ دے دیتا تھا۔ یہاں تک کہ اس کے بعد والی آیت نازل ہوئی اور اس نے پہلی آیت کو منسوخ کر دیا۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ بکیر کا انتقال یزید سے پہلے ہو گیا تھا۔ بکیر جو یزید کے شاگرد تھے یزید سے پہلے 120 ھ میں مر گئے تھے۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے بکر بن مضر نے بیان کیا، ان سے عمرو بن حارث نے، ان سے بکیر بن عبداللہ نے، ان سے سلمہ بن اکوع کے مولیٰ یزید بن ابی عبید نے اور ان سے سلمہ بن اکوع رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا بَكْرُ بْنُ مُضَرَ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ، عَنْ يَزِيدَ، مَوْلَى سَلَمَةَ بْنِ الأَكْوَعِ عَنْ سَلَمَةَ، قَالَ لَمَّا نَزَلَتْ ‏{‏وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ‏}‏ كَانَ مَنْ أَرَادَ أَنْ يُفْطِرَ وَيَفْتَدِيَ حَتَّى نَزَلَتِ الآيَةُ الَّتِي بَعْدَهَا فَنَسَخَتْهَا‏.‏ مَاتَ بُكَيْرٌ قَبْلَ يَزِيدَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4292,
                "hadithNumber": "4508",
                "englishNarrator": "Narrated Al-Bara' رضی اللہ عنہ :",
                "hadithEnglish": "When the order of compulsory fasting of Ramadan was revealed, the people did not have sexual relations with their wives for the whole month of Ramadan, but some men cheated themselves (by violating that restriction). So Allah revealed: \"Allah is aware that you were deceiving yourselves but He accepted your repentance and forgave you..\" (3.187)",
                "hadithUrdu": "جب رمضان کے روزے کا حکم نازل ہوا تو مسلمان پورے رمضان میں اپنی بیویوں کے قریب نہیں جاتے تھے اور کچھ لوگوں نے اپنے کو خیانت میں مبتلا کر لیا تھا۔ اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی «علم الله أنكم كنتم تختانون أنفسكم فتاب عليكم وعفا عنكم‏» ”اللہ نے جان لیا کہ تم اپنے کو خیانت میں مبتلا کرتے رہتے تھے۔ پس اس نے تم پر رحمت سے توجہ فرمائی اور تم کو معاف کر دیا۔“",
                "urduNarrator": "ہم سے عبیداللہ نے بیان کیا، انہوں نے کہا ہم سے اسرائیل نے بیان کیا، ان سے ابواسحاق نے اور ان سے براء رضی اللہ عنہ نے (دوسری سند) اور ہم سے احمد بن عثمان نے بیان کیا، ان سے شریح بن مسلمہ نے بیان کیا، کہا کہ مجھ سے ابراہیم بن یوسف نے بیان کا، ان سے ان کے والد نے، ان سے ابواسحاق نے بیان کیا، انہوں نے براء بن عازب رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، وَحَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ يُوسُفَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ‏.‏ لَمَّا نَزَلَ صَوْمُ رَمَضَانَ كَانُوا لاَ يَقْرَبُونَ النِّسَاءَ رَمَضَانَ كُلَّهُ، وَكَانَ رِجَالٌ يَخُونُونَ أَنْفُسَهُمْ، فَأَنْزَلَ اللَّهُ ‏{‏عَلِمَ اللَّهُ أَنَّكُمْ كُنْتُمْ تَخْتَانُونَ أَنْفُسَكُمْ فَتَابَ عَلَيْكُمْ وَعَفَا عَنْكُمْ‏}‏‏.‏",
                "headingArabic": "‏{‏أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ هُنَّ لِبَاسٌ لَكُمْ وَأَنْتُمْ لِبَاسٌ لَهُنَّ عَلِمَ اللَّهُ أَنَّكُمْ كُنْتُمْ تَخْتَانُونَ أَنْفُسَكُمْ فَتَابَ عَلَيْكُمْ وَعَفَا عَنْكُمْ فَالآنَ بَاشِرُوهُنَّ وَابْتَغُوا مَا كَتَبَ اللَّهُ لَكُمْ‏}‏",
                "headingUrdu": "’’تمہارے لیے حلال کر دیا گیا ہے کہ اپنی بیویوں سے شبِ معراج (روزہ) ... (تک) ... اور اس چیز کی تلاش کرو جو اللہ نے تم پر (اولاد) فرض کر دی ہے۔‘‘ (V.2:187)",
                "headingEnglish": "\"It is made lawful for you to have sexual relation with your wives on the night of As-Saum (the fasts) ... (till) ... and seek that which Allah has ordained for you (offspring).. .\" (V.2:187)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4293,
                "hadithNumber": "4509",
                "englishNarrator": "Narrated `Adi bin Hatim رضی اللہ عنہ :",
                "hadithEnglish": "He took a white rope (or thread) and a black one, and when some part of the night had passed, he looked at them but he could not distinguish one from the other. The next morning he said, \"O Allah's Apostle! I put (a white thread and a black thread) underneath my pillow.\" The Prophet (ﷺ) said, \"Then your pillow is too wide if the white thread (of dawn) and the black thread (of the night) are underneath your pillow! \"",
                "hadithUrdu": "انھوں نے ایک سفید دھاگا اور ایک سیاہ دھاگا لیا ( اور سوتے ہوئے اپنے ساتھ رکھ لیا ) ۔ جب رات کا کچھ حصہ گزر گیا تو انہوں نے اسے دیکھا، وہ دونوں میں تمیز نہیں ہوئی۔ جب صبح ہوئی تو عرض کیا: یا رسول اللہ! میں نے اپنے تکئے کے نیچے ( سفید و سیاہ دھاگے رکھے تھے اور کچھ نہیں ہوا ) تو نبی کریم صلی اللہ علیہ وسلم نے اس پر بطور مذاق کے فرمایا کہ پھر تو تمہارا تکیہ بہت لمبا چوڑا ہو گا کہ صبح کا سفیدی خط اور سیاہ خط اس کے نیچے آ گیا تھا۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، ان سے حصین بن عبدالرحمٰن نے، ان سے عامر شعبی نے عدی بن حاتم رضی اللہ عنہ سے، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ حُصَيْنٍ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيٍّ، قَالَ أَخَذَ عَدِيٌّ عِقَالاً أَبْيَضَ وَعِقَالاً أَسْوَدَ حَتَّى كَانَ بَعْضُ اللَّيْلِ نَظَرَ فَلَمْ يَسْتَبِينَا، فَلَمَّا أَصْبَحَ قَالَ يَا رَسُولَ اللَّهِ، جَعَلْتُ تَحْتَ وِسَادَتِي‏.‏ قَالَ ‏ \"‏ إِنَّ وِسَادَكَ إِذًا لَعَرِيضٌ أَنْ كَانَ الْخَيْطُ الأَبْيَضُ وَالأَسْوَدُ تَحْتَ وِسَادَتِكَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ مِنَ الْفَجْرِ ثُمَّ أَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ وَلاَ تُبَاشِرُوهُنَّ وَأَنْتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ‏}‏ إِلَى قَوْلِهِ ‏{‏تَتَّقُونَ‏}‏ الْعَاكِفُ: الْمُقِيمُ",
                "headingUrdu": "’’اور کھاؤ پیو یہاں تک کہ صبح کا سفید دھاگہ سیاہ دھاگے (رات کی تاریکی) سے الگ نظر نہ آئے۔‘‘ (V.2:187)",
                "headingEnglish": "\"...And eat and drink until the white thread (light) of dawn appears to you distinct from the black thread (darkness of the night).. .\" (V.2:187)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4294,
                "hadithNumber": "4510",
                "englishNarrator": "Narrated `Adi bin Hatim رضی اللہ عنہ :",
                "hadithEnglish": "I said, \"O Allah's Messenger (ﷺ)! What is the meaning of the white thread distinct from the black thread? Are these two threads?\" He said, \"You are not intelligent if you watch the two threads.\" He then added, \"No, it is the darkness of the night and the whiteness of the day.''",
                "hadithUrdu": "میں نے عرض کیا: یا رسول اللہ! ( آیت میں ) «الخيط الأبيض» اور «الخيط الأسود» سے کیا مراد ہے؟ کیا ان سے مراد دو دھاگے ہیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تمہاری کھوپڑی پھر تو بڑی لمبی چوڑی ہو گی۔ اگر تم نے رات کو دو دھاگے دیکھے ہیں۔ پھر فرمایا کہ ان سے مراد رات کی سیاہی اور صبح کی سفیدی ہے۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، انہوں نے کہا ہم سے جریر نے بیان کیا، ان سے مطرف نے بیان کیا، ان سے شعبی نے بیان کیا اور ان سے عدی بن حاتم رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مُطَرِّفٍ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ ـ رضى الله عنه ـ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَا الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ أَهُمَا الْخَيْطَانِ قَالَ ‏\"‏ إِنَّكَ لَعَرِيضُ الْقَفَا إِنْ أَبْصَرْتَ الْخَيْطَيْنِ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ لاَ بَلْ هُوَ سَوَادُ اللَّيْلِ وَبَيَاضُ النَّهَارِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4295,
                "hadithNumber": "4511",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "The Verse \"And eat and drink until the white thread appears to you distinct from the black thread.\" was revealed, but: '... of dawn' was not revealed (along with it) so some men, when intending to fast, used to tie their legs, one with white thread and the other with black thread and would keep on eating till they could distinguish one thread from the other. Then Allah revealed' ... of dawn,' whereupon they understood that meant the night and the day.",
                "hadithUrdu": "آیت \"اور کھاؤ پیو یہاں تک کہ سفید دھاگہ سیاہ دھاگے سے ممتاز نظر آئے۔\" نازل ہوئی، لیکن: ''... طلوع فجر'' نازل نہیں ہوئی (اس کے ساتھ) تو بعض آدمی جب روزہ کا ارادہ کرتے تو اپنی ٹانگیں باندھ لیتے تھے، ایک سفید دھاگے سے اور دوسرے کو سیاہ دھاگے سے اور کھاتے رہتے تھے۔ جب تک کہ وہ ایک دھاگے کو دوسرے سے الگ نہ کر سکیں۔ پھر اللہ تعالیٰ نے ’’فجر کا‘‘ نازل کیا تو انہوں نے سمجھا کہ اس سے مراد رات اور دن ہے۔",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا، انہوں نے کہا ہم سے ابوغسان محمد بن مطرف نے بیان کیا، انہوں نے کہا مجھ سے ابوحازم سلمہ بن دینار نے بیان کیا، ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، مُحَمَّدُ بْنُ مُطَرِّفٍ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ وَأُنْزِلَتْ ‏{‏وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ‏}‏ وَلَمْ يُنْزَلْ ‏{‏مِنَ الْفَجْرِ‏}‏ وَكَانَ رِجَالٌ إِذَا أَرَادُوا الصَّوْمَ رَبَطَ أَحَدُهُمْ فِي رِجْلَيْهِ الْخَيْطَ الأَبْيَضَ وَالْخَيْطَ الأَسْوَدَ، وَلاَ يَزَالُ يَأْكُلُ حَتَّى يَتَبَيَّنَ لَهُ رُؤْيَتُهُمَا، فَأَنْزَلَ اللَّهُ بَعْدَهُ ‏{‏مِنَ الْفَجْرِ‏}‏ فَعَلِمُوا أَنَّمَا يَعْنِي اللَّيْلَ مِنَ النَّهَارِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4296,
                "hadithNumber": "4512",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "In the Pre-lslamic Period when the people assumed Ihram, they would enter their houses from the back. So Allah revealed:-- \"And it is not righteousness that you enter houses from the back, but the righteous man is he who fears Allah, obeys His Orders and keeps away from what He has forbidden. So enter houses through their doors.\" (2.189)",
                "hadithUrdu": "جب لوگ جاہلیت میں احرام باندھ لیتے تو گھروں میں پیچھے کی طرف سے چھت پر چڑھ کر داخل ہوتے۔ اس پر اللہ تعالیٰ نے یہ آیت نازل کی «وليس البر بأن تأتوا البيوت من ظهورها ولكن البر من اتقى وأتوا البيوت من أبوابها‏» کہ ”اور یہ نیکی نہیں ہے کہ تم گھروں میں ان کے پیچھے کی طرف سے آؤ، البتہ نیکی یہ ہے کہ کوئی شخص تقویٰ اختیار کرے اور گھروں میں ان کے دروازوں سے آؤ۔“",
                "urduNarrator": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا، کہا ان سے اسرائیل نے، ان سے ابواسحاق نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ كَانُوا إِذَا أَحْرَمُوا فِي الْجَاهِلِيَّةِ أَتَوُا الْبَيْتَ مِنْ ظَهْرِهِ، فَأَنْزَلَ اللَّهُ ‏{‏وَلَيْسَ الْبِرُّ بِأَنْ تَأْتُوا الْبُيُوتَ مِنْ ظُهُورِهَا وَلَكِنَّ الْبِرَّ مَنِ اتَّقَى وَأْتُوا الْبُيُوتَ مِنْ أَبْوَابِهَا‏}‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَلَيْسَ الْبِرُّ بِأَنْ تَأْتُوا الْبُيُوتَ مِنْ ظُهُورِهَا وَلَكِنَّ الْبِرَّ مَنِ اتَّقَى وَأْتُوا الْبُيُوتَ مِنْ أَبْوَابِهَا وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ‏}‏",
                "headingUrdu": "’’اور یہ کوئی نیکی نہیں کہ تم اپنے گھروں کے پیچھے سے داخل ہو، ہاں نیکی تقویٰ ہے، لہٰذا گھروں میں ان کے دروازوں سے آؤ اور اللہ تعالیٰ سے ڈرتے رہو اس امید پر کہ تم فلاح پاؤ۔‘‘",
                "headingEnglish": "''And it is no virtue that you enter your houses by the back thereof, yes, the virtue is piety, so come in houses by their doors and fear Allah Almighty in the hope that you may get prosperity.''",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4297,
                "hadithNumber": "4513, 4514, 4515",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "During the affliction of Ibn Az-Zubair رضی اللہ عنہما , two men came to Ibn `Umar رضی اللہ عنہ and said, \"The people are lost, and you are the son of `Umar رضی اللہ عنہ , and the companion of the Prophet, so what forbids you from coming out?\" He said, \"What forbids me is that Allah has prohibited the shedding of my brother's blood.\" They both said, \"Didn't Allah say, 'And fight then until there is no more affliction?' \" He said \"We fought until there was no more affliction and the worship is for Allah (Alone while you want to fight until there is affliction and until the worship become for other than Allah.\"  Narrated Nafi` (through another group of sub-narrators): A man came to Ibn `Umar and said, \"O Abu `Abdur Rahman! What made you perform Hajj in one year and Umra in another year and leave the Jihad for Allah' Cause though you know how much Allah recommends it?\" Ibn `Umar replied, \"O son of my brother! Islam is founded on five principles, i.e. believe in Allah and His Apostle, the five compulsory prayers, the fasting of the month of Ramadan, the payment of Zakat, and the Hajj to the House (of Allah).\" The man said, \"O Abu `Abdur Rahman! Won't you listen to why Allah has mentioned in His Book: 'If two groups of believers fight each other, then make peace between them, but if one of then transgresses beyond bounds against the other, then you all fight against the one that transgresses. (49.9) and:--\"And fight them till there is no more affliction (i.e. no more worshiping of others along with Allah).\" Ibn `Umar said, \"We did it, during the lifetime of Allah's Messenger (ﷺ) when Islam had only a few followers. A man would be put to trial because of his religion; he would either be killed or tortured. But when the Muslims increased, there was no more afflictions or oppressions.\" The man said, \"What is your opinion about `Uthman and `Ali?\" Ibn `Umar said, \"As for `Uthman, it seems that Allah has forgiven him, but you people dislike that he should be forgiven. And as for `Ali, he is the cousin of Allah's Messenger (ﷺ) and his son-in-law.\" Then he pointed with his hand and said, \"That is his house which you see.\"",
                "hadithUrdu": "ان کے پاس ابن زبیر رضی اللہ عنہما کے فتنے کے زمانہ میں ( جب ان پر حجاج ظالم نے حملہ کیا اور مکہ کا محاصرہ کیا ) دو آدمی ( علاء بن عرار اور حبان سلمی ) آئے اور کہا کہ لوگ آپس میں لڑ کر تباہ ہو رہے ہیں۔ آپ عمر رضی اللہ عنہ کے صاحبزادے اور رسول اللہ صلی اللہ علیہ وسلم کے صحابی ہیں پھر آپ کیوں خاموش ہیں؟ اس فساد کو رفع کیوں نہیں کرتے؟ ابن عمر رضی اللہ عنہما نے کہا کہ میری خاموشی کی وجہ صرف یہ ہے کہ اللہ تعالیٰ نے میرے کسی بھی بھائی مسلمان کا خون مجھ پر حرام قرار دیا ہے۔ اس پر انہوں نے کہا: کیا اللہ تعالیٰ نے یہ ارشاد نہیں فرمایا ہے «وقاتلوهم حتى لا تكون فتنة» کہ ”اور ان سے لڑو یہاں تک کہ فساد باقی نہ رہے۔“ ابن عمر رضی اللہ عنہما نے فرمایا کہ ہم ( قرآن کے حکم کے مطابق ) لڑے ہیں، یہاں تک کہ فتنہ یعنی شرک و کفر باقی نہیں رہا اور دین خالص اللہ کے لیے ہو گیا، لیکن تم لوگ چاہتے ہو کہ تم اس لیے لڑو کہ فتنہ اور فساد پیدا ہو اور دین اسلام ضعیف ہو، کافروں کو جیت ہو اور اللہ کے برخلاف دوسروں کا حکم سنا جائے۔\r\nاورعثمان بن صالح نےزیادہ بیان کیا کہ ان سے عبداللہ بن وہب نے  بیان کیا،انہیں فلاں شخص عبداللہ بن ربیعہ اور  حیوہ بن شریح نے خبر دی،انہیں بکربن عمرومعافری نے،ان سےبکیر بن عبداللہ نے  بیان کیا، ان سے نافع کہتے ہیں کہ ایک شخص ابن عمر رضی اللہ عنہ کے پاس آیا اور کہا: اے ابو عبدالرحمٰن! آپ کو کس چیز نے اس بات پر مجبور کیا کہ ایک سال میں حج کیا اور دوسرے سال میں عمرہ کیا اور جہاد کو اللہ کے لیے چھوڑ دیا؟ حالانکہ تم جانتے ہو کہ اللہ اس کی کتنی سفارش کرتا ہے؟ ابن عمر رضی اللہ عنہ نے جواب دیا: اے میرے بھائی کے بیٹے، اسلام کی بنیاد پانچ چیزوں پر ہے، یعنی اللہ اور اس کے رسول پر ایمان، پانچوں نمازیں، رمضان کے روزے، زکوٰۃ کی ادائیگی اور حج۔ (اللہ کا گھر)۔ اس آدمی نے کہا اے ابو عبدالرحمٰن! کیا تم نہیں سنتے کہ اللہ تعالیٰ نے اپنی کتاب میں یہ کیوں کہا ہے کہ اگر مومنوں کے دو گروہ آپس میں لڑیں تو ان میں صلح کراؤ اور اگر ان میں سے کوئی حد سے بڑھ جائے دوسرے، پھر تم سب زیادتی کرنے والے سے لڑو۔ (49.9) اور:-\"اور ان سے اس وقت تک لڑو جب تک کہ کوئی مصیبت باقی نہ رہے (یعنی اللہ کے ساتھ دوسروں کی عبادت نہ کرنا)۔\" ابن عمر رضی اللہ عنہ نے کہا: رسول اللہ صلی اللہ علیہ وسلم کے دور میں جب اسلام کے چند پیروکار تھے۔ ایک آدمی کو اس کے مذہب کی وجہ سے آزمائش میں ڈالا جائے گا۔ اسے یا تو مار دیا جائے گا یا تشدد کا نشانہ بنایا جائے گا۔ لیکن جب مسلمانوں کی تعداد بڑھ گئی تو پھر کوئی مصیبت یا ظلم باقی نہیں رہا۔‘‘ اس آدمی نے کہا: ’’عثمان اور علی کے بارے میں تمہاری کیا رائے ہے؟‘‘ ابن عمر نے کہا، ’’عثمان کے بارے میں تو ایسا لگتا ہے کہ اللہ تعالیٰ نے انہیں معاف کر دیا ہے۔ لیکن تم لوگ اس بات کو ناپسند کرتے ہو کہ اسے معاف کر دیا جائے۔ اور جہاں تک علی کا تعلق ہے تو وہ رسول اللہ صلی اللہ علیہ وسلم کے چچازاد بھائی اور آپ کے داماد ہیں، پھر آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ سے اشارہ کیا اور فرمایا: ”یہ ان کا گھر ہے جسے تم دیکھ رہے ہو۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے عبدالوہاب نے بیان کیا، کہا ہم سے عبیداللہ عمری نے بیان کیا، ان سے نافع نے ابن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَتَاهُ رَجُلاَنِ فِي فِتْنَةِ ابْنِ الزُّبَيْرِ فَقَالاَ إِنَّ النَّاسَ قَدْ ضُيِّعُوا، وَأَنْتَ ابْنُ عُمَرَ وَصَاحِبُ النَّبِيِّ صلى الله عليه وسلم فَمَا يَمْنَعُكَ أَنْ تَخْرُجَ فَقَالَ يَمْنَعُنِي أَنَّ اللَّهَ حَرَّمَ دَمَ أَخِي‏.‏ فَقَالاَ أَلَمْ يَقُلِ اللَّهُ ‏{‏وَقَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ ‏}‏ فَقَالَ قَاتَلْنَا حَتَّى لَمْ تَكُنْ فِتْنَةٌ، وَكَانَ الدِّينُ لِلَّهِ، وَأَنْتُمْ تُرِيدُونَ أَنْ تُقَاتِلُوا حَتَّى تَكُونَ فِتْنَةٌ، وَيَكُونَ الدِّينُ لِغَيْرِ اللَّهِ‏.‏وَزَادَ عُثْمَانُ بْنُ صَالِحٍ عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي فُلاَنٌ، وَحَيْوَةُ بْنُ شُرَيْحٍ، عَنْ بَكْرِ بْنِ عَمْرٍو الْمَعَافِرِيِّ، أَنَّ بُكَيْرَ بْنَ عَبْدِ اللَّهِ، حَدَّثَهُ عَنْ نَافِعٍ، أَنَّ رَجُلاً، أَتَى ابْنَ عُمَرَ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ مَا حَمَلَكَ عَلَى أَنْ تَحُجَّ عَامًا وَتَعْتَمِرَ عَامًا، وَتَتْرُكَ الْجِهَادَ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ، وَقَدْ عَلِمْتَ مَا رَغَّبَ اللَّهُ فِيهِ قَالَ يَا ابْنَ أَخِي بُنِيَ الإِسْلاَمُ عَلَى خَمْسٍ إِيمَانٍ بِاللَّهِ وَرَسُولِهِ، وَالصَّلاَةِ الْخَمْسِ، وَصِيَامِ رَمَضَانَ، وَأَدَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ‏.‏ قَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ، أَلاَ تَسْمَعُ مَا ذَكَرَ اللَّهُ فِي كِتَابِهِ ‏{‏وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا‏}‏ ‏{‏إِلَى أَمْرِ اللَّهِ‏}‏ ‏{‏قَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ‏}‏ قَالَ فَعَلْنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ الإِسْلاَمُ قَلِيلاً، فَكَانَ الرَّجُلُ يُفْتَنُ فِي دِينِهِ إِمَّا قَتَلُوهُ، وَإِمَّا يُعَذِّبُوهُ، حَتَّى كَثُرَ الإِسْلاَمُ فَلَمْ تَكُنْ فِتْنَةٌ‏.‏ قَالَ فَمَا قَوْلُكَ فِي عَلِيٍّ وَعُثْمَانَ قَالَ أَمَّا عُثْمَانُ فَكَأَنَّ اللَّهَ عَفَا عَنْهُ، وَأَمَّا أَنْتُمْ فَكَرِهْتُمْ أَنْ تَعْفُوا عَنْهُ، وَأَمَّا عَلِيٌّ فَابْنُ عَمِّ رَسُولِ اللَّهِ صلى الله عليه وسلم وَخَتَنُهُ‏.‏ وَأَشَارَ بِيَدِهِ فَقَالَ هَذَا بَيْتُهُ حَيْثُ تَرَوْنَ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَقَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ وَيَكُونَ الدِّينُ لِلَّهِ فَإِنِ انْتَهَوْا فَلاَ عُدْوَانَ إِلاَّ عَلَى الظَّالِمِينَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور ان سے اس وقت تک لڑو جب تک کہ فتنہ باقی نہ رہے اور (ہر قسم کی) عبادت اللہ ہی کے لیے ہو، پھر اگر وہ باز آجائیں تو اس کے سوا کوئی زیادتی نہ ہو۔ ظالموں اور ظالموں کے خلاف۔\" (V.2:193)",
                "headingEnglish": "Allah's Statement: \"And fight them until there is no more Fitnah (disbelief and worshipping of others along with Allah) and (all and every kind of) worship is for Allah (Alone). But if they cease, let there be no transgression except against Az-Zalimün (the polytheists and wrong-doers) .\" (V.2:193)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4298,
                "hadithNumber": "4516",
                "englishNarrator": "Narrated Hudhaifa رضی اللہ عنہ :",
                "hadithEnglish": "\"The Verse:-- \"And spend (of your wealth) in the Cause of Allah and do not throw yourselves in destruction,\" (2.195) was revealed concerning spending in Allah's Cause (i.e. Jihad).",
                "hadithUrdu": "اور اللہ کی راہ میں خرچ کرتے رہو اور اپنے آپ کو اپنے ہاتھوں سے ہلاکت میں نہ ڈالو۔“ اللہ کے راستے میں خرچ کرنے کے بارے میں نازل ہوئی تھی۔",
                "urduNarrator": "ہم سے اسحاق نے بیان کیا، کہا ہم کو نضر نے خبر دی، ان سے شعبہ نے بیان کیا، ان سے سلیمان نے بیان کیا، انہوں نے ابووائل سے سنا اور ان سے حذیفہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا النَّضْرُ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، عَنْ حُذَيْفَةَ، ‏{‏وَأَنْفِقُوا فِي سَبِيلِ اللَّهِ وَلاَ تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ‏}‏ قَالَ نَزَلَتْ فِي النَّفَقَةِ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَأَنْفِقُوا فِي سَبِيلِ اللَّهِ وَلاَ تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ وَأَحْسِنُوا إِنَّ اللَّهَ يُحِبُّ الْمُحْسِنِينَ‏}‏",
                "headingUrdu": "ارشادِ باری تعالیٰ ہے: ’’اور اللہ کی راہ میں خرچ کرو (یعنی ہر قسم کا جہاد) اور اپنے آپ کو ہلاکت میں نہ ڈالو (اپنے مال کو اللہ کی راہ میں خرچ نہ کر کے) اور نیکی کرو، بے شک اللہ تعالیٰ محبت کرتا ہے۔ محسنون (نیک کام کرنے والے)۔\" (V.2:195)",
                "headingEnglish": "Allah's Statement: \"And spend in the Cause of Allah (i.e., Jihad of all kinds), and do not throw yourselves into destruction (by not spending your wealth in the Cause of Allah), and do good. Truly, Allah loves A1-Muhsinun (the good-doers) .\" (V.2:195)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4299,
                "hadithNumber": "4517",
                "englishNarrator": "Narrated `Abdullah bin Maqal:",
                "hadithEnglish": "I sat with Ka`b bin Ujra رضی اللہ عنہ in this mosque, i.e. Kufa Mosque, and asked him about the meaning of: \"Pay a ransom (i.e. Fidya) of either fasting or . . . . (2.196)\" He said, \"I was taken to the Prophet (ﷺ) while lice were falling on my face. The Prophet (ﷺ) said, 'I did not think that your trouble reached to such an extent. Can you afford to slaughter a sheep (as a ransom for shaving your head)?' I said, 'No.' He said, 'Then fast for three days, or feed six poor persons by giving half a Sa of food for each and shave your head.' So the above Verse was revealed especially for me and generally for all of you.\"",
                "hadithUrdu": "میں کعب بن عجرہ رضی اللہ عنہ کی خدمت میں اس مسجد میں حاضر ہوا، ان کی مراد کوفہ کی مسجد سے تھی اور ان سے روزے کے فدیہ کے متعلق پوچھا۔ انہوں نے بیان کیا کہ مجھے احرام میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لوگ لے گئے اور جوئیں ( سر سے ) میرے چہرے پر گر رہی تھیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میرا خیال یہ نہیں تھا کہ تم اس حد تک تکلیف میں مبتلا ہو گئے ہو تم کوئی بکری نہیں مہیا کر سکتے؟ میں نے عرض کیا کہ نہیں۔ فرمایا، پھر تین دن کے روزے رکھ لو یا چھ مسکینوں کو کھانا کھلا دو، ہر مسکین کو آدھا صاع کھانا کھلانا اور اپنا سر منڈوا لو۔ کعب رضی اللہ عنہ نے کہا تو یہ آیت خاص میرے بارے میں نازل ہوئی تھی اور اس کا حکم تم سب کے لیے عام ہے۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے، ان سے عبدالرحمٰن بن اصبہانی نے، کہا میں نے عبداللہ بن معقل سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبَهَانِيِّ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَعْقِلٍ، قَالَ قَعَدْتُ إِلَى كَعْبِ بْنِ عُجْرَةَ فِي هَذَا الْمَسْجِدِ ـ يَعْنِي مَسْجِدَ الْكُوفَةِ ـ فَسَأَلْتُهُ عَنْ فِدْيَةٌ مِنْ صِيَامٍ فَقَالَ حُمِلْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي فَقَالَ ‏\"‏ مَا كُنْتُ أُرَى أَنَّ الْجَهْدَ قَدْ بَلَغَ بِكَ هَذَا، أَمَا تَجِدُ شَاةً ‏\"‏‏.‏ قُلْتُ لاَ‏.‏ قَالَ ‏\"‏ صُمْ ثَلاَثَةَ أَيَّامٍ، أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ، لِكُلِّ مِسْكِينٍ نِصْفُ صَاعٍ مِنْ طَعَامٍ، وَاحْلِقْ رَأْسَكَ ‏\"‏‏.‏ فَنَزَلَتْ فِيَّ خَاصَّةً وَهْىَ لَكُمْ عَامَّةً‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ‏}‏",
                "headingUrdu": "اللہ کا فرمان \"اور تم میں سے جو بیمار ہو یا اس کی کھوپڑی میں کوئی بیماری ہو...\" (V. 2: 196)",
                "headingEnglish": "The Statement of Allah \"And whosoever of you is ill or has an ailment in his scalp...\" (V.2:196)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4300,
                "hadithNumber": "4518",
                "englishNarrator": "Narrated `Imran bin Husain رضی اللہ عنہما :",
                "hadithEnglish": "The Verse of Hajj-at-Tamatu was revealed in Allah's Book, so we performed it with Allah's Messenger (ﷺ), and nothing was revealed in Qur'an to make it illegal, nor did the Prophet (ﷺ) prohibit it till he died. But the man (who regarded it illegal) just expressed what his own mind suggested.",
                "hadithUrdu": "( حج میں ) تمتع کا حکم قرآن میں نازل ہوا اور ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تمتع کے ساتھ ( حج ) کیا، پھر اس کے بعد قرآن نے اس سے نہیں روکا اور نہ اس سے نبی کریم صلی اللہ علیہ وسلم نے روکا، یہاں تک کہ آپ کی وفات ہو گئی ( لہٰذا تمتع اب بھی جائز ہے ) یہ تو ایک صاحب نے اپنی رائے سے جو چاہا کہہ دیا ہے۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا، انہوں نے کہا ہم سے یحییٰ نے بیان کیا، ان سے عمران ابی بکر نے، ان سے ابورجاء نے بیان کیا اور ان سے عمران بن حصین رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عِمْرَانَ أَبِي بَكْرٍ، حَدَّثَنَا أَبُو رَجَاءٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ـ رضى الله عنهما ـ قَالَ أُنْزِلَتْ آيَةُ الْمُتْعَةِ فِي كِتَابِ اللَّهِ فَفَعَلْنَاهَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم، وَلَمْ يُنْزَلْ قُرْآنٌ يُحَرِّمُهُ، وَلَمْ يَنْهَ عَنْهَا حَتَّى مَاتَ قَالَ رَجُلٌ بِرَأْيِهِ مَا شَاءَ‏.‏",
                "headingArabic": "‏{‏فَمَنْ تَمَتَّعَ بِالْعُمْرَةِ إِلَى الْحَجِّ‏}‏",
                "headingUrdu": "\"...اور جو شخص حج کے مہینوں میں حج (یعنی حج تمتع اور القرآن) سے پہلے عمرہ کرے۔\" (V.2:196)",
                "headingEnglish": "\"...And whosoever performs the 'Umra in the months of Hajj before (performing) the Hajj (i.e., Hajj At.Tamattu' and AI-Qiran) .\" (V.2:196)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4301,
                "hadithNumber": "4519",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "`Ukaz, Mijanna and Dhul-Majaz were markets during the Pre-islamic Period. They (i.e. Muslims) considered it a sin to trade there during the Hajj time (i.e. season), so this Verse was revealed:-- \"There is no harm for you if you seek of the Bounty of your Lord during the Hajj season.\" (2.198)",
                "hadithUrdu": "عکاظ، مجنہ اور ذوالمجاز زمانہ جاہلیت کے بازار ( میلے ) تھے، اس لیے ( اسلام کے بعد ) موسم حج میں صحابہ رضی اللہ عنہم نے وہاں کاروبار کو برا سمجھا تو آیت نازل ہوئی «ليس عليكم جناح أن تبتغوا فضلا من ربكم‏» کہ ”تمہیں اس بارے میں کوئی حرج نہیں کہ تم اپنے پروردگار کے یہاں سے تلاش معاش کرو۔“ یعنی موسم حج میں تجارت کے لیے مذکورہ منڈیوں میں جاؤ۔",
                "urduNarrator": "مجھ سے محمد نے بیان کیا، کہا کہ مجھے ابن عیینہ نے خبر دی، انہیں عمرو نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدٌ، قَالَ أَخْبَرَنِي ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَتْ عُكَاظٌ وَمَجَنَّةُ وَذُو الْمَجَازِ أَسْوَاقًا فِي الْجَاهِلِيَّةِ فَتَأَثَّمُوا أَنْ يَتَّجِرُوا فِي الْمَوَاسِمِ فَنَزَلَتْ ‏{‏لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلاً مِنْ رَبِّكُمْ‏}‏ فِي مَوَاسِمِ الْحَجِّ‏.‏",
                "headingArabic": "‏{‏لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلاً مِنْ رَبِّكُمْ‏}‏",
                "headingUrdu": "’’تم پر کوئی گناہ نہیں اگر تم اپنے رب کا فضل (حج کے دوران) مانگو۔‘‘ (آیت 2:198)",
                "headingEnglish": "\"There is no sin on you if you ask the Bounty of your Lord (during pilgrimage by trading)...\" (V.2:198)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4302,
                "hadithNumber": "4520",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Quraish people and those who embraced their religion, used to stay at Muzdalifa and used to call themselves Al-Hums, while the rest of the Arabs used to stay at `Arafat. When Islam came, Allah ordered His Prophet to go to `Arafat and stay at it, and then pass on from there, and that is what is meant by the Statement of Allah:--\"Then depart from the place whence all the people depart......\" (2.199)",
                "hadithUrdu": "قریش اور ان کے طریقے کی پیروی کرنے والے عرب ( حج کے لیے ) مزدلفہ میں ہی وقوف کیا کرتے تھے، اس کا نام انہوں الحمس رکھا تھا اور باقی عرب عرفات کے میدان میں وقوف کرتے تھے۔ پھر جب اسلام آیا تو اللہ تعالیٰ نے اپنے نبی کریم صلی اللہ علیہ وسلم کو حکم دیا کہ آپ عرفات میں آئیں اور وہیں وقوف کریں اور پھر وہاں سے مزدلفہ آئیں۔ آیت «ثم أفيضوا من حيث أفاض الناس‏» سے یہی مراد ہے۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا، انہوں نے کہا ہم سے محمد بن حازم نے بیان کیا، ان سے ہشام نے بیان کیا، ان سے ان کے والد نے اور ان سے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ خَازِمٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ كَانَتْ قُرَيْشٌ وَمَنْ دَانَ دِينَهَا يَقِفُونَ بِالْمُزْدَلِفَةِ، وَكَانُوا يُسَمَّوْنَ الْحُمْسَ، وَكَانَ سَائِرُ الْعَرَبِ يَقِفُونَ بِعَرَفَاتٍ، فَلَمَّا جَاءَ الإِسْلاَمُ أَمَرَ اللَّهُ نَبِيَّهُ صلى الله عليه وسلم أَنْ يَأْتِيَ عَرَفَاتٍ، ثُمَّ يَقِفَ بِهَا ثُمَّ يُفِيضَ مِنْهَا، فَذَلِكَ قَوْلُهُ تَعَالَى ‏{‏ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ‏}‏",
                "headingArabic": "‏{‏ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ‏}‏",
                "headingUrdu": "\"پھر اس جگہ سے چلے جاؤ جہاں سے سب لوگ جاتے ہیں...\" (V. 2: 199)",
                "headingEnglish": "\"Then depart from the place whence all the people depart...\" (V.2:199)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4276,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=171",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=169",
                "label": "169",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=170",
                "label": "170",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=171",
                "label": "171",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=172",
                "label": "172",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=173",
                "label": "173",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=174",
                "label": "174",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=175",
                "label": "175",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=173",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=173",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=171",
        "to": 4300,
        "total": 40465
    }
}