{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 198,
        "data": [
            {
                "id": 4928,
                "hadithNumber": "5155",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) saw the traces of Sufra (yellow perfume) on `Abdur-Rahman bin `Auf and said, \"What is this?\" `Abdur-Rahman, said, \"I have married a woman and have paid gold equal to the weight of a datestone (as her Mahr). The Prophet (ﷺ) said to him, \"May Allah bless you: Offer a wedding banquet even with one sheep.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے حضرت عبدالرحمٰن بن عوف پر زردی کا نشان دیکھا تو پوچھا کہ یہ کیا ہے ؟ انہوں نے کہا کہ میں نے ایک عورت سے ایک گٹھلی کے وزن کے برابر سونے کے مہر پر نکاح کیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ تمہیں برکت دے دعوت ولیمہ کر خواہ ایک بکری ہی کی ہو ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ ـ هُوَ ابْنُ زَيْدٍ ـ عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى عَلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَثَرَ صُفْرَةٍ قَالَ ‏\"‏ مَا هَذَا ‏\"‏‏.‏ قَالَ إِنِّي تَزَوَّجْتُ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ قَالَ ‏\"‏ بَارَكَ اللَّهُ لَكَ، أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏",
                "headingArabic": "كَيْفَ يُدْعَى لِلْمُتَزَوِّجِ",
                "headingUrdu": "حال ہی میں شادی کرنے والے شخص پر بھلائی کیسے کی جائے؟",
                "headingEnglish": "How to invoke good upon a person who has married recently?",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4929,
                "hadithNumber": "5156",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "When the Prophet (ﷺ) married me, my mother came to me and made me enter the house where I saw some women from the Ansar who said, \"May you prosper and have blessings and have good omen.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے جب مجھ سے شادی کی تو میری والدہ ( ام رومان بنت عامر ) میرے پاس آئیں اور مجھے آنحضرت صلی اللہ علیہ وسلم کے گھر کے اندر لے گئیں ۔ گھر کے اندر قبیلہ انصار کی عورتیں موجود تھیں ۔ انہوں نے ( مجھ کو اور میری ماں کو ) یوں دعادی بارک وبارک اللہ اللہ کرے تم اچھی ہو تمہارا نصیبہ اچھا ہو ۔",
                "urduNarrator": "ہم سے فروہ بن ابی المغراء نے بیان کیا ، کہا ہم سے علی بن مسہر نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا فَرْوَةُ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ تَزَوَّجَنِي النَّبِيُّ صلى الله عليه وسلم فَأَتَتْنِي أُمِّي فَأَدْخَلَتْنِي الدَّارَ، فَإِذَا نِسْوَةٌ مِنَ الأَنْصَارِ فِي الْبَيْتِ فَقُلْنَ عَلَى الْخَيْرِ وَالْبَرَكَةِ، وَعَلَى خَيْرِ طَائِرٍ‏.‏",
                "headingArabic": "الدُّعَاءِ لِلنِّسَاءِ اللاَّتِي يَهْدِينَ الْعَرُوسَ، وَلِلْعَرُوسِ",
                "headingUrdu": "ان عورتوں کی دعوت جو دلہن کو تیار کرتی ہیں۔",
                "headingEnglish": "The invocation of those women who prepare the bride",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4930,
                "hadithNumber": "5157",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A prophet among the prophets went for a military expedition and said to his people: \"A man who has married a lady and wants to consummate his marriage with her and he has not done so yet, should not accompany me.' \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا گزشتہ انبیاء میں سے ایک نبی ( حضرت یوشع علیہ السلام یا حضرت داؤد ) علیہ السلام نے غزوہ کیا اور ( غزوہ سے پہلے ) اپنی قوم سے کہا کہ میرے ساتھ کوئی ایسا شخص نہ چلے جس نے کسی نئی عورت سے شادی کی ہو اور اس کے ساتھ صحبت کرنے کا ارادہ رکھتا ہو اور ابھی صحبت نہ  کرے۔",
                "urduNarrator": "ہم سے محمد بن علاء نے بیان کیا ، کہا ہم سے عبداللہ بن المبارک نے بیان کیا ، ان سے معمربن راشد نے ، ان سے ہمام نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ غَزَا نَبِيٌّ مِنَ الأَنْبِيَاءِ فَقَالَ لِقَوْمِهِ لاَ يَتْبَعْنِي رَجُلٌ مَلَكَ بُضْعَ امْرَأَةٍ وَهْوَ يُرِيدُ أَنْ يَبْنِيَ بِهَا وَلَمْ يَبْنِ بِهَا ‏\"‏‏.‏",
                "headingArabic": "مَنْ أَحَبَّ الْبِنَاءَ قَبْلَ الْغَزْوِ",
                "headingUrdu": "فوجی مہم پر جانے سے پہلے شادی کو مکمل کرنا",
                "headingEnglish": "To consummate the marriage before going on a military campaign",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4931,
                "hadithNumber": "5158",
                "englishNarrator": "Narrated 'Urwa:",
                "hadithEnglish": "The Prophet (ﷺ) wrote the (marriage contract) with `Aisha رضی اللہ عنہا while she was six years old and consummated his marriage with her while she was nine years old and she remained with him for nine years (i.e. till his death).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے حضرت عائشہ رضی اللہ عنہا سے نکاح کیا تو ان کی عمر چھ سال کی تھی اور جب ان کے ساتھ خلوت کی تو ان کی عمر نو سال کی تھی اور وہ آنحضرت صلی اللہ علیہ وسلم کے ساتھ نو سال تک رہیں ۔",
                "urduNarrator": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ہشام بن عروہ نے اور ان سے عروہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، تَزَوَّجَ النَّبِيُّ صلى الله عليه وسلم عَائِشَةَ وَهْىَ ابْنَةُ سِتٍّ وَبَنَى بِهَا وَهْىَ ابْنَةُ تِسْعٍ وَمَكَثَتْ عِنْدَهُ تِسْعًا‏.‏",
                "headingArabic": "مَنْ بَنَى بِامْرَأَةٍ وَهْىَ بِنْتُ تِسْعِ سِنِينَ",
                "headingUrdu": "جس نے اپنا نکاح نو سال کی عمر کی عورت سے کیا۔",
                "headingEnglish": "Whoever consummated his marriage with a lady of nine years of age",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4932,
                "hadithNumber": "5159",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) stayed for three days at a place between Khaibar and Medina, and there he consummated his marriage with Safiyya bint Huyay رضی اللہ عنہا . I invited the Muslims to a banquet which included neither meat nor bread. The Prophet (ﷺ) ordered for the leather dining sheets to be spread, and then dates, dried yogurt and butter were provided over it, and that was the Walima (banquet) of the Prophet. The Muslims asked whether Safiyya رضی اللہ عنہا would be considered as his wife or as a slave girl of what his right hands possessed. Then they said, \"If the Prophet (ﷺ) screens her from the people, then she Is the Prophet's wife but if he does not screen her, then she is a slave girl.\" So when the Prophet (ﷺ) proceeded, he made a place for her (on the camel) behind him and screened her from people.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے مدینہ اور خیبر کے درمیان ( راستہ میں ) تین دن تک قیام کیا اور وہاں ام المؤمنین حضرت صفیہ بنت حیی رضی اللہ عنہا کے ساتھ خلوت کی ۔ میں نے مسلمانوں کو آنحضرت صلی اللہ علیہ وسلم کے ولیمہ پر بلایا لیکن اس دعوت میں روٹی اور گوشت نہیں تھا ۔ آپ نے دسترخوان بچھانے کا حکم دیا اور اس پر کھجور ، پنیر اور گھی رکھ دیا گیا اور یہی آنحضرت صلی اللہ علیہ وسلم کا ولیمہ تھا ۔ مسلمانوں نے حضرت صفیہ رضی اللہ عنہا کے بارے میں ( کہا کہ ) امہات المؤمنین میں سے ہیں یا آنحضرت صلی اللہ علیہ وسلم نے انہیں لونڈی ہی رکھا ہے ( کیونکہ وہ بھی جنگ خیبر کے قیدیوں میں سے تھیں ۔ اس پر بعض نے کہا کہ اگرآنحضرت صلی اللہ علیہ وسلم ان کے لئے پردہ کرائیں پھر تو وہ امہات المؤمنین میں سے ہیں اور اگر آپ ان کے لئے پردہ نہ کرائیں تو پھر وہ لونڈی کی حیثیت سے ہیں ۔ جب سفر ہوا تو آنحضرت صلی اللہ علیہ وسلم نے ان کے لئے اپنی سواری پر پیچھے جگہ بنائی اور لوگوں کے اور ان کے درمیان پردہ ڈلوایا ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے خبر دی ، انہیں حمید نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ أَقَامَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ خَيْبَرَ وَالْمَدِينَةِ ثَلاَثًا يُبْنَى عَلَيْهِ بِصَفِيَّةَ بِنْتِ حُيَىٍّ فَدَعَوْتُ الْمُسْلِمِينَ إِلَى وَلِيمَتِهِ، فَمَا كَانَ فِيهَا مِنْ خُبْزٍ وَلاَ لَحْمٍ، أَمَرَ بِالأَنْطَاعِ فَأُلْقِيَ فِيهَا مِنَ التَّمْرِ وَالأَقِطِ وَالسَّمْنِ فَكَانَتْ وَلِيمَتَهُ، فَقَالَ الْمُسْلِمُونَ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ أَوْ مِمَّا مَلَكَتْ يَمِينُهُ فَقَالُوا إِنْ حَجَبَهَا فَهْىَ مِنْ أُمَّهَاتِ الْمُؤْمِنِينَ، وَإِنْ لَمْ يَحْجُبْهَا فَهْىَ مِمَّا مَلَكَتْ يَمِينُهُ فَلَمَّا ارْتَحَلَ وَطَّى لَهَا خَلْفَهُ وَمَدَّ الْحِجَابَ بَيْنَهَا وَبَيْنَ النَّاسِ‏.‏",
                "headingArabic": "الْبِنَاءِ فِي السَّفَرِ",
                "headingUrdu": "سفر کے دوران نکاح کی تکمیل",
                "headingEnglish": "Consummation of marriage during a journey",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4933,
                "hadithNumber": "5160",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "When the Prophet (ﷺ) married me, my mother came to me and made me enter the house (of the Prophet) and nothing surprised me but the coming of Allah's Messenger (ﷺ) to me in the forenoon.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے مجھ سے شادی کی تھی ۔ میری والدہ میرے پاس آئیں اورتنہا مجھے ایک گھر میں داخل کر دیا ۔ پھر مجھے کسی چیز نے خوف نہیں دلایا سوائے رسول اللہ صلی اللہ علیہ وسلم کے کہ آپ اچانک ہی میرے پاس چاشت کے وقت آ گئے ۔ آپ نے مجھ سے ملاپ فرمایا ۔",
                "urduNarrator": "مجھ سے فروہ بن ابی المغراء نے بیان کیا ، کہا ہم سے علی بن مسہر نے بیان کیا ، ان سے ہشام بن عروہ نے ، اپنے والد سے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنِي فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ تَزَوَّجَنِي النَّبِيُّ صلى الله عليه وسلم فَأَتَتْنِي أُمِّي فَأَدْخَلَتْنِي الدَّارَ، فَلَمْ يَرُعْنِي إِلاَّ رَسُولُ اللَّهِ صلى الله عليه وسلم ضُحًى‏.‏",
                "headingArabic": "الْبِنَاءِ بِالنَّهَارِ بِغَيْرِ مَرْكَبٍ وَلاَ نِيرَانٍ",
                "headingUrdu": "دن کے وقت شادی کے جلوس یا آگ کی روشنی کے بغیر شادی کی تکمیل",
                "headingEnglish": "Consummation of marriage during the daytime without a marriage procession or lighting of fires",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4934,
                "hadithNumber": "5161",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Did you get Anmat?\" I said, 'O Allah's Messenger (ﷺ)! From where can we have Anmat?\" The Prophet (ﷺ) said, \"Soon you will have them (Anmat).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ان سے ( جب انہوں نے شادی کی ) فرمایا تم نے جھالر دار چادریں بھی لی ہیں یا نہیں ؟ انہوں نے عرض کیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! ہمارے پاس جھالر دار چادریں کہاں ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جلد ہی میسر ہو جائیں گی ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے محمد بن المنکدر نے بیان کیا ، ان سے حضرت جابربن عبداللہ رضی اللہ عنہما نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلِ اتَّخَذْتُمْ أَنْمَاطًا ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ وَأَنَّى لَنَا أَنْمَاطٌ‏.‏ قَالَ ‏\"‏ إِنَّهَا سَتَكُونُ ‏\"‏‏.‏",
                "headingArabic": "الأَنْمَاطِ وَنَحْوِهَا لِلنِّسَاءِ",
                "headingUrdu": "پردے، بستر اور اسی طرح کے پتلے خواتین کے لیے ڈیزائن کیے گئے ہیں۔",
                "headingEnglish": "The curtains, beddings and similar thins designed for the women",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4935,
                "hadithNumber": "5162",
                "englishNarrator": "Narrated 'Aisha رضی اللہ عنہا :",
                "hadithEnglish": "She prepared a lady for a man from the Ansar as his bride and the Prophet said, \"O 'Aisha! Haven't you got any amusement (during the marriage ceremony) as the Ansar like amusement?\"",
                "hadithUrdu": "وہ ایک دلہن کو ایک انصاری مرد کے پاس لے گئیں تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا عائشہ ! تمہارے پاس لہو ( دف بجانے والا ) نہیں تھا ، انصار کو دف پسند ہے ۔",
                "urduNarrator": "ہم سے فضیل بن یعقوب نے بیان کیا ، کہا ہم سے محمد بن سابق نے بیان کیا ، ان سے اسرائیل نے بیان کیا ، ان سے ہشام بن عروہ نے ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا الْفَضْلُ بْنُ يَعْقُوبَ، حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا زَفَّتِ امْرَأَةً إِلَى رَجُلٍ مِنَ الأَنْصَارِ فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَا عَائِشَةُ مَا كَانَ مَعَكُمْ لَهْوٌ فَإِنَّ الأَنْصَارَ يُعْجِبُهُمُ اللَّهْوُ ‏\"‏‏.‏",
                "headingArabic": "النِّسْوَةِ اللاَّتِي يَهْدِينَ الْمَرْأَةَ إِلَى زَوْجِهَا وَدُعَائِهِنَّ بِالْبَرَكَةِ",
                "headingUrdu": "وہ عورتیں جو عورت کو اس کے شوہر کے سامنے پیش کرتی ہیں۔",
                "headingEnglish": "The women who present the lady to her husband",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4936,
                "hadithNumber": "5163",
                "englishNarrator": "Narrated Anas bin Malik:",
                "hadithEnglish": "\"Whenever the Prophet (ﷺ) passed by (my mother Um-Sulaim) he used to enter her and greet her. Anas رضی اللہ عنہ further said: Once the Prophet (ﷺ) way a bridegroom during his marriage with Zainab رضی اللہ عنہ , Um Sulaim رضی اللہ عنہ said to me, \"Let us give a gift to Allah's Messenger (ﷺ) .\" I said to her, \"Do it.\" So she prepared Haisa (a sweet dish) made from dates, butter and dried yoghurt and she sent it with me to him. I took it to him and he said, \"Put it down,\" and ordered me to call some men whom he named, and to invite whomever I would meet. I did what he ordered me to do, and when I returned, I found the house crowded with people and saw the Prophet (ﷺ) keeping his hand over the Haisa and saying over it whatever Allah wished (him to say). Then he called the men in batches of ten to eat of it, and he said to them, \"Mention the Name of Allah, and each man should eat of the dish the nearest to him.\" When all of them had finished their meals, some of them left and a few remained there talking, over which I felt unhappy. Then the Prophet (ﷺ) went out towards the dwelling places (of his wives) and I too, went out after him and told him that those people had left. Then he returned and entered his dwelling place and let the curtains fall while I was in (his) dwelling place, and he was reciting the Verses:-- 'O you who believe! Enter not the Prophet's house until leave is given you for a meal, (and then) not (as early as) to what for its preparation. But when you are invited, enter, and when you have taken your meals, disperse without sitting for a talk. Verily such (behavior) annoys the Prophet; and he would be shy of (asking) you (to go), but Allah is not shy of (telling you) the Truth.' (33-53) Abu Uthman said: Anas رضی اللہ عنہ said, \"I served the Prophet for ten years.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم کا قاعدہ تھا آپ جب ام سلیم رضی اللہ عنہا کے گھر کی طرف سے گزرتے تو ان کے پاس جاتے ، ان کو سلام کرتے ( وہ آپ کی رضاعی خالہ ہوتی تھیں ) پھر انس رضی اللہ عنہ نے بیان کیا کہ ایک بار ایسا ہوا کہ آنحضرت صلی اللہ علیہ وسلم دولہا تھے ۔ آپ نے زینب رضی اللہ عنہا سے نکا ح کیا تھا تو ام سلیم ( میری ماں ) مجھ سے کہنے لگیں اس وقت ہم آنحضرت صلی اللہ علیہ وسلم کے پاس کچھ تحفہ بھیجیں تو اچھا ہے ۔ میں نے کہا مناسب ہے ۔ انہوں نے کھجور اور گھی اور پنیر ملا کر ایک ہانڈی میں حلوہ بنایا اور میرے ہاتھ میں دے کر آنحضرت صلی اللہ علیہ وسلم کے پاس بھجوایا ، میں لے کر آپ کے پاس چلا ، جب پہنچا تو آپ نے فرمایا رکھ دے اور جا کر فلاں فلاں لوگوں کو بلا لا آپ نے ان کا نام لیا اور جو بھی کوئی تجھ کو راستے میں ملے اس کو بلا لے ۔ انس رضی اللہ عنہ نے کہا کہ میں آپ کے حکم کے موافق لوگوں کو دعوت دینے گیا ۔ لوٹ کر جو آ یا تو کیا دیکھتا ہوں کہ سارا گھر لوگوں سے بھرا ہوا ہے ۔ میں نے دیکھا کہ آنحضرت صلی اللہ علیہ وسلم نے اپنے دونو ں ہاتھ اس حلوے پر رکھے اور جو اللہ کو منظور تھا وہ زبان سے کہا ( برکت کی دعا فرمائی ) پھر دس دس آدمیوں کو کھانے کے لئے بلانا شروع کیا ۔ آپ ان سے فرماتے جاتے تھے اللہ کا نام لو اور ہر ایک آدمی اپنے آگے سے کھائے ۔ ( رکابی کے بیچ میں ہاتھ نہ ڈالے ) یہا ں تک کہ سب لوگ کھا کر گھر کے باہر چل دئیے ۔ تین آدمی گھر میں بیٹھے باتیں کرتے رہے اور مجھ کو ان کے نہ جانے سے رنج پیدا ہوا ( اس خیال سے کہ آنحضرت صلی اللہ علیہ وسلم کو تکلیف ہو گی ) آخر آنحضرت صلی اللہ علیہ وسلم اپنی بیویوں کے حجروں پر گئے میں بھی آپ کے پیچھے پیچھے گیا پھر راستے میں میں نے آپ سے کہا اب وہ تین آدمی بھی چلے گئے ہیں ۔ اس وقت آپ لوٹے اور ( زینب رضی اللہ عنہا کے حجرے میں ) آئے ۔ میں بھی حجرے ہی میں تھا لیکن آپ نے میری اور اپنے بیچ میں پردہ ڈال لیا ۔ آپ سورۃ الاحزاب کی یہ آیت پڑھ رہے تھے ۔ ” مسلمانو ! نبی کے گھروں میں نہ جایا کرومگر جب کھانے کے لئے تم کو اند ر آنے کی اجازت دی جائے اس وقت جا ؤ وہ بھی ایسا ٹھیک وقت دیکھ کر کہ کھانے کے پکنے کا انتظار نہ کرنا پڑے البتہ جب بلائے جاؤ تو اندر آ جاؤ اور کھانے سے فارغ ہوتے ہی چل دو ۔ باتوں میں لگ کر وہا ں بیٹھے نہ رہا کرو ، ایسا کرنے سے پیغمبر کو تکلیف ہوتی تھی ، اس کو تم سے شرم آتی تھی ( کہ تم سے کہے کہ چلے جاؤ ) اللہ تعالیٰ حق بات میں نہیں شرماتا ۔ “ ابوعثمان ( جعدی بن دینار ) کہتے تھے کہ انس رضی اللہ عنہ کہا کرتے تھے ۔ کہ میں نے دس سال رسول اللہ صلی اللہ علیہ وسلم کی خدمت کی۔",
                "urduNarrator": "ابراھیم نے ابو عثمان - جن کا نام الجعد ہے - انس بن مالک سے روایت کیا ہے، انہوں نے کہا: وہ ہمارے پاس سے مسجد بنی رفاع میں گزرے، میں نے انہیں یہ فرماتے ہوئے سنا کہ",
                "hadithArabic": "وَقَالَ إِبْرَاهِيمُ عَنْ أَبِي عُثْمَانَ ـ وَاسْمُهُ الْجَعْدُ ـ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مَرَّ بِنَا فِي مَسْجِدِ بَنِي رِفَاعَةَ فَسَمِعْتُهُ يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا مَرَّ بِجَنَبَاتِ أُمِّ سُلَيْمٍ دَخَلَ عَلَيْهَا فَسَلَّمَ عَلَيْهَا، ثُمَّ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم عَرُوسًا بِزَيْنَبَ فَقَالَتْ لِي أُمُّ سُلَيْمٍ لَوْ أَهْدَيْنَا لِرَسُولِ اللَّهِ صلى الله عليه وسلم هَدِيَّةً فَقُلْتُ لَهَا افْعَلِي‏.‏ فَعَمَدَتْ إِلَى تَمْرٍ وَسَمْنٍ وَأَقِطٍ، فَاتَّخَذَتْ حَيْسَةً فِي بُرْمَةٍ، فَأَرْسَلَتْ بِهَا مَعِي إِلَيْهِ، فَانْطَلَقْتُ بِهَا إِلَيْهِ فَقَالَ لِي ‏\"‏ ضَعْهَا ‏\"‏‏.‏ ثُمَّ أَمَرَنِي فَقَالَ ‏\"‏ ادْعُ لِي رِجَالاً ـ سَمَّاهُمْ ـ وَادْعُ لِي مَنْ لَقِيتَ ‏\"‏‏.‏ قَالَ فَفَعَلْتُ الَّذِي أَمَرَنِي فَرَجَعْتُ فَإِذَا الْبَيْتُ غَاصٌّ بِأَهْلِهِ، فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَضَعَ يَدَيْهِ عَلَى تِلْكَ الْحَيْسَةِ، وَتَكَلَّمَ بِهَا مَا شَاءَ اللَّهُ، ثُمَّ جَعَلَ يَدْعُو عَشَرَةً عَشَرَةً، يَأْكُلُونَ مِنْهُ، وَيَقُولُ لَهُمُ ‏\"‏ اذْكُرُوا اسْمَ اللَّهِ، وَلْيَأْكُلْ كُلُّ رَجُلٍ مِمَّا يَلِيهِ ‏\"‏‏.‏ قَالَ حَتَّى تَصَدَّعُوا كُلُّهُمْ عَنْهَا، فَخَرَجَ مِنْهُمْ مَنْ خَرَجَ، وَبَقِيَ نَفَرٌ يَتَحَدَّثُونَ قَالَ وَجَعَلْتُ أَغْتَمُّ، ثُمَّ خَرَجَ النَّبِيُّ صلى الله عليه وسلم نَحْوَ الْحُجُرَاتِ، وَخَرَجْتُ فِي إِثْرِهِ فَقُلْتُ إِنَّهُمْ قَدْ ذَهَبُوا‏.‏ فَرَجَعَ فَدَخَلَ الْبَيْتَ، وَأَرْخَى السِّتْرَ، وَإِنِّي لَفِي الْحُجْرَةِ، وَهْوَ يَقُولُ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلاَّ أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ وَلَكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا فَإِذَا طَعِمْتُمْ فَانْتَشِرُوا وَلاَ مُسْتَأْنِسِينَ لِحَدِيثٍ إِنَّ ذَلِكُمْ كَانَ يُؤْذِي النَّبِيَّ فَيَسْتَحْيِي مِنْكُمْ وَاللَّهُ لاَ يَسْتَحْيِي مِنَ الْحَقِّ‏}‏‏.‏ قَالَ أَبُو عُثْمَانَ قَالَ أَنَسٌ إِنَّهُ خَدَمَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَشْرَ سِنِينَ‏.‏",
                "headingArabic": "الْهَدِيَّةِ لِلْعَرُوسِ",
                "headingUrdu": "دولہا کو تحفہ دینا",
                "headingEnglish": "The giving of a present to the bridegroom",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4937,
                "hadithNumber": "5164",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "She borrowed a necklace from Asma' رضی اللہ عنہا and then it got lost. So Allah's Messenger (ﷺ) sent some people from his companions in search of it. In the meantime the stated time for the prayer became due and they offered their prayer without ablution. When they came to the Prophet, they complained about it to him, so the Verse regarding Tayammum was revealed . Usaid bin Hudair رضی اللہ عنہا said, \"(O `Aisha!) may Allah bless you with a good reward, for by Allah, never did a difficulty happen in connection with you, but Allah made an escape from it for you, and brought Allah's Blessings for the Muslims.\"",
                "hadithUrdu": "انہوں نے ( اپنی بہن ) حضرت اسماء رضی اللہ عنہا سے ایک ہار عاریۃ ًلے لیا تھا ، راستے میں وہ گم ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے اپنے صحابہ میں سے کچھ آدمیوں کو اسے تلاش کرنے کے لئے بھیجا ۔ تلاش کرتے ہوئے نماز کا وقت ہو گیا ( اور پانی نہیں تھا ) اس لئے انہوں نے وضو کے بغیر نماز پڑھی ۔ پھر جب وہ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں واپس ہوئے تو آپ کے سامنے یہ شکوہ کیا ۔ اس پر تیمم کی آیت نازل ہوئی ۔ حضرت اسید بن حضیر رضی اللہ عنہ نے کہا کہ اے عائشہ ! اللہ تمہیں بہتر بدلہ دے ، واللہ ! جب بھی آپ پر کوئی مشکل آن پڑتی ہے تو اللہ تعالیٰ نے تم سے اسے دور کیا اور مزید برآ ں یہ کہ مسلمانوں کے لئے برکت اور بھلائی ہوئی",
                "urduNarrator": "مجھ سے عبید بن اسمعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا اسْتَعَارَتْ مِنْ أَسْمَاءَ قِلاَدَةً، فَهَلَكَتْ، فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم نَاسًا مِنْ أَصْحَابِهِ فِي طَلَبِهَا، فَأَدْرَكَتْهُمُ الصَّلاَةُ فَصَلَّوْا بِغَيْرِ وُضُوءٍ، فَلَمَّا أَتَوُا النَّبِيَّ صلى الله عليه وسلم شَكَوْا ذَلِكَ إِلَيْهِ، فَنَزَلَتْ آيَةُ التَّيَمُّمِ‏.‏ فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ جَزَاكِ اللَّهُ خَيْرًا، فَوَاللَّهِ مَا نَزَلَ بِكِ أَمْرٌ قَطُّ، إِلاَّ جَعَلَ لَكِ مِنْهُ مَخْرَجًا، وَجُعِلَ لِلْمُسْلِمِينَ فِيهِ بَرَكَةٌ‏.‏",
                "headingArabic": "اسْتِعَارَةِ الثِّيَابِ لِلْعَرُوسِ وَغَيْرِهَا",
                "headingUrdu": "دلہن کے لیے کپڑے وغیرہ ادھار لینا",
                "headingEnglish": "To borrow the clothes, etc. for the bride",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4938,
                "hadithNumber": "5165",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If anyone of you, when having sexual intercourse with his wife, says: Bismillah, Allahumma jannibni-Sh-Shaitan wa jannib-ish-Shaitan ma razaqtana, and if it is destined that they should have a child, then Satan will never be able to harm him.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ کوئی شخص اپنی بیوی کے پاس ہمبستری کے لئے جب آئے تو یہ دعا پڑھے بسم اللہ اللھم جنبنی الشیطان وجنب الشیطان ما رزقتنا یعنی میں اللہ کے نام سے شروع کرتا ہوں اے اللہ ! شیطان کو مجھ سے دور رکھ اور شیطان کو اس چیز سے بھی دور رکھ جو ( اولاد ) ہمیں تو عطا کرے ۔ پھر اس عرصہ میں ان کے لئے کوئی اولاد نصیب ہو تو اسے شیطان کبھی ضرر نہ پہنچا سکے گا ۔",
                "urduNarrator": "ہم سے سعد بن حفص طلحی نے بیان کیا ، کہا ہم سے شیبان بن عبدالرحمٰن نے ، ان سے منصور بن معتمر نے ، ان سے سالم بن ابی الجعد نے ، ان سے کریب نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَمَا لَوْ أَنَّ أَحَدَهُمْ يَقُولُ حِينَ يَأْتِي أَهْلَهُ بِاسْمِ اللَّهِ، اللَّهُمَّ جَنِّبْنِي الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا، ثُمَّ قُدِّرَ بَيْنَهُمَا فِي ذَلِكَ، أَوْ قُضِيَ وَلَدٌ، لَمْ يَضُرَّهُ شَيْطَانٌ أَبَدًا ‏\"‏‏.‏",
                "headingArabic": "مَا يَقُولُ الرَّجُلُ إِذَا أَتَى أَهْلَهُ",
                "headingUrdu": "بیوی سے ہمبستری کرنے پر مرد کیا کہے؟",
                "headingEnglish": "What a man should say on having a sexual intercourse with his wife",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4939,
                "hadithNumber": "5166",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "I was ten years old when Allah's Messenger (ﷺ) arrived at Medina. My mother and aunts used to urge me to serve the Prophet (ﷺ) regularly, and I served him for ten years. When the Prophet (ﷺ) died I was twenty years old, and I knew about the order of Al-Hijab (veiling of ladies) more than any other person when it was revealed. It was revealed for the first time when Allah's Messenger (ﷺ) had consummated his marriage with Zainab bint Jahsh رضی اللہ عنہما . When the day dawned, the Prophet (ﷺ) was a bridegroom and he invited the people to a banquet, so they came, ate, and then all left except a few who remained with the Prophet (ﷺ) for a long time. The Prophet (ﷺ) got up and went out, and I too went out with him so that those people might leave too. The Prophet (ﷺ) proceeded and so did I, till he came to the threshold of `Aisha's dwelling place. Then thinking that these people have left by then, he returned and so did I along with him till he entered upon Zainab رضی اللہ عنہا and behold, they were still sitting and had not gone. So the Prophet (ﷺ) again went away and I went away along with him. When we reached the threshold of `Aisha's dwelling place, he thought that they had left, and so he returned and I too, returned along with him and found those people had left. Then the Prophet (ﷺ) drew a curtain between me and him, and the Verses of Al-Hijab were revealed.",
                "hadithUrdu": "جب رسول کریم صلی اللہ علیہ وسلم مدینہ منورہ ہجرت کر کے آئے تو ان کی عمر دس برس کی تھی ۔ میری ماں اور بہنیں نبی کریم صلی اللہ علیہ وسلم کی خدمت کے لئے مجھ کو تاکید کرتی رہتی تھیں ۔ چنانچہ میں نے حضور اکرم صلی اللہ علیہ وسلم کی دس برس تک خدمت کی اور جب آپ کی وفات ہوئی تو میں بیس برس کا تھا ۔ پردہ کے متعلق میں سب سے زیادہ جاننے والوں میں سے ہوں کہ کب نازل ہوا ۔ سب سے پہلے یہ حکم اس وقت نازل ہوا تھا جب آنحضرت صلی اللہ علیہ وسلم زینب بنت جحش رضی اللہ عنہما سے نکاح کے بعد انہیں اپنے گھر لائے تھے ، آپ ان کے دولہا بنے تھے ۔ پھر آپ نے لوگوں کو ( دعوت ولیمہ پر ) بلایا ۔ لوگوں نے کھانا کھایا اور چلے گئے ۔ لیکن کچھ لوگ ان میں سے آنحضرت صلی اللہ علیہ وسلم کے گھر میں ( کھا نے کے بعدبھی ) دیر تک وہیں بیٹھے ( باتیں کرتے رہے ) آخر آنحضرت صلی اللہ علیہ وسلم کھڑے ہوئے اور باہر تشریف لے گئے ۔ میں بھی آنحضرت صلی اللہ علیہ وسلم کے ساتھ باہر گیا تاکہ یہ لوگ بھی چلے جائیں ۔ آنحضرت صلی اللہ علیہ وسلم چلتے رہے اور میں بھی آپ کے ساتھ رہا ۔ جب آپ حضرت عائشہ رضی اللہ عنہا کے حجرہ کے پاس دروازے پر آئے تو آپ کو معلوم ہوا کہ وہ لوگ چلے گئے ہیں ۔ اس لئے آپ واپس تشریف لائے اور میں بھی آپ کے ساتھ آیا ۔ جب آپ زینب رضی اللہ عنہا کے گھر میں داخل ہوئے تو دیکھا کہ وہ لوگ ابھی بیٹھے ہوئے ہیں اور ابھی تک نہیں گئے ہیں ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم وہاں سے پھر واپس تشریف لائے اور میں بھی آپ کے ساتھ واپس آ گیا جب آپ عائشہ رضی اللہ عنہا کے حجرہ کے دروازے پر پہنچے اور آپ کو معلوم ہوا کہ وہ لوگ چلے گئے ہیں تو آپ پھر واپس تشریف لائے اور میں بھی آپ کے ساتھ واپس آیا ۔ اب وہ لوگ واقعی جا چکے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس کے بعد اپنے اور میرے بیچ میں پردہ ڈال دیا اور پردہ کی آیت نازل ہوئی ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیرنے بیان کیا ، کہا کہ مجھ سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے بیان کیا اور انہیں انس بن مالک رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ كَانَ ابْنَ عَشْرِ سِنِينَ مَقْدَمَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ، فَكَانَ أُمَّهَاتِي يُوَاظِبْنَنِي عَلَى خِدْمَةِ النَّبِيِّ صلى الله عليه وسلم فَخَدَمْتُهُ عَشْرَ سِنِينَ، وَتُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم وَأَنَا ابْنُ عِشْرِينَ سَنَةً، فَكُنْتُ أَعْلَمَ النَّاسِ بِشَأْنِ الْحِجَابِ حِينَ أُنْزِلَ، وَكَانَ أَوَّلَ مَا أُنْزِلَ فِي مُبْتَنَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِزَيْنَبَ ابْنَةِ جَحْشٍ، أَصْبَحَ النَّبِيُّ صلى الله عليه وسلم بِهَا عَرُوسًا، فَدَعَا الْقَوْمَ فَأَصَابُوا مِنَ الطَّعَامِ، ثُمَّ خَرَجُوا وَبَقِيَ رَهْطٌ مِنْهُمْ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأَطَالُوا الْمُكْثَ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَخَرَجَ وَخَرَجْتُ مَعَهُ لِكَىْ يَخْرُجُوا، فَمَشَى النَّبِيُّ صلى الله عليه وسلم وَمَشَيْتُ، حَتَّى جَاءَ عَتَبَةَ حُجْرَةِ عَائِشَةَ، ثُمَّ ظَنَّ أَنَّهُمْ خَرَجُوا فَرَجَعَ وَرَجَعْتُ مَعَهُ، حَتَّى إِذَا دَخَلَ عَلَى زَيْنَبَ فَإِذَا هُمْ جُلُوسٌ لَمْ يَقُومُوا، فَرَجَعَ النَّبِيُّ صلى الله عليه وسلم وَرَجَعْتُ مَعَهُ، حَتَّى إِذَا بَلَغَ عَتَبَةَ حُجْرَةِ عَائِشَةَ، وَظَنَّ أَنَّهُمْ خَرَجُوا، فَرَجَعَ وَرَجَعْتُ مَعَهُ فَإِذَا هُمْ قَدْ خَرَجُوا فَضَرَبَ النَّبِيُّ صلى الله عليه وسلم بَيْنِي وَبَيْنَهُ بِالسِّتْرِ، وَأُنْزِلَ الْحِجَابُ‏.‏",
                "headingArabic": "الْوَلِيمَةُ حَقٌّ",
                "headingUrdu": "ولیمہ (شادی کی ضیافت) واجب ہے۔",
                "headingEnglish": "The Walima (wedding banquet) is obligatory",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4940,
                "hadithNumber": "5167",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When `Abdur-Rahman bin `Auf رضی اللہ عنہ married an Ansari woman, the Prophet (ﷺ) asked him, \"How much Mahr did you give her?\" `Abdur-Rahman said, \"Gold equal to the weight of a date stone.\" Anas رضی اللہ عنہ added: When they (i.e. the Prophet (ﷺ) and his companions) arrived at Medina, the emigrants stayed at the Ansar's houses. `Abdur-Rahman bin `Auf رضی اللہ عنہ stayed at Sa`d bin Ar-Rabi's house. Sa`d رضی اللہ عنہ said to `Abdur- Rahman, \"I will divide and share my property with you and will give one of my two wives to you.\" `Abdur-Rahman said, \"May Allah bless you, your wives and property (I am not in need of that; but kindly show me the way to the market).\" So `Abdur-Rahman went to the market and traded there gaining a profit of some dried yoghurt and butter, and married (an Ansari woman). The Prophet (ﷺ) said to him, \"Give a banquet, even if with one sheep.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ سے پوچھا ، انہوں نے قبیلہ انصار کی ایک عورت سے شادی کی تھی کہ مہر کتنا دیا ہے ؟ انہوں نے کہا کہ ایک گٹھلی کے وزن کے برابر سونا ۔ اور حمید سے روایت ہے کہ میں نے حضرت انس رضی اللہ عنہ سے سنا اور انہوں نے بیان کیا کہ جب ( آنحضرت صلی اللہ علیہ وسلم اورمہاجرین صحابہ ) مدینہ ہجرت کر کے آئے تو مہاجرین نے انصار کے یہاں قیام کیا عبدالرحمٰن بن عوف رضی اللہ عنہ نے سعد بن ربیع رضی اللہ عنہ کے یہاں قیام کیا ۔ سعد رضی اللہ عنہ نے ان سے کہا کہ میں آپ کو اپنا مال تقسیم کر دوں گا اور اپنی دوبیویوں میں سے ایک کو آپ کے لئے چھوڑ دوں گا ۔ عبدالرحمٰن نے کہا کہ اللہ آپ کے اہل و عیال اور مال میں برکت دے پھر وہ بازار نکل گئے اور وہاں تجارت شروع کی اور پنیر اور گھی نفع میں کمایا ۔ اس کے بعد شادی کی تو نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ دعوت ولیمہ کر خواہ ایک بکری ہی کی ہو ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا کہ مجھ سے حمیدطویل نے بیان کیا اور انہوں نے حضرت انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي حُمَيْدٌ، أَنَّهُ سَمِعَ أَنَسًا ـ رضى الله عنه ـ قَالَ سَأَلَ النَّبِيُّ صلى الله عليه وسلم عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ وَتَزَوَّجَ امْرَأَةً مِنَ الأَنْصَارِ ‏\"‏ كَمْ أَصْدَقْتَهَا ‏\"‏‏.‏ قَالَ وَزْنَ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ وَعَنْ حُمَيْدٍ سَمِعْتُ أَنَسًا قَالَ لَمَّا قَدِمُوا الْمَدِينَةَ نَزَلَ الْمُهَاجِرُونَ عَلَى الأَنْصَارِ فَنَزَلَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ عَلَى سَعْدِ بْنِ الرَّبِيعِ فَقَالَ أُقَاسِمُكَ مَالِي وَأَنْزِلُ لَكَ عَنْ إِحْدَى امْرَأَتَىَّ‏.‏ قَالَ بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ‏.‏ فَخَرَجَ إِلَى السُّوقِ فَبَاعَ وَاشْتَرَى فَأَصَابَ شَيْئًا مِنْ أَقِطٍ وَسَمْنٍ فَتَزَوَّجَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏",
                "headingArabic": "الْوَلِيمَةِ وَلَوْ بِشَاةٍ",
                "headingUrdu": "ولیمہ ایک بکری کے ساتھ  ہی ہو ۔",
                "headingEnglish": "Al-Walima is to be given even with one sheep",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4941,
                "hadithNumber": "5168",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) did not give a better wedding banquet on the occasion of marrying any of his wives than the one he gave on marrying Zainab رضی اللہ عنہا , and that banquet was with (consisted of) one sheep.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے حضرت زینب رضی اللہ عنہا جیسا ولیمہ اپنی بیویوں میں سے کسی کا نہیں کیا ، ان کا ولیمہ آپ نے ایک بکری کا کیا تھا ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حما د بن زید نے بیان کیا ، ان سے ثابت بنانی نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ مَا أَوْلَمَ النَّبِيُّ صلى الله عليه وسلم عَلَى شَىْءٍ مِنْ نِسَائِهِ، مَا أَوْلَمَ عَلَى زَيْنَبَ أَوْلَمَ بِشَاةٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4942,
                "hadithNumber": "5169",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) manumitted Safiyya رضی اللہ عنہا and then married her, and her Mahr was her manumission, and he gave a wedding banquet with Hais (a sort of sweet dish made from butter, cheese and dates).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے حضرت صفیہ رضی اللہ عنہا کو آزاد کیا اور پھر ان سے نکاح کیا اور ان کی آزادی کو ان کا مہر قرار دیااور ان کا ولیمہ ملیدہ (مکھن، پنیر اور کھجور سے بنی ہوئی میٹھی ڈش)سے کیا ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، ان سے عبدالوارث نے بیان کیا ، ان سے شعیب نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ عَبْدِ الْوَارِثِ، عَنْ شُعَيْبٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَعْتَقَ صَفِيَّةَ، وَتَزَوَّجَهَا وَجَعَلَ عِتْقَهَا صَدَاقَهَا، وَأَوْلَمَ عَلَيْهَا بِحَيْسٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4943,
                "hadithNumber": "5170",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) consummated his marriage with a woman (Zainab رضی اللہ عنہا ), so he sent me to invite men to the meals.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک خاتون ( زینب بن جحش رضی اللہ عنہا ) کو نکاح کر کے لائے تو مجھے بھیجا اور میں نے لوگوں کو ولیمہ کھا نے کے لئے بلایا ۔",
                "urduNarrator": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، ان سے بیان بن بشر نے بیان کیا ، انہوں نے کہا کہ میں نے حضرت انس رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا زُهَيْرٌ، عَنْ بَيَانٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ بَنَى النَّبِيُّ صلى الله عليه وسلم بِامْرَأَةٍ فَأَرْسَلَنِي فَدَعَوْتُ رِجَالاً إِلَى الطَّعَامِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4944,
                "hadithNumber": "5171",
                "englishNarrator": "Narrated Thabit:",
                "hadithEnglish": "The marriage of Zainab bint Jahash رضی اللہ عنہا was mentioned in the presence of Anas رضی اللہ عنہ and he said, \"I did not see the Prophet (ﷺ) giving a better banquet on marrying any of his wives than the one he gave on marrying Zainab. He then gave a banquet with one sheep.\"",
                "hadithUrdu": "انس رضی اللہ عنہ کے سامنے زینب بنت جحش رضی اللہ عنہا کے نکاح کا ذکر کیا گیا تو انہوں نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ان کے جیسا اپنی بیویوں میں سے کسی کے لئے ولیمہ کرتے نہیں دیکھا ۔ آنحضرت صلی اللہ علیہ وسلم نے ان کا ولیمہ ایک بکری سے کیا تھا ۔",
                "urduNarrator": "ہم سے مسدد بن مسر ہد نے بیان کیا ، کہا ہم سے حماد بن زید نے ، ان سے ثابت بنانی نے ، کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، قَالَ ذُكِرَ تَزْوِيجُ زَيْنَبَ ابْنَةِ جَحْشٍ عِنْدَ أَنَسٍ فَقَالَ مَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم أَوْلَمَ عَلَى أَحَدٍ مِنْ نِسَائِهِ مَا أَوْلَمَ عَلَيْهَا أَوْلَمَ بِشَاةٍ‏.‏",
                "headingArabic": "مَنْ أَوْلَمَ عَلَى بَعْضِ نِسَائِهِ أَكْثَرَ مِنْ بَعْضٍ",
                "headingUrdu": "بعض بیویوں سے نکاح کرنے پر دوسری بیویوں سے بڑا ولیمہ",
                "headingEnglish": "A bigger Walima on marrying some wives than the other wives",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4945,
                "hadithNumber": "5172",
                "englishNarrator": "Narrated Safiyya bint Shaiba رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) gave a banquet with two Mudds of barley on marrying some of his wives. (1 Mudd= 1 3/4 of a kilogram) .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اپنی ایک بیوی کا ولیمہ دو مد ( تقریباً پونے دوسیر ) جو سے کیا تھا ۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے منصور بن صفیہ نے ، ان سے ان کی والدہ حضرت صفیہ بنت شیبہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورِ ابْنِ صَفِيَّةَ، عَنْ أُمِّهِ، صَفِيَّةَ بِنْتِ شَيْبَةَ قَالَتْ أَوْلَمَ النَّبِيُّ صلى الله عليه وسلم عَلَى بَعْضِ نِسَائِهِ بِمُدَّيْنِ مِنْ شَعِيرٍ‏.‏",
                "headingArabic": "مَنْ أَوْلَمَ بِأَقَلَّ مِنْ شَاةٍ",
                "headingUrdu": "ایک بھیڑ سے کم کا ولیمہ",
                "headingEnglish": "Walima of less than one sheep",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4946,
                "hadithNumber": "5173",
                "englishNarrator": "Narrated `Abdullah bin `Umar:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If anyone of you is invited to a wedding banquet, he must go for it (accept the invitation).\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تم میں سے کسی کو دعوت ولیمہ پر بلایا جائے تو اسے آنا چاہئے ۔ معلوم ہوا کہ دعوت ولیمہ کاقبول کرنا ضروری ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم سے مالک نے خبر دی ، انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا دُعِيَ أَحَدُكُمْ إِلَى الْوَلِيمَةِ فَلْيَأْتِهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4947,
                "hadithNumber": "5174",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Set the captives free, accept the invitation (to a wedding banquet), and visit the patients.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا قیدی کو چھڑاؤ ، دعوت کرنے والے کی دعوت قبول کرو اور بیمارکی عیادت کرو ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ بن کثیر نے یبان کیا ، ان سے سفیان ثوری نے ، کہا کہ مجھ سے منصور نے بیان کیا ، ان سے ابووائل نے اور ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي مَنْصُورٌ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ فُكُّوا الْعَانِيَ، وَأَجِيبُوا الدَّاعِيَ، وَعُودُوا الْمَرِيضَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4948,
                "hadithNumber": "5175",
                "englishNarrator": "Narrated Al-Bara' bin `Azib رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) ordered us to do seven (things) and forbade us from seven. He ordered us to visit the patients, to follow the funeral procession, to reply to the sneezer (i.e., say to him, 'Yarhamuka-l-lah (May Allah bestow His Mercy upon you), if he says 'Al-hamduli l-lah' (Praise be to Allah), to help others to fulfill their oaths, to help the oppressed, to greet (whomever one should meet), and to accept the invitation (to a wedding banquet). He forbade us to wear golden rings, to use silver utensils, to use Maiyathir (cushions of silk stuffed with cotton and placed under the rider on the saddle), the Qasiyya (linen clothes containing silk brought from an Egyptian town), the Istibraq (thick silk) and the Dibaj (another kind of silk). (See Hadith No. 539 and 753). Abu Awanah and Shibani have reported from Ash'ath in the same way about promotion greeting.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ہمیں سات کا موں کا حکم دیا اور سات کامو ں سے منع فرمایا ۔ ہمیں آنحضرت صلی اللہ علیہ وسلم نے بیمارکی عیادت ، جنازہ کے پیچھے چلنے ، چھینکنے والے کے جواب دینے ( یرحمک اللہ یعنی اللہ تم پر رحم کرے ، کہنا ) قسم کو پورا کرنے ، مظلوم کی مدد کرنے ، سب کو سلام کرنے اور دعوت کرنے والے کی دعوت قبول کرنے کاحکم دیا تھا اور ہمیں آنحضرت صلی اللہ علیہ وسلم نے سونے کی انگوٹھی پہننے ، چاندی کے برتن استعمال کرنے ، ریشمی گدے ، قسیہ ( ریشمی کپڑا ) استبرق ( موٹے ریشم کا کپڑا ) اور دیباج ( ایک ریشمی کپڑا ) کے استعمال سے منع فرمایا تھا ۔ ابو عوانہ اور شیبانی نے اشعث کی روایت سے لفظ افشاء السلام میں ابوالاحوص کی متابعت کی ہے ۔",
                "urduNarrator": "ہم سے حسن بن ربیع نے بیان کیا ، کہا ہم سے ابوالاحوص ( سلام بن سلیم ) نے بیان کیا ، ان سے اشعث بن ابی الشعثاء نے ، ان سے معاویہ بن سوید نے کہ براء بن عازب رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنِ الأَشْعَثِ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدٍ، قَالَ الْبَرَاءُ بْنُ عَازِبٍ ـ رضى الله عنهما ـ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم بِسَبْعٍ، وَنَهَانَا عَنْ سَبْعٍ، أَمَرَنَا بِعِيَادَةِ الْمَرِيضِ، وَاتِّبَاعِ الْجِنَازَةِ، وَتَشْمِيتِ الْعَاطِسِ، وَإِبْرَارِ الْقَسَمِ، وَنَصْرِ الْمَظْلُومِ، وَإِفْشَاءِ السَّلاَمِ، وَإِجَابَةِ الدَّاعِي، وَنَهَانَا عَنْ خَوَاتِيمِ الذَّهَبِ، وَعَنْ آنِيَةِ الْفِضَّةِ، وَعَنِ الْمَيَاثِرِ، وَالْقَسِّيَّةِ، وَالإِسْتَبْرَقِ وَالدِّيبَاجِ‏.‏ تَابَعَهُ أَبُو عَوَانَةَ وَالشَّيْبَانِيُّ عَنْ أَشْعَثَ فِي إِفْشَاءِ السَّلاَمِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4949,
                "hadithNumber": "5176",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "Abu Usaid As-Sa'di رضی اللہ عنہ invited Allah's Messenger (ﷺ) to his wedding party and his wife who was the bride, served them on that day. Do you know what drink she gave Allah's Messenger (ﷺ)? She had soaked some dates for him (in water) overnight, and when he had finished his meal she gave him that drink (of soaked dates).",
                "hadithUrdu": "حضرت ابوا سید ساعدی رضی اللہ عنہ نے رسول کریم صلی اللہ علیہ وسلم کو اپنی شادی پر دعوت دی ، ان کی دلہن ام اسیدسلامہ بنت وہب ضروری جو کام کا ج کر رہی تھیں اور وہی دلہن بنی تھیں ۔ حضرت سہل رضی اللہ عنہ نے کہا تمہیں معلوم ہے انہوں نے آنحضرت صلی اللہ علیہ وسلم کو اس موقع پر کیا پلایا تھا ؟ رات کے وقت انہوں نے کچھ کھجوریں پانی میں بھگو دی تھیں ( صبح کو ) جب آنحضرت صلی اللہ علیہ وسلم کھانے سے فارغ ہوئے تو آپ کو وہی پلایا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے عبد العزیز بن ابی حازم نے بیان کیا اور ان سے سہل بن سعد رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ دَعَا أَبُو أُسَيْدٍ السَّاعِدِيُّ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي عُرْسِهِ، وَكَانَتِ امْرَأَتُهُ يَوْمَئِذٍ خَادِمَهُمْ وَهْىَ الْعَرُوسُ، قَالَ سَهْلٌ تَدْرُونَ مَا سَقَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْقَعَتْ لَهُ تَمَرَاتٍ مِنَ اللَّيْلِ، فَلَمَّا أَكَلَ سَقَتْهُ إِيَّاهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4950,
                "hadithNumber": "5177",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The worst food is that of a wedding banquet to which only the rich are invited while the poor are not invited. And he who refuses an invitation (to a banquet) disobeys Allah and His Apostle .",
                "hadithUrdu": "ولیمہ کا وہ کھا نا بدترین کھا نا ہے جس میں صرف مالداروں کو اس کی طرف دعوت دی جائے اور محتاجوں کو نہ کھلایا جائے اور جس نے ولیمہ کی دعوت قبول کرنے سے انکار کیا اس نے اللہ اور اس کے رسول کی نافرمانی کی ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه أَنَّهُ كَانَ يَقُولُ شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ يُدْعَى لَهَا الأَغْنِيَاءُ، وَيُتْرَكُ الْفُقَرَاءُ، وَمَنْ تَرَكَ الدَّعْوَةَ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ صلى الله عليه وسلم‏.‏",
                "headingArabic": "مَنْ تَرَكَ الدَّعْوَةَ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ",
                "headingUrdu": "اگر کوئی دعوت دینے سے انکار کرتا ہے۔",
                "headingEnglish": "If somebody refuses an invitation",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4951,
                "hadithNumber": "5178",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If I am invited to a meal of trotters I will accept it; and if I am given a trotter as a present I will accept it.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر مجھے بکری کے کھر کی دعوت دی جائے تو میں اسے بھی قبول کروں گا اور اگر مجھے وہ کھر بھی ہدیہ میں دیئے جائیں تو میں اسے قبول کروں گا ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، ان سے ابوحمزہ نے ، ا ن سے اعمش نے ، ان سے ابوحازم نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَوْ دُعِيتُ إِلَى كُرَاعٍ لأَجَبْتُ، وَلَوْ أُهْدِيَ إِلَىَّ ذِرَاعٌ لَقَبِلْتُ ‏\"‏‏.‏",
                "headingArabic": "مَنْ أَجَابَ إِلَى كُرَاعٍ",
                "headingUrdu": "جس نے بھی  بکری کے کھر کے کھانے کی دعوت قبول کی۔",
                "headingEnglish": "Whoever accepted the invitation to a meal of trotters",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4952,
                "hadithNumber": "5179",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) said, 'Accept the marriage invitation if you are invited to it.' \" Ibn `Umar رضی اللہ عنہما used to accept the invitation whether to a wedding banquet or to any other party, even when he was fasting.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اس ولیمہ کی جب تمہیں دعوت دی جائے تو قبول کرو ۔ بیان کیا کہ حضرت عبداللہ بن عمر رضی اللہ عنہما اگر روزے سے ہوتے جب بھی ولیمہ کی دعوت یا کسی دوسری دعوت میں شرکت کرتے تھے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ بن ابراہیم نے بیان کیا ، انہوں نے کہا ہم سے حجاج بن محمد اعور نے بیان کیا ، انہوں نے کہا کہ ابن جریج نے کہا کہ مجھ کو موسیٰ بن عقبہ نے خبر دی ، انہیں نافع نے ، انہوں نے کہا کہ میں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے سنا ، انہوں نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ، حَدَّثَنَا الْحَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَجِيبُوا هَذِهِ الدَّعْوَةَ إِذَا دُعِيتُمْ لَهَا ‏\"‏‏.‏ قَالَ كَانَ عَبْدُ اللَّهِ يَأْتِي الدَّعْوَةَ فِي الْعُرْسِ وَغَيْرِ الْعُرْسِ وَهْوَ صَائِمٌ‏.‏",
                "headingArabic": "إِجَابَةِ الدَّاعِي فِي الْعُرْسِ وَغَيْرِه",
                "headingUrdu": "کسی پارٹی کی دعوت کو قبول کرنا",
                "headingEnglish": "To accept the invitation to a party",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4926,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=197",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=195",
                "label": "195",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=196",
                "label": "196",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=197",
                "label": "197",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=198",
                "label": "198",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=199",
                "label": "199",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=200",
                "label": "200",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=201",
                "label": "201",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=199",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=199",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=197",
        "to": 4950,
        "total": 40465
    }
}