{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 5,
        "data": [
            {
                "id": 101,
                "hadithNumber": "101",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri:",
                "hadithEnglish": "Some women requested the Prophet (ﷺ) to fix a day for them as the men were taking all his time. On that he promised them one day for religious lessons and commandments. Once during such a lesson the Prophet said, \"A woman whose three children die will be shielded by them from the Hell fire.\" On that a woman asked, \"If only two die?\" He replied, \"Even two (will shield her from the Hell-fire).",
                "hadithUrdu": "عورتوں نے رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ ( آپ صلی اللہ علیہ وسلم سے فائدہ اٹھانے میں ) مرد ہم سے آگے بڑھ گئے ہیں ، اس لیے آپ اپنی طرف سے ہمارے ( وعظ کے ) لیے ( بھی ) کوئی دن خاص فرما دیں ۔ تو آپ صلی اللہ علیہ وسلم نے ان سے ایک دن کا وعدہ فرما لیا ۔ اس دن عورتوں سے آپ نے ملاقات کی اور انہیں وعظ فرمایا اور ( مناسب ) احکام سنائے جو کچھ آپ صلی اللہ علیہ وسلم نے ان سے فرمایا تھا اس میں یہ بات بھی تھی کہ جو کوئی عورت تم میں سے ( اپنے ) تین ( لڑکے ) آگے بھیج دے گی تو وہ اس کے لیے دوزخ سے پناہ بن جائیں گے ۔ اس پر ایک عورت نے کہا ، اگر دو ( بچے بھیج دے ) آپ صلی اللہ علیہ وسلم نے فرمایا ہاں ! اور دو ( کا بھی یہ حکم ہے ) ۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا ، ان سے شعبہ نے ، ان سے ابن الاصبہانی نے ، انھوں نے ابوصالح ذکوان سے سنا ، وہ حضرت ابو سعید خدری رضی اللہ عنہ سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي ابْنُ الأَصْبَهَانِيِّ، قَالَ سَمِعْتُ أَبَا صَالِحٍ، ذَكْوَانَ يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ،‏.‏ قَالَتِ النِّسَاءُ لِلنَّبِيِّ صلى الله عليه وسلم غَلَبَنَا عَلَيْكَ الرِّجَالُ، فَاجْعَلْ لَنَا يَوْمًا مِنْ نَفْسِكَ‏.‏ فَوَعَدَهُنَّ يَوْمًا لَقِيَهُنَّ فِيهِ، فَوَعَظَهُنَّ وَأَمَرَهُنَّ، فَكَانَ فِيمَا قَالَ لَهُنَّ ‏\"‏ مَا مِنْكُنَّ امْرَأَةٌ تُقَدِّمُ ثَلاَثَةً مِنْ وَلَدِهَا إِلاَّ كَانَ لَهَا حِجَابًا مِنَ النَّارِ ‏\"‏‏.‏ فَقَالَتِ امْرَأَةٌ وَاثْنَيْنِ فَقَالَ ‏\"‏ وَاثْنَيْنِ ‏\"‏‏.‏",
                "headingArabic": "هَلْ يُجْعَلُ لِلنِّسَاءِ يَوْمٌ عَلَى حِدَةٍ فِي الْعِلْمِ",
                "headingUrdu": "کیا عورتوں کے لیے (مردوں کے علاوہ) دین کی تعلیم دینے کے لیے کوئی دن مقرر کیا جائے؟",
                "headingEnglish": "Should a day be fixed for women in order to teach them religion (apart from men)?",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 102,
                "hadithNumber": "102",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri:",
                "hadithEnglish": "as above (the sub narrators are different). Abu Huraira qualified the three children referred to in the above mentioned Hadith as not having reached the age of committing sins (i.e. age of puberty) .",
                "hadithUrdu": "انھوں نے فرمایا کہ ایسے تین ( بچے ) جو ابھی بلوغت کو نہ پہنچے ہوں ۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا ، ان سے غندر نے ، ان سے شعبہ نے عبدالرحمٰن بن الاصبہانی کے واسطے سے بیان کیا ، وہ ذکوان سے ، وہ ابوسعید سے اور ابو سعید خدری رضی اللہ عنہ ، رسول اللہ صلی اللہ علیہ وسلم سے یہی حدیث روایت کرتے ہیں ۔ اور ( دوسری سند میں ) عبدالرحمٰن الاصبہانی کہتے ہیں کہ میں نے ابوحازم سے سنا ، وہ ابوہریرہ سے نقل کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبَهَانِيِّ، عَنْ ذَكْوَانَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا‏.‏ وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبَهَانِيِّ، قَالَ سَمِعْتُ أَبَا حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ‏ \"‏ ثَلاَثَةً لَمْ يَبْلُغُوا الْحِنْثَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 103,
                "hadithNumber": "103",
                "englishNarrator": "Narrated Ibn Abu Mulaika:",
                "hadithEnglish": "Whenever `Aisha (the wife of the Prophet) heard anything which she did not understand, she used to ask again till she understood it completely. Aisha said: \"Once the Prophet (ﷺ) said, \"Whoever will be called to account (about his deeds on the Day of Resurrection) will surely be punished.\" I said, \"Doesn't Allah say: \"He surely will receive an easy reckoning.\" (84.8) The Prophet (ﷺ) replied, \"This means only the presentation of the accounts but whoever will be argued about his account, will certainly be ruined.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی بیوی حضرت عائشہ رضی اللہ عنہا جب کوئی ایسی باتیں سنتیں جس کو سمجھ نہ پاتیں تو دوبارہ اس کو معلوم کرتیں تاکہ سمجھ لیں ۔ چنانچہ ( ایک مرتبہ ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس سے حساب لیا گیا اسے عذاب کیا جائے گا ۔ حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ ( یہ سن کر ) میں نے کہا کہ کیا اللہ نے یہ نہیں فرمایا کہ عنقریب اس سے آسان حساب لیا جائے گا ؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ یہ صرف ( اللہ کے دربار میں ) پیشی کا ذکر ہے ۔ لیکن جس کے حساب میں جانچ پڑتال کی گئی ( سمجھو ) وہ غارت ہو گیا ۔",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا ، انہیں نافع بن عمر نے خبر دی ، انہیں ابن ابی ملیکہ نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ أَخْبَرَنَا نَافِعُ بْنُ عُمَرَ، قَالَ حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ لاَ تَسْمَعُ شَيْئًا لاَ تَعْرِفُهُ إِلاَّ رَاجَعَتْ فِيهِ حَتَّى تَعْرِفَهُ، وَأَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ حُوسِبَ عُذِّبَ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ فَقُلْتُ أَوَ لَيْسَ يَقُولُ اللَّهُ تَعَالَى ‏{‏فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا‏}‏ قَالَتْ فَقَالَ ‏\"‏ إِنَّمَا ذَلِكَ الْعَرْضُ، وَلَكِنْ مَنْ نُوقِشَ الْحِسَابَ يَهْلِكْ ‏\"‏‏.‏",
                "headingArabic": "مَنْ سَمِعَ شَيْئًا، فَرَاجَعَ حَتَّى يَعْرِفَهُ",
                "headingUrdu": "جس نے کوئی بات سنی (لیکن نہ سمجھی) پھر دوبارہ پوچھا یہاں تک کہ پوری طرح سمجھ جائے۔",
                "headingEnglish": "Whoever heard something (but did not understand it) and then asked again till he understood it completely",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 104,
                "hadithNumber": "104",
                "englishNarrator": "Narrated Sa`id:",
                "hadithEnglish": "Abu Shuraih said, \"When `Amr bin Sa`id was sending the troops to Mecca (to fight `Abdullah bin Az- Zubair) I said to him, 'O chief! Allow me to tell you what the Prophet (ﷺ) said on the day following the conquests of Mecca. My ears heard and my heart comprehended, and I saw him with my own eyes, when he said it. He glorified and praised Allah and then said, \"Allah and not the people has made Mecca a sanctuary. So anybody who has belief in Allah and the Last Day (i.e. a Muslim) should neither shed blood in it nor cut down its trees. If anybody argues that fighting is allowed in Mecca as Allah's Messenger (ﷺ) did fight (in Mecca), tell him that Allah gave permission to His Apostle, but He did not give it to you. The Prophet (ﷺ) added: Allah allowed me only for a few hours on that day (of the conquest) and today (now) its sanctity is the same (valid) as it was before. So it is incumbent upon those who are present to convey it (this information) to those who are absent.\" Abu- Shuraih was asked, \"What did `Amr reply?\" He said `Amr said, \"O Abu Shuraih! I know better than you (in this respect). Mecca does not give protection to one who disobeys (Allah) or runs after committing murder, or theft (and takes refuge in Mecca).",
                "hadithUrdu": "انھوں نے عمرو بن سعید ( والی مدینہ ) سے جب وہ مکہ میں ( ابن زبیر سے لڑنے کے لیے ) فوجیں بھیج رہے تھے کہا کہ اے امیر ! مجھے آپ اجازت دیں تو میں وہ حدیث آپ سے بیان کر دوں ، جو رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے دوسرے دن ارشاد فرمائی تھی ، اس ( حدیث ) کو میرے دونوں کانوں نے سنا اور میرے دل نے اسے یاد رکھا ہے اور جب رسول اللہ صلی اللہ علیہ وسلم یہ حدیث فرما رہے تھے تو میری آنکھیں آپ صلی اللہ علیہ وسلم کو دیکھ رہی تھیں ۔ آپ صلی اللہ علیہ وسلم نے ( پہلے ) اللہ کی حمد و ثنا بیان کی ، پھر فرمایا کہ مکہ کو اللہ نے حرام کیا ہے ، آدمیوں نے حرام نہیں کیا ۔ تو ( سن لو ) کہ کسی شخص کے لیے جو اللہ پر اور یوم آخرت پر ایمان رکھتا ہو جائز نہیں ہے کہ مکہ میں خون ریزی کرے ، یا اس کا کوئی پیڑ کاٹے ، پھر اگر کوئی اللہ کے رسول ( کے لڑنے ) کی وجہ سے اس کا جواز نکالے تو اس سے کہہ دو اللہ نے اپنے رسول صلی اللہ علیہ وسلم کے لیے اجازت دی تھی ، تمہارے لیے نہیں دی اور مجھے بھی دن کے کچھ لمحوں کے لیے اجازت ملی تھی ۔ آج اس کی حرمت لوٹ آئی ، جیسی کل تھی ۔ اور حاضر غائب کو ( یہ بات ) پہنچا دے ۔ ( یہ حدیث سننے کے بعد راوی حدیث ) ابوشریح سے پوچھا گیا کہ ( آپ کی یہ بات سن کر ) عمرو نے کیا جواب دیا ؟ کہا یوں کہ اے ( ابوشریح ! ) حدیث کو میں تم سے زیادہ جانتا ہوں ۔ مگر حرم ( مکہ ) کسی خطاکار کو یا خون کر کے اور فتنہ پھیلا کر بھاگ آنے والے کو پناہ نہیں دیتا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، ان سے لیث نے ، ان سے سعید بن ابی سعید نے ، وہ ابوشریح سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي سَعِيدٌ، عَنْ أَبِي شُرَيْحٍ، أَنَّهُ قَالَ لِعَمْرِو بْنِ سَعِيدٍ وَهْوَ يَبْعَثُ الْبُعُوثَ إِلَى مَكَّةَ ائْذَنْ لِي أَيُّهَا الأَمِيرُ أُحَدِّثْكَ قَوْلاً قَامَ بِهِ النَّبِيُّ صلى الله عليه وسلم الْغَدَ مِنْ يَوْمِ الْفَتْحِ، سَمِعَتْهُ أُذُنَاىَ وَوَعَاهُ قَلْبِي، وَأَبْصَرَتْهُ عَيْنَاىَ، حِينَ تَكَلَّمَ بِهِ، حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏ \"‏ إِنَّ مَكَّةَ حَرَّمَهَا اللَّهُ، وَلَمْ يُحَرِّمْهَا النَّاسُ، فَلاَ يَحِلُّ لاِمْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ يَسْفِكَ بِهَا دَمًا، وَلاَ يَعْضِدَ بِهَا شَجَرَةً، فَإِنْ أَحَدٌ تَرَخَّصَ لِقِتَالِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِيهَا فَقُولُوا إِنَّ اللَّهَ قَدْ أَذِنَ لِرَسُولِهِ، وَلَمْ يَأْذَنْ لَكُمْ‏.‏ وَإِنَّمَا أَذِنَ لِي فِيهَا سَاعَةً مِنْ نَهَارٍ، ثُمَّ عَادَتْ حُرْمَتُهَا الْيَوْمَ كَحُرْمَتِهَا بِالأَمْسِ، وَلْيُبَلِّغِ الشَّاهِدُ الْغَائِبَ ‏\"‏‏.‏ فَقِيلَ لأَبِي شُرَيْحٍ مَا قَالَ عَمْرٌو قَالَ أَنَا أَعْلَمُ مِنْكَ يَا أَبَا شُرَيْحٍ، لاَ يُعِيذُ عَاصِيًا، وَلاَ فَارًّا بِدَمٍ، وَلاَ فَارًّا بِخَرْبَةٍ‏.‏",
                "headingArabic": "لِيُبَلِّغِ الْعِلْمَ الشَّاهِدُ الْغَائِبَ",
                "headingUrdu": "جو لوگ حاضر ہیں ان پر واجب ہے کہ وہ غیر حاضر لوگوں تک علم پہنچائیں۔",
                "headingEnglish": "It is incumbent on those who are present [in a religious meeting (or conference)] to convey the knowledge to those who are absent",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 105,
                "hadithNumber": "105",
                "englishNarrator": "Narrated Abu Bakra:",
                "hadithEnglish": "The Prophet (ﷺ) said. No doubt your blood, property, the sub-narrator Muhammad thought that Abu Bakra had also mentioned and your honor (chastity), are sacred to one another as is the sanctity of this day of yours in this month of yours. It is incumbent on those who are present to inform those who are absent.\" (Muhammad the Sub-narrator used to say, \"Allah's Messenger (ﷺ) told the truth.\") The Prophet (ﷺ) repeated twice: \"No doubt! Haven't I conveyed Allah's message to you.",
                "hadithUrdu": "( ایک مرتبہ ) ابوبکرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کا ذکر کیا کہ آپ صلی اللہ علیہ وسلم نے ( یوں ) فرمایا ، تمہارے خون اور تمہارے مال ، محمد کہتے ہیں کہ میرے خیال میں آپ صلی اللہ علیہ وسلم نے «وأعراضكم» کا لفظ بھی فرمایا ۔ ( یعنی ) اور تمہاری آبروئیں تم پر حرام ہیں ۔ جس طرح تمہارے آج کے دن کی حرمت تمہارے اس مہینے میں ۔ سن لو ! یہ خبر حاضر غائب کو پہنچا دے ۔ اور محمد ( راوی حدیث ) کہتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے سچ فرمایا ۔ ( پھر ) دوبارہ فرمایا کہ کیا میں نے ( اللہ کا یہ حکم ) تمہیں نہیں پہنچا دیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، ان سے حماد نے ایوب کے واسطے سے نقل کیا ، وہ محمد سے اور وہ ابن ابی بکرہ سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنِ ابْنِ أَبِي بَكْرَةَ، عَنْ أَبِي بَكْرَةَ، ذُكِرَ النَّبِيُّ صلى الله عليه وسلم قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ ـ قَالَ مُحَمَّدٌ وَأَحْسِبُهُ قَالَ وَأَعْرَاضَكُمْ ـ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا، أَلاَ لِيُبَلِّغِ الشَّاهِدُ مِنْكُمُ الْغَائِبَ ‏\"‏‏.‏ وَكَانَ مُحَمَّدٌ يَقُولُ صَدَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم كَانَ ذَلِكَ ‏\"‏ أَلاَ هَلْ بَلَّغْتُ ‏\"‏ مَرَّتَيْنِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 106,
                "hadithNumber": "106",
                "englishNarrator": "Narrated `Ali:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Do not tell a lie against me for whoever tells a lie against me (intentionally) then he will surely enter the Hell-fire.\"",
                "hadithUrdu": "میں نے حضرت علی رضی اللہ عنہ کو یہ فرماتے ہوئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ مجھ پر جھوٹ مت بولو ۔ کیونکہ جو مجھ پر جھوٹ باندھے وہ دوزخ میں داخل ہو ۔",
                "urduNarrator": "ہم سے علی بن جعد نے بیان کیا ، انہیں شعبہ نے خبر دی ، انہیں منصور نے ، انھوں نے ربعی بن حراش سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، قَالَ أَخْبَرَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي مَنْصُورٌ، قَالَ سَمِعْتُ رِبْعِيَّ بْنَ حِرَاشٍ، يَقُولُ سَمِعْتُ عَلِيًّا، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تَكْذِبُوا عَلَىَّ، فَإِنَّهُ مَنْ كَذَبَ عَلَىَّ فَلْيَلِجِ النَّارَ ‏\"‏‏.‏",
                "headingArabic": "إِثْمِ مَنْ كَذَبَ عَلَى النَّبِيِّ صلى الله عليه وسلم",
                "headingUrdu": "نبی صلی اللہ علیہ وسلم پر جھوٹ بولنے والے کا گناہ",
                "headingEnglish": "The sin of a person who tells a lie against the Prophet (saws)",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 107,
                "hadithNumber": "107",
                "englishNarrator": "Narrated `Abdullah bin Az-Zubair:",
                "hadithEnglish": "I said to my father, 'I do not hear from you any narration (Hadith) of Allah s Apostle as I hear (his narration) from so and so?\" Az-Zubair replied. l was always with him (the Prophet) and I heard him saying \"Whoever tells a lie against me (intentionally) then (surely) let him occupy, his seat in Hellfire.",
                "hadithUrdu": "میں نے کبھی آپ سے رسول اللہ صلی اللہ علیہ وسلم کی احادیث نہیں سنیں ۔ جیسا کہ فلاں ، فلاں بیان کرتے ہیں ، کہا میں کبھی آپ سے الگ تھلگ نہیں رہا لیکن میں نے آپ کو یہ بھی فرماتے ہوئے سنا ہے کہ جو شخص مجھ پر جھوٹ باندھے گا وہ اپنا ٹھکانا جہنم میں بنا لے ۔",
                "urduNarrator": "ہم سے ابوالولید نے بیان کیا ، انھوں نے کہا ہم سے شعبہ نے ، ان سے جامع بن شداد نے ، وہ عامر بن عبداللہ بن زبیر سے اور وہ اپنے باپ عبداللہ بن زبیر رضی اللہ عنہما سے روایت کرتے ہیں ۔ انھوں نے کہا میں نے اپنے باپ یعنی زبیر سے عرض کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ جَامِعِ بْنِ شَدَّادٍ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، قَالَ قُلْتُ لِلزُّبَيْرِ إِنِّي لاَ أَسْمَعُكَ تُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم كَمَا يُحَدِّثُ فُلاَنٌ وَفُلاَنٌ‏.‏ قَالَ أَمَا إِنِّي لَمْ أُفَارِقْهُ وَلَكِنْ سَمِعْتُهُ يَقُولُ ‏ \"‏ مَنْ كَذَبَ عَلَىَّ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 108,
                "hadithNumber": "108",
                "englishNarrator": "Narrated Anas:",
                "hadithEnglish": "The fact which stops me from narrating a great number of Hadiths to you is that the Prophet (ﷺ) said: \"Whoever tells a lie against me intentionally, then (surely) let him occupy his seat in Hell-fire.\"",
                "hadithUrdu": "مجھے بہت سی حدیثیں بیان کرنے سے یہ بات روکتی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص مجھ پر جان بوجھ کر جھوٹ باندھے تو وہ اپنا ٹھکانا جہنم میں بنا لے ۔",
                "urduNarrator": "ہم سے ابومعمر نے بیان کیا ، ان سے عبدالوارث نے عبدالعزیز کے واسطے سے نقل کیا کہ حضرت انس رضی اللہ عنہ فرماتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، قَالَ أَنَسٌ إِنَّهُ لَيَمْنَعُنِي أَنْ أُحَدِّثَكُمْ حَدِيثًا كَثِيرًا أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ تَعَمَّدَ عَلَىَّ كَذِبًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 109,
                "hadithNumber": "109",
                "englishNarrator": "Narrated Salama:",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"Whoever (intentionally) ascribes to me what I have not said then (surely) let him occupy his seat in Hell-fire.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا کہ جو شخص میرے نام سے وہ بات بیان کرے جو میں نے نہیں کہی تو وہ اپنا ٹھکانا جہنم میں بنا لے ۔",
                "urduNarrator": "ہم سے مکی ابن ابراہیم نے بیان کیا ، ان سے یزید بن ابی عبید نے سلمہ بن الاکوع رضی اللہ عنہ کے واسطے سے بیان کیا ، وہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ يَقُلْ عَلَىَّ مَا لَمْ أَقُلْ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 110,
                "hadithNumber": "110",
                "englishNarrator": "Narrated Abu Huraira:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Name yourselves with my name (use my name) but do not name yourselves with my Kunya name (i.e. Abul Qasim). And whoever sees me in a dream then surely he has seen me for Satan cannot impersonate me. And whoever tells a lie against me (intentionally), then (surely) let him occupy his seat in Hell-fire.\"",
                "hadithUrdu": "وہ رسول اللہ صلی اللہ علیہ وسلم سے کہ ( اپنی اولاد ) کا میرے نام کے اوپر نام رکھو ۔ مگر میری کنیت اختیار نہ کرو اور جس شخص نے مجھے خواب میں دیکھا تو بلاشبہ اس نے مجھے دیکھا ۔ کیونکہ شیطان میری صورت میں نہیں آ سکتا اور جو شخص مجھ پر جان بوجھ کر جھوٹ بولے وہ دوزخ میں اپنا ٹھکانہ تلاش کرے ۔",
                "urduNarrator": "ہم سے موسیٰ نے بیان کیا ، ان سے ابوعوانہ نے ابی حصین کے واسطہ سے نقل کیا ، وہ ابوصالح سے روایت کرتے ہیں ، وہ ابوہریرہ رضی اللہ عنہ سے",
                "hadithArabic": "حَدَّثَنَا مُوسَى، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ تَسَمَّوْا بِاسْمِي وَلاَ تَكْتَنُوا بِكُنْيَتِي، وَمَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي، فَإِنَّ الشَّيْطَانَ لاَ يَتَمَثَّلُ فِي صُورَتِي، وَمَنْ كَذَبَ عَلَىَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 111,
                "hadithNumber": "111",
                "englishNarrator": "Narrated Ash-Shu`bi:",
                "hadithEnglish": "Abu Juhaifa said, \"I asked `Ali, 'Have you got any book (which has been revealed to the Prophet (ﷺ) apart from the Qur'an)?' `Ali replied, 'No, except Allah's Book or the power of understanding which has been bestowed (by Allah) upon a Muslim or what is (written) in this sheet of paper (with me).' Abu Juhaifa said, \"I asked, 'What is (written) in this sheet of paper?' `Ali replied, it deals with The Diyya (compensation (blood money) paid by the killer to the relatives of the victim), the ransom for the releasing of the captives from the hands of the enemies, and the law that no Muslim should be killed in Qisas (equality in punishment) for the killing of (a disbeliever).",
                "hadithUrdu": "میں نے حضرت علی رضی اللہ عنہ سے پوچھا کہ کیا آپ کے پاس کوئی ( اور بھی ) کتاب ہے ؟ انھوں نے فرمایا کہ نہیں ، مگر اللہ کی کتاب قرآن ہے یا پھر فہم ہے جو وہ ایک مسلمان کو عطا کرتا ہے ۔ یا پھر جو کچھ اس صحیفے میں ہے ۔ میں نے پوچھا ، اس صحیفے میں کیا ہے ؟ انھوں نے فرمایا ، دیت اور قیدیوں کی رہائی کا بیان ہے اور یہ حکم کہ مسلمان ، کافر کے بدلے قتل نہ کیا جائے ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، انہیں وکیع نے سفیان سے خبر دی ، انھوں نے مطرف سے سنا ، انھوں نے شعبی رحمہ اللہ سے ، انھوں نے ابوحجیفہ سے ، وہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ أَخْبَرَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ مُطَرِّفٍ، عَنِ الشَّعْبِيِّ، عَنْ أَبِي جُحَيْفَةَ، قَالَ قُلْتُ لِعَلِيٍّ هَلْ عِنْدَكُمْ كِتَابٌ قَالَ لاَ، إِلاَّ كِتَابُ اللَّهِ، أَوْ فَهْمٌ أُعْطِيَهُ رَجُلٌ مُسْلِمٌ، أَوْ مَا فِي هَذِهِ الصَّحِيفَةِ‏.‏ قَالَ قُلْتُ فَمَا فِي هَذِهِ الصَّحِيفَةِ قَالَ الْعَقْلُ، وَفَكَاكُ الأَسِيرِ، وَلاَ يُقْتَلُ مُسْلِمٌ بِكَافِرٍ‏.‏",
                "headingArabic": "كِتَابَةِ الْعِلْمِ",
                "headingUrdu": "علم کی تحریر",
                "headingEnglish": "The writing of knowledge",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 112,
                "hadithNumber": "112",
                "englishNarrator": "Narrated Abu Huraira:",
                "hadithEnglish": "In the year of the Conquest of Mecca, the tribe of Khuza`a killed a man from the tribe of Bani Laith in revenge for a killed person, belonging to them. They informed the Prophet (ﷺ) about it. So he rode his Rahila (she-camel for riding) and addressed the people saying, \"Allah held back the killing from Mecca. (The sub-narrator is in doubt whether the Prophet (ﷺ) said \"elephant or killing,\" as the Arabic words standing for these words have great similarity in shape), but He (Allah) let His Apostle and the believers over power the infidels of Mecca. Beware! (Mecca is a sanctuary) Verily! Fighting in Mecca was not permitted for anyone before me nor will it be permitted for anyone after me. It (war) in it was made legal for me for few hours or so on that day. No doubt it is at this moment a sanctuary, it is not allowed to uproot its thorny shrubs or to uproot its trees or to pick up its Luqat (fallen things) except by a person who will look for its owner (announce it publicly). And if somebody is killed, then his closest relative has the right to choose one of the two-- the blood money (Diyya) or retaliation having the killer killed. In the meantime a man from Yemen came and said, \"O Allah's Messenger (ﷺ)! Get that written for me.\" The Prophet (ﷺ) ordered his companions to write that for him. Then a man from Quraish said, \"Except Al-Idhkhir (a type of grass that has good smell) O Allah's Messenger (ﷺ), as we use it in our houses and graves.\" The Prophet (ﷺ) said, \"Except Al-Idhkhir i.e. Al-Idhkhir is allowed to be plucked.\"",
                "hadithUrdu": "قبیلہ خزاعہ ( کے کسی شخص ) نے بنو لیث کے کسی آدمی کو اپنے کسی مقتول کے بدلے میں مار دیا تھا ، یہ فتح مکہ والے سال کی بات ہے ، رسول اللہ صلی اللہ علیہ وسلم کو یہ خبر دی گئی ، آپ نے اپنی اونٹنی پر سوار ہو کر خطبہ پڑھا اور فرمایا کہ اللہ نے مکہ سے قتل یا ہاتھی کو روک لیا ۔ امام بخاری رحمہ اللہ فرماتے ہیں اس لفظ کو شک کے ساتھ سمجھو ، ایسا ہی ابونعیم وغیرہ نے «القتل» اور «الفيل» کہا ہے ۔ ان کے علاوہ دوسرے لوگ «الفيل» کہتے ہیں ۔ ( پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ) کہ اللہ نے ان پر اپنے رسول اور مسلمان کو غالب کر دیا اور سمجھ لو کہ وہ ( مکہ ) کسی کے لیے حلال نہیں ہوا ۔ نہ مجھ سے پہلے اور نہ ( آئندہ ) کبھی ہو گا اور میرے لیے بھی صرف دن کے تھوڑے سے حصہ کے لیے حلال کر دیا گیا تھا ۔ سن لو کہ وہ اس وقت حرام ہے ۔ نہ اس کا کوئی کانٹا توڑا جائے ، نہ اس کے درخت کاٹے جائیں اور اس کی گری پڑی چیزیں بھی وہی اٹھائے جس کا منشاء یہ ہو کہ وہ اس چیز کا تعارف کرا دے گا ۔ تو اگر کوئی شخص مارا جائے تو ( اس کے عزیزوں کو ) اختیار ہے دو باتوں کا ، یا دیت لیں یا بدلہ ۔ اتنے میں ایک یمنی آدمی ( ابوشاہ نامی ) آیا اور کہنے لگا ( یہ مسائل ) میرے لیے لکھوا دیجیئے ۔ تب آپ صلی اللہ علیہ وسلم نے فرمایا کہ ابوفلاں کے لیے ( یہ مسائل ) لکھ دو ۔ تو ایک قریشی شخص نے کہا کہ یا رسول اللہ ! مگر اذخر ( یعنی اذخر کاٹنے کی اجازت دے دیجیئے ) کیونکہ اسے ہم گھروں کی چھتوں پر ڈالتے ہیں ۔ ( یا مٹی ملا کر ) اور اپنی قبروں میں بھی ڈالتے ہیں ( یہ سن کر ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ( ہاں ) مگر اذخر ، مگر اذخر ۔",
                "urduNarrator": "ہم سے ابونعیم الفضل بن دکین نے بیان کیا ، ان سے شیبان نے یحییٰ کے واسطے سے نقل کیا ، وہ ابوسلمہ سے ، وہ ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ الْفَضْلُ بْنُ دُكَيْنٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ خُزَاعَةَ، قَتَلُوا رَجُلاً مِنْ بَنِي لَيْثٍ عَامَ فَتْحِ مَكَّةَ بِقَتِيلٍ مِنْهُمْ قَتَلُوهُ، فَأُخْبِرَ بِذَلِكَ النَّبِيُّ صلى الله عليه وسلم فَرَكِبَ رَاحِلَتَهُ، فَخَطَبَ فَقَالَ ‏\"‏ إِنَّ اللَّهَ حَبَسَ عَنْ مَكَّةَ الْقَتْلَ ـ أَوِ الْفِيلَ شَكَّ أَبُو عَبْدِ اللَّهِ ـ وَسَلَّطَ عَلَيْهِمْ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالْمُؤْمِنِينَ، أَلاَ وَإِنَّهَا لَمْ تَحِلَّ لأَحَدٍ قَبْلِي، وَلاَ تَحِلُّ لأَحَدٍ بَعْدِي أَلاَ وَإِنَّهَا حَلَّتْ لِي سَاعَةً مِنْ نَهَارٍ، أَلاَ وَإِنَّهَا سَاعَتِي هَذِهِ حَرَامٌ، لاَ يُخْتَلَى شَوْكُهَا، وَلاَ يُعْضَدُ شَجَرُهَا، وَلاَ تُلْتَقَطُ سَاقِطَتُهَا إِلاَّ لِمُنْشِدٍ، فَمَنْ قُتِلَ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا أَنْ يُعْقَلَ، وَإِمَّا أَنْ يُقَادَ أَهْلُ الْقَتِيلِ ‏\"‏‏.‏ فَجَاءَ رَجُلٌ مِنْ أَهْلِ الْيَمَنِ فَقَالَ اكْتُبْ لِي يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ اكْتُبُوا لأَبِي فُلاَنٍ ‏\"‏‏.‏ فَقَالَ رَجُلٌ مِنْ قُرَيْشٍ إِلاَّ الإِذْخِرَ يَا رَسُولَ اللَّهِ، فَإِنَّا نَجْعَلُهُ فِي بُيُوتِنَا وَقُبُورِنَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِلاَّ الإِذْخِرَ، إِلاَّ الإِذْخِرَ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ يُقَالُ يُقَادُ بِالْقَافِ‏.‏ فَقِيلَ لأَبِي عَبْدِ اللَّهِ أَىُّ شَىْءٍ كَتَبَ لَهُ قَالَ كَتَبَ لَهُ هَذِهِ الْخُطْبَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 113,
                "hadithNumber": "113",
                "englishNarrator": "Narrated Abu Huraira:",
                "hadithEnglish": "There is none among the companions of the Prophet (ﷺ) who has narrated more Hadiths than I except `Abdullah bin `Amr (bin Al-`As) who used to write them and I never did the same.",
                "hadithUrdu": "میں نے حضرت ابوہریرہ رضی اللہ عنہ کو کہتے ہوئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم کے صحابہ میں عبداللہ بن عمرو رضی اللہ عنہما کے علاوہ مجھ سے زیادہ کوئی حدیث بیان کرنے والا نہیں تھا ۔ مگر وہ لکھ لیا کرتے تھے اور میں لکھتا نہیں تھا ۔ دوسری سند سے معمر نے وہب بن منبہ کی متابعت کی ، وہ ہمام سے روایت کرتے ہیں ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، ان سے سفیان نے ، ان سے عمرو نے ، وہ کہتے ہیں کہ مجھے وہب بن منبہ نے اپنے بھائی کے واسطے سے خبر دی ، وہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا عَمْرٌو، قَالَ أَخْبَرَنِي وَهْبُ بْنُ مُنَبِّهٍ، عَنْ أَخِيهِ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ مَا مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَحَدٌ أَكْثَرَ حَدِيثًا عَنْهُ مِنِّي، إِلاَّ مَا كَانَ مِنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو فَإِنَّهُ كَانَ يَكْتُبُ وَلاَ أَكْتُبُ‏.‏ تَابَعَهُ مَعْمَرٌ عَنْ هَمَّامٍ عَنْ أَبِي هُرَيْرَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 114,
                "hadithNumber": "114",
                "englishNarrator": "Narrated 'Ubaidullah bin `Abdullah:",
                "hadithEnglish": "Ibn `Abbas said, \"When the ailment of the Prophet (ﷺ) became worse, he said, 'Bring for me (writing) paper and I will write for you a statement after which you will not go astray.' But `Umar said, 'The Prophet is seriously ill, and we have got Allah's Book with us and that is sufficient for us.' But the companions of the Prophet (ﷺ) differed about this and there was a hue and cry. On that the Prophet (ﷺ) said to them, 'Go away (and leave me alone). It is not right that you should quarrel in front of me.\" Ibn `Abbas came out saying, \"It was most unfortunate (a great disaster) that Allah's Messenger (ﷺ) was prevented from writing that statement for them because of their disagreement and noise. (Note: It is apparent from this Hadith that Ibn `Abbas had witnessed the event and came out saying this statement. The truth is not so, for Ibn `Abbas used to say this statement on narrating the Hadith and he had not witnessed the event personally. See Fath Al-Bari Vol. 1, p.220 footnote.) (See Hadith No. 228, Vol. 4).",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم کے مرض میں شدت ہو گئی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ میرے پاس سامان کتابت لاؤ تاکہ تمہارے لیے ایک تحریر لکھ دوں ، تاکہ بعد میں تم گمراہ نہ ہو سکو ، اس پر حضرت عمر رضی اللہ عنہ نے ( لوگوں سے ) کہا کہ اس وقت آپ صلی اللہ علیہ وسلم پر تکلیف کا غلبہ ہے اور ہمارے پاس اللہ کی کتاب قرآن موجود ہے جو ہمیں ( ہدایت کے لیے ) کافی ہے ۔ اس پر لوگوں کی رائے مختلف ہو گئی اور شور و غل زیادہ ہونے لگا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا میرے پاس سے اٹھ کھڑے ہو ، میرے پاس جھگڑنا ٹھیک نہیں ، اس پر ابن عباس رضی اللہ عنہما یہ کہتے ہوئے نکل آئے کہ بیشک مصیبت بڑی سخت مصیبت ہے ( وہ چیز جو ) ہمارے اور رسول کریم صلی اللہ علیہ وسلم کے اور آپ کی تحریر کے درمیان حائل ہو گئی ۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، ان سے ابن وہب نے ، انہیں یونس نے ابن شہاب سے خبر دی ، وہ عبیداللہ بن عبداللہ سے ، وہ ابن عباس سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا اشْتَدَّ بِالنَّبِيِّ صلى الله عليه وسلم وَجَعُهُ قَالَ ‏\"‏ ائْتُونِي بِكِتَابٍ أَكْتُبُ لَكُمْ كِتَابًا لاَ تَضِلُّوا بَعْدَهُ ‏\"‏‏.‏ قَالَ عُمَرُ إِنَّ النَّبِيَّ صلى الله عليه وسلم غَلَبَهُ الْوَجَعُ وَعِنْدَنَا كِتَابُ اللَّهِ حَسْبُنَا فَاخْتَلَفُوا وَكَثُرَ اللَّغَطُ‏.‏ قَالَ ‏\"‏ قُومُوا عَنِّي، وَلاَ يَنْبَغِي عِنْدِي التَّنَازُعُ ‏\"‏‏.‏ فَخَرَجَ ابْنُ عَبَّاسٍ يَقُولُ إِنَّ الرَّزِيَّةَ كُلَّ الرَّزِيَّةِ مَا حَالَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ كِتَابِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 115,
                "hadithNumber": "115",
                "englishNarrator": "Narrated Um Salama:",
                "hadithEnglish": "One night Allah's Messenger (ﷺ) got up and said, \"Subhan Allah! How many afflictions have been descended tonight and how many treasures have been disclosed! Go and wake the sleeping lady occupants of these dwellings (his wives) up (for prayers). A well-dressed (soul) in this world may be naked in the Hereafter. \"",
                "hadithUrdu": "ایک رات نبی کریم صلی اللہ علیہ وسلم نے بیدار ہوتے ہی فرمایا کہ سبحان اللہ ! آج کی رات کس قدر فتنے اتارے گئے ہیں اور کتنے ہی خزانے بھی کھولے گئے ہیں ۔ ان حجرہ والیوں کو جگاؤ ۔ کیونکہ بہت سی عورتیں ( جو ) دنیا میں ( باریک ) کپڑا پہننے والی ہیں وہ آخرت میں ننگی ہوں گی ۔",
                "urduNarrator": "صدقہ نے ہم سے بیان کیا ، انہیں ابن عیینہ نے معمر کے واسطے سے خبر دی ، وہ زہری سے روایت کرتے ہیں ، زہری ہند سے ، وہ ام سلمہ رضی اللہ عنہا سے ، ( دوسری سند میں ) عمرو اور یحییٰ بن سعید زہری سے ، وہ ایک عورت سے ، وہ ام سلمہ رضی اللہ عنہا سے روایت کرتی ہیں کہ",
                "hadithArabic": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ هِنْدٍ، عَنْ أُمِّ سَلَمَةَ، وَعَمْرٍو، وَيَحْيَى بْنِ سَعِيدٍ، عَنِ الزُّهْرِيِّ، عَنْ هِنْدٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتِ اسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَقَالَ ‏ \"‏ سُبْحَانَ اللَّهِ مَاذَا أُنْزِلَ اللَّيْلَةَ مِنَ الْفِتَنِ وَمَاذَا فُتِحَ مِنَ الْخَزَائِنِ أَيْقِظُوا صَوَاحِبَاتِ الْحُجَرِ، فَرُبَّ كَاسِيَةٍ فِي الدُّنْيَا عَارِيَةٍ فِي الآخِرَةِ ‏\"‏‏.‏",
                "headingArabic": "الْعِلْمِ وَالْعِظَةِ بِاللَّيْلِ",
                "headingUrdu": "علم اور اس کی تعلیم اور رات کو تبلیغ",
                "headingEnglish": "The knowledge and its teaching and preaching at night",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 116,
                "hadithNumber": "116",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Once the Prophet (ﷺ) led us in the `Isha' prayer during the last days of his life and after finishing it (the prayer) (with Taslim) he said: \"Do you realize (the importance of) this night?\" Nobody present on the surface of the earth tonight will be living after the completion of one hundred years from this night.\"",
                "hadithUrdu": "آخر عمر میں ( ایک دفعہ ) رسول اللہ صلی اللہ علیہ وسلم نے ہمیں عشاء کی نماز پڑھائی ۔ جب آپ صلی اللہ علیہ وسلم نے سلام پھیرا تو کھڑے ہو گئے اور فرمایا کہ تمہاری آج کی رات وہ ہے کہ اس رات سے سو برس کے آخر تک کوئی شخص جو زمین پر ہے وہ باقی نہیں رہے گا ۔",
                "urduNarrator": "سعید بن عفیر نے ہم سے بیان کیا ، ان سے لیث نے بیان کیا ، ان سے عبدالرحمٰن بن خالد بن مسافر نے ابن شہاب کے واسطے سے بیان کیا ، انھوں نے سالم اور ابوبکر بن سلیمان بن ابی حثمہ سے روایت کیا کہ حضرت عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، وَأَبِي، بَكْرِ بْنِ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم الْعِشَاءَ فِي آخِرِ حَيَاتِهِ، فَلَمَّا سَلَّمَ قَامَ فَقَالَ ‏ \"‏ أَرَأَيْتَكُمْ لَيْلَتَكُمْ هَذِهِ، فَإِنَّ رَأْسَ مِائَةِ سَنَةٍ مِنْهَا لاَ يَبْقَى مِمَّنْ هُوَ عَلَى ظَهْرِ الأَرْضِ أَحَدٌ ‏\"‏‏.‏",
                "headingArabic": "السَّمَرِ بِالْعِلْمِ",
                "headingUrdu": "رات کے وقت (دینی) علم کے بارے میں بات کرنا",
                "headingEnglish": "To speak about (religious) knowledge at night",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 117,
                "hadithNumber": "117",
                "englishNarrator": "Narrated Ibn `Abbas:",
                "hadithEnglish": "I stayed overnight in the house of my aunt Maimuna bint Al-Harith (the wife of the Prophet (ﷺ) ) while the Prophet (ﷺ) was there with her during her night turn. The Prophet (ﷺ) offered the `Isha' prayer (in the mosque), returned home and after having prayed four rak`at, he slept. Later on he got up at night and then asked whether the boy (or he used a similar word) had slept? Then he got up for the prayer and I stood up by his left side but he made me stand to his right and offered five rak`at followed by two more rak`at. Then he slept and I heard him snoring and then (after a while) he left for the (Fajr) prayer.",
                "hadithUrdu": "ایک رات میں نے اپنی خالہ میمونہ بنت الحارث رضی اللہ عنہا زوجہ نبی کریم صلی اللہ علیہ وسلم کے پاس گزاری اور نبی کریم صلی اللہ علیہ وسلم ( اس دن ) ان کی رات میں ان ہی کے گھر تھے ۔ آپ صلی اللہ علیہ وسلم نے عشاء کی نماز مسجد میں پڑھی ۔ پھر گھر تشریف لائے اور چار رکعت ( نماز نفل ) پڑھ کر آپ صلی اللہ علیہ وسلم سو گئے ، پھر اٹھے اور فرمایا کہ ( ابھی تک یہ ) لڑکا سو رہا ہے یا اسی جیسا لفظ فرمایا ۔ پھر آپ ( نماز پڑھنے ) کھڑے ہو گئے اور میں ( بھی وضو کر کے ) آپ کی بائیں جانب کھڑا ہو گیا ۔ تو آپ صلی اللہ علیہ وسلم نے مجھے دائیں جانب ( کھڑا ) کر لیا ، تب آپ صلی اللہ علیہ وسلم نے پانچ رکعت پڑھیں ۔ پھر دو پڑھیں ، پھر آپ صلی اللہ علیہ وسلم سو گئے ۔ یہاں تک کہ میں نے آپ صلی اللہ علیہ وسلم کے خراٹے کی آواز سنی ، پھر آپ کھڑے ہو کر نماز کے لیے ( باہر ) تشریف لے آئے ۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا ، انھوں نے کہا کہ ہم کو شعبہ نے خبر دی ، ان کو حکم نے کہا کہ میں نے سعید بن جبیر سے سنا ، وہ حضرت عبداللہ بن عباس رضی اللہ عنہما سے نقل کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا الْحَكَمُ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ بِتُّ فِي بَيْتِ خَالَتِي مَيْمُونَةَ بِنْتِ الْحَارِثِ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَكَانَ النَّبِيُّ صلى الله عليه وسلم عِنْدَهَا فِي لَيْلَتِهَا، فَصَلَّى النَّبِيُّ صلى الله عليه وسلم الْعِشَاءَ، ثُمَّ جَاءَ إِلَى مَنْزِلِهِ، فَصَلَّى أَرْبَعَ رَكَعَاتٍ، ثُمَّ نَامَ، ثُمَّ قَامَ، ثُمَّ قَالَ ‏ \"‏ نَامَ الْغُلَيِّمُ ‏\"‏‏.‏ أَوْ كَلِمَةً تُشْبِهُهَا، ثُمَّ قَامَ فَقُمْتُ عَنْ يَسَارِهِ، فَجَعَلَنِي عَنْ يَمِينِهِ، فَصَلَّى خَمْسَ رَكَعَاتٍ ثُمَّ صَلَّى رَكْعَتَيْنِ، ثُمَّ نَامَ حَتَّى سَمِعْتُ غَطِيطَهُ ـ أَوْ خَطِيطَهُ ـ ثُمَّ خَرَجَ إِلَى الصَّلاَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 118,
                "hadithNumber": "118",
                "englishNarrator": "Narrated Abu Huraira:",
                "hadithEnglish": "People say that I have narrated many Hadiths (The Prophet's narration). Had it not been for two verses in the Qur'an, I would not have narrated a single Hadith, and the verses are: \"Verily those who conceal the clear sign and the guidance which We have sent down . . . (up to) Most Merciful.\" (2:159-160). And no doubt our Muhajir (emigrant) brothers used to be busy in the market with their business (bargains) and our Ansari brothers used to be busy with their property (agriculture). But I (Abu Huraira) used to stick to Allah's Messenger (ﷺ) contented with what will fill my stomach and I used to attend that which they used not to attend and I used to memorize that which they used not to memorize.",
                "hadithUrdu": "لوگ کہتے ہیں کہ ابوہریرہ رضی اللہ عنہ بہت حدیثیں بیان کرتے ہیں اور ( میں کہتا ہوں ) کہ قرآن میں دو آیتیں نہ ہوتیں تو میں کوئی حدیث بیان نہ کرتا ۔ پھر یہ آیت پڑھی ، ( جس کا ترجمہ یہ ہے ) کہ جو لوگ اللہ کی نازل کی ہوئی دلیلوں اور آیتوں کو چھپاتے ہیں ( آخر آیت ) «رحيم‏» تک ۔ ( واقعہ یہ ہے کہ ) ہمارے مہاجرین بھائی تو بازار کی خریدوفروخت میں لگے رہتے تھے اور انصار بھائی اپنی جائیدادوں میں مشغول رہتے اور ابوہریرہ ، رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جی بھر کر رہتا ( تاکہ آپ کی رفاقت میں شکم پری سے بھی بےفکری رہے ) اور ( ان مجلسوں میں ) حاضر رہتا جن ( مجلسوں ) میں دوسرے حاضر نہ ہوتے اور وہ ( باتیں ) محفوظ رکھتا جو دوسرے محفوظ نہیں رکھ سکتے تھے ۔",
                "urduNarrator": "عبدالعزیز بن عبداللہ نے ہم سے بیان کیا ، ان سے مالک نے ابن شہاب کے واسطے سے نقل کیا ، انھوں نے اعرج سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے ، وہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ إِنَّ النَّاسَ يَقُولُونَ أَكْثَرَ أَبُو هُرَيْرَةَ، وَلَوْلاَ آيَتَانِ فِي كِتَابِ اللَّهِ مَا حَدَّثْتُ حَدِيثًا، ثُمَّ يَتْلُو ‏{‏إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنْزَلْنَا مِنَ الْبَيِّنَاتِ‏}‏ إِلَى قَوْلِهِ ‏{‏الرَّحِيمُ‏}‏ إِنَّ إِخْوَانَنَا مِنَ الْمُهَاجِرِينَ كَانَ يَشْغَلُهُمُ الصَّفْقُ بِالأَسْوَاقِ، وِإِنَّ إِخْوَانَنَا مِنَ الأَنْصَارِ كَانَ يَشْغَلُهُمُ الْعَمَلُ فِي أَمْوَالِهِمْ، وَإِنَّ أَبَا هُرَيْرَةَ كَانَ يَلْزَمُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِشِبَعِ بَطْنِهِ وَيَحْضُرُ مَا لاَ يَحْضُرُونَ، وَيَحْفَظُ مَا لاَ يَحْفَظُونَ‏.‏",
                "headingArabic": "حِفْظِ الْعِلْمِ",
                "headingUrdu": "(جس کے بارے میں کہا جاتا ہے) (دینی) علم کا حفظ",
                "headingEnglish": "(What is said regarding) the memorization of (religious) knowledge",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 119,
                "hadithNumber": "119",
                "englishNarrator": "Narrated Abu Huraira:",
                "hadithEnglish": "I said to Allah's Messenger (ﷺ) \"I hear many narrations (Hadiths) from you but I forget them.\" Allah's Apostle said, \"Spread your Rida' (garment).\" I did accordingly and then he moved his hands as if filling them with something (and emptied them in my Rida') and then said, \"Take and wrap this sheet over your body.\" I did it and after that I never forgot any thing. Narrated Ibrahim bin Al-Mundhir: Ibn Abi Fudaik narrated the same as above (Hadith...119) but added that the Prophet (ﷺ) had moved his hands as if filling them with something and then he emptied them in the Rida' of Abu Huraira.",
                "hadithUrdu": "میں نے عرض کیا ، یا رسول اللہ ! میں آپ صلی اللہ علیہ وسلم سے بہت باتیں سنتا ہوں ، مگر بھول جاتا ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا اپنی چادر پھیلاؤ ، میں نے اپنی چادر پھیلائی ، آپ صلی اللہ علیہ وسلم نے اپنے دونوں ہاتھوں کی چلو بنائی اور ( میری چادر میں ڈال دی ) فرمایا کہ ( چادر کو ) لپیٹ لو ۔ میں نے چادر کو ( اپنے بدن پر ) لپیٹ لیا ، پھر ( اس کے بعد ) میں کوئی چیز نہیں بھولا ۔ ہم سے ابراہیم بن المنذر نے بیان کیا ، ان سے ابن ابی فدیک نے اسی طرح بیان کیا کہ ( یوں ) فرمایا کہ اپنے ہاتھ سے ایک چلو اس ( چادر ) میں ڈال دی ۔",
                "urduNarrator": "ہم سے ابومصعب احمد بن ابی بکر نے بیان کیا ، ان سے محمد بن ابراہیم بن دینار نے ابن ابی ذئب کے واسطے سے بیان کیا ، وہ سعید المقبری سے ، وہ ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي بَكْرٍ أَبُو مُصْعَبٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ دِينَارٍ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ، إِنِّي أَسْمَعُ مِنْكَ حَدِيثًا كَثِيرًا أَنْسَاهُ‏.‏ قَالَ ‏\"‏ ابْسُطْ رِدَاءَكَ ‏\"‏ فَبَسَطْتُهُ‏.‏ قَالَ فَغَرَفَ بِيَدَيْهِ ثُمَّ قَالَ ‏\"‏ ضُمُّهُ ‏\"‏ فَضَمَمْتُهُ فَمَا نَسِيتُ شَيْئًا بَعْدَهُ‏. حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ قَالَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ بِهَذَا أَوْ قَالَ غَرَفَ بِيَدِهِ فِيهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 120,
                "hadithNumber": "120",
                "englishNarrator": "Narrated Abu Huraira:",
                "hadithEnglish": "I have memorized two kinds of knowledge from Allah's Messenger (ﷺ) . I have propagated one of them to you and if I propagated the second, then my pharynx (throat) would be cut (i.e. killed).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے ( علم کے ) دو برتن یاد کر لیے ہیں ، ایک کو میں نے پھیلا دیا ہے اور دوسرا برتن اگر میں پھیلاؤں تو میرا یہ نرخرا کاٹ دیا جائے ۔ امام بخاری رحمہ اللہ نے فرمایا کہ «بلعوم» سے مراد وہ نرخرا ہے جس سے کھانا اترتا ہے ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، ان سے ان کے بھائی ( عبدالحمید ) نے ابن ابی ذئب سے نقل کیا ۔ وہ سعید المقبری سے روایت کرتے ہیں ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے ، وہ فرماتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي أَخِي، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ حَفِظْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وِعَاءَيْنِ، فَأَمَّا أَحَدُهُمَا فَبَثَثْتُهُ، وَأَمَّا الآخَرُ فَلَوْ بَثَثْتُهُ قُطِعَ هَذَا الْبُلْعُومُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 121,
                "hadithNumber": "121",
                "englishNarrator": "Narrated Jarir:",
                "hadithEnglish": "The Prophet (ﷺ) said to me during Hajjat-al-Wida`: Let the people keep quiet and listen. Then he said (addressing the people), \"Do not (become infidels) revert to disbelief after me by striking the necks (cutting the throats) of one another (killing each other).",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے ان سے حجۃ الوداع میں فرمایا کہ لوگوں کو بالکل خاموش کر دو ( تاکہ وہ خوب سن لیں ) پھر فرمایا ، لوگو ! میرے بعد پھر کافر مت بن جانا کہ ایک دوسرے کی گردن مارنے لگو ۔",
                "urduNarrator": "ہم سے حجاج نے بیان کیا ، انھوں نے کہا ہم سے شعبہ نے بیان کیا ، انھوں نے کہا مجھے علی بن مدرک نے ابوزرعہ سے خبر دی ، وہ جریر رضی اللہ عنہ سے نقل کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا حَجَّاجٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَلِيُّ بْنُ مُدْرِكٍ، عَنْ أَبِي زُرْعَةَ، عَنْ جَرِيرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهُ فِي حَجَّةِ الْوَدَاعِ ‏\"‏ اسْتَنْصِتِ النَّاسَ ‏\"‏ فَقَالَ ‏\"‏ لاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏",
                "headingArabic": "الإِنْصَاتِ لِلْعُلَمَاءِ",
                "headingUrdu": "خاموش رہنا (اور سننا) مذہبی عالموں کو",
                "headingEnglish": "To be quiet (and listen) to religious learned men",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 122,
                "hadithNumber": "122",
                "englishNarrator": "Narrated Sa`id bin Jubair:",
                "hadithEnglish": "I said to Ibn `Abbas, \"Nauf-Al-Bakali claims that Moses (the companion of Khadir) was not the Moses of Bani Israel but he was another Moses.\" Ibn `Abbas remarked that the enemy of Allah (Nauf) was a liar. Narrated Ubai bin Ka`b: The Prophet (ﷺ) said, \"Once the Prophet (ﷺ) Moses stood up and addressed Bani Israel. He was asked, \"Who is the most learned man amongst the people. He said, \"I am the most learned.\" Allah admonished Moses as he did not attribute absolute knowledge to Him (Allah). So Allah inspired to him \"At the junction of the two seas there is a slave amongst my slaves who is more learned than you.\" Moses said, \"O my Lord! How can I meet him?\" Allah said: Take a fish in a large basket (and proceed) and you will find him at the place where you will lose the fish. So Moses set out along with his (servant) boy, Yusha` bin Noon and carried a fish in a large basket till they reached a rock, where they laid their heads (i.e. lay down) and slept. The fish came out of the basket and it took its way into the sea as in a tunnel. So it was an amazing thing for both Moses and his (servant) boy. They proceeded for the rest of that night and the following day. When the day broke, Moses said to his (servant) boy: \"Bring us our early meal. No doubt, we have suffered much fatigue in this journey.\" Moses did not get tired till he passed the place about which he was told. There the (servant) boy told Moses, \"Do you remember when we betook ourselves to the rock, I indeed forgot the fish.\" Moses remarked, \"That is what we have been seeking. So they went back retracing their footsteps, till they reached the rock. There they saw a man covered with a garment (or covering himself with his own garment). Moses greeted him. Al-Khadir replied saying, \"How do people greet each other in your land?\" Moses said, \"I am Moses.\" He asked, \"The Moses of Bani Israel?\" Moses replied in the affirmative and added, \"May I follow you so that you teach me of that knowledge which you have been taught.\" Al-Khadir replied, \"Verily! You will not be able to remain patient with me, O Moses! I have some of the knowledge of Allah which He has taught me and which you do not know, while you have some knowledge which Allah has taught you which I do not know.\" Moses said, \"Allah willing, you will find me patient and I will disobey no order of yours. So both of them set out walking along the seashore, as they did not have a boat. In the meantime a boat passed by them and they requested the crew of the boat to take them on board. The crew recognized Al-Khadir and took them on board without fare. Then a sparrow came and stood on the edge of the boat and dipped its beak once or twice in the sea. Al-Khadir said: \"O Moses! My knowledge and your knowledge have not decreased Allah's knowledge except as much as this sparrow has decreased the water of the sea with its beak.\" Al- Khadir went to one of the planks of the boat and plucked it out. Moses said, \"These people gave us a free lift but you have broken their boat and scuttled it so as to drown its people.\" Al-Khadir replied, \"Didn't I tell you that you will not be able to remain patient with me.\" Moses said, \"Call me not to account for what I forgot.\" The first (excuse) of Moses was that he had forgotten. Then they proceeded further and found a boy playing with other boys. Al-Khadir took hold of the boy's head from the top and plucked it out with his hands (i.e. killed him). Moses said, \"Have you killed an innocent soul who has killed none.\" Al-Khadir replied, \"Did I not tell you that you cannot remain patient with me?\" Then they both proceeded till when they came to the people of a town, they asked them for food, but they refused to entertain them. Then they found there a wall on the point of collapsing. Al-Khadir repaired it with his own hands. Moses said, \"If you had wished, surely you could have taken wages for it.\" Al-Khadir replied, \"This is the parting between you and me.\" The Prophet added, \"May Allah be Merciful to Moses! Would that he could have been more patient to learn more about his story with Al-Khadir. \"",
                "hadithUrdu": "نوف بکالی کا یہ خیال ہے کہ موسیٰ علیہ السلام ( جو خضر علیہ السلام کے پاس گئے تھے وہ ) موسیٰ بنی اسرائیل والے نہیں تھے بلکہ دوسرے موسیٰ تھے ، ( یہ سن کر ) ابن عباس رضی اللہ عنہما بولے کہ اللہ کے دشمن نے جھوٹ کہا ہے ۔ ہم سے ابی ابن کعب رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے نقل کیا کہ ( ایک روز ) موسیٰ علیہ السلام نے کھڑے ہو کر بنی اسرائیل میں خطبہ دیا ، تو آپ سے پوچھا گیا کہ لوگوں میں سب سے زیادہ صاحب علم کون ہے ؟ انھوں نے فرمایا کہ میں ہوں ۔ اس وجہ سے اللہ کا غصہ ان پر ہوا کہ انھوں نے علم کو خدا کے حوالے کیوں نہ کر دیا ۔ تب اللہ نے ان کی طرف وحی بھیجی کہ میرے بندوں میں سے ایک بندہ دریاؤں کے سنگم پر ہے ۔ ( جہاں فارس اور روم کے سمندر ملتے ہیں ) وہ تجھ سے زیادہ عالم ہے ، موسیٰ علیہ السلام نے کہا اے پروردگار ! میری ان سے ملاقات کیسے ہو ؟ حکم ہوا کہ ایک مچھلی زنبیل میں رکھ لو ، پھر جہاں تم اس مچھلی کو گم کر دو گے تو وہ بندہ تمہیں ( وہیں ) ملے گا ۔ تب موسیٰ علیہ السلام چلے اور ساتھ اپنے خادم یوشع بن نون کو لے لیا اور انھوں نے زنبیل میں مچھلی رکھ لی ، جب ( ایک ) پتھر کے پاس پہنچے ، دونوں اپنے سر اس پر رکھ کر سو گئے اور مچھلی زنبیل سے نکل کر دریا میں اپنی راہ بناتی چلی گئی اور یہ بات موسیٰ علیہ السلام اور ان کے ساتھی کے لیے بےحد تعجب کی تھی ، پھر دونوں باقی رات اور دن میں ( جتنا وقت باقی تھا ) چلتے رہے ، جب صبح ہوئی موسیٰ علیہ السلام نے خادم سے کہا ، ہمارا ناشتہ لاؤ ، اس سفر میں ہم نے ( کافی ) تکلیف اٹھائی ہے اور موسیٰ علیہ السلام بالکل نہیں تھکے تھے ، مگر جب اس جگہ سے آگے نکل گئے ، جہاں تک انہیں جانے کا حکم ملا تھا ، تب ان کے خادم نے کہا ، کیا آپ نے دیکھا تھا کہ جب ہم صخرہ کے پاس ٹھہرے تھے تو میں مچھلی کا ذکر بھول گیا ، ( بقول بعض صخرہ کے نیچے آب حیات تھا ، وہ اس مچھلی پر پڑا ، اور وہ زندہ ہو کر بقدرت الٰہی دریا میں چل دی ) ( یہ سن کر ) موسیٰ علیہ السلام بولے کہ یہ ہی وہ جگہ ہے جس کی ہمیں تلاش تھی ، تو وہ پچھلے پاؤں واپس ہو گئے ، جب پتھر تک پہنچے تو دیکھا کہ ایک شخص کپڑا اوڑھے ہوئے ( موجود ہے ) موسیٰ علیہ السلام نے انہیں سلام کیا ، خضر علیہ السلام نے کہا کہ تمہاری سرزمین میں سلام کہاں ؟ پھر موسیٰ علیہ السلام نے کہا کہ میں موسیٰ ( علیہ السلام ) ہوں ، خضر بولے کہ بنی اسرائیل کے موسیٰ ؟ انھوں نے جواب دیا کہ ہاں ! پھر کہا کیا میں آپ کے ساتھ چل سکتا ہوں ، تاکہ آپ مجھے ہدایت کی وہ باتیں بتلائیں جو اللہ نے خاص آپ ہی کو سکھلائی ہیں ۔ خضر علیہ السلام بولے کہ تم میرے ساتھ صبر نہیں کر سکو گے ۔ اسے موسیٰ ! مجھے اللہ نے ایسا علم دیا ہے جسے تم نہیں جانتے اور تم کو جو علم دیا ہے اسے میں نہیں جانتا ۔ ( اس پر ) موسیٰ نے کہا کہ خدا نے چاہا تو آپ مجھے صابر پاؤ گے اور میں کسی بات میں آپ کی نافرمانی نہیں کروں گا ۔ پھر دونوں دریا کے کنارے کنارے پیدل چلے ، ان کے پاس کوئی کشتی نہ تھی کہ ایک کشتی ان کے سامنے سے گزری ، تو کشتی والوں سے انھوں نے کہا کہ ہمیں بٹھا لو ۔ خضر علیہ السلام کو انھوں نے پہچان لیا اور بغیر کرایہ کے سوار کر لیا ، اتنے میں ایک چڑیا آئی اور کشتی کے کنارے پر بیٹھ گئی ، پھر سمندر میں اس نے ایک یا دو چونچیں ماریں ( اسے دیکھ کر ) خضر علیہ السلام بولے کہ اے موسیٰ ! میرے اور تمہارے علم نے اللہ کے علم میں سے اتنا ہی کم کیا ہو گا جتنا اس چڑیا نے سمندر ( کے پانی ) سے پھر خضر علیہ السلام نے کشتی کے تختوں میں سے ایک تختہ نکال ڈالا ، موسیٰ علیہ السلام نے کہا کہ ان لوگوں نے تو ہمیں کرایہ لیے بغیر ( مفت میں ) سوار کیا اور آپ نے ان کی کشتی ( کی لکڑی ) اکھاڑ ڈالی تاکہ یہ ڈوب جائیں ، خضر علیہ السلام بولے کہ کیا میں نے نہیں کہا تھا کہ تم میرے ساتھ صبر نہیں کر سکو گے ؟ ( اس پر ) موسیٰ علیہ السلام نے جواب دیا کہ بھول پر میری گرفت نہ کرو ۔ موسیٰ علیہ السلام نے بھول کر یہ پہلا اعتراض کیا تھا ۔ پھر دونوں چلے ( کشتی سے اتر کر ) ایک لڑکا بچوں کے ساتھ کھیل رہا تھا ، خضر علیہ السلام نے اوپر سے اس کا سر پکڑ کر ہاتھ سے اسے الگ کر دیا ۔ موسیٰ علیہ السلام بول پڑے کہ آپ نے ایک بےگناہ بچے کو بغیر کسی جانی حق کے مار ڈالا ( غضب ہو گیا ) خضر علیہ السلام بولے کہ میں نے تم سے نہیں کہا تھا کہ تم میرے ساتھ صبر نہیں کر سکو گے ۔ ابن عیینہ کہتے ہیں کہ اس کلام میں پہلے سے زیادہ تاکید ہے ( کیونکہ پہلے کلام میں لفظ لک نہیں کہا تھا ، اس میں لک زائد کیا ، جس سے تاکید ظاہر ہے ) پھر دونوں چلتے رہے ۔ حتیٰ کہ ایک گاؤں والوں کے پاس آئے ، ان سے کھانا لینا چاہا ۔ انھوں نے کھانا کھلانے سے انکار کر دیا ۔ انھوں نے وہیں دیکھا کہ ایک دیوار اسی گاؤں میں گرنے کے قریب تھی ۔ خضر علیہ السلام نے اپنے ہاتھ کے اشارے سے اسے سیدھا کر دیا ۔ موسیٰ بول اٹھے کہ اگر آپ چاہتے تو ( گاؤں والوں سے ) اس کام کی مزدوری لے سکتے تھے ۔ خضر نے کہا کہ ( بس اب ) ہم اور تم میں جدائی کا وقت آ گیا ہے ۔ جناب محبوب کبریا رسول اللہ صلی اللہ علیہ وسلم فرماتے ہیں کہ اللہ موسیٰ پر رحم کرے ، ہماری تمنا تھی کہ موسیٰ کچھ دیر اور صبر کرتے تو مزید واقعات ان دونوں کے بیان کئے جاتے ( اور ہمارے سامنے روشنی میں آتے ، مگر حضرت موسیٰ علیہ السلام کی عجلت نے اس علم لدنی کے سلسلہ کو جلد ہی منقطع کرا دیا ) محمد بن یوسف کہتے ہیں کہ ہم سے علی بن خشرم نے یہ حدیث بیان کی ، ان سے سفیان بن عیینہ نے پوری کی پوری بیان کی ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد المسندی نے بیان کیا ، ان سے سفیان نے ، ان سے عمرو نے ، انہیں سعید بن جبیر رضی اللہ عنہ نے خبر دی ، وہ کہتے ہیں کہ میں نے ابن عباس رضی اللہ عنہما سے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا عَمْرٌو، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ إِنَّ نَوْفًا الْبِكَالِيَّ يَزْعُمُ أَنَّ مُوسَى لَيْسَ بِمُوسَى بَنِي إِسْرَائِيلَ، إِنَّمَا هُوَ مُوسَى آخَرُ‏.‏ فَقَالَ كَذَبَ عَدُوُّ اللَّهِ، حَدَّثَنَا أُبَىُّ بْنُ كَعْبٍ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ قَامَ مُوسَى النَّبِيُّ خَطِيبًا فِي بَنِي إِسْرَائِيلَ، فَسُئِلَ أَىُّ النَّاسِ أَعْلَمُ فَقَالَ أَنَا أَعْلَمُ‏.‏ فَعَتَبَ اللَّهُ عَلَيْهِ، إِذْ لَمْ يَرُدَّ الْعِلْمَ إِلَيْهِ، فَأَوْحَى اللَّهُ إِلَيْهِ أَنَّ عَبْدًا مِنْ عِبَادِي بِمَجْمَعِ الْبَحْرَيْنِ هُوَ أَعْلَمُ مِنْكَ‏.‏ قَالَ يَا رَبِّ وَكَيْفَ بِهِ فَقِيلَ لَهُ احْمِلْ حُوتًا فِي مِكْتَلٍ فَإِذَا فَقَدْتَهُ فَهْوَ ثَمَّ، فَانْطَلَقَ وَانْطَلَقَ بِفَتَاهُ يُوشَعَ بْنِ نُونٍ، وَحَمَلاَ حُوتًا فِي مِكْتَلٍ، حَتَّى كَانَا عِنْدَ الصَّخْرَةِ وَضَعَا رُءُوسَهُمَا وَنَامَا فَانْسَلَّ الْحُوتُ مِنَ الْمِكْتَلِ فَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ سَرَبًا، وَكَانَ لِمُوسَى وَفَتَاهُ عَجَبًا، فَانْطَلَقَا بَقِيَّةَ لَيْلَتِهِمَا وَيَوْمِهِمَا فَلَمَّا أَصْبَحَ قَالَ مُوسَى لِفَتَاهُ آتِنَا غَدَاءَنَا، لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَذَا نَصَبًا، وَلَمْ يَجِدْ مُوسَى مَسًّا مِنَ النَّصَبِ حَتَّى جَاوَزَ الْمَكَانَ الَّذِي أُمِرَ بِهِ‏.‏ فَقَالَ لَهُ فَتَاهُ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ، قَالَ مُوسَى ذَلِكَ مَا كُنَّا نَبْغِي، فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا، فَلَمَّا انْتَهَيَا إِلَى الصَّخْرَةِ إِذَا رَجُلٌ مُسَجًّى بِثَوْبٍ ـ أَوْ قَالَ تَسَجَّى بِثَوْبِهِ ـ فَسَلَّمَ مُوسَى‏.‏ فَقَالَ الْخَضِرُ وَأَنَّى بِأَرْضِكَ السَّلاَمُ فَقَالَ أَنَا مُوسَى‏.‏ فَقَالَ مُوسَى بَنِي إِسْرَائِيلَ قَالَ نَعَمْ‏.‏ قَالَ هَلْ أَتَّبِعُكَ عَلَى أَنْ تُعَلِّمَنِي مِمَّا عُلِّمْتَ رَشَدًا قَالَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا، يَا مُوسَى إِنِّي عَلَى عِلْمٍ مِنْ عِلْمِ اللَّهِ عَلَّمَنِيهِ لاَ تَعْلَمُهُ أَنْتَ، وَأَنْتَ عَلَى عِلْمٍ عَلَّمَكَهُ لاَ أَعْلَمُهُ‏.‏ قَالَ سَتَجِدُنِي إِنْ شَاءَ اللَّهُ صَابِرًا، وَلاَ أَعْصِي لَكَ أَمْرًا، فَانْطَلَقَا يَمْشِيَانِ عَلَى سَاحِلِ الْبَحْرِ لَيْسَ لَهُمَا سَفِينَةٌ، فَمَرَّتْ بِهِمَا سَفِينَةٌ، فَكَلَّمُوهُمْ أَنْ يَحْمِلُوهُمَا، فَعُرِفَ الْخَضِرُ، فَحَمَلُوهُمَا بِغَيْرِ نَوْلٍ، فَجَاءَ عُصْفُورٌ فَوَقَعَ عَلَى حَرْفِ السَّفِينَةِ، فَنَقَرَ نَقْرَةً أَوْ نَقْرَتَيْنِ فِي الْبَحْرِ‏.‏ فَقَالَ الْخَضِرُ يَا مُوسَى، مَا نَقَصَ عِلْمِي وَعِلْمُكَ مِنْ عِلْمِ اللَّهِ إِلاَّ كَنَقْرَةِ هَذَا الْعُصْفُورِ فِي الْبَحْرِ‏.‏ فَعَمَدَ الْخَضِرُ إِلَى لَوْحٍ مِنْ أَلْوَاحِ السَّفِينَةِ فَنَزَعَهُ‏.‏ فَقَالَ مُوسَى قَوْمٌ حَمَلُونَا بِغَيْرِ نَوْلٍ، عَمَدْتَ إِلَى سَفِينَتِهِمْ فَخَرَقْتَهَا لِتُغْرِقَ أَهْلَهَا قَالَ أَلَمْ أَقُلْ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا قَالَ لاَ تُؤَاخِذْنِي بِمَا نَسِيتُ‏.‏ فَكَانَتِ الأُولَى مِنْ مُوسَى نِسْيَانًا‏.‏ فَانْطَلَقَا فَإِذَا غُلاَمٌ يَلْعَبُ مَعَ الْغِلْمَانِ، فَأَخَذَ الْخَضِرُ بِرَأْسِهِ مِنْ أَعْلاَهُ فَاقْتَلَعَ رَأْسَهُ بِيَدِهِ‏.‏ فَقَالَ مُوسَى أَقَتَلْتَ نَفْسًا زَكِيَّةً بِغَيْرِ نَفْسٍ قَالَ أَلَمْ أَقُلْ لَكَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا ـ قَالَ ابْنُ عُيَيْنَةَ وَهَذَا أَوْكَدُ ـ فَانْطَلَقَا حَتَّى إِذَا أَتَيَا أَهْلَ قَرْيَةٍ اسْتَطْعَمَا أَهْلَهَا، فَأَبَوْا أَنْ يُضَيِّفُوهُمَا، فَوَجَدَا فِيهَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ فَأَقَامَهُ‏.‏ قَالَ الْخَضِرُ بِيَدِهِ فَأَقَامَهُ‏.‏ فَقَالَ لَهُ مُوسَى لَوْ شِئْتَ لاَتَّخَذْتَ عَلَيْهِ أَجْرًا‏.‏ قَالَ هَذَا فِرَاقُ بَيْنِي وَبَيْنِكَ ‏\"‏‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَرْحَمُ اللَّهُ مُوسَى، لَوَدِدْنَا لَوْ صَبَرَ حَتَّى يُقَصَّ عَلَيْنَا مِنْ أَمْرِهِمَا ‏\"‏‏.‏",
                "headingArabic": "مَا يُسْتَحَبُّ لِلْعَالِمِ إِذَا سُئِلَ أَىُّ النَّاسِ أَعْلَمُ فَيَكِلُ الْعِلْمَ إِلَى اللَّهِ",
                "headingUrdu": "جب کسی عالم دین سے پوچھا جاتا ہے کہ \"سب سے زیادہ علم والا کون ہے؟\" اس کے لیے بہتر ہے کہ وہ اللہ عزوجل کی طرف مکمل علم کو منسوب کرے یا سپرد کرے اور کہے۔ \"اللہ سب سے زیادہ جاننے والا ہے\"",
                "headingEnglish": "When a religious learned man is asked, \"Who is the most learned person.\" it is better for him to attribute or entrust absolute knowledge to Allah 'Azza wa Jall and to say. \"Allah is the Most Learned (than anybody else)\"",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 123,
                "hadithNumber": "123",
                "englishNarrator": "Narrated Abu Musa:",
                "hadithEnglish": "A man came to the Prophet (ﷺ) and asked, \"O Allah's Messenger (ﷺ)! What kind of fighting is in Allah's cause? (I ask this), for some of us fight because of being enraged and angry and some for the sake of his pride and haughtiness.\" The Prophet (ﷺ) raised his head (as the questioner was standing) and said, \"He who fights so that Allah's Word (Islam) should be superior, then he fights in Allah's cause.\"",
                "hadithUrdu": "ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت اقدس میں حاضر ہوا اور اس نے عرض کیا کہ یا رسول اللہ ! اللہ کی راہ میں لڑائی کی کیا صورت ہے ؟ کیونکہ ہم میں سے کوئی غصہ کی وجہ سے اور کوئی غیرت کی وجہ سے جنگ کرتا ہے تو آپ صلی اللہ علیہ وسلم نے اس کی طرف سر اٹھایا ، اور سر اسی لیے اٹھایا کہ پوچھنے والا کھڑا ہوا تھا ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا جو اللہ کے کلمے کو سربلند کرنے کے لیے لڑے ، وہ اللہ کی راہ میں ( لڑتا ) ہے ۔",
                "urduNarrator": "ہم سے عثمان نے بیان کیا ، کہا ہم سے جریر نے منصور کے واسطے سے بیان کیا ، وہ ابووائل سے روایت کرتے ہیں ، وہ حضرت ابوموسیٰ رضی اللہ عنہ سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ، قَالَ أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، مَا الْقِتَالُ فِي سَبِيلِ اللَّهِ فَإِنَّ أَحَدَنَا يُقَاتِلُ غَضَبًا، وَيُقَاتِلُ حَمِيَّةً‏.‏ فَرَفَعَ إِلَيْهِ رَأْسَهُ ـ قَالَ وَمَا رَفَعَ إِلَيْهِ رَأْسَهُ إِلاَّ أَنَّهُ كَانَ قَائِمًا ـ فَقَالَ ‏ \"‏ مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هِيَ الْعُلْيَا فَهُوَ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ ‏\"‏‏.‏",
                "headingArabic": "مَنْ سَأَلَ وَهْوَ قَائِمٌ عَالِمًا جَالِسًا",
                "headingUrdu": "جس نے کھڑے ہو کر کسی عالم دین سے پوچھا جو بیٹھا ہوا تھا (منبر پر یا اس سے ملتی جلتی کسی چیز کے بارے میں)",
                "headingEnglish": "Whosoever, while standing, asked a religious learned man who was sitting (on a pulpit or a similar thing, about something)",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 124,
                "hadithNumber": "124",
                "englishNarrator": "Narrated `Abdullah:",
                "hadithEnglish": "I saw the Prophet (ﷺ) near the Jamra and the people were asking him questions (about religious problems). A man asked, \"O Allah's Messenger (ﷺ)! I have slaughtered the Hadi (animal) before doing the Rami.\" The Prophet (ﷺ) replied, \"Do the Rami (now) and there is no harm.\" Another person asked, \"O Allah's Messenger (ﷺ)! I got my head shaved before slaughtering the animal.\" The Prophet (ﷺ) replied, \"Do the slaughtering (now) and there is no harm.\" So on that day, when the Prophet (ﷺ) was asked about anything as regards the ceremonies of Hajj performed before or after its due time his reply was, \"Do it (now) and there is no harm.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو رمی جمار کے وقت دیکھا آپ صلی اللہ علیہ وسلم سے پوچھا جا رہا تھا تو ایک شخص نے عرض کیا ، یا رسول اللہ ! میں نے رمی سے قبل قربانی کر لی ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ( اب ) رمی کر لو کچھ حرج نہیں ہوا ۔ دوسرے نے کہا ، یا رسول اللہ ! میں نے قربانی سے پہلے سر منڈا لیا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ( اب ) قربانی کر لو کچھ حرج نہیں ۔ ( اس وقت ) جس چیز کے بارے میں جو آگے پیچھے ہو گئی تھی ، آپ سے پوچھا گیا ، آپ صلی اللہ علیہ وسلم نے یہ ہی جواب دیا ( اب ) کر لو کچھ حرج نہیں ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، انھوں نے کہا کہ ہم سے عبدالعزیز بن ابی سلمہ نے زہری کے واسطے سے روایت کیا ، انھوں نے عیسیٰ بن طلحہ سے ، انھوں نے عبداللہ بن عمرو سے ، وہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، عَنِ الزُّهْرِيِّ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم عِنْدَ الْجَمْرَةِ وَهُوَ يُسْأَلُ، فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ نَحَرْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ ارْمِ وَلاَ حَرَجَ ‏\"‏‏.‏ قَالَ آخَرُ يَا رَسُولَ اللَّهِ حَلَقْتُ قَبْلَ أَنْ أَنْحَرَ‏.‏ قَالَ ‏\"‏ انْحَرْ وَلاَ حَرَجَ ‏\"‏‏.‏ فَمَا سُئِلَ عَنْ شَىْءٍ قُدِّمَ وَلاَ أُخِّرَ إِلاَّ قَالَ افْعَلْ وَلاَ حَرَجَ‏.‏",
                "headingArabic": "السُّؤَالِ وَالْفُتْيَا عِنْدَ رَمْىِ الْجِمَارِ",
                "headingUrdu": "جمر کی رمی کرتے ہوئے (حج کے دوران منیٰ میں) دینی معاملے کے بارے میں پوچھنا اور مذہبی فیصلہ دینا (حج کے دوران منیٰ میں جمر پر کنکریاں پھینکنا)",
                "headingEnglish": "To ask about a religious matter and to give a religious verdict (at Mina during Hajj) while doing the Rami of Jimar (throwing of pebbles at the Jimar in Mina during Hajj)",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 125,
                "hadithNumber": "125",
                "englishNarrator": "Narrated `Abdullah:",
                "hadithEnglish": "While I was going with the Prophet (ﷺ) through the ruins of Medina and he was reclining on a date-palm leaf stalk, some Jews passed by. Some of them said to the others: Ask him (the Prophet) about the spirit. Some of them said that they should not ask him that question as he might give a reply which would displease them. But some of them insisted on asking, and so one of them stood up and asked, \"O Abul-Qasim ! What is the spirit?\" The Prophet (ﷺ) remained quiet. I thought he was being inspired Divinely. So I stayed till that state of the Prophet (while being inspired) was over. The Prophet (ﷺ) then said, \"And they ask you (O Muhammad) concerning the spirit --Say: The spirit -- its knowledge is with my Lord. And of knowledge you (mankind) have been given only a little).\" (17.85)",
                "hadithUrdu": "( ایک مرتبہ ) میں رسول کریم صلی اللہ علیہ وسلم کے ساتھ مدینہ کے کھنڈرات میں چل رہا تھا اور آپ کھجور کی چھڑی پر سہارا دے کر چل رہے تھے ، تو کچھ یہودیوں کا ( ادھر سے ) گزر ہوا ، ان میں سے ایک نے دوسرے سے کہا کہ آپ سے روح کے بارے میں کچھ پوچھو ، ان میں سے کسی نے کہا مت پوچھو ، ایسا نہ ہو کہ وہ کوئی ایسی بات کہہ دیں جو تمہیں ناگوار ہو ( مگر ) ان میں سے بعض نے کہا کہ ہم ضرور پوچھیں گے ، پھر ایک شخص نے کھڑے ہو کر کہا ، اے ابوالقاسم ! روح کیا چیز ہے ؟ آپ صلی اللہ علیہ وسلم نے خاموشی اختیار فرمائی ، میں نے ( دل میں ) کہا کہ آپ پر وحی آ رہی ہے ۔ اس لیے میں کھڑا ہو گیا ۔ جب آپ صلی اللہ علیہ وسلم سے ( وہ کیفیت ) دور ہو گئی تو آپ صلی اللہ علیہ وسلم نے ( قرآن کی یہ آیت جو اس وقت نازل ہوئی تھی ) تلاوت فرمائی ’’ ( اے نبی ! ) تم سے یہ لوگ روح کے بارے میں پوچھ رہے ہیں ۔ کہہ دو کہ روح میرے رب کے حکم سے ہے ۔ اور تمہیں علم کا بہت تھوڑا حصہ دیا گیا ہے ۔ ‘‘ ( اس لیے تم روح کی حقیقت نہیں سمجھ سکتے ) اعمش کہتے ہیں کہ ہماری قرآت میں «وما اوتوا» ہے ۔ ( « وما اوتيتم » ) نہیں ۔",
                "urduNarrator": "ہم سے قیس بن حفص نے بیان کیا ، ان سے عبدالواحد نے ، ان سے اعمش سلیمان بن مہران نے ابراہیم کے واسطے سے بیان کیا ، انھوں نے علقمہ سے نقل کیا ، انھوں نے عبداللہ بن مسعود سے روایت کیا ، وہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا الأَعْمَشُ، سُلَيْمَانُ عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ بَيْنَا أَنَا أَمْشِي، مَعَ النَّبِيِّ صلى الله عليه وسلم فِي خَرِبِ الْمَدِينَةِ، وَهُوَ يَتَوَكَّأُ عَلَى عَسِيبٍ مَعَهُ، فَمَرَّ بِنَفَرٍ مِنَ الْيَهُودِ، فَقَالَ بَعْضُهُمْ لِبَعْضٍ سَلُوهُ عَنِ الرُّوحِ‏.‏ وَقَالَ بَعْضُهُمْ لاَ تَسْأَلُوهُ لاَ يَجِيءُ فِيهِ بِشَىْءٍ تَكْرَهُونَهُ‏.‏ فَقَالَ بَعْضُهُمْ لَنَسْأَلَنَّهُ‏.‏ فَقَامَ رَجُلٌ مِنْهُمْ فَقَالَ يَا أَبَا الْقَاسِمِ، مَا الرُّوحُ فَسَكَتَ‏.‏ فَقُلْتُ إِنَّهُ يُوحَى إِلَيْهِ‏.‏ فَقُمْتُ، فَلَمَّا انْجَلَى عَنْهُ، قَالَ ‏{‏وَيَسْأَلُونَكَ عَنِ الرُّوحِ قُلِ الرُّوحُ مِنْ أَمْرِ رَبِّي وَمَا أُوتُيتُمْ مِنَ الْعِلْمِ إِلاَّ قَلِيلاً‏}‏‏.‏ قَالَ الأَعْمَشُ هَكَذَا فِي قِرَاءَتِنَا‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَمَا أُوتِيتُمْ مِنَ الْعِلْمِ إِلاَّ قَلِيلاً}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور تم لوگوں کو بہت کم علم دیا گیا ہے‘‘۔",
                "headingEnglish": "The Statement of Allah Ta'ala: \"And of knowledge you (mankind) have been given only a little\"",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 101,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=4",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=3",
                "label": "3",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=4",
                "label": "4",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=5",
                "label": "5",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=6",
                "label": "6",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=7",
                "label": "7",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=8",
                "label": "8",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=9",
                "label": "9",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=10",
                "label": "10",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=6",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=6",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=4",
        "to": 125,
        "total": 40465
    }
}