{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 98,
        "data": [
            {
                "id": 2428,
                "hadithNumber": "2539, 2540",
                "englishNarrator": "Narrated Marwan and Al-Miswar bin Makhrama:",
                "hadithEnglish": "When the delegates of the tribe of Hawazin came to the Prophet (ﷺ) and they requested him to return their properties and captives. The Prophet (ﷺ) stood up and said to them, \"I have other people with me in this matter (as you see) and the most beloved statement to me is the true one; you may choose either the properties or the prisoners as I have delayed their distribution.\" The Prophet (ﷺ) had waited for them for more than ten days since his arrival from Ta'if. So, when it became evident to them that the Prophet (ﷺ) was not going to return them except one of the two, they said, \"We choose our prisoners.\" The Prophet got up amongst the people and glorified and praised Allah as He deserved and said, \"Then after, these brethren of yours have come to us with repentance, and I see it logical to return them the captives. So, whoever amongst you likes to do that as a favor, then he can do it, and whoever of you likes to stick to his share till we recompense him from the very first war booty which Allah will give us, then he can do so (i.e. give up the present captives).\" The people unanimously said, \"We do that (return the captives) willingly.\" The Prophet (ﷺ) said, \"We do not know which of you has agreed to it and which have not, so go back and let your leaders forward us your decision.\" So, all the people then went back and discussed the matter with their leaders who returned and informed the Prophet (ﷺ) that all the people had willingly given their consent to return the captives. This is what has reached us about the captives of Hawazin. Narrated Anas رضی اللہ عنہ that `Abbas رضی اللہ عنہ said to the Prophet, \"I paid for my ransom and `Aqil's ransom.\"",
                "hadithUrdu": "جب ہوازن قبیلہ کی بھیجے ہوئے لوگ ( مسلمان ہو کر ) آنحضرت صلی اللہ علیہ وسلم کے پاس آئے ۔ آپ صلی اللہ علیہ وسلم نے کھڑے ہو کر ان سے ملاقات فرمائی ، پھر ان لوگوں نے آپ صلی اللہ علیہ وسلم کے سامنے درخواست کی کہ ان کے اموال اور قیدی واپس کر دیے جائیں ۔ آپ صلی اللہ علیہ وسلم کھڑے ہوئے ( خطبہ سنایا ) آپ صلی اللہ علیہ وسلم نے فرمایا تم دیکھتے ہو میرے ساتھ جو لوگ ہیں ( میں اکیلا ہوتا تو تم کو واپس کر دیتا ) اور بات وہی مجھے پسند ہے جو سچ ہو ۔ اس لیے دو چیزوں میں سے ایک ہی تمہیں اختیار کرنی ہو گی ، یا اپنا مال واپس لے لو ، یا اپنے قیدیوں کو چھڑا لو ، اسی لیے میں نے ان کی تقسیم میں بھی دیر کی تھی ۔ نبی کریم صلی اللہ علیہ وسلم نے طائف سے لوٹتے ہوئے ( جعرانہ میں ) ہوازن والوں کا وہاں پر کئی راتوں تک انتظار کیا تھا ۔ جب ان لوگوں پر یہ بات پوری طرح ظاہر ہو گئی کہ نبی کریم صلی اللہ علیہ وسلم دوچیزوں ( مال اور قیدی ) میں سے صرف ایک ہی کو واپس فرما سکتے ہیں ۔ تو انہوں نے کہا کہ ہمیں ہمارے آدمی ہی واپس کر دیجئیے جو آپ کی قید میں ہیں ۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے لوگوں سے خطاب فرمایا ، اللہ کی تعریف اس کی شان کے مطابق کرنے کے بعد فرمایا ، امابعد ! یہ تمہارے بھائی ہمارے پاس نادم ہو کر آئے ہیں اور میرا بھی خیال یہ ہے کہ ان کے آدمی جو ہماری قید میں ہیں ، انہیں واپس کر دیے جائیں ۔ اب جو شخص اپنی خوشی سے ان کے آدمیوں کو واپس کرے وہ ایسا کر لے اور جو شخص اپنے حصے کو چھوڑنا نہ چاہے ( اور اس شرط پر اپنے قیدیوں کو آزاد کرنے کے لیے تیار ہو کہ ان قیدیوں کے بدلے میں ) ہم اسے اس کے بعد سب سے پہلی مال غنیمت میں سے جو اللہ تعالیٰ ہمیں دے گا اس کے ( اس ) حصے کا بدلہ اس کے حوالہ کر دیں گے تو وہ ایسا کر لے ۔ لوگ اس پر بول پڑے کہ ہم اپنی خوشی سے قیدی کو واپس کرنے کے لیے تیار ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا ، لیکن ہم پر یہ ظاہر نہ ہو سکا کہ کس نے ہمیں اجازت دی ہے اور کس نے نہیں دی ہے ۔ اس لیے سب لوگ ( اپنے خیموں میں ) واپس جائیں اور سب کے ذمہ دار آ کر ان کی رائے سے ہمیں آگاہ کریں ۔ چنانچہ سب لوگ چلے آئے اور ان کے سرداروں نے ( ان سے گفتگو کی ) پھر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر آپ کو خبر دی کہ سب نے اپنی خوشی سے اجازت دے دی ہے ۔ یہی وہ خبر ہے جو ہمیں ہوازن کے قیدیوں کے سلسلے میں معلوم ہوئی ہے ۔ ( زہری نے کہا ) اور انس رضی اللہ عنہ نے بیان کیا کہ عباس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے ( جب بحرین سے مال آیا ) کہا تھا کہ ( بدر کے موقع پر ) میں نے اپنا بھی فد یہ دیا تھا اور عقیل رضی اللہ عنہ کا بھی ۔",
                "urduNarrator": "ہم سے ابن ابی مریم نے بیان کیا ، کہا کہ مجھے لیث نے خبر دی ، انہیں عقیل نے ، انہیں ابن شہاب نے کہ عروہ نے ذکر کیا کہ مروان اور مسور بن مخرمہ نے انہیں خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، قَالَ أَخْبَرَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، ذَكَرَ عُرْوَةُ أَنَّ مَرْوَانَ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَاهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَامَ حِينَ جَاءَهُ وَفْدُ هَوَازِنَ، فَسَأَلُوهُ أَنْ يَرُدَّ إِلَيْهِمْ أَمْوَالَهُمْ وَسَبْيَهُمْ فَقَالَ ‏\"‏ إِنَّ مَعِي مَنْ تَرَوْنَ، وَأَحَبُّ الْحَدِيثِ إِلَىَّ أَصْدَقُهُ، فَاخْتَارُوا إِحْدَى الطَّائِفَتَيْنِ إِمَّا الْمَالَ، وَإِمَّا السَّبْىَ، وَقَدْ كُنْتُ اسْتَأْنَيْتُ بِهِمْ ‏\"‏‏.‏ وَكَانَ النَّبِيُّ صلى الله عليه وسلم انْتَظَرَهُمْ بِضْعَ عَشْرَةَ لَيْلَةً حِينَ قَفَلَ مِنَ الطَّائِفِ، فَلَمَّا تَبَيَّنَ لَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم غَيْرُ رَادٍّ إِلَيْهِمْ إِلاَّ إِحْدَى الطَّائِفَتَيْنِ قَالُوا فَإِنَّا نَخْتَارُ سَبْيَنَا‏.‏ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فِي النَّاسِ، فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ، ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ فَإِنَّ إِخْوَانَكُمْ جَاءُونَا تَائِبِينَ، وَإِنِّي رَأَيْتُ أَنْ أَرُدَّ إِلَيْهِمْ سَبْيَهُمْ، فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يُطَيِّبَ ذَلِكَ فَلْيَفْعَلْ، وَمَنْ أَحَبَّ أَنْ يَكُونَ عَلَى حَظِّهِ حَتَّى نُعْطِيَهُ إِيَّاهُ مِنْ أَوَّلِ مَا يُفِيءُ اللَّهُ عَلَيْنَا فَلْيَفْعَلْ ‏\"‏‏.‏ فَقَالَ النَّاسُ طَيَّبْنَا ذَلِكَ‏.‏ قَالَ ‏\"‏ إِنَّا لاَ نَدْرِي مَنْ أَذِنَ مِنْكُمْ مِمَّنْ لَمْ يَأْذَنْ فَارْجِعُوا حَتَّى يَرْفَعَ إِلَيْنَا عُرَفَاؤُكُمْ أَمْرَكُمْ ‏\"‏‏.‏ فَرَجَعَ النَّاسُ، فَكَلَّمَهُمْ عُرَفَاؤُهُمْ، ثُمَّ رَجَعُوا إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرُوهُ أَنَّهُمْ طَيَّبُوا وَأَذِنُوا، فَهَذَا الَّذِي بَلَغَنَا عَنْ سَبْىِ هَوَازِنَ‏.‏ وَقَالَ أَنَسٌ قَالَ عَبَّاسٌ لِلنَّبِيِّ صلى الله عليه وسلم فَادَيْتُ نَفْسِي، وَفَادَيْتُ عَقِيلاً‏.‏",
                "headingArabic": "مَنْ مَلَكَ مِنَ الْعَرَبِ رَقِيقًا فَوَهَبَ وَبَاعَ وَجَامَعَ وَفَدَى وَسَبَى الذُّرِّيَّةَ",
                "headingUrdu": "جس کے پاس عرب غلام تھے۔",
                "headingEnglish": "Whoever possessed Arab slaves",
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2429,
                "hadithNumber": "2541",
                "englishNarrator": "Narrated Nafi'o wrote for Ibn-e-`Aun:",
                "hadithEnglish": "The Prophet (ﷺ) had suddenly attacked Bani Mustaliq without warning while they were heedless and their cattle were being watered at the places of water. Their fighting men were killed and their women and children were taken as captives; the Prophet (ﷺ) got Juwairiya on that day. Nafi` said that Ibn `Umar رضی اللہ عنہما had told him the above narration and that Ibn `Umar          رضی اللہ عنہما was in that army.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے بنو المصطلق پر جب حملہ کیا تو وہ بالکل غافل تھے اور ان کے مویشی پانی پی رہے تھے ۔ ان کے لڑنے والوں کو قتل کیا گیا ، عورتوں بچوں کو قید کر لیا گیا ۔ انہیں قیدیوں میں جویر یہ رضی اللہ عنہا ( ام المؤمنین ) بھی تھیں ۔ ( نافع رحمہ اللہ نے لکھا تھا کہ ) یہ حدیث مجھ سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کی تھی ، وہ خود بھی اسلامی فوج کے ہمراہ تھے ۔",
                "urduNarrator": "ہم سے علی بن حسن نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو ابن عون نے خبر دی ، انہوں نے بیان کیا کہ میں نے نافع رحمہ اللہ کو لکھا تو انہوں نے مجھے جواب دیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا ابْنُ عَوْنٍ، قَالَ كَتَبْتُ إِلَى نَافِعٍ فَكَتَبَ إِلَىَّ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَغَارَ عَلَى بَنِي الْمُصْطَلِقِ وَهُمْ غَارُّونَ وَأَنْعَامُهُمْ تُسْقَى عَلَى الْمَاءِ، فَقَتَلَ مُقَاتِلَتَهُمْ، وَسَبَى ذَرَارِيَّهُمْ، وَأَصَابَ يَوْمَئِذٍ جُوَيْرِيَةَ‏.‏ حَدَّثَنِي بِهِ عَبْدُ اللَّهِ بْنُ عُمَرَ، وَكَانَ فِي ذَلِكَ الْجَيْشِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2430,
                "hadithNumber": "2542",
                "englishNarrator": "Narrated Ibn Muhairiz:",
                "hadithEnglish": "I saw Abu Sa`id رضی اللہ عنہ and asked him about coitus interruptus. Abu Sa`id said, \"We went with Allah's Apostle, in the Ghazwa of Bani Al-Mustaliq and we captured some of the 'Arabs as captives, and the long separation from our wives was pressing us hard and we wanted to practice coitus interruptus. We asked Allah's Messenger (ﷺ) (whether it was permissible). He said, \"It is better for you not to do so. No soul, (that which Allah has) destined to exist, up to the Day of Resurrection, but will definitely come, into existence.\"",
                "hadithUrdu": "میں نے ابوسعید رضی اللہ عنہ کو دیکھا تو ان سے ایک سوال کیا ، آپ نے جواب میں کہا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ غزوہ بنی مصطلق کے لیے نکلے ۔ اس غزوے میں ہمیں ( قبیلہ بنی مصطلق کے ) عرب قیدی ہاتھ آئے ( راستے ہی میں ) ہمیں عورتوں کی خواہش ہوئی اور عورت سے الگ رہنا ہم کو مشکل ہو گیا ۔ ہم نے چاہا کہ عزل کر لیں ۔ جب رسول اللہ صلی اللہ علیہ وسلم سے اس بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا ، تم عزل کر سکتے ہو ، اس میں کوئی قباحت نہیں لیکن جن روحوں کی بھی قیامت تک کے لیے پیدائش مقدر ہو چکی ہے وہ تو ضرور پیدا ہو کر رہیں گی ( لہٰذا تمہارا عزل کرنا بیکار ہے )",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ربیعہ بن ابی عبدالرحمٰن نے ، انہیں محمد بن یحییٰ بن حبان نے ، ان سے ابن محیریز نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ ابْنِ مُحَيْرِيزٍ، قَالَ رَأَيْتُ أَبَا سَعِيدٍ ـ رضى الله عنه ـ فَسَأَلْتُهُ فَقَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ بَنِي الْمُصْطَلِقِ فَأَصَبْنَا سَبْيًا مِنْ سَبْىِ الْعَرَبِ، فَاشْتَهَيْنَا النِّسَاءَ فَاشْتَدَّتْ عَلَيْنَا الْعُزْبَةُ وَأَحْبَبْنَا الْعَزْلَ، فَسَأَلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ مَا عَلَيْكُمْ أَنْ لاَ تَفْعَلُوا، مَا مِنْ نَسَمَةٍ كَائِنَةٍ إِلَى يَوْمِ الْقِيَامَةِ إِلاَّ وَهْىَ كَائِنَةٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2431,
                "hadithNumber": "2543",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I have loved the people of the tribe of Bani Tamim ever since I heard, three things, Allah's Messenger (ﷺ) said about them. I heard him saying, These people (of the tribe of Bani Tamim) would stand firm against Ad-Dajjal.\" When the Sadaqat (gifts of charity) from that tribe came, Allah's Messenger (ﷺ) said, \"These are the Sadaqat (i.e. charitable gifts) of our folk.\" `Aisha had a slave-girl from that tribe, and the Prophet (ﷺ) said to `Aisha رضی اللہ عنہا , \"Manumit her as she is a descendant of Ishmael (the Prophet)",
                "hadithUrdu": "میں بنوتمیم سے ہمیشہ محبت کرتا رہا ہوں ( دوسری سند امام بخاری رحمہ اللہ نے کہا ) مجھ سے ابن سلام نے بیان کیا ، کہا ہم کو جریر بن عبدالحمید نے خبر دی ، انہیں مغیرہ نے ، انہیں حارث نے ، انہیں ابوزرعہ نے اور انہیں ابوہریرہ رضی اللہ عنہ نے ، ( تیسری سند ) اور مغیرہ نے عمارہ سے روایت کی ، انہوں نے ابوزرعہ سے کہ ابوہریرہ رضی اللہ عنہ نے فرمایا ، تین باتوں کی وجہ سے جنہیں میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ۔ میں بنو تمیم سے ہمیشہ محبت کرتا ہوں ۔ رسول کریم صلی اللہ علیہ وسلم نے ان کے بارے میں فرمایا کہ یہ لوگ دجال کے مقابلے میں میری امت میں سب سے زیادہ سخت مخالف ثابت ہوں گے ۔ انہوں نے بیان کیا کہ ( ایک مرتبہ ) بنوتمیم کے یہاں سے زکوٰۃ ( وصول ہو کر آئی ) تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا یہ ہماری قوم کی زکوٰۃ ہے ۔ بنوتمیم کی ایک عورت قید ہو کر حضرت عائشہ رضی اللہ عنہا کے پاس تھی تو آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اسے آزاد کر دے کہ یہ حضرت اسماعیل علیہ السلام کی اولاد میں سے ہے ۔",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا ، کہا کہ ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے عمارہ بن قعقاع ، ان سے ابوزرعہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ لاَ أَزَالُ أُحِبُّ بَنِي تَمِيمٍ‏.‏ وَحَدَّثَنِي ابْنُ سَلاَمٍ أَخْبَرَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ عَنِ الْمُغِيرَةِ عَنِ الْحَارِثِ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ‏.‏ وَعَنْ عُمَارَةَ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ مَا زِلْتُ أُحِبُّ بَنِي تَمِيمٍ مُنْذُ ثَلاَثٍ سَمِعْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ فِيهِمْ، سَمِعْتُهُ يَقُولُ ‏\"‏ هُمْ أَشَدُّ أُمَّتِي عَلَى الدَّجَّالِ ‏\"‏‏.‏ قَالَ وَجَاءَتْ صَدَقَاتُهُمْ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذِهِ صَدَقَاتُ قَوْمِنَا ‏\"‏‏.‏ وَكَانَتْ سَبِيَّةٌ مِنْهُمْ عِنْدَ عَائِشَةَ‏.‏ فَقَالَ ‏\"‏ أَعْتِقِيهَا فَإِنَّهَا مِنْ وَلَدِ إِسْمَاعِيلَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2432,
                "hadithNumber": "2544",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"He who has a slave-girl and educates and treats her nicely and then manumits and marries her, will get a double reward.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جس شخص کے پاس کوئی لونڈی ہو اور وہ اس کی اچھی پرورش کرے اور اس کے ساتھ اچھا معاملہ کرے ، پھر اسے آزاد کر کے اس سے نکاح کر لے تو اس کو دوہرا ثواب ملے گا ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، انہوں نے محمد بن فضیل سے سنا ، انہوں نے مطرف سے ، انہوں نے شعبی سے ، انہوں نے ابوبردہ سے ، انہوں نے حضرت ابوموسیٰ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، سَمِعَ مُحَمَّدَ بْنَ فُضَيْلٍ، عَنْ مُطَرِّفٍ، عَنِ الشَّعْبِيِّ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ كَانَتْ لَهُ جَارِيَةٌ فَعَالَهَا، فَأَحْسَنَ إِلَيْهَا ثُمَّ أَعْتَقَهَا وَتَزَوَّجَهَا، كَانَ لَهُ أَجْرَانِ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ مَنْ أَدَّبَ جَارِيَتَهُ وَعَلَّمَهَا",
                "headingUrdu": "اس کی فضیلت جو اپنی لونڈی کو اچھے اخلاق سکھائے",
                "headingEnglish": "The superiority of him who teaches his slave-girl good manners",
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2433,
                "hadithNumber": "2545",
                "englishNarrator": "Narrated Al-Ma'rur bin Suwaid:",
                "hadithEnglish": "I saw Abu Dhar Al-Ghifari رضی اللہ عنہ wearing a cloak, and his slave, too, was wearing a cloak. We asked him about that (i.e. how both were wearing similar cloaks). He replied, \"Once I abused a man and he complained of me to the Prophet (ﷺ) . The Prophet (ﷺ) asked me, 'Did you abuse him by slighting his mother?' He added, 'Your slaves are your brethren upon whom Allah has given you authority. So, if one has one's brethren under one's control, one should feed them with the like of what one eats and clothe them with the like of what one wears. You should not overburden them with what they cannot bear, and if you do so, help them (in their hard job).",
                "hadithUrdu": "میں نے ابوذر غفاری رضی اللہ عنہ کو دیکھا کہ ان کے بدن پر بھی ایک جوڑا تھا اور ان کے غلام کے بدن پر بھی اسی قسم کا ایک جوڑا تھا ۔ ہم نے اس کا سبب پوچھا تو انہوں نے بتلایا کہ ایک دفعہ میری ایک صاحب ( یعنی بلال رضی اللہ عنہ سے ) سے کچھ گالی گلوچ ہو گئی تھی ۔ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے میری شکایت کی ، آپ صلی اللہ علیہ وسلم نے مجھ سے پوچھا کہ کیا تم نے انہیں ان کی ماں کی طرف سے عار دلائی ہے ؟ پھر آپ صلی اللہ علیہ وسلم نے فرمایا ، تمہارے غلام بھی تمہارے بھائی ہیں اگرچہ اللہ تعالیٰ نے انہیں تمہاری ماتحتی میں دے رکھا ہے ۔ اس لیے جس کا بھی کوئی بھائی اس کے قبضہ میں ہو اسے وہی کھلائے جو وہ خود کھاتا ہے اور وہی پہنائے جو وہ خود پہنتا ہے اور ان پر ان کی طاقت سے زیادہ بوجھ نہ ڈالے ۔ لیکن اگر ان کی طاقت سے زیادہ بوجھ ڈالو تو پھر ان کی خود مدد بھی کر دیا کرو ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ہم سے واصل بن حیان نے جو کبڑے تھے ، بیان کیا ، کہا کہ میں نے معرور بن سوید سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا وَاصِلٌ الأَحْدَبُ، قَالَ سَمِعْتُ الْمَعْرُورَ بْنَ سُوَيْدٍ، قَالَ رَأَيْتُ أَبَا ذَرٍّ الْغِفَارِيَّ ـ رضى الله عنه ـ وَعَلَيْهِ حُلَّةٌ وَعَلَى غُلاَمِهِ حُلَّةٌ فَسَأَلْنَاهُ عَنْ ذَلِكَ فَقَالَ إِنِّي سَابَبْتُ رَجُلاً فَشَكَانِي إِلَى النَّبِيِّ صلى الله عليه وسلم، فَقَالَ لِيَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَعَيَّرْتَهُ بِأُمِّهِ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّ إِخْوَانَكُمْ خَوَلُكُمْ جَعَلَهُمُ اللَّهُ تَحْتَ أَيْدِيكُمْ، فَمَنْ كَانَ أَخُوهُ تَحْتَ يَدِهِ فَلْيُطْعِمْهُ مِمَّا يَأْكُلُ، وَلْيُلْبِسْهُ مِمَّا يَلْبَسُ، وَلاَ تُكَلِّفُوهُمْ مَا يَغْلِبُهُمْ، فَإِنْ كَلَّفْتُمُوهُمْ مَا يَغْلِبُهُمْ فَأَعِينُوهُمْ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏",
                "headingUrdu": "’’غلام تمہارے بھائی ہیں، لہٰذا انہیں ویسا ہی کھلاؤ جیسا تم کھاتے ہو۔‘‘",
                "headingEnglish": "\"Slaves are your brothers, so feed them with the like of what you eat.\"",
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2434,
                "hadithNumber": "2546",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If a slave is honest and faithful to his master and worships his Lord (Allah) in a perfect manner, he will get a double reward.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، غلام جو اپنے آقا کا خیرخواہ بھی ہو اور اپنے رب کی عبادت بھی اچھی طرح کرتا ہو تو اسے دو گنا ثواب ملتا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، انہوں نے امام مالک سے ، انہوں نے نافع سے ، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْعَبْدُ إِذَا نَصَحَ سَيِّدَهُ وَأَحْسَنَ عِبَادَةَ رَبِّهِ كَانَ لَهُ أَجْرُهُ مَرَّتَيْنِ ‏\"‏‏.‏",
                "headingArabic": "الْعَبْدِ إِذَا أَحْسَنَ عِبَادَةَ رَبِّهِ وَنَصَحَ سَيِّدَهُ",
                "headingUrdu": "ایک غلام جو اپنے رب کی عبادت کرتا ہے اور وہ اپنے آقا کے ساتھ دیانت دار اور وفادار بھی ہے۔",
                "headingEnglish": "A slave who worships his Lord and he is also honest and faithful to his master",
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2435,
                "hadithNumber": "2547",
                "englishNarrator": "Narrated Abu Musa Al-Ash`ari رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"He who has a slave-girl and teaches her good manners and improves her education and then manumits and marries her, will get a double reward; and any slave who observes Allah's right and his master's right will get a double reward.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا جس کسی کے پاس بھی کوئی باندی ہو اور وہ اسے پورے حسن و خوبی کے ساتھ ادب سکھائے ، پھر آزاد کر کے اس سے شادی کر لے تو اسے دوگنا ثواب ملتا ہے اور جو غلام اللہ تعالیٰ کے حقوق بھی ادا کرے اور اپنے آقاؤں کے بھی تو اسے بھی دوگنا ثواب ملتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان ثوری نے خبر دی صالح سے ، انہوں نے شعبی سے ، انہوں نے ابوبردہ سے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ صَالِحٍ، عَنِ الشَّعْبِيِّ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَيُّمَا رَجُلٍ كَانَتْ لَهُ جَارِيَةٌ فَأَدَّبَهَا فَأَحْسَنَ تَأْدِيبَهَا، وَأَعْتَقَهَا وَتَزَوَّجَهَا، فَلَهُ أَجْرَانِ، وَأَيُّمَا عَبْدٍ أَدَّى حَقَّ اللَّهِ وَحَقَّ مَوَالِيهِ، فَلَهُ أَجْرَانِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2436,
                "hadithNumber": "2548",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"A pious slave gets a double reward.\" Abu Huraira رضی اللہ عنہ added: By Him in Whose Hands my soul is but for Jihad (i.e. holy battles), Hajj, and my duty to serve my mother, I would have loved to die as a slave.",
                "hadithUrdu": "ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا غلام جو کسی کی ملکیت میں ہو اور نیکوکار ہو تو اسے دو ثواب ملتے ہیں اور حضرت ابوہریرۃ رضی اللہ عنہ نے کہا ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے اگر اللہ تعالیٰ کے راستے میں جہاد ، حج اور والدہ کی خدمت ( کی روک ) نہ ہوتی تو میں پسند کرتاکہ غلام رہ کر مروں ۔",
                "urduNarrator": "ہم سے بشر بن محمد نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس نے خبر دی ، انہوں نے زہری سے سنا ، انہوں نے کہا کہ میں نے سعید بن مسیب سے سنا ، انہوں نے کہا کہ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لِلْعَبْدِ الْمَمْلُوكِ الصَّالِحِ أَجْرَانِ، وَالَّذِي نَفْسِي بِيَدِهِ لَوْلاَ الْجِهَادُ فِي سَبِيلِ اللَّهِ وَالْحَجُّ وَبِرُّ أُمِّي، لأَحْبَبْتُ أَنْ أَمُوتَ وَأَنَا مَمْلُوكٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2437,
                "hadithNumber": "2549",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Goodness and comfort are for him who worships his Lord in a perfect manner and serves his master sincerely.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کتنا اچھا ہے کسی کا وہ غلام جو اپنے رب کی عبادت تمام حسن و خوبی کے ساتھ بجا لائے اور اپنے مالک کی خیرخواہی بھی کرتا رہے ۔",
                "urduNarrator": "ہم سے اسحاق بن نصر نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، انہوں نے اعمش سے ، ان سے ابوصالح نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الأَعْمَشِ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ نِعْمَ مَا لأَحَدِهِمْ يُحْسِنُ عِبَادَةَ رَبِّهِ وَيَنْصَحُ لِسَيِّدِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2438,
                "hadithNumber": "2550",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If a slave serves his Saiyid (i.e. master) sincerely and worships his Lord (Allah) perfectly, he will get a double reward.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ جب غلام اپنے آقا کی خیرخواہی کرے اور اپنے رب کی عبادت تمام حسن و خوبی کے ساتھ بجا لائے تو اسے دوگنا ثواب ملتا ہے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے عبیداللہ نے ، ان سے نافع نے کہا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا نَصَحَ الْعَبْدُ سَيِّدَهُ، وَأَحْسَنَ عِبَادَةَ رَبِّهِ، كَانَ لَهُ أَجْرُهُ مَرَّتَيْنِ ‏\"‏‏.‏",
                "headingArabic": "كَرَاهِيَةِ التَّطَاوُلِ عَلَى الرَّقِيقِ",
                "headingUrdu": "غلام کو حقیر سمجھنا ناپسندیدہ ہے۔",
                "headingEnglish": "It is dislike to look down upon a slave",
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2439,
                "hadithNumber": "2551",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The Mamluk (slave) who worships his Lord in a perfect manner, and is dutiful, sincere and obedient to his Saiyid (master), will get a double reward.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ غلام جو اپنے رب کی عبادت احسن طریق کے ساتھ بجا لائے اور اپنے آقا کے جو اس پر خیرخواہی اور فرماں برداری ( کے حقوق ہیں ) انہیں بھی ادا کرتا رہے ، تو اسے دوگنا ثواب ملتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن علاء نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، انہوں نے برید بن عبداللہ سے ، وہ ابوبردہ سے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمَمْلُوكُ الَّذِي يُحْسِنُ عِبَادَةَ رَبِّهِ، وَيُؤَدِّي إِلَى سَيِّدِهِ الَّذِي لَهُ عَلَيْهِ مِنَ الْحَقِّ وَالنَّصِيحَةِ وَالطَّاعَةِ، لَهُ أَجْرَانِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2440,
                "hadithNumber": "2552",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"You should not say, 'Feed your lord (Rabbaka), help your lord in performing ablution, or give water to your lord, but should say, 'my master (e.g. Feed your master instead of lord etc.) (Saiyidi), or my guardian (Maulai), and one should not say, my slave (Abdi), or my girl-slave (Amati), but should say, my lad (Fatai), my lass (Fatati), and 'my boy (Ghulami).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا ۔ کوئی شخص ( کسی غلام یا کسی بھی شخص سے ) یہ نہ کہے ” اپنے رب ( مراد آقا ) کو کھانا کھلا ، اپنے رب کو وضوکرا ، اپنے رب کو پانی پلا “ ۔ بلکہ صرف میرے سردار ، میرے آقا کے الفاظ کہنا چاہئے ۔ اسی طرح کوئی شخص یہ نہ کہے ۔ ” میرا بندہ ، میری بندی ، بلکہ یوں کہنا چاہئے میرا چھوکرا ، میری چھوکری ، میرا غلام ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام بن منبہ نے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ لاَ يَقُلْ أَحَدُكُمْ أَطْعِمْ رَبَّكَ، وَضِّئْ رَبَّكَ، اسْقِ رَبَّكَ‏.‏ وَلْيَقُلْ سَيِّدِي مَوْلاَىَ‏.‏ وَلاَ يَقُلْ أَحَدُكُمْ عَبْدِي أَمَتِي‏.‏ وَلْيَقُلْ فَتَاىَ وَفَتَاتِي وَغُلاَمِي ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2441,
                "hadithNumber": "2553",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If one manumits his share of a common slave (Abd), and he has money sufficient to free the remaining portion of the price of the slave (justly estimated), then he should free the slave completely by paying the rest of his price; otherwise the slave is freed partly. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جس نے غلام کا اپنا حصہ آزاد کر دیا ، اور اس کے پاس اتنا مال بھی ہو جس سے غلام کی واجبی قیمت ادا کی جا سکے تو اسی کے مال سے پورا غلام آزاد کیا جائے گا ورنہ جتنا آزاد ہو گیا ہو گیا ۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، انہوں نے کہا ہم سے جریر بن حازم نے بیان کیا ، انہوں نے نافع سے ، وہ حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ أَعْتَقَ نَصِيبًا لَهُ مِنَ الْعَبْدِ، فَكَانَ لَهُ مِنَ الْمَالِ مَا يَبْلُغُ قِيمَتَهُ، يُقَوَّمُ عَلَيْهِ قِيمَةَ عَدْلٍ، وَأُعْتِقَ مِنْ مَالِهِ، وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2442,
                "hadithNumber": "2554",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Everyone of you is a guardian and is responsible for his charges. The ruler who has authority over people, is a guardian and is responsible for them, a man is a guardian of his family and is responsible for them; a woman is a guardian of her husband's house and children and is responsible for them; a slave ('Abu) is a guardian of his master's property and is responsible for it; so all of you are guardians and are responsible for your charges.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تم میں سے ہر شخص حاکم ہے اور اس کی رعایا کے بارے میں سوال ہو گا ۔ پس لوگوں کا واقعی امیر ایک حاکم ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ اور ہر آدمی اپنے گھر والوں پر حاکم ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ اور عورت اپنے شوہر کے گھر اور اس کے بچوں پر حاکم ہے اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ اور غلام اپنے آقا ( سید ) کے مال کا حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ پس جان لو کہ تم میں سے ہر ایک حاکم ہے اور ہر ایک سے اس کی رعیت کے بارے میں ( قیامت کے دن ) پوچھ ہو گی ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے عبیداللہ عمری نے بیان کیا کہ مجھ سے نافع نے بیان کیا ، حضرت عبداللہ بن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّكُمْ رَاعٍ فَمَسْئُولٌ عَنْ رَعِيَّتِهِ، فَالأَمِيرُ الَّذِي عَلَى النَّاسِ رَاعٍ وَهْوَ مَسْئُولٌ عَنْهُمْ، وَالرَّجُلُ رَاعٍ عَلَى أَهْلِ بَيْتِهِ وَهْوَ مَسْئُولٌ عَنْهُمْ، وَالْمَرْأَةُ رَاعِيَةٌ عَلَى بَيْتِ بَعْلِهَا وَوَلَدِهِ وَهْىَ مَسْئُولَةٌ عَنْهُمْ، وَالْعَبْدُ رَاعٍ عَلَى مَالِ سَيِّدِهِ وَهْوَ مَسْئُولٌ عَنْهُ، أَلاَ فَكُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2443,
                "hadithNumber": "2555, 2556",
                "englishNarrator": "Narrated Abu Huraira and Zaid bin Khalid رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If a slave-girl (Ama) commits illegal sexual intercourse, scourge her; if she does it again, scourge her again; if she repeats it, scourge her again.\" The narrator added that on the third or the fourth offense, the Prophet (ﷺ) said, \"Sell her even for a hair rope.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ جب باندی زنا کرائے تو اسے ( بطور حد شرعی ) کوڑے لگاؤ پھر اگر کرئے تو اسے کوڑے لگاؤ تیسری یا چوتھی بار میں ( آپ صلی اللہ علیہ وسلم نے فرمایا کہ ) پھر اسے بیچ دو ، خواہ قیمت میں ایک رسی ہی ملے ۔",
                "urduNarrator": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا زہری سے ، ان سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے بیان کیا ، کہا میں نے ابوہریرہ اور زید بن خالد رضی اللہ عنہما سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عُبَيْدُ اللَّهِ، سَمِعْتُ أَبَا هُرَيْرَةَ، وَزَيْدَ بْنَ خَالِدٍ، رضى الله عنهما عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا زَنَتِ الأَمَةُ فَاجْلِدُوهَا، ثُمَّ إِذَا زَنَتْ فَاجْلِدُوهَا، ثُمَّ إِذَا زَنَتْ فَاجْلِدُوهَا، فِي الثَّالِثَةِ أَوِ الرَّابِعَةِ بِيعُوهَا وَلَوْ بِضَفِيرٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2444,
                "hadithNumber": "2557",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"When your servant brings your meals to you then if he does not let him sit and share the meals, then he should at least give him a mouthful or two mouthfuls of that meal or a meal or two meals, as he has prepared it.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب کسی کا غلام کھانا لائے اور وہ اسے اپنے ساتھ ( کھلانے کے لیے ) نہ بٹھا سکے تو اسے ایک یا دو نوالے ضرور کھلا دے یا آپ صلی اللہ علیہ وسلم نے لقمۃ او لقمتین کے بدل اکلۃ او اکلتین فرمایا ( یعنی ایک یا دو لقمے ) کیونکہ اسی نے اس کو تیار کرنے کی تکلیف اٹھائی ہے ۔",
                "urduNarrator": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا مجھے محمد بن زیاد نے خبر دی ، انہوں نے کہا کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا اور انہوں نے",
                "hadithArabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ زِيَادٍ، سَمِعْتُ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ إِذَا أَتَى أَحَدَكُمْ خَادِمُهُ بِطَعَامِهِ، فَإِنْ لَمْ يُجْلِسْهُ مَعَهُ، فَلْيُنَاوِلْهُ لُقْمَةً أَوْ لُقْمَتَيْنِ أَوْ أُكْلَةً أَوْ أُكْلَتَيْنِ، فَإِنَّهُ وَلِيَ عِلاَجَهُ ‏\"‏‏.‏",
                "headingArabic": "إِذَا أَتَاهُ خَادِمُهُ بِطَعَامِهِ",
                "headingUrdu": "جب آپ کا خادم آپ کے لیے کھانا لاتا ہے؟",
                "headingEnglish": "When your servant brings your meal to you?",
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2445,
                "hadithNumber": "2558",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "That he heard Allah's Messenger (ﷺ) saying, \"Everyone of you is a guardian and is responsible for his charge; the ruler is a guardian and is responsible for his subjects; the man is a guardian in his family and responsible for his charges; a woman is a guardian of her husband's house and responsible for her charges; and the servant is a guardian of his master's property and is responsible for his charge.\" I definitely heard the above from the Prophet (ﷺ) and think that the Prophet (ﷺ) also said, \"A man is a guardian of his father's property and responsible for his charges; so everyone of you is a guardian and responsible for his charges.\"",
                "hadithUrdu": "انہوں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہر آدمی حاکم ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ امام حاکم ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ مرد اپنے گھر کے معاملات کا افسر ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ عورت اپنے شوہر کے گھر کی افسر ہے اور اس سے اس کی رعایا کے بارے میں سوال ہو گا ۔ خادم اپنے سید کے مال کا محافظ ہے اور اس سے اس کے بارے میں سوال ہو گا ۔ انہوں نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے یہ باتیں سنی ہیں اور مجھے خیال ہے کہ آپ صلی اللہ علیہ وسلم نے یہ بھی فرمایا تھا کہ مرد اپنے باپ کے مال کا محافظ ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ غرض تم میں سے ہر فرد حاکم ہے اور سب سے اس کی رعیت کے بارے میں سوال ہو گا ۔",
                "urduNarrator": "سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا کہ مجھے سالم بن عبداللہ بن عمر نے خبر دی اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ كُلُّكُمْ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، فَالإِمَامُ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالرَّجُلُ فِي أَهْلِهِ رَاعٍ وَهْوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالْمَرْأَةُ فِي بَيْتِ زَوْجِهَا رَاعِيَةٌ وَهْىَ مَسْئُولَةٌ عَنْ رَعِيَّتِهَا، وَالْخَادِمُ فِي مَالِ سَيِّدِهِ رَاعٍ وَهْوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏ قَالَ فَسَمِعْتُ هَؤُلاَءِ مِنَ النَّبِيِّ صلى الله عليه وسلم وَأَحْسِبُ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ وَالرَّجُلُ فِي مَالِ أَبِيهِ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، فَكُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏",
                "headingArabic": "الْعَبْدُ رَاعٍ فِي مَالِ سَيِّدِهِ",
                "headingUrdu": "غلام اپنے آقا کے مال کا محافظ ہے۔",
                "headingEnglish": "The slave is a guardian of the property of his master.",
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2446,
                "hadithNumber": "2559",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If somebody fights (or beats somebody) then he should avoid the face.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب کوئی کسی سے جھگڑا کرے تو چہرے ( پر مارنے ) سے پرہیز کرے ۔",
                "urduNarrator": "ہم سے محمد بن عبیداللہ نے بیان کیا ، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھ سے امام مالک بن انس نے بیان کیا ، کہا کہ مجھے ابن فلاں ( ابن سمعان ) نے خبر دی ، انہیں سعید مقبری نے ، انہیں ان کے باپ نے اور انہیں ابوہریرہ رضی اللہ عنہ نے ، نبی کریم صلی اللہ علیہ وسلم سے ۔  ( دوسری سند اور امام بخاری نے کہا ) اور ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ہمام سے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، قَالَ وَأَخْبَرَنِي ابْنُ فُلاَنٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا قَاتَلَ أَحَدُكُمْ فَلْيَجْتَنِبِ الْوَجْهَ ‏\"‏‏.‏",
                "headingArabic": "إِذَا ضَرَبَ الْعَبْدَ فَلْيَجْتَنِبِ الْوَجْهَ",
                "headingUrdu": "اگر کوئی غلام کو مارے تو اس کے چہرے سے اجتناب کرے۔",
                "headingEnglish": "If somebody beats a slave, he should avoid his face.",
                "chapterId": "50",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 50,
                    "chapterNumber": "50",
                    "chapterEnglish": "Manumission of Slaves",
                    "chapterUrdu": "غلاموں کی آزادی کے بیان میں",
                    "chapterArabic": "كتاب العتق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2447,
                "hadithNumber": "2560",
                "englishNarrator": "Narrated 'Aishah رضی اللہ عنہا :",
                "hadithEnglish": "Barira رضی اللہ عنہا came to seek her help writing of emancipation and she had to pay five Uqiya (of gold) by five yearly installments. 'Aishah رضی اللہ عنہا said to her, \"Do you think that if I pay the whole sum at once, your masters will sell you to me, and I will free you and your Wala' will be for me.\" Barira رضی اللہ عنہا went to her masters and told them about that offer. They said that they would not agree to it unless her Wala' would be for them. 'Aishah رضی اللہ عنہا further said, \"I went to Allah's Messenger (ﷺ) and told him about it.\" Allah Messenger (ﷺ) said to her, \"Buy Barira رضی اللہ عنہا and manumit her and the Wala' will be for the liberator.\" Allah's Messenger (ﷺ) then got up and said, \"What about those people who stipulate conditions that are not present in Allah's Laws? If anybody stipulates a condition which is not in Allah's Laws, then what he stipulates is invalid. Allah's Condition (Laws) are the truth and are more solid.\"",
                "hadithUrdu": "بریرہ رضی اللہ عنہا ان کے پاس آئیں اپنے مکاتبت کے معاملہ میں ان کی مدد حاصل کرنے کے لیے ۔ بریرہ رضی اللہ عنہا کو پانچ اوقیہ چاندی پانچ سال کے اندر پانچ قسطوں میں ادا کرنی تھی ۔ عائشہ رضی اللہ عنہا نے کہا ، انہیں خود بریرہ رضی اللہ عنہا کے آزاد کرانے میں دلچسپی ہو گئی تھی ، کہ یہ بتاو اگر میں انہیں ایک ہی مرتبہ ( چاندی کے یہ پانچ اوقیہ ) ادا کر دوں تو کیا تمہارے مالک تمہیں میرے ہاتھ بیچ دیں گے ؟ پھر میں تمہیں آزاد کر دوں گی اور تمہاری ولاء میرے ساتھ قائم ہو جائے گی ۔ بریرہ رضی اللہ عنہا اپنے مالکوں کے ہاں گئیں اور ان کے آگے یہ صورت رکھی ۔ انہوں نے کہا کہ ہم یہ صورت اس وقت منظور کر سکتے ہیں کہ رشتہ ولاء ہمارے ساتھ رہے ۔ حضرت عائشہ رضی اللہ عنہا نے کہا کہ پھر میرے پاس نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ صلی اللہ علیہ وسلم سے اس کا ذکر کیا آپ نے فرمایا کہ تو خرید کر بریرہ رضی اللہ عنہا کو آزاد کر دے ، ولاء تو اس کی ہوتی ہے جو آزاد کرے ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کو خطاب فرمایا کہ کچھ لوگوں کو کیا ہو گیا ہے جو ( معاملات میں ) ایسی شرطیں لگاتے ہیں جن کی کوئی جڑ بنیاد کتاب اللہ میں نہیں ہے ۔ پس جو شخص کوئی ایسی شرط لگائے جس کی کوئی اصل کتاب اللہ میں نہ ہو تو وہ شرط غلط ہے ۔ اللہ تعالیٰ کی شرط ہی زیادہ حق اور زیادہ مضبوط ہے ۔",
                "urduNarrator": "لیث نے کہا کہ مجھ سے یونس نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ نے کہ عائشہ رضی اللہ عنہا نے کہا کہ",
                "hadithArabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ إِنَّ بَرِيرَةَ دَخَلَتْ عَلَيْهَا تَسْتَعِينُهَا فِي كِتَابَتِهَا وَعَلَيْهَا خَمْسَةُ أَوَاقٍ، نُجِّمَتْ عَلَيْهَا فِي خَمْسِ سِنِينَ، فَقَالَتْ لَهَا عَائِشَةُ وَنَفِسَتْ فِيهَا أَرَأَيْتِ إِنْ عَدَدْتُ لَهُمْ عَدَّةً وَاحِدَةً، أَيَبِيعُكِ أَهْلُكِ، فَأُعْتِقَكِ، فَيَكُونَ وَلاَؤُكِ لِي فَذَهَبَتْ بَرِيرَةُ إِلَى أَهْلِهَا، فَعَرَضَتْ ذَلِكَ عَلَيْهِمْ فَقَالُوا لاَ إِلاَّ أَنْ يَكُونَ لَنَا الْوَلاَءُ‏.‏ قَالَتْ عَائِشَةُ فَدَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ‏.‏ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اشْتَرِيهَا فَأَعْتِقِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا بَالُ رِجَالٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ، مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَهْوَ بَاطِلٌ، شَرْطُ اللَّهِ أَحَقُّ وَأَوْثَقُ ‏\"‏‏.‏",
                "headingArabic": "إِثْمِ مَنْ قَذَفَ مَمْلُوكَهُ الْمُكَاتَبِ",
                "headingUrdu": "اس کا گناہ جو اپنے غلام پر ناجائز جنسی تعلقات کا جھوٹا الزام لگاتا ہے۔",
                "headingEnglish": "The sin of one who falsely accuses his slave of illegal sexual intercourse",
                "chapterId": "51",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 51,
                    "chapterNumber": "51",
                    "chapterEnglish": "Makaatib",
                    "chapterUrdu": "مکاتب کے مسائل کا بیان",
                    "chapterArabic": "كتاب المكاتب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2448,
                "hadithNumber": "2561",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Buraira رضی اللہ عنہا came to seek her help in her writing of emancipation (for a certain sum) and that time she had not paid anything of it. `Aisha رضی اللہ عنہا said to her, \"Go back to your masters, and if they agree that I will pay the amount of your writing of emancipation and get your Wala', I will do so.\" Buraira رضی اللہ عنہا informed her masters of that but they refused and said, \"If she (i.e. `Aisha رضی اللہ عنہا) is seeking Allah's reward, then she can do so, but your Wala' will be for us.\" `Aisha رضی اللہ عنہا mentioned that to Allah's Apostle who said to her, \"Buy and manumit her, as the Wala' is for the liberator.\" Allah's Messenger (ﷺ) then got up and said, \"What about the people who stipulate conditions which are not present in Allah's Laws? Whoever imposes conditions which are not present in Allah's Laws, then those conditions will be invalid, even if he imposed these conditions a hundred times. Allah's conditions (Laws) are the truth and are more solid.\"",
                "hadithUrdu": "بریرہ رضی اللہ عنہا ان کے پاس اپنے معاملہ مکاتبت میں مدد لینے آئیں ، ابھی انہوں نے کچھ بھی ادا نہیں کیا تھا ۔ حضرت عائشہ رضی اللہ عنہا نے ان سے کہا کہ تو اپنے مالکوں کے پاس جا ، اگر وہ یہ پسند کریں کہ تیرے معاملہ مکاتبت کی پوری رقم میں ادا کر دوں اور تمہاری ولاء میرے ساتھ قائم ہو تو میں ایسا کر سکتی ہوں ۔ بریرہ رضی اللہ عنہا نے یہ صورت اپنے مالکوں کے سامنے رکھی لیکن انہوں نے انکار کیا اور کہا کہ اگر وہ ( حضرت عائشہ رضی اللہ عنہا ) تمہارے ساتھ ثواب کی نیت سے یہ کام کرنا چاہتی ہیں تو انہیں اختیار ہے ، لیکن تمہاری ولاء تو ہمارے ہی ساتھ رہے گی ۔ حضرت عائشہ رضی اللہ عنہا نے اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا کہ تو خرید کر انہیں آزاد کر دے ۔ ولاء تو اسی کے ساتھ ہوتی ہے جو آزاد کر دے ۔ راوی نے بیان کیا کہ پھر رسول اللہ صلی اللہ علیہ وسلم نے لوگوں سے خطاب کیا اور فرمایا کہ کچھ لوگوں کو کیا ہو گیا ہے کہ وہ ایسی شرطیں لگاتے ہیں جن کی کوئی اصل کتاب اللہ میں نہیں ہے ۔ پس جو بھی کوئی ایسی شرط لگائے جس کی اصل کتاب اللہ میں نہیں ہے تو اس کو ایسی شرطیں لگانا لائق نہیں خواہ وہ ایسی سو شرطیں کیوں نہ لگا لے ۔ اللہ تعالیٰ کی شرط ہی سب سے زیادہ معقول اور مضبوط ہے ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ابن شہاب سے ، انہوں نے عروہ سے اور انہیں حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّ بَرِيرَةَ جَاءَتْ تَسْتَعِينُهَا فِي كِتَابَتِهَا، وَلَمْ تَكُنْ قَضَتْ مِنْ كِتَابَتِهَا شَيْئًا، قَالَتْ لَهَا عَائِشَةُ ارْجِعِي إِلَى أَهْلِكِ، فَإِنْ أَحَبُّوا أَنْ أَقْضِيَ عَنْكِ كِتَابَتَكِ، وَيَكُونَ وَلاَؤُكِ لِي فَعَلْتُ‏.‏ فَذَكَرَتْ ذَلِكَ بَرِيرَةُ لأَهْلِهَا فَأَبَوْا وَقَالُوا إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ فَلْتَفْعَلْ، وَيَكُونَ وَلاَؤُكِ لَنَا، فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ابْتَاعِي فَأَعْتِقِي، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ قَالَ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا بَالُ أُنَاسٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَلَيْسَ لَهُ، وَإِنْ شَرَطَ مِائَةَ مَرَّةٍ، شَرْطُ اللَّهِ أَحَقُّ وَأَوْثَقُ ‏\"‏‏.‏",
                "headingArabic": "مَا يَجُوزُ مِنْ شُرُوطِ الْمُكَاتَبِ، وَمَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ",
                "headingUrdu": "آزادی اور حالات کی تحریر",
                "headingEnglish": "Writing of emancipations and conditions",
                "chapterId": "51",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 51,
                    "chapterNumber": "51",
                    "chapterEnglish": "Makaatib",
                    "chapterUrdu": "مکاتب کے مسائل کا بیان",
                    "chapterArabic": "كتاب المكاتب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2449,
                "hadithNumber": "2562",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Aisha رضی اللہ عنہا wanted to buy a slave-girl in order to manumit her. The girl's masters stipulated that her Wala' would be for them. Allah's Messenger (ﷺ) said (to `Aisha رضی اللہ عنہا), \"What they stipulate should not stop you, for the Wala' is for the liberator.\"",
                "hadithUrdu": "ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے ایک باندی خرید کر اسے آزاد کرنا چاہا ، اس باندی کے مالکوں نے کہا کہ اس شرط پر ہم معاملہ کر سکتے ہیں کہ ولاء ہمارے ساتھ قائم رہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے عائشہ رضی اللہ عنہا سے فرمایا کہ ان کی اس شرط کی وجہ سے تم نہ رکو ، ولاء تو اسی کی ہوتی ہے جو آزاد کرے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی نافع سے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَرَادَتْ عَائِشَةُ أُمُّ الْمُؤْمِنِينَ أَنْ تَشْتَرِيَ جَارِيَةً لِتُعْتِقَهَا، فَقَالَ أَهْلُهَا عَلَى أَنَّ وَلاَءَهَا لَنَا‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَمْنَعُكِ ذَلِكِ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "51",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 51,
                    "chapterNumber": "51",
                    "chapterEnglish": "Makaatib",
                    "chapterUrdu": "مکاتب کے مسائل کا بیان",
                    "chapterArabic": "كتاب المكاتب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2450,
                "hadithNumber": "2563",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Buraira رضی اللہ عنہا came (to `Aisha رضی اللہ عنہا) and said, \"I have made a contract of emancipation with my masters for nine Uqiyas (of gold) to be paid in yearly installments. Therefore, I seek your help.\" `Aisha رضی اللہ عنہا said, \"If your masters agree, I will pay them the sum at once and free you on condition that your Wala' will be for me.\" Buraira رضی اللہ عنہا went to her masters but they refused that offer. She (came back) and said, \"I presented to them the offer but they refused, unless the Wala' was for them.\" Allah's Messenger (ﷺ) heard of that and asked me about it, and I told him about it. On that he said, \"Buy and manumit her and stipulate that the Wala' should be for you, as Wala' is for the liberator.\" `Aisha رضی اللہ عنہا added, \"Allah's Messenger (ﷺ) then got up amongst the people, Glorified and Praised Allah, and said, 'Then after: What about some people who impose conditions which are not present in Allah's Laws? So, any condition which is not present in Allah's Laws is invalid even if they were one-hundred conditions. Allah's ordinance is the truth, and Allah's condition is stronger and more solid. Why do some men from you say, O so-and-so! manumit the slave but the Wala will be for me? Verily, the Wala is for the liberator.\"",
                "hadithUrdu": "بریرہ رضی اللہ عنہا آئیں اور کہا کہ میں نے اپنے مالکوں سے نو اوقیہ چاندی پر مکاتبت کا معاملہ کیا ہے ۔ ہر سال ایک اوقیہ مجھے ادا کرنا پڑے گا ۔ آپ بھی میری مدد کریں ۔ اس پر حضرت عائشہ رضی اللہ عنہا نے کہا کہ اگر تمہارے مالک پسند کریں تو میں انہیں ( یہ ساری رقم ) ایک ہی مرتبہ دے دوں اور پھر تمہیں آزاد کر دوں ، تو میں ایسا کر سکتی ہوں ۔ لیکن تمہاری ولاء میرے ساتھ ہو جائے گی ۔ بریرہ رضی اللہ عنہا اپنے مالکوں کے پاس گئیں تو انہوں نے اس صورت سے انکار کیا ( واپس آ کر ) انہوں نے بتایا کہ میں نے آپ کی یہ صورت ان کے سامنے رکھی تھی لیکن وہ اسے صرف اس صورت میں قبول کرنے کو تیار ہیں کہ ولاء ان کے ساتھ قائم رہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے یہ سنا تو آپ صلی اللہ علیہ وسلم نے مجھ سے دریافت فرمایا ۔ میں نے آپ کو مطلع کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تو انہیں لے کر آزاد کر دے اور انہیں ولاء کی شرط لگانے دے ۔ ولاء تو بہرحال اسی کی ہوتی ہے جو آزاد کرے ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کو خطاب کیا ۔ اللہ کی حمد و ثناء کے بعد فرمایا ، تم میں سے کچھ لوگوں کو یہ کیا ہو گیا ہے کہ ( معاملات میں ) ایسی شرطیں لگاتے ہیں جن کی کوئی اصل کتاب اللہ میں نہیں ہے ۔ پس جو بھی شرط ایسی ہو جس کی اصل کتاب اللہ میں نہ ہو وہ باطل ہے ۔ خواہ ایسی سو شرطیں کیوں نہ لگالی جائیں ۔ اللہ کا فیصلہ ہی حق ہے اور اللہ کی شرط ہی مضبوط ہے کچھ لوگوں کو کیا ہو گیا ہے کہ وہ کہتے ہیں ، اے فلاں ! آزاد تم کرو اور ولاء میرے ساتھ قائم رہے گی ۔ ولاء تو صرف اسی کے ساتھ قائم ہو گی جو آزاد کرے ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ہشام بن عروہ سے ، وہ اپنے والد سے ، ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ جَاءَتْ بَرِيرَةُ فَقَالَتْ إِنِّي كَاتَبْتُ أَهْلِي عَلَى تِسْعِ أَوَاقٍ، فِي كُلِّ عَامٍ وَقِيَّةٌ، فَأَعِينِينِي‏.‏ فَقَالَتْ عَائِشَةُ إِنْ أَحَبَّ أَهْلُكِ أَنْ أَعُدَّهَا لَهُمْ عَدَّةً وَاحِدَةً، وَأُعْتِقَكِ فَعَلْتُ، وَيَكُونَ وَلاَؤُكِ لِي‏.‏ فَذَهَبَتْ إِلَى أَهْلِهَا، فَأَبَوْا ذَلِكَ عَلَيْهَا، فَقَالَتْ إِنِّي قَدْ عَرَضْتُ ذَلِكَ عَلَيْهِمْ، فَأَبَوْا إِلاَّ أَنْ يَكُونَ الْوَلاَءُ لَهُمْ‏.‏ فَسَمِعَ بِذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَأَلَنِي فَأَخْبَرْتُهُ، فَقَالَ ‏\"‏ خُذِيهَا، فَأَعْتِقِيهَا، وَاشْتَرِطِي لَهُمُ الْوَلاَءَ، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي النَّاسِ، فَحَمِدَ اللَّهَ، وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَمَا بَالُ رِجَالٍ مِنْكُمْ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ فَأَيُّمَا شَرْطٍ لَيْسَ فِي كِتَابِ اللَّهِ فَهْوَ بَاطِلٌ، وَإِنْ كَانَ مِائَةَ شَرْطٍ، فَقَضَاءُ اللَّهِ أَحَقُّ، وَشَرْطُ اللَّهِ أَوْثَقُ، مَا بَالُ رِجَالٍ مِنْكُمْ يَقُولُ أَحَدُهُمْ أَعْتِقْ يَا فُلاَنُ وَلِيَ الْوَلاَءُ إِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
                "headingArabic": "اسْتِعَانَةِ الْمُكَاتَبِ، وَسُؤَالِهِ النَّاسَ",
                "headingUrdu": "مکاتب کو اجازت ہے کہ وہ دوسروں سے مدد طلب کرے۔",
                "headingEnglish": "Al-Mukatab is permitted to ask others to help him",
                "chapterId": "51",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 51,
                    "chapterNumber": "51",
                    "chapterEnglish": "Makaatib",
                    "chapterUrdu": "مکاتب کے مسائل کا بیان",
                    "chapterArabic": "كتاب المكاتب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2451,
                "hadithNumber": "2564",
                "englishNarrator": "Narrated `Amra bint `Abdur-Rahman:",
                "hadithEnglish": "Buraira رضی اللہ عنہ went to Aisha رضی اللہ عنہا , the mother of the faithful believers to seek her help in her emancipation Aisha رضی اللہ عنہا said to her, \"If your masters agree, I will pay them your price in a lump sum and manumit you.\" Buraira رضی اللہ عنہا mentioned that offer to her masters but they refused to sell her unless the Wala' was for them. `Aisha رضی اللہ عنہا told Allah's Messenger (ﷺ) about it. He said, \"Buy and manumit her as the Wala' is for the liberator.\"",
                "hadithUrdu": "بریرہ رضی اللہ عنہ حضرت عائشہ رضی اللہ عنہا سے مدد لینے آئیں ۔ حضرت عائشہ رضی اللہ عنہا نے اس سے کہا کہ اگر تمہارے مالک یہ صورت پسند کریں کہ میں ( مکاتبت کی ساری رقم ) انہیں ایک ہی مرتبہ ادا کر دوں اور پھر تمہیں آزاد کر دوں تو میں ایسا کر سکتی ہوں ۔ بریرہ رضی اللہ عنہا نے اس کا ذکر اپنے مالک سے کیا تو انہوں نے کہا کہ ( ہمیں اس صورت میں یہ منظور ہے کہ ) تیری ولاء ہمارے ساتھ ہی قائم رہے ۔ مالک نے بیان کیا ، ان سے یحییٰ نے بیان کیا کہ عمرہ کو یقین تھا کہ عائشہ رضی اللہ عنہا نے اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تو اسے خرید کر آزاد کر دے ۔ ولاء تو اسی کی ہوتی ہے جو آزاد کرے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک رحمہ اللہ نے خبر دی یحییٰ بن سعید سے ، وہ عمرہ بنت عبدالرحمٰن سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ بَرِيرَةَ، جَاءَتْ تَسْتَعِينُ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ فَقَالَتْ لَهَا إِنْ أَحَبَّ أَهْلُكِ أَنْ أَصُبَّ لَهُمْ ثَمَنَكِ صَبَّةً وَاحِدَةً فَأُعْتِقَكِ فَعَلْتُ‏.‏ فَذَكَرَتْ بَرِيرَةُ ذَلِكَ لأَهْلِهَا، فَقَالُوا لاَ‏.‏ إِلاَّ أَنْ يَكُونَ وَلاَؤُكِ لَنَا‏.‏ قَالَ مَالِكٌ قَالَ يَحْيَى فَزَعَمَتْ عَمْرَةُ أَنَّ عَائِشَةَ ذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ اشْتَرِيهَا وَأَعْتِقِيهَا، فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏",
                "headingArabic": "بَيْعِ الْمُكَاتَبِ إِذَا رَضِيَ",
                "headingUrdu": "مکاتب کو اپنے معاہدے پر بیچنا",
                "headingEnglish": "The selling of a Mukatab on his agreement",
                "chapterId": "51",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 51,
                    "chapterNumber": "51",
                    "chapterEnglish": "Makaatib",
                    "chapterUrdu": "مکاتب کے مسائل کا بیان",
                    "chapterArabic": "كتاب المكاتب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2452,
                "hadithNumber": "2565",
                "englishNarrator": "Narrated `Abdul Wahid bin Aiman رضی اللہ عنہ :",
                "hadithEnglish": "I went to `Aisha رضی اللہ عنہا and said, \"I was the slave of `Utba bin Abu Lahab. \"Utba died and his sons became my masters who sold me to Ibn Abu `Amr who manumitted me. The sons of `Utba stipulated that my Wala' should be for them.\" `Aisha رضی اللہ عنہا said, \"Buraira رضی اللہ عنہا came to me and she was given the writing of emancipation by her masters and she asked me to buy and manumit her. I agreed to it, but Buraira رضی اللہ عنہا told me that her masters would not sell her unless her Wala' was for them.\" `Aisha رضی اللہ عنہا said, \"I am not in need of that.\" When the Prophet (ﷺ) heard that, or he was told about it, he asked `Aisha رضی اللہ عنہا about it. `Aisha رضی اللہ عنہا mentioned what Buraira رضی اللہ عنہا had told her. The Prophet (ﷺ) said, \"Buy and manumit her and let them stipulate whatever they like.\" So, `Aisha رضی اللہ عنہا bought and manumitted her and her masters stipulated that her Wala' should be for them.\" The Prophet;, said, \"The Wala' will be for the liberator even if they stipulated a hundred conditions.\"",
                "hadithUrdu": "میں عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا اور عرض کیا کہ میں پہلے عتبہ بن ابی لہب کا غلام تھا ۔ ان کا جب انتقال ہوا تو ان کی اولاد میری وارث ہوئی ۔ ان لوگوں نے مجھے عبداللہ ابن ابی عمرو کو بیچ دیا اور ابن ابی عمرو نے مجھے آزاد کر دیا ۔ لیکن ( بیچتے وقت ) عتبہ کے وارثوں نے ولاء کی شرط اپنے لیے لگالی تھی ( تو کیا یہ شرط صحیح ہے ؟ ) اس پر عائشہ رضی اللہ عنہا نے کہا کہ بریرہ رضی اللہ عنہا میرے یہاں آئی تھیں اور انہوں نے کتابت کا معاملہ کر لیا تھا ۔ انہوں نے کہا کہ مجھے آپ خرید کر آزاد کر دیں ۔ عائشہ رضی اللہ عنہا نے کہا کہ میں ایسا کر دوں گی ( لیکن مالکوں سے بات چیت کے بعد ) انہوں نے بتایا کہ وہ مجھے بیچنے پر صرف اس شرط کے ساتھ راضی ہیں کہ ولاء انہیں کے پاس رہے ۔ عائشہ رضی اللہ عنہا نے کہا کہ پھر مجھے اس کی ضرورت بھی نہیں ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے بھی اسے سنایا ( عائشہ رضی اللہ عنہا نے یہ کہا کہ ) آپ کو اس کی اطلاع ملی ۔ اس لیے آپ صلی اللہ علیہ وسلم نے عائشہ رضی اللہ عنہا سے دریافت فرمایا ، انہوں نے صورت حال کی آپ کو خبر دی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ بریرہ کو خرید کر آزاد کر دے اور مالکوں کو جو بھی شرط چاہیں لگانے دو ۔ چنانچہ عائشہ رضی اللہ عنہا نے انہیں خرید کر آزاد کر دیا ۔ مالکوں نے چونکہ ولاء کی شرط رکھی تھی اس لیے نبی کریم صلی اللہ علیہ وسلم نے ( صحابہ کرام رضی اللہ عنہم کے ایک مجمع سے ) خطاب فرمایا ، ولاء تو اسی کے ساتھ ہوتی ہے جو آزاد کرے ۔ ( اور جو آزاد نہ کریں ) اگرچہ وہ سو شرطیں بھی لگا لیں ( ولاء پھر بھی ان کے ساتھ قائم نہیں ہو سکتی ) ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے عبدالواحد بن ایمن نے بیان کیا کہ مجھ سے میرے باپ ایمن رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ، قَالَ حَدَّثَنِي أَبِي أَيْمَنُ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ ـ رضى الله عنها ـ فَقُلْتُ كُنْتُ غُلاَمًا لِعُتْبَةَ بْنِ أَبِي لَهَبٍ، وَمَاتَ وَوَرِثَنِي بَنُوهُ، وَإِنَّهُمْ بَاعُونِي مِنَ ابْنِ أَبِي عَمْرٍو، فَأَعْتَقَنِي ابْنُ أَبِي عَمْرٍو، وَاشْتَرَطَ بَنُو عُتْبَةَ الْوَلاَءَ‏.‏ فَقَالَتْ دَخَلَتْ بَرِيرَةُ وَهْىَ مُكَاتَبَةٌ فَقَالَتِ اشْتَرِينِي وَأَعْتِقِينِي‏.‏ قَالَتْ نَعَمْ‏.‏ قَالَتْ لاَ يَبِيعُونِي حَتَّى يَشْتَرِطُوا وَلاَئِي‏.‏ فَقَالَتْ لاَ حَاجَةَ لِي بِذَلِكَ‏.‏ فَسَمِعَ بِذَلِكَ النَّبِيُّ صلى الله عليه وسلم أَوْ بَلَغَهُ، فَذَكَرَ لِعَائِشَةَ، فَذَكَرَتْ عَائِشَةُ مَا قَالَتْ لَهَا، فَقَالَ ‏\"‏ اشْتَرِيهَا وَأَعْتِقِيهَا، وَدَعِيهِمْ يَشْتَرِطُونَ مَا شَاءُوا ‏\"‏‏.‏ فَاشْتَرَتْهَا عَائِشَةُ فَأَعْتَقَتْهَا وَاشْتَرَطَ أَهْلُهَا الْوَلاَءَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْوَلاَءُ لِمَنْ أَعْتَقَ، وَإِنِ اشْتَرَطُوا مِائَةَ شَرْطٍ ‏\"‏‏.‏",
                "headingArabic": "إِذَا قَالَ الْمُكَاتَبُ اشْتَرِنِي وَأَعْتِقْنِي فَاشْتَرَاهُ لِذَلِكَ",
                "headingUrdu": "اگر مکاتب غلام کسی سے کہے کہ اسے خرید کر آزاد کر دے۔",
                "headingEnglish": "If a Mukatab slave asks somebody to buy and free him",
                "chapterId": "51",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 51,
                    "chapterNumber": "51",
                    "chapterEnglish": "Makaatib",
                    "chapterUrdu": "مکاتب کے مسائل کا بیان",
                    "chapterArabic": "كتاب المكاتب",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 2426,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=97",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=95",
                "label": "95",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=96",
                "label": "96",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=97",
                "label": "97",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=98",
                "label": "98",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=99",
                "label": "99",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=100",
                "label": "100",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=101",
                "label": "101",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=99",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=99",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=97",
        "to": 2450,
        "total": 40465
    }
}