{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 68,
        "data": [
            {
                "id": 1677,
                "hadithNumber": "1747",
                "englishNarrator": "Narrated `Abdur-Rahman bin Yazid:",
                "hadithEnglish": "`Abdullah رضی اللہ عنہ , did the Rami from the middle of the valley. So, I said, \"O, Abu `Abdur-Rahman! Some people do the Rami (of the Jamra) from above it (i.e. from the top of the valley).\" He said, \"By Him except whom none has the right to be worshipped, this is the place from where the one on whom Surat-al-Baqara was revealed (i.e. Allah's Messenger (ﷺ)) did the Rami.\" Abdullah bin Waleed, Sufyan have also reported this Hadith from Aamash.",
                "hadithUrdu": "عبداللہ رضی اللہ عنہ نے وادی کے نشیب ( بطن وادی ) میں کھڑے ہو کر کنکری ماری تو میں نے کہا ، اے ابوعبدالرحمٰن ! کچھ لوگ تو وادی کے بالائی علاقہ سے کنکریاں مارتے ہیں ، اس کا جواب انہوں نے یہ دیا کہ اس ذات کی قسم ! جس کے سوا کوئی معبود نہیں یہی ( بطن وادی ) ان کے کھڑے ہونے کی جگہ ہے ( رمی کرتے وقت ) جن پر سورۃ البقرہ نازل ہوئی تھی صلی اللہ علیہ وسلم ۔ عبداللہ بن ولید نے بیان کیا کہ ان سے سفیان ثوری نے اور ان سے اعمش نے یہی حدیث بیان کی ۔",
                "urduNarrator": "محمد بن کثیر نے بیان کیا ، کہا کہ ہم کو سفیان ثوری نے خبر دی ، انہیں اعمش نے ، انہیں ابراہیم نے اور ان سے عبدالرحمٰن بن زید نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ رَمَى عَبْدُ اللَّهِ مِنْ بَطْنِ الْوَادِي، فَقُلْتُ يَا أَبَا عَبْدِ الرَّحْمَنِ، إِنَّ نَاسًا يَرْمُونَهَا مِنْ فَوْقِهَا، فَقَالَ وَالَّذِي لاَ إِلَهَ غَيْرُهُ هَذَا مَقَامُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ صلى الله عليه وسلم‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ الْوَلِيدِ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا الأَعْمَشُ بِهَذَا‏.‏",
                "headingArabic": "رَمْىِ الْجِمَارِ مِنْ بَطْنِ الْوَادِي",
                "headingUrdu": "وادی کے وسط سے جمار کا رمی",
                "headingEnglish": "Rami of Jimar from the middle of the valley",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1678,
                "hadithNumber": "1748",
                "englishNarrator": "Narrated `Abdur-Rahman bin Yazid:",
                "hadithEnglish": "When `Abdullah رضی اللہ عنہ , reached the big Jamra (i.e. Jamrat-ul-Aqaba) he kept the Ka`ba on the left side and Mina on his right side and threw seven pebbles (at the Jamra) and said, \"The one on whom Surat-al- Baqara was revealed (i.e. the Prophet) had done the Rami similarly.\"",
                "hadithUrdu": "عبداللہ بن مسعود رضی اللہ عنہ جمرہ کبریٰ کے پاس پہنچے تو کعبہ کو اپنے بائیں طرف کیا اور منیٰ کو دائیں طرف ، پھر سات کنکریوں سے رمی کی اور فرمایا کہ جن پر سورۃ البقرہ نازل ہوئی تھی صلی اللہ علیہ وسلم انہوں نے بھی اسی طرح رمی کی تھی ۔ ( یعنی رسول اللہ صلی اللہ علیہ وسلم ) ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے حکم بن عتبہ نے ، ان سے ابراہیم نحعی نے ، ان سے عبدالرحمٰن بن یزید نے کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّهُ انْتَهَى إِلَى الْجَمْرَةِ الْكُبْرَى جَعَلَ الْبَيْتَ عَنْ يَسَارِهِ، وَمِنًى عَنْ يَمِينِهِ، وَرَمَى بِسَبْعٍ، وَقَالَ هَكَذَا رَمَى الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ صلى الله عليه وسلم‏.‏",
                "headingArabic": "رَمْىِ الْجِمَارِ بِسَبْعِ حَصَيَاتٍ",
                "headingUrdu": "جمار کا رامی جس میں سات چھوٹے پتھر ہیں۔",
                "headingEnglish": "The Rami of the Jimar with seven small stones",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1679,
                "hadithNumber": "1749",
                "englishNarrator": "Narrated `Abdur-Rahman bin Yazid:",
                "hadithEnglish": "I performed Hajj with Ibn Mas`ud , and saw him doing Rami of the big Jamra (Jamrat-ul-Aqaba) with seven small pebbles, keeping the Ka`ba on his left side and Mina on his right. He then said, \"This is the place where the one on whom Surat-al-Baqara was revealed (i.e. Allah's Messenger (ﷺ) ) stood.\"",
                "hadithUrdu": "انہوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ کے ساتھ حج کیا انہوں نے دیکھا جمرہ عقبہ کی سات کنکریوں کے ساتھ رمی کے وقت آپ نے بیت اللہ کو تو اپنی بائیں طرف اور منی کو دائیں طرف کر لیا پھر فرمایا کہ یہی ان کا بھی مقام تھا جن پر سورۃ البقرہ نازل ہوئی تھی یعنی نبی کریم صلی اللہ علیہ وسلم ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے حکم بن عتبہ نے بیان کیا ، ان سے ابراہیم نخعی نے ، ان سے عبدالرحمٰن بن یزید نے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا الْحَكَمُ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، أَنَّهُ حَجَّ مَعَ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ فَرَآهُ يَرْمِي الْجَمْرَةَ الْكُبْرَى بِسَبْعِ حَصَيَاتٍ، فَجَعَلَ الْبَيْتَ عَنْ يَسَارِهِ، وَمِنًى عَنْ يَمِينِهِ، ثُمَّ قَالَ هَذَا مَقَامُ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ‏.‏",
                "headingArabic": "مَنْ رَمَى جَمْرَةَ الْعَقَبَةِ فَجَعَلَ الْبَيْتَ عَنْ يَسَارِهِ",
                "headingUrdu": "جمرات العقبہ کی رمی کرتے ہوئے خانہ کعبہ کو بائیں طرف رکھنا",
                "headingEnglish": "Keeping the House (Ka'bah) the left on doing Rami of the Jamrat-ul-'Aqaba",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1680,
                "hadithNumber": "1750",
                "englishNarrator": "Narrated Al-A`mash:",
                "hadithEnglish": "I heard Al-Hajjaj saying on the pulpit, \"The Sura in which Al-Baqara (the cow) is mentioned and the Sura in which the family of `Imran is mentioned and the Sura in which the women (An-Nisa) is mentioned.\" I mentioned this to Ibrahim, and he said, `Abdur-Rahman bin Yazid told me, 'I was with Ibn Mas`ud, when he did the Rami of the Jamrat-ul-Aqaba. He went down the middle of the valley, and when he came near the tree (which was near the Jamra) he stood opposite to it and threw seven small pebbles and said: 'Allahu-Akbar' on throwing every pebble.' Then he said, 'By Him, except Whom none has the right to be worshipped, here (at this place) stood the one on whom Surat-al-Baqra was revealed (i.e. Allah's Messenger (ﷺ)).' \"",
                "hadithUrdu": "میں نے حجاج سے سنا ، وہ منبر پر سورتوں کا یوں نام لے رہا تھا وہ سورۃ جس میں بقرہ ( گائے ) کا ذکر آیا ہے ، وہ سورۃ جس میں آل عمران کا ذکر آیا ہے ، وہ سورۃ جس میں نساء ( عورتوں ) کا ذکر آیا ہے ، اعمش نے کہا میں نے اس کا ذکر حضرت ابراہیم نخعی رحمہ اللہ سے کیا تو انہوں نے فرمایا کہ مجھ سے عبدالرحمٰن بن یزید نے بیان کیا کہ جب حضرت عبداللہ بن مسعود رضی اللہ عنہ نے جمرہ عقبہ کی رمی کی تو وہ ان کے ساتھ تھے ، اس وقت وہ وادی کے نشیب میں اتر گئے اور جب درخت کے ( جو اس وقت وہاں پر تھا ) برابر نیچے اس کے سامنے ہو کر سات کنکریوں سے رمی کی ہر کنکری کے ساتھ اللہ اکبر کہتے جاتے تھے ۔ پھر فرمایا قسم ہے اس کی کہ جس ذات کے سوا کوئی معبود نہیں یہیں وہ ذات بھی کھڑی ہوئی تھی جس پر سورۃ البقرہ نازل ہوئی صلی اللہ علیہ وسلم ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے عبدالواحد بن زیاد مصری نے بیان کیا ، ان سے سلیمان اعمش نے بیان کیا ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ عَبْدِ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ الْحَجَّاجَ، يَقُولُ عَلَى الْمِنْبَرِ السُّورَةُ الَّتِي يُذْكَرُ فِيهَا الْبَقَرَةُ، وَالسُّورَةُ الَّتِي يُذْكَرُ فِيهَا آلُ عِمْرَانَ، وَالسُّورَةُ الَّتِي يُذْكَرُ فِيهَا النِّسَاءُ‏.‏ قَالَ فَذَكَرْتُ ذَلِكَ لإِبْرَاهِيمَ، فَقَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ أَنَّهُ كَانَ مَعَ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ حِينَ رَمَى جَمْرَةَ الْعَقَبَةِ، فَاسْتَبْطَنَ الْوَادِيَ، حَتَّى إِذَا حَاذَى بِالشَّجَرَةِ اعْتَرَضَهَا، فَرَمَى بِسَبْعِ حَصَيَاتٍ، يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ، ثُمَّ قَالَ مِنْ هَا هُنَا وَالَّذِي لاَ إِلَهَ غَيْرُهُ قَامَ الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ صلى الله عليه وسلم‏.‏",
                "headingArabic": "يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ",
                "headingUrdu": "ہر کنکری پر اللہ اکبر کہنا",
                "headingEnglish": "To say 'Allahu Akbar' on throwing every pebble",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1681,
                "hadithNumber": "1751",
                "englishNarrator": "Narrated Salim:",
                "hadithEnglish": "Ibn `Umar رضی اللہ عنہما used to do Rami of the Jamrat-ud-Dunya (the Jamra near to the Khaif mosque) with seven small stones and used to recite Takbir on throwing every pebble. He then would go ahead till he reached the level ground where he would stand facing the Qibla for a long time to invoke (Allah) while raising his hands (while invoking). Then he would do Rami of the Jamrat-ul-Wusta (middle Jamra) and then he would go to the left towards the middle ground, where he would stand facing the Qibla. He would remain standing there for a long period to invoke (Allah) while raising his hands, and would stand there for a long period. Then he would do Rami of the Jamrat-ul-Aqaba from the middle of the valley, but he would not stay by it, and then he would leave and say, \"I saw the Prophet (ﷺ) doing like this.\"",
                "hadithUrdu": "حضرت عبدللہ بن عمر رضی اللہ عنہما پہلے جمرہ کی رمی سات کنکریوں کے ساتھ کرتے اور ہر کنکری پر «الله اكبر» کہتے تھے ، پھر آگے بڑھتے اور ایک نرم ہموار زمین پر پہنچ کر قبلہ رخ کھڑے ہو جاتے اسی طرح دیر تک کھڑے دونوں ہاتھ اٹھا کر دعا کرتے ، پھر جمرہ وسطیٰ کی رمی کرتے ، پھر بائیں طرف بڑھتے اور ایک ہموار زمین پر قبلہ رخ ہو کر کھڑے ہو جاتے ، یہاں بھی دیر تک کھڑے کھڑے دونوں ہاتھ اٹھا کر دعائیں کرتے رہتے ، اس کے بعد والے نشیب سے جمرہ عقبہ کی رمی کرتے اس کے بعد آپ کھڑے نہ ہوتے بلکہ واپس چلے آتے اور فرماتے کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو اسی طرح کرتے دیکھا تھا ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، انہوں نے کہا کہ ہم سے طلحہ بن یحییٰ نے بیان کیا ، ان سے یونس نے زہری سے بیان کیا ، ان سے سالم نے کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى، حَدَّثَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ كَانَ يَرْمِي الْجَمْرَةَ الدُّنْيَا بِسَبْعِ حَصَيَاتٍ، يُكَبِّرُ عَلَى إِثْرِ كُلِّ حَصَاةٍ، ثُمَّ يَتَقَدَّمُ حَتَّى يُسْهِلَ فَيَقُومَ مُسْتَقْبِلَ الْقِبْلَةِ فَيَقُومُ طَوِيلاً، وَيَدْعُو وَيَرْفَعُ يَدَيْهِ، ثُمَّ يَرْمِي الْوُسْطَى، ثُمَّ يَأْخُذُ ذَاتَ الشِّمَالِ فَيَسْتَهِلُ وَيَقُومُ مُسْتَقْبِلَ الْقِبْلَةِ فَيَقُومُ طَوِيلاً وَيَدْعُو وَيَرْفَعُ يَدَيْهِ، وَيَقُومُ طَوِيلاً، ثُمَّ يَرْمِي جَمْرَةَ ذَاتِ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي، وَلاَ يَقِفُ عِنْدَهَا ثُمَّ يَنْصَرِفُ فَيَقُولُ هَكَذَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَفْعَلُهُ‏.‏",
                "headingArabic": "مَنْ رَمَى جَمْرَةَ الْعَقَبَةِ وَلَمْ يَقِفْ",
                "headingUrdu": "جمرات عقبہ کی رمی کے بعد (دعوت کے لیے) کھڑا نہ ہونا",
                "headingEnglish": "Not standing (for invocation) after doing Rami of Jamrat-ul-'Aqaba",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1682,
                "hadithNumber": "1752",
                "englishNarrator": "Narrated Salim bin `Abdullah:",
                "hadithEnglish": "`Abdullah bin `Umar رضی اللہ عنہما used to do Rami of the Jamrat-ud-Dunya with seven small pebbles and used to recite Takbir on throwing each stone. He, then, would proceed further till he reached the level ground, where he would stay for a long time, facing the Qibla to invoke (Allah) while raising his hands. Then he would do Rami of the Jamrat-ul-Wusta similarly and would go to the left towards the level ground, where he would stand for a long time facing the Qibla to invoke (Allah) while raising his hands. Then he would do Rami of the Jamrat-ul-Aqaba from the middle of the valley, but he would not stay by it. Ibn `Umar used to say, \"I saw Allah's Messenger (ﷺ) doing like that.\"",
                "hadithUrdu": "عبداللہ بن عمر رضی اللہ عنہما پہلے جمرہ کی رمی سات کنکریوں کے ساتھ کرتے اور ہر کنکری پر «الله اكبر» کہتے تھے ، اس کے بعد آگے بڑھتے اور ایک نرم ہموار زمین پر قبلہ رخ کھڑے ہو جاتے ، دعائیں کرتے رہتے اور دونوں ہاتھوں کو اٹھاتے پھر جمرہ وسطی کی رمی میں بھی اسی طرح کرتے اور بائیں طرف آگے بڑھ کر ایک نرم زمین پر قبلہ رخ کھڑے ہو جاتے ، بہت دیر تک اسی طرح کھڑے ہو کر دعائیں کرتے رہتے ، پھر جمرہ عقبہ کی رمی بطن وادی سے کرتے لیکن وہاں ٹھہرتے نہیں تھے ، آپ فرماتے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کی اسی طرح کرتے دیکھا ہے ۔",
                "urduNarrator": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ مجھ سے میرے بھائی ( عبدالحمید ) نے بیان کیا ، ان سے سلیمان نے بیان کیا ، ان سے یونس بن یزید نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے سالم بن عبداللہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ يَرْمِي الْجَمْرَةَ الدُّنْيَا بِسَبْعِ حَصَيَاتٍ، ثُمَّ يُكَبِّرُ عَلَى إِثْرِ كُلِّ حَصَاةٍ، ثُمَّ يَتَقَدَّمُ فَيُسْهِلُ، فَيَقُومُ مُسْتَقْبِلَ الْقِبْلَةِ قِيَامًا طَوِيلاً، فَيَدْعُو وَيَرْفَعُ يَدَيْهِ، ثُمَّ يَرْمِي الْجَمْرَةَ الْوُسْطَى كَذَلِكَ، فَيَأْخُذُ ذَاتَ الشِّمَالِ فَيُسْهِلُ، وَيَقُومُ مُسْتَقْبِلَ الْقِبْلَةِ قِيَامًا طَوِيلاً، فَيَدْعُو وَيَرْفَعُ يَدَيْهِ، ثُمَّ يَرْمِي الْجَمْرَةَ ذَاتَ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي، وَلاَ يَقِفُ عِنْدَهَا، وَيَقُولُ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَفْعَلُ‏.‏",
                "headingArabic": "رَفْعِ الْيَدَيْنِ عِنْدَ جَمْرَةِ الدُّنْيَا وَالْوُسْطَى",
                "headingUrdu": "الجمارۃ الدنیا اور الجمرۃ الوسطۃ کے نزدیک دعا",
                "headingEnglish": "Invocation near Al-Jamrat-ud-Dunya and Al-Jamrat-ul-Wusta",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1683,
                "hadithNumber": "1753",
                "englishNarrator": "Narrated Az-Zuhri:",
                "hadithEnglish": "Whenever Allah's Messenger (ﷺ) stoned the Jamra near Mina Mosque, he would do Ramy of it with seven small pebbles and say Takbir on throwing each pebble. Then he would go ahead and stand facing the Qiblah with his hands raised, and invoke (Allah) and he sued to stand for a long period. Then he would come to the second Jamra (Al-Wusta) and stone it will seven small stones, reciting Takbir on throwing each stone. Then he would stand facing the Qiblah with raised hands to invoke (Allah). Then he would come to the Jamra near the 'Aqaba (Jamrat-ul-'Aqaba) and do Ramy of it with seven small pebbles, reciting Takbir on throwing each stone. he then would leave and not stay by it. Narrated Az-Zuhri: I heard Salim bin 'Abdullah saying the same that his father said on the authority of the Prophet (ﷺ). And Ibn 'Umar رضی اللہ عنہما used to do the same.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم جب اس جمرہ کی رمی کرتے جو منی کی مسجد کے نزدیک ہے تو سات کنکریوں سے رمی کرتے اور ہر کنکری کے ساتھ تکبیر «الله اكبر» کہتے ، پھر آگے بڑھتے اور قبلہ رخ کھڑے ہو کر دونوں ہاتھ اٹھا کر دعائیں کرتے تھے ، یہاں آپ صلی اللہ علیہ وسلم بہت دیر تک کھڑے رہتے تھے پھر جمرہ ثانیہ ( وسطی ) کے پاس آتے یہاں بھی سات کنکریوں سے رمی کرتے اور ہر کنکری کے ساتھ «الله اكبر» کہتے ، پھر بائیں طرف نالے کے قریب اتر جاتے اور وہاں بھی قبلہ رخ کھڑے ہوتے اور ہاتھوں کو اٹھا کر دعا کرتے رہتے ، پھر جمرہ عقبہ کے پاس آتے اور یہاں بھی سات کنکریوں سے رمی کرتے اور ہر کنکری کے ساتھ «الله اكبر» کہتے ، اس کے بعد واپس ہو جاتے یہاں آپ دعا کے لیے ٹھہرتے نہیں تھے ۔ زہری نے کہا کہ میں نے سالم سے سنا وہ بھی اسی طرح اپنے والد ( ابن عمر رضی اللہ عنہما ) سے نبی کریم صلی اللہ علیہ وسلم کی حدیث بیان کرتے تھے اور یہ کہ عبداللہ بن عمر رضی اللہ عنہما خود بھی اسی طرح کیا کرتے تھے ۔",
                "urduNarrator": "اور محمد بن بشار نے کہا کہ ہم سے عثمان بن عمر نے بیان کیا ، انہیں یونس نے خبر دی اور انہیں زہری نے کہ",
                "hadithArabic": "وَقَالَ مُحَمَّدٌ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا رَمَى الْجَمْرَةَ الَّتِي تَلِي مَسْجِدَ مِنًى يَرْمِيهَا بِسَبْعِ حَصَيَاتٍ، يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ، ثُمَّ تَقَدَّمَ أَمَامَهَا فَوَقَفَ مُسْتَقْبِلَ الْقِبْلَةِ رَافِعًا يَدَيْهِ يَدْعُو، وَكَانَ يُطِيلُ الْوُقُوفَ، ثُمَّ يَأْتِي الْجَمْرَةَ الثَّانِيَةَ، فَيَرْمِيهَا بِسَبْعِ حَصَيَاتٍ، يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ، ثُمَّ يَنْحَدِرُ ذَاتَ الْيَسَارِ مِمَّا يَلِي الْوَادِيَ، فَيَقِفُ مُسْتَقْبِلَ الْقِبْلَةِ رَافِعًا يَدَيْهِ يَدْعُو، ثُمَّ يَأْتِي الْجَمْرَةَ الَّتِي عِنْدَ الْعَقَبَةِ فَيَرْمِيهَا بِسَبْعِ حَصَيَاتٍ، يُكَبِّرُ عِنْدَ كُلِّ حَصَاةٍ، ثُمَّ يَنْصَرِفُ وَلاَ يَقِفُ عِنْدَهَا‏.‏ قَالَ الزُّهْرِيُّ سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ يُحَدِّثُ مِثْلَ هَذَا عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم وَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ‏.‏",
                "headingArabic": "الدُّعَاءِ عِنْدَ الْجَمْرَتَيْنِ",
                "headingUrdu": "دو جمرات کے قریب (اللہ کو) پکارنا",
                "headingEnglish": "Invoking (Allah) near the two Jamrat",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1684,
                "hadithNumber": "1754",
                "englishNarrator": "Narrated I heard my father who was the best man of his age, saying, \"I heard `Aisha رضی اللہ عنہا saying :",
                "hadithEnglish": "'I perfumed Allah's Apostle with my own hands before finishing his Ihram while yet he has not performed Tawaf-al- Ifada.' She spread her hands (while saying so.)\"",
                "hadithUrdu": "میں نے خود اپنے ہاتھوں سے رسول اللہ صلی اللہ علیہ وسلم کے ، جب آپ نے احرام باندھنا چاہا ، خوشبو لگائی تھی اس طرح کھولتے وقت بھی جب آپ نے طواف الزیارۃ سے پہلے احرام کھولنا چاہا تھا ( آپ نے ہاتھ پھیلا کر خوشبو لگانے کی کیفیت بتائی ) ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عبدالرحمٰن بن قاسم نے بیان کیا کہ  میں نے اپنے والد سے سنا - اور وہ اپنے زمانے کے لوگوں میں سب سے اچھے تھے - کہتے ہیں  میں نے حضرت عائشہ رضی اللہ عنہا سے سنا ، وہ فرماتی تھیں کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، أَنَّهُ سَمِعَ أَبَاهُ ـ وَكَانَ أَفْضَلَ أَهْلِ زَمَانِهِ ـ يَقُولُ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ تَقُولُ طَيَّبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِيَدَىَّ هَاتَيْنِ حِينَ أَحْرَمَ، وَلِحِلِّهِ حِينَ أَحَلَّ، قَبْلَ أَنْ يَطُوفَ‏.‏ وَبَسَطَتْ يَدَيْهَا‏.‏",
                "headingArabic": "الطِّيبِ بَعْدَ رَمْىِ الْجِمَارِ وَالْحَلْقِ قَبْلَ الإِفَاضَةِ",
                "headingUrdu": "رمی کے بعد خوشبو لگانا اور طواف افاضہ سے پہلے سر منڈوانا",
                "headingEnglish": "To perfume after Rami and to have head shaved before Tawaf-al-Ifada",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1685,
                "hadithNumber": "1755",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The people were ordered to perform the Tawaf of the Ka`ba (Tawaf-al-Wada`) as the lastly thing, before leaving (Mecca), except the menstruating women who were excused.",
                "hadithUrdu": "لوگوں کو اس کا حکم تھا کہ ان کا آخری وقت بیت اللہ کے ساتھ ہو ( یعنی طواف وداع کریں ) البتہ حائضہ سے یہ معاف ہو گیا تھا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابن طاؤس نے ، ان سے ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أُمِرَ النَّاسُ أَنْ يَكُونَ آخِرُ عَهْدِهِمْ بِالْبَيْتِ، إِلاَّ أَنَّهُ خُفِّفَ عَنِ الْحَائِضِ‏.‏",
                "headingArabic": "طَوَافِ الْوَدَاعِ",
                "headingUrdu": "طواف الوداع",
                "headingEnglish": "Tawaf-al-Wada'",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1686,
                "hadithNumber": "1756",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) offered the Zuhr, `Asr, Maghrib and the `Isha' prayers and slept for a while at a place called Al-Muhassab and then rode to the Ka`ba and performed Tawaf round it. Laith has corroborated him from Khalid, Sa'd, Qatadah, Hadrat Anas bin Malik\r\nرضی اللہ عنہ from the prophet (ﷺ).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ظہر ، عصر ، مغرب اور عشاء پڑھی ، پھر تھوڑی دیر محصب میں سو رہے ، اس کے بعد سوار ہو کر بیت اللہ تشریف لے گئے اور وہاں طواف زیارۃ عمرو بن حارث کے ساتھ کیا ، اس روایت کی متابعت لیث نے کی ہے ، ان سے خالد نے بیان کیا ، ان سے سعید نے ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے نقل کیا ہے ۔",
                "urduNarrator": "ہم سے اصبغ بن فرج نے بیان کیا ، انہوں نے کہا کہ ہم کو ابن وہب نے خبر دی ، انہیں عمرو بن حارث نے ، انہیں قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَصْبَغُ بْنُ الْفَرَجِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ قَتَادَةَ، أَنَّ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ حَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى الظُّهْرَ وَالْعَصْرَ، وَالْمَغْرِبَ وَالْعِشَاءَ، ثُمَّ رَقَدَ رَقْدَةً بِالْمُحَصَّبِ، ثُمَّ رَكِبَ إِلَى الْبَيْتِ فَطَافَ بِهِ‏.‏ تَابَعَهُ اللَّيْثُ حَدَّثَنِي خَالِدٌ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، أَنَّ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ حَدَّثَهُ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1687,
                "hadithNumber": "1757",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Safiya bint Huyay  رضی اللہ عنہا , the wife of the Prophet (ﷺ) got her menses, and Allah's Messenger (ﷺ) was informed of that. He said, \"Would she delay us?\" The people said, \"She has already performed Tawaf-al-Ifada.\" He said, \"Therefore she will not (delay us).\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ صفیہ بنت حی رضی اللہ عنہا ( حجۃ الوداع کے موقع پر ) حائضہ ہو گئیں تو میں نے اس کا ذکر آنحضرت صلی اللہ علیہ وسلم سے کیا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر تو یہ ہمیں روکیں گی ، لوگوں نے کہا کہ انہوں نے طواف افاضہ کر لیا ہے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر کوئی فکر نہیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہمیں امام مالک نے خبر دی ، انہیں عبدالرحمٰن بن قاسم نے ، انہیں ان کے والد نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ صَفِيَّةَ بِنْتَ حُيَىٍّ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم حَاضَتْ، فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَحَابِسَتُنَا هِيَ ‏\"‏‏.‏ قَالُوا إِنَّهَا قَدْ أَفَاضَتْ‏.‏ قَالَ ‏\"‏ فَلاَ إِذًا ‏\"‏‏.‏",
                "headingArabic": "إِذَا حَاضَتِ الْمَرْأَةُ بَعْدَ مَا أَفَاضَتْ",
                "headingUrdu": "اگر عورت کو طواف افاضہ کے بعد حیض آجائے",
                "headingEnglish": "If a woman gets her menses after Tawaf-al-Ifada",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1688,
                "hadithNumber": "1758, 1759",
                "englishNarrator": "Narrated `Ikrima:",
                "hadithEnglish": "The people of Medina asked Ibn `Abbas رضی اللہ عنہما about a woman who got her menses after performing Tawafal- Ifada. He said, \"She could depart (from Mecca).\" They said, \"We will not act on your verdict and ignore the verdict of Zaid رضی اللہ عنہم .\" Ibn `Abbas  رضی اللہ عنہما said, \"When you reach Medina, inquire about it.\" So, when they reached Medina they asked (about that). One of those whom they asked was Um Sulaim. She told them the narration of Safiya (812). Khalid and Qatadah reported it from Ikrimah.",
                "hadithUrdu": "مدینہ کے لوگوں نے ابن عباس رضی اللہ عنہما سے ایک عورت کے متعلق پوچھا کہ جو طواف کرنے کے بعد حائضہ ہو گئی تھیں ، آپ نے انہیں بتایا کہ ( انہیں ٹھہرنے کی ضرورت نہیں بلکہ ) چلی جائیں ۔ لیکن پوچھنے والوں نے کہا ہم ایسا نہیں کریں گے کہ آپ کی بات پر عمل تو کریں اور زید بن ثابت رضی اللہ عنہم کی بات چھوڑ دیں ، ابن عباس رضی اللہ عنہما نے فرمایا کہ جب تم مدینہ پہنچ جاؤ تو یہ مسئلہ وہاں ( اکابر صحابہ رضی اللہ عنہم سے ) پوچھنا ۔ چنانچہ جب یہ لوگ مدینہ آئے تو پوچھا ، جن اکابر سے پوچھا گیا تھا ان میں ام سلیم رضی اللہ عنہا بھی تھیں اور انہوں نے ( ان کے جواب میں وہی ) صفیہ رضی اللہ عنہا کی حدیث بیان کی ۔ اس حدیث کو خالد اور قتادہ نے بھی عکرمہ سے روایت کیا ہے ۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، ان سے ایوب نے ، ان سے عکرمہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، أَنَّ أَهْلَ الْمَدِينَةِ، سَأَلُوا ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ امْرَأَةٍ، طَافَتْ ثُمَّ حَاضَتْ، قَالَ لَهُمْ تَنْفِرُ‏.‏ قَالُوا لاَ نَأْخُذُ بِقَوْلِكَ وَنَدَعَ قَوْلَ زَيْدٍ‏.‏ قَالَ إِذَا قَدِمْتُمُ الْمَدِينَةَ فَسَلُوا‏.‏ فَقَدِمُوا الْمَدِينَةَ فَسَأَلُوا، فَكَانَ فِيمَنْ سَأَلُوا أُمُّ سُلَيْمٍ، فَذَكَرَتْ حَدِيثَ صَفِيَّةَ‏.‏ رَوَاهُ خَالِدٌ وَقَتَادَةُ عَنْ عِكْرِمَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1689,
                "hadithNumber": "1760, 1761",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "A menstruating woman was allowed to leave Mecca if she had done Tawaf-al-Ifada. Tawus (a subnarrator) said from his father, \"I heard Ibn `Umar saying that she would not depart. Then later I heard him saying that the Prophet (ﷺ) had allowed them (menstruating women) to depart.\"",
                "hadithUrdu": "عورت کو اس کی اجازت ہے کہ اگر وہ طواف افاضہ ( طواف زیارت ) کر چکی ہو اور پھر ( طواف وداع سے پہلے ) حیض آ جائے تو ( اپنے گھر ) واپس چلی جائے ۔  کہا میں نے ابن عمر کو کہتے سنا کہ اس عورت کے لیے واپسی نہیں ۔ اس کے بعد میں نے ان سے سنا آپ فرماتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے عورتوں کو اس کی اجازت دی ہے ۔",
                "urduNarrator": "ہم سے مسلم نے بیان کیا ، کہا کہ ہم سے وہیب نے بیان کیا ، کہا کہ ہم سے ابن طاؤس نے بیان کیا ، ان سے ان کے باپ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ رُخِّصَ لِلْحَائِضِ أَنْ تَنْفِرَ إِذَا أَفَاضَتْ‏. قَالَ وَسَمِعْتُ ابْنَ عُمَرَ، يَقُولُ إِنَّهَا لاَ تَنْفِرُ‏.‏ ثُمَّ سَمِعْتُهُ يَقُولُ بَعْدُ إِنَّ النَّبِيَّ صلى الله عليه وسلم رَخَّصَ لَهُنَّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1690,
                "hadithNumber": "1762",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "We set out with the Prophet (ﷺ) with the intention of performing Hajj only. The Prophet (ﷺ) reached Mecca and performed Tawaf of the Ka`ba and between Safa and Marwa and did not finish the Ihram, because he had the Hadi with him. His companions and his wives performed Tawaf (of the Ka`ba and between Safa and Marwa), and those who had no Hadi with them finished their Ihram. I got the menses and performed all the ceremonies of Hajj. So, when the Night of Hasba (night of departure) came, I said, \"O Allah's Messenger (ﷺ)! All your companions are returning with Hajj and `Umra except me.\" He asked me, \"Didn't you perform Tawaf of the Ka`ba (Umra) when you reached Mecca?\" I said, \"No.\" He said, \"Go to Tan`im with your brother `Abdur-Rahman, and assume Ihram for `Umra and I will wait for you at such and such a place.\" So I went with `Abdur-Rahman to Tan`im and assumed Ihram for `Umra. Then Safiya bint Huyay got menses. The Prophet (ﷺ) said, \" 'Aqra Halqa! You will detain us! Didn't you perform Tawaf-al-Ifada on the Day of Nahr (slaughtering)?\" She said, \"Yes, I did.\" He said, \"Then there is no harm, depart.\" So I met the Prophet (ﷺ) when he was ascending the heights towards Mecca and I was descending, or vice-versa. Musaddad narrates: Jareer did not corroborated Mansoor in the word \"No\" .",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ نکلے ، ہماری نیت حج کے سوا اور کچھ نہ تھی ۔ پھر جب نبی کریم صلی اللہ علیہ وسلم ( مکہ ) پہنچے تو آپ صلی اللہ علیہ وسلم نے بیت اللہ کا طواف اور صفا اور مروہ کی سعی کی ، لیکن آپ صلی اللہ علیہ وسلم نے احرام نہیں کھولا کیونکہ آپ کے ساتھ قربانی تھی ۔ آپ صلی اللہ علیہ وسلم کے ساتھ آپ صلی اللہ علیہ وسلم کی بیویوں نے اور دیگر اصحاب نے بھی طواف کیا اور جن کے ساتھ قربانی نہیں تھیں انہوں نے ( اس طواف و سعی کے بعد ) احرام کھول دیا لیکن حضرت عائشہ رضی اللہ عنہا حائضہ ہو گئی تھیں ، سب نے اپنے حج کے تمام مناسک ادا کر لیئے تھے ، پھر جب لیلۃ حصبہ یعنی روانگی کی رات آئی تو عائشہ رضی اللہ عنہا نے عرض کی یا رسول اللہ صلی اللہ علیہ وسلم آپ صلی اللہ علیہ وسلم کے تمام ساتھی حج اور عمرہ دونوں کر کے جا رہے ہیں صرف میں عمرہ سے محروم ہوں ، آپ صلی اللہ علیہ وسلم نے فرمایا کے اچھا جب ہم آئے تھے تو تم ( حیض کی وجہ سے ) بیت اللہ کا طوا ف نہیں کر سکی تھیں ؟ میں نے کہا کہ نہیں ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر اپنے بھائی کے ساتھ تنعیم چلی جا اور وہاں سے عمرہ کا احرام باندھ ( اور عمرہ کر ) ہم تمہارا فلاں جگہ انتظار کریں گے ، چنانچہ میں اپنے بھائی ( عبدالرحمٰن رضی اللہ عنہ ) کے ساتھ تنعیم گئی اور وہاں سے احرام باندھا ۔ اسی طرح صفیہ بنت حی رضی اللہ عنہا بھی حائضہ ہو گئی تھیں نبی کریم صلی اللہ علیہ وسلم نے انہیں ( ازراہ محبت ) فرمایا «عقرى حلقى» ، تو ، تو ہمیں روک لے گی ، کیا تو نے قربانی کے دن طواف زیارت نہیں کیا تھا ؟ وہ بولیں کہ کیا تھا ، اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر کوئی حرج نہیں ، چلی چلو ۔ میں جب آپ تک پہنچی تو آپ صلی اللہ علیہ وسلم مکہ کے بالائی علاقہ پر چڑھ رہے تھے اور میں اتر رہی تھی یا یہ کہا کہ میں چڑھ رہی تھی اور حضور صلی اللہ علیہ وسلم اتر رہے تھے ۔ مسدد کی روایت میں ( رسول اللہ صلی علیہ وسلم کے کہنے پر ) ہاں کے بجائے نہیں ہے ، اس کی متابعت جریر نے منصور کے واسطہ سے ” نہیں “ کے ذکر میں کی ہے ۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، کہا کہ ہم سے ابوعوانہ نے بیان کیا ، ان سے منصور نے ، ان سے ابراہیم نخعی نے ، ان سے اسود نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم وَلاَ نُرَى إِلاَّ الْحَجَّ، فَقَدِمَ النَّبِيُّ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ، وَلَمْ يَحِلَّ وَكَانَ مَعَهُ الْهَدْىُ، فَطَافَ مَنْ كَانَ مَعَهُ مِنْ نِسَائِهِ وَأَصْحَابِهِ، وَحَلَّ مِنْهُمْ مَنْ لَمْ يَكُنْ مَعَهُ الْهَدْىُ، فَحَاضَتْ هِيَ، فَنَسَكْنَا مَنَاسِكَنَا مِنْ حَجِّنَا، فَلَمَّا كَانَ لَيْلَةُ الْحَصْبَةِ لَيْلَةُ النَّفْرِ، قَالَتْ يَا رَسُولَ اللَّهِ كُلُّ أَصْحَابِكَ يَرْجِعُ بِحَجٍّ وَعُمْرَةٍ غَيْرِي‏.‏ قَالَ ‏\"‏ مَا كُنْتِ تَطُوفِي بِالْبَيْتِ لَيَالِيَ قَدِمْنَا ‏\"‏‏.‏ قُلْتُ لاَ‏.‏ قَالَ ‏\"‏ فَاخْرُجِي مَعَ أَخِيكِ إِلَى التَّنْعِيمِ فَأَهِلِّي بِعُمْرَةٍ، وَمَوْعِدُكِ مَكَانَ كَذَا وَكَذَا ‏\"‏‏.‏ فَخَرَجْتُ مَعَ عَبْدِ الرَّحْمَنِ إِلَى التَّنْعِيمِ، فَأَهْلَلْتُ بِعُمْرَةٍ، وَحَاضَتْ صَفِيَّةُ بِنْتُ حُيَىٍّ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَقْرَى حَلْقَى، إِنَّكِ لَحَابِسَتُنَا، أَمَا كُنْتِ طُفْتِ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قَالَتْ بَلَى‏.‏ قَالَ ‏\"‏ فَلاَ بَأْسَ‏.‏ انْفِرِي ‏\"‏‏.‏ فَلَقِيتُهُ مُصْعِدًا عَلَى أَهْلِ مَكَّةَ، وَأَنَا مُنْهَبِطَةٌ، أَوْ أَنَا مُصْعِدَةٌ، وَهُوَ مُنْهَبِطٌ‏.‏ وَقَالَ مُسَدَّدٌ قُلْتُ لاَ‏.‏ تَابَعَهُ جَرِيرٌ عَنْ مَنْصُورٍ فِي قَوْلِهِ لاَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1691,
                "hadithNumber": "1763",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "\"Tell me something you have observed about the Prophet (ﷺ) concerning where he offered the Zuhr prayer on the Day of Tarwiya (8th Dhul-Hijja).\" Anas replied, \"He offered it at Mina.\" I said, \"Where did he offer the `Asr prayer on the Day of Nafr (day of departure from Mina)?\" He replied, \"At Al-Abtah,\" and added, \"You should do as your leaders do.\"",
                "hadithUrdu": "مجھے وہ حدیث بتائے جو آپ کو رسول اللہ صلی اللہ علیہ وسلم سے یاد ہو کہ انہوں نے آٹھویں ذی الحجہ کے دن ظہر کی نماز کہاں پڑھی تھی ، انہوں نے کہا منیٰ میں ، میں نے پوچھا اور روانگی کے دن عصر کہاں پڑھی تھی انہوں نے فرمایا کہ ابطح میں اور تم اسی طرح کرو جس طرح تمہارے حاکم لوگ کرتے ہوں ۔ ( تاکہ فتنہ واقع نہ ہو ) ۔",
                "urduNarrator": "ہم سے محمد بن مثنی نے بیان کیا ، کہا ہم سے اسحٰق بن یوسف نے بیان کیا ، ان سے سفیان ثوری نے بیان کیا ، ان سے عبدالعزیز بن رفیع نے بیان کیا کہ میں نے انس بن مالک رضی اللہ عنہ سے پوچھا ،",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ أَخْبِرْنِي بِشَىْءٍ، عَقَلْتَهُ عَنِ النَّبِيِّ صلى الله عليه وسلم أَيْنَ صَلَّى الظُّهْرَ يَوْمَ التَّرْوِيَةِ قَالَ بِمِنًى‏.‏ قُلْتُ فَأَيْنَ صَلَّى الْعَصْرَ يَوْمَ النَّفْرِ قَالَ بِالأَبْطَحِ‏.‏ افْعَلْ كَمَا يَفْعَلُ أُمَرَاؤُكَ‏.‏",
                "headingArabic": "مَنْ صَلَّى الْعَصْرَ يَوْمَ النَّفْرِ بِالأَبْطَحِ",
                "headingUrdu": "منیٰ سے روانگی کے دن عبتہ میں عصر کی نماز (یوم نفر)",
                "headingEnglish": "'Asr prayer at Abtah on the day of departure from Mina (Day of Nafr)",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1692,
                "hadithNumber": "1764",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) offered the Zuhr, `Asr, Maghrib and `Isha' prayers and slept for a while at a place called Al-Mahassab and then he rode towards the Ka`ba and performed Tawaf (al-Wada`).",
                "hadithUrdu": "ظہر ، عصر ، مغرب ، عشاء نبی کریم صلی اللہ علیہ وسلم نے پڑھی اور تھوڑی دیر کے لیے محصب میں سو رہے ، پھر بیت اللہ کی طرف سوار ہو کر گئے اور طواف کیا ۔ ( یہاں طواف الزیارۃ مراد ہے ) ۔",
                "urduNarrator": "ہم سے عبدالمتعال بن طالب نے بیان کیا ، انہوں نے کہا کہ ہم سے ابن وہب نے بیان کیا ، انہوں نے کہا کہ مجھے عمرو بن حارث نے خبر دی ، ان سے قتادہ نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْمُتَعَالِ بْنُ طَالِبٍ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ قَتَادَةَ، حَدَّثَهُ عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ حَدَّثَهُ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ صَلَّى الظُّهْرَ وَالْعَصْرَ، وَالْمَغْرِبَ وَالْعِشَاءَ، وَرَقَدَ رَقْدَةً بِالْمُحَصَّبِ، ثُمَّ رَكِبَ إِلَى الْبَيْتِ فَطَافَ بِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1693,
                "hadithNumber": "1765",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "It (i.e. Al-Abtah) was a place where the Prophet (ﷺ) used to camp so that it might be easier for him to depart (to Madinah Munawwarah: Irfan) is Abtah.",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم منیٰ سے کوچ کر کے یہاں محصب میں اس لیے اترے تھے تاکہ آسانی کے ساتھ مدینہ کو نکل سکیں ۔ آپ صلی اللہ علیہ وسلم کی مراد ابطح میں اترنے سے تھی ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے سفیان نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ إِنَّمَا كَانَ مَنْزِلٌ يَنْزِلُهُ النَّبِيُّ صلى الله عليه وسلم لِيَكُونَ أَسْمَحَ لِخُرُوجِهِ‏.‏ يَعْنِي بِالأَبْطَحِ‏.‏",
                "headingArabic": "الْمُحَصَّبِ",
                "headingUrdu": "المحسب",
                "headingEnglish": "Al-Muhassab",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1694,
                "hadithNumber": "1766",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Staying at Al-Mahassab is not one of the ceremonies (of Hajj), but Al-Mahassab is a place where Allah's Messenger (ﷺ) camped (during his Hajjat-al-Wida).",
                "hadithUrdu": "محصب میں اترنا حج کی کوئی عبادت نہیں ہے ، یہ تو صرف رسول اللہ صلی اللہ علیہ وسلم کے قیام کی جگہ تھی ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن عطاء بن ابی رباح نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ لَيْسَ التَّحْصِيبُ بِشَىْءٍ، إِنَّمَا هُوَ مَنْزِلٌ نَزَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1695,
                "hadithNumber": "1767",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "Ibn `Umar رضی اللہ عنہما used to spend the night at Dhi-Tuwa in between the two Thaniyas and then he would enter Mecca through the Thaniya which is at the higher region of Mecca, and whenever he came to Mecca for Hajj or `Umra, he never made his she camel kneel down except near the gate of the Masjid (Sacred Mosque) and then he would enter (it) and go to the Black (stone) Corner and start from there circumambulating the Ka`ba seven times: hastening in the first three rounds (Ramal) and walking in the last four. On finishing, he would offer two rak`at prayer and set out to perform Tawaf between Safa and Marwa before returning to his dwelling place. On returning (to Medina) from Hajj or `Umra, he used to make his camel kneel down at Al-Batha which is at Dhul-Hulaifa, the place where the Prophet used to make his camel kneel down.",
                "hadithUrdu": "حضرت عبداللہ بن عمر رضی اللہ عنہما مکہ جاتے وقت ذی طویٰ کی دونوں پہاڑیوں کے درمیان رات گزارتے تھے اور پھر اس پہاڑی سے ہو کر گزرتے جو مکہ کے اوپر کی طرف ہے اور جب مکہ میں حج یا عمرہ کا احرام باندھنے آتے تو اپنی اونٹنی مسجد کے دروازہ پر لا کر بٹھاتے پھر حجراسود کے پاس آتے اور یہیں سے طواف شروع کرتے ، طواف سات چکروں میں ختم ہوتا جس کے شروع میں رمل کرتے اور چار میں معمول کے مطابق چلتے ، طواف کے بعد دو رکعت نماز پڑھتے پھر ڈیرہ پر واپس ہونے سے پہلے صفا اور مروہ کی دوڑ کرتے ۔ جب حج یا عمرہ کر کے مدینہ واپس ہوتے تو ذو الحلیفہ کے میدان میں سواری بٹھاتے ، جہاں نبی کریم صلی اللہ علیہ وسلم بھی ( مکہ سے مدینہ واپس ہوتے ہوئے ) اپنی سواری بٹھایا کرتے تھے ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، انہوں نے کہا کہ ہم سے ابوضمرہ انس بن عیاض نے بیان کیا ، ان سے موسیٰ بن عقبہ نے بیان کیا ، ان سے نافع نے کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ يَبِيتُ بِذِي طُوًى بَيْنَ الثَّنِيَّتَيْنِ، ثُمَّ يَدْخُلُ مِنَ الثَّنِيَّةِ الَّتِي بِأَعْلَى مَكَّةَ، وَكَانَ إِذَا قَدِمَ مَكَّةَ حَاجًّا أَوْ مُعْتَمِرًا لَمْ يُنِخْ نَاقَتَهُ إِلاَّ عِنْدَ باب الْمَسْجِدِ، ثُمَّ يَدْخُلُ فَيَأْتِي الرُّكْنَ الأَسْوَدَ فَيَبْدَأُ بِهِ، ثُمَّ يَطُوفُ سَبْعًا ثَلاَثًا سَعْيًا، وَأَرْبَعًا مَشْيًا، ثُمَّ يَنْصَرِفُ فَيُصَلِّي سَجْدَتَيْنِ، ثُمَّ يَنْطَلِقُ قَبْلَ أَنْ يَرْجِعَ إِلَى مَنْزِلِهِ، فَيَطُوفُ بَيْنَ الصَّفَا وَالْمَرْوَةِ، وَكَانَ إِذَا صَدَرَ عَنِ الْحَجِّ أَوِ الْعُمْرَةِ أَنَاخَ بِالْبَطْحَاءِ الَّتِي بِذِي الْحُلَيْفَةِ الَّتِي كَانَ النَّبِيُّ صلى الله عليه وسلم يُنِيخُ بِهَا‏.‏",
                "headingArabic": "النُّزُولِ بِذِي طُوًى قَبْلَ أَنْ يَدْخُلَ مَكَّةَ، وَالنُّزُولِ بِالْبَطْحَاءِ الَّتِي بِذِي الْحُلَيْفَةِ إِذَا رَجَعَ مِنْ مَكَّةَ",
                "headingUrdu": "مکہ میں داخل ہونے سے پہلے ذی طویٰ اور مکہ سے واپسی پر البطح کے مقام پر ڈیرے ڈالنا",
                "headingEnglish": "To camp at Dhi-Tuwa before entering Makkah and at Al-Bathaâ€™ on returning from Makkah",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1696,
                "hadithNumber": "1768",
                "englishNarrator": "Narrated Nafi` :",
                "hadithEnglish": "'Allah's Messenger (ﷺ)s, `Umar and Ibn `Umar رضی اللہ عنہم camped there.\" Nafi` added, \"Ibn `Umar رضی اللہ عنہما used to offer the Zuhr and `Asr prayers at it (i.e. Al-Mahassab).\" I think he mentioned the Maghrib prayer also. I said, \"I don't doubt about `Isha' (i.e. he used to offer it there also), and he used to sleep there for a while. He used to say, 'The Prophet (ﷺ) used to do the same.' \"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اور حضرت عمر اور ابن عمر رضی اللہ عنہم نے محصب میں قیام فرمایا تھا ۔ نافع سے روایت ہے کہ حضرت عبداللہ بن عمر رضی اللہ عنہما محصب میں ظہر اور عصر پڑھتے تھے ۔ میرا خیال ہے کہ انہوں نے مغرب ( پڑھنے کا بھی ) ذکر کیا ، خالد نے بیان کیا کہ عشاء میں مجھے کوئی شک نہیں ۔ اس کے پڑھنے کا ذکر ضرور کیا پھر تھوڑی دیر کے لیے وہاں سو رہتے نبی کریم صلی اللہ علیہ وسلم سے بھی ایسا ہی مذکور ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، انہوں نے کہا کہ ہم سے خالد بن حارث نے بیان کیا ، انہوں نے کہا کہ عبیداللہ سے محصب کے بارے میں پوچھا گیا تو انہوں نے نافع سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ سُئِلَ عُبَيْدُ اللَّهِ عَنِ الْمُحَصَّبِ، فَحَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ،، قَالَ نَزَلَ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَعُمَرُ وَابْنُ عُمَرَ‏.‏ وَعَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ يُصَلِّي بِهَا ـ يَعْنِي الْمُحَصَّبَ ـ الظُّهْرَ وَالْعَصْرَ ـ أَحْسِبُهُ قَالَ وَالْمَغْرِبَ‏.‏ قَالَ خَالِدٌ لاَ أَشُكُّ فِي الْعِشَاءِ، وَيَهْجَعُ هَجْعَةً، وَيَذْكُرُ ذَلِكَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "مَنْ نَزَلَ بِذِي طُوًى إِذَا رَجَعَ مِنْ مَكَّةَ",
                "headingUrdu": "مکہ سے واپسی پر ذی طویٰ میں قیام",
                "headingEnglish": "Staying at Dhi-Tuwa on returning from Makkah",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1697,
                "hadithNumber": "1769",
                "englishNarrator": "Narrated Nafi':",
                "hadithEnglish": "Whenver Ibn 'Umar رضی اللہ عنہما approached (Makkah) he used to pass the night at Dhi-Tuwa till dawn, and then he would enter Makkah. On his return, he used to pass by Dhi-Tuwa and pass the night there till dawn, and he used to say that the Prophet (ﷺ) used to do the same.",
                "hadithUrdu": "حضرت عبداللہ بن عمر رضی اللہ عنہما جب مدینہ سے مکہ آتے تو ذی طویٰ میں رات گزارتے اور جب صبح صادق ہوتی تو مکہ میں داخل ہوتے ۔ اسی طرح مکہ سے واپسی میں بھی ذی طویٰ سے گزرتے اور وہیں رات گزارتے اور فرماتے کہ نبی کریم صلی اللہ علیہ وسلم بھی اسی طرح کرتے تھے ۔",
                "urduNarrator": "اور محمد بن عیسیٰ نے کہا کہ ہم سے حماد بن سلمہ نے بیان کیا ، انہوں نے کہا کہ ہم سے ایوب نے بیان کیا ، ان سے نافع نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ كَانَ إِذَا أَقْبَلَ بَاتَ بِذِي طُوًى، حَتَّى إِذَا أَصْبَحَ دَخَلَ، وَإِذَا نَفَرَ مَرَّ بِذِي طُوًى وَبَاتَ بِهَا حَتَّى يُصْبِحَ، وَكَانَ يَذْكُرُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَفْعَلُ ذَلِكَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1698,
                "hadithNumber": "1770",
                "englishNarrator": "Narrated Ibn ' `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Dhul-Majaz and `Ukaz were the markets of the people during the Pre-Islamic period of ignorance. When the people embraced Islam, they disliked to do bargaining there till the following Holy Verses were revealed:-- There is no harm for you If you seek of the bounty Of your Lord (during Hajj by trading, etc.) (2.198)",
                "hadithUrdu": "ذو المجاز اور عکاظ عہد جاہلیت کے بازار تھے جب اسلام آیا تو گویا لوگوں نے ( جاہلیت کے ان بازاروںمیں ) خریدوفروخت کو برا خیال کیا اس پر ( سورۃ البقرہ کی ) یہ آیت نازل ہوئی ” تمہارے لیے کوئی حرج نہیں اگر تم اپنے رب کے فضل کی تلاش کرو ، یہ حج کے زمانہ کے یے تھا ۔",
                "urduNarrator": "ہم سے عثمان بن ہیثم نے بیان کیا ، انہوں نے کہا کہ ہم کو ابن جریج نے خبر دی ، ان سے عمرو بن دینار نے بیان کیا اور ان سے حضرت عبدللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ عَمْرُو بْنُ دِينَارٍ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ كَانَ ذُو الْمَجَازِ وَعُكَاظٌ مَتْجَرَ النَّاسِ فِي الْجَاهِلِيَّةِ، فَلَمَّا جَاءَ الإِسْلاَمُ كَأَنَّهُمْ كَرِهُوا ذَلِكَ حَتَّى نَزَلَتْ ‏{‏لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلاً مِنْ رَبِّكُمْ‏}‏ فِي مَوَاسِمِ الْحَجِّ‏.‏",
                "headingArabic": "التِّجَارَةِ أَيَّامَ الْمَوْسِمِ وَالْبَيْعِ فِي أَسْوَاقِ الْجَاهِلِيَّةِ",
                "headingUrdu": "حج کے دوران تجارت",
                "headingEnglish": "Trading during the time of Hajj",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1699,
                "hadithNumber": "1771, 1772",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Safiya رضی اللہ عنہا got her menses on the night of Nafr (departure from Hajj), and she said, \"I see that I will detain you.\" The Prophet (ﷺ) said, \"Aqra Halqa! Did she perform the Tawaf on the Day of Nahr (slaughtering)?\" Somebody replied in the affirmative. He said, \"Then depart.\"\r\n(Different narrators mentioned that) `Aisha رضی اللہ عنہا said, \"We set out with Allah''s Apostle (from Medina) with the intention of performing Hajj only. When we reached Mecca, he ordered us to finish the Ihram. When it was the night of Nafr (departure), Safiya bint Huyay got her menses. The Prophet (ﷺ) said, \"Halqa Aqra! I think that she will detain you,\" and added, \"Did you perform the Tawaf (Al-Ifada) on the Day of Nahr (slaughtering)?\" She replied, \"Yes.\" He said, \"Then depart.\" I said, \"O Allah''s Apostle! I have not (done the Umra).\" He replied, \"Perform `Umra from Tan`im.\" My brother went with me and we came across the Prophet (ﷺ) in the last part of the night. He said, \"Wait at such and such a place.\"",
                "hadithUrdu": "مکہ سے روانگی کی رات صفیہ رضی اللہ عنہا حائضہ تھیں ، انہوں نے کہا کہ ایسا معلوم ہوتا ہے میں ان لوگوں کے روکنے کا باعث بن جاؤں گی ، پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا «عقرى حلقى» کیا تو نے قربانی کے دن طواف الزیارۃ کیا تھا ؟ اس نے کہا کہ جی ہاں کر لیا تھا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر چلو ۔\r\nابوعبداللہ امام بخاری نے کہا ، محمد بن سلام نے ( اپنی روایت میں ) یہ زیادتی کی ہے کہ ہم سے محاضر نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے ابراہیم نخعی نے ، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( حجۃ الوادع ) میں مدینہ سے نکلے تو ہماری زبانوں پر صر ف حج کا ذکر تھا ۔ جب ہم مکہ پہنچ گئے تو آپ صلی اللہ علیہ وسلم نے ہمیں احرام کھول دینے کا حکم دیا ( افعال عمرہ کے بعد جن کے ساتھ قربانی نہیں تھی ) روانگی کی رات صفیہ بنت حی رضی اللہ عنہا حائضہ ہو گئیں ، آنحضرت صلی اللہ علی وسلم نے اس پر فرمایا «عقرى حلقى» ایسا معلوم ہوتا کہ تم ہمیں روکنے کا باعث بنو گی ، پھر آپ صلی اللہ علیہ وسلم نے پوچھا کیا قربانی کے دن تم نے طواف الزیارۃ کر لیا تھا ؟ انہوں نے کہا کہ ہاں ، اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر چلی چلو ! ( عائشہ رضی اللہ عنہا نے اپنے متعلق کہا کہ ) میں نے کہا کہ یا رسول اللہ ! میں نے احرام نہیں کھولا ہے آپ نے فرمایا کہ تم تنعیم سے عمرہ کا احرام باندھ لو ( اور عمرہ کر لو ) چنانچہ عائشہ رضی اللہ عنہا کے ساتھ ان کے بھائی گئے ( عائشہ رضی اللہ عنہا نے ) فرمایا کہ ہم رات کے آخر میں واپس لوٹ رہے تھے کہ آپ صلی اللہ علیہ وسلم سے ملاقات ہوئی ، آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ ہم تمہار انتظار فلاں جگہ کریں گے ۔",
                "urduNarrator": "ہم سے عمرو بن حفص نے بیان کیا ، کہا کہ ہم سے ہمارے والد نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے ابراہیم نخعی نے بیان کیا ، ان سے اسود نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي إِبْرَاهِيمُ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ حَاضَتْ صَفِيَّةُ لَيْلَةَ النَّفْرِ، فَقَالَتْ مَا أُرَانِي إِلاَّ حَابِسَتَكُمْ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عَقْرَى حَلْقَى أَطَافَتْ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قِيلَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَانْفِرِي ‏\"‏‏. قَالَ أَبُو عَبْدِ اللَّهِ وَزَادَنِي مُحَمَّدٌ حَدَّثَنَا مُحَاضِرٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ نَذْكُرُ إِلاَّ الْحَجَّ، فَلَمَّا قَدِمْنَا أَمَرَنَا أَنْ نَحِلَّ، فَلَمَّا كَانَتْ لَيْلَةُ النَّفْرِ حَاضَتْ صَفِيَّةُ بِنْتُ حُيَىٍّ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ حَلْقَى عَقْرَى، مَا أُرَاهَا إِلاَّ حَابِسَتَكُمْ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ كُنْتِ طُفْتِ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قَالَتْ نَعَمْ‏.‏ قَالَ ‏\"‏ فَانْفِرِي ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ‏.‏ إِنِّي لَمْ أَكُنْ حَلَلْتُ‏.‏ قَالَ ‏\"‏ فَاعْتَمِرِي مِنَ التَّنْعِيمِ ‏\"‏‏.‏ فَخَرَجَ مَعَهَا أَخُوهَا، فَلَقِينَاهُ مُدَّلِجًا‏.‏ فَقَالَ ‏\"‏ مَوْعِدُكِ مَكَانَ كَذَا وَكَذَا ‏\"‏‏.‏",
                "headingArabic": "الإِدْلاَجِ مِنَ الْمُحَصَّبِ",
                "headingUrdu": "رات میں المحسب سے روانہ ہونا",
                "headingEnglish": "To depart from Al-Muhassab in the night",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1700,
                "hadithNumber": "1773",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"(The performance of) `Umra is an expiation for the sins committed (between it and the previous one). And the reward of Hajj Mabrur (the one accepted by Allah) is nothing except Paradise.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ایک عمرہ کے بعد دوسرا عمرہ دونوں کے درمیان کے گناہوں کا کفارہ ہے اور حج مبرور کی جزا جنت کے سوا اور کچھ نہیں ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ابوبکر بن عبدالرحمٰن کے غلام سمی نے خبر دی ، انہیں ابوصالح سمان نے خبر دی اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْعُمْرَةُ إِلَى الْعُمْرَةِ كَفَّارَةٌ لِمَا بَيْنَهُمَا، وَالْحَجُّ الْمَبْرُورُ لَيْسَ لَهُ جَزَاءٌ إِلاَّ الْجَنَّةُ ‏\"‏‏.‏",
                "headingArabic": "وُجُوبِ الْعُمْرَةِ وَفَضْلِهَا",
                "headingUrdu": "عمرہ اور اس کی فضیلت",
                "headingEnglish": "'Umra and its superiority",
                "chapterId": "27",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 27,
                    "chapterNumber": "27",
                    "chapterEnglish": "`Umrah (Minor pilgrimage)",
                    "chapterUrdu": "عمرہ کے مسائل کا بیان",
                    "chapterArabic": "كتاب العمرة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1701,
                "hadithNumber": "1774",
                "englishNarrator": "Narrated Ibn Juraij:",
                "hadithEnglish": "`Ikrima bin Khalid asked Ibn `Umar رضی اللہ عنہما about performing `Umra before Hajj. Ibn `Umar replied, \"There is no harm in it.\" `Ikrima said, \"Ibn `Umar رضی اللہ عنہما also said, 'The Prophet (ﷺ) had performed `Umra رضی اللہ عنہما before performing Hajj.'\" Narrated `Ikrima bin Khalid: I asked Ibn `Umar the same (as above). It is reported from Hadrat `Ikrima bin Khalid with another authority: I askek Hadrat Ibn-e-Umer رضی اللہ عنہما in the same way.",
                "hadithUrdu": "عکرمہ بن خالد نے حضرت ابن عمر رضی اللہ عنہما سے حج سے پہلے عمرہ کرنے کے بارے میں پوچھا تو انہوں نے کہا کوئی حرج نہیں ، عکرمہ نے کہا حضرت ابن عمر رضی اللہ عنہما نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم نے حج کرنے سے پہلے عمرہ ہی کیا تھا اور ابراہیم بن سعد نے محمد بن اسحاق سے بیان کیا ، ان سے عکرمہ بن خالد نے بیان کیا کہ میں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے پوچھا پھر یہی حدیث بیان کی ۔ ہم سے عمرو بن علی فلاس نے بیان کیا ، ان سے ابوعاصم نے بیان کیا ، انہیں ابن جریج نے خبر دی ، ان سے عکرمہ بن خالد نے بیان کیا کہ میں نے ابن عمر رضی اللہ عنہما سے پوچھا پھر یہی حدیث بیان کی ۔",
                "urduNarrator": "ہم سے احمد بن محمد نے بیان کیا ، انہیں عبداللہ بن مبارک نے خبر دی ، انہیں ابن جریج نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ ، أَخْبَرَنَا عَبْدُ اللَّهِ ، أَخْبَرَنَا ابْنُ جُرَيْجٍ ، أَنَّ عِكْرِمَةَ بْنَ خَالِدٍ ، سَأَلَ ابْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا عَنِ الْعُمْرَةِ قَبْلَ الْحَجِّ ، فَقَالَ : لَا بَأْسَ ، قَالَ عِكْرِمَةُ , قَالَ ابْنُ عُمَرَ اعْتَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ أَنْ يَحُجَّ , وَقَالَ إِبْرَاهِيمُ بْنُ سَعْدٍ : عَنْ ابْنِ إِسْحَاقَ ، حَدَّثَنِي عِكْرِمَةُ بْنُ خَالِدٍ ، سَأَلْتُ ابْنَ عُمَرَ مِثْلَهُ ، حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ ، حَدَّثَنَا أَبُو عَاصِمٍ ، أَخْبَرَنَا ابْنُ جُرَيْجٍ ، قَالَ عِكْرِمَةُ بْنُ خَالِدٍ : سَأَلْتُ ابْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا مِثْلَهُ.",
                "headingArabic": "مَنِ اعْتَمَرَ قَبْلَ الْحَجِّ",
                "headingUrdu": "حج سے پہلے عمرہ",
                "headingEnglish": "'Umra before Hajj",
                "chapterId": "27",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 27,
                    "chapterNumber": "27",
                    "chapterEnglish": "`Umrah (Minor pilgrimage)",
                    "chapterUrdu": "عمرہ کے مسائل کا بیان",
                    "chapterArabic": "كتاب العمرة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1676,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=67",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=65",
                "label": "65",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=66",
                "label": "66",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=67",
                "label": "67",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=68",
                "label": "68",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=69",
                "label": "69",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=70",
                "label": "70",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=71",
                "label": "71",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=69",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=69",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=67",
        "to": 1700,
        "total": 40465
    }
}