{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 130,
        "data": [
            {
                "id": 3228,
                "hadithNumber": "3378",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) landed at Al-Hijr during the Ghazwa of Tabuk, he ordered his companions not to drink water from its well or reserve water from it. They said, \"We have already kneaded the dough with its water. and also filled our bags with its water.'' On that, the Prophet (ﷺ) ordered them to throw away the dough and pour out the water. And Abu Dharr رضی اللہ عنہ has reported from the prophet (ﷺ): Whoever has kneaded the flour with this water.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے جب حجر ( ثمود کی بستی ) میں غزوہ تبوک کے لئے جاتے ہوئے پڑاو کیا تو آپ نے صحابہ رضی اللہ عنہم کو حکم فرمایا کہ یہاں کے کنوؤں کا پانی نہ پینا اور نہ اپنے برتنوں میں ساتھ لینا ۔ صحابہ رضوان اللہ علیہم اجمعین نے عرض کیا کہ ہم نے تو اس سے اپنا آٹا بھی گوندھ لیا ہے اور پانی اپنے برتنوں میں بھی رکھ لیا ہے ۔ حضور صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ گندھا ہوا آٹا پھینک دیا جائے اور ابوذر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے نقل کیا ہے کہ جس نے آٹا اس پانی سے گوندھ لیا ہو ( وہ اسے پھینک دے ) ۔",
                "urduNarrator": "ہم سے محمد بن مسکین ابوالحسن نے بیان کیا ‘ انہوں نے کہا ہم سے یحییٰ بن حسان بن حیان ابو زکریا نے بیان کیا ‘ انہوں نے کہا ہم سے سلیمان نے بیان کیا ‘ ان سے عبداللہ بن دینار نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِسْكِينٍ أَبُو الْحَسَنِ، حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ بْنِ حَيَّانَ أَبُو زَكَرِيَّاءَ، حَدَّثَنَا سُلَيْمَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا نَزَلَ الْحِجْرَ فِي غَزْوَةِ تَبُوكَ أَمَرَهُمْ أَنْ لاَ يَشْرَبُوا مِنْ بِئْرِهَا، وَلاَ يَسْتَقُوا مِنْهَا فَقَالُوا قَدْ عَجَنَّا مِنْهَا، وَاسْتَقَيْنَا‏.‏ فَأَمَرَهُمْ أَنْ يَطْرَحُوا ذَلِكَ الْعَجِينَ وَيُهَرِيقُوا ذَلِكَ الْمَاءَ‏.‏ وَيُرْوَى عَنْ سَبْرَةَ بْنِ مَعْبَدٍ وَأَبِي الشُّمُوسِ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ بِإِلْقَاءِ الطَّعَامِ‏.‏ وَقَالَ أَبُو ذَرٍّ عَنِ النَّبِيَّ صلى الله عليه وسلم ‏ \"‏ مَنِ اعْتَجَنَ بِمَائِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3229,
                "hadithNumber": "3379",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The people landed at the land of Thamud called Al-Hijr along with Allah's Messenger (ﷺ) and they took water from its well for drinking and kneading the dough with it as well. (When Allah's Messenger (ﷺ) heard about it) he ordered them to pour out the water they had taken from its wells and feed the camels with the dough, and ordered them to take water from the well whence the she-camel (of Prophet Salih) used to drink.",
                "hadithUrdu": "صحابہ نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ ثمود کی بستی حجر میں پڑاؤ کیا تو وہاں کے کنوؤں کا پانی اپنے برتنوں میں بھر لیا اور آٹا بھی اس پانی سے گوندھ لیا ۔ لیکن حضور صلی اللہ علیہ وسلم نے انہیں حکم دیا کہ جو پانی انہوں نے اپنے برتنوں میں بھر لیا ہے اسے انڈیل دیں اور گندھا ہوا آٹا جانوروں کو کھلا دیں ۔ اس کے بجائے حضور صلی اللہ علیہ وسلم نے انہیں یہ حکم دیا کہ اس کنویں سے پانی لیں جس سے صالح علیہ السلام کی اونٹنی پانی پیا کرتی تھی ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا‘انہوں نے کہا ہم سے انس بن عیاض نے بیان کیا ‘ ان سے عبیداللہ نے ‘ ان سے نافع نے اور اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ النَّاسَ نَزَلُوا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم أَرْضَ ثَمُودَ الْحِجْرَ، فَاسْتَقَوْا مِنْ بِئْرِهَا، وَاعْتَجَنُوا بِهِ، فَأَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُهَرِيقُوا مَا اسْتَقَوْا مِنْ بِئْرِهَا، وَأَنْ يَعْلِفُوا الإِبِلَ الْعَجِينَ، وَأَمَرَهُمْ أَنْ يَسْتَقُوا مِنَ الْبِئْرِ الَّتِي كَانَ تَرِدُهَا النَّاقَةُ‏.‏ تَابَعَهُ أُسَامَةُ عَنْ نَافِعٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3230,
                "hadithNumber": "3380",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہ :",
                "hadithEnglish": "When the Prophet (ﷺ) passed by (a place called) Al Hijr, he said, \"Do not enter the house of those who were unjust to themselves, unless (you enter) weeping, lest you should suffer the same punishment as was inflicted upon them.\" After that he covered his face with his sheet cloth while he was on the camel-saddle.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب مقام حجر سے گزرے تو فرمایا کہ ان لوگوں کی بستی میں جنہوں نے ظلم کیا تھا نہ داخل ہو ‘ لیکن اس صورت میں کہ تم روتے ہوئے ہو ۔ کہیں ایسا نہ ہو کہ تم پر وہی عذاب آ جائے جو ان پر آیا تھا ۔ پھر آپ نے اپنی چادر چہرہ مبارک پر ڈال لی ۔ آپ اس وقت کجاوے پر تشریف رکھتے تھے ۔",
                "urduNarrator": "ہم سے محمد نے بیان کیا ‘ کہا ہم کو عبداللہ نے خبر دی ‘ انہیں معمر نے ‘ ان سے زہری نے بیان کیا ‘ کہا مجھ کو سالم بن عبداللہ نے خبر دی اور انہیں ان کے والد ( عبداللہ رضی اللہ عنہ ) نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِيهِ ـ رضى الله عنهم أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمَّا مَرَّ بِالْحِجْرِ قَالَ ‏ \"‏ لاَ تَدْخُلُوا مَسَاكِنَ الَّذِينَ ظَلَمُوا إِلاَّ أَنْ تَكُونُوا بَاكِينَ، أَنْ يُصِيبَكُمْ مَا أَصَابَهُمْ ‏\"‏‏.‏ ثُمَّ تَقَنَّعَ بِرِدَائِهِ، وَهْوَ عَلَى الرَّحْلِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3231,
                "hadithNumber": "3381",
                "englishNarrator": "Narrated Ibn `Umar:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Do not enter the ruined dwellings of those who were unjust to themselves unless (you enter) weeping, lest you should suffer the same punishment as was inflicted upon them.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب تمہیں ان لوگوں کی بستی سے گزرنا پڑے جنہوں نے اپنی جانوں پر ظلم کیا تھا تو روتے ہوئے گزرو ۔ کہیں تمہیں بھی وہ عذاب آ نہ پکڑے جس میں یہ ظالم لوگ گرفتار کئے گئے تھے ۔",
                "urduNarrator": "مجھ سے عبداللہ نے بیان کیا ‘ کہا ہم سے وہب نے بیان کیا ‘ ان سے ان کے والد نے بیان کیا ‘ انہوں نے یونس سے سنا ‘ انہوں نے زہری سے ‘ انہوں نے سالم سے اور ان سے حضرت ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ، حَدَّثَنَا وَهْبٌ، حَدَّثَنَا أَبِي، سَمِعْتُ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، أَنَّ ابْنَ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَدْخُلُوا مَسَاكِنَ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ إِلاَّ أَنْ تَكُونُوا بَاكِينَ، أَنْ يُصِيبَكُمْ مِثْلُ مَا أَصَابَهُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3232,
                "hadithNumber": "3382",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The honorable is the son of the honorable, the son the honorable, i.e. Joseph, the son of Jacob, the son of Isaac, the son of Abraham.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ شریف بن شریف بن شریف بن شریف ‘ یوسف بن یعقوب بن اسحاق بن ابراہیم علیہ السلام تھے ۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا ‘ کہا ہم کو عبدالصمد نے خبر دی ‘ کہا ہم سے عبدالرحمٰن بن عبداللہ نے بیان کیا ‘ ان سے ان کے والد نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ الْكَرِيمُ ابْنُ الْكَرِيمِ ابْنِ الْكَرِيمِ ابْنِ الْكَرِيمِ يُوسُفُ ابْنُ يَعْقُوبَ بْنِ إِسْحَاقَ بْنِ إِبْرَاهِيمَ ـ عَلَيْهِمُ السَّلاَمُ ‏\"‏‏.‏",
                "headingArabic": "{أَمْ كُنْتُمْ شُهَدَاءَ إِذْ حَضَرَ يَعْقُوبَ الْمَوْتُ}",
                "headingUrdu": "یا جب موت یعقوب (علیہ السلام) کے قریب آئی تو تم گواہ تھے؟",
                "headingEnglish": "\"Or were you witnesses when death approached Ya`qub (Jacob)?\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3233,
                "hadithNumber": "3383",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) was asked, \"Who is the most honorable amongst the people?\" He replied, \"The most Allah fearing.\" The people said, \"We do not want to ask you about this.\" He said, \"The most honorable person is Joseph, Allah's Prophet, the son of Allah's Prophet, the son of Allah's Prophet, the son of Allah's Khalil\" The people said, 'We do not want to ask you about this.\" He said,\" Then you want to ask me about the origins of the Arabs? People are of various origins. The best in the prelslamic period are the best in Islam, provided they comprehend (the religious knowledge).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سے پوچھا گیا کہ سب سے زیادہ شریف آدمی کون ہے ؟ آپ نے فرمایا ‘ جو اللہ کا خوف زیادہ رکھتا ہو ‘ صحابہ نے عرض کیا کہ ہمارے سوال کا مقصد یہ نہیں ہے ۔ آپ نے فرمایا کہ پھر سب سے زیادہ شریف اللہ کے نبی یوسف بن نبی اللہ بن بنی اللہ بن خلیل اللہ ہیں ۔ صحابہ نے عرض کیا کہ ہمارے سوال کا مقصد یہ بھی نہیں ہے ۔ آپ نے فرمایا تم لوگ عرب کے خانوادوں کے بارے میں پوچھنا چاہتے ہو ۔ دیکھو ! لوگوں کی مثال کانوں کی سی ہے ( کسی کان میں سے اچھا مال نکلتا ہے کسی میں سے برا ) جو لوگ تم میں سے زمانہ جاہلیت میں شریف اور بہتر اخلاق کے تھے وہی اسلام کے بعد بھی اچھے اور شریف ہیں بشرطیکہ وہ دین کی سمجھ حاصل کریں ۔",
                "urduNarrator": "مجھ سے عبیدبن اسماعیل نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ ان سے عبیداللہ نے بیان کیا ‘ انہیں سعید بن ابی سعید نے خبر دی اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ بْنُ إِسْمَاعِيلَ، عَنْ أَبِي أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَنْ أَكْرَمُ النَّاسِ قَالَ ‏\"‏ أَتْقَاهُمْ لِلَّهِ ‏\"‏‏.‏ قَالُوا لَيْسَ عَنْ هَذَا نَسْأَلُكَ‏.‏ قَالَ ‏\"‏ فَأَكْرَمُ النَّاسِ يُوسُفُ نَبِيُّ اللَّهِ ابْنُ نَبِيِّ اللَّهِ ابْنِ نَبِيِّ اللَّهِ ابْنِ خَلِيلِ اللَّهِ ‏\"‏‏.‏ قَالُوا لَيْسَ عَنْ هَذَا نَسْأَلُكَ‏.‏ قَالَ ‏\"‏ فَعَنْ مَعَادِنِ الْعَرَبِ تَسْأَلُونِي، النَّاسُ مَعَادِنُ خِيَارُهُمْ فِي الْجَاهِلِيَّةِ خِيَارُهُمْ فِي الإِسْلاَمِ إِذَا فَقِهُوا ‏\"‏‏.‏ حَدَّثَنِي مُحَمَّدُ بْنُ سَلَامٍ أَخْبَرَنَا عَبْدَةُ عَنْ عُبَيْدِ اللَّهِ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {لَقَدْ كَانَ فِي يُوسُفَ وَإِخْوَتِهِ آيَاتٌ لِلسَّائِلِينَ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’یقینا یوسف اور ان کے بھائیوں میں آیات تھیں۔‘‘",
                "headingEnglish": "The Statement of Allah Taa'la: \"Verily, in Yusuf and his brethren there were Ayat...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3234,
                "hadithNumber": "3384",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "That the Prophet (ﷺ) said (to her). \"Order Abu Bakr to lead the people in prayer.\" She replied,\" Abu Bakr is a soft-hearted person and when he stands at your place, he will weep (so he will not be able to lead the prayer).\" The Prophet (ﷺ) repeated the same order and she gave the same reply. The narrator, Shuba said that the Prophet (ﷺ) said on the third or fourth time. \"You are (like) the female companions of Joseph. Order Abu Bakr رضی اللہ عنہ to lead the prayer. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ( مرض الموت میں ) ان سے فرمایا ‘ ابوبکر سے کہو کہ لوگوں کو نماز پڑھائیں ‘ عائشہ رضی اللہ عنہا نے عرض کیا کہ وہ بہت نرم دل ہیں ‘ آپ کی جگہ جب کھڑے ہوں گے تو ان پر رقت طاری ہو جائے گی ۔ حضور صلی اللہ علیہ وسلم نے انہیں دوبارہ یہی حکم دیا ۔ لیکن انہوں نے بھی دوبارہ یہی عذر بیان کیا ‘ شعبہ نے بیان کیا کہ حضور صلی اللہ علیہ وسلم نے تیسری یا چوتھی مرتبہ فرمایا کہ تم تو یوسف علیہ السلام کی ساتھ والیاں ہو ۔ ( ظاہر میں کچھ باطن میں کچھ ) ابوبکر رضی اللہ عنہ سے کہو نماز پڑھائیں ۔",
                "urduNarrator": "ہم سے بدل بن محبر نے بیان کیا ‘ کہا ہم کو شعبہ نے خبر دی ‘ ان سے سعد بن ابراہیم نے بیان کیا ‘ انہوں نے عروہ بن زبیر سے سنا اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے کہ",
                "hadithArabic": "حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ، أَخْبَرَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ سَمِعْتُ عُرْوَةَ بْنَ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهَا ‏\"‏ مُرِي أَبَا بَكْرٍ يُصَلِّي بِالنَّاسِ ‏\"‏‏.‏ قَالَتْ إِنَّهُ رَجُلٌ أَسِيفٌ، مَتَى يَقُمْ مَقَامَكَ رَقَّ‏.‏ فَعَادَ فَعَادَتْ، قَالَ شُعْبَةُ فَقَالَ فِي الثَّالِثَةِ أَوِ الرَّابِعَةِ ‏\"‏ إِنَّكُنَّ صَوَاحِبُ يُوسُفَ، مُرُوا أَبَا بَكْرٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3235,
                "hadithNumber": "3385",
                "englishNarrator": "Narrated Abu Musa:",
                "hadithEnglish": "When the Prophet (ﷺ) fell ill, he said, \"Order Abu Bakr to lead the people in prayer.\" `Aisha رضی اللہ عنہا said, \"Abu Bakr رضی اللہ عنہ is a soft-hearted person. The Prophet (ﷺ) gave the same order again and she again gave the same reply. He again said, \"Order Abu Bakr (to lead the prayer)! You are (like) the female companions of Joseph.\" Consequently Abu Bakr led the people in prayer in the life-time of the Prophet. In Zaidah's narration, there has come \"رَجُلٌ رَقِيقٌ‏\" (a soft hearted man).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب بیمار پڑے تو آپ نے فرمایا کہ ابوبکر سے کہو کہ لوگوں کو نماز پڑھائیں ۔ عائشہ رضی اللہ عنہا نے عرض کیا کہ ابوبکر رضی اللہ عنہ نہایت نرم دل انسان ہیں لیکن حضور صلی اللہ علیہ وسلم نے دوبارہ یہی حکم فرمایا اور انہوں نے بھی وہی عذر دہرایا ۔ آخر حضور صلی اللہ علیہ وسلم نے فرمایا کہ ان سے کہو نماز پڑھائیں ۔ تم تو یوسف کی سا تھ والیاں ہو ۔ ظاہر کچھ باطن کچھ ) چنانچہ ابوبکر رضی اللہ عنہ نے حضور صلی اللہ علیہ وسلم کی زندگی میں امامت کی اور حسین بن علی جعفی نے زائدہ سے رجل رقیق کے الفاظ نقل کئے کہ ابوبکر نرم دل آدمی ہیں ۔",
                "urduNarrator": "ہم سے ربیع بن یحییٰ بصریٰ نے بیان کیا ‘ کہا ہم سے زائدہ نے بیان کیا ‘ ان سے عبدالملک بن عمیر نے ‘ ان سے ابوبردہ بن ابی موسیٰ نے اور ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الرَّبِيعُ بْنُ يَحْيَى الْبَصْرِيُّ، حَدَّثَنَا زَائِدَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى، عَنْ أَبِيهِ، قَالَ مَرِضَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ‏\"‏‏.‏ فَقَالَتْ إِنَّ أَبَا بَكْرٍ رَجُلٌ‏.‏ فَقَالَ مِثْلَهُ فَقَالَتْ مِثْلَهُ‏.‏ فَقَالَ ‏\"‏ مُرُوهُ فَإِنَّكُنَّ صَوَاحِبُ يُوسُفَ ‏\"‏‏.‏ فَأَمَّ أَبُو بَكْرٍ فِي حَيَاةِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَقَالَ حُسَيْنٌ عَنْ زَائِدَةَ رَجُلٌ رَقِيقٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3236,
                "hadithNumber": "3386",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"O Allah! Save `Aiyyash bin Abi Rabi`a (from the unjust treatment of the infidels). O Allah! Save Salama bin Hisham. O Allah! Send your Punishment on (the tribe of) Mudar. O Allah! Let them suffer from years (of drought) similar to that inflicted during the life-time of Joseph.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے دعا فرمائی ‘ اے اللہ ! عیاش بن ابی ربیعہ کو نجات دے ‘ اے اللہ ! سلمہ بن ہشام کو نجات دے ‘ اے اللہ ! ولید بن ولید کو نجات دے ‘ اے اللہ تمام ضعیف اور کمزور مسلمانوں کو نجات دے ۔ اے اللہ ! قبیلہ مضر کو سخت گرفت میں پکڑ لے ۔ اے اللہ ! یوسف علیہ السلام کے زمانے کی سی قحط سالی ان ( ظالموں ) پر نازل فرما ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا‘انہوں نے کہا ہم کو شعیب نے خبر دی ‘ انہوں نے کہا ہم سے ابوالزناد نے بیان کیا ‘ ان سے اعرج نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اللَّهُمَّ أَنْجِ عَيَّاشَ بْنَ أَبِي رَبِيعَةَ، اللَّهُمَّ أَنْجِ سَلَمَةَ بْنَ هِشَامٍ، اللَّهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ اللَّهُمَّ أَنْجِ الْمُسْتَضْعَفِينَ مِنَ الْمُؤْمِنِينَ، اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ، اللَّهُمَّ اجْعَلْهَا سِنِينَ كَسِنِي يُوسُفَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3237,
                "hadithNumber": "3387",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"May Allah bestow His Mercy on Lot. He wanted to have a powerful support. If I were to stay in prison (for a period equal to) the stay of Joseph (prison) and then the offer of freedom came to me, then I would have accepted it.\" (See Hadith No. 591)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ اللہ تعالیٰ لوط علیہ السلام پر رحم فرمائے کہ وہ زبردست رکن ( یعنی خداوند کریم ) کی پناہ لیتے تھے اور اگر میں اتنی مدت تک قید رہتا جتنی یوسف علیہ السلام رہے تھے اور پھر میرے پاس ( بادشاہ کا آدمی ) بلانے کے لئے آتا تو میں فوراً اس کے ساتھ چلا جاتا ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد بن اسماء ابن اخی جویریہ نے بیان کیا ‘ انہوں نے کہا ہم سے جویریہ بن اسماء نے بیان کیا ‘ ان سے مالک نے بیان کیا ‘ ان سے زہری نے بیان کیا ‘ ان کو سعید بن مسیب اور ابوعبیدہ نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ ابْنِ أَخِي جُوَيْرِيَةَ حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَأَبَا، عُبَيْدٍ أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَرْحَمُ اللَّهُ لُوطًا، لَقَدْ كَانَ يَأْوِي إِلَى رُكْنٍ شَدِيدٍ، وَلَوْ لَبِثْتُ فِي السِّجْنِ مَا لَبِثَ يُوسُفُ ثُمَّ أَتَانِي الدَّاعِي لأَجَبْتُهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3238,
                "hadithNumber": "3388",
                "englishNarrator": "Narrated Masruq:",
                "hadithEnglish": "I asked Um Ruman, `Aisha's mother about the accusation forged against `Aisha رضی اللہ عنہا . She said, \"While I was sitting with `Aisha رضی اللہ عنہا , an Ansari woman came to us and said, 'Let Allah condemn such-and-such person.' I asked her, 'Why do you say so?' She replied, 'For he has spread the (slanderous) story.' `Aisha         رضی اللہ عنہا said, 'What story?' The woman then told her the story. `Aisha رضی اللہ عنہا asked, 'Have Abu Bakr رضی اللہ عنہ and Allah's Messenger (ﷺ) heard about it ?' She said, 'Yes.' `Aisha رضی اللہ عنہا fell down senseless (on hearing that), and when she came to her senses, she got fever and shaking of the body. The Prophet (ﷺ) came and asked, 'What is wrong with her?' I said, 'She has got fever because of a story which has been rumored.' `Aisha رضی اللہ عنہ got up and said, 'By Allah! Even if I took an oath, you would not believe me, and if I put forward an excuse, You would not excuse me. My example and your example is just like that example of Jacob and his sons. Against that which you assert, it is Allah (Alone) Whose Help can be sought.' (12.18) The Prophet (ﷺ) left and then Allah revealed the Verses (concerning the matter), and on that `Aisha رضی اللہ عنہ said, 'Thanks to Allah (only) and not to anybody else.\"",
                "hadithUrdu": "میں نے عائشہ رضی اللہ عنہا کی والدہ ام رومان رضی اللہ عنہا سے عائشہ رضی اللہ عنہا کے بارے میں جو بہتان تراشا گیا تھا اس کے متعلق پوچھا تو انہوں نے کہا کہ عائشہ رضی اللہ عنہا کے ساتھ بیٹھی ہوئی تھی کہ ایک انصاریہ عورت ہمارے یہاں آئی اور کہا کہ اللہ فلاں ( مسطح بن اثاثہ ) کو تباہ کر دے اور وہ اسے تباہ کر بھی چکا انہوں نے بیان کیا کہ میں نے کہا آپ یہ کیا کہہ رہی ہیں انہوں نے بتایا کہ اسی نے تو یہ جھوٹ مشہور کیا ہے ۔ پھر انصاریہ عورت نے ( حضرت عائشہ رضی اللہ عنہا پر تہمت کا سارا ) واقعہ بیان کیا ‘ حضرت عائشہ رضی اللہ عنہا نے ( اپنی والدہ سے ) پوچھا کہ کون سا واقعہ ؟ تو ان کی والدہ نے انہیں واقعہ کی تفصیل بتائی ۔ عائشہ نے پوچھا کہ کیا یہ قصہ ابوبکر رضی اللہ عنہ اور رسول اللہ صلی اللہ علیہ وسلم کو بھی معلوم ہو گیا ہے ؟ ان کی والدہ نے بتایا کہ ہاں ۔ یہ سنتے ہی حضرت عائشہ رضی اللہ عنہا بیہوش ہو کر گر پڑیں اور جب ہوش آیا تو جاڑے کے ساتھ بخار چڑھا ہوا تھا ۔ پھر نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور دریافت فرمایا کہ انہیں کیا ہوا ؟ میں نے کہا کہ ایک بات ان سے ایسی کہی گئی تھی اور اسی کے صدمے سے ان کو بخار آ گیا ہے ۔ پھر حضرت عائشہ رضی اللہ عنہا اٹھ کر بیٹھ گئیں اور کہا اللہ کی قسم ! اگر میں قسم کھاؤں جب بھی آپ لوگ میری بات نہیں مان سکتے اور اگر کوئی عذر بیان کروں تو اسے بھی تسلیم نہیں کر سکتے ۔ بس میری اور آپ لوگوں کی مثال یعقوب علیہ السلام اور ان کے بیٹوں کی سی ہے ( کہ انہوں نے اپنے بیٹوں کی من گھڑت کہانی سن کر فرمایا تھا کہ ) ” جو کچھ تم کہہ رہے ہو میں اس پر اللہ ہی کی مدد چاہتا ہوں ۔ “ اس کے بعد آنحضرت صلی اللہ علیہ وسلم واپس تشریف لے گئے اور اللہ تعالیٰ کو جو کچھ منظور تھا وہ نازل فرمایا ۔ جب آنحضرت صلی اللہ علیہ وسلم نے اس کی خبر عائشہ رضی اللہ عنہا کو دی تو انہوں نے کہا کہ اس کے لئے میں صرف اللہ کا شکر ادا کرتی ہوں کسی اور کا نہیں ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ‘ کہا ہم کو محمد بن فضیل نے خبر دی ‘ کہا ہم سے حصین نے بیان کیا ‘ ان سے سفیان نے ‘ ان سے مسروق نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا حُصَيْنٌ، عَنْ شَقِيقٍ، عَنْ مَسْرُوقٍ، قَالَ سَأَلْتُ أُمَّ رُومَانَ، وَهْىَ أُمُّ عَائِشَةَ، عَمَّا قِيلَ فِيهَا مَا قِيلَ قَالَتْ بَيْنَمَا أَنَا مَعَ عَائِشَةَ جَالِسَتَانِ، إِذْ وَلَجَتْ عَلَيْنَا امْرَأَةٌ مِنَ الأَنْصَارِ، وَهْىَ تَقُولُ فَعَلَ اللَّهُ بِفُلاَنٍ وَفَعَلَ‏.‏ قَالَتْ فَقُلْتُ لِمَ قَالَتْ إِنَّهُ نَمَا ذِكْرَ الْحَدِيثِ‏.‏ فَقَالَتْ عَائِشَةُ أَىُّ حَدِيثٍ فَأَخْبَرَتْهَا‏.‏ قَالَتْ فَسَمِعَهُ أَبُو بَكْرٍ وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ نَعَمْ‏.‏ فَخَرَّتْ مَغْشِيًّا عَلَيْهَا، فَمَا أَفَاقَتْ إِلاَّ وَعَلَيْهَا حُمَّى بِنَافِضٍ، فَجَاءَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ مَا لِهَذِهِ ‏\"‏‏.‏ قُلْتُ حُمَّى أَخَذَتْهَا مِنْ أَجْلِ حَدِيثٍ تُحُدِّثَ بِهِ، فَقَعَدَتْ فَقَالَتْ وَاللَّهِ لَئِنْ حَلَفْتُ لاَ تُصَدِّقُونِي، وَلَئِنِ اعْتَذَرْتُ لاَ تَعْذِرُونِي، فَمَثَلِي وَمَثَلُكُمْ كَمَثَلِ يَعْقُوبَ وَبَنِيهِ، فَاللَّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ‏.‏ فَانْصَرَفَ النَّبِيُّ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ مَا أَنْزَلَ، فَأَخْبَرَهَا فَقَالَتْ بِحَمْدِ اللَّهِ لاَ بِحَمْدِ أَحَدٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3239,
                "hadithNumber": "3389",
                "englishNarrator": "Narrated `Urwa:",
                "hadithEnglish": "I asked `Aisha رضی اللہ عنہا the wife of the Prophet (ﷺ) about the meaning of the following Verse: -- \"(Respite will be granted) 'Until when the apostles give up hope (of their people) and thought that they were denied (by their people)...............\"(12.110) `Aisha رضی اللہ عنہا replied, \"Really, their nations did not believe them.\" I said, \"By Allah! They were definite that their nations treated them as liars and it was not a matter of suspecting.\" `Aisha رضی اللہ عنہا said, \"O 'Uraiya (i.e. `Urwa)! No doubt, they were quite sure about it.\" I said, \"May the Verse be read in such a way as to mean that the apostles thought that Allah did not help them?\" Aisha رضی اللہ عنہا said, \"Allah forbid! (Impossible) The Apostles did not suspect their Lord of such a thing. But this Verse is concerned with the Apostles' followers who had faith in their Lord and believed in their apostles and their period of trials was long and Allah's Help was delayed till the apostles gave up hope for the conversion of the disbelievers amongst their nation and suspected that even their followers were shaken in their belief, Allah's Help then came to them.\" Imam Abdullah Bukhari says: \"اسْتَيْأَسُوا‏\" , \"يَئِسْتُ‏\" is from the head \"‏ افْتَعَلُو\" .  \"مِنْهُ\" i.e. they became disappointed from Hadrat Yousuf (Joseph) ‏لاَ تَيْأَسُوا مِنْ رَوْحِ اللَّهِ‏\"  .علیہ السلام. \" means \" hope\".",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا سے آیت کے متعلق پوچھاحتیٰ اذا استیئس الرسل وظنوا انھم قد کذبوا ( تشدید کے ساتھ ) ہے یا کذبوا ( بغیر تشدید کے ) یعنی یہاں تک کہ جب انبیاء ناامید ہو گئے اور انہیں خیال گزرنے لگا کہ انہیں جھٹلا دیا گیا تو اللہ کی مدد پہنچی تو انہوں نے کہا کہ ( یہ تشدید کے ساتھ ہے اور مطلب یہ ہے کہ ) ان کی قوم نے انہیں جھٹلایا تھا ۔ میں نے عرض کیا کہ پھر معنی کیسے بنیں گے ‘ پیغمبروں کو یقین تھا ہی کہ ان کی قوم انہیں جھٹلا رہی ہے ۔ پھر قرآن میں لفظ ظن گمان اور خیال کے معنی میں استعمال کیوں کیا گیا ؟ عائشہ رضی اللہ عنہا نے کہا اے چھوٹے سے عروہ ! بیشک ان کو تو یقین تھا میں نے کہا تو شاید اس آیت میں بغیر تشدید کے کذبوا ہو گا یعنی پیغمبر یہ سمجھے کہ اللہ نے جو ان کی مدد کا وعدہ کیا تھا وہ غلط تھا ۔ عائشہ رضی اللہ عنہا نے فرمایا معاذاللہ ! انبیاء اپنے رب کے ساتھ بھلا ایسا گمان کر سکتے ہیں ۔ عائشہ رضی اللہ عنہا نے کہا مراد یہ ہے کہ پیغمبروں کے تابعدار لوگ جو اپنے مالک پر ایمان لائے تھے اور پیغمبروں کی تصدیق کی تھی ان پر جب مدت تک خدا کی آزمائش رہی اور مدد آنے میں دیر ہوئی اور پیغمبر لوگ اپنی قوم کے جھٹلانے والوں سے ناامید ہو گئے ( سمجھے کہ اب وہ ایمان نہیں لائیں گے ) اور انہوں نے یہ گمان کیا کہ جو لوگ ان کے تابعدار بنے ہیں وہ بھی ان کو جھوٹا سمجھنے لگیں گے ‘ اس وقت اللہ کی مدد آن پہنچی ۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا کہ استیاسوا ‘ افتعلوا کے وزن پر ہے جو یئستمنہ سے نکلا ہے ‘ ای من یوسف ( سورۃ یوسف کی آیت کا ایک جملہ ہے یعنی زلیخا یوسف علیہ السلام سے ناامید ہو گئی » لا تایئسوا من رّوح اللّٰہ « ( یوسف : 87 ) یعنی اللہ سے امید رکھو ناامید نہ ہو ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث نے بیان کیا ‘ ان سے عقیل نے ‘ ان سے ابن شہاب نے ‘ کہا کہ مجھے عروہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَرَأَيْتِ قَوْلَهُ ‏{‏حَتَّى إِذَا اسْتَيْأَسَ الرُّسُلُ وَظَنُّوا أَنَّهُمْ قَدْ كُذِّبُوا‏}‏ أَوْ كُذِبُوا‏.‏ قَالَتْ بَلْ كَذَّبَهُمْ قَوْمُهُمْ‏.‏ فَقُلْتُ وَاللَّهِ لَقَدِ اسْتَيْقَنُوا أَنَّ قَوْمَهُمْ كَذَّبُوهُمْ وَمَا هُوَ بِالظَّنِّ‏.‏ فَقَالَتْ يَا عُرَيَّةُ، لَقَدِ اسْتَيْقَنُوا بِذَلِكَ‏.‏ قُلْتُ فَلَعَلَّهَا أَوْ كُذِبُوا‏.‏ قَالَتْ مَعَاذَ اللَّهِ، لَمْ تَكُنِ الرُّسُلُ تَظُنُّ ذَلِكَ بِرَبِّهَا وَأَمَّا هَذِهِ الآيَةُ قَالَتْ هُمْ أَتْبَاعُ الرُّسُلِ الَّذِينَ آمَنُوا بِرَبِّهِمْ وَصَدَّقُوهُمْ، وَطَالَ عَلَيْهِمُ الْبَلاَءُ، وَاسْتَأْخَرَ عَنْهُمُ النَّصْرُ حَتَّى إِذَا اسْتَيْأَسَتْ مِمَّنْ كَذَّبَهُمْ مِنْ قَوْمِهِمْ، وَظَنُّوا أَنَّ أَتْبَاعَهُمْ كَذَّبُوهُمْ جَاءَهُمْ نَصْرُ اللَّهِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ ‏{‏اسْتَيْأَسُوا‏}‏ افْتَعَلُوا مِنْ يَئِسْتُ‏.‏ ‏{‏مِنْهُ‏}‏ مِنْ يُوسُفَ‏.‏ ‏{‏لاَ تَيْأَسُوا مِنْ رَوْحِ اللَّهِ‏}‏ مَعْنَاهُ الرَّجَاءُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3240,
                "hadithNumber": "3390",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The honorable, the son of the honorable, the son of the honorable, (was) Joseph  علیہم السلام, the son of Jacob! the son of Isaac, the son of Abraham.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ شریف بن شریف بن شریف بن شریف یوسف بن یعقوب بن اسحاق بن ابراہیم علیہم السلام ہیں ۔",
                "urduNarrator": "مجھے عبدہ بن عبداللہ نے خبر دی ‘ انہوں نے کہا ہم سے عبدالصمد نے بیان کیا ۔ ان سے عبدالرحمٰن نے بیان کیا ‘ ان سے ان کے والد عبداللہ بن دینار نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "أَخْبَرَنِي عَبْدَةُ، حَدَّثَنَا عَبْدُ الصَّمَدِ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْكَرِيمُ ابْنُ الْكَرِيمِ ابْنِ الْكَرِيمِ ابْنِ الْكَرِيمِ يُوسُفُ بْنُ يَعْقُوبَ بْنِ إِسْحَاقَ بْنِ إِبْرَاهِيمَ عَلَيْهِمِ السَّلاَمُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3241,
                "hadithNumber": "3391",
                "englishNarrator": "Narrated Abu Huraira:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"While Job was naked, taking a bath, a swarm of gold locusts fell on him and he started collecting them in his garment. His Lord called him, 'O Job! Have I not made you rich enough to need what you see? He said, 'Yes, O Lord! But I cannot dispense with your Blessing.\"'",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ ایوب علیہ السلام ننگے غسل کر رہے تھے کہ سونے کی ٹڈیاں ان پر گرنے لگیں ۔ وہ ان کو اپنے کپڑے میں جمع کرنے لگے ۔ ان کے پروردگار نے ان کو پکارا کہ اے ایوب ! جو کچھ تم دیکھ رہے ہو ( سونے کی ٹڈیاں ) کیا میں نے تمہیں اس سے بےپروا نہیں کر دیا ہے ؟ انہوں نے عرض کیا کہ صحیح ہے ‘ اے رب العزت لیکن تیری برکت سے میں کس طرح بےپروا ہو سکتا ہوں ۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد جعفی نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں ہمام نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَمَا أَيُّوبُ يَغْتَسِلُ عُرْيَانًا خَرَّ عَلَيْهِ رِجْلُ جَرَادٍ مِنْ ذَهَبٍ، فَجَعَلَ يَحْثِي فِي ثَوْبِهِ، فَنَادَى رَبُّهُ يَا أَيُّوبُ، أَلَمْ أَكُنْ أَغْنَيْتُكَ عَمَّا تَرَى قَالَ بَلَى يَا رَبِّ، وَلَكِنْ لاَ غِنَى لِي عَنْ بَرَكَتِكَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَأَيُّوبَ إِذْ نَادَى رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور ایوب نے جب اپنے رب کو پکارا…‘‘",
                "headingEnglish": "The Statement of Allah Taa'la: \"And Ayyub, when he cried to his Lord...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3242,
                "hadithNumber": "3392",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) returned to Khadija رضی اللہ عنہا while his heart was beating rapidly. She took him to Waraqa bin Naufal who was a Christian convert and used to read the Gospels in Arabic Waraqa asked (the Prophet), \"What do you see?\" When he told him, Waraqa said, \"That is the same angel whom Allah sent to the Prophet) Moses. Should I live till you receive the Divine Message, I will support you strongly. \"النَّامُوسُ\" means a confidant to whom a person confides his those secrets which he does not reveal to any other.",
                "hadithUrdu": "پھر نبی کریم صلی اللہ علیہ وسلم ( غار حراء سے ) ام المؤمنین حضرت خدیجہ رضی اللہ عنہا کے پاس لوٹ آئے تو آپ کا دل دھڑک رہا تھا ۔ حضرت خدیجہ رضی اللہ عنہا آپ کو ورقہ بن نوفل کے پاس لے گئیں ، وہ نصرانی ہو گئے تھے اور انجیل کو عربی میں پڑھتے تھے ۔ ورقہ نے پوچھا کہ آپ کیا دیکھتے ہیں ؟ آپ نے انہیں بتایا تو انہوں نے کہا کہ یہی ہیں وہ ” ناموس “ جنہیں اللہ تعالیٰ نے موسیٰ علیہ السلام کے پاس بھیجا تھا اور اگر میں تمہارے زمانے تک زندہ رہا تو میں تمہاری پوری مدد کروں گا ۔ ناموس محرم راز کو کہتے ہیں جو ایسے راز سے بھی آگاہ ہو جو آدمی دوسروں سے چھپائے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے بیان کیا ‘ کہا کہ مجھ سے عقیل نے بیان کیا ‘‘ ان سے ابن شہاب نے ‘ انہوں نے عروہ بن زبیر سے سنا ‘ انہوں نے بیان کیا کہ حضرت عائشہ رضی اللہ عنہا نے کہا ‘",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، سَمِعْتُ عُرْوَةَ، قَالَ قَالَتْ عَائِشَةُ ـ رضى الله عنها فَرَجَعَ النَّبِيُّ صلى الله عليه وسلم إِلَى خَدِيجَةَ يَرْجُفُ فُؤَادُهُ، فَانْطَلَقَتْ بِهِ إِلَى وَرَقَةَ بْنِ نَوْفَلٍ، وَكَانَ رَجُلاً تَنَصَّرَ يَقْرَأُ الإِنْجِيلَ بِالْعَرَبِيَّةِ‏.‏ فَقَالَ وَرَقَةُ مَاذَا تَرَى فَأَخْبَرَهُ‏.‏ فَقَالَ وَرَقَةُ هَذَا النَّامُوسُ الَّذِي أَنْزَلَ اللَّهُ عَلَى مُوسَى، وَإِنْ أَدْرَكَنِي يَوْمُكَ أَنْصُرْكَ نَصْرًا مُؤَزَّرًا‏.‏ النَّامُوسُ صَاحِبُ السِّرِّ الَّذِي يُطْلِعُهُ بِمَا يَسْتُرُهُ عَنْ غَيْرِهِ‏.‏",
                "headingArabic": "{وَاذْكُرْ فِي الْكِتَابِ مُوسَى إِنَّهُ كَانَ مُخْلِصًا وَكَانَ رَسُولاً نَبِيًّا وَنَادَيْنَاهُ مِنْ جَانِبِ الطُّورِ الأَيْمَنِ وَقَرَّبْنَاهُ نَجِيًّا} كَلَّمَهُ",
                "headingUrdu": "اور کتاب (قرآن) میں موسیٰ (علیہ السلام) کا ذکر کرو، بیشک وہ برگزیدہ اور رسول اور نبی تھے، اور ہم نے انہیں کوہ طور کے داہنے جانب سے بلایا اور انہیں قریب کیا۔ ہم اس سے بات کرنے کے لیے۔\"",
                "headingEnglish": "\"And mention in the Book (this Qur'an) Musa (Moses). Verily, he was chosen and he was a messenger and a prophet. And We called him from the right side of the Mount, and made him to draw near to us for a talk with him.\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3243,
                "hadithNumber": "3393",
                "englishNarrator": "Narrated Malik bin Sasaa رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) talked to his companions about his Night Journey to the Heavens. When he reached the fifth Heaven, he met Aaron. (Gabriel said to the Prophet), \"This is Aaron.\" The Prophet (ﷺ) said, \"Gabriel greeted and so did I, and he returned the greeting saying, 'Welcome, O Pious Brother and Pious Prophet.\" Thabit, Abbad bin Abu Ali, Hadrat Anas reported it from the prophet (ﷺ).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ان سے اس رات کے متعلق بیان کیا جس میں آپ کو معراج ہوا کہ جب آپ پانچویں آسمان پر تشریف لے گئے تو وہاں ہارون علیہ السلام سے ملے ۔ جبرائیل علیہ السلام نے بتایا کہ یہ ہارون علیہ السلام ہیں ‘ انہیں سلام کیجئے ۔ میں نے سلام کیا تو انہوں نے جواب دیتے ہوئے فرمایا ‘ خوش آمدید ‘ صالح بھائی اور صالح نبی ۔ اس حدیث کو قتادہ کے ساتھ ثابت بنانی اور عباد بن ابی علی نے بھی انس رضی اللہ عنہ سے ‘ انہوں نے آنحضرت صلی اللہ علیہ وسلم سے روایت کیا ہے ۔",
                "urduNarrator": "ہم سے ہدبہ بن خالد نے بیان کیا ‘ کہا ہم سے ہمام نے بیان کیا ‘ ان سے قتادہ نے بیان کیا ‘ ان سے انس بن مالک رضی اللہ عنہ نے اور ان سے حضرت مالک بن صعصعہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ مَالِكِ بْنِ صَعْصَعَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَدَّثَهُمْ عَنْ لَيْلَةِ أُسْرِيَ بِهِ حَتَّى أَتَى السَّمَاءَ الْخَامِسَةَ، فَإِذَا هَارُونُ قَالَ هَذَا هَارُونُ فَسَلِّمْ عَلَيْهِ‏.‏ فَسَلَّمْتُ عَلَيْهِ، فَرَدَّ ثُمَّ قَالَ مَرْحَبًا بِالأَخِ الصَّالِحِ وَالنَّبِيِّ الصَّالِحِ‏.‏ تَابَعَهُ ثَابِتٌ وَعَبَّادُ بْنُ أَبِي عَلِيٍّ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ عَزَّ وَجَلَّ: {وَهَلْ أَتَاكَ حَدِيثُ مُوسَى إِذْ رَأَى نَارًا} إِلَى قَوْلِهِ: {بِالْوَادِي الْمُقَدَّسِ طُوًى}",
                "headingUrdu": "اللہ عزوجل کا فرمان ہے: ’’اور کیا تمہارے پاس موسیٰ کا قصہ آیا ہے؟‘‘",
                "headingEnglish": "The Statement of Allah Aza Wajal: \"And has there come to you the story of Musa...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3244,
                "hadithNumber": "3394",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"On the night of my Ascension to Heaven, I saw (the prophet) Moses who was a thin person with lank hair, looking like one of the men of the tribe of Shanua; and I saw Jesus who was of average height with red face as if he had just come out of a bathroom. And I resemble prophet Abraham more than any of his offspring does. Then I was given two cups, one containing milk and the other wine. Gabriel said, 'Drink whichever you like.' I took the milk and drank it. Gabriel said, 'You have accepted what is natural, (True Religion i.e. Islam) and if you had taken the wine, your followers would have gone astray.' \"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اس رات کی کیفیت بیان کی جس میں آپ کو معراج ہوا کہ میں نے موسیٰ علیہ السلام کو دیکھا کہ وہ ایک دبلے پتلے سیدھے بالوں والے آدمی ہیں ۔ ایسا معلوم ہوتا تھا کہ قبیلہ شنوہ میں سے ہوں اور میں نے عیسیٰ علیہ السلام کو بھی دیکھا ‘ وہ میانہ قد اور نہایت سرخ و سفید رنگ والے تھے ۔ ایسے تروتازہ اور پاک و صاف کہ معلوم ہوتا تھا کہ ابھی غسل خانہ سے نکلے ہیں اور میں ابرہیم علیہ السلام سے ان کی اولاد میں سب سے زیادہ مشابہ ہوں ۔ پھر دو برتن میرے سامنے لائے گئے ۔ ایک میں دودھ تھا اور دوسرے میں شراب تھی ۔ جبرائیل علیہ السلام نے کہا کہ دونوں چیزوں میں سے آپ کا جو جی چاہے پیجئے ‘ میں نے دودھ کا پیالہ اپنے ہاتھ میں لے لیا اور اسے پی گیا ۔ مجھ سے کہا گیا کہ آپ نے فطرت کو اختیار کیا ( دودھ آدمی کی پیدائشی غذا ہے ) اگر اس کے بجائے آپ نے شراب پی ہوتی تو آپ کی امت گمراہ ہو جاتی ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ‘ کہا ہم کو ہشام بن یوسف نے خبر دی ‘ کہا ہم کومعمر نے خبر دی ‘ انہیں زہری نے ‘ انہیں سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةَ أُسْرِيَ بِهِ ‏ \"‏ رَأَيْتُ مُوسَى وَإِذَا رَجُلٌ ضَرْبٌ رَجِلٌ، كَأَنَّهُ مِنْ رِجَالِ شَنُوءَةَ، وَرَأَيْتُ عِيسَى، فَإِذَا هُوَ رَجُلٌ رَبْعَةٌ أَحْمَرُ كَأَنَّمَا خَرَجَ مِنْ دِيمَاسٍ، وَأَنَا أَشْبَهُ وَلَدِ إِبْرَاهِيمَ صلى الله عليه وسلم بِهِ، ثُمَّ أُتِيتُ بِإِنَاءَيْنِ، فِي أَحَدِهِمَا لَبَنٌ، وَفِي الآخَرِ خَمْرٌ فَقَالَ اشْرَبْ أَيَّهُمَا شِئْتَ‏.‏ فَأَخَذْتُ اللَّبَنَ فَشَرِبْتُهُ فَقِيلَ أَخَذْتَ الْفِطْرَةَ، أَمَا إِنَّكَ لَوْ أَخَذْتَ الْخَمْرَ غَوَتْ أُمَّتُكَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَهَلْ أَتَاكَ حَدِيثُ مُوسَى}، {وَكَلَّمَ اللَّهُ مُوسَى تَكْلِيمًا}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان: ’’اور موسیٰ سے اللہ نے براہ راست بات کی۔‘‘",
                "headingEnglish": "The Statement of Allah Taa'la: \"And to Moses Allah spoke directly.\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3245,
                "hadithNumber": "3395, 3396",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"One should not say that I am better than Jonah (i.e. Yunus) bin Matta.\" So, he mentioned his father Matta. The Prophet (ﷺ) mentioned the night of his Ascension and said, \"The prophet Moses was brown, a tall person as if from the people of the tribe of Shanu'a. Jesus was a curly-haired man of moderate height.\" He also mentioned Malik, the gate-keeper of the (Hell) Fire, and Ad-Dajjal.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کسی شخص کو یوں نہ کہنا چاہئے کہ میں یونس بن متی سے بہتر ہوں ‘ حضور صلی اللہ علیہ وسلم نے ان کا نام ان کے والد کی طرف منسوب کر کے لیا ۔ اور حضور صلی اللہ علیہ وسلم نے شب معراج کا ذکر کرتے ہوئے فرمایا کہ موسیٰ علیہ السلام گندم گوں اور دراز قد تھے ۔ ایسا معلوم ہوتا تھا جیسے قبیلہ شنوہ کے کوئی صاحب ہوں اور فرمایا کہ عیسیٰ علیہ السلام گھنگریالے بال والے اور میانہ قد کے تھے اور حضور صلی اللہ علیہ وسلم نے داروغہ جہنم مالک کا بھی ذکر فرمایا اور دجال کا بھی ۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا ‘ کہا ہم سے غندر نے بیان کیا ‘ ان سے شعبہ نے بیان کیا ‘ ان سے قتادہ نے بیان کیا ‘ ان سے ابوالعالیہ نے بیان کیا اور ان سے تمہارے نبی کے چچا زاد بھائی یعنی حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَبَا الْعَالِيَةِ، حَدَّثَنَا ابْنُ عَمِّ، نَبِيِّكُمْ ـ يَعْنِي ابْنَ عَبَّاسٍ ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏‏.‏ وَنَسَبَهُ إِلَى أَبِيهِ‏.‏وَذَكَرَ النَّبِيُّ صلى الله عليه وسلم لَيْلَةَ أُسْرِيَ بِهِ فَقَالَ ‏\"‏ مُوسَى آدَمُ طُوَالٌ كَأَنَّهُ مِنْ رِجَالِ شَنُوءَةَ ‏\"‏‏.‏ وَقَالَ ‏\"‏ عِيسَى جَعْدٌ مَرْبُوعٌ ‏\"‏‏.‏ وَذَكَرَ مَالِكًا خَازِنَ النَّارِ، وَذَكَرَ الدَّجَّالَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3246,
                "hadithNumber": "3397",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When the Prophet (ﷺ) came to Medina, he found (the Jews) fasting on the day of 'Ashura' (i.e. 10th of Muharram). They used to say: \"This is a great day on which Allah saved Moses and drowned the folk of Pharaoh. Moses observed the fast on this day, as a sign of gratitude to Allah.\" The Prophet (ﷺ) said, \"I am closer to Moses than they.\" So, he observed the fast (on that day) and ordered the Muslims to fast on it.",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو وہاں کے لوگ ایک دن یعنی عاشورا کے دن روزہ رکھتے تھے ۔ ان لوگوں ( یہودیوں ) نے بتایا کہ یہ بڑی عظمت والا دن ہے ‘ اسی دن اللہ تعالیٰ نے موسیٰ علیہ السلام کو نجات دی تھی اور آل فرعون کو غرق کیا تھا ۔ اس کے شکر میں موسیٰ علیہ السلام نے اس دن کا روزہ رکھا تھا ۔ حضور صلی اللہ علیہ وسلم نے فرمایا کہ میں موسیٰ علیہ السلام کا ان سے زیادہ قریب ہوں ۔ چنانچہ آپ نے خود بھی اس دن کا روزہ رکھنا شروع کیا اور صحابہ کو بھی اس کا حکم فرمایا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ کہا ہم سے ایوب سختیانی نے بیان کیا ‘ ان سے سعید بن جبیر کے صاحبزادے ( عبداللہ ) نے اپنے والد سے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَيُّوبُ السَّخْتِيَانِيُّ، عَنِ ابْنِ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمَّا قَدِمَ الْمَدِينَةَ وَجَدَهُمْ يَصُومُونَ يَوْمًا، يَعْنِي عَاشُورَاءَ، فَقَالُوا هَذَا يَوْمٌ عَظِيمٌ، وَهْوَ يَوْمٌ نَجَّى اللَّهُ فِيهِ مُوسَى، وَأَغْرَقَ آلَ فِرْعَوْنَ، فَصَامَ مُوسَى شُكْرًا لِلَّهِ‏.‏ فَقَالَ ‏ \"‏ أَنَا أَوْلَى بِمُوسَى مِنْهُمْ ‏\"‏‏.‏ فَصَامَهُ وَأَمَرَ بِصِيَامِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3247,
                "hadithNumber": "3398",
                "englishNarrator": "Narrated Abu Sa`id:",
                "hadithEnglish": "The Prophet (ﷺ) said, 'People will be struck unconscious on the Day of Resurrection and I will be the first to regain consciousness, and behold! There I will see Moses holding one of the pillars of Allah's Throne. I will wonder whether he has become conscious before me of he has been exempted, because of his unconsciousness at the Tur (mountain) which he received (on the earth).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ قیامت کے دن سب لوگ بیہوش ہو جائیں گے ‘ پھر سب سے پہلے میں ہوش میں آؤں گا اور دیکھوں گا کہ موسیٰ عرش کے پایوں میں سے ایک پایہ تھامے ہوئے ہیں ۔ اب مجھے یہ معلوم نہیں کہ وہ مجھ سے پہلے ہوش میں آ گئے ہوں گے یا ( بیہوش ہی نہیں کئے گئے ہوں گے بلکہ ) انہیں کوہ طور کی بے ہوشی کا بدلہ ملا ہو گا ۔",
                "urduNarrator": "ہم سے محمد بن یوسف بیکندی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے ‘ ان سے عمرو بن یحییٰ نے ‘ ان سے ان کے والد یحییٰ بن عمارہ نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ النَّاسُ يَصْعَقُونَ يَوْمَ الْقِيَامَةِ، فَأَكُونُ أَوَّلَ مَنْ يُفِيقُ، فَإِذَا أَنَا بِمُوسَى آخِذٌ بِقَائِمَةٍ مِنْ قَوَائِمِ الْعَرْشِ، فَلاَ أَدْرِي أَفَاقَ قَبْلِي، أَمْ جُوزِيَ بِصَعْقَةِ الطُّورِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَوَاعَدْنَا مُوسَى ثَلاَثِينَ لَيْلَةً وَأَتْمَمْنَاهَا بِعَشْرٍ فَتَمَّ مِيقَاتُ رَبِّهِ أَرْبَعِينَ لَيْلَةً وَقَالَ مُوسَى لأَخِيهِ هَارُونَ اخْلُفْنِي فِي قَوْمِي وَأَصْلِحْ وَلاَ تَتَّبِعْ سَبِيلَ الْمُفْسِدِينَ وَلَمَّا جَاءَ مُوسَى لِمِيقَاتِنَا وَكَلَّمَهُ رَبُّهُ قَالَ رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ قَالَ لَنْ تَرَانِي} إِلَى قَوْلِهِ: {وَأَنَا أَوَّلُ الْمُؤْمِنِينَ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور ہم نے موسیٰ کے لیے تیس راتیں مقرر کیں۔‘‘",
                "headingEnglish": "The Statement of Allah Taa'la: \"And We appointed for Musa thirty nights...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3248,
                "hadithNumber": "3399",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Were it not for Bani Israel, meat would not decay; and were it not for Eve, no woman would ever betray her husband.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر بنی اسرائیل نہ ہوتے ( سلویٰ کا گوشت جمع کر کے نہ رکھتے ) تو گوشت کبھی نہ سڑتا ۔ اور اگر حوانہ ہوتیں ( یعنی حضرت آدم علیہ السلام سے دغا نہ کرتیں ) تو کوئی عورت اپنے شوہر کی خیانت کبھی نہ کرتی ۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد جعفی نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں ہمام نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَوْلاَ بَنُو إِسْرَائِيلَ لَمْ يَخْنَزِ اللَّحْمُ، وَلَوْلاَ حَوَّاءُ لَمْ تَخُنْ أُنْثَى زَوْجَهَا الدَّهْرَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3249,
                "hadithNumber": "3400",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "He differed with Al-Hur bin Qais Al-Fazari رضی اللہ عنہ regarding the companion of Moses. Ibn `Abbas رضی اللہ عنہما said that he was Al-Khadir. Meanwhile Ubai bin Ka`b رضی اللہ عنہ passed by them and Ibn `Abbas رضی اللہ عنہما called him saying, \"My friend and I have differed regarding Moses' companion whom Moses asked the way to meet. Have you heard Allah's Messenger (ﷺ) mentioning something about him?\" He said, \"Yes, I heard Allah's Apostle saying, 'While Moses was sitting in the company of some Israelites, a man came and asked (him), 'Do you know anyone who is more learned than you?' Moses replied, 'No.' So, Allah sent the Divine Inspiration to Moses: 'Yes, Our slave, Khadir (is more learned than you).' Moses asked how to meet him (i.e. Khadir). So, the fish, was made, as a sign for him, and he was told that when the fish was lost, he should return and there he would meet him. So, Moses went on looking for the sign of the fish in the sea. The servant boy of Moses said to him, 'Do you know that when we were sitting by the side of the rock, I forgot the fish, and t was only Satan who made me forget to tell (you) about it.' Moses said, That was what we were seeking after,' and both of them returned, following their footmarks and found Khadir; and what happened further to them, is mentioned in Allah's Book.\"",
                "hadithUrdu": "حر بن قیس فزاری رضی اللہ عنہ سے صاحب موسیٰ علیہ السلام کے بارے میں ان کا اختلاف ہوا ۔ پھر حضرت ابی بن کعب رضی اللہ عنہ وہاں سے گزرے تو عبداللہ بن عباس رضی اللہ عنہما نے انہیں بلایا اور کہا کہ میرا اپنے ان ساتھی سے صاحب موسیٰ کے بارے میں اختلاف ہو گیا ہے جن سے ملاقات کے لئے موسیٰ علیہ السلام نے راستہ پوچھا تھا ‘ کیا رسول اللہ صلی اللہ علیہ وسلم سے آپ نے ان کے بارے میں کچھ سنا ہے ؟ انہوں نے فرمایا کہ جی ہاں ‘ میں نے حضور صلی اللہ علیہ وسلم کو یہ فرماتے سنا تھا کہ موسیٰ علیہ السلام نبی اسرائیل کی ایک جماعت میں تشریف رکھتے تھے کہ ایک شخص نے ان سے پوچھا ‘ کیا آپ کسی ایسے شخص کو جانتے ہیں جو اس تمام زمین پر آپ سے زیادہ علم رکھنے والا ہو ؟ انہوں نے فرمایا کہ نہیں ۔ اس پر اللہ تعالیٰ نے موسیٰ علیہ السلام پر وحی نازل کی کہ کیوں نہیں ‘ ہمارا بندہ خضر ہے ۔ موسیٰ علیہ السلام نے ان تک پہنچنے کا راستہ پوچھا تو انہیں مچھلی کو اس کی نشانی کے طور پر بتایا گیا اور کہا گیا کہ جب مچھلی گم ہو جائے ( تو جہاں گم ہوئی ہو وہاں ) واپس آ جانا وہیں ان سے ملاقات ہو گی ۔ چنانچہ موسیٰ علیہ السلام دریا میں ( سفر کے دوران ) مچھلی کی برابر نگرانی کرتے رہے ۔ پھر ان سے ان کے رفیق سفر نے کہا کہ آپ نے خیال نہیں کیا جب ہم چٹان کے پاس ٹھہرے تو میں مچھلی کے متعلق آپ کو بتانا بھول گیا تھا اور مجھے شیطان نے اسے یاد رکھنے سے غافل رکھا ۔ موسیٰ علیہ السلام نے فرمایا کہ اسی کی تو ہمیں تلاش ہے چنانچہ یہ بزرگ اسی راستے سے پیچھے کی طرف لوٹے اور حضرت خضر علیہ السلام سے ملاقات ہوئی ان دونوں کے ہی وہ حالات ہیں جنہیں اللہ تعالیٰ کی کتاب میں بیان فرمایا ہے ۔",
                "urduNarrator": "ہم سے عمر بن محمد نے بیان کیا ‘ کہا ہم سے یعقوب بن ابراہیم نے بیان کیا ‘ کہا کہ مجھ سے میرے والد نے بیان کیا ‘ ان سے صالح نے ‘ ان سے ابن شہاب نے ‘ انہیں عبیداللہ بن عبداللہ نے خبر دی اور انہیں حضرت ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ تَمَارَى هُوَ وَالْحُرُّ بْنُ قَيْسٍ الْفَزَارِيُّ فِي صَاحِبِ مُوسَى، قَالَ ابْنُ عَبَّاسٍ هُوَ خَضِرٌ، فَمَرَّ بِهِمَا أُبَىُّ بْنُ كَعْبٍ، فَدَعَاهُ ابْنُ عَبَّاسٍ، فَقَالَ إِنِّي تَمَارَيْتُ أَنَا وَصَاحِبِي، هَذَا فِي صَاحِبِ مُوسَى الَّذِي سَأَلَ السَّبِيلَ إِلَى لُقِيِّهِ، هَلْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ شَأْنَهُ قَالَ نَعَمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ بَيْنَمَا مُوسَى فِي مَلإٍ مِنْ بَنِي إِسْرَائِيلَ جَاءَهُ رَجُلٌ، فَقَالَ هَلْ تَعْلَمُ أَحَدًا أَعْلَمَ مِنْكَ قَالَ لاَ‏.‏ فَأَوْحَى اللَّهُ إِلَى مُوسَى بَلَى عَبْدُنَا خَضِرٌ‏.‏ فَسَأَلَ مُوسَى السَّبِيلَ إِلَيْهِ، فَجُعِلَ لَهُ الْحُوتُ آيَةً، وَقِيلَ لَهُ إِذَا فَقَدْتَ الْحُوتَ فَارْجِعْ، فَإِنَّكَ سَتَلْقَاهُ‏.‏ فَكَانَ يَتْبَعُ الْحُوتَ فِي الْبَحْرِ، فَقَالَ لِمُوسَى فَتَاهُ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ، فَإِنِّي نَسِيتُ الْحُوتَ، وَمَا أَنْسَانِيهِ إِلاَّ الشَّيْطَانُ أَنْ أَذْكُرَهُ‏.‏ فَقَالَ مُوسَى ذَلِكَ مَا كُنَّا نَبْغِ‏.‏ فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا فَوَجَدَا خَضِرًا، فَكَانَ مِنْ شَأْنِهِمَا الَّذِي قَصَّ اللَّهُ فِي كِتَابِهِ ‏\"‏‏.‏",
                "headingArabic": "الْخَضِرِ مَعَ مُوسَى ـ عَلَيْهِمَا السَّلاَمُ",
                "headingUrdu": "حضرت موسیٰ علیہ السلام کے ساتھ خضر کا قصہ",
                "headingEnglish": "The story of Al-Khidr with Musa (Moses) alayhis-salam",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3250,
                "hadithNumber": "3401",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"Nauf Al-Bukah claims that Moses, the companion of Al-Khadir was not Moses (the prophet) of the children of Israel, but some other Moses.\" Ibn `Abbas  Ibn `Abbas رضی اللہ عنہما said, \"Allah's enemy (i.e. Nauf) has told a lie. Ubai bin Ka`b رضی اللہ عنہ told us that the Prophet (ﷺ) said, 'Once Moses stood up and addressed Bani Israel. He was asked who was the most learned man amongst the people. He said, 'I.' Allah admonished him as he did not attribute absolute knowledge to Him (Allah). So, Allah said to him, 'Yes, at the junction of the two seas there is a Slave of Mine who is more learned than you.' Moses said, 'O my Lord! How can I meet him?' Allah said, 'Take a fish and put it in a large basket and you will find him at the place where you will lose the fish.' Moses took a fish and put it in a basket and proceeded along with his (servant) boy, Yusha` bin Noon, till they reached the rock where they laid their heads (i.e. lay down). Moses slept, and the fish, moving out of the basket, fell into the sea. It took its way into the sea (straight) as in a tunnel. Allah stopped the flow of water over the fish and it became like an arch (the Prophet (ﷺ) pointed out this arch with his hands). They travelled the rest of the night, and the next day Moses said to his boy (servant), 'Give us our food, for indeed, we have suffered much fatigue in this journey of ours.' Moses did not feel tired till he crossed that place which Allah had ordered him to seek after. His boy (servant) said to him, 'Do you know that when we were sitting near that rock, I forgot the fish, and none but Satan caused me to forget to tell (you) about it, and it took its course into the sea in an amazing way?.' So there was a path for the fish and that astonished them. Moses said, 'That was what we were seeking after.' So, both of them retraced their footsteps till they reached the rock. There they saw a man Lying covered with a garment. Moses greeted him and he replied saying, 'How do people greet each other in your land?' Moses said, 'I am Moses.' The man asked, 'Moses of Bani Israel?' Moses said, 'Yes, I have come to you so that you may teach me from those things which Allah has taught you.' He said, 'O Moses! I have some of the Knowledge of Allah which Allah has taught me, and which you do not know, while you have some of the Knowledge of Allah which Allah has taught you and which I do not know.' Moses asked, 'May I follow you?' He said, 'But you will not be able to remain patient with me for how can you be patient about things which you will not be able to understand?' (Moses said, 'You will find me, if Allah so will, truly patient, and I will not disobey you in aught.') So, both of them set out walking along the sea-shore, a boat passed by them and they asked the crew of the boat to take them on board. The crew recognized Al-Khadir and so they took them on board without fare. When they were on board the boat, a sparrow came and stood on the edge of the boat and dipped its beak once or twice into the sea. Al-Khadir said to Moses, 'O Moses! My knowledge and your knowledge have not decreased Allah's Knowledge except as much as this sparrow has decreased the water of the sea with its beak.' Then suddenly Al-Khadir took an adze and plucked a plank, and Moses did not notice it till he had plucked a plank with the adze. Moses said to him, 'What have you done? They took us on board charging us nothing; yet you I have intentionally made a hole in their boat so as to drown its passengers. Verily, you have done a dreadful thing.' Al-Khadir replied, 'Did I not tell you that you would not be able to remain patient with me?' Moses replied, 'Do not blame me for what I have forgotten, and do not be hard upon me for my fault.' So the first excuse of Moses was that he had forgotten. When they had left the sea, they passed by a boy playing with other boys. Al-Khadir took hold of the boys head and plucked it with his hand like this. (Sufyan, the sub narrator pointed with his fingertips as if he was plucking some fruit.) Moses said to him, \"Have you killed an innocent person who has not killed any person? You have really done a horrible thing.\" Al-Khadir said, \"Did I not tell you that you could not remain patient with me?' Moses said \"If I ask you about anything after this, don't accompany me. You have received an excuse from me.' Then both of them went on till they came to some people of a village, and they asked its inhabitant for wood but they refused to entertain them as guests. Then they saw therein a wall which was just going to collapse (and Al Khadir repaired it just by touching it with his hands). (Sufyan, the sub-narrator, pointed with his hands, illustrating how Al-Khadir passed his hands over the wall upwards.) Moses said, \"These are the people whom we have called on, but they neither gave us food, nor entertained us as guests, yet you have repaired their wall. If you had wished, you could have taken wages for it.\" Al-Khadir said, \"This is the parting between you and me, and I shall tell you the explanation of those things on which you could not remain patient.\" The Prophet (ﷺ) added, \"We wished that Moses could have remained patient by virtue of which Allah might have told us more about their story. (Sufyan the sub-narrator said that the Prophet (ﷺ) said, \"May Allah bestow His Mercy on Moses! If he had remained patient, we would have been told further about their case.\")  And Hadrat Ibn-e-Abbaas رضی اللہ عنہما recited the verse in this way: And before them, there was a king who used to seize every perfect boat forcibly. And the Young man (killed by Hadrat Khadir) was an Infidel and his parents were Muslims. Sufyan said to me: I have heard this Hadith twice from Amr bin Dinaar and memorized it. Sufyan was asked: Have you memorized this Hadith before hearing it from anybody (else Amr)? Have anybody reported it from Amr else me! I have memorized this Hadith after hearing it from him twice or thrice.",
                "hadithUrdu": "نوف بکالی یہ کہتا ہے کہ موسیٰ ‘ صاحب خضر بنی اسرائیل کے موسیٰ نہیں ہیں بلکہ وہ دوسرے موسیٰ ہیں ۔ حضرت ابن عباس رضی اللہ عنہما نے کہا کہ دشمن خدا نے بالکل غلط بات کہی ہے ۔ حضرت ابی بن کعب رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہوئے ہم سے بیان کیا کہ موسیٰ علیہ السلام نبی اسرائیل کو کھڑے ہو کر خطاب فرما رہے تھے کہ ان سے پوچھا گیا کون سا شخص سب سے زیادہ علم والا ہے ‘ انہوں نے فرمایا کہ میں ۔ اس پر اللہ تعالیٰ نے ان پر عتاب فرمایا کیونکہ انہوں علم کی نسبت اللہ تعالیٰ کی طرف نہیں کی ۔ اللہ تعالیٰ نے ان سے فرمایا کہ کیوں نہیں میرا ایک بندہ ہے جہاں دو دریا آ کر ملتے ہیں وہاں رہتا ہے اور تم سے زیادہ علم والا ہے ۔ انہوں نے عرض کیا اے رب العالمین ! میں ان سے کس طرح مل سکوں گا ؟ سفیان نے ( اپنی روایت میں یہ الفاظ ) بیان کئے کہ ” اے رب ! ” وکیف لی بہ “ اللہ تعالیٰ نے فرمایا کہ ایک مچھلی پکڑ کر اسے اپنے تھیلے میں رکھ لینا ‘ جہاں وہ مچھلی گم ہو جائے بس میرا بندہ وہیں تم کو ملے گا ۔ بعض دفعہ راوی نے ( بجائے فھوثم کے ) فھوثمہ کہا ۔ چنانچہ موسیٰ علیہ السلام نے مچھلی لے لی اور اسے ایک تھیلے میں رکھ لیا ۔ پھر وہ اور ایک ان کے رفیق سفر یوشع بن نون روانہ ہوئے ‘ جب یہ چٹان پر پہنچے تو سر سے ٹیک لگالی ‘ موسیٰ علیہ السلام کو نیند آ گئی اور مچھلی تڑپ کر نکلی اور دریا کے اندر چلی گئی اور اس نے دریا میں اپنا راستہ بنا لیا ۔ اللہ تعالیٰ نے مچھلی سے پانی کے بہاؤ کو روک دیا اور وہ محراب کی طرح ہو گئی ‘ انہوں نے واضح کیا کہ یوں محراب کی طرح ۔ پھر یہ دونوں اس دن اور رات کے باقی حصے میں چلتے رہے ‘ جب دوسرا دن آیا تو موسیٰ علیہ السلام نے اپنے رفیق سفر سے فرمایا کہ اب ہمارا کھانا لاؤ کیونکہ ہم اپنے سفر میں بہت تھک گئے ہیں ۔ موسیٰ علیہ السلام نے اس وقت تک کوئی تھکان محسوس نہیں کی تھی جب تک وہ اس مقررہ جگہ سے آگے نہ بڑھ گئے جس کا اللہ تعالیٰ نے انہیں حکم دیا تھا ۔ ان کے رفیق نے کہا کہ دیکھئیے تو سہی جب چٹان پر اترے تھے تو میں مچھلی ( کے متعلق کہنا ) آپ سے بھول گیا اور مجھے اس کی یاد سے شیطان نے غافل رکھا اور اس مچھلی نے تو وہیں ( چٹان کے قریب ) دریا میں اپنا راستہ عجیب طور پر بنا لیا تھا ۔ مچھلی کو تو راستہ مل گیا اور یہ دونوں حیران تھے ۔ موسیٰ علیہ السلام نے فرمایا کہ یہی وہ جگہ تھی جس کی تلاش میں ہم نکلے ہیں ۔ چنانچہ یہ دونوں اسی راستے سے پیچھے کی طرف واپس ہوئے اور جب اس چٹان پر پہنچے تو وہاں ایک بزرگ اپنا سارا جسم ایک کپڑے میں لپیٹے ہوئے موجود تھے ۔ حضرت موسیٰ علیہ السلام نے انہیں سلام کیا اور انہوں نے جواب دیا پھر کہا کہ تمہارے خطے میں سلام کا رواج کہاں سے آ گیا ؟ موسیٰ علیہ اسلام نے فرمایا کہ میں موسیٰ ہوں ۔ انہوں نے پوچھا ‘ بنی اسرائیل کے موسیٰ ؟ فرمایا کہ جی ہاں ۔ میں آپ کی خدمت میں اس لئے حاضر ہوا ہوں کہ آپ مجھے وہ علم نافع سکھا دیں جو آپ کو سکھایا گیا ہے ۔ انہوں نے فرمایا اے موسیٰ ! میرے پاس اللہ کا دیا ہوا ایک علم ہے اللہ تعالیٰ نے مجھے وہ علم سکھایا ہے اور آپ اس کو نہیں جانتے ۔ اسی طرح آپ کے پاس اللہ کا دیا ہوا ایک علم ہے اللہ تعالیٰ نے آپ کو سکھایا ہے اور میں اسے نہیں جانتا ۔ موسیٰ علیہ السلام نے کہا کیا میں آپ کے ساتھ رہ سکتا ہوں انہوں نے کہا کہ آپ میرے ساتھ صبر نہیں کر سکیں گے اور واقعی آپ ان کاموں کے بارے میں صبر کر بھی کیسے سکتے ہیں جو آپ کے علم میں نہیں ہیں ۔ اللہ تعالیٰ کے ارشاد امراًتک آخر موسیٰ اور خضر علیہم السلام دریا کے کنارے کنارے چلے ۔ پھر ان کے قریب سے ایک کشتی گزری ۔ ان حضرات نے کہا کہ انہیں بھی کشتی والے کشتی پر سوار کر لیں ۔ کشتی والوں نے حضرت خضر علیہ السلام کو پہچان لیا اور کوئی مزدوری لئے بغیر ان کو سوار کر لیا ۔ جب یہ حضرات اس پر سوار ہو گئے تو ایک چڑیا آئی اور کشتی کے ایک کنارے بیٹھ کر اس نے پانی میں اپنی چونچ کو ایک یا دو مرتبہ ڈالا ۔ خضر علیہ السلام نے فرمایا اے موسیٰ ! میرے اور آپ کے علم کی وجہ سے اللہ کے علم میں اتنی بھی کمی نہیں ہوئی جتنی اس چڑیا کے دریا میں چونچ مارنے سے دریا کے پانی میں کمی ہوئی ہو گی ۔ اتنے میں خضر علیہ السلام نے کلہاڑی اٹھائی اور اس کشتی میں سے ایک تختہ نکال لیا ۔ موسیٰ علیہ السلام نے جو نظر اٹھائی تو وہ اپنی کلہاڑی سے تختہ نکال چکے تھے ۔ اس پر حضرت موسیٰ علیہ السلام بول پڑے کہ یہ آپ نے کیا کیا ؟ جن لوگوں نے ہمیں بغیر کسی اجرت کے سوار کر لیا انہیں کی کشتی پر آپ نے بری نظر ڈالی اور اسے چیر دیا کہ سارے کشتی والے ڈوب جائیں ۔ اس میں کوئی شبہ نہیں کہ آپ نے نہایت ناگوار کام کیا ۔ حضرت خضر علیہ السلام نے فرمایا ‘ کیا میں نے آپ سے پہلے ہی نہیں کہہ دیا تھا کہ آپ میرے ساتھ صبر نہیں کر سکتے ۔ موسیٰ علیہ السلام نے فرمایا کہ ( یہ بےصبری اپنے وعدہ کو بھول جانے کی وجہ سے ہوئی ‘ اس لئے ) آپ اس چیز کا مجھ سے مواخذہ نہ کریں جو میں بھول گیا تھا اور میرے معاملے میں تنگی نہ فرمائیں ۔ یہ پہلی بات حضرت موسیٰ علیہ السلام سے بھول کر ہوئی تھی پھر جب دریائی سفر ختم ہوا تو ان کا گزر ایک بچے کے پاس سے ہوا جو دوسرے بچوں کے ساتھ کھیل رہا تھا ۔ حضرت خضر علیہ السلام نے اس کا سر پکڑ کر اپنے ہاتھ سے ( ڈھر سے ) جدا کر دیا ۔ سفیان نے اپنے ہاتھ سے ( جدا کرنے کی کیفیت بتانے کے لئے ) اشارہ کیا جیسے وہ کوئی چیز توڑ رہے ہوں ۔ اس پر حضرت موسیٰ علیہ السلام نے فرمایا کہ آپ نے ایک جان کو ضائع کر دیا ۔ کسی دوسری جان کے بدلے میں بھی یہ نہیں تھا ۔ بلاشبہ آپ نے ایک برا کام کیا ۔ خضر علیہ السلام نے فرمایا ‘ کیا میں نے آپ سے پہلے ہی نہیں کہا تھا کہ آپ میرے ساتھ صبر نہیں کر سکتے ۔ حضرت موسیٰ علیہ السلام نے کہا اچھا اس کے بعد اگر میں نے آپ سے کوئی بات پوچھی تو پھر آپ مجھے ساتھ نہ لے چلئے گا ، بیشک آپ میرے بارے میں حد عذر کو پہنچ چکے ہیں ۔ پھر یہ دونوں آگے بڑھے اور جب ایک بستی میں پہنچے تو بستی والوں سے کہا کہ وہ انہیں اپنا مہمان بنا لیں ‘ لیکن انہوں نے انکار کیا ۔ پھر اس بستی میں انہیں ایک دیوار دکھائی دی جو بس گرنے ہی والی تھی ۔ خضر علیہ السلام نے اپنے ہاتھ سے یوں اشارہ کیا ۔ سفیان نے ( کیفیت بتانے کے لئے ) اس طرح اشارہ کیا جیسے وہ کوئی چیز اوپر کی طرف پھیر رہے ہوں ۔ میں نے سفیان سے ” مائلا “ کا لفظ صرف ایک مرتبہ سنا تھا ۔ حضرت موسیٰ علیہ السلام نے کہا کہ یہ لوگ تو ایسے تھے کہ ہم ان کے یہاں آئے اور انہوں نے ہماری میزبانی سے بھی انکار کیا ۔ پھر ان کی دیوار آپ نے ٹھیک کر دی ‘ اگر آپ چاہتے تو اس کی اجرت ان سے لے سکتے تھے ۔ حضرت خضر علیہ السلام نے فرمایا کہ بس یہاں سے میرے اور آپ کے درمیان جدائی ہو گئی جن باتوں پر آپ صبر نہیں کر سکتے ‘ میں ان کی تاویل و توجیہ اب تم پر واضح کر دوں گا ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہماری تو خواہش یہ تھی کہ موسیٰ علیہ السلام صبر کرتے اور اللہ تعالیٰ تکوینی واقعات ہمارے لئے بیان کرتا ۔ سفیان نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ اللہ حضرت موسیٰ علیہ السلام پر رحم کرے ‘ اگر انہوں نے صبر کیا ہوتا تو ان کے ( مزید واقعات ) ہمیں معلوم ہوتے حضرت ابن عباس رضی اللہ عنہما نے ( جمہور کی قرآت ورائھمکے بجائے ) ” امامھم ملک یاخذ کل سفینۃ غضبا “ پڑھا ہے ۔ اور وہ بچہ ( جس کی حضرت خضر علیہ السلام نے جان لی تھی ) کافر تھا اور اس کے والدین مومن تھے ۔ پھر مجھ سے سفیان نے بیان کیا کہ میں نے یہ حدیث عمرو بن دینار سے دو مرتبہ سنی تھی اور انہیں سے ( سن کر ) یاد کی تھی ۔ سفیان نے کسی سے پوچھا تھا کہ کیا یہ حدیث آپ نے عمرو بن دینار سے سننے سے پہلے ہی کسی دوسرے شخص سے سن کر ( جس نے عمرو بن دینار سے سنی ہو ) یاد کی تھی ؟ یا ( اس کے بجائے یہ جملہ کہا ) ”تحفظتہ من انسان دو مرتبہ “ ( شک علی بن عبداللہ کو تھا ) تو سفیان نے کہا کہ دوسرے کسی شخص سے سن کر میں یاد کرتا ‘ کیا اس حدیث کو عمرو بن دینار سے میرے سوا کسی اور نے بھی روایت کیا ہے ؟ میں نے ان سے یہ حدیث دو یا تین مرتبہ سنی اور انہیں سے سن کر یاد کی ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ کہا ہم سے عمرو بن دینار نے بیان کیا ‘ کہا کہ مجھے سعید بن جبیر نے خبر دی ‘ انہوں نے کہا کہ میں نے ابن عباس رضی اللہ عنہما سے عرض کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ إِنَّ نَوْفًا الْبَكَالِيَّ يَزْعُمُ أَنَّ مُوسَى صَاحِبَ الْخَضِرِ لَيْسَ هُوَ مُوسَى بَنِي إِسْرَائِيلَ، إِنَّمَا هُوَ مُوسَى آخَرُ‏.‏ فَقَالَ كَذَبَ عَدُوُّ اللَّهِ حَدَّثَنَا أُبَىُّ بْنُ كَعْبٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ أَنَّ مُوسَى قَامَ خَطِيبًا فِي بَنِي إِسْرَائِيلَ، فَسُئِلَ أَىُّ النَّاسِ أَعْلَمُ فَقَالَ أَنَا‏.‏ فَعَتَبَ اللَّهُ عَلَيْهِ إِذْ لَمْ يَرُدَّ الْعِلْمَ إِلَيْهِ‏.‏ فَقَالَ لَهُ بَلَى، لِي عَبْدٌ بِمَجْمَعِ الْبَحْرَيْنِ هُوَ أَعْلَمُ مِنْكَ‏.‏ قَالَ أَىْ رَبِّ وَمَنْ لِي بِهِ ـ وَرُبَّمَا قَالَ سُفْيَانُ أَىْ رَبِّ وَكَيْفَ لِي بِهِ ـ قَالَ تَأْخُذُ حُوتًا، فَتَجْعَلُهُ فِي مِكْتَلٍ، حَيْثُمَا فَقَدْتَ الْحُوتَ فَهْوَ ثَمَّ ـ وَرُبَّمَا قَالَ فَهْوَ ثَمَّهْ ـ وَأَخَذَ حُوتًا، فَجَعَلَهُ فِي مِكْتَلٍ، ثُمَّ انْطَلَقَ هُوَ وَفَتَاهُ يُوشَعُ بْنُ نُونٍ، حَتَّى أَتَيَا الصَّخْرَةَ، وَضَعَا رُءُوسَهُمَا فَرَقَدَ مُوسَى، وَاضْطَرَبَ الْحُوتُ فَخَرَجَ فَسَقَطَ فِي الْبَحْرِ، فَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ سَرَبًا، فَأَمْسَكَ اللَّهُ عَنِ الْحُوتِ جِرْيَةَ الْمَاءِ، فَصَارَ مِثْلَ الطَّاقِ، فَقَالَ هَكَذَا مِثْلُ الطَّاقِ‏.‏ فَانْطَلَقَا يَمْشِيَانِ بَقِيَّةَ لَيْلَتِهِمَا وَيَوْمَهُمَا، حَتَّى إِذَا كَانَ مِنَ الْغَدِ قَالَ لِفَتَاهُ آتِنَا غَدَاءَنَا لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَذَا نَصَبًا‏.‏ وَلَمْ يَجِدْ مُوسَى النَّصَبَ حَتَّى جَاوَزَ حَيْثُ أَمَرَهُ اللَّهُ‏.‏ قَالَ لَهُ فَتَاهُ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ، وَمَا أَنْسَانِيهِ إِلاَّ الشَّيْطَانُ أَنْ أَذْكُرَهُ، وَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ عَجَبًا، فَكَانَ لِلْحُوتِ سَرَبًا وَلَهُمَا عَجَبًا‏.‏ قَالَ لَهُ مُوسَى ذَلِكَ مَا كُنَّا نَبْغِي، فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا، رَجَعَا يَقُصَّانِ آثَارَهُمَا حَتَّى انْتَهَيَا إِلَى الصَّخْرَةِ، فَإِذَا رَجُلٌ مُسَجًّى بِثَوْبٍ، فَسَلَّمَ مُوسَى، فَرَدَّ عَلَيْهِ‏.‏ فَقَالَ وَأَنَّى بِأَرْضِكَ السَّلاَمُ‏.‏ قَالَ أَنَا مُوسَى‏.‏ قَالَ مُوسَى بَنِي إِسْرَائِيلَ قَالَ نَعَمْ، أَتَيْتُكَ لِتُعَلِّمَنِي مِمَّا عُلِّمْتَ رَشَدًا‏.‏ قَالَ يَا مُوسَى إِنِّي عَلَى عِلْمٍ مِنْ عِلْمِ اللَّهِ، عَلَّمَنِيهِ اللَّهُ لاَ تَعْلَمُهُ وَأَنْتَ عَلَى عِلْمٍ مِنْ عِلْمِ اللَّهِ عَلَّمَكَهُ اللَّهُ لاَ أَعْلَمُهُ‏.‏ قَالَ هَلْ أَتَّبِعُكَ قَالَ ‏{‏إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا * وَكَيْفَ تَصْبِرُ عَلَى مَا لَمْ تُحِطْ بِهِ خُبْرًا‏}‏ إِلَى قَوْلِهِ ‏{‏إِمْرًا‏}‏ فَانْطَلَقَا يَمْشِيَانِ عَلَى سَاحِلِ الْبَحْرِ، فَمَرَّتْ بِهِمَا سَفِينَةٌ، كَلَّمُوهُمْ أَنْ يَحْمِلُوهُمْ، فَعَرَفُوا الْخَضِرَ، فَحَمَلُوهُ بِغَيْرِ نَوْلٍ، فَلَمَّا رَكِبَا فِي السَّفِينَةِ جَاءَ عُصْفُورٌ، فَوَقَعَ عَلَى حَرْفِ السَّفِينَةِ، فَنَقَرَ فِي الْبَحْرِ نَقْرَةً أَوْ نَقْرَتَيْنِ، قَالَ لَهُ الْخَضِرُ يَا مُوسَى، مَا نَقَصَ عِلْمِي وَعِلْمُكَ مِنْ عِلْمِ اللَّهِ إِلاَّ مِثْلَ مَا نَقَصَ هَذَا الْعُصْفُورُ بِمِنْقَارِهِ مِنَ الْبَحْرِ‏.‏ إِذْ أَخَذَ الْفَأْسَ فَنَزَعَ لَوْحًا، قَالَ فَلَمْ يَفْجَأْ مُوسَى إِلاَّ وَقَدْ قَلَعَ لَوْحًا بِالْقَدُّومِ‏.‏ فَقَالَ لَهُ مُوسَى مَا صَنَعْتَ قَوْمٌ حَمَلُونَا بِغَيْرِ نَوْلٍ، عَمَدْتَ إِلَى سَفِينَتِهِمْ فَخَرَقْتَهَا لِتُغْرِقَ أَهْلَهَا، لَقَدْ جِئْتَ شَيْئًا إِمْرًا‏.‏ قَالَ أَلَمْ أَقُلْ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا‏.‏ قَالَ لاَ تُؤَاخِذْنِي بِمَا نَسِيتُ وَلاَ تُرْهِقْنِي مِنْ أَمْرِي عُسْرًا، فَكَانَتِ الأُولَى مِنْ مُوسَى نِسْيَانًا‏.‏ فَلَمَّا خَرَجَا مِنَ الْبَحْرِ مَرُّوا بِغُلاَمٍ يَلْعَبُ مَعَ الصِّبْيَانِ، فَأَخَذَ الْخَضِرُ بِرَأْسِهِ فَقَلَعَهُ بِيَدِهِ هَكَذَا ـ وَأَوْمَأَ سُفْيَانُ بِأَطْرَافِ أَصَابِعِهِ كَأَنَّهُ يَقْطِفُ شَيْئًا ـ فَقَالَ لَهُ مُوسَى أَقَتَلْتَ نَفْسًا زَكِيَّةً بِغَيْرِ نَفْسٍ لَقَدْ جِئْتَ شَيْئًا نُكْرًا‏.‏ قَالَ أَلَمْ أَقُلْ لَكَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا‏.‏ قَالَ إِنْ سَأَلْتُكَ عَنْ شَىْءٍ بَعْدَهَا فَلاَ تُصَاحِبْنِي، قَدْ بَلَغْتَ مِنْ لَدُنِّي عُذْرًا‏.‏ فَانْطَلَقَا حَتَّى إِذَا أَتَيَا أَهْلَ قَرْيَةٍ اسْتَطْعَمَا أَهْلَهَا فَأَبَوْا أَنْ يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ مَائِلاً ـ أَوْمَأَ بِيَدِهِ هَكَذَا وَأَشَارَ سُفْيَانُ كَأَنَّهُ يَمْسَحُ شَيْئًا إِلَى فَوْقُ، فَلَمْ أَسْمَعْ سُفْيَانَ يَذْكُرُ مَائِلاً إِلاَّ مَرَّةً ـ قَالَ قَوْمٌ أَتَيْنَاهُمْ فَلَمْ يُطْعِمُونَا وَلَمْ يُضَيِّفُونَا عَمَدْتَ إِلَى حَائِطِهِمْ لَوْ شِئْتَ لاَتَّخَذْتَ عَلَيْهِ أَجْرًا‏.‏ قَالَ هَذَا فِرَاقُ بَيْنِي وَبَيْنِكَ، سَأُنَبِّئُكَ بِتَأْوِيلِ مَا لَمْ تَسْتَطِعْ عَلَيْهِ صَبْرًا‏\"‏‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَدِدْنَا أَنَّ مُوسَى كَانَ صَبَرَ، فَقَصَّ اللَّهُ عَلَيْنَا مِنْ خَبَرِهِمَا ‏\"‏‏.‏ قَالَ سُفْيَانُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَرْحَمُ اللَّهُ مُوسَى، لَوْ كَانَ صَبَرَ يُقَصُّ عَلَيْنَا مِنْ أَمْرِهِمَا ‏\"‏‏.‏ وَقَرَأَ ابْنُ عَبَّاسٍ أَمَامَهُمْ مَلِكٌ يَأْخُذُ كُلَّ سَفِينَةٍ صَالِحَةٍ غَصْبًا، وَأَمَّا الْغُلاَمُ فَكَانَ كَافِرًا وَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ‏.‏ ثُمَّ قَالَ لِي سُفْيَانُ سَمِعْتُهُ مِنْهُ مَرَّتَيْنِ وَحَفِظْتُهُ مِنْهُ‏.‏ قِيلَ لِسُفْيَانَ حَفِظْتَهُ قَبْلَ أَنْ تَسْمَعَهُ مِنْ عَمْرٍو، أَوْ تَحَفَّظْتَهُ مِنْ إِنْسَانٍ فَقَالَ مِمَّنْ أَتَحَفَّظُهُ وَرَوَاهُ أَحَدٌ عَنْ عَمْرٍو غَيْرِي سَمِعْتُهُ مِنْهُ مَرَّتَيْنِ أَوْ ثَلاَثًا وَحَفِظْتُهُ مِنْهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3251,
                "hadithNumber": "3402",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Al-Khadir علیہ السلام was named so because he sat over a barren white land, it turned green with plantation after (his sitting over it.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ خضر علیہ السلام کا یہ نام اس وجہ سے ہوا کہ وہ ایک سوکھی زمین ( جہاں سبزی کا نام بھی نہ تھا ) پر بیٹھے ۔ لیکن جوں ہی وہ وہاں سے اٹھے تو وہ جگہ سرسبز ہو کر لہلہانے لگی ۔",
                "urduNarrator": "ہم سے محمد بن سعید اصبہانی نے بیان کیا ‘ کہا ہم کو عبداللہ بن مبارک نے خبر دی ‘ انہیں معمر نے ‘ انہیں ہمام بن منبہ نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدٍ الأَصْبَهَانِيُّ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا سُمِّيَ الْخَضِرُ أَنَّهُ جَلَسَ عَلَى فَرْوَةٍ بَيْضَاءَ فَإِذَا هِيَ تَهْتَزُّ مِنْ خَلْفِهِ خَضْرَاءَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3252,
                "hadithNumber": "3403",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"It was said to Bani Israel, Enter the gate (of the town) with humility (prostrating yourselves) and saying: \"Repentance\", but they changed the word and entered the town crawling on their buttocks and saying: \"A wheat grain in the hair.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ نبی اسرائیل کو حکم ہوا تھا کہ بیت المقدس میں سجدہ و رکوع کرتے ہوئے داخل ہوں اور یہ کہتے ہوئے کہ یا اللہ ! ہم کو بخش دے ۔ لیکن انہوں نے اس کو الٹا کیا اور اپنے چوتڑوں کے بل گھسٹتے ہوئے داخل ہوئے اور یہ کہتے ہوئے ” حبۃ فی شعرہ “ ( یعنی بالیوں میں دانے خوب ہوں ) داخل ہوئے ۔",
                "urduNarrator": "مجھ سے اسحاق بن نصرنے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ‘ ان سے معمر نے ‘ ان سے ہمام بن منبہ نے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ۔ انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ قِيلَ لِبَنِي إِسْرَائِيلَ ادْخُلُوا الْبَابَ سُجَّدًا وَقُولُوا حِطَّةٌ‏.‏ فَبَدَّلُوا فَدَخَلُوا يَزْحَفُونَ عَلَى أَسْتَاهِهِمْ، وَقَالُوا حَبَّةٌ فِي شَعْرَةٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 3226,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=129",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=127",
                "label": "127",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=128",
                "label": "128",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=129",
                "label": "129",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=130",
                "label": "130",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=131",
                "label": "131",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=132",
                "label": "132",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=133",
                "label": "133",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=131",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=131",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=129",
        "to": 3250,
        "total": 40465
    }
}