{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 156,
        "data": [
            {
                "id": 3878,
                "hadithNumber": "4064",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When it was the day of Uhud, the people left the Prophet (ﷺ) while Abu Talha          رضی اللہ عنہ was in front of the Prophet (ﷺ) shielding him with his leather shield. Abu Talha رضی اللہ عنہ was a skillful archer who used to shoot violently. He broke two or three arrow bows on that day. If a man carrying a quiver full of arrows passed by, the Prophet would say (to him), put (scatter) its contents for Abu Talha رضی اللہ عنہ .\" The Prophet (ﷺ) would raise his head to look at the enemy, whereupon Abu Talha رضی اللہ عنہ would say, \"Let my father and mother be sacrificed for you ! Do not raise your head, lest an arrow of the enemy should hit you. (Let) my neck (be struck) rather than your neck.\" I saw `Aisha رضی اللہ عنہا , the daughter of Abu Bakr رضی اللہ عنہا, and Um Sulaim رضی اللہ عنہا rolling up their dresses so that I saw their leg-bangles while they were carrying water skins on their backs and emptying them in the mouths of the (wounded) people. They would return to refill them and again empty them in the mouths of the (wounded) people. The sword fell from Abu Talha's hand twice or thrice (on that day).",
                "hadithUrdu": "غزوہ احد میں جب مسلمان نبی کریم صلی اللہ علیہ وسلم کے پاس سے منتشر ہو کر پسپا ہو گئے تو طلحہ رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کی اپنے چمڑے کی ڈھال سے حفاظت کر رہے تھے۔ ابوطلحہ رضی اللہ عنہ بڑے تیرانداز تھے اور کمان خوب کھینچ کر تیر چلایا کرتے تھے۔ اس دن انہوں نے دو یا تین کمانیں توڑ دی تھیں۔ مسلمانوں میں سے کوئی اگر تیر کا ترکش لیے گزرتا تو نبی کریم صلی اللہ علیہ وسلم ان سے فرماتے یہ تیر ابوطلحہ کے لیے یہیں رکھتے جاؤ۔ انس رضی اللہ عنہ نے بیان کیا کہ آپ صلی اللہ علیہ وسلم مشرکین کو دیکھنے کے لیے سر اٹھا کر جھانکتے تو ابوطلحہ رضی اللہ عنہ عرض کرتے: میرے ماں باپ آپ پر فدا ہوں، سر مبارک اوپر نہ اٹھایئے کہیں ایسا نہ ہو کہ ادھر سے کوئی تیر آپ کو لگ جائے۔ میری گردن آپ سے پہلے ہے اور میں نے دیکھا کہ جنگ میں عائشہ بنت ابی بکر رضی اللہ عنہا اور ( انس رضی اللہ عنہ کی والدہ ) ام سلیم رضی اللہ عنہا اپنے کپڑے اٹھائے ہوئے ہیں کہ ان کی پنڈلیاں نظر آ رہی تھیں اور مشکیزے اپنی پیٹھوں پر لیے دوڑ رہی ہیں اور اس کا پانی زخمی مسلمانوں کو پلا رہی ہیں پھر ( جب اس کا پانی ختم ہو جاتا ہے ) تو واپس آتی ہیں اور مشک بھر کر پھر لے جاتی ہیں اور مسلمانوں کو پلاتی ہیں۔ اس دن ابوطلحہ رضی اللہ عنہ کے ہاتھ سے دو یا تین مرتبہ تلوار گر گئی تھی۔",
                "urduNarrator": "ہم سے ابومعمر نے بیان کیا، کہا ہم سے عبدالوارث نے بیان کیا، ان سے عبدالعزیز نے بیان کیا اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمَّا كَانَ يَوْمَ أُحُدٍ انْهَزَمَ النَّاسُ عَنِ النَّبِيِّ صلى الله عليه وسلم وَأَبُو طَلْحَةَ بَيْنَ يَدَىِ النَّبِيِّ صلى الله عليه وسلم مُجَوِّبٌ عَلَيْهِ بِحَجَفَةٍ لَهُ، وَكَانَ أَبُو طَلْحَةَ رَجُلاً رَامِيًا شَدِيدَ النَّزْعِ، كَسَرَ يَوْمَئِذٍ قَوْسَيْنِ أَوْ ثَلاَثًا، وَكَانَ الرَّجُلُ يَمُرُّ مَعَهُ بِجَعْبَةٍ مِنَ النَّبْلِ فَيَقُولُ انْثُرْهَا لأَبِي طَلْحَةَ‏.‏ قَالَ وَيُشْرِفُ النَّبِيُّ صلى الله عليه وسلم يَنْظُرُ إِلَى الْقَوْمِ، فَيَقُولُ أَبُو طَلْحَةَ بِأَبِي أَنْتَ وَأُمِّي، لاَ تُشْرِفْ يُصِيبُكَ سَهْمٌ مِنْ سِهَامِ الْقَوْمِ، نَحْرِي دُونَ نَحْرِكَ‏.‏ وَلَقَدْ رَأَيْتُ عَائِشَةَ بِنْتَ أَبِي بَكْرٍ وَأُمَّ سُلَيْمٍ، وَإِنَّهُمَا لَمُشَمِّرَتَانِ أَرَى خَدَمَ سُوقِهِمَا تَنْقُزَانِ الْقِرَبَ عَلَى مُتُونِهِمَا، تُفْرِغَانِهِ فِي أَفْوَاهِ الْقَوْمِ ثُمَّ تَرْجِعَانِ فَتَمْلآنِهَا، ثُمَّ تَجِيئَانِ فَتُفْرِغَانِهِ فِي أَفْوَاهِ الْقَوْمِ، وَلَقَدْ وَقَعَ السَّيْفُ مِنْ يَدَىْ أَبِي طَلْحَةَ إِمَّا مَرَّتَيْنِ وَإِمَّا ثَلاَثًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3879,
                "hadithNumber": "4065",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "When it was the day of Uhud, the pagans were defeated. Then Satan, Allah's Curse be upon him, cried loudly, \"O Allah's Worshippers, beware of what is behind!\" On that, the front files of the (Muslim) forces turned their backs and started fighting with the back files. Hudhaifa looked, and on seeing his father Al-Yaman, he shouted, \"O Allah's Worshippers, my father, my father!\" But by Allah, they did not stop till they killed him. Hudhaifa said, \"May Allah forgive you.\" (The sub-narrator, `Urwa, said, \"By Allah, Hudhaifa continued asking Allah's Forgiveness for the killers of his father till he departed to Allah (i.e. died).\") (Imam Bukhari) says that he thinks: (بصرت) is in fact from '' الْبَصِيرَةِ '' regarding affair; and '' أبصرت '' means to see by an eye. The other people say that بصرت and أبصرت are synonyms.",
                "hadithUrdu": "شروع جنگ احد میں پہلے مشرکین شکست کھا گئے تھے لیکن ابلیس، اللہ کی اس پر لعنت ہو، دھوکا دینے کے لیے پکارنے لگا۔ اے عباد اللہ! ( مسلمانو! ) اپنے پیچھے والوں سے خبردار ہو جاؤ۔ اس پر آگے جو مسلمان تھے وہ لوٹ پڑے اور اپنے پیچھے والوں سے بھڑ گئے۔ حذیفہ بن یمان رضی اللہ عنہ نے جو دیکھا تو ان کے والد یمان رضی اللہ عنہ انہیں میں ہیں ( جنہیں مسلمان اپنا دشمن مشرک سمجھ کر مار رہے تھے ) ۔ وہ کہنے لگے مسلمانو! یہ تو میرے والد ہیں، میرے والد۔ عروہ نے کہا، عائشہ رضی اللہ عنہا نے کہا، پس اللہ کی قسم انہوں نے ان کو اس وقت تک نہیں چھوڑا جب تک قتل نہ کر لیا۔ حذیفہ رضی اللہ عنہ نے صرف اتنا کہا کہ اللہ مسلمانوں کی غلطی معاف کرے۔ عروہ نے بیان کیا کہ اس کے بعد حذیفہ رضی اللہ عنہ برابر مغفرت کی دعا کرتے رہے یہاں تک کہ وہ اللہ سے جا ملے۔ «بصرت» یعنی میں دل کی آنکھوں سے کام کو سمجھتا ہوں اور «أبصرت» آنکھوں سے دیکھنے کے لیے استعمال ہوتا ہے۔ یہ بھی کہا گیا ہے کہ «بصرت» اور «أبصرت» کے ایک ہی معنی ہیں۔ «بصرت» دل کی آنکھوں سے دیکھنا اور «أبصرت» ظاہر کی آنکھوں سے دیکھنا مراد ہے۔",
                "urduNarrator": "مجھ سے عبید اللہ بن سعید نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے ہشام بن عروہ نے، ان سے ان کے والد عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا كَانَ يَوْمَ أُحُدٍ هُزِمَ الْمُشْرِكُونَ، فَصَرَخَ إِبْلِيسُ لَعْنَةُ اللَّهِ عَلَيْهِ أَىْ عِبَادَ اللَّهِ أُخْرَاكُمْ‏.‏ فَرَجَعَتْ أُولاَهُمْ فَاجْتَلَدَتْ هِيَ وَأُخْرَاهُمْ فَبَصُرَ حُذَيْفَةُ فَإِذَا هُوَ بِأَبِيهِ الْيَمَانِ فَقَالَ أَىْ عِبَادَ اللَّهِ أَبِي أَبِي‏.‏ قَالَ قَالَتْ فَوَاللَّهِ مَا احْتَجَزُوا حَتَّى قَتَلُوهُ فَقَالَ حُذَيْفَةُ يَغْفِرُ اللَّهُ لَكُمْ‏.‏ قَالَ عُرْوَةُ فَوَاللَّهِ مَا زَالَتْ فِي حُذَيْفَةَ بَقِيَّةُ خَيْرٍ حَتَّى لَحِقَ بِاللَّهِ‏.‏ بَصُرْتُ عَلِمْتُ، مِنَ الْبَصِيرَةِ فِي الأَمْرِ، وَأَبْصَرْتُ مِنْ بَصَرِ الْعَيْنِ وَيُقَالُ بَصُرْتُ وَأَبْصَرْتُ وَاحِدٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3880,
                "hadithNumber": "4066",
                "englishNarrator": "Narrated `Uthman bin Mauhab:",
                "hadithEnglish": "A man came to perform the Hajj to (Allah's) House. Seeing some people sitting, he said, \"Who are these sitting people?\" Somebody said, \"They are the people of Quraish.\" He said, \"Who is the old man?\" They said, \"Ibn `Umar رضی اللہ عنہما .\" He went to him and said, \"I want to ask you about something; will you tell me about it? I ask you with the respect due to the sanctity of this (Sacred) House, do you know that `Uthman bin `Affan رضی اللہ عنہ fled on the day of Uhud?\" Ibn `Umar رضی اللہ عنہ said, \"Yes.\" He said, \"Do you know that he (i.e. `Uthman) was absent from the Badr (battle) and did not join it?\" Ibn `Umar رضی اللہ عنہ said, \"Yes.\" He said, \"Do you know that he failed to be present at the Ridwan Pledge of allegiance (i.e. Pledge of allegiance at Hudaibiya) and did not witness it?\" Ibn `Umar رضی اللہ عنہ replied, \"Yes,\" He then said, \"Allahu- Akbar!\" Ibn `Umar رضی اللہ عنہ said, \"Come along; I will inform you and explain to you what you have asked. As for the flight (of `Uthman) on the day of Uhud, I testify that Allah forgave him. As regards his absence from the Badr (battle), he was married to the daughter of Allah's Messenger (ﷺ) and she was ill, so the Prophet (ﷺ) said to him, 'You will have such reward as a man who has fought the Badr battle will get, and will also have the same share of the booty.' As for his absence from the Ridwan Pledge of allegiance if there had been anybody more respected by the Meccans than `Uthman bin `Affan رضی اللہ عنہ , the Prophet would surely have sent that man instead of `Uthman رضی اللہ عنہ. So the Prophet (ﷺ) sent him (i.e. `Uthman رضی اللہ عنہ to Mecca) and the Ridwan Pledge of allegiance took place after `Uthman رضی اللہ عنہ had gone to Mecca. The Prophet raised his right hand saying. 'This is the hand of `Uthman رضی اللہ عنہ ,' and clapped it over his other hand and said, \"This is for `Uthman رضی اللہ عنہ .'\" Ibn `Umar رضی اللہ عنہ then said (to the man), \"Go now, after taking this information.\"",
                "hadithUrdu": "ایک صاحب بیت اللہ کے حج کے لیے آئے تھے۔ دیکھا کہ کچھ لوگ بیٹھے ہوئے ہیں۔ پوچھا کہ یہ بیٹھے ہوئے کون لوگ ہیں؟ لوگوں نے بتایا کہ یہ قریش ہیں۔ پوچھا کہ ان میں شیخ کون ہیں؟ بتایا کہ ابن عمر رضی اللہ عنہما۔ وہ صاحب ابن عمر رضی اللہ عنہما کے پاس آئے اور ان سے کہا کہ میں آپ سے ایک بات پوچھتا ہوں۔ آپ مجھ سے واقعات ( صحیح ) بیان کر دیجئیے۔ اس گھر کی حرمت کی قسم دے کر میں آپ سے پوچھتا ہوں۔ کیا آپ کو معلوم ہے کہ عثمان رضی اللہ عنہ نے غزوہ احد کے موقع پر راہ فرار اختیار کی تھی؟ انہوں نے کہا کہ ہاں صحیح ہے۔ انہوں نے پوچھا آپ کو یہ بھی معلوم ہے عثمان رضی اللہ عنہ بدر کی لڑائی میں شریک نہیں تھے؟ کہا کہ ہاں یہ بھی ہوا تھا۔ انہوں نے پوچھا اور آپ کو یہ بھی معلوم ہے کہ وہ بیعت رضوان ( صلح حدیبیہ ) میں بھی پیچھے رہ گئے تھے اور حاضر نہ ہو سکے تھے؟ انہوں نے کہا کہ ہاں یہ بھی صحیح ہے۔ اس پر ان صاحب نے ( مارے خوشی کے ) اللہ اکبر کہا لیکن ابن عمر رضی اللہ عنہما نے کہا۔ یہاں آؤ میں تمہیں بتاؤں گا اور جو سوالات تم نے کئے ہیں ان کی میں تمہارے سامنے تفصیل بیان کر دوں گا۔ احد کی لڑائی میں فرار سے متعلق جو تم نے کہا تو میں گواہی دیتا ہوں کہ اللہ تعالیٰ نے ان کی غلطی معاف کر دی ہے۔ بدر کی لڑائی میں ان کے نہ ہونے کے متعلق جو تم نے کہا تو اس کی وجہ یہ تھی۔ کہ ان کے نکاح میں رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی ( رقیہ رضی اللہ عنہا ) تھیں اور وہ بیمار تھیں۔ آپ نے فرمایا تھا کہ تمہیں اس شخص کے برابر ثواب ملے گا جو بدر کی لڑائی میں شریک ہو گا اور اسی کے برابر مال غنیمت سے حصہ بھی ملے گا۔ بیعت رضوان میں ان کی عدم شرکت کا جہاں تک سوال ہے تو وادی مکہ میں عثمان بن عفان رضی اللہ عنہ سے زیادہ کوئی شخص ہر دل عزیز ہوتا تو نبی کریم صلی اللہ علیہ وسلم ان کے بجائے اسی کو بھیجتے۔ اس لیے عثمان رضی اللہ عنہ کو وہاں بھیجنا پڑا اور بیعت رضوان اس وقت ہوئی جب وہ مکہ میں تھے۔ ( بیعت لیتے ہوئے ) نبی کریم صلی اللہ علیہ وسلم نے اپنے دائیں ہاتھ کو اٹھا کر فرمایا کہ یہ عثمان کا ہاتھ ہے اور اسے اپنے ( بائیں ) ہاتھ پر مار کر فرمایا کہ یہ بیعت عثمان کی طرف سے ہے۔ اب جا سکتے ہو۔ البتہ میری باتوں کو یاد رکھنا۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا، کہا ہم کو ابوحمزہ نے خبر دی، ان سے عثمان بن موہب نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا أَبُو حَمْزَةَ، عَنْ عُثْمَانَ بْنِ مَوْهَبٍ، قَالَ جَاءَ رَجُلٌ حَجَّ الْبَيْتَ فَرَأَى قَوْمًا جُلُوسًا فَقَالَ مَنْ هَؤُلاَءِ الْقُعُودُ قَالُوا هَؤُلاَءِ قُرَيْشٌ‏.‏ قَالَ مَنِ الشَّيْخُ قَالُوا ابْنُ عُمَرَ‏.‏ فَأَتَاهُ فَقَالَ إِنِّي سَائِلُكَ عَنْ شَىْءٍ أَتُحَدِّثُنِي، قَالَ أَنْشُدُكَ بِحُرْمَةِ هَذَا الْبَيْتِ أَتَعْلَمُ أَنَّ عُثْمَانَ بْنَ عَفَّانَ فَرَّ يَوْمَ أُحُدٍ قَالَ نَعَمْ‏.‏ قَالَ فَتَعْلَمُهُ تَغَيَّبَ عَنْ بَدْرٍ فَلَمْ يَشْهَدْهَا قَالَ نَعَمْ‏.‏ قَالَ فَتَعْلَمُ أَنَّهُ تَخَلَّفَ عَنْ بَيْعَةِ الرُّضْوَانِ فَلَمْ يَشْهَدْهَا قَالَ نَعَمْ‏.‏ قَالَ فَكَبَّرَ‏.‏ قَالَ ابْنُ عُمَرَ تَعَالَ لأُخْبِرَكَ وَلأُبَيِّنَ لَكَ عَمَّا سَأَلْتَنِي عَنْهُ، أَمَّا فِرَارُهُ يَوْمَ أُحُدٍ فَأَشْهَدُ أَنَّ اللَّهَ عَفَا عَنْهُ، وَأَمَّا تَغَيُّبُهُ عَنْ بَدْرٍ فَإِنَّهُ كَانَ تَحْتَهُ بِنْتُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَتْ مَرِيضَةً، فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ لَكَ أَجْرَ رَجُلٍ مِمَّنْ شَهِدَ بَدْرًا وَسَهْمَهُ ‏\"‏‏.‏ وَأَمَّا تَغَيُّبُهُ عَنْ بَيْعَةِ الرُّضْوَانِ فَإِنَّهُ لَوْ كَانَ أَحَدٌ أَعَزَّ بِبَطْنِ مَكَّةَ مِنْ عُثْمَانَ بْنِ عَفَّانَ لَبَعَثَهُ مَكَانَهُ، فَبَعَثَ عُثْمَانَ، وَكَانَ بَيْعَةُ الرُّضْوَانِ بَعْدَ مَا ذَهَبَ عُثْمَانُ إِلَى مَكَّةَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ الْيُمْنَى ‏\"‏ هَذِهِ يَدُ عُثْمَانَ ‏\"‏‏.‏ فَضَرَبَ بِهَا عَلَى يَدِهِ فَقَالَ ‏\"‏ هَذِهِ لِعُثْمَانَ ‏\"‏‏.‏ اذْهَبْ بِهَذَا الآنَ مَعَكَ‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى {‏إِنَّ الَّذِينَ تَوَلَّوْا مِنْكُمْ يَوْمَ الْتَقَى الْجَمْعَانِ إِنَّمَا اسْتَزَلَّهُمُ الشَّيْطَانُ بِبَعْضِ مَا كَسَبُوا وَلَقَدْ عَفَا اللَّهُ عَنْهُمْ إِنَّ اللَّهَ غَفُورٌ حَلِيمٌ}",
                "headingUrdu": "’’لیکن اللہ تعالیٰ نے یقیناً انہیں معاف کر دیا ہے۔‘‘",
                "headingEnglish": "“But Allah indeed has forgiven them.”",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3881,
                "hadithNumber": "4067",
                "englishNarrator": "Narrated Al-Bara' bin `Azib رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) appointed `Abdullah bin Jubair رضی اللہ عنہما as the commander of the cavalry archers on the day of the battle of Uhud. Then they returned defeated, and that what is referred to by Allah's Statement:-- \"And the Apostle (Muhammad) was in your rear calling you back.\" (3.153)",
                "hadithUrdu": "غزوہ احد کے موقع پر رسول اللہ صلی اللہ علیہ وسلم نے ( تیر اندازوں کے ) پیدل دستہ کا امیر عبداللہ بن جبیر رضی اللہ عنہما کو بنایا تھا لیکن وہ لوگ شکست خوردہ ہو کر آئے۔ ( آیت «يدعوهم الرسول في أخراهم‏.‏» ان ہی کے بارے میں نازل ہوئی تھی ) اور یہ ہزیمت اس وقت پیش آئی جبکہ رسول اللہ صلی اللہ علیہ وسلم ان کو پیچھے سے پکار رہے تھے۔",
                "urduNarrator": "مجھ سے عمرو بن خالد نے بیان کیا، کہا ہم سے زہیر نے بیان کیا، کہا ہم سے ابواسحاق نے بیان کیا، کہا کہ میں نے براء بن عازب رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ قَالَ جَعَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى الرَّجَّالَةِ يَوْمَ أُحُدٍ عَبْدَ اللَّهِ بْنَ جُبَيْرٍ، وَأَقْبَلُوا مُنْهَزِمِينَ، فَذَاكَ إِذْ يَدْعُوهُمُ الرَّسُولُ فِي أُخْرَاهُمْ‏.‏",
                "headingArabic": "{‏إِذْ تُصْعِدُونَ وَلاَ تَلْوُونَ عَلَى أَحَدٍ وَالرَّسُولُيَدْعُوكُمْ فِي أُخْرَاكُمْ فَأَثَابَكُمْ غَمًّا بِغَمٍّ لِكَيْلاَ تَحْزَنُوا عَلَى مَا فَاتَكُمْ وَلاَ مَا أَصَابَكُمْ وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ} ، {تُصْعِدُونَ} تَذْهَبُونَ، أَصْعَدَ وَصَعِدَ فَوْقَ الْبَيْتِ",
                "headingUrdu": "(اور یاد کرو) جب تم بھاگے تھے۔",
                "headingEnglish": "“(And remember) when you ran away",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3882,
                "hadithNumber": "4068",
                "englishNarrator": "Narrated Abu Talha رضی اللہ عنہ :",
                "hadithEnglish": "I was amongst those who were overtaken by slumber until my sword fell from my hand on several occasions. The sword fell and I picked it up, and it fell again, and I picked it up.\"",
                "hadithUrdu": "میں ان لوگوں میں تھا جنہیں غزوہ احد کے موقع پر اونگھ نے آ گھیرا تھا اور اسی حالت میں میری تلوار کئی مرتبہ ( ہاتھ سے چھوٹ کر بے اختیار ) گر پڑی تھی۔ میں اسے اٹھا لیتا، پھر گر جاتی اور میں اسے پھر اٹھا لیتا۔",
                "urduNarrator": "اور مجھ سے خلیفہ نے بیان کیا، کہا ہم سے یزید بن زریع نے بیان کیا، ان سے سعید نے بیان کیا، انہوں نے قتادہ سے سنا اور ان سے انس رضی اللہ عنہ نے اور ان سے ابوطلحہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ لِي خَلِيفَةُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنْ أَبِي طَلْحَةَ ـ رضى الله عنهما ـ قَالَ كُنْتُ فِيمَنْ تَغَشَّاهُ النُّعَاسُ يَوْمَ أُحُدٍ، حَتَّى سَقَطَ سَيْفِي مِنْ يَدِي مِرَارًا، يَسْقُطُ وَآخُذُهُ، وَيَسْقُطُ فَآخُذُهُ‏.‏",
                "headingArabic": "{‏ثُمَّ أَنْزَلَ عَلَيْكُمْ مِنْ بَعْدِ الْغَمِّ أَمَنَةً نُعَاسًا يَغْشَى طَائِفَةً مِنْكُمْ وَطَائِفَةٌ قَدْ أَهَمَّتْهُمْ أَنْفُسُهُمْ يَظُنُّونَ بِاللَّهِ غَيْرَ الْحَقِّ ظَنَّ الْجَاهِلِيَّةِ يَقُولُونَ هَلْ لَنَا مِنَ الأَمْرِ مِنْ شَيْءٍ قُلْ إِنَّ الأَمْرَ كُلَّهُ لِلَّهِ يُخْفُونَ فِي أَنْفُسِهِمْ مَا لاَ يُبْدُونَ لَكَ يَقُولُونَ لَوْ كَانَ لَنَا مِنَ الأَمْرِ شَيْءٌ مَا قُتِلْنَا هَاهُنَا قُلْ لَوْ كُنْتُمْ فِي بُيُوتِكُمْ لَبَرَزَ الَّذِينَ كُتِبَ عَلَيْهِمُ الْقَتْلُ إِلَى مَضَاجِعِهِمْ وَلِيَبْتَلِيَ اللَّهُ مَا فِي صُدُورِكُمْ وَلِيُمَحِّصَ مَا فِي قُلُوبِكُمْ وَاللَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ}",
                "headingUrdu": "\"پھر مصیبت کے بعد اس نے تم پر سلامتی نازل کی...\"",
                "headingEnglish": "“Then after the distress, He sent down security for you…”",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3883,
                "hadithNumber": "4069",
                "englishNarrator": "Narrated Salim's father:",
                "hadithEnglish": "He heard Allah's Messenger (ﷺ), when raising his head from bowing of the first rak`a of the morning prayer, saying, \"O Allah! Curse so-and-so and so-and-so\" after he had said, \"Allah hears him who sends his praises to Him. Our Lord, all the Praises are for you!\" So Allah revealed:-- \"Not for you (O Muhammad! )......(till the end of Verse) they are indeed wrong-doers.\" (3.128)",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، جب نبی کریم صلی اللہ علیہ وسلم فجر کی آخری رکعت کے رکوع سے سر مبارک اٹھاتے تو یہ دعا کرتے ”اے اللہ! فلاں، فلاں اور فلاں ( صفوان بن امیہ، سہیل بن عمرو اور حارث بن ہشام ) کو اپنی رحمت سے دور کر دے۔“ یہ دعا آپ «سمع الله لمن حمده ربنا ولك الحمد» کے بعد کرتے تھے۔ اس پر اللہ تعالیٰ نے آیت «ليس لك من الأمر شىء‏» سے «فإنهم ظالمون‏» ( آل عمران: 128 ) تک نازل کی۔",
                "urduNarrator": "ہم سے یحییٰ بن عبداللہ سلمی نے بیان کیا، کہا ہم کو عبداللہ نے خبر دی، کہا ہم کو معمر نے خبر دی، انہیں زہری نے، انہیں سالم نے اپنے والد عبداللہ بن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ عَبْدِ اللَّهِ السُّلَمِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي سَالِمٌ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ مِنَ الرَّكْعَةِ الآخِرَةِ مِنَ الْفَجْرِ يَقُولُ ‏\"‏ اللَّهُمَّ الْعَنْ فُلاَنًا وَفُلاَنًا وَفُلاَنًا ‏\"‏‏.‏ بَعْدَ مَا يَقُولُ ‏\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ ‏{‏لَيْسَ لَكَ مِنَ الأَمْرِ شَىْءٌ‏}‏ إِلَى قَوْلِهِ ‏{‏ فَإِنَّهُمْ ظَالِمُونَ‏}‏",
                "headingArabic": "{‏لَيْسَ لَكَ مِنَ الأَمْرِ شَىْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَالِمُونَ}",
                "headingUrdu": "’’فیصلہ تمہارے لیے نہیں ہے…‘‘",
                "headingEnglish": "“Not for you is the decision…”",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3884,
                "hadithNumber": "4070",
                "englishNarrator": "Narrated Salim bin `Abdullah:",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) used to invoke evil upon Safwan bin Umaiya, Suhail bin `Amr and Al-Harith bin Hisham. So the Verse was revealed:-- \"Not for you (O Muhammad!)......(till the end of Verse) For they are indeed wrong-doers.\" (3.128)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم صفوان بن امیہ، سہیل بن عمرو اور حارث بن ہشام کے لیے بددعا کرتے تھے اس پر یہ آیت «ليس لك من الأمر شىء‏» سے «فإنهم ظالمون‏» تک نازل ہوئی۔",
                "urduNarrator": "اور حنظلہ بن ابی سفیان سے روایت ہے، انہوں نے بیان کیا کہ میں نے سالم بن عبداللہ سے سنا، وہ بیان کرتے تھے کہ",
                "hadithArabic": "وَعَنْ حَنْظَلَةَ بْنِ أَبِي سُفْيَانَ، سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْعُو عَلَى صَفْوَانَ بْنِ أُمَيَّةَ وَسُهَيْلِ بْنِ عَمْرٍو وَالْحَارِثِ بْنِ هِشَامٍ فَنَزَلَتْ ‏{‏لَيْسَ لَكَ مِنَ الأَمْرِ شَىْءٌ‏}‏ إِلَى قَوْلِهِ ‏{‏فَإِنَّهُمْ ظَالِمُونَ‏}‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3885,
                "hadithNumber": "4071",
                "englishNarrator": "Narrated Tha`laba bin Abi Malik:",
                "hadithEnglish": "`Umar bin Al-Khattab رضی اللہ عنہ distributed woolen clothes amongst some women of Medina, and a nice woolen garment remained. Some of those who were sitting with him, said, \"O chief of the believers! Give it to the daughter of Allah's Messenger (ﷺ) who is with you,\" and by that, they meant Um Kulthum, the daughter of `Ali رضی اللہ عنہا . `Umar رضی اللہ عنہ said, \"Um Salit رضی اللہ عنہا has got more right than she.\" Um Salit رضی اللہ عنہا was amongst those Ansari women who had given the pledge of allegiance to Allah's Messenger (ﷺ) . `Umar رضی اللہ عنہ added, \"She (i.e. Um Salit رضی اللہ عنہا          ) used to carry the filled water skins for us on the day of the battle of Uhud.\"",
                "hadithUrdu": "عمر بن خطاب رضی اللہ عنہ نے مدینہ کی خواتین میں چادریں تقسیم کروائیں۔ ایک عمدہ قسم کی چادر باقی بچ گئی تو ایک صاحب نے جو وہیں موجود تھے، عرض کیا: یا امیرالمؤمنین! یہ چادر رسول اللہ صلی اللہ علیہ وسلم کی نواسی کو دے دیجئیے جو آپ کے نکاح میں ہیں۔ ان کا اشارہ ام کلثوم بنت علی رضی اللہ عنہا کی طرف تھا۔ لیکن عمر رضی اللہ عنہ بولے کہ ام سلیط رضی اللہ عنہا ان سے زیادہ مستحق ہیں۔ ام سلیط رضی اللہ عنہا کا تعلق قبیلہ انصار سے تھا اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی تھی۔ عمر رضی اللہ عنہ نے کہا کہ غزوہ احد میں وہ ہمارے لیے پانی کی مشک بھربھر کر لاتی تھیں۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے یونس نے بیان کیا، ان سے ابن شہاب نے بیان کیا کہ ثعلبہ بن ابی مالک نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، وَقَالَ ثَعْلَبَةُ بْنُ أَبِي مَالِكٍ إِنَّ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ قَسَمَ مُرُوطًا بَيْنَ نِسَاءٍ مِنْ نِسَاءِ أَهْلِ الْمَدِينَةِ، فَبَقِيَ مِنْهَا مِرْطٌ جَيِّدٌ، فَقَالَ لَهُ بَعْضُ مَنْ عِنْدَهُ يَا أَمِيرَ الْمُؤْمِنِينَ أَعْطِ هَذَا بِنْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم الَّتِي عِنْدَكَ‏.‏ يُرِيدُونَ أُمَّ كُلْثُومٍ بِنْتَ عَلِيٍّ‏.‏ فَقَالَ عُمَرُ أُمُّ سَلِيطٍ أَحَقُّ بِهِ‏.‏ وَأُمُّ سَلِيطٍ مِنْ نِسَاءِ الأَنْصَارِ مِمَّنْ بَايَعَ رَسُولَ اللَّهِ صلى الله عليه وسلم، قَالَ عُمَرُ فَإِنَّهَا كَانَتْ تُزْفِرُ لَنَا الْقِرَبَ يَوْمَ أُحُدٍ‏.‏",
                "headingArabic": "ذِكْرِ أُمِّ سَلِيطٍ",
                "headingUrdu": "ام سلط سے متعلق روایت",
                "headingEnglish": "Narration regarding Umm Salit",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3886,
                "hadithNumber": "4072",
                "englishNarrator": "Narrated Jafar bin `Amr bin Umaiya رضی اللہ عنہ :",
                "hadithEnglish": "I went out with 'Ubaidullah bin `Adi Al-Khaiyar رضی اللہ عنہ . When we reached Hims (i.e. a town in Syria), 'Ubaidullah bin `Adi رضی اللہ عنہ said (to me), \"Would you like to see Wahshi so that we may ask him about the killing of Hamza رضی اللہ عنہ ?\" I replied, \"Yes.\" Wahshi used to live in Hims. We enquired about him and somebody said to us, \"He is that in the shade of his palace, as if he were a full water skin.\" So we went up to him, and when we were at a short distance from him, we greeted him and he greeted us in return. 'Ubaidullah was wearing his turban and Wahshi could not see except his eyes and feet. 'Ubaidullah said, \"O Wahshi! Do you know me?\" Wahshi looked at him and then said, \"No, by Allah! But I know that `Adi bin Al-Khiyar married a woman called Um Qital, the daughter of Abu Al-Is, and she delivered a boy for him at Mecca, and I looked for a wet nurse for that child. (Once) I carried that child along with his mother and then I handed him over to her, and your feet resemble that child's feet.\" Then 'Ubaidullah uncovered his face and said (to Wahshi), \"Will you tell us (the story of) the killing of Hamza رضی اللہ عنہ ?\" Wahshi replied \"Yes, Hamza رضی اللہ عنہ killed Tuaima bin `Adi bin Al-Khaiyar at Badr (battle) so my master, Jubair bin Mut`im said to me, 'If you kill Hamza in revenge for my uncle, then you will be set free.\" When the people set out (for the battle of Uhud) in the year of 'Ainain ..'Ainain is a mountain near the mountain of Uhud, and between it and Uhud there is a valley.. I went out with the people for the battle. When the army aligned for the fight, Siba' came out and said, 'Is there any (Muslim) to accept my challenge to a duel?' Hamza bin `Abdul Muttalib رضی اللہ عنہ came out and said, 'O Siba'. O Ibn Um Anmar, the one who circumcises other ladies! Do you challenge Allah and His Apostle?' Then Hamza attacked and killed him, causing him to be non-extant like the bygone yesterday. I hid myself under a rock, and when he (i.e. Hamza) came near me, I threw my spear at him, driving it into his umbilicus so that it came out through his buttocks, causing him to die. When all the people returned to Mecca, I too returned with them. I stayed in (Mecca) till Islam spread in it (i.e. Mecca). Then I left for Taif, and when the people (of Taif) sent their messengers to Allah's Messenger (ﷺ), I was told that the Prophet (ﷺ) did not harm the messengers; So I too went out with them till I reached Allah's Messenger (ﷺ). When he saw me, he said, 'Are you Wahshi?' I said, 'Yes.' He said, 'Was it you who killed Hamza?' I replied, 'What happened is what you have been told of.' He said, 'Can you hide your face from me?' So I went out when Allah's Messenger (ﷺ) died, and Musailamah Al-Kadhdhab appeared (claiming to be a prophet). I said, 'I will go out to Musailamah so that I may kill him, and make amends for killing Hamza رضی اللہ عنہ . So I went out with the people (to fight Musailamah and his followers) and then famous events took place concerning that battle. Suddenly I saw a man (i.e. Musailamah) standing near a gap in a wall. He looked like an ash-colored camel and his hair was dishevelled. So I threw my spear at him, driving it into his chest in between his breasts till it passed out through his shoulders, and then an Ansari man attacked him and struck him on the head with a sword. `Abdullah bin `Umar رضی اللہ عنہ said, 'A slave girl on the roof of a house said: Alas! The chief of the believers (i.e. Musailamah) has been killed by a black slave.\"",
                "hadithUrdu": "میں عبیداللہ بن عدی بن خیار رضی اللہ عنہ کے ساتھ روانہ ہوا۔ جب حمص پہنچے تو مجھ سے عبیداللہ رضی اللہ عنہ نے کہا، آپ کو وحشی ( ابن حرب حبشی جس نے غزوہ احد میں حمزہ رضی اللہ عنہ کو قتل کیا اور ہندہ زوجہ ابوسفیان نے ان کی لاش کا مثلہ کیا تھا ) سے تعارف ہے۔ ہم چل کے ان سے حمزہ رضی اللہ عنہ کی شہادت کے بارے میں معلوم کرتے ہیں۔ میں نے کہا کہ ٹھیک ہے ضرور چلو۔ وحشی حمص میں موجود تھے۔ چنانچہ ہم نے لوگوں سے ان کے بارے میں معلوم کیا تو ہمیں بتایا گیا کہ وہ اپنے مکان کے سائے میں بیٹھے ہوئے ہیں، جیسے کوئی بڑا سا کپا ہو۔ انہوں نے بیان کیا کہ پھر ہم ان کے پاس آئے اور تھوڑی دیر ان کے پاس کھڑے رہے۔ پھر سلام کیا تو انہوں نے سلام کا جواب دیا۔ بیان کیا کہ عبیداللہ نے اپنے عمامہ کو جسم پر اس طرح لپیٹ رکھا تھا کہ وحشی صرف ان کی آنکھیں اور پاؤں دیکھ سکتے تھے۔ عبیداللہ نے پوچھا: اے وحشی! کیا تم نے مجھے پہچانا؟ راوی نے بیان کیا کہ پھر اس نے عبیداللہ کو دیکھا اور کہا کہ نہیں، اللہ کی قسم! البتہ میں اتنا جانتا ہوں کہ عدی بن خیار نے ایک عورت سے نکاح کیا تھا۔ اسے ام قتال بنت ابی العیص کہا جاتا تھا پھر مکہ میں اس کے یہاں ایک بچہ پیدا ہوا اور میں اس کے لیے کسی دایا کی تلاش کے لیے گیا تھا۔ پھر میں اس بچے کو اس کی ( رضاعی ) ماں کے پاس لے گیا اور اس کی والدہ بھی ساتھ تھی۔ غالباً میں نے تمہارے پاؤں دیکھے تھے۔ بیان کیا کہ اس پر عبیداللہ بن عدی رضی اللہ عنہ نے اپنے چہرے سے کپڑا ہٹا لیا اور کہا، ہمیں تم حمزہ رضی اللہ عنہ کی شہادت کے واقعات بتا سکتے ہو؟ انہوں نے کہا کہ ہاں، بات یہ ہوئی کہ بدر کی لڑائی میں حمزہ رضی اللہ عنہ نے طعیمہ بن عدی بن خیار کو قتل کیا تھا۔ میرے آقا جبیر بن مطعم نے مجھ سے کہا کہ اگر تم نے حمزہ رضی اللہ عنہ کو میرے چچا ( طعیمہ ) کے بدلے میں قتل کر دیا تو تم آزاد ہو جاؤ گے۔ انہوں نے بتایا کہ پھر جب قریش عینین کی جنگ کے لیے نکلے۔ عینین احد کی ایک پہاڑی ہے اور اس کے اور احد کے درمیان ایک وادی حائل ہے۔ تو میں بھی ان کے ساتھ جنگ کے ارادہ سے ہو لیا۔ جب ( دونوں فوجیں آمنے سامنے ) لڑنے کے لیے صف آراء ہو گئیں تو ( قریش کی صف میں سے ) سباع بن عبدالعزیٰ نکلا اور اس نے آواز دی، ہے کوئی لڑنے والا؟ بیان کیا کہ ( اس کی اس دعوت مبازرت پر ) امیر حمزہ بن عبدالمطلب رضی اللہ عنہ نکل کر آئے اور فرمایا، اے سباع! اے ام انمار کے بیٹے! جو عورتوں کے ختنے کیا کرتی تھی، تو اللہ اور اس کے رسول سے لڑنے آیا ہے؟ بیان کیا کہ پھر حمزہ رضی اللہ عنہ نے اس پر حملہ کیا ( اور اسے قتل کر دیا ) اب وہ واقعہ گزرے ہوئے دن کی طرح ہو چکا تھا۔ وحشی نے بیان کیا کہ ادھر میں ایک چٹان کے نیچے حمزہ رضی اللہ عنہ کی تاک میں تھا اور جوں ہی وہ مجھ سے قریب ہوئے، میں نے ان پر اپنا چھوٹا نیزہ پھینک کر مارا، نیزہ ان کی ناف کے نیچے جا کر لگا اور ان کی سرین کے پار ہو گیا۔ بیان کیا کہ یہی ان کی شہادت کا سبب بنا، پھر جب قریش واپس ہوئے تو میں بھی ان کے ساتھ واپس آ گیا اور مکہ میں مقیم رہا۔ لیکن جب مکہ بھی اسلامی سلطنت کے تحت آ گیا تو میں طائف چلا گیا۔ طائف والوں نے بھی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک قاصد بھیجا تو مجھ سے وہاں کے لوگوں نے کہا کہ انبیاء کسی پر زیادتی نہیں کرتے ( اس لیے تم مسلمان ہو جاؤ۔ اسلام قبول کرنے کے بعد تمہاری پچھلی تمام غلطیاں معاف ہو جائیں گی ) چنانچہ میں بھی ان کے ساتھ روانہ ہوا۔ جب نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پہنچا اور آپ نے مجھے دیکھا تو دریافت فرمایا، کیا تمہارا ہی نام وحشی ہے؟ میں نے عرض کیا کہ جی ہاں۔ آپ صلی اللہ علیہ وسلم نے فرمایا: کیا تم ہی نے حمزہ کو قتل کیا تھا؟ میں نے عرض کیا، جو نبی کریم صلی اللہ علیہ وسلم کو اس معاملے میں معلوم ہے وہی صحیح ہے۔ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا: کیا تم ایسا کر سکتے ہو کہ اپنی صورت مجھے کبھی نہ دکھاؤ؟ انہوں نے بیان کیا کہ پھر میں وہاں سے نکل گیا۔ پھر آپ صلی اللہ علیہ وسلم کی جب وفات ہوئی تو مسیلمہ کذاب نے خروج کیا۔ اب میں نے سوچا کہ مجھے مسیلمہ کذاب کے خلاف جنگ میں ضرور شرکت کرنی چاہیے۔ ممکن ہے میں اسے قتل کر دوں اور اس طرح حمزہ رضی اللہ عنہ کے قتل کا بدل ہو سکے۔ انہوں نے بیان کیا کہ پھر میں بھی اس کے خلاف جنگ کے لیے مسلمانوں کے ساتھ نکلا۔ اس سے جنگ کے واقعات سب کو معلوم ہیں۔ بیان کیا کہ ( میدان جنگ میں ) میں نے دیکھا کہ ایک شخص ( مسیلمہ ) ایک دیوار کی دراز سے لگا کھڑا ہے۔ جیسے گندمی رنگ کا کوئی اونٹ ہو۔ سر کے بال منتشر تھے۔ بیان کیا کہ میں نے اس پر بھی اپنا چھوٹا نیزہ پھینک کر مارا۔ نیزہ اس کے سینے پر لگا اور شانوں کو پار کر گیا۔ بیان کیا کہ اتنے میں ایک صحابی انصاری جھپٹے اور تلوار سے اس کی کھوپڑی پر مارا۔ انہوں ( عبدالعزیز بن عبداللہ ) نے کہا، ان سے عبداللہ بن فضل نے بیان کیا کہ پھر مجھے سلیمان بن یسار نے خبر دی اور انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا، وہ بیان کر رہے تھے کہ ( مسیلمہ کے قتل کے بعد ) ایک لڑکی نے چھت پر کھڑی ہو کر اعلان کیا کہ امیرالمؤمنین کو ایک کالے غلام ( یعنی وحشی ) نے قتل کر دیا۔",
                "urduNarrator": "مجھ سے ابو جعفر محمد بن عبداللہ نے بیان کیا، کہا ہم سے حجین بن مثنی نے بیان کیا، کہا ہم سے عبدالعزیز بن عبداللہ بن ابی سلمہ نے بیان کیا، ان سے عبداللہ بن فضل نے، ان سے سلیمان بن یسار نے، ان سے جعفر بن عمرو بن امیہ ضمری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو جَعْفَرٍ، مُحَمَّدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ، قَالَ خَرَجْتُ مَعَ عُبَيْدِ اللَّهِ بْنِ عَدِيِّ بْنِ الْخِيَارِ، فَلَمَّا قَدِمْنَا حِمْصَ قَالَ لِي عُبَيْدُ اللَّهِ هَلْ لَكَ فِي وَحْشِيٍّ نَسْأَلُهُ عَنْ قَتْلِ حَمْزَةَ قُلْتُ نَعَمْ‏.‏ وَكَانَ وَحْشِيٌّ يَسْكُنُ حِمْصَ فَسَأَلْنَا عَنْهُ فَقِيلَ لَنَا هُوَ ذَاكَ فِي ظِلِّ قَصْرِهِ، كَأَنَّهُ حَمِيتٌ‏.‏ قَالَ فَجِئْنَا حَتَّى وَقَفْنَا عَلَيْهِ بِيَسِيرٍ، فَسَلَّمْنَا، فَرَدَّ السَّلاَمَ، قَالَ وَعُبَيْدُ اللَّهِ مُعْتَجِرٌ بِعِمَامَتِهِ، مَا يَرَى وَحْشِيٌّ إِلاَّ عَيْنَيْهِ وَرِجْلَيْهِ، فَقَالَ عُبَيْدُ اللَّهِ يَا وَحْشِيُّ أَتَعْرِفُنِي قَالَ فَنَظَرَ إِلَيْهِ ثُمَّ قَالَ لاَ وَاللَّهِ إِلاَّ أَنِّي أَعْلَمُ أَنَّ عَدِيَّ بْنَ الْخِيَارِ تَزَوَّجَ امْرَأَةً يُقَالُ لَهَا أُمُّ قِتَالٍ بِنْتُ أَبِي الْعِيصِ، فَوَلَدَتْ لَهُ غُلاَمًا بِمَكَّةَ، فَكُنْتُ أَسْتَرْضِعُ لَهُ، فَحَمَلْتُ ذَلِكَ الْغُلاَمَ مَعَ أُمِّهِ، فَنَاوَلْتُهَا إِيَّاهُ، فَلَكَأَنِّي نَظَرْتُ إِلَى قَدَمَيْكَ‏.‏ قَالَ فَكَشَفَ عُبَيْدُ اللَّهِ عَنْ وَجْهِهِ ثُمَّ قَالَ أَلاَ تُخْبِرُنَا بِقَتْلِ حَمْزَةَ قَالَ نَعَمْ، إِنَّ حَمْزَةَ قَتَلَ طُعَيْمَةَ بْنَ عَدِيِّ بْنِ الْخِيَارِ بِبَدْرٍ، فَقَالَ لِي مَوْلاَىَ جُبَيْرُ بْنُ مُطْعِمٍ إِنْ قَتَلْتَ حَمْزَةَ بِعَمِّي فَأَنْتَ حُرٌّ، قَالَ فَلَمَّا أَنْ خَرَجَ النَّاسُ عَامَ عَيْنَيْنِ ـ وَعَيْنَيْنِ جَبَلٌ بِحِيَالِ أُحُدٍ، بَيْنَهُ وَبَيْنَهُ وَادٍ ـ خَرَجْتُ مَعَ النَّاسِ إِلَى الْقِتَالِ، فَلَمَّا اصْطَفُّوا لِلْقِتَالِ خَرَجَ سِبَاعٌ فَقَالَ هَلْ مِنْ مُبَارِزٍ قَالَ فَخَرَجَ إِلَيْهِ حَمْزَةُ بْنُ عَبْدِ الْمُطَّلِبِ فَقَالَ يَا سِبَاعُ يَا ابْنَ أُمِّ أَنْمَارٍ مُقَطِّعَةِ الْبُظُورِ، أَتُحَادُّ اللَّهَ وَرَسُولَهُ صلى الله عليه وسلم قَالَ ثُمَّ شَدَّ عَلَيْهِ فَكَانَ كَأَمْسِ الذَّاهِبِ ـ قَالَ ـ وَكَمَنْتُ لِحَمْزَةَ تَحْتَ صَخْرَةٍ فَلَمَّا دَنَا مِنِّي رَمَيْتُهُ بِحَرْبَتِي، فَأَضَعُهَا فِي ثُنَّتِهِ حَتَّى خَرَجَتْ مِنْ بَيْنِ وَرِكَيْهِ ـ قَالَ ـ فَكَانَ ذَاكَ الْعَهْدَ بِهِ، فَلَمَّا رَجَعَ النَّاسُ رَجَعْتُ مَعَهُمْ فَأَقَمْتُ بِمَكَّةَ، حَتَّى فَشَا فِيهَا الإِسْلاَمُ، ثُمَّ خَرَجْتُ إِلَى الطَّائِفِ، فَأَرْسَلُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم رَسُولاً، فَقِيلَ لِي إِنَّهُ لاَ يَهِيجُ الرُّسُلَ ـ قَالَ ـ فَخَرَجْتُ مَعَهُمْ حَتَّى قَدِمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَآنِي قَالَ ‏\"‏ آنْتَ وَحْشِيٌّ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ أَنْتَ قَتَلْتَ حَمْزَةَ ‏\"‏‏.‏ قُلْتُ قَدْ كَانَ مِنَ الأَمْرِ مَا بَلَغَكَ‏.‏ قَالَ ‏\"‏ فَهَلْ تَسْتَطِيعُ أَنْ تُغَيِّبَ وَجْهَكَ عَنِّي ‏\"‏‏.‏ قَالَ فَخَرَجْتُ، فَلَمَّا قُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَخَرَجَ مُسَيْلِمَةُ الْكَذَّابُ قُلْتُ لأَخْرُجَنَّ إِلَى مُسَيْلِمَةَ لَعَلِّي أَقْتُلُهُ فَأُكَافِئَ بِهِ حَمْزَةَ ـ قَالَ ـ فَخَرَجْتُ مَعَ النَّاسِ، فَكَانَ مِنْ أَمْرِهِ مَا كَانَ ـ قَالَ ـ فَإِذَا رَجُلٌ قَائِمٌ فِي ثَلْمَةِ جِدَارٍ، كَأَنَّهُ جَمَلٌ أَوْرَقُ ثَائِرُ الرَّأْسِ ـ قَالَ ـ فَرَمَيْتُهُ بِحَرْبَتِي، فَأَضَعُهَا بَيْنَ ثَدْيَيْهِ حَتَّى خَرَجَتْ مِنْ بَيْنِ كَتِفَيْهِ ـ قَالَ ـ وَوَثَبَ إِلَيْهِ رَجُلٌ مِنَ الأَنْصَارِ، فَضَرَبَهُ بِالسَّيْفِ عَلَى هَامَتِهِ‏.‏ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ الْفَضْلِ فَأَخْبَرَنِي سُلَيْمَانُ بْنُ يَسَارٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ فَقَالَتْ جَارِيَةٌ عَلَى ظَهْرِ بَيْتٍ وَا أَمِيرَ الْمُؤْمِنِينَ، قَتَلَهُ الْعَبْدُ الأَسْوَدُ‏.‏",
                "headingArabic": "قَتْلِ حَمْزَةَ بْنِ عَبْدِ الْمُطَّلِبِ رَضِيَ اللَّهُ عَنْهُ",
                "headingUrdu": "حمزہ رضی اللہ عنہ کی شہادت",
                "headingEnglish": "The martyrdom of Hamza رضي الله عنه",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3887,
                "hadithNumber": "4073",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) (pointing to his broken canine tooth) said, \"Allah's Wrath has become severe on the people who harmed His Prophet. Allah's Wrath has become severe on the man who is killed by the Apostle of Allah in Allah's Cause.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”اللہ تعالیٰ کا غضب اس قوم پر انتہائی سخت ہوا جس نے اس کے نبی کے ساتھ یہ کیا۔“ آپ صلی اللہ علیہ وسلم کا اشارہ آگے کے دندان مبارک ( کے ٹوٹ جانے ) کی طرف تھا۔ اللہ تعالیٰ کا غضب اس شخص ( ابی بن خلف ) پر انتہائی سخت ہوا۔ جسے اس کے نبی نے اللہ کے راستے میں قتل کیا۔",
                "urduNarrator": "ہم سے اسحاق بن نصر نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، ان سے معمر نے، ان سے ہمام نے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ اشْتَدَّ غَضَبُ اللَّهِ عَلَى قَوْمٍ فَعَلُوا بِنَبِيِّهِ ـ يُشِيرُ إِلَى رَبَاعِيَتِهِ ـ اشْتَدَّ غَضَبُ اللَّهِ عَلَى رَجُلٍ يَقْتُلُهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": "مَا أَصَابَ النَّبِيَّ صلى الله عليه وسلم مِنَ الْجِرَاحِ يَوْمَ أُحُدٍ",
                "headingUrdu": "احد کے دن رسول اللہ صلی اللہ علیہ وسلم کو لگنے والے زخم",
                "headingEnglish": "The wounds inflicted on the Prophet (ﷺ) on the day (of the battle) of Uhud",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3888,
                "hadithNumber": "4074",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Wrath became severe on him whom the Prophet (ﷺ) had killed in Allah's Cause. Allah's Wrath became severe on the people who caused the face of Allah's Prophet to bleed.",
                "hadithUrdu": "اللہ تعالیٰ کا اس شخص پر انتہائی غضب نازل ہوا جسے اللہ کے نبی نے قتل کیا تھا۔ اللہ تعالیٰ کا انتہائی غضب اس قوم پر نازل ہوا جنہوں نے اللہ کے نبی کے چہرہ مبارک کو ( غزوہ احد کے موقع پر ) خون آلود کر دیا تھا۔",
                "urduNarrator": "مجھ سے مخلد بن مالک نے بیان کیا، کہا ہم سے یحییٰ بن سعید اموی نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، ان سے عمرو بن دینار نے بیان کیا، ان سے عکرمہ نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مَخْلَدُ بْنُ مَالِكٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الأُمَوِيُّ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ اشْتَدَّ غَضَبُ اللَّهِ عَلَى مَنْ قَتَلَهُ النَّبِيُّ صلى الله عليه وسلم فِي سَبِيلِ اللَّهِ، اشْتَدَّ غَضَبُ اللَّهِ عَلَى قَوْمٍ دَمَّوْا وَجْهَ نَبِيِّ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3889,
                "hadithNumber": "4075",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "\"By Allah, I know who washed the wounds of Allah's Messenger (ﷺ) and who poured water (for washing them), and with what he was treated.\" Sahl added, \"Fatima رضی اللہ عنہا , the daughter of Allah's Messenger (ﷺ) used to wash the wounds, and `Ali bin Abi Talib رضی اللہ عنہ used to pour water from a shield. When Fatima رضی اللہ عنہا saw that the water aggravated the bleeding, she took a piece of a mat, burnt it, and inserted its ashes into the wound so that the blood was congealed (and bleeding stopped). His canine tooth got broken on that day, and face was wounded, and his helmet was broken on his head.\"",
                "hadithUrdu": "اللہ کی قسم! مجھے اچھی طرح یاد ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے زخموں کو کس نے دھویا تھا اور کون ان پر پانی ڈال رہا تھا اور جس دوا سے آپ کا علاج کیا گیا۔ انہوں نے بیان کیا کہ فاطمہ رضی اللہ عنہا رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی خون کو دھو رہی تھیں۔ علی رضی اللہ عنہ ڈھال سے پانی ڈال رہے تھے۔ جب فاطمہ رضی اللہ عنہا نے دیکھا کہ پانی ڈالنے سے خون اور زیادہ نکلا آ رہا ہے تو انہوں نے چٹائی کا ایک ٹکڑا لے کر جلایا اور پھر اسے زخم پر چپکا دیا جس سے خون کا آنا بند ہو گیا۔ اسی دن نبی کریم صلی اللہ علیہ وسلم کے آگے کے دندان مبارک شہید ہوئے تھے۔ آپ صلی اللہ علیہ وسلم کا چہرہ مبارک بھی زخمی ہو گیا تھا اور خود سر مبارک پر ٹوٹ گئی تھی۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے یعقوب نے بیان کیا، ان سے ابوحازم نے اور انہوں نے سہل بن سعد رضی اللہ عنہ سے سنا، ان سے نبی کریم صلی اللہ علیہ وسلم کے (غزوہ احد کے موقع پر ہونے والے) زخموں کے متعلق پوچھا گیا، تو انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، عَنْ أَبِي حَازِمٍ، أَنَّهُ سَمِعَ سَهْلَ بْنَ سَعْدٍ، وَهْوَ يُسْأَلُ عَنْ جُرْحِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَمَا وَاللَّهِ إِنِّي لأَعْرِفُ مَنْ كَانَ يَغْسِلُ جُرْحَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَمَنْ كَانَ يَسْكُبُ الْمَاءَ وَبِمَا دُووِيَ ـ قَالَ كَانَتْ فَاطِمَةُ ـ عَلَيْهَا السَّلاَمُ ـ بِنْتُ رَسُولِ اللَّهِ صلى الله عليه وسلم تَغْسِلُهُ وَعَلِيٌّ يَسْكُبُ الْمَاءَ بِالْمِجَنِّ، فَلَمَّا رَأَتْ فَاطِمَةُ أَنَّ الْمَاءَ لاَ يَزِيدُ الدَّمَ إِلاَّ كَثْرَةً أَخَذَتْ قِطْعَةً مِنْ حَصِيرٍ، فَأَحْرَقَتْهَا وَأَلْصَقَتْهَا فَاسْتَمْسَكَ الدَّمُ، وَكُسِرَتْ رَبَاعِيَتُهُ يَوْمَئِذٍ، وَجُرِحَ وَجْهُهُ، وَكُسِرَتِ الْبَيْضَةُ عَلَى رَأْسِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3890,
                "hadithNumber": "4076",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Wrath gets severe on a person killed by a prophet, and Allah's Wrath became severe on him who had caused the face of Allah's Messenger (ﷺ) to bleed.",
                "hadithUrdu": "اللہ تعالیٰ کا انتہائی غضب اس شخص پر نازل ہوا جسے اللہ کے نبی نے قتل کیا تھا۔ اللہ تعالیٰ کا انتہائی غضب اس شخص پر نازل ہوا جس نے ( یعنی عبداللہ بن قمیہ نے لعنتہ اللہ علیہ ) رسول اللہ صلی اللہ علیہ وسلم کے چہرہ مبارک کو خون آلود کیا تھا۔",
                "urduNarrator": "مجھ سے عمرو بن علی نے بیان کیا، کہا ہم سے ابوعاصم نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، ان سے عمرو بن دینار نے، ان سے عکرمہ نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ اشْتَدَّ غَضَبُ اللَّهِ عَلَى مَنْ قَتَلَهُ نَبِيٌّ، اشْتَدَّ غَضَبُ اللَّهِ عَلَى مَنْ دَمَّى وَجْهَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3891,
                "hadithNumber": "4077",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Regarding the Holy Verse: \"Those who responded (To the call) of Allah And the Apostle (Muhammad), After being wounded, For those of them Who did good deeds And refrained from wrong, there is a great reward.\" (3.172) She said to `Urwa, \"O my nephew! Your father, Az-Zubair رضی اللہ عنہ and Abu Bakr رضی اللہ عنہ were amongst them (i.e. those who responded to the call of Allah and the Apostle on the day (of the battle of Uhud). When Allah's Messenger (ﷺ), suffered what he suffered on the day of Uhud and the pagans left, the Prophet (ﷺ) was afraid that they might return. So he said, 'Who will go on their (i.e. pagans') track?' He then selected seventy men from amongst them (for this purpose).\" (The sub-narrator added, \"Abu Bakr رضی اللہ عنہ and Az- Zubair رضی اللہ عنہ were amongst them.\")",
                "hadithUrdu": "( آیت ) «الذين استجابوا لله والرسول من بعد ما أصابهم القرح للذين أحسنوا منهم واتقوا أجر عظيم‏» ”وہ لوگ جنہوں نے اللہ اور اس کے رسول کی آواز پر لبیک کہا۔“ انہوں نے عروہ سے اس آیت کے متعلق کہا، میرے بھانجے! تمہارے والد زبیر رضی اللہ عنہ اور ( نانا ) ابوبکر رضی اللہ عنہ بھی انہیں میں سے تھے۔ احد کی لڑائی میں رسول اللہ صلی اللہ علیہ وسلم کو جو کچھ تکلیف پہنچنی تھی جب وہ پہنچی اور مشرکین واپس جانے لگے تو نبی کریم صلی اللہ علیہ وسلم کو اس کا خطرہ ہوا کہ کہیں وہ پھر لوٹ کر حملہ نہ کریں۔ اس لیے آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان کا پیچھا کرنے کون کون جائیں گے۔ اسی وقت ستر صحابہ رضی اللہ عنہم تیار ہو گئے۔ راوی نے بیان کیا کہ ابوبکر رضی اللہ عنہ اور زبیر رضی اللہ عنہ بھی انہیں میں سے تھے۔",
                "urduNarrator": "ہم سے محمد نے بیان کیا، کہا ہم سے ابومعاویہ نے بیان کیا، ان سے ہشام نے بیان کیا، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ‏{‏الَّذِينَ اسْتَجَابُوا لِلَّهِ وَالرَّسُولِ مِنْ بَعْدِ مَا أَصَابَهُمُ الْقَرْحُ لِلَّذِينَ أَحْسَنُوا مِنْهُمْ وَاتَّقَوْا أَجْرٌ عَظِيمٌ‏}‏ قَالَتْ لِعُرْوَةَ يَا ابْنَ أُخْتِي كَانَ أَبُوكَ مِنْهُمُ الزُّبَيْرُ وَأَبُو بَكْرٍ، لَمَّا أَصَابَ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا أَصَابَ يَوْمَ أُحُدٍ، وَانْصَرَفَ عَنْهُ الْمُشْرِكُونَ خَافَ أَنْ يَرْجِعُوا قَالَ ‏\"‏ مَنْ يَذْهَبُ فِي إِثْرِهِمْ ‏\"‏‏.‏ فَانْتَدَبَ مِنْهُمْ سَبْعُونَ رَجُلاً، قَالَ كَانَ فِيهِمْ أَبُو بَكْرٍ وَالزُّبَيْرُ‏.‏",
                "headingArabic": "‏{‏الَّذِينَ اسْتَجَابُوا لِلَّهِ وَالرَّسُولِ‏}",
                "headingUrdu": "’’وہ لوگ جنہوں نے اللہ اور رسول کی پکار پر لبیک کہا۔‘‘",
                "headingEnglish": "“Those who answered (the Call of) Allah and the Messenger…”",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3892,
                "hadithNumber": "4078",
                "englishNarrator": "Narrated Qatada:",
                "hadithEnglish": "We do not know of any tribe amongst the 'Arab tribes who lost more martyrs than Al-Ansar, and they will have superiority on the Day of Resurrection. Anas bin Malik رضی اللہ عنہ told us that seventy from the Ansar were martyred on the day of Uhud, and seventy on the day (of the battle of) Bir Ma'una, and seventy on the day of Al-Yamama. Anas added, \"The battle of Bir Ma'una took place during the lifetime of Allah's Messenger (ﷺ) and the battle of Al-Yamama, during the caliphate of Abu Bakr رضی اللہ عنہ , and it was the day when Musailamah Al-Kadhdhab was killed.\"",
                "hadithUrdu": "عرب کے تمام قبائل میں کوئی قبیلہ انصار کے مقابلے میں اس عزت کو حاصل نہیں کر سکا کہ اس کے سب سے زیادہ آدمی شہید ہوئے اور وہ قبیلہ قیامت کے دن سب سے زیادہ عزت کے ساتھ اٹھے گا۔ انس بن مالک رضی اللہ عنہ نے ہم سے بیان کیا کہ غزوہ احد میں قبیلہ انصار کے ستر آدمی شہید ہوئے اور بئرمعونہ کے حادثہ میں اس کے ستر آدمی شہید ہوئے اور یمامہ کی لڑائی میں اس کے ستر آدمی شہید ہوئے۔ راوی نے بیان کیا کہ بئرمعونہ کا واقعہ رسول اللہ صلی اللہ علیہ وسلم کے وقت میں پیش آیا تھا اور یمامہ کی جنگ ابوبکر رضی اللہ عنہ کے عہد خلافت میں ہوئی تھی جو مسیلمہ کذاب سے ہوئی تھی۔",
                "urduNarrator": "ہم سے عمرو بن علی نے بیان کیا، کہا ہم سے معاذ بن ہشام نے بیان کیا، کہا کہ مجھ سے میرے والد نے بیان کیا، ان سے قتادہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، قَالَ مَا نَعْلَمُ حَيًّا مِنْ أَحْيَاءِ الْعَرَبِ أَكْثَرَ شَهِيدًا أَعَزَّ يَوْمَ الْقِيَامَةِ مِنَ الأَنْصَارِ‏.‏ قَالَ قَتَادَةُ وَحَدَّثَنَا أَنَسُ بْنُ مَالِكٍ أَنَّهُ قُتِلَ مِنْهُمْ يَوْمَ أُحُدٍ سَبْعُونَ، وَيَوْمَ بِئْرِ مَعُونَةَ سَبْعُونَ، وَيَوْمَ الْيَمَامَةِ سَبْعُونَ، قَالَ وَكَانَ بِئْرُ مَعُونَةَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم، وَيَوْمُ الْيَمَامَةِ عَلَى عَهْدِ أَبِي بَكْرٍ يَوْمَ مُسَيْلِمَةَ الْكَذَّابِ‏.‏",
                "headingArabic": "مَنْ قُتِلَ مِنَ الْمُسْلِمِينَ يَوْمَ أُحُدٍ",
                "headingUrdu": "وہ مسلمان جو احد کے دن مارے گئے۔",
                "headingEnglish": "The Muslims who were killed on the day of Uhud",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3893,
                "hadithNumber": "4079, 4080",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to shroud two martyrs of Uhud in one sheet and then say, \"Which of them knew Qur'an more?\" When one of the two was pointed out, he would put him first in the grave. Then he said, \"I will be a witness for them on the Day of Resurrection.\" He ordered them to be buried with their blood (on their bodies). Neither was the funeral prayer offered for them, nor were they washed. Jabir رضی اللہ عنہ added, \"When my father was martyred, I started weeping and uncovering his face. The companions of the Prophet (ﷺ) stopped me from doing so but the Prophet (ﷺ) did not stop me. Then the Prophet said, '(O Jabir.) don't weep over him, for the angels kept on covering him with their wings till his body was carried away (for burial).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے احد کے شہداء کو ایک ہی کپڑے میں دو دو کو کفن دیا اور آپ صلی اللہ علیہ وسلم دریافت فرماتے کہ ان میں قرآن کا عالم سب سے زیادہ کون ہے؟ جب کسی ایک کی طرف اشارہ کر کے آپ کو بتایا جاتا تو لحد میں آپ صلی اللہ علیہ وسلم انہی کو آگے فرماتے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ قیامت کے دن میں ان سب پر گواہ رہوں گا۔ پھر آپ نے تمام شہداء کو خون سمیت دفن کرنے کا حکم فرما دیا اور ان کی نماز جنازہ نہیں پڑھی اور نہ انہیں غسل دیا گیا۔جابر رضی اللہ عنہ کہتے ہیں کہ جب میرے والد شہید ہوئے تو میں رونے لگا اور ان کا چہرہ ننگا کرنے لگا، مجھے رسول اللہ صلی اللہ علیہ وسلم کے صحابہ نے ایسا کرنے سے روکا لیکن آپ صلی اللہ علیہ وسلم نے مجھے نہیں روکا، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: جابر رضی اللہ عنہ اس پر نہ رو، کیونکہ فرشتے اسے اپنے پروں سے ڈھانپتے رہے یہاں تک کہ اس کی لاش کو (دفنانے کے لیے) لے جایا گیا۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے ابن شہاب نے، ان سے عبدالرحمٰن بن کعب بن مالک نے اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَجْمَعُ بَيْنَ الرَّجُلَيْنِ مِنْ قَتْلَى أُحُدٍ فِي ثَوْبٍ وَاحِدٍ ثُمَّ يَقُولُ ‏\"‏ أَيُّهُمْ أَكْثَرُ أَخْذًا لِلْقُرْآنِ ‏\"‏‏.‏ فَإِذَا أُشِيرَ لَهُ إِلَى أَحَدٍ، قَدَّمَهُ فِي اللَّحْدِ، وَقَالَ ‏\"‏ أَنَا شَهِيدٌ عَلَى هَؤُلاَءِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ وَأَمَرَ بِدَفْنِهِمْ بِدِمَائِهِمْ، وَلَمْ يُصَلِّ عَلَيْهِمْ، وَلَمْ يُغَسَّلُوا‏.‏وَقَالَ أَبُو الْوَلِيدِ عَنْ شُعْبَةَ، عَنِ ابْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرًا، قَالَ لَمَّا قُتِلَ أَبِي جَعَلْتُ أَبْكِي وَأَكْشِفُ الثَّوْبَ عَنْ وَجْهِهِ،، فَجَعَلَ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم يَنْهَوْنِي وَالنَّبِيُّ صلى الله عليه وسلم لَمْ يَنْهَ، وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ تَبْكِيهِ أَوْ مَا تَبْكِيهِ، مَا زَالَتِ الْمَلاَئِكَةُ تُظِلُّهُ بِأَجْنِحَتِهَا حَتَّى رُفِعَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3894,
                "hadithNumber": "4081",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I saw in a dream that I moved a sword and its blade got broken, and that symbolized the casualties which the believers suffered on the day of Uhud. Then I moved it again, and it became as perfect as it had been, and that symbolized the Conquest (of Mecca) which Allah helped us to achieve, and the union of all the believers. I (also) saw cows in the dream, and what Allah does is always beneficial. Those cows appeared to symbolize the faithful believers (who were martyred) on the day of Uhud.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”میں نے خواب میں دیکھا کہ میں نے تلوار کو ہلایا اور اس سے اس کی دھار ٹوٹ گئی۔ اس کی تعبیر مسلمانوں کے اس نقصان کی شکل میں ظاہر ہوئی جو غزوہ احد میں انہیں اٹھانا پڑا تھا۔ پھر میں نے دوبارہ اس تلوار کو ہلایا، تو پھر وہ اس سے بھی زیادہ عمدہ ہو گئی جیسی پہلے تھی۔ اس کی تعبیر اللہ تعالیٰ نے فتح اور مسلمانوں کے پھر از سر نو اجتماع کی صورت میں ظاہر کی۔ میں نے اسی خواب میں ایک گائے دیکھی تھی ( جو ذبح ہو رہی تھی ) اور اللہ تعالیٰ کے تمام کام خیر و برکت لیے ہوتے ہیں۔ اس کی تعبیر وہ مسلمان تھے ( جو ) احد کی لڑائی میں ( شہید ہوئے ) ۔",
                "urduNarrator": "ہم سے محمد بن علاء نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے یزید بن عبداللہ بن ابی بردہ نے، ان سے ان کے دادا ابوبردہ نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ جَدِّهِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ أُرَى عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ رَأَيْتُ فِي رُؤْيَاىَ أَنِّي هَزَزْتُ سَيْفًا فَانْقَطَعَ صَدْرُهُ، فَإِذَا هُوَ مَا أُصِيبَ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ، ثُمَّ هَزَزْتُهُ أُخْرَى فَعَادَ أَحْسَنَ مَا كَانَ، فَإِذَا هُوَ مَا جَاءَ بِهِ اللَّهُ مِنَ الْفَتْحِ وَاجْتِمَاعِ الْمُؤْمِنِينَ، وَرَأَيْتُ فِيهَا بَقَرًا وَاللَّهُ خَيْرٌ، فَإِذَا هُمُ الْمُؤْمِنُونَ يَوْمَ أُحُدٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3895,
                "hadithNumber": "4082",
                "englishNarrator": "Narrated Khabbab رضی اللہ عنہ :",
                "hadithEnglish": "We migrated with the Prophet (ﷺ) for Allah's Cause, so our reward became due with Allah. Some of us passed away (i.e. died) without enjoying anything from their reward, and one of them was Mus`ab bin `Umar رضی اللہ عنہ who was killed (i.e. martyred) on the day of Uhud. He did not leave behind except a sheet of striped woolen cloth. If we covered his head with it, his feet became naked, and if we covered his feet with it, his head became naked. The Prophet (ﷺ) said to us, \"Cover his head with it and put Idhkhir (i.e. a kind of grass) over his feet,\" or said, \"Put some Idhkhir over his feet.\" But some of us have got their fruits ripened, and they are collecting them.",
                "hadithUrdu": "ہم نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ ہجرت کی اور ہمارا مقصد اس سے صرف اللہ تعالیٰ کی رضا مندی حاصل کرنا تھا۔ ضروری تھا کہ اللہ تعالیٰ ہمیں اس پر ثواب دیتا۔ ہم میں سے بعض لوگ تو وہ تھے جو اللہ سے جا ملے اور ( دنیا میں ) انہوں نے اپنا کوئی ثواب نہیں دیکھا۔ مصعب بن عمیر رضی اللہ عنہ بھی انہیں میں سے تھے۔ غزوہ احد میں انہوں نے شہادت پائی اور ایک چادر کے سوا اور کوئی چیز انہوں نے نہیں چھوڑی۔ اس چادر سے ( کفن دیتے وقت ) جب ہم ان کا سر چھپاتے تو پاؤں کھل جاتے اور پاؤں چھپاتے تو سر کھل جاتا تھا۔ آپ صلی اللہ علیہ وسلم نے ہم سے فرمایا ” «غطوا بها رأسه،‏‏‏‏ واجعلوا على رجليه الإذخر» چادر سے سر چھپا دو اور پاؤں پر اذخر گھاس رکھ دو۔“ یا آپ صلی اللہ علیہ وسلم نے یوں فرمایا ” «ألقوا على رجليه من الإذخر» یعنی ان کے پیروں پر اذخر گھاس ڈال دو۔“ ( دونوں جملوں کا مطلب ایک ہی ہے ) اور ہم میں بعض وہ ہیں جنہیں ان کے اس عمل کا پھل ( اسی دنیا میں ) دے دیا گیا اور وہ اس سے خوب فائدہ اٹھا رہے ہیں۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، کہا ہم سے زہیر نے بیان کیا، کہا ہم سے اعمش نے بیان کیا، ان سے شقیق نے اور ان سے خباب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ خَبَّابٍ ـ رضى الله عنه ـ قَالَ هَاجَرْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم وَنَحْنُ نَبْتَغِي وَجْهَ اللَّهِ، فَوَجَبَ أَجْرُنَا عَلَى اللَّهِ، فَمِنَّا مَنْ مَضَى أَوْ ذَهَبَ لَمْ يَأْكُلْ مِنْ أَجْرِهِ شَيْئًا، كَانَ مِنْهُمْ مُصْعَبُ بْنُ عُمَيْرٍ قُتِلَ يَوْمَ أُحُدٍ، فَلَمْ يَتْرُكْ إِلاَّ نَمِرَةً كُنَّا إِذَا غَطَّيْنَا بِهَا رَأْسَهُ خَرَجَتْ رِجْلاَهُ، وَإِذَا غُطِّيَ بِهَا رِجْلاَهُ خَرَجَ رَأْسُهُ، فَقَالَ لَنَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ غَطُّوا بِهَا رَأْسَهُ، وَاجْعَلُوا عَلَى رِجْلَيْهِ الإِذْخِرَ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ أَلْقُوا عَلَى رِجْلَيْهِ مِنَ الإِذْخِرِ ‏\"‏‏.‏ وَمِنَّا مَنْ أَيْنَعَتْ لَهُ ثَمَرَتُهُ فَهْوَ يَهْدِبُهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3896,
                "hadithNumber": "4083",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"This is a mountain that loves us and is loved by us.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”احد پہاڑ ہم سے محبت رکھتا ہے اور ہم اس سے محبت رکھتے ہیں۔“",
                "urduNarrator": "ہم سے نصر بن علی نے بیان کیا، کہا کہ مجھے میرے والد نے خبر دی، انہیں قرہ بن خالد نے، انہیں قتادہ نے اور انہوں نے انس رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنِي نَصْرُ بْنُ عَلِيٍّ، قَالَ أَخْبَرَنِي أَبِي، عَنْ قُرَّةَ بْنِ خَالِدٍ، عَنْ قَتَادَةَ، سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏‏.‏",
                "headingArabic": "أُحُدٌ يُحِبُّنَا ‏وَنُحِبُّهُ‏",
                "headingUrdu": "’’احد ایک پہاڑ ہے جو ہم سے محبت کرتا ہے اور ہم سے محبت کرتا ہے۔‘‘",
                "headingEnglish": "“Uhud is a mountain that loves us and is loved by us.”",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3897,
                "hadithNumber": "4084",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "When the mountain of Uhud appeared before Allah's Messenger (ﷺ) he said, \"This IS a mountain that loves us and is loved by us. O, Allah! Abraham made Mecca a Sanctuary, and I have made Medina (i.e. the area between its two mountains) a Sanctuary as well.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو ( خیبر سے واپس ہوتے ہوئے ) احد پہاڑ دکھائی دیا تو آپ صلی اللہ علیہ وسلم نے فرمایا ”یہ پہاڑ ہم سے محبت رکھتا ہے اور ہم اس سے محبت رکھتے ہیں۔ اے اللہ! ابراہیم علیہ السلام نے مکہ کو حرمت والا شہر قرار دیا تھا اور میں ان دو پتھریلے میدانوں کے درمیان والے علاقے ( مدینہ منورہ ) کو حرمت والا شہر قرار دیتا ہوں۔“",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، انہیں مطلب کے غلام عمرو بن ابی عمرو نے اور انہیں انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَمْرٍو، مَوْلَى الْمُطَّلِبِ عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَلَعَ لَهُ أُحُدٌ فَقَالَ ‏ \"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ، اللَّهُمَّ إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ، وَإِنِّي حَرَّمْتُ مَا بَيْنَ لاَبَتَيْهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3898,
                "hadithNumber": "4085",
                "englishNarrator": "Narrated `Uqba رضی اللہ عنہ :",
                "hadithEnglish": "One day the Prophet (ﷺ) went out and offered the (funeral) prayer for the people (i.e. martyrs) of Uhud as he used to offer a funeral prayer for any dead person, and then (after returning) he ascended the pulpit and said, \"I am your predecessor before you, and I am a witness upon you, and I am looking at my Tank just now, and I have been given the keys of the treasures of the world (or the keys of the world). By Allah, I am not afraid that you will worship others besides Allah after me, but I am afraid that you will compete with each other for (the pleasures of) this world.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک دن باہر تشریف لائے اور شہداء احد پر نماز جنازہ ادا کی، جیسے مردوں پر ادا کی جاتی ہے۔ پھر آپ صلی اللہ علیہ وسلم منبر پر تشریف لائے اور فرمایا کہ میں تمہارے آگے جاؤں گا، میں تمہارے حق میں گواہ رہوں گا۔ میں اب بھی اپنے حوض ( حوض کوثر ) کو دیکھ رہا ہوں۔ مجھے دنیا کے خزانوں کی کنجی عطا فرمائی گئی ہے یا ( آپ حوض کوثر نے یوں فرمایا ) «مفاتيح الأرض» یعنی زمین کی کنجیاں دی گئی ہیں۔ ( دونوں جملوں کا مطلب ایک ہی ہے ) ۔ اللہ کی قسم! میں تمہارے بارے میں اس سے نہیں ڈرتا کہ تم میرے بعد شرک کرنے لگو گے بلکہ مجھے اس کا ڈر ہے کہ تم دنیا کے لیے حرص کرنے لگو گے۔",
                "urduNarrator": "مجھ سے عمرو بن خالد نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے یزید بن ابی حبیب نے، ان سے ابوالخیر نے اور ان سے عقبہ بن عامر رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلاَتَهُ عَلَى الْمَيِّتِ، ثُمَّ انْصَرَفَ إِلَى الْمِنْبَرِ فَقَالَ ‏ \"‏ إِنِّي فَرَطٌ لَكُمْ، وَأَنَا شَهِيدٌ عَلَيْكُمْ، وَإِنِّي لأَنْظُرُ إِلَى حَوْضِي الآنَ، وَإِنِّي أُعْطِيتُ مَفَاتِيحَ خَزَائِنِ الأَرْضِ ـ أَوْ مَفَاتِيحَ الأَرْضِ ـ وَإِنِّي وَاللَّهِ مَا أَخَافُ عَلَيْكُمْ أَنْ تُشْرِكُوا بَعْدِي، وَلَكِنِّي أَخَافُ عَلَيْكُمْ أَنْ تَنَافَسُوا فِيهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3899,
                "hadithNumber": "4086",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) sent a Sariya of spies and appointed `Asim bin Thabit رضی اللہ عنہ +, the grandfather of `Asim bin `Umar bin Al-Khattab, as their leader. So they set out, and when they reached (a place) between 'Usfan and Mecca, they were mentioned to one of the branch tribes of Bani Hudhail called Lihyan. So, about one-hundred archers followed their traces till they (i.e. the archers) came to a journey station where they (i.e. `Asim and his companions) had encamped and found stones of dates they had brought as journey food from Medina. The archers said, \"These are the dates of Medina,\" and followed their traces till they took them over. When `Asim and his companions were not able to go ahead, they went up a high place, and their pursuers encircled them and said, \"You have a covenant and a promise that if you come down to us, we will not kill anyone of you.\" `Asim said, \"As for me, I will never come down on the security of an infidel. O Allah! Inform Your Prophet about us.\" So they fought with them till they killed `Asim along with seven of his companions with arrows, and there remained Khubaib رضی اللہ عنہ , Zaid and another man to whom they gave a promise and a covenant. So when the infidels gave them the covenant and promise, they came down. When they captured them, they opened the strings of their arrow bows and tied them with it. The third man who was with them said, \"This is the first breach in the covenant,\" and refused to accompany them. They dragged him and tried to make him accompany them, but he refused, and they killed him. Then they proceeded on taking Khubaib and Zaid till they sold them in Mecca. The sons of Al-Harith bin `Amr bin Naufal bought Khubaib. It was Khubaib who had killed Al-Harith bin `Amr on the day of Badr. Khubaib stayed with them for a while as a captive till they decided unanimously to kill him. (At that time) Khubaib borrowed a razor from one of the daughters of Al- Harith to shave his pubic hair. She gave it to him. She said later on, \"I was heedless of a little baby of mine, who moved towards Khubaib, and when it reached him, he put it on his thigh. When I saw it, I got scared so much that Khubaib noticed my distress while he was carrying the razor in his hand. He said 'Are you afraid that I will kill it? Allah willing, I will never do that,' \" Later on she used to say, \"I have never seen a captive better than Khubaib Once I saw him eating from a bunch of grapes although at that time no fruits were available at Mecca, and he was fettered with iron chains, and in fact, it was nothing but food bestowed upon him by Allah.\" So they took him out of the Sanctuary (of Mecca) to kill him. He said, \"Allow me to offer a two-rak`at prayer.\" Then he went to them and said, \"Had I not been afraid that you would think I was afraid of death, I would have prayed for a longer time.\" So it was Khubaib who first set the tradition of praying two rak`at before being executed. He then said, \"O Allah! Count them one by one,\" and added, 'When I am being martyred as a Muslim, I do not care in what way I receive my death for Allah's Sake, because this death is in Allah's Cause. If He wishes, He will bless the cut limbs.\" Then `Uqba bin Al-Harith got up and martyred him. The narrator added: The Quraish (infidels) sent some people to `Asim رضی اللہ عنہ in order to bring a part of his body so that his death might be known for certain, for `Asim رضی اللہ عنہ had killed one of their chiefs on the day of Badr. But Allah sent a cloud of wasps which protected his body from their messengers who could not harm his body consequently.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے جاسوسی کے لیے ایک جماعت ( مکہ، قریش کی خبر لانے کے لیے ) بھیجی اور اس کا امیر عاصم بن ثابت رضی اللہ عنہ کو بنایا، جو عاصم بن عمر بن خطاب کے نانا ہیں۔ یہ جماعت روانہ ہوئی اور جب عسفان اور مکہ کے درمیان پہنچی تو قبیلہ ہذیل کے ایک قبیلے کو جسے بنو لحیان کہا جاتا تھا، ان کا علم ہو گیا اور قبیلہ کے تقریباً سو تیر اندازوں نے ان کا پیچھا کیا اور ان کے نشانات قدم کو تلاش کرتے ہوئے چلے۔ آخر ایک ایسی جگہ پہنچنے میں کامیاب ہو گئے جہاں صحابہ کی اس جماعت نے پڑاؤ کیا تھا۔ وہاں ان کھجوروں کی گٹھلیاں ملیں جو صحابہ مدینہ سے لائے تھے۔ قبیلہ والوں نے کہا کہ یہ تو یثرب کی کھجور ( کی گھٹلی ) ہے اب انہوں نے پھر تلاش شروع کی اور صحابہ کو پا لیا۔ عاصم رضی اللہ عنہ اور ان کے ساتھیوں نے جب یہ صورت حال دیکھی تو صحابہ کی اس جماعت نے ایک ٹیلے پر چڑھ کر پناہ لی۔ قبیلہ والوں نے وہاں پہنچ کر ٹیلہ کو اپنے گھیرے میں لے لیا اور صحابہ سے کہا کہ ہم تمہیں یقین دلاتے ہیں اور عہد کرتے ہیں کہ اگر تم نے ہتھیار ڈال دیئے تو ہم تم میں سے کسی کو بھی قتل نہیں کریں گے۔ اس پر عاصم رضی اللہ عنہ بولے کہ میں تو کسی کافر کی حفاظت و امن میں خود کو کسی صورت میں بھی نہیں دے سکتا۔ اے اللہ! ہمارے ساتھ پیش آنے والے حالات کی خبر اپنے نبی کو پہنچا دے۔ چنانچہ ان صحابہ نے ان سے قتال کیا اور عاصم اپنے سات ساتھیوں کے ساتھ ان کے تیروں سے شہید ہو گئے۔ خبیب، زید اور ایک اور صحابی ان کے حملوں سے ابھی محفوظ تھے۔ قبیلہ والوں نے پھر حفاظت و امان کا یقین دلایا۔ یہ حضرات ان کی یقین دہانی پر اتر آئے۔ پھر جب قبیلہ والوں نے انہیں پوری طرح اپنے قبضے میں لے لیا تو ان کی کمان کی تانت اتار کر ان صحابہ کو انہیں سے باندھ دیا۔ تیسرے صحابہ جو خبیب اور زید کے ساتھ تھے، انہوں نے کہا کہ یہ تمہاری پہلی غداری ہے۔ انہوں نے ان کے ساتھ جانے سے انکار کر دیا۔ پہلے تو قبیلہ والوں نے انہیں گھسیٹا اور اپنے ساتھ لے جانے کے لیے زور لگاتے رہے لیکن جب وہ کسی طرح تیار نہ ہوئے تو انہیں وہیں قتل کر دیا اور خبیب اور زید کو ساتھ لے کر روانہ ہوئے۔ پھر انہیں مکہ میں لا کر بیچ دیا۔ خبیب رضی اللہ عنہ کو تو حارث بن عامر بن نوفل کے بیٹوں نے خرید لیا کیونکہ خبیب رضی اللہ عنہ نے بدر کی جنگ میں حارث کو قتل کیا تھا۔ وہ ان کے یہاں کچھ دنوں تک قیدی کی حیثیت سے رہے۔ جس وقت ان سب کا خبیب رضی اللہ عنہ کے قتل پر اتفاق ہو چکا تو اتفاق سے انہیں دنوں حارث کی ایک لڑکی ( زینب ) سے انہوں نے موئے زیر ناف صاف کرنے کے لیے استرہ مانگا اور انہوں نے ان کو استرہ بھی دے دیا تھا۔ ان کا بیان تھا کہ میرا لڑکا میری غفلت میں خبیب رضی اللہ عنہ کے پاس چلا گیا۔ انہوں نے اسے اپنی ران پر بٹھا لیا۔ میں نے جو اسے اس حالت میں دیکھا تو بہت گھبرائی۔ انہوں نے میری گھبراہٹ کو جان لیا، استرہ ان کے ہاتھ میں تھا۔ انہوں نے مجھ سے کہا، کیا تمہیں اس کا خطرہ ہے کہ میں اس بچے کو قتل کر دوں گا؟ ان شاءاللہ میں ہرگز ایسا نہیں کر سکتا۔ ان کا بیان تھا کہ خبیب رضی اللہ عنہ سے بہتر قیدی میں نے کبھی نہیں دیکھا تھا۔ میں نے انہیں انگور کا خوشہ کھاتے ہوئے دیکھا حالانکہ اس وقت مکہ میں کسی طرح کا پھل موجود نہیں تھا جبکہ وہ زنجیروں میں جکڑے ہوئے بھی تھے، تو وہ اللہ کی بھیجی ہوئی روزی تھی۔ پھر حارث کے بیٹے قتل کرنے کے لیے انہیں لے کر حرم کے حدود سے باہر گئے۔ خبیب رضی اللہ عنہ نے ان سے فرمایا کہ مجھے دو رکعت نماز پڑھنے کی اجازت دو ( انہوں نے اجازت دے دی اور ) ۔ جب وہ نماز سے فارغ ہوئے تو ان سے فرمایا کہ اگر تم یہ خیال نہ کرنے لگتے کہ میں موت سے گھبرا گیا ہوں تو اور زیادہ نماز پڑھتا۔ خبیب رضی اللہ عنہ ہی پہلے وہ شخص ہیں جن سے قتل سے پہلے دو رکعت نماز کا طریقہ چلا ہے۔ اس کے بعد انہوں نے ان کے لیے بددعا کی، اے اللہ! انہیں ایک ایک کر کے ہلاک کر دے اور یہ اشعار پڑھے ”جب کہ میں مسلمان ہونے کی حالت میں قتل کیا جا رہا ہوں تو مجھے اس کی کوئی پرواہ نہیں کہ کس پہلو پر اللہ کی راہ میں مجھے قتل کیا جائے گا۔ یہ سب کچھ اللہ کی راہ میں ہے اور اگر وہ چاہے گا تو جسم کے ایک ایک کٹے ہوئے ٹکڑے میں برکت دے گا۔“ پھر عقبہ بن حارث نے کھڑے ہو کر انہیں شہید کر دیا اور قریش نے عاصم رضی اللہ عنہ کی لاش کے لیے آدمی بھیجے تاکہ ان کے جسم کا کوئی بھی حصہ لائیں جس سے انہیں پہچانا جا سکے۔ عاصم رضی اللہ عنہ نے قریش کے ایک بہت بڑے، سردار کو بدر کی لڑائی میں قتل کیا تھا لیکن اللہ تعالیٰ نے بھڑوں کی ایک فوج کو بادل کی طرح ان کے اوپر بھیجا اور ان بھڑوں نے ان کی لاش کو قریش کے آدمیوں سے محفوظ رکھا اور قریش کے بھیجے ہوئے یہ لوگ ( ان کے پاس نہ پھٹک سکے ) کچھ نہ کر سکے۔",
                "urduNarrator": "مجھ سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم کو ہشام بن یوسف نے خبر دی، انہیں معمر بن راشد نے، انہیں زہری نے، انہیں عمرو بن ابی سفیان ثقفی نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عَمْرِو بْنِ أَبِي سُفْيَانَ الثَّقَفِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم سَرِيَّةً عَيْنًا، وَأَمَّرَ عَلَيْهِمْ عَاصِمَ بْنَ ثَابِتٍ ـ وَهْوَ جَدُّ عَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ ـ فَانْطَلَقُوا حَتَّى إِذَا كَانَ بَيْنَ عُسْفَانَ وَمَكَّةَ ذُكِرُوا لَحِيٍّ مِنْ هُذَيْلٍ، يُقَالُ لَهُمْ بَنُو لَحْيَانَ، فَتَبِعُوهُمْ بِقَرِيبٍ مِنْ مِائَةِ رَامٍ، فَاقْتَصُّوا آثَارَهُمْ حَتَّى أَتَوْا مَنْزِلاً نَزَلُوهُ فَوَجَدُوا فِيهِ نَوَى تَمْرٍ تَزَوَّدُوهُ مِنَ الْمَدِينَةِ فَقَالُوا هَذَا تَمْرُ يَثْرِبَ‏.‏ فَتَبِعُوا آثَارَهُمْ حَتَّى لَحِقُوهُمْ، فَلَمَّا انْتَهَى عَاصِمٌ وَأَصْحَابُهُ لَجَئُوا إِلَى فَدْفَدٍ، وَجَاءَ الْقَوْمُ فَأَحَاطُوا بِهِمْ، فَقَالُوا لَكُمُ الْعَهْدُ وَالْمِيثَاقُ إِنْ نَزَلْتُمْ إِلَيْنَا أَنْ لاَ نَقْتُلَ مِنْكُمْ رَجُلاً‏.‏ فَقَالَ عَاصِمٌ أَمَّا أَنَا فَلاَ أَنْزِلُ فِي ذِمَّةِ كَافِرٍ، اللَّهُمَّ أَخْبِرْ عَنَّا نَبِيَّكَ‏.‏ فَقَاتَلُوهُمْ حَتَّى قَتَلُوا عَاصِمًا فِي سَبْعَةِ نَفَرٍ بِالنَّبْلِ، وَبَقِيَ خُبَيْبٌ، وَزَيْدٌ وَرَجُلٌ آخَرُ، فَأَعْطَوْهُمُ الْعَهْدَ وَالْمِيثَاقَ، فَلَمَّا أَعْطَوْهُمُ الْعَهْدَ وَالْمِيثَاقَ نَزَلُوا إِلَيْهِمْ، فَلَمَّا اسْتَمْكَنُوا مِنْهُمْ حَلُّوا أَوْتَارَ قِسِيِّهِمْ فَرَبَطُوهُمْ بِهَا‏.‏ فَقَالَ الرَّجُلُ الثَّالِثُ الَّذِي مَعَهُمَا هَذَا أَوَّلُ الْغَدْرِ‏.‏ فَأَبَى أَنْ يَصْحَبَهُمْ فَجَرَّرُوهُ وَعَالَجُوهُ عَلَى أَنْ يَصْحَبَهُمْ، فَلَمْ يَفْعَلْ، فَقَتَلُوهُ، وَانْطَلَقُوا بِخُبَيْبٍ وَزَيْدٍ حَتَّى بَاعُوهُمَا بِمَكَّةَ، فَاشْتَرَى خُبَيْبًا بَنُو الْحَارِثِ بْنِ عَامِرِ بْنِ نَوْفَلٍ، وَكَانَ خُبَيْبٌ هُوَ قَتَلَ الْحَارِثَ يَوْمَ بَدْرٍ، فَمَكَثَ عِنْدَهُمْ أَسِيرًا حَتَّى إِذَا أَجْمَعُوا قَتْلَهُ اسْتَعَارَ مُوسَى مِنْ بَعْضِ بَنَاتِ الْحَارِثِ أَسْتَحِدَّ بِهَا فَأَعَارَتْهُ، قَالَتْ فَغَفَلْتُ عَنْ صَبِيٍّ لِي فَدَرَجَ إِلَيْهِ حَتَّى أَتَاهُ، فَوَضَعَهُ عَلَى فَخِذِهِ، فَلَمَّا رَأَيْتُهُ فَزِعْتُ فَزْعَةً عَرَفَ ذَاكَ مِنِّي، وَفِي يَدِهِ الْمُوسَى فَقَالَ أَتَخْشَيْنَ أَنْ أَقْتُلَهُ مَا كُنْتُ لأَفْعَلَ ذَاكِ إِنْ شَاءَ اللَّهُ‏.‏ وَكَانَتْ تَقُولُ مَا رَأَيْتُ أَسِيرًا قَطُّ خَيْرًا مِنْ خُبَيْبٍ، لَقَدْ رَأَيْتُهُ يَأْكُلُ مِنْ قِطْفِ عِنَبٍ، وَمَا بِمَكَّةَ يَوْمَئِذٍ ثَمَرَةٌ، وَإِنَّهُ لَمُوثَقٌ فِي الْحَدِيدِ، وَمَا كَانَ إِلاَّ رِزْقٌ رَزَقَهُ اللَّهُ، فَخَرَجُوا بِهِ مِنَ الْحَرَمِ، لِيَقْتُلُوهُ فَقَالَ دَعُونِي أُصَلِّي رَكْعَتَيْنِ‏.‏ ثُمَّ انْصَرَفَ إِلَيْهِمْ فَقَالَ لَوْلاَ أَنْ تَرَوْا أَنَّ مَا بِي جَزَعٌ مِنَ الْمَوْتِ، لَزِدْتُ‏.‏ فَكَانَ أَوَّلَ مَنْ سَنَّ الرَّكْعَتَيْنِ عِنْدَ الْقَتْلِ هُوَ، ثُمَّ قَالَ اللَّهُمَّ أَحْصِهِمْ عَدَدًا ثُمَّ قَالَ مَا أُبَالِي حِينَ أُقْتَلُ مُسْلِمًا عَلَى أَىِّ شِقٍّ كَانَ لِلَّهِ مَصْرَعِي وَذَلِكَ فِي ذَاتِ الإِلَهِ وَإِنْ يَشَأْ يُبَارِكْ عَلَى أَوْصَالِ شِلْوٍ مُمَزَّعِ ثُمَّ قَامَ إِلَيْهِ عُقْبَةُ بْنُ الْحَارِثِ فَقَتَلَهُ، وَبَعَثَ قُرَيْشٌ إِلَى عَاصِمٍ لِيُؤْتَوْا بِشَىْءٍ مِنْ جَسَدِهِ يَعْرِفُونَهُ، وَكَانَ عَاصِمٌ قَتَلَ عَظِيمًا مِنْ عُظَمَائِهِمْ يَوْمَ بَدْرٍ، فَبَعَثَ اللَّهُ عَلَيْهِ مِثْلَ الظُّلَّةِ مِنَ الدَّبْرِ، فَحَمَتْهُ مِنْ رُسُلِهِمْ، فَلَمْ يَقْدِرُوا مِنْهُ عَلَى شَىْءٍ‏.‏",
                "headingArabic": "غَزْوَةُ الرَّجِيعِ وَرِعْلٍ وَذَكْوَانَ وَبِئْرِ مَعُونَةَ",
                "headingUrdu": "غزوہ الراضی، رؤل، ذکوان اور بئر معونہ اور خبیب اور ان کے ساتھیوں کی روایت",
                "headingEnglish": "The Ghazwa of Ar-Raji’, Ri’l, Dhakwan and Bi’r Ma’una and the narration about Khubaib and his companions",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3900,
                "hadithNumber": "4087",
                "englishNarrator": "Narrated Jabir:",
                "hadithEnglish": "The person who killed Khubaib رضی اللہ عنہ was Abu Sarua (i.e. `Uqba bin Al-Harith).",
                "hadithUrdu": "خبیب رضی اللہ عنہ کو ابوسروعہ ( عقبہ بن عامر ) نے قتل کیا تھا۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے عمرو بن دینار نے، انہوں نے جابر سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ جَابِرًا، يَقُولُ الَّذِي قَتَلَ خُبَيْبًا هُوَ أَبُو سِرْوَعَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3901,
                "hadithNumber": "4088",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "\"The Prophet (ﷺ) sent seventy men, called Al-Qurra 'for some purpose. The two groups of Bani Sulaim called Ri'l and Dhakwan, appeared to them near a well called Bir Ma'una. The people (i.e. Al- Qurra) said, 'By Allah, we have not come to harm you, but we are passing by you on our way to do something for the Prophet.' But (the infidels) killed them. The Prophet (ﷺ) therefore invoked evil upon them for a month during the morning prayer. That was the beginning of Al Qunut and we used not to say Qunut before that.\" A man asked Anas about Al-Qunut, \"Is it to be said after the Bowing (in the prayer) or after finishing the Recitation (i.e. before Bowing)?\" Anas رضی اللہ عنہ replied, \"No, but (it is to be said) after finishing the Recitation.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ستر صحابہ کی ایک جماعت تبلیغ اسلام کے لیے بھیجی تھی۔ انہیں قاری کہا جاتا تھا۔ راستے میں بنو سلیم کے دو قبیلے رعل اور ذکوان نے ایک کنویں کے قریب ان کے ساتھ مزاحمت کی۔ یہ کنواں بئرمعونہ کے نام سے مشہور تھا۔ صحابہ نے ان سے کہا کہ اللہ کی قسم! ہم تمہارے خلاف، یہاں لڑنے نہیں آئے بلکہ ہمیں تو رسول اللہ صلی اللہ علیہ وسلم کی طرف سے ایک ضرورت پر مامور کیا گیا ہے۔ لیکن کفار کے ان قبیلوں نے تمام صحابہ کو شہید کر دیا۔ اس واقعہ کے بعد نبی کریم صلی اللہ علیہ وسلم صبح کی نماز میں ان کے لیے ایک مہینہ تک بددعا کرتے رہے۔ اسی دن سے دعا قنوت کی ابتداء ہوئی، ورنہ اس سے پہلے ہم دعا قنوت نہیں پڑھا کرتے تھے اور عبدالعزیز بن صہیب نے بیان کیا کہ ایک صاحب ( عاصم احول ) نے انس رضی اللہ عنہ سے دعا قنوت کے بارے میں پوچھا کہ یہ دعا رکوع کے بعد پڑھی جائے گی یا قرآت قرآن سے فارغ ہونے کے بعد؟ ( رکوع سے پہلے ) انس رضی اللہ عنہ نے فرمایا کہ نہیں بلکہ قرآت قرآن سے فارغ ہونے کے بعد ( رکوع سے پہلے ) ۔",
                "urduNarrator": "ہم سے ابومعمر نے بیان کیا، کہا ہم سے عبدالوارث بن سعید نے بیان کیا، کہا ہم سے عبدالعزیز بن صہیب نے بیان کیا، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم سَبْعِينَ رَجُلاً لِحَاجَةٍ يُقَالُ لَهُمُ الْقُرَّاءُ، فَعَرَضَ لَهُمْ حَيَّانِ مِنْ بَنِي سُلَيْمٍ رِعْلٌ وَذَكْوَانُ، عِنْدَ بِئْرٍ يُقَالُ لَهَا بِئْرُ مَعُونَةَ، فَقَالَ الْقَوْمُ وَاللَّهِ مَا إِيَّاكُمْ أَرَدْنَا، إِنَّمَا نَحْنُ مُجْتَازُونَ فِي حَاجَةٍ لِلنَّبِيِّ صلى الله عليه وسلم، فَقَتَلُوهُمْ فَدَعَا النَّبِيُّ صلى الله عليه وسلم عَلَيْهِمْ شَهْرًا فِي صَلاَةِ الْغَدَاةِ، وَذَلِكَ بَدْءُ الْقُنُوتِ وَمَا كُنَّا نَقْنُتُ‏.‏ قَالَ عَبْدُ الْعَزِيزِ وَسَأَلَ رَجُلٌ أَنَسًا عَنِ الْقُنُوتِ أَبَعْدَ الرُّكُوعِ، أَوْ عِنْدَ فَرَاغٍ مِنَ الْقِرَاءَةِ قَالَ لاَ بَلْ عِنْدَ فَرَاغٍ مِنَ الْقِرَاءَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3902,
                "hadithNumber": "4089",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said Al-Qunut for one month after the posture of Bowing, invoking evil upon some 'Arab tribes.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے رکوع کے بعد ایک مہینہ تک قنوت پڑھی جس میں آپ صلی اللہ علیہ وسلم عرب کے چند قبائل ( رعل و ذکوان وغیرہ ) کے لیے بددعا کرتے تھے۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے ہشام دستوائی نے بیان کیا، کہا ہم سے قتادہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، قَالَ قَنَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَهْرًا بَعْدَ الرُّكُوعِ يَدْعُو عَلَى أَحْيَاءٍ مِنَ الْعَرَبِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 3876,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=155",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=153",
                "label": "153",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=154",
                "label": "154",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=155",
                "label": "155",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=156",
                "label": "156",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=157",
                "label": "157",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=158",
                "label": "158",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=159",
                "label": "159",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=157",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=157",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=155",
        "to": 3900,
        "total": 40465
    }
}