{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 165,
        "data": [
            {
                "id": 4103,
                "hadithNumber": "4301",
                "englishNarrator": "Narrated Abu Jamila رضی اللہ عنہ :",
                "hadithEnglish": "While we were in the company of the Ibn Al-Musaiyab, Sunain Abi Jamila informed us (a Hadith), Abu Jamila said that he lived during the lifetime of the Prophet (ﷺ) and that he had accompanied him ( to Mecca) during the year of the Conquest (of Mecca).",
                "hadithUrdu": "تو ہم سعید بن مسیب کے ساتھ تھے بیان کیا کہ ابوجمیلہ رضی اللہ عنہ نے کہا کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم کی صحبت پائی اور وہ آپ کے ساتھ غزوہ فتح مکہ کے لیے نکلے تھے۔",
                "urduNarrator": "مجھ سے ابراہیم بن موسیٰ نے بیان کیا ‘ کہا ہم کو ہشام بن یوسف نے خبر دی ‘ انہیں معمر نے اور انہیں زہری نے ‘ انہیں سفیان نے ‘ انہیں ابوجمیلہ نے ‘ زہری نے بیان کیا کہ جب ہم سے ابوجمیلہ رضی اللہ عنہ نے حدیث بیان کی",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سُنَيْنٍ أَبِي جَمِيلَةَ، قَالَ أَخْبَرَنَا وَنَحْنُ، مَعَ ابْنِ الْمُسَيَّبِ قَالَ وَزَعَمَ أَبُو جَمِيلَةَ أَنَّهُ أَدْرَكَ النَّبِيَّ صلى الله عليه وسلم، وَخَرَجَ مَعَهُ عَامَ الْفَتْحِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4104,
                "hadithNumber": "4302",
                "englishNarrator": "Narrated `Abu Qalabah رضی اللہ عنہ :",
                "hadithEnglish": "We were at a place which was a thoroughfare for the people, and the caravans used to pass by us and we would ask them, \"What is wrong with the people? What is wrong with the people? Who is that man?. They would say, \"That man claims that Allah has sent him (as an Apostle), that he has been divinely inspired, that Allah has revealed to him such-and-such.\" I used to memorize that (Divine) Talk, and feel as if it was inculcated in my chest (i.e. mind) And the 'Arabs (other than Quraish) delayed their conversion to Islam till the Conquest (of Mecca). They used to say.\" \"Leave him (i.e. Muhammad) and his people Quraish: if he overpowers them then he is a true Prophet. So, when Mecca was conquered, then every tribe rushed to embrace Islam, and my father hurried to embrace Islam before (the other members of) my tribe. When my father returned (from the Prophet) to his tribe, he said, \"By Allah, I have come to you from the Prophet (ﷺ) for sure!\" The Prophet (ﷺ) afterwards said to them, 'Offer such-and-such prayer at such-and-such time, and when the time for the prayer becomes due, then one of you should pronounce the Adhan (for the prayer), and let the one amongst you who knows Qur'an most should, lead the prayer.\" So they looked for such a person and found none who knew more Qur'an than I because of the Qur'anic material which I used to learn from the caravans. They therefore made me their Imam ((to lead the prayer) and at that time I was a boy of six or seven years, wearing a Burda (i.e. a black square garment) proved to be very short for me (and my body became partly naked). A lady from the tribe said, \"Won't you cover the anus of your reciter for us?\" So they bought (a piece of cloth) and made a shirt for me. I had never been so happy with anything before as I was with that shirt.",
                "hadithUrdu": "جاہلیت میں ہمارا قیام ایک چشمہ پر تھا جہاں عام راستہ تھا۔ سوار ہمارے قریب سے گزرتے تو ہم ان سے پوچھتے ‘ لوگوں کا کیا خیال ہے ‘ اس شخص کا کیا معاملہ ہے؟ ( یہ اشارہ نبی کریم صلی اللہ علیہ وسلم کی طرف ہوتا تھا ) لوگ بتاتے کہ وہ کہتے ہیں کہ اللہ نے انہیں اپنا رسول بنا کر بھیجا ہے اور اللہ ان پر وحی نازل کرتا ہے ‘ یا اللہ نے ان پر وحی نازل کی ہے ( وہ قرآن کی کوئی آیت سناتے ) میں وہ فوراً یاد کر لیتا ‘ ان کی باتیں میرے دل کو لگتی تھیں۔ ادھر سارے عرب والے فتح مکہ پر اپنے اسلام کو موقوف کئے ہوئے تھے۔ ان کا کہنا یہ تھا کہ اس نبی کو اور اس کی قوم ( قریش ) کو نمٹنے دو ‘ اگر وہ ان پر غالب آ گئے تو پھر واقعی وہ سچے نبی ہیں۔ چنانچہ جب مکہ فتح ہو گیا تو ہر قوم نے اسلام لانے میں پہل کی اور میرے والد نے بھی میری قوم کے اسلام میں جلدی کی۔ پھر جب ( مدینہ ) سے واپس آئے تو کہا کہ میں اللہ کی قسم ایک سچے نبی کے پاس سے آ رہا ہوں۔ انہوں نے فرمایا ہے کہ فلاں نماز اس طرح فلاں وقت پڑھا کرو اور جب نماز کا وقت ہو جائے تو تم میں سے کوئی ایک شخص اذان دے اور امامت وہ کرے جسے قرآن سب سے زیادہ یاد ہو۔ لوگوں نے اندازہ کیا کہ کسے قرآن سب سے زیادہ یاد ہے تو کوئی شخص ان کے قبیلے میں مجھ سے زیادہ قرآن یاد کرنے والا انہیں نہیں ملا۔ کیونکہ میں آنے جانے والے سواروں سے سن کر قرآن مجید یاد کر لیا کرتا تھا۔ اس لیے مجھے لوگوں نے امام بنایا۔ حالانکہ اس وقت میری عمر چھ یا سات سال کی تھی اور میرے پاس ایک ہی چادر تھی۔ جب میں ( اسے لپیٹ کر ) سجدہ کرتا تو اوپر ہو جاتی ( اور پیچھے کی جگہ ) کھل جاتی۔ اس قبیلہ کی ایک عورت نے کہا ‘ تم اپنے قاری کا چوتڑ تو پہلے چھپا دو۔ آخر انہوں نے کپڑا خریدا اور میرے لیے ایک قمیص بنائی، میں جتنا خوش اس قمیص سے ہوا اتنا کسی اور چیز سے نہیں ہوا تھا۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ‘ کہا ہم سے حماد بن زید نے بیان کیا ‘ ان سے ایوب سختیانی نے اور ان سے ابوقلابہ نے اور ان سے عمرو بن سلمہ رضی اللہ عنہ نے ‘ ایوب نے کہا کہ مجھ سے ابوقلابہ نے کہا ‘ عمرو بن سلمہ رضی اللہ عنہ کی خدمت میں حاضر ہو کر یہ قصہ کیوں نہیں پوچھتے؟ ابوقلابہ نے کہا کہ پھر میں ان کی خدمت میں گیا اور ان سے سوال کیا ‘ انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ عَمْرِو بْنِ سَلِمَةَ، قَالَ قَالَ لِي أَبُو قِلاَبَةَ أَلاَ تَلْقَاهُ فَتَسْأَلَهُ، قَالَ فَلَقِيتُهُ فَسَأَلْتُهُ فَقَالَ كُنَّا بِمَاءٍ مَمَرَّ النَّاسِ، وَكَانَ يَمُرُّ بِنَا الرُّكْبَانُ فَنَسْأَلُهُمْ مَا لِلنَّاسِ مَا لِلنَّاسِ مَا هَذَا الرَّجُلُ فَيَقُولُونَ يَزْعُمُ أَنَّ اللَّهَ أَرْسَلَهُ أَوْحَى إِلَيْهِ، أَوْ أَوْحَى اللَّهُ بِكَذَا‏.‏ فَكُنْتُ أَحْفَظُ ذَلِكَ الْكَلاَمَ، وَكَأَنَّمَا يُغْرَى فِي صَدْرِي، وَكَانَتِ الْعَرَبُ تَلَوَّمُ بِإِسْلاَمِهِمِ الْفَتْحَ، فَيَقُولُونَ اتْرُكُوهُ وَقَوْمَهُ، فَإِنَّهُ إِنْ ظَهَرَ عَلَيْهِمْ فَهْوَ نَبِيٌّ صَادِقٌ‏.‏ فَلَمَّا كَانَتْ وَقْعَةُ أَهْلِ الْفَتْحِ بَادَرَ كُلُّ قَوْمٍ بِإِسْلاَمِهِمْ، وَبَدَرَ أَبِي قَوْمِي بِإِسْلاَمِهِمْ، فَلَمَّا قَدِمَ قَالَ جِئْتُكُمْ وَاللَّهِ مِنْ عِنْدِ النَّبِيِّ صلى الله عليه وسلم حَقًّا فَقَالَ ‏ \"‏ صَلُّوا صَلاَةَ كَذَا فِي حِينِ كَذَا، وَصَلُّوا كَذَا فِي حِينِ كَذَا، فَإِذَا حَضَرَتِ الصَّلاَةُ، فَلْيُؤَذِّنْ أَحَدُكُمْ، وَلْيَؤُمَّكُمْ أَكْثَرُكُمْ قُرْآنًا ‏\"‏‏.‏ فَنَظَرُوا فَلَمْ يَكُنْ أَحَدٌ أَكْثَرَ قُرْآنًا مِنِّي، لِمَا كُنْتُ أَتَلَقَّى مِنَ الرُّكْبَانِ، فَقَدَّمُونِي بَيْنَ أَيْدِيهِمْ، وَأَنَا ابْنُ سِتٍّ أَوْ سَبْعِ، سِنِينَ وَكَانَتْ عَلَىَّ بُرْدَةٌ، كُنْتُ إِذَا سَجَدْتُ تَقَلَّصَتْ عَنِّي، فَقَالَتِ امْرَأَةٌ مِنَ الْحَىِّ أَلاَ تُغَطُّوا عَنَّا اسْتَ قَارِئِكُمْ‏.‏ فَاشْتَرَوْا فَقَطَعُوا لِي قَمِيصًا، فَمَا فَرِحْتُ بِشَىْءٍ فَرَحِي بِذَلِكَ الْقَمِيصِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4105,
                "hadithNumber": "4303",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "`Utba bin Abi Waqqas authorized his brother Sa`d رضی اللہ عنہ to take the son of the slave-girl of Zam`a into his custody. `Utba said (to him). \"He is my son.\" When Allah's Messenger (ﷺ) arrived in Mecca during the Conquest (of Mecca), Sa`d bin Abi Waqqas رضی اللہ عنہ  took the son of the slave-girl of Zam`a and took him to the Prophet (ﷺ) `Abd bin Zam`a too came along with him. Sa`d رضی اللہ عنہ said. \"This is the son of my brother and the latter has informed me that he is his son.\" `Abd bin Zam`a said, \"O Allah's Messenger (ﷺ)! This is my brother who is the son of the slave-girl of Zam`a and was born on his (i.e. Zam'as) bed.' Allah's Apostle looked at the son of the slave-girl of Zam`a and noticed that he, of all the people had the greatest resemblance to `Utba bin Abi Waqqas. Allah's Messenger (ﷺ) then said (to `Abd), \" He is yours; he is your brother, O `Abd bin Zam`a, he was born on the bed (of your father).\" (At the same time) Allah's Messenger (ﷺ) said (to his wife Sauda), \"Veil yourself before him (i.e. the son of the slave-girl) O Sauda,\" because of the resemblance he noticed between him and `Utba bin Abi Waqqas رضی اللہ عنہ . Allah's Apostle added, \"The boy is for the bed (i.e. for the owner of the bed where he was born), and stone is for the adulterer.\" (Ibn Shihab said, \"Abu Huraira رضی اللہ عنہ used to say that (i.e. the last statement of the Prophet in the above Hadith 596, publicly.\")",
                "hadithUrdu": "عتبہ بن ابی وقاص نے (مرتے وقت زمانہ جاہلیت میں) اپنے بھائی (سعد بن ابی وقاص رضی اللہ عنہ) کو وصیت کی تھی کہ وہ زمعہ بن لیثی کی باندی سے پیدا ہونے والے بچے کو اپنے قبضے میں لے لیں۔ عتبہ نے کہا تھا کہ وہ میرا لڑکا ہو گا۔ چنانچہ جب فتح مکہ کے موقع پر رسول اللہ صلی اللہ علیہ وسلم مکہ میں داخل ہوئے تو سعد بن ابی وقاص رضی اللہ عنہ اس بچے کو لے کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور ان کے ساتھ عبد بن زمعہ بھی آئے۔ سعد بن ابی وقاص رضی اللہ عنہ نے تو یہ کہا کہ یہ میرے بھائی کا لڑکا ہے۔ لیکن عبد بن زمعہ نے کہا: یا رسول اللہ! یہ میرا بھائی ہے (میرے والد) زمعہ کا بیٹا ہے کیونکہ انہیں کے بستر پر پیدا ہوا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے زمعہ کی باندی کے لڑکے کو دیکھا تو وہ واقعی (سعد کے بھائی) عتبہ بن ابی وقاص کی شکل پر تھا لیکن نبی کریم صلی اللہ علیہ وسلم نے (قانون شریعت کے مطابق) فیصلے میں یہ کہا کہ اے عبد بن زمعہ! تمہیں اس بچے کو رکھو، یہ تمہارا بھائی ہے، کیونکہ یہ تمہارے والد کے فراش پر (اس کی باندی کے بطن سے پیدا ہوا ہے۔ لیکن دوسری طرف ام المؤمنین سودہ رضی اللہ عنہا سے جو زمعہ کی بیٹی تھیں فرمایا سودہ! اس لڑکے سے پردا کیا کرنا کیونکہ آپ نے اس لڑکے میں عتبہ بن ابی وقاص رضی اللہ عنہ کی شباہت پائی تھی۔ ابن شہاب نے کہا ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ لڑکا اس کا ہوتا ہے جس کی جورو یا لونڈی کے پیٹ سے پیدا ہوا ہو اور زنا کرنے والے کے حصے میں سنگ ہی ہیں۔ ابن شہاب نے بیان کیا کہ ابوہریرہ رضی اللہ عنہ اس حدیث کو پکار پکار کر بیان کیا کرتے تھے۔",
                "urduNarrator": "مجھ سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، کہا ہم سے امام مالک نے بیان کیا، ان سے ابن شہاب نے، ان سے عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا، نبی کریم صلی اللہ علیہ وسلم سے (دوسری سند اور لیث بن سعد نے کہا مجھ سے یونس نے بیان کیا، ان سے ابن شہاب نے، انہیں عروہ بن زبیر نے خبر دی اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ عَنِ ابْنِ شِهَابٍ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ قَالَتْ كَانَ عُتْبَةُ بْنُ أَبِي وَقَّاصٍ عَهِدَ إِلَى أَخِيهِ سَعْدٍ أَنْ يَقْبِضَ ابْنَ وَلِيدَةِ زَمْعَةَ، وَقَالَ عُتْبَةُ إِنَّهُ ابْنِي‏.‏ فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَكَّةَ فِي الْفَتْحِ أَخَذَ سَعْدُ بْنُ أَبِي وَقَّاصٍ ابْنَ وَلِيدَةِ زَمْعَةَ، فَأَقْبَلَ بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم، وَأَقْبَلَ مَعَهُ عَبْدُ بْنُ زَمْعَةَ، فَقَالَ سَعْدُ بْنُ أَبِي وَقَّاصٍ هَذَا ابْنُ أَخِي، عَهِدَ إِلَىَّ أَنَّهُ ابْنُهُ‏.‏ قَالَ عَبْدُ بْنُ زَمْعَةَ يَا رَسُولَ اللَّهِ، هَذَا أَخِي، هَذَا ابْنُ زَمْعَةَ، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَنَظَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى ابْنِ وَلِيدَةِ زَمْعَةَ، فَإِذَا أَشْبَهُ النَّاسِ بِعُتْبَةَ بْنِ أَبِي وَقَّاصٍ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ، هُوَ أَخُوكَ يَا عَبْدُ بْنَ زَمْعَةَ ‏\"‏‏.‏ مِنْ أَجْلِ أَنَّهُ وُلِدَ عَلَى فِرَاشِهِ، وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْتَجِبِي مِنْهُ يَا سَوْدَةُ ‏\"‏‏.‏ لِمَا رَأَى مِنْ شَبَهِ عُتْبَةَ بْنِ أَبِي وَقَّاصٍ‏.‏ قَالَ ابْنُ شِهَابٍ قَالَتْ عَائِشَةُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏ وَقَالَ ابْنُ شِهَابٍ وَكَانَ أَبُو هُرَيْرَةَ يَصِيحُ بِذَلِكَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4106,
                "hadithNumber": "4304",
                "englishNarrator": "Narrated `Urwa bin Az-Zubair:",
                "hadithEnglish": "A lady committed theft during the lifetime of Allah's Messenger (ﷺ) in the Ghazwa of Al-Fath, ((i.e. Conquest of Mecca). Her folk went to Usama bin Zaid رضی اللہ عنہما to intercede for her (with the Prophet). When Usama رضی اللہ عنہ interceded for her with Allah's Messenger (ﷺ), the color of the face of Allah's Messenger (ﷺ) changed and he said, \"Do you intercede with me in a matter involving one of the legal punishments prescribed by Allah?\" Usama رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! Ask Allah's Forgiveness for me.\" So in the afternoon, Allah's Apostle got up and addressed the people. He praised Allah as He deserved and then said, \"Amma ba'du ! The nations prior to you were destroyed because if a noble amongst them stole, they used to excuse him, and if a poor person amongst them stole, they would apply (Allah's) Legal Punishment to him. By Him in Whose Hand Muhammad's soul is, if Fatima, the daughter of Muhammad stole, I would cut her hand.\" Then Allah's Messenger (ﷺ) gave his order in the case of that woman and her hand was cut off. Afterwards her repentance proved sincere and she got married. `Aisha said, \"That lady used to visit me and I used to convey her demands to Allah's Messenger (ﷺ).\"",
                "hadithUrdu": "غزوہ فتح ( مکہ ) کے موقع پر ایک عورت نے نبی کریم صلی اللہ علیہ وسلم کے عہد میں چوری کر لی تھی۔ اس عورت کی قوم گھبرائی ہوئی اسامہ بن زید رضی اللہ عنہما کے پاس آئی تاکہ وہ نبی کریم صلی اللہ علیہ وسلم سے اس کی سفارش کر دیں ( کہ اس کا ہاتھ چوری کے جرم میں نہ کاٹا جائے ) ۔ عروہ نے بیان کیا کہ جب اسامہ رضی اللہ عنہ نے اس کے بارے میں نبی کریم صلی اللہ علیہ وسلم سے گفتگو کی تو آپ صلی اللہ علیہ وسلم کے چہرے کا رنگ بدل گیا اور آپ صلی اللہ علیہ وسلم نے فرمایا! تم مجھ سے اللہ کی قائم کی ہوئی ایک حد کے بارے میں سفارش کرنے آئے ہو۔ اسامہ رضی اللہ عنہ نے عرض کیا: میرے لیے دعا مغفرت کیجئے، یا رسول اللہ! پھر دوپہر بعد نبی کریم صلی اللہ علیہ وسلم نے صحابہ رضی اللہ عنہم کو خطاب کیا، اللہ تعالیٰ کی اس کے شان کے مطابق تعریف کرنے کے بعد فرمایا: امابعد! تم میں سے پہلے لوگ اس لیے ہلاک ہو گئے کہ اگر ان میں سے کوئی معزز شخص چوری کرتا تو اسے چھوڑ دیتے لیکن اگر کوئی کمزور چوری کر لیتا تو اس پر حد قائم کرتے اور اس ذات کی قسم جس کے ہاتھ میں محمد صلی اللہ علیہ وسلم کی جان ہے اگر فاطمہ بنت محمد بھی چوری کر لے تو میں اس کا ہاتھ کاٹوں گا۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے اس عورت کے لیے حکم دیا اور ان کا ہاتھ کاٹ دیا گیا۔ پھر اس عورت نے صدق دل سے توبہ کر لی اور شادی بھی کر لی۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ بعد میں وہ میرے یہاں آتی تھیں۔ ان کو اور کوئی ضرورت ہوتی تو میں رسول اللہ صلی اللہ علیہ وسلم کے سامنے پیش کر دیتی۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا، کہا کہ ہم کو عبداللہ بن مبارک نے خبر دی، انہیں یونس نے خبر دی، انہیں زہری نے، کہا کہ مجھے عروہ بن زبیر نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنِي يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ امْرَأَةً، سَرَقَتْ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ الْفَتْحِ، فَفَزِعَ قَوْمُهَا إِلَى أُسَامَةَ بْنِ زَيْدٍ يَسْتَشْفِعُونَهُ، قَالَ عُرْوَةُ فَلَمَّا كَلَّمَهُ أُسَامَةُ فِيهَا تَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَتُكَلِّمُنِي فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ‏\"‏‏.‏ قَالَ أُسَامَةُ اسْتَغْفِرْ لِي يَا رَسُولَ اللَّهِ‏.‏ فَلَمَّا كَانَ الْعَشِيُّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَطِيبًا، فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَإِنَّمَا أَهْلَكَ النَّاسَ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمُ الشَّرِيفُ تَرَكُوهُ، وَإِذَا سَرَقَ فِيهِمِ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ، وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا ‏\"‏‏.‏ ثُمَّ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِتِلْكَ الْمَرْأَةِ، فَقُطِعَتْ يَدُهَا، فَحَسُنَتْ تَوْبَتُهَا بَعْدَ ذَلِكَ وَتَزَوَّجَتْ‏.‏ قَالَتْ عَائِشَةُ فَكَانَتْ تَأْتِي بَعْدَ ذَلِكَ فَأَرْفَعُ حَاجَتَهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4107,
                "hadithNumber": "4305, 4306",
                "englishNarrator": "Narrated Mujashii رضی اللہ عنہ :",
                "hadithEnglish": "I took my brother to the Prophet (ﷺ) after the Conquest (of Mecca) and said, \"O Allah's Messenger (ﷺ)! I have come to you with my brother so that you may take a pledge of allegiance from him for migration.\" The Prophet (ﷺ) said, \"The people of migration (i.e. those who migrated to Medina before the Conquest) enjoyed the privileges of migration (i.e. there is no need for migration anymore).\" I said to the Prophet, \"For what will you take his pledge of allegiance?\" The Prophet (ﷺ) said, \"I will take his pledge of allegiance for Islam, Belief, and for Jihad (i.e. fighting in Allah's Cause)\". Thereafter, I (Abu Usman) met Abu Mabad, their elder brother, and inquired of him about it, so he said: Mujashii has spoken the truth.",
                "hadithUrdu": "فتح مکہ کے بعد میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں اپنے بھائی ( مجالد ) کو لے کر حاضر ہوا اور عرض کیا کہ یا رسول اللہ! میں اسے اس لیے لے کر حاضر ہوا ہوں تاکہ آپ ہجرت پر اس سے بیعت لے لیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہجرت کرنے والے اس کی فضیلت و ثواب کو حاصل کر چکے ( یعنی اب ہجرت کرنے کا زمانہ تو گزر چکا ) ۔ میں نے عرض کیا: پھر آپ اس سے کس چیز پر بیعت لیں گے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ایمان، اسلام اور جہاد پر۔ ابی عثمان نہدی نے کہا کہ پھر میں ( مجاشع کے بھائی ) ابومعبد مجالد سے ملا وہ دونوں بھائیوں سے بڑے تھے، میں نے ان سے بھی اس حدیث کے متعلق پوچھا تو انہوں نے کہا کہ مجاشع نے حدیث ٹھیک طرح بیان کی ہے۔",
                "urduNarrator": "ہم سے عمرو بن خالد نے بیان کیا، کہا ہم سے زہیر بن معاویہ نے بیان کیا، کہا ہم سے عاصم بن سلیمان نے بیان کیا، ان سے ابوعثمان نہدی نے بیان کیا اور ان سے مجاشع بن مسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا عَاصِمٌ، عَنْ أَبِي عُثْمَانَ، قَالَ حَدَّثَنِي مُجَاشِعٌ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم بِأَخِي بَعْدَ الْفَتْحِ قُلْتُ يَا رَسُولَ اللَّهِ، جِئْتُكَ بِأَخِي لِتُبَايِعَهُ عَلَى الْهِجْرَةِ‏.‏ قَالَ ‏\"‏ ذَهَبَ أَهْلُ الْهِجْرَةِ بِمَا فِيهَا ‏\"‏‏.‏ فَقُلْتُ عَلَى أَىِّ شَىْءٍ تُبَايِعُهُ قَالَ ‏\"‏ أُبَايِعُهُ عَلَى الإِسْلاَمِ وَالإِيمَانِ وَالْجِهَادِ‏\" فَلَقِيتُ أَبَا مَعْبَدٍ بَعْدُ وَكَانَ أَكْبَرَهُمَا فَسَأَلْتُهُ فَقَالَ صَدَقَ مُجَاشِعٌ‏.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4108,
                "hadithNumber": "4307, 4308",
                "englishNarrator": "Narrated Mujashi bin Mas`ud رضی اللہ عنہ :",
                "hadithEnglish": "I took Abu Mabad رضی اللہ عنہ to the Prophet (ﷺ) in order that he might give him the pledge of allegiance for migration. The Prophet (ﷺ) said, \"Migration has gone to its people, but I take the pledge from him (i.e. Abu Mabad) for Islam and Jihad.\" Later I (Abu Uthman) met Abu Mabad and asked him about it, he said: Mujashii has spoken the truth. Abu Uthman has reported from Hadrat Mujashii رضی اللہ عنہ that he took his brother and visited the prophet ﷺ .",
                "hadithUrdu": "میں اپنے بھائی ( ابومعبد رضی اللہ عنہ ) کو نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آپ سے ہجرت پر بیعت کرانے کے لیے لے گیا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہجرت کا ثواب تو ہجرت کرنے والوں کے ساتھ ختم ہو چکا۔ البتہ میں اس سے اسلام اور جہاد پر بیعت لیتا ہوں۔ ابوعثمان نے کہا کہ پھر میں نے ابومعبد رضی اللہ عنہ سے مل کر ان سے اس کے متعلق پوچھا تو انہوں نے کہا کہ مجاشع رضی اللہ عنہ نے ٹھیک بیان کیا اور خالد حذاء نے بھی ابوعثمان سے بیان کیا، ان سے مجاشع رضی اللہ عنہ نے کہ وہ اپنے بھائی مجالد رضی اللہ عنہ کو لے کر آئے تھے، ( پھر حدیث کو آخر تک بیان کیا، اس کو اسماعیل نے وصل کیا ہے ) ۔",
                "urduNarrator": "ہم سے محمد بن ابی بکر نے بیان کیا، کہا ہم سے فضیل بن سلیمان نے بیان کیا، کہا ہم سے عاصم بن سلیمان نے بیان کیا، ان سے ابوعثمان نہدی نے اور ان سے مجاشع بن مسعود رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا عَاصِمٌ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ مُجَاشِعِ بْنِ مَسْعُودٍ، انْطَلَقْتُ بِأَبِي مَعْبَدٍ إِلَى النَّبِيِّ صلى الله عليه وسلم لِيُبَايِعَهُ عَلَى الْهِجْرَةِ، قَالَ ‏ \"‏ مَضَتِ الْهِجْرَةُ لأَهْلِهَا، أُبَايِعُهُ عَلَى الإِسْلاَمِ وَالْجِهَادِ.\" فَلَقِيتُ أَبَا مَعْبَدٍ فَسَأَلْتُهُ فَقَالَ صَدَقَ مُجَاشِعٌ‏.‏ وَقَالَ خَالِدٌ عَنْ أَبِي عُثْمَانَ عَنْ مُجَاشِعٍ أَنَّهُ جَاءَ بِأَخِيهِ مُجَالِدٍ‏.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4109,
                "hadithNumber": "4309",
                "englishNarrator": "Narrated Mujahid:",
                "hadithEnglish": "I said to Ibn `Umar رضی اللہ عنہما , \"I want to migrate to Sham.\" He said, \"There is no migration, but Jihad (for Allah's Cause). Go and offer yourself for Jihad, and if you find an opportunity for Jihad (stay there) otherwise, come back.\"",
                "hadithUrdu": "میں نے ابن عمر رضی اللہ عنہما سے عرض کیا کہ میرا ارادہ ہے کہ میں ملک شام کو ہجرت کر جاؤں، فرمایا: اب ہجرت باقی نہیں رہی، جہاد ہی باقی رہ گیا ہے۔ اس لیے جاؤ اور خود کو پیش کرو۔ اگر تم نے کچھ پا لیا تو بہتر ورنہ واپس آ جانا۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے ابوبشر نے اور ان سے مجاہد نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ مُجَاهِدٍ، قُلْتُ لاِبْنِ عُمَرَ ـ رضى الله عنهما ـ إِنِّي أُرِيدُ أَنْ أُهَاجِرَ إِلَى الشَّأْمِ‏.‏ قَالَ لاَ هِجْرَةَ وَلَكِنْ جِهَادٌ، فَانْطَلِقْ فَاعْرِضْ نَفْسَكَ، فَإِنْ وَجَدْتَ شَيْئًا وَإِلاَّ رَجَعْتَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4110,
                "hadithNumber": "4310",
                "englishNarrator": "Narrated Mujahid:  (In an other narration):",
                "hadithEnglish": "Ibn `Umar رضی اللہ عنہما said \"There is no migration today or after Allah's Messenger (ﷺ).\" (and completed his statement as above.)",
                "hadithUrdu": "جب میں نے عبداللہ بن عمر رضی اللہ عنہما سے عرض کیا تو انہوں نے کہا کہ اب ہجرت باقی نہیں رہی یا ( فرمایا کہ ) رسول اللہ صلی اللہ علیہ وسلم کے بعد پھر ہجرت کہاں رہی۔",
                "urduNarrator": "نضر نے بیان کیا کہ ہمیں شعبہ نے خبر دی، انہیں ابوبشر نے خبر دی، انہوں نے مجاہد سے سنا کہ",
                "hadithArabic": "وَقَالَ النَّضْرُ أَخْبَرَنَا شُعْبَةُ، أَخْبَرَنَا أَبُو بِشْرٍ، سَمِعْتُ مُجَاهِدًا، قُلْتُ لاِبْنِ عُمَرَ فَقَالَ لاَ هِجْرَةَ الْيَوْمَ، أَوْ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِثْلَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4111,
                "hadithNumber": "4311",
                "englishNarrator": "Narrated Mujahid bin Jabr:",
                "hadithEnglish": "`Abdullah bin `Umar رضی اللہ عنہما used to say, \"There is no migration after the Conquest (of Mecca).",
                "hadithUrdu": "عبداللہ بن عمر رضی اللہ عنہما کہا کرتے تھے کہ فتح مکہ کے بعد ہجرت باقی نہیں رہی۔",
                "urduNarrator": "مجھ سے اسحاق بن یزید نے بیان کیا، انہوں نے کہا ہم سے یحییٰ بن حمزہ نے بیان کیا، انہوں نے کہا کہ مجھ سے ابوعمرو اوزاعی نے بیان کیا، ان سے عبدہ بن ابی لبابہ نے، ان سے مجاہد بن جبر مکی نے کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ يَزِيدَ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، قَالَ حَدَّثَنِي أَبُو عَمْرٍو الأَوْزَاعِيُّ، عَنْ عَبْدَةَ بْنِ أَبِي لُبَابَةَ، عَنْ مُجَاهِدِ بْنِ جَبْرٍ الْمَكِّيِّ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ يَقُولُ لاَ هِجْرَةَ بَعْدَ الْفَتْحِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4112,
                "hadithNumber": "4312",
                "englishNarrator": "Narrated `Ata' bin Abi Rabah:",
                "hadithEnglish": "`Ubaid bin `Umar and I visited `Aisha رضی اللہ عنہا , and he asked her about the migration. She said, \"There is no migration today. A believer used to flee with his religion to Allah and His Prophet for fear that he might be put to trial as regards his religion. Today Allah has rendered Islam victorious; therefore a believing one can worship one's Lord wherever one wishes. But there is Jihad (for Allah's Cause) and intentions.\" (See Hadith 42, in the 4th Vol. for its Explanation)",
                "hadithUrdu": "میں عبید بن عمیر کے ساتھ عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا۔ عبید نے ان سے ہجرت کا مسئلہ پوچھا تو انہوں نے کہا کہ اب ہجرت باقی نہیں رہی۔ پہلے مسلمان اپنا دین بچانے کے لیے اللہ اور اس کے رسول کی طرف پناہ لینے کے لیے آتے تھے، اس خوف سے کہ کہیں دین کی وجہ سے فتنہ میں نہ پڑ جائیں۔ اس لیے اب جب کہ اللہ تعالیٰ نے اسلام کو غالب کر دیا تو مسلمان جہاں بھی چاہے اپنے رب کی عبادت کر سکتا ہے۔ اب تو صرف جہاد اور جہاد کی نیت کا ثواب باقی ہے۔",
                "urduNarrator": "ہم سے اسحاق بن یزید نے بیان کیا، کہا ہم سے یحییٰ بن حمزہ نے بیان کیا، کہا کہ مجھ سے امام اوزاعی نے بیان کیا، ان سے عطا بن ابی رباح نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ يَزِيدَ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، قَالَ حَدَّثَنِي الأَوْزَاعِيُّ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، قَالَ زُرْتُ عَائِشَةَ مَعَ عُبَيْدِ بْنِ عُمَيْرٍ فَسَأَلَهَا عَنِ الْهِجْرَةِ، فَقَالَتْ لاَ هِجْرَةَ الْيَوْمَ، كَانَ الْمُؤْمِنُ يَفِرُّ أَحَدُهُمْ بِدِينِهِ إِلَى اللَّهِ وَإِلَى رَسُولِهِ صلى الله عليه وسلم مَخَافَةَ أَنْ يُفْتَنَ عَلَيْهِ، فَأَمَّا الْيَوْمَ فَقَدْ أَظْهَرَ اللَّهُ الإِسْلاَمَ، فَالْمُؤْمِنُ يَعْبُدُ رَبَّهُ حَيْثُ شَاءَ، وَلَكِنْ جِهَادٌ وَنِيَّةٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4113,
                "hadithNumber": "4313",
                "englishNarrator": "Narrated Mujahid:",
                "hadithEnglish": "Allah's Messenger (ﷺ) got up on the day of the Conquest of Mecca and said, \"Allah has made Mecca a sanctuary since the day He created the Heavens and the Earth, and it will remain a sanctuary by virtue of the sanctity Allah has bestowed on it till the Day of Resurrection. It (i.e. fighting in it) was not made lawful to anyone before me!, nor will it be made lawful to anyone after me, and it was not made lawful for me except for a short period of time. Its game should not be chased, nor should its trees be cut, nor its vegetation or grass uprooted, not its Luqata (i.e. Most things) picked up except by one who makes a public announcement about it.\" Al-Abbas bin `Abdul Muttalib said, \"Except the Idhkhir, O Allah's Messenger (ﷺ), as it is indispensable for blacksmiths and houses.\" On that, the Prophet (ﷺ) kept quiet and then said, \"Except the Idhkhir as it is lawful to cut.\" Ibn-e-Juraij, Abdul Karim, Ikrimah has reported in the similar way fro, Hadrat Ibn-e-Abbaas رضی اللہ عنہما , and Hadrat Abu Hurairah has reported the same from the prophet ﷺ.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم فتح مکہ کے دن خطبہ سنانے کھڑے ہوئے اور فرمایا ”جس دن اللہ تعالیٰ نے آسمان و زمین کو پیدا کیا تھا، اسی دن اس نے مکہ کو حرمت والا شہر قرار دے دیا تھا۔ پس یہ شہر اللہ کے حکم کے مطابق قیامت تک کے لیے حرمت والا رہے گا۔ جو مجھ سے پہلے کبھی کسی کے لیے حلال نہیں ہوا اور نہ میرے بعد کسی کے لیے حلال ہو گا اور میرے لیے بھی صرف ایک گھڑی کے لیے حلال ہوا تھا۔ یہاں حدود حرم میں شکار کے قابل جانور نہ چھیڑے جائیں۔ یہاں کے کانٹے دار درخت نہ کاٹے جائیں نہ یہاں کی گھاس اکھاڑی جائے اور یہاں پر گری پڑی چیز اس شخص کے سوا جو اعلان کرنے کا ارادہ رکھتا ہو اور کسی کے لیے اٹھانی جائز نہیں۔“ اس پر عباس بن عبدالمطلب رضی اللہ عنہ  نے کہا: یا رسول اللہ! اذخر ( گھاس ) کی اجازت دے دیجئیے کیونکہ سناروں کے لیے اور مکانات ( کی تعمیر وغیرہ ) کے لیے یہ ضروری ہے۔ آپ صلی اللہ علیہ وسلم خاموش ہو گئے پھر فرمایا ”اذخر اس حکم سے الگ ہے اس کا ( کاٹنا ) حلال ہے۔“ دوسری روایت ابن جریج سے ( اسی سند سے ) ایسی ہی ہے انہوں نے عبدالکریم بن مالک سے، انہوں نے ابن عباس سے اور ابوہریرہ رضی اللہ عنہ نے بھی نبی کریم صلی اللہ علیہ وسلم سے ایسے ہی روایت کی ہے۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے ابوعاصم نبیل نے بیان کیا، ان سے ابن جریج نے بیان کیا، کہا مجھ کو حسن بن مسلم نے خبر دی اور انہیں مجاہد نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي حَسَنُ بْنُ مُسْلِمٍ، عَنْ مُجَاهِدٍ، أَنَّ رَسُولَ اللَّهِ قَامَ يَوْمَ الْفَتْحِ فَقَالَ ‏\"‏ إِنَّ اللَّهَ حَرَّمَ مَكَّةَ يَوْمَ خَلَقَ السَّمَوَاتِ وَالأَرْضَ، فَهْىَ حَرَامٌ بِحَرَامِ اللَّهِ إِلَى يَوْمِ الْقِيَامَةِ، لَمْ تَحِلَّ لأَحَدٍ قَبْلِي، وَلاَ تَحِلُّ لأَحَدٍ بَعْدِي، وَلَمْ تَحْلِلْ لِي إِلاَّ سَاعَةً مِنَ الدَّهْرِ، لاَ يُنَفَّرُ صَيْدُهَا، وَلاَ يُعْضَدُ شَوْكُهَا، وَلاَ يُخْتَلَى خَلاَهَا وَلاَ تَحِلُّ لُقَطَتُهَا إِلاَّ لِمُنْشِدٍ ‏\"‏‏.‏ فَقَالَ الْعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ إِلاَّ الإِذْخِرَ يَا رَسُولَ اللَّهِ، فَإِنَّهُ لاَ بُدَّ مِنْهُ لِلْقَيْنِ وَالْبُيُوتِ، فَسَكَتَ ثُمَّ قَالَ ‏\"‏ إِلاَّ الإِذْخِرَ فَإِنَّهُ حَلاَلٌ ‏\"‏‏.‏ وَعَنِ ابْنِ جُرَيْجٍ أَخْبَرَنِي عَبْدُ الْكَرِيمِ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ بِمِثْلِ هَذَا أَوْ نَحْوِ هَذَا‏.‏ رَوَاهُ أَبُو هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4114,
                "hadithNumber": "4314",
                "englishNarrator": "Narrated Isma`il:",
                "hadithEnglish": "I saw (a healed scar of) blow over the hand of Ibn Abi `Aufa رضی اللہ عنہما who said, \"I received that blow in the battle of Hunain in the company of the Prophet.\" I said, \"Did you take part in the battle of Hunain?\" He replied, \"Yes (and in other battles) before it.\"",
                "hadithUrdu": "میں نے عبداللہ بن ابی اوفی رضی اللہ عنہما کے ہاتھ میں زخم کا نشان دیکھا پھر انہوں نے بتلایا کہ یہ زخم اس وقت آیا تھا جب میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ غزوہ حنین میں شریک تھا۔ میں نے کہا، آپ حنین میں شریک تھے؟ انہوں نے کہا کہ اس سے پہلے بھی میں کئی غزوات میں شریک ہو چکا ہوں۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا، کہا ہم سے یزید بن ہارون نے بیان کیا، کہا ہم کو اسماعیل بن ابی خالد نے خبر دی، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا إِسْمَاعِيلُ، رَأَيْتُ بِيَدِ ابْنِ أَبِي أَوْفَى ضَرْبَةً، قَالَ ضُرِبْتُهَا مَعَ النَّبِيِّ صلى الله عليه وسلم يَوْمَ حُنَيْنٍ‏.‏ قُلْتُ شَهِدْتَ حُنَيْنًا قَالَ قَبْلَ ذَلِكَ‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَيَوْمَ حُنَيْنٍ إِذْ أَعْجَبَتْكُمْ كَثْرَتُكُمْ فَلَمْ تُغْنِ عَنْكُمْ شَيْئًا وَضَاقَتْ عَلَيْكُمُ الأَرْضُ بِمَا رَحُبَتْ ثُمَّ وَلَّيْتُمْ مُدْبِرِينَ ثُمَّ أَنْزَلَ اللَّهُ سَكِينَتَهُ} إِلَى قَوْلِهِ: {غَفُورٌ رَحِيمٌ}",
                "headingUrdu": "’’اور حنین کے دن جب تم اپنی بڑی تعداد پر خوش ہوئے…‘‘",
                "headingEnglish": "“…and on the day of Hunain when you rejoiced at your great number….”",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4115,
                "hadithNumber": "4315",
                "englishNarrator": "Narrated Abu 'Is-haq:",
                "hadithEnglish": "I heard Al-Bara رضی اللہ عنہ' narrating when a man came and said to him, \"O Abu '`Umara! Did you flee on the day (of the battle) of Hunain?\" Al-Bara' replied, \"I testify that the Prophet (ﷺ) did not flee, but the hasty people hurried away and the people of Hawazin threw arrows at them. At that time, Abu Sufyan bin Al-Harith رضی اللہ عنہ was holding the white mule of the Prophet (ﷺ) by the head, and the Prophet (ﷺ) was saying, \"I am the Prophet (ﷺ) undoubtedly: I am the son of `Abdul-Muttalib.\"",
                "hadithUrdu": "میں نے براء رضی اللہ عنہ سے سنا، ان کے یہاں ایک شخص آیا اور کہنے لگا کہ اے ابو عمارہ! کیا تم نے حنین کی لڑائی میں پیٹھ پھیر لی تھی؟ انہوں نے کہا، میں اس کی گواہی دیتا ہوں کہ نبی کریم صلی اللہ علیہ وسلم اپنی جگہ سے نہیں ہٹے تھے۔ البتہ جو لوگ قوم میں جلد باز تھے، انہوں نے اپنی جلد بازی کا ثبوت دیا تھا، پس قبیلہ ہوازن والوں نے ان پر تیر برسائے۔ ابوسفیان بن حارث رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے سفید خچر کی لگام تھامے ہوئے تھے اور نبی کریم صلی اللہ علیہ وسلم فرما رہے تھے «أنا النبي لا كذب،‏‏‏‏ أنا ابن عبد المطلب‏» ”میں نبی ہوں اس میں بالکل جھوٹ نہیں، میں عبدالمطلب کی اولاد ہوں۔“",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے ابواسحاق نے، کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ، رضى الله عنه وَجَاءَهُ رَجُلٌ فَقَالَ يَا أَبَا عُمَارَةَ أَتَوَلَّيْتَ يَوْمَ حُنَيْنٍ فَقَالَ أَمَّا أَنَا فَأَشْهَدُ عَلَى النَّبِيِّ صلى الله عليه وسلم أَنَّهُ لَمْ يُوَلِّ، وَلَكِنْ عَجِلَ سَرَعَانُ الْقَوْمِ، فَرَشَقَتْهُمْ هَوَازِنُ، وَأَبُو سُفْيَانَ بْنُ الْحَارِثِ آخِذٌ بِرَأْسِ بَغْلَتِهِ الْبَيْضَاءِ يَقُولُ ‏{‏أَنَا النَّبِيُّ لاَ كَذِبْ، أَنَا ابْنُ عَبْدِ الْمُطَّلِبْ‏}‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4116,
                "hadithNumber": "4316",
                "englishNarrator": "Narrated Abu 'Is-haq:",
                "hadithEnglish": "Al-Bara رضی اللہ عنہ' was asked while I was listening, \"Did you flee (before the enemy) along with the Prophet (ﷺ) on the day of (the battle of) Hunain?\" He replied, \"As for the Prophet, he did not (flee). The enemy were good archers and the Prophet (ﷺ) was saying, \"I am the Prophet (ﷺ) undoubtedly; I am the son of `Abdul Muttalib.\"",
                "hadithUrdu": "براء بن عازب رضی اللہ عنہ سے پوچھا گیا اور میں سن رہا تھا کہ تم لوگوں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ غزوہ حنین میں پیٹھ پھیر لی تھی؟ انہوں نے کہا جہاں تک نبی کریم صلی اللہ علیہ وسلم کا تعلق ہے تو آپ نے پیٹھ نہیں پھیری تھی۔ ہوا یہ تھا کہ ہوازن والے بڑے تیرانداز تھے، نبی کریم صلی اللہ علیہ وسلم نے اس موقع پر فرمایا تھا «أنا النبي لا كذب أنا ابن عبد المطلب» ”میں نبی ہوں اس میں جھوٹ نہیں، میں عبدالمطلب کی اولاد ہوں۔“",
                "urduNarrator": "ہم سے ابوالولید نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے ابواسحاق نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قِيلَ لِلْبَرَاءِ وَأَنَا أَسْمَعُ، أَوَلَّيْتُمْ مَعَ النَّبِيِّ صلى الله عليه وسلم يَوْمَ حُنَيْنٍ فَقَالَ أَمَّا النَّبِيُّ صلى الله عليه وسلم فَلاَ، كَانُوا رُمَاةً فَقَالَ ‏ \"‏ أَنَا النَّبِيُّ لاَ كَذِبْ أَنَا ابْنُ عَبْدِ الْمُطَّلِبْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4117,
                "hadithNumber": "4317",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "when a man from Qais (tribe) asked him \"Did you flee leaving Allah's Messenger (ﷺ) on the day (of the battle) of Hunain?\" Al-Bara' replied, \"But Allah's Messenger (ﷺ) did not flee. The people of Hawazin were good archers, and when we attacked them, they fled. But rushing towards the booty, we were confronted by the arrows (of the enemy). I saw the Prophet (ﷺ) riding his white mule while Abu Sufyan was holding its reins, and the Prophet (ﷺ) was saying \"I am the Prophet (ﷺ) undoubtedly.\" (Israil and Zuhair said, \"The Prophet (ﷺ) dismounted from his Mule.\")",
                "hadithUrdu": "ان سے قبیلہ قیس کے ایک آدمی نے پوچھا کہ کیا تم لوگ نبی کریم صلی اللہ علیہ وسلم کو غزوہ حنین میں چھوڑ کر بھاگ نکلے تھے؟ انہوں نے کہا: لیکن نبی کریم صلی اللہ علیہ وسلم اپنی جگہ سے نہیں ہٹے تھے۔ قبیلہ ہوازن کے لوگ تیرانداز تھے، جب ان پر ہم نے حملہ کیا تو وہ پسپا ہو گئے پھر ہم لوگ مال غنیمت میں لگ گئے۔ آخر ہمیں ان کے تیروں کا سامنا کرنا پڑا۔ میں نے خود دیکھا تھا کہ نبی کریم صلی اللہ علیہ وسلم اپنے سفید خچر پر سوار تھے اور ابوسفیان بن حارث رضی اللہ عنہ اس کی لگام تھامے ہوئے تھے۔ آپ صلی اللہ علیہ وسلم فرما رہے تھے «أنا النبي لا كذب‏» ”میں نبی ہوں، اس میں جھوٹ نہیں۔“ اسرائیل اور زہیر نے بیان کیا کہ بعد میں آپ صلی اللہ علیہ وسلم اپنے خچر سے اتر گئے۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر نے بیان کیا، ان سے شعبہ نے بیان کیا، ان سے ابواسحاق نے، انہوں نے براء رضی اللہ عنہ سے سنا اور",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، سَمِعَ الْبَرَاءَ ـ وَسَأَلَهُ رَجُلٌ مِنْ قَيْسٍ ـ أَفَرَرْتُمْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ حُنَيْنٍ فَقَالَ لَكِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَفِرَّ، كَانَتْ هَوَازِنُ رُمَاةً، وَإِنَّا لَمَّا حَمَلْنَا عَلَيْهِمِ انْكَشَفُوا، فَأَكْبَبْنَا عَلَى الْغَنَائِمِ، فَاسْتُقْبِلْنَا بِالسِّهَامِ، وَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى بَغْلَتِهِ الْبَيْضَاءِ، وَإِنَّ أَبَا سُفْيَانَ آخِذٌ بِزِمَامِهَا وَهْوَ يَقُولُ ‏{‏أَنَا النَّبِيُّ لاَ كَذِبْ‏}‏‏.‏ قَالَ إِسْرَائِيلُ وَزُهَيْرٌ نَزَلَ النَّبِيُّ صلى الله عليه وسلم عَنْ بَغْلَتِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4118,
                "hadithNumber": "4318, 4319",
                "englishNarrator": "Narrated Marwan and Al-Miswar bin Makhrama رضی اللہ عنہ :",
                "hadithEnglish": "When the delegate of Hawazin came to Allah's Messenger (ﷺ) declaring their conversion to Islam and asked him to return their properties and captives, Allah's Messenger (ﷺ) got up and said to them, \"There Is involved in this matter, the people whom you see with me, and the most beloved talk to me, is the true one. So choose one of two alternatives: Either the captives or the properties. I have been waiting for you (i.e. have not distributed the booty).\" Allah's Messenger (ﷺ) had delayed the distribution of their booty over ten nights after his return from Ta'if. So when they came to know that Allah's Messenger (ﷺ) was not going to return to them but one of the two, they said, \"We prefer to have our captives.\" So Allah's Messenger (ﷺ) got up amongst the Muslims, and praising Allah as He deserved, said, \"To proceed! Your brothers have come to you with repentance and I see (it logical) to return their captives. So, whoever of you likes to do that as a favor then he can do it. And whoever of you likes to stick to his share till we give him from the very first booty which Allah will give us, then he can do so.\" The people said, \"We do that (i.e. return the captives) willingly as a favor, O Allah's Messenger (ﷺ)!\" Allah's Messenger (ﷺ) said, \"We do not know which of you have agreed to it and which have not; so go back and let your chiefs forward us your decision.\" They went back and their chief's spoke to them, and they (i.e. the chiefs) returned to Allah's Messenger (ﷺ) and informed him that all of them had agreed (to give up their captives) with pleasure, and had given their permission (i.e. that the captives be returned to their people). (The sub-narrator said, \"That is what has reached me about the captives of Hawazin tribe.\")",
                "hadithUrdu": "جب قبیلہ ہوازن کا وفد مسلمان ہو کر حاضر ہوا تو رسول اللہ صلی اللہ علیہ وسلم رخصت دینے کھڑے ہوئے، انہوں نے آپ سے یہ درخواست کی کہ ان کا مال اور ان کے ( قبیلے کے قیدی ) انہیں واپس دے دئیے جائیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا جیسا کہ تم لوگ دیکھ رہے ہو، میرے ساتھ کتنے اور لوگ بھی ہیں اور دیکھو سچی بات مجھے سب سے زیادہ پسند ہے۔ اس لیے تم لوگ ایک ہی چیز پسند کر لو یا تو اپنے قیدی لے لو یا مال لے لو۔ میں نے تم ہی لوگوں کے خیال سے ( قیدیوں کی تقسیم میں ) تاخیر کی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے طائف سے واپس ہو کر تقریباً دس دن ان کا انتظار کیا تھا۔ آخر جب ان پر واضح ہو گیا کہ نبی کریم صلی اللہ علیہ وسلم انہیں صرف ایک ہی چیز واپس کریں گے تو انہوں نے کہا کہ پھر ہم اپنے ( قبیلے کے ) قیدیوں کی واپسی چاہتے ہیں۔ چنانچہ آپ صلی اللہ علیہ وسلم نے مسلمانوں کو خطاب کیا، اللہ تعالیٰ کی اس کی شان کے مطابق ثنا کرنے کے بعد فرمایا: امابعد! تمہارے بھائی ( قبیلہ ہوازن کے لوگ ) توبہ کر کے ہمارے پاس آئے ہیں، مسلمان ہو کر اور میری رائے یہ ہے کہ ان کے قیدی انہیں واپس کر دئیے جائیں۔ اس لیے جو شخص ( بلا کسی دنیاوی صلہ کے ) انہیں اپنی خوشی سے واپس کرنا چاہے وہ واپس کر دے یہ بہتر ہے اور جو لوگ اپنا حصہ نہ چھوڑنا چاہتے ہوں، ان کا حق قائم رہے گا۔ وہ یوں کر لیں کہ اس کے بعد جو سب سے پہلے غنیمت اللہ تعالیٰ ہمیں عنایت فرمائے گا اس میں سے ہم انہیں اس کے بدلہ دے دیں گے تو وہ ان کے قیدی واپس کر دیں۔ تمام صحابہ رضی اللہ عنہم نے کہا: یا رسول اللہ! ہم خوشی سے ( بلا کسی بدلہ کے ) واپس کرنا چاہتے ہیں لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس طرح ہمیں اس کا علم نہیں ہو گا کہ کس نے اپنی خوشی سے واپس کیا ہے اور کس نے نہیں، اس لیے سب لوگ جائیں اور تمہارے چودھری لوگ تمہارا فیصلہ ہمارے پاس لائیں۔ چنانچہ سب واپس آ گئے اور ان کے چودھریوں نے ان سے گفتگو کی پھر وہ آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ سب نے خوشی اور فراخ دلی کے ساتھ اجازت دے دی ہے۔ ابن عباس رضی اللہ عنہما نے کہا یہی ہے وہ حدیث جو مجھے قبیلہ ہوازن کے قیدیوں کے متعلق پہنچی ہے۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا، کہا کہ مجھ سے لیث بن سعد نے بیان کیا، کہا مجھ سے عقیل نے بیان کیا، ان سے ابن شہاب نے (دوسری سند) اور مجھ سے اسحاق بن منصور نے بیان کیا، کہا ہم سے یعقوب بن ابراہیم نے بیان کیا، ہم سے ابن شہاب کے بھتیجے (محمد بن عبداللہ بن شہاب نے) بیان کیا کہ محمد بن شہاب نے کہا کہ ان سے عروہ بن زبیر نے بیان کیا کہ انہیں مروان بن حکم اور مسور بن مخرمہ رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي لَيْثٌ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ،‏.‏ وَحَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ،، قَالَ مُحَمَّدُ بْنُ شِهَابٍ وَزَعَمَ عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ مَرْوَانَ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ حِينَ جَاءَهُ وَفْدُ هَوَازِنَ مُسْلِمِينَ، فَسَأَلُوهُ أَنْ يَرُدَّ إِلَيْهِمْ أَمْوَالَهُمْ وَسَبْيَهُمْ، فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَعِي مَنْ تَرَوْنَ، وَأَحَبُّ الْحَدِيثِ إِلَىَّ أَصْدَقُهُ، فَاخْتَارُوا إِحْدَى الطَّائِفَتَيْنِ إِمَّا السَّبْىَ، وَإِمَّا الْمَالَ، وَقَدْ كُنْتُ اسْتَأْنَيْتُ بِكُمْ ‏\"‏‏.‏ وَكَانَ أَنْظَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم بِضْعَ عَشْرَةَ لَيْلَةً، حِينَ قَفَلَ مِنَ الطَّائِفِ، فَلَمَّا تَبَيَّنَ لَهُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم غَيْرُ رَادٍّ إِلَيْهِمْ إِلاَّ إِحْدَى الطَّائِفَتَيْنِ قَالُوا فَإِنَّا نَخْتَارُ سَبْيَنَا‏.‏ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمُسْلِمِينَ، فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَإِنَّ إِخْوَانَكُمْ قَدْ جَاءُونَا تَائِبِينَ، وَإِنِّي قَدْ رَأَيْتُ أَنْ أَرُدَّ إِلَيْهِمْ سَبْيَهُمْ، فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يُطَيِّبَ ذَلِكَ فَلْيَفْعَلْ، وَمَنْ أَحَبَّ مِنْكُمْ أَنْ يَكُونَ عَلَى حَظِّهِ، حَتَّى نُعْطِيَهُ إِيَّاهُ مِنْ أَوَّلِ مَا يُفِيءُ اللَّهُ عَلَيْنَا، فَلْيَفْعَلْ ‏\"‏‏.‏ فَقَالَ النَّاسُ قَدْ طَيَّبْنَا ذَلِكَ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّا لاَ نَدْرِي مَنْ أَذِنَ مِنْكُمْ فِي ذَلِكَ مِمَّنْ لَمْ يَأْذَنْ فَارْجِعُوا حَتَّى يَرْفَعَ إِلَيْنَا عُرَفَاؤُكُمْ أَمْرَكُمْ ‏\"‏‏.‏ فَرَجَعَ النَّاسُ فَكَلَّمَهُمْ عُرَفَاؤُهُمْ ثُمَّ رَجَعُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرُوهُ أَنَّهُمْ قَدْ طَيَّبُوا وَأَذِنُوا‏.‏ هَذَا الَّذِي بَلَغَنِي عَنْ سَبْىِ هَوَازِنَ‏.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4119,
                "hadithNumber": "4320",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When we returned from (the battle of) Hunain, `Umar رضی اللہ عنہ asked the Prophet (ﷺ) about a vow which he had made during the Pre-lslamic period of Ignorance that he would perform I`tikaf. The Prophet (ﷺ) ordered him to fulfill his vow. Some people have narrated its chain like this: Hammad from Ayyub, he from Nafii and he from Ibn-e-Umer رضی اللہ عنہما who has reported from the prophet ﷺ. (Imam Bukhari has himself presented this Hadith with two authorities). Thus, other authorities have been mentioned. Thus, there are four chains in total.",
                "hadithUrdu": "جب ہم غزوہ حنین سے واپس ہو رہے تھے تو عمر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اپنی ایک نذر کے متعلق پوچھا جو انہوں نے زمانہ جاہلیت میں اعتکاف کی مانی تھی اور نبی کریم صلی اللہ علیہ وسلم نے انہیں اسے پوری کرنے کا حکم دیا اور بعض ( احمد بن عبدہ ضبی ) نے حماد سے بیان کیا، ان سے ایوب نے، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے۔ اور اس روایت کو جریر بن حازم اور حماد بن سلمہ نے ایوب سے بیان کیا، ان سے نافع نے، ان سے ابن عمر رضی اللہ عنہما نے، نبی کریم صلی اللہ علیہ وسلم سے۔",
                "urduNarrator": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ایوب نے، ان سے نافع نے کہ عمر رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! (دوسری سند) اور مجھ سے محمد بن مقاتل نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، انہیں معمر نے خبر دی، انہیں ایوب نے، انہیں نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، أَنَّ عُمَرَ، قَالَ يَا رَسُولَ اللَّهِ‏.‏ حَدَّثَنِي مُحَمَّدُ بْنُ مُقَاتِلٍ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ لَمَّا قَفَلْنَا مِنْ حُنَيْنٍ سَأَلَ عُمَرُ النَّبِيَّ صلى الله عليه وسلم عَنْ نَذْرٍ كَانَ نَذَرَهُ فِي الْجَاهِلِيَّةِ اعْتِكَافٍ، فَأَمَرَهُ النَّبِيُّ صلى الله عليه وسلم بِوَفَائِهِ‏.‏ وَقَالَ بَعْضُهُمْ حَمَّادٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ‏.‏ وَرَوَاهُ جَرِيرُ بْنُ حَازِمٍ وَحَمَّادُ بْنُ سَلَمَةَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4120,
                "hadithNumber": "4321",
                "englishNarrator": "Narrated Abu Qatada رضی اللہ عنہ :",
                "hadithEnglish": "We set out along with the Prophet (ﷺ) during the year of (the battle of) Hunain, and when we faced the enemy, the Muslims (with the exception of the Prophet (ﷺ) and some of his companions) retreated (before the enemy). I saw one of the pagans over-powering one of the Muslims, so I struck the pagan from behind his neck causing his armor to be cut off. The pagan headed towards me and pressed me so forcibly that I felt as if I was dying. Then death took him over and he released me. Afterwards I followed `Umar رضی اللہ عنہ and said to him, \"What is wrong with the people?\" He said, \"It is the Order of Allah.\" Then the Muslims returned (to the battle after the flight) and (after overcoming the enemy) the Prophet sat and said, \"Whoever had killed an Infidel and has an evidence to this issue, will have the Salb (i.e. the belonging of the deceased e.g. clothes, arms, horse, etc).\" I (stood up) and said, \"Who will be my witness?\" and then sat down. Then the Prophet (ﷺ) repeated his question. Then the Prophet (ﷺ) said the same (for the third time). I got up and said, \"Who will be my witness?\" and then sat down. The Prophet (ﷺ) asked his former question again. So I got up. The Prophet (ﷺ) said, What is the matter, O Abu Qatada?\" So I narrated the whole story; A man said, \"Abu Qatada has spoken the truth, and the Salb of the deceased is with me, so please compensate Abu Qatada on my behalf.\" Abu Bakr رضی اللہ عنہ said, \"No! By Allah, it will never happen that the Prophet (ﷺ) will leave a Lion of Allah who fights for the Sake of Allah and His Apostle and give his spoils to you.\" The Prophet (ﷺ) said, \"Abu Bakr رضی اللہ عنہ has spoken the truth. Give it (the spoils) back to him (O man)!\" So he gave it to me and I bought a garden in (the land of) Banu Salama with it (i.e. the spoils) and that was the first property I got after embracing Islam.",
                "hadithUrdu": "غزوہ حنین کے لیے ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ نکلے۔ جب جنگ ہوئی تو مسلمان ذرا ڈگمگا گئے ( یعنی آگے پیچھے ہو گئے ) ۔ میں نے دیکھا کہ ایک مشرک ایک مسلمان کے اوپر غالب ہو رہا ہے، میں نے پیچھے سے اس کی گردن پر تلوار ماری اور اس کی زرہ کاٹ ڈالی۔ اب وہ مجھ پر پلٹ پڑا اور مجھے اتنی زور سے بھینچا کہ موت کی تصویر میری آنکھوں میں پھر گئی، آخر وہ مر گیا اور مجھے چھوڑ دیا۔ پھر میری ملاقات عمر رضی اللہ عنہ سے ہوئی۔ میں نے پوچھا لوگوں کو کیا ہو گیا ہے؟ انہوں نے فرمایا، یہی اللہ عزوجل کا حکم ہے۔ پھر مسلمان پلٹے اور ( جنگ ختم ہونے کے بعد ) نبی کریم صلی اللہ علیہ وسلم تشریف فرما ہوئے اور فرمایا کہ جس نے کسی کو قتل کیا ہو اور اس کے لیے کوئی گواہ بھی رکھتا ہو تو اس کا تمام سامان و ہتھیار اسے ہی ملے گا۔ میں نے اپنے دل میں کہا کہ میرے لیے کون گواہی دے گا؟ پھر میں بیٹھ گیا۔ بیان کیا کہ پھر آپ نے دوبارہ یہی فرمایا۔ اس مرتبہ پھر میں نے دل میں کہا کہ میرے لیے کون گواہی دے گا؟ اور پھر بیٹھ گیا۔ آپ صلی اللہ علیہ وسلم نے پھر اپنا فرمان دہرایا تو میں اس مرتبہ کھڑا ہو گیا۔ آپ صلی اللہ علیہ وسلم نے اس مرتبہ فرمایا کیا بات ہے، اے ابوقتادہ! میں نے آپ صلی اللہ علیہ وسلم کو بتایا تو ایک صاحب ( اسود بن خزاعی اسلمی ) نے کہا کہ یہ سچ کہتے ہیں اور ان کے مقتول کا سامان میرے پاس ہے۔ آپ میرے حق میں انہیں راضی کر دیں ( کہ سامان مجھ سے نہ لیں ) اس پر ابوبکر رضی اللہ عنہ نے فرمایا: نہیں، اللہ کی قسم! اللہ کے شیروں میں سے ایک شیر، جو اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی طرف سے لڑتا ہے پھر نبی کریم صلی اللہ علیہ وسلم اس کا حق تمہیں ہرگز نہیں دے سکتے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہوں نے سچ کہا، تم سامان ابوقتادہ کو دے دو۔ انہوں نے سامان مجھے دے دیا۔ میں نے اس سامان سے قبیلہ سلمہ کے محلہ میں ایک باغ خریدا اسلام کے بعد یہ میرا پہلا مال تھا، جسے میں نے حاصل کیا تھا۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا، کہا ہم کو امام مالک رحمہ اللہ نے خبر دی، انہیں یحییٰ بن سعید نے، انہیں عمرو بن کثیر بن افلح نے، انہیں قتادہ کے مولیٰ ابو محمد نے اور ان سے ابوقتادہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُمَرَ بْنِ كَثِيرِ بْنِ أَفْلَحَ، عَنْ أَبِي مُحَمَّدٍ، مَوْلَى أَبِي قَتَادَةَ عَنْ أَبِي قَتَادَةَ، قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم عَامَ حُنَيْنٍ، فَلَمَّا الْتَقَيْنَا كَانَتْ لِلْمُسْلِمِينَ جَوْلَةٌ، فَرَأَيْتُ رَجُلاً مِنَ الْمُشْرِكِينَ، قَدْ عَلاَ رَجُلاً مِنَ الْمُسْلِمِينَ، فَضَرَبْتُهُ مِنْ وَرَائِهِ عَلَى حَبْلِ عَاتِقِهِ بِالسَّيْفِ، فَقَطَعْتُ الدِّرْعَ، وَأَقْبَلَ عَلَىَّ فَضَمَّنِي ضَمَّةً وَجَدْتُ مِنْهَا رِيحَ الْمَوْتِ، ثُمَّ أَدْرَكَهُ الْمَوْتُ فَأَرْسَلَنِي، فَلَحِقْتُ عُمَرَ فَقُلْتُ مَا بَالُ النَّاسِ قَالَ أَمْرُ اللَّهِ عَزَّ وَجَلَّ‏.‏ ثُمَّ رَجَعُوا وَجَلَسَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنْ قَتَلَ قَتِيلاً لَهُ عَلَيْهِ بَيِّنَةٌ فَلَهُ سَلَبُهُ ‏\"‏‏.‏ فَقُلْتُ مَنْ يَشْهَدُ لِي ثُمَّ جَلَسْتُ ـ قَالَ ـ ثُمَّ قَالَ النَّبِيُّ صلى الله عليه وسلم مِثْلَهُ فَقُمْتُ فَقُلْتُ مَنْ يَشْهَدُ لِي ثُمَّ جَلَسْتُ قَالَ ثُمَّ قَالَ النَّبِيُّ صلى الله عليه وسلم مِثْلَهُ، فَقُمْتُ فَقَالَ ‏\"‏ مَالَكَ يَا أَبَا قَتَادَةَ ‏\"‏‏.‏ فَأَخْبَرْتُهُ‏.‏ فَقَالَ رَجُلٌ صَدَقَ وَسَلَبُهُ عِنْدِي، فَأَرْضِهِ مِنِّي‏.‏ فَقَالَ أَبُو بَكْرٍ لاَهَا اللَّهِ، إِذًا لاَ يَعْمِدُ إِلَى أَسَدٍ مِنْ أُسْدِ اللَّهِ يُقَاتِلُ عَنِ اللَّهِ وَرَسُولِهِ صلى الله عليه وسلم فَيُعْطِيَكَ سَلَبَهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ صَدَقَ فَأَعْطِهِ ‏\"‏‏.‏ فَأَعْطَانِيهِ فَابْتَعْتُ بِهِ مَخْرَفًا فِي بَنِي سَلِمَةَ، فَإِنَّهُ لأَوَّلُ مَالٍ تَأَثَّلْتُهُ فِي الإِسْلاَمِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4121,
                "hadithNumber": "4322",
                "englishNarrator": "Narrated Abu Qatada رضی اللہ عنہ :",
                "hadithEnglish": "When it was the day of (the battle of) Hunain, I saw a Muslim man fighting with one of the pagans and another pagan was hiding himself behind the Muslim in order to kill him. So I hurried towards the pagan who was hiding behind the Muslim to kill him, and he raised his hand to hit me but I hit his hand and cut it off. That man got hold of me and pressed me so hard that I was afraid (that I would die), then he knelt down and his grip became loose and I pushed him and killed him. The Muslims (excepting the Prophet (ﷺ) and some of his companions) started fleeing and I too, fled with them. Suddenly I met `Umar bin Al-Khattab رضی اللہ عنہ amongst the people and I asked him, \"What is wrong with the people?\" He said, \"It is the order of Allah\" Then the people returned to Allah's Messenger (ﷺ) (after defeating the enemy). Allah's Messenger (ﷺ) said, \"Whoever produces a proof that he has killed an infidel, will have the spoils of the killed man.\" So I got up to look for an evidence to prove that I had killed an infidel, but I could not find anyone to bear witness for me, so I sat down. Then it came to my mind (that I should speak of it) and I mentioned the case to Allah's Messenger (ﷺ). A man from the persons who were sitting with him (i.e. the Prophet), said, \"The arms of the deceased one whom he ( i.e. Abu Qatada رضی اللہ عنہ) has mentioned, are with me, so please compensate him for it (i.e. the spoils),\" Abu Bakr رضی اللہ عنہ said, \"No, Allah's Messenger (ﷺ) will not give it (i.e. the spoils) to a weak humble person from Quraish and leave one of Allah's Lions who fights on behalf of Allah and His Apostle.\" Allah's Messenger (ﷺ) then got up and gave that (spoils) to me, and I bought with it, a garden which was the first property I got after embracing Islam.",
                "hadithUrdu": "غزوہ حنین کے دن میں نے ایک مسلمان کو دیکھا کہ ایک مشرک سے لڑ رہا تھا اور ایک دوسرا مشرک پیچھے سے مسلمان کو قتل کرنے کی گھات میں تھا، پہلے تو میں اسی کی طرف بڑھا، اس نے اپنا ہاتھ مجھے مارنے کے لیے اٹھایا تو میں نے اس کے ہاتھ پر وار کر کے کاٹ دیا۔ اس کے بعد وہ مجھ سے چمٹ گیا اور اتنی زور سے مجھے بھینچا کہ میں ڈر گیا۔ آخر اس نے مجھے چھوڑ دیا اور ڈھیلا پڑ گیا۔ میں نے اسے دھکا دے کر قتل کر دیا اور مسلمان بھاگ نکلے اور میں بھی ان کے ساتھ بھاگ پڑا۔ لوگوں میں عمر بن خطاب رضی اللہ عنہ نظر آئے تو میں نے ان سے پوچھا، کہ لوگ بھاگ کیوں رہے ہیں؟ انہوں نے فرمایا کہ اللہ تعالیٰ کا یہی حکم ہے، پھر لوگ نبی کریم صلی اللہ علیہ وسلم کے پاس آ کر جمع ہو گئے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص اس پر گواہ قائم کر دے گا کہ کسی مقتول کو اسی نے قتل کیا ہے تو اس کا سارا سامان اسے ملے گا۔ میں اپنے مقتول پر گواہ کے لیے اٹھا لیکن مجھے کوئی گواہ دکھائی نہیں دیا۔ آخر میں بیٹھ گیا پھر میرے سامنے ایک صورت آئی۔ میں نے اپنے معاملے کی اطلاع نبی کریم صلی اللہ علیہ وسلم کو دی۔ آپ صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے ایک صاحب ( اسود بن خزاعی اسلمی رضی اللہ عنہ ) نے کہا کہ ان کے مقتول کا ہتھیار میرے پاس ہے، آپ میرے حق میں انہیں راضی کر دیں۔ اس پر ابوبکر رضی اللہ عنہ نے کہا ہرگز نہیں، اللہ کے شیروں میں سے ایک شیر کو چھوڑ کر جو اللہ اور اس کے رسول کے لیے جنگ کرتا ہے، اس کا حق قریش کے ایک بزدل کو آپ صلی اللہ علیہ وسلم نہیں دے سکتے۔ ابوقتادہ رضی اللہ عنہ نے بیان کیا کہ آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور مجھے وہ سامان عطا فرمایا۔ میں نے اس سے ایک باغ خریدا اور یہ سب سے پہلا مال تھا جسے میں نے اسلام لانے کے بعد حاصل کیا تھا۔",
                "urduNarrator": "اور لیث بن سعد نے بیان کیا، مجھ سے یحییٰ بن سعید انصاری نے بیان کیا تھا کہ ان سے عمر بن کثیر بن افلح نے، ان سے ابوقتادہ رضی اللہ عنہ کے مولیٰ ابو محمد نے کہ ابوقتادہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، عَنْ عُمَرَ بْنِ كَثِيرِ بْنِ أَفْلَحَ، عَنْ أَبِي مُحَمَّدٍ، مَوْلَى أَبِي قَتَادَةَ أَنَّ أَبَا قَتَادَةَ، قَالَ لَمَّا كَانَ يَوْمُ حُنَيْنٍ نَظَرْتُ إِلَى رَجُلٍ مِنَ الْمُسْلِمِينَ يُقَاتِلُ رَجُلاً مِنَ الْمُشْرِكِينَ، وَآخَرُ مِنَ الْمُشْرِكِينَ يَخْتِلُهُ مِنْ وَرَائِهِ لِيَقْتُلَهُ، فَأَسْرَعْتُ إِلَى الَّذِي يَخْتِلُهُ فَرَفَعَ يَدَهُ لِيَضْرِبَنِي، وَأَضْرِبُ يَدَهُ، فَقَطَعْتُهَا، ثُمَّ أَخَذَنِي، فَضَمَّنِي ضَمًّا شَدِيدًا حَتَّى تَخَوَّفْتُ، ثُمَّ تَرَكَ فَتَحَلَّلَ، وَدَفَعْتُهُ ثُمَّ قَتَلْتُهُ، وَانْهَزَمَ الْمُسْلِمُونَ، وَانْهَزَمْتُ مَعَهُمْ، فَإِذَا بِعُمَرَ بْنِ الْخَطَّابِ فِي النَّاسِ، فَقُلْتُ لَهُ مَا شَأْنُ النَّاسِ قَالَ أَمْرُ اللَّهِ، ثُمَّ تَرَاجَعَ النَّاسُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ أَقَامَ بَيِّنَةً عَلَى قَتِيلٍ قَتَلَهُ فَلَهُ سَلَبُهُ ‏\"‏‏.‏ فَقُمْتُ لأَلْتَمِسَ بَيِّنَةً عَلَى قَتِيلِي، فَلَمْ أَرَ أَحَدًا يَشْهَدُ لِي فَجَلَسْتُ، ثُمَّ بَدَا لِي، فَذَكَرْتُ أَمْرَهُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَجُلٌ مِنْ جُلَسَائِهِ سِلاَحُ هَذَا الْقَتِيلِ الَّذِي يَذْكُرُ عِنْدِي فَأَرْضِهِ مِنْهُ‏.‏ فَقَالَ أَبُو بَكْرٍ كَلاَّ لاَ يُعْطِهِ أُصَيْبِغَ مِنْ قُرَيْشٍ، وَيَدَعَ أَسَدًا مِنْ أُسْدِ اللَّهِ يُقَاتِلُ عَنِ اللَّهِ وَرَسُولِهِ صلى الله عليه وسلم قَالَ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَدَّاهُ إِلَىَّ، فَاشْتَرَيْتُ مِنْهُ خِرَافًا فَكَانَ أَوَّلَ مَالٍ تَأَثَّلْتُهُ فِي الإِسْلاَمِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4122,
                "hadithNumber": "4323",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "When the Prophet (ﷺ) had finished from the battle of Hunain, he sent Abu Amir at the head of an army to Autas He (i.e. Abu Amir  رضی اللہ عنہ ) met Duraid bin As Summa and Duraid was killed and Allah defeated his companions. The Prophet (ﷺ) sent me with Abu 'Amir. Abu Amir رضی اللہ عنہ was shot at his knee with an arrow which a man from Jushm had shot and fixed into his knee. I went to him and said, \"O Uncle! Who shot you?\" He pointed me out (his killer) saying, \"That is my killer who shot me (with an arrow).\" So I headed towards him and overtook him, and when he saw me, he fled, and I followed him and started saying to him, \"Won't you be ashamed? Won't you stop?\" So that person stopped, and we exchanged two hits with the swords and I killed him. Then I said to Abu 'Amir رضی اللہ عنہ . \"Allah has killed your killer.\" He said, \"Take out this arrow\" So I removed it, and water oozed out of the wound. He then said, \"O son of my brother! Convey my compliments to the Prophet (ﷺ) and request him to ask Allah's Forgiveness for me.\" Abu Amir رضی اللہ عنہ made me his successor in commanding the people (i.e. troops). He survived for a short while and then died. (Later) I returned and entered upon the Prophet (ﷺ) at his house, and found him lying in a bed made of stalks of date-palm leaves knitted with ropes, and on it there was bedding. The strings of the bed had their traces over his back and sides. Then I told the Prophet (ﷺ) about our and Abu Amir's news and how he had said \"Tell him to ask for Allah's Forgiveness for me.\" The Prophet (ﷺ) asked for water, performed ablution and then raised hands, saying, \"O Allah's Forgive `Ubaid, Abu Amir رضی اللہ عنہ .\" At that time I saw the whiteness of the Prophet's armpits. The Prophet (ﷺ) then said, \"O Allah, make him (i.e. Abu Amir رضی اللہ عنہ ) on the Day of Resurrection, superior to many of Your human creatures.\" I said, \"Will you ask Allah's Forgiveness for me?\" (On that) the Prophet (ﷺ) said, \"O Allah, forgive the sins of `Abdullah bin Qais and admit him to a nice entrance (i.e. paradise) on the Day of Resurrection.\" Abu Burda said, \"One of the prayers was for Abu 'Amir  رضی اللہ عنہ and the other was for Abu Musa رضی اللہ عنہ (i.e. `Abdullah bin Qais).",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم غزوہ حنین سے فارغ ہو گئے تو آپ نے ایک دستے کے ساتھ ابوعامر رضی اللہ عنہ کو وادی اوطاس کی طرف بھیجا۔ اس معرکہ میں درید ابن الصمہ سے مقابلہ ہوا۔ درید قتل کر دیا گیا اور اللہ تعالیٰ نے اس کے لشکر کو شکست دے دی۔ ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ ابوعامر رضی اللہ عنہ کے ساتھ نبی کریم صلی اللہ علیہ وسلم نے مجھے بھی بھیجا تھا۔ ابوعامر رضی اللہ عنہ کے گھٹنے میں تیر آ کر لگا۔ بنی جعشم کے ایک شخص نے ان پر تیر مارا تھا اور ان کے گھٹنے میں اتار دیا تھا۔ میں ان کے پاس پہنچا اور کہا:چچا! یہ تیر آپ پر کس نے پھینکا؟ انہوں نے ابوموسیٰ رضی اللہ عنہ کو اشارے سے بتایا کہ وہ جعشمی میرا قاتل ہے جس نے مجھے نشانہ بنایا ہے۔ میں اس کی طرف لپکا اور اس کے قریب پہنچ گیا لیکن جب اس نے مجھے دیکھا تو وہ بھاگ پڑا میں نے اس کا پیچھا کیا اور میں یہ کہتا جاتا تھا، تجھے شرم نہیں آتی، تجھ سے مقابلہ نہیں کیا جاتا۔ آخر وہ رک گیا اور ہم نے ایک دوسرے پر تلوار سے وار کیا۔ میں نے اسے قتل کر دیا اور ابوعامر رضی اللہ عنہ سے جا کر کہا کہ اللہ نے آپ کے قاتل کو قتل کروا دیا۔ انہوں نے فرمایا کہ میرے ( گھٹنے میں سے ) تیر نکال لے، میں نے نکال دیا تو اس سے پانی جاری ہو گیا پھر انہوں نے فرمایا: بھتیجے! نبی کریم صلی اللہ علیہ وسلم کو میرا سلام پہنچانا اور عرض کرنا کہ میرے لیے مغفرت کی دعا فرمائیں۔ ابوعامر رضی اللہ عنہ نے لوگوں پر مجھے اپنا نائب بنا دیا۔ اس کے بعد وہ تھوڑی دیر اور زندہ رہے اور شہادت پائی۔ میں واپس ہوا اور نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پہنچا۔ آپ اپنے گھر میں بانوں کی ایک چارپائی پر تشریف فرما تھے۔ اس پر کوئی بستر بچھا ہوا نہیں تھا اور بانوں کے نشانات آپ کی پیٹھ اور پہلو پر پڑ گئے تھے۔ میں نے آپ سے اپنے اور ابوعامر رضی اللہ عنہ کے واقعات بیان کئے اور یہ کہ انہوں نے دعا مغفرت کے لیے درخواست کی ہے۔ نبی کریم صلی اللہ علیہ وسلم نے پانی طلب فرمایا اور وضو کیا پھر ہاتھ اٹھا کر دعا کی، اے اللہ! عبید ابوعامر کی مغفرت فرما۔ میں نے آپ صلی اللہ علیہ وسلم کی بغل میں سفیدی ( جب آپ دعا کر رہے تھے ) دیکھی۔ پھر نبی کریم صلی اللہ علیہ وسلم نے دعا کی، اے اللہ! قیامت کے دن ابوعامر کو اپنی بہت سی مخلوق سے بلند تر درجہ عطا فرمائیو۔ میں نے عرض کیا اور میرے لیے بھی اللہ سے مغفرت کی دعا فرما دیجئیے۔ آپ صلی اللہ علیہ وسلم نے دعا کی اے اللہ! عبداللہ بن قیس ابوموسیٰ کے گناہوں کو بھی معاف فرما اور قیامت کے دن اچھا مقام عطا فرمائیو۔ ابوبردہ نے بیان کیا کہ ایک دعا ابوعامر رضی اللہ عنہ کے لیے تھی اور دوسری ابوموسیٰ رضی اللہ عنہ کے لیے۔",
                "urduNarrator": "ہم سے محمد بن علاء نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے برید بن عبداللہ نے، ان سے ابوبردہ نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ لَمَّا فَرَغَ النَّبِيُّ صلى الله عليه وسلم مِنْ حُنَيْنٍ بَعَثَ أَبَا عَامِرٍ عَلَى جَيْشٍ إِلَى أَوْطَاسٍ فَلَقِيَ دُرَيْدَ بْنَ الصِّمَّةِ، فَقُتِلَ دُرَيْدٌ وَهَزَمَ اللَّهُ أَصْحَابَهُ‏.‏ قَالَ أَبُو مُوسَى وَبَعَثَنِي مَعَ أَبِي عَامِرٍ فَرُمِيَ أَبُو عَامِرٍ فِي رُكْبَتِهِ، رَمَاهُ جُشَمِيٌّ بِسَهْمٍ فَأَثْبَتَهُ فِي رُكْبَتِهِ، فَانْتَهَيْتُ إِلَيْهِ فَقُلْتُ يَا عَمِّ مَنْ رَمَاكَ فَأَشَارَ إِلَى أَبِي مُوسَى فَقَالَ ذَاكَ قَاتِلِي الَّذِي رَمَانِي‏.‏ فَقَصَدْتُ لَهُ فَلَحِقْتُهُ فَلَمَّا رَآنِي وَلَّى فَاتَّبَعْتُهُ وَجَعَلْتُ أَقُولُ لَهُ أَلاَ تَسْتَحِي، أَلاَ تَثْبُتُ‏.‏ فَكَفَّ فَاخْتَلَفْنَا ضَرْبَتَيْنِ بِالسَّيْفِ فَقَتَلْتُهُ ثُمَّ قُلْتُ لأَبِي عَامِرٍ قَتَلَ اللَّهُ صَاحِبَكَ‏.‏ قَالَ فَانْزِعْ هَذَا السَّهْمَ فَنَزَعْتُهُ فَنَزَا مِنْهُ الْمَاءُ‏.‏ قَالَ يَا ابْنَ أَخِي أَقْرِئِ النَّبِيَّ صلى الله عليه وسلم السَّلاَمَ، وَقُلْ لَهُ اسْتَغْفِرْ لِي‏.‏ وَاسْتَخْلَفَنِي أَبُو عَامِرٍ عَلَى النَّاسِ، فَمَكَثَ يَسِيرًا ثُمَّ مَاتَ، فَرَجَعْتُ فَدَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم فِي بَيْتِهِ عَلَى سَرِيرٍ مُرْمَلٍ وَعَلَيْهِ فِرَاشٌ قَدْ أَثَّرَ رِمَالُ السَّرِيرِ بِظَهْرِهِ وَجَنْبَيْهِ، فَأَخْبَرْتُهُ بِخَبَرِنَا وَخَبَرِ أَبِي عَامِرٍ، وَقَالَ قُلْ لَهُ اسْتَغْفِرْ لِي، فَدَعَا بِمَاءٍ فَتَوَضَّأَ ثُمَّ رَفَعَ يَدَيْهِ فَقَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لِعُبَيْدٍ أَبِي عَامِرٍ ‏\"‏‏.‏ وَرَأَيْتُ بَيَاضَ إِبْطَيْهِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ اجْعَلْهُ يَوْمَ الْقِيَامَةِ فَوْقَ كَثِيرٍ مِنْ خَلْقِكَ مِنَ النَّاسِ ‏\"‏‏.‏ فَقُلْتُ وَلِي فَاسْتَغْفِرْ‏.‏ فَقَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لِعَبْدِ اللَّهِ بْنِ قَيْسٍ ذَنْبَهُ وَأَدْخِلْهُ يَوْمَ الْقِيَامَةِ مُدْخَلاً كَرِيمًا ‏\"‏‏.‏ قَالَ أَبُو بُرْدَةَ إِحْدَاهُمَا لأَبِي عَامِرٍ وَالأُخْرَى لأَبِي مُوسَى‏.‏",
                "headingArabic": "باب غَزَاةِ أَوْطَاسٍ",
                "headingUrdu": "اوطاس کا غزوہ",
                "headingEnglish": "The Ghazwa of Autas",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4123,
                "hadithNumber": "4324",
                "englishNarrator": "Narrated Um Salama رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) came to me while there was an effeminate man sitting with me, and I heard him (i.e. the effeminate man) saying to `Abdullah bin Abi Umaiya, \"O `Abdullah! See if Allah should make you conquer Ta'if tomorrow, then take the daughter of Ghailan (in marriage) as (she is so beautiful and fat that) she shows four folds of flesh when facing you, and eight when she turns her back.\" The Prophet (ﷺ) then said, \"These (effeminate men) should never enter upon you (O women!).\" Ibn Juraij said, \"That effeminate man was called Hit.\" Narrated Hisham: The above narration and added extra, that at that time, the Prophet, was besieging Taif.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم میرے یہاں تشریف لائے تو میرے پاس ایک مخنث بیٹھا ہوا تھا پھر نبی کریم صلی اللہ علیہ وسلم نے سنا کہ وہ عبداللہ بن امیہ سے کہہ رہا تھا کہ اے عبداللہ! دیکھو اگر کل اللہ تعالیٰ نے طائف کی فتح تمہیں عطا فرمائی تو غیلان بن سلمہ کی بیٹی ( بادیہ نامی ) کو لے لینا وہ جب سامنے آتی ہے تو پیٹ پر چار بل اور پیٹھ موڑ کر جاتی ہے تو آٹھ بل دکھائی دیتے ہیں ( یعنی بہت موٹی تازہ عورت ہے ) تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا یہ لوگ اب تمہار ے گھر میں نہ آیا کریں۔ ابن عیینہ نے بیان کیا کہ ابن جریج نے کہا، اس مخنث کا نام ہیت تھا۔ ہم سے محمود نے بیان کیا، ان سے ابواسامہ نے بیان کیا، ان سے ہشام نے اسی طرح بیان کیا اور یہ اضافہ کیا ہے کہ نبی کریم صلی اللہ علیہ وسلم اس وقت طائف کا محاصرہ کئے ہوئے تھے",
                "urduNarrator": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا، کہا ہم نے سفیان بن عیینہ سے سنا، ان سے ہشام بن عروہ نے بیان کیا، ان سے ان کے والد نے، ان سے زینب بنت ابی سلمہ نے اور ان سے ان کی والدہ ام المؤمنین ام سلمہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، سَمِعَ سُفْيَانَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ ابْنَةِ أَبِي سَلَمَةَ، عَنْ أُمِّهَا أُمِّ سَلَمَةَ ـ رضى الله عنها ـ دَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَعِنْدِي مُخَنَّثٌ فَسَمِعْتُهُ يَقُولُ لِعَبْدِ اللَّهِ بْنِ أَبِي أُمَيَّةَ يَا عَبْدَ اللَّهِ أَرَأَيْتَ إِنْ فَتَحَ اللَّهُ عَلَيْكُمُ الطَّائِفَ غَدًا فَعَلَيْكَ بِابْنَةِ غَيْلاَنَ، فَإِنَّهَا تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ‏.‏ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَدْخُلَنَّ هَؤُلاَءِ عَلَيْكُنَّ ‏\"‏‏.‏ قَالَ ابْنُ عُيَيْنَةَ وَقَالَ ابْنُ جُرَيْجٍ الْمُخَنَّثُ هِيتٌ‏.‏ حَدَّثَنَا مَحْمُودٌ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ بِهَذَا، وَزَادَ وَهْوَ مُحَاصِرٌ الطَّائِفَ يَوْمَئِذٍ‏.‏",
                "headingArabic": "غَزْوَةُ الطَّائِفِ فِي شَوَّالٍ سَنَةَ ثَمَانٍ",
                "headingUrdu": "طائف کا غزوہ",
                "headingEnglish": "The Ghazwa of At-Taif",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4124,
                "hadithNumber": "4325",
                "englishNarrator": "Narrated `Abdullah bin `Amr رضی اللہ عنہما :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) besieged Taif and could not conquer its people, he said, \"We will return (to Medina) If Allah wills.\" That distressed the Companions (of the Prophet (ﷺ) and they said, \"Shall we go away without conquering it (i.e. the Fort of Taif)?\" Once the Prophet (ﷺ) said, \"Let us return.\" Then the Prophet said (to them), \"Fight tomorrow.\" They fought and (many of them) got wounded, whereupon the Prophet (ﷺ) said, \"We will return (to Medina) tomorrow if Allah wills.\" That delighted them, whereupon the Prophet (ﷺ) smiled. The sub-narrator, Sufyan said once, \"(The Prophet) smiled.\"",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم نے طائف کا محاصرہ کیا تو دشمن کا کچھ بھی نقصان نہیں کیا۔ آخر آپ نے فرمایا کہ اب ان شاءاللہ ہم واپس ہو جائیں گے۔ مسلمانوں کے لیے ناکام لوٹنا بڑا شاق گزرا۔ انہوں نے کہا کہ واہ بغیر فتح کے ہم واپس چلے جائیں ( راوی نے ) ایک مرتبہ «نذهب» کے بجائے «نقفل» کا لفظ استعمال کیا یعنی ہم۔۔۔ لوٹ جائیں اور طائف کو فتح نہ کریں ( یہ کیونکر ہو سکتا ہے ) اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر صبح سویرے میدان میں جنگ کے لیے آ جاؤ۔ پس وہ صحابہ سویرے ہی آ گئے لیکن ان کی بڑی تعداد زخمی ہو گئی۔ اب پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ان شاءاللہ ہم کل واپس چلیں گے۔ صحابہ نے اسے بہت پسند کیا۔ آپ صلی اللہ علیہ وسلم اس پر ہنس پڑے۔ اور سفیان نے ایک مرتبہ بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم مسکرا دئیے۔ حمیدی نے کہا کہ ہم سے سفیان نے یہ پوری خبر بیان کی۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے عمرو بن دینار نے، ان سے ابو العباس نابینا شاعر نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ أَبِي الْعَبَّاسِ الشَّاعِرِ الأَعْمَى، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ لَمَّا حَاصَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم الطَّائِفَ فَلَمْ يَنَلْ مِنْهُمْ شَيْئًا قَالَ ‏\"‏ إِنَّا قَافِلُونَ إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ فَثَقُلَ عَلَيْهِمْ وَقَالُوا نَذْهَبُ وَلاَ نَفْتَحُهُ ـ وَقَالَ مَرَّةً نَقْفُلُ ـ فَقَالَ ‏\"‏ اغْدُوا عَلَى الْقِتَالِ ‏\"‏‏.‏ فَغَدَوْا فَأَصَابَهُمْ جِرَاحٌ فَقَالَ ‏\"‏ إِنَّا قَافِلُونَ غَدًا إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ فَأَعْجَبَهُمْ فَضَحِكَ النَّبِيُّ صلى الله عليه وسلم، وَقَالَ سُفْيَانُ مَرَّةً فَتَبَسَّمَ‏.‏ قَالَ قَالَ الْحُمَيْدِيُّ حَدَّثَنَا سُفْيَانُ الْخَبَرَ كُلَّهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4125,
                "hadithNumber": "4326, 4327",
                "englishNarrator": "Narrated Abu `Uthman:",
                "hadithEnglish": "I heard from Sa`d رضی اللہ عنہ , the first man who has thrown an arrow in Allah's Cause, and from Abu Bakra رضی اللہ عنہ who jumped over the wall of the Ta'if Fort along with a few persons and came to the Prophet. They both said, \"We heard the Prophet (ﷺ) saying, 'If somebody claims to be the son of somebody other than his father knowingly, he will be denied Paradise (i.e. he will not enter Paradise).' \" Narrated Ma`mar from `Asim from Abu Al-`Aliya or Abu `Uthman An-Nahdi رضی اللہ عنہ who said, \"I heard Sa`d رضی اللہ عنہ and Abu Bakra رضی اللہ عنہ narrating from the Prophet.\" `Asim said, \"I said (to him), 'Very trustworthy persons have narrated to you.' He said, 'Yes, one of them was the first to throw an arrow in Allah's Cause and the other came to the Prophet (ﷺ) in a group of twenty-three persons from Ta'if'.\"",
                "hadithUrdu": "میں نے سعد بن ابی وقاص رضی اللہ عنہ سے سنا، جنہوں نے سب سے پہلے اللہ کے راستے میں تیر چلایا تھا اور ابوبکرہ رضی اللہ عنہ سے جو طائف کے قلعے پر چند مسلمانوں کے ساتھ چڑھے تھے اور اس طرح نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تھے۔ ان دونوں صحابیوں نے بیان کیا کہ ہم نے نبی کریم صلی اللہ علیہ وسلم سے سنا، آپ فرما رہے تھے کہ جو شخص جانتے ہوئے اپنے باپ کے سوا کسی دوسرے کی طرف اپنے آپ کو منسوب کرے تو اس پر جنت حرام ہے۔ اور ہشام نے بیان کیا اور انہیں معمر نے خبر دی، انہیں عاصم نے، انہیں ابوالعالیہ یا ابوعثمان نہدی نے، کہا کہ میں نے سعد بن ابی وقاص رضی اللہ عنہ اور ابوبکرہ رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا، عاصم نے بیان کیا کہ میں نے ( ابوالعالیہ یا ابوعثمان نہدی رضی اللہ عنہ ) سے کہا آپ سے یہ روایت ایسے دو اصحاب ( سعد اور ابوبکرہ رضی اللہ عنہما ) نے بیان کی ہے کہ یقین کے لیے ان کے نام کافی ہیں۔ انہوں نے کہا یقیناً ان میں سے ایک ( سعد بن ابی وقاص رضی اللہ عنہ ) تو وہ ہیں جنہوں نے اللہ کے راستے میں سب سے پہلے تیر چلایا تھا اور دوسرے ( ابوبکرہ رضی اللہ عنہ ) وہ ہیں جو تئیس  آدمی تھے ان لوگوں میں جو طائف کے قلعہ سے اتر کر نبی کریم صلی اللہ علیہ وسلم کے پاس آئے تھے۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر (محمد بن جعفر) نے بیان کیا، ان سے شعبہ نے بیان کیا، ان سے عاصم بن سلیمان نے بیان کیا، انہوں نے ابوعثمان نہدی سے سنا کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَاصِمٍ، قَالَ سَمِعْتُ أَبَا عُثْمَانَ، قَالَ سَمِعْتُ سَعْدًا ـ وَهْوَ أَوَّلُ مَنْ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ ـ وَأَبَا بَكْرَةَ ـ وَكَانَ تَسَوَّرَ حِصْنَ الطَّائِفِ فِي أُنَاسٍ ـ فَجَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالاَ سَمِعْنَا النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ وَهْوَ يَعْلَمُ فَالْجَنَّةُ عَلَيْهِ حَرَامٌ ‏\"‏‏.‏ وَقَالَ هِشَامٌ وَأَخْبَرَنَا مَعْمَرٌ، عَنْ عَاصِمٍ، عَنْ أَبِي الْعَالِيَةِ، أَوْ أَبِي عُثْمَانَ النَّهْدِيِّ قَالَ سَمِعْتُ سَعْدًا، وَأَبَا، بَكْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ قَالَ عَاصِمٌ قُلْتُ لَقَدْ شَهِدَ عِنْدَكَ رَجُلاَنِ حَسْبُكَ بِهِمَا‏.‏ قَالَ أَجَلْ أَمَّا أَحَدُهُمَا فَأَوَّلُ مَنْ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ، وَأَمَّا الآخَرُ فَنَزَلَ إِلَى النَّبِيِّ صلى الله عليه وسلم ثَالِثَ ثَلاَثَةٍ وَعِشْرِينَ مِنَ الطَّائِفِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4126,
                "hadithNumber": "4328",
                "englishNarrator": "Narrated Abu Burda رضی اللہ عنہ :",
                "hadithEnglish": "Abu Musa رضی اللہ عنہ said, \"I was with the Prophet (ﷺ) when he was encamping at Al-Jarana (a place) between Mecca and Medina and Bilal رضی اللہ عنہ was with him. A bedouin came to the Prophet (ﷺ) and said, \"Won't you fulfill what you have promised me?\" The Prophet (ﷺ) said, 'Rejoice (at what I will do for you).' The bedouin said, \"(You have said to me) rejoice too often.\" Then the Prophet (ﷺ) turned to me (i.e. Abu Musa رضی اللہ عنہ ) and Bilal رضی اللہ عنہ in an angry mood and said, 'The bedouin has refused the good tidings, so you both accept them.' Bilal رضی اللہ عنہ and I said, 'We accept them.' Then the Prophet (ﷺ) asked for a drinking bowl containing water and washed his hands and face in it, and then took a mouthful of water and threw it therein saying (to us), \"Drink (some of) it and pour (some) over your faces and chests and be happy at the good tidings.\" So they both took the drinking bowl and did as instructed. Um Salama called from behind a screen, \"Keep something (of the water for your mother.\" So they left some of it for her.",
                "hadithUrdu": "ابوموسیٰ رضی اللہ عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھا جب آپ مکہ اور مدینہ کے درمیان الجرانہ میں پڑاؤ ڈال رہے تھے اور بلال رضی اللہ عنہ آپ کے ساتھ تھے، ایک بدو نبی صلی اللہ علیہ وسلم کے پاس آیا اور کہا: جیت گیا۔ کیا تم نے مجھ سے جو وعدہ کیا ہے اسے پورا نہیں کیا؟‘‘ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: خوش ہو جاؤ (میں تمہارے لیے کیا کروں گا)۔ اعرابی نے کہا: (تم نے مجھ سے کہا ہے کہ) کثرت سے خوش رہو، پھر رسول اللہ صلی اللہ علیہ وسلم نے غصے میں میری طرف (یعنی ابو موسیٰ) اور بلال رضی اللہ عنہما کی طرف متوجہ ہوئے اور فرمایا: اس اعرابی نے بشارت سے انکار کر دیا ہے۔ تم دونوں ان کو قبول کرو۔' میں نے اور بلال نے کہا، 'ہمیں قبول ہے۔' پھر رسول اللہ صلی اللہ علیہ وسلم نے پینے کا ایک پیالہ منگوایا جس میں پانی تھا اور اس میں اپنے ہاتھ اور چہرے کو دھویا، پھر پانی کا ایک نہر لے کر اس میں ڈال دیا اور فرمایا: اس میں سے کچھ پیو اور (کچھ) ڈال دو۔ ) اپنے چہروں اور سینوں پر رکھو اور بشارت پر خوش رہو۔\" چنانچہ دونوں نے پینے کا پیالہ لیا اور ہدایت کے مطابق کیا، ام سلمہ نے پردے کے پیچھے سے آواز دی، \"اپنی والدہ کے لیے کچھ پانی رکھو۔\" چنانچہ وہ چلی گئیں۔ اس میں سے کچھ اس کے لیے۔",
                "urduNarrator": "ہم سے محمد بن علاء نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے برید بن عبداللہ نے، ان سے ابوبردہ نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم وَهْوَ نَازِلٌ بِالْجِعْرَانَةِ بَيْنَ مَكَّةَ وَالْمَدِينَةِ وَمَعَهُ بِلاَلٌ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم أَعْرَابِيٌّ فَقَالَ أَلاَ تُنْجِزُ لِي مَا وَعَدْتَنِي‏.‏ فَقَالَ لَهُ ‏\"‏ أَبْشِرْ ‏\"‏‏.‏ فَقَالَ قَدْ أَكْثَرْتَ عَلَىَّ مِنْ أَبْشِرْ‏.‏ فَأَقْبَلَ عَلَى أَبِي مُوسَى وَبِلاَلٍ كَهَيْئَةِ الْغَضْبَانِ فَقَالَ ‏\"‏ رَدَّ الْبُشْرَى فَاقْبَلاَ أَنْتُمَا ‏\"‏‏.‏ قَالاَ قَبِلْنَا‏.‏ ثُمَّ دَعَا بِقَدَحٍ فِيهِ مَاءٌ فَغَسَلَ يَدَيْهِ وَوَجْهَهُ فِيهِ، وَمَجَّ فِيهِ، ثُمَّ قَالَ ‏\"‏ اشْرَبَا مِنْهُ، وَأَفْرِغَا عَلَى وُجُوهِكُمَا وَنُحُورِكُمَا، وَأَبْشِرَا ‏\"‏‏.‏ فَأَخَذَا الْقَدَحَ فَفَعَلاَ، فَنَادَتْ أُمُّ سَلَمَةَ مِنْ وَرَاءِ السِّتْرِ أَنْ أَفْضِلاَ لأُمِّكُمَا‏.‏ فَأَفْضَلاَ لَهَا مِنْهُ طَائِفَةً‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4127,
                "hadithNumber": "4329",
                "englishNarrator": "Narrated Safwan bin Ya`la bin Umaiya:",
                "hadithEnglish": "Ya`la used to say, \"I wish I could see Allah's Messenger (ﷺ) at the time when he is being inspired divinely.\" Ya`la added \"While the Prophet (ﷺ) was at Al-Ja'rana, shaded with a cloth sheet (in the form of a tent) and there were staying with him, some of his companions under it, suddenly there came to him a bedouin wearing a cloak and perfumed extravagantly. He said, \"O Allah's Messenger (ﷺ) ! What is your opinion regarding a man who assumes the state of Ihram for `Umra wearing a cloak after applying perfume to his body?\" `Umar رضی اللہ عنہ signalled with his hand to Ya`la رضی اللہ عنہ to come (near). Ya`la رضی اللہ عنہ came and put his head (underneath that cloth sheet) and saw the Prophet (ﷺ) red-faced and when that state (of the Prophet (ﷺ) ) was over, he said, \"Where is he who as already asked me about the `Umra?\" The man was looked for and brought to the Prophet (ﷺ) The Prophet (ﷺ) said (to him), \"As for the perfume you have applied to your body, wash it off your body) thrice, and take off your cloak, and then do in your `Umra the rites you do in your Hajj.\"",
                "hadithUrdu": "یعلیٰ نے کہا کاش میں رسول اللہ صلی اللہ علیہ وسلم کو اس وقت دیکھ سکتا جب آپ پر وحی نازل ہوتی ہے۔ بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم جعرانہ میں ٹھہرے ہوئے تھے۔ آپ کے لیے ایک کپڑے سے سایہ کر دیا گیا تھا اور اس میں چند صحابہ رضی اللہ عنہم بھی آپ کے ساتھ موجود تھے۔ اتنے میں ایک اعرابی آئے وہ ایک جبہ پہنے ہوئے تھے، خوشبو میں بسا ہوا۔ انہوں نے عرض کیا: یا رسول اللہ! ایک ایسے شخص کے بارے میں آپ کا کیا حکم ہے جو اپنے جبہ میں خوشبو لگانے کے بعد احرام باندھے؟ فوراً ہی عمر رضی اللہ عنہ نے یعلیٰ رضی اللہ عنہ کو آنے کے لیے ہاتھ سے اشارہ کیا۔ یعلیٰ رضی اللہ عنہ حاضر ہو گئے اور اپنا سر ( نبی کریم صلی اللہ علیہ وسلم کو دیکھنے کے لیے ) اندر کیا ( نزول وحی کی کیفیت سے ) نبی کریم صلی اللہ علیہ وسلم کا چہرہ مبارک سرخ ہو رہا تھا اور زور زور سے سانس چل رہی تھی۔ تھوڑی دیر تک یہی کیفیت رہی پھر ختم ہو گئی تو آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ ابھی عمرہ کے متعلق جس نے سوال کیا تھا وہ کہاں ہے؟ انہیں تلاش کر کے لایا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو خوشبو تم نے لگا رکھی ہے اسے تین مرتبہ دھو لو اور جبہ اتار دو اور پھر عمرہ میں وہی کام کرو جو حج میں کرتے ہو۔",
                "urduNarrator": "ہم سے یعقوب بن ابراہیم نے بیان کیا، کہا ہم سے اسماعیل بن ابراہیم بن علیہ نے بیان کیا، ان سے ابن جریج نے بیان کیا، کہا مجھ کو عطا بن ابی رباح نے خبر دی، انہیں صفوان بن یعلیٰ بن امیہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، أَنَّ صَفْوَانَ بْنَ يَعْلَى بْنِ أُمَيَّةَ، أَخْبَرَ أَنَّ يَعْلَى كَانَ يَقُولُ لَيْتَنِي أَرَى رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ يُنْزَلُ عَلَيْهِ‏.‏ قَالَ فَبَيْنَا النَّبِيُّ صلى الله عليه وسلم بِالْجِعْرَانَةِ وَعَلَيْهِ ثَوْبٌ قَدْ أُظِلَّ بِهِ، مَعَهُ فِيهِ نَاسٌ مِنْ أَصْحَابِهِ، إِذْ جَاءَهُ أَعْرَابِيٌّ عَلَيْهِ جُبَّةٌ مُتَضَمِّخٌ بِطِيبٍ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ تَرَى فِي رَجُلٍ أَحْرَمَ بِعُمْرَةٍ فِي جُبَّةٍ بَعْدَ مَا تَضَمَّخَ بِالطِّيبِ فَأَشَارَ عُمَرُ إِلَى يَعْلَى بِيَدِهِ أَنْ تَعَالَ‏.‏ فَجَاءَ يَعْلَى فَأَدْخَلَ رَأْسَهُ، فَإِذَا النَّبِيُّ صلى الله عليه وسلم مُحْمَرُّ الْوَجْهِ، يَغِطُّ كَذَلِكَ سَاعَةً، ثُمَّ سُرِّيَ عَنْهُ فَقَالَ ‏\"‏ أَيْنَ الَّذِي يَسْأَلُنِي عَنِ الْعُمْرَةِ آنَفًا ‏\"‏‏.‏ فَالْتُمِسَ الرَّجُلُ فَأُتِيَ بِهِ فَقَالَ ‏\"‏ أَمَّا الطِّيبُ الَّذِي بِكَ فَاغْسِلْهُ ثَلاَثَ مَرَّاتٍ، وَأَمَّا الْجُبَّةُ فَانْزِعْهَا، ثُمَّ اصْنَعْ فِي عُمْرَتِكَ كَمَا تَصْنَعُ فِي حَجِّكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4101,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=164",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=162",
                "label": "162",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=163",
                "label": "163",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=164",
                "label": "164",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=165",
                "label": "165",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=166",
                "label": "166",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=167",
                "label": "167",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=168",
                "label": "168",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=166",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=166",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=164",
        "to": 4125,
        "total": 40465
    }
}