{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 48,
        "data": [
            {
                "id": 1176,
                "hadithNumber": "1218",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "The news about the differences amongst the people of Bani `Amr bin `Auf at Quba reached Allah's Apostle and so he went to them along with some of his companions to affect a reconciliation. Allah's Apostle was delayed there and the time for the prayer became due. Bilal رضی اللہ عنہ came to Abu Bakrرضی اللہ عنہ ! and said, \"O Abu Bakr رضی اللہ عنہ ! Allah's Messenger (ﷺ) is detained (there) and the time for the prayer is due. Will you lead the people in prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal رضی اللہ عنہ pronounced the Iqama and Abu Bakr رضی اللہ عنہ went forward and the people said Takbir. In the meantime, Allah's Messenger (ﷺ) came piercing through the rows till he stood in the (first) row and the people started clapping. Abu Bakr رضی اللہ عنہ, would never look hither and thither during the prayer but when the people clapped much he looked back and saw Allah's Messenger (ﷺ). The Prophet (ﷺ) beckoned him to carry on. Abu Bakr رضی اللہ عنہraised both his hands, praised Allah and retreated till he stood in the row and Allah's Messenger (ﷺ) went forward and led the people in the prayer. When he had finished the prayer, he addressed the people and said, \"O people! Why did you start clapping when something happened to you in the prayer? Clapping is for women. Whenever one is confronted with something unusual in the prayer one should say, 'Sub Han Allah'.\" Then the Prophet looked towards Abu Bakr and asked, \"What prevented you from leading the prayer when I beckoned you to carry on?\" Abu Bakr رضی اللہ عنہ replied, \"It does not befit the son of Al Quhafa to lead the prayer in the presence of Allah's Messenger (ﷺ).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو یہ خبر پہنچی کہ قباء کے قبیلہ بنو عمرو بن عوف میں کوئی جھگڑا ہو گیا ہے ۔ اس لیے آپ صلی اللہ علیہ وسلم کئی اصحاب کو ساتھ لے کر ان میں صلح کرانے کے لیے تشریف لے گئے ۔ وہاں آپ صلی اللہ علیہ وسلم صلح صفائی کے لیے ٹھہر گئے ۔ ادھر نماز کا وقت ہو گیا تو بلال رضی اللہ عنہ نے حضرت ابوبکر رضی اللہ عنہ سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نہیں آئے اور نماز کا وقت ہو گیا ، تو کیا آپ لوگوں کو نماز پڑھائیں گے ؟ آپ نے جواب دیا کہ ہاں اگر تم چاہتے ہو تو پڑھا دوں گا ۔ چنانچہ بلال رضی اللہ عنہ نے تکبیر کہی اور ابوبکر رضی اللہ عنہ نے آگے بڑھ کر نیت باندھ لی ۔ اتنے میں رسول اللہ صلی اللہ علیہ وسلم بھی تشریف لے آئے اور صفوں سے گزر تے ہوئے آپ صلی اللہ علیہ وسلم پہلی صف میں آ کھڑے ہوئے ، لوگوں نے ہاتھ پر ہاتھ مارنے شروع کر دیئے ۔ ( سہل نے کہا کہ «تصفيح» کے معنی «تصفيق» کے ہیں ) آپ نے بیان کیا کہ ابوبکر رضی اللہ عنہ نماز میں کسی طرف متوجہ نہیں ہوتے تھے ۔ لیکن جب لوگوں نے بہت دستکیں دیں تو انہوں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہیں ۔ حضور اکرم صلی اللہ علیہ وسلم نے اشارہ سے ابوبکر کو نماز پڑھانے کے لیے کہا ۔ اس پر ابوبکر رضی اللہ عنہ نے ہاتھ اٹھا کر اللہ تعالیٰ کا شکر ادا کیا اور پھر الٹے پاؤں پیچھے کی طرف چلے آئے اور صف میں کھڑے ہو گئے اور رسول اللہ صلی اللہ علیہ وسلم نے آگے بڑھ کر نماز پڑھائی ۔ نماز سے فارغ ہو کر آپ صلی اللہ علیہ وسلم لوگوں کی طرف متوجہ ہوئے اور فرمایا کہ لوگو ! یہ کیا بات ہے کہ جب نماز میں کوئی بات پیش آتی ہے تو تم تالیاں بجانے لگتے ہو ۔ یہ مسئلہ تو عورتوں کے لیے ہے ۔ تمہیں اگر نماز میں کوئی حادثہ پیش آئے تو «سبحان الله» کہا کرو ۔ اس کے بعد آپ صلی اللہ علیہ وسلم ابوبکر رضی اللہ عنہ کی طرف متوجہ ہوئے اور فرمایا کہ ابوبکر ! میرے کہنے کے باوجود تم نے نماز کیوں نہیں پڑھائی ؟ ابوبکر رضی اللہ عنہ نے عرض کیا کہ ابوقحافہ کے بیٹے کو زیب نہیں دیتا کہ رسول اللہ صلی اللہ علیہ وسلم کی موجودگی میں نماز پڑھائے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدا لعزیز بن ابی حازم نے بیان کیا ، ان سے ابوحازم سلمہ بن دینار نے اور ان سے سہل بن سعد رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ ـ رضى الله عنه ـ قَالَ بَلَغَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنَّ بَنِي عَمْرِو بْنِ عَوْفٍ بِقُبَاءٍ كَانَ بَيْنَهُمْ شَىْءٌ، فَخَرَجَ يُصْلِحُ بَيْنَهُمْ فِي أُنَاسٍ مِنْ أَصْحَابِهِ، فَحُبِسَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَحَانَتِ الصَّلاَةُ، فَجَاءَ بِلاَلٌ إِلَى أَبِي بَكْرٍ ـ رضى الله عنهما ـ فَقَالَ يَا أَبَا بَكْرٍ، إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ حُبِسَ وَقَدْ حَانَتِ الصَّلاَةُ، فَهَلْ لَكَ أَنْ تَؤُمَّ النَّاسَ قَالَ نَعَمْ إِنْ شِئْتَ‏.‏ فَأَقَامَ بِلاَلٌ الصَّلاَةَ، وَتَقَدَّمَ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَكَبَّرَ لِلنَّاسِ، وَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْشِي فِي الصُّفُوفِ يَشُقُّهَا شَقًّا، حَتَّى قَامَ فِي الصَّفِّ، فَأَخَذَ النَّاسُ فِي التَّصْفِيحِ‏.‏ قَالَ سَهْلٌ التَّصْفِيحُ هُوَ التَّصْفِيقُ‏.‏ قَالَ وَكَانَ أَبُو بَكْرٍ ـ رضى الله عنه ـ لاَ يَلْتَفِتُ فِي صَلاَتِهِ، فَلَمَّا أَكْثَرَ النَّاسُ الْتَفَتَ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَشَارَ إِلَيْهِ، يَأْمُرُهُ أَنْ يُصَلِّيَ، فَرَفَعَ أَبُو بَكْرٍ ـ رضى الله عنه ـ يَدَهُ، فَحَمِدَ اللَّهَ، ثُمَّ رَجَعَ الْقَهْقَرَى وَرَاءَهُ حَتَّى قَامَ فِي الصَّفِّ، وَتَقَدَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى لِلنَّاسِ، فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ مَا لَكُمْ حِينَ نَابَكُمْ شَىْءٌ فِي الصَّلاَةِ أَخَذْتُمْ بِالتَّصْفِيحِ إِنَّمَا التَّصْفِيحُ لِلنِّسَاءِ، مَنْ نَابَهُ شَىْءٌ فِي صَلاَتِهِ فَلْيَقُلْ سُبْحَانَ اللَّهِ ‏\"‏‏.‏ ثُمَّ الْتَفَتَ إِلَى أَبِي بَكْرٍ ـ رضى الله عنه ـ فَقَالَ ‏\"‏ يَا أَبَا بَكْرٍ، مَا مَنَعَكَ أَنْ تُصَلِّيَ لِلنَّاسِ حِينَ أَشَرْتُ إِلَيْكَ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ مَا كَانَ يَنْبَغِي لاِبْنِ أَبِي قُحَافَةَ أَنْ يُصَلِّيَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": "رَفْعِ الأَيْدِي فِي الصَّلاَةِ لأَمْرٍ يَنْزِلُ بِهِ",
                "headingUrdu": "ضرورت کی بنا پر نماز میں ہاتھ اٹھانا",
                "headingEnglish": "To raise the hands in Salat because of necessity",
                "chapterId": "22",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 22,
                    "chapterNumber": "22",
                    "chapterEnglish": "Actions while Praying",
                    "chapterUrdu": "نماز کے کام کے بارے میں",
                    "chapterArabic": "كتاب العمل في الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1177,
                "hadithNumber": "1219",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "It was forbidden to keep the hands on the hips during the prayer. (This is narrated by Abu Huraira رضی اللہ عنہ from the Prophet (ﷺ).)",
                "hadithUrdu": "نماز میں پہلو پر ہاتھ رکھنے سے منع کیا گیا تھا ۔ ہشام اور ابوہلال محمد بن سلیم نے ، ابن سیرین سے اس حدیث کو روایت کیا ، وہ ابوہریرہ رضی اللہ عنہ سے اور وہ نبی کریم صلی اللہ علیہ وسلم سے ۔",
                "urduNarrator": "ہم سے ابو النعمان نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے محمد بن سیرین نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نُهِيَ عَنِ الْخَصْرِ، فِي الصَّلاَةِ‏.‏ وَقَالَ هِشَامٌ وَأَبُو هِلاَلٍ عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "الْخَصْرِ فِي الصَّلاَةِ",
                "headingUrdu": "نماز کے دوران کولہوں پر ہاتھ رکھنا",
                "headingEnglish": "Keeping the hands on the hips during As-Salat",
                "chapterId": "22",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 22,
                    "chapterNumber": "22",
                    "chapterEnglish": "Actions while Praying",
                    "chapterUrdu": "نماز کے کام کے بارے میں",
                    "chapterArabic": "كتاب العمل في الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1178,
                "hadithNumber": "1220",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "It was forbidden to pray with the hands over one's hips.",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے پہلو پر ہاتھ رکھ کر نماز پڑھنے سے منع فرمایا ۔",
                "urduNarrator": "ہم سے عمرو بن علی فلاس نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے ہشام بن حسان فردوسی نے بیان کیا ، ان سے محمد بن سیرین نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا مُحَمَّدٌ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه قَالَ نُهِيَ أَنْ يُصَلِّيَ الرَّجُلُ مُخْتَصِرًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 22,
                    "chapterNumber": "22",
                    "chapterEnglish": "Actions while Praying",
                    "chapterUrdu": "نماز کے کام کے بارے میں",
                    "chapterArabic": "كتاب العمل في الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1179,
                "hadithNumber": "1221",
                "englishNarrator": "Narrated `Uqba bin Al-Harith رضی اللہ عنہ :",
                "hadithEnglish": "I offered the `Asr prayer with the Prophet (ﷺ) and after finishing the prayer with Taslim he got up quickly and went to some of his wives and then came out. He noticed the signs of astonishment on the faces of the people caused by his speed. He then said, \"I remembered while I was in my prayer that a piece of gold was Lying in my house and I disliked that it should remain with us throughout the night, and so I have ordered it to be distributed.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ عصر کی نماز پڑھی ۔ آپ صلی اللہ علیہ وسلم سلام پھیرتے ہی بڑی تیزی سے اٹھے اور اپنی ایک بیوی کے حجرہ میں تشریف لے گئے ، پھر باہر تشریف لائے ۔ آپ صلی اللہ علیہ وسلم نے اپنی جلدی پر اس تعجب و حیرت کو محسوس کیا جو صحابہ کے چہروں سے ظاہر ہو رہا تھا ، اس لیے آپ صلی اللہ علیہ وسلم نے فرمایا کہ نماز میں مجھے سونے کا ایک ڈلا یاد آ گیا جو ہمارے پاس تقسیم سے باقی رہ گیا تھا ۔ مجھے برا معلوم ہوا کہ ہمارے پاس وہ شام تک یا رات تک رہ جائے ۔ اس لیے میں نے اسے تقسیم کرنے کا حکم دے دیا ۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا ، کہا کہ ہم سے روح بن عبادہ نے ، کہا کہ ہم سے عمر نے جو سعید کے بیٹے ہیں ، انہوں نے کہا کہ مجھے ابن ابی ملیکہ نے خبر دی عقبہ بن حارث رضی اللہ عنہ سے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا عُمَرُ ـ هُوَ ابْنُ سَعِيدٍ ـ قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم الْعَصْرَ، فَلَمَّا سَلَّمَ قَامَ سَرِيعًا دَخَلَ عَلَى بَعْضِ نِسَائِهِ، ثُمَّ خَرَجَ وَرَأَى مَا فِي وُجُوهِ الْقَوْمِ مِنْ تَعَجُّبِهِمْ لِسُرْعَتِهِ فَقَالَ ‏ \"‏ ذَكَرْتُ وَأَنَا فِي الصَّلاَةِ تِبْرًا عِنْدَنَا، فَكَرِهْتُ أَنْ يُمْسِيَ أَوْ يَبِيتَ عِنْدَنَا فَأَمَرْتُ بِقِسْمَتِهِ ‏\"‏‏.‏",
                "headingArabic": "تَفَكُّرِ الرَّجُلِ الشَّىْءَ فِي الصَّلاَةِ",
                "headingUrdu": "نماز کے دوران کچھ سوچنا",
                "headingEnglish": "Thinking of something during As-Salat (the prayer)",
                "chapterId": "22",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 22,
                    "chapterNumber": "22",
                    "chapterEnglish": "Actions while Praying",
                    "chapterUrdu": "نماز کے کام کے بارے میں",
                    "chapterArabic": "كتاب العمل في الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1180,
                "hadithNumber": "1222",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"When the Adhan for the prayer is pronounced, then Satan takes to his heels passing wind so that he may not hear the Adhan and when the Mu'adh-dhin finishes, he comes back; and when the Iqama is pronounced he again takes to his heels and when it is finished, he again comes back and continues reminding the praying person of things that he used not to remember when not in prayer till he forgets how much he has prayed.\" Abu Salama bin `Abdur-Rahman said, \"If anyone of you has such a thing (forgetting the number of rak`at he has prayed) he should perform two prostrations of Sahu (i.e. forgetfulness) while sitting.\" Abu Salama narrates this from Abu Huraira.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب نماز کے لیے اذان دی جاتی ہے تو شیطان پیٹھ موڑ کر ریاح خارج کرتا ہوا بھاگتا ہے تاکہ اذان نہ سن سکے ۔ جب مؤذن چپ ہو جاتا ہے تو مردود پھر آ جاتا ہے اور جب جماعت کھڑی ہونے لگتی ہے ( اور تکبیر کہی جاتی ہے ) تو پھر بھاگ جاتا ہے ۔ لیکن جب مؤذن چپ ہو جاتا ہے تو پھر آ جاتا ہے ۔ اور آدمی کے دل میں وسواس پیدا کرتا رہتا ہے ۔ کہتا ہے کہ ( فلاں فلاں بات ) یاد کر ۔ کم بخت وہ باتیں یاد دلاتا ہے جو اس نمازی کے ذہن میں بھی نہ تھیں ۔ اس طرح نمازی کو یہ بھی یاد نہیں رہتا کہ اس نے کتنی رکعتیں پڑھی ہیں ۔ ابوسلمہ بن عبدالرحمٰن نے کہا کہ جب کوئی یہ بھول جائے ( کہ کتنی رکعتیں پڑھی ہیں ) تو بیٹھے بیٹھے ( سہو کے ) دو سجدے کر لے ۔ ابوسلمہ نے یہ ابوہریرہ رضی اللہ عنہ سے سنا تھا ۔",
                "urduNarrator": "ہم سے یحی بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث نے ، ان سے جعفربن ربیعہ نے اور ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرٍ، عَنِ الأَعْرَجِ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أُذِّنَ بِالصَّلاَةِ أَدْبَرَ الشَّيْطَانُ لَهُ ضُرَاطٌ حَتَّى لاَ يَسْمَعَ التَّأْذِينَ، فَإِذَا سَكَتَ الْمُؤَذِّنُ أَقْبَلَ، فَإِذَا ثُوِّبَ أَدْبَرَ فَإِذَا سَكَتَ أَقْبَلَ، فَلاَ يَزَالُ بِالْمَرْءِ يَقُولُ لَهُ اذْكُرْ مَا لَمْ يَكُنْ يَذْكُرُ حَتَّى لاَ يَدْرِي كَمْ صَلَّى ‏\"‏‏.‏ قَالَ أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ إِذَا فَعَلَ أَحَدُكُمْ ذَلِكَ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ قَاعِدٌ‏.‏ وَسَمِعَهُ أَبُو سَلَمَةَ مِنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 22,
                    "chapterNumber": "22",
                    "chapterEnglish": "Actions while Praying",
                    "chapterUrdu": "نماز کے کام کے بارے میں",
                    "chapterArabic": "كتاب العمل في الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1181,
                "hadithNumber": "1223",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "People say that I narrate too many narrations of the Prophet; once I met a man (during the lifetime of the Prophet) and asked him, \"Which Sura did Allah's Messenger (ﷺ) s recite yesterday in the `Isha' prayer?\" He said, \"I do not know.\" I said, \"Did you not attend the prayer?\" He said, \"Yes, (I did).\" I said, \"I know. He recited such and such Sura.\"",
                "hadithUrdu": "لوگ کہتے ہیں کہ ابوہریرہ بہت زیادہ حدیثیں بیان کرتا ہے ( اور حال یہ ہے کہ ) میں ایک شخص سے ایک مرتبہ ملا اور اس سے میں نے ( بطور امتحان ) دریافت کیا کہ گزشتہ رات نبی کریم صلی اللہ علیہ و سلم نے عشاء میں کون کون سی سورتیں پڑھی تھیں ؟ اس نے کہا کہ مجھے نہیں معلوم ۔ میں نے پوچھا کہ تم نماز میں شریک تھے ؟ کہا کہ ہاں شریک تھا ۔ میں نے کہا لیکن مجھے تو یاد ہے کہ آپ صلی اللہ علیہ وسلم نے فلاں فلاں سورتیں پڑھی تھیں ۔",
                "urduNarrator": "ہم سے محمد بن مثنی نے بیان کیا ، کہا کہ ہم سے عثمان بن عمر نے کہا کہ مجھے ابن ابی ذئب نے خبر دی ، انہیں سعید مقبری نے کہ ابوہریرہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ النَّاسُ أَكْثَرَ أَبُو هُرَيْرَةَ، فَلَقِيتُ رَجُلاً فَقُلْتُ بِمَ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْبَارِحَةَ فِي الْعَتَمَةِ فَقَالَ لاَ أَدْرِي‏.‏ فَقُلْتُ لَمْ تَشْهَدْهَا قَالَ بَلَى‏.‏ قُلْتُ لَكِنْ أَنَا أَدْرِي، قَرَأَ سُورَةَ كَذَا وَكَذَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "22",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 22,
                    "chapterNumber": "22",
                    "chapterEnglish": "Actions while Praying",
                    "chapterUrdu": "نماز کے کام کے بارے میں",
                    "chapterArabic": "كتاب العمل في الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1182,
                "hadithNumber": "1224",
                "englishNarrator": "Narrated `Abdullah bin Buhaina رضى الله عنه :",
                "hadithEnglish": "Allah's Messenger (ﷺ) once led us in a prayer and offered two rak`at and got up (for the third rak`a) without sitting (after the second rak`a). The people also got up with him, and when he was about to finish his prayer, we waited for him to finish the prayer with Taslim but he said Takbir before Taslim and performed two prostrations while sitting and then finished the prayer with Taslim.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کسی ( چار رکعت ) نماز کی دو رکعت پڑھانے کے بعد ( قعدہ تشہد کے بغیر ) کھڑے ہو گئے ، پہلا قعدہ نہیں کیا ۔ اس لیے لوگ بھی آپ صلی اللہ علیہ وسلم کے ساتھ کھڑے ہو گئے ۔ جب آپ صلی اللہ علیہ وسلم نماز پوری کر چکے تو ہم سلام پھیرنے کا انتظار کرنے لگے ۔ لیکن آپ صلی اللہ علیہ وسلم نے سلام سے پہلے بیٹھے بیٹھے «الله اكبر» کہا اور سلام ہی سے پہلے دو سجدے بیٹھے بیٹھے کیے پھر سلام پھیرا ۔",
                "urduNarrator": "ہم سے عبداللہ یوسف تینسی نے بیان کیا ، کہا کہ ہم کو امام مالک بن انس نے خبر دی ، انہیں ابن شہاب نے ، انہیں عبدالرحمٰن اعرج نے اور ان سے عبداللہ بن بحینہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ ـ رضى الله عنه ـ أَنَّهُ قَالَ صَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم رَكْعَتَيْنِ مِنْ بَعْضِ الصَّلَوَاتِ ثُمَّ قَامَ فَلَمْ يَجْلِسْ، فَقَامَ النَّاسُ مَعَهُ، فَلَمَّا قَضَى صَلاَتَهُ وَنَظَرْنَا تَسْلِيمَهُ كَبَّرَ قَبْلَ التَّسْلِيمِ فَسَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ ثُمَّ سَلَّمَ‏.‏",
                "headingArabic": "مَا جَاءَ فِي السَّهْوِ إِذَا قَامَ مِنْ رَكْعَتَىِ الْفَرِيضَةِ",
                "headingUrdu": "سہو کے بارے میں کیا کہا جاتا ہے: اگر کوئی شخص فرض نماز کی دوسری رکعت کے بعد (بغیر بیٹھے تیسری رکعت کے لیے) اٹھے۔",
                "headingEnglish": "What is said regarding the Sahw: If someone gets up (for the third rak'a without sitting) after the second rak'a of a compulsory salat (prayer)",
                "chapterId": "23",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 23,
                    "chapterNumber": "23",
                    "chapterEnglish": "Forgetfulness in Prayer",
                    "chapterUrdu": "سجدہ سھو کا بیان",
                    "chapterArabic": "كتاب السهو",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1183,
                "hadithNumber": "1225",
                "englishNarrator": "Narrated `Abdullah bin Buhaina:",
                "hadithEnglish": "Allah's Messenger (ﷺ) got up after the second rak`a of the Zuhr prayer without sitting in between (the second and the third rak`at). When he finished the prayer he performed two prostrations (of Sahu) and then finished the prayer with Taslim.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ظہر کی دو رکعت پڑھنے کے بعد بیٹھے بغیر کھڑے ہو گئے اور قعدہ اولیٰ نہیں کیا ۔ جب نماز پوری کر چکے تو دو سجدے کئے ۔ پھر ان کے بعد سلام پھیرا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا ہم کو امام مالک رحمہ اللہ نے خبر دی ، انہیں یحی بن سعید انصاری نے خبر دی ، انہیں عبدالرحمٰن اعرج نے خبر دی اور ان سے عبداللہ بن بحینہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ ـ رضى الله عنه ـ أَنَّهُ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ مِنِ اثْنَتَيْنِ مِنَ الظُّهْرِ لَمْ يَجْلِسْ بَيْنَهُمَا، فَلَمَّا قَضَى صَلاَتَهُ سَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ بَعْدَ ذَلِكَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 23,
                    "chapterNumber": "23",
                    "chapterEnglish": "Forgetfulness in Prayer",
                    "chapterUrdu": "سجدہ سھو کا بیان",
                    "chapterArabic": "كتاب السهو",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1184,
                "hadithNumber": "1226",
                "englishNarrator": "Narrated' `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Once Allah's Messenger (ﷺ) offered five rak`at in the Zuhr prayer, and somebody asked him whether there was some increase in the prayer. Allah's Messenger (ﷺ) said, \"What is that?\" He said, \"You have offered five rak`at.\" So Allah's Messenger (ﷺ) performed two prostrations of Sahu after Taslim.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ظہر میں پانچ رکعت پڑھ لیں ۔ اس لیے آپ صلی اللہ علیہ وسلم سے پوچھا گیا کہ کیا نماز کی رکعتیں زیادہ ہو گئی ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ کیا بات ہے ؟ کہنے والے نے کہا کہ آپ صلی اللہ علیہ وسلم نے پانچ رکعتیں پڑھی ہیں ۔ اس پر آپ صلی اللہ علیہ وسلم نے سلام کے بعد دو سجدے کئے ۔",
                "urduNarrator": "ہم سے ابوالولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے حکم نے ، ان سے ابراہیم نخعی نے ، ان سے علقمہ نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى الظُّهْرَ خَمْسًا فَقِيلَ لَهُ أَزِيدَ فِي الصَّلاَةِ فَقَالَ ‏ \"‏ وَمَا ذَاكَ ‏\"‏‏.‏ قَالَ صَلَّيْتَ خَمْسًا‏.‏ فَسَجَدَ سَجْدَتَيْنِ بَعْدَ مَا سَلَّمَ‏.‏",
                "headingArabic": "إِذَا صَلَّى خَمْسًا",
                "headingUrdu": "اگر کوئی پانچ رکعت پڑھے (چار کی بجائے)",
                "headingEnglish": "If one offers five Rak'a (instead of four)",
                "chapterId": "23",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 23,
                    "chapterNumber": "23",
                    "chapterEnglish": "Forgetfulness in Prayer",
                    "chapterUrdu": "سجدہ سھو کا بیان",
                    "chapterArabic": "كتاب السهو",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1185,
                "hadithNumber": "1227",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) led us in the `Asr or the Zuhr prayer and finished it with Taslim. Dhul-Yadain said to him, \"O Allah's Messenger (ﷺ)! Has the prayer been reduced?\" The Prophet (ﷺ) asked his companions in the affirmative. So Allah's Messenger (ﷺ) I offered two more rak`at and then performed two prostrations (of Sahu). Sa`d said, \"I saw that 'Urwa bin Az-Zubair had offered two rak`at in the Maghrib prayer and finished it with Taslim. He then talked (and when he was informed about it) he completed the rest of his prayer and performed two prostrations, and said, 'The Prophet (ﷺ) prayed like this.' \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ظہر یا عصر کی نماز پڑھائی جب آپ صلی اللہ علیہ وسلم نے سلام پھیرا تو ذوالیدین کہنے لگا کہ یا رسول اللہ صلی اللہ علیہ وسلم ! کیا نماز کی رکعتیں کم ہو گئی ہیں ؟ ( کیونکہ آپ صلی اللہ علیہ وسلم نے بھول کر صرف رکعتوں پر سلام پھیر دیا تھا ) نبی کریم صلی اللہ علیہ وسلم نے اپنے اصحاب سے دریافت کیا کہ کیا یہ سچ کہتے ہیں ؟ صحابہ نے کہا جی ہاں ، اس نے صحیح کہا ہے ۔ تب نبی کریم صلی اللہ علیہ وسلم نے دو رکعت اور پڑھائیں پھر دو سجدے کئے ۔ سعد نے بیان کیا کہ عروہ بن زبیر کو میں نے دیکھا کہ آپ نے مغرب کی دو رکعتیں پڑھ کر سلام پھیر دیا اور باتیں بھی کیں ۔ پھر باقی ایک رکعت پڑھی اور دو سجدے کئے اور فرمایا کہ نبی کریم صلی اللہ علیہ وسلم نے اسی طرح کیا تھا ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے سعد بن ابراہیم نے ، ان سے ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم الظُّهْرَ أَوِ الْعَصْرَ فَسَلَّمَ، فَقَالَ لَهُ ذُو الْيَدَيْنِ الصَّلاَةُ يَا رَسُولَ اللَّهَ أَنَقَصَتْ فَقَالَ النَّبِيُّ صلى الله عليه وسلم لأَصْحَابِهِ ‏ \"‏ أَحَقٌّ مَا يَقُولُ ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ فَصَلَّى رَكْعَتَيْنِ أُخْرَيَيْنِ ثُمَّ سَجَدَ سَجْدَتَيْنِ‏.‏ قَالَ سَعْدٌ وَرَأَيْتُ عُرْوَةَ بْنَ الزُّبَيْرِ صَلَّى مِنَ الْمَغْرِبِ رَكْعَتَيْنِ فَسَلَّمَ وَتَكَلَّمَ ثُمَّ صَلَّى مَا بَقِيَ وَسَجَدَ سَجْدَتَيْنِ وَقَالَ هَكَذَا فَعَلَ النَّبِيُّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "إِذَا سَلَّمَ فِي رَكْعَتَيْنِ أَوْ ثَلاَثٍ فَسَجَدَ سَجْدَتَيْنِ مِثْلَ سُجُودِ الصَّلاَةِ أَوْ أَطْوَلَ",
                "headingUrdu": "اگر کوئی دو یا تین رکعات (غلطی سے) ادا کرنے کے بعد اپنی نماز تسلیم کے ساتھ ختم کر لے۔",
                "headingEnglish": "If one finishes his Salat wit Taslim after offering two or three Rak'a (by mistake)",
                "chapterId": "23",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 23,
                    "chapterNumber": "23",
                    "chapterEnglish": "Forgetfulness in Prayer",
                    "chapterUrdu": "سجدہ سھو کا بیان",
                    "chapterArabic": "كتاب السهو",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1186,
                "hadithNumber": "1228",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Once Allah's Messenger (ﷺ) offered two rak`at and finished his prayer. So Dhul-Yadain asked him, \"Has the prayer been reduced or have you forgotten?\" Allah's Messenger (ﷺ) said, \"Has Dhul-Yadain spoken the truth?\" The people replied in the affirmative. Then Allah's Messenger (ﷺ) stood up and offered the remaining two rak`at and performed Taslim, and then said Takbir and performed two prostrations like his usual prostrations, or a bit longer, and then got up.\r\nHadrat Salamah bin Alqamah narrates that he said to Muhammad bin Sireen: asked Muhammad (bin Seereen) whether Tashah-hud should be recited after the two prostrations of Sahu. He replied, \"It is not (mentioned) in Abu Huraira's narration . \"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم دو رکعت پڑھ کر اٹھ کھڑے ہوئے تو ذوالیدین نے پوچھا کہ یا رسول اللہ ! کیا نماز کم کر دی گئی ہے یا آپ بھول گئے ہیں ؟ رسول اللہ صلی اللہ علیہ وسلم نے لوگوں سے پوچھا کہ کیا ذوالیدین سچ کہتے ہیں ۔ لوگوں نے کہا جی ہاں ! یہ سن کر رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے اور دو رکعت جو رہ گئی تھیں ان کو پڑھا ، پھر سلام پھیرا ، پھر «الله اكبر» کہا اور اپنے سجدے کی طرح ( یعنی نماز کے معمولی سجدے کی طرح ) سجدہ کیا یا اس سے لمبا پھر سرا ٹھایا ۔\r\nہم سےسلیمان بن حرب نےبیان کیا،کہا کہ ہم سےحماد بن زیدنےبیان کیا،ان سےسلمہ بن علقمہ نے،انہوں نے کہا کہ میں نےمحمدبن سیرین سے پوچھا کہ کیاسجدہ سہو میں تشہید ہے؟ آپ نے جواب دیا کہ ابوہریرہ رضی اللہ عنہ  کی حدیث میں تواس کا ذکر نہیں ہے۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہم کوا مام مالک بن انس نے خبر دی ، انہیں ایوب بن ابی تمیمہ سختیانی نے خبر دی ، انہیں محمد بن سیرین نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ السَّخْتِيَانِيِّ ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْصَرَفَ مِنَ اثْنَتَيْنِ ، فَقَالَ لَهُ ذُو الْيَدَيْنِ : أَقَصُرَتِ الصَّلَاةُ أَمْ نَسِيتَ يَا رَسُولَ اللَّهِ ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَصَدَقَ ذُو الْيَدَيْنِ ؟ ، فَقَالَ النَّاسُ : نَعَمْ ، فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى اثْنَتَيْنِ أُخْرَيَيْنِ ، ثُمَّ سَلَّمَ ، ثُمَّ كَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ، ثُمَّ رَفَعَ .\r\nحَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ سَلَمَةَ بْنِ عَلْقَمَةَ، قَالَ قُلْتُ لِمُحَمَّدٍ فِي سَجْدَتَىِ السَّهْوِ تَشَهُّدٌ قَالَ لَيْسَ فِي حَدِيثِ أَبِي هُرَيْرَةَ‏.‏",
                "headingArabic": "مَنْ لَمْ يَتَشَهَّدْ فِي سَجْدَتَىِ السَّهْوِ",
                "headingUrdu": "جس نے سہو کے دو سجدوں کے بعد تشہد التحیات نہ پڑھی",
                "headingEnglish": "Whoever did not recite Tashah-dud (At-Tahiyyat) after the two prostrations of Sahw",
                "chapterId": "23",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 23,
                    "chapterNumber": "23",
                    "chapterEnglish": "Forgetfulness in Prayer",
                    "chapterUrdu": "سجدہ سھو کا بیان",
                    "chapterArabic": "كتاب السهو",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1187,
                "hadithNumber": "1229",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) offered one of the evening prayers (the sub-narrator Muhammad said, \"I think that it was most probably the `Asr prayer\") and he finished it after offering two rak`at only. He then stood near a price of wood in front of the Mosque and put his hand over it. Abu Bakr and `Umar رضی اللہ عنہما were amongst those who were present, but they dared not talk to him about that (because of excessive respect for him), and those who were in a hurry went out. They said, \"Has the prayer been reduced?\" A man who was called Dhul-Yadain by the Prophet (ﷺ) said (to the Prophet), \"Has the prayer been reduced or have you forgotten?\" He said, \"Neither have I forgotten, nor has the prayer been reduced.\" He said, \"Certainly you have forgotten.\" So the Prophet (ﷺ) offered two more rak`at and performed Taslim and then said Takbir and performed a prostration of Sahu like his ordinary prostration or a bit longer and then raised his head and said Takbir and then put his head down and performed a prostration like his ordinary prostration or a bit longer, and then raised his head and said Takbir.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے تیسرے پہر کی دو نمازوں ( ظہر یا عصر ) میں سے کوئی نماز پڑھی ۔ میرا غالب گمان یہ ہے کہ وہ عصر ہی کی نماز تھی ۔ اس میں آپ صلی اللہ علیہ وسلم نے صرف دو ہی رکعت پر سلام پھیر دیا ۔ پھر آپ صلی اللہ علیہ وسلم ایک درخت کے تنے سے جو مسجد کی اگلی صف میں تھا ، ٹیک لگا کر کھڑے ہو گئے ۔ آپ صلی اللہ علیہ وسلم اپنا ہاتھ اس پر رکھے ہوئے تھے ۔ حاضرین میں ابوبکر اور عمر رضی اللہ عنہما بھی تھے لیکن انہیں بھی کچھ کہنے کی ہمت نہیں ہوئی ۔ جو ( جلد باز قسم کے ) لوگ نماز پڑھتے ہی مسجد سے نکل جانے کے عادی تھے ۔ وہ باہر جا چکے تھے ۔ لوگوں نے کہا کیا نماز کی رکعتیں کم ہو گئیں ۔ ایک شخص جنہیں نبی کریم صلی اللہ علیہ وسلم ذوالیدین کہتے تھے ۔ وہ بولے یا رسول اللہ ! آپ بھول گئے یا نماز میں کمی ہو گئی ؟ آنحضور صلی اللہ علیہ وسلم نے فرمایا نہ میں بھولا ہوں اور نہ نماز کی رکعتیں کم ہوئیں ۔ ذوالیدین بولے کہ نہیں آپ بھول گئے ہیں ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے دو رکعت اور پڑھی اور سلام پھیرا پھر تکبیر کہی اور معمول کے مطابق یا اس سے بھی طویل سجدہ کیا ۔ جب سجدہ سے سر اٹھایا تو پھر تکبیر کہی اور پھر تکبیر کہہ کر سجدہ میں گئے ۔ یہ سجدہ بھی معمول کی طرح یا اس سے طویل تھا ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے سر اٹھایا اور تکبیر کہی ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، کہا کہ ہم سے یزید بن ابراہیم نے بیان کیا ، ان سے محمد بن سیرین نے بیان کیا ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا ، کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم إِحْدَى صَلاَتَىِ الْعَشِيِّ ـ قَالَ مُحَمَّدٌ وَأَكْثَرُ ظَنِّي الْعَصْرَ ـ رَكْعَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ قَامَ إِلَى خَشَبَةٍ فِي مُقَدَّمِ الْمَسْجِدِ فَوَضَعَ يَدَهُ عَلَيْهَا وَفِيهِمْ أَبُو بَكْرٍ وَعُمَرُ ـ رضى الله عنهما ـ فَهَابَا أَنْ يُكَلِّمَاهُ وَخَرَجَ سَرَعَانُ النَّاسِ فَقَالُوا أَقَصُرَتِ الصَّلاَةُ وَرَجُلٌ يَدْعُوهُ النَّبِيُّ صلى الله عليه وسلم ذُو الْيَدَيْنِ فَقَالَ أَنَسِيتَ أَمْ قَصُرَتْ فَقَالَ ‏ \"‏ لَمْ أَنْسَ وَلَمْ تُقْصَرْ ‏\"‏‏.‏ قَالَ بَلَى قَدْ نَسِيتَ‏.‏ فَصَلَّى رَكْعَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ كَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ، ثُمَّ رَفَعَ رَأْسَهُ فَكَبَّرَ، ثُمَّ وَضَعَ رَأْسَهُ فَكَبَّرَ فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ، ثُمَّ رَفَعَ رَأْسَهُ وَكَبَّرَ‏.‏",
                "headingArabic": "مَنْ يُكَبِّرُ فِي سَجْدَتَىِ السَّهْوِ",
                "headingUrdu": "سہو کے سجدوں میں تکبیر کہنا",
                "headingEnglish": "To say Takbir in the prostrations of Sahw",
                "chapterId": "23",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 23,
                    "chapterNumber": "23",
                    "chapterEnglish": "Forgetfulness in Prayer",
                    "chapterUrdu": "سجدہ سھو کا بیان",
                    "chapterArabic": "كتاب السهو",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1188,
                "hadithNumber": "1230",
                "englishNarrator": "Narrated `Abdullah bin Buhaina Al-Asdi:",
                "hadithEnglish": "(the ally of Bani `Abdul Muttalib) Allah's Messenger (ﷺ) stood up for the Zuhr prayer and he should have sat (after the second rak`a but he stood up for the third rak`a without sitting for Tashah-hud) and when he finished the prayer he performed two prostrations and said Takbir on each prostration while sitting, before ending (the prayer) with Taslim; and the people too performed the two prostrations with him instead of the sitting he forgot. Ibn-e-Jurail corroborated him from Ibn-e-Shihab in connected with Takbeer.",
                "hadithUrdu": "( بنو عبدالمطلب کے حلیف) رسول اللہ صلی اللہ علیہ وسلم ظہر کی نماز میں قعدہ اولیٰ کئے بغیر کھڑے ہو گئے ۔ حالانکہ اس وقت آپ صلی اللہ علیہ وسلم کو بیٹھنا چاہئے تھا ۔ جب آپ صلی اللہ علیہ وسلم نے نماز پوری کی تو آپ صلی اللہ علیہ وسلم نے بیٹھے بیٹھے ہی سلام سے پہلے دو سجدے سہو کے کئے اور ہر سجدے میں «الله اكبر» کہا ۔ مقتدیوں نے بھی آپ صلی اللہ علیہ وسلم کے ساتھ یہ دو سجدے کئے ۔ آپ صلی اللہ علیہ وسلم بیٹھنا بھول گئے تھے ، اس لیے یہ سجدے اسی کے بدلہ میں کئے تھے ۔ اس روایت کی مطابعت ابن جریج نے ابن شہاب سے تکبیر کے ذکر میں کی ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا کہ ہم سے لیث بن سعد نے ، ان سے ابن شہاب نے ، ان سے اعرج نے ، ان سے عبداللہ بن بحینہ اسدی نے",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ الأَسْدِيِّ، حَلِيفِ بَنِي عَبْدِ الْمُطَّلِبِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ فِي صَلاَةِ الظُّهْرِ وَعَلَيْهِ جُلُوسٌ، فَلَمَّا أَتَمَّ صَلاَتَهُ سَجَدَ سَجْدَتَيْنِ فَكَبَّرَ فِي كُلِّ سَجْدَةٍ وَهُوَ جَالِسٌ قَبْلَ أَنْ يُسَلِّمَ، وَسَجَدَهُمَا النَّاسُ مَعَهُ مَكَانَ مَا نَسِيَ مِنَ الْجُلُوسِ‏.‏ تَابَعَهُ ابْنُ جُرَيْجٍ عَنِ ابْنِ شِهَابٍ فِي التَّكْبِيرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 23,
                    "chapterNumber": "23",
                    "chapterEnglish": "Forgetfulness in Prayer",
                    "chapterUrdu": "سجدہ سھو کا بیان",
                    "chapterArabic": "كتاب السهو",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1189,
                "hadithNumber": "1231",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"When the call for prayer is made, Satan takes to his heels passing wind so that he may not hear the Adhan and when the call is finished he comes back, and when the Iqama is pronounced, Satan again takes to his heels, and when the Iqama is finished he comes back again and tries to interfere with the person and his thoughts and say, \"Remember this and that (which he has not thought of before the prayer)\", till the praying person forgets how much he has prayed. If anyone of you does not remember whether he has offered three or four rak`at then he should perform two prostrations of Sahu while sitting.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب نماز کے لیے اذان ہوتی ہے تو شیطان ہوا خارج کرتا ہوا بھاگتا ہے تاکہ اذان نہ سنے ، جب اذان پوری ہو جاتی ہے تو پھر آ جاتا ہے ۔ جب اقامت ہوتی ہے تو پھر بھاگ پڑتا ہے ۔ لیکن اقامت ختم ہوتے ہی پھر آ جاتا ہے اور نمازی کے دل میں طرح طرح کے وسوسے ڈالتا ہے اور کہتا ہے کہ فلاں فلاں بات یاد کرو ، اس طرح اسے وہ باتیں یاد دلاتا ہے جو اس کے ذہن میں نہیں تھیں ۔ لیکن دوسری طرف نماز ی کو یہ بھی یاد نہیں رہتا کہ کتنی رکعتیں اس نے پڑھی ہیں ۔ اس لیے اگر کسی کو یہ یاد نہ رہے کہ تین رکعت پڑھیں یا چار تو بیٹھے ہی بیٹھے سہو کے دو سجدے کر لے ۔",
                "urduNarrator": "ہم سے معاذبن فضالہ نے بیان کیا ، انہوں نے کہا کہ ہم سے ہشام بن ابی عبداللہ دستوائی نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے ، ان سے ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامُ بْنُ أَبِي عَبْدِ اللَّهِ الدَّسْتَوَائِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا نُودِيَ بِالصَّلاَةِ أَدْبَرَ الشَّيْطَانُ وَلَهُ ضُرَاطٌ حَتَّى لاَ يَسْمَعَ الأَذَانَ، فَإِذَا قُضِيَ الأَذَانُ أَقْبَلَ، فَإِذَا ثُوِّبَ بِهَا أَدْبَرَ فَإِذَا قُضِيَ التَّثْوِيبُ أَقْبَلَ حَتَّى يَخْطِرَ بَيْنَ الْمَرْءِ وَنَفْسِهِ يَقُولُ اذْكُرْ كَذَا وَكَذَا مَا لَمْ يَكُنْ يَذْكُرُ حَتَّى يَظَلَّ الرَّجُلُ إِنْ يَدْرِي كَمْ صَلَّى، فَإِذَا لَمْ يَدْرِ أَحَدُكُمْ كَمْ صَلَّى ثَلاَثًا أَوْ أَرْبَعًا فَلْيَسْجُدْ سَجْدَتَيْنِ وَهْوَ جَالِسٌ ‏\"‏‏.‏",
                "headingArabic": "إِذَا لَمْ يَدْرِ كَمْ صَلَّى ثَلاَثًا أَوْ أَرْبَعًا سَجَدَ سَجْدَتَيْنِ وَهْوَ جَالِسٌ",
                "headingUrdu": "جب کوئی شخص بھول جائے کہ اس نے تین رکعتیں پڑھی ہیں یا چار",
                "headingEnglish": "When a person forgets whether he has offered three or four Rak'a",
                "chapterId": "23",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 23,
                    "chapterNumber": "23",
                    "chapterEnglish": "Forgetfulness in Prayer",
                    "chapterUrdu": "سجدہ سھو کا بیان",
                    "chapterArabic": "كتاب السهو",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1190,
                "hadithNumber": "1232",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"When anyone of you stands for the prayers, Satan comes and puts him in doubts till he forgets how many rak`at he has prayed. So if this happens to anyone of you, he should perform two prostrations of Sahu while sitting.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم میں سے جب کوئی نماز پڑھنے کے لیے کھڑا ہوتا ہے تو شیطان آ کر اس کی نماز میں شبہ پیدا کر دیتا ہے پھر اسے یہ بھی یاد نہیں رہتا کہ کتنی رکعتیں پڑھیں ۔ تم میں سے جب کسی کو ایسا اتفاق ہو تو بیٹھے بیٹھے دو سجدے کر لے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہم کو امام مالک رحمہ اللہ نے خبر دی ، انہیں ابن شہاب نے ، انہیں ابوسلمہ بن عبدالرحمٰن نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ أَحَدَكُمْ إِذَا قَامَ يُصَلِّي جَاءَ الشَّيْطَانُ فَلَبَسَ عَلَيْهِ حَتَّى لاَ يَدْرِيَ كَمْ صَلَّى، فَإِذَا وَجَدَ ذَلِكَ أَحَدُكُمْ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ ‏\"‏‏.‏",
                "headingArabic": "السَّهْوِ فِي الْفَرْضِ وَالتَّطَوُّعِ",
                "headingUrdu": "فرض نماز اور نوافل میں سہو",
                "headingEnglish": "Sahw in compulsory Salat and Nawafil",
                "chapterId": "23",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 23,
                    "chapterNumber": "23",
                    "chapterEnglish": "Forgetfulness in Prayer",
                    "chapterUrdu": "سجدہ سھو کا بیان",
                    "chapterArabic": "كتاب السهو",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1191,
                "hadithNumber": "1233",
                "englishNarrator": "Narrated Kuraib:",
                "hadithEnglish": "I was sent to Aisha رضی اللہ عنہا by Ibn `Abbas, Al-Miswar bin Makhrama and `Abdur-Rahman bin Azhar رضی اللہ عنہم. They told me to greet her on their behalf and to ask her about the offering of the two rak`at after the `Asr prayer and to say to her, \"We were informed that you offer those two rak`at and we were told that the Prophet had forbidden offering them.\" Ibn `Abbas said, \"I along with `Umar bin Al-Khattab used to beat the people whenever they offered them.\" I went to Aisha and told her that message. `Aisha رضی اللہ عنہا said, \"Go and ask Um Salama about them.\" So I returned and informed them about her statement. They then told me to go to Um Salama with the same question with which t sent me to `Aisha رضی اللہ عنہا . Um Salama رضی اللہ عنہا replied, \"I heard the Prophet (ﷺ) forbidding them. Later I saw him offering them immediately after he prayed the `Asr prayer. He then entered my house at a time when some of the Ansari women from the tribe of Bani Haram were sitting with me, so I sent my slave girl to him having said to her, 'Stand beside him and tell him that Um Salama says to you, \"O Allah's Messenger (ﷺ)! I have heard you forbidding the offering of these (two rak`at after the `Asr prayer) but I have seen you offering them.\" If he waves his hand then wait for him.' The slave girl did that. The Prophet (ﷺ) beckoned her with his hand and she waited for him. When he had finished the prayer he said, \"O daughter of Bani Umaiya! You have asked me about the two rak`at after the `Asr prayer. The people of the tribe of `Abdul-Qais came to me and made me busy and I could not offer the two rak`at after the Zuhr prayer. These (two rak`at that I have just prayed) are for those (missed) ones.",
                "hadithUrdu": "ابن عباس ، مسور بن مخرمہ اور عبدالرحمٰن بن ازہر رضی اللہ عنہم نے انہیں حضرت عائشہ رضی اللہ عنہا کی خدمت میں بھیجا اور کہا حضرت عائشہ رضی اللہ عنہا سے ہم سب کا سلام کہنا اور اس کے بعد عصر کے بعد کی دو رکعتوں کے بارے میں دریافت کرنا ۔ انہیں یہ بھی بتا دینا کہ ہمیں خبر ہوئی ہے کہ آپ یہ دو رکعتیں پڑھتی ہیں ۔ حالانکہ ہمیں آنحضرت صلی اللہ علیہ وسلم سے یہ حدیث پہنچی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ان دو رکعتوں سے منع کیا ہے اور ابن عباس رضی اللہ عنہما نے کہا کہ میں نے عمر بن خطاب رضی اللہ عنہ کے ساتھ ان رکعتوں کے پڑھنے پر لوگوں کو مارا بھی تھا ۔ کریب نے بیان کیا کہ میں حضرت عائشہ رضی اللہ عنہا کی خدمت میں حاضر ہوا اور پیغام پہنچایا ۔ اس کا جواب آپ نے یہ دیا کہ ام سلمہ رضی اللہ عنہا سے اس کے متعلق دریافت کر ۔ چنانچہ میں ان حضرات کی خدمت میں واپس ہوا اور حضرت عائشہ رضی اللہ عنہا کی گفتگو نقل کر دی ، انہوں نے مجھے ام سلمہ رضی اللہ عنہا کی خدمت میں بھیجا انہیں پیغامات کے ساتھ جن کے ساتھ حضرت عائشہ رضی اللہ عنہا کے یہاں بھیجا تھا ۔ حضرت ام سلمہ رضی اللہ عنہا نے یہ جواب دیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے کہ آپ صلی اللہ علیہ وسلم عصر کے بعد نماز پڑھنے سے روکتے تھے لیکن ایک دن میں نے دیکھا کہ عصر کے بعد آپ صلی اللہ علیہ وسلم خود یہ دو رکعتیں پڑھ رہے ہیں ۔ اس کے بعد آپ صلی اللہ علیہ وسلم میرے گھر تشریف لائے ۔ میرے پاس انصار کے قبیلہ بنو حرام کی چند عورتیں بیٹھی ہوئی تھیں ۔ اس لیے میں نے ایک باندی کو آپ صلی اللہ علیہ وسلم کی خدمت میں بھیجا ۔ میں نے اس سے کہہ دیا تھا کہ وہ آپ صلی اللہ علیہ وسلم کے بازو میں ہو کر یہ پوچھے کہ ام سلمہ کہتی ہیں کہ یا رسول اللہ ! آپ تو ان دو رکعتوں سے منع کیا کرتے تھے حالانکہ میں دیکھ رہی ہوں کہ آپ صلی اللہ علیہ وسلم خود انہیں پڑھتے ہیں ۔ اگر آنحضور صلی اللہ علیہ وسلم ہاتھ سے اشارہ کریں تو تم پیچھے ہٹ جانا ۔ باندی نے پھر اسی طرح کیا اور آپ صلی اللہ علیہ وسلم نے ہاتھ سے اشارہ کیا تو پیچھے ہٹ گئی ۔ پھر جب آپ صلی اللہ علیہ وسلم فارغ ہوئے تو ( آپ نے ام سلمہ رضی اللہ عنہا سے ) فرمایا کہ اے ابوامیہ کی بیٹی ! تم نے عصر کے بعد کی دو رکعتوں کے متعلق پوچھا ، بات یہ ہے کہ میرے پاس عبدالقیس کے کچھ لوگ آ گئے تھے اور ان کے ساتھ بات کرنے میں میں ظہر کے بعد کی دو رکعتیں نہیں پڑھ سکا تھا سو یہ وہی دو رکعت ہیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھے عمرو بن حارث نے خبر دی ، انہیں بکیر نے ، انہیں کریب نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، عَنْ بُكَيْرٍ، عَنْ كُرَيْبٍ، أَنَّ ابْنَ عَبَّاسٍ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، وَعَبْدَ الرَّحْمَنِ بْنَ أَزْهَرَ ـ رضى الله عنهم ـ أَرْسَلُوهُ إِلَى عَائِشَةَ ـ رضى الله عنها ـ فَقَالُوا اقْرَأْ عَلَيْهَا السَّلاَمَ مِنَّا جَمِيعًا وَسَلْهَا عَنِ الرَّكْعَتَيْنِ بَعْدَ صَلاَةِ الْعَصْرِ وَقُلْ لَهَا إِنَّا أُخْبِرْنَا أَنَّكِ تُصَلِّينَهُمَا وَقَدْ بَلَغَنَا أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْهَا‏.‏ وَقَالَ ابْنُ عَبَّاسٍ وَكُنْتُ أَضْرِبُ النَّاسَ مَعَ عُمَرَ بْنِ الْخَطَّابِ عَنْهُمَا‏.‏ فَقَالَ كُرَيْبٌ فَدَخَلْتُ عَلَى عَائِشَةَ ـ رضى الله عنها ـ فَبَلَّغْتُهَا مَا أَرْسَلُونِي‏.‏ فَقَالَتْ سَلْ أُمَّ سَلَمَةَ‏.‏ فَخَرَجْتُ إِلَيْهِمْ فَأَخْبَرْتُهُمْ بِقَوْلِهَا فَرَدُّونِي إِلَى أُمِّ سَلَمَةَ بِمِثْلِ مَا أَرْسَلُونِي بِهِ إِلَى عَائِشَةَ‏.‏ فَقَالَتْ أُمُّ سَلَمَةَ ـ رضى الله عنها ـ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَنْهَى عَنْهَا ثُمَّ رَأَيْتُهُ يُصَلِّيهِمَا حِينَ صَلَّى الْعَصْرَ، ثُمَّ دَخَلَ عَلَىَّ وَعِنْدِي نِسْوَةٌ مِنْ بَنِي حَرَامٍ مِنَ الأَنْصَارِ فَأَرْسَلْتُ إِلَيْهِ الْجَارِيَةَ فَقُلْتُ قُومِي بِجَنْبِهِ قُولِي لَهُ تَقُولُ لَكَ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ سَمِعْتُكَ تَنْهَى عَنْ هَاتَيْنِ وَأَرَاكَ تُصَلِّيهِمَا‏.‏ فَإِنْ أَشَارَ بِيَدِهِ فَاسْتَأْخِرِي عَنْهُ‏.‏ فَفَعَلَتِ الْجَارِيَةُ فَأَشَارَ بِيَدِهِ فَاسْتَأْخَرَتْ عَنْهُ فَلَمَّا انْصَرَفَ قَالَ ‏ \"‏ يَا بِنْتَ أَبِي أُمَيَّةَ سَأَلْتِ عَنِ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ وَإِنَّهُ أَتَانِي نَاسٌ مِنْ عَبْدِ الْقَيْسِ فَشَغَلُونِي عَنِ الرَّكْعَتَيْنِ اللَّتَيْنِ بَعْدَ الظُّهْرِ فَهُمَا هَاتَانِ ‏\"‏‏.‏",
                "headingArabic": "إِذَا كُلِّمَ وَهُوَ يُصَلِّي فَأَشَارَ بِيَدِهِ وَاسْتَمَعَ",
                "headingUrdu": "اگر کوئی شخص نماز پڑھنے والے سے بات کرے",
                "headingEnglish": "If a person speaks to a person offering Salat (prayer)",
                "chapterId": "23",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 23,
                    "chapterNumber": "23",
                    "chapterEnglish": "Forgetfulness in Prayer",
                    "chapterUrdu": "سجدہ سھو کا بیان",
                    "chapterArabic": "كتاب السهو",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1192,
                "hadithNumber": "1234",
                "englishNarrator": "Narrated Sahl bin Sa`d As-Sa`idi رضی اللہ عنہ :",
                "hadithEnglish": "The news about the differences amongst the people of Bani `Amr bin `Auf reached Allah's Messenger (ﷺ) and so he went to them along with some of his companions to effect a reconciliation between them. Allah's Messenger (ﷺ) was delayed there, and the time of the prayer was due. Bilal رضی اللہ عنہ went to Abu Bakr \r\nرضی اللہ عنہ and said to him, \"Allah's Messenger (ﷺ) has been delayed (there) and the time of prayer is due. So will you lead the people in prayer?\" Abu Bakr said, \"Yes, if you wish.\" Bilal رضی اللہ عنہ pronounced the Iqama and Abu Bakrرضی اللہ عنہ , went forward and said Takbir for the people. In the meantime Allah's Messenger (ﷺ) came crossing the rows (of the praying people) and stood in the (first) row and the people started clapping. Abu Bakrرضی اللہ عنہ , would never glance sideways in his prayer but when the people clapped much he looked back and (ﷺ) Allah's Messenger (ﷺ) . Allah's Messenger (ﷺ) beckoned him to carry on the prayer. Abu Bakr رضی اللہ عنہ raised his hands and thanked Allah, and retreated till he reached the (first) row. Allah's Messenger (ﷺ) went forward and led the people in the prayer. When he completed the prayer he faced the people and said, \"O people! Why did you start clapping when something unusual happened to you in the prayer? Clapping is only for women. So whoever amongst you comes across something in the prayer should say, 'Subhan-Allah' for there is none who will not turn round on hearing him saying Subhan-Allah. O Abu Bakr رضی اللہ عنہ ! What prevented you from leading the people in the prayer when I beckoned you to do so?\" Abu Bakr رضی اللہ عنہ replied, \"How dare the son of Abu Quhafa lead the prayer in the presence of Allah's Messenger (ﷺ) ?\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو خبر پہنچی کہ بنی عمرو بن عوف کے لوگوں میں باہم کوئی جھگڑا پیدا ہو گیا ہے تو آپ صلی اللہ علیہ وسلم چند صحابہ رضوان اللہ علیہم اجمعین کے ساتھ ملاپ کرانے کے لیے وہاں تشریف لے گئے ۔ رسول اللہ صلی اللہ علیہ وسلم ابھی مشغول ہی تھے کہ نماز کا وقت ہو گیا ۔ اس لیے بلال رضی اللہ عنہ نے حضرت ابوبکر رضی اللہ عنہ سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم ابھی تک تشریف نہیں لائے ۔ ادھر نماز کا وقت ہو گیا ہے ۔ کیا آپ لوگوں کی امامت کریں گے ؟ انہوں نے کہا کہ ہاں اگر تم چاہو ۔ چنانچہ حضرت بلال رضی اللہ عنہ نے تکبیر کہی اور حضرت ابوبکر رضی اللہ عنہ نے آگے بڑھ کر تکبیر ( تحریمہ ) کہی ۔ اتنے میں رسول اللہ صلی اللہ علیہ وسلم بھی صفوں سے گزرتے ہوئے پہلی صف میں آ کر کھڑے ہو گئے ۔ لوگوں نے ( حضرت ابوبکر رضی اللہ عنہ کو آگاہ کرنے کے لیے ) ہاتھ پر ہاتھ بجانے شروع کر دیئے لیکن حضرت ابوبکر رضی اللہ عنہ نماز میں کسی طرف دھیان نہیں دیا کرتے تھے ۔ جب لوگوں نے بہت تالیاں بجائیں تو آپ متوجہ ہوئے اور کیا دیکھتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہیں ۔ آنحضور صلی اللہ علیہ وسلم نے اشارہ سے انہیں نماز پڑھاتے رہنے کے لیے کہا ، اس پر ابوبکر رضی اللہ عنہ نے ہاتھ اٹھا کر اللہ تعالیٰ کا شکر ادا کیا اور الٹے پاؤں پیچھے کی طرف آ کر صف میں کھڑے ہو گئے پھر رسول اللہ صلی اللہ علیہ وسلم نے آگے بڑھ کر نماز پڑھائی ۔ نماز کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا ۔ لوگو ! نماز میں ایک امر پیش آیا تو تم لوگ ہاتھ پر ہاتھ کیوں مارنے لگے تھے ، یہ دستک دینا تو صرف عورتوں کے لیے ہے ۔ جس کو نماز میں کوئی حادثہ پیش آئے تو «سبحان الله» کہے کیونکہ جب بھی کوئی «سبحان الله» سنے گا وہ ادھر خیال کرے گا اور اے ابوبکر ! میرے اشارے کے باوجود تم لوگوں کو نماز کیوں نہیں پڑھاتے رہے ؟ ابوبکر رضی اللہ عنہ نے عرض کیا کہ بھلا ابوقحافہ کے بیٹے کی کیا مجال تھی کہ رسول اللہ صلی اللہ علیہ وسلم کے آگے نماز پڑھائے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا کہ ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے ابوحازم سلمہ بن دینار نے ، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَلَغَهُ أَنَّ بَنِي عَمْرِو بْنِ عَوْفٍ كَانَ بَيْنَهُمْ شَىْءٌ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصْلِحُ بَيْنَهُمْ فِي أُنَاسٍ مَعَهُ، فَحُبِسَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَحَانَتِ الصَّلاَةُ فَجَاءَ بِلاَلٌ إِلَى أَبِي بَكْرٍ ـ رضى الله عنه ـ فَقَالَ يَا أَبَا بَكْرٍ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ حُبِسَ وَقَدْ حَانَتِ الصَّلاَةُ فَهَلْ لَكَ أَنْ تَؤُمَّ النَّاسَ قَالَ نَعَمْ إِنْ شِئْتَ‏.‏ فَأَقَامَ بِلاَلٌ وَتَقَدَّمَ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَكَبَّرَ لِلنَّاسِ وَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْشِي فِي الصُّفُوفِ حَتَّى قَامَ فِي الصَّفِّ، فَأَخَذَ النَّاسُ فِي التَّصْفِيقِ، وَكَانَ أَبُو بَكْرٍ ـ رضى الله عنه ـ لاَ يَلْتَفِتُ فِي صَلاَتِهِ، فَلَمَّا أَكْثَرَ النَّاسُ الْتَفَتَ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُهُ أَنْ يُصَلِّيَ، فَرَفَعَ أَبُو بَكْرٍ ـ رضى الله عنه ـ يَدَيْهِ فَحَمِدَ اللَّهَ وَرَجَعَ الْقَهْقَرَى وَرَاءَهُ حَتَّى قَامَ فِي الصَّفِّ، فَتَقَدَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى لِلنَّاسِ فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏ \"‏ يَا أَيُّهَا النَّاسُ مَا لَكُمْ حِينَ نَابَكُمْ شَىْءٌ فِي الصَّلاَةِ أَخَذْتُمْ فِي التَّصْفِيقِ، إِنَّمَا التَّصْفِيقُ لِلنِّسَاءِ، مَنْ نَابَهُ شَىْءٌ فِي صَلاَتِهِ فَلْيَقُلْ سُبْحَانَ اللَّهِ‏.‏ فَإِنَّهُ لاَ يَسْمَعُهُ أَحَدٌ حِينَ يَقُولُ سُبْحَانَ اللَّهِ إِلاَّ الْتَفَتَ، يَا أَبَا بَكْرٍ مَا مَنَعَكَ أَنْ تُصَلِّيَ لِلنَّاسِ حِينَ أَشَرْتُ إِلَيْكَ ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ ـ رضى الله عنه ـ مَا كَانَ يَنْبَغِي لاِبْنِ أَبِي قُحَافَةَ أَنْ يُصَلِّيَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": "الإِشَارَةِ فِي الصَّلاَةِ",
                "headingUrdu": "نماز کے دوران اشارہ کرنا [نماز میں ایک شخص کی طرف سے]",
                "headingEnglish": "Beckoning during the Salat [by a person in Salat]",
                "chapterId": "23",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 23,
                    "chapterNumber": "23",
                    "chapterEnglish": "Forgetfulness in Prayer",
                    "chapterUrdu": "سجدہ سھو کا بیان",
                    "chapterArabic": "كتاب السهو",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1193,
                "hadithNumber": "1235",
                "englishNarrator": "Narrated Asma رضی اللہ عنہا :",
                "hadithEnglish": "I went to `Aisha رضی اللہ عنہا and she was standing praying and the people, too, were standing (praying). So I said, \"What is the matter with the people?\" She beckoned with her head towards the sky. I said, \"(Is there) a sign?\" She nodded intending to say, \"Yes.\"",
                "hadithUrdu": "میں حضرت عائشہ رضی اللہ عنہا کے پاس گئی ۔ اس وقت وہ کھڑی نماز پڑھ رہی تھیں ۔ لوگ بھی کھڑے نماز پڑھ رہے تھے ۔ میں نے پوچھا کہ کیا بات ہوئی ؟ تو انہوں نے سر سے آسمان کی طرف اشارہ کیا ۔ میں نے پوچھا کہ کیا کوئی نشانی ہے ؟ تو انہوں نے اپنے سر کے اشارے سے کہا کہ ہاں ۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن وہب نے بیان کیا ، ان سے سفیان ثوری نے ، ان سے ہشام بن عروہ نے ، ان سے فاطمہ بنت منذر نے اور ان سے اسماء بنت ابی بکر رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، حَدَّثَنَا الثَّوْرِيُّ، عَنْ هِشَامٍ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ، قَالَتْ دَخَلْتُ عَلَى عَائِشَةَ ـ رضى الله عنها ـ وَهِيَ تُصَلِّي قَائِمَةً وَالنَّاسُ قِيَامٌ فَقُلْتُ مَا شَأْنُ النَّاسِ فَأَشَارَتْ بِرَأْسِهَا إِلَى السَّمَاءِ‏.‏ فَقُلْتُ آيَةٌ‏.‏ فَقَالَتْ بِرَأْسِهَا أَىْ نَعَمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 23,
                    "chapterNumber": "23",
                    "chapterEnglish": "Forgetfulness in Prayer",
                    "chapterUrdu": "سجدہ سھو کا بیان",
                    "chapterArabic": "كتاب السهو",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1194,
                "hadithNumber": "1236",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا the wife of the Prophet:",
                "hadithEnglish": "Allah's Messenger (ﷺ) during his illness prayed in his house sitting, whereas some people followed him standing, but the Prophet (ﷺ) beckoned them to sit down. On completion of the prayer he said, \"The Imam is to be followed. So, bow when he bows, and raise your head when he raises his head.\" (See Hadith No. 657 Vol 1 for taking the verdict).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم بیمار تھے ۔ اس لیے آپ صلی اللہ علیہ وسلم نے گھر ہی میں بیٹھ کر نماز پڑھی لوگوں نے آپ صلی اللہ علیہ وسلم کے پیچھے کھڑے ہو کر نماز پڑھی ۔ لیکن آپ صلی اللہ علیہ وسلم نے انہیں بیٹھنے کا اشارہ کیا اور نماز کے بعد فرمایا کہ امام اس لیے ہے کہ اس کی پیروی کی جائے ۔ اس لیے جب وہ رکوع کرے تو تم بھی رکوع کرو اور جب سر اٹھائے تو تم بھی سر اٹھاؤ ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے باپ عروہ بن زبیر نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ صدیقہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَيْتِهِ وَهُوَ شَاكٍ جَالِسًا، وَصَلَّى وَرَاءَهُ قَوْمٌ قِيَامًا فَأَشَارَ إِلَيْهِمْ أَنِ اجْلِسُوا فَلَمَّا انْصَرَفَ قَالَ ‏ \"‏ إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ، فَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "23",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 23,
                    "chapterNumber": "23",
                    "chapterEnglish": "Forgetfulness in Prayer",
                    "chapterUrdu": "سجدہ سھو کا بیان",
                    "chapterArabic": "كتاب السهو",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1195,
                "hadithNumber": "1237",
                "englishNarrator": "Narrated Abu Dhar رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Someone came to me from my Lord and gave me the news (or good tidings) that if any of my followers dies worshipping none (in any way) along with Allah, he will enter Paradise.\" I asked, \"Even if he committed illegal sexual intercourse (adultery) and theft?\" He replied, \"Even if he committed illegal sexual intercourse (adultery) and theft.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ( کہ خواب میں ) میرے پاس میرے رب کا ایک آنے والا ( فرشتہ ) آیا ۔ اس نے مجھے خبر دی ، یا آپ صلی اللہ علیہ وسلم نے یہ فرمایا کہ اس نے مجھے خوشخبری دی کہ میری امت میں سے جو کوئی اس حال میں مرے کہ اللہ تعالیٰ کے ساتھ اس نے کوئی شریک نہ ٹھہرایا ہو تو وہ جنت میں جائے گا ۔ اس پر میں نے پوچھا اگرچہ اس نے زنا کیا ہو ، اگرچہ اس نے چوری کی ہو ؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اگرچہ زنا کیا ہو اگرچہ چوری کی ہو ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ ہم سے مہدی بن میمون نے ، کہا کہ ہم سے واصل بن حیان احدب ( کبڑے ) نے ، ان سے معرور بن سوید نے بیان کیا اور ان سے حضرت ابوذر غفاری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا وَاصِلٌ الأَحْدَبُ، عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ، عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَانِي آتٍ مِنْ رَبِّي فَأَخْبَرَنِي ـ أَوْ قَالَ بَشَّرَنِي ـ أَنَّهُ مَنْ مَاتَ مِنْ أُمَّتِي لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ ‏\"‏ وَإِنْ زَنَى وَإِنْ سَرَقَ ‏\"‏‏.‏",
                "headingArabic": "فِي الْجَنَائِزِ وَمَنْ كَانَ آخِرُ كَلاَمِهِ لاَ إِلَهَ إِلاَّ اللَّهُ",
                "headingUrdu": "جنازوں کے بارے میں کیا کہا جاتا ہے، اور جن کے آخری الفاظ یہ تھے: لا الہ الا اللہ (اللہ کے سوا کوئی معبود نہیں)",
                "headingEnglish": "What is said about funerals, and those whose last words were: La ilãha ilallãh (none has the right to be worshipped but Allah)",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1196,
                "hadithNumber": "1238",
                "englishNarrator": "Narrated `Abdullah:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Anyone who dies worshipping others along with Allah will definitely enter the Fire.\" I said, \"Anyone who dies worshipping none along with Allah will definitely enter Paradise.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص اس حالت میں مرے کہ کسی کو اللہ کا شریک ٹھہراتا تھا تو وہ جہنم میں جائے گا اور میں یہ کہتا ہوں کہ جو اس حال میں مرا کہ اللہ کا کوئی شریک نہ ٹھہراتا ہو وہ جنت میں جائے گا ۔",
                "urduNarrator": "ہم سے عمر بن حفص نے بیان کیا ، کہا کہ ہم سے میرے باپ حفص بن غیاث نے بیان کیا ، کہا کہ ہم سے اعمش نے بیان کیا ، کہا کہ ہم سے شقیق بن سلمہ نے بیان کیا اور ان سے عبداللہ بن مسعود نے کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا شَقِيقٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ مَاتَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ النَّارَ ‏\"‏‏.‏ وَقُلْتُ أَنَا مَنْ مَاتَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1197,
                "hadithNumber": "1239",
                "englishNarrator": "Narrated Al-Bara' bin `Azib رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) ordered us to do seven things and forbade us to do other seven. He ordered us: to follow the funeral procession. to visit the sick, to accept invitations, to help the oppressed, to fulfill the oaths, to return the greeting and to reply to the sneezer: (saying, \"May Allah be merciful on you,\" provided the sneezer says, \"All the praises are for Allah,\"). He forbade us to use silver utensils and dishes and to wear golden rings, silk (clothes), Dibaj (pure silk cloth), Qissi and Istabraq (two kinds of silk cloths).",
                "hadithUrdu": "ہمیں نبی کریم صلی اللہ علیہ وسلم نے سات کاموں کا حکم دیا اور سات کاموں سے روکا ۔ ہمیں آپ صلی اللہ علیہ وسلم نے حکم دیا تھا جنازہ کے ساتھ چلنے ، مریض کی مزاج پرسی ، دعوت قبول کرنے ، مظلوم کی مدد کرنے کا ، قسم پوری کرنے کا ، سلام کا جواب دینے کا ، چھینک پر «يرحمک الله» کہنے کا اور آپ صلی اللہ علیہ وسلم نے ہمیں منع کیا تھا چاندی کے برتن ( استعمال میں لانے ) سے ، سونے کی انگوٹھی پہننے سے ، ریشم اور دیباج ( کے کپڑوں کے پہننے ) سے ، قسی سے ، استبرق سے ۔",
                "urduNarrator": "ہم سے ابو الولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے اشعث بن ابی الثعثاء نے ، انہوں نے کہا کہ میں نے معاویہ بن سوید مقرن سے سنا ، وہ براء بن عازب رضی اللہ عنہ سے نقل کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَشْعَثِ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم بِسَبْعٍ، وَنَهَانَا عَنْ سَبْعٍ أَمَرَنَا بِاتِّبَاعِ الْجَنَائِزِ، وَعِيَادَةِ الْمَرِيضِ، وَإِجَابَةِ الدَّاعِي، وَنَصْرِ الْمَظْلُومِ، وَإِبْرَارِ الْقَسَمِ، وَرَدِّ السَّلاَمِ، وَتَشْمِيتِ الْعَاطِسِ‏.‏ وَنَهَانَا عَنْ آنِيَةِ الْفِضَّةِ، وَخَاتَمِ الذَّهَبِ، وَالْحَرِيرِ، وَالدِّيبَاجِ، وَالْقَسِّيِّ، وَالإِسْتَبْرَقِ‏.‏",
                "headingArabic": "الأَمْرِ بِاتِّبَاعِ الْجَنَائِزِ",
                "headingUrdu": "نماز جنازہ کی پیروی کا حکم",
                "headingEnglish": "The order of following the funeral procession",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1198,
                "hadithNumber": "1240",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"The rights of a Muslim on the Muslims are five: to respond to the salaam, visiting the sick, to follow the funeral processions, to accept an invitation, and to reply to those who sneeze. (see Hadith 1239)\r\nAbdul Razzaq corroborated him and said Mamar gave us the news and Salamah reported from Uqail.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ مسلمان کے مسلمان پر پانچ حق ہیں سلام کا جواب دینا ، مریض کا مزاج معلوم کرنا ، جنازے کے ساتھ چلنا ، دعوت قبول کرنا ، اور چھینک پر ( اس کے «الحمدلله» کے جواب میں ) «يرحمک الله» کہنا ۔ \r\n اس روایت کی متابعت عبدالرزاق نے کی ہے ۔ انہوں نے کہا کہ مجھے معمر نے خبر دی تھی ۔ اور اس کی روایت سلامہ نے بھی عقیل سے کی ہے ۔",
                "urduNarrator": "ہم سے محمدنے بیان کیا ، انہوں نے کہا کہ ہم سے عمرو بن ابی سلمہ نے بیان کیا ، ان سے امام اوزاعی نے ، انہوں نے کہا کہ مجھے ابن شہاب نے خبر دی ، کہا کہ مجھے سعید بن مسیب نے خبر دی کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا عَمْرُو بْنُ أَبِي سَلَمَةَ، عَنِ الأَوْزَاعِيِّ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ خَمْسٌ رَدُّ السَّلاَمِ، وَعِيَادَةُ الْمَرِيضِ، وَاتِّبَاعُ الْجَنَائِزِ، وَإِجَابَةُ الدَّعْوَةِ، وَتَشْمِيتُ الْعَاطِسِ ‏\"‏‏.‏ تَابَعَهُ عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا مَعْمَرٌ‏.‏ وَرَوَاهُ سَلاَمَةُ عَنْ عُقَيْلٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1199,
                "hadithNumber": "1241, 1242",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Abu Bakr رضی اللہ عنہ came riding his horse from his dwelling place in As-Sunh. He got down from it, entered the Mosque and did not speak with anybody till he came to me and went direct to the Prophet, who was covered with a marked blanket. Abu Bakr رضی اللہ عنہ uncovered his face. He knelt down and kissed him and then started weeping and said, \"My father and my mother be sacrificed for you, O Allah's Prophet! Allah will not combine two deaths on you. You have died the death which was written for you.\" Narrated Abu Salama from Ibn `Abbas رضی اللہ عنہما : Abu Bakr رضی اللہ عنہ came out and `Umar , was addressing the people, and Abu Bakr told him to sit down but `Umar رضی اللہ عنہ refused. Abu Bakr رضی اللہ عنہ again told him to sit down but `Umar رضی اللہ عنہ again refused. Then Abu Bakr رضی اللہ عنہ recited the Tashah-hud (i.e. none has the right to be worshipped but Allah and Muhammad is Allah's Messenger (ﷺ)) and the people attended to Abu Bakr and left `Umar رضی اللہ عنہ . Abu Bakr said رضی اللہ عنہ , \"Amma ba'du, whoever amongst you worshipped Muhammad, then Muhammad is dead, but whoever worshipped Allah, Allah is alive and will never die. Allah said: 'Muhammad is no more than an Apostle and indeed (many) Apostles have passed away before him ..(up to the) grateful.' \" (3.144) (The narrator added, \"By Allah, it was as if the people never knew that Allah had revealed this verse before till Abu Bakr رضی اللہ عنہ recited it and then whoever heard it, started reciting it.\")",
                "hadithUrdu": "( جب آنحضرت صلی اللہ علیہ وسلم کی وفات ہو گئی ) ابوبکر رضی اللہ عنہ اپنے گھر سے جو سنح میں تھا گھوڑے پر سوار ہو کر آئے اور اترتے ہی مسجد میں تشریف لے گئے ۔ پھر آپ کسی سے گفتگو کئے بغیر عائشہ رضی اللہ عنہا کے حجرہ میں آئے ( جہاں نبی کریم صلی اللہ علیہ وسلم کی نعش مبارک رکھی ہوئی تھی ) اور نبی کریم صلی اللہ علیہ وسلم کی طرف گئے ۔ حضور اکرم صلی اللہ علیہ وسلم کو برد حبرہ ( یمن کی بنی ہوئی دھاری دار چادر ) سے ڈھانک دیا گیا تھا ۔ پھر آپ نے حضور کا چہرہ مبارک کھولا اور جھک کر اس کا بوسہ لیا اور رونے لگے ۔ آپ نے کہا میرے ماں باپ آپ پر قربان ہوں اے اللہ کے نبی ! اللہ تعالیٰ دو موتیں آپ پر کبھی جمع نہیں کرے گا ۔ سوا ایک موت کے جو آپ کے مقدر میں تھی سو آپ وفات پا چکے ۔ ابوسلمہ نے کہا کہ مجھے ابن عباس رضی اللہ عنہما نے خبر دی کہ حضرت ابوبکر رضی اللہ عنہ جب باہر تشریف لائے تو حضرت عمر رضی اللہ عنہ اس وقت لوگوں سے کچھ باتیں کر رہے تھے ۔ حضرت صدیق اکبر رضی اللہ عنہ نے فرمایا کہ بیٹھ جاؤ ۔ لیکن حضرت عمر رضی اللہ عنہ نہیں مانے ۔ پھر دوبارہ آپ نے بیٹھنے کے لیے کہا ۔ لیکن حضرت عمر رضی اللہ عنہ نہیں مانے ۔ آخر حضرت ابوبکر رضی اللہ عنہ نے کلمہ شہادت پڑھا تو تمام مجمع آپ کی طرف متوجہ ہو گیا اور حضرت عمر رضی اللہ عنہ کو چھوڑ دیا ۔ آپ نے فرمایا امابعد ! اگر کوئی شخص تم میں سے محمد صلی اللہ علیہ وسلم کی عبادت کرتا تھا تو اسے معلوم ہونا چاہیے کہ محمد صلی اللہ علیہ وسلم کی وفات ہو چکی اور اگر کوئی اللہ تعالیٰ کی عبادت کرتا ہے تو اللہ تعالیٰ باقی رہنے والا ہے ۔ کبھی وہ مرنے والا نہیں ۔ اللہ پاک نے فرمایا ہے ” اور محمد صرف اللہ کے رسول ہیں اور بہت سے رسول اس سے پہلے بھی گزر چکے ہیں “ «الشاكرين» تک ( آپ نے آیت تلاوت کی ) قسم اللہ کی ایسا معلوم ہوا کہ حضرت ابوبکر رضی اللہ عنہ کے آیت کی تلاوت سے پہلے جیسے لوگوں کو معلوم ہی نہ تھا کہ یہ آیت بھی اللہ پاک نے قرآن مجید میں اتاری ہے ۔ اب تمام صحابہ نے یہ آیت آپ سے سیکھ لی پھر تو ہر شخص کی زبان پر یہی آیت تھی ۔",
                "urduNarrator": "ہم سے بشر بن محمد نے بیان کیا ، انہیں عبداللہ بن مبارک نے خبر دی ، کہا کہ مجھے معمر بن راشد اور یونس نے خبر دی ، انہیں زہری نے ، کہا کہ مجھے ابوسلمہ نے خبر دی کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنِي مَعْمَرٌ، وَيُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ قَالَتْ أَقْبَلَ أَبُو بَكْرٍ ـ رضى الله عنه ـ عَلَى فَرَسِهِ مِنْ مَسْكَنِهِ بِالسُّنْحِ حَتَّى نَزَلَ، فَدَخَلَ الْمَسْجِدَ، فَلَمْ يُكَلِّمِ النَّاسَ، حَتَّى نَزَلَ فَدَخَلَ عَلَى عَائِشَةَ ـ رضى الله عنها ـ فَتَيَمَّمَ النَّبِيَّ صلى الله عليه وسلم وَهُوَ مُسَجًّى بِبُرْدِ حِبَرَةٍ، فَكَشَفَ عَنْ وَجْهِهِ، ثُمَّ أَكَبَّ عَلَيْهِ فَقَبَّلَهُ ثُمَّ بَكَى فَقَالَ بِأَبِي أَنْتَ يَا نَبِيَّ اللَّهِ، لاَ يَجْمَعُ اللَّهُ عَلَيْكَ مَوْتَتَيْنِ، أَمَّا الْمَوْتَةُ الَّتِي كُتِبَتْ عَلَيْكَ فَقَدْ مُتَّهَا‏.‏ قَالَ أَبُو سَلَمَةَ فَأَخْبَرَنِي ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ خَرَجَ وَعُمَرُ ـ رضى الله عنه ـ يُكَلِّمُ النَّاسَ‏.‏ فَقَالَ اجْلِسْ‏.‏ فَأَبَى‏.‏ فَقَالَ اجْلِسْ‏.‏ فَأَبَى، فَتَشَهَّدَ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَمَالَ إِلَيْهِ النَّاسُ، وَتَرَكُوا عُمَرَ فَقَالَ أَمَّا بَعْدُ، فَمَنْ كَانَ مِنْكُمْ يَعْبُدُ مُحَمَّدًا صلى الله عليه وسلم فَإِنَّ مُحَمَّدًا صلى الله عليه وسلم قَدْ مَاتَ، وَمَنْ كَانَ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَىٌّ لاَ يَمُوتُ، قَالَ اللَّهُ تَعَالَى ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ‏}‏ إِلَى ‏{‏الشَّاكِرِينَ‏}‏ وَاللَّهِ لَكَأَنَّ النَّاسَ لَمْ يَكُونُوا يَعْلَمُونَ أَنَّ اللَّهَ أَنْزَلَ الآيَةَ حَتَّى تَلاَهَا أَبُو بَكْرٍ ـ رضى الله عنه ـ فَتَلَقَّاهَا مِنْهُ النَّاسُ، فَمَا يُسْمَعُ بَشَرٌ إِلاَّ يَتْلُوهَا‏.‏",
                "headingArabic": "الدُّخُولِ عَلَى الْمَيِّتِ بَعْدَ الْمَوْتِ إِذَا أُدْرِجَ فِي كَفَنِهِ",
                "headingUrdu": "کفن پہنانے کے بعد میت کی عیادت کرنا",
                "headingEnglish": "Visiting the deceased person after he has been put in his shroud",
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1200,
                "hadithNumber": "1243",
                "englishNarrator": "Narrated Kharija bin Zaid bin Thabit:",
                "hadithEnglish": "Um Al-`Ala' رضی اللہ عنہا , an Ansari woman who gave the pledge of allegiance to the Prophet (ﷺ) said to me, \"The emigrants were distributed amongst us by drawing lots and we got in our share `Uthman bin Maz'un رضی اللہ عنہ . We made him stay with us in our house. Then he suffered from a disease which proved fatal when he died and was given a bath and was shrouded in his clothes, Allah's Messenger (ﷺ) came I said, 'May Allah be merciful to you, O Abu As-Sa'ib! I testify that Allah has honored you'. The Prophet (ﷺ) said, 'How do you know that Allah has honored him?' I replied, 'O Allah's Messenger (ﷺ)! Let my father be sacrificed for you! On whom else shall Allah bestow His honor?' The Prophet (ﷺ) said, 'No doubt, death came to him. By Allah, I too wish him good, but by Allah, I do not know what Allah will do with me though I am Allah's Messenger (ﷺ). ' By Allah, I never attested the piety of anyone after that.\"",
                "hadithUrdu": "ام العلاء رضی اللہ عنہا انصار کی ایک عورت نے جنہوں نے نبی کریم صلی اللہ علیہ وسلم سے بیعت کی تھی ، نے انہیں خبر دی کہ مہاجرین قرعہ ڈال کر انصار میں بانٹ دیئے گئے تو حضرت عثمان بن مظعون رضی اللہ عنہ ہمارے حصہ میں آئے ۔ چنانچہ ہم نے انہیں اپنے گھر میں رکھا ۔ آخر وہ بیمار ہوئے اور اسی میں وفات پا گئے ۔ وفات کے بعد غسل دیا گیا اور کفن میں لپیٹ دیا گیا تو رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ۔ میں نے کہا ابوسائب آپ پر اللہ کی رحمتیں ہوں میری آپ کے متعلق شہادت یہ ہے کہ اللہ تعالیٰ نے آپ کی عزت فرمائی ہے ۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا تمہیں کیسے معلوم ہوا کہ اللہ تعالیٰ نے ان کی عزت فرمائی ہے ؟ میں نے کہا یا رسول اللہ ! میرے ماں باپ آپ پر قربان ہوں پھر کس کی اللہ تعالیٰ عزت افزائی کرے گا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا اس میں شبہ نہیں کہ ان کی موت آ چکی ، قسم اللہ کی کہ میں بھی ان کے لیے خیر ہی کی امید رکھتا ہوں لیکن واللہ ! مجھے خود اپنے متعلق بھی معلوم نہیں کہ میرے ساتھ کیا معاملہ ہو گا ۔ حالانکہ میں اللہ کا رسول ہوں ۔ ام العلاء رضی اللہ عنہا نے کہا کہ خدا کی قسم! اب میں کبھی کسی کے متعلق ( اس طرح کی ) گواہی نہیں دوں گی ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث بن سعد نے کہا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، انہوں نے فرمایا کہ مجھے خارجہ بن زید بن ثابت نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ ، حَدَّثَنَا اللَّيْثُ ، عَنْ عُقَيْلٍ ، عَنِ ابْنِ شِهَابٍ , قَالَ : أَخْبَرَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ ، أَنَّ أُمَّ الْعَلَاءِ امْرَأَةً مِنْ الْأَنْصَارِ بَايَعَتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، أَخْبَرَتْهُ أَنَّهُ اقْتُسِمَ الْمُهَاجِرُونَ قُرْعَةً فَطَارَ لَنَا عُثْمَانُ بْنُ مَظْعُونٍ فَأَنْزَلْنَاهُ فِي أَبْيَاتِنَا ، فَوَجِعَ وَجَعَهُ الَّذِي تُوُفِّيَ فِيهِ فَلَمَّا تُوُفِّيَ وَغُسِّلَ وَكُفِّنَ فِي أَثْوَابِهِ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقُلْتُ : رَحْمَةُ اللَّهِ عَلَيْكَ أَبَا السَّائِبِ فَشَهَادَتِي عَلَيْكَ لَقَدْ أَكْرَمَكَ اللَّهُ ، فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : وَمَا يُدْرِيكِ أَنَّ اللَّهَ قَدْ أَكْرَمَهُ ؟ , فَقُلْتُ : بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ ، فَمَنْ يُكْرِمُهُ اللَّهُ ؟ , فَقَالَ : أَمَّا هُوَ فَقَدْ جَاءَهُ الْيَقِينُ ، وَاللَّهِ إِنِّي لَأَرْجُو لَهُ الْخَيْرَ وَاللَّهِ مَا أَدْرِي وَأَنَا رَسُولُ اللَّهِ مَا يُفْعَلُ بِي ، قَالَتْ : فَوَاللَّهِ لَا أُزَكِّي أَحَدًا بَعْدَهُ أَبَدًا.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "24",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 24,
                    "chapterNumber": "24",
                    "chapterEnglish": "Funerals (Al-Janaa'iz)",
                    "chapterUrdu": "جنازے کے احکام و مسائل",
                    "chapterArabic": "كتاب الجنائز",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1176,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=47",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=45",
                "label": "45",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=46",
                "label": "46",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=47",
                "label": "47",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=48",
                "label": "48",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=49",
                "label": "49",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=50",
                "label": "50",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=51",
                "label": "51",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=49",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=49",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=47",
        "to": 1200,
        "total": 40465
    }
}