{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 76,
        "data": [
            {
                "id": 1877,
                "hadithNumber": "1956",
                "englishNarrator": "Narrated `Abdullah bin Abi `Aufa رضی اللہ عنہ :",
                "hadithEnglish": "We were traveling with Allah's Messenger (ﷺ) and he was fasting, and when the sun set, he said to (someone), \"Get down and mix Sawiq with water for us.\" He replied, \"O Allah's Messenger (ﷺ)! (Will you wait) till it is evening?\" The Prophet (ﷺ) again said, \"Get down and mix Sawiq with water for us.\" He replied, \"O Allah's Messenger (ﷺ)! It is still daytime.\" The Prophet (ﷺ) said again, \"Get down and mix Sawiq with water for us.\" So, he got down and carried out that order. The Prophet (ﷺ) then said, \"When you see night falling from this side, the fasting person should break his fast,\" and he beckoned with his finger towards the east.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ سفر میں جا رہے تھے ، آپ صلی اللہ علیہ وسلم روزے سے تھے ، جب سورج غروب ہوا تو آپ نے ایک شخص سے فرمایا کہ اتر کر ہمارے لیے ستو گھول ، انہوں نے کہا یا رسول اللہ ! تھوڑی دیر اور ٹھہرئیے ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اتر کر ہمارے لیے ستو گھول انہوں نے پھر یہی کہا کہ یا رسول اللہ ! ابھی تو دن باقی ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اتر کر ستو ہمارے لیے گھول ، چنانچہ انہوں نے اتر کر ستو گھولا ۔ آنحضرت صلی اللہ علیہ وسلم نے پھر فرمایا کہ جب تم دیکھو کہ رات کی تاریکی ادھر سے آ گئی تو روزہ دار کو روزہ افطار کر لینا چاہئے ۔ آپ صلی اللہ علیہ وسلم نے اپنی انگلی سے مشرق کی طرف اشارہ کیا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے عبدالواحد نے بیان کیا ، ان سے سلیمان شیبانی نے بیان کیا ، کہا کہ میں نے عبداللہ بن ابی اوفی رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الشَّيْبَانِيُّ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى ـ رضى الله عنه ـ قَالَ سِرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْوَ صَائِمٌ، فَلَمَّا غَرَبَتِ الشَّمْسُ قَالَ ‏\"‏ انْزِلْ، فَاجْدَحْ لَنَا ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ، لَوْ أَمْسَيْتَ‏.‏ قَالَ ‏\"‏ انْزِلْ، فَاجْدَحْ لَنَا ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ، إِنَّ عَلَيْكَ نَهَارًا‏.‏ قَالَ ‏\"‏ انْزِلْ، فَاجْدَحْ لَنَا ‏\"‏‏.‏ فَنَزَلَ، فَجَدَحَ، ثُمَّ قَالَ ‏\"‏ إِذَا رَأَيْتُمُ اللَّيْلَ أَقْبَلَ مِنْ هَا هُنَا فَقَدْ أَفْطَرَ الصَّائِمُ ‏\"‏‏.‏ وَأَشَارَ بِإِصْبَعِهِ قِبَلَ الْمَشْرِقِ‏.‏",
                "headingArabic": "يُفْطِرُ بِمَا تَيَسَّرَ عَلَيْهِ بِالْمَاءِ وَغَيْرِهِ",
                "headingUrdu": "افطار (روزہ توڑنے کے لیے)",
                "headingEnglish": "Iftar (to break the Saum (fast))",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1878,
                "hadithNumber": "1957",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The people will remain on the right path as long as they hasten the breaking of the fast.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، میری امت کے لوگوں میں اس وقت تک خیر باقی رہے گی ، جب تک وہ افطار میں جلدی کرتے رہیں گے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہمیں امام مالک نے خبر دی ، انہیں ابوحازم سلمہ بن دینار نے ، انہیں سہل بن سعد رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الْفِطْرَ ‏\"‏‏.‏",
                "headingArabic": "تَعْجِيلِ الإِفْطَارِ",
                "headingUrdu": "افطار میں جلدی کرنا",
                "headingEnglish": "To hasten the Iftar",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1879,
                "hadithNumber": "1958",
                "englishNarrator": "Narrated Ibn Abi `Aufa رضی اللہ عنہ :",
                "hadithEnglish": "I was with the Prophet (ﷺ) on a journey, and he observed the fast till evening. The Prophet (ﷺ) said to a man, \"Get down and mix Sawiq with water for me.\" He replied, \"Will you wait till it is evening?\" The Prophet said, \"Get down and mix Sawiq with water for me; when you see night falling from this side, the fasting person should break his fast.\"",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھا ۔ آپ صلی اللہ علیہ وسلم روزے سے تھے ، جب شام ہوئی تو آپ صلی اللہ علیہ وسلم نے ایک شخص سے فرمایا کہ ( اونٹ سے ) اتر کر میرے لیے ستو گھول ، اس نے کہا ! حضور اگر شام ہونے کا کچھ اور انتظار فرمائیں تو بہتر ہو ، آپ صلی اللہ علیہ وسلم نے فرمایا ، اتر کر میرے لیے ستو گھول ( وقت ہو گیا ہے ) جب تم یہ دیکھ لو کہ رات ادھر مشرق سے آ گئی تو روزہ دار کے روزہ کھولنے کا وقت ہو گیا ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، کہا کہ ہم سے ابوبکر بن عیاش نے بیان کیا ، ان سے سلیمان شیبانی نے اور ان سے ابن ابی اوفی رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو بَكْرٍ، عَنْ سُلَيْمَانَ، عَنِ ابْنِ أَبِي أَوْفَى ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ، فَصَامَ حَتَّى أَمْسَى، قَالَ لِرَجُلٍ ‏\"‏ انْزِلْ، فَاجْدَحْ لِي ‏\"‏‏.‏ قَالَ لَوِ انْتَظَرْتَ حَتَّى تُمْسِيَ‏.‏ قَالَ ‏\"‏ انْزِلْ، فَاجْدَحْ لِي، إِذَا رَأَيْتَ اللَّيْلَ قَدْ أَقْبَلَ مِنْ هَا هُنَا فَقَدْ أَفْطَرَ الصَّائِمُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1880,
                "hadithNumber": "1959",
                "englishNarrator": "Narrated Asma bint Abi Bakr رضی اللہ عنہ :",
                "hadithEnglish": "\"We broke our fast during the lifetime of the Prophet (ﷺ) on a cloudy day and then the sun appeared.\" Hisham was asked, \"Were they ordered to fast in lieu of that day?\" He replied, \"It had to be made up for.\" Ma`mar said, \"I heard Hisham saying, \"I don't know whether they fasted in lieu of that day or not.\"",
                "hadithUrdu": "ایک مرتبہ نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں بادل تھا ۔ ہم نے جب افطار کر لیا تو سورج نکل آیا ۔ اس پر ہشام ( راوی حدیث ) سے کہا گیا کہ پھر انہیں اس روزے کی قضاء کا حکم ہوا تھا ؟ تو انہوں نے بتلایا کہ قضاء کے سوا اور چارہ کار ہی کیا تھا ؟ اور معمر نے کہا کہ میں نے ہشام سے یوں سنا ” مجھے معلوم نہیں کہ ان لوگوں نے قضاء کی تھی یا نہیں ۔ “",
                "urduNarrator": "ہم سے عبداللہ بن ابی شیبہ نے بیان کیا ، کہا کہ ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے فاطمہ بنت منذر نے اور ان سے اسماء بنت ابی بکر رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَتْ أَفْطَرْنَا عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم يَوْمَ غَيْمٍ، ثُمَّ طَلَعَتِ الشَّمْسُ‏.‏ قِيلَ لِهِشَامٍ فَأُمِرُوا بِالْقَضَاءِ قَالَ بُدٌّ مِنْ قَضَاءٍ‏.‏ وَقَالَ مَعْمَرٌ سَمِعْتُ هِشَامًا لاَ أَدْرِي أَقْضَوْا أَمْ لاَ‏.‏",
                "headingArabic": "إِذَا أَفْطَرَ فِي رَمَضَانَ ثُمَّ طَلَعَتِ الشَّمْسُ",
                "headingUrdu": "اگر کوئی یہ سوچ کر صوم توڑ دے کہ سورج غروب ہو گیا ہے۔",
                "headingEnglish": "If somebody breaks the Saum thinking that the sun has set",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1881,
                "hadithNumber": "1960",
                "englishNarrator": "Narrated Ar-Rubi' bint Mu'awadh رضی اللہ عنہا :",
                "hadithEnglish": "\"The Prophet (ﷺ) sent a messenger to the village of the Ansar in the morning of the day of 'Ashura' (10th of Muharram) to announce: 'Whoever has eaten something should not eat but complete the fast, and whoever is observing the fast should complete it.' \"She further said, \"Since then we used to fast on that day regularly and also make our boys fast. We used to make toys of wool for the boys and if anyone of them cried for, he was given those toys till it was the time of the breaking of the fast.\"",
                "hadithUrdu": "عاشورہ کی صبح آنحضرت صلی اللہ علیہ وسلم نے انصار کے محلوں میں کہلا بھیجا کہ صبح جس نے کھا پی لیا ہو وہ دن کا باقی حصہ ( روزہ دار کی طرح ) پورے کرے اور جس نے کچھ کھایا پیا نہ ہو وہ روزے سے رہے ۔ ربیع نے کہا کہ پھر بعد میں بھی ( رمضان کے روزے کی فرضیت کے بعد ) ہم اس دن روزہ رکھتے اور اپنے بچوں سے بھی رکھواتے تھے ۔ انہیں ہم اون کا ایک کھلونا دے کر بہلائے رکھتے ۔ جب کوئی کھانے کے لیے روتا تو وہی دے دیتے ، یہاں تک کہ افطار کا وقت آ جاتا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، ان سے بشر بن مفضل نے بیان کیا ، ان سے خالد بن ذکوان نے بیان کیا ، ان سے ربیع بنت معوذ رضی اللہ عنہا نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا خَالِدُ بْنُ ذَكْوَانَ، عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذٍ، قَالَتْ أَرْسَلَ النَّبِيُّ صلى الله عليه وسلم غَدَاةَ عَاشُورَاءَ إِلَى قُرَى الأَنْصَارِ ‏ \"‏ مَنْ أَصْبَحَ مُفْطِرًا فَلْيُتِمَّ بَقِيَّةَ يَوْمِهِ، وَمَنْ أَصْبَحَ صَائِمًا فَلْيَصُمْ ‏\"‏‏.‏ قَالَتْ فَكُنَّا نَصُومُهُ بَعْدُ، وَنُصَوِّمُ صِبْيَانَنَا، وَنَجْعَلُ لَهُمُ اللُّعْبَةَ مِنَ الْعِهْنِ، فَإِذَا بَكَى أَحَدُهُمْ عَلَى الطَّعَامِ أَعْطَيْنَاهُ ذَاكَ، حَتَّى يَكُونَ عِنْدَ الإِفْطَارِ‏.‏",
                "headingArabic": "صَوْمِ الصِّبْيَانِ",
                "headingUrdu": "لڑکوں (بچوں وغیرہ) کا صوم (روزہ)",
                "headingEnglish": "Saum (fasting) of boys (children etc.)",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1882,
                "hadithNumber": "1961",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Do not practice Al-Wisal (fasting continuously without breaking one's fast in the evening or eating before the following dawn).\" The people said to the Prophet, \"But you practice Al- Wisal?\" The Prophet (ﷺ) replied, \"I am not like any of you, for I am given food and drink (by Allah) during the night.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( بلا سحر و افطار ) پے در پے روزے نہ رکھا کرو ۔ صحابہ رضی اللہ عنہم نے عرض کی کہ آپ صلی اللہ علیہ وسلم تو وصال کرتے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہاری طرح نہیں ہوں ۔ مجھے ( اللہ تعالیٰ کی طرف سے ) کھلایا اور پلایا جاتا ہے یا ( آپ صلی اللہ علیہ وسلم نے یہ فرمایا کہ ) میں اس طرح رات گزارتا ہوں کہ مجھے کھلایا اور پلایا جاتا رہتا ہے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا کہ مجھ سے یحییٰ قطان نے بیان کیا ، ان سے شعبہ نے ، کہا کہ مجھ سے قتادہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنِي يَحْيَى، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي قَتَادَةُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تُوَاصِلُوا ‏\"‏‏.‏ قَالُوا إِنَّكَ تُوَاصِلُ‏.‏ قَالَ ‏\"‏ لَسْتُ كَأَحَدٍ مِنْكُمْ، إِنِّي أُطْعَمُ وَأُسْقَى، أَوْ إِنِّي أَبِيتُ أُطْعَمُ وَأُسْقَى ‏\"‏‏.‏",
                "headingArabic": "الْوِصَالِ، وَمَنْ قَالَ لَيْسَ فِي اللَّيْلِ صِيَامٌ",
                "headingUrdu": "صوم (روزہ) لگاتار رکھنا",
                "headingEnglish": "To observe Saum (fast) continuously",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1883,
                "hadithNumber": "1962",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) forbade Al-Wisal. The people said (to him), \"But you practice it?\" He said, \"I am not like you, for I am given food and drink by Allah.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے صوم وصال سے منع فرمایا ۔ صحابہ رضی اللہ عنہم نے عرض کی کہ آپ تو وصال کرتے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہاری طرح نہیں ہوں ، مجھے تو کھلایا اور پلایا جاتا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک رحمہ اللہ نے خبر دی ، انہیں نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْوِصَالِ‏.‏ قَالُوا إِنَّكَ تُوَاصِلُ‏.‏ قَالَ ‏ \"‏ إِنِّي لَسْتُ مِثْلَكُمْ، إِنِّي أُطْعَمُ وَأُسْقَى ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1884,
                "hadithNumber": "1963",
                "englishNarrator": "Narrated Abu Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "That he had heard the Prophet (ﷺ) saying, \"Do not fast continuously (practice Al-Wisal), and if you intend to lengthen your fast, then carry it on only till the Suhur (before the following dawn).\" The people said to him, \"But you practice (Al-Wisal), O Allah's Messenger (ﷺ)!\" He replied, \"I am not similar to you, for during my sleep I have One Who makes me eat and drink.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا مسلسل ( بلاسحری و افطاری ) روزے نہ رکھو ، ہاں اگر کوئی ایسا کرنا ہی چاہے تو وہ سحری کے وقت تک ایسا کر سکتا ہے ۔ صحابہ رضی اللہ عنہم نے عرض کی یا رسول اللہ ! آپ تو ایسا کرتے ہیں ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا میں تمہاری طرح نہیں ہوں ۔ میں تو رات اس طرح گزارتا ہوں کہ ایک کھلانے والا مجھے کھلاتا ہے اور ایک پلانے والا مجھے پلاتا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، ان سے لیث بن سعد نے بیان کیا ، ان سے یزید بن ہاد نے بیان کیا ، ان سے عبداللہ بن خباب نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ تُوَاصِلُوا، فَأَيُّكُمْ إِذَا أَرَادَ أَنْ يُوَاصِلَ فَلْيُوَاصِلْ حَتَّى السَّحَرِ ‏\"‏‏.‏ قَالُوا فَإِنَّكَ تُوَاصِلُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ إِنِّي لَسْتُ كَهَيْئَتِكُمْ، إِنِّي أَبِيتُ لِي مُطْعِمٌ يُطْعِمُنِي وَسَاقٍ يَسْقِينِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1885,
                "hadithNumber": "1964",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) forbade Al-Wisal out of mercy to them. They said to him, \"But you practice Al- Wisal?\" He said, \"I am not similar to you, for my Lord gives me food and drink. \" Imam Abu Abdullah Bukhari said: Uthman, the reporter, has not mentioned. رَحْمَةً لَهُمْ",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے پے در پے روزہ سے منع کیا تھا ۔ امت پر رحمت و شفقت کے خیال سے ، صحابہ رضی اللہ عنہم نے عرض کی کہ آپ صلی اللہ علیہ وسلم تو وصال کرتے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، میں تمہاری طرح نہیں ہوں مجھے میرا رب کھلاتا اور پلاتا ہے ۔ عثمان نے ( اپنی روایت میں ) ” امت پر رحمت و شفقت کے خیال سے “ کے الفاظ ذکر نہیں کئے ہیں ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ اور محمد بن سلام نے بیان کیا ، کہا کہ ہم کو عبدہ نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے باپ نے اور ان سے عائشہ رضی اللہ عنہا نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدٌ، قَالاَ أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْوِصَالِ، رَحْمَةً لَهُمْ فَقَالُوا إِنَّكَ تُوَاصِلُ‏.‏ قَالَ ‏ \"‏ إِنِّي لَسْتُ كَهَيْئَتِكُمْ، إِنِّي يُطْعِمُنِي رَبِّي وَيَسْقِينِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ لَمْ يَذْكُرْ عُثْمَانُ رَحْمَةً لَهُمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1886,
                "hadithNumber": "1965",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) forbade Al-Wisal in fasting. So, one of the Muslims said to him, \"But you practice Al- Wisal. O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) replied, \"Who amongst you is similar to me? I am given food and drink during my sleep by my Lord.\" So, when the people refused to stop Al-Wisal (fasting continuously), the Prophet (ﷺ) fasted day and night continuously along with them for a day and then another day and then they saw the crescent moon (of the month of Shawwal). The Prophet (ﷺ) said to them (angrily), \"If It (the crescent) had not appeared, I would have made you fast for a longer period.\" That was as a punishment for them when they refused to stop (practicing Al-Wisal).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مسلسل ( کئی دن تک سحری و افطاری کے بغیر ) روزہ رکھنے سے منع فرمایا تھا ۔ اس پر ایک آدمی نے مسلمانوں میں سے عرض کی ، یا رسول اللہ صلی اللہ علیہ وسلم آپ تو وصال کرتے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا میری طرح تم میں سے کون ہے ؟ مجھے تو رات میں میرا رب کھلاتا ہے ، اور وہی مجھے سیراب کرتا ہے ۔ لوگ اس پر بھی جب صوم وصال رکھنے سے نہ رکے تو آپ صلی اللہ علیہ وسلم نے ان کے ساتھ دو دن تک وصال کیا ۔ پھر عید کا چاند نکل آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر چاند نہ دکھائی دیتا تو میں اور کئی دن وصال کرتا ، گویا جب صوم و صال سے وہ لوگ نہ رکے تو  آپ نے ان کو سزا دینے کے لیے یہ کہا ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا کہ ہم کو شعیب نے خبر دی ان سے زہری نے بیان کیا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْوِصَالِ فِي الصَّوْمِ فَقَالَ لَهُ رَجُلٌ مِنَ الْمُسْلِمِينَ إِنَّكَ تُوَاصِلُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَأَيُّكُمْ مِثْلِي إِنِّي أَبِيتُ يُطْعِمُنِي رَبِّي وَيَسْقِينِ ‏\"‏‏.‏ فَلَمَّا أَبَوْا أَنْ يَنْتَهُوا عَنِ الْوِصَالِ وَاصَلَ بِهِمْ يَوْمًا ثُمَّ يَوْمًا، ثُمَّ رَأَوُا الْهِلاَلَ، فَقَالَ ‏\"‏ لَوْ تَأَخَّرَ لَزِدْتُكُمْ ‏\"‏‏.‏ كَالتَّنْكِيلِ لَهُمْ، حِينَ أَبَوْا أَنْ يَنْتَهُوا‏.‏",
                "headingArabic": "التَّنْكِيلِ لِمَنْ أَكْثَرَ الْوِصَالَ",
                "headingUrdu": "الوصال کثرت سے کرنے والے کی سزا۔",
                "headingEnglish": "The punishment for the person who practises Al-Wisal very often.",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1887,
                "hadithNumber": "1966",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said twice, \"(O you people) Be cautious! Do not practice Al-Wisal.\" The people said to him, \"But you practice Al-Wisal?\" The Prophet (ﷺ) replied, \"My Lord gives me food and drink during my sleep. Do that much of deeds which is within your ability.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے دوبار فرمایا ، تم لوگ وصال سے بچو ! عرض کیا گیا کہ آپ تو وصال کرتے ہیں ، اس پر آپ نے فرمایا کہ رات میں مجھے میرا رب کھلاتا اور وہی مجھے سیراب کرتا ہے ۔ پس تم اتنی ہی مشقت اٹھاؤ جتنی تم طاقت رکھتے ہو ۔",
                "urduNarrator": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، ان سے عبدالرزاق نے بیان کیا ، ان سے معمر نے ، ان سے ہمام نے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِيَّاكُمْ وَالْوِصَالَ ‏\"‏‏.‏ مَرَّتَيْنِ قِيلَ إِنَّكَ تُوَاصِلُ‏.‏ قَالَ ‏\"‏ إِنِّي أَبِيتُ يُطْعِمُنِي رَبِّي وَيَسْقِينِ، فَاكْلَفُوا مِنَ الْعَمَلِ مَا تُطِيقُونَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1888,
                "hadithNumber": "1967",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Do not fast continuously day and night (practice Al-Wisal) and if anyone of you intends to fast continuously day and night, he should continue till the Suhur time.\" They said, \"But you practice Al-Wisal, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, \"I am not similar to you;. during my sleep I have One Who makes me eat and drink.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم فرما رہے تھے ، صوم وصال نہ رکھو ۔ اور اگر کسی کا ارادہ ہی وصال کا ہو تو سحری کے وقت تک وصال کر لے ۔ صحابہ رضی اللہ عنہم نے عرض کی ، یا رسول اللہ ! آپ تو وصال کرتے ہیں آپ نے فرمایا کہ میں تمہاری طرح نہیں ہوں ۔ رات کے وقت ایک کھلانے والا مجھے کھلاتا ہے اور ایک پلانے والا مجھے پلاتا ہے ۔",
                "urduNarrator": "ہم سے ابراہیم بن حمزہ نے بیان کیا ، کہا کہ ہم سے عبدالعزیز ابن ابی حازم نے بیان کیا ، ان سے یزید بن ہاد نے ، ان سے عبداللہ بن خباب نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، عَنْ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ تُوَاصِلُوا، فَأَيُّكُمْ أَرَادَ أَنْ يُوَاصِلَ فَلْيُوَاصِلْ حَتَّى السَّحَرِ ‏\"‏‏.‏ قَالُوا فَإِنَّكَ تُوَاصِلُ، يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ لَسْتُ كَهَيْئَتِكُمْ، إِنِّي أَبِيتُ لِي مُطْعِمٌ يُطْعِمُنِي وَسَاقٍ يَسْقِينِ ‏\"‏‏.‏",
                "headingArabic": "الْوِصَالِ إِلَى السَّحَرِ",
                "headingUrdu": "سحر کے وقت تک مسلسل دن رات (الوصال) کا مشاہدہ کرنا۔",
                "headingEnglish": "To observe Saum continuously day and night (Al-Wisal) till the time of Sahar.",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1889,
                "hadithNumber": "1968",
                "englishNarrator": "Narrated Abu Juhaifa:",
                "hadithEnglish": "The Prophet (ﷺ) made a bond of brotherhood between Salman and Abu Ad-Darda رضی اللہ عنہ .' Salman رضی اللہ عنہ paid a visit to Abu Ad-Darda' and found Um Ad-Darda' dressed in shabby clothes and asked her why she was in that state. She replied, \"Your brother Abu Ad-Darda رضی اللہ عنہ ' is not interested in (the luxuries of) this world.\" In the meantime Abu Ad-Darda' came and prepared a meal for Salman. Salman requested Abu Ad- Darda' to eat (with him), but Abu Ad-Darda' said, \"I am fasting.\" Salman said, \"I am not going to eat unless you eat.\" So, Abu Ad-Darda' ate (with Salman). When it was night and (a part of the night passed), Abu Ad-Darda' got up (to offer the night prayer), but Salman told him to sleep and Abu Ad- Darda رضی اللہ عنہ ' slept. After sometime Abu Ad-Darda' again got up but Salman told him to sleep. When it was the last hours of the night, Salman told him to get up then, and both of them offered the prayer. Salman رضی اللہ عنہ told Abu Ad-Darda', \"Your Lord has a right on you, your soul has a right on you, and your family has a right on you; so you should give the rights of all those who has a right on you.\" Abu Ad- Darda' came to the Prophet (ﷺ) and narrated the whole story. The Prophet (ﷺ) said, \"Salman رضی اللہ عنہ has spoken the truth.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے سلمان اور ابوالدرداء رضی اللہ عنہ میں ( ہجرت کے بعد ) بھائی چارہ کرایا تھا ۔ ایک مرتبہ سلمان رضی اللہ عنہ ، ابودرادء رضی اللہ عنہ سے ملاقات کے لیے گئے ۔ تو ( ان کی عورت ) ام الدرداء رضی اللہ عنہا کو بہت پراگندہ حال میں دیکھا ۔ ان سے پوچھا کہ یہ حالت کیوں بنا رکھی ہے ؟ ام الدرداء رضی اللہ عنہا نے جواب دیا کہ تمہارے بھائی ابوالدرداء رضی اللہ عنہ ہیں جن کو دنیا کی کوئی حاجت ہی نہیں ہے پھر ابوالدرداء رضی اللہ عنہ بھی آ گئے اور ان کے سامنے کھانا حاضر کیا اور کہا کہ کھانا کھاؤ ، انہوں نے کہا کہ میں تو روزے سے ہوں ، اس پر حضرت سلمان رضی اللہ عنہ نے فرمایا کہ میں بھی اس وقت تک کھانا نہیں کھاؤں گا جب تک تم خود بھی شریک نہ ہو گے ۔ راوی نے بیان کیا کہ پھر وہ کھانے میں شریک ہو گئے ( اور روزہ توڑ دیا ) رات ہوئی تو ابوالدرداء رضی اللہ عنہ عبادت کے لیے اٹھے اور اس مرتبہ بھی سلمان رضی اللہ عنہ نے فرمایا کہ ابھی سو جاؤ ۔ پھر جب رات کا آخری حصہ ہوا تو سلمان رضی اللہ عنہ نے فرمایا کہ اچھا اب اٹھ جاؤ ۔ چنانچہ دونوں نے نماز پڑھی ۔ اس کے بعد سلمان رضی اللہ عنہ نے فرمایا کہ تمہارے رب کا بھی تم پر حق ہے ۔ جان کا بھی تم پر حق ہے اور تمہاری بیوی کا بھی تم پر حق ہے ، اس لیے ہر حق والے کے حق کو ادا کرنا چاہئے ، پھر آپ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ صلی اللہ علیہ وسلم سے اس کا تذکرہ کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ سلمان نے سچ کہا ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے جعفر بن عون نے بیان کیا ، ان سے ابوالعمیس عتبہ بن عبداللہ نے بیان کیا ، ان سے عون بن ابی حجیفہ نے اور ان سے ان کے والد ( وہب بن عبداللہ رضی اللہ عنہ ) نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، حَدَّثَنَا أَبُو الْعُمَيْسِ، عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، قَالَ آخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَ سَلْمَانَ، وَأَبِي الدَّرْدَاءِ، فَزَارَ سَلْمَانُ أَبَا الدَّرْدَاءِ، فَرَأَى أُمَّ الدَّرْدَاءِ مُتَبَذِّلَةً‏.‏ فَقَالَ لَهَا مَا شَأْنُكِ قَالَتْ أَخُوكَ أَبُو الدَّرْدَاءِ لَيْسَ لَهُ حَاجَةٌ فِي الدُّنْيَا‏.‏ فَجَاءَ أَبُو الدَّرْدَاءِ، فَصَنَعَ لَهُ طَعَامًا‏.‏ فَقَالَ كُلْ‏.‏ قَالَ فَإِنِّي صَائِمٌ‏.‏ قَالَ مَا أَنَا بِآكِلٍ حَتَّى تَأْكُلَ‏.‏ قَالَ فَأَكَلَ‏.‏ فَلَمَّا كَانَ اللَّيْلُ ذَهَبَ أَبُو الدَّرْدَاءِ يَقُومُ‏.‏ قَالَ نَمْ‏.‏ فَنَامَ، ثُمَّ ذَهَبَ يَقُومُ‏.‏ فَقَالَ نَمْ‏.‏ فَلَمَّا كَانَ مِنْ آخِرِ اللَّيْلِ قَالَ سَلْمَانُ قُمِ الآنَ‏.‏ فَصَلَّيَا، فَقَالَ لَهُ سَلْمَانُ إِنَّ لِرَبِّكَ عَلَيْكَ حَقًّا، وَلِنَفْسِكَ عَلَيْكَ حَقًّا، وَلأَهْلِكَ عَلَيْكَ حَقًّا، فَأَعْطِ كُلَّ ذِي حَقٍّ حَقَّهُ‏.‏ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ صَدَقَ سَلْمَانُ ‏\"‏‏.‏",
                "headingArabic": "مَنْ أَقْسَمَ عَلَى أَخِيهِ لِيُفْطِرَ فِي التَّطَوُّعِ وَلَمْ يَرَ عَلَيْهِ قَضَاءً، إِذَا كَانَ أَوْفَقَ لَهُ",
                "headingUrdu": "اگر کوئی اپنے مسلمان بھائی کو نوافل کا روزہ توڑنے پر مجبور کرے۔",
                "headingEnglish": "If someone forces his Muslim brother to break his (Nawafil) fast.",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1890,
                "hadithNumber": "1969",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to fast till one would say that he would never stop fasting, and he would abandon fasting till one would say that he would never fast. I never saw Allah's Messenger (ﷺ) fasting for a whole month except the month of Ramadan, and did not see him fasting in any month more than in the month of Sha'ban.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نفل روزہ رکھنے لگتے تو ہم ( آپس میں ) کہتے کہ اب آپ صلی اللہ علیہ وسلم روزہ رکھنا چھوڑیں گے ہی نہیں ۔ اور جب روزہ چھوڑ دیتے تو ہم کہتے کہ اب آپ روزہ رکھیں گے ہی نہیں ۔ میں نے رمضان کو چھوڑ کر رسول اللہ صلی اللہ علیہ وسلم کو کبھی پورے مہینے کا نفلی روزہ رکھتے نہیں دیکھتا اور جتنے روزے آپ شعبان میں رکھتے میں نے کسی مہینہ میں اس سے زیادہ روزے رکھتے آپ کو نہیں دیکھا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کوامام مالک رحمہ اللہ نے خبری دی ، انہیں ابوالنضر نے ، انہیں ابوسلمہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا ، کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي النَّضْرِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ حَتَّى نَقُولَ لاَ يُفْطِرُ، وَيُفْطِرُ حَتَّى نَقُولَ لاَ يَصُومُ‏.‏ فَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَكْمَلَ صِيَامَ شَهْرٍ إِلاَّ رَمَضَانَ، وَمَا رَأَيْتُهُ أَكْثَرَ صِيَامًا مِنْهُ فِي شَعْبَانَ‏.‏",
                "headingArabic": "صَوْمِ شَعْبَانَ",
                "headingUrdu": "شعبان کے مہینے میں صوم (روزہ)",
                "headingEnglish": "Saum (fasting) in the month of Sha'ban.",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1891,
                "hadithNumber": "1970",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) never fasted in any month more than in the month of Sha'ban. He used to say, \"Do those deeds which you can do easily, as Allah will not get tired (of giving rewards) till you get bored and tired (of performing religious deeds).\" The most beloved prayer to the Prophet (ﷺ) was the one that was done regularly (throughout the life) even if it were little. And whenever the Prophet (ﷺ) offered a prayer he used to offer it regularly .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم شعبان سے زیادہ اور کسی مہینہ میں روزے نہیں رکھتے تھے ، شعبان کے پورے دنوں میں آپ صلی اللہ علیہ وسلم روزہ سے رہتے ۔ آپ صلی اللہ علیہ وسلم فرمایا کرتے تھے کہ عمل وہی اختیار کرو جس کی تم میں طاقت ہو کیونکہ اللہ تعالیٰ ( ثواب دینے سے ) نہیں تھکتا ۔ تم خود ہی اکتا جاؤ گے ۔ نبی کریم صلی اللہ علیہ وسلم اس نماز کو سب سے زیادہ پسند فرماتے جس پر ہمیشگی اختیار کی جائے خواہ کم ہی کیوں نہ ہو ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم جب کوئی نماز شروع کرتے تو اسے ہمیشہ پڑھتے تھے ۔",
                "urduNarrator": "ہم سے معاذ بن فضالہ نے بیان کیا ، ان سے ہشام نے بیان کیا ، ان سے یحییٰ نے ، ان سے ابوسلمہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ حَدَّثَتْهُ قَالَتْ، لَمْ يَكُنِ النَّبِيُّ صلى الله عليه وسلم يَصُومُ شَهْرًا أَكْثَرَ مِنْ شَعْبَانَ، فَإِنَّهُ كَانَ يَصُومُ شَعْبَانَ كُلَّهُ، وَكَانَ يَقُولُ ‏ \"‏ خُذُوا مِنَ الْعَمَلِ مَا تُطِيقُونَ، فَإِنَّ اللَّهَ لاَ يَمَلُّ حَتَّى تَمَلُّوا، وَأَحَبُّ الصَّلاَةِ إِلَى النَّبِيِّ صلى الله عليه وسلم مَا دُووِمَ عَلَيْهِ، وَإِنْ قَلَّتْ ‏\"‏ وَكَانَ إِذَا صَلَّى صَلاَةً دَاوَمَ عَلَيْهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1892,
                "hadithNumber": "1971",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) never fasted a full month except the month of Ramadan, and he used to fast till one could say, \"By Allah, he will never stop fasting,\" and he would abandon fasting till one would say, \"By Allah, he will never fast.\"",
                "hadithUrdu": "رمضان کے سوا نبی کریم صلی اللہ علیہ وسلم نے کبھی پورے مہینے کا روزہ نہیں رکھا ۔ آپ صلی اللہ علیہ وسلم نفل روزہ رکھنے لگتے تو دیکھنے والا کہہ اٹھتاکہ بخدا ، اب آپ بے روزہ نہیں رہیں گے اور اسی طرح جب نفل روزہ چھوڑ دیتے تو کہنے والا کہتا کہ واللہ ! اب آپ صلی اللہ علیہ وسلم روزہ نہیں رکھیں گے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، ان سے ابوعوانہ نے بیان کیا ، ان سے ابوبشر نے ، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ مَا صَامَ النَّبِيُّ صلى الله عليه وسلم شَهْرًا كَامِلاً قَطُّ غَيْرَ رَمَضَانَ، وَيَصُومُ حَتَّى يَقُولَ الْقَائِلُ لاَ وَاللَّهِ لاَ يُفْطِرُ، وَيُفْطِرُ حَتَّى يَقُولَ الْقَائِلُ لاَ وَاللَّهِ لاَ يَصُومُ‏.‏",
                "headingArabic": "مَا يُذْكَرُ مِنْ صَوْمِ النَّبِيِّ صلى الله عليه وسلم وَإِفْطَارِهِ",
                "headingUrdu": "نبی کریم صلی اللہ علیہ وسلم کے روزے اور غیر روزہ ( ادوار )",
                "headingEnglish": "Fasting and non-fasting (periods) of the Prophet saws.",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1893,
                "hadithNumber": "1972",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to leave fasting in a certain month till we thought that he would not fast in that month, and he used to fast in another month till we thought he would not stop fasting at all in that month. And if one wanted to see him praying at night, one could see him (in that condition), and if one wanted to see him sleeping at night, one could see him (in that condition) too. Sulaiman has reported from Humaid that he asked Hadrat Anas رضی اللہ عنہ about fasting.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کسی مہینہ میں بے روزہ کے رہتے تو ہمیں خیال ہوتا کہ اس مہینہ میں آپ روزہ رکھیں گے ہی نہیں ۔ اسی طرح کسی مہینہ میں نفل روزہ رکھنے لگتے تو ہم خیال کرتے کہ اب اس مہینہ کا ایک دن بھی بے روزے کے نہیں گزرے گا ۔ جو جب بھی چاہتا آنحضرت صلی اللہ علیہ وسلم کو رات میں نماز پڑھتے دیکھ سکتا تھا اور جب بھی چاہتا سوتا ہوا بھی دیکھ سکتا تھا ۔ سلیمان نے حمید طویل سے یوں بیان کیا کہ انہوں نے انس رضی اللہ عنہ سے روزہ کے متعلق پوچھا تھا ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے محمد بن جعفر نے بیان کیا ، ان سے حمید طویل نے اور انہوں نے انس رضی اللہ عنہ سے سنا ، آپ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، أَنَّهُ سَمِعَ أَنَسًا ـ رضى الله عنه ـ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُفْطِرُ مِنَ الشَّهْرِ، حَتَّى نَظُنَّ أَنْ لاَ يَصُومَ مِنْهُ، وَيَصُومُ حَتَّى نَظُنَّ أَنْ لاَ يُفْطِرَ مِنْهُ شَيْئًا، وَكَانَ لاَ تَشَاءُ تَرَاهُ مِنَ اللَّيْلِ مُصَلِّيًا إِلاَّ رَأَيْتَهُ، وَلاَ نَائِمًا إِلاَّ رَأَيْتَهُ‏.‏ وَقَالَ سُلَيْمَانُ عَنْ حُمَيْدٍ أَنَّهُ سَأَلَ أَنَسًا فِي الصَّوْمِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1894,
                "hadithNumber": "1973",
                "englishNarrator": "Narrated Humaid:",
                "hadithEnglish": "I asked Anas رضی اللہ عنہ about the fasting of the Prophet. He said \"Whenever I liked to see the Prophet (ﷺ) fasting in any month, I could see that, and whenever I liked to see him not fasting, I could see that too, and if I liked to see him praying in any night, I could see that, and if I liked to see him sleeping, I could see that, too.\" Anas further said, \"I never touched silk or velvet softer than the hand of Allah's Messenger (ﷺ) and never smelled musk or perfumed smoke more pleasant than the smell of Allah's Messenger (ﷺ).\"",
                "hadithUrdu": "میں نے انس رضی اللہ عنہ سے نبی کریم صلی اللہ علیہ وسلم کے روزوں کے متعلق پوچھا ۔ آپ نے فرمایا کہ جب بھی میرا دل چاہتا کہ آپ کو روزے سے دیکھوں تو میں آپ کو روزے سے ہی دیکھتا ۔ اور بغیر روزے کے چاہتا تو بغیر روزے سے ہی دیکھتا ۔ رات میں کھڑے ( نماز پڑھتے ) دیکھنا چاہتا تو اسی طرح نماز پڑھتے دیکھتا ۔ اور سوتے ہوئے دیکھنا چاہتا تو اسی طرح دیکھتا ۔ میں نے نبی کریم صلی اللہ علیہ وسلم کے مبارک ہاتھوں سے زیادہ نرم و نازک ریشم کے کپڑوں کو بھی نہیں دیکھا ۔ اور نہ مشک و عنبر کو آپ کی خوشبو سے زیادہ خوشبودار پایا ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا کہ ہم کو ابوخالد احمر نے خبر دی ، کہا کہ ہم کو حمید نے خبر دی ، کہا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا أَبُو خَالِدٍ الأَحْمَرُ، أَخْبَرَنَا حُمَيْدٌ، قَالَ سَأَلْتُ أَنَسًا رضى الله عنه عَنْ صِيَامِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ مَا كُنْتُ أُحِبُّ أَنْ أَرَاهُ مِنَ الشَّهْرِ صَائِمًا إِلاَّ رَأَيْتُهُ وَلاَ مُفْطِرًا إِلاَّ رَأَيْتُهُ، وَلاَ مِنَ اللَّيْلِ قَائِمًا إِلاَّ رَأَيْتُهُ، وَلاَ نَائِمًا إِلاَّ رَأَيْتُهُ، وَلاَ مَسِسْتُ خَزَّةً وَلاَ حَرِيرَةً أَلْيَنَ مِنْ كَفِّ رَسُولِ اللَّهِ صلى الله عليه وسلم، وَلاَ شَمِمْتُ مِسْكَةً وَلاَ عَبِيرَةً أَطْيَبَ رَائِحَةً مِنْ رَائِحَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1895,
                "hadithNumber": "1974",
                "englishNarrator": "Narrated `Abdullah bin `Amr bin Al-`As رضی اللہ عنہما :",
                "hadithEnglish": "\"Once Allah's Messenger (ﷺ) came to me,\" and then he narrated the whole narration, i.e. your guest has a right on you, and your wife has a right on you. I then asked about the fasting of David. The Prophet (ﷺ) replied, \"Half of the year,\" (i.e. he used to fast on every alternate day).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم میرے یہاں تشریف لائے ۔ پھر انہوں نے پوری حدیث بیان کی ، یعنی تمہارے ملاقاتیوں کا بھی تم پر حق ہے اور تمہاری بیوی کا بھی تم پر حق ہے ۔ اس پر میں نے پوچھا اور داؤد علیہ السلام کا روزہ کیسا تھا ؟ تو آپ نے فرمایا کہ ایک دن روزہ رکھنا اور ایک دن بے روزہ رہنا صوم داؤدی ہے ۔",
                "urduNarrator": "ہم سے اسحاق نے بیان کیا ، کہا کہ ہم کو ہارون بن اسماعیل نے خبر دی ، کہا کہ ہم سے علی نے بیان کیا ، ان سے یحییٰ نے بیان کیا ، کہا کہ مجھ سے ابوسلمہ نے بیان کیا ، کہا کہ مجھ سے عبداللہ بن عمرو بن عاص رضی اللہ عنہما نے بیان کیا ، آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا هَارُونُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ ـ رضى الله عنهما ـ قَالَ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَذَكَرَ الْحَدِيثَ يَعْنِي ‏\"‏ إِنَّ لِزَوْرِكَ عَلَيْكَ حَقًّا، وَإِنَّ لِزَوْجِكَ عَلَيْكَ حَقًّا ‏\"‏‏.‏ فَقُلْتُ وَمَا صَوْمُ دَاوُدَ قَالَ ‏\"‏ نِصْفُ الدَّهْرِ ‏\"‏‏.‏",
                "headingArabic": "حَقِّ الضَّيْفِ فِي الصَّوْمِ",
                "headingUrdu": "روزے میں مہمان کا حق۔",
                "headingEnglish": "The right of the guest in fasting.",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1896,
                "hadithNumber": "1975",
                "englishNarrator": "Narrated `Abdullah bin `Amr bin Al-`As رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said to me, \"O `Abdullah! Have I not been informed that you fast during the day and offer prayers all the night.\" `Abdullah replied, \"Yes, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, \"Don't do that; fast for few days and then give it up for few days, offer prayers and also sleep at night, as your body has a right on you, and your wife has a right on you, and your guest has a right on you. And it is sufficient for you to fast three days in a month, as the reward of a good deed is multiplied ten times, so it will be like fasting throughout the year.\" I insisted (on fasting) and so I was given a hard instruction. I said, \"O Allah's Messenger (ﷺ)! I have power.\" The Prophet (ﷺ) said, \"Fast like the fasting of the Prophet (ﷺ) David and do not fast more than that.\" I said, \"How was the fasting of the Prophet (ﷺ) of Allah, David?\" He said, \"Half of the year,\" (i.e. he used to fast on every alternate day). Afterwards when `Abdullah رضی اللہ عنہ became old, he used to say, \"It would have been better for me if I had accepted the permission of the Prophet (which he gave me i.e. to fast only three days a month).",
                "hadithUrdu": "مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، عبداللہ ! کیا یہ خبر صحیح ہے کہ تم دن میں تو روزہ رکھتے ہو اور ساری رات نماز پڑھتے ہو ؟ میں نے عرض کی صحیح ہے یا رسول اللہ صلی اللہ علیہ وسلم ! آپ نے فرمایا ، کہ ایسا نہ کر ، روزہ بھی رکھ اور بے روزہ کے بھی رہ ۔ نماز بھی پڑھ اور سوؤ بھی ۔ کیونکہ تمہارے جسم کا بھی تم پر حق ہے تہماری آنکھوں کا بھی تم پر حق ہے اور تمہاری بیوی کا بھی تم پر حق ہے اور تم سے ملاقات کرنے والوں کا بھی تم پر حق ہے بس یہی کافی ہے کہ ہر مہینے میں تین دن روزہ رکھ لیا کرو ، کیونکہ ہر نیکی کا بدلہ دس گنا ملے گا اور اس طرح یہ ساری عمر کا روزہ ہو جائے گا ، لیکن میں نے اپنے پر سختی چاہی تو مجھ پر سختی کر دی گئی ۔ میں نے عرض کی ، یا رسول اللہ ! میں اپنے میں قوت پاتا ہوں ۔ اس پر آپ نے فرمایا کہ پھر اللہ کے نبی داؤد علیہ السلام کا روزہ رکھ اور اس سے آگے نہ بڑھ ، میں نے پوچھا اللہ کے نبی داؤد علیہ السلام کا روزہ کیا تھا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، ایک دن روزہ رکھتے اور ایک دن بے روزہ رہا کرتے تھے ۔ عبداللہ رضی اللہ عنہ بعد میں جب ضعیف ہو گئے تو کہا کرتے تھے کاش ! میں رسول اللہ صلی اللہ علیہ وسلم کی دی ہوئی رخصت مان لیتا ۔",
                "urduNarrator": "ہم سے ابن مقاتل نے بیان کیا ، انہوں نے کہا کہ ہم کو عبداللہ نے خبر دی ، انہوں نے کہا کہ ہم کو اوزاعی نے خبر دی ، انہوں نے کہا کہ مجھ سے یحییٰ بن ابی کثیر نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا ، انہوں نے کہا کہ مجھ سے عبداللہ بن عمرو بن عاص رضی اللہ عنہما نے بیان کیا ، کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ ـ رضى الله عنهما ـ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا عَبْدَ اللَّهِ أَلَمْ أُخْبَرْ أَنَّكَ تَصُومُ النَّهَارَ وَتَقُومُ اللَّيْلَ ‏\"‏‏.‏ فَقُلْتُ بَلَى يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَلاَ تَفْعَلْ، صُمْ وَأَفْطِرْ، وَقُمْ وَنَمْ، فَإِنَّ لِجَسَدِكَ عَلَيْكَ حَقًّا، وَإِنَّ لِعَيْنِكَ عَلَيْكَ حَقًّا، وَإِنَّ لِزَوْجِكَ عَلَيْكَ حَقًّا، وَإِنَّ لِزَوْرِكَ عَلَيْكَ حَقًّا، وَإِنَّ بِحَسْبِكَ أَنْ تَصُومَ كُلَّ شَهْرٍ ثَلاَثَةَ أَيَّامٍ، فَإِنَّ لَكَ بِكُلِّ حَسَنَةٍ عَشْرَ أَمْثَالِهَا، فَإِنَّ ذَلِكَ صِيَامُ الدَّهْرِ كُلِّهِ ‏\"‏‏.‏ فَشَدَّدْتُ، فَشُدِّدَ عَلَىَّ، قُلْتُ يَا رَسُولَ اللَّهِ، إِنِّي أَجِدُ قُوَّةً‏.‏ قَالَ ‏\"‏ فَصُمْ صِيَامَ نَبِيِّ اللَّهِ دَاوُدَ عَلَيْهِ السَّلاَمُ وَلاَ تَزِدْ عَلَيْهِ ‏\"‏‏.‏ قُلْتُ وَمَا كَانَ صِيَامُ نَبِيِّ اللَّهِ دَاوُدَ ـ عَلَيْهِ السَّلاَمُ ـ قَالَ ‏\"‏ نِصْفَ الدَّهْرِ ‏\"‏‏.‏ فَكَانَ عَبْدُ اللَّهِ يَقُولُ بَعْدَ مَا كَبِرَ يَا لَيْتَنِي قَبِلْتُ رُخْصَةَ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "حَقِّ الْجِسْمِ فِي الصَّوْمِ",
                "headingUrdu": "عصوم کو دیکھنے میں جسم کا حق۔",
                "headingEnglish": "The right of the body in observing As-Saum.",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1897,
                "hadithNumber": "1976",
                "englishNarrator": "Narrated `Abdullah bin `Amr رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) was informed that I had taken an oath to fast daily and to pray (every night) all the night throughout my life (so Allah's Messenger (ﷺ) came to me and asked whether it was correct): I replied, \"Let my parents be sacrificed for you! I said so.\" The Prophet (ﷺ) said, \"You can not do that. So, fast for few days and give it up for few days, offer Salat (prayer) and sleep. Fast three days a month as the reward of good deeds is multiplied ten times and that will be equal to one year of fasting.\" The Prophet (ﷺ) said to me, \"Fast one day and give up fasting for two days.\" I replied, \"I can do better than that.\" The Prophet (ﷺ) said to me, \"Fast one day and give up fasting for a day and that is the fasting of Prophet David and that is the best fasting.\" I said, \"I have the power to fast better (more) than that.\" The Prophet (ﷺ) said, \"There is no better fasting than that.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم تک میری یہ بات پہنچا گئی کہ ” خدا کی قسم ! زندگی بھر میں دن میں تو روزے رکھوں گا ۔ اور ساری رات عبادت کروں گا “ میں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کی ، میرے ماں باپ آپ صلی اللہ علیہ وسلم پر فدا ہوں ، ہاں میں نے یہ کہا ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا لیکن تیرے اندر اس کی طاقت نہیں ، اس لیے روزہ بھی رکھ اور بے روزہ بھی رہ ۔ عبادت بھی کر لیکن سوؤ بھی اور مہینے میں تین دن کے روزے رکھا کر ۔ نیکیوں کا بدلہ دس گنا ملتا ہے ، اس طرح یہ ساری عمر کا روزہ ہو جائے گا ، میں نے کہا کہ میں اس سے بھی زیادہ کی طاقت رکھتاہوں ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر ایک دن روزہ رکھا کر اور دو دن کے لیے روزے چھوڑ دیا کر ۔ میں نے پھر کہا کہ میں اس سے بھی زیادہ کی طاقت رکھتا ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اچھا ایک دن روزہ رکھ اور ایک دن بے روزہ کے رہ کہ داؤد علیہ السلام کا روزہ ایسا ہی تھا ۔ اور روزہ کا یہ سب سے افضل طریقہ ہے ۔ میں نے اب بھی وہی کہا کہ مجھے اس سے بھی زیادہ کی طاقت ہے لیکن اس مرتبہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس سے افضل کوئی روزہ نہیں ہے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا کہ ہم کو شعیب نے خبر دی ، انہیں زہری نے ، کہا کہ مجھے سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن نے خبر دی کہ عبداللہ بن عمرو رضی اللہ عنہما نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرٍو، قَالَ أُخْبِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنِّي أَقُولُ وَاللَّهِ لأَصُومَنَّ النَّهَارَ، وَلأَقُومَنَّ اللَّيْلَ، مَا عِشْتُ‏.‏ فَقُلْتُ لَهُ قَدْ قُلْتُهُ بِأَبِي أَنْتَ وَأُمِّي‏.‏ قَالَ ‏\"‏ فَإِنَّكَ لاَ تَسْتَطِيعُ ذَلِكَ، فَصُمْ وَأَفْطِرْ، وَقُمْ وَنَمْ، وَصُمْ مِنَ الشَّهْرِ ثَلاَثَةَ أَيَّامٍ، فَإِنَّ الْحَسَنَةَ بِعَشْرِ أَمْثَالِهَا، وَذَلِكَ مِثْلُ صِيَامِ الدَّهْرِ ‏\"‏‏.‏ قُلْتُ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ‏.‏ قَالَ ‏\"‏ فَصُمْ يَوْمًا وَأَفْطِرْ يَوْمَيْنِ ‏\"‏‏.‏ قُلْتُ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ‏.‏ قَالَ ‏\"‏ فَصُمْ يَوْمًا وَأَفْطِرْ يَوْمًا، فَذَلِكَ صِيَامُ دَاوُدَ ـ عَلَيْهِ السَّلاَمُ ـ وَهْوَ أَفْضَلُ الصِّيَامِ ‏\"‏‏.‏ فَقُلْتُ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ أَفْضَلَ مِنْ ذَلِكَ ‏\"‏‏.‏",
                "headingArabic": "صَوْمِ الدَّهْرِ",
                "headingUrdu": "زندگی بھر روزانہ صوم (روزہ) رکھنا۔",
                "headingEnglish": "Observing Saum (fasting) daily throughout the life.",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1898,
                "hadithNumber": "1977",
                "englishNarrator": "Narrated `Abdullah bin `Amr رضی اللہ عنہما :",
                "hadithEnglish": "The news of my daily fasting and praying every night throughout the night reached the Prophet. So he sent for me or I met him, and he said, \"I have been informed that you fast everyday and pray every night (all the night). Fast (for some days) and give up fasting (for some days); pray and sleep, for your eyes have a right on you, and your body and your family (i.e. wife) have a right on you.\" I replied, \"I have more power than that (fasting).\" The Prophet (ﷺ) said, \"Then fast like the fasts of (the Prophet) David\". I said, \"How?\" He replied, \"He used to fast on alternate days, and he used not to flee on meeting the enemy.\" I said, \"From where can I get that chance?\" (`Ata' said, \"I do not know how the expression of fasting daily throughout the life occurred.\") So, the Prophet (ﷺ) said, twice, \"Whoever fasts daily throughout his life is just as the one who does not fast at all.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کو معلوم ہوا کہ میں مسلسل روزے رکھتا ہوں اور ساری رات عبادت کرتا ہوں ۔ اب یا آنحضور صلی اللہ علیہ وسلم نے کسی کو میرے پاس بھیجا یا خود میں نے آپ سے ملاقات کی ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا یہ خبر صحیح ہے کہ تو متواتر روزے رکھتا ہے اور ایک بھی نہیں چھوڑتا اور ( رات بھر ) نماز پڑھتا رہتا ہے ؟ روزہ بھی رکھ اور بے روزہ بھی رہ ، عبادت بھی کر اور سوؤ بھی کیونکہ تیری آنکھ کا بھی تجھ پر حق ہے ، تیری جان کا بھی تجھ پر حق ہے اور تیری بیوی کا بھی تجھ پر حق ہے ۔ عبداللہ رضی اللہ عنہ نے کہا کہ مجھ میں اس سے زیادہ کی طاقت ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر داؤد علیہ السلام کی طرح روزہ رکھا کر ۔ انہوں نے کہا اور وہ کس طرح ؟ فرمایا کہ داؤد علیہ السلام ایک دن روزہ رکھتے تھے اور ایک دن کا روزہ چھوڑ دیا کرتے تھے ۔ اور جب دشمن سے مقابلہ ہوتا تو پیٹھ نہیں پھیرتے تھے ۔ اس پر عبداللہ رضی اللہ عنہ نے عرض کی ، اے اللہ کے نبی ! میرے لیے یہ کیسے ممکن ہے کہ میں پیٹھ پھیرجاؤں ۔ عطاء نے کہا کہ مجھے یاد نہیں ( اس حدیث میں ) صوم دہر کا کس طرح ذکر ہوا ! ( البتہ انہیں اتنا دیا تھا کہ ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، جو صوم دہر رکھتا ہے اس کا روزہ ہی نہیں ، دو مرتبہ ( آپ صلی اللہ علیہ وسلم نے یہی فرمایا ) ۔",
                "urduNarrator": "ہم سے عمرو بن علی نے بیان کیا ، کہا کہ ہم کو ابوعاصم نے خبر دی ، انہیں ابن جریج نے ، انہوں نے عطاء سے سنا ، انہیں ابوعباس شاعر نے خبر دی ، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، أَخْبَرَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، سَمِعْتُ عَطَاءً، أَنَّ أَبَا الْعَبَّاسِ الشَّاعِرَ، أَخْبَرَهُ أَنَّهُ، سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرٍو ـ رضى الله عنهما ـ بَلَغَ النَّبِيَّ صلى الله عليه وسلم أَنِّي أَسْرُدُ الصَّوْمَ وَأُصَلِّي اللَّيْلَ، فَإِمَّا أَرْسَلَ إِلَىَّ، وَإِمَّا لَقِيتُهُ، فَقَالَ ‏\"‏ أَلَمْ أُخْبَرْ أَنَّكَ تَصُومُ وَلاَ تُفْطِرُ، وَتُصَلِّي وَلاَ تَنَامُ، فَصُمْ وَأَفْطِرْ، وَقُمْ وَنَمْ، فَإِنَّ لِعَيْنِكَ عَلَيْكَ حَظًّا، وَإِنَّ لِنَفْسِكَ وَأَهْلِكَ عَلَيْكَ حَظًّا ‏\"‏‏.‏ قَالَ إِنِّي لأَقْوَى لِذَلِكَ‏.‏ قَالَ ‏\"‏ فَصُمْ صِيَامَ دَاوُدَ ـ عَلَيْهِ السَّلاَمُ ـ ‏\"‏‏.‏ قَالَ وَكَيْفَ قَالَ ‏\"‏ كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا، وَلاَ يَفِرُّ إِذَا لاَقَى ‏\"‏‏.‏ قَالَ مَنْ لِي بِهَذِهِ يَا نَبِيَّ اللَّهِ قَالَ عَطَاءٌ لاَ أَدْرِي كَيْفَ ذَكَرَ صِيَامَ الأَبَدِ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ صَامَ مَنْ صَامَ الأَبَدَ ‏\"‏‏.‏ مَرَّتَيْنِ‏.‏",
                "headingArabic": "حَقِّ الأَهْلِ فِي الصَّوْمِ",
                "headingUrdu": "عصوم کی تعظیم میں اہل خانہ (بیوی) کا حق۔",
                "headingEnglish": "The right of the family (wife) in observing As-Saum.",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1899,
                "hadithNumber": "1978",
                "englishNarrator": "Narrated Mujahid from `Abdullah bin `Amr رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said (to `Abdullah), \"Fast three days a month.\" `Abdullah said, (to the Prophet) \"I am able to fast more than that.\" They kept on arguing on this matter till the Prophet (ﷺ) said, \"Fast on alternate days, and recite the whole Qur'an once a month.\" `Abdullah said, \"I can recite more (in a month),\" and the argument went on till the Prophet (ﷺ) said, \"Recite the Qur'an once each three days.\" (i.e. you must not recite the whole Qur'an in less than three days).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، مہینہ میں صرف تین دن کے روزے رکھا کر ۔ انہوں نے کہا کہ مجھ میں اس سے بھی زیادہ کی طاقت ہے ۔ اسی طرح وہ برابر کہتے رہے ( کہ مجھ میں اس سے بھی زیادہ کی طاقت ہے ) یہاں تک کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، ایک دن روزہ رکھو اور ایک دن کا روزہ چھوڑ دیا کر ۔ آپ صلی اللہ علیہ وسلم نے ان سے یہ بھی فرمایا کہ مہینہ میں ایک قرآن مجید ختم کیا کر ۔ انہوں نے اس پر بھی کہا کہ میں اس سے زیادہ کی طاقت رکھتا ہوں ۔ اور برابر یہی کہتے رہے ۔ یہاں تک کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تین دن میں ( ایک قرآن ختم کیا کر ) ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے غندر نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے مغیرہ نے بیان کیا کہ میں نے مجاہد سے سنا اور انہوں نے عبداللہ بن عمرو رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُغِيرَةَ، قَالَ سَمِعْتُ مُجَاهِدًا، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ صُمْ مِنَ الشَّهْرِ ثَلاَثَةَ أَيَّامٍ ‏\"‏‏.‏ قَالَ أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ‏.‏ فَمَا زَالَ حَتَّى قَالَ ‏\"‏ صُمْ يَوْمًا وَأَفْطِرْ يَوْمًا ‏\"‏ فَقَالَ ‏\"‏ اقْرَإِ الْقُرْآنَ فِي شَهْرٍ ‏\"‏‏.‏ قَالَ إِنِّي أُطِيقُ أَكْثَرَ‏.‏ فَمَا زَالَ حَتَّى قَالَ فِي ثَلاَثٍ‏.‏",
                "headingArabic": "صَوْمِ يَوْمٍ وَإِفْطَارِ يَوْمٍ",
                "headingUrdu": "متبادل دنوں میں صوم (روزہ)",
                "headingEnglish": "Saum (fasting) on alternate days",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1900,
                "hadithNumber": "1979",
                "englishNarrator": "Narrated `Abdullah bin `Amr bin Al-`As رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said to me, \"You fast daily all the year and pray every night all the night?\" I replied in the affirmative. The Prophet (ﷺ) said, \"If you keep on doing this, your eyes will become weak and your body will get tired. He who fasts all the year is as he who did not fast at all. The fasting of three days (a month) will be equal to the fasting of the whole year.\" I replied, \"I have the power for more than this.\" The Prophet (ﷺ) said, \"Then fast like the fasting of David who used to fast on alternate days and would never flee from the battle field, on meeting the enemy.\"",
                "hadithUrdu": "مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، کیا تو متواتر روزے رکھتا ہے اور رات بھر عبادت کرتا ہے ؟ میں نے ہاں میں جواب دیا تو آپ صلی اللہ علیہ وسلم نے فرمایا ، اگر تو یونہی کرتا رہا تو آنکھیں دھنس جائیں گی ، اور تو بےحد کمزور ہو جائے گا یہ کوئی روزہ نہیں کہ کوئی زندگی بھر ( بلاناغہ ہر روز ) روزہ رکھے ۔ تین دن کا ( ہر مہینہ میں ) روزہ پوری زندگی کے روزے کے برابر ہے ۔ میں نے اس پر کہا کہ مجھے اس سے بھی زیادہ طاقت ہے ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر داؤد علیہ السلام کا روزہ رکھا کر ۔ آپ ایک دن روزہ رکھتے تھے اور ایک دن روزہ چھوڑ دیتے تھے اور جب دشمن کا سامنا ہوتا تو پیٹھ نہیں دکھلایا کرتے تھے ۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، کہا کہ ہم سے حبیب بن ابی ثابت نے بیان کیا ، کہا کہ میں نے ابوعباس مکی سے سنا ، وہ شاعر تھے لیکن روایت حدیث میں ان پر کسی قسم کا اتہام نہیں تھا ۔ انہوں نے بیان کیا کہ میں نے عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ، قَالَ سَمِعْتُ أَبَا الْعَبَّاسِ الْمَكِّيَّ ـ وَكَانَ شَاعِرًا وَكَانَ لاَ يُتَّهَمُ فِي حَدِيثِهِ ـ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ ـ رضى الله عنهما ـ قَالَ قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّكَ لَتَصُومُ الدَّهْرَ، وَتَقُومُ اللَّيْلَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ إِنَّكَ إِذَا فَعَلْتَ ذَلِكَ هَجَمَتْ لَهُ الْعَيْنُ وَنَفِهَتْ لَهُ النَّفْسُ، لاَ صَامَ مَنْ صَامَ الدَّهْرَ، صَوْمُ ثَلاَثَةِ أَيَّامٍ صَوْمُ الدَّهْرِ كُلِّهِ ‏\"‏‏.‏ قُلْتُ فَإِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ‏.‏ قَالَ ‏\"‏ فَصُمْ صَوْمَ دَاوُدَ عَلَيْهِ السَّلاَمُ كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا، وَلاَ يَفِرُّ إِذَا لاَقَى ‏\"‏‏.‏",
                "headingArabic": "صَوْمِ دَاوُدَ عَلَيْهِ السَّلاَمُ",
                "headingUrdu": "داؤد علیہ السلام کا صوم (روزہ)۔",
                "headingEnglish": "The Saum (fasting) of Da'wud (David) alayhis salam.",
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1901,
                "hadithNumber": "1980",
                "englishNarrator": "Narrated `Abdullah bin `Amr    رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) was informed about my fasts, and he came to me and I spread for him a leather cushion stuffed with palm fires, but he sat on the ground and the cushion remained between me and him, and then he said, \"Isn't it sufficient for you to fast three days a month?\" I replied, \"O Allah's Apostle! (I can fast more).\" He said, \"Five?\" I replied, \"O Allah's Messenger (ﷺ)! (I can fast more).\" He said, \"Seven?\" I replied, \"O Allah's Messenger (ﷺ)! (I can fast more).\" He said, \"Nine (days per month)?\" I replied, \"O Allah's Messenger (ﷺ)! (I can fast more)\" He said, \"Eleven (days per month)?\" And then the Prophet said, \"There is no fast superior to that of the Prophet (ﷺ) David it was for half of the year. So, fast on alternate days.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو میرے روزے کے متعلق خبر ہو گئی ۔ ( کہ میں مسلسل روزے رکھتا ہوں ) آپ صلی اللہ علیہ وسلم میرے یہاں تشریف لائے اور میں نے ایک گدہ آپ صلی اللہ علیہ وسلم کے لیے بچھا دیا ۔ جس میں کھجور کی چھال بھری ہوئی تھی لیکن آنحضرت صلی اللہ علیہ وسلم زمین پر بیٹھ گئے ۔ اور تکیہ میرے اور آپ صلی اللہ علیہ وسلم کے درمیان ہو گیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، کیا تمہارے لیے ہر مہینہ میں تین دن کے روزے کافی نہیں ہیں ۔ انہوں نے کہا کہ میں نے عرض کی ، یا رسول اللہ ! ( کچھ اور بڑھا دیجئیے ) آپ نے فرمایا ، اچھا پانچ دن کے روزے ( رکھ لے ) میں نے عرض کی ، یا رسول اللہ کچھ اور آپ صلی اللہ علیہ وسلم نے فرمایا چلو چھ دن ، میں نے عرض کی یا رسول اللہ ! ( کچھ اور بڑھائیے ، مجھ میں اس سے بھی زیادہ کی طاقت ہے ) آپ صلی اللہ علیہ وسلم نے فرمایا ! اچھا نو دن ، میں نے عرض کی ، یا رسول اللہ ! کچھ اور فرمایا ، اچھا گیارہ دن ۔ آخر آپ نے فرمایا کہ داؤد علیہ السلام کے روزے کے طریقے کے سوا اور کوئی طریقہ ( شریعت میں ) جائز نہیں ۔ یعنی زندگی کے آدھے دنوں میں ایک دن کا روزہ رکھ اور ایک دن کا روزہ چھوڑ دیا کر ۔",
                "urduNarrator": "ہم سے اسحٰق واسطی نے بیان کیا ، کہا ہم سے خالد نے بیان کیا ، ان سے خالد حذاء نے اور ان سے ابوقلابہ نے کہ مجھے ابوملیح نے خبر دی ، کہا کہ میں آپ کے والد کے ساتھ عبداللہ بن عمرو رضی اللہ عنہما کی خدمت میں حاضر ہوا ۔ انہوں نے ہم سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدٌ، عَنْ خَالِدٍ، عَنْ أَبِي قِلاَبَةَ، قَالَ أَخْبَرَنِي أَبُو الْمَلِيحِ، قَالَ دَخَلْتُ مَعَ أَبِيكَ عَلَى عَبْدِ اللَّهِ بْنِ عَمْرٍو فَحَدَّثَنَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذُكِرَ لَهُ صَوْمِي فَدَخَلَ عَلَىَّ، فَأَلْقَيْتُ لَهُ وِسَادَةً مِنْ أَدَمٍ، حَشْوُهَا لِيفٌ، فَجَلَسَ عَلَى الأَرْضِ، وَصَارَتِ الْوِسَادَةُ بَيْنِي وَبَيْنَهُ‏.‏ فَقَالَ ‏\"‏ أَمَا يَكْفِيكَ مِنْ كُلِّ شَهْرٍ ثَلاَثَةُ أَيَّامٍ ‏\"‏‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ خَمْسًا ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ سَبْعًا ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ تِسْعًا ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ إِحْدَى عَشْرَةَ ‏\"‏‏.‏ ثُمَّ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ صَوْمَ فَوْقَ صَوْمِ دَاوُدَ ـ عَلَيْهِ السَّلاَمُ ـ شَطْرَ الدَّهْرِ، صُمْ يَوْمًا، وَأَفْطِرْ يَوْمًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "31",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 31,
                    "chapterNumber": "31",
                    "chapterEnglish": "Fasting",
                    "chapterUrdu": "روزے کے مسائل کا بیان",
                    "chapterArabic": "كتاب الصوم",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1876,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=75",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=73",
                "label": "73",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=74",
                "label": "74",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=75",
                "label": "75",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=76",
                "label": "76",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=77",
                "label": "77",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=78",
                "label": "78",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=79",
                "label": "79",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=77",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=77",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=75",
        "to": 1900,
        "total": 40465
    }
}