{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 67,
        "data": [
            {
                "id": 1652,
                "hadithNumber": "1722",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "A man said to the Prophet (ﷺ) \"I performed the Tawaf-al-Ifada before the Rami (throwing pebbles at the Jamra).\" The Prophet (ﷺ) replied, \"There is no harm.\" The man said, \"I had my head shaved before slaughtering.\" The Prophet (ﷺ) replied, \"There is no harm.\" He said, \"I have slaughtered the Hadi before the Rami.\" The Prophet (ﷺ) replied, \"There is no harm.\"Abdur Raheem Razi,Ibn-e-Khuthaim,Ataa,Hazrat Ibn-e-Abbas ( رضی اللہ عنہما )   reported it from the Prophet( ﷺ).Qasim bin Yahya, Ibn-e-Khuthaim,Ataa,Hazrat Ibn-e-Abbas( رضی اللہ عنہما ) reported it from the Prophet( ﷺ).Affan,Wohaib ,Ibn-e-Khuthaim,Saeed bin Jubair,Ibn-e-Abbas  رضی اللہ) عنہما ) reported it from the Prophet( ﷺ).Hammad,Qais bin Sa'd and Abbas bin Mansoor ,Ataa, Hazrat Jabir( رضی اللہ عنہما ) reported it from the Prophet( ﷺ).",
                "hadithUrdu": "ایک آدمی نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ حضور ! رمی سے پہلے میں نے طواف زیارت کر لیا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کوئی حرج نہیں ، پھر اس نے کہا اور حضور قربانی کرنے سے پہلے میں نے سر منڈوا لیا ، آپ صلی اللہ علیہ وسلم نے فرمایا کوئی حرج نہیں ، پھر اس نے کہا اور قربانی کو رمی سے بھی پہلے کر لیا آنحضرت صلی اللہ علیہ وسلم نے پھر بھی یہی فرمایا کہ کوئی حرج نہیں ۔\r\n اور عبدالرحیم رازی نے ابن خشیم سے بیان کیا ، کہا کہ عطاء نے خبر دی اور انہیں ابن عباس رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے اور قاسم بن یحییٰ نے کہا کہ مجھ سے ابن خشیم نے بیان کیا ، ان سے عطاء نے ، ان سے ابن عباس رضی اللہ عنہما نے نبی کریم صلی اللہ سے ۔ عفان بن مسلم صغار نے کہا کہ میرا خیال ہے کہ وہیب بن خالد سے روایت ہے کہ ابن خثیم نے بیان کیا ، ان سے سعید بن جبیر نے ، ان سے ابن عباس رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے ۔ اور حماد نے قیس بن سعد اور عباد بن منصور سے بیان کیا ، ان سے عطاء نے اور ان سے جابر رضی اللہ عنہ نے انہوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم کو ابوبکر بن عیاش نے خبر دی ، انہیں عبدالعزیز بن رفیع نے ، انہیں عطابن ابی رباح نے اور انہیں ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، أَخْبَرَنَا أَبُو بَكْرٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ رَجُلٌ لِلنَّبِيِّ صلى الله عليه وسلم زُرْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏ قَالَ حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ‏.‏ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏ قَالَ ذَبَحْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏ وَقَالَ عَبْدُ الرَّحِيمِ الرَّازِيُّ عَنِ ابْنِ خُثَيْمٍ أَخْبَرَنِي عَطَاءٌ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ الْقَاسِمُ بْنُ يَحْيَى حَدَّثَنِي ابْنُ خُثَيْمٍ عَنْ عَطَاءٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ عَفَّانُ أُرَاهُ عَنْ وُهَيْبٍ، حَدَّثَنَا ابْنُ خُثَيْمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ حَمَّادٌ عَنْ قَيْسِ بْنِ سَعْدٍ وَعَبَّادِ بْنِ مَنْصُورٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1653,
                "hadithNumber": "1723",
                "englishNarrator": "Narrated Ibn `Abbas:رضی اللہ عنہما",
                "hadithEnglish": "The Prophet (ﷺ) was asked by a man who said, \"I have done the Rami in the evening.\" The Prophet (ﷺ) replied, \"There is no harm in it.\" Another man asked, \"I had my head shaved before the slaughtering.\" The Prophet (ﷺ) replied, \"There is no harm in it.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سے ایک آدمی نے مسئلہ پوچھا کہ شام ہونے کے بعد میں نے رمی کی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ کوئی حرج نہیں ۔ سائل نے کہا کہ قربانی کرنے سے پہلے میں نے سر منڈا لیا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کوئی حرج نہیں ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے عبدالاعلیٰ نے بیان کیا ، کہا ہم سے خالد نے بیان کیا ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ رَمَيْتُ بَعْدَ مَا أَمْسَيْتُ‏.‏ فَقَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏ قَالَ حَلَقْتُ قَبْلَ أَنْ أَنْحَرَ‏.‏ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1654,
                "hadithNumber": "1724",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "I came upon Allah's Messenger (ﷺ) when he was at Al-Batha. He asked me, \"Have you intended to perform the Hajj?\" I replied in the affirmative. He asked, \"For what have you assumed lhram?\" I replied,\" I have assumed Ihram with the same intention as that of the Prophet (ﷺ) .\" The Prophet (ﷺ) said, \"You have done well! Go and perform Tawaf round the Ka`ba and between Safa and Marwa.\" Then I went to one of the women of Bani Qais and she took out lice from my head. Later, I assumed the Ihram for Hajj. So, I used to give this verdict to the people till the caliphate of `Umar. When I told him about it, he said, \"If we take (follow) the Holy Book, then it orders us to complete Hajj and `Umra (Hajj-at- Tamattu`) and if we follow the tradition of Allah's Messenger (ﷺ) then Allah's Messenger (ﷺ) did not finish his lhram till the Hadi had reached its destination (had been slaughtered). (i.e. Hajj-al-Qiran). (See Hadith No. 630)",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ بطحاء میں تھے ۔ ( جو مکہ کے قریب ایک جگہ ہے ) آپ صلی اللہ علیہ وسلم نے پوچھا کیا تو نے حج کی نیت کی ہے ؟ میں نے کہا کہ ہاں ، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تو نے احرام کس چیز کا باندھا ہے میں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم کے احرام کی طرح باندھا ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ تو نے اچھا کیا اب جا ۔ چنانچہ ( مکہ پہنچ کر ) میں نے بیت اللہ کا طواف کیا اور صفا و مروہ کی سعی کی ، پھر میں بنو قیس کی ایک خاتون کے پاس آیا اور انہوں نے میرے سر کی جوئیں نکالی ۔ اس کے بعد میں نے حج کی لبیک پکاری ۔ اس کے بعد میں عمر رضی اللہ عنہ کے عہد خلافت تک اسی کا فتویٰ دیتا رہا پھر جب میں نے عمر رضی اللہ عنہ سے اس کا ذکر کیا تو آپ رضی اللہ عنہ نے فرمایا کہ ہمیں کتاب اللہ پر بھی عمل کرنا چاہئے اورکہ  اس میں  حج اور عمرہ    پورا کرنے کا حکم ہے ، پھر رسول اللہ صلی اللہ علیہ وسلم کی سنت پر بھی عمل کرنا چاہئے اور آنحضرت صلی اللہ علیہ وسلم قربانی سے پہلے حلال نہیں ہوئے تھے ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، کہا کہ مجھے میرے باپ عثمان نے خبر دی ، انہیں شعبہ نے ، انہیں قیس بن مسلم نے ، انہیں طارق بن شہاب نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ قَدِمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ بِالْبَطْحَاءِ‏.‏ فَقَالَ ‏\"‏ أَحَجَجْتَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ بِمَا أَهْلَلْتَ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ بِإِهْلاَلٍ كَإِهْلاَلِ النَّبِيِّ صلى الله عليه وسلم‏.‏ قَالَ ‏\"‏ أَحْسَنْتَ، انْطَلِقْ فَطُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ‏\"‏‏.‏ ثُمَّ أَتَيْتُ امْرَأَةً مِنْ نِسَاءِ بَنِي قَيْسٍ، فَفَلَتْ رَأْسِي، ثُمَّ أَهْلَلْتُ بِالْحَجِّ، فَكُنْتُ أُفْتِي بِهِ النَّاسَ، حَتَّى خِلاَفَةِ عُمَرَ ـ رضى الله عنه ـ فَذَكَرْتُهُ لَهُ‏.‏ فَقَالَ إِنْ نَأْخُذْ بِكِتَابِ اللَّهِ فَإِنَّهُ يَأْمُرُنَا بِالتَّمَامِ، وَإِنْ نَأْخُذْ بِسُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَحِلَّ حَتَّى بَلَغَ الْهَدْىُ مَحِلَّهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1655,
                "hadithNumber": "1725",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Hafsa رضی اللہ عنہا said, \"O Allah's Messenger (ﷺ)! What is wrong with the people; they finished their Ihram after performing `Umra, but you have not finished it after your `Umra?\" He replied, \"I matted my hair and have garlanded my Hadi. So, I cannot finish my Ihram till I slaughter (my Hadi). \"",
                "hadithUrdu": "حفصہ رضی اللہ عنہا نے عرض کی یا رسول اللہ صلی اللہ علیہ وسلم کیا وجہ ہوئی کہ اور لوگ تو عمرہ کر کے حلال ہو گئے اور آپ صلی اللہ علیہ وسلم نے عمرہ کر لیا اورحلال نہ ہوئے ؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اپنے سر کے بال جما لیے تھے اور قربانی کے گلے میں قلادہ پہنا کر میں ( اپنے ساتھ ) لایا ہوں ، اس لیے جب تک میں نحر نہ کر لوں گا میں احرام نہیں کھولوں گا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں نافع نے ، انہیں ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ ـ رضى الله عنهم ـ أَنَّهَا قَالَتْ يَا رَسُولَ اللَّهِ، مَا شَأْنُ النَّاسِ حَلُّوا بِعُمْرَةٍ وَلَمْ تَحْلِلْ أَنْتَ مِنْ عُمْرَتِكَ قَالَ ‏ \"‏ إِنِّي لَبَّدْتُ رَأْسِي، وَقَلَّدْتُ هَدْيِي، فَلاَ أَحِلُّ حَتَّى أَنْحَرَ ‏\"‏‏.‏",
                "headingArabic": "مَنْ لَبَّدَ رَأْسَهُ عِنْدَ الإِحْرَامِ وَحَلَقَ",
                "headingUrdu": "جس نے احرام باندھ کر اپنے سر کے بالوں کو جوڑا",
                "headingEnglish": "Whoever matted his head-hair on assuming Ihram",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1656,
                "hadithNumber": "1726",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) (got) his head shaved after performing his Hajj.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے حجۃ الوداع کے موقع پر اپنا سر منڈایا تھا ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب بن ابی حمزہ نے خبر دی ، ان سے نافع نے بیان کیا کہ ابن عمر رضی اللہ عنہما فرمایا کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ، قَالَ نَافِعٌ كَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ حَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَجَّتِهِ‏.‏",
                "headingArabic": "الْحَلْقِ وَالتَّقْصِيرِ عِنْدَ الإِحْلاَلِ",
                "headingUrdu": "احرام سے فارغ ہونے پر سر منڈوانا اور سر کے بال چھوٹے کرنا",
                "headingEnglish": "To shave the head and to have the head-hair cut short on finishing the Ihram",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1657,
                "hadithNumber": "1727",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"O Allah! Be merciful to those who have their head shaved.\" The people said, \"O Allah's Messenger (ﷺ)! And (invoke Allah for) those who get their hair cut short.\" The Prophet (ﷺ) said, \"O Allah! Be merciful to those who have their head shaved.\" The people said, \"O Allah's Messenger (ﷺ)! And those who get their hair cut short.\" The Prophet (ﷺ) said (the third time), \"And to those who get their hair cut short.\" Nafi` said that the Prophet (ﷺ) had said once or twice, \"O Allah! Be merciful to those who get their head shaved,\" and on the fourth time he added, \"And to those who have their hair cut short.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے دعا کی اے اللہ ! سر منڈوانے والوں پر رحم فرما ! صحابہ رضی اللہ عنہم نے عرض کی اور کتروانے والوں پر ؟ آنحضرت صلی اللہ علیہ وسلم نے اب بھی دعا کی اے اللہ سر منڈوانے والوں پر رحم فرما ! صحابہ رضی اللہ عنہم نے پھر عرض کی اور کتروانے والوں پر ؟ اب آپ صلی اللہ علیہ وسلم نے فرمایا اور کتروانے والوں پر بھی ، لیث نے کہا کہ مجھ سے نافع نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، اللہ نے سر منڈوانے والوں پر رحم کیا ایک یا دو مرتبہ ، انہوں نے بیان کیا کہ عبیداللہ نے کہا کہ مجھ سے نافع نے بیان کیا کہ چوتھی مرتبہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تھا کہ کتروانے والوں پر بھی ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں نافع نے ، انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ اللَّهُمَّ ارْحَمِ الْمُحَلِّقِينَ ‏\"‏‏.‏ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ اللَّهُمَّ ارْحَمِ الْمُحَلِّقِينَ ‏\"‏‏.‏ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَالْمُقَصِّرِينَ ‏\"‏‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي نَافِعٌ ‏\"‏ رَحِمَ اللَّهُ الْمُحَلِّقِينَ ‏\"‏ مَرَّةً أَوْ مَرَّتَيْنِ‏.‏ قَالَ وَقَالَ عُبَيْدُ اللَّهِ حَدَّثَنِي نَافِعٌ وَقَالَ فِي الرَّابِعَةِ ‏\"‏ وَالْمُقَصِّرِينَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1658,
                "hadithNumber": "1728",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"O Allah! Forgive those who get their heads shaved.\" The people asked. \"Also those who get their hair cut short?\" The Prophet (ﷺ) said, \"O Allah! Forgive those who have their heads shaved.\" The people said, \"Also those who get their hair cut short?\" The Prophet (invoke Allah for those who have their heads shaved and) at the third time said, \"also (forgive) those who get their hair cut short.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے دعا فرمائی اے اللہ ! سر منڈوانے والوں کی مغفرت فرما ! صحابہ رضی اللہ عنہم نے عرض کیا اور کتروانے والوں کے لیے بھی ( یہی دعا فرمائیے ) لیکن آنحضرت صلی اللہ علیہ وسلم نے اس مرتبہ بھی یہی فرمایا اے اللہ ! سر منڈوانے والوں کی مغفرت کر ۔ پھر صحابہ رضی اللہ عنہم نے عرض کیا اور کتروانے والوں کی بھی ! تیسری مرتبہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اور کتروانے والوں کی بھی مغفرت فرما ۔",
                "urduNarrator": "ہم سے عیاش بن ولید نے بیان کیا ، کہا ہم سے محمد بن فضیل نے بیان کیا ، ان سے عمارہ بن قعقاع نے بیان کیا ، ان سے ابوزرعہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا عُمَارَةُ بْنُ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ ‏\"‏‏.‏ قَالُوا وَلِلْمُقَصِّرِينَ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ ‏\"‏‏.‏ قَالُوا وَلِلْمُقَصِّرِينَ‏.‏ قَالَهَا ثَلاَثًا‏.‏ قَالَ ‏\"‏ وَلِلْمُقَصِّرِينَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1659,
                "hadithNumber": "1729",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) and some of his companions got their heads shaved and some others got their hair cut short.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم اور آپ صلی اللہ علیہ وسلم کے بہت سے اصحاب نے سر منڈوایا تھا لیکن بعض نے کتروایا بھی تھا ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد بن اسماء نے بیان کیا ، کہا ہم سے جویریہ بن اسماء نے ، ان سے نافع نے کہ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ، قَالَ حَلَقَ النَّبِيُّ صلى الله عليه وسلم وَطَائِفَةٌ مِنْ أَصْحَابِهِ، وَقَصَّرَ بَعْضُهُمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1660,
                "hadithNumber": "1730",
                "englishNarrator": "Narrated Muawiya  رضی اللہ عنہ :",
                "hadithEnglish": "I cut short the hair of Allah's Messenger (ﷺ) with a long blade.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے بال قینچی سے کاٹے تھے ۔",
                "urduNarrator": "ہم سے ابوعاصم نے بیان کیا ، ان سے ابن جریج نے بیان کیا ، ان سے حسن بن مسلم نے بیان کیا ، ان سے طاؤس نے بیان کیا ، ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما اور ان سے معاویہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ الْحَسَنِ بْنِ مُسْلِمٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مُعَاوِيَةَ ـ رضى الله عنهم ـ قَالَ قَصَّرْتُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِشْقَصٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1661,
                "hadithNumber": "1731",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When the Prophet (ﷺ) came to Mecca, he ordered his Companions to perform Tawaf round the Ka`ba and between Safa and Marwa, to finish their Ihram and get their hair shaved off or cut short.",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم مکہ میں تشریف لائے تو آپ صلی اللہ علیہ وسلم نے اپنے اصحاب کو یہ حکم دیا کہ بیت اللہ کا طواف اور صفا و مروہ کی سعی کرنے کے بعد احرام کھول دیں پھر سر منڈوا لیں یا بال کتروا لیں ۔",
                "urduNarrator": "ہم سے محمد بن ابی بکر نے بیان کیا ، ان سے فضیل بن سلیمان نے بیان کیا ، ان سے موسیٰ بن عقبہ نے ، انہیں کریب نے خبر دی ، ان سے ابن عباس رضی اللہ عنہما نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، أَخْبَرَنِي كُرَيْبٌ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ أَمَرَ أَصْحَابَهُ أَنْ يَطُوفُوا بِالْبَيْتِ، وَبِالصَّفَا وَالْمَرْوَةِ، ثُمَّ يَحِلُّوا، وَيَحْلِقُوا أَوْ يُقَصِّرُوا‏.‏",
                "headingArabic": "تَقْصِيرِ الْمُتَمَتِّعِ بَعْدَ الْعُمْرَةِ",
                "headingUrdu": "عمرہ کے بعد سر کے بال چھوٹے کرانا",
                "headingEnglish": "To get the head-hair cut short after 'Umra",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1662,
                "hadithNumber": "1732",
                "englishNarrator": "Narrated Nafi:",
                "hadithEnglish": "'Ibn 'Umar رضی اللہ عنہما performed only one Tawaf. He would take an afternoon nap and then return to Mina. That was on the day of Nahr (slaughtering). Abdur Razzaq has reported it from Obaidullah connected it to Allah's Apostle ﷺ.",
                "hadithUrdu": "ابن عمر رضی اللہ عنہما نے صرف ایک طواف الزیارۃ کیا پھر سویرے سے منیٰ کو آئے ، ان کی مراد دسویں تاریخ سے تھی ، عبدالرزاق نے اس حدیث کا رفع ( رسول اللہ صلی اللہ علیہ وسلم تک ) بھی کیا ہے ۔ انہیں عبیداللہ نے خبر دی ۔",
                "urduNarrator": "اور ہم سے ابونعیم نے بیان کیا ، ان سے سفیان نے بیان کیا ، ان سے عبیداللہ نے ، ان سے نافع نے کہ",
                "hadithArabic": "وَقَالَ لَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ طَافَ طَوَافًا وَاحِدًا، ثُمَّ يَقِيلُ ثُمَّ يَأْتِي مِنًى ـ يَعْنِي يَوْمَ النَّحْرِ ـ‏.‏ وَرَفَعَهُ عَبْدُ الرَّزَّاقِ أَخْبَرَنَا عُبَيْدُ اللَّهِ‏.‏",
                "headingArabic": "الزِّيَارَةِ يَوْمَ النَّحْرِ",
                "headingUrdu": "یومِ نحر کو طوافِ افاضہ کرنے کے لیے کعبہ کی زیارت",
                "headingEnglish": "The visit (of the Ka'bah) to perform (Tawaf-al-Ifada) on the Day of Nahr",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1663,
                "hadithNumber": "1733",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "We performed Hajj with the Prophet (ﷺ) and performed Tawaf-al-ifada on the Day of Nahr (slaughtering). Safiya got her menses and the Prophets desired from her what a husband desires from his wife. I said to him, \"O Allah's Messenger (ﷺ)! She is having her menses.\" He said, \"Is she going to detain us?\" We informed him that she had performed Tawaf-al-Ifada on the Day of Nahr He said: Then move on! Aswad has reported from Hadrat Aishah that Hadrat Sufiyah had performed the circumambulation of visit on the day of sacrifice.",
                "hadithUrdu": "ہم نے جب رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حج کیا تو دسویں تاریخ کو طواف الزیارۃ کیا لیکن صفیہ رضی اللہ عنہا حائضہ ہو گئیں پھر آنحضرت صلی اللہ علیہ وسلم نے ان سے وہی چاہا جو شوہر اپنی بیوی سے چاہتا ہے ، تو میں نے کہا یا رسول اللہ ! وہ حائضہ ہیں ، آپ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ اس نے تو ہمیں روک دیا پھر جب لوگوں نے کہا کہ یا رسول اللہ ! انہوں نے دسویں تاریخ کو طواف الزیارۃ کر لیا تھا ، آپ صلی اللہ علیہ وسلم نے فرمایا پھر چلے چلو ۔ قاسم ، عروہ اور اسود سے بواسطہ ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا روایت ہے کہ ام المؤمنین صفیہ رضی اللہ عنہا نے دسویں تاریخ کو طواف الزیارۃ کیا تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، ان سے لیث نے بیان کیا ، ان سے جعفر بن ربیعہ نے ، ان سے اعرج نے انھوں نے کہا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنِ الأَعْرَجِ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ حَجَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم فَأَفَضْنَا يَوْمَ النَّحْرِ، فَحَاضَتْ صَفِيَّةُ، فَأَرَادَ النَّبِيُّ صلى الله عليه وسلم مِنْهَا مَا يُرِيدُ الرَّجُلُ مِنْ أَهْلِهِ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهَا حَائِضٌ‏.‏ قَالَ ‏\"‏ حَابِسَتُنَا هِيَ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ، أَفَاضَتْ يَوْمَ النَّحْرِ‏.‏ قَالَ ‏\"‏ اخْرُجُوا ‏\"‏‏.‏ وَيُذْكَرُ عَنِ الْقَاسِمِ وَعُرْوَةَ وَالأَسْوَدِ عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَفَاضَتْ صَفِيَّةُ يَوْمَ النَّحْرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1664,
                "hadithNumber": "1734",
                "englishNarrator": "Narrated Ibn `Abbas  رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) was asked about the slaughtering, shaving (of the head), and the doing of Rami before or after the due times. He said, \"There is no harm in that.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سے قربانی کرنے ، سر منڈانے ، رمی جمار کرنے اور ان سے آگے پیچھے کرنے کے بارے میں دریافت کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ کوئی حرج نہیں ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، ان سے وہیب نے بیان کیا ، ان سے ابن طاؤس نے بیان کیا ، ان سے ان کے باپ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قِيلَ لَهُ فِي الذَّبْحِ وَالْحَلْقِ وَالرَّمْىِ وَالتَّقْدِيمِ وَالتَّأْخِيرِ فَقَالَ ‏ \"‏ لاَ حَرَجَ ‏\"‏‏.‏",
                "headingArabic": "إِذَا رَمَى بَعْدَ مَا أَمْسَى أَوْ حَلَقَ قَبْلَ أَنْ يَذْبَحَ نَاسِيًا أَوْ جَاهِلاً",
                "headingUrdu": "جمرہ کا رمی مغرب کے بعد یا ہدی کو ذبح کرنے سے پہلے سر منڈوانا",
                "headingEnglish": "Rami of the Jamra after Maghrib or head shaved before slaughtering the Hadi",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1665,
                "hadithNumber": "1735",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) was asked (as regards the ceremonies of Hajj) at Mina on the Day of Nahr and he replied that there was no harm. Then a man said to him, \"I got my head shaved before slaughtering.\" He replied, \"Slaughter (now) and there is no harm in it.\" (Another) man said, \"I did the Rami (of the Jimar) after midday.\" The Prophet (ﷺ) replied, \"There was no harm in it.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سے یوم نحر میں منیٰ میں مسائل پوچھے جاتے اور آپ صلی اللہ علیہ وسلم فرماتے جاتے کہ کوئی حرج نہیں ، ایک شخص نے پوچھا تھا کہ میں نے قربانی کرنے سے پہلے سر منڈا لیا ہے تو آپ نے اس کے جواب میں بھی یہی فرمایا کہ جاؤ قربانی کر لو کوئی حرج نہیں اور اس نے یہ بھی پوچھا کہ میں نے کنکریاں شام ہونے کے بعد ہی مار لی ہیں ، تو بھی آپ صلی اللہ علیہ وسلم نے فرمایا کہ کوئی حرج نہیں ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، ان سے یزید بن زریع نے بیان کیا ، ان سے خالد نے بیان کیا ، ان سے عکرمہ نے ، ان سے ابن عباس رضی اللہ عنہمانے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُسْأَلُ يَوْمَ النَّحْرِ بِمِنًى، فَيَقُولُ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏ فَسَأَلَهُ رَجُلٌ، فَقَالَ حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ‏.‏ قَالَ ‏\"‏ اذْبَحْ، وَلاَ حَرَجَ ‏\"‏‏.‏ وَقَالَ رَمَيْتُ بَعْدَ مَا أَمْسَيْتُ‏.‏ فَقَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1666,
                "hadithNumber": "1736",
                "englishNarrator": "Narrated `Abdullah bin `Amr رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) stopped (for a while near the Jimar at Mina) during his last Hajj and the people started asking him questions. A man said, \"Ignorantly I got my head shaved before slaughtering.\" The Prophet replied, \"Slaughter (now) and there is no harm in it.\" Another man said, \"Unknowingly I slaughtered the Hadi before doing the Rami.\" The Prophet (ﷺ) said, \"Do Rami now and there is no harm in it.\" So, on that day, when the Prophet (ﷺ) was asked about anything (about the ceremonies of Hajj) done before or after (its stated time) his reply was, \"Do it (now) and there is no harm.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم حجۃ الوداع کے موقع پر ( اپنی سواری ) پر بیٹھے ہوئے تھے اور لوگ آپ صلی اللہ علیہ وسلم سے مسائل معلوم کئے جا رہے تھے ۔ ایک شخص نے کہا حضور مجھ کو معلوم نہ تھا اور میں نے قربانی کرنے سے پہلے ہی سر منڈا لیا ، آپ صلی اللہ علیہ وسلم نے فرمایا اب قربانی کر لو کوئی حرج نہیں ، دوسرا شخص آیا اور بولا حضور مجھے خیال نہ رہا اور رمی جمار سے پہلے ہی میں نے قربانی کر دی ، آپ صلی اللہ علیہ وسلم نے فرمایا اب رمی کر لو کوئی حرج نہیں ، اس دن آپ صلی اللہ علیہ وسلم سے جس چیز کے آگے پیچھے کرنے کے متعلق سوال ہوا آپ صلی اللہ علیہ وسلم نے یہی فرمایا اب کر لو کوئی حرج نہیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں عیسیٰ بن طلحہ نے ، انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَقَفَ فِي حَجَّةِ الْوَدَاعِ، فَجَعَلُوا يَسْأَلُونَهُ، فَقَالَ رَجُلٌ لَمْ أَشْعُرْ فَحَلَقْتُ قَبْلَ أَنْ أَذْبَحَ‏.‏ قَالَ ‏\"‏ اذْبَحْ وَلاَ حَرَجَ ‏\"‏‏.‏ فَجَاءَ آخَرُ فَقَالَ لَمْ أَشْعُرْ فَنَحَرْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ ارْمِ وَلاَ حَرَجَ ‏\"‏‏.‏ فَمَا سُئِلَ يَوْمَئِذٍ عَنْ شَىْءٍ قُدِّمَ وَلاَ أُخِّرَ إِلاَّ قَالَ افْعَلْ وَلاَ حَرَجَ‏.‏",
                "headingArabic": "الْفُتْيَا عَلَى الدَّابَّةِ عِنْدَ الْجَمْرَةِ",
                "headingUrdu": "جانور کی سواری کے دوران مذہبی فیصلے دینا",
                "headingEnglish": "To give religious verdicts while riding an animal",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1667,
                "hadithNumber": "1737",
                "englishNarrator": "Narrated `Abdullah bin `Amr bin Al-`As رضی اللہ عنہما :",
                "hadithEnglish": "I witnessed the Prophet (ﷺ) when he was delivering the sermon on the Day of Nahr. A man stood up and said, \"I thought that such and such was to be done before such and such. I got my hair shaved before slaughtering.\" (Another said), \"I slaughtered the Hadi before doing the Rami.\" So, the people asked about many similar things. The Prophet (ﷺ) said, \"Do it (now) and there is no harm in all these cases.\" Whenever the Prophet (ﷺ) was asked about anything on that day, he replied, \"Do it (now) and there is no harm in it.\"",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم دسویں تاریخ کو منیٰ میں خطبہ دے رہے تھے تو وہ وہاں موجود تھے ۔ ایک شخص نے اس وقت کھڑے ہو کر پوچھا کہ میں اس خیال میں تھا کہ فلاں کام فلاں سے پہلے ہے پھر دوسرا کھڑا ہوا اور کہا کہ میرا خیال تھا کہ فلاں کام فلاں سے پہلے ہے ، چنانچہ میں نے قربانی سے پہلے سر منڈالیا ، رمی جمار سے پہلے قربانی کر لی ، اور مجھے اس میں شک ہوا ۔ تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا اب کر لو ۔ ان سب میں کوئی حرج نہیں ۔ اسی طرح کے دوسرے سوالات بھی آپ صلی اللہ علیہ وسلم سے کئے گئے آپ صلی اللہ علیہ وسلم نے ان سب کے جواب میں یہی فرمایا کہ کوئی حرج نہیں اب کر لو ۔",
                "urduNarrator": "ہم سے سعید بن یحییٰ بن سعید نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، ان سے ابن جریج نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے عیسیٰ بن طلحہ نے اور ان سے عبداللہ بن عمرو بن العاص رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا ابْنُ جُرَيْجٍ، حَدَّثَنِي الزُّهْرِيُّ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ ـ رضى الله عنه ـ حَدَّثَهُ أَنَّهُ، شَهِدَ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ يَوْمَ النَّحْرِ، فَقَامَ إِلَيْهِ رَجُلٌ، فَقَالَ كُنْتُ أَحْسِبُ أَنَّ كَذَا قَبْلَ كَذَا‏.‏ ثُمَّ قَامَ آخَرُ فَقَالَ كُنْتُ أَحْسِبُ أَنَّ كَذَا قَبْلَ كَذَا حَلَقْتُ قَبْلَ أَنْ أَنْحَرَ، نَحَرْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ وَأَشْبَاهَ ذَلِكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ افْعَلْ وَلاَ حَرَجَ ‏\"‏‏.‏ لَهُنَّ كُلِّهِنَّ، فَمَا سُئِلَ يَوْمَئِذٍ عَنْ شَىْءٍ إِلاَّ قَالَ افْعَلْ وَلاَ حَرَجَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1668,
                "hadithNumber": "1738",
                "englishNarrator": "Narrated `Abdullah bin `Amr bin Al-`As رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) stopped while on his she-camel (the sub-narrator then narrated the Hadith as above, i.e. 793). Mamar corroborated him from Zuhri.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنے سواری پر سوا رہو کر ٹھہرے رہے پھر پوری حدیث بیان کی ۔ اس کی متابعت معمر نے زہری سے روایت کر کے کی ہے ۔",
                "urduNarrator": "ہم سے اسحاق نے بیان کیا ، کہا کہ ہمیں یعقوب بن ابراہیم نے خبر دی ، ان سے میرے والد نے بیان کیا ، ان سے صالح نے ، ان سے ابن شہاب نے اور ان سے عیسیٰ بن طلحہ بن عبیداللہ نے بیان کیا ، انہوں نے عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے سنا انہوں نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، قَالَ أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عِيسَى بْنُ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ ـ رضى الله عنهما ـ قَالَ وَقَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى نَاقَتِهِ‏.‏ فَذَكَرَ الْحَدِيثَ‏.‏ تَابَعَهُ مَعْمَرٌ عَنِ الزُّهْرِيِّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1669,
                "hadithNumber": "1739",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما:",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) delivered a sermon on the Day of Nahr, and said, 'O people! (Tell me) what is the day today?' The people replied, 'It is the forbidden (sacred) day.' He asked again, 'What town is this?' They replied, 'It is the forbidden (Sacred) town.' He asked, 'Which month is this?' They replied, 'It is the forbidden (Sacred) month.' He said, 'No doubt! Your blood, your properties, and your honor are sacred to one another like the sanctity of this day of yours, in this (sacred) town (Mecca) of yours, in this month of yours.' The Prophet (ﷺ) repeated his statement again and again. After that he raised his head and said, 'O Allah! Haven't conveyed (Your Message) to them'. Haven't I conveyed Your Message to them?' \" Ibn `Abbas added, \"By Him in Whose Hand my soul is, the following was his will (Prophet's will) to his followers:--It is incumbent upon those who are present to convey this information to those who are absent Beware don't renegade (as) disbelievers (turn into infidels) after me, Striking the necks (cutting the throats) of one another.' \"",
                "hadithUrdu": "دسویں تاریخ کو رسول کریم صلی اللہ علیہ وسلم نے منیٰ میں خطبہ دیا ، خطبہ میں آپ صلی اللہ علیہ وسلم نے پوچھا لوگو ! آج کون سا دن ہے ؟ لوگ بولے یہ حرمت کا دن ہے ، آپ صلی اللہ علیہ وسلم نے پھر پوچھا اور یہ شہر کون سا ہے ؟ لوگوں نے کہا یہ حرمت کا شہر ہے ، آپ صلی اللہ عیہ وسلم نے پوچھا یہ مہینہ کون سا ہے ؟ لوگوں نے کہا یہ حرمت کا مہینہ ہے ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا بس تمہارا خون تمہارے مال اور تمہاری عزت ایک دوسرے پر اسی طرح حرام ہے جیسے اس دن کی حرمت ، اس شہر اور اس مہینہ کی حرمت ہے ، اس کلمہ کو آپ صلی اللہ علیہ وسلم نے کئی بار دہرایا اور پھر آسمان کی طرف سر اٹھا کر کہا اے اللہ ! کیا میں نے ( تیرا پیغام ) پہنچا دیا اے اللہ ! کیا میں نے پہنچا دیا ۔ حضرت عبداللہ بن عباس رضی اللہ عنہما نے بتلایا کہ اس ذا ت کی قسم ! جس کے ہاتھ میں میری جان ہے آنحضرت صلی اللہ علیہ وسلم کی یہ وصیت اپنی تمام امت کے لیے ہے ، لہٰذا حاضر ( اور جاننے والے ) غائب ( اور ناواقف لوگوں کو اللہ کا پیغام ) پہنچا دیں ۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا دیکھو میرے بعد ایک دوسرے کی گردن مار کر کافر نہ بن جانا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا مجھ سے یحییٰ بن سعید نے بیان کیا ، ان سے فضل بن غزوان نے بیان کیا ، ان سے عکرمہ نے بیان کیا اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا فُضَيْلُ بْنُ غَزْوَانَ، حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَطَبَ النَّاسَ يَوْمَ النَّحْرِ فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ‏.‏ أَىُّ يَوْمٍ هَذَا ‏\"‏‏.‏ قَالُوا يَوْمٌ حَرَامٌ‏.‏ قَالَ ‏\"‏ فَأَىُّ بَلَدٍ هَذَا ‏\"‏‏.‏ قَالُوا بَلَدٌ حَرَامٌ‏.‏ قَالَ ‏\"‏ فَأَىُّ شَهْرٍ هَذَا ‏\"‏‏.‏ قَالُوا شَهْرٌ حَرَامٌ‏.‏ قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ عَلَيْكُمْ حَرَامٌ، كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا ‏\"‏‏.‏ فَأَعَادَهَا مِرَارًا، ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ ‏\"‏ اللَّهُمَّ هَلْ بَلَّغْتُ اللَّهُمَّ هَلْ بَلَّغْتُ ‏\"‏‏.‏ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ فَوَالَّذِي نَفْسِي بِيَدِهِ إِنَّهَا لَوَصِيَّتُهُ إِلَى أُمَّتِهِ ـ ‏\"‏ فَلْيُبْلِغِ الشَّاهِدُ الْغَائِبَ، لاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏",
                "headingArabic": "الْخُطْبَةِ أَيَّامَ مِنًى",
                "headingUrdu": "ایام منیٰ میں الخطبہ",
                "headingEnglish": "Al-Khutba during the Days of Mina",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1670,
                "hadithNumber": "1740",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "I heard the Prophet (ﷺ) delivering a sermon at `Arafat. Ibn-e-Oyainah corroborated him from Amr.",
                "hadithUrdu": "میدان عرفات میں رسول کریم صلی اللہ علیہ وسلم کا خطبہ میں نے خود سنا تھا ۔ اس کی متابعت ابن عیینہ نے عمرو سے کی ہے ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، ہم سے شعبہ نے بیان کیا ، کہا کہ مجھے عمرو نے خبر دی ، کہا کہ میں نے جابر بن زید سے سنا ، انہوں نے کہا کہ میں نے ابن عباس رضی اللہ عنہما سے سنا ، آپ رضی اللہ عنہما نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَمْرٌو، قَالَ سَمِعْتُ جَابِرَ بْنَ زَيْدٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ بِعَرَفَاتٍ‏.‏ تَابَعَهُ ابْنُ عُيَيْنَةَ عَنْ عَمْرٍو‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1671,
                "hadithNumber": "1741",
                "englishNarrator": "Narrated Abu Bakra  رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) delivered to us a sermon on the Day of Nahr. He said, \"Do you know what is the day today?\" We said, \"Allah and His Apostle know better.\" He remained silent till we thought that he might give that day another name. He said, \"Isn't it the Day of Nahr?\" We said, \"It is.\" He further asked, \"Which month is this?\" We said, \"Allah and His Apostle know better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn't it the month of Dhul-Hijja?\" We replied: \"Yes! It is.\" He further asked, \"What town is this?\" We replied, \"Allah and His Apostle know it better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn't it the forbidden (Sacred) town (of Mecca)?\" We said, \"Yes. It is.\" He said, \"No doubt, your blood and your properties are sacred to one another like the sanctity of this day of yours, in this month of yours, in this town of yours, till the day you meet your Lord. No doubt! Haven't I conveyed Allah's message to you? They said, \"Yes.\" He said, \"O Allah! Be witness. So it is incumbent upon those who are present to convey it (this information) to those who are absent because the informed one might comprehend it (what I have said) better than the present audience, who will convey it to him. Beware! Do not renegade (as) disbelievers after me by striking the necks (cutting the throats) of one another.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے دسویں تاریخ کو منیٰ میں خطبہ سنایا ، آپ صلی اللہ علیہ وسلم نے پوچھا لوگو ! معلوم ہے آج یہ کون سا دن ہے ؟ ہم نے عرض کی اللہ اور اس کا رسول زیادہ جانتے ہیں ، آپ صلی اللہ علیہ وسلم اس پر خاموش ہو گئے اور ہم نے سمجھا کہ آپ صلی اللہ علیہ وسلم اس دن کا کوئی اور نام رکھیں گے لیکن آپ صلی اللہ علیہ وسلم نے فرمایا : کیا یہ قربانی کا دن نہیں ۔ ہم بولے ہاں ضرور ہے ، پھر آپ صلی اللہ علیہ وسلم نے پوچھا یہ مہینہ کون سا ہے ؟ ہم نے کہا اللہ اور اس کے رسول زیادہ جانتے لیے ۔ آپ اس مرتبہ بھی خاموش ہو گئے اور ہمیں خیال ہوا کہ آپ صلی اللہ علیہ وسلم اس مہینہ کا نام کوئی اور نام رکھیں گے ، لیکن آپ نے فرمایا کیا یہ ذی الحجہ کا مہینہ نہیں ہے ؟ ہم بولے کیوں نہیں ، پھر آپ صلی اللہ علیہ وسلم نے پوچھا یہ شہر کون سا ہے ؟ ہم نے عرض کی اللہ اور اس کے رسول بہتر جانتے ہیں ، اس مرتبہ بھی آپ صلی اللہ علیہ وسلم اس طرح خاموش ہو گئے کہ ہم نے سمجھا کہ آپ صلی اللہ علیہ وسلم اس کا کوئی اور نام رکھیں گے ، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ حرمت کا شہر نہیں ہے ؟ ہم نے عرض کی کیوں نہیں ضرور ہے ، اس کے بعد آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا بس تمہارا خون اور تمہارے مال تم پر اسی طرح حرام ہیں جیسے اس دن کی حرمت اس مہینہ اور اس شہر میں ہے ، تاآنکہ تم اپنے رب سے جاملو ۔ کہو کیا میں نے تم کو اللہ کا پیغام پہنچا دیا ؟ لوگوں نے کہا کہ ہاں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا اے اللہ ! تو گواہ رہنا اور ہاں ! یہاں موجود غائب کو پہنچا دیں کیونکہ بہت سے لوگ جن تک یہ پیغام پہنچے گا سننے والوں سے زیادہ ( پیغام کو ) یاد رکھنے والے ثابت ہوں گے اور میرے بعد کافر نہ بن جانا کہ ایک دوسرے کی ( ناحق ) گردنیں مارنے لگو ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے ابوعامر نے بیان کیا ، ان سے قرہ نے بیان کیا ، ان سے محمد بن سیرین نے کہا کہ مجھے عبدالرحمٰن بن ابی بکرہ نے اور ایک اور شخص نے جو میرے نزدیک عبدالرحمٰن سے بھی افضل ہے یعنی حمید بن عبدالرحمٰن نے خبر دی کہ ابوبکر رضی اللہ عنہ نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا قُرَّةُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، عَنْ أَبِي بَكْرَةَ،، وَرَجُلٌ، أَفْضَلُ فِي نَفْسِي مِنْ عَبْدِ الرَّحْمَنِ حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ قَالَ خَطَبَنَا النَّبِيُّ صلى الله عليه وسلم يَوْمَ النَّحْرِ، قَالَ ‏\"‏ أَتَدْرُونَ أَىُّ يَوْمٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ أَىُّ شَهْرٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ فَقَالَ ‏\"‏ أَلَيْسَ ذُو الْحَجَّةِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ أَىُّ بَلَدٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَتْ بِالْبَلْدَةِ الْحَرَامِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ عَلَيْكُمْ حَرَامٌ، كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا، إِلَى يَوْمِ تَلْقَوْنَ رَبَّكُمْ‏.‏ أَلاَ هَلْ بَلَّغْتُ ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اشْهَدْ، فَلْيُبَلِّغِ الشَّاهِدُ الْغَائِبَ، فَرُبَّ مُبَلَّغٍ أَوْعَى مِنْ سَامِعٍ، فَلاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1672,
                "hadithNumber": "1742",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "At Mina, the Prophet (ﷺ) said, \"Do you know what is the day today?\" The people replied, \"Allah and His Apostle know it better.\" He said, \"It is the forbidden (sacred) day. And do you know what town is this?\" They replied, \"Allah and His Apostle know it better.\" He said, \"This is the forbidden (Sacred) town (Mecca). And do you know which month is this?\" The people replied, \"Allah and His Apostle know it better.\" He said, \"This is the forbidden (sacred) month.\" The Prophet (ﷺ) added, \"No doubt, Allah made your blood, your properties, and your honor sacred to one another like the sanctity of this day of yours in this month of yours in this town of yours.\" Narrated Ibn `Umar: On the Day of Nahr (10th of Dhul-Hijja), the Prophet (ﷺ) stood in between the Jamrat during his Hajj which he performed (as in the previous Hadith) and said, \"This is the greatest Day (i.e. 10th of Dhul-Hijjah).\" The Prophet (ﷺ) started saying repeatedly, \"O Allah! Be Witness (I have conveyed Your Message).\" He then bade the people farewell. The people said, \"This is Hajjat-al-Wada`).\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے منیٰ میں فرمایا کہ تم کو معلوم ہے ! آج کون سا دن ہے ؟ لوگوں نے کہا کہ اللہ اور اس کے رسول زیادہ جانتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ حرمت کا دن ہے اور یہ بھی تم کو معلوم ہے کہ یہ کون سا شہر ہے ؟ لوگوں نے کہا اللہ اور اس کے رسول زیادہ جانتے ہیں ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ حرمت کا شہر ہے اور تم کو یہ بھی معلوم ہے کہ یہ کون سا مہینہ ہے ، لوگوں نے کہا اللہ اور اس کے رسول زیادہ جانتے ہیں ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ حرمت کا مہینہ ہے پھر فرمایا کہ اللہ تعالیٰ نے تمہارا خون ! تمہارا مال اور عزت ایک دوسرے پر ( ناحق ) اس طرح حرام کر دی ہیں جیسے اس دن کی حرمت اس مہینہ اور اس شہر میں ہے ۔ ہشام بن غاز نے کہا کہ مجھے نافع نے ابن عمر رضی اللہ عنہما کے حوالے سے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم حجۃ الوداع میں دسویں تاریخ کو جمرات کے درمیان کھڑے ہوئے تھے اور فرمایا تھا کہ دیکھو ! یہ ( «يوم النحر» ) حج اکبر کا دن ہے ، پھر نبی کریم صلی اللہ علیہ وسلم یہ فرمانے لگے کہ اے اللہ ! گواہ رہنا ، آنحضرت صلی اللہ علیہ وسلم نے اس موقع پر چونکہ لوگوں کو رخصت کیا تھا ۔ ( آپ سمجھ گئے کہ وفات کا زمانہ آن پہنچا ) جب سے لوگ اس حج کو حجۃ الوداع کہنے لگے ۔",
                "urduNarrator": "ہم سے محمد بن مثنی نے بیان کیا ، کہا ہم سے یزید بن ہارون نے بیان کیا ، کہا ہم کو عاصم بن محمد بن زید نے خبر دی ، انہیں ان کے باپ نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَاصِمُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم بِمِنًى ‏\"‏ أَتَدْرُونَ أَىُّ يَوْمٍ هَذَا ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَقَالَ ‏\"‏ فَإِنَّ هَذَا يَوْمٌ حَرَامٌ، أَفَتَدْرُونَ أَىُّ بَلَدٍ هَذَا ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ بَلَدٌ حَرَامٌ، أَفَتَدْرُونَ أَىُّ شَهْرٍ هَذَا ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ شَهْرٌ حَرَامٌ ـ قَالَ ـ فَإِنَّ اللَّهَ حَرَّمَ عَلَيْكُمْ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ، كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا ‏\"‏‏.‏ وَقَالَ هِشَامُ بْنُ الْغَازِ أَخْبَرَنِي نَافِعٌ عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ وَقَفَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ النَّحْرِ بَيْنَ الْجَمَرَاتِ فِي الْحَجَّةِ الَّتِي حَجَّ بِهَذَا، وَقَالَ ‏\"‏ هَذَا يَوْمُ الْحَجِّ الأَكْبَرِ ‏\"‏، فَطَفِقَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏\"‏ اللَّهُمَّ اشْهَدْ ‏\"‏‏.‏ وَوَدَّعَ النَّاسَ‏.‏ فَقَالُوا هَذِهِ حَجَّةُ الْوَدَاعِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1673,
                "hadithNumber": "1743",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) accorded the permission.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اجازت دی ۔",
                "urduNarrator": "ہم سے محمد بن عبید بن میمون نے بیان کیا ، انہوں نے کہا کہ ہم سے عیسیٰ بن یونس نے ، ان سے عبیداللہ نے ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ رَخَّصَ النَّبِيُّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "هَلْ يَبِيتُ أَصْحَابُ السِّقَايَةِ أَوْ غَيْرُهُمْ بِمَكَّةَ لَيَالِيَ مِنًى",
                "headingUrdu": "کیا حاجیوں کو پانی مہیا کرنے والے منیٰ کی راتوں میں مکہ میں رہ سکتے ہیں؟",
                "headingEnglish": "May those who provide the pilgrims with water stay at Makkah during the nights of Mina?",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1674,
                "hadithNumber": "1744",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "That the Prophet (ﷺ) granted the permission.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اجازت دی ۔",
                "urduNarrator": "( دوسری سند ) اور ہم سے یحییٰ بن موسیٰ نے بیان کیا ، کہا ہم سے محمد بن بکر نے بیان کیا ، کہا ہم کو ابن جریج نے خبر دی ، انہیں عبیداللہ نے ، انہیں نافع نے اور انہیں ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَذِنَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1675,
                "hadithNumber": "1745",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Al-Abbas رضی اللہ عنہ asked the permission from the Prophet (ﷺ) to stay at Mecca during the nights of Mina in order to provide water to the people, so the Prophet (ﷺ) allowed him. Abu Osamah, Uqbah bin Khalid and Abu Damrah corroborated him.",
                "hadithUrdu": "عباس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے منیٰ کی راتوں میں ( حاجیوں ) کو پانی پلانے کے لیے مکہ میں رہنے کی اجازت چاہی تو آپ صلی اللہ علیہ وسلم نے ان کو اجازت دے دی ۔ اس روایت کی متابعت محمد بن عبداللہ کے ساتھ ابواسامہ عقبہ بن خالد اور ابوضمرہ نے کی ہے ۔",
                "urduNarrator": "اور ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا ، ان سے ان کے باپ نے بیان کیا ، ان سے عبیداللہ نے بیان کیا ، کہا کہ مجھ سے نافع نے بیان کیا اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ الْعَبَّاسَ ـ رضى الله عنه ـ اسْتَأْذَنَ النَّبِيَّ صلى الله عليه وسلم لِيَبِيتَ بِمَكَّةَ لَيَالِيَ مِنًى، مِنْ أَجْلِ سِقَايَتِهِ، فَأَذِنَ لَهُ‏.‏ تَابَعَهُ أَبُو أُسَامَةَ وَعُقْبَةُ بْنُ خَالِدٍ وَأَبُو ضَمْرَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1676,
                "hadithNumber": "1746",
                "englishNarrator": "Narrated Wabra:",
                "hadithEnglish": "I asked Ibn `Umar رضی اللہ عنہما , \"When should I do the Rami of the Jimar?\" He replied, \"When your leader does that.\" I asked him again the same question. He replied, \"We used to wait till the sun declined and then we would do the Rami (i.e. on the 11th and 12th of Dhul-Hijja).\"",
                "hadithUrdu": "حضرت عبداللہ بن عمر رضی اللہ عنہما سے پوچھا کہ میں کنکریاں کس وقت ماروں ؟ تو آپ نے فرمایا کہ جب تمہارا امام مارے تو تم بھی مارو ، لیکن دوبارہ میں نے ان سے یہی مسئلہ پوچھا تو انہوں نے فرمایا کہ ہم انتظار کرتے رہتے اور جب سورج ڈھل جاتا تو کنکریاں مارتے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا ہم سے مسعر نے بیان کیا ، ان سے وبرہ نے کہ میں نے",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا مِسْعَرٌ، عَنْ وَبَرَةَ، قَالَ سَأَلْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ مَتَى أَرْمِي الْجِمَارَ قَالَ إِذَا رَمَى إِمَامُكَ فَارْمِهْ‏.‏ فَأَعَدْتُ عَلَيْهِ الْمَسْأَلَةَ، قَالَ كُنَّا نَتَحَيَّنُ، فَإِذَا زَالَتِ الشَّمْسُ رَمَيْنَا‏.‏",
                "headingArabic": "رَمْىِ الْجِمَارِ",
                "headingUrdu": "جمار کی رمی کرنا",
                "headingEnglish": "To do the Rami of the Jimar",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1651,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=66",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=64",
                "label": "64",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=65",
                "label": "65",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=66",
                "label": "66",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=67",
                "label": "67",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=68",
                "label": "68",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=69",
                "label": "69",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=70",
                "label": "70",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=68",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=68",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=66",
        "to": 1675,
        "total": 40465
    }
}