{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 135,
        "data": [
            {
                "id": 3353,
                "hadithNumber": "3513",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "While Allah's Messenger (ﷺ) was on the pulpit, he said, \"May Allah forgive the tribe of Ghifar! And may Allah save the tribe of Aslam! The tribe of `Usaiya have disobeyed Allah and His Apostle.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے منبر پر فرمایا ، قبیلہ غفار کی اللہ تعالیٰ نے مغفرت فرما دی اور قبیلہ اسلم کو اللہ تعالیٰ نے سلامت رکھا اور قبیلہ عصیہ نے اللہ تعالیٰ کی اور اس کے رسول کی نافرمانی کی ۔",
                "urduNarrator": "ہم سے محمد بن غریر زہری نے بیان کیا ، انہوں نے کہا ہم سے یعقوب بن ابراہیم نے بیان کیا ، ان سے ان کے والد نے ، ان سے صالح نے ، ان سے نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ غُرَيْرٍ الزُّهْرِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، عَنْ أَبِيهِ، عَنْ صَالِحٍ، حَدَّثَنَا نَافِعٌ، أَنَّ عَبْدَ اللَّهِ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ عَلَى الْمِنْبَرِ ‏ \"‏ غِفَارُ غَفَرَ اللَّهُ لَهَا، وَأَسْلَمُ سَالَمَهَا اللَّهُ، وَعُصَيَّةُ عَصَتِ اللَّهَ وَرَسُولَهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3354,
                "hadithNumber": "3514",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"May Allah save the tribe of Aslam, and may Allah forgive the tribe of Ghifar!\"",
                "hadithUrdu": "قبیلہ اسلم کو اللہ تعالیٰ نے سلامت رکھا اور قبیلہ غفار کی اللہ تعالیٰ نے مغفرت فرما دی ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو عبدالوہاب ثقفی نے خبر دی ، انہیں ایوب نے ، انہیں محمد نے ، انہیں ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَسْلَمُ سَالَمَهَا اللَّهُ، وَغِفَارُ غَفَرَ اللَّهُ لَهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3355,
                "hadithNumber": "3515",
                "englishNarrator": "Narrated Abu Bakra رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Do you think that the tribes of Juhaina, Muzaina, Aslam and Ghifar are better than the tribes of Bani Tamim, Bani Asad, Bani `Abdullah bin Ghatafan and Bani Amir bin Sasaa?\" A man said, \"They were unsuccessful and losers.\" The Prophet (ﷺ) added, \"(Yes), they are better than the tribes of Bani Tamim, Bani Asad, Bani `Abdullah bin Ghatafan and Bani Amir bin Sasaa.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا بتاو کیا جہینہ ، مزینہ ، اسلم اور غفار کے قبیلے بنی تمیم ، بنی اسد ، بنی عبداللہ بن غطفان اور بنی عامر بن صعصعہ کے مقابلے میں بہتر ہیں ؟ ایک شخص ( اقرع بن حابس ) نے کہا کہ وہ تو تباہ و برباد ہوئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں یہ چاروں قبیلے بنوتمیم ، بنو اسد ، بنو عبداللہ بن غطفان اور بنو عامر بن صعصعہ کے قبیلوں سے بہتر ہیں ۔",
                "urduNarrator": "ہم سے قبیصہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ( دوسری سند ) امام بخاری رحمہ اللہ نے کہا اور مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ، ان سے سفیان نے ، ان سے عبدالملک بن عمیرنے ، ان سے عبدالرحمٰن بن ابی بکرہ نے اور ان سے ان کے والد ابوبکرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ،‏.‏ حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَرَأَيْتُمْ إِنْ كَانَ جُهَيْنَةُ وَمُزَيْنَةُ وَأَسْلَمُ وَغِفَارُ خَيْرًا مِنْ بَنِي تَمِيمٍ وَبَنِي أَسَدٍ، وَمِنْ بَنِي عَبْدِ اللَّهِ بْنِ غَطَفَانَ وَمِنْ بَنِي عَامِرِ بْنِ صَعْصَعَةَ ‏\"‏‏.‏ فَقَالَ رَجُلٌ خَابُوا وَخَسِرُوا‏.‏ فَقَالَ ‏\"‏ هُمْ خَيْرٌ مِنْ بَنِي تَمِيمٍ وَمِنْ بَنِي أَسَدٍ، وَمِنْ بَنِي عَبْدِ اللَّهِ بْنِ غَطَفَانَ، وَمِنْ بَنِي عَامِرِ بْنِ صَعْصَعَةَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3356,
                "hadithNumber": "3516",
                "englishNarrator": "Narrated Abu Bakra:",
                "hadithEnglish": "Al-Aqra' bin Habis رضی اللہ عنہ said to the Prophet (ﷺ) \"Nobody gave you the pledge of allegiance but the robbers of the pilgrims (i.e. those who used to rob the pilgrims) from the tribes of Aslam, Ghifar, Muzaina.\" (Ibn Abi Ya'qub is in doubt whether Al-Aqra' added. 'And Juhaina.') The Prophet (ﷺ) said, \"Don't you think that the tribes of Aslam, Ghifar, Muzaina (and also perhaps) Juhaina are better than the tribes of Bani Tamim, Bani Amir, Asad, and Ghatafan?\" Somebody said, \"They were unsuccessful and losers!\" The Prophet said, \"Yes, by Him in Whose Hands my life is, they (i.e. the former) are better than they (i.e. the latter).",
                "hadithUrdu": "اقرع بن حابس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے عرض کیا کہ آپ سے ان لوگوں نے بیعت کی ہے کہ جو حاجیوں کا سامان چرایا کرتے تھے یعنی اسلم اور غفار اور مزینہ کے لوگ ، محمد بن ابی یعقوب نے کہا کہ میں سمجھتا ہوں عبدالرحمٰن نے جہینہ کا بھی ذکر کیا ، شعبہ نے کہا کہ یہ شک محمد بن ابی یعقوب کو ہوا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا : بتلاو اسلم ، غفار ، مزینہ ، اور میں سمجھتا ہوں کہ جہینہ کو بھی کہا یہ چاروں قبیلے بنی تمیم ، بنی عامر اور اسد اور غطفان سے بہتر نہیں ہیں ؟ کیا یہ ( مؤخرالذکر ) خراب اور برباد نہیں ہوئے ؟ اقرع نے کہا : ہاں ، آپ نے فرمایا : قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے ! یہ ان سے بہتر ہیں ۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے محمد بن ابی یعقوب نے بیان کیا ، انہوں نے عبدالرحمٰن بن ابی بکرہ سے سنا ، انہوں نے اپنے والد سے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ أَبِي يَعْقُوبَ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، أَنَّ الأَقْرَعَ بْنَ حَابِسٍ، قَالَ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّمَا بَايَعَكَ سُرَّاقُ الْحَجِيجِ مِنْ أَسْلَمَ وَغِفَارَ وَمُزَيْنَةَ ـ وَأَحْسِبُهُ وَجُهَيْنَةَ ابْنُ أَبِي يَعْقُوبَ شَكَّ ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَرَأَيْتَ إِنْ كَانَ أَسْلَمُ وَغِفَارُ وَمُزَيْنَةُ ـ وَأَحْسِبُهُ ـ وَجُهَيْنَةُ خَيْرًا مِنْ بَنِي تَمِيمٍ وَبَنِي عَامِرٍ وَأَسَدٍ وَغَطَفَانَ، خَابُوا وَخَسِرُوا ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ، إِنَّهُمْ لَخَيْرٌ مِنْهُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3357,
                "hadithNumber": "3517",
                "englishNarrator": "Narrated Abu Hurairah رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The hour will not be established unless a man from the tribe of Qahtan appears, driving the people with his stick (ruling them with violence and oppression).\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، کہ قیامت اس وقت تک قائم نہیں ہو گی جب تک کہ قبیلہ قحطان میں ایک ایسا شخص پیدا نہیں ہو گا جو لوگوں پر اپنی لاٹھی کے زور سے حکومت کرے گا ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، کہا کہ مجھ سے سلیمان بن بلال نے بیان کیا ، ان سے ثور بن زید نے ، ان سے ابولغیث نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَخْرُجَ رَجُلٌ مِنْ قَحْطَانَ يَسُوقُ النَّاسَ بِعَصَاهُ ‏\"‏‏.‏",
                "headingArabic": "ذِكْرِ قَحْطَانَ",
                "headingUrdu": "قحطان قبیلہ کا ذکر",
                "headingEnglish": "The mention of the Qahtan tribe",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3358,
                "hadithNumber": "3518",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "We were in the company of the Prophet (ﷺ) in a Ghazwa. A large number of emigrants joined him and among the emigrants there was a person who used to play jokes (or play with spears); so he (jokingly) stroked an Ansari man on the hip. The Ans-ari got so angry that both of them called their people. The Ansari said, \"Help, O Ansar!\" And the emigrant said \"Help, O emigrants!\" The Prophet (ﷺ) came out and said, \"What is wrong with the people (as they are calling) this call of the period of Ignorance? \"Then he said, \"What is the matter with them?\" So he was told about the stroke of the emigrant to the Ansari. The Prophet (ﷺ) said, \"Stop this (i.e. appeal for help) for it is an evil call. \"Abdullah bin Ubai bin Salul (a hypocrite) said, \"The emigrants have called and (gathered against us); so when we return to Medina, surely, the more honorable people will expel therefrom the meaner,\" Upon that `Umar رضی اللہ عنہ said, \"O Allah's Prophet! Shall we not kill this evil person (i.e. `Abdullah bin Ubai bin Salul) ?\" The Prophet) said, \"(No), lest the people should say that Muhammad used to kill his companions.\"",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ جہاد میں شریک تھے ، مہاجرین بڑی تعداد میں آپ کے پاس جمع ہو گئے ۔ وجہ یہ ہوئی کہ مہاجرین میں ایک صاحب تھے بڑے دل لگی کرنے والے ، انہوں نے ایک انصاری کے سرین پر ضرب لگائی ، انصاری بہت سخت غصہ ہوا ، اس نے اپنی برادری والوں کو مدد کے لیے پکارا اور نوبت یہاں تک پہنچی کہ ان لوگوں نے یعنی انصاری نے کہا : اے قبائل انصار ! مدد کو پہنچو ! اور مہاجر نے کہا : اے مہاجرین ! مدد کو پہنچو ! یہ غل سن کر نبی کریم صلی اللہ علیہ وسلم ( خیمہ سے ) باہر تشریف لائے اور فرمایا : کیا بات ہے ؟ یہ جاہلیت کی پکار کیسی ہے ؟ آپ کے صورت حال دریافت کرنے پر مہاجر صحابی کے انصاری صحابی کو مار دینے کا واقعہ بیان کیا گیا تو آپ نے فرمایا : ایسی جاہلیت کی ناپاک باتیں چھوڑ دو اور عبداللہ بن ابی سلول ( منافق ) نے کہا کہ یہ مہاجرین اب ہمارے خلاف اپنی قوم والوں کی دہائی دینے لگے ۔ مدینہ پہنچ کر ہم سمجھ لیں گے ، عزت دار ذلیل کو یقیناً نکال باہر کر دے گا ۔ حضرت عمر رضی اللہ عنہ نے اجازت چاہی یا رسول اللہ صلی اللہ علیہ وسلم ! ہم اس ناپاک پلید عبداللہ بن ابی کو قتل کیوں نہ کر دیں ؟ لیکن آپ نے فرمایا : ایسا نہ ہونا چاہیے کہ لوگ کہیں کہ محمد ( صلی اللہ علیہ وسلم ) اپنے لوگوں کو قتل کر دیا کرتے ہیں ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو مخلد بن یزید نے خبر دی ، کہا ہمیں ابن جریج نے خبر دی ، کہا کہ مجھے عمرو بن دینار نے خبر دی اور انہوں نے جابر رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا مَخْلَدُ بْنُ يَزِيدَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّهُ سَمِعَ جَابِرًا ـ رضى الله عنه ـ يَقُولُ غَزَوْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم وَقَدْ ثَابَ مَعَهُ نَاسٌ مِنَ الْمُهَاجِرِينَ حَتَّى كَثُرُوا، وَكَانَ مِنَ الْمُهَاجِرِينَ رَجُلٌ لَعَّابٌ فَكَسَعَ أَنْصَارِيًّا، فَغَضِبَ الأَنْصَارِيُّ غَضَبًا شَدِيدًا، حَتَّى تَدَاعَوْا، وَقَالَ الأَنْصَارِيُّ يَا لَلأَنْصَارِ‏.‏ وَقَالَ الْمُهَاجِرِيُّ يَا لَلْمُهَاجِرِينَ‏.‏ فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا بَالُ دَعْوَى أَهْلِ الْجَاهِلِيَّةِ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ مَا شَأْنُهُمْ ‏\"‏‏.‏ فَأُخْبِرَ بِكَسْعَةِ الْمُهَاجِرِيِّ الأَنْصَارِيَّ قَالَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعُوهَا فَإِنَّهَا خَبِيثَةٌ ‏\"‏‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ أَقَدْ تَدَاعَوْا عَلَيْنَا، لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ‏.‏ فَقَالَ عُمَرُ أَلاَ نَقْتُلُ يَا رَسُولَ اللَّهِ هَذَا الْخَبِيثَ لِعَبْدِ اللَّهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ يَتَحَدَّثُ النَّاسُ أَنَّهُ كَانَ يَقْتُلُ أَصْحَابَهُ ‏\"‏‏.‏",
                "headingArabic": "مَا يُنْهَى مِنْ دَعْوَةِ الْجَاهِلِيَّةِ",
                "headingUrdu": "دور جاہلیت کی دعوت کی کیا چیز حرام ہے؟",
                "headingEnglish": "What is forbidden of the Da'wah of the Period of Ignorance",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3359,
                "hadithNumber": "3519",
                "englishNarrator": "Narrated `Abdullah (bin Mas`ud) رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Who-ever slaps his face or tears the bosom of his dress, or calls the calls of the Period of Ignorance, is not from us.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، وہ شخص ہم میں سے نہیں ہے جو ( نوحہ کرتے ہوئے ) اپنے رخسار پیٹے ، گریبان پھاڑ ڈالے ، اور جاہلیت کی پکار پکارے ۔",
                "urduNarrator": "ہم سے ثابت بن محمد نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے اعمش نے ، ان سے عبداللہ بن مرہ نے ، ان سے مسروق نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے ان سے نبی کریم صلی اللہ علیہ وسلم نے ، اور سفیان نے زبید سے ، انہوں نے ابراہیم سے ، انہوں نے مسروق سے اور انہوں نے حضرت عبداللہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنِي ثَابِتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَعَنْ سُفْيَانَ، عَنْ زُبَيْدٍ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ، وَشَقَّ الْجُيُوبَ، وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3360,
                "hadithNumber": "3520",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"`Amr bin Luhai bin Qam'a bin Khindif was the father of Khuza`a.'",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، عمرو بن لحیی بن قمعہ بن خندف قبیلہ خزاعہ کا باپ تھا ۔",
                "urduNarrator": "مجھ سے اسحٰق بن ابراہیم نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن آدم نے بیان کیا ، کہا ہم کو اسرائیل نے خبر دی ، انہیں ابوحصین نے ، انہیں ابوصالح نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، أَخْبَرَنَا إِسْرَائِيلُ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ عَمْرُو بْنُ لُحَىِّ بْنِ قَمَعَةَ بْنِ خِنْدِفَ أَبُو خُزَاعَةَ ‏\"‏‏.‏",
                "headingArabic": "قِصَّةُ خُزَاعَةَ",
                "headingUrdu": "خزاعہ کا قصہ",
                "headingEnglish": "The story of Khuza'a",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3361,
                "hadithNumber": "3521",
                "englishNarrator": "Narrated Sa`id bin Al-Musaiyab:",
                "hadithEnglish": "Al-Bahira was an animal whose milk was spared for the idols and other dieties, and so nobody was allowed to milk it. As-Saiba was an animal which they (i.e infidels) used to set free in the names of their gods so that it would not be used for carrying anything. Abu Huraira رضی اللہ عنہ said, \"The Prophet (ﷺ) said, 'I saw `Amr bin 'Amir bin Luhai Al-Khuza`i dragging his intestines in the (Hell) Fire, for he was the first man who started the custom of releasing animals (for the sake of false gods).' \"",
                "hadithUrdu": "بحیرہ وہ اونٹنی جس کے دودھ کی ممانعت ہوتی تھی ۔ کیونکہ وہ بتوں کے لیے وقف ہوتی تھی ۔ اس لیے کوئی بھی شخص اس کا دودھ نہیں دوھتا تھا اور سائبہ اسے کہتے جس کو وہ اپنے معبودوں کے لیے چھوڑ دیتے اور ان پر کوئی بوجھ نہ لادتا اور نہ کوئی سواری کرتا ۔ انہوں نے کہا کہ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں نے عمرو بن عامر بن لحی خزاعی کو دیکھا کہ جہنم میں وہ اپنی انتڑیاں گھسیٹ رہا تھا اوریہی عمرو وہ پہلا شخص ہے جس نے سائبہ کی رسم نکالی ۔",
                "urduNarrator": "ہم سے ابولیمان نے بیان کیا ، کہا ہم سے شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہوں نے سعید بن مسیب سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، قَالَ الْبَحِيرَةُ الَّتِي يُمْنَعُ دَرُّهَا لِلطَّوَاغِيتِ وَلاَ يَحْلُبُهَا أَحَدٌ مِنَ النَّاسِ، وَالسَّائِبَةُ الَّتِي كَانُوا يُسَيِّبُونَهَا لآلِهَتِهِمْ فَلاَ يُحْمَلُ عَلَيْهَا شَىْءٌ‏.‏ قَالَ وَقَالَ أَبُو هُرَيْرَةَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ رَأَيْتُ عَمْرَو بْنَ عَامِرِ بْنِ لُحَىٍّ الْخُزَاعِيَّ يَجُرُّ قُصْبَهُ فِي النَّارِ، وَكَانَ أَوَّلَ مَنْ سَيَّبَ السَّوَائِبَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3362,
                "hadithNumber": "3522",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"Shall I tell you the story of Abu Dhar's conversion to Islam?\" We said, \"Yes.\" He said, \"Abu Dhar رضی اللہ عنہ said: I was a man from the tribe of Ghifar. We heard that a man had appeared in Mecca, claiming to be a Prophet. ! said to my brother, 'Go to that man and talk to him and bring me his news.' He set out, met him and returned. I asked him, 'What is the news with you?' He said, 'By Allah, I saw a man enjoining what is good and forbidding what is evil.' I said to him, 'You have not satisfied me with this little information.' So, I took a water skin and a stick and proceeded towards Mecca. Neither did I know him (i.e. the Prophet (ﷺ) ), nor did I like to ask anyone about him. I Kept on drinking Zam zam water and staying in the Mosque. Then `Ali رضی اللہ عنہ passed by me and said, 'It seems you are a stranger?' I said, 'Yes.' He proceeded to his house and I accompanied him. Neither did he ask me anything, nor did I tell him anything. Next morning I went to the Mosque to ask about the Prophet but no-one told me anything about him. `Ali رضی اللہ عنہ passed by me again and asked, 'Hasn't the man recognized his dwelling place yet' I said, 'No.' He said, 'Come along with me.' He asked me, 'What is your business? What has brought you to this town?' I said to him, 'If you keep my secret, I will tell you.' He said, 'I will do,' I said to him, 'We have heard that a person has appeared here, claiming to be a Prophet. I sent my brother to speak to him and when he returned, he did not bring a satisfactory report; so I thought of meeting him personally.' `Ali رضی اللہ عنہ said (to Abu Dhar), 'You have reached your goal; I am going to him just now, so follow me, and wherever I enter, enter after me. If I should see someone who may cause you trouble, I will stand near a wall pretending to mend my shoes (as a warning), and you should go away then.' `Ali رضی اللہ عنہ proceeded and I accompanied him till he entered a place, and I entered with him to the Prophet (ﷺ) to whom I said, 'Present (the principles of) Islam to me.' When he did, I embraced Islam 'immediately. He said to me, 'O Abu Dhar! Keep your conversion as a secret and return to your town; and when you hear of our victory, return to us. ' I said, 'By H him Who has sent you with the Truth, I will announce my conversion to Islam publicly amongst them (i.e. the infidels),' Abu Dhar went to the Mosque, where some people from Quraish were present, and said, 'O folk of Quraish ! I testify that None has the right to be worshipped except Allah, and I (also) testify that Muhammad is Allah's Slave and His Apostle.' (Hearing that) the Quraishi men said, 'Get at this Sabi (i.e. Muslim) !' They got up and beat me nearly to death. Al `Abbas رضی اللہ عنہما saw me and threw himself over me to protect me. He then faced them and said, 'Woe to you! You want to kill a man from the tribe of Ghifar, although your trade and your communications are through the territory of Ghifar?' They therefore left me. The next morning I returned (to the Mosque) and said the same as I have said on the previous day. They again said, 'Get at this Sabi!' I was treated in the same way as on the previous day, and again Al-Abbas رضی اللہ عنہما found me and threw himself over me to protect me and told them the same as he had said the day before.' So, that was the conversion of Abu Dhar رضی اللہ عنہ (may Allah be Merciful to him) to Islam.\"",
                "hadithUrdu": "کیا میں ابوذر رضی اللہ عنہ کے اسلام کا واقعہ تمہیں سناؤں ؟ ہم نے عرض کیا ضرور سنائیے ۔ انہوں نے بیان کیا کہ ابوذر رضی اللہ عنہ نے بتلایا ۔ میرا تعلق قبیلہ غفار سے تھا ۔ ہمارے یہاں یہ خبر پہنچی تھی کہ مکہ میں ایک شخص پیدا ہوئے ہیں جن کا دعویٰ ہے کہ وہ نبی ہیں ( پہلے تو ) میں نے اپنے بھائی سے کہا کہ اس شخص کے پاس مکہ جا ، اس سے گفتگو کر اور پھر اس کے سارے حالات آ کر مجھے بتا ۔ چنانچہ میرے بھائی خدمت نبوی میں حاضر ہوئے اور آنحضرت صلی اللہ علیہ وسلم سے ملاقات کی اور واپس آ گئے ۔ میں نے پوچھا کہ کیا خبر لائے ؟ انہوں نے کہا ، اللہ کی قسم ! میں نے ایسے شخص کو دیکھا ہے جو اچھے کاموں کے لیے کہتا ہے اور برے کاموں سے منع کرتا ہے ۔ میں نے کہا کہ تمہاری باتوں سے تو میری تشفی نہیں ہوئی ۔ اب میں نے توشے کا تھیلا اور چھڑی اٹھائی اور مکہ آ گیا ۔ وہاں میں کسی کو پہچانتا نہیں تھا اور آپ کے متعلق کسی سے پوچھتے ہوئے بھی ڈر لگتا تھا ۔ میں ( صرف ) زمزم کا پانی پی لیا کرتا تھا ، اور مسجدالحرام میں ٹھہرا ہوا تھا ۔ انہوں نے بیان کیا کہ ایک مرتبہ علی رضی اللہ عنہ میرے سامنے سے گزرے اور بولے معلوم ہوتا ہے کہ آپ اس شہر میں مسافر ہیں ۔ انہوں نے بیان کیا کہ میں نے کہا : جی ہاں ۔ بیان کیا کہ تو پھر میرے گھر چلو ۔ پھر وہ مجھے اپنے گھر ساتھ لے گئے ۔ بیان کیا کہ میں آپ کے ساتھ ساتھ گیا ۔ نہ انہوں نے کوئی بات پوچھی اور نہ میں نے کچھ کہا ۔ صبح ہوئی تو میں پھر مسجدالحرام میں آ گیا تاکہ آنحضرت صلی اللہ علیہ وسلم کے بارے میں کسی سے پوچھوں لیکن آپ کے بارے میں کوئی بتانے والا نہیں تھا ۔ بیان کیا کہ پھر حضرت علی رضی اللہ عنہ میرے سامنے سے گزرے اور بولے کہ کیا ابھی تک آپ اپنے ٹھکانے کو نہیں پا سکے ہیں ؟ بیان کیا ، میں نے کہا کہ نہیں ۔ انہوں نے کہا کہ اچھا پھر میرے ساتھ آئیے ، انہوں نے بیان کیا کہ پھر حضرت علی رضی اللہ عنہ نے پوچھا ۔ آپ کا مطلب کیا ہے ۔ آپ اس شہر میں کیوں آئے ؟ انہوں نے بیان کیا کہ میں نے کہا : آپ اگر ظاہر نہ کریں تو میں آپ کو اپنے معاملے کے بارے میں بتاؤں ۔ انہوں نے کہا کہ میں ایسا ہی کروں گا ۔ تب میں نے ان سے کہا ۔ ہمیں معلوم ہوا ہے کہ یہاں کوئی شخص پیدا ہوئے ہیں جو نبوت کا دعویٰ کرتے ہیں ۔ میں نے پہلے اپنے بھائی کو ان سے بات کرنے کے لیے بھیجا تھا ۔ لیکن جب وہ واپس ہوئے تو انہوں نے مجھے کوئی تشفی بخش اطلاعات نہیں دیں ۔ اس لیے میں اس ارادہ سے آیا ہوں کہ ان سے خود ملاقات کروں ۔ علی رضی اللہ عنہ نے کہا کہ آپ نے اچھا راستہ پایا کہ مجھ سے مل گئے ۔ میں انہیں کے پاس جا رہا ہوں ۔ آپ میرے پیچھے پیچھے چلیں ۔ جہاں میں داخل ہوں آپ بھی داخل ہو جائیں ۔ اگر میں کسی ایسے آدمی کو دیکھوں گا جس سے آپ کے بارے میں مجھے خطرہ ہو گا تو میں کسی دیوار کے پاس کھڑا ہو جاؤں گا ، گویا کہ میں اپنا جوتا ٹھیک کر رہا ہوں ۔ اس وقت آپ آگے بڑھ جائیں چنانچہ وہ چلے اور میں بھی ان کے پیچھے ہو لیا اور آخر میں وہ ایک مکان کے اندر گئے اور میں بھی ان کے ساتھ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اندر داخل ہو گیا ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے عرض کیا کہ اسلام کے اصول و ارکان مجھے سمجھا دیجئیے ۔ آپ نے میرے سامنے ان کی وضاحت فرمائی اور میں مسلمان ہو گیا ۔ پھر آپ نے فرمایا : اے ابوذر ! اس معاملے کو ابھی پوشیدہ رکھنا اور اپنے شہر کو چلے جانا ۔ پھر جب تمہیں ہمارے غلبہ کا حال معلوم ہو جائے تب یہاں دوبارہ آنا ۔ میں نے عرض کیا اس ذات کی قسم جس نے آپ کو حق کے ساتھ مبعوث کیا ہے میں تو ان سب کے سامنے اسلام کے کلمہ کا اعلان کروں گا ۔ چنانچہ وہ مسجدالحرام میں آئے ۔ قریش کے لوگ وہاں موجود تھے اور کہا ، اے قریش کی جماعت ! ( سنو ) میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں اور میں گواہی دیتا ہوں کہ محمد اس کے بندے اور اس کے رسول ہیں ۔ ( صلی اللہ علیہ وسلم ) قریشیوں نے کہا کہ اس بددین کی خبر لو ۔ چنانچہ وہ میری طرف لپکے اور مجھے اتنا مارا کہ میں مرنے کے قریب ہو گیا ۔ اتنے میں حضرت عباس رضی اللہ عنہ آ گئے اور مجھ پر گر کر مجھے اپنے جسم سے چھپا لیا اور قریشیوں کی طرف متوجہ ہو کر انہوں کہا ۔ ارے نادانو ! قبیلہ غفار کے آدمی کو قتل کرتے ہو ۔ غفار سے تو تمہاری تجارت بھی ہے اور تمہارے قافلے بھی اس طرف سے گزرتے ہیں ۔ اس پر انہوں نے مجھے چھوڑ دیا ۔ پھر جب دوسری صبح ہوئی تو پھر میں مسجدالحرام میں آیا اور جو کچھ میں نے کل پکارا تھا اسی کو پھر دہرایا ۔ قریشیوں نے پھر کہا : پکڑو اس بددین کو ۔ جو کچھ انہوں نے میرے ساتھ کل کیا تھا وہی آج بھی کیا ۔ اتفاق سے پھر عباس بن عبدالمطلب آ گئے اور مجھ پر گر کر مجھے اپنے جسم سے انہوں نے چھپا لیا اور جیسا ا نہوں نے قریشیوں سے کل کہا تھا ویسا ہی آج بھی کہا ۔ عبداللہ بن عباس رضی اللہ عنہما نے کہا کہ حضرت ابوذر رضی اللہ عنہ کے اسلام قبول کرنے کی ابتداء اس طرح سے ہوئی تھی ۔",
                "urduNarrator": "ہم سے زید نے جو اخزم کے بیٹے ہیں ، یبان کیا ، کہا ہم سے ابوقتیبہ سلم بن قتیبہ نے بیان کیا ، ان سے مثنیٰ بن سعید قصیر نے بیان کیا ، کہا کہ مجھ سے ابوجمرہ نے بیان کیا ، کہا کہ ہم سے عبداللہ بن عباس رضی اللہ عنہما نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا زَيْدٌ ـ هُوَ ابْنُ أَخْزَمَ ـ قَالَ أَبُو قُتَيْبَةَ سَلْمُ بْنُ قُتَيْبَةَ حَدَّثَنِي مُثَنَّى بْنُ سَعِيدٍ الْقَصِيرُ، قَالَ حَدَّثَنِي أَبُو جَمْرَةَ، قَالَ لَنَا ابْنُ عَبَّاسِ أَلاَ أُخْبِرُكُمْ بِإِسْلاَمِ أَبِي ذَرٍّ، قَالَ قُلْنَا بَلَى‏.‏ قَالَ قَالَ أَبُو ذَرٍّ كُنْتُ رَجُلاً مِنْ غِفَارٍ، فَبَلَغَنَا أَنَّ رَجُلاً قَدْ خَرَجَ بِمَكَّةَ، يَزْعُمُ أَنَّهُ نَبِيٌّ، فَقُلْتُ لأَخِي انْطَلِقْ إِلَى هَذَا الرَّجُلِ كَلِّمْهُ وَأْتِنِي بِخَبَرِهِ‏.‏ فَانْطَلَقَ فَلَقِيَهُ، ثُمَّ رَجَعَ فَقُلْتُ مَا عِنْدَكَ فَقَالَ وَاللَّهِ لَقَدْ رَأَيْتُ رَجُلاً يَأْمُرُ بِالْخَيْرِ وَيَنْهَى عَنِ الشَّرِّ‏.‏ فَقُلْتُ لَهُ لَمْ تَشْفِنِي مِنَ الْخَبَرِ‏.‏ فَأَخَذْتُ جِرَابًا وَعَصًا، ثُمَّ أَقْبَلْتُ إِلَى مَكَّةَ فَجَعَلْتُ لاَ أَعْرِفُهُ، وَأَكْرَهُ أَنْ أَسْأَلَ عَنْهُ، وَأَشْرَبُ مِنْ مَاءِ زَمْزَمَ وَأَكُونُ فِي الْمَسْجِدِ‏.‏ قَالَ فَمَرَّ بِي عَلِيٌّ فَقَالَ كَأَنَّ الرَّجُلَ غَرِيبٌ‏.‏ قَالَ قُلْتُ نَعَمْ‏.‏ قَالَ فَانْطَلِقْ إِلَى الْمَنْزِلِ‏.‏ قَالَ فَانْطَلَقْتُ مَعَهُ لاَ يَسْأَلُنِي عَنْ شَىْءٍ، وَلاَ أُخْبِرُهُ، فَلَمَّا أَصْبَحْتُ غَدَوْتُ إِلَى الْمَسْجِدِ لأَسْأَلَ عَنْهُ، وَلَيْسَ أَحَدٌ يُخْبِرُنِي عَنْهُ بِشَىْءٍ‏.‏ قَالَ فَمَرَّ بِي عَلِيٌّ فَقَالَ أَمَا نَالَ لِلرَّجُلِ يَعْرِفُ مَنْزِلَهُ بَعْدُ قَالَ قُلْتُ لاَ‏.‏ قَالَ انْطَلِقْ مَعِي‏.‏ قَالَ فَقَالَ مَا أَمْرُكَ وَمَا أَقْدَمَكَ هَذِهِ الْبَلْدَةَ قَالَ قُلْتُ لَهُ إِنْ كَتَمْتَ عَلَىَّ أَخْبَرْتُكَ‏.‏ قَالَ فَإِنِّي أَفْعَلُ‏.‏ قَالَ قُلْتُ لَهُ بَلَغَنَا أَنَّهُ قَدْ خَرَجَ هَا هُنَا رَجُلٌ يَزْعُمُ أَنَّهُ نَبِيٌّ، فَأَرْسَلْتُ أَخِي لِيُكَلِّمَهُ فَرَجَعَ وَلَمْ يَشْفِنِي مِنَ الْخَبَرِ، فَأَرَدْتُ أَنْ أَلْقَاهُ‏.‏ فَقَالَ لَهُ أَمَا إِنَّكَ قَدْ رَشَدْتَ، هَذَا وَجْهِي إِلَيْهِ، فَاتَّبِعْنِي، ادْخُلْ حَيْثُ أَدْخُلُ، فَإِنِّي إِنْ رَأَيْتُ أَحَدًا أَخَافُهُ عَلَيْكَ، قُمْتُ إِلَى الْحَائِطِ، كَأَنِّي أُصْلِحُ نَعْلِي، وَامْضِ أَنْتَ، فَمَضَى وَمَضَيْتُ مَعَهُ، حَتَّى دَخَلَ وَدَخَلْتُ مَعَهُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقُلْتُ لَهُ اعْرِضْ عَلَىَّ الإِسْلاَمَ‏.‏ فَعَرَضَهُ فَأَسْلَمْتُ مَكَانِي، فَقَالَ لِي ‏ \"‏ يَا أَبَا ذَرٍّ اكْتُمْ هَذَا الأَمْرَ، وَارْجِعْ إِلَى بَلَدِكَ، فَإِذَا بَلَغَكَ ظُهُورُنَا فَأَقْبِلْ ‏\"‏‏.‏ فَقُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ لأَصْرُخَنَّ بِهَا بَيْنَ أَظْهُرِهِمْ‏.‏ فَجَاءَ إِلَى الْمَسْجِدِ، وَقُرَيْشٌ فِيهِ فَقَالَ يَا مَعْشَرَ قُرَيْشٍ، إِنِّي أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ‏.‏ فَقَالُوا قُومُوا إِلَى هَذَا الصَّابِئِ‏.‏ فَقَامُوا فَضُرِبْتُ لأَمُوتَ فَأَدْرَكَنِي الْعَبَّاسُ، فَأَكَبَّ عَلَىَّ ثُمَّ أَقْبَلَ عَلَيْهِمْ، فَقَالَ وَيْلَكُمْ تَقْتُلُونَ رَجُلاً مِنْ غِفَارَ، وَمَتْجَرُكُمْ وَمَمَرُّكُمْ عَلَى غِفَارَ‏.‏ فَأَقْلَعُوا عَنِّي، فَلَمَّا أَنْ أَصْبَحْتُ الْغَدَ رَجَعْتُ فَقُلْتُ مِثْلَ مَا قُلْتُ بِالأَمْسِ، فَقَالُوا قُومُوا إِلَى هَذَا الصَّابِئِ‏.‏ فَصُنِعَ ‏{‏بِي‏}‏ مِثْلَ مَا صُنِعَ بِالأَمْسِ وَأَدْرَكَنِي الْعَبَّاسُ فَأَكَبَّ عَلَىَّ، وَقَالَ مِثْلَ مَقَالَتِهِ بِالأَمْسِ‏.‏ قَالَ فَكَانَ هَذَا أَوَّلَ إِسْلاَمِ أَبِي ذَرٍّ رَحِمَهُ اللَّهُ‏.‏",
                "headingArabic": "قِصَّةِ زَمْزَمَ",
                "headingUrdu": "زمزم کی کہانی",
                "headingEnglish": "The story of Zamzam",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3363,
                "hadithNumber": "3523",
                "englishNarrator": "Narrated Abu Hurairah رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, (The people of) Aslam, Ghifar and some people of Muzaina and Juhaina or said (some people of Juhaina or Muzaina) are better with Allah or said (on the Day of resurrection) than the tribe of Asad, Tamim, Hawazin and Ghatafan.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، قبیلہ اسلم ، غفار اور مزینہ اور جہنیہ کے کچھ لوگ یا انہوں نے بیان کیا کہ مزینہ کے کچھ لوگ یا ( بیان کیا کہ ) جہینہ کے کچھ لوگ اللہ تعالیٰ کے نزدیک یا بیان کیا کہ قیامت کے دن قبیلہ اسد ، تمیم ، ہوازن اور غطفان سے بہتر ہوں گے ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد نے بیان کیا ، ان سے ایوب نے ، ان سے محمد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ أَسْلَمُ وَغِفَارُ وَشَىْءٌ مِنْ مُزَيْنَةَ وَجُهَيْنَةَ ـ أَوْ قَالَ شَىْءٌ مِنْ جُهَيْنَةَ أَوْ مُزَيْنَةَ ـ خَيْرٌ عِنْدَ اللَّهِ ـ أَوْ قَالَ ـ يَوْمَ الْقِيَامَةِ مِنْ أَسَدٍ وَتَمِيمٍ وَهَوَازِنَ وَغَطَفَانَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3364,
                "hadithNumber": "3524",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "If you wish to know about the ignorance of the Arabs, refer to Surat-al-Anam after Verse No. 130:-- Indeed lost are those who have killed their children From folly without knowledge and have forbidden that which Allah has provided for them, inventing a lie against Allah. They have indeed gone astray and were not guided.' (6.14)",
                "hadithUrdu": "اگر تم کو عرب کی جہالت معلوم کرنا اچھا لگے تو سورۃ الانعام میں ایک سو تیس آیتوں کے بعد یہ آیتیں پڑھ لو ” یقیناً وہ لوگ تباہ ہوئے جنہوں نے اپنی اولاد کو نادانی سے مارڈالا “ سے لے کر ” وہ گمراہ ہیں ، راہ پانے والے نہیں “ تک ۔",
                "urduNarrator": "ہم سے ابولنعمان نے بیان کیا ، انہوں نے کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے بشر نے ، ان سے سعید بن جبیر نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ إِذَا سَرَّكَ أَنْ تَعْلَمَ جَهْلَ الْعَرَبِ فَاقْرَأْ مَا فَوْقَ الثَّلاَثِينَ وَمِائَةٍ فِي سُورَةِ الأَنْعَامِ ‏{‏قَدْ خَسِرَ الَّذِينَ قَتَلُوا أَوْلاَدَهُمْ سَفَهًا بِغَيْرِ عِلْمٍ‏}‏ إِلَى قَوْلِهِ ‏{‏قَدْ ضَلُّوا وَمَا كَانُوا مُهْتَدِينَ‏}‏‏.‏",
                "headingArabic": "قِصَّةِ زَمْزَمَ وَجَهْلِ الْعَرَبِ",
                "headingUrdu": "زمزم کا قصہ اور عربوں کی جہالت",
                "headingEnglish": "The story of Zamzam and the ignorance of the Arabs",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3365,
                "hadithNumber": "3525",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When the Verse:-- 'And warn your tribe of near kindred.' (26.214) was revealed, the Prophet (ﷺ) started calling (the 'Arab tribes), \"O Bani Fihr, O Bani `Adi\" mentioning first the various branch tribes of Quraish.",
                "hadithUrdu": "جب ( سورۃ الشعراء کی ) یہ آیت اتری ” اے پیغمبر ! اپنے قریبی رشتہ داروں کو ڈرا “ تو نبی کریم صلی اللہ علیہ وسلم نے قریش کے مختلف قبیلوں کو بلایا ” اے بنی فہر ! اے بنی عدی ! جو قریش کے خاندان تھے ۔",
                "urduNarrator": "ہم سے عمر بن حفص نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، کہا ہم سے اعمش نے ، کہا ان سے عمرو بن مرہ نے ، ان سے سعید بن جبیر نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا نَزَلَتْ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}‏ جَعَلَ النَّبِيُّ صلى الله عليه وسلم يُنَادِي ‏\"‏ يَا بَنِي فِهْرٍ، يَا بَنِي عَدِيٍّ لِبُطُونِ قُرَيْشٍ ‏\"‏‏.‏",
                "headingArabic": "مَنِ انْتَسَبَ إِلَى آبَائِهِ فِي الإِسْلاَمِ وَالْجَاهِلِيَّةِ‏",
                "headingUrdu": "جس نے اپنے آباء و اجداد سے قرابت داری کی۔",
                "headingEnglish": "Whoever related kinship to his forefathers",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3366,
                "hadithNumber": "3526",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When the Verse:-- 'And warn your tribe of near kindred' (26.214). was revealed, the Prophet (ﷺ) started calling every tribe by its name.",
                "hadithUrdu": "جب یہ آیت ” اور آپ اپنے قریبی رشتہ داروں کو ڈرائیے “ اتری تو آنحضرت صلی اللہ علیہ وسلم نے الگ الگ قبائل کو دعوت دی ۔",
                "urduNarrator": "( حضرت امام بخاری رحمہ اللہ نے ) کہا کہ ہم سے قبیصہ نے بیان کیا ، انہیں سفیان نے خبر دی ، انہیں حبیب بن ابی ثابت نے ، انہیں سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ لَنَا قَبِيصَةُ أَخْبَرَنَا سُفْيَانُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا نَزَلَتْ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}‏ جَعَلَ النَّبِيُّ صلى الله عليه وسلم يَدْعُوهُمْ قَبَائِلَ قَبَائِلَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3367,
                "hadithNumber": "3527",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"O Bani `Abd Munaf! Buy yourselves from Allah; O Bani `Abdul-Muttalib! Buy yourselves from Allah; O mother of Az-Zubair bin Al-Awwam, the aunt of Allah's Messenger (ﷺ), and O Fatima bint Muhammad! Buy yourselves from Allah, for I cannot defend you before Allah. You (both) can ask me from my property as much as you like. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : اے عبدمناف کے بیٹو ! اپنی جانوں کو اللہ سے خرید لو ( یعنی نیک کام کر کے انہیں اللہ تعالیٰ کے عذاب سے بچا لو ) اے عبدالمطلب کے بیٹو ! اپنی جانوں کو اللہ تعالیٰ سے خرید لو ، اے زبیر بن عوام کی والدہ ! رسول اللہ صلی اللہ علیہ وسلم کی پھوپھی ، اے فاطمہ بنت محمد ! تم دونوں اپنی جانوں کو اللہ سے بچا لو ۔ میں تمہارے لیے اللہ کی بارگاہ میں کچھ اختیار نہیں رکھتا ۔ تم دونوں میرے مال میں جتنا چاہو مانگ سکتی ہو ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، کہا ہم کو ابوالزناد نے خبر دی ، انہیں اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، أَخْبَرَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَا بَنِي عَبْدِ مَنَافٍ، اشْتَرُوا أَنْفُسَكُمْ مِنَ اللَّهِ، يَا بَنِي عَبْدِ الْمُطَّلِبِ اشْتَرُوا أَنْفُسَكُمْ مِنَ اللَّهِ، يَا أُمَّ الزُّبَيْرِ بْنِ الْعَوَّامِ عَمَّةَ رَسُولِ اللَّهِ، يَا فَاطِمَةُ بِنْتَ مُحَمَّدٍ، اشْتَرِيَا أَنْفُسَكُمَا مِنَ اللَّهِ، لاَ أَمْلِكُ لَكُمَا مِنَ اللَّهِ شَيْئًا، سَلاَنِي مِنْ مَالِي مَا شِئْتُمَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3368,
                "hadithNumber": "3528",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) sent for the Ansar (and when they came), he asked, 'Is there any stranger amongst you?\" They said, \"No except the son of our sister.\" Allah's Messenger (ﷺ) said, \"The son of the sister of some people belongs to them.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے انصار کو خاص طور سے ایک مرتبہ بلایا ، پھر ان سے پوچھا کیا تم لوگوں میں کوئی ایسا شخص بھی رہتا ہے جس کا تعلق تمہارے قبیلے سے نہ ہو ؟ انہوں نے عرض کیا کہ صرف ہمارا ایک بھانجا ایسا ہے ۔ آپ نے فرمایا کہ بھانجا بھی اسی قوم میں داخل ہوتا ہے ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے ، ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ دَعَا النَّبِيُّ صلى الله عليه وسلم الأَنْصَارَ فَقَالَ ‏\"‏ هَلْ فِيكُمْ أَحَدٌ مِنْ غَيْرِكُمْ ‏\"‏‏.‏ قَالُوا لاَ، إِلاَّ ابْنُ أُخْتٍ لَنَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ابْنُ أُخْتِ الْقَوْمِ مِنْهُمْ ‏\"‏‏.‏",
                "headingArabic": "ابْنُ أُخْتِ الْقَوْمِ وَمَوْلَى الْقَوْمِ مِنْهُمْ",
                "headingUrdu": "بعض لوگوں کی بہن کا بیٹا بھی اسی قوم کا سمجھا جاتا ہے۔",
                "headingEnglish": "The son of some people's sister is considered as belonging to the same people",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3369,
                "hadithNumber": "3529, 3530",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "During the Mina days, Abu Bakr رضی اللہ عنہ came to her, while there where two girls with her, beating drums, and the Prophet (ﷺ) was (lying) covering himself with his garment. Abu Bakr رضی اللہ عنہ rebuked the two girls, but the Prophet (ﷺ) uncovered his face and said, \"O Abu Bakr! Leave them, for these are the days of Id (festival).\" Those days were the days of Mina. `Aisha added, \"I was being screened by the Prophet (ﷺ) while I was watching the Ethiopians playing in the Mosque. `Umar rebuked them, but the Prophet (ﷺ) said, \"Leave them, O Bani Arfida! Play. (for) you are safe.\"",
                "hadithUrdu": "ابوبکر رضی اللہ عنہ ان کے یہاں تشریف لائے تو وہاں ( انصار کی ) دو لڑکیاں دف بجا کر گارہی تھیں ۔ یہ حج کے ایام منیٰ کا واقعہ ہے ، نبی کریم صلی اللہ علیہ وسلم روئے مبارک پر کپڑا ڈالے ہوئے لیٹے ہوئے تھے ۔ حضرت ابوبکر رضی اللہ عنہ نے انہیں ڈانٹا تو آنحضرت صلی اللہ علیہ وسلم نے اپنے چہرہ مبارک سے کپڑا ہٹا کر فرمایا : ابوبکر ! انہیں چھوڑد و ، یہ عید کے دن ہیں ، یہ منیٰ میں ٹھہرنے کے دن تھے ۔ اور حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم مجھ کو پردہ میں رکھے ہوئے ہیں اور میں حبشیوں کو دیکھ رہی تھی جو نیزوں کا کھیل مسجد میں کر رہے تھے ۔ حضرت ابوبکر رضی اللہ عنہ نے انہیں ڈانٹا ۔ لیکن آنحضرت صلی اللہ علیہ وسلم نے فرمایا : انہیں چھوڑ دو ، بنی ارفدہ تم بے فکر ہو کر کھیلو ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ دَخَلَ عَلَيْهَا وَعِنْدَهَا جَارِيَتَانِ فِي أَيَّامِ مِنًى تُدَفِّفَانِ وَتَضْرِبَانِ، وَالنَّبِيُّ صلى الله عليه وسلم مُتَغَشٍّ بِثَوْبِهِ، فَانْتَهَرَهُمَا أَبُو بَكْرٍ، فَكَشَفَ النَّبِيُّ صلى الله عليه وسلم عَنْ وَجْهِهِ، فَقَالَ ‏\"‏ دَعْهُمَا يَا أَبَا بَكْرٍ، فَإِنَّهَا أَيَّامُ عِيدٍ، وَتِلْكَ الأَيَّامُ أَيَّامُ مِنًى ‏\"‏‏. وَقَالَتْ عَائِشَةُ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَسْتُرُنِي، وَأَنَا أَنْظُرُ إِلَى الْحَبَشَةِ، وَهُمْ يَلْعَبُونَ فِي الْمَسْجِدِ فَزَجَرَهُمْ ‏{‏عُمَرُ‏}‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ دَعْهُمْ أَمْنًا بَنِي أَرْفَدَةَ ‏\"‏‏.‏ يَعْنِي مِنَ الأَمْنِ‏.‏",
                "headingArabic": "قِصَّةِ الْحَبَشِ‏",
                "headingUrdu": "حبشیوں کی کہانی",
                "headingEnglish": "The story of the Ethiopians",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3370,
                "hadithNumber": "3531",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Once Hassan bin Thabit رضی اللہ عنہ asked the permission of the Prophet (ﷺ) to lampoon (i.e. compose satirical poetry defaming) the infidels. The Prophet (ﷺ) said, \"What about the fact that I have common descent with them?\" Hassan رضی اللہ عنہ replied, \"I shall take you out of them as a hair is taken out of dough.\" Narrated `Urwa: I started abusing Hassan رضی اللہ عنہ in front of `Aisha رضی اللہ عنہا , whereupon she said. \"Don't abuse him, for he used to defend the Prophet (with his poetry).",
                "hadithUrdu": "حسان بن ثابت رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے مشرکین ( قریش ) کی ہجو کرنے کی اجازت چاہی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر میں بھی تو ان ہی کے خاندان سے ہوں ۔ اس پر حسان رضی اللہ عنہ نے عرض کیا کہ میں آپ کو ( شعر میں ) اس طرح صاف نکال لے جاؤں گا جیسے آٹے میں سے بال نکال لیا جاتا ہے اور ( ہشام نے ) اپنے والد سے روایت کیا کہ انہوں نے کہا ، حضرت عائشہ رضی اللہ عنہا کے یہاں میں حسان رضی اللہ عنہ کو برا کہنے لگا تو انہوں نے فرمایا ، انہیں برا نہ کہو ، وہ نبی کریم صلی اللہ علیہ وسلم کی طرف سے مدافعت کیا کرتے تھے ۔",
                "urduNarrator": "مجھ سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے عبدہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اسْتَأْذَنَ حَسَّانُ النَّبِيَّ صلى الله عليه وسلم فِي هِجَاءِ الْمُشْرِكِينَ، قَالَ ‏ \"‏ كَيْفَ بِنَسَبِي ‏\"‏‏.‏ فَقَالَ حَسَّانُ لأَسُلَّنَّكَ مِنْهُمْ كَمَا تُسَلُّ الشَّعَرَةُ مِنَ الْعَجِينِ‏.‏ وَعَنْ أَبِيهِ قَالَ ذَهَبْتُ أَسُبُّ حَسَّانَ عِنْدَ عَائِشَةَ فَقَالَتْ لاَ تَسُبُّهُ فَإِنَّهُ كَانَ يُنَافِحُ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "مَنْ أَحَبَّ أَنْ لاَ يُسَبَّ نَسَبُهُ",
                "headingUrdu": "جس نے یہ پسند کیا کہ اس کے اسلاف کو گالی نہ دی جائے۔",
                "headingEnglish": "Whoever liked that his ancestors should not be abused",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3371,
                "hadithNumber": "3532",
                "englishNarrator": "Narrated Jubair bin Mut`im رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"I have five names: I am Muhammad and Ahmad; I am Al-Mahi through whom Allah will eliminate infidelity; I am Al-Hashir who will be the first to be resurrected, the people being resurrected there after; and I am also Al-`Aqib (i.e. There will be no prophet after me).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، میرے پانچ نام ہیں ۔ میں محمد ، احمد اور ماحی ہوں ( یعنی مٹانے والا ہوں ) کہ اللہ تعالیٰ میرے ذریعہ کفر کو مٹائے گا اور میں حاشر ہوں کہ تمام انسانوں کا ( قیامت کے دن ) میرے بعد حشر ہو گا اور میں ” عاقب “ ہوں یعنی خاتم النبین ہوں ۔ میرے بعد کوئی نیا پیغمبر دنیا میں نہیں آئے گا ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا کہ مجھ سے معن نے کہا ، ان سے امام مالک نے ، ان سے ابن شہاب نے ، ان سے محمد بن جیبر بن مطعم نے اور ان سے ان کے والد ( جبیر بن مطعم رضی اللہ عنہ ) نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنِي مَعْنٌ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لِي خَمْسَةُ أَسْمَاءٍ أَنَا مُحَمَّدٌ، وَأَحْمَدُ، وَأَنَا الْمَاحِي الَّذِي يَمْحُو اللَّهُ بِي الْكُفْرَ، وَأَنَا الْحَاشِرُ الَّذِي يُحْشَرُ النَّاسُ عَلَى قَدَمِي، وَأَنَا الْعَاقِبُ ‏\"‏‏.‏",
                "headingArabic": "مَا جَاءَ فِي أَسْمَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "headingUrdu": "اللہ کے رسول صلی اللہ علیہ وسلم کے نام",
                "headingEnglish": "The names of Allah's Messenger (saws)",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3372,
                "hadithNumber": "3533",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Doesn't it astonish you how Allah protects me from the Quraish's abusing and cursing? They abuse Mudhammam and curse Mudhammam while I am Muhammad (and not Mudhammam).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، تمہیں تعجب نہیں ہوتا کہ اللہ تعالیٰ مجھ سے قریش کی گالیوں اور لعنت ملامت کو کس طرح دور کرتا ہے ۔ مجھے وہ مذمم کہہ کر برا کہتے ، اس پر لعنت کرتے ہیں ۔ حالانکہ میں تو محمد ہوں ۔ ( صلی اللہ علیہ وسلم )",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَلاَ تَعْجَبُونَ كَيْفَ يَصْرِفُ اللَّهُ عَنِّي شَتْمَ قُرَيْشٍ وَلَعْنَهُمْ يَشْتِمُونَ مُذَمَّمًا وَيَلْعَنُونَ مُذَمَّمًا وَأَنَا مُحَمَّدٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3373,
                "hadithNumber": "3534",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"My similitude in comparison with the other prophets is that of a man who has built a house completely and excellently except for a place of one brick. When the people enter the house, they admire its beauty and say: 'But for the place of this brick (how splendid the house will be)!\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میری اور دوسرے انبیاء کی مثال ایسی ہے جیسی کسی شخص نے کوئی گھر بنایا ، اسے خوب آراستہ پیراستہ کر کے مکمل کر دیا ۔ صرف ایک اینٹ کی جگہ خالی چھوڑ دی ۔ لوگ اس گھر میں داخل ہوتے اور تعجب کرتے اور کہتے کاش یہ ایک اینٹ کی جگہ خالی نہ رہتی تو کیسا اچھا مکمل گھر ہوتا ۔",
                "urduNarrator": "ہم سے محمد بن سنان نے بیان کیا ، کہا ہم سے سلیم نے بیان کیا ، کہا ہم سے سعید بن میناء نے بیان کیا اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہمانے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا سَلِيمٌ، حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَثَلِي وَمَثَلُ الأَنْبِيَاءِ كَرَجُلٍ بَنَى دَارًا فَأَكْمَلَهَا وَأَحْسَنَهَا، إِلاَّ مَوْضِعَ لَبِنَةٍ، فَجَعَلَ النَّاسُ يَدْخُلُونَهَا وَيَتَعَجَّبُونَ، وَيَقُولُونَ لَوْلاَ مَوْضِعُ اللَّبِنَةِ ‏\"‏‏.‏",
                "headingArabic": "خَاتِمِ النَّبِيِّينَ صلى الله عليه وسلم",
                "headingUrdu": "تمام انبیاء کے آخری نبی (محمد صلی اللہ علیہ وسلم)",
                "headingEnglish": "The last of all the Prophets (Muhammad (saws))",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3374,
                "hadithNumber": "3535",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"My similitude in comparison with the other prophets before me, is that of a man who has built a house nicely and beautifully, except for a place of one brick in a corner. The people go about it and wonder at its beauty, but say: 'Would that this brick be put in its place!' So I am that brick, and I am the last of the Prophets.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میری اور مجھ سے پہلے کے تمام انبیاء کی مثال ایسی ہے جیسے ایک شخص نے ایک گھر بنایا اور اس میں ہر طرح کی زینت پیدا کی لیکن ایک کونے میں ایک اینٹ کی جگہ چھوٹ گئی ۔ اب تمام لوگ آتے ہیں اور مکان کو چاروں طرف سے گھوم کر دیکھتے ہیں اور تعجب میں پڑ جاتے ہیں لیکن یہ بھی کہتے جاتے ہیں کہ یہاں پر ایک اینٹ کیوں نہ رکھی گئی ؟ تو میں ہی وہ اینٹ ہوں اور میں خاتم النبیین ہوں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے عبداللہ بن دینار نے ، ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ مَثَلِي وَمَثَلَ الأَنْبِيَاءِ مِنْ قَبْلِي كَمَثَلِ رَجُلٍ بَنَى بَيْتًا فَأَحْسَنَهُ وَأَجْمَلَهُ، إِلاَّ مَوْضِعَ لَبِنَةٍ مِنْ زَاوِيَةٍ، فَجَعَلَ النَّاسُ يَطُوفُونَ بِهِ وَيَعْجَبُونَ لَهُ، وَيَقُولُونَ هَلاَّ وُضِعَتْ هَذِهِ اللَّبِنَةُ قَالَ فَأَنَا اللَّبِنَةُ، وَأَنَا خَاتِمُ النَّبِيِّينَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3375,
                "hadithNumber": "3536",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) died when he was sixty three years old. Ibn-e-Shihab said: Saeed bin Al-Mosayyab has told me the same.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ترسٹھ سال کی عمر میں وفات پائی اور ابن شہاب نے کہا کہ مجھ سے سعید بن مسیب نے اسی طرح بیان کیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ بن زبیر نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ النَّبِيَّ صلى الله عليه وسلم تُوُفِّيَ وَهْوَ ابْنُ ثَلاَثٍ وَسِتِّينَ‏.‏ وَقَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ مِثْلَهُ‏.‏",
                "headingArabic": "وَفَاةِ النَّبِيِّ صلى الله عليه وسلم",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی وفات",
                "headingEnglish": "The death of the Prophet (saws)",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3376,
                "hadithNumber": "3537",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "While the Prophet (ﷺ) was in the market, a man called (somebody), \"O Abu-l-Qasim!' The Prophet (ﷺ) turned to him and said \"Name yourselves after me but do not call yourselves by my Kuniya.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم بازار میں تھے کہ ایک صاحب کی آواز آئی ۔ یا اباالقاسم ! آپ ان کی طرف متوجہ ہوئے ( معلوم ہوا کہ انہوں نے کسی اور کو پکارا ہے ) اس پر آپ نے فرمایا : میرے نام پر نام رکھو لیکن میری کنیت مت رکھو ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حمید نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم فِي السُّوقِ فَقَالَ رَجُلٌ يَا أَبَا الْقَاسِمِ‏.‏ فَالْتَفَتَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ سَمُّوا بِاسْمِي، وَلاَ تَكْتَنُوا بِكُنْيَتِي ‏\"‏‏.‏",
                "headingArabic": "كُنْيَةِ النَّبِيِّ صلى الله عليه وسلم",
                "headingUrdu": "نبی صلی اللہ علیہ وسلم کی کنیت",
                "headingEnglish": "The Kunya of the Prophet (saws)",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3377,
                "hadithNumber": "3538",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Name yourselves after me, but do not call yourselves by my Kuniya.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میرے نام پر نام رکھا کرو لیکن میری کنیت نہ رکھا کرو ۔",
                "urduNarrator": "ہم سے محمد بن کثیرنے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں منصور نے ، انہیں سالم بن ابی الجعد نے اور انہیںحضرت جابر رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ سَالِمٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ تَسَمَّوْا بِاسْمِي، وَلاَ تَكْتَنُوا بِكُنْيَتِي ‏\"‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 3351,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=134",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=132",
                "label": "132",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=133",
                "label": "133",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=134",
                "label": "134",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=135",
                "label": "135",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=136",
                "label": "136",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=137",
                "label": "137",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=138",
                "label": "138",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=136",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=136",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=134",
        "to": 3375,
        "total": 40465
    }
}