{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 276,
        "data": [
            {
                "id": 6881,
                "hadithNumber": "7175",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Salim, the freed salve of Abu Hudhaifa رضی اللہ عنہ used to lead in prayer the early Muhajirin (emigrants) and the companions of the Prophet (ﷺ) in the Quba mosque. Among those (who used to pray behind him) were Abu Bakr, `Umar, Abu Salama, and Amir bin Rabi`a رضی اللہ عنہم .",
                "hadithUrdu": "ابوحذیفہ رضی اللہ عنہ کے ( آزاد کردہ غلام ) سالم مہاجر اولین کی اور نبی کریم صلی اللہ علیہ وسلم کے دوسرے صحابہ کرام مسجد قباء میں امامت کیا کرتے تھے ۔ ان اصحاب میں ابوبکر ، عمر ، ابوسلمہ ، زید اور عامر بن ربیعہ رضی اللہ عنہم بھی ہوتے تھے ۔",
                "urduNarrator": "ہم سے عثمان بن صالح نے بیان کیا ، انہوں نے کہا ہم سے عبداللہ بن وہب نے بیان کیا ، انہوں نے کہا مجھ کو ابن جریج نے خبر دی ، انہیں نافع نے خبر دی ، انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے خبر دی ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ صَالِحٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي ابْنُ جُرَيْجٍ، أَنَّ نَافِعًا، أَخْبَرَهُ أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ قَالَ كَانَ سَالِمٌ مَوْلَى أَبِي حُذَيْفَةَ يَؤُمُّ الْمُهَاجِرِينَ الأَوَّلِينَ وَأَصْحَابَ النَّبِيِّ صلى الله عليه وسلم فِي مَسْجِدِ قُبَاءٍ، فِيهِمْ أَبُو بَكْرٍ وَعُمَرُ وَأَبُو سَلَمَةَ وَزَيْدٌ وَعَامِرُ بْنُ رَبِيعَةَ‏.‏",
                "headingArabic": "اسْتِقْضَاءِ الْمَوَالِي وَاسْتِعْمَالِهِمْ",
                "headingUrdu": "مولا کو قاضی اور عہدیدار مقرر کرنا",
                "headingEnglish": "To appoint the Maula as judges and officials",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6882,
                "hadithNumber": "7176, 7177",
                "englishNarrator": "Narrated Marwan bin Al-Hakam and Al-Miswar bin Makhrama رضی اللہ عنہم :",
                "hadithEnglish": "When the Muslims were permitted to set free the captives of Hawazin, Allah's Messenger (ﷺ) said, \"I do not know who amongst you has agreed (to it) and who has not. Go back so that your 'Urafa' may submit your decision to us.\" So the people returned and their 'Urafa' talked to them and then came back to Allah's Messenger (ﷺ) and told him that the people had given their consent happily and permitted (their captives to be freed).",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے جب مسلمانوں نے قبیلہ ہوازن کے قیدیوں کو اجازت دی تو فرمایا کہ مجھے نہیں معلوم کہ تم میں سے کس نے اجازت دی ہے اور کس نے نہیں دی ہے ۔ پس واپس جاؤ اور تمہارا معاملہ ہمارے پاس تمہارے نقیب یا چودھری اور تمہارے سردار لائیں ۔ چنانچہ لوگ واپس چلے گئے اور ان کے ذمہ داروں نے ان سے بات کی اور پھر آنحضرت صلی اللہ علیہ وسلم کو آ کر اطلاع دی کہ لوگوں نے دلی حوشی سے اجازت دے دی ہے ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا ہم سے اسماعیل بن ابراہیم نے بیان کیا ، ان سے ان کے چچا موسیٰ بن عقبہ نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے عروہ بن زبیر نے بیان کیا اور انہیں مروان بن حکم اور مسور بن مخرمہ رضی اللہ عنہم نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ عَمِّهِ، مُوسَى بْنِ عُقْبَةَ قَالَ ابْنُ شِهَابٍ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، أَخْبَرَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ حِينَ أَذِنَ لَهُمُ الْمُسْلِمُونَ فِي عِتْقِ سَبْىِ هَوَازِنَ ‏ \"‏ إِنِّي لاَ أَدْرِي مَنْ أَذِنَ مِنْكُمْ مِمَّنْ لَمْ يَأْذَنْ، فَارْجِعُوا حَتَّى يَرْفَعَ إِلَيْنَا عُرَفَاؤُكُمْ أَمْرَكُمْ ‏\"‏‏.‏ فَرَجَعَ النَّاسُ فَكَلَّمَهُمْ عُرَفَاؤُهُمْ، فَرَجَعُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرُوهُ أَنَّ النَّاسَ قَدْ طَيَّبُوا وَأَذِنُوا‏.",
                "headingArabic": "الْعُرَفَاءِ لِلنَّاسِ",
                "headingUrdu": "'عرفہ کو لوگوں کی دیکھ بھال کے لیے مقرر کیا گیا۔",
                "headingEnglish": "‘Urafa appointed to look after the people",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6883,
                "hadithNumber": "7178",
                "englishNarrator": "Narrated Ibn `Umarرضی اللہ عنہما :",
                "hadithEnglish": "\"When we enter upon our ruler(s) we say in their praise what is contrary to what we say when we leave them.\" Ibn `Umar رضی اللہ عنہما said, \"We used to consider this as hypocrisy.\"",
                "hadithUrdu": "ہم اپنے حاکموں کے پاس جاتے ہیں اور ان کے حق میں وہ باتیں کہتے ہیں کہ باہر آنے کے بعد ہم اس کے خلاف کہتے ہیں ۔ ابن عمر رضی اللہ عنہما نے کہا کہ ہم اسے نفاق کہتے تھے ۔",
                "urduNarrator": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا ہم سے عاصم بن محمد بن زید بن عبداللہ بن عمر نے ، اور ان سے ان کے والد نے کہ کچھ لوگوں نے ابن عمر رضی اللہ عنہما سے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدِ بْنِ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، قَالَ أُنَاسٌ لاِبْنِ عُمَرَ إِنَّا نَدْخُلُ عَلَى سُلْطَانِنَا فَنَقُولُ لَهُمْ خِلاَفَ مَا نَتَكَلَّمُ إِذَا خَرَجْنَا مِنْ عِنْدِهِمْ قَالَ كُنَّا نَعُدُّهَا نِفَاقًا‏.‏",
                "headingArabic": "مَا يُكْرَهُ مِنْ ثَنَاءِ السُّلْطَانِ، وَإِذَا خَرَجَ قَالَ غَيْرَ ذَلِكَ",
                "headingUrdu": "سلطان کی تعریف کرنا اور اس کے جانے کے بعد الگ الگ کہنا",
                "headingEnglish": "Praising the Sultan and saying differently after leaving him",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6884,
                "hadithNumber": "7179",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ)s said, \"The worst of all mankind is the double-faced one, who comes to some people with one face and to others, with another face.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ بدترین وہ شخص دورخا ہے ۔ کسی کے سامنے اس کا ایک رخ ہوتا ہے اور دوسرے کے سامنے دوسرا رخ برتتا ہے ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے یزید بن ابی حبیب نے ، ان سے عراک نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ،",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عِرَاكٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنْ شَرَّ النَّاسِ ذُو الْوَجْهَيْنِ، الَّذِي يَأْتِي هَؤُلاَءِ بِوَجْهٍ وَهَؤُلاَءِ بِوَجْهٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6885,
                "hadithNumber": "7180",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Hind (bint `Utba) said to the Prophet (ﷺ) \"Abu Sufyan is a miserly man and I need to take some money of his wealth.\" The Prophet (ﷺ) said, \"Take reasonably what is sufficient for you and your children \"",
                "hadithUrdu": "ہند نے نبی کریم صلی اللہ علیہ وسلم سے کہا کہ ( ان کے شوہر ) ابوسفیان بخیل ہیں اور مجھے ان کے مال میں سے لینے کی ضرورت ہوتی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ دستور کے مطابق اتنا لے لیا کرو جو تمہارے اور تمہارے بچوں کے لیے کافی ہو ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان نے خبر دی ، انہیں ہشام نے ، انہیں ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ هِنْدَ، قَالَتْ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ، فَأَحْتَاجُ أَنْ آخُذَ مِنْ مَالِهِ‏.‏ قَالَ ‏ \"‏ خُذِي مَا يَكْفِيكِ وَوَلَدَكِ بِالْمَعْرُوفِ ‏\"‏‏.‏",
                "headingArabic": "الْقَضَاءِ عَلَى الْغَائِبِ",
                "headingUrdu": "غیر حاضر شخص کے خلاف فیصلہ",
                "headingEnglish": "Judgement against an absent person",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6886,
                "hadithNumber": "7181",
                "englishNarrator": "Narrated Um Salama (the wife of the Prophet) رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) heard some people quarreling at the door of his dwelling, so he went out to them and said, \"I am only a human being, and litigants with cases of dispute come to me, and someone of you may happen to be more eloquent (in presenting his case) than the other, whereby I may consider that he is truthful and pass a judgment in his favor. If ever I pass a judgment in favor of somebody whereby he takes a Muslim's right unjustly, then whatever he takes is nothing but a piece of Fire, and it is up to him to take or leave.\"",
                "hadithUrdu": "آپ  صلی اللہ علیہ وسلم اپنے حجرہ کے دورازے پر جھگڑے کی آواز سنی تو باہر ان کی طرف نکلے ۔ پھر آپ نے فرمایا کہ میں بھی ایک انسان ہوں اور میرے پاس لوگ مقدمے لے کر آتے ہیں ۔ ممکن ہے ان میں سے ایک فریق دوسرے فریق سے بولنے میں زیادہ عمدہ ہو اور میں یقین کر لوں کی وہی سچا ہے اور اس طرح اس کے موافق فیصلہ کر دوں ۔ پس جس شخص کے لیے بھی میں کسی مسلمان کا حق دلادوں تو وہ جہنم کا ایک ٹکڑا ہے وہ چاہے اسے لے یا چھوڑ دے ، میں اس کو درحقیقت دوزخ کا ایک ٹکڑا دلارہا ہوں ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے صالح نے ، ان سے ابن شہاب نے بیان کیا ، انہیں عروہ بن زبیر نے خبر دی ، انہیں زیب بنت ابی سلمہ نے خبر دی اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ ام سلمہ رضی اللہ عنہا نے خبر دی ۔",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ، أَخْبَرَتْهُ أَنَّ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهَا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ سَمِعَ خُصُومَةً بِبَابِ حُجْرَتِهِ فَخَرَجَ إِلَيْهِمْ فَقَالَ ‏ \"‏ إِنَّمَا أَنَا بَشَرٌ، وَإِنَّهُ يَأْتِينِي الْخَصْمُ، فَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَبْلَغَ مِنْ بَعْضٍ، فَأَحْسِبُ أَنَّهُ صَادِقٌ فَأَقْضِي لَهُ بِذَلِكَ، فَمَنْ قَضَيْتُ لَهُ بِحَقِّ مُسْلِمٍ، فَإِنَّمَا هِيَ قِطْعَةٌ مِنَ النَّارِ، فَلْيَأْخُذْهَا أَوْ لِيَتْرُكْهَا ‏\"‏‏.‏",
                "headingArabic": "مَنْ قُضِيَ لَهُ بِحَقِّ أَخِيهِ فَلاَ يَأْخُذْهُ، فَإِنَّ قَضَاءَ الْحَاكِمِ لاَ يُحِلُّ حَرَامًا وَلاَ يُحَرِّمُ حَلاَلاً",
                "headingUrdu": "جسے عدالتی فیصلے کے ذریعے اس کے بھائی کا حق دیا جائے۔",
                "headingEnglish": "Whoever is given the right of his brother through a judicial decision",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6887,
                "hadithNumber": "7182",
                "englishNarrator": "Narrated `Aisha (the wife of the Prophet)  رضی اللہ عنہا :",
                "hadithEnglish": "`Utba bin Abi Waqqas said to his brother Sa`d bin Abi Waqqas رضی اللہ عنہ , \"The son of the slave girl of Zam`a is from me, so take him into your custody.\" So in the year of Conquest of Mecca, Sa`d رضی اللہ عنہ took him and said. (This is) my brother's son whom my brother has asked me to take into my custody.\" `Abd bin Zam`a got up before him and said, (He is) my brother and the son of the slave girl of my father, and was born on my father's bed.\" So they both submitted their case before Allah's Apostle. Sa`d رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! This boy is the son of my brother and he entrusted him to me.\" `Abd bin Zam`a said, \"This boy is my brother and the son of the slave girl of my father, and was born on the bed of my father.\" Allah's Messenger (ﷺ) said, \"The boy is for you, O `Abd bin Zam`a!\" Then Allah's Apostle further said, \"The child is for the owner of the bed, and the stone is for the adulterer,\" He then said to Sauda bint Zam`a رضی اللہ عنہ , \"Veil (screen) yourself before him,\" when he saw the child's resemblance to `Utba. The boy did not see her again till he met Allah.",
                "hadithUrdu": "عتبہ بن ابی وقاص نے اپنے بھائی سعد بن ابی وقاص رضی اللہ عنہ کو یہ وصیت کی تھی کہ زمعہ کی لونڈی ( کا لڑکا ) میرا ہے ۔ تم اسے اپنی پروش میں لے لینا ۔ چنانچہ فتح مکہ کے دن سعد رضی اللہ عنہ نے اسے لے لیا اور کہا کہ یہ میرے بھائی کا لڑکا ہے اور مجھے اس کے بارے میں انہوں نے وصیت کی تھی ، پھر عبد بن زمعہ کھڑے ہوئے اور کہا کہ یہ میرا بھائی ، میرے والد کی لونڈی کا لڑکا ہے اور انہیں کے فراش پر پیدا ہوا ۔ چنانچہ یہ دونوں آنحضرت صلی اللہ علیہ وسلم کے پاس پہنچے ۔ سعد رضی اللہ عنہ نے کہا کہ یا رسول اللہ ! میرے بھائی کا لڑکا ہے ، انہوں نے مجھے اس کی وصیت کی تھی اور عبد بن زمعہ نے کہا کہ میرا بھائی ہے ، میرے والد کی لونڈی کا لڑکا ہے اور انہیں کے فراش پر پیدا ہوا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ عبد بن زمعہ ! یہ تمہارا ہے ، پھر آپ نے فرمایا کہ بچہ فراش کا ہوتا ہے اور زانی کے لیے پتھر ہے ۔ پھر آپ نے سودہ بنت زمعہ رضی اللہ عنہ سے کہا کہ اس لڑکے سے پردہ کیا کرو کیونکہ آپ صلی اللہ علیہ وسلم نے لڑکے کی عتبہ سے مشابہت دیکھ لی تھی ۔ چنانچہ اس نے سودہ رضی اللہ عنہا کو موت تک نہیں دیکھا ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ بن زبیر نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ عُتْبَةُ بْنُ أَبِي وَقَّاصٍ عَهِدَ إِلَى أَخِيهِ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّ ابْنَ وَلِيدَةِ زَمْعَةَ مِنِّي فَاقْبِضْهُ إِلَيْكَ‏.‏ فَلَمَّا كَانَ عَامُ الْفَتْحِ أَخَذَهُ سَعْدٌ فَقَالَ ابْنُ أَخِي، قَدْ كَانَ عَهِدَ إِلَىَّ فِيهِ، فَقَامَ إِلَيْهِ عَبْدُ بْنُ زَمْعَةَ فَقَالَ أَخِي وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَتَسَاوَقَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ ابْنُ أَخِي، كَانَ عَهِدَ إِلَىَّ فِيهِ‏.‏ وَقَالَ عَبْدُ بْنُ زَمْعَةَ أَخِي وَابْنُ وَلِيدَةِ أَبِي، وُلِدَ عَلَى فِرَاشِهِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ ‏\"‏‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْوَلَدُ لِلْفِرَاشِ، وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏ ثُمَّ قَالَ لِسَوْدَةَ بِنْتِ زَمْعَةَ ‏\"‏ احْتَجِبِي مِنْهُ ‏\"‏، لِمَا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ، فَمَا رَآهَا حَتَّى لَقِيَ اللَّهَ تَعَالَى‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6888,
                "hadithNumber": "7183, 7184",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If somebody on the demand of a judge takes an oath to grab (a Muslim's) property and he is liar in it, he will meet Allah Who will be angry with him\". So Allah revealed: \"Verily! those who purchase a small gain at the cost of Allah's Covenant and their oaths..\" (3.77)Al-Ash`ath رضی اللہ عنہ came while `Abdullah رضی اللہ عنہ was narrating (this) to the people. Al-Ash`ath رضی اللہ عنہ said, \"This verse was revealed regarding me and another man with whom I had a quarrel about a well. The Prophet (ﷺ) said (to me), 'Do you have any evidence?' I replied, 'No.' He said, 'Let your opponent take an oath.' I said: 'I am sure he would take a (false) oath.' Thereupon it was revealed: 'Verily! those who purchase a small gain at the cost of Allah's Covenant....' \" (3.77).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص ایسی قسم کھائے جو جھوٹی ہو جس کے ذریعہ وہ کسی دوسرے کا مال مار لے تو اللہ سے وہ اس حال میں ملے گا کہ وہ اس پر غضبناک ہو گا‘پھر اللہ تعالیٰ نے یہ آیت ( اس کی تصدیق میں ) نازل فرمائی ” بلاشبہ جو لوگ اللہ کے عہد اور اس کی قسموں کو تھوڑی پونجی کے بدلے خرید تے ہیں “ ( الایہ ) ۔اتنے میں اشعث رضی اللہ عنہ بھی آ گئے۔ ابھی عبداللہ بن مسعود رضی اللہ عنہ ان سے حدیث بیان کر ہی رہے تھے۔ انہوں نے کہا کہ میرے ہی بارے میں یہ آیت نازل ہوئی تھی اور ایک شخص کے بارے میں میرا ان سے کنویں کے بارے میں جھگڑا ہوا تو نبی کریم صلی اللہ علیہ وسلم نے ( مجھ سے ) کہا کہ تمہارے پاس کوئی گواہی ہے؟ میں نے کہا کہ نہیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر فریق مقابل کی قسم پر فیصلہ ہو گا۔ میں نے کہا کہ پھر تو یہ ( جھوٹی ) قسم کھا لے گا۔ چنانچہ آیت «إن الذين يشترون بعهد الله‏» ”بلاشبہ جو لوگ اللہ کے عہد کو“ الخ نازل ہوئی۔",
                "urduNarrator": "ہم سے اسحاق بن نفر نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ کہا ہم کو سفیان نے خبر دی ‘ انہیں منصور اور اعمش نے ‘ ان سے ابووائل نے بیان کیا کہ عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، وَالأَعْمَشِ، عَنْ أَبِي وَائِلٍ، قَالَ قَالَ عَبْدُ اللَّهِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ يَحْلِفُ عَلَى يَمِينِ صَبْرٍ، يَقْتَطِعُ مَالاً وَهْوَ فِيهَا فَاجِرٌ، إِلاَّ لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ‏}‏ الآيَةَ‏.‏فَجَاءَ الأَشْعَثُ وَعَبْدُ اللَّهِ يُحَدِّثُهُمْ فَقَالَ فِيَّ نَزَلَتْ وَفِي رَجُلٍ خَاصَمْتُهُ فِي بِئْرٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَلَكَ بَيِّنَةٌ ‏\"‏‏.‏ قُلْتُ لاَ‏.‏ قَالَ ‏\"‏ فَلْيَحْلِفْ ‏\"‏‏.‏ قُلْتُ إِذًا يَحْلِفُ‏.‏ فَنَزَلَتْ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ‏}‏ الآيَةَ‏.‏",
                "headingArabic": "الْحُكْمِ فِي الْبِئْرِ وَنَحْوِهَا",
                "headingUrdu": "کنویں وغیرہ سے متعلق مقدمات کا فیصلہ",
                "headingEnglish": "Judgement regarding cases involving wells, etc.",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6889,
                "hadithNumber": "7185",
                "englishNarrator": "Narrated Um Salama رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) heard the voices of some people quarreling near his gate, so he went to them and said, \"I am only a human being and litigants with cases of disputes come to me, and maybe one of them presents his case eloquently in a more convincing and impressive way than the other, and I give my verdict in his favor thinking he is truthful. So if I give a Muslim's right to another (by mistake), then that (property) is a piece of Fire, which is up to him to take it or leave it.\" (See Hadith No. 281 )",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اپنے دروازے پر جھگڑا کرنے والوں کی آواز سنی اور ان کی طرف نکلے ۔ پھر ان سے فرمایا ‘ میں تمہارے ہی جیسا انسان ہوں ‘ میرے پاس لوگ مقدمہ لے کر آتے ہیں ‘ ممکن ہے ایک فریق دوسرے سے زیادہ عمدہ بولنے والا ہو اور میں اس کے لیے اس حق کا فیصلہ کر دوں اور یہ سمجھوں کہ میں نے فیصلہ صحیح کیا ہے ( حالانکہ وہ صحیح نہ ہو ) تو جس کے لیے میں کسی مسلمان کے حق کا فیصلہ کر دوں تو بلاشبہ یہ فیصلہ جہنم کا ایک ٹکڑا ہے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ‘ انہیں زہری نے ، انہیں عروہ بن زبیر نے ‘ انہیں زینب بنت ابی سلمہ رضی اللہ عنہ نے خبر دی ‘ ان سے ان کی والدہ ام سلمہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ، أَخْبَرَتْهُ عَنْ أُمِّهَا أُمِّ سَلَمَةَ، قَالَتْ سَمِعَ النَّبِيُّ صلى الله عليه وسلم جَلَبَةَ خِصَامٍ عِنْدَ بَابِهِ فَخَرَجَ عَلَيْهِمْ فَقَالَ ‏ \"‏ إِنَّمَا أَنَا بَشَرٌ، وَإِنَّهُ يَأْتِينِي الْخَصْمُ، فَلَعَلَّ بَعْضًا أَنْ يَكُونَ أَبْلَغَ مِنْ بَعْضٍ، أَقْضِي لَهُ بِذَلِكَ وَأَحْسِبُ أَنَّهُ صَادِقٌ، فَمَنْ قَضَيْتُ لَهُ بِحَقِّ مُسْلِمٍ فَإِنَّمَا هِيَ قِطْعَةٌ مِنَ النَّارِ، فَلْيَأْخُذْهَا أَوْ لِيَدَعْهَا ‏\"‏‏.‏",
                "headingArabic": "الْقَضَاءِ فِي كَثِيرِ الْمَالِ وَقَلِيلِهِ",
                "headingUrdu": "دولت سے متعلق مقدمات کا فیصلہ کرنا",
                "headingEnglish": "To judge cases involving wealth",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6890,
                "hadithNumber": "7186",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) came to know that one of his companions had given the promise of freeing his slave after his death, but as he had no other property than that slave, the Prophet (ﷺ) sold that slave for 800 dirhams and sent the price to him.",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم کو معلوم ہوا کہ آپ کے صحابہ میں سے ایک نے اپنے غلام کو مدبر بنا دیا ہے ( کہ ان کی موت کے بعد وہ آزاد ہو جائے گا ) چونکہ ان کے پاس اس کے سوا اور کوئی مال نہیں تھا اس لیے آنحضرت صلی اللہ علیہ وسلم نے اس غلام کو آٹھ سو درہم میں بیچ دیا اور اس کی قیمت انہیں بھیج دی ۔",
                "urduNarrator": "ہم سے ابن نمیر نے بیان کیا ‘ کہا ہم سے محمد بن بشر نے بیان کیا ‘ کہا ہم سے اسماعیل نے بیان کیا ‘ کہا ہم سے سلمہ بن کہیل نے بیان کیا ‘ ان سے عطاء نے اور ان سے جابر بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا سَلَمَةُ بْنُ كُهَيْلٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ بَلَغَ النَّبِيَّ صلى الله عليه وسلم أَنَّ رَجُلاً مِنْ أَصْحَابِهِ أَعْتَقَ غُلاَمًا عَنْ دُبُرٍ، لَمْ يَكُنْ لَهُ مَالٌ غَيْرَهُ، فَبَاعَهُ بِثَمَانِمِائَةِ دِرْهَمٍ، ثُمَّ أَرْسَلَ بِثَمَنِهِ إِلَيْهِ‏.‏",
                "headingArabic": "بَيْعِ الإِمَامِ عَلَى النَّاسِ أَمْوَالَهُمْ وَضِيَاعَهُمْ",
                "headingUrdu": "حکمران کی طرف سے لوگوں کی جائیدادیں بیچنا",
                "headingEnglish": "Selling people’s estates by the ruler on their behalf",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6891,
                "hadithNumber": "7187",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent an army unit headed by Usama bin Zaid رضی اللہ عنہ and the people criticized his leadership. The Prophet (ﷺ) said (to the people), \"If you are criticizing his leadership now, then you used to criticize his father's leadership before. By Allah, he (Usama's father) deserved the leadership and used to be one of the most beloved persons to me, and now his son (Usama رضی اللہ عنہ) is one of the most beloved persons to me after him. \" (See Hadith No. 745, Vol. 5)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک لشکر بھیجا اور اس کا امیر اسامہ بن زید رضی اللہ عنہ کو بنایا لیکن ان کی سرداری پر طعن کیا گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ اگر آج تم ان کی امارت کو مطعون قرار دیتے ہو تو تم نے اس سے پہلے اس کے والد ( زید رضی اللہ عنہ ) کی امارت کو بھی مطعون قرار دیا تھا اور خدا کی قسم وہ امارت کے لیے سزا وار تھے اور وہ مجھے تمام لوگوں میں سب سے زیادہ عزیز تھے اور یہ ( اسامہ رضی اللہ عنہ ) ان کے بعد سب سے زیادہ مجھے عزیز ہے ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ‘ انہوں نے کہا ہم سے عبد العزیز بن مسلم نے بیان کیا ، ان سے عبداللہ بن دینار نے بیان کیا‘انہوں نے کہا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ‘ انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْثًا وَأَمَّرَ عَلَيْهِمْ أُسَامَةَ بْنَ زَيْدٍ، فَطُعِنَ فِي إِمَارَتِهِ، وَقَالَ ‏ \"‏ إِنْ تَطْعَنُوا فِي إِمَارَتِهِ فَقَدْ كُنْتُمْ تَطْعَنُونَ فِي إِمَارَةِ أَبِيهِ مِنْ قَبْلِهِ، وَايْمُ اللَّهِ إِنْ كَانَ لَخَلِيقًا لِلإِمْرَةِ، وَإِنْ كَانَ لَمِنْ أَحَبِّ النَّاسِ إِلَىَّ، وَإِنَّ هَذَا لَمِنْ أَحَبِّ النَّاسِ إِلَىَّ بَعْدَهُ ‏\"‏‏.‏",
                "headingArabic": "مَنْ لَمْ يَكْتَرِثْ بِطَعْنِ مَنْ لاَ يَعْلَمُ فِي الأُمَرَاءِ حَدِيثًا",
                "headingUrdu": "جاہلوں کی طرف سے امیروں کے خلاف بہتان تراشی۔",
                "headingEnglish": "Slanders made by ignorant people against the Amirs",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6892,
                "hadithNumber": "7188",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The most hated person in the sight of Allah, is the most quarrelsome person.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ کے نزدیک سب سے مبغوض وہ شخص ہے جو سخت جھگڑا لو ہو ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘ انہوں نے کہا ہم سے یحییٰ بن سعید نے بیان کیا ‘ ان سے ابن جریج نے بیان کیا ‘ انہوں نے ابن ابی ملیکہ سے سنا ‘ وہ حضرت عائشہ رضی اللہ عنہا سے بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَبْغَضُ الرِّجَالِ إِلَى اللَّهِ الأَلَدُّ الْخَصِمُ ‏\"‏‏.‏",
                "headingArabic": "الأَلَدِّ الْخَصِمِ",
                "headingUrdu": "مخالفین میں سب سے زیادہ جھگڑالو شخص",
                "headingEnglish": "The most quarrelsome person of the opponents",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6893,
                "hadithNumber": "7189",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The prophet dispatched Hadrat Khalid bin Waleed رضی اللہ عنہ . Saalim bin Abdullah has reported from his father (Hadrat Ibn-e-Umer رضی اللہ عنہا) that the Prophet (ﷺ) sent (an army unit under the command of) Khalid bin Al-Walid رضی اللہ عنہ to fight against the tribe of Bani Jadhima and those people could not express themselves by saying, \"Aslamna,\" but they said, \"Saba'na! Saba'na! \" Khalid رضی اللہ عنہ kept on killing some of them and taking some others as captives, and he gave a captive to everyone of us and ordered everyone of us to kill his captive. I said, \"By Allah, I shall not kill my captive and none of my companions shall kill his captive!\" Then we mentioned that to the Prophet (ﷺ) and he said, \"O Allah! I am free from what Khalid bin Al-Walid رضی اللہ عنہ has done,\" and repeated it twice.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے خالد رضی اللہ عنہ کو بھیجا ۔ ( دوسری سند ) امام بخاری نے کہا اور مجھ سے نعیم بن حماد نے بیان کیا ‘ کہا ہم کو عبداللہ نے خبر دی ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں زہری نے ‘ انہیں سالم نے ‘ انہیں ان کے والد نے نبی کریم صلی اللہ علیہ وسلم نے خالد بن ولید رضی اللہ عنہ کو بنی جذیمہ ‘ کی طرف بھیجا ( جب انہیں اسلام کی دعوت دی ) تو وہ ” اسلمنا “ ( ہم اسلام لائے ) کہہ کر اچھی طرح اظہار اسلام نے کر سکے بلکہ کہنے لگے کہ صبانا صبانا ( ہم اپنے دین سے پھر گئے‘ہم اپنے دین سے پھر گئے ) اس پر خالد رضی اللہ عنہ انہیں قتل اور قید کرنے لگے اور ہم میں سے ہر شخص کو اس کا حصہ کا قیدی دیا اور ہمیں حکم دیا کہ ہر شخص اپنے قیدی کو قتل کر دے ۔ اس پر میں نے کہا کہ واللہ ! میں اپنے قیدی کو قتل نہیں کروں گا اور نہ میرے ساتھیوں میں کوئی اپنے قیدی کو قتل کرے گا ۔ پھر ہم نے اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا کہ اے اللہ ! میں اس سے برات ظاہر کرتا ہوں جو خالد بن ولید رضی اللہ عنہ رضی اللہ نے کیا ۔ دو مرتبہ ۔",
                "urduNarrator": "ہم سے محمود نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کہا ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں زہری نے انہیں سالم نے اور انہیں ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، بَعَثَ النَّبِيُّ صلى الله عليه وسلم خَالِدًا ح وَحَدَّثَنِي نُعَيْمٌ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم خَالِدَ بْنَ الْوَلِيدِ إِلَى بَنِي جَذِيمَةَ فَلَمْ يُحْسِنُوا أَنْ يَقُولُوا أَسْلَمْنَا‏.‏ فَقَالُوا صَبَأْنَا صَبَأْنَا، فَجَعَلَ خَالِدٌ يَقْتُلُ وَيَأْسِرُ، وَدَفَعَ إِلَى كُلِّ رَجُلٌ مِنَّا أَسِيرَهُ، فَأَمَرَ كُلَّ رَجُلٍ مِنَّا أَنْ يَقْتُلَ أَسِيرَهُ، فَقُلْتُ وَاللَّهِ لاَ أَقْتُلُ أَسِيرِي وَلاَ يَقْتُلُ رَجُلٌ مِنْ أَصْحَابِي أَسِيرَهُ‏.‏ فَذَكَرْنَا ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ اللَّهُمَّ إِنِّي أَبْرَأُ إِلَيْكَ مِمَّا صَنَعَ خَالِدُ بْنُ الْوَلِيدِ ‏\"‏، مَرَّتَيْنِ‏.‏",
                "headingArabic": "إِذَا قَضَى الْحَاكِمُ بِجَوْرٍ أَوْ خِلاَفِ أَهْلِ الْعِلْمِ فَهْوَ رَدٌّ",
                "headingUrdu": "اگر کوئی جج غیر منصفانہ فیصلہ دیتا ہے۔",
                "headingEnglish": "If a judge passes an unjust judgement",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6894,
                "hadithNumber": "7190",
                "englishNarrator": "Narrated Sahl bin Sa`d As-Saidi رضی اللہ عنہ :",
                "hadithEnglish": "There was some quarrel (sighting) among Bani `Amr, and when this news reached the Prophet, he offered the Zuhr prayer and went to establish peace among them. In the meantime the time of `Asr prayer was due, Bilal رضی اللہ عنہ pronounced the Adhan and then the Iqama for the prayer and requested Abu Bakr رضی اللہ عنہ (to lead the prayer) and Abu Bakr رضی اللہ عنہ went forward. The Prophet (ﷺ) arrived while Abu Bakr رضی اللہ عنہ was still praying. He entered the rows of praying people till he stood behind Abu Bakr رضی اللہ عنہ in the (first) row. The people started clapping, and it was the habit of Abu Bakr رضی اللہ عنہ that whenever he stood for prayer, he never glanced side-ways till he had finished it, but when Abu Bakr رضی اللہ عنہ observed that the clapping was not coming to an end, he looked and saw the Prophet (ﷺ) standing behind him. The Prophet (ﷺ) beckoned him to carry on by waving his hand. Abu Bakr رضی اللہ عنہ stood there for a while, thanking Allah for the saying of the Prophet (ﷺ) and then he retreated, taking his steps backwards. When the Prophet saw that, he went ahead and led the people in prayer. When he finished the prayer, he said, \"O Abu Bakr! What prevented you from carrying on with the prayer after I beckoned you to do so?\" Abu Bakr رضی اللہ عنہ replied, \"It does not befit the son of Abi Quhafa to lead the Prophet (ﷺ) in prayer.\" Then the Prophet (ﷺ) said to the people, \"If some problem arises during prayers, then the men should say, Subhan Allah!; and the women should clap.\" (See Hadith No. 652, Vol. 1)",
                "hadithUrdu": "قبیلہ بنی عمرو بن عوف میں باہم لڑائی ہو گئی ۔ جب آنحضرت صلی اللہ علیہ وسلم کو اس کی اطلاع ملی تو آپ نے ظہر کی نماز پڑھی اور ان کے یہاں صلح کرانے کے لئے تشریف لائے ۔ جب عصر کی نماز کا وقت ہوا ( مدینہ میں ) تو بلال رضی اللہ عنہ نے اذان دی اور اقامت کہی ۔ آپ نے ابوبکر رضی اللہ عنہ کو نماز پڑھانے کا حکم دیا تھا ۔ چنانچہ وہ آ گئے بڑھے ‘ اتنے میں آنحضرت صلی اللہ علیہ وسلم تشریف لے آئے ابوبکر رضی اللہ عنہ نماز ہی میں تھے‘پھر آنحضرت صلی اللہ علیہ وسلم لوگوں کی صف کو چیرتے ہوئے آگے بڑھے اور ابوبکر رضی اللہ عنہ کے پیچھے کھڑے ہو گئے اور اس صف میں آ گئے جو ان سے قریب تھی ۔ سہل رضی اللہ عنہ نے کہا کہ لوگوں نے آنحضرت صلی اللہ علیہ وسلم کی آمد کو بتانے کے لیے ہاتھ مارے ۔ ابوبکر رضی اللہ عنہ جب نماز شروع کرتے تو ختم کرنے سے پہلے کسی طرف توجہ نہیں کرتے تھے ۔ جب انہوں نے دیکھا کہ ہاتھ پر ہاتھ مارنا رکتا ہی نہیں تو آپ متوجہ ہوئے اور آنحضرت صلی اللہ علیہ وسلم کو اپنے پیچھے دیکھا لیکن آنحضرت صلی اللہ علیہ وسلم نے اشارہ کیا کہ نماز پوری کریں اور آپ نے اس طرح ہاتھ سے اپنی جگہ ٹھہرے رہنے کا اشارہ کیا ۔ ابوبکر رضی اللہ عنہ تھوڑی دیر نبی کریم صلی اللہ علیہ وسلم کے حکم پر اللہ کی حمد کرنے کے لیے ٹھہرے رہے ‘ پھر آپ الٹے پاؤں پیچھے آ گئے ۔ جب آنحضرت صلی اللہ علیہ وسلم نے یہ دیکھا تو آپ آگے بڑھے اور لوگوں کو آپ نے نماز پڑھائی ۔ نماز پوری کرنے کے بعد آپ نے فرمایا ‘ ابوبکر ! جب میں نے ارشاد کر دیا تھا تو آپ کو نماز پوری پڑھانے میں کیا چیز مانع تھی ؟ انہوں نے عرض کیا ‘ ابن ابی قحافہ کے لیے مناسب نہیں تھا کہ وہ آنحضرت صلی اللہ علیہ وسلم کی امامت کرے اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ( نماز میں ) جب کوئی معاملہ پیش آئے تو مردوں کو سبحان اللہ کہنا چاہئیے اور عورتوں کو ہاتھ پر ہاتھ مارنا چاہئے ۔",
                "urduNarrator": "ہم سے ابو النعمان نے بیان کیا ‘ کہا ہم سے حماد نے بیان کیا ‘ ان سے ابوحازم المدینی نے بیان کیا اور ان سے سہل بن سعد الساعدی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَبُو حَازِمٍ الْمَدِينِيُّ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ كَانَ قِتَالٌ بَيْنَ بَنِي عَمْرٍو، فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَصَلَّى الظُّهْرَ، ثُمَّ أَتَاهُمْ يُصْلِحُ بَيْنَهُمْ، فَلَمَّا حَضَرَتْ صَلاَةُ الْعَصْرِ فَأَذَّنَ بِلاَلٌ وَأَقَامَ وَأَمَرَ أَبَا بَكْرٍ فَتَقَدَّمَ، وَجَاءَ النَّبِيُّ صلى الله عليه وسلم وَأَبُو بَكْرٍ فِي الصَّلاَةِ، فَشَقَّ النَّاسَ حَتَّى قَامَ خَلْفَ أَبِي بَكْرٍ، فَتَقَدَّمَ فِي الصَّفِّ الَّذِي يَلِيهِ‏.‏ قَالَ وَصَفَّحَ الْقَوْمُ، وَكَانَ أَبُو بَكْرٍ إِذَا دَخَلَ فِي الصَّلاَةِ لَمْ يَلْتَفِتْ حَتَّى يَفْرُغَ، فَلَمَّا رَأَى التَّصْفِيحَ لاَ يُمْسَكُ عَلَيْهِ الْتَفَتَ فَرَأَى النَّبِيَّ صلى الله عليه وسلم خَلْفَهُ، فَأَوْمَأَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم أَنِ امْضِهْ وَأَوْمَأَ بِيَدِهِ هَكَذَا، وَلَبِثَ أَبُو بَكْرٍ هُنَيَّةً يَحْمَدُ اللَّهَ عَلَى قَوْلِ النَّبِيِّ صلى الله عليه وسلم ثُمَّ مَشَى الْقَهْقَرَى، فَلَمَّا رَأَى النَّبِيُّ صلى الله عليه وسلم ذَلِكَ تَقَدَّمَ فَصَلَّى النَّبِيُّ صلى الله عليه وسلم بِالنَّاسِ، فَلَمَّا قَضَى صَلاَتَهُ قَالَ ‏\"‏ يَا أَبَا بَكْرٍ مَا مَنَعَكَ إِذْ أَوْمَأْتُ إِلَيْكَ أَنْ لاَ تَكُونَ مَضَيْتَ ‏\"‏‏.‏ قَالَ لَمْ يَكُنْ لاِبْنِ أَبِي قُحَافَةَ أَنْ يَؤُمَّ النَّبِيَّ صلى الله عليه وسلم‏.‏ وَقَالَ لِلْقَوْمِ ‏\"‏ إِذَا نَابَكُمْ أَمْرٌ، فَلْيُسَبِّحِ الرِّجَالُ، وَلْيُصَفِّحِ النِّسَاءُ ‏\"‏‏.‏",
                "headingArabic": "الإِمَامِ يَأْتِي قَوْمًا فَيُصْلِحُ بَيْنَهُمْ",
                "headingUrdu": "امام لوگوں کے درمیان امن قائم کرے گا۔",
                "headingEnglish": "The Imam going to establish peace among people",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6895,
                "hadithNumber": "7191",
                "englishNarrator": "Narrated Zaid bin Thabit رضی اللہ عنہ :",
                "hadithEnglish": "Abu Bak رضی اللہ عنہ sent for me owing to the large number of casualties in the battle of Al-Yamama, while `Umar رضی اللہ عنہ was sitting with him. Abu Bakr رضی اللہ عنہ said (to me), `Umar رضی اللہ عنہ has come to my and said, 'A great number of Qaris of the Holy Qur'an were killed on the day of the battle of Al-Yamama, and I am afraid that the casualties among the Qaris of the Qur'an may increase on other battle-fields whereby a large part of the Qur'an may be lost. Therefore I consider it advisable that you (Abu Bakr رضی اللہ عنہ ) should have the Qur'an collected.' I said, 'How dare I do something which Allah's Messenger (ﷺ) did not do?' `Umar رضی اللہ عنہ said, By Allah, it is something beneficial.' `Umar رضی اللہ عنہ kept on pressing me for that till Allah opened my chest for that for which He had opened the chest of `Umar رضی اللہ عنہ and I had in that matter, the same opinion as `Umar رضی اللہ عنہ had.\" Abu Bakr رضی اللہ عنہ then said to me (Zaid رضی اللہ عنہ ), \"You are a wise young man and we do not have any suspicion about you, and you used to write the Divine Inspiration for Allah's Messenger (ﷺ). So you should search for the fragmentary scripts of the Qur'an and collect it (in one Book).\" Zaid رضی اللہ عنہ further said: By Allah, if Abu Bakr رضی اللہ عنہ had ordered me to shift a mountain among the mountains from one place to another it would not have been heavier for me than this ordering me to collect the Qur'an. Then I said (to `Umar and Abu Bakr), \"How can you do something which Allah's Messenger (ﷺ) did not do?\" Abu Bakr رضی اللہ عنہ said, \"By Allah, it is something beneficial.\" Zaid added: So he (Abu Bakr رضی اللہ عنہ ) kept on pressing me for that until Allah opened my chest for that for which He had opened the chests of Abu Bakr رضی اللہ عنہ and `Umar رضی اللہ عنہ , and I had in that matter, the same opinion as theirs. So I started compiling the Qur'an by collecting it from the leafless stalks of the date-palm tree and from the pieces of leather and hides and from the stones, and from the chests of men (who had memorized the Qur'an). I found the last verses of Sirat-at-Tauba: (\"Verily there has come unto you an Apostle (Muhammad) from amongst yourselves--' (9.128-129) ) from Khuza`ima or Abi Khuza`ima رضی اللہ عنہ and I added to it the rest of the Sura. The manuscripts of the Qur'an remained with Abu Bakr رضی اللہ عنہ till Allah took him unto Him. Then it remained with `Umar رضی اللہ عنہ till Allah took him unto Him, and then with Hafsa bint `Umar رضی اللہ عنہ . Muhammad bin Obaidullah states that '' اللِّخَافُ '' means gravels.",
                "hadithUrdu": "جنگ یمامہ میں بکثرت ( قاری صحابہ کی ) شہادت کی وجہ سے ابوبکر رضی اللہ عنہ نے مجھے بلا بھیجا ۔ ان کے پاس عمر رضی اللہ عنہ بھی تھے ۔ ابوبکر رضی اللہ عنہ نے مجھ سے کہا کہ عمر میرے پاس آئے اور کہا کہ جنگ یمامہ میں قرآن کے قاریوں کا قتل بہت ہوا ہے اور میرا خیال ہے کہ دوسری جنگوں میں بھی اسی طرح وہ شہید کئے جائیں گے اور قرآن اکثر ضائع ہو جائے گا ۔ میں سمجھتا ہوں کہ آپ قرآن مجید کو ( کتابی صورت میں ) جمع کرنے کا حکم دیں ۔ اس پر میں نے عمر رضی اللہ عنہ سے کہا کہ میں کوئی ایسا کام کیسے کر سکتا ہوں جسے رسول اللہ صلی اللہ علیہ وسلم نے نہیں کیا ۔ عمر رضی اللہ عنہ نے کہا واللہ ! یہ تو کار خیر ہے ۔ عمر رضی اللہ عنہ اس معاملہ میں برابر مجھ سے کہتے رہے ‘ یہاں تک کہ اللہ تعالیٰ نے اسی طرح اس معاملے میں میرا بھی سینہ کھول دیا جس طرح عمر رضی اللہ عنہ کا تھا اور میں بھی وہی مناسب سمجھنے لگا جسے عمر رضی اللہ عنہ مناسب سمجھتے تھے ۔ زید رضی اللہ عنہ نے بیان یا کہ مجھ سے ابوبکر رضی اللہ عنہ نے کہا کہ تم جوان ہو ‘ عقلمند ہو اور ہم تمہیں کسی بارے میں متہم بھی نہیں سمجھتے تم آنحضرت صلی اللہ علیہ وسلم کی وحی بھی لکھتے تھے ‘ پس تم اس قرآن مجید ( کی آیات ) کو تلاش کرو اور ایک جگہ جمع کر دو ۔ زید رضی اللہ عنہ نے بیان کیا کہ واللہ ! اگر ابوبکر رضی اللہ عنہ مجھے کسی پہاڑ کو اٹھا کر دوسری جگہ رکھنے کا مکلف کرتے تو اس کا بوجھ بھی میں اتنانہ محسوس کرتا جتنا کہ مجھے قرآن مجید کو جمع کرنے کے حکم سے محسوس ہوا ۔ میں نے ان لوگوں سے کہا کہ آپ کس طرح ایسا کام کرتے ہیں جو رسول اللہ صلی اللہ علیہ وسلم نے نہیں کیا ۔ ابوبکرنے کہا کہ واللہ ! یہ خیر ہے ۔ چنانچہ مجھے آمادہ کرنے کی کوشش کرتے رہے ‘ یہاں تک کہ اللہ تعالیٰ نے اس کام کے لیے میرا بھی سینہ کھول دیا جس کے لئے ابوبکر وعمر رضی اللہ عنہما کا سینہ کھولا تھا اور میں بھی وہی مناسب خیال کرنے لگا جسے وہ لوگ مناسب خیال کر رہے تھے ۔ چنانچہ میں نے قرآن مجید کی تلاش شروع کی ۔ اسے میں کھجور کی چھال ‘ چمڑے وغیرہ کے ٹکڑوں ‘ پتلے پتھر کے ٹکڑوں اور لوگوں کے سینوں سے جمع کرنے لگا ۔ میں نے سورۃ التوبہ کی آخری آیت لقد جاء کم رسول من ا نفسکم آخر تک خزیمہ یا ابو خزیمہ رضی اللہ عنہ کے پاس پائی اور اس کو سورت میں شامل کر لیا ۔ ( قرآن مجید کے یہ مرتب ) صحیفے ابوبکر رضی اللہ عنہ کے پاس رہے جب تک وہ زندہ ہے ۔ یہاں تک کہ اللہ تعالیٰ نے انہیں وفات دی ‘ پھر وہ عمر رضی اللہ عنہ کے پاس آ گئے اور آخر وقت تک ان کے پاس رہے ۔ جب آپ کو بھی اللہ تعالیٰ نے وفات دی تو وہ حفصہ بن عمر رضی اللہ عنہ کے پاس محفوظ رہے ۔ محمد بن عبیداللہ نے کہا کہ ” اللخاف “ کے لفظ سے ٹھیکری مراد ہے جسے خزف کہتے ہیں ۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ ابو ثابت نے بیان کیا ‘ کہا ہم سے ابراہیم بن سعد نے بیان کیا ‘ ان سے ابن شہاب نے ‘ ان سے عبید بن سابق نے اور ان سے زید بن ثابت رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ أَبُو ثَابِتٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ بْنِ السَّبَّاقِ، عَنْ زَيْدِ بْنِ ثَابِتٍ، قَالَ بَعَثَ إِلَىَّ أَبُو بَكْرٍ لِمَقْتَلِ أَهْلِ الْيَمَامَةِ وَعِنْدَهُ عُمَرُ فَقَالَ أَبُو بَكْرٍ إِنَّ عُمَرَ أَتَانِي فَقَالَ إِنَّ الْقَتْلَ قَدِ اسْتَحَرَّ يَوْمَ الْيَمَامَةِ بِقُرَّاءِ الْقُرْآنِ، وَإِنِّي أَخْشَى أَنْ يَسْتَحِرَّ الْقَتْلُ بِقُرَّاءِ الْقُرْآنِ فِي الْمَوَاطِنِ كُلِّهَا، فَيَذْهَبَ قُرْآنٌ كَثِيرٌ، وَإِنِّي أَرَى أَنْ تَأْمُرَ بِجَمْعِ الْقُرْآنِ‏.‏ قُلْتُ كَيْفَ أَفْعَلُ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ عُمَرُ هُوَ وَاللَّهِ خَيْرٌ‏.‏ فَلَمْ يَزَلْ عُمَرُ يُرَاجِعُنِي فِي ذَلِكَ حَتَّى شَرَحَ اللَّهُ صَدْرِي لِلَّذِي شَرَحَ لَهُ صَدْرَ عُمَرَ، وَرَأَيْتُ فِي ذَلِكَ الَّذِي رَأَى عُمَرُ‏.‏ قَالَ زَيْدٌ قَالَ أَبُو بَكْرٍ وَإِنَّكَ رَجُلٌ شَابٌّ عَاقِلٌ لاَ نَتَّهِمُكَ، قَدْ كُنْتَ تَكْتُبُ الْوَحْىَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَتَتَبَّعِ الْقُرْآنَ فَاجْمَعْهُ‏.‏ قَالَ زَيْدٌ فَوَاللَّهِ لَوْ كَلَّفَنِي نَقْلَ جَبَلٍ مِنَ الْجِبَالِ مَا كَانَ بِأَثْقَلَ عَلَىَّ مِمَّا كَلَّفَنِي مِنْ جَمْعِ الْقُرْآنِ‏.‏ قُلْتُ كَيْفَ تَفْعَلاَنِ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ أَبُو بَكْرٍ هُوَ وَاللَّهِ خَيْرٌ‏.‏ فَلَمْ يَزَلْ يَحُثُّ مُرَاجَعَتِي حَتَّى شَرَحَ اللَّهُ صَدْرِي لِلَّذِي شَرَحَ اللَّهُ لَهُ صَدْرَ أَبِي بَكْرٍ وَعُمَرَ، وَرَأَيْتُ فِي ذَلِكَ الَّذِي رَأَيَا، فَتَتَبَّعْتُ الْقُرْآنَ أَجْمَعُهُ مِنَ الْعُسُبِ وَالرِّقَاعِ وَاللِّخَافِ وَصُدُورِ الرِّجَالِ، فَوَجَدْتُ آخِرَ سُورَةِ التَّوْبَةِ ‏{‏لَقَدْ جَاءَكُمْ رَسُولٌ مِنْ أَنْفُسِكُمْ‏}‏ إِلَى آخِرِهَا مَعَ خُزَيْمَةَ أَوْ أَبِي خُزَيْمَةَ فَأَلْحَقْتُهَا فِي سُورَتِهَا، وَكَانَتِ الصُّحُفُ عِنْدَ أَبِي بَكْرٍ حَيَاتَهُ حَتَّى تَوَفَّاهُ اللَّهُ عَزَّ وَجَلَّ، ثُمَّ عِنْدَ عُمَرَ حَيَاتَهُ حَتَّى تَوَفَّاهُ اللَّهُ، ثُمَّ عِنْدَ حَفْصَةَ بِنْتِ عُمَرَ‏.‏ قَالَ مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ اللِّخَافُ يَعْنِي الْخَزَفَ‏.‏",
                "headingArabic": "يُسْتَحَبُّ لِلْكَاتِبِ أَنْ يَكُونَ أَمِينًا عَاقِلاً",
                "headingUrdu": "یہ ضروری ہے کہ ایک کاتب دیانت دار اور عقلمند ہو۔",
                "headingEnglish": "It is desirable that a scribe should be honest and wise",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6896,
                "hadithNumber": "7192",
                "englishNarrator": "Narrated Abu Laila bin `Abdullah bin `Abdur-Rahman bin Sahl:",
                "hadithEnglish": "Sahl bin Abi Hathma and some great men of his tribe said, `Abdullah bin 'Sahl and Muhaiyisa رضی اللہ عنہ went out to Khaibar as they were struck with poverty and difficult living conditions. Then Muhaiyisa was informed that `Abdullah had been killed and thrown in a pit or a spring. Muhaiyisa went to the Jews and said, \"By Allah, you have killed my companion.\" The Jews said, \"By Allah, we have not killed him.\" Muhaiyisa رضی اللہ عنہ then came back to his people and told them the story. He, his elder brother Huwaiyisa and `Abdur-Rahman bin Sahl رضی اللہ عنہ came (to the Prophet) and he who had been at Khaibar, proceeded to speak, but the Prophet (ﷺ) said to Muhaiyisa, \"The eldest! The eldest!\" meaning, \"Let the eldest of you speak.\" So Huwaiyisa spoke first and then Muhaiyisa. Allah's Messenger (ﷺ) said, \"The Jews should either pay the blood money of your (deceased) companion or be ready for war.\" After that Allah's Messenger (ﷺ) wrote a letter to the Jews in that respect, and they wrote that they had not killed him. Then Allah's Messenger (ﷺ) said to Huwaiyisa, Muhaiyisa and `Abdur-Rahman رضی اللہ عنہ , \"Can you take an oath by which you will be entitled to take the blood money?\" They said, \"No.\" He said (to them), \"Shall we ask the Jews to take an oath before you?\" They replied, \"But the Jews are not Muslims.\" So Allah's Apostle gave them one-hundred she-camels as blood money from himself. Sahl رضی اللہ عنہ added: When those she-camels were made to enter the house, one of them kicked me with its leg.",
                "hadithUrdu": "ان سے سہل بن ابی حثمہ نے ، انہیں سہل اور ان کی قوم کے بعض دوسرے ذمہ داروں نے خبر دی کہ عبداللہ سہل اور محیصہ رضی اللہ عنہ خیبر کی طرف ( کھجور لینے کے لیے ) گئے ۔ کیونکہ تنگ دستی میں مبتلا تھے ۔ پھر محیصہ کو بتایا گیا کہ عبداللہ کو کسی نے قتل کر کے گڑھے یا کنویں میں ڈال دیا ہے ۔ پھر وہ یہودیوں کے پاس گئے اور کہا کہ واللہ ! تم نے ہی قتل کیا ہے ۔ انہوں نے کہا واللہ ! ہم نے انہیں نہیں قتل کیا ۔ پھر وہ واپس آئے اور اپنی قوم کے پاس آئے اور ان سے ذکر کیا ۔ اس کے بعد وہ اور ان کے بھائی حویصہ جو ان سے بڑے تھے اور عبدالرحمٰن بن سہل رضی اللہ عنہ آئے ‘پھر محیصہ رضی اللہ عنہ نے بات کرنی چاہی کیونکہ آپ ہی خیبر میں موجود تھے لیکن آنحضرت صلی اللہ علیہ وسلم نے ان سے کہا کہ بڑے کو آگے کرو ‘ بڑے کو آپ کی مراد عمر کی بڑائی تھی ۔ چنانچہ حویصہ نے بات کی ، پھر محیصہ نے بھی بات کی ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہودی تمہارے ساتھی کی دیت ادا کریں ورنہ لڑائی کے لیے تیار ہو جائیں ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے یہودیوں کو اس مقدمہ میں لکھا ۔ انہوں نے جواب میں یہ لکھا کہ ہم نے انہیں نہیں قتل کیا ہے ۔ پھر آپ نے حویصہ ‘ محیصہ اور عبدالرحمٰن رضی اللہ عنہ سے کہا کہ کیا آپ لوگ قسم کھا کر اپنے شہید ساتھی کے خون کے مستحق ہو سکتے ہیں ؟ ان لوگوں نے کہا کہ نہیں ( کیونکہ جرم کرتے دیکھا نہیں تھا ) پھر آپ نے فرمایا ‘ کیا آپ لوگوں کے بجائے یہودی قسم کھائیں ( کہ انہوں نے قتل نہیں کیا ہے ) ؟ انہوں نے کہا کہ وہ مسلمان نہیں ہیں اور وہ جھوٹی قسم کھا سکتے ہیں ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے اپنی طرف سے سو اونٹوں کی دیت ادا کی اور وہ اونٹ گھر میں لائے گئے ۔ سہل رضی اللہ عنہ نے بیان کیا کہ ان میں سے ایک اونٹنی نے مجھے لات ماری ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ کہا ہم کو امام مالک نے خبر دی ‘ انہیں ابن ابی لیلیٰ نے ( دوسری سند ) امام بخاری نے کہا کہ ہم سے اسماعیل نے بیان کیا ‘ کہا ہم سے امام مالک نے بیان کیا ‘ان سے ابو لیلیٰ بن عبداللہ بن عبدالرحمٰن بن سہل نے ،",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي لَيْلَى، ح حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ أَبِي لَيْلَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَهْلٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، أَنَّهُ أَخْبَرَهُ هُوَ، وَرِجَالٌ، مِنْ كُبَرَاءِ قَوْمِهِ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ، فَأُخْبِرَ مُحَيِّصَةُ أَنَّ عَبْدَ اللَّهِ قُتِلَ وَطُرِحَ فِي فَقِيرٍ أَوْ عَيْنٍ، فَأَتَى يَهُودَ فَقَالَ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ‏.‏ قَالُوا مَا قَتَلْنَاهُ وَاللَّهِ‏.‏ ثُمَّ أَقْبَلَ حَتَّى قَدِمَ عَلَى قَوْمِهِ فَذَكَرَ لَهُمْ، وَأَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ ـ وَهْوَ أَكْبَرُ مِنْهُ ـ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ، فَذَهَبَ لِيَتَكَلَّمَ وَهْوَ الَّذِي كَانَ بِخَيْبَرَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم لِمُحَيِّصَةَ ‏\"‏ كَبِّرْ كَبِّرْ ‏\"‏‏.‏ يُرِيدُ السِّنَّ، فَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِمَّا أَنْ يَدُوا صَاحِبَكُمْ، وَإِمَّا أَنْ يُؤْذِنُوا بِحَرْبٍ ‏\"‏‏.‏ فَكَتَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَيْهِمْ بِهِ، فَكُتِبَ مَا قَتَلْنَاهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ ‏\"‏ أَتَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ ‏\"‏‏.‏ قَالُوا لاَ‏.‏ قَالَ ‏\"‏ أَفَتَحْلِفُ لَكُمْ يَهُودُ ‏\"‏‏.‏ قَالُوا لَيْسُوا بِمُسْلِمِينَ‏.‏ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ مِائَةَ نَاقَةٍ حَتَّى أُدْخِلَتِ الدَّارَ‏.‏ قَالَ سَهْلٌ فَرَكَضَتْنِي مِنْهَا نَاقَةٌ‏.‏",
                "headingArabic": "كِتَابِ الْحَاكِمِ إِلَى عُمَّالِهِ، وَالْقَاضِي إِلَى أُمَنَائِهِ",
                "headingUrdu": "حکمران کی طرف سے نمائندوں کو اور جج کی طرف سے کارکنوں کو خط لکھنا",
                "headingEnglish": "The writing of a letter by the ruler to representatives and by judge to workers",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6897,
                "hadithNumber": "7193, 7194",
                "englishNarrator": "Narrated Abu Huraira and Zaid bin Khalid Al-Juhani رضی اللہ عنہما :",
                "hadithEnglish": "A bedouin came and said, \"O Allah's Messenger (ﷺ)! Judge between us according to Allah's Book (Laws).\" His opponent stood up and said, \"He has said the truth, so judge between us according to Allah's Laws.\" The bedouin said, \"My son was a laborer for this man and committed illegal sexual intercourse with his wife. The people said to me, 'Your son is to be stoned to death,' so I ransomed my son for one hundred sheep and a slave girl. Then I asked the religious learned men and they said to me, 'Your son has to receive one hundred lashes plus one year of exile.' \" The Prophet (ﷺ) said, \"I shall judge between you according to Allah's Book (Laws)! As for the slave girl and the sheep, it shall be returned to you, and your son shall receive one-hundred lashes and be exiled for one year. O you, Unais!\" The Prophet (ﷺ) addressed some man, \"Go in the morning to the wife of this man and stone her to death.\" So Unais رضی اللہ عنہ went to her the next morning and stoned her to death.",
                "hadithUrdu": "ایک دیہاتی آئے اور عرض کیا یا رسول اللہ ! ہمارا فیصلہ کتاب اللہ کے مطابق کر دیجئیے ۔ پھر دوسرے فریق کھڑے ہوئے اور انہوں نے بھی کہا کہ یہ صحیح کہتے ہیں ‘ ہمارا فیصلہ کتاب اللہ سے کر دیجئیے ۔ پھر دیہاتی نے کہا ‘ میرا لڑکا اس شخص کے یہاں مزدور تھا ‘ پھر اس نے اس کی بیوی کے ساتھ زنا کر لیا تو لوگوں نے مجھ سے کہا کہ تمہارے لڑکے کا حکم اسے رجم کرنا ہے لیکن میں نے اپنے لڑکے کی طرف سے سو بکریوں اور ایک باندی کا فدیہ دے دیا ۔ پھر میں نے اہل علم سے پوچھا تو انہوں نے کہا کہ تمہارے لڑکے کو سو کوڑے مارے جائیں گے اور ایک سال کے لیے شہر بدر ہو گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہارے درمیان اللہ کی کتاب کے مطابق فیصلہ کروں گا ۔ باندی اور بکریاں تو تمہیں واپس ملیں گی اور تیرے لڑکے کی سزا سو کوڑے اور ایک سال کے لیے جلاوطن ہونا ہے اور انیس ( جو ایک صحابی تھے ) سے فرمایا کہ تم اس کی بیوی کے پاس جاؤ اور اسے رجم کرو ۔ چنانچہ انیس رضی اللہ عنہ اس کے پاس گئے اور اسے رجم کیا ۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا ‘ کہا ہم سے ابن ابی ذئب نے بیان کیا ‘کہا ہم سے زہری نے بیان کیا ‘ ان سے عبیداللہ بن عبداللہ نے اور ان سے ابوہریرہ اور زید بن خالد الجہنی رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، قَالاَ جَاءَ أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ فَقَامَ خَصْمُهُ فَقَالَ صَدَقَ فَاقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ‏.‏ فَقَالَ الأَعْرَابِيُّ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا فَزَنَى بِامْرَأَتِهِ، فَقَالُوا لِي عَلَى ابْنِكَ الرَّجْمُ‏.‏ فَفَدَيْتُ ابْنِي مِنْهُ بِمِائَةٍ مِنَ الْغَنَمِ وَوَلِيدَةٍ، ثُمَّ سَأَلْتُ أَهْلَ الْعِلْمِ فَقَالُوا إِنَّمَا عَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ، أَمَّا الْوَلِيدَةُ وَالْغَنَمُ فَرَدٌّ عَلَيْكَ، وَعَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، وَأَمَّا أَنْتَ يَا أُنَيْسُ ـ لِرَجُلٍ ـ فَاغْدُ عَلَى امْرَأَةِ هَذَا فَارْجُمْهَا ‏\"‏‏.‏ فَغَدَا عَلَيْهَا أُنَيْسٌ فَرَجَمَهَا‏.",
                "headingArabic": "هَلْ يَجُوزُ لِلْحَاكِمِ أَنْ يَبْعَثَ رَجُلاً وَحْدَهُ لِلنَّظَرِ فِي الأُمُورِ",
                "headingUrdu": "صرف ایک آدمی کو بعض امور کے انتظام کے لیے بھیجنا",
                "headingEnglish": "To send one man only to manage certain affairs",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6898,
                "hadithNumber": "7195",
                "englishNarrator": "Narrated Zaid bin Thabit رضی اللہ عنہ :",
                "hadithEnglish": "\"The Prophet (ﷺ) ordered me to learn the writing of the Jews. I even wrote letters for the Prophet (ﷺ) (to the Jews) and also read their letters when they wrote to him.\"And 'Umar رضی اللہ عنہ while Hadrat Ali, Hadrat Abdur Rehman and Hadrat Uthman رضی اللہ عنہ were accompaning him, said: What does she say? Hadrat Abdur Rehman bin Khatib states that he said: She is telling you about her Companion who has wronged her. Abu Jamrah states that he would act as an interpreter between Hadrat Ibn-e-Abbas رضی اللہ عنہما and have two interpreters.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ یہودیوں کی تحریر سیکھیں ‘ یہاں تک کہ میں یہودیوں کے نام آنحضرت صلی اللہ علیہ وسلم کے خطوط لکھتا تھا اور جب یہودی آپ کو لکھتے تو ان کے خطوط آپ کو پڑھ کر سناتا تھا ۔ عمر رضی اللہ عنہ نے عبدالرحمٰن بن حاطب سے پوچھا‘اس وقت ان کے پاس علی ‘ عبدالرحمٰن اور عثمان رضی اللہ عنہ بھی موجود تھے کہ یہ لونڈی کیا کہتی ہے ؟ عبدالرحمٰن بن حاطب نے کہا کہ امیرالمؤمنین یہ آپ کو اس کے متعلق بتاتی ہے جس نے اس کے ساتھ زنا کیا ہے ۔ ( جو یرغوس نام کا غلام تھا ) اور ابوجمرہ نے کہا کہ میں ابن عباس رضی اللہ عنہما اور لوگوں کے درمیان ترجمانی کرتا تھا اور بعض لوگوں ( امام محمد اور شافعی ) نے کہا کہ حاکم کے لیے دو ترجموں کا ہونا ضروری ہے ۔",
                "urduNarrator": "ر خارجہ بن زید بن ثابت نے اپنے والد زید بن ثابت رضی اللہ عنہ سے بیان کیا کہ",
                "hadithArabic": "وَقَالَ خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَهُ أَنْ يَتَعَلَّمَ كِتَابَ الْيَهُودِ، حَتَّى كَتَبْتُ لِلنَّبِيِّ صلى الله عليه وسلم كُتُبَهُ، وَأَقْرَأْتُهُ كُتُبَهُمْ إِذَا كَتَبُوا إِلَيْهِ، وَقَالَ عُمَرُ وَعِنْدَهُ عَلِيٌّ وَعَبْدُ الرَّحْمَنِ وَعُثْمَانُ مَاذَا تَقُولُ هَذِهِ قَالَ عَبْدُ الرَّحْمَنِ بْنُ حَاطِبٍ فَقُلْتُ تُخْبِرُكَ بِصَاحِبِهِمَا الَّذِي صَنَعَ بِهِمَا‏.‏ وَقَالَ أَبُو جَمْرَةَ كُنْتُ أُتَرْجِمُ بَيْنَ ابْنِ عَبَّاسٍ وَبَيْنَ النَّاسِ‏.‏ وَقَالَ بَعْضُ النَّاسِ لاَ بُدَّ لِلْحَاكِمِ مِنْ مُتَرْجِمَيْنِ‏.‏",
                "headingArabic": "تَرْجَمَةِ الْحُكَّامِ، وَهَلْ يَجُوزُ تُرْجُمَانٌ وَاحِدٌ",
                "headingUrdu": "حاکم کے مترجم",
                "headingEnglish": "The translators of a ruler",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6899,
                "hadithNumber": "7196",
                "englishNarrator": "Narrated `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Abu Sufyan bin Harb told him that Heraclius had called him along with the members of a Quraish caravan and then said to his interpreter, \"Tell them that I want to ask this (Abu Sufyan) a question, and if he tries to tell me a lie, they should contradict him.\" Then Abu Sufyan mentioned the whole narration and said that Heraclius said to the inter Peter, \"Say to him (Abu Sufyan), 'If what you say is true, then he (the Prophet) will take over the place underneath my two feet.' \"",
                "hadithUrdu": "ابوسفیان بن حرب نے انہیں خبر دی کہ ہرقل نے انہیں قریش کی ایک جماعت کے ساتھ بلا بھیجا ‘ پھر اپنے ترجمان سے کہا ‘ ان سے کہو کہ میں ان کے بارے میں پوچھوں گا ۔ اگر یہ مجھ سے جھوٹ بات کہے تو اسے جھٹلا دیں ۔ پھر پوری حدیث بیان کی اس سے کہو کہ اگر تمہاری باتیں صحیح ہیں تو وہ شخص اس ملک کا بھی ہو جائے گا جو اس وقت میرے قدموں کے نیچے ہے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی انہیں زہری نے ‘ انہیں عبیداللہ بن عبداللہ نے خبر دی اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ أَبَا سُفْيَانَ بْنَ حَرْبٍ أَخْبَرَهُ أَنَّ هِرَقْلَ أَرْسَلَ إِلَيْهِ فِي رَكْبٍ مِنْ قُرَيْشٍ، ثُمَّ قَالَ لِتَرْجُمَانِهِ قُلْ لَهُمْ إِنِّي سَائِلٌ هَذَا، فَإِنْ كَذَبَنِي فَكَذِّبُوهُ‏.‏ فَذَكَرَ الْحَدِيثَ فَقَالَ لِلتَّرْجُمَانِ قُلْ لَهُ إِنْ كَانَ مَا تَقُولُ حَقًّا فَسَيَمْلِكُ مَوْضِعَ قَدَمَىَّ هَاتَيْنِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6900,
                "hadithNumber": "7197",
                "englishNarrator": "Narrated Abu Humaid As-Sa`idi:",
                "hadithEnglish": "The Prophet (ﷺ) employed Ibn Al-Utbiyya to collect Zakat from Bani Sulaim, and when he returned (with the money) to Allah's Messenger (ﷺ) the Prophet (ﷺ) called him to account, and he said, \"This (amount) is for you, and this was given to me as a present.\" Allah's Messenger (ﷺ) said, \"Why don't you stay at your father's house or your mother's house to see whether you will be given gifts or not, if you are telling the truth?\" Then Allah's Messenger (ﷺ) stood up and addressed the people, and after glorifying and praising Allah, he said: Amma Ba'du (then after) I employ some men from among you for some job which Allah has placed in my charge, and then one of you comes to me and says, 'This (amount) is for you and this is a gift given to me.' Why doesn't he stay at the house of his father or the house of his mother and see whether he will be given gifts or not if he was telling the truth by Allah, none of you takes anything of it (i.e., Zakat) for himself (Hisham added: unlawfully) but he will meet Allah on the Day of Resurrection carrying it on his neck! I do not want to see any of you carrying a grunting camel or a mooing cow or a bleating sheep on meeting Allah.\" Then the Prophet (ﷺ) raised both his hands till I saw the whiteness of his armpits, and said, \"(No doubt)! Haven't I conveyed Allah's Message!\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ابن الاتیہ کو بنی سلیم کے صدقہ کی وصول یابی کے لیے عامل بنایا ۔ جب وہ آنحضرت صلی اللہ علیہ وسلم کے پاس ( وصول یابی کر کے ) آئے اور آنحضرت صلی اللہ علیہ وسلم نے ان سے حساب طلب فرمایا تو انہوں نے کہا یہ تو آپ لوگوں کا ہے اور یہ مجھے ہدیہ دیا گیا ہے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر تم اپنے ماں باپ کے گھر کیوں نہ بیٹھے رہے ‘ اگر تم سچے ہو تو وہاں بھی تمہارے پاس ہدیہ آتا ۔ پھر آپ کھڑے ہوئے اور لوگوں کو خطبہ دیا ۔ آپ نے حمد و ثنا کے بعد فرمایا ۔ امابعد ! میں کچھ لوگوں کو بعض ان کاموں کے لیے عامل بنا تا ہوں جو اللہ تعالیٰ نے مجھے سونپے ہیں ‘ پھر تم میں سے کوئی ایک آتا ہے اور کہتا ہے کہ یہ مال تمہارا ہے اور یہ ہدیہ ہے جو مجھے دیا گیا ہے ۔ اگر وہ سچا ہے تو پھر کیوں نہ وہ اپنے باپ یا اپنی ماں کے گھر میں بیٹھا رہا تاکہ وہیں اس کا ہدیہ پہنچ جاتا ۔ پس خدا کا قسم تم میں سے کوئی اگر اس مال میں سے کوئی چیز لے گا ۔ ہشام نے آگے کا مضمون اس طرح بیان کیا کہ بلا حق کے تو قیامت کے دن اللہ تعالیٰ اسے اس طرح لائے گا کہ وہ اس کو اٹھائے ہوئے ہو گا ۔ آگاہ ہو جاؤ کہ میں اسے پہچان لوں گا جو اللہ کے پاس وہ شخص لے کر آئے گا ۔ اونٹ جو آواز نکال رہا ہو گا یا گائے جو اپنی آواز نکال رہی ہو گی یا بکری جو اپنی آواز نکال رہی ہو گی ۔ پھر آپ نے اپنے ہاتھ اٹھائے یہاں تک کہ میں نے آپ کے بغلوں کی سفیدی دیکھی اور فرمایا کیا میں نے پہنچا دیا ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ‘ کہا ہم کو عبدہ بن سلیمان نے خبر دی ‘ ان سے ہشام بن عروہ نے بیان کیا ‘ ان سے ان کے والد نے ‘ ان سے ابو حمید ساعدی نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اسْتَعْمَلَ ابْنَ الأُتَبِيَّةِ عَلَى صَدَقَاتِ بَنِي سُلَيْمٍ، فَلَمَّا جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَحَاسَبَهُ قَالَ هَذَا الَّذِي لَكُمْ، وَهَذِهِ هَدِيَّةٌ أُهْدِيَتْ لِي‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَهَلاَّ جَلَسْتَ فِي بَيْتِ أَبِيكَ وَبَيْتِ أُمِّكَ حَتَّى تَأْتِيَكَ هَدِيَّتُكَ، إِنْ كُنْتَ صَادِقًا ‏\"‏‏.‏ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَخَطَبَ النَّاسَ وَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ فَإِنِّي أَسْتَعْمِلُ رِجَالاً مِنْكُمْ عَلَى أُمُورٍ مِمَّا وَلاَّنِي اللَّهُ، فَيَأْتِي أَحَدُكُمْ فَيَقُولُ هَذَا لَكُمْ وَهَذِهِ هَدِيَّةٌ أُهْدِيَتْ لِي فَهَلاَّ جَلَسَ فِي بَيْتِ أَبِيهِ وَبَيْتِ أُمِّهِ حَتَّى تَأْتِيَهُ هَدِيَّتُهُ إِنْ كَانَ صَادِقًا، فَوَاللَّهِ لاَ يَأْخُذُ أَحَدُكُمْ مِنْهَا شَيْئًا ـ قَالَ هِشَامٌ ـ بِغَيْرِ حَقِّهِ إِلاَّ جَاءَ اللَّهَ يَحْمِلُهُ يَوْمَ الْقِيَامَةِ، أَلاَ فَلأَعْرِفَنَّ مَا جَاءَ اللَّهَ رَجُلٌ بِبَعِيرٍ لَهُ رُغَاءٌ، أَوْ بِبَقَرَةٍ لَهَا خُوَارٌ، أَوْ شَاةٍ تَيْعَرُ ‏\"‏‏.‏ ثُمَّ رَفَعَ يَدَيْهِ حَتَّى رَأَيْتُ بَيَاضَ إِبْطَيْهِ ‏\"‏ أَلاَ هَلْ بَلَّغْتُ ‏\"‏‏.‏",
                "headingArabic": "مُحَاسَبَةِ الإِمَامِ عُمَّالَهُ",
                "headingUrdu": "حکمران اپنے ملازمین کو احتساب کے لیے بلا رہا ہے۔",
                "headingEnglish": "The ruler calling his employees to account",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6901,
                "hadithNumber": "7198",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah never sends a prophet or gives the Caliphate to a Caliph but that he (the prophet or the Caliph) has two groups of advisors: A group advising him to do good and exhorts him to do it, and the other group advising him to do evil and exhorts him to do it. But the protected person (against such evil advisors) is the one protected by Allah.' \" Solaiman, Yahya, Ibn-e-Shihab has reported likewise. Ibn-e-Abi Ateeq, Musa has reported from Ibn-e-Shihab likewise. Shoaib, Zuhri, Abu Salamah reported the statement of Abu Saeed Khudri رضی اللہ عنہ . Auzai, Moaviyah bin Salaam, Zuhri, Abu Salamah, Hadrat Abu Hurairah رضی اللہ عنہ reported it from the prophet ﷺ. Ibn-e-Abu Husain and Saeed bin Zinad from Abu Salamah, he has reported the statement of Hadrat Abu Saeed Khudri رضی اللہ عنہ. Hadrat Abu Ayyb رضی اللہ عنہ states that he has reported it from the prophet ﷺ.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ اللہ نے جب بھی کوئی نبی بھیجا یا کسی کو خلیفہ بنایا تو اس کے ساتھ دو رفیق تھے ایک تو انہیں نیکی کے لیے کہتا اور اس پر ابھارتا اور دوسرا انہیں برائی کے لیے کہتا اور اس پر ابھار تا ۔ پس معصوم وہ ہے جسے اللہ بچائے رکھے ۔ اور سلیمان بن بلال نے اس حدیث کو یحییٰ بن سعید انصاری سے روایت کیا ، کہا مجھ کو ابن شہاب نے خبر دی ( اس کو اسماعیلی نے وصل کیا ) اور ابن ابی عتیق اور موسیٰ بن عقبہ سے بھی ‘ ان دونوں نے ابن شہاب سے یہی حدیث ( اس کو بیہقی نے وصل کیا ) اور شعیب بن ابی حمزہ نے زہری سے یوں روایت کی ۔ مجھ سے ابوسلمہ نے بیان کیا ۔ انہوں نے ابو سعید خدری رضی اللہ عنہ سے ان کا قول ( یعنی حدیث کوث موقوفاً نقل کیا ) اور امام اوزاعی اور معاویہ بن سلام نے کہا ، مجھ سے زہری نے بیان کیا ‘ کہا مجھ سے ابوسلمہ بن عبدالرحمٰن نے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے اور عبداللہ بن عبدالرحمٰن بن ابی حسین اور سعید بن زیاد نے اس کو ابوسلمہ سے روایت کیا ‘ انہوں نے ابو سیعد خدری رضی اللہ عنہ سے موقوفاً ( یعنی ابوسعید کا قول ) اور عبداللہ بن ابی جعفر نے کہا ‘ مجھ سے صفوان بن سلیم نے بیان کیا ‘ انہوں نے ابوسلمہ سے ‘ انہوں نے ابوایوب سے ‘ کہا میں نے آنحضرت صلی اللہ علیہ وسلم سے سنا ۔",
                "urduNarrator": "ہم سے اصبغ نے بیان کیا ‘ کہا ہم کو ابن وہب نے خبر دی ‘ انہیں یونس نے خبر دی ‘ انہیں ابن شہاب نے ‘ انہیں ابوسلمہ نے اور انہیں ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَصْبَغُ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا بَعَثَ اللَّهُ مِنْ نَبِيٍّ وَلاَ اسْتَخْلَفَ مِنْ خَلِيفَةٍ، إِلاَّ كَانَتْ لَهُ بِطَانَتَانِ، بِطَانَةٌ تَأْمُرُهُ بِالْمَعْرُوفِ وَتَحُضُّهُ عَلَيْهِ، وَبِطَانَةٌ تَأْمُرُهُ بِالشَّرِّ وَتَحُضُّهُ عَلَيْهِ، فَالْمَعْصُومُ مَنْ عَصَمَ اللَّهُ تَعَالَى ‏\"‏‏.‏ وَقَالَ سُلَيْمَانُ عَنْ يَحْيَى أَخْبَرَنِي ابْنُ شِهَابٍ بِهَذَا، وَعَنِ ابْنِ أَبِي عَتِيقٍ وَمُوسَى عَنِ ابْنِ شِهَابٍ مِثْلَهُ، وَقَالَ شُعَيْبٌ عَنِ الزُّهْرِيِّ حَدَّثَنِي أَبُو سَلَمَةَ عَنْ أَبِي سَعِيدٍ قَوْلَهُ‏.‏ وَقَالَ الأَوْزَاعِيُّ وَمُعَاوِيَةُ بْنُ سَلاَّمٍ حَدَّثَنِي الزُّهْرِيُّ حَدَّثَنِي أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ ابْنُ أَبِي حُسَيْنٍ وَسَعِيدُ بْنُ زِيَادٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ قَوْلَهُ‏.‏ وَقَالَ عُبَيْدُ اللَّهِ بْنُ أَبِي جَعْفَرٍ حَدَّثَنِي صَفْوَانُ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي أَيُّوبَ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "بِطَانَةِ الإِمَامِ وَأَهْلِ مَشُورَتِهِ",
                "headingUrdu": "امام کا وفد اور ان کو نصیحت کرنے والے",
                "headingEnglish": "The courtiers and advisers of the Imam",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6902,
                "hadithNumber": "7199, 7200",
                "englishNarrator": "Narrated `Ubada bin As-Samit رضی اللہ عنہ :",
                "hadithEnglish": "We gave the oath of allegiance to Allah's Messenger (ﷺ) that we would listen to and obey him both at the time when we were active and at the time when we were tired and that we would not fight against the ruler or disobey him, and would stand firm for the truth or say the truth wherever we might be, and in the Way of Allah we would not be afraid of the blame of the blamers. (See Hadith No. 178 and 320)",
                "hadithUrdu": "ہم نے رسول اللہ صلی اللہ علیہ وسلم سے  آپ کی سننے اور اطاعت کرنے کی بیعت کی, خوشی اور ناخوشی دونوں حالتوں میں اور اس شرط پر کہ جو شخص سرداری کے لائق ہو گا ( مثلاً قریش میں سے ہو اور شرع پر قائم ہو ) اس کی سرداری قبول کر لیں گے اس سے جھگڑا نہ کریں اور یہ کہ ہم حق کو لے کر کھڑے ہوں گے یا حق بات کہیں گے جہاں بھی ہوں اور اللہ کے راستے میں ملامت کرنے والے کی ملامت کی پرواہ نہ کریں گے۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ‘کہا مجھ سے امام مالک نے بیان کیا ‘ ان سے یحییٰ بن سعید نے ‘ انہوں نے کہا کہ مجھ کو عبادہ بن الولید نے خبر دی ‘ انہیں ان کے والد نے خبر دی ‘ ان سے عبادہ بن صامت رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي عُبَادَةُ بْنُ الْوَلِيدِ، أَخْبَرَنِي أَبِي، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ \"بَايَعْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ فِي الْمَنْشَطِ وَالْمَكْرَهِ‏. ‏‏وَأَنْ لاَ نُنَازِعَ الأَمْرَ أَهْلَهُ، وَأَنْ نَقُومَ ـ أَوْ نَقُولَ ـ بِالْحَقِّ حَيْثُمَا كُنَّا لاَ نَخَافُ فِي اللَّهِ لَوْمَةَ لاَئِمٍ ‏\"‏‏.‏",
                "headingArabic": "كَيْفَ يُبَايِعُ الإِمَامُ النَّاسَ",
                "headingUrdu": "لوگ امام کو بیع کیسے دیتے ہیں؟",
                "headingEnglish": "How do the people give the Bai'a to the Imam",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6903,
                "hadithNumber": "7201",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) went out on a cold morning while the Muhajirin (emigrants) and the Ansar were digging the trench. The Prophet (ﷺ) then said, \"O Allah! The real goodness is the goodness of the Here after, so please forgive the Ansar and the Muhajirin.\" They replied, \"We are those who have given the Pledge of allegiance to Muhammad for to observe Jihad as long as we remain alive.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سردی میں صبح کے وقت باہر نکلے اور مہاجرین اور انصار خندق کھود رہے تھے ‘ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا ‘ اے اللہ ! خیر تو آخرت ہی کی خیر ہے ۔ پس انصار و مہاجرین کی مغفرت کر دے اس کا جواب لوگوں نے دیا کہ ” ہم وہ ہیں جنہوں نے محمد صلی اللہ علیہ وسلم سے جہاد پر بیعت کی ہے ہمیشہ کے لیے جب تک وہ زندہ ہیں ۔ “",
                "urduNarrator": "ہم سے عمر بن علی نے بیان کیا ‘ انہوں نے کہا ہم سے خالد بن حارث نے بیان کیا ‘ انہوں نے کہا ہم سے حمید نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ ـ رضى الله عنه ـ خَرَجَ النَّبِيُّ صلى الله عليه وسلم فِي غَدَاةٍ بَارِدَةٍ وَالْمُهَاجِرُونَ وَالأَنْصَارُ يَحْفِرُونَ الْخَنْدَقَ فَقَالَ ‏ \"‏ اللَّهُمَّ إِنَّ الْخَيْرَ خَيْرُ الآخِرَهْ فَاغْفِرْ لِلأَنْصَارِ وَالْمُهَاجِرَهْ ‏\"‏ فَأَجَابُوا نَحْنُ الَّذِينَ بَايَعُوا مُحَمَّدَا عَلَى الْجِهَادِ مَا بَقِينَا أَبَدَا",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6904,
                "hadithNumber": "7202",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Whenever we gave the Pledge of allegiance to Allah's Messenger (ﷺ) for to listen to and obey, he used to say to us, for as much as you can.\"",
                "hadithUrdu": "جب ہم رسول اللہ صلی اللہ علیہ وسلم سے سننے اور اطاعت کرنے کی بیعت کرتے تو آپ ہم سے فرماتے کہ جتنی تمہیں طاقت ہو ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ انہوں نے کہا ہم کو امام مالک نے خبر دی ‘ انہیں عبداللہ بن دینا ر نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كُنَّا إِذَا بَايَعْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ يَقُولُ لَنَا ‏ \"‏ فِيمَا اسْتَطَعْتَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6905,
                "hadithNumber": "7203",
                "englishNarrator": "Narrated `Abdullah bin Dinar:",
                "hadithEnglish": "I witnessed Ibn `Umar رضی اللہ عنہما when the people gathered around `Abdul Malik. Ibn `Umar wrote: I gave the Pledge of allegiance that I will listen to and obey Allah's Slave, `Abdul Malik, Chief of the believers according to Allah's Laws and the Traditions of His Apostle as much as I can; and my sons too, give the same pledge.'",
                "hadithUrdu": "میں اس وقت عبداللہ بن عمر رضی اللہ عنہما کے پاس موجود تھا جب سب لوگ عبدالملک بن مروان سے بیعت کے لیے جمع ہو گئے ۔ بیان کیا کہ انہوں نے عبدالملک کو لکھا کہ ” میں سننے اور اطاعت کرنے کا اقرار کرتا ہوں عبداللہ عبدالملک امیرالمؤمنین کے لیے اللہ کے دین اور اس کے رسول کی سنت کے مطابق جتنی بھی مجھ میں قوت ہو گی اور یہ کہ میرے لڑکے بھی اس کا اقرار کرتے ہیں ۔ “",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے یحییٰ نے بیان کیا ‘ان سے سفیان نے ‘ ان سے عبداللہ بن دینار نے بیان کیا ‘ کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ شَهِدْتُ ابْنَ عُمَرَ حَيْثُ اجْتَمَعَ النَّاسُ عَلَى عَبْدِ الْمَلِكِ ـ قَالَ ـ كَتَبَ إِنِّي أُقِرُّ بِالسَّمْعِ وَالطَّاعَةِ لِعَبْدِ الْمَلِكِ أَمِيرِ الْمُؤْمِنِينَ عَلَى سُنَّةِ اللَّهِ وَسُنَّةِ رَسُولِهِ مَا اسْتَطَعْتُ، وَإِنَّ بَنِيَّ قَدْ أَقَرُّوا بِمِثْلِ ذَلِكَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 6876,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=275",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=273",
                "label": "273",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=274",
                "label": "274",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=275",
                "label": "275",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=276",
                "label": "276",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=277",
                "label": "277",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=278",
                "label": "278",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=279",
                "label": "279",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=277",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=277",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=275",
        "to": 6900,
        "total": 40465
    }
}