{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 268,
        "data": [
            {
                "id": 6681,
                "hadithNumber": "6964",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "A man mentioned to the Prophet (ﷺ) that he had always been cheated in bargains. The Prophet (ﷺ) said, \"Whenever you do bargain, say, 'No cheating.'\"",
                "hadithUrdu": "ایک صحابی نے نبی کریم صلی اللہ علیہ وسلم سے عرض کیا کہ وہ خریدوفروخت میں دھوکہ کھاجاتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جب تم کچھ خریدا کرو تو کہہ دیا کرو کہ اس میں کوئی دھوکہ نہ ہونا چاہئے ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے عبداللہ بن دینار نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَجُلاً، ذَكَرَ لِلنَّبِيِّ صلى الله عليه وسلم أَنَّهُ يُخْدَعُ فِي الْبُيُوعِ فَقَالَ ‏ \"‏ إِذَا بَايَعْتَ فَقُلْ لاَ خِلاَبَةَ ‏\"‏‏.‏",
                "headingArabic": "مَا يُكْرَهُ مِنَ التَّنَاجُشِ",
                "headingUrdu": "سودے بازی میں دھوکہ",
                "headingEnglish": "Cheating in bargains",
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6682,
                "hadithNumber": "6965",
                "englishNarrator": "Narrated `Urwa:",
                "hadithEnglish": "That he asked `Aisha رضی اللہ عنہا regarding the Verse: 'If you fear that you shall not be able to deal justly with the orphan girls, marry (other) women of your choice.' (4.3) `Aisha said, \"It is about an orphan girl under the custody of her guardian who being attracted by her wealth and beauty wants to marry her with Mahr less than other women of her status. So such guardians were forbidden to marry them unless they treat them justly by giving them their full Mahr. Then the people sought the verdict of Allah's Apostle for such cases, whereupon Allah revealed: 'They ask your instruction concerning women..' (4.127) (The sub-narrator then mentioned the Hadith.)",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا نے آیت ” اور اگر تمہیں خوف ہو کہ تم یتیموں کے بارے میں انصاف نہیں کر سکو گے تو پھر دوسری عورتوں سے نکاح کرو جو تمہیں پسند ہوں “ آپ نے کہا کہ اس آیت میں ایسی یتیم لڑکی کا ذکر ہے جو اپنے ولی کی پرورش میں ہو اور ولی لڑکی کے مال اور اس کے حسن سے رغبت رکھتا ہو اور چاہتا ہو کہ عورتوں ( کے مہر وغیرہ کے متعلق ) جو سب سے معمولی طریقہ ہے اس کے مطابق اس سے نکاح کرے تو ایسے ولیوں کو ان لڑکیوں کے نکاح سے منع کیا گیا ہے ۔ سوا اس صورت کے کہ ولی مہر کو پورا کرنے میں انصاف سے کام لے ۔ پھر لوگوں نے آنحضرت صلی اللہ علیہ وسلم سے اس کے بعد مسئلہ پوچھا تو اللہ تعالیٰ نے یہ آیت نازل کی ويستفتونك في النساء ‏ اور لوگ آپ سے عورتوں کے بارے میں مسئلہ پوچھتے ہیں “ اور اس واقعہ کا ذکر کیا ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے کہ عروہ ان سے بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ كَانَ عُرْوَةُ يُحَدِّثُ أَنَّهُ سَأَلَ عَائِشَةَ ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ‏}‏‏.‏ قَالَتْ هِيَ الْيَتِيمَةُ فِي حَجْرِ وَلِيِّهَا، فَيَرْغَبُ فِي مَالِهَا وَجَمَالِهَا، فَيُرِيدُ أَنْ يَتَزَوَّجَهَا بِأَدْنَى مِنْ سُنَّةِ نِسَائِهَا، فَنُهُوا عَنْ نِكَاحِهِنَّ، إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ فِي إِكْمَالِ الصَّدَاقِ، ثُمَّ اسْتَفْتَى النَّاسُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدُ فَأَنْزَلَ اللَّهُ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ‏}‏ فَذَكَرَ الْحَدِيثَ‏.‏",
                "headingArabic": "مَا يُنْهَى مِنَ الْخِدَاعِ فِي الْبُيُوعِ",
                "headingUrdu": "سودے بازی میں دھوکہ",
                "headingEnglish": "Cheating in bargains",
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6683,
                "hadithNumber": "6966",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"For every betrayer there will be a flag by which he will be recognized on the Day of Resurrection. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہر دھوکہ دینے والے کے لیے قیامت کے دن ایک جھنڈا ہو گا جس کے ذریعہ وہ پہچانا جائے گا ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے عبداللہ بن دینار نے ، اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا ، کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ لِكُلِّ غَادِرٍ لِوَاءٌ يَوْمَ الْقِيَامَةِ يُعْرَفُ بِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6684,
                "hadithNumber": "6967",
                "englishNarrator": "Narrated Um Salama رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I am only a human being, and you people have disputes. May be some one amongst you can present his case in a more eloquent and convincing manner than the other, and I give my judgment in his favor according to what I hear. Beware! If ever I give (by error) somebody something of his brother's right then he should not take it as I have only, given him a piece of Fire.\" (See Hadith No. 638. Vol. 3)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں تمہارے ہی جیسا انسان ہوں اور بعض اوقات جب تم باہمی جھگڑا لاتے ہو تو ممکن ہے کہ تم میں سے بعض اپنے فریق مخالف کے مقابلہ میں اپنا مقدمہ پیش کرنے میں زیادہ چالاکی سے بولنے والا ہو اور اس طرح میں اس کے مطابق فیصلہ کر دوں جو میں تم سے سنتا ہوں ۔ پس جس شخص کے لیے بھی اس کے بھائی کے حق میں سے ، میں کسی چیز کا فیصلہ کر دوں تو وہ اسے نہ لے ۔ کیونکہ اس طرح میں اسے جہنم کا ایک ٹکڑا دیتا ہوں ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، ان سے سفیان نے ، ان سے ہشام نے ، ان سے عروہ نے ، ان سے زینت بنت ام سلمہ نے اور ان سے ام سلمہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، عَنْ سُفْيَانَ، عَنْ هِشَامٍ، عَنْ عُرْوَةَ، عَنْ زَيْنَبَ ابْنَةِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا أَنَا بَشَرٌ، وَإِنَّكُمْ تَخْتَصِمُونَ، وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ، وَأَقْضِيَ لَهُ عَلَى نَحْوِ مَا أَسْمَعُ، فَمَنْ قَضَيْتُ لَهُ مِنْ حَقِّ أَخِيهِ شَيْئًا، فَلاَ يَأْخُذْ، فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّارِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6685,
                "hadithNumber": "6968",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A virgin should not be married till she is asked for her consent; and the matron should not be married till she is asked whether she agrees to marry or not.\" It was asked, \"O Allah's Apostle! How will she (the virgin) express her consent?\" He said, \"By keeping silent.\" Some people said that if a virgin is not asked for her consent and she is not married, and then a man, by playing a trick presents two false witnesses that he has married her with her consent and the judge confirms his marriage as a true one, and the husband knows that the witnesses were false ones, then there is no harm for him to consummate his marriage with her and the marriage is regarded as valid.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ کسی کنواری لڑکی کا نکاح اس وقت تک نہ کیا جائے جب تک اس کی اجازت نہ لے لی جائے اور کسی بیوہ کا نکاح اس وقت تک نہ کیا جائے جب تک اس کا حکم نہ معلوم کر لیا جائے ۔ پوچھا گیا یا رسول اللہ اس کی ( کنواری کی ) اجازت کی کیا صورت ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس کی خاموشی اجازت ہے ۔ اس کے باوجود بعض لوگ کہتے ہیں کہ اگر کنواری لڑکی سے اجازت نہ لی گئی اور نہ اس نے نکاح کیا ۔ لیکن کسی شخص نے حیلہ کر کے دو جھوٹے گواہ کھڑے کر دئیے کہ اس نے لڑکی سے نکاح کیا ہے اس کی مرضی سے اور قاضی نے بھی اس کے نکاح کا فیصلہ کر دیا ۔ حالانکہ شوہر جانتا ہے کہ وہ جھوٹا ہے کہ گواہی جھوٹی تھی اس کے باوجود اس لڑکی سے صحبت کرنے میں اس کے لیے کوئی حرج نہیں ہے بلکہ یہ نکاح صحیح ہو گا ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے ہشام نے بیان کیا ، کہا ہم سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تُنْكَحُ الْبِكْرُ حَتَّى تُسْتَأْذَنَ، وَلاَ الثَّيِّبُ حَتَّى تُسْتَأْمَرَ ‏\"‏‏.‏ فَقِيلَ يَا رَسُولَ اللَّهِ كَيْفَ إِذْنُهَا قَالَ ‏\"‏ إِذَا سَكَتَتْ ‏\"‏‏.‏ وَقَالَ بَعْضُ النَّاسِ إِنْ لَمْ تُسْتَأْذَنِ الْبِكْرُ وَلَمْ تَزَوَّجْ‏.‏ فَاحْتَالَ رَجُلٌ فَأَقَامَ شَاهِدَىْ زُورٍ أَنَّهُ تَزَوَّجَهَا بِرِضَاهَا، فَأَثْبَتَ الْقَاضِي نِكَاحَهَا، وَالزَّوْجُ يَعْلَمُ أَنَّ الشَّهَادَةَ بَاطِلَةٌ، فَلاَ بَأْسَ أَنْ يَطَأَهَا، وَهْوَ تَزْوِيجٌ صَحِيحٌ‏.‏",
                "headingArabic": "فِي النِّكَاحِ",
                "headingUrdu": "شادی میں (چالیاں)",
                "headingEnglish": "(Tricks) in marriage",
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6686,
                "hadithNumber": "6969",
                "englishNarrator": "Narrated Al-Qasim:",
                "hadithEnglish": "A woman from the offspring of Ja`far رضی اللہ عنہ was afraid lest her guardian marry her (to somebody) against her will. So she sent for two elderly men from the Ansar, `Abdur Rahman and Mujammi', the two sons of Jariya, and they said to her, \"Don't be afraid, for Khansa' bint Khidam رضی اللہ عنہ was given by her father in marriage against her will, then the Prophet (ﷺ) cancelled that marriage.\" Sufyan says that he heard from Hadrat Abdur Rehman that he, reporting from his father, would say: Khansa رضی اللہ عنہا .",
                "hadithUrdu": "جعفر رضی اللہ عنہ کی اولاد میں سے ایک خاتون کو اس کا خطرہ ہوا کہ ان کا ولی ( جن کی وہ زیرپرورش تھیں ) ان کا نکاح کر دے گا ۔ حالانکہ وہ اس نکاح کو ناپسند کرتی تھیں ۔ چنانچہ انہوں نے قبیلہ انصار کے دو شیوخ عبدالرحمٰن اور مجمع کو جو جاریہ کے بیٹے تھے کہلا بھیجا انہوں نے تسلی دی کہ کوئی خوف نہ کریں ۔ کیونکہ خنساء بنت خذام رضی اللہ عنہا کا نکاح ان کے والد نے ان کی ناپسندیدگی کے باوجود کر دیا تھا تو رسول اللہ صلی اللہ علیہ وسلم نے اس نکاح کو رد کر دیا تھا ۔ سفیان نے بیان کیا کہ میں نے عبدالرحمٰن کو اپنے والد سے یہ کہتے ہوئے سنا ہے کہ خنساء رضی اللہ عنہا آخر حدیث تک بیان کیا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے ، کہا ہم سے یحییٰ بن سعید نے ، ان سے قاسم نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ الْقَاسِمِ، أَنَّ امْرَأَةً، مِنْ وَلَدِ جَعْفَرٍ تَخَوَّفَتْ أَنْ يُزَوِّجَهَا وَلِيُّهَا وَهْىَ كَارِهَةٌ فَأَرْسَلَتْ إِلَى شَيْخَيْنِ مِنَ الأَنْصَارِ عَبْدِ الرَّحْمَنِ وَمُجَمِّعٍ ابْنَىْ جَارِيَةَ قَالاَ فَلاَ تَخْشَيْنَ، فَإِنَّ خَنْسَاءَ بِنْتَ خِذَامٍ أَنْكَحَهَا أَبُوهَا وَهْىَ كَارِهَةٌ، فَرَدَّ النَّبِيُّ صلى الله عليه وسلم ذَلِكَ‏.‏ قَالَ سُفْيَانُ وَأَمَّا عَبْدُ الرَّحْمَنِ فَسَمِعْتُهُ يَقُولُ عَنْ أَبِيهِ إِنَّ خَنْسَاءَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6687,
                "hadithNumber": "6970",
                "englishNarrator": "Narrated Abu Haraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"A lady slave should not be given in marriage until she is consulted, and a virgin should not be given in marriage until her permission is granted.\" The people said, \"How will she express her permission?\" The Prophet (ﷺ) said, \"By keeping silent (when asked her consent).\" Some people said, \"If a man, by playing a trick, presents two false witnesses before the judge to testify that he has married a matron with her consent and the judge confirms his marriage, and the husband is sure that he has never married her (before), then such a marriage will be considered as a legal one and he may live with her as husband.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کسی بیوہ سے اس وقت تک شادی نہ کی جائے جب تک اس کا حکم نہ معلوم کر لیا جائے اور کسی کنواری سے اس وقت تک نکاح نہ کیا جائے جب تک اس کی اجازت نہ لے لی جائے ۔ صحابہ نے پوچھا اس کی اجازت کا کیا طریقہ ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ۔ یہ کہ وہ خاموش ہو جائے ۔ پھر بھی بعض لوگ کہتے ہیں کہاگر کسی شخص نے دو جھوٹے گواہوں کے ذریعہ حیلہ کیا ( اور یہ جھوٹ گھڑا ) کہ کسی بیوہ عورت سے اس نے اس کی اجازت سے نکاح کیا ہے اور قاضی نے بھی اس مرد سے اس کے نکاح کا فیصلہ کر دیا جبکہ اس مرد کو خوب خبر ہے کہ اس نے اس عورت سے نکاح نہیں کیا ہے تو یہ نکاح جائز ہے اور اس کے لیے اس عورت کے ساتھ رہنا جائز ہو جائے گا ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے شیبان نے بیان کیا ، ان سے یحییٰ نے ، ان سے ابوسلمہ نے ، اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تُنْكَحُ الأَيِّمُ حَتَّى تُسْتَأْمَرَ، وَلاَ تُنْكَحُ الْبِكْرُ حَتَّى تُسْتَأْذَنَ ‏\"‏‏.‏ قَالُوا كَيْفَ إِذْنُهَا قَالَ ‏\"‏ أَنْ تَسْكُتَ ‏\"‏‏.‏ وَقَالَ بَعْضُ النَّاسِ إِنِ احْتَالَ إِنْسَانٌ بِشَاهِدَىْ زُورٍ عَلَى تَزْوِيجِ امْرَأَةٍ ثَيِّبٍ بِأَمْرِهَا، فَأَثْبَتَ الْقَاضِي نِكَاحَهَا إِيَّاهُ، وَالزَّوْجُ يَعْلَمُ أَنَّهُ لَمْ يَتَزَوَّجْهَا قَطُّ، فَإِنَّهُ يَسَعُهُ هَذَا النِّكَاحُ، وَلاَ بَأْسَ بِالْمُقَامِ لَهُ مَعَهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6688,
                "hadithNumber": "6971",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"It is essential to have the consent of a virgin (for the marriage). I said, \"A virgin feels shy.\" The Prophet; said, \"Her silence means her consent.\" Some people said, \"If a man falls in love with an orphan slave girl or a virgin and she refuses (him) and then he makes a trick by bringing two false witnesses to testify that he has married her, and then she attains the age of puberty and agrees to marry him and the judge accepts the false witness and the husband knows that the witnesses were false ones, he may consummate his marriage.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ کنواری لڑکی سے اجازت لی جائے گی ۔ میں نے پوچھا کہ کنواری لڑکی شرمائے گی ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس کی خاموشی ہی اجازت ہے ۔  اور بعض لوگوں کا کہنا ہے کہ کوئی شخص اگر کسی یتیم لڑکی یا کنواری لڑکی سے نکاح کا خواہشمند ہو ۔ لیکن لڑکی راضی نہ ہو اس پر اس نے حیلہ کیا اور دو جھوٹے گواہوں کی گواہی اس کی دلائی کہ اس نے لڑکی سے شادی کر لی ہے پھر جب وہ لڑکی جوان ہوئی اور اس نکاح سے وہ بھی راضی ہو گئی اور قاضی نے اس جھوٹی شہادت کو قبول کر لیا حالانکہ وہ جانتا ہے کہ یہ سارا ہی جھوٹ اور فریب ہے ۔ تب بھی اس سے جماع کرنا جائز ہے ۔",
                "urduNarrator": "ہم سے ابوعاصم ضحاک بن مخلد نے بیان کیا ، ان سے ابن جریج نے ، ان سے ابن ابی ملیکہ نے ، ان سے ذکوان نے ، اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ ذَكْوَانَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْبِكْرُ تُسْتَأْذَنُ ‏\"‏‏.‏ قُلْتُ إِنَّ الْبِكْرَ تَسْتَحْيِي قَالَ ‏\"‏ إِذْنُهَا صُمَاتُهَا ‏\"‏‏.‏ وَقَالَ بَعْضُ النَّاسِ إِنْ هَوِيَ رَجُلٌ جَارِيَةً يَتِيمَةً أَوْ بِكْرًا، فَأَبَتْ فَاحْتَالَ فَجَاءَ بِشَاهِدَىْ زُورٍ عَلَى أَنَّهُ تَزَوَّجَهَا، فَأَدْرَكَتْ فَرَضِيَتِ الْيَتِيمَةُ، فَقَبِلَ الْقَاضِي شَهَادَةَ الزُّورِ، وَالزَّوْجُ يَعْلَمُ بِبُطْلاَنِ ذَلِكَ، حَلَّ لَهُ الْوَطْءُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6689,
                "hadithNumber": "6972",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to like sweets and also used to like honey, and whenever he finished the `Asr prayer, he used to visit his wives and stay with them. Once he visited Hafsa رضی اللہ عنہا and remained with her longer than the period he used to stay, so I enquired about it. It was said to me, \"A woman from her tribe gave her a leather skin containing honey as a present, and she gave some of it to Allah's Messenger (ﷺ) to drink.\" I said, \"By Allah, we will play a trick on him.\" So I mentioned the story to Sauda (the wife of the Prophet) رضی اللہ عنہا and said to her, \"When he enters upon you, he will come near to you whereupon you should say to him, 'O Allah's Messenger (ﷺ)! Have you eaten Maghafir?' He will say, 'No.' Then you say to him, 'What is this bad smell? ' And it would be very hard on Allah's Messenger (ﷺ) that a bad smell should be found on his body. He will say, 'Hafsa has given me a drink of honey.' Then you should say to him, 'Its bees must have sucked from the Al-`Urfut (a foul smelling flower).' I too, will tell him the same. And you, O Saifya, say the same.\" So when the Prophet (ﷺ) entered upon Sauda (the following happened). Sauda said, \"By Him except Whom none has the right to be worshipped, I was about to say to him what you had told me to say while he was still at the gate because of fear from you. But when Allah 's Apostle came near to me, I said to him, 'O Allah's Messenger (ﷺ)! Have you eaten Maghafir?' He replied, 'No.' I said, 'What about this smell?' He said, 'Hafsa has given me a drink of honey.' I said, 'Its bees must have sucked Al-`Urfut.' \" When he entered upon me, I told him the same as that, and when he entered upon Safiya رضی اللہ عنہا , she too told him the same. So when he visited Hafsa again, she said to him, \"O Allah's Messenger (ﷺ)! Shall I give you a drink of it (honey)?\" He said, \"I have no desire for it.\" Sauda رضی اللہ عنہا said, Subhan Allah! We have deprived him of it (honey).\" I said to her, \"Be quiet!\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم حلوہ ( یعنی میٹھی چیز ) اور شہد پسند کرتے تھے اور عصر کی نماز سے فارغ ہونے کے بعد اپنی ازواج سے ( ان میں سے کسی کے حجرہ میں جانے کے لیے ) اجازت لیتے تھے اور ان کے پاس جاتے تھے ۔ ایک مرتبہ آپ حفصہ رضی اللہ عنہا کے گھر گئے اور ان کے یہاں اس سے زیادہ دیر تک ٹھہرے رہے جتنی دیر تک ٹھہرنے کا آپ کا معمول تھا ۔ میں نے اس کے متعلق آنحضرت صلی اللہ علیہ وسلم سے پوچھا تو آپ نے فرمایا کہ ان کی قوم کی ایک خاتون نے شہد کی ایک کپی انہیں ہدیہ کی تھی اور انہوں نے آنحضرت صلی اللہ علیہ وسلم کو اس کا شربت پلایا تھا ۔ میں نے اس پر کہا کہ اب میں آنحضرت صلی اللہ علیہ وسلم کے ساتھ ایک حیلہ کروں گی چنانچہ میں نے اس کا ذکر سودہ رضی اللہ عنہا سے کیا اور کہا جب آنحضرت آپ کے یہاں آئیں تو آپ کے قریب بھی آئیں گے اس وقت تم آپ سے کہنا یا رسول اللہ ! شاید آپ نے مغافیر کھایا ہے ؟ اس پر آپ جواب دیں گے کہ نہیں ۔ تم کہنا کہ پھر یہ بو کس چیز کی ہے ؟ آنحضرت صلی اللہ علیہ وسلم کو یہ بات بہت ناگوار تھی کہ آپ کے جسم کے کسی حصہ سے بو آئے ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم اس کا جواب یہ دیں گے کہ حفصہ نے مجھے شہد کا شربت پلایا تھا ۔ اس پر کہنا کہ شہد کی مکھیوں نے غرفط کا رس چوسا ہو گا اور میں بھی آنحضرت سے یہی بات کہوں گی اور صفیہ تم بھی آنحضرت سے یہ کہنا چنانچہ جب آنحضرت صلی اللہ علیہ وسلم سودہ کے یہاں تشریف لے گئے تو ان کا بیان ہے کہ اس ذات کی قسم جس کے سوا کوئی معبود نہیں کہ تمہارے خوف سے قریب تھا کہ میں اس وقت آنحضرت صلی اللہ علیہ وسلم سے یہ بات جلدی میں کہہ دیتی جبکہ آپ دروازے ہی پر تھے ۔ آخر جب آنحضرت صلی اللہ علیہ وسلم قریب آئے تو میں نے عرض کیا یا رسول اللہ آپ نے مغافیر کھایا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ۔ میں نے کہا پھر بو کیسی ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ حفصہ نے مجھے شہد کا شربت پلایا ہے میں نے کہا اس شہد کی مکھیوں نے غرفط کا رس چوسا ہو گا اور صفیہ رضی اللہ عنہا کے پاس جب آپ تشریف لے گئے تو انہوں نے بھی یہی کہا ۔ اس کے بعد جب حفصہ کے پاس آپ صلی اللہ علیہ وسلم گئے تو انہوں نے عرض کیا یا رسول اللہ ! وہ شہد میں پھر آپ کو پلاؤں ۔ آنحضرت نے فرمایا کہ اس کی ضرورت نہیں ۔ بیان کیا ہے کہ اس پر سودہ رضی اللہ عنہا بولیں ۔ سبحان اللہ یہ ہم نے کیا کیا گویا شہد آپ پر حرام کر دیا ۔ میں نے کہا چپ رہو ۔",
                "urduNarrator": "ہم سے عبیدبن اسماعیل نے بیان کیا ، کہا ہم سے ابواسامہ نے ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحِبُّ الْحَلْوَاءَ، وَيُحِبُّ الْعَسَلَ، وَكَانَ إِذَا صَلَّى الْعَصْرَ أَجَازَ عَلَى نِسَائِهِ فَيَدْنُو مِنْهُنَّ، فَدَخَلَ عَلَى حَفْصَةَ، فَاحْتَبَسَ عِنْدَهَا أَكْثَرَ مِمَّا كَانَ يَحْتَبِسُ، فَسَأَلْتُ عَنْ ذَلِكَ فَقِيلَ لِي أَهْدَتِ امْرَأَةٌ مِنْ قَوْمِهَا عُكَّةَ عَسَلٍ، فَسَقَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْهُ شَرْبَةً‏.‏ فَقُلْتُ أَمَا وَاللَّهِ لَنَحْتَالَنَّ لَهُ‏.‏ فَذَكَرْتُ ذَلِكَ لِسَوْدَةَ قُلْتُ إِذَا دَخَلَ عَلَيْكِ فَإِنَّهُ سَيَدْنُو مِنْكِ فَقُولِي لَهُ يَا رَسُولَ اللَّهِ أَكَلْتَ مَغَافِيرَ فَإِنَّهُ سَيَقُولُ لاَ‏.‏ فَقُولِي لَهُ مَا هَذِهِ الرِّيحُ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَشْتَدُّ عَلَيْهِ أَنْ تُوجَدُ مِنْهُ الرِّيحُ، فَإِنَّهُ سَيَقُولُ سَقَتْنِي حَفْصَةُ شَرْبَةَ عَسَلٍ‏.‏ فَقُولِي لَهُ جَرَسَتْ نَحْلُهُ الْعُرْفُطَ‏.‏ وَسَأَقُولُ ذَلِكَ، وَقُولِيهِ أَنْتِ يَا صَفِيَّةُ‏.‏ فَلَمَّا دَخَلَ عَلَى سَوْدَةَ، قُلْتُ تَقُولُ سَوْدَةُ وَالَّذِي لاَ إِلَهَ إِلاَّ هُوَ لَقَدْ كِدْتُ أَنْ أُبَادِرَهُ بِالَّذِي قُلْتِ لِي، وَإِنَّهُ لَعَلَى الْبَابِ فَرَقًا مِنْكِ، فَلَمَّا دَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم قُلْتُ يَا رَسُولَ اللَّهِ أَكَلْتَ مَغَافِيرَ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَمَا هَذِهِ الرِّيحُ قَالَ ‏\"‏ سَقَتْنِي حَفْصَةُ شَرْبَةَ عَسَلٍ ‏\"‏‏.‏ قُلْتُ جَرَسَتْ نَحْلُهُ الْعُرْفُطَ‏.‏ فَلَمَّا دَخَلَ عَلَىَّ قُلْتُ لَهُ مِثْلَ ذَلِكَ‏.‏ وَدَخَلَ عَلَى صَفِيَّةَ فَقَالَتْ لَهُ مِثْلَ ذَلِكَ‏.‏ فَلَمَّا دَخَلَ عَلَى حَفْصَةَ قَالَتْ لَهُ يَا رَسُولَ اللَّهِ أَلاَ أَسْقِيكَ مِنْهُ قَالَ ‏\"‏ لاَ حَاجَةَ لِي بِهِ ‏\"‏‏.‏ قَالَتْ تَقُولُ سَوْدَةُ سُبْحَانَ اللَّهِ لَقَدْ حَرَمْنَاهُ‏.‏ قَالَتْ قُلْتُ لَهَا اسْكُتِي‏.‏",
                "headingArabic": "مَا يُكْرَهُ مِنِ احْتِيَالِ الْمَرْأَةِ مَعَ الزَّوْجِ وَالضَّرَائِرِ",
                "headingUrdu": "شوہر کے ساتھ عورت کی چال",
                "headingEnglish": "The trick by a woman with her husband",
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6690,
                "hadithNumber": "6973",
                "englishNarrator": "Narrated `Abdullah bin 'Amir bin Rabi`a:",
                "hadithEnglish": "`Umar bin Al-Khattab رضی اللہ عنہ left for Sham, and when he reached a placed called Sargh, he came to know that there was an outbreak of an epidemic (of plague) in Sham. Then `AbdurRahman bin `Auf رضی اللہ عنہ told him that Allah's Messenger (ﷺ) said, \"If you hear the news of an outbreak of an epidemic (plague) in a certain place, do not enter that place: and if the epidemic falls in a place while you are present in it, do not leave that place to escape from the epidemic.\" So `Umar  رضی اللہ عنہ returned from Sargh.",
                "hadithUrdu": "حضرت عمر بن خطاب رضی اللہ عنہ ( سنہ 18 ھ ماہ ربیع الثانی میں ) شام تشریف لے گئے ۔ جب مقام سرغ پر پہنچے تو ان کو یہ خبرملی کہ شام وبائی بیماری کی لپیٹ میں ہے ۔ پھر حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے انہیں خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ جب تمہیں معلوم ہو جائے کہ کسی سرزمین میں وبا پھیلی ہوئی ہے تو اس میں داخل مت ہو ، لیکن اگر کسی جگہ وبا پھوٹ پڑے اور تم وہیں موجود ہو تو وبا سے بھاگنے کے لیے تم وہاں سے نکلو بھی مت ۔ چنانچہ حضرت عمر رضی اللہ عنہ مقام سرغ سے واپس آ گئے ۔ اور ابن شہاب سے روایت ہے ، ان سے سالم بن عبداللہ نے کہ حضرت عمر رضی اللہ عنہ حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ کی حدیث سن کر واپس ہو گئے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعبنی نے بیان کیا ، کہا ہم سے امام مالک نے ، ان سے ابن شہاب نے ، ان سے عبداللہ ابن عامر بن ربیعہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ خَرَجَ إِلَى الشَّأْمِ، فَلَمَّا جَاءَ بِسَرْغَ بَلَغَهُ أَنَّ الْوَبَاءَ وَقَعَ بِالشَّأْمِ فَأَخْبَرَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا سَمِعْتُمْ بِأَرْضٍ فَلاَ تَقْدَمُوا عَلَيْهِ، وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ ‏\"‏‏.‏ فَرَجَعَ عُمَرُ مِنْ سَرْغَ‏.‏ وَعَنِ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّ عُمَرَ إِنَّمَا انْصَرَفَ مِنْ حَدِيثِ عَبْدِ الرَّحْمَنِ‏.‏",
                "headingArabic": "مَا يُكْرَهُ مِنَ الاِحْتِيَالِ فِي الْفِرَارِ مِنَ الطَّاعُونِ",
                "headingUrdu": "طاعون کی بیماری سے بھاگنے کے لیے حربے کھیلنا",
                "headingEnglish": "Playing tricks to run from the disease of plague",
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6691,
                "hadithNumber": "6974",
                "englishNarrator": "Narrated 'Amir bin Sa`d bin Abi Waqqas رضی اللہ عنہ :",
                "hadithEnglish": "That he heard Usama bin Zaid speaking to Sa`d, saying, \"Allah's Messenger (ﷺ) mentioned the plague and said, 'It is a means of punishment with which some nations were punished and some of it has remained, and it appears now and then. So whoever hears that there is an outbreak of plague in some land, he should not go to that land, and if the plague breaks out in the land where one is already present, one should not run away from that land, escaping from the plague.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے طاعون کا ذکر کیا اور فرمایا کہ یہ ایک عذاب ہے جس کے ذریعہ بعض امتوں کو عذاب دیا گیا تھا اس کے بعد ا سکا کچھ حصہ باقی رہ گیا ہے اور وہ کبھی چلا جاتا ہے اور کبھی واپس آتاجا ہے ۔ پس جو شخص کسی سرزمین پر اس کے پھیلنے کے متعلق سنے تو وہاں نہ جائے لیکن اگر کوئی کسی جگہ ہو اور وہاں یہ وبا پھوٹ پڑے تو وہاں سے بھاگے بھی نہیں ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم سے شعیب نے بیان کیا ‘ ان سے زہری نے ‘ ان سے عامر ابن سعد بن ابی وقاص نے کہ انہوں نے حضرت اسامہ بن زید رضی اللہ عنہ سے سنا ‘ وہ حضرت سعد بن ابی وقاص رضی اللہ عنہ سے حدیث نقل کر رہے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنَا عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَنَّهُ سَمِعَ أُسَامَةَ بْنَ زَيْدٍ، يُحَدِّثُ سَعْدًا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ الْوَجَعَ فَقَالَ ‏ \"‏ رِجْزٌ ـ أَوْ عَذَابٌ ـ عُذِّبَ بِهِ بَعْضُ الأُمَمِ، ثُمَّ بَقِيَ مِنْهُ بَقِيَّةٌ، فَيَذْهَبُ الْمَرَّةَ وَيَأْتِي الأُخْرَى، فَمَنْ سَمِعَ بِهِ بِأَرْضٍ فَلاَ يَقْدَمَنَّ عَلَيْهِ، وَمَنْ كَانَ بِأَرْضٍ وَقَعَ بِهَا فَلاَ يَخْرُجْ فِرَارًا مِنْهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6692,
                "hadithNumber": "6975",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The one who takes back his gift is like a dog swallowing its own vomit, and we (believers) should not act according to this bad example.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اپنے ہبہ کو واپس لینے والا اس کتے کی طرح ہے جو اپنی قے کو خود چاٹ جاتا ہے ‘ ہمارے لیے بری مثال مناسب نہیں ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ‘ کہا ہم سے سفیان نے بیان کیا ‘ ان سے ایوب سختیانی نے ‘ ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ، لَيْسَ لَنَا مَثَلُ السَّوْءِ ‏\"‏‏.‏",
                "headingArabic": "فِي الْهِبَةِ وَالشُّفْعَةِ",
                "headingUrdu": "(ٹرکس میں) تحفہ دینا اور پری ایمپشن",
                "headingEnglish": "(Tricks in) gift-giving and pre-emption",
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6693,
                "hadithNumber": "6976",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) has decreed that preemption is valid in all cases where the real estate concerned has not been divided, but if the boundaries are established and the ways are made, then there is no preemption. A man said, \"Preemption is only for the neighbor,\" and then he makes invalid what he has confirmed. He said, \"If someone wants to buy a house and being afraid that the neighbor (of the house) may buy it through preemption, he buys one share out of one hundred shares of the house and then buys the rest of the house, then the neighbor can only have the right of preemption for the first share but not for the rest of the house; and the buyer may play such a trick in this case.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے شفعہ کا حکم ہر اس چیز میں دیا تھا جو تقسیم نہ ہو سکتی ہو ۔ پس جب حد بندی ہو جائے اور راستے الگ الگ کر دئیے جائیں تو پھر شفعہ نہیں ۔  اور بعض لوگ کہتے ہیں کہ شفعہ کا حق پڑوسی کو بھی ہوتا ہے پھر خود ہی اپنی بات کو غلط قرار دیا اور کہا کہ اگر کسی نے کوئی گھر خریدا اور اسے خطرہ ہے کہ اس کا پڑوسی حق شفعہ کی بنا پر اس سے گھر لے لے گا تو اس نے اس کے سو حصے کر کے ایک حصہ اس میں سے پہلے خرید لیا اور باقی حصے بعد میں خریدے تو ایسی صورت میں پہلے حصے میں تو پڑوسی کو شفعہ کا حق ہو گا ۔ گھر کے باقی حصوں میں اسے یہ حق نہیں ہو گا اور اس کے لیے جائز ہے کہ یہ حیلہ کرے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ‘ انہوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا ‘ انہوں نے کہا ہم کو معمر نے خبر دی ‘ انہیں زہری نے ‘ انہیں ابوسلمہ نے اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ إِنَّمَا جَعَلَ النَّبِيُّ صلى الله عليه وسلم الشُّفْعَةَ فِي كُلِّ مَا لَمْ يُقْسَمْ، فَإِذَا وَقَعَتِ الْحُدُودُ وَصُرِّفَتِ الطُّرُقُ فَلاَ شُفْعَةَ‏.‏ وَقَالَ بَعْضُ النَّاسِ الشُّفْعَةُ لِلْجِوَارِ‏.‏ ثُمَّ عَمَدَ إِلَى مَا شَدَّدَهُ فَأَبْطَلَهُ، وَقَالَ إِنِ اشْتَرَى دَارًا فَخَافَ أَنْ يَأْخُذَ الْجَارُ بِالشُّفْعَةِ، فَاشْتَرَى سَهْمًا مِنْ مِائَةِ سَهْمٍ، ثُمَّ اشْتَرَى الْبَاقِيَ، وَكَانَ لِلْجَارِ الشُّفْعَةُ فِي السَّهْمِ الأَوَّلِ، وَلاَ شُفْعَةَ لَهُ فِي بَاقِي الدَّارِ، وَلَهُ أَنْ يَحْتَالَ فِي ذَلِكَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6694,
                "hadithNumber": "6977",
                "englishNarrator": "Narrated 'Amr bin Ash-Sharid:",
                "hadithEnglish": "Al-Miswar bin Makhrama رضی اللہ عنہ came and put his hand on my shoulder and I accompanied him to Sa'd. Abu Rafi' said to Al-Miswar, \"Won't you order this (i.e. Sa'd) to buy my house which is in my yard?\" Sa'd said, \"I will not offer more than four hundred in installments over a fixed period.\" Abu Rafi said, \"I was offered five hundred cash but I refused. Had I not heard the Prophet (ﷺ) saying, 'A neighbor is more entitled to receive the care of his neighbor,' I would not have sold it to you.\" The narrator said, to Sufyan: Ma'mar did not say so. Sufyan said, \"But he did say so to me.\" Some people said, \"If someone wants to sell a house and deprived somebody of the right of preemption, he has the right to play a trick to render the preemption invalid. And that is by giving the house to the buyer as a present and marking its boundaries and giving it to him. The buyer then gives the seller one-thousand Dirham as compensation in which case the preemptor loses his right of preemption.\"",
                "hadithUrdu": "مسور بن مخرمہ رضی اللہ عنہ آئے اور انہوں نے میرے مونڈھے پر اپنا ہاتھ رکھا پھر میں ان کے ساتھ سعد بن ابی وقاص رضی اللہ عنہ کے یہاں گیا تو ابورافع نے اس پر کہا کہ اس کا چار سو سے زیادہ میں نہیں دے سکتا اور وہ بھی قسطوں میں دوں گا ۔ اس پر انہوں نے جواب دیا کہ مجھے تو اس کے پانچ سو نقد مل رہے تھے اور میں نے انکار کر دیا ۔ اگر میں نے رسول اللہ صلی اللہ علیہ وسلم سے یہ نہ سنا ہوتا کہ پڑوسی زیادہ مستحق ہے تو میں اسے تمہیں نہ بیچتا ۔ علی بن عبداللہ مدینی نے کہا میں نے سفیان بن عیینہ سے اس پر پوچھا کہ معمر نے اس طرح نہیں بیان کیا ہے ۔ سفیان نے کہا کہ لیکن مجھ سے تو ابراہیم بن میسرہ نے یہ حدیث اسی طرح نقل کی ۔  اور بعض لوگ کہتے ہیں کہ اگر کوئی شخص چاہے کہ شفیع کو حق شفعہ نہ دے تو اسے حیلہ کرنے کی اجازت ہے اور حیلہ یہ ہے کہ جائیداد کا مالک خریدار کو وہ جائیداد ہبہ کر دے پھر خریدار یعنی موہوب لہ اس ہبہ کے معاوضہ میں مالک جائیداد کو ہزار درہم مثلاً ہبہ کر دے اس صورت میں شفیع کو شفعہ کا حق نہ رہے گا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے ابراہیم بن میسرہ نے بیان کیا ‘ انہوں نے عمرو بن الشرید سے سنا ‘ انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، سَمِعْتُ عَمْرَو بْنَ الشَّرِيدِ، قَالَ جَاءَ الْمِسْوَرُ بْنُ مَخْرَمَةَ فَوَضَعَ يَدَهُ عَلَى مَنْكِبِي، فَانْطَلَقْتُ مَعَهُ إِلَى سَعْدٍ فَقَالَ أَبُو رَافِعٍ لِلْمِسْوَرِ أَلاَ تَأْمُرُ هَذَا أَنْ يَشْتَرِيَ مِنِّي بَيْتِي الَّذِي فِي دَارِي‏.‏ فَقَالَ لاَ أَزِيدُهُ عَلَى أَرْبَعِمِائَةٍ، إِمَّا مُقَطَّعَةٍ وَإِمَّا مُنَجَّمَةٍ‏.‏ قَالَ أُعْطِيتُ خَمْسَمِائَةٍ نَقْدًا، فَمَنَعْتُهُ، وَلَوْلاَ أَنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْجَارُ أَحَقُّ بِصَقَبِهِ ‏\"‏‏.‏ مَا بِعْتُكَهُ أَوْ قَالَ مَا أَعْطَيْتُكَهُ‏.‏ قُلْتُ لِسُفْيَانَ إِنَّ مَعْمَرًا لَمْ يَقُلْ هَكَذَا‏.‏ قَالَ لَكِنَّهُ قَالَ لِي هَكَذَا‏.‏ وَقَالَ بَعْضُ النَّاسِ إِذَا أَرَادَ أَنْ يَبِيعَ الشُّفْعَةَ فَلَهُ أَنْ يَحْتَالَ حَتَّى يُبْطِلَ الشُّفْعَةَ فَيَهَبُ الْبَائِعُ لِلْمُشْتَرِي الدَّارَ، وَيَحُدُّهَا وَيَدْفَعُهَا إِلَيْهِ، وَيُعَوِّضُهُ الْمُشْتَرِي أَلْفَ دِرْهَمٍ، فَلاَ يَكُونُ لِلشَّفِيعِ فِيهَا شُفْعَةٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6695,
                "hadithNumber": "6978",
                "englishNarrator": "Narrated Abu Rafi':",
                "hadithEnglish": "Sa'd رضی اللہ عنہ offered him four hundred Mithqal of gold for a house. Abu Rafi ' said, \"If I had not heard Allah's Messenger (ﷺ) saying, 'A neighbor has more right to be taken care of by his neighbor,' then I would not have given it to you.\" Some people said, \"If one has bought a portion of a house and wants to cancel the right of preemption, he may give it as a present to his little son and he will not be obliged to take an oath.\"",
                "hadithUrdu": "حضرت سعد رضی اللہ عنہ نے ان کے ایک گھر کی چار سو مثقال قیمت لگائی تو انہوں نے کہا کہ اگر میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ کہتے نہ سنا ہوتا کہ پڑوسی اپنے پڑوس کا زیادہ مستحق ہے تو میں اسے تمہیں نہ دیتا ۔  اور بعض لوگ کہتے ہیں کہ اگر کسی نے کسی گھر کا حصہ خریدا اور چاہا کہ اس کا حق شفہ باطل کر دے تو اسے اس گھر کو اپنے چھوٹے بیٹے کو ہبہ کر دینا چاہیے ۔ اب نابالغ پر قسم بھی نہیں ہو گی ۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے ابراہیم بن میسرہ نے بیان کیا ، ان سے عمرو بن شرید نے ، ان سے ابورافع نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِي رَافِعٍ، أَنَّ سَعْدًا، سَاوَمَهُ بَيْتًا بِأَرْبَعِمِائَةِ مِثْقَالٍ فَقَالَ لَوْلاَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْجَارُ أَحَقُّ بِصَقَبِهِ ‏\"‏‏.‏ لَمَا أَعْطَيْتُكَ‏.‏ وَقَالَ بَعْضُ النَّاسِ إِنِ اشْتَرَى نَصِيبَ دَارٍ، فَأَرَادَ أَنْ يُبْطِلَ الشُّفْعَةَ، وَهَبَ لاِبْنِهِ الصَّغِيرِ وَلاَ يَكُونُ عَلَيْهِ يَمِينٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6696,
                "hadithNumber": "6979",
                "englishNarrator": "Narrated Abu Humaid As-Sa`idi رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) appointed a man called Ibn Al-Lutabiyya to collect the Zakat from Bani Sulaim's tribe. When he returned, the Prophet (ﷺ) called him to account. He said (to the Prophet, 'This is your money, and this has been given to me as a gift.\" On that, Allah's Messenger (ﷺ) said, \"Why didn't you stay in your father's and mother's house to see whether you will be given gifts or not if you are telling the truth?\" Then the Prophet (ﷺ) addressed us, and after praising and glorifying Allah, he said: \"Amma Ba'du\", I employ a man from among you to manage some affair of what Allah has put under my custody, and then he comes to me and says, 'This is your money and this has been given to me as a gift. Why didn't he stay in his father's and mother's home to see whether he will be given gifts or not? By Allah, not anyone of you takes a thing unlawfully but he will meet Allah on the Day of Resurrection, carrying that thing. I do not want to see any of you carrying a grunting camel or a mooing cow or a bleating sheep on meeting Allah.\" Then the Prophet (ﷺ) raised both his hands till the whiteness of his armpits became visible, and he said, \"O Allah! Haven't I have conveyed (Your Message)?\" The narrator added: My eyes witnessed and my ears heard (that Hadith).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو بنی سلیم کے صدقات کی وصولی کے لیے عامل بنایا ان کا نام ابن اللتیبہ تھا پھر جب یہ عامل واپس آیا اور آنحضرت صلی اللہ علیہ وسلم نے ان کا حساب لیا ‘ اس نے سر کاری مال علیحدہ کیا اور کچھ مال کی نسبت کہنے لگا کہ یہ ( مجھے ) تحفہ میں ملا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا پھر کیوں نہ تم اپنے ماں باپ کے گھر بیٹھے رہے اگر تم سچے ہو تو وہیں یہ تحفہ تمہارے پاس آ جاتا ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے ہمیں خطبہ دیا اور اللہ کی حمد و ثنا کے بعد فرمایا امابعد ! میں تم میں سے کسی ایک کو اس کام پر عامل بناتا ہوں جس کا اللہ نے مجھے والی بنایا ہے پھر وہ شخص آتا ہے اور کہتا ہے کہ یہ تمہارا مال اور یہ تحفہ ہے جو مجھے دیا گیا تھا ۔ اسے اپنے ماں باپ کے گھر بیٹھا رہنا چاہئیے تھا تاکہ اس کا تحفہ وہیں پہنچ جاتا ۔ اللہ کی قسم تم میں سے جو بھی حق کے سوا کوئی چیز لے گا وہ اللہ تعالیٰ سے اس حال میں ملے گا کہ اس چیز کو اٹھائے ہوئے ہو گا بلکہ میں تم میں ہر اس شخص کو پہچان لوں گا جو اللہ سے اس حال میں ملے گا کہ اونٹ اٹھائے ہو گا جو بلبلا رہا ہو گا یا گائے اٹھائے ہو گا جو اپنی آواز نکال رہی ہو گی یا بکری اٹھائے ہو گا جو اپنی آواز نکال رہی ہو گی ۔ پھر آپ نے اپنا ہاتھ اٹھایا یہاں تک کہ آپ کے بغل کی سفیدی دکھائی دینے لگی اور فرمایا اے اللہ رضی اللہ عنہ کیا میں نے پہنچا دیا ۔ یہ فرماتے ہوئے آنحضرت صلی اللہ علیہ وسلم کو میری آنکھوں نے دیکھا اور کانوں سے سنا ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ ان سے ہشام نے ‘ ان سے ان کے والد عروہ نے اور ان سے ابوحمید الساعدی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، قَالَ اسْتَعْمَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً عَلَى صَدَقَاتِ بَنِي سُلَيْمٍ يُدْعَى ابْنَ اللُّتَبِيَّةِ، فَلَمَّا جَاءَ حَاسَبَهُ قَالَ هَذَا مَالُكُمْ وَهَذَا هَدِيَّةٌ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَهَلاَّ جَلَسْتَ فِي بَيْتِ أَبِيكَ وَأُمِّكَ، حَتَّى تَأْتِيَكَ هَدِيَّتُكَ إِنْ كُنْتَ صَادِقًا ‏\"‏‏.‏ ثُمَّ خَطَبَنَا فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ، فَإِنِّي أَسْتَعْمِلُ الرَّجُلَ مِنْكُمْ عَلَى الْعَمَلِ مِمَّا وَلاَّنِي اللَّهُ، فَيَأْتِي فَيَقُولُ هَذَا مَالُكُمْ وَهَذَا هَدِيَّةٌ أُهْدِيَتْ لِي‏.‏ أَفَلاَ جَلَسَ فِي بَيْتِ أَبِيهِ وَأُمِّهِ حَتَّى تَأْتِيَهُ هَدِيَّتُهُ، وَاللَّهِ لاَ يَأْخُذُ أَحَدٌ مِنْكُمْ شَيْئًا بِغَيْرِ حَقِّهِ، إِلاَّ لَقِيَ اللَّهَ يَحْمِلُهُ يَوْمَ الْقِيَامَةِ، فَلأَعْرِفَنَّ أَحَدًا مِنْكُمْ لَقِيَ اللَّهَ يَحْمِلُ بَعِيرًا لَهُ رُغَاءٌ، أَوْ بَقَرَةً لَهَا خُوَارٌ، أَوْ شَاةً تَيْعَرُ ‏\"‏‏.‏ ثُمَّ رَفَعَ يَدَهُ حَتَّى رُئِيَ بَيَاضُ إِبْطِهِ يَقُولُ ‏\"‏ اللَّهُمَّ هَلْ بَلَّغْتُ ‏\"‏‏.‏ بَصْرَ عَيْنِي وَسَمْعَ أُذُنِي‏.‏",
                "headingArabic": "احْتِيَالِ الْعَامِلِ لِيُهْدَى لَهُ",
                "headingUrdu": "تحائف حاصل کرنے کے لیے ایک سرکاری شخص کی چال",
                "headingEnglish": "Tricks by an official person to obtain presents",
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6697,
                "hadithNumber": "6980",
                "englishNarrator": "Narrated Abu Rafi` رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The neighbor has more right to be taken care of by his neighbor (than anyone else).\" Some men said, \"If one wants to buy a house for 20,000 Dirhams then there is no harm to play a trick to deprive somebody of preemption by buying it (just on paper) with 20,000 Dirhams but paying to the seller only 9,999 Dirhams in cash and then agree with the seller to pay only one Dinar in cash for the rest of the price (i.e. 10,001 Dirhams). If the preemptor offers 20,000 Dirhams for the house, he can buy it otherwise he has no right to buy it (by this trick he got out of preemption). If the house proves to belong to somebody else other than the seller, the buyer should take back from the seller what he has paid, i.e., 9,999 Dirhams and one Dinar, because if the house proves to belong to somebody else, so the whole bargain (deal) is unlawful. If the buyer finds a defect in the house and it does not belong to somebody other than the seller, the buyer may return it and receive 20,000 Dirhams (instead of 9999 Dirham plus one Dinar) which he actually paid.' Abu `Abdullah said, \"So that man allows (some people) the playing of tricks amongst the Muslims (although) the Prophet (ﷺ) said, 'In dealing with Muslims one should not sell them sick (animals) or bad things or stolen things.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا پڑوسی اپنے پڑوسی کا زیادہ حقدار ہے ۔  اور بعض لوگوں نے کہا اگر کسی شخص نے ایک گھر بیس ہزار درہم کا خریدا ( تو شفعہ کا حق ساقط کرنے کے لیے ) یہ حیلہ کرنے میں کوئی قباحت نہیں کہ مالک مکان کو نو ہراز نو سو ننانوے درہم نقد ادا کرے اب بیس ہزار کے تکملہ میں جو باقی رہے یعنی دس ہزار اور ایک درہم اس کے بدل مالک مکان کو ایک دینار ( اشرفی ) دیدے ۔ اس صورت میں اگر شفیع اس مکان کو لینا چاہے گا تو اس کو بیس ہزار درہم پر لینا ہو گا ورنہ وہ اس گھر کو نہیں لے سکتا ۔ ایسی صورت میں اگر بیع کے بعد یہ گھر ( بائع کے سوا ) اور کسی کا نکلا تو خریدار بائع سے وہی قیمت واپس لے گا جو اس نے دی ہے یعنی نو ہزار نو سو ننانوے درہم اور ایک دینار ( بیس ہزار دہم نہیں واپس سکتا ) کیونکہ جب وہ گھر کسی اور کا نکلا تو اب وہ بیع صرف جو بائع اور مشتری کے بیچ میں ہو گئی تھی بالکل باطل ہو گئی ( تو اصل دینار پھر نا لازم ہو گا نہ کہ اس کے ثمن ( یعنی دس ہزرا اور ایک درہم ) اگر اس گھر میں کوئی عیب نکلا لیکن وہ بائع کے سوا کسی اور کی ملک نہیں نکلا تو خریدار اس گھر کو بائع کو واپس اور بیس ہزار درہم اس سے لے سکتا ہے ۔ حضرت امام بخاری نے کہا تو ان لوگوں نے مسلمانوں کے آپس میں مکروفریب کو جائز رکھا اور آنحضرت صلی اللہ علیہ وسلم نے تو فرمایا ہے مسلمان کی بیع میں جو مسلمان کے ساتھ ہو نہ عیب ہونا چاہئیے ( بیماری ) نہ خباثت نہ کوئی آفت ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ‘ کہا ہم سے سفیان ثوری نے بیان کیا ‘ ان سے ابراہیم بن میسرہ نے ‘ ان سے عمرو بن شرید نے اور ان سے حضرت ابورافع رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِي رَافِعٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْجَارُ أَحَقُّ بِصَقَبِهِ ‏\"‏‏.‏ وَقَالَ بَعْضُ النَّاسِ إِنِ اشْتَرَى دَارًا بِعِشْرِينَ أَلْفَ دِرْهَمٍ، فَلاَ بَأْسَ أَنْ يَحْتَالَ حَتَّى يَشْتَرِيَ الدَّارَ بِعِشْرِينَ أَلْفَ دِرْهَمٍ، وَيَنْقُدَهُ تِسْعَةَ آلاَفِ دِرْهَمٍ وَتِسْعَمِائَةَ دِرْهَمٍ وَتِسْعَةً وَتِسْعِينَ، وَيَنْقُدَهُ دِينَارًا بِمَا بَقِيَ مِنَ الْعِشْرِينَ الأَلْفَ، فَإِنْ طَلَبَ الشَّفِيعُ أَخَذَهَا بِعِشْرِينَ أَلْفَ دِرْهَمٍ، وَإِلاَّ فَلاَ سَبِيلَ لَهُ عَلَى الدَّارِ، فَإِنِ اسْتُحِقَّتِ الدَّارُ، رَجَعَ الْمُشْتَرِي عَلَى الْبَائِعِ بِمَا دَفَعَ إِلَيْهِ، وَهْوَ تِسْعَةُ آلاَفِ دِرْهَمٍ وَتِسْعُمِائَةٍ وَتِسْعَةٌ وَتِسْعُونَ دِرْهَمًا وَدِينَارٌ، لأَنَّ الْبَيْعَ حِينَ اسْتُحِقَّ انْتَقَضَ الصَّرْفُ فِي الدِّينَارِ، فَإِنْ وَجَدَ بِهَذِهِ الدَّارِ عَيْبًا وَلَمْ تُسْتَحَقَّ، فَإِنَّهُ يَرُدُّهَا عَلَيْهِ بِعِشْرِينَ أَلْفَ دِرْهَمٍ‏.‏ قَالَ فَأَجَازَ هَذَا الْخِدَاعَ بَيْنَ الْمُسْلِمِينَ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لاَ دَاءَ وَلاَ خِبْثَةَ وَلاَ غَائِلَةَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6698,
                "hadithNumber": "6981",
                "englishNarrator": "Narrated `Amr bin Ash-Sharid:",
                "hadithEnglish": "Abu Rafi` رضی اللہ عنہ sold a house to Sa`d bin Malik رضی اللہ عنہ for four-hundred Mithqal of gold, and said, \"If I had not heard the Prophet (ﷺ) saying, 'The neighbor has more right to be taken care of by his neighbor (than anyone else),' then I would not have sold it to you.\"",
                "hadithUrdu": "ابورافع رضی اللہ عنہ نے سعد بن مالک رضی اللہ عنہ کو ایک گھر چار سو مثقال میں بیچا اور کہا کہ اگر میں نے نبی کریم صلی اللہ علیہ وسلم سے یہ نہ سنا ہوتا کہ پڑوسی حق پڑوس کا زیادہ حقدار ہے تو میں آپ کو یہ گھر نہ دیتا ( اور کسی کے ہاتھ بیچ ڈالتا ) ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے یحییٰ نے بیان کیا ‘ ان سے سفیان نے ‘ ان سے ابراہیم بن میسرہ نے بیان کیا ‘ ان سے عمرو بن شرید نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، أَنَّ أَبَا رَافِعٍ، سَاوَمَ سَعْدَ بْنَ مَالِكٍ بَيْتًا بِأَرْبَعِمِائَةِ مِثْقَالٍ وَقَالَ لَوْلاَ أَنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْجَارُ أَحَقُّ بِصَقَبِهِ ‏\"‏‏.‏ مَا أَعْطَيْتُكَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "92",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 92,
                    "chapterNumber": "92",
                    "chapterEnglish": "Tricks",
                    "chapterUrdu": "شرعی حیلوں کے بیان میں",
                    "chapterArabic": "كتاب الحيل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6699,
                "hadithNumber": "6982",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The commencement of the Divine Inspiration to Allah's Messenger (ﷺ) was in the form of good righteous (true) dreams in his sleep. He never had a dream but that it came true like bright day light. He used to go in seclusion (the cave of) Hira where he used to worship(Allah Alone) continuously for many (days) nights. He used to take with him the journey food for that (stay) and then come back to (his wife) Khadija رضی اللہ عنہا to take his food like-wise again for another period to stay, till suddenly the Truth descended upon him while he was in the cave of Hira. The angel came to him in it and asked him to read. The Prophet (ﷺ) replied, \"I do not know how to read.\" (The Prophet (ﷺ) added), \"The angel caught me (forcefully) and pressed me so hard that I could not bear it anymore. He then released me and again asked me to read, and I replied, \"I do not know how to read,\" whereupon he caught me again and pressed me a second time till I could not bear it anymore. He then released me and asked me again to read, but again I replied, \"I do not know how to read (or, what shall I read?).\" Thereupon he caught me for the third time and pressed me and then released me and said, \"Read: In the Name of your Lord, Who has created (all that exists). Has created man from a clot. Read and Your Lord is Most Generous...up to..... ..that which he knew not.\" (96.15) Then Allah's Messenger (ﷺ) returned with the Inspiration, his neck muscles twitching with terror till he entered upon Khadija رضی اللہ عنہا and said, \"Cover me! Cover me!\" They covered him till his fear was over and then he said, \"O Khadija رضی اللہ عنہا , what is wrong with me?\" Then he told her everything that had happened and said, 'I fear that something may happen to me.\" Khadija رضی اللہ عنہا said, 'Never! But have the glad tidings, for by Allah, Allah will never disgrace you as you keep good reactions with your Kith and kin, speak the truth, help the poor and the destitute, serve your guest generously and assist the deserving, calamityafflicted ones.\" Khadija رضی اللہ عنہا then accompanied him to (her cousin) Waraqa bin Naufal bin Asad bin `Abdul `Uzza bin Qusai. Waraqa was the son of her paternal uncle, i.e., her father's brother, who during the Pre-Islamic Period became a Christian and used to write the Arabic writing and used to write of the Gospels in Arabic as much as Allah wished him to write. He was an old man and had lost his eyesight. Khadija رضی اللہ عنہا said to him, \"O my cousin! Listen to the story of your nephew.\" Waraqa asked, \"O my nephew! What have you seen?\" The Prophet (ﷺ) described whatever he had seen. Waraqa said, \"This is the same Namus (i.e., Gabriel, the Angel who keeps the secrets) whom Allah had sent to Moses. I wish I were young and could live up to the time when your people would turn you out.\" Allah's Messenger (ﷺ) asked, \"Will they turn me out?\" Waraqa replied in the affirmative and said: \"Never did a man come with something similar to what you have brought but was treated with hostility. If I should remain alive till the day when you will be turned out then I would support you strongly.\" But after a few days Waraqa died and the Divine Inspiration was also paused for a while and the Prophet (ﷺ) became so sad as we have heard that he intended several times to throw himself from the tops of high mountains and every time he went up the top of a mountain in order to throw himself down, Gabriel would appear before him and say, \"O Muhammad! You are indeed Allah's Messenger (ﷺ) in truth\" whereupon his heart would become quiet and he would calm down and would return home. And whenever the period of the coming of the inspiration used to become long, he would do as before, but when he used to reach the top of a mountain, Gabriel would appear before him and say to him what he had said before. (Ibn `Abbas رضی اللہ عنہما said regarding the meaning of: 'He it is that Cleaves the daybreak (from the darkness)' (6.96) that Al-Asbah. means the light of the sun during the day and the light of the moon at night).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم پر وحی کی ابتداء سونے کی حالت میں سچے خواب کے ذریعہ ہوئی ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم جو خواب بھی دیکھتے تو وہ صبح کی روشنی کی طرح سامنے آ جا تا اور آنحضرت صلی اللہ علیہ وسلم غار حرا میں چلے جاتے اور اس میں تنہا خدا کی یاد کرتے تھے چند مقررہ دنوں کے لیے ۔ ( یہاں آتے ) اور ان دنوں کا توشہ بھی ساتھ لاتے ۔ پھر حضرت خدیجہ رضی اللہ عنہا کے پاس واپس تشریف لے جاتے اور وہ پھر اتنا ہی توشہ آپ کے ساتھ کر دیتیں یہاں تک کہ حق آپ کے پاس اچانک آ گیا اور آپ غار حرا ہی میں تھے ۔ چنانچہ اس میں فرشتہ آپ کے پاس آیا اور کہا کہ پڑھیے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس سے فرمایا کہ میں پڑھا ہوا نہیں ہوں ۔ آخر اس نے مجھے پکڑ لیا اور زور سے دابا اور خوب دابا جس کی وجہ سے مجھ کو بہت تکلیف ہوئی ۔ پھر اس نے مجھے چھوڑ دیا اور کہا کہ پڑھیے آپ صلی اللہ علیہ وسلم نے پھر وہی جواب دیا کہ میں پڑھا ہوا نہیں ہوں ۔ اس نے مجھے ایسا دابا کہ میں بے قابو ہو گیا یا انہوں نے اپنا زور ختم کر دیا اور پھر چھوڑ کر اس نے مجھ سے کہا کہ پڑھیے اپنے رب کے نام سے جس نے پیدا کیا ہے ۔ الفاظ ” مالم یعلم “ تک ۔ پھر جب آپ صلی اللہ علیہ وسلم حضرت خدیجہ رضی اللہ عنہا کے پاس آئے تو آپ کے مونڈھوں کے گوشت ( ڈر کے مارے ) پھڑک رہے تھے ۔ جب گھر میں آپ صلی اللہ علیہ وسلم داخل ہوئے تو فرمایا کہ مجھے چادر اڑھا دو ‘ مجھے چادر اڑھا دو چنانچہ کو چادر اڑھا دی گئی اور جب آپ صلی اللہ علیہ وسلم کا خوف دور ہو گیا تو فرمایا کہ خدیجہ رضی اللہ عنہا میرا حال کیا ہو گیا ہے ؟ پھر آپ صلی اللہ علیہ وسلم نے اپنا سارا حال بیان کیا اور فرمایا کہ مجھے اپنی جان کا ڈر ہے ۔ لیکن حضرت خدیجہ رضی اللہ عنہا نے کہا خدا کی قسم ایسا ہرگز نہیں ہو سکتا ‘ آپ خوش رہئے خداوند تعالیٰ آپ کو کبھی رسوا نہیں کرے گا ۔ آپ تو صلہ رحمی کرتے ہیں ‘ بات سچی بولتے ہیں ‘ نا داروں کا بوجھ اٹھاتے ہیں ‘ مہمان نوازی کرتے ہیں اور حق کی وجہ سے پیش آنے والی مصیبتوں پر لوگوں کی مدد کرتے ہیں ۔ پھر آپ کو حضرت خدیجہ رضی اللہ عنہا ورقہ بن نوفل بن اسد بن عبد العزیٰ بن قصی کے پاس لائیں جو حضرت خدیجہ رضی اللہ عنہا کے والد خویلد کے بھائی کے بیٹے تھے ۔ جو زمانہ جاہلیت میں عیسائی ہو گئے تھے اور عربی لکھ لیتے تھے اور وہ جتنا اللہ تعالیٰ چاہتا عربی میں انجیل کا ترجمہ لکھا کرتے تھے ‘ وہ اس وقت بہت بوڑھے ہو گئے تھے اور بینائی بھی جاتی رہی تھی ۔ ان سے حضرت خدیجہ رضی اللہ عنہا نے کہا بھائی ! اپنے بھتیجے کی بات سنو ۔ ورقہ نے پوچھا بھتیجے تم کیا دیکھتے ہو ؟ آنحضرت صلی اللہ علیہ وسلم نے جو دیکھا تھا وہ سنایا تو ورقہ نے کہا کہ یہ تو وہی فرشتہ ( جبرائیل علیہ السلام ) ہے جو موسیٰ علیہ السلام پر آیا تھا ۔ کاش میں اس وقت جوان ہوتا جب تمہیں تمہاری قوم نکال دے گی اور زندہ رہتا آنحضرت صلی اللہ علیہ وسلم نے پوچھا کیا یہ مجھے نکالیں گے ؟ ورقہ نے کہا کہ ہاں ۔ جب بھی کوئی نبی ورسول وہ پیغام لے کر آیا جسے لے کر آپ آئے ہیں تو اس کے ساتھ دشمنی کی گئی اور اگر میں نے تمہارے وہ دن پا لیے تو میں تمہاری بھرپور مدد کروں گا لیکن کچھ ہی دنوں بعد ورقہ کا انتقال ہو گیا اور وحی کا سلسلہ کٹ گیا اور آنحضرت کو اس کی وجہ سے اتنا غم تھا کہ آپ نے کئی مرتبہ پہاڑ کی بلند چوٹی سے اپنے آپ کو گرا دینا چاہا لیکن جب بھی آپ کسی پہا ڑ کی چوٹی پر چڑھے تاکہ اس پر سے اپنے آپ کو گرادیں تو جبرائیل علیہ السلام آپ کے سامنے آ گئے اور کہا کہ یا محمد ! آپ یقیناً اللہ کے رسول ہیں ۔ اس سے آنحضرت صلی اللہ علیہ وسلم کو سکون ہوتا اور آپ واپس آ جاتے لیکن جب وحی زیادہ دنوں تک رکی رہی تو آپ نے ایک مرتبہ اور ایسا ارادہ کیا لیکن جب پہاڑ کی چوٹی پر چڑھے تو حضرت جبرائیل علیہ السلام سامنے آئے اور اسی طرح کی بات پھر کہی ۔ حضرت ابن عباس رضی اللہ عنہما نے کہا سورۃ الانعام میں لفظ فالق الاصباح سے مراد دن میں سورج کی روشنی اور رات میں چاند کی روشنی ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ‘ ان سے عقیل بن خالد نے بیان کیا ‘ اور ان سے ابن شہاب نے بیان کیا ( دوسری سند امام بخاری نے کہا ) کہ مجھ سے عبداللہ بن محمد مسندی نے بیان کیا ‘ انہوں نے کہا مجھ سے عبدالرزاق نے بیان کیا ‘ ان سے معمر نے بیان کیا ‘ ان سے زہری نے کہا کہ مجھے عروہ نے خبر دی اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ،‏.‏ وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، قَالَ الزُّهْرِيُّ فَأَخْبَرَنِي عُرْوَةُ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ أَوَّلُ مَا بُدِئَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الْوَحْىِ الرُّؤْيَا الصَّادِقَةُ فِي النَّوْمِ، فَكَانَ لاَ يَرَى رُؤْيَا إِلاَّ جَاءَتْ مِثْلَ فَلَقِ الصُّبْحِ، فَكَانَ يَأْتِي حِرَاءً فَيَتَحَنَّثُ فِيهِ ـ وَهْوَ التَّعَبُّدُ ـ اللَّيَالِيَ ذَوَاتِ الْعَدَدِ، وَيَتَزَوَّدُ لِذَلِكَ ثُمَّ يَرْجِعُ إِلَى خَدِيجَةَ فَتُزَوِّدُهُ لِمِثْلِهَا، حَتَّى فَجِئَهُ الْحَقُّ وَهْوَ فِي غَارِ حِرَاءٍ فَجَاءَهُ الْمَلَكُ فِيهِ فَقَالَ اقْرَأْ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَقُلْتُ مَا أَنَا بِقَارِئٍ فَأَخَذَنِي فَغَطَّنِي حَتَّى بَلَغَ مِنِّي الْجَهْدَ ثُمَّ أَرْسَلَنِي‏.‏ فَقَالَ اقْرَأْ‏.‏ فَقُلْتُ مَا أَنَا بِقَارِئٍ‏.‏ فَأَخَذَنِي فَغَطَّنِي الثَّانِيَةَ حَتَّى بَلَغَ مِنِّي الْجَهْدَ، ثُمَّ أَرْسَلَنِي فَقَالَ اقْرَأْ‏.‏ فَقُلْتُ مَا أَنَا بِقَارِئٍ‏.‏ فَغَطَّنِي الثَّالِثَةَ حَتَّى بَلَغَ مِنِّي الْجَهْدُ، ثُمَّ أَرْسَلَنِي فَقَالَ اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ ‏\"‏‏.‏ حَتَّى بَلَغَ ‏{‏مَا لَمْ يَعْلَمْ‏}‏ فَرَجَعَ بِهَا تَرْجُفُ بَوَادِرُهُ حَتَّى دَخَلَ عَلَى خَدِيجَةَ فَقَالَ ‏\"‏ زَمِّلُونِي زَمِّلُونِي ‏\"‏‏.‏ فَزَمَّلُوهُ حَتَّى ذَهَبَ عَنْهُ الرَّوْعُ فَقَالَ ‏\"‏ يَا خَدِيجَةُ مَا لِي ‏\"‏‏.‏ وَأَخْبَرَهَا الْخَبَرَ وَقَالَ ‏\"‏ قَدْ خَشِيتُ عَلَى نَفْسِي ‏\"‏‏.‏ فَقَالَتْ لَهُ كَلاَّ أَبْشِرْ، فَوَاللَّهِ لاَ يُخْزِيكَ اللَّهُ أَبَدًا، إِنَّكَ لَتَصِلُ الرَّحِمَ، وَتَصْدُقُ الْحَدِيثَ، وَتَحْمِلُ الْكَلَّ، وَتَقْرِي الضَّيْفَ، وَتُعِينُ عَلَى نَوَائِبِ الْحَقِّ‏.‏ ثُمَّ انْطَلَقَتْ بِهِ خَدِيجَةُ حَتَّى أَتَتْ بِهِ وَرَقَةَ بْنَ نَوْفَلِ بْنِ أَسَدِ بْنِ عَبْدِ الْعُزَّى بْنِ قُصَىٍّ ـ وَهْوَ ابْنُ عَمِّ خَدِيجَةَ أَخُو أَبِيهَا، وَكَانَ امْرَأً تَنَصَّرَ فِي الْجَاهِلِيَّةِ، وَكَانَ يَكْتُبُ الْكِتَابَ الْعَرَبِيَّ فَيَكْتُبُ بِالْعَرَبِيَّةِ مِنَ الإِنْجِيلِ مَا شَاءَ اللَّهُ أَنْ يَكْتُبَ، وَكَانَ شَيْخًا كَبِيرًا قَدْ عَمِيَ ـ فَقَالَتْ لَهُ خَدِيجَةُ أَىِ ابْنَ عَمِّ اسْمَعْ مِنِ ابْنِ أَخِيكَ‏.‏ فَقَالَ وَرَقَةُ ابْنَ أَخِي مَاذَا تَرَى فَأَخْبَرَهُ النَّبِيُّ صلى الله عليه وسلم مَا رَأَى فَقَالَ وَرَقَةُ هَذَا النَّامُوسُ الَّذِي أُنْزِلَ عَلَى مُوسَى، يَا لَيْتَنِي فِيهَا جَذَعًا أَكُونُ حَيًّا، حِينَ يُخْرِجُكَ قَوْمُكَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَوَمُخْرِجِيَّ هُمْ ‏\"‏‏.‏ فَقَالَ وَرَقَةُ نَعَمْ، لَمْ يَأْتِ رَجُلٌ قَطُّ بِمَا جِئْتَ بِهِ إِلاَّ عُودِيَ، وَإِنْ يُدْرِكْنِي يَوْمُكَ أَنْصُرْكَ نَصْرًا مُؤَزَّرًا‏.‏ ثُمَّ لَمْ يَنْشَبْ وَرَقَةُ أَنْ تُوُفِّيَ، وَفَتَرَ الْوَحْىُ فَتْرَةً حَتَّى حَزِنَ النَّبِيُّ صلى الله عليه وسلم فِيمَا بَلَغَنَا حُزْنًا غَدَا مِنْهُ مِرَارًا كَىْ يَتَرَدَّى مِنْ رُءُوسِ شَوَاهِقِ الْجِبَالِ، فَكُلَّمَا أَوْفَى بِذِرْوَةِ جَبَلٍ لِكَىْ يُلْقِيَ مِنْهُ نَفْسَهُ، تَبَدَّى لَهُ جِبْرِيلُ فَقَالَ يَا مُحَمَّدُ إِنَّكَ رَسُولُ اللَّهِ حَقًّا‏.‏ فَيَسْكُنُ لِذَلِكَ جَأْشُهُ وَتَقِرُّ نَفْسُهُ فَيَرْجِعُ، فَإِذَا طَالَتْ عَلَيْهِ فَتْرَةُ الْوَحْىِ غَدَا لِمِثْلِ ذَلِكَ، فَإِذَا أَوْفَى بِذِرْوَةِ جَبَلٍ تَبَدَّى لَهُ جِبْرِيلُ فَقَالَ لَهُ مِثْلَ ذَلِكَ‏.‏ قَالَ ابْنُ عَبَّاسٍ ‏{‏فَالِقُ الإِصْبَاحِ‏}‏ ضَوْءُ الشَّمْسِ بِالنَّهَارِ، وَضَوْءُ الْقَمَرِ بِاللَّيْلِ‏.‏",
                "headingArabic": "اللہ کے رسول صلی اللہ علیہ وسلم پر وحی الٰہی کا آغاز اچھے خوابوں کی صورت میں تھا۔",
                "headingUrdu": "اللہ کے رسول صلی اللہ علیہ وسلم پر وحی الٰہی کا آغاز اچھے خوابوں کی صورت میں تھا۔",
                "headingEnglish": "Commencement of the Divine Revelation to Allah’s Messenger (saws) was in the form of good dreams",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6700,
                "hadithNumber": "6983",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"A good dream (that comes true) of a righteous man is one of forty-six parts of prophetism.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کسی نیک آدمی کا اچھا خواب نبوت کا چھیالیسواں حصہ ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ‘ انہوں نے کہا ہم سے امام مالک نے بیان کیا ‘ ان سے اسحاق بن عبداللہ بن ابی طلحہ نے بیان کیا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الرُّؤْيَا الْحَسَنَةُ مِنَ الرَّجُلِ الصَّالِحِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏",
                "headingArabic": "رُؤْيَا الصَّالِحِينَ",
                "headingUrdu": "نیک لوگوں کے خواب",
                "headingEnglish": "The dreams of righteous people",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6701,
                "hadithNumber": "6984",
                "englishNarrator": "Narrated Abu Qatada رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A true good dream is from Allah, and a bad dream is from Satan.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( اچھے ) خواب اللہ کی طرف سے ہوتے ہیں اور برے خواب شیطان کی طرف سے ہوتے ہیں ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ‘ کہا ہم سے زہیر نے بیان کیا ‘ کہا ہم سے یحییٰ نے جو سعید کے بیٹے ہیں ‘ کہا کہ میں نے حضرت ابوسلمہ رضی اللہ عنہ سے سنا ‘ کہا کہ میں نے ابوقتادہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا يَحْيَى ـ هُوَ ابْنُ سَعِيدٍ ـ قَالَ سَمِعْتُ أَبَا سَلَمَةَ، قَالَ سَمِعْتُ أَبَا قَتَادَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الرُّؤْيَا مِنَ اللَّهِ، وَالْحُلْمُ مِنَ الشَّيْطَانِ ‏\"‏‏.‏",
                "headingArabic": "الرُّؤْيَا مِنَ اللَّهِ",
                "headingUrdu": "اچھے خواب اللہ کی طرف سے ہوتے ہیں۔",
                "headingEnglish": "Good dreams are from Allah",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6702,
                "hadithNumber": "6985",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If anyone of you sees a dream that he likes, then it is from Allah, and he should thank Allah for it and narrate it to others; but if he sees something else, i.e., a dream that he dislikes, then it is from Satan, and he should seek refuge with Allah from its evil, and he should not mention it to anybody, for it will not harm him.\"",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا کہ جب تم میں سے کوئی ایسا خواب دیکھے جسے وہ پسند کرتا ہو تو وہ اللہ کی طرف سے ہوتا ہے ۔ اس پر اللہ کی حمد کرے اور اسے بتا دینا چاہئیے لیکن اگر کوئی اس کے سوا کوئی ایسا خواب دیکھتا ہے جو اسے ناپسند ہے تو یہ شیطان کی طرف سے ہوتا ہے پس اس کے شر سے پناہ مانگے اور کسی سے ایسے خواب کا ذکر نہ کرے ۔ یہ خواب اسے کچھ نقصان نہیں پہنچا سکے گا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے بیان کیا ‘ ان سے ابن الہاد نے ‘ ان سے عبداللہ بن خباب نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا رَأَى أَحَدُكُمْ رُؤْيَا يُحِبُّهَا فَإِنَّمَا هِيَ مِنَ اللَّهِ، فَلْيَحْمَدِ اللَّهَ عَلَيْهَا، وَلْيُحَدِّثْ بِهَا، وَإِذَا رَأَى غَيْرَ ذَلِكَ مِمَّا يَكْرَهُ، فَإِنَّمَا هِيَ مِنَ الشَّيْطَانِ، فَلْيَسْتَعِذْ مِنْ شَرِّهَا، وَلاَ يَذْكُرْهَا لأَحَدٍ، فَإِنَّهَا لاَ تَضُرُّهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6703,
                "hadithNumber": "6986",
                "englishNarrator": "Narrated Abu Qatada رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A good dream that comes true is from Allah, and a bad dream is from Satan, so if anyone of you sees a bad dream, he should seek refuge with Allah from Satan and should spit on the left, for the bad dream will not harm him.\" Similarly Hadrat Abu Qatadah رضی اللہ عنہ has reported from the prophet ﷺ.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اچھا خواب اللہ کی طرف سے ہوتا ہے اور برا خواب شیطان کی طرف سے پس اگر کوئی برا خواب دیکھے تو اسے اس سے اللہ کی پناہ مانگنی چاہئیے اور بائیں طرف تھوکنا چاہئیے یہ خواب اسے کوئی نقصان نہیں پہنچا سکے گا اور عبداللہ بن یحییٰ سے ان کے والد نے اور ان سے عبداللہ بن ابی قتادہ نے بیان کیا اور ان سے ان کے والد نے نبی کریم صلی اللہ علیہ وسلم سے اسی طرح بیان کیا",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے عبداللہ بن یحییٰ بن ابی کثیر نے بیان کیا اور ان کی تعریف کی کہ میں نے ان سے یمامہ میں ملاقات کی تھی ‘ ان سے ان کے والد نے ‘ ان سے ابوسلمہ رضی اللہ عنہ اور ان سے ابوقتادہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَحْيَى بْنِ أَبِي كَثِيرٍ ـ وَأَثْنَى عَلَيْهِ خَيْرًا لَقِيتُهُ بِالْيَمَامَةِ ـ عَنْ أَبِيهِ، حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي قَتَادَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الرُّؤْيَا الصَّالِحَةُ مِنَ اللَّهِ، وَالْحُلْمُ مِنَ الشَّيْطَانِ، فَإِذَا حَلَمَ فَلْيَتَعَوَّذْ مِنْهُ وَلْيَبْصُقْ عَنْ شِمَالِهِ، فَإِنَّهَا لاَ تَضُرُّهُ ‏\"‏‏.‏ وَعَنْ أَبِيهِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏",
                "headingArabic": "الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ",
                "headingUrdu": "\"ایک صالح اچھا خواب جو سچا ہو، النبوۃ کے چھیالیس حصوں میں سے ایک ہے۔\"",
                "headingEnglish": "“A righteous good dream that comes true is one of the forty-six parts of An-Nubuwwa.”",
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6704,
                "hadithNumber": "6987",
                "englishNarrator": "Narrated 'Ubada bin As-Samit رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The (good) dreams of a faithful believer is a part of the forty-six parts of prophetism:'",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مومن کا خواب نبوت کے چھیالیس حصوں میں سے ایک حصہ ہوتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ‘ کہا ہم سے غندر نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے قتادہ نے ‘ ان سے حضرت انس بن مالک رضی اللہ عنہ نے اور ان سے حضرت عبادہ بن صامت رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6705,
                "hadithNumber": "6988",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The (good) dream of a faithful believer is a part of the forty-six parts of prophetism.\" Hadrat Anas رضی اللہ عنہ has also reported it from the prophet ﷺ.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا مومن کا خواب نبوت کے چھیالیس حصوں میں سے ایک حصہ ہوتا ہے ۔ اس کی روایت ثابت ‘ حمید ‘ اسحاق بن عبداللہ اور شعیب نے حضرت انس رضی اللہ عنہ سے کی ۔ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ۔",
                "urduNarrator": "ہم سے یحییٰ بن قزعہ نے بیان کیا ‘ انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ‘ ان سے زہری نے بیان کیا ‘ ان سے سعید بن المسیب نے بیان کیا ‘ اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏‏.‏ رَوَاهُ ثَابِتٌ وَحُمَيْدٌ وَإِسْحَاقُ بْنُ عَبْدِ اللَّهِ وَشُعَيْبٌ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "93",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 93,
                    "chapterNumber": "93",
                    "chapterEnglish": "Interpretation of Dreams",
                    "chapterUrdu": "خوابوں کی تعبیر کے بیان میں",
                    "chapterArabic": "كتاب التعبير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 6676,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=267",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=265",
                "label": "265",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=266",
                "label": "266",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=267",
                "label": "267",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=268",
                "label": "268",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=269",
                "label": "269",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=270",
                "label": "270",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=271",
                "label": "271",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=269",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=269",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=267",
        "to": 6700,
        "total": 40465
    }
}