{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 16,
        "data": [
            {
                "id": 376,
                "hadithNumber": "380",
                "englishNarrator": "Narrated 'Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "\"My grandmother Mulaika invited Allah's Messenger (ﷺ) for a meal which she herself had prepared. He ate from it and said, 'Get up! I will lead you in the prayer.' \" \r\nAnas added, \"I took my Hasir, washed it with water as it had become dark because of long use and Allah's Messenger (ﷺ) stood on it. The orphan (Damira or Ruh) and I aligned behind him and the old lady (Mulaika) stood behind us. Allah's Messenger (ﷺ) led us in the prayer and offered two rak`at and then left.\"",
                "hadithUrdu": "ان کی نانی ملیکہ نےرسول اللہ صلی اللہ علیہ وسلم کو کھانا تیار کر کے کھانے کے لیے بلایا ۔ آپ صلی اللہ علیہ وسلم نے کھانے کے بعد فرمایا کہ آو تمہیں نماز پڑھا دوں ۔ انس رضی اللہ عنہ نے کہا کہ میں نے اپنے گھر سے ایک بوریا اٹھایا جو کثرت استعمال سے کالا ہو گیا تھا ۔ میں نے اس پر پانی چھڑکا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نماز کے لیے ( اسی بورئیے پر ) کھڑے ہوئے اور میں اور ایک یتیم ( کہ رسول اللہ صلی اللہ علیہ وسلم کے غلام ابوضمیرہ کے لڑکے ضمیرہ ) آپ کے پیچھے صف باندھ کر کھڑے ہو گئے اور بوڑھی عورت ( انس کی نانی ملیکہ ) ہمارے پیچھے کھڑی ہوئیں ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں دو رکعت نماز پڑھائی اور واپس گھر تشریف لے گئے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا کہا کہ ہمیں امام مالک نے خبر دی اسحاق بن عبداللہ بن ابی طلحہ سے ، انھوں نے انس بن مالک رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ جَدَّتَهُ، مُلَيْكَةَ دَعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ صَنَعَتْهُ لَهُ، فَأَكَلَ مِنْهُ ثُمَّ قَالَ ‏ \"‏ قُومُوا فَلأُصَلِّ لَكُمْ ‏\"‏‏.‏ قَالَ أَنَسٌ فَقُمْتُ إِلَى حَصِيرٍ لَنَا قَدِ اسْوَدَّ مِنْ طُولِ مَا لُبِسَ، فَنَضَحْتُهُ بِمَاءٍ، فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَصَفَفْتُ وَالْيَتِيمَ وَرَاءَهُ، وَالْعَجُوزُ مِنْ وَرَائِنَا، فَصَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم رَكْعَتَيْنِ ثُمَّ انْصَرَفَ‏.‏",
                "headingArabic": "الصَّلاَةِ عَلَى الْحَصِيرِ",
                "headingUrdu": "حصیر (ایک چٹائی جو کھجور کے پتوں سے بنی ہو اور آدمی کے قد کے برابر یا اس سے زیادہ ہو) پر نماز پڑھنا",
                "headingEnglish": "To offer As-Salat (the prayers) on the Hasir (a mat that is made of the leaves of date-palm trees and is as long as or longer than a man's stature",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 377,
                "hadithNumber": "381",
                "englishNarrator": "Narrated Maimuna رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to pray on Khumra.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سجدہ گاہ ( یعنی چھوٹے مصلے ) پر نماز پڑھا کرتے تھے ۔",
                "urduNarrator": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، کہ کہا ہم سے شعبہ نے ، کہا ہم سے سلیمان شیبانی نے عبداللہ بن شداد کے واسطے سے ، انھوں نے ام المؤمنین میمونہ رضی اللہ عنہا سے ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنَا سُلَيْمَانُ الشَّيْبَانِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، عَنْ مَيْمُونَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي عَلَى الْخُمْرَةِ‏.‏",
                "headingArabic": "الصَّلاَةِ عَلَى الْخُمْرَةِ",
                "headingUrdu": "خمرہ پر نماز پڑھنا (ایک چھوٹی چٹائی جو نماز کے دوران سجدہ میں چہرے اور ہاتھوں کے لیے مشکل سے کافی ہوتی ہے)",
                "headingEnglish": "To offer As-Salat (the prayers) on a Khumra (a small mat, hardly sufficient for the face and hands while prostrating during Salat)",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 378,
                "hadithNumber": "382",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا ( the wife of the Prophet ﷺ):",
                "hadithEnglish": "\"I used to sleep in front o Allah's Messenger (ﷺ) and my legs were opposite his Qibla and in prostration he pushed my legs and I withdrew then and when he stood, I stretched them.' `Aisha added, \"In those days the houses were without lights.\"",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے آگے سو جاتی اور میرے پاؤں آپ صلی اللہ علیہ وسلم کے قبلہ میں ہوتے ۔ جب آپ صلی اللہ علیہ وسلم سجدہ کرتے ، تو میرے پاؤں کو آہستہ سے دبا دیتے ۔ میں اپنے پاؤں سمیٹ لیتی اور آپ جب کھڑے ہو جاتے تو میں انہیں پھر پھیلا دیتی ۔ ان دنوں گھروں میں چراغ بھی نہیں ہوا کرتے تھے ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہ کہا مجھ سے امام مالک نے عمر بن عبیداللہ کے غلام ابوالنضر سالم کے حوالہ سے ، انھوں نے ابوسلمہ بن عبدالرحمٰن سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا سے ۔ آپ نے بتلایا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كُنْتُ أَنَامُ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَرِجْلاَىَ فِي قِبْلَتِهِ، فَإِذَا سَجَدَ غَمَزَنِي، فَقَبَضْتُ رِجْلَىَّ، فَإِذَا قَامَ بَسَطْتُهُمَا‏.‏ قَالَتْ وَالْبُيُوتُ يَوْمَئِذٍ لَيْسَ فِيهَا مَصَابِيحُ‏.‏",
                "headingArabic": "الصَّلاَةِ عَلَى الْفِرَاشِ",
                "headingUrdu": "بستر پر نماز پڑھنا",
                "headingEnglish": "To offer As-Salat (the prayers) on the bed",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 379,
                "hadithNumber": "383",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah Messenger ﷺ prayed while I was lying like a dead body on his family bed between him and his Qibla.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنے گھر کے بچھونے پر نماز پڑھتے اور حضرت عائشہ رضی اللہ عنہا آپ صلی اللہ علیہ وسلم کے اور قبلہ کے درمیان اس طرح لیٹی ہوتیں جیسے ( نماز کے لیے ) جنازہ رکھا جاتا ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے عقیل سے ، انھوں نے ابن شہاب سے ، ان کو عروہ نے خبر دی کہ حضرت عائشہ رضی اللہ عنہا نے انہیں بتایا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي وَهْىَ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ عَلَى فِرَاشِ أَهْلِهِ، اعْتِرَاضَ الْجَنَازَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 380,
                "hadithNumber": "384",
                "englishNarrator": "Narrated `Urwa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) prayed while `Aisha رضی اللہ عنہا was lying between him and his Qibla on the bed on which they used to sleep.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم اس بچھونے پر نماز پڑھتے جس پر آپ صلی اللہ علیہ وسلم اور حضرت عائشہ رضی اللہ عنہا سوتے اور حضرت عائشہ رضی اللہ عنہا آپ صلی اللہ علیہ وسلم کے اور قبلہ کے درمیان اس بستر پر لیٹی رہتیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا کہا ہم سے لیث بن سعد نے حدیث بیان کی یزید سے ، انھوں نے عراک سے ، انھوں نے عروہ بن زبیر سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ، عَنْ عِرَاكٍ، عَنْ عُرْوَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي وَعَائِشَةُ مُعْتَرِضَةٌ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ عَلَى الْفِرَاشِ الَّذِي يَنَامَانِ عَلَيْهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 381,
                "hadithNumber": "385",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ  :",
                "hadithEnglish": "We used to pray with the Prophet (ﷺ) and some of us used to place the ends of their clothes at the place of prostration because of scorching heat.",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے تھے ۔ پھر سخت گرمی کی وجہ سے کوئی کوئی ہم میں سے اپنے کپڑے کا کنارہ سجدے کی جگہ رکھ لیتا ۔",
                "urduNarrator": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، انھوں نے کہا ہم سے بشر بن مفضل نے بیان کیا ، انھوں نے کہا مجھے غالب قطان نے بکر بن عبداللہ کے واسطے سے بیان کیا ، انھوں نے انس بن مالک رضی اللہ عنہ سے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ حَدَّثَنِي غَالِبٌ الْقَطَّانُ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم فَيَضَعُ أَحَدُنَا طَرَفَ الثَّوْبِ مِنْ شِدَّةِ الْحَرِّ فِي مَكَانِ السُّجُودِ‏.‏",
                "headingArabic": "السُّجُودِ عَلَى الثَّوْبِ فِي شِدَّةِ الْحَرِّ",
                "headingUrdu": "چلچلاتی گرمی میں کپڑے پر سجدہ کرنا",
                "headingEnglish": "To prostrate on a garment in scorching heat",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 382,
                "hadithNumber": "386",
                "englishNarrator": "Narrated Abu Maslama Sa`id bin Yazid Al-Azdi I asked Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "whether the Prophet (ﷺ) had ever, prayed with his shoes on. He replied \"Yes.\"",
                "hadithUrdu": "کیا نبی کریم صلی اللہ علیہ وسلم اپنی جوتیاں پہن کر نماز پڑھتے تھے ؟ تو انھوں نے فرمایا کہ ہاں ! ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انھوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، انھوں نے کہا ہم سے ابومسلمہ سعید بن یزید ازدی نے بیان کیا ، کہا میں نے انس بن مالک رضی اللہ عنہ سے پوچھا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنَا أَبُو مَسْلَمَةَ، سَعِيدُ بْنُ يَزِيدَ الأَزْدِيُّ قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ أَكَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي فِي نَعْلَيْهِ قَالَ نَعَمْ‏.‏",
                "headingArabic": "الصَّلاَةِ فِي النِّعَالِ",
                "headingUrdu": "جوتے پہن کر نماز پڑھنا",
                "headingEnglish": "To offer Salat (prayer) with the shoes on",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 383,
                "hadithNumber": "387",
                "englishNarrator": "Narrated Hammam bin Al-Harith:",
                "hadithEnglish": "\"I saw Jarir bin `Abdullah urinating. Then he performed ablution and passed his (wet) hands over his Khuffs (socks made from thick fabric or leather), stood up and prayed. He was asked about it. He replied that he had seen the Prophet (ﷺ) doing the same.\" They approved of this narration as Jarir was one of those who embraced Islam very late.",
                "hadithUrdu": "میں نے جریر بن عبداللہ رضی اللہ عنہ کو دیکھا ، انھوں نے پیشاب کیا پھر وضو کیا اور اپنے موزوں پر مسح کیا ۔ پھر کھڑے ہوئے اور ( موزوں سمیت ) نماز پڑھی ۔ آپ سے جب اس کے متعلق پوچھا گیا ، تو فرمایا کہ میں نے نبی کریم صلی اللہ علیہ وسلم کو ایسا ہی کرتے دیکھا ہے ۔ ابراہیم نخعی نے کہا کہ یہ حدیث لوگوں کی نظر میں بہت پسندیدہ تھی کیونکہ جریر رضی اللہ عنہ آخر میں اسلام لائے تھے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے اعمش کے واسطہ سے ، اس نے کہا کہ میں نے ابراہیم نخعی سے سنا ۔ وہ ہمام بن حارث سے روایت کرتے تھے ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ إِبْرَاهِيمَ، يُحَدِّثُ عَنْ هَمَّامِ بْنِ الْحَارِثِ، قَالَ رَأَيْتُ جَرِيرَ بْنَ عَبْدِ اللَّهِ بَالَ ثُمَّ تَوَضَّأَ، وَمَسَحَ عَلَى خُفَّيْهِ، ثُمَّ قَامَ فَصَلَّى، فَسُئِلَ فَقَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم صَنَعَ مِثْلَ هَذَا‏.‏ قَالَ إِبْرَاهِيمُ فَكَانَ يُعْجِبُهُمْ، لأَنَّ جَرِيرًا كَانَ مِنْ آخِرِ مَنْ أَسْلَمَ‏.‏",
                "headingArabic": "الصَّلاَةِ فِي الْخِفَافِ",
                "headingUrdu": "خف (چمڑے کے موزے) پہن کر نماز پڑھنا",
                "headingEnglish": "To offer As-Salat (the prayers) wearing Khuff (leather socks)",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 384,
                "hadithNumber": "388",
                "englishNarrator": "Narrated Al-Mughira bin Shu'ba:",
                "hadithEnglish": "I helped the Prophet (ﷺ) in performing ablution and he passed his wet hands over his Khuffs and prayed.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کو وضو کرایا ۔ آپ صلی اللہ علیہ وسلم نے اپنے موزوں پر مسح کیا اور نماز پڑھی ۔",
                "urduNarrator": "ہم سے اسحاق بن نصر نے بیان کیا کہ کہا ہم سے ابواسامہ نے بیان کیا اعمش کے واسطہ سے ، انھوں نے مسلم بن صبیح سے ، انھوں نے مسروق بن اجدع سے ، انھوں نے مغیرہ بن شعبہ سے ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ وَضَّأْتُ النَّبِيَّ صلى الله عليه وسلم فَمَسَحَ عَلَى خُفَّيْهِ وَصَلَّى‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 385,
                "hadithNumber": "389",
                "englishNarrator": "Narrated Hudhaifa رضی اللہ عنہ :",
                "hadithEnglish": "He saw a person bowing and prostrating imperfectly. When he finished his Salat, Hudhaifa told him that he had not offered Salat. The subnarrator added, \"I think that Hudhaifa also said Were you to die you would die on a \"Sunna\" (legal way) other than that of Muhammad (ﷺ).\"",
                "hadithUrdu": "انھوں نے ایک شخص کو دیکھا جو رکوع اور سجدہ پوری طرح نہیں کرتا تھا ۔ جب اس نے اپنی نماز پوری کر لی تو حذیفہ رضی اللہ عنہ نے فرمایا کہ تم نے نماز ہی نہیں پڑھی ۔ ابووائل راوی نے کہا ، میں خیال کرتا ہوں کہ حضرت حذیفہ رضی اللہ عنہ نے یہ بھی فرمایا کہ اگر تو ایسی ہی نماز پر مر جاتا تو آنحضرت صلی اللہ علیہ وسلم کی سنت پر نہیں مرتا ۔",
                "urduNarrator": "ہمیں صلت بن محمد نے بیان کیا ، کہا ہم سے مہدی بن میمون نے واصل کے واسطہ سے ، وہ ابووائل شقیق بن سلمہ سے ، وہ حذیفہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "أَخْبَرَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا مَهْدِيٌّ، عَنْ وَاصِلٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، رَأَى رَجُلاً لاَ يُتِمُّ رُكُوعَهُ وَلاَ سُجُودَهُ، فَلَمَّا قَضَى صَلاَتَهُ قَالَ لَهُ حُذَيْفَةُ مَا صَلَّيْتَ ـ قَالَ وَأَحْسِبُهُ قَالَ ـ لَوْ مُتَّ مُتَّ عَلَى غَيْرِ سُنَّةِ مُحَمَّدٍ صلى الله عليه وسلم‏.‏",
                "headingArabic": "إِذَا لَمْ يُتِمَّ السُّجُودَ",
                "headingUrdu": "اگر کوئی صحیح طریقے سے سجدہ نہ کرے۔",
                "headingEnglish": "If someone does not prostrate properly",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 386,
                "hadithNumber": "390",
                "englishNarrator": "Narrated 'Abdullah bin Malik Ibn Buhaina:",
                "hadithEnglish": "\"When the Prophet (ﷺ) prayed, he used to separate his arms from his body so widely that the whiteness of his armpits was visible.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب نماز پڑھتے تو اپنے بازوؤں کے درمیان اس قدر کشادگی کر دیتے کہ دونوں بغلوں کی سفیدی ظاہر ہونے لگتی تھی اور لیث نے یوں کہا کہ مجھ سے جعفر بن ربیعہ نے اسی طرح حدیث بیان کی ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا مجھ سے حدیث بیان کی بکر بن مضر نے جعفر سے ، وہ ابن ہرمز سے ، انھوں نے عبداللہ بن مالک بن بحینہ سے کہ",
                "hadithArabic": "أَخْبَرَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا بَكْرُ بْنُ مُضَرَ، عَنْ جَعْفَرٍ، عَنِ ابْنِ هُرْمُزَ، عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ ابْنِ بُحَيْنَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا صَلَّى فَرَّجَ بَيْنَ يَدَيْهِ حَتَّى يَبْدُوَ بَيَاضُ إِبْطَيْهِ‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ نَحْوَهُ‏.‏",
                "headingArabic": "يُبْدِي ضَبْعَيْهِ وَيُجَافِي فِي السُّجُودِ",
                "headingUrdu": "سجدے کے دوران اپنی بغلیں دکھائیں اور اپنے بازوؤں کو جسم سے الگ کریں۔",
                "headingEnglish": "During Prostrations one should show his armpits and separate his forearms from his body",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 387,
                "hadithNumber": "391",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Whoever prays like us and faces our Qibla and eats our slaughtered animals is a Muslim and is under Allah's and His Apostle's protection. So do not betray Allah by betraying those who are in His protection.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جس نے ہماری طرح نماز پڑھی اور ہماری طرح قبلہ کی طرف منہ کیا اور ہمارے ذبیحہ کو کھایا تو وہ مسلمان ہے جس کے لیے اللہ اور اس کے رسول کی پناہ ہے ۔ پس تم اللہ کے ساتھ اس کی دی ہوئی پناہ میں خیانت نہ کرو ۔",
                "urduNarrator": "ہم سے عمرو بن عباس نے بیان کیا ، انھوں نے کہا ہم سے ابن مہدی نے بیان کیا ، انھوں نے کہا ہم سے منصور بن سعد نے میمون بن سیاہ کے واسطہ سے بیان کیا ، انھوں نے انس بن مالک رضی اللہ عنہ سے ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، قَالَ حَدَّثَنَا ابْنُ الْمَهْدِيِّ، قَالَ حَدَّثَنَا مَنْصُورُ بْنُ سَعْدٍ، عَنْ مَيْمُونِ بْنِ سِيَاهٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ صَلَّى صَلاَتَنَا، وَاسْتَقْبَلَ قِبْلَتَنَا، وَأَكَلَ ذَبِيحَتَنَا، فَذَلِكَ الْمُسْلِمُ الَّذِي لَهُ ذِمَّةُ اللَّهِ وَذِمَّةُ رَسُولِهِ، فَلاَ تُخْفِرُوا اللَّهَ فِي ذِمَّتِهِ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ اسْتِقْبَالِ الْقِبْلَةِ",
                "headingUrdu": "دوران  نمازمیں قبلہ روکھڑےہونے کی فضیلت ہو نےکی فضیلت",
                "headingEnglish": "Superiority of (praying) facing the Qiblah with the toes toward it as well",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 388,
                "hadithNumber": "392",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"I have been ordered to fight the people till they say: 'None has the right to be worshipped but Allah.' And if they say so, pray like our prayers, face our Qibla and slaughter as we slaughter, then their blood and property will be sacred to us and we will not interfere with them except legally and their reckoning will be with Allah.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مجھے حکم دیا گیا ہے کہ میں لوگوں کے ساتھ جنگ کروں یہاں تک کہ وہ «لا إله إلا الله» کہیں ۔ پس جب وہ اس کا اقرار کر لیں اور ہماری طرح نماز پڑھنے لگیں اور ہمارے قبلہ کی طرف نماز میں منہ کریں اور ہمارے ذبیحہ کو کھانے لگیں تو ان کا خون اور ان کے اموال ہم پر حرام ہو گئے ۔ مگر کسی حق کے بدلے اور ( باطن میں ) ان کا حساب اللہ پر رہے گا ۔",
                "urduNarrator": "ہم سے نعیم بن حماد نے بیان کیا ، کہا ہم سے عبداللہ ابن مبارک نے حمید طویل کے واسطہ سے ، انھوں نے روایت کیا انس بن مالک رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا نُعَيْمٌ، قَالَ حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ فَإِذَا قَالُوهَا وَصَلَّوْا صَلاَتَنَا، وَاسْتَقْبَلُوا قِبْلَتَنَا، وَذَبَحُوا ذَبِيحَتَنَا، فَقَدْ حَرُمَتْ عَلَيْنَا دِمَاؤُهُمْ وَأَمْوَالُهُمْ إِلاَّ بِحَقِّهَا، وَحِسَابُهُمْ عَلَى اللَّهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 389,
                "hadithNumber": "393",
                "englishNarrator": "Narrated Maimun bin Siyah that he asked Anas bin Malik:",
                "hadithEnglish": "\"O Abu Hamza! What makes the life and property of a person sacred?\" He replied, \"Whoever says, 'None has the right to be worshipped but Allah', faces our Qibla during the prayers, prays like us and eats our slaughtered animal, then he is a Muslim, and has got the same rights and obligations as other Muslims have.\"",
                "hadithUrdu": "اے ابوحمزہ ! آدمی کی جان اور مال پر زیادتی کو کیا چیزیں حرام کرتی ہیں ؟ تو انھوں نے فرمایا کہ جس نے گواہی دی کہ اللہ کے سوا کوئی معبود نہیں اور ہمارے قبلہ کی طرف منہ کیا اور ہماری نماز کی طرح نماز پڑھی اور ہمارے ذبیحہ کو کھایا تو وہ مسلمان ہے ۔ پھر اس کے وہی حقوق ہیں جو عام مسلمانوں کے ہیں اور اس کی وہی ذمہ داریاں ہیں جو عام مسلمانوں پر ہیں اور ابن ابی مریم نے کہا ، ہمیں یحییٰ بن ایوب نے خبر دی ، انھوں نے کہا ہم سے حمید نے حدیث بیان کیا ، انھوں نے کہا ہم سے انس بن مالک رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے نقل کر کے حدیث بیان کی ۔",
                "urduNarrator": "علی بن عبداللہ بن مدینی نے فرمایا کہ ہم سے خالد بن حارث نے بیان کیا ، انھوں نے کہا ہم سے حمید طویل نے بیان کیا ، انھوں نے کہا کہ میمون بن سیاہ نے حضرت انس بن مالک رضی اللہ عنہ سے پوچھا کہ",
                "hadithArabic": "قَالَ ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا يَحْيَى، حَدَّثَنَا حُمَيْدٌ، حَدَّثَنَا أَنَسٌ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا حُمَيْدٌ قَالَ سَأَلَ مَيْمُونُ بْنُ سِيَاهٍ أَنَسَ بْنَ مَالِكٍ قَالَ يَا أَبَا حَمْزَةَ، مَا يُحَرِّمُ دَمَ الْعَبْدِ وَمَالَهُ فَقَالَ مَنْ شَهِدَ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَاسْتَقْبَلَ قِبْلَتَنَا، وَصَلَّى صَلاَتَنَا، وَأَكَلَ ذَبِيحَتَنَا، فَهُوَ الْمُسْلِمُ، لَهُ مَا لِلْمُسْلِمِ، وَعَلَيْهِ مَا عَلَى الْمُسْلِمِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 390,
                "hadithNumber": "394",
                "englishNarrator": "Narrated Abu Aiyub Al-Ansari رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"While defecating, neither face nor turn your back to the Qibla but face either east or west.\" Abu Aiyub added. \"When we arrived in Sham we came across some lavatories facing the Qibla; therefore we turned ourselves while using them and asked for Allah's forgiveness.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تم قضائے حاجت کے لیے جاؤ تو اس وقت نہ قبلہ کی طرف منہ کرو اور نہ پیٹھ کرو ۔ بلکہ مشرق یا مغرب کی طرف اس وقت اپنا منہ کر لیا کرو ۔ ابوایوب نے فرمایا کہ ہم جب شام میں آئے تو یہاں کے بیت الخلاء قبلہ رخ بنے ہوئے تھے ( جب ہم قضائے حاجت کے لیے جاتے ) تو ہم مڑ جاتے اور اللہ عزوجل سے استغفار کرتے تھے اور زہری نے عطاء سے اس حدیث کو اسی طرح روایت کیا ۔ اس میں یوں ہے کہ عطاء نے کہا میں نے ابوایوب سے سنا ، انھوں نے اسی طرح آنحضرت صلی اللہ علیہ وسلم سے سنا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان نے ، کہا ہم سے زہری نے عطاء بن یزید لیثی کے واسطہ سے ، انھوں نے ابوایوب انصاری رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا الزُّهْرِيُّ، عَنْ عَطَاءِ بْنِ يَزِيدَ، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَتَيْتُمُ الْغَائِطَ فَلاَ تَسْتَقْبِلُوا الْقِبْلَةَ وَلاَ تَسْتَدْبِرُوهَا، وَلَكِنْ شَرِّقُوا أَوْ غَرِّبُوا ‏\"‏‏.‏ قَالَ أَبُو أَيُّوبَ فَقَدِمْنَا الشَّأْمَ فَوَجَدْنَا مَرَاحِيضَ بُنِيَتْ قِبَلَ الْقِبْلَةِ، فَنَنْحَرِفُ وَنَسْتَغْفِرُ اللَّهَ تَعَالَى‏.‏ وَعَنِ الزُّهْرِيِّ عَنْ عَطَاءٍ قَالَ سَمِعْتُ أَبَا أَيُّوبَ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏",
                "headingArabic": "قِبْلَةِ أَهْلِ الْمَدِينَةِ وَأَهْلِ الشَّأْمِ وَالْمَشْرِقِ",
                "headingUrdu": "مدینہ، شام اور مشرق والوں کے لیے قبلہ۔",
                "headingEnglish": "The Qiblah for the people of Al-Madina, Sham and the East.",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 391,
                "hadithNumber": "395, 396",
                "englishNarrator": "Narrated `Amr bin Dinar:",
                "hadithEnglish": "I asked Ibn `Umar, \"Can a person who has performed the Tawaf around the Ka`ba for `Umra but has not performed the (Sa`i) Tawaf of Safa and Marwa, have a sexual relation with his wife?\" Ibn `Umar replied \"When the Prophet (ﷺ) reached Mecca he performed the Tawaf around the Ka`ba (circumambulated it seven times) and offered a two-rak`at prayer (at the place) behind the station (of Abraham) and then performed the Tawaf (Sa`i) of Safa and Marwa, and verily in Allah's Messenger (ﷺ) you have a good example.\"\r\nThen we put the same question to Jabir bin `Abdullah and he too replied, \"He should not go near his wife (for sexual relation) till he has finished the Tawaf of Safa and Marwa.\"",
                "hadithUrdu": "ایک ایسے شخص کے بارے میں پوچھا جس نے بیت اللہ کا طواف عمرہ کے لیے کیا لیکن صفا اور مروہ کی سعی نہیں کی، کیا ایسا شخص ( بیت اللہ کے طواف کے بعد ) اپنی بیوی سے صحبت کر سکتا ہے؟ آپ نے جواب دیا کہ نبی کریم صلی اللہ علیہ وسلم تشریف لائے آپ نے سات مرتبہ بیت اللہ کا طواف کیا اور مقام ابراہیم کے پاس دو رکعت نماز پڑھی، پھر صفا اور مردہ کی سعی کی اور تمہارے لیے نبی کریم صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے۔“ ( الاحزاب: 21 )\r\nحضرت جابر بن عبداللہ ؓ سے روایت ہے، ان سے مذکورہ شخص کے متعلق سوال ہوا تو فرمایا: صفا اور مروا کے طواف سے پہلے ہر گز اپنی بیوی سے صحبت نہ کرے۔",
                "urduNarrator": "ہم سے حمیدی نے بیان کیا ، انھوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے عمرو بن دینار نے ، کہا ہم نے عبداللہ بن عمر رضی اللہ عنہما سے",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، قَالَ سَأَلْنَا ابْنَ عُمَرَ عَنْ رَجُلٍ، طَافَ بِالْبَيْتِ الْعُمْرَةَ، وَلَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ، أَيَأْتِي امْرَأَتَهُ فَقَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ سَبْعًا، وَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ، وَطَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ، وَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏.\r\nوَسَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ فَقَالَ لاَ يَقْرَبَنَّهَا حَتَّى يَطُوفَ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے \"اور تم (لوگوں) ابراہیم (علیہ السلام) کے مقام کو لے لو (یا وہ پتھر جس پر ابراہیم کھڑے ہوئے تھے جب وہ کعبہ کو نماز کی جگہ بنا رہے تھے) طواف کعبہ کے بعد)",
                "headingEnglish": "The Statement of Allah \" And take you (people) the Maqam (place) of Ibrahim (Abraham) (or the stone on which Abrahim stood while he was building the Kabah as a place of prayer (for some of your Salat e.g., two Raka after the Tawaf of Kabah)\"",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 392,
                "hadithNumber": "397",
                "englishNarrator": "Narrated Mujahid:",
                "hadithEnglish": "Someone came to Ibn `Umar and said, \"Here is Allah's Messenger (ﷺ) entering the Ka`ba.\" Ibn `Umar said, \"I went there but the Prophet (ﷺ) had come out of the Ka`ba and I found Bilal standing between its two doors. I asked Bilal, 'Did the Prophet (ﷺ) pray in the Ka`ba?' Bilal replied, 'Yes, he prayed two rak`at between the two pillars which are to your left on entering the Ka`ba. Then Allah's Messenger (ﷺ) came out and offered a two-rak`at prayer facing the Ka`ba.' \"",
                "hadithUrdu": "ابن عمر رضی اللہ عنہما کی خدمت میں ایک آدمی آیا اور کہنے لگا ، اے لو یہ رسول اللہ صلی اللہ علیہ وسلم آن پہنچے اور آپ کعبہ کے اندر داخل ہو گئے ۔ ابن عمر رضی اللہ عنہما نے کہا کہ میں جب آیا تو نبی کریم صلی اللہ علیہ وسلم کعبہ سے نکل چکے تھے ، میں نے دیکھا کہ بلال دونوں دروازوں کے سامنے کھڑے ہیں ۔ میں نے بلال سے پوچھا کہ کیا نبی کریم صلی اللہ علیہ وسلم نے کعبہ کے اندر نماز پڑھی ہے ؟ انھوں نے کہا کہ ہاں ! دو رکعت ان دو ستونوں کے درمیان پڑھی تھیں ، جو کعبہ میں داخل ہوتے وقت بائیں طرف واقع ہیں ۔ پھر جب باہر تشریف لائے تو کعبہ کے سامنے دو رکعت نماز ادا فرمائی ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا سیف ابن ابی سلیمان سے ، انھوں نے کہا میں نے مجاہد سے سنا ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ سَيْفٍ، قَالَ سَمِعْتُ مُجَاهِدًا، قَالَ أُتِيَ ابْنُ عُمَرَ فَقِيلَ لَهُ هَذَا رَسُولُ اللَّهِ صلى الله عليه وسلم دَخَلَ الْكَعْبَةَ‏.‏ فَقَالَ ابْنُ عُمَرَ فَأَقْبَلْتُ وَالنَّبِيُّ صلى الله عليه وسلم قَدْ خَرَجَ، وَأَجِدُ بِلاَلاً قَائِمًا بَيْنَ الْبَابَيْنِ، فَسَأَلْتُ بِلاَلاً فَقُلْتُ أَصَلَّى النَّبِيُّ صلى الله عليه وسلم فِي الْكَعْبَةِ قَالَ نَعَمْ رَكْعَتَيْنِ بَيْنَ السَّارِيَتَيْنِ اللَّتَيْنِ عَلَى يَسَارِهِ إِذَا دَخَلْتَ، ثُمَّ خَرَجَ فَصَلَّى فِي وَجْهِ الْكَعْبَةِ رَكْعَتَيْنِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 393,
                "hadithNumber": "398",
                "englishNarrator": "Narrated Ibn `Abbas:",
                "hadithEnglish": "When the Prophet (ﷺ) entered the Ka`ba, he invoked Allah in each and every side of it and did not pray till he came out of it, and offered a two-rak`at prayer facing the Ka`ba and said, \"This is the Qibla.\"",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم کعبہ کے اندر تشریف لے گئے تو اس کے چاروں کونوں میں آپ صلی اللہ علیہ وسلم نے دعا کی اور نماز نہیں پڑھی ۔ پھر جب باہر تشریف لائے تو دو رکعت نماز کعبہ کے سامنے پڑھی اور فرمایا کہ یہی قبلہ ہے ۔",
                "urduNarrator": "ہم سے اسحاق بن نصر نے بیان کیا ، انھوں نے کہا ہم سے عبدالرزاق بن ہمام نے بیان کیا ، انھوں نے کہا ہمیں ابن جریج نے خبر پہنچائی عطاء ابن ابی رباح سے ، انھوں نے کہا میں نے ابن عباس رضی اللہ عنہما سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنْ عَطَاءٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، قَالَ لَمَّا دَخَلَ النَّبِيُّ صلى الله عليه وسلم الْبَيْتَ دَعَا فِي نَوَاحِيهِ كُلِّهَا، وَلَمْ يُصَلِّ حَتَّى خَرَجَ مِنْهُ، فَلَمَّا خَرَجَ رَكَعَ رَكْعَتَيْنِ فِي قُبُلِ الْكَعْبَةِ وَقَالَ ‏ \"‏ هَذِهِ الْقِبْلَةُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 394,
                "hadithNumber": "399",
                "englishNarrator": "Narrated Bara' bin `Azib رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) prayed facing Baitul-Maqdis for sixteen or seventeen months but he loved to face the Ka`ba (at Mecca) so Allah revealed: \"Verily, We have seen the turning of your face to the heaven!\" (2:144) So the Prophet (ﷺ) faced the Ka`ba and the fools amongst the people namely \"the Jews\" said, \"What has turned them from their Qibla (Baitul-Maqdis) which they formerly observed\"\" (Allah revealed): \"Say: 'To Allah belongs the East and the West. He guides whom he will to a straight path'.\" (2:142) A man prayed with the Prophet (facing the Ka`ba) and went out. He saw some of the Ansar praying the `Asr prayer with their faces towards Baitul-Maqdis, he said, \"I bear witness that I prayed with Allah's Messenger (ﷺ) facing the Ka`ba.\" So all the people turned their faces towards the Ka`ba.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے سولہ یا سترہ ماہ تک بیت المقدس کی طرف منہ کر کے نمازیں پڑھیں اور رسول صلی اللہ علیہ وسلم ( دل سے ) چاہتے تھے کہ کعبہ کی طرف منہ کر کے نماز پڑھیں ۔ آخر اللہ تعالیٰ نے یہ آیت نازل فرمائی ’’ ہم آپ کا آسمان کی طرف باربار چہرہ اٹھانا دیکھتے ہیں ۔ پھر آپ نے کعبہ کی طرف منہ کر لیا اور احمقوں نے جو یہودی تھے کہنا شروع کیا کہ انہیں اگلے قبلہ سے کس چیز نے پھیر دیا ۔ آپ فرما دیجیئے کہ اللہ ہی کی ملکیت ہے مشرق اور مغرب ، اللہ جس کو چاہتا ہے سیدھے راستے کی ہدایت کر دیتا ہے ۔ ‘‘ ( جب قبلہ بدلا تو ) ایک شخص نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی پھر نماز کے بعد وہ چلا اور انصار کی ایک جماعت پر اس کا گزر ہوا جو عصر کی نماز بیت المقدس کی طرف منہ کر کے پڑھ رہے تھے ۔ اس شخص نے کہا کہ میں گواہی دیتا ہوں کہ میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ وہ نماز پڑھی ہے جس میں آپ نے موجودہ قبلہ ( کعبہ ) کی طرف منہ کر کے نماز پڑھی ہے ۔ پھر وہ جماعت ( نماز کی حالت میں ہی ) مڑ گئی اور کعبہ کی طرف منہ کر لیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن رجاء نے بیان کیا ، انھوں نے کہا ہم سے اسرائیل بن یونس نے بیان کیا ، کہا انھوں نے ابواسحاق سے بیان کیا ، کہا انھوں نے حضرت براء بن عازب رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ـ رضى الله عنهما ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَلَّى نَحْوَ بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ أَوْ سَبْعَةَ عَشَرَ شَهْرًا، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحِبُّ أَنْ يُوَجَّهَ إِلَى الْكَعْبَةِ، فَأَنْزَلَ اللَّهُ ‏{‏قَدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ‏}‏ فَتَوَجَّهَ نَحْوَ الْكَعْبَةِ، وَقَالَ السُّفَهَاءُ مِنَ النَّاسِ ـ وَهُمُ الْيَهُودُ ـ مَا وَلاَّهُمْ عَنْ قِبْلَتِهِمُ الَّتِي كَانُوا عَلَيْهَا ‏{‏قُلْ لِلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ يَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ‏}‏ فَصَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم رَجُلٌ ثُمَّ خَرَجَ بَعْدَ مَا صَلَّى، فَمَرَّ عَلَى قَوْمٍ مِنَ الأَنْصَارِ فِي صَلاَةِ الْعَصْرِ نَحْوَ بَيْتِ الْمَقْدِسِ فَقَالَ هُوَ يَشْهَدُ أَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم، وَأَنَّهُ تَوَجَّهَ نَحْوَ الْكَعْبَةِ‏.‏ فَتَحَرَّفَ الْقَوْمُ حَتَّى تَوَجَّهُوا نَحْوَ الْكَعْبَةِ‏.‏",
                "headingArabic": "التَّوَجُّهِ نَحْوَ الْقِبْلَةِ حَيْثُ كَانَ",
                "headingUrdu": "[فرض نماز (نماز کے دوران)] جہاں بھی ہو قبلہ (کعبہ مکہ) کی طرف منہ کرنا چاہئے۔",
                "headingEnglish": "[During the obligatory Salat (prayers)] one should face the Qiblah (Kabah at Makkah) wherever one may be",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 395,
                "hadithNumber": "400",
                "englishNarrator": "Narrated Jabir:",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to pray (optional, non-obligatory prayer) while riding on his mount (Rahila) wherever it turned, and whenever he wanted to pray the compulsory prayer he dismounted and prayed facing the Qibla.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم اپنی سواری پر خواہ اس کا رخ کسی طرف ہو ( نفل ) نماز پڑھتے تھے لیکن جب فرض نماز پڑھنا چاہتے تو سواری سے اتر جاتے اور قبلہ کی طرف منہ کر کے نماز پڑھتے ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے ہشام بن عبداللہ دستوائی نے ، کہا ہم سے یحییٰ بن ابی کثیر نے محمد بن عبدالرحمٰن کے واسطہ سے ، انھوں نے جابر بن عبداللہ سے ، انھوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمٌ، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي عَلَى رَاحِلَتِهِ حَيْثُ تَوَجَّهَتْ، فَإِذَا أَرَادَ الْفَرِيضَةَ نَزَلَ فَاسْتَقْبَلَ الْقِبْلَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 396,
                "hadithNumber": "401",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ  :",
                "hadithEnglish": "The Prophet (ﷺ) prayed (and the sub-narrator Ibrahim said, \"I do not know whether he prayed more or less than usual\"), and when he had finished the prayers he was asked, \"O Allah's Messenger (ﷺ)! Has there been any change in the prayers?\" He said, \"What is it?' The people said, \"You have prayed so much and so much.\" So the Prophet (ﷺ) bent his legs, faced the Qibla and performed two prostration's (of Sahu) and finished his prayers with Taslim (by turning his face to right and left saying: 'As-Salamu `Alaikum- Warahmat-ullah'). When he turned his face to us he said, \"If there had been anything changed in the prayer, surely I would have informed you but I am a human being like you and liable to forget like you. So if I forget remind me and if anyone of you is doubtful about his prayer, he should follow what he thinks to be correct and complete his prayer accordingly and finish it and do two prostrations (of Sahu).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھائی ۔ ابراہیم نے کہا مجھے نہیں معلوم کہ نماز میں زیادتی ہوئی یا کمی ۔ پھر جب آپ صلی اللہ علیہ وسلم نے سلام پھیرا تو آپ صلی اللہ علیہ وسلم سے کہا گیا کہ یا رسول اللہ ! کیا نماز میں کوئی نیا حکم آیا ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا آخر کیا بات ہے ؟ لوگوں نے کہا آپ نے اتنی اتنی رکعتیں پڑھی ہیں ۔ یہ سن کر آپ صلی اللہ علیہ وسلم نے اپنے دونوں پاؤں پھیرے اور قبلہ کی طرف منہ کر لیا اور ( سہو کے ) دو سجدے کئے اور سلام پھیرا ۔ پھر ہماری طرف متوجہ ہوئے اور فرمایا کہ اگر نماز میں کوئی نیا حکم نازل ہوا ہوتا تو میں تمہیں پہلے ہی ضرور کہہ دیتا لیکن میں تو تمہارے ہی جیسا آدمی ہوں ، جس طرح تم بھولتے ہو میں بھی بھول جاتا ہوں ۔ اس لیے جب میں بھول جایا کروں تو تم مجھے یاد دلایا کرو اور اگر کسی کو نماز میں شک ہو جائے تو اس وقت ٹھیک بات سوچ لے اور اسی کے مطابق نماز پوری کرے پھر سلام پھیر کر دو سجدے ( سہو کے ) کر لے ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر نے منصور کے واسطے سے ، انھوں نے ابراہیم سے ، انھوں نے علقمہ سے ، کہ عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ قَالَ عَبْدُ اللَّهِ صَلَّى النَّبِيُّ صلى الله عليه وسلم ـ قَالَ إِبْرَاهِيمُ لاَ أَدْرِي زَادَ أَوْ نَقَصَ ـ فَلَمَّا سَلَّمَ قِيلَ لَهُ يَا رَسُولَ اللَّهِ، أَحَدَثَ فِي الصَّلاَةِ شَىْءٌ قَالَ ‏\"‏ وَمَا ذَاكَ ‏\"‏‏.‏ قَالُوا صَلَّيْتَ كَذَا وَكَذَا‏.‏ فَثَنَى رِجْلَيْهِ وَاسْتَقْبَلَ الْقِبْلَةَ، وَسَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ، فَلَمَّا أَقْبَلَ عَلَيْنَا بِوَجْهِهِ قَالَ ‏\"‏ إِنَّهُ لَوْ حَدَثَ فِي الصَّلاَةِ شَىْءٌ لَنَبَّأْتُكُمْ بِهِ، وَلَكِنْ إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ، أَنْسَى كَمَا تَنْسَوْنَ، فَإِذَا نَسِيتُ فَذَكِّرُونِي، وَإِذَا شَكَّ أَحَدُكُمْ فِي صَلاَتِهِ فَلْيَتَحَرَّى الصَّوَابَ، فَلْيُتِمَّ عَلَيْهِ ثُمَّ يُسَلِّمْ، ثُمَّ يَسْجُدْ سَجْدَتَيْنِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 397,
                "hadithNumber": "402",
                "englishNarrator": "Narrated `Umar (bin Al-Khattab) رضی اللہ عنہ :",
                "hadithEnglish": "My Lord agreed with me in three things: \r\n1. I said, \"O Allah's Messenger (ﷺ), I wish we took the station of Abraham as our praying place (for some of our prayers). So came the Divine Inspiration: And take you (people) the station of Abraham as a place of prayer (for some of your prayers e.g. two rak`at of Tawaf of Ka`ba)\". (2.125) \r\n2. And as regards the (verse of) the veiling of the women, I said, 'O Allah's Messenger (ﷺ)! I wish you ordered your wives to cover themselves from the men because good and bad ones talk to them.' So the verse of the veiling of the women was revealed. \r\n3. Once the wives of the Prophet (ﷺ) made a united front against the Prophet (ﷺ) and I said to them, 'It may be if he (the Prophet) divorced you, (all) that his Lord (Allah) will give him instead of you wives better than you.' So this verse (the same as I had said) was revealed.\" (66.5). Narrated Anas: as above (395).",
                "hadithUrdu": "میری تین باتوں میں جو میرے منہ سے نکلا میرے رب نے ویسا ہی حکم فرمایا ۔ میں نے کہا تھا کہ یا رسول اللہ ! اگر ہم مقام ابراہیم کو نماز پڑھنے کی جگہ بنا سکتے تو اچھا ہوتا ۔ اس پر یہ آیت نازل ہوئی ۔ ’’ اور تم مقام ابراہیم کو نماز پڑھنے کی جگہ بنا لو ‘‘ دوسری آیت پردہ کے بارے میں ہے ۔ میں نے کہا تھا کہ یا رسول اللہ کاش ! آپ اپنی عورتوں کو پردہ کا حکم دیتے ، کیونکہ ان سے اچھے اور برے ہر طرح کے لوگ بات کرتے ہیں ۔ اس پر پردہ کی آیت نازل ہوئی اور ایک مرتبہ آنحضور صلی اللہ علیہ وسلم کی بیویاں جوش و خروش میں آپ کی خدمت میں اتفاق کر کے کچھ مطالبات لے کر حاضر ہوئیں ۔ میں نے ان سے کہا کہ ہو سکتا ہے کہ اللہ پاک تمہیں طلاق دلا دیں اور تمہارے بدلے تم سے بہتر مسلمہ بیویاں اپنے رسول صلی اللہ علیہ وسلم کو عنایت کریں ، تو یہ آیت نازل ہوئی «عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن‏» اور سعید ابن ابی مریم نے کہا کہ مجھے یحییٰ بن ایوب نے خبر دی ، کہا کہ ہم سے حمید نے بیان کیا ، کہا میں نے حضرت انس رضی اللہ عنہ سے یہ حدیث سنی ۔",
                "urduNarrator": "ہم سے عمرو بن عون نے بیان کیا ، کہا ہم سے ہشیم نے حمید کے واسطہ سے ، انھوں نے انس بن مالک رضی اللہ عنہ کے واسطہ سے کہ عمر رضی اللہ عنہ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، قَالَ حَدَّثَنَا هُشَيْمٌ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ قَالَ عُمَرُ وَافَقْتُ رَبِّي فِي ثَلاَثٍ، فَقُلْتُ يَا رَسُولَ اللَّهِ لَوِ اتَّخَذْنَا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى فَنَزَلَتْ ‏{‏وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى‏}‏ وَآيَةُ الْحِجَابِ قُلْتُ يَا رَسُولَ اللَّهِ، لَوْ أَمَرْتَ نِسَاءَكَ أَنْ يَحْتَجِبْنَ، فَإِنَّهُ يُكَلِّمُهُنَّ الْبَرُّ وَالْفَاجِرُ‏.‏ فَنَزَلَتْ آيَةُ الْحِجَابِ، وَاجْتَمَعَ نِسَاءُ النَّبِيِّ صلى الله عليه وسلم فِي الْغَيْرَةِ عَلَيْهِ فَقُلْتُ لَهُنَّ عَسَى رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبَدِّلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ‏.‏ فَنَزَلَتْ هَذِهِ الآيَةُ‏ ، وحَدَّثَنَا ابْنُ أَبِي مَرْيَمَ ، قَالَ : أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ ، قَالَ : حَدَّثَنِي حُمَيْدٌ ، قَالَ : سَمِعْتُ أَنَسًا بِهَذَا.",
                "headingArabic": "مَا جَاءَ فِي الْقِبْلَةِ، وَمَنْ لاَ يَرَى الإِعَادَةَ عَلَى مَنْ سَهَا فَصَلَّى إِلَى غَيْرِ الْقِبْلَةِ",
                "headingUrdu": "قبلہ (کعبہ مکہ) کے بارے میں کیا کہا گیا ہے اور جہاں بھی یہ خیال کیا گیا ہے کہ اگر کسی نے غلطی سے قبلہ کے علاوہ کسی اور طرف منہ کر کے نماز پڑھ لی تو نماز کے اعادہ کی ضرورت نہیں۔",
                "headingEnglish": "What has been said about (facing) the Qiblah (Kabah at Makkah) and wherever considered that there was no need to repeat the Salat (prayer) if someone offered prayers by mistake facing a direction other than that of the Qiblah",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 398,
                "hadithNumber": "403",
                "englishNarrator": "Narrated `Abdullah bin `Umar:",
                "hadithEnglish": "While the people were offering the Fajr prayer at Quba' (near Medina), someone came to them and said: \"It has been revealed to Allah's Messenger (ﷺ) tonight, and he has been ordered to pray facing the Ka`ba.\" So turn your faces to the Ka`ba. Those people were facing Sham (Jerusalem) so they turned their faces towards Ka`ba (at Mecca).",
                "hadithUrdu": "لوگ قباء میں فجر کی نماز پڑھ رہے تھے کہ اتنے میں ایک آنے والا آیا ۔ اس نے بتایا کہ رسول اللہ صلی اللہ علیہ وسلم پر کل وحی نازل ہوئی ہے اور انہیں کعبہ کی طرف ( نماز میں ) منہ کرنے کا حکم ہو گیا ہے ۔ چنانچہ ان لوگوں نے بھی کعبہ کی جانب منہ کر لیے جب کہ اس وقت وہ شام کی جانب منہ کئے ہوئے تھے ، اس لیے وہ سب کعبہ کی جانب گھوم گئے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا ہمیں امام مالک نے عبداللہ بن دینار کے واسطہ سے ، انھوں نے عبداللہ بن عمر سے ، آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ بَيْنَا النَّاسُ بِقُبَاءٍ فِي صَلاَةِ الصُّبْحِ إِذْ جَاءَهُمْ آتٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أُنْزِلَ عَلَيْهِ اللَّيْلَةَ قُرْآنٌ، وَقَدْ أُمِرَ أَنْ يَسْتَقْبِلَ الْكَعْبَةَ فَاسْتَقْبِلُوهَا، وَكَانَتْ وُجُوهُهُمْ إِلَى الشَّأْمِ، فَاسْتَدَارُوا إِلَى الْكَعْبَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 399,
                "hadithNumber": "404",
                "englishNarrator": "Narrated `Abdullah:",
                "hadithEnglish": "\"Once the Prophet (ﷺ) offered five rak`at in Zuhr prayer. He was asked, \"Is there an increase in the prayer?\" The Prophet (ﷺ) said, \"And what is it?\" They said, \"You have prayed five rak`at.' So he bent his legs and performed two prostrations (of Sahu).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ( بھولے سے ) ظہر کی نماز ( ایک مرتبہ ) پانچ رکعت پڑھی ہیں ۔ عبداللہ بن مسعود رضی اللہ عنہما نے فرمایا کہ پھر آپ نے اپنے پاؤں موڑ لیے اور ( سہو کے ) دو سجدے کئے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا کہ کہا ہم سے یحییٰ بن سعید بن قطان نے شعبہ کے واسطے سے ، انھوں نے ابراہیم سے ، انھوں نے علقمہ سے انھوں نے عبداللہ سے ، انھوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم الظُّهْرَ خَمْسًا فَقَالُوا أَزِيدَ فِي الصَّلاَةِ قَالَ ‏ \"‏ وَمَا ذَاكَ ‏\"‏‏.‏ قَالُوا صَلَّيْتَ خَمْسًا‏.‏ فَثَنَى رِجْلَيْهِ وَسَجَدَ سَجْدَتَيْنِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 400,
                "hadithNumber": "405",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) saw some sputum in the direction of the Qibla (on the wall of the mosque) and he disliked that and the sign of disgust was apparent from his face. So he got up and scraped it off with his hand and said, \"Whenever anyone of you stands for the prayer, he is speaking in private to his Lord or his Lord is between him and his Qibla. So, none of you should spit in the direction of the Qibla but one can spit to the left or under his foot.\" The Prophet (ﷺ) then took the corner of his sheet and spat in it and folded it and said, \"Or you can do this. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے قبلہ کی طرف ( دیوار پر ) بلغم دیکھا ، جو آپ صلی اللہ علیہ وسلم کو ناگوار گزرا اور یہ ناگواری آپ صلی اللہ علیہ وسلم کے چہرہ مبارک پر دکھائی دینے لگی ۔ پھر آپ صلی اللہ علیہ وسلم اٹھے اور خود اپنے ہاتھ سے اسے کھرچ ڈالا اور فرمایا کہ جب کوئی شخص نماز کے لیے کھڑا ہوتا ہے تو گویا وہ اپنے رب کے ساتھ سرگوشی کرتا ہے ، یا یوں فرمایا کہ اس کا رب اس کے اور قبلہ کے درمیان ہوتا ہے ۔ اس لیے کوئی شخص ( نماز میں اپنے ) قبلہ کی طرف نہ تھوکے ۔ البتہ بائیں طرف یا اپنے قدموں کے نیچے تھوک سکتا ہے ۔ پھر آپ نے اپنی چادر کا کنارہ لیا ، اس پر تھوکا پھر اس کو الٹ پلٹ کیا اور فرمایا ، یا اس طرح کر لیا کرو ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا کہ کہا ہم سے اسماعیل بن جعفر نے حمید کے واسطہ سے ، انھوں نے انس بن مالک رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى نُخَامَةً فِي الْقِبْلَةِ، فَشَقَّ ذَلِكَ عَلَيْهِ حَتَّى رُئِيَ فِي وَجْهِهِ، فَقَامَ فَحَكَّهُ بِيَدِهِ فَقَالَ ‏\"‏ إِنَّ أَحَدَكُمْ إِذَا قَامَ فِي صَلاَتِهِ، فَإِنَّهُ يُنَاجِي رَبَّهُ ـ أَوْ إِنَّ رَبَّهُ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ ـ فَلاَ يَبْزُقَنَّ أَحَدُكُمْ قِبَلَ قِبْلَتِهِ، وَلَكِنْ عَنْ يَسَارِهِ، أَوْ تَحْتَ قَدَمَيْهِ ‏\"‏‏.‏ ثُمَّ أَخَذَ طَرَفَ رِدَائِهِ فَبَصَقَ فِيهِ، ثُمَّ رَدَّ بَعْضَهُ عَلَى بَعْضٍ، فَقَالَ ‏\"‏ أَوْ يَفْعَلْ هَكَذَا ‏\"‏‏.‏",
                "headingArabic": "حَكِّ الْبُزَاقِ بِالْيَدِ مِنَ الْمَسْجِدِ",
                "headingUrdu": "مسجد سے تھوک کو ہاتھ سے کھرچنا (کسی آلے یا دوسرے سے یا ن ٹول کا استعمال کرتے ہوئے)",
                "headingEnglish": "To scrape off the sputum from the mosque with the hand (using some tool or other, or using n tool)",
                "chapterId": "8",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 8,
                    "chapterNumber": "8",
                    "chapterEnglish": "Prayers (Salat)",
                    "chapterUrdu": "نماز کے احکام و مسائل",
                    "chapterArabic": "كتاب الصلاة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 376,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=15",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=13",
                "label": "13",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=14",
                "label": "14",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=15",
                "label": "15",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=16",
                "label": "16",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=17",
                "label": "17",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=18",
                "label": "18",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=19",
                "label": "19",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=17",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=17",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=15",
        "to": 400,
        "total": 40465
    }
}