{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 177,
        "data": [
            {
                "id": 4403,
                "hadithNumber": "4624",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"I saw Hell and its different portions were consuming each other and saw `Amr dragging his intestines (in it), and he was the first person to establish the tradition of letting animals loose (for the idols).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے جہنم کو دیکھا کہ اس کے بعض حصے بعض دوسرے حصوں کو کھائے جا رہے ہیں اور میں نے عمرو بن عامر خزاعی کو دیکھا کہ وہ اپنی آنتیں اس میں گھسیٹا پھر رہا تھا۔ یہی وہ شخص ہے جس نے سب سے پہلے سانڈ چھوڑنے کی رسم ایجاد کی تھی۔",
                "urduNarrator": "مجھ سے محمد بن ابی یعقوب ابوعبداللہ کرمانی نے بیان کیا، کہا ہم سے حسان بن ابراہیم نے بیان کیا، کہا ہم سے یونس نے بیان کیا، ان سے زہری نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي يَعْقُوبَ أَبُو عَبْدِ اللَّهِ الْكَرْمَانِيُّ، حَدَّثَنَا حَسَّانُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، رضى الله عنها قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ رَأَيْتُ جَهَنَّمَ يَحْطِمُ بَعْضُهَا بَعْضًا، وَرَأَيْتُ عَمْرًا يَجُرُّ قُصْبَهُ، وَهْوَ أَوَّلُ مَنْ سَيَّبَ السَّوَائِبَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4404,
                "hadithNumber": "4625",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) delivered a sermon and said, \"O people! You will be gathered before Allah barefooted, naked and not circumcised.\" Then (quoting Qur'an) he said:-- \"As We began the first creation, We shall repeat it. A promise We have undertaken: Truly we shall do it..\" (21.104) The Prophet (ﷺ) then said, \"The first of the human beings to be dressed on the Day of Resurrection, will be Abraham. Lo! Some men from my followers will be brought and then (the angels) will drive them to the left side (Hell-Fire). I will say. 'O my Lord! (They are) my companions!' Then a reply will come (from Almighty), 'You do not know what they did after you.' I will say as the pious slave (the Prophet (ﷺ) Jesus) said: And I was a witness over them while I dwelt amongst them. When You took me up. You were the Watcher over them and You are a Witness to all things.' (5.117) Then it will be said, \"These people have continued to be apostates since you left them.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے خطبہ دیا اور فرمایا کہ اے لوگو! تم اللہ کے پاس جمع کئے جاؤ گے، ننگے پاؤں ننگے جسم اور بغیر ختنہ کے، پھر آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی «كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين‏» ”جس طرح ہم نے اول بار پیدا کرنے کے وقت ابتداء کی تھی، اسی طرح اسے دوبارہ زندہ کر دیں گے، ہمارے ذمہ وعدہ ہے، ہم ضرور اسے کر کے ہی رہیں گے۔“ آخر آیت تک۔ پھر فرمایا قیامت کے دن تمام مخلوق میں سب سے پہلے ابراہیم علیہ السلام کو کپڑا پہنایا جائے گا۔ ہاں اور میری امت کے کچھ لوگوں کو لایا جائے گا اور انہیں جہنم کی بائیں طرف لے جایا جائے گا۔ میں عرض کروں گا، میرے رب! یہ تو میرے امتی ہیں؟ مجھ سے کہا جائے گا، آپ کو نہیں معلوم ہے کہ انہوں نے آپ کے بعد نئی نئی باتیں شریعت میں نکالی تھیں۔ اس وقت میں بھی وہی کہوں گا جو عبد صالح عیسیٰ علیہ السلام نے کہا ہو گا «وكنت عليهم شهيدا ما دمت فيهم فلما توفيتني كنت أنت الرقيب عليهم‏» کہ ”میں ان کا حال دیکھتا رہا جب تک میں ان کے درمیان رہا، پھر جب تو نے مجھے اٹھا لیا ( جب سے ) تو ہی ان پر نگراں ہے۔“ مجھے بتایا جائے گا کہ آپ کی جدائی کے بعد یہ لوگ دین سے پھر گئے تھے۔",
                "urduNarrator": "ہم سے ابوالولید نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، کہا ہم کو مغیرہ بن نعمان نے خبر دی، انہوں نے کہا کہ میں نے سعید بن جبیر سے سنا اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا الْمُغِيرَةُ بْنُ النُّعْمَانِ، قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ إِنَّكُمْ مَحْشُورُونَ إِلَى اللَّهِ حُفَاةً عُرَاةً غُرْلاً ـ ثُمَّ قَالَ ـ ‏{‏كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْدًا عَلَيْنَا إِنَّا كُنَّا فَاعِلِينَ‏}‏ إِلَى آخِرِ الآيَةِ ـ ثُمَّ قَالَ ـ أَلاَ وَإِنَّ أَوَّلَ الْخَلاَئِقِ يُكْسَى يَوْمَ الْقِيَامَةِ إِبْرَاهِيمُ، أَلاَ وَإِنَّهُ يُجَاءُ بِرِجَالٍ مِنْ أُمَّتِي فَيُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ، فَأَقُولُ يَا رَبِّ أُصَيْحَابِي‏.‏ فَيُقَالُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ‏.‏ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ ‏{‏وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ فَلَمَّا تَوَفَّيْتَنِي كُنْتَ أَنْتَ الرَّقِيبَ عَلَيْهِمْ‏}‏ فَيُقَالُ إِنَّ هَؤُلاَءِ لَمْ يَزَالُوا مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ مُنْذُ فَارَقْتَهُمْ ‏\"‏‏.‏",
                "headingArabic": "{‏وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ فَلَمَّا تَوَفَّيْتَنِي كُنْتَ أَنْتَ الرَّقِيبَ عَلَيْهِمْ وَأَنْتَ عَلَى كُلِّ شَىْءٍ شَهِيدٌ‏}‏",
                "headingUrdu": "\"اور جب میں ان کے درمیان رہا تو میں ان پر گواہ تھا، لیکن جب تو نے مجھے اٹھا لیا تو آپ ان پر نگراں تھے، اور آپ ہر چیز کے گواہ ہیں۔\" (V.5:117)",
                "headingEnglish": "\"And I was a witness over them while I dwelt amongst them; but when You took me up, You were the Watcher over them, and You are a Witness to all things.\" (V.5:117)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4405,
                "hadithNumber": "4626",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"You will be gathered (on the Day of Resurrection) and some people will be driven (by the angels) to the left side (and taken to Hell) whereupon I will say as the pious slave (Jesus) said:- - \"And I was a witness over them while I dwelt amongst them...the ALMIGHTY, the All Wise.\" (5.117-118)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں قیامت کے دن جمع کیا جائے گا اور کچھ لوگوں کو جہنم کی طرف لے جایا جائے گا۔ اس وقت میں وہی کہوں گا جو نیک بندے نے کہا ہو گا «وكنت عليهم شهيدا ما دمت فيهم‏» ”میں ان کا حال دیکھتا رہا جب تک میں ان کے درمیان رہا“ آخر آیت «العزيز الحكيم‏» تک۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا، انہوں نے کہا ہم سے سفیان نے بیان کیا، انہوں نے کہا ہم سے مغیرہ بن نعمان نے بیان کیا، ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الْمُغِيرَةُ بْنُ النُّعْمَانِ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّكُمْ مَحْشُورُونَ، وَإِنَّ نَاسًا يُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ، فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ ‏{‏وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ‏}‏ إِلَى قَوْلِهِ ‏{‏الْعَزِيزُ الْحَكِيمُ ‏}‏‏\"‏",
                "headingArabic": "قَوْلِهِ ‏{‏إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اگر تو انہیں سزا دے تو وہ تیرے بندے ہیں۔‘‘ (5:118)",
                "headingEnglish": "Allah's Statement: \"If You punish them, they are Your slaves.\"(V.5:118)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4406,
                "hadithNumber": "4627",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The key of the Unseen are five: Verily with Allah (Alone) is the knowledge of the Hour He sends down the rain and knows what is in the wombs. No soul knows what it will earn tomorrow, and no soul knows in what land it will die. Verily, Allah is All-Knower, All-Aware.\" (31.34)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ غیب کے خزانے پانچ ہیں۔ جیسا کہ ارشاد باری ہے۔ بیشک اللہ ہی کو قیامت کی خبر ہے اور وہی جانتا ہے کہ رحموں میں کیا ہے اور کوئی بھی نہیں جان سکتا کہ وہ کل کیا عمل کرے گا اور نہ کوئی یہ جان سکتا ہے کہ وہ کس زمین پر مرے گا، بیشک اللہ ہی علم والا ہے، خبر رکھنے والا ہے۔“",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، ان سے ابن شہاب نے، ان سے سالم بن عبداللہ نے اور ان سے ان کے والد (عبداللہ بن عمر رضی اللہ عنہما) نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَفَاتِحُ الْغَيْبِ خَمْسٌ إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ، وَيُنَزِّلُ الْغَيْثَ، وَيَعْلَمُ مَا فِي الأَرْحَامِ، وَمَا تَدْرِي نَفْسٌ مَاذَا تَكْسِبُ غَدًا، وَمَا تَدْرِي نَفْسٌ بِأَىِّ أَرْضٍ تَمُوتُ، إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ ‏\"‏‏.‏",
                "headingArabic": "‏{‏وَعِنْدَهُ مَفَاتِحُ الْغَيْبِ لاَ يَعْلَمُهَا إِلاَّ هُوَ‏}‏",
                "headingUrdu": "\"اور اسی کے پاس غیب کی کنجیاں ہیں، (جو کچھ پوشیدہ ہے)، ان کو اس کے سوا کوئی نہیں جانتا...\" (آیت 6:59)",
                "headingEnglish": "\"And With Him are the keys of the Ghaib, (all that is hidden), none knows them but He...\" (V.6:59)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4407,
                "hadithNumber": "4628",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "When this Verse was revealed: \"Say: He has power to send torment on you from above.\" (6.65) Allah's Messenger (ﷺ) said, \"O Allah! I seek refuge with Your Face (from this punishment).\" And when the verse: \"or send torment from below your feet,\" (was revealed), Allah's Messenger (ﷺ) said, \"(O Allah!) I seek refuge with Your Face (from this punishment).\" (But when there was revealed): \"Or confuse you in party strife and make you to taste the violence of one another.\" (6.65) Allah's Messenger (ﷺ) said, \"This is lighter (or, this is easier).",
                "hadithUrdu": "جب یہ آیت «قل هو القادر على أن يبعث عليكم عذابا من فوقكم‏» نازل ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ! میں تیرے منہ کی پناہ مانگتا ہوں۔ پھر یہ اترا «أو من تحت أرجلكم‏» آپ صلی اللہ علیہ وسلم نے فرمایا کہ یا اللہ! میں تیرے منہ کی پناہ مانگتا ہوں۔ پھر یہ اترا «أو يلبسكم شيعا ويذيق بعضكم بأس بعض‏» اس وقت نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ پہلے عذابوں سے ہلکا یا آسان ہے۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا، ان سے عمرو بن دینار نے بیان کیا اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ ‏{‏قُلْ هُوَ الْقَادِرُ عَلَى أَنْ يَبْعَثَ عَلَيْكُمْ عَذَابًا مِنْ فَوْقِكُمْ‏}‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَعُوذُ بِوَجْهِكَ ‏\"‏‏.‏ قَالَ ‏{‏أَوْ مِنْ تَحْتِ أَرْجُلِكُمْ‏}‏ قَالَ ‏\"‏ أَعُوذُ بِوَجْهِكَ‏\"‏ ‏{‏أَوْ يَلْبِسَكُمْ شِيَعًا وَيُذِيقَ بَعْضَكُمْ بَأْسَ بَعْضٍ‏}‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا أَهْوَنُ ‏\"‏‏.‏ أَوْ ‏\"‏ هَذَا أَيْسَرُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏قُلْ هُوَ الْقَادِرُ عَلَى أَنْ يَبْعَثَ عَلَيْكُمْ عَذَابًا مِنْ فَوْقِكُمْ‏}‏ الآيَةَ",
                "headingUrdu": "\"کہو: وہ تم پر اوپر سے عذاب بھیجنے کا اختیار رکھتا ہے...\" (V.6:65)",
                "headingEnglish": "\"Say: He has power to send torment on you from above...\" (V.6:65)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4408,
                "hadithNumber": "4629",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "When:\"...and confuse not their belief with wrong.\" (6.82) was revealed, the Prophet's companions said, \"Which of us has not done wrong?\" Then there was revealed:-- \"Verily joining others in worship with Allah is a tremendous wrong indeed.\" (31.13)",
                "hadithUrdu": "جب آیت «ولم يلبسوا إيمانهم بظلم‏» نازل ہوئی صحابہ رضی اللہ عنہم نے کہا، ہم میں کون ہو گا جس کا دامن ظلم سے پاک ہو۔ اس یہ آیت اتری «إن الشرك لظلم عظيم‏» ”بیشک شرک ظلم عظیم ہے۔“",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے ابن عدی نے بیان کیا، ان سے شعبی نے، ان سے سلیمان نے، ان سے ابراہیم نے، ان سے علقمہ نے اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتْ ‏{‏وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏}‏ قَالَ أَصْحَابُهُ وَأَيُّنَا لَمْ يَظْلِمْ فَنَزَلَتْ ‏{‏إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ‏}‏",
                "headingArabic": "‏{‏وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏}‏",
                "headingUrdu": "\"یہ وہ لوگ ہیں جو (اللہ کی وحدانیت پر یقین رکھتے ہیں اور اس کے سوا کسی کی عبادت نہیں کرتے) اور اپنے ایمان کو ضعیم (یعنی اللہ کے سوا دوسروں کی عبادت کر کے) کے ساتھ خلط ملط نہیں کرتے۔\" (V.6:82)",
                "headingEnglish": "\"It is those who believe (in the Oneness of Allah and worship none but Him Alone) and confuse not their belief with Zuim (wrong i.e., by worshipping others besides Allah).. .\" (V.6:82)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4409,
                "hadithNumber": "4630",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Nobody has the rights to say that I am better than Jonah bin Matta.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کسی کے لیے مناسب نہیں کہ مجھے یونس بن متی علیہ السلام سے بہتر بتائے۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، انہوں نے کہا ہم سے ابن مہدی نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، ان سے قتادہ نے، ان سے ابوالعالیہ نے بیان کیا کہ مجھ سے تمہارے نبی کے چچا زاد بھائی یعنی ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي الْعَالِيَةِ، قَالَ حَدَّثَنِي ابْنُ عَمِّ، نَبِيِّكُمْ يَعْنِي ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَيُونُسَ وَلُوطًا وَكُلاًّ فَضَّلْنَا عَلَى الْعَالَمِينَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور یونس اور لوط (علیہ السلام) اور ان میں سے ہر ایک کو ہم نے العالمین (انسانوں اور جنوں) پر فضیلت دی‘‘ (آیت 6:86)",
                "headingEnglish": "The Statement of Allah: \"...And Yünus (Jonah) and Lut (Lot), and each one of them We preferred above Al-Alamin (mankind and jinn) (of their times)\" (V.6:86)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4410,
                "hadithNumber": "4631",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Nobody has the right to say that I am better than Jonah bin Matta.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کسی شخص کے لیے جائز نہیں کہ مجھے یونس بن متی علیہ السلام سے بہتر بتائے۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، انہوں نے کہا ہم کو سعد بن ابراہیم نے خبر دی، انہوں نے کہا کہ میں نے حمید بن عبدالرحمٰن بن عوف رضی اللہ عنہ سے سنا، انہوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا سَعْدُ بْنُ إِبْرَاهِيمَ، قَالَ سَمِعْتُ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4411,
                "hadithNumber": "4632",
                "englishNarrator": "Narrated Mujahid:",
                "hadithEnglish": "He asked Ibn `Abbas رضی اللہ عنہما , \"Is there a prostration Surat-al-Sa`d?\" (38.24) Ibn `Abbas رضی اللہ عنہما said, \"Yes,\" and then recited: \"We gave...So follow their guidance.\" (6.85,90) Then he said, \"He (David ) is one them (i.e. those prophets).\" Mujahid narrated: I asked Ibn `Abbas  رضی اللہ عنہما (regarding the above Verse). He said, \"Your Prophet (Muhammad) was one of those who were ordered to follow them.\"",
                "hadithUrdu": "انہوں نے ابن عباس رضی اللہ عنہما سے پوچھا کیا سورۃ ص میں سجدہ ہے؟ ابن عباس رضی اللہ عنہما نے بتلایا، ہاں۔ پھر آپ نے آیت «ووهبنا‏» سے ( «فبهداهم اقتده‏» ) تک پڑھی اور کہا کہ داؤد علیہ السلام بھی ان انبیاء میں شامل ہیں ( جن کا ذکر آیت میں ہوا ہے ) ۔ یزید بن ہارون، محمد بن عبید اور سہل بن یوسف نے عوام بن حوشب سے، ان سے مجاہد نے بیان کیا کہ میں نے ابن عباس رضی اللہ عنہما سے پوچھا، تو انہوں نے کہا تمہارے نبی بھی ان میں سے ہیں جنہیں اگلے انبیاء کی اقتداء کا حکم دیا گیا ہے۔",
                "urduNarrator": "مجھ سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم کو ہشام بن یوسف نے خبر دی، انہیں ابن جریج نے خبر دی، کہا کہ مجھے سلیمان احول نے خبر دی، انہیں مجاہد نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي سُلَيْمَانُ الأَحْوَلُ، أَنَّ مُجَاهِدًا، أَخْبَرَهُ أَنَّهُ، سَأَلَ ابْنَ عَبَّاسٍ أَفِي ‏\"‏ ص ‏\"‏ سَجْدَةٌ فَقَالَ نَعَمْ‏.‏ ثُمَّ تَلاَ ‏{‏وَوَهَبْنَا‏}‏ إِلَى قَوْلِهِ ‏{‏فَبِهُدَاهُمُ اقْتَدِهْ‏}‏ ثُمَّ قَالَ هُوَ مِنْهُمْ‏.‏ زَادَ يَزِيدُ بْنُ هَارُونَ وَمُحَمَّدُ بْنُ عُبَيْدٍ وَسَهْلُ بْنُ يُوسُفَ عَنِ الْعَوَّامِ عَنْ مُجَاهِدٍ قُلْتُ لاِبْنِ عَبَّاسٍ فَقَالَ نَبِيُّكُمْ صلى الله عليه وسلم مِمَّنْ أُمِرَ أَنْ يَقْتَدِيَ بِهِمْ‏.‏",
                "headingArabic": "‏{‏أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی ہے، لہٰذا ان کی ہدایت کی پیروی کرو۔‘‘ (آیت 6:90)",
                "headingEnglish": "The Statement of Allah: \"They are those whom Allah had guided. So, follow their guidance...\" (V.6:90)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4412,
                "hadithNumber": "4633",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"May Allah curse the Jews! When Allah forbade them to eat the fat of animals, they melted it and sold it, and utilized its price! \" Moreover, Abu Asim, Abdul Hameed, Yazeed, Ataa bin Rabih, Hadrat Jabir رضی اللہ عنہ reported it from the prophet ﷺ.",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، نبی کریم صلی اللہ علیہ وسلم نے فرمایا، اللہ یہودیوں کو غارت کرے، جب اللہ تعالیٰ نے ان پر مردہ جانوروں کی چربی حرام کر دی تو اس کا تیل نکال کر اسے بیچنے اور کھانے لگے۔ اور ابوعاصم نے بیان کیا، ان سے عبدالحمید نے بیان کیا، ان سے یزید نے بیان کیا، انہیں عطاء نے لکھا تھا کہ میں نے جابر رضی اللہ عنہ سے سنا اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے۔",
                "urduNarrator": "ہم سے عمرو بن خالد نے بیان کیا، کہا ہم سے لیث نے بیان کیا، ان سے یزید بن ابی حبیب نے کہ عطاء نے بیان کیا کہ انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، قَالَ عَطَاءٌ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ قَاتَلَ اللَّهُ الْيَهُودَ، لَمَّا حَرَّمَ اللَّهُ عَلَيْهِمْ شُحُومَهَا جَمَلُوهُ ثُمَّ بَاعُوهُ فَأَكَلُوهَا ‏\"‏‏.‏ وَقَالَ أَبُو عَاصِمٍ حَدَّثَنَا عَبْدُ الْحَمِيدِ، حَدَّثَنَا يَزِيدُ، كَتَبَ إِلَىَّ عَطَاءٌ سَمِعْتُ جَابِرًا، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَعَلَى الَّذِينَ هَادُوا حَرَّمْنَا كُلَّ ذِي ظُفُرٍ وَمِنَ الْبَقَرِ وَالْغَنَمِ حَرَّمْنَا عَلَيْهِمْ شُحُومَهُمَا‏}‏ الآيَةَ",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"اور جو یہودی ہیں ان پر ہم نے ہر اس جانور کو حرام کر دیا ہے جس کے کھر ہیں...\" (آیت 6:146)",
                "headingEnglish": "Allah's Statement: \"And unto those who are Jews, We forbade every (animal) with undivided hoof...\" (V.6:146)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4413,
                "hadithNumber": "4634",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "\"None has more sense of ghaira than Allah therefore - He prohibits shameful sins (illegal sexual intercourse, etc.) whether committed openly or secretly. And none loves to be praised more than Allah does, and for this reason He praises Himself.\" I asked Abu Wali, \"Did you hear it from `Abdullah رضی اللہ عنہ?\" He said, \"Yes,\" I said, \"Did `Abdullah رضی اللہ عنہ ascribe it to Allah's Messenger (ﷺ)?\" He said, \"Yes.\"",
                "hadithUrdu": "اللہ سے زیادہ اور کوئی غیرت مند نہیں، یہی وجہ ہے کہ اس نے بےحیائیوں کو حرام قرار دیا ہے۔ خواہ وہ ظاہر ہوں خواہ پوشیدہ اور اللہ کو اپنی تعریف سے زیادہ اور کوئی چیز پسند نہیں، یہی وجہ ہے کہ اس نے اپنی خود مدح کی ہے۔ ( عمرو بن مرہ نے بیان کیا کہ ) میں نے پوچھا آپ نے یہ حدیث خود عبداللہ بن مسعود رضی اللہ عنہ سے سنی تھی انہوں نے بیان کیا کہ ہاں، میں نے پوچھا اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے حوالہ سے حدیث بیان کی تھی؟ کہا کہ ہاں۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے عمرو نے، ان سے ابووائل نے اور ان سے عبداللہ رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ ‏ \"‏ لاَ أَحَدَ أَغْيَرُ مِنَ اللَّهِ، وَلِذَلِكَ حَرَّمَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ، وَلاَ شَىْءَ أَحَبُّ إِلَيْهِ الْمَدْحُ مِنَ اللَّهِ، لِذَلِكَ مَدَحَ نَفْسَهُ ‏\"‏‏.‏ قُلْتُ سَمِعْتَهُ مِنْ عَبْدِ اللَّهِ قَالَ نَعَمْ‏.‏ قُلْتُ وَرَفَعَهُ قَالَ نَعَمْ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَلاَ تَقْرَبُوا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’الفواحش (شرمناک گناہ، ناجائز جنسی جماع) کے قریب نہ جاؤ، خواہ کھلے عام کیا جائے یا چھپ کر...‘‘ (آیت 6:151)",
                "headingEnglish": "The Statement of Allah: \"...Come not near to Al-Fawahish (shameful sins, illegal sexual intercourse), whether committed openly or secretly...\" (V.6:151)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4414,
                "hadithNumber": "4635",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The Hour will not be established until the sun rises from the West: and when the people see it, then whoever will be living on the surface of the earth will have faith, and that is (the time) when no good will it do to a soul to believe then, if it believed not before.\" (6.158)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اس وقت تک قیامت قائم نہ ہو گی، جب تک سورج مغرب سے طلوع نہ ہو لے۔ جب لوگ اسے دیکھیں گے تو ایمان لائیں گے لیکن یہ وہ وقت ہو گا جب کسی ایسے شخص کو اس کا ایمان کوئی نفع نہ دے گا جو پہلے سے ایمان نہ رکھتا ہو۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، انہوں نے کہا ہم سے عبدالواحد نے بیان کیا، انہوں نے کہا ہم سے عمارہ نے بیان کیا، انہوں نے کہا ہم سے ابوزرعہ نے بیان کیا، کہا ہم سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا عُمَارَةُ، حَدَّثَنَا أَبُو زُرْعَةَ، حَدَّثَنَا أَبُو هُرَيْرَةَ، رضى الله عنه قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا، فَإِذَا رَآهَا النَّاسُ آمَنَ مَنْ عَلَيْهَا، فَذَاكَ حِينَ لاَ يَنْفَعُ نَفْسًا إِيمَانُهَا، لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ ‏\"‏‏.‏",
                "headingArabic": ":بَابُ قَوْلِهِ: {هَلُمَّ شُهَدَاءَكُمُ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’کہہ دو اپنے گواہوں کو سامنے لاؤ‘‘ (آیت 6:150)",
                "headingEnglish": "The Statement of Allah: \"Say: 'Bring forward your witnesses...\" (V.6:150)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4415,
                "hadithNumber": "4636",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The hour will not be established till the sun rises from the West; and when it rises (from the West) and the people see it, they all will believe. And that is (the time) when no good will it do to a soul to believe then.\" Then he recited the whole Verse (6.158)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ قیامت اس وقت تک قائم نہ ہو گی، جب تک سورج مغرب سے نہ طلوع ہو لے۔ جب مغرب سے سورج طلوع ہو گا اور لوگ دیکھ لیں گے تو سب ایمان لائیں گے لیکن یہ وقت ہو گا جب کسی کو اس کا ایمان نفع نہ دے گا، پھر آپ صلی اللہ علیہ وسلم نے اس آیت کی تلاوت کی۔",
                "urduNarrator": "مجھ سے اسحاق نے بیان کیا، کہا ہم کو عبدالرزاق نے خبر دی، کہا ہم کو معمر نے خبر دی، انہیں ہمام نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا فَإِذَا طَلَعَتْ وَرَآهَا النَّاسُ آمَنُوا أَجْمَعُونَ، وَذَلِكَ حِينَ لاَ يَنْفَعُ نَفْسًا إِيمَانُهَا ‏\"‏‏.‏ ثُمَّ قَرَأَ الآيَةَ‏.‏",
                "headingArabic": "‏{‏لاَ يَنْفَعُ نَفْسًا إِيمَانُهَا‏}‏",
                "headingUrdu": "\"جس دن آپ کے رب کی نشانیوں میں سے کچھ آ جائیں گے، کسی شخص کے لیے ایمان لانا کوئی فائدہ نہیں دے گا...\" (V.6:158)",
                "headingEnglish": "\"The day that some of the signs of your Lord do come, no good will it do to a person to believe...\" (V.6:158)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4416,
                "hadithNumber": "4637",
                "englishNarrator": "Narrated `Abdullah bin Mas`ud رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"None has more sense of ghaira than Allah, and for this He has forbidden shameful sins whether committed openly or secretly, and none loves to be praised more than Allah does, and this is why He Praises Himself.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ سے زیادہ اور کوئی غیرت مند نہیں ہے۔ اسی لیے اس نے بےحیائیوں کو حرام کیا خواہ ظاہر میں ہوں یا پوشیدہ اور اللہ سے زیادہ اپنی مدح کو پسند کرنے والا اور کوئی نہیں، اسی لیے اس نے اپنے نفس کی خود تعریف کی ہے۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے عمرو بن مرہ نے، ان سے ابووائل نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے ( عمرو بن مرہ نے بیان کیا کہ ) میں نے ( ابووائل سے ) پوچھا، کیا تم نے یہ حدیث ابن مسعود رضی اللہ عنہ سے خود سنی ہے؟ انہوں نے کہا کہ جی ہاں اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیا،",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قُلْتُ أَنْتَ سَمِعْتَ هَذَا مِنْ عَبْدِ اللَّهِ قَالَ نَعَمْ، وَرَفَعَهُ‏.‏ قَالَ ‏ \"‏ لاَ أَحَدَ أَغْيَرُ مِنَ اللَّهِ، فَلِذَلِكَ حَرَّمَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ، وَلاَ أَحَدَ أَحَبُّ إِلَيْهِ الْمِدْحَةُ مِنَ اللَّهِ، فَلِذَلِكَ مَدَحَ نَفْسَهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4417,
                "hadithNumber": "4638",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "A man from the Jews, having been slapped on his face, came to the Prophet (ﷺ) and said, \"O Muhammad! A man from your companions from the Ansar has slapped me on my face!\" The Prophet (ﷺ) said, \"Call him.\" When they called him, the Prophet (ﷺ) said, \"Why did you slap him?\" He said, \"O Allah's Messenger (ﷺ)! While I was passing by the Jews, I heard him saying, 'By Him Who selected Moses above the human beings,' I said, 'Even above Muhammad?' I became furious and slapped him on the face.\" The Prophet (ﷺ) said, \"Do not give me superiority over the other prophets, for on the Day of Resurrection the people will become unconscious and I will be the first to regain consciousness. Then I will see Moses holding one of the legs of the Throne. I will not know whether he has come to his senses before me or that the shock he had received at the Mountain, (during his worldly life) was sufficient for him.\"",
                "hadithUrdu": "ایک یہودی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا، اس کے منہ پر کسی نے طمانچہ مارا تھا۔ اس نے کہا: اے محمد! آپ کے انصاری صحابہ میں سے ایک شخص نے مجھے طمانچہ مارا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہیں بلاؤ۔ لوگوں نے انہیں بلایا، پھر آپ صلی اللہ علیہ وسلم نے ان سے پوچھا تم نے اسے طمانچہ کیوں مارا ہے؟ اس نے عرض کیا: یا رسول اللہ! میں یہودیوں کی طرف سے گزرا تو میں نے سنا کہ یہ کہہ رہا تھا۔ اس ذات کی قسم! جس نے موسیٰ علیہ السلام کو تمام انسانوں پر فضیلت دی۔ میں نے کہا اور محمد صلی اللہ علیہ وسلم پر بھی۔ مجھے اس کی بات پر غصہ آ گیا اور میں نے اسے طمانچہ مار دیا۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر فرمایا کہ مجھے انبیاء پر فضیلت نہ دیا کرو۔ قیامت کے دن تمام لوگ بیہوش کر دیئے جائیں گے۔ سب سے پہلے میں ہوش میں آؤں گا لیکن میں موسیٰ علیہ السلام کو دیکھوں گا کہ وہ عرش کا ایک پایہ پکڑے کھڑے ہوں گے اب مجھے نہیں معلوم کہ وہ مجھ سے پہلے ہوش میں آ گئے یا طور کی بے ہوشی کا انہیں بدلہ دیا گیا۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا، انہوں نے کہا ہم سے سفیان ثوری نے بیان کیا، ان سے عمرو بن یحییٰ مازنی نے، ان سے ان کے والد یحییٰ مازنی نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ جَاءَ رَجُلٌ مِنَ الْيَهُودِ إِلَى النَّبِيِّ صلى الله عليه وسلم قَدْ لُطِمَ وَجْهُهُ وَقَالَ يَا مُحَمَّدُ إِنَّ رَجُلاً مِنْ أَصْحَابِكَ مِنَ الأَنْصَارِ لَطَمَ وَجْهِي‏.‏ قَالَ ‏\"‏ ادْعُوهُ ‏\"‏‏.‏ فَدَعَوْهُ قَالَ ‏\"‏ لِمَ لَطَمْتَ وَجْهَهُ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ، إِنِّي مَرَرْتُ بِالْيَهُودِ فَسَمِعْتُهُ يَقُولُ وَالَّذِي اصْطَفَى مُوسَى عَلَى الْبَشَرِ‏.‏ فَقُلْتُ وَعَلَى مُحَمَّدٍ وَأَخَذَتْنِي غَضْبَةٌ فَلَطَمْتُهُ‏.‏ قَالَ ‏\"‏ لاَ تُخَيِّرُونِي مِنْ بَيْنِ الأَنْبِيَاءِ، فَإِنَّ النَّاسَ يَصْعَقُونَ يَوْمَ الْقِيَامَةِ فَأَكُونُ أَوَّلَ مَنْ يُفِيقُ، فَإِذَا أَنَا بِمُوسَى آخِذٌ بِقَائِمَةٍ مِنْ قَوَائِمِ الْعَرْشِ، فَلاَ أَدْرِي أَفَاقَ قَبْلِي أَمْ جُزِيَ بِصَعْقَةِ الطُّورِ ‏\"‏‏.‏",
                "headingArabic": "‏{‏وَلَمَّا جَاءَ مُوسَى لِمِيقَاتِنَا وَكَلَّمَهُ رَبُّهُ قَالَ رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ قَالَ لَنْ تَرَانِي وَلَكِنِ انْظُرْ إِلَى الْجَبَلِ فَإِنِ اسْتَقَرَّ مَكَانَهُ فَسَوْفَ تَرَانِي فَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا وَخَرَّ مُوسَى صَعِقًا فَلَمَّا أَفَاقَ قَالَ سُبْحَانَكَ تُبْتُ إِلَيْكَ وَأَنَا أَوَّلُ الْمُؤْمِنِينَ‏}‏",
                "headingUrdu": "اور جب موسیٰ (علیہ السلام) ہمارے مقرر کردہ وقت اور جگہ پر آئے اور ان کے رب نے ان سے بات کی تو انہوں نے کہا اے میرے رب مجھے دکھا کہ میں تجھے دیکھوں۔ (V.7:143)",
                "headingEnglish": "\"And when Musa (Moses) came at the time and place appointed by Us, and his Lord (Allah) spoke to him, he said, 'O my Lord! Show me (Yourself) that I may look upon You.\" (V.7:143)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4418,
                "hadithNumber": "4639",
                "englishNarrator": "Narrated Sa`id Ibn Zaid رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Al-Kam'a is like the Mann (sweet resin or gum) (in that it grows naturally without human care) and its water is a cure for the eye diseases.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا، کھنبی «من» میں سے ہے اور اس کا پانی آنکھوں کے لیے شفاء ہے۔",
                "urduNarrator": "ہم سے مسلم نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے عبدالملک نے، ان سے عمرو بن حریث نے اور ان سے سعید بن زید رضی اللہ عنہما کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ، عَنْ عَمْرِو بْنِ حُرَيْثٍ، عَنْ سَعِيدِ بْنِ زَيْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْكَمْأَةُ مِنَ الْمَنِّ وَمَاؤُهَا شِفَاءُ الْعَيْنِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4419,
                "hadithNumber": "4640",
                "englishNarrator": "Narrated Abu Ad-Darda رضی اللہ عنہ :",
                "hadithEnglish": "There was a dispute between Abu Bakr رضی اللہ عنہ and `Umar رضی اللہ عنہ , and Abu Bakr رضی اللہ عنہ made `Umar رضی اللہ عنہ angry. So `Umar رضی اللہ عنہ left angrily. Abu Bakr رضی اللہ عنہ followed him, requesting him to ask forgiveness (of Allah) for him, but `Umar رضی اللہ عنہ refused to do so and closed his door in Abu Bakr's face. So Abu Bakr رضی اللہ عنہ went to Allah's Messenger (ﷺ) while we were with him. Allah's Messenger (ﷺ) said, \"This friend of yours must have quarrelled (with somebody).\" In the meantime `Umar رضی اللہ عنہ repented and felt sorry for what he had done, so he came, greeted (those who were present) and sat with the Prophet (ﷺ) and related the story to him. Allah's Messenger (ﷺ) became angry and Abu Bakr رضی اللہ عنہ started saying, \"O Allah's Messenger (ﷺ)! By Allah, I was more at fault (than `Umarرضی اللہ عنہ ).\" Allah's Apostle said, \"Are you (people) leaving for me my companion? (Abu Bakr), Are you (people) leaving for me my companion? When I said, 'O people I am sent to you all as the Messenger of Allah,' you said, 'You tell a lie.' while Abu Bakr said, 'You have spoken the truth .\"",
                "hadithUrdu": "ابوبکر اور عمر رضی اللہ عنہما کے درمیان کچھ بحث سی ہو گئی تھی۔ عمر رضی اللہ عنہ ابوبکر رضی اللہ عنہ پر غصہ ہو گئے اور ان کے پاس سے آنے لگے۔ ابوبکر رضی اللہ عنہ بھی ان کے پیچھے پیچھے ہو گئے، معافی مانگتے ہوئے۔ لیکن عمر رضی اللہ عنہ نے انہیں معاف نہیں کیا اور ( گھر پہنچ کر ) اندر سے دروازہ بند کر لیا۔ اب ابوبکر رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے۔ ابودرداء رضی اللہ عنہ نے بیان کیا کہ ہم لوگ اس وقت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے یہ صاحب ( یعنی ابوبکر رضی اللہ عنہ ) لڑ آئے ہیں۔ راوی نے بیان کیا کہ عمر رضی اللہ عنہ بھی اپنے طرز عمل پر نادم ہوئے اور نبی کریم صلی اللہ علیہ وسلم کی طرف چلے اور سلام کر کے آپ صلی اللہ علیہ وسلم کے قریب بیٹھ گئے۔ پھر نبی کریم صلی اللہ علیہ وسلم سے سارا واقعہ بیان کیا۔ ابودرداء رضی اللہ عنہ نے بیان کیا کہ آپ بہت ناراض ہوئے۔ ادھر ابوبکر رضی اللہ عنہ باربار یہ عرض کرتے کہ یا رسول اللہ! واقعی میری ہی زیادتی تھی۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کیا تم لوگ مجھے میرے ساتھی سے جدا کرنا چاہتے ہو؟ کیا تم لوگ میرے ساتھی کو مجھ سے جدا کرنا چاہتے ہو؟ جب میں نے کہا تھا کہ اے انسانو! بیشک میں اللہ کا رسول ہوں، تم سب کی طرف، تو تم لوگوں نے کہا کہ تم جھوٹ بولتے ہو، اس وقت ابوبکر نے کہا تھا کہ آپ سچے ہیں۔ ابوعبداللہ نے کہا «غامر» کے معنی حدیث میں یہ ہے کہ ابوبکر رضی اللہ عنہ نے بھلائی میں سبقت کی ہے۔",
                "urduNarrator": "ہم سے عبداللہ نے بیان کیا، انہوں نے کہا ہم سے سلیمان بن عبدالرحمٰن اور موسیٰ بن ہارون نے بیان کیا، انہوں نے کہا کہ ہم سے ولید بن مسلم نے بیان کیا، کہا ہم سے عبداللہ بن علاء بن زبیر نے بیان کیا، کہا کہ مجھ سے بسر بن عبداللہ نے بیان کیا، کہا کہ مجھ سے ابوادریس خولانی نے بیان کیا، کہا کہ میں نے ابودرداء رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ، وَمُوسَى بْنُ هَارُونَ، قَالاَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلاَءِ بْنِ زَبْرٍ، قَالَ حَدَّثَنِي بُسْرُ بْنُ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبُو إِدْرِيسَ الْخَوْلاَنِيُّ، قَالَ سَمِعْتُ أَبَا الدَّرْدَاءِ، يَقُولُ كَانَتْ بَيْنَ أَبِي بَكْرٍ وَعُمَرَ مُحَاوَرَةٌ، فَأَغْضَبَ أَبُو بَكْرٍ عُمَرَ، فَانْصَرَفَ عَنْهُ عُمَرُ مُغْضَبًا، فَاتَّبَعَهُ أَبُو بَكْرٍ يَسْأَلُهُ أَنْ يَسْتَغْفِرَ لَهُ، فَلَمْ يَفْعَلْ حَتَّى أَغْلَقَ بَابَهُ فِي وَجْهِهِ، فَأَقْبَلَ أَبُو بَكْرٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَبُو الدَّرْدَاءِ وَنَحْنُ عِنْدَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَّا صَاحِبُكُمْ هَذَا فَقَدْ غَامَرَ ‏\"‏‏.‏ قَالَ وَنَدِمَ عُمَرُ عَلَى مَا كَانَ مِنْهُ فَأَقْبَلَ حَتَّى سَلَّمَ وَجَلَسَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَقَصَّ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الْخَبَرَ‏.‏ قَالَ أَبُو الدَّرْدَاءِ وَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَجَعَلَ أَبُو بَكْرٍ يَقُولُ وَاللَّهِ يَا رَسُولَ اللَّهِ لأَنَا كُنْتُ أَظْلَمَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ أَنْتُمْ تَارِكُو لِي صَاحِبِي هَلْ أَنْتُمْ تَارِكُو لِي صَاحِبِي إِنِّي قُلْتُ يَا أَيُّهَا النَّاسُ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ جَمِيعًا فَقُلْتُمْ كَذَبْتَ‏.‏ وَقَالَ أَبُو بَكْرٍ صَدَقْتَ ‏ قَالَ أَبُو عَبْد اللَّهِ غَامَرَ سَبَقَ بِالْخَيْر\"‏‏.‏",
                "headingArabic": "{‏قُلْ يَا أَيُّهَا النَّاسُ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ جَمِيعًا الَّذِي لَهُ مُلْكُ السَّمَوَاتِ وَالأَرْضِ لاَ إِلَهَ إِلاَّ هُوَ يُحْيِي وَيُمِيتُ فَآمِنُوا بِاللَّهِ وَرَسُولِهِ النَّبِيِّ الأُمِّيِّ الَّذِي يُؤْمِنُ بِاللَّهِ وَكَلِمَاتِهِ وَاتَّبِعُوهُ لَعَلَّكُمْ تَهْتَدُونَ‏}",
                "headingUrdu": "(اے محمد صلی اللہ علیہ وسلم) کہہ دو کہ اے لوگو، بے شک میں تم سب کی طرف اس اللہ کا رسول بنا کر بھیجا گیا ہوں جس کی بادشاہی آسمانوں اور زمین کی ہے، لیلٰہ الا ہُوّا وہی زندگی دیتا ہے اور موت دیتا ہے، پس اللہ اور اس کے رسول پر ایمان لاؤ، اس نبی پر جو نہ پڑھ سکتے ہیں اور نہ لکھ سکتے ہیں، جو اللہ اور اس کے کلمات پر ایمان رکھتے ہیں۔ قرآن، تورات (تورات) اور انجیل (Gpspel) اور اللہ کا کلام بھی ہے: \"ہو جا، اور وہ عیسیٰ ابن مریم (علیہ السلام) تھے، اور ان کی پیروی کرو تاکہ تم اس کی پیروی کرو۔ ہدایت یافتہ ہو\" (V. 7: 158)",
                "headingEnglish": "\"Say (O Muhammad ﷺ : 'O mankind. Verily, I am sent to you all as the Messenger of Allah - to Whom belongs the dominion of the heavens and the earth. Lailaha ilIa Huwa (none has the right to be worshipped but He). It is He Who gives life and causes death. So believe in Allah and His Messenger (Muhammad ﷺ,), the Prophet who can neither read nor write (i.e., Muhammad ﷺ) ,who believes in Allah and His Words [(this Qur'an), the Taurat (Torah) and the Injeel (Gpspel) and also Allah's Word: \"Be! - and he was, i.e., 'Isa (Jesus) son of Maryam (Mary) ;and follow him so that you may be guided.\" (V.7:158)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4420,
                "hadithNumber": "4641",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"It was said to the children of Israel, 'Enter the gate in prostration and say Hitatun. (7.161) We shall forgive you, your faults.' But they changed (Allah's Order) and entered, dragging themselves on their buttocks and said, 'Habatun (a grain) in a Sha'ratin (hair).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ بنی اسرائیل سے کہا گیا تھا کہ دروازے میں ( عاجزی سے ) جھکتے ہوئے داخل ہو اور کہتے جاؤ کہ توبہ ہے، تو ہم تمہاری خطائیں معاف کر دیں گے، لیکن انہوں نے حکم بدل ڈالا۔ چوتڑوں کے بل گھسٹتے ہوئے داخل ہوئے اور یہ کہا کہ «حبة في شعرة» یعنی ہم کو بالیوں میں دانہ چاہیئے۔",
                "urduNarrator": "ہم سے اسحاق نے بیان کیا، کہا ہم کو عبدالرزاق نے خبر دی، کہا ہم کو معمر نے خبر دی، انہیں ہمام بن منبہ نے، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قِيلَ لِبَنِي إِسْرَائِيلَ ‏{‏ادْخُلُوا الْبَابَ سُجَّدًا وَقُولُوا حِطَّةٌ نَغْفِرْ لَكُمْ خَطَايَاكُمْ‏}‏ فَبَدَّلُوا فَدَخَلُوا يَزْحَفُونَ عَلَى أَسْتَاهِهِمْ وَقَالُوا حَبَّةٌ فِي شَعَرَةٍ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَقُولُوا حِطَّةٌ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا ارشاد ہے: \"اور کہو... حتطون...\" [یعنی (اے اللہ) ہمارے گناہوں کو بخش دے] (V.",
                "headingEnglish": "Allah's Saying: \"And say ... Hittatun...\" [i.e., (O Allah) forgive our sins] (V.7:161)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4421,
                "hadithNumber": "4642",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Uyaina bin Hisn bin Hudhaifa came and stayed with his nephew Al-Hurr bin Qais who was one of those whom `Umar رضی اللہ عنہ used to keep near him, as the Qurra' (learned men knowing Qur'an by heart) were the people of `Umar's meetings and his advisors whether they were old or young. 'Uyaina said to his nephew, \"O son of my brother! You have an approach to this chief, so get for me the permission to see him.\" Al-Hurr said, \"I will get the permission for you to see him.\" So Al-Hurr asked the permission for 'Uyaina and `Umar رضی اللہ عنہ admitted him. When 'Uyaina entered upon him, he said, \"Beware! O the son of Al-Khattab! By Allah, you neither give us sufficient provision nor judge among us with justice.\" Thereupon `Umar رضی اللہ عنہ became so furious that he intended to harm him, but Al-Hurr said, \"O chief of the Believers! Allah said to His Prophet: \"Hold to forgiveness; command what is right; and leave (don't punish) the foolish.\" (7.199) and this (i.e. 'Uyaina) is one of the foolish.\" By Allah, `Umar رضی اللہ عنہ did not overlook that Verse when Al-Hurr recited it before him; he observed (the orders of) Allah's Book strictly.",
                "hadithUrdu": "عیینہ بن حصن بن حذیفہ نے اپنے بھتیجے حر بن قیس کے یہاں آ کر قیام کیا۔ حر، ان چند خاص لوگوں میں سے تھے جنہیں عمر رضی اللہ عنہ اپنے بہت قریب رکھتے تھے جو لوگ قرآن مجید کے زیادہ عالم اور قاری ہوتے۔ عمر رضی اللہ عنہ کی مجلس میں انہیں کو زیادہ نزدیکی حاصل ہوتی تھی اور ایسے لوگ آپ کے مشیر ہوتے۔ اس کی کوئی قید نہیں تھی کہ وہ عمر رسیدہ ہوں یا نوجوان۔ عیینہ نے اپنے بھتیجے سے کہا کہ تمہیں اس امیر کی مجلس میں بہت نزدیکی حاصل ہے۔ میرے لیے بھی مجلس میں حاضری کی اجازت لے دو۔ حر بن قیس نے کہا کہ میں آپ کے لیے بھی اجازت مانگوں گا۔ ابن عباس رضی اللہ عنہما رضی اللہ عنہ نے بیان کیا۔ چنانچہ انہوں نے عیینہ کے لیے بھی اجازت مانگی اور عمر رضی اللہ عنہ نے انہیں مجلس میں آنے کی اجازت دے دی۔ مجلس میں جب وہ پہنچے تو کہنے لگے: اے خطاب کے بیٹے! اللہ کی قسم! نہ تو تم ہمیں مال ہی دیتے ہو اور نہ عدل و انصاف کے ساتھ فیصلہ کرتے ہو۔ عمر رضی اللہ عنہ کو ان کی اس بات پر بڑا غصہ آیا اور آگے بڑھ ہی رہے تھے کہ حر بن قیس نے عرض کیا: یا امیرالمؤمنین! اللہ تعالیٰ نے اپنے نبی سے خطاب کر کے فرمایا ہے ”معافی اختیار کر اور نیک کام کا حکم دے اور جاہلوں سے کنارہ کش ہو جایا کیجئے۔“ اور یہ بھی جاہلوں میں سے ہیں۔ اللہ کی قسم! کہ جب حر نے قرآن مجید کی تلاوت کی تو عمر رضی اللہ عنہ بالکل ٹھنڈے پڑ گئے اور کتاب اللہ کے حکم کے سامنے آپ کی یہی حالت ہوتی تھی۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، ان سے زہری نے بیان کیا، انہیں عبیداللہ بن عبداللہ بن عتبہ نے خبر دی اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ عُيَيْنَةُ بْنُ حِصْنِ بْنِ حُذَيْفَةَ فَنَزَلَ عَلَى ابْنِ أَخِيهِ الْحُرِّ بْنِ قَيْسٍ، وَكَانَ مِنَ النَّفَرِ الَّذِينَ يُدْنِيهِمْ عُمَرُ، وَكَانَ الْقُرَّاءُ أَصْحَابَ مَجَالِسِ عُمَرَ وَمُشَاوَرَتِهِ كُهُولاً كَانُوا أَوْ شُبَّانًا‏.‏ فَقَالَ عُيَيْنَةُ لاِبْنِ أَخِيهِ يَا ابْنَ أَخِي، لَكَ وَجْهٌ عِنْدَ هَذَا الأَمِيرِ فَاسْتَأْذِنْ لِي عَلَيْهِ‏.‏ قَالَ سَأَسْتَأْذِنُ لَكَ عَلَيْهِ‏.‏ قَالَ ابْنُ عَبَّاسٍ فَاسْتَأْذَنَ الْحُرُّ لِعُيَيْنَةَ فَأَذِنَ لَهُ عُمَرُ، فَلَمَّا دَخَلَ عَلَيْهِ قَالَ هِيْ يَا ابْنَ الْخَطَّابِ، فَوَاللَّهِ مَا تُعْطِينَا الْجَزْلَ، وَلاَ تَحْكُمُ بَيْنَنَا بِالْعَدْلِ‏.‏ فَغَضِبَ عُمَرُ حَتَّى هَمَّ بِهِ، فَقَالَ لَهُ الْحُرُّ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ اللَّهَ تَعَالَى قَالَ لِنَبِيِّهِ صلى الله عليه وسلم ‏{‏خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ‏}‏ وَإِنَّ هَذَا مِنَ الْجَاهِلِينَ‏.‏ وَاللَّهِ مَا جَاوَزَهَا عُمَرُ حِينَ تَلاَهَا عَلَيْهِ، وَكَانَ وَقَّافًا عِنْدَ كِتَابِ اللَّهِ‏.‏",
                "headingArabic": "‏{‏خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ‏}‏ الْعُرْفُ: الْمَعْرُوفُ",
                "headingUrdu": "\"معاف کرو، نیکی کا حکم دو، اور بے وقوفوں سے منہ موڑو (یعنی سزا نہ دو)۔\" (V.7:199)",
                "headingEnglish": "\"Show forgiveness, enjoin what is good, and turn away from the foolish (i.e., don't punish them).\" (V.7:199)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4422,
                "hadithNumber": "4643",
                "englishNarrator": "Narrated `Abdullah bin Az Zubair رضی اللہ عنہما :",
                "hadithEnglish": "(The Verse) \"Hold to forgiveness; command what is right...\" was revealed by Allah except in connection with the character of the people.",
                "hadithUrdu": "آیت «خذ العفو وأمر بالعرف‏» ”معافی اختیار کیجئے اور نیک کام کا حکم دیتے رہئیے۔“ لوگوں کے اخلاق کی اصلاح کے لیے ہی نازل ہوئی ہے۔",
                "urduNarrator": "ہم سے یحییٰ نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، ان سے ہشام نے، ان سے ان کے والد نے اور ان سے عبداللہ بن زبیر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، ‏{‏خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ‏}‏ قَالَ مَا أَنْزَلَ اللَّهُ إِلاَّ فِي أَخْلاَقِ النَّاسِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4423,
                "hadithNumber": "4644",
                "englishNarrator": "Narrated `Abdullah bin Az-Zubair رضی اللہ عنہما :",
                "hadithEnglish": "Allah ordered His Prophet to forgive the people their misbehavior (towards him).",
                "hadithUrdu": "اللہ تعالیٰ نے اپنے نبی کریم صلی اللہ علیہ وسلم کو حکم دیا ہے کہ لوگوں کے اخلاق ٹھیک کرنے کے لیے درگزر اختیار کریں یا کچھ ایسا ہی کہا۔",
                "urduNarrator": "اور عبداللہ بن براد نے بیان کیا، ان سے ابواسامہ نے بیان کیا، ان سے ہشام نے، ان سے ان کے والد نے اور ان سے عبداللہ بن زبیر رضی اللہ عنہما نے کہ",
                "hadithArabic": "وَقَالَ عَبْدُ اللَّهِ بْنُ بَرَّادٍ حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، قَالَ أَمَرَ اللَّهُ نَبِيَّهُ صلى الله عليه وسلم أَنْ يَأْخُذَ الْعَفْوَ مِنْ أَخْلاَقِ النَّاسِ‏.‏ أَوْ كَمَا قَالَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4424,
                "hadithNumber": "4645",
                "englishNarrator": "Narrated Sa`id bin Jubair:",
                "hadithEnglish": "I asked Ibn `Abbas رضی اللہ عنہما regarding Surat-al-Anfal. He said, \"It was revealed in connection with the Battle of Badr. \"الشوكة'' means: edge. ''مردفين‏'' means: flocks after flocks. ''ردفني'' means: come after me. ''ذوقوا‏'' means taste the torment, experience it. It is not a taste of mouth. ''فيركمه‏'': gather them. ''شرد‏'' : To put apart. ''جنحوا‏'' means: demanded. ''يُثْخِنَ‏'' means: to hold supremacy. Mujahid said: ''مكاء‏'' means: To produce a sound by inserting fingers into the mouth. ''تصدية‏'' means whistle. ''يثبتوك‏'' means: so as to confine you.",
                "hadithUrdu": "میں نے ابن عباس رضی اللہ عنہما سے سورۃ الانفال کے متعلق پوچھا۔ انہوں نے بتلایا کہ غزوہ بدر میں نازل ہوئی تھی۔ «الشوكة» کا معنی دھار نوک۔ «مردفين‏» کے معنی فوج در فوج۔ کہتے ہیں «ردفني وأردفني» یعنی میرے بعد آیا۔ «ذلكم فذوقوه ذوقوا‏» کا معنی یہ ہے کہ یہ عذاب اٹھاؤ اس کا تجربہ کرو، منہ سے چکھنا مراد نہیں ہے۔ «فيركمه‏» کا معنی اس کا جمع کرے۔ «شرد‏» کا معنی جدا کر دے ( یا سخت سزا دے ) ۔ «جنحوا‏» کے معنی طلب کریں۔ «يثخن‏» کا معنی غالب ہوا اور مجاہد نے کہا «مكاء‏» کا معنی انگلیاں منہ پر رکھنا۔ «تصدية‏» سیٹی بجانا۔ «يثبتوك‏» تاکہ تجھ کو قید کر لیں۔",
                "urduNarrator": "مجھ سے محمد بن عبدالرحیم نے بیان کیا، انہوں نے کہا ہم سے سعید بن سلیمان نے بیان کیا، انہوں نے کہا ہم کو ہشیم نے خبر دی، انہوں نے کہا ہم کو ابوبشر نے خبر دی، ان سے سعید بن جبیر نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، أَخْبَرَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ ـ رضى الله عنهما ـ سُورَةُ الأَنْفَالِ قَالَ نَزَلَتْ فِي بَدْرٍ‏.‏ الشَّوْكَةُ الْحَدُّ ‏{‏مُرْدَفِينَ‏}‏ فَوْجًا بَعْدَ فَوْجٍ، رَدِفَنِي وَأَرْدَفَنِي جَاءَ بَعْدِي ‏{‏ذُوقُوا‏}‏ بَاشِرُوا وَجَرِّبُوا وَلَيْسَ هَذَا مِنْ ذَوْقِ الْفَمِ ‏{‏فَيَرْكُمَهُ‏}‏ يَجْمَعُهُ‏.‏ ‏{‏شَرِّدْ‏}‏ فَرِّقْ ‏{‏وَإِنْ جَنَحُوا‏}‏ طَلَبُوا ‏{‏يُثْخِنَ‏}‏ يَغْلِبَ‏.‏ وَقَالَ مُجَاهِدٌ ‏{‏مُكَاءً‏}‏ إِدْخَالُ أَصَابِعِهِمْ فِي أَفْوَاهِهِمْ وَ‏{‏تَصْدِيَةً‏}‏ الصَّفِيرُ ‏{‏لِيُثْبِتُوكَ‏}‏ لِيَحْبِسُوكَ‏.‏",
                "headingArabic": "قَوْلُهُ ‏{‏يَسْأَلُونَكَ عَنِ الأَنْفَالِ، قُلِ الأَنْفَالُ لِلَّهِ وَالرَّسُولِ فَاتَّقُوا اللَّهَ وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"وہ لوگ آپ سے الانفال کے بارے میں پوچھتے ہیں، آپ کہہ دیجیے: غنیمت اللہ اور رسول صلی اللہ علیہ وسلم کے لیے ہے۔\" پس اللہ سے ڈرو اور اپنے درمیان تمام اختلافات کو درست کرو...\" (آیت 8:1)",
                "headingEnglish": "The Statement of Allah: \"They ask you (O Muhammad ﷺ) about Al-Anfal (the spoils of war). Say: 'The spoils are for Allah and the Messenger ﷺ.' So fear Allah and adjust all matters of difference among you...\" (V.8:1)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4425,
                "hadithNumber": "4646",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Regarding the Verse: \"Verily! The worst of beasts in the Sight of Allah are the deaf and the dumb---- those who understand not.\" (8.22) (The people referred to here) were some persons from the tribe of Bani `Abd-Addar.",
                "hadithUrdu": "آیت «إن شر الدواب عند الله الصم البكم الذين لا يعقلون‏» ”بدترین حیوانات اللہ کے نزدیک وہ بہرے گونگے ہیں جو عقل سے ذرا کام نہیں لیتے۔“ بنو عبدالدار کے کچھ لوگوں کے بارے میں اتری تھی۔",
                "urduNarrator": "ہم سے محمد بن یوسف فریابی نے بیان کیا، کہا ہم سے ورقاء بن عمر نے بیان کیا، ان سے ابن ابی نجیح نے، ان سے مجاہد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا وَرْقَاءُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، ‏{‏إِنَّ شَرَّ الدَّوَابِّ عِنْدَ اللَّهِ الصُّمُّ الْبُكْمُ الَّذِينَ لاَ يَعْقِلُونَ‏}‏ قَالَ هُمْ نَفَرٌ مِنْ بَنِي عَبْدِ الدَّارِ‏.‏",
                "headingArabic": "‏{‏إِنَّ شَرَّ الدَّوَابِّ عِنْدَ اللَّهِ الصُّمُّ الْبُكْمُ الَّذِينَ لاَ يَعْقِلُونَ‏}‏",
                "headingUrdu": "\"بے شک! اللہ کے نزدیک سب سے بدتر (چلتے پھرتے) بہرے اور گونگے ہیں، جو نہیں سمجھتے (یعنی کافر)۔\" (V.8:22)",
                "headingEnglish": "\"Verily! The worst of (moving) living creatures with Allah are the deaf and the dumb, those who understand not (i.e., the disbelievers) .\" (V.8:22)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4426,
                "hadithNumber": "4647",
                "englishNarrator": "Narrated Abu Sa`id bin Al-Mu'alla رضی اللہ عنہ :",
                "hadithEnglish": "While I was praying, Allah's Messenger (ﷺ) passed me and called me, but I did not go to him until I had finished the prayer. Then I went to him, and he said, \"What prevented you from coming to me? Didn't Allah say:-- \"O you who believe! Answer the call of Allah (by obeying Him) and His Apostle when He calls you?\" He then said, \"I will inform you of the greatest Sura in the Qur'an before I leave (the mosque).\" When Allah's Messenger (ﷺ) got ready to leave (the mosque), I reminded him. He said, \"It is: 'Praise be to Allah, the Lord of the worlds.' (i.e. Surat-al-Fatiha) As-sab'a Al-Mathani (the seven repeatedly recited Verses).",
                "hadithUrdu": "میں نماز پڑھ رہا تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے پکارا۔ میں آپ صلی اللہ علیہ وسلم کی خدمت میں نہ پہنچ سکا بلکہ نماز سے فارغ ہونے کے بعد حاضر ہوا۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ آنے میں دیر کیوں ہوئی؟ کیا اللہ تعالیٰ نے تمہیں حکم نہیں دیا ہے «يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم» کہ ”اے ایمان والو! اللہ اور اس کے رسول کی آواز پر لبیک کہو، جبکہ وہ ( یعنی رسول ) تم کو بلائیں۔“ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ مسجد سے نکلنے سے پہلے میں تمہیں قرآن کی عظیم ترین سورۃ سکھاؤں گا۔ تھوڑی دیر بعد آپ باہر تشریف لے جانے لگے تو میں نے آپ کو یاد دلایا۔ اور معاذ بن معاذ عنبری نے اس حدیث کو یوں روایت کیا کہ ہم سے شعبہ نے بیان کیا، ان سے خبیب نے، انہوں نے حفص سے سنا اور انہوں نے ابوسعید بن معلی رضی اللہ عنہ جو نبی کریم صلی اللہ علیہ وسلم کے صحابی تھے، سنا اور انہوں نے بیان کیا وہ ( سورۃ فاتحه ) «الحمد لله رب العالمين» ہے جس میں سات آیتیں ہیں جو ہر نماز میں مکرر پڑھی جاتی ہیں۔",
                "urduNarrator": "مجھ سے اسحاق بن راہویہ نے بیان کیا، کہا ہم کو روح بن عبادہ نے خبر دی، کہا ہم سے شعبہ نے بیان کیا، ان سے خبیب بن عبدالرحمٰن نے انہوں نے حفص بن عاصم سے سنا اور ان سے ابوسعید بن معلی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا رَوْحٌ، حَدَّثَنَا شُعْبَةُ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، سَمِعْتُ حَفْصَ بْنَ عَاصِمٍ، يُحَدِّثُ عَنْ أَبِي سَعِيدِ بْنِ الْمُعَلَّى ـ رضى الله عنه ـ قَالَ كُنْتُ أُصَلِّي فَمَرَّ بِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَدَعَانِي فَلَمْ آتِهِ حَتَّى صَلَّيْتُ، ثُمَّ أَتَيْتُهُ فَقَالَ ‏\"‏ مَا مَنَعَكَ أَنْ تَأْتِيَ أَلَمْ يَقُلِ اللَّهُ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ‏}‏ ثُمَّ قَالَ لأُعَلِّمَنَّكَ أَعْظَمَ سُورَةٍ فِي الْقُرْآنِ قَبْلَ أَنْ أَخْرُجَ ‏\"‏‏.‏ فَذَهَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيَخْرُجَ فَذَكَرْتُ لَهُ‏.‏ وَقَالَ مُعَاذٌ حَدَّثَنَا شُعْبَةُ، عَنْ خُبَيْبٍ، سَمِعَ حَفْصًا، سَمِعَ أَبَا سَعِيدٍ، رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا، وَقَالَ هِيَ ‏{‏الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏}‏ السَّبْعُ الْمَثَانِي‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَإِذْ قَالُوا اللَّهُمَّ إِنْ كَانَ هَذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِنَ السَّمَاءِ أَوِ ائْتِنَا بِعَذَابٍ أَلِيمٍ‏}‏",
                "headingUrdu": "اے لوگو جو ایمان لائے ہو، اللہ اور اس کے رسول کی بات مانو جب وہ تمہیں اس چیز کی طرف بلائے جو تمہیں زندگی بخشے، اور جان لو کہ اللہ آدمی اور اس کے دل کے درمیان آ جاتا ہے (یعنی وہ روکتا ہے۔ اور یقیناً تم سب اسی کی طرف جمع کیے جاؤ گے۔ (V.8:24)",
                "headingEnglish": "\"O you who believe! Answer Allah (by obeying Him) and (His) Messenger when he () calls you to that which will give you life, and know that Allah comes in between a man and his heart (i.e., He prevents an evil person to decide anything). And verily, to Him you shall (all) be gathered.\" (V.8:24)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4427,
                "hadithNumber": "4648",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Abu Jahl said, \"O Allah! If this (Qur'an) is indeed the Truth from You, then rain down on us a shower of stones from the sky or bring on us a painful torment.\" So Allah revealed:-- \"But Allah would not punish them while you were amongst them, nor He will punish them while they seek (Allah's) forgiveness...\" (8.33) And why Allah should not punish them while they turn away (men) from Al- Masjid-al-Haram (the Sacred Mosque of Mecca)...\" (8.33-34)",
                "hadithUrdu": "ابوجہل نے کہا تھا کہ اے اللہ! اگر یہ کلام تیری طرف سے واقعی حق ہے تو ہم پر آسمانوں سے پتھر برسا دے یا پھر کوئی اور ہی عذاب درد ناک لے آ!“ تو اس پر آیت «وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون * وما لهم أن لا يعذبهم الله وهم يصدون عن المسجد الحرام‏» ”حالانکہ اللہ ایسا نہیں کرے گا کہ انہیں عذاب دے، اس حال میں کہ آپ ان میں موجود ہوں اور نہ اللہ ان پر عذاب لائے گا اس حال میں کہ وہ استغفار کر رہے ہوں۔ ان لوگوں کے لیے کیا وجہ کہ اللہ ان پر عذاب ( ہی سرے سے ) نہ لائے درآں حالیکہ وہ مسجد الحرام سے روکتے ہیں۔“ آخر آیت تک۔",
                "urduNarrator": "مجھ سے احمد بن نضر نے بیان کیا، کہا ہم سے عبیداللہ بن معاذ نے بیان کیا، کہا ہم سے ہمارے والد نے بیان کیا، ان سے شعبہ نے بیان کیا، ان سے صاحب الزیادی عبدالحمید نے جو کردید کے صاحبزادے تھے، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْحَمِيدِ ـ هُوَ ابْنُ كُرْدِيدٍ صَاحِبُ الزِّيَادِيِّ ـ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ قَالَ أَبُو جَهْلٍ ‏{‏اللَّهُمَّ إِنْ كَانَ هَذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِنَ السَّمَاءِ أَوِ ائْتِنَا بِعَذَابٍ أَلِيمٍ‏}‏ فَنَزَلَتْ ‏{‏وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ * وَمَا لَهُمْ أَنْ لاَ يُعَذِّبَهُمُ اللَّهُ وَهُمْ يَصُدُّونَ عَنِ الْمَسْجِدِ الْحَرَامِ‏}‏ الآيَةَ‏.‏",
                "headingArabic": "‏{‏وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور اللہ ان کو عذاب نہیں دے گا جب تک کہ آپ (صلی اللہ علیہ وآلہ وسلم) ان میں ہوں گے اور نہ وہ ان کو عذاب دے گا جب تک وہ (اللہ سے) استغفار کرتے ہوں گے۔‘‘ (V.8:33)",
                "headingEnglish": "The Statement of Allah: \"And Allah would not punish them while you (Muhammad ﷺ) are amongst them, nor will He punish them while they seek (Allah's) forgiveness.\" (V.8:33)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4401,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=176",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=174",
                "label": "174",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=175",
                "label": "175",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=176",
                "label": "176",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=177",
                "label": "177",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=178",
                "label": "178",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=179",
                "label": "179",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=180",
                "label": "180",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=178",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=178",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=176",
        "to": 4425,
        "total": 40465
    }
}