{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 111,
        "data": [
            {
                "id": 2753,
                "hadithNumber": "2880",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "On the day (of the battle) of Uhad when (some) people retreated and left the Prophet, I saw `Aisha bint Abu Bakr and Um Sulaim  رضی اللہ عنہا , with their robes tucked up so that the bangles around their ankles were visible hurrying with their water skins (in another narration it is said, \"carrying the water skins on their backs\"). Then they would pour the water in the mouths of the people, and return to fill the water skins again and came back again to pour water in the mouths of the people.",
                "hadithUrdu": "احد کی لڑائی کے موقع پر مسلمان نبی کریم صلی اللہ علیہ وسلم کے پاس سے جدا ہو گئے تھے ۔ انہوں نے بیان کیا کہ میں نے عائشہ بنت ابی بکر اور ام سلیم رضی اللہ عنہا ( انس رضی اللہ عنہ کی والدہ ) کو دیکھا کہ یہ اپنے ازار سمیٹے ہوئے تھیں اور ( تیز چلنے کی وجہ سے ) پانی کے مشکیزے چھلکاتی ہوئی لیے جا رہی تھیں اور ابو معمر کے علاوہ جعفر بن مہران نے بیان کیا کہ مشکیزے کو اپنی پشت پر ادھر سے ادھر جلدی جلدی لیے پھرتی تھیں اور قوم کو اس میں سے پانی پلاتی تھیں ، پھر واپس آتی تھیں اور مشکیزوں کو بھر کر لے جاتی تھیں اور قوم کو پانی پلاتی تھیں ، میں ان کے پاؤں کی پازیبیں دیکھ رہا تھا ۔",
                "urduNarrator": "ہم سے ابومعمر نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، کہا ہم سے عبدالعزیز نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمَّا كَانَ يَوْمُ أُحُدٍ انْهَزَمَ النَّاسُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ وَلَقَدْ رَأَيْتُ عَائِشَةَ بِنْتَ أَبِي بَكْرٍ وَأُمَّ سُلَيْمٍ وَإِنَّهُمَا لَمُشَمِّرَتَانِ أَرَى خَدَمَ سُوقِهِمَا، تَنْقُزَانِ الْقِرَبَ ـ وَقَالَ غَيْرُهُ تَنْقُلاَنِ الْقِرَبَ ـ عَلَى مُتُونِهِمَا، ثُمَّ تُفْرِغَانِهِ فِي أَفْوَاهِ الْقَوْمِ، ثُمَّ تَرْجِعَانِ فَتَمْلآنِهَا، ثُمَّ تَجِيئَانِ فَتُفْرِغَانِهَا فِي أَفْوَاهِ الْقَوْمِ‏.‏",
                "headingArabic": "غَزْوِ النِّسَاءِ وَقِتَالِهِنَّ مَعَ الرِّجَالِ",
                "headingUrdu": "عورتوں کا جہاد اور مردوں کے ساتھ ان کا مقابلہ",
                "headingEnglish": "The Jihad of women and their fighting along with men",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2754,
                "hadithNumber": "2881",
                "englishNarrator": "Narrated Tha`laba bin Abi Malik:",
                "hadithEnglish": "`Umar bin Al-Khattab رضی اللہ عنہ distributed some garments amongst the women of Medina. One good garment remained, and one of those present with him said, \"O chief of the believers! Give this garment to your wife, the (grand) daughter of Allah's Messenger (ﷺ).\" They meant Um Kulthum رضی اللہ عنہ , the daughter of `Ali. `Umar رضی اللہ عنہ said, Um Salit رضی اللہ عنہا has more right (to have it).\" Um Salit رضی اللہ عنہا was amongst those Ansari women who had given the pledge of allegiance to Allah's Messenger (ﷺ).' `Umar رضی اللہ عنہ said, \"She (i.e. Um Salit رضی اللہ عنہا) used to carry the water skins for us on the day of Uhud.\" Imam Abu Abdullah Bukhari said: Here \" تَزْفِرُ \" means they would stich.",
                "hadithUrdu": "عمر بن خطاب رضی اللہ عنہ نے مدینہ کی خواتین میں کچھ چادریں تقسیم کیں ۔ ایک نئی چادر بچ گئی تو بعض حضرات نے جو آپ کے پاس ہی تھے کہا یا امیرالمؤمنین ! یہ چادر رسول اللہ صلی اللہ علیہ وسلم کی نواسی کو دے دیجئیے ، جو آپ کے گھر میں ہیں ۔ ان کی مراد ( آپ کی بیوی ) ام کلثوم بنت علی رضی اللہ عنہ سے تھی لیکن عمر رضی اللہ عنہ نے جواب دیا کہ ام سلیط رضی اللہ عنہا اس کی زیادہ مستحق ہیں ۔ یہ ام سلیط رضی اللہ عنہا ان انصاری خواتین میں سے تھیں جنہوں نے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی تھی ۔ عمر رضی اللہ عنہ نے فرمایا کہ آپ احد کی لڑائی کے موقع پر ہمارے لیے مشکیزے ( پانی کے ) اٹھا کر لاتی تھیں ۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا ( حدیث میں ) لفظ تزفر کا معنی یہ ہے کہ سیتی تھی ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، کہا ہم کو عبداللہ بن مباک نے خبر دی ، کہا ہم کو یونس نے خبر دی ، انہیں ابن شہاب نے ، ان سے ثعلبہ بن ابی مالک نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ ثَعْلَبَةُ بْنُ أَبِي مَالِكٍ إِنَّ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ قَسَمَ مُرُوطًا بَيْنَ نِسَاءٍ مِنْ نِسَاءِ الْمَدِينَةِ، فَبَقِيَ مِرْطٌ جَيِّدٌ فَقَالَ لَهُ بَعْضُ مَنْ عِنْدَهُ يَا أَمِيرَ الْمُؤْمِنِينَ أَعْطِ هَذَا ابْنَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم الَّتِي عِنْدَكَ‏.‏ يُرِيدُونَ أُمَّ كُلْثُومٍ بِنْتَ عَلِيٍّ‏.‏ فَقَالَ عُمَرُ أُمُّ سَلِيطٍ أَحَقُّ‏.‏ وَأُمُّ سَلِيطٍ مِنْ نِسَاءِ الأَنْصَارِ، مِمَّنْ بَايَعَ رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ عُمَرُ فَإِنَّهَا كَانَتْ تَزْفِرُ لَنَا الْقِرَبَ يَوْمَ أُحُدٍ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ تَزْفِرُ تَخِيطُ‏.‏",
                "headingArabic": "حَمْلِ النِّسَاءِ الْقِرَبَ إِلَى النَّاسِ فِي الْغَزْوِ",
                "headingUrdu": "خواتین کا لوگوں تک پانی پہنچانا",
                "headingEnglish": "The carrying of water by the women to the people",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2755,
                "hadithNumber": "2882",
                "englishNarrator": "Narrated Ar-Rubayyi 'bint Mu'auwidh رضی اللہ عنہا :",
                "hadithEnglish": "We were in the company of the Prophet (ﷺ) providing the wounded with water and treating them and bringing the killed to Medina (from the battle field) .",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ( غزوہ میں ) شریک ہوتے تھے ، مسلمان فوجیوں کو پانی پلاتیں تھیں زخمیوں کی مرہم پٹی کرتی تھیں اور جو لوگ شہید ہو جاتے انہیں مدینہ اٹھا کر لاتیں تھیں ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے بشر بن مفضل نے بیان کیا ، کہا ہم سے خالد بن ذکوان نے بیان کیا ، ان سے ربیع بنت معوذ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا خَالِدُ بْنُ ذَكْوَانَ، عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذٍ، قَالَتْ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم نَسْقِي، وَنُدَاوِي الْجَرْحَى، وَنَرُدُّ الْقَتْلَى إِلَى الْمَدِينَةِ‏.‏",
                "headingArabic": "مُدَاوَاةِ النِّسَاءِ الْجَرْحَى فِي الْغَزْوِ",
                "headingUrdu": "خواتین کی طرف سے زخمیوں کا علاج",
                "headingEnglish": "Treatment of the wounded by the women",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2756,
                "hadithNumber": "2883",
                "englishNarrator": "Narrated Ar-Rabi'bint Mu'auwidh رضی اللہ عنہا :",
                "hadithEnglish": "We used to take part in holy battles with the Prophet (ﷺ) by providing the people with water and serving them and bringing the killed and the wounded back to Medina.",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ جہاد میں شریک ہوتیں تھیں مجاہد مسلمانوں کو پانی پلاتیں ، ان کی خدمت کرتیں اور زخمیوں اور شہیدوں کو اٹھا کر مدینہ لے جاتیں تھیں ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے بشر بن مفضل نے بیان کیا ، ان سے خالد بن ذکوان نے اور ان سے ربیع بنت معوذ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ خَالِدِ بْنِ ذَكْوَانَ، عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذٍ، قَالَتْ كُنَّا نَغْزُو مَعَ النَّبِيِّ صلى الله عليه وسلم فَنَسْقِي الْقَوْمَ وَنَخْدُمُهُمْ، وَنَرُدُّ الْجَرْحَى وَالْقَتْلَى إِلَى الْمَدِينَةِ‏.‏",
                "headingArabic": "رَدِّ النِّسَاءِ الْجَرْحَى وَالْقَتْلَى",
                "headingUrdu": "خواتین کے ذریعے زخمیوں اور جاں بحق ہونے والوں کو واپس لانا",
                "headingEnglish": "The bringing back of the wounded and the killed by the women",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2757,
                "hadithNumber": "2884",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "Abu 'Amir رضی اللہ عنہ was hit with an arrow in his knee, so I went to him and he asked me to remove the arrow. When I removed it, the water started dribbling from it. Then I went to the Prophet (ﷺ) and told him about it. He said, \"O Allah! Forgive `Ubaid Abu 'Amir.\"",
                "hadithUrdu": "ابوعامر رضی اللہ عنہ کے گھٹنے میں تیر لگا تو میں ان کے پاس پہنچا ۔ انہوں نے فرمایا کہ اس تیر کو کھینچ کر نکال لو میں نے کھینچ لیا تو اس سے خون بہنے لگا پھر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ صلی اللہ علیہ وسلم کو اس حادثہ کی اطلاع دی تو آپ صلی اللہ علیہ وسلم نے ( ان کے لیے ) دعا فرمائی کہ اے اللہ ! عبید ابوعامر کی مغفرت فرما ۔",
                "urduNarrator": "ہم سے محمد بن علاء نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے یزید بن عبداللہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ رُمِيَ أَبُو عَامِرٍ فِي رُكْبَتِهِ، فَانْتَهَيْتُ إِلَيْهِ قَالَ انْزِعْ هَذَا السَّهْمَ‏.‏ فَنَزَعْتُهُ، فَنَزَا مِنْهُ الْمَاءُ، فَدَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرْتُهُ، فَقَالَ ‏ \"‏ اللَّهُمَّ اغْفِرْ لِعُبَيْدٍ أَبِي عَامِرٍ ‏\"‏‏.‏",
                "headingArabic": "نَزْعِ السَّهْمِ مِنَ الْبَدَنِ",
                "headingUrdu": "جسم سے تیر کو ہٹانا",
                "headingEnglish": "Removing the arrow from the body",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2758,
                "hadithNumber": "2885",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) was vigilant one night and when he reached Medina, he said, \"Would that a pious man from my companions guard me tonight!\" Suddenly we heard the clatter of arms. He said, \"Who is that? \" He (The new comer) replied, \" I am Sa`d bin Abi Waqqas and have come to guard you.\" So, the Prophet (ﷺ) slept (that night).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ( ایک رات ) بیداری میں گزاری ، مدینہ پہنچنے کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا ، کاش ! میرے اصحاب میں سے کوئی نیک مرد ایسا ہوتا جو رات بھر ہمارا پہرہ دیتا ! ابھی یہی باتیں ہو رہی تھیں کہ ہم نے ہتھیار کی جھنکار سنی ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا یہ کون صاحب ہیں ؟ ( آنے والے نے ) کہا میں ہوں سعد بن ابی وقاص ، آپ کا پہرہ دینے کے لیے حاضر ہوا ہوں ۔ پھر نبی کریم صلی اللہ علیہ وسلم خوش ہوئے ۔ ان کے لیے دعا فرمائی اور آپ سو گئے ۔",
                "urduNarrator": "ہم سے اسماعیل بن خلیل نے بیان کیا ، کہا ہم کو علی بن مسہر نے خبر دی ، کہا ہم کو یحییٰ بن سعید نے خبر دی ، کہا ہم کو عبداللہ بن ربیعہ بن عامر نے خبر دی ، کہا کہ میں نے عائشہ رضی اللہ عنہا سے سنا ، آپ بیان کرتی تھیں کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ خَلِيلٍ، أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ رَبِيعَةَ، قَالَ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ تَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم سَهِرَ فَلَمَّا قَدِمَ الْمَدِينَةَ قَالَ ‏\"‏ لَيْتَ رَجُلاً مِنْ أَصْحَابِي صَالِحًا يَحْرُسُنِي اللَّيْلَةَ ‏\"‏‏.‏ إِذْ سَمِعْنَا صَوْتَ سِلاَحٍ فَقَالَ ‏\"‏ مَنْ هَذَا ‏\"‏‏.‏ فَقَالَ أَنَا سَعْدُ بْنُ أَبِي وَقَّاصٍ، جِئْتُ لأَحْرُسَكَ‏.‏ وَنَامَ النَّبِيُّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "الْحِرَاسَةِ فِي الْغَزْوِ فِي سَبِيلِ اللَّهِ",
                "headingUrdu": "اللہ کی راہ میں مقدس لڑائیوں کے دوران چوکسی",
                "headingEnglish": "Vigilance during holy battles in Allah's Cause",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2759,
                "hadithNumber": "2886",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Let the slave of Dinar and Dirham of Quantify and Khamisa (i.e. money and luxurious clothes) perish for he is pleased if these things are given to him, and if not, he is displeased!\" . Israeel has not narrated it from Abu Husain Merfuan (elevating it to the Prophet ﷺ).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اشرفی کا بندہ ، روپے کا بندہ ، چادر کا بندہ ، کمبل کا بندہ ہلاک ہوا کہ اگر اسے کچھ دے دیا جائے تب تو خوش ہو جاتا ہے اور اگر نہیں دیا جائے تو ناراض ہو جاتا ہے ، اس حدیث کو اسرائیل اور محمد بن جہادہ نے ابو حصین سے مرفوع نہیں کیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن یوسف نے بیان کیا ، کہا ہم کو ابوبکرنے خبر دی ، انہیں ابو حصین نے ، انہیں ابوصالح اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يُوسُفَ، أَخْبَرَنَا أَبُو بَكْرٍ، عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ تَعِسَ عَبْدُ الدِّينَارِ وَالدِّرْهَمِ وَالْقَطِيفَةِ وَالْخَمِيصَةِ، إِنْ أُعْطِيَ رَضِيَ، وَإِنْ لَمْ يُعْطَ لَمْ يَرْضَ ‏\"‏‏.‏ لَمْ يَرْفَعْهُ إِسْرَائِيلُ عَنْ أَبِي حَصِينٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2760,
                "hadithNumber": "2887",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \" Let the slave of Dinar and Dirham, of Quantify and Khamisa perish as he is pleased if these things are given to him, and if not, he is displeased. Let such a person perish and relapse, and if he is pierced with a thorn, let him not find anyone to take it out for him. Paradise is for him who holds the reins of his horse to strive in Allah's Cause, with his hair unkempt and feet covered with dust: if he is appointed in the vanguard, he is perfectly satisfied with his post of guarding, and if he is appointed in the rearward, he accepts his post with satisfaction; (he is so simple and unambiguous that) if he asks for permission he is not permitted, and if he intercedes, his intercession is not accepted.\" Imam Abu Abdullah Bukhari says: Israeel and Muhammad bin Juhadah have not reported it from Abu Husain elevating it to the prophet (ﷺ) . And he said: \" تَعْسًا‏\" as if he had said: Allah has destroyed him, Allah has disgraced him. \"‏ طُوبَى\" is on the base of \"فُعْلَى \" and it means every nice thing. And its \"يَاءٌ \" has changed into \"و\" here and it is derived from \"يَطِيبُ‏\" .",
                "hadithUrdu": "انہوں نے آنحضرت صلی اللہ علیہ وسلم سے ، آپ نے فرمایا اشرفی کا بندہ اور روپے کا بندہ اور کمبل کا بندہ تباہ ہوا ، اگر اس کو کچھ دیا جائے تب تو خوش جب نہ دیا جائے تو غصہ ہو جائے ، ایسا شخص تباہ سرنگوں ہوا ۔ اس کو کانٹا لگے تو خدا کرے پھر نہ نکلے ۔ مبارک کا مستحق ہے وہ بندہ جو اللہ کے راستے میں ( غزوہ کے موقع پر ) اپنے گھوڑے کی لگام تھامے ہوئے ہے ، اس کے سر کے بال پراگندہ ہیں اور اس کے قدم گرد و غبار سے اٹے ہوئے ہیں ، اگر اسے چوکی پہرے پر لگا دیا جائے تو وہ اپنے اس کام میں پوری تندہی سے لگا رہے اور اگر لشکر کے پیچھے ( دیکھ بھال کے لیے ) لگا دیا جائے تو اس میں بھی پوری تندہی اور فرض شناسی سے لگا رہے ( اگرچہ زندگی میں غربت کی وجہ سے اس کی کوئی اہمیت بھی نہ ہو کہ ) اگر وہ کسی سے ملاقات کی اجازت چاہے تو اسے اجازت بھی نہ ملے اور اگر کسی کی سفارش کرے تو اس کی سفارش بھی قبول نہ کی جائے ۔ ابوعبداللہ ( حضرت امام بخاری رحمہ اللہ ) نے کہا کہ اسرائیل اور محمد بن جحادہ نے ابو حصین سے یہ روایت مرفوعاً نہیں بیان کی ہے اور کہا کہ قرآن مجید میں جو لفظ تعساً آیا ہے گویا یوں کہنا چاہئے کہ » فاتعسہم اﷲ « ( اللہ انہیں گرائے ہلاک کرے ) طوبیٰ فعلیٰکے وزن پر ہے ہر اچھی اور طیب چیز کے لیے ۔ واو اصل میں یا تھا ( طیبیٰ ) پھر یا کوواو سے بدل دیا گیا اور یہ طیب سے نکلا ہے ۔",
                "urduNarrator": "اور عمرو ابن مرزوق نے ہم سے بڑھا کر بیان کیا ، انہوں نے کہا ہم کو عبدالرحمٰن بن عبداللہ بن دینار نے خبر دی ، انہوں نے اپنے باپ سے ، انہوں نے ابوصالح سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے ،",
                "hadithArabic": "وَزَادَنَا عَمْرٌو قَالَ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِيهِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ تَعِسَ عَبْدُ الدِّينَارِ وَعَبْدُ الدِّرْهَمِ وَعَبْدُ الْخَمِيصَةِ، إِنْ أُعْطِيَ رَضِيَ، وَإِنْ لَمْ يُعْطَ سَخِطَ، تَعِسَ وَانْتَكَسَ، وَإِذَا شِيكَ فَلاَ انْتَقَشَ، طُوبَى لِعَبْدٍ آخِذٍ بِعِنَانِ فَرَسِهِ فِي سَبِيلِ اللَّهِ، أَشْعَثَ رَأْسُهُ مُغْبَرَّةٍ قَدَمَاهُ، إِنْ كَانَ فِي الْحِرَاسَةِ كَانَ فِي الْحِرَاسَةِ، وَإِنْ كَانَ فِي السَّاقَةِ كَانَ فِي السَّاقَةِ، إِنِ اسْتَأْذَنَ لَمْ يُؤْذَنْ لَهُ، وَإِنْ شَفَعَ لَمْ يُشَفَّعْ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ لَمْ يَرْفَعْهُ إِسْرَائِيلُ وَمُحَمَّدُ بْنُ جُحَادَةَ عَنْ أَبِي حَصِينٍ وَقَالَ تَعْسًا‏.‏ كَأَنَّهُ يَقُولُ فَأَتْعَسَهُمُ اللَّهُ‏.‏ طُوبَى فُعْلَى مِنْ كُلِّ شَىْءٍ طَيِّبٍ، وَهْىَ يَاءٌ حُوِّلَتْ إِلَى الْوَاوِ وَهْىَ مِنْ يَطِيبُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2761,
                "hadithNumber": "2888",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "I was in the company of Jabir bin `Abdullah on a journey and he used to serve me though he was older than I. Jarir رضی اللہ عنہ said, \"I saw the Ansar doing a thing (i.e. showing great reverence to the Prophet (ﷺ) ) for which I have vowed that whenever I meet any of them, I will serve him.\"",
                "hadithUrdu": "میں جریر بن عبداللہ بجلی رضی اللہ عنہ کے ساتھ تھا تو وہ میری خدمت کرتے تھے حالانکہ عمر میں وہ مجھ سے بڑے تھے ، جریر رضی اللہ عنہ نے بیان کیا کہ میں نے ہر وقت انصار کو ایک ایسا کام کرتے دیکھا ( رسول اللہ صلی اللہ علیہ وسلم کی خدمت ) کہ جب ان میں سے کوئی مجھے ملتا ہے تو میں اس کی تعظیم و اکرام کرتا ہوں ۔",
                "urduNarrator": "ہم سے محمد بن عرعرہ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے یونس بن عبید نے ، ان سے ثابت بنانی نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ يُونُسَ بْنِ عُبَيْدٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ صَحِبْتُ جَرِيرَ بْنَ عَبْدِ اللَّهِ، فَكَانَ يَخْدُمُنِي‏.‏ وَهْوَ أَكْبَرُ مِنْ أَنَسٍ قَالَ جَرِيرٌ إِنِّي رَأَيْتُ الأَنْصَارَ يَصْنَعُونَ شَيْئًا لاَ أَجِدُ أَحَدًا مِنْهُمْ إِلاَّ أَكْرَمْتُهُ‏.‏",
                "headingArabic": "فَضْلِ الْخِدْمَةِ فِي الْغَزْوِ",
                "headingUrdu": "حاضر خدمت تھے، دورنگ ہول بٹلیاں",
                "headingEnglish": "The service, during holy battles",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2762,
                "hadithNumber": "2889",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "I went along with the Prophet (ﷺ) to Khaibar so as to serve him. (Later on) when the Prophet (ﷺ) returned he, on seeing the Uhud mountain, said, \"This is a mountain that loves us and is loved by us.\" Then he pointed to Medina with his hand saying, \"O Allah! I make the area which is in between Medina's two mountains a sanctuary, as Abraham made Mecca a sanctuary. O Allah! Bless us in our Sa` and Mudd (i.e. units of measuring).\"",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ خیبر ( غزوہ کے موقع پر ) گیا ، میں آپ صلی اللہ علیہ وسلم کی خدمت کیا کرتا تھا ، پھر جب آپ صلی اللہ علیہ وسلم واپس ہوئے اور احد پہاڑ دکھائی دیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ وہ پہاڑ ہے جس سے ہم محبت کرتے ہیں اور وہ ہم سے محبت کرتا ہے ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ سے مدینہ کی طرف اشارہ کر کے فرمایا اے اللہ ! میں اس کے دونوں پتھریلے میدانوں کے درمیان کے خطے کو حرمت والا قرار دیتا ہوں ، جس طرح ابراہیم علیہ السلام نے مکہ کو حرمت والا شہر قرار دیا تھا ، اے اللہ ! ہمارے صاع اور ہمارے مد میں برکت عطا فرما ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا ہم سے محمد بن جعفر نے بیان کا ، ان سے مطلب بن حنطب کے مولیٰ عمرو بن ابی عمرو نے اور انہوں نے انس بن مالک رضی اللہ عنہ سے سنا ، آپ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، مَوْلَى الْمُطَّلِبِ بْنِ حَنْطَبٍ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ خَرَجْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى خَيْبَرَ أَخْدُمُهُ، فَلَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم رَاجِعًا، وَبَدَا لَهُ أُحُدٌ قَالَ ‏\"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏‏.‏ ثُمَّ أَشَارَ بِيَدِهِ إِلَى الْمَدِينَةِ قَالَ اللَّهُمَّ إِنِّي أُحَرِّمُ مَا بَيْنَ لاَبَتَيْهَا كَتَحْرِيمِ إِبْرَاهِيمَ مَكَّةَ ‏\"‏ اللَّهُمَّ بَارِكْ لَنَا فِي صَاعِنَا وَمُدِّنَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2763,
                "hadithNumber": "2890",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "We were with the Prophet (on a journey) and the only shade one could have was the shade made by one's own garment. Those who fasted did not do any work and those who did not fast served the camels and brought the water on them and treated the sick and (wounded). So, the Prophet (ﷺ) said, \"Today, those who were not fasting took (all) the reward.\"",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ( ایک سفر میں ) تھے ۔ کچھ صحابہ کرام رضی اللہ عنہم روزے سے تھے اور کچھ نے روزہ نہیں رکھا تھا ۔ موسم گرمی کا تھا ، ہم میں زیادہ بہتر سایہ جو کوئی کرتا ، اپنا کمبل تان لیتا ۔ خیر جو لوگ روزے سے تھے وہ کوئی کام نہ کر سکے تھے اور جن حضرات نے روزہ نہیں رکھا تھا تو انہوں نے ہی اونٹوں کو اٹھایا ( پانی پلایا ) اور روزہ داروں کی خوب خوب خدمت بھی کی ۔ اور ( دوسرے تمام ) کام کئے ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا آج اجر و ثواب کو روزہ نہ رکھنے والے لوٹ کر لے گئے ۔",
                "urduNarrator": "ہم سے سلیمان بن داود ابوالربیع نے بیان کیا ، کہا ہم سے اسماعیل بن زکریا نے ، ان سے عاصم بن سلیمان نے ، ان سے مورق عجلی نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَبُو الرَّبِيعِ، عَنْ إِسْمَاعِيلَ بْنِ زَكَرِيَّاءَ، حَدَّثَنَا عَاصِمٌ، عَنْ مُوَرِّقٍ الْعِجْلِيِّ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم أَكْثَرُنَا ظِلاًّ الَّذِي يَسْتَظِلُّ بِكِسَائِهِ، وَأَمَّا الَّذِينَ صَامُوا فَلَمْ يَعْمَلُوا شَيْئًا، وَأَمَّا الَّذِينَ أَفْطَرُوا فَبَعَثُوا الرِّكَابَ وَامْتَهَنُوا وَعَالَجُوا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ ذَهَبَ الْمُفْطِرُونَ الْيَوْمَ بِالأَجْرِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2764,
                "hadithNumber": "2891",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Charity is obligatory everyday on every joint of a human being. If one helps a person in matters concerning his riding animal by helping him to ride it or by lifting his luggage on to it, all this will be regarded charity. A good word, and every step one takes to offer the compulsory Congregational prayer, is regarded as charity; and guiding somebody on the road is regarded as charity.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا روزانہ انسان کے ہر ایک جوڑ پر صدقہ لازم ہے اور اگر کوئی شخص کسی کی سواری میں مدد کرے کہ اس کو سہارا دے کر اس کی سواری پر سوار کرا دے یا اس کا سامان اس پر اٹھا کر رکھ دے تو یہ بھی صدقہ ہے ۔ اچھا اور پاک لفظ بھی ( زبان سے نکالنا ) صدقہ ہے ۔ ہر قدم جو نماز کے لیے اٹھتا ہے وہ بھی صدقہ ہے اور ( کسی مسافر کو ) راستہ بتا دینا بھی صدقہ ہے ۔",
                "urduNarrator": "ہم سے اسحاق بن نضر نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، ان سے معمر نے ، ان سے ہمام نے ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ سُلاَمَى عَلَيْهِ صَدَقَةٌ كُلَّ يَوْمٍ، يُعِينُ الرَّجُلَ فِي دَابَّتِهِ يُحَامِلُهُ عَلَيْهَا أَوْ يَرْفَعُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالْكَلِمَةُ الطَّيِّبَةُ، وَكُلُّ خَطْوَةٍ يَمْشِيهَا إِلَى الصَّلاَةِ صَدَقَةٌ، وَدَلُّ الطَّرِيقِ صَدَقَةٌ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ مَنْ حَمَلَ مَتَاعَ صَاحِبِهِ فِي السَّفَرِ",
                "headingUrdu": "اس کی فضیلت جو سفر میں اپنے ساتھیوں کا سامان اٹھائے ۔",
                "headingEnglish": "The superiority of him who carries the luggage of his companions during a journey",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2765,
                "hadithNumber": "2892",
                "englishNarrator": "Narrated Sahl bin Sa`d As-Sa'di رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"To guard Muslims from infidels in Allah's Cause for one day is better than the world and whatever is on its surface, and a place in Paradise as small as that occupied by the whip of one of you is better than the world and whatever is on its surface; and a morning's or an evening's journey which a slave (person) travels in Allah's Cause is better than the world and whatever is on its surface.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اللہ کے راستے میں دشمن سے ملی ہوئی سرحد پر ایک دن کا پہرہ دنیا و مافیھا سے بڑھ کر ہے جنت میں کسی کے لئے ایک کوڑے جتنی جگہ دنیا و مافیھا سے بڑھ کر ہے اور جو شخص اللہ کے راستے میں شام کو چلے یا صبح کو تو وہ دنیا و مافیھا سے بہتر ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن منیر نے بیان کیا ، انہوں نے ابوالنضر ہاشم بن قاسم سے سنا ، انہوں نے کہا ہم سے عبدالرحمٰن بن عبداللہ بن دینار نے بیان کیا ، انہوں نے کہا کہ ہم سے ابوحازم ( سلمہ بن دینار ) نے بیان کیا اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ، سَمِعَ أَبَا النَّضْرِ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ رِبَاطُ يَوْمٍ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنَ الدُّنْيَا وَمَا عَلَيْهَا، وَمَوْضِعُ سَوْطِ أَحَدِكُمْ مِنَ الْجَنَّةِ خَيْرٌ مِنَ الدُّنْيَا وَمَا عَلَيْهَا، وَالرَّوْحَةُ يَرُوحُهَا الْعَبْدُ فِي سَبِيلِ اللَّهِ أَوِ الْغَدْوَةُ خَيْرٌ مِنَ الدُّنْيَا وَمَا عَلَيْهَا ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ رِبَاطِ يَوْمٍ فِي سَبِيلِ اللَّهِ",
                "headingUrdu": "حفاظت کی فضیلت (مسلمانوں کو کافروں سے)",
                "headingEnglish": "The superiority of guarding (Muslims from infidels)",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2766,
                "hadithNumber": "2893",
                "englishNarrator": "Narrated Anas bin Malik:",
                "hadithEnglish": "The Prophet (ﷺ) said to Abu Talha رضی اللہ عنہ , \"Choose one of your boy servants to serve me in my expedition to Khaibar.\" So, Abu Talha took me letting me ride behind him while I was a boy nearing the age of puberty. I used to serve Allah's Messenger (ﷺ) when he stopped to rest. I heard him saying repeatedly, \"O Allah! I seek refuge with You from distress and sorrow, from helplessness and laziness, from miserliness and cowardice, from being heavily in debt and from being overcome by men.\" Then we reached Khaibar; and when Allah enabled him to conquer the Fort (of Khaibar), the beauty of Safiya bint Huyai bin Akhtab رضی اللہ عنہا was described to him. Her husband had been killed while she was a bride. So Allah's Messenger (ﷺ) selected her for himself and took her along with him till we reached a place called Sa`d-AsSahba,' where her menses were over and he took her for his wife. Haris (a kind of dish) was served on a small leather sheet. Then Allah's Messenger (ﷺ) told me to call those who were around me. So, that was the marriage banquet of Allah's Messenger (ﷺ) and Safiya رضی اللہ عنہا . Then we left for Medina. I saw Allah's Apostle folding a cloak round the hump of the camel so as to make a wide space for Safiya رضی اللہ عنہا (to sit on behind him) He sat beside his camel letting his knees for Safiya رضی اللہ عنہا to put her feet on so as to mount the camel. Then, we proceeded till we approached Medina; he looked at Uhud (mountain) and said, \"This is a mountain which loves us and is loved by us.\" Then he looked at Medina and said, \"O Allah! I make the area between its (i.e. Medina's) two mountains a sanctuary as Abraham made Mecca a sanctuary. O Allah! Bless them (i.e. the people of Medina) in their Mudd and Sa (i.e. measures).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ابوطلحہ رضی اللہ عنہ سے فرمایا کہ اپنے بچوں میں سے کوئی بچہ میرے ساتھ کر دو جو خیبر کے غزوے میں میرے کام کر دیا کرے ، جب کہ میں خیبر کا سفر کروں ۔ ابوطلحہ اپنی سواری پر اپنے پیچھے بٹھا کر مجھے ( انس رضی اللہ عنہ کو ) لے گئے ، میں اس وقت ابھی لڑکا تھا ۔ بالغ ہونے کے قریب ۔ جب بھی آنحضرت صلی اللہ علیہ وسلم کہیں قیام فرماتے تو میں آپ صلی اللہ علیہ وسلم کی خدمت کرتا ۔ اکثر میں سنتا کہ آپ صلی اللہ علیہ وسلم یہ دعا کرتے اے اللہ ! میں تیری پناہ مانگتا ہوں غم ، عاجزی ، سستی ، بخل ، بزدلی ، قرض داری کے بوجھ اور ظالم کے اپنے اوپر غلبہ سے ، آخر ہم خیبر پہنچے اور جب اللہ تعالیٰ نے خیبر کے قلعہ پر آپ صلی اللہ علیہ وسلم کو فتح دی تو آپ صلی اللہ علیہ وسلم کے سامنے صفیہ بنت حی بن اخطب رضی اللہ عنہا کے جمال ( ظاہری و باطنی ) کا ذکر کیا گیا ان کا شوہر ( یہودی ) لڑائی میں کام آ گیا تھا اور وہ ابھی دلہن ہی تھیں ( اور چونکہ قبیلہ کے سردار کی لڑکی تھیں ) اس لیے رسول کریم صلی اللہ علیہ وسلم نے ( ان کا اکرام کرنے کے لیے کہا ) انہیں اپنے لیے پسند فرما لیا ۔ پھر آپ صلی اللہ علیہ وسلم انہیں ساتھ لے کر وہاں سے چلے ۔ جب ہم سدا الصبہاء پر پہنچے تو وہ حیض سے پاک ہوئیں ، تو آپ صلی اللہ علیہ وسلم نے ان سے خلوت کی ۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے حیس ( کھجور ، پنیر اور گھی سے تیار کیا ہوا ایک کھانا ) تیار کرا کر ایک چھوٹے سے دسترخوان پر رکھوایا اور مجھ سے فرمایا کہ اپنے آس پاس کے لوگوں کو دعوت دے دو اور یہی آنحضرت صلی اللہ علیہ وسلم کا حضرت صفیہ رضی اللہ عنہا کے ساتھ نکاح کا ولیمہ تھا ۔ آخر ہم مدینہ کی طرف چلے ، انس رضی اللہ عنہ نے کہا کہ میں نے دیکھا کہ آنحضور صلی اللہ علیہ وسلم صفیہ رضی اللہ عنہا کی وجہ سے اپنے پیچھے ( اونٹ کے کوہان کے اردگرد ) اپنی عباء سے پردہ کئے ہوئے تھے ( سواری پر جب حضرت صفیہ رضی اللہ عنہا سوار ہوتیں ) تو آپ صلی اللہ علیہ وسلم اپنے اونٹ کے پاس بیٹھ جاتے اور اپنا گھٹنا کھڑا رکھتے اور حضرت صفیہ رضی اللہ عنہا اپنا پاؤں حضور اکرم صلی اللہ علیہ وسلم کے گھٹنے پر رکھ کر سوار ہو جاتیں ۔ اس طرح ہم چلتے رہے اور جب مدینہ منورہ کے قریب پہنچے تو آپ صلی اللہ علیہ وسلم نے احد پہاڑ کو دیکھا اور فرمایا یہ پہاڑ ہم سے محبت رکھتا ہے اور ہم اس سے محبت رکھتے ہیں ، اس کے بعد آپ صلی اللہ علیہ وسلم نے مدینہ کی طرف نگاہ اٹھائی اور فرمایا اے اللہ ! میں اس کے دونوں پتھریلے میدانوں کے درمیان کے خطے کو حرمت والا قرار دیتا ہوں جس طرح حضرت ابراہیم علیہ السلام نے مکہ معظمہ کو حرمت والا قرار دیا تھا اے اللہ ! مدینہ کے لوگوں کو ان کی مد اور صاع میں برکت دیجئیے !",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے کہا ، ہم سے بعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے عمرو بن عمرو نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا يَعْقُوبُ، عَنْ عَمْرٍو، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لأَبِي طَلْحَةَ ‏\"‏ الْتَمِسْ غُلاَمًا مِنْ غِلْمَانِكُمْ يَخْدُمُنِي حَتَّى أَخْرُجَ إِلَى خَيْبَرَ ‏\"‏‏.‏ فَخَرَجَ بِي أَبُو طَلْحَةَ مُرْدِفِي، وَأَنَا غُلاَمٌ رَاهَقْتُ الْحُلُمَ، فَكُنْتُ أَخْدُمُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا نَزَلَ، فَكُنْتُ أَسْمَعُهُ كَثِيرًا يَقُولُ ‏\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ ‏\"‏‏.‏ ثُمَّ قَدِمْنَا خَيْبَرَ، فَلَمَّا فَتَحَ اللَّهُ عَلَيْهِ الْحِصْنَ ذُكِرَ لَهُ جَمَالُ صَفِيَّةَ بِنْتِ حُيَىِّ بْنِ أَخْطَبَ، وَقَدْ قُتِلَ زَوْجُهَا وَكَانَتْ عَرُوسًا، فَاصْطَفَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم لِنَفْسِهِ، فَخَرَجَ بِهَا حَتَّى بَلَغْنَا سَدَّ الصَّهْبَاءِ حَلَّتْ، فَبَنَى بِهَا، ثُمَّ صَنَعَ حَيْسًا فِي نِطَعٍ صَغِيرٍ، ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ آذِنْ مَنْ حَوْلَكَ ‏\"‏‏.‏ فَكَانَتْ تِلْكَ وَلِيمَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى صَفِيَّةَ‏.‏ ثُمَّ خَرَجْنَا إِلَى الْمَدِينَةِ قَالَ فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُحَوِّي لَهَا وَرَاءَهُ بِعَبَاءَةٍ، ثُمَّ يَجْلِسُ عِنْدَ بَعِيرِهِ فَيَضَعُ رُكْبَتَهُ، فَتَضَعُ صَفِيَّةُ رِجْلَهَا عَلَى رُكْبَتِهِ حَتَّى تَرْكَبَ، فَسِرْنَا حَتَّى إِذَا أَشْرَفْنَا عَلَى الْمَدِينَةِ نَظَرَ إِلَى أُحُدٍ فَقَالَ ‏\"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏‏.‏ ثُمَّ نَظَرَ إِلَى الْمَدِينَةِ فَقَالَ ‏\"‏ اللَّهُمَّ إِنِّي أُحَرِّمُ مَا بَيْنَ لاَبَتَيْهَا بِمِثْلِ مَا حَرَّمَ إِبْرَاهِيمُ مَكَّةَ، اللَّهُمَّ بَارِكْ لَهُمْ فِي مُدِّهِمْ وَصَاعِهِمْ ‏\"‏‏.‏",
                "headingArabic": "مَنْ غَزَا بِصَبِيٍّ لِلْخِدْمَةِ",
                "headingUrdu": "جو کوئی لڑکا نوکر کے ساتھ مقدس جنگ کے لیے روانہ ہو۔",
                "headingEnglish": "Whoever sets off for a holy battle accompanied by a boy-servant",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2767,
                "hadithNumber": "2894, 2895",
                "englishNarrator": "Narrated Um Haram رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) one day took a midday nap in her house. Then he woke up smiling. Um Haram asked, \"O Allah's Messenger (ﷺ)! What makes you smile?\" He replied \"I was astonished to see (in my dream) some people amongst my followers on a sea-voyage looking like kings on the thrones.\" She said, \"O Allah's Messenger (ﷺ)! Invoke Allah to make me one of them.\" He replied, \"You are amongst them.\" He slept again and then woke up smiling and said the same as before twice or thrice. And she said, \"O Allah's Messenger (ﷺ)! Invoke Allah to make me one of them.\" And he said, \"You are amongst the first batch.\" 'Ubada bin As-Samit رضی اللہ عنہ married her (i.e. Um Haram) and then he took her for Jihad. When she returned, an animal was presented to her to ride, but she fell down and her neck was broken. (And she died).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک دن ان کے گھر تشریف لا کر قیلولہ فرمایا تھا ۔ جب آپ بیدار ہوئے تو ہنس رہے تھے ۔ انہوں نے پوچھا یا رسول اللہ ! کس بات پر آپ ہنس رہے ہیں ؟ فرمایا مجھے اپنی امت میں ایک ایسی قوم کو ( خواب میں دیکھ کر ) خوشی ہوئی جو سمندر میں ( غزوہ کے لیے ) اس طرح جا رہے تھے جیسے بادشاہ تخت پر بیٹھے ہوں ۔ میں نے عرض کیا یا رسول اللہ ! اللہ سے دعا کیجئے کہ مجھے بھی وہ ان میں سے کر دے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم بھی ان میں سے ہو ۔ اس کے بعد پھر آپ سو گئے اور جب بیدار ہوئے تو پھر ہنس رہے تھے ۔ آپ نے اس مرتبہ بھی وہی بات بتائی ۔ ایسا دو یا تین دفعہ ہوا ۔ میں نے کہا اے اللہ کے رسول ! اللہ تعالیٰ سے دعا کیجئے کہ مجھے بھی ان میں سے کر دے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم سب سے پہلے لشکر کے ساتھ ہو گی وہ حضرت عبادہ بن صامت رضی اللہ عنہ کے نکاح میں تھیں اور وہ ان کو ( اسلام کے سب سے پہلے بحری بیڑے کے ساتھ ) غزوہ میں لے گئے ، واپسی میں سوار ہونے کے لیے اپنی سواری سے قریب ہوئیں ( سوار ہوتے ہوئے یا سوار ہونے کے بعد ) گر پڑیں جس سے آپ کی گردن ٹوٹ گئی اور شہادت کی موت پائی۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے یحییٰ بن سعید انصاری نے ، ان سے محمد بن یحییٰ بن حبان نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا اور ان سے ام حرام رضی اللہ عنہا نے یہ واقعہ بیان کیا تھا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ حَدَّثَتْنِي أُمُّ حَرَامٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ يَوْمًا فِي بَيْتِهَا، فَاسْتَيْقَظَ وَهْوَ يَضْحَكُ، قَالَتْ يَا رَسُولَ اللَّهِ، مَا يُضْحِكُكَ قَالَ ‏\"‏ عَجِبْتُ مِنْ قَوْمٍ مِنْ أُمَّتِي يَرْكَبُونَ الْبَحْرَ، كَالْمُلُوكِ عَلَى الأَسِرَّةِ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ، ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ فَقَالَ ‏\"‏ أَنْتِ مَعَهُمْ ‏\"‏‏.‏ ثُمَّ نَامَ، فَاسْتَيْقَظَ وَهْوَ يَضْحَكُ فَقَالَ مِثْلَ ذَلِكَ مَرَّتَيْنِ أَوْ ثَلاَثًا‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ، ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ فَيَقُولُ ‏\"‏ أَنْتِ مِنَ الأَوَّلِينَ ‏\"‏ فَتَزَوَّجَ بِهَا عُبَادَةُ بْنُ الصَّامِتِ، فَخَرَجَ بِهَا إِلَى الْغَزْوِ، فَلَمَّا رَجَعَتْ قُرِّبَتْ دَابَّةٌ لِتَرْكَبَهَا، فَوَقَعَتْ فَانْدَقَّتْ عُنُقُهَا‏.‏",
                "headingArabic": "رُكُوبِ الْبَحْرِ",
                "headingUrdu": "سمندری سفر پر جانے کے لیے",
                "headingEnglish": "To go on a seavoyage",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2768,
                "hadithNumber": "2896",
                "englishNarrator": "Narrated Mus`ab bin Sa`d:",
                "hadithEnglish": "Once Sa`d (bin Abi Waqqas رضی اللہ عنہ ) thought that he was superior to those who were below him in rank. On that the Prophet (ﷺ) said, \"You gain no victory or livelihood except through (the blessings and invocations of) the poor amongst you.\"",
                "hadithUrdu": "سعد بن ابی وقاص رضی اللہ عنہ کا خیال تھا کہ انہیں دوسرے بہت سے صحابہ پر ( اپنی مالداری اور بہادری کی وجہ سے ) فضیلت حاصل ہے تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ صرف اپنے کمزور معذور لوگوں کی دعاؤں کے نتیجہ میں اللہ کی طرف سے مدد پہنچائے جاتے ہو اور ان ہی کی دعاؤں سے رزق دئیے جاتے ہیں ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے محمد بن طلحہ نے بیان کیا ، ان سے مصعب ابن سعد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، عَنْ طَلْحَةَ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، قَالَ رَأَى سَعْدٌ ـ رضى الله عنه ـ أَنَّ لَهُ فَضْلاً عَلَى مَنْ دُونَهُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ هَلْ تُنْصَرُونَ وَتُرْزَقُونَ إِلاَّ بِضُعَفَائِكُمْ ‏\"‏‏.‏",
                "headingArabic": "مَنِ اسْتَعَانَ بِالضُّعَفَاءِ وَالصَّالِحِينَ فِي الْحَرْبِ",
                "headingUrdu": "جنگ میں غریب اور متقی لوگوں کی مدد",
                "headingEnglish": "The help of poor and pious men in war",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2769,
                "hadithNumber": "2897",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A time will come when groups of people will go for Jihad and it will be asked, 'Is there anyone amongst you who has enjoyed the company of the Prophet?' The answer will be, 'Yes.' Then they will be given victory (by Allah) (because of him). Then a time will come when it will be asked. 'Is there anyone amongst you who has enjoyed the company of the companions of the Prophet?' It will be said, 'Yes,' and they will be given victory (by Allah). Then a time will come when it will be said. 'Is there anyone amongst you who has enjoyed the company of the companions of the companions of the Prophet?' It will be said, 'Yes,' and they will be given victory (by Allah).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ایک زمانہ ایسا آئے گا کہ مسلمانوں کی فوج کی فوج جہاں پر ہوں گی جن میں پوچھا جائے گا کہ کیا فوج میں کوئی ایسے بزرگ بھی ہیں جنہوں نے نبی کریم صلی اللہ علیہ وسلم کی صحبت اٹھائی ہو ، کہا جائے گا کہ ہاں تو ان سے فتح کی دعا کرائی جائے گی ۔ پھر ایک ایسا زمانہ آئے گا اس وقت اس کی تلاش ہو گی کہ کوئی ایسے بزرگ مل جائیں جنہوں نے نبی کریم صلی اللہ علیہ وسلم کے صحابہ کی صحبت اٹھائی ہو ، ( یعنی تابعی ) ایسے بھی بزرگ مل جائیں گے اور ان سے فتح کی دعا کرائی جائے گی اس کے بعد ایک ایسا زمانہ آئے گا کہ پوچھا جائے گا کہ کیا تم میں کوئی ایسے بزرگ ہیں جنہوں نے نبی کریم صلی اللہ علیہ وسلم کے صحابہ کے شاگردوں کی صحبت اٹھائی ہو کہا جائے گا کہ ہاں اور ان سے فتح کی دعا کرائی جائے گی ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے سفیان بن عینیہ نے بیان کیا ، ان سے عمرو بن دینار نے ، انہوں نے جابر رضی اللہ عنہ سے سنا ، آپ ابو سعید خدری رضی اللہ عنہ سے بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ جَابِرًا، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنهم ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَأْتِي زَمَانٌ يَغْزُو فِئَامٌ مِنَ النَّاسِ، فَيُقَالُ فِيكُمْ مَنْ صَحِبَ النَّبِيَّ صلى الله عليه وسلم فَيُقَالُ نَعَمْ‏.‏ فَيُفْتَحُ عَلَيْهِ، ثُمَّ يَأْتِي زَمَانٌ فَيُقَالُ فِيكُمْ مَنْ صَحِبَ أَصْحَابَ النَّبِيِّ صلى الله عليه وسلم فَيُقَالُ نَعَمْ‏.‏ فَيُفْتَحُ، ثُمَّ يَأْتِي زَمَانٌ فَيُقَالُ فِيكُمْ مَنْ صَحِبَ صَاحِبَ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فَيُقَالُ نَعَمْ‏.‏ فَيُفْتَحُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2770,
                "hadithNumber": "2898",
                "englishNarrator": "Narrated Sahl bin Sa`d As-Sa`idi رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) and the pagans faced each other and started fighting. When Allah's Messenger (ﷺ) returned to his camp and when the pagans returned to their camp, somebody talked about a man amongst the companions of Allah's Messenger (ﷺ) who would follow and kill with his sword any pagan going alone. He said, \"Nobody did his job (i.e. fighting) so properly today as that man.\" Allah's Messenger (ﷺ) said, \"Indeed, he is amongst the people of the (Hell) Fire.\" A man amongst the people said, \"I shall accompany him (to watch what he does)\" Thus he accompanied him, and wherever he stood, he would stand with him, and wherever he ran, he would run with him. Then the (brave) man got wounded seriously and he decided to bring about his death quickly. He planted the blade of the sword in the ground directing its sharp end towards his chest between his two breasts. Then he leaned on the sword and killed himself. The other man came to Allah's Messenger (ﷺ) and said, \"I testify that you are Allah's Messenger (ﷺ).\" The Prophet (ﷺ) asked, \"What has happened?\" He replied, \"(It is about) the man whom you had described as one of the people of the (Hell) Fire. The people were greatly surprised at what you said, and I said, 'I will find out his reality for you.' So, I came out seeking him. He got severely wounded, and hastened to die by slanting the blade of his sword in the ground directing its sharp end towards his chest between his two breasts. Then he eased on his sword and killed himself.\" when Allah's Messenger (ﷺ) said, \"A man may seem to the people as if he were practising the deeds of the people of Paradise while in fact he is from the people of the Hell) Fire, another may seem to the people as if he were practicing the deeds of the people of Hell (Fire), while in fact he is from the people of Paradise.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی ( اپنے اصحاب کے ہمراہ احد یا خیبر کی لڑائی میں ) مشرکین سے مڈبھیڑ ہوئی اور جنگ چھڑ گئی ، پھر جب آپ صلی اللہ علیہ وسلم ( اس دن لڑائی سے فارغ ہو کر ) اپنے پڑاو کی طرف واپس ہوئے اور مشرکین اپنے پڑاو کی طرف تو آپ صلی اللہ علیہ وسلم کی فوج کے ساتھ ایک شخص تھا ، لڑائی لڑنے میں ان کا یہ حال تھا کہ مشرکین کا کوئی آدمی بھی اگر کسی طرف نظر آ جاتا تو اس کا پیچھا کر کے وہ شخص اپنی تلوار سے اسے قتل کر دیتا ۔ سہل رضی اللہ عنہ نے اس کے متعلق کہا کہ آج جتنی سرگرمی کے ساتھ فلاں شخص لڑا ہے ، ہم میں سے کوئی بھی شخص اس طرح نہ لڑ سکا ۔ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ لیکن وہ شخص دوزخی ہے ۔ مسلمانوں میں سے ایک شخص نے ( اپنے دل میں کہا اچھا میں اس کا پیچھا کروں گا ( دیکھوں ) حضور صلی اللہ علیہ وسلم نے اسے کیوں دوزخی فرمایا ہے ) بیان کیا کہ وہ اس کے ساتھ ساتھ دوسرے دن لڑائی میں موجود رہا ، جب کبھی وہ کھڑا ہو جاتا تو یہ بھی کھڑا ہو جاتا اور جب وہ تیز چلتا تو یہ بھی اس کے ساتھ تیز چلتا ۔ بیان کیا کہ آخر وہ شخص زخمی ہو گیا زخم بڑا گہرا تھا ۔ اس لیے اس نے چاہا کہ موت جلدی آ جائے اور اپنی تلوار کا پھل زمین پر رکھ کر اس کی دھار کو سینے کے مقابلہ میں کر لیا اور تلوار پر گر کر اپنی جان دے دی ۔ اب وہ صاحب رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہنے لگے کہ میں گواہی دیتا ہوں کہ آپ صلی اللہ علیہ وسلم اللہ کے سچے رسول ہیں ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا بات ہوئی ؟ انہوں نے بیان کیا کہ وہی شخص جس کے متعلق آپ نے فرمایا تھا کہ وہ دوزخی ہے ، صحابہ کرام رضی اللہ عنہم پر یہ آپ کا فرمان بڑا شاق گزرا تھا ۔ میں نے ان سے کہا کہ تم سب لوگوں کی طرف سے میں اس کے متعلق تحقیق کرتا ہوں ۔ چنانچہ میں اس کے پیچھے ہو لیا ۔ اس کے بعد وہ شخص سخت زخمی ہوا اور چاہا کہ جلدی موت آ جائے ۔ اٍس لیے اس نے اپنی تلوار کا پھل زمین پر رکھ کر اس کی دھار کو اپنے سینے کے مقابل کر لیا اور اس پر گر کر خود جان دے دی ۔ اس وقت آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک آدمی زندگی بھر بظاہر اہل جنت کے سے کام کرتا ہے حالانکہ وہ اہل دوزخ میں سے ہوتا ہے اور ایک آدمی بظاہر اہل دوزخ کے کام کرتا ہے حالانکہ وہ اہل جنت میں سے ہوتا ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے ابوحازم نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ ـ رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم الْتَقَى هُوَ وَالْمُشْرِكُونَ فَاقْتَتَلُوا، فَلَمَّا مَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى عَسْكَرِهِ، وَمَالَ الآخَرُونَ إِلَى عَسْكَرِهِمْ، وَفِي أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم رَجُلٌ لاَ يَدَعُ لَهُمْ شَاذَّةً وَلاَ فَاذَّةً إِلاَّ اتَّبَعَهَا يَضْرِبُهَا بِسَيْفِهِ، فَقَالَ مَا أَجْزَأَ مِنَّا الْيَوْمَ أَحَدٌ كَمَا أَجْزَأَ فُلاَنٌ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَا إِنَّهُ مِنْ أَهْلِ النَّارِ ‏\"‏‏.‏ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ أَنَا صَاحِبُهُ‏.‏ قَالَ فَخَرَجَ مَعَهُ كُلَّمَا وَقَفَ وَقَفَ مَعَهُ، وَإِذَا أَسْرَعَ أَسْرَعَ مَعَهُ قَالَ فَجُرِحَ الرَّجُلُ جُرْحًا شَدِيدًا، فَاسْتَعْجَلَ الْمَوْتَ، فَوَضَعَ نَصْلَ سَيْفِهِ بِالأَرْضِ وَذُبَابَهُ بَيْنَ ثَدْيَيْهِ، ثُمَّ تَحَامَلَ عَلَى سَيْفِهِ، فَقَتَلَ نَفْسَهُ، فَخَرَجَ الرَّجُلُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ‏.‏ قَالَ ‏\"‏ وَمَا ذَاكَ ‏\"‏‏.‏ قَالَ الرَّجُلُ الَّذِي ذَكَرْتَ آنِفًا أَنَّهُ مِنْ أَهْلِ النَّارِ، فَأَعْظَمَ النَّاسُ ذَلِكَ‏.‏ فَقُلْتُ أَنَا لَكُمْ بِهِ‏.‏ فَخَرَجْتُ فِي طَلَبِهِ، ثُمَّ جُرِحَ جُرْحًا شَدِيدًا، فَاسْتَعْجَلَ الْمَوْتَ، فَوَضَعَ نَصْلَ سَيْفِهِ فِي الأَرْضِ وَذُبَابَهُ بَيْنَ ثَدْيَيْهِ، ثُمَّ تَحَامَلَ عَلَيْهِ، فَقَتَلَ نَفْسَهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ ‏\"‏ إِنَّ الرَّجُلَ لَيَعْمَلُ عَمَلَ أَهْلِ الْجَنَّةِ فِيمَا يَبْدُو لِلنَّاسِ، وَهْوَ مِنْ أَهْلِ النَّارِ، وَإِنَّ الرَّجُلَ لَيَعْمَلُ عَمَلَ أَهْلِ النَّارِ فِيمَا يَبْدُو لِلنَّاسِ، وَهْوَ مِنْ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏",
                "headingArabic": "لاَ يَقُولُ فُلاَنٌ شَهِيدٌ",
                "headingUrdu": "یہ مت کہو کہ فلاں شہید ہے۔",
                "headingEnglish": "Do not say that so-and-so is a martyr",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2771,
                "hadithNumber": "2899",
                "englishNarrator": "Narrated Salama bin Al-Akwa` رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) passed by some people of the tribe of Bani Aslam who were practicing archery. The Prophet said, \"O Bani Isma`il ! Practice archery as your father Isma`il was a great archer. Keep on throwing arrows and I am with Bani so-and-so.\" So one of the parties ceased throwing. Allah's Apostle said, \"Why do you not throw?\" They replied, \"How should we throw while you are with them (i.e. on their side)?\" On that the Prophet (ﷺ) said, \"Throw, and I am with all of you.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کا قبیلہ بنو اسلم کے چند لوگوں پر گزر ہوا جو تیراندازی کی مشق کر رہے تھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا اسماعیل علیہ السلام کے بیٹو ! تیراندازی کرو کہ تمہارے بزرگ دادا اسماعیل علیہ السلام بھی تیرانداز تھے ۔ ہاں ! تیراندازی کرو ، میں بنی فلاں ( ابن الاورع رضی اللہ عنہ ) کی طرف ہوں ۔ بیان کیا ، جب آپ صلی اللہ علیہ وسلم ایک فریق کے ساتھ ہو گئے تو ( مقابلے میں حصہ لینے والے ) دوسرے ایک فریق نے ہاتھ روک لیے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کیا بات پیش آئی ، تم لوگوں نے تیراندازی بند کیوں کر دی ؟ دوسرے فریق نے عرض کیا جب آپ صلی اللہ علیہ وسلم ایک فریق کے ساتھ ہو گئے تو بھلا ہم کس طرح مقابلہ کر سکتے ہیں ۔ اس پر آنحضور صلی اللہ علیہ وسلم نے فرمایا اچھا تیراندازی جاری رکھو میں تم سب کے ساتھ ہوں ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے حاتم بن اسماعیل نے بیان کیا ، ان سے یزید بن ابی عبید نے بیان کیا ، انہوں نے سلمہ بن اکوع رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، قَالَ سَمِعْتُ سَلَمَةَ بْنَ الأَكْوَعِ ـ رضى الله عنه ـ قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم عَلَى نَفَرٍ مِنْ أَسْلَمَ يَنْتَضِلُونَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ارْمُوا بَنِي إِسْمَاعِيلَ، فَإِنَّ أَبَاكُمْ كَانَ رَامِيًا ارْمُوا وَأَنَا مَعَ بَنِي فُلاَنٍ ‏\"‏‏.‏ قَالَ فَأَمْسَكَ أَحَدُ الْفَرِيقَيْنِ بِأَيْدِيهِمْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا لَكُمْ لاَ تَرْمُونَ ‏\"‏‏.‏ قَالُوا كَيْفَ نَرْمِي وَأَنْتَ مَعَهُمْ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ارْمُوا فَأَنَا مَعَكُمْ كُلِّكُمْ ‏\"‏‏.‏",
                "headingArabic": "التَّحْرِيضِ عَلَى الرَّمْىِ",
                "headingUrdu": "تیر اندازی کی نصیحت (یعنی تیر پھینکنا)",
                "headingEnglish": "Exhortation to archery (i.e., arrow throwing)",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2772,
                "hadithNumber": "2900",
                "englishNarrator": "Narrated Abu Usaid:",
                "hadithEnglish": "On the day (of the battle) of Badr when we stood in rows against (the army of) Quraish and they stood in rows against us, the Prophet (ﷺ) said, \"When they do come near you, throw arrows at them.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے بدر کی لڑائی کے موقع پر جب ہم قریش کے مقابلہ میں صف باندھے ہوئے کھڑے ہو گئے تھے اور وہ ہمارے مقابلہ میں تیار تھے ، فرمایا کہ اگر ( حملہ کرتے ہوئے ) قریش تمہارے قریب آ جائیں تو تم لوگ تیراندازی شروع کر دینا تاکہ وہ پیچھے ہٹنے پر مجبور ہوں ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن غسیل نے ، ان سے حمزہ بن ابی اسید نے اور ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْغَسِيلِ، عَنْ حَمْزَةَ بْنِ أَبِي أُسَيْدٍ، عَنْ أَبِيهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ بَدْرٍ حِينَ صَفَفْنَا لِقُرَيْشٍ وَصَفُّوا لَنَا ‏ \"‏ إِذَا أَكْثَبُوكُمْ فَعَلَيْكُمْ بِالنَّبْلِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2773,
                "hadithNumber": "2901",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "While some Ethiopians were playing in the presence of the Prophet, `Umar came in, picked up a stone and hit them with it. On that the Prophet (ﷺ) said, \"O `Umar! Allow them (to play).\" Ma`mar (the subnarrator) added that they were playing in the Mosque.",
                "hadithUrdu": "حبشہ کے کچھ لوگ نبی کریم صلی اللہ علیہ وسلم کے سامنے حراب ( چھوٹے نیزے ) کا کھیل دکھلا رہے تھے کہ عمر رضی اللہ عنہ آ گئے اور کنکریاں اٹھا کر انہیں ان سے مارا ۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا عمر رضی اللہ عنہ انہیں کھیل دکھانے دو ۔ علی بن مدینی نے یہ بیان زیادہ کیا کہ ہم سے عبدالرزاق نے بیان کیا ، انہیں معمر نے خبر دی کہ مسجد میں ( یہ صحابہ رضی اللہ عنہم اپنے کھیل کا مظاہرہ کر رہے تھے ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو ہشام نے خبر دی ، انہیں معمر نے ، انہیں زہری نے ، انہیں ابن المسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَيْنَا الْحَبَشَةُ يَلْعَبُونَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم بِحِرَابِهِمْ دَخَلَ عُمَرُ، فَأَهْوَى إِلَى الْحَصَى فَحَصَبَهُمْ بِهَا‏.‏ فَقَالَ ‏ \"‏ دَعْهُمْ يَا عُمَرُ ‏\"‏‏.‏ وَزَادَ عَلِيٌّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ فِي الْمَسْجِدِ‏.‏",
                "headingArabic": "اللَّهْوِ بِالْحِرَابِ وَنَحْوِهَا",
                "headingUrdu": "نیزوں اور اسی طرح کے دوسرے ہتھیاروں سے کھیلنا",
                "headingEnglish": "To play with spears and other similar arms",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2774,
                "hadithNumber": "2902",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Abu Talha رضی اللہ عنہ  and the Prophet (ﷺ) used to shield themselves with one shield. Abu Talha رضی اللہ عنہ was a good archer, and when he threw (his arrows) the Prophet (ﷺ) would look at the target of his arrows.",
                "hadithUrdu": "ابوطلحہ رضی اللہ عنہ اپنی اور نبی کریم صلی اللہ علیہ وسلم کی آڑ ایک ہی ڈھال سے کر رہے تھے اور ابوطلحہ رضی اللہ عنہ بڑے اچھے تیرانداز تھے ۔ جب وہ تیر مارتے تو نبی اکرم صلی اللہ علیہ وسلم سر اٹھا کر دیکھتے کہ تیر کہاں جا کر گرا ہے ۔",
                "urduNarrator": "ہم سے احمد بن محمد نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو اوزاعی نے خبر دی ، انہوں نے کہا کہ ہ میں اسحاق بن عبداللہ بن ابی طلحہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا الأَوْزَاعِيُّ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كَانَ أَبُو طَلْحَةَ يَتَتَرَّسُ مَعَ النَّبِيِّ صلى الله عليه وسلم بِتُرْسٍ وَاحِدٍ، وَكَانَ أَبُو طَلْحَةَ حَسَنَ الرَّمْىِ، فَكَانَ إِذَا رَمَى تَشَرَّفَ النَّبِيُّ صلى الله عليه وسلم فَيَنْظُرُ إِلَى مَوْضِعِ نَبْلِهِ‏.‏",
                "headingArabic": "الْمِجَنِّ وَمَنْ يَتَتَرَّسُ بِتُرْسِ صَاحِبِهِ",
                "headingUrdu": "ڈھال، اور اپنے ساتھی کی ڈھال سے خود کو بچانا",
                "headingEnglish": "The shield, and shielding oneself with the shield of his companion",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2775,
                "hadithNumber": "2903",
                "englishNarrator": "Narrated Sahl رضی اللہ عنہ :",
                "hadithEnglish": "When the helmet of the Prophet (ﷺ) was smashed on his head and blood covered his face and one of his front teeth got broken, `Ali brought the water in his shield and Fatima the Prophet's daughter) washed him. But when she saw that the bleeding increased more by the water, she took a mat, burnt it, and placed the ashes on the wound of the Prophet (ﷺ) and so the blood stopped oozing out.",
                "hadithUrdu": "جب احد کی لڑائی میں آنحضرت صلی اللہ علیہ وسلم کا خود آپ صلی اللہ علیہ وسلم کے سرمبارک پر توڑا گیا اور چہرہ مبارک خون آلود ہو گیا اور آپ صلی اللہ علیہ وسلم کے آگے کے دانت شہید ہو گئے تو علی رضی اللہ عنہ ڈھال میں بھربھر کر پانی باربار لا رہے تھے اور حضرت فاطمہ رضی اللہ عنہا زخم کو دھو رہی تھیں ۔ جب انہوں نے دیکھا کہ خون پانی سے اور زیادہ نکل رہا ہے تو انہوں نے ایک چٹائی جلائی اور اس کی راکھ آپ صلی اللہ علیہ وسلم کے زخموں پر لگا دیا ، جس سے خون آنا بند ہو گیا ۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ، کہا ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے ابوحازم نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلٍ، قَالَ لَمَّا كُسِرَتْ بَيْضَةُ النَّبِيِّ صلى الله عليه وسلم عَلَى رَأْسِهِ وَأُدْمِيَ وَجْهُهُ، وَكُسِرَتْ رَبَاعِيَتُهُ، وَكَانَ عَلِيٌّ يَخْتَلِفُ بِالْمَاءِ فِي الْمِجَنِّ، وَكَانَتْ فَاطِمَةُ تَغْسِلُهُ، فَلَمَّا رَأَتِ الدَّمَ يَزِيدُ عَلَى الْمَاءِ كَثْرَةً عَمَدَتْ إِلَى حَصِيرٍ، فَأَحْرَقَتْهَا وَأَلْصَقَتْهَا عَلَى جُرْحِهِ، فَرَقَأَ الدَّمُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2776,
                "hadithNumber": "2904",
                "englishNarrator": "Narrated `Umar رضی اللہ عنہ :",
                "hadithEnglish": "The properties of Bani An-Nadir which Allah had transferred to His Apostle as Fai Booty were not gained by the Muslims with their horses and camels. The properties therefore, belonged especially to Allah's Messenger (ﷺ) who used to give his family their yearly expenditure and spend what remained thereof on arms and horses to be used in Allah's Cause.",
                "hadithUrdu": "بنونضیر کے باغات وغیرہ ان اموال میں سے تھے جن کو اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کو بغیر لڑے دے دیا تھا ۔ مسلمانوں نے ان کے حاصل کرنے کے لیے گھوڑے اور اونٹ نہیں دوڑائے تو یہ اموال خاص طور سے رسول اللہ صلی اللہ علیہ وسلم ہی کے تھے جن میں سے آپ صلی اللہ علیہ وسلم اپنی ازواج مطہرات کو سالانہ نفقہ کے طور پر بھی دے دیتے تھے اور باقی ہتھیار اور گھوڑوں پر خرچ کرتے تھے تاکہ اللہ کے راستے میں ( جہاد کے لیے ) ہر وقت تیاری رہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے زہری نے ، ان سے مالک بن اوس بن حدثان نے اور ان سے عمر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنِ الزُّهْرِيِّ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، عَنْ عُمَرَ ـ رضى الله عنه ـ قَالَ كَانَتْ أَمْوَالُ بَنِي النَّضِيرِ مِمَّا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ صلى الله عليه وسلم مِمَّا لَمْ يُوجِفِ الْمُسْلِمُونَ عَلَيْهِ بِخَيْلٍ وَلاَ رِكَابٍ، فَكَانَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم خَاصَّةً، وَكَانَ يُنْفِقُ عَلَى أَهْلِهِ نَفَقَةَ سَنَتِهِ، ثُمَّ يَجْعَلُ مَا بَقِيَ فِي السِّلاَحِ وَالْكُرَاعِ، عُدَّةً فِي سَبِيلِ اللَّهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2777,
                "hadithNumber": "2905",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "I never saw the Prophet (ﷺ) saying, \"Let my parents sacrifice their lives for you,\" to any man after Sa`d رضی اللہ عنہ . I heard him saying (to him), \"Throw (the arrows)! Let my parents sacrifice their lives for you.\"",
                "hadithUrdu": "سعد بن ابی وقاص رضی اللہ عنہ کے بعد میں نے کسی کے متعلق نبی کریم صلی اللہ علیہ وسلم سے نہیں سنا کہ آپ نے خود کو ان پر صدقے کیا ہو ۔ میں نے سنا کہ آپ صلی اللہ علیہ وسلم فرما رہے تھے ۔ تیر برساؤ ( سعد ) تم پر میرے ماں باپ قربان ہوں ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے سفیان بن عیینہ نے بیان کیا ، کہا مجھ سے سعد بن ابراہیم نے بیان کیا ، ان سے عبداللہ بن شداد نے اور ان سے علی رضی اللہ عنہ نے ( دوسری سند ) ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے سعد بن ابراہیم نے بیان کیا ، کہا مجھ سے عبداللہ بن شداد نے بیان کیا ، کہا کہ میں نے حضرت علی  رضی اللہ عنہ  سے سنا ، آپ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي سَعْدُ بْنُ إِبْرَاهِيمَ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، عَنْ عَلِيٍّ، حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ شَدَّادٍ، قَالَ سَمِعْتُ عَلِيًّا ـ رضى الله عنه ـ يَقُولُ مَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يُفَدِّي رَجُلاً بَعْدَ سَعْدٍ، سَمِعْتُهُ يَقُولُ ‏ \"‏ ارْمِ فِدَاكَ أَبِي وَأُمِّي ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 2751,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=110",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=108",
                "label": "108",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=109",
                "label": "109",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=110",
                "label": "110",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=111",
                "label": "111",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=112",
                "label": "112",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=113",
                "label": "113",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=114",
                "label": "114",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=112",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=112",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=110",
        "to": 2775,
        "total": 40465
    }
}