{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 239,
        "data": [
            {
                "id": 5953,
                "hadithNumber": "6212",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "There was a state of fear in Medina. Allah's Messenger (ﷺ) rode a horse belonging to Abu Talha (in order to see the matter). The Prophet (ﷺ) said, \"We could not see anything, and we found that horse like a sea (fast in speed).",
                "hadithUrdu": "مدینہ منورہ پر ( ایک رات نامعلوم آواز کی وجہ سے ) ڈرطاری ہو گیا ۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم ابوطلحہ کے ایک گھوڑے پر سوار ہوئے ۔ پھر ( واپس آ کر ) فرمایا ہمیں تو کوئی ( خوف کی ) چیز نظر نہ آئی ۔ البتہ یہ گھوڑا تو گویا دریا تھا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے شعبہ نے ، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ بِالْمَدِينَةِ فَزَعٌ فَرَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرَسًا لأَبِي طَلْحَةَ فَقَالَ ‏ \"‏ مَا رَأَيْنَا مِنْ شَىْءٍ، وَإِنْ وَجَدْنَاهُ لَبَحْرًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5954,
                "hadithNumber": "6213",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Some people asked Allah's Messenger (ﷺ) about the fore-tellers. Allah's Messenger (ﷺ) said to them, \"They are nothing (i.e., liars).\" The people said, 'O Allah's Messenger (ﷺ) ! Sometimes they tell something which comes out to be true.\" Allah's Messenger (ﷺ) said, \"That word which comes to be true is what a jinx snatches away by stealing and then pours it in the ear of his fore-teller with a sound similar to the cackle of a hen, and then they add to it one-hundred lies.\"",
                "hadithUrdu": "کچھ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے کاہنوں کے بارے میں پوچھا ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ ان کی ( پیشین گوئیوں کی ) کوئی حیثیت نہیں ۔ صحابہ نے عرض کیا یا رسول اللہ ! لیکن وہ بعض اوقات ایسی باتیں کرتے ہیں جو صحیح ثابت ہوتی ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ بات سچی بات ہوتی ہے جسے جن فرشتوں سے سن کر اڑا لیتا ہے اور پھر اسے اپنے ولی ( کاہن ) کے کان میں مرغ کی آواز کی طرح ڈالتا ہے ۔ اس کے بعد کاہن اس ( ایک سچی بات میں ) سو سے زیادہ جھوٹ ملا دیتے ہیں ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو مخلد بن یزید نے خبر دی ، کہا ہم کو ابن جریج نے خبر دی کہ ابن شہاب نے بیان کیا کہ مجھ کو یحییٰ بن عروہ نے خبر دی ، انہوں نے عروہ سے سنا ، کہا کہ عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا مَخْلَدُ بْنُ يَزِيدَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي يَحْيَى بْنُ عُرْوَةَ، أَنَّهُ سَمِعَ عُرْوَةَ، يَقُولُ قَالَتْ عَائِشَةُ سَأَلَ أُنَاسٌ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْكُهَّانِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَيْسُوا بِشَىْءٍ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ فَإِنَّهُمْ يُحَدِّثُونَ أَحْيَانًا بِالشَّىْءِ يَكُونُ حَقًّا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تِلْكَ الْكَلِمَةُ مِنَ الْحَقِّ يَخْطَفُهَا الْجِنِّيُّ، فَيَقُرُّهَا فِي أُذُنِ وَلِيِّهِ قَرَّ الدَّجَاجَةِ، فَيَخْلِطُونَ فِيهَا أَكْثَرَ مِنْ مِائَةِ كَذْبَةٍ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ الرَّجُلِ لِلشَّىْءِ لَيْسَ بِشَىْءٍ وَهْوَ يَنْوِي أَنَّهُ لَيْسَ بِحَقٍّ‏‏",
                "headingUrdu": "کسی شخص کی طرف سے کسی چیز کو 'کچھ نہیں' کے طور پر بیان کرنا جبکہ اس کا مطلب یہ ہے کہ یہ سچ نہیں ہے۔",
                "headingEnglish": "The description of something by a man as 'nothing' while he means that it is not true",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5955,
                "hadithNumber": "6214",
                "englishNarrator": "Narrated Jabir bin `Abdullah:",
                "hadithEnglish": "Allah's Messenger (ﷺ) saying. \"Then there was a pause in the revelation of the Divine Inspiration to me. Then while I was walking all of a sudden I heard a voice from the sky, and I raised my sight towards the sky and saw the same angel who had visited me in the cave of Hira,' sitting on a chair between the sky and the earth.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر میرے پاس وحی آنے کا سلسلہ بند ہو گیا ۔ ایک دن میں چل رہا تھا کہ میں نے آسمان کی طرف سے ایک آواز سنی ، میں نے آسمان کی طرف نظر اٹھائی تو میں نے پھر اس فرشتہ کو دیکھا جو میرے پاس غار حرا میں آیا تھا ۔ وہ آسمان و زمین کے درمیان کرسی پر بیٹھا ہوا تھا ۔",
                "urduNarrator": "ہم سے ابن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے کہ میں نے ابوسلمہ بن عبدالرحمٰن سے سنا ، وہ بیان کرتے تھے کہ مجھے جابر بن عبداللہ نے خبر دی ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے ،",
                "hadithArabic": "حَدَّثَنَا ابْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، يَقُولُ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ ثُمَّ فَتَرَ عَنِّي الْوَحْىُ، فَبَيْنَا أَنَا أَمْشِي سَمِعْتُ صَوْتًا مِنَ السَّمَاءِ، فَرَفَعْتُ بَصَرِي إِلَى السَّمَاءِ فَإِذَا الْمَلَكُ الَّذِي جَاءَنِي بِحِرَاءٍ قَاعِدٌ عَلَى كُرْسِيٍّ بَيْنَ السَّمَاءِ وَالأَرْضِ ‏\"‏‏.‏",
                "headingArabic": "رَفْعِ الْبَصَرِ إِلَى السَّمَاءِ",
                "headingUrdu": "نظر آسمان کی طرف اٹھانا رَفْعِ الْبَصَرِ إِلَى السَّمَاءِ",
                "headingEnglish": "To raise the sight towards the sky",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5956,
                "hadithNumber": "6215",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Once I stayed overnight at the house of Maimuna and the Prophet (ﷺ) was there with her. When it was the last third of the night, or some part of the night, the Prophet (ﷺ) got up looking towards the sky and recited: 'Verily! In the creation of the heavens and the earth, and in the alternation of Night and Day, there are indeed signs for men of u understanding.' (3.190)",
                "hadithUrdu": "میں نے ایک رات میمونہ ( خالہ ) کے گھر گزاری ، نبی کریم صلی اللہ علیہ وسلم بھی اس رات وہیں ٹھہرے ہوئے تھے ۔ جب رات کا آخری تہائی حصہ ہوا یا اس کا بعض حصہ رہ گیا تو آنحضرت صلی اللہ علیہ وسلم اٹھ بیٹھے اورآسمان کی طرف دیکھا پھر اس آیت کی تلاوت کی ۔ ” بلاشبہ آسمان کی اور زمین کی پیدائش میں اور دن رات کے بدلتے رہنے میں عقل والوں کے لئے نشانیاں ہیں ۔ “",
                "urduNarrator": "ہم سے ابن ابی مریم نے بیان کیا ، کہا ہم سے محمد بن جعفرنے بیان کیا ، کہا کہ مجھے شریک نے خبر دی ، انہیں کریب نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي شَرِيكٌ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ بِتُّ فِي بَيْتِ مَيْمُونَةَ وَالنَّبِيُّ صلى الله عليه وسلم عِنْدَهَا، فَلَمَّا كَانَ ثُلُثُ اللَّيْلِ الآخِرُ أَوْ بَعْضُهُ قَعَدَ فَنَظَرَ إِلَى السَّمَاءِ فَقَرَأَ ‏{‏إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ وَاخْتِلاَفِ اللَّيْلِ وَالنَّهَارِ لآيَاتٍ لأُولِي الأَلْبَابِ‏}‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5957,
                "hadithNumber": "6216",
                "englishNarrator": "Narrated Abu Musa:",
                "hadithEnglish": "He was in the company of the Prophet (ﷺ) in one of the gardens of Medina and in the hand of the Prophet there was a stick, and he was striking (slowly) the water and the mud with it. A man came (at the gate of the garden) and asked permission to enter. The Prophet (ﷺ) said, \"Open the gate for him and give him the glad tidings of entering Paradise. \"I went, and behold! It was Abu Bakr رضی اللہ عنہ . So I opened the gate for him and informed him of the glad tidings of entering Paradise. Then another man came and asked permission to enter. The Prophet (ﷺ) said, \"Open the gate for him and give him the glad tidings of entering Paradise.\" Behold! It was `Umar رضی اللہ عنہ . So I opened the gate for him and gave him the glad tidings of entering Paradise. Then another man came and asked permission to enter. The Prophet (ﷺ) was sitting in a leaning posture, so he sat up and said, \"Open the gate for him and give him the glad tidings of entering Paradise with a calamity which will befall him or which will take place.\" I went, and behold ! It was `Uthman رضی اللہ عنہ . So I opened the gate for him and gave him the glad tidings of entering Paradise and also informed him of what the Prophet (ﷺ) had said (about a calamity). `Uthman رضی اللہ عنہ said, \"Allah Alone Whose Help I seek (against that calamity).",
                "hadithUrdu": "وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ مدینہ کے باغوں میں سے ایک باغ میں تھے ۔ آنحضرت صلی اللہ علیہ وسلم کے ہاتھ میں ایک لکڑی تھی ، آپ اس کو پانی اور کیچڑ میں مار رہے تھے ۔ اس دوران میں ایک صاحب نے باغ کا دروازہ کھلوانا چاہا ۔ آنحضرت صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ اس کے لئے دروازہ کھول دے اور انہیں جنت کی خوشخبری سنا دے ۔ میں گیا تو وہاں حضرت ابوبکر رضی اللہ عنہ موجود تھے ، میں نے ان کے لئے دروازہ کھولا اور انہیں جنت کی خوشخبری سنائی پھر ایک اور صاحب نے دروازہ کھلوایا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ دروازہ کھول دے اور انہیں جنت کی خوشخبری سنا دے اس مرتبہ حضرت عمر رضی اللہ عنہ تھے ۔ میں نے ان کے لئے بھی دروازہ کھولا اور انہیں بھی جنت کی خوشخبری سنا دی ۔ پھر ایک تیسرے صاحب نے دروازہ کھلوایا ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت ٹیک لگائے ہوئے تھے اب سیدھے بیٹھ گئے ۔ پھر فرمایا دروازہ کھول دے اور جنت کی خوشخبری سنا دے ، ان آزمائشوں کے ساتھ جس سے ( دنیا میں ) انہیں دوچار ہونا پڑے گا ۔ میں گیا تو وہاں حضرت عثمان رضی اللہ عنہ تھے ۔ ان کے لیے بھی میں نے دروازہ کھولا اور انہیں جنت کی خوشخبری سنائی اور وہ بات بھی بتادی جو آنحضرت صلی اللہ علیہ وسلم نے فرمائی تھی ۔ عثمان رضی اللہ عنہ نے کہا خیر اللہ مددگار ہے ۔",
                "urduNarrator": "ہم سے مسدد نے کہا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے عثمان بن غیاث نے ، کہا ہم سے ابوعثمان نہدی نے بیان کیا اور ان سے ابوموسیٰ اشعری نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُثْمَانَ بْنِ غِيَاثٍ، حَدَّثَنَا أَبُو عُثْمَانَ، عَنْ أَبِي مُوسَى، أَنَّهُ كَانَ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي حَائِطٍ مِنْ حِيطَانِ الْمَدِينَةِ، وَفِي يَدِ النَّبِيِّ صلى الله عليه وسلم عُودٌ يَضْرِبُ بِهِ بَيْنَ الْمَاءِ وَالطِّينِ، فَجَاءَ رَجُلٌ يَسْتَفْتِحُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ افْتَحْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَذَهَبْتُ فَإِذَا أَبُو بَكْرٍ، فَفَتَحْتُ لَهُ وَبَشَّرْتُهُ بِالْجَنَّةِ، ثُمَّ اسْتَفْتَحَ رَجُلٌ آخَرُ فَقَالَ ‏\"‏ افْتَحْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَإِذَا عُمَرُ، فَفَتَحْتُ لَهُ وَبَشَّرْتُهُ بِالْجَنَّةِ، ثُمَّ اسْتَفْتَحَ رَجُلٌ آخَرُ، وَكَانَ مُتَّكِئًا فَجَلَسَ فَقَالَ ‏\"‏ افْتَحْ ‏{‏لَهُ‏}‏ وَبَشِّرْهُ بِالْجَنَّةِ، عَلَى بَلْوَى تُصِيبُهُ أَوْ تَكُونُ ‏\"‏‏.‏ فَذَهَبْتُ فَإِذَا عُثْمَانُ، فَفَتَحْتُ لَهُ، وَبَشَّرْتُهُ بِالْجَنَّةِ، فَأَخْبَرْتُهُ بِالَّذِي قَالَ‏.‏ قَالَ اللَّهُ الْمُسْتَعَانُ‏.‏",
                "headingArabic": "نَكْتِ الْعُودِ فِي الْمَاءِ وَالطِّينِ",
                "headingUrdu": "جس نے پانی اور کیچڑ میں چھڑی ڈبو دی۔",
                "headingEnglish": "Whoever dipped a stick in water and mud",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5958,
                "hadithNumber": "6217",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "We were with the Prophet (ﷺ) in a funeral procession, and he started scraping the ground with a small stick and said, \"There is none amongst you but has been assigned a place (either) in Paradise and (or) in the Hell-Fire.\" The people said (to him), \"Should we not depend upon it?\" He said: carry on doing (good) deeds, for everybody will find easy such deeds as will lead him to his destined place. He then recited: \"As for him who gives (in charity) and keeps his duty to Allah..\" (92.5)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک جنازہ میں شریک تھے ۔ آنحضرت صلی اللہ علیہ وسلم کے ہاتھ میں ایک چھڑی تھی اس کو آپ زمین پر مار رہے تھے پھر آپ نے فرمایا تم میں کوئی ایسا نہیں ہے جس کا جنت یا دوزخ کا ٹھکانا طے نہ ہو چکا ہو ۔ صحابہ نے عرض کیا ، پھر کیوں نہ ہم اس پر بھروسہ کر لیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، عمل کرتے رہو کیونکہ ہر شخص جس ٹھکانے کے لیے پیدا کیا گیا ہے اس کو ویسی ہی توفیق دی جائے گی ۔ جیسا کہ قرآن شریف کے سورۃ واللیل میں ہے کہ جس نے للہ خیرات کی اور اللہ تعالیٰ سے ڈر ا ، آخر تک ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے شعبہ نے ، ان سے سلیمان ومنصور نے ، ان سے سعد بن عبیدہ نے ان سے ابوعبدالرحمن سلمی نے اور ان سے حضرت علی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، وَمَنْصُورٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي جَنَازَةٍ فَجَعَلَ يَنْكُتُ الأَرْضَ بِعُودٍ، فَقَالَ ‏\"‏ لَيْسَ مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَقَدْ فُرِغَ مِنْ مَقْعَدِهِ مِنَ الْجَنَّةِ وَالنَّارِ ‏\"‏‏.‏ فَقَالُوا أَفَلاَ نَتَّكِلُ قَالَ ‏\"‏ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ ‏\"‏‏.‏ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى‏}‏ الآيَةَ‏.‏",
                "headingArabic": "الرَّجُلِ يَنْكُتُ الشَّىْءَ بِيَدِهِ فِي الأَرْضِ",
                "headingUrdu": "کوئی زمین کو کھرچ سکتا ہے۔",
                "headingEnglish": "One may scrape up the ground",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5959,
                "hadithNumber": "6218",
                "englishNarrator": "Narrated Um Salama رضی اللہ عنہا :",
                "hadithEnglish": "(One night) the Prophet (ﷺ) woke up and said, \"Subhan Allah ! How many treasures have been (disclosed) sent down! And how many afflictions have been descended! Who will go and wake the sleeping ladyoccupants up of these dwellings (for praying)?\" (He meant by this his wives.) The Prophet (ﷺ) added, \"A well-dressed soul (person) in this world may be naked in the \"Hereafter.\" `Umar رضی اللہ عنہ said, \"I asked the Prophet, 'Have you divorced your wives?' He said, 'No.' I said, 'Allahu Akbar.' \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ( رات میں ) بیدار ہوئے اور فرمایا ، سبحان اللہ ! اللہ کی رحمت کے کتنے خزانے آج نازل کئے گئے ہیں اور کس طرح کے فتنے بھی اتارے گئے ہیں ۔ کون ہے ! جو ان حجرہ والیوں کو جگائے ۔ آنحضرت صلی اللہ علیہ وسلم کی مراد ازواج مطہرات سے تھی تاکہ وہ نماز پڑھ لیں کیونکہ بہت سی دنیا میں کپڑے پہننے والیاں آخرت میں ننگی ہوں گی ۔ اور ابن ابی ثور نے بیان کیا ، ان سے حضرت ابن عباس رضی اللہ عنہما نے اور ان سے حضرت عمر رضی اللہ عنہ نے بیان کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا ، کیا آپ نے ازواج مطہرات کو طلاق دے دی ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ۔ میں نے کہااللہ اکبر !",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، ان سے ہند بن حارث نے بیان کیا کہ ام سلمہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَتْنِي هِنْدُ بِنْتُ الْحَارِثِ، أَنَّ أُمَّ سَلَمَةَ ـ رضى الله عنها ـ قَالَتِ اسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ سُبْحَانَ اللَّهِ مَاذَا أُنْزِلَ مِنَ الْخَزَائِنِ، وَمَاذَا أُنْزِلَ مِنَ الْفِتَنِ، مَنْ يُوقِظُ صَوَاحِبَ الْحُجَرِ ـ يُرِيدُ بِهِ أَزْوَاجَهُ ـ حَتَّى يُصَلِّينَ، رُبَّ كَاسِيَةٍ فِي الدُّنْيَا، عَارِيَةٍ فِي الآخِرَةِ ‏\"‏‏.‏ وَقَالَ ابْنُ أَبِي ثَوْرٍ عَنِ ابْنِ عَبَّاسٍ، عَنْ عُمَرَ، قَالَ قُلْتُ لِلنَّبِيِّ صلى الله عليه وسلم طَلَّقْتَ نِسَاءَكَ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ اللَّهُ أَكْبَرُ‏.‏",
                "headingArabic": "التَّكْبِيرِ وَالتَّسْبِيحِ عِنْدَ التَّعَجُّبِ",
                "headingUrdu": "تعجب کے وقت تکبیر اور تسبیح کا کہنا",
                "headingEnglish": "The saying of Takbir and Tasbih at the time of wonder",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5960,
                "hadithNumber": "6219",
                "englishNarrator": "Narrated Safiya bint Huyai رضی اللہ عنہا :",
                "hadithEnglish": "The wife of the Prophet (ﷺ) that she went to Allah's Messenger (ﷺ) while he was in I`tikaf (staying in the mosque) during the last ten nights of the month of Ramadan. She spoke to him for an hour (a while) at night and then she got up to return home. The Prophet (ﷺ) got up to accompany her, and when they reached the gate of the mosque opposite the dwelling place of Um Salama رضی اللہ عنہا , the wife of the Prophet, two Ansari men passed by, and greeting Allah's Messenger (ﷺ) , they quickly went ahead. Allah's Messenger (ﷺ) said to them, \"Do not be in a hurry She is Safiya رضی اللہ عنہا , the daughter of Huyai.\" They said, \"Subhan Allah! O Allah's Messenger (ﷺ) (how dare we suspect you).\" That was a great thing for both of them. The Prophet (ﷺ) then said, \"Satan runs in the body of Adam's son (i.e. man) as his blood circulates in it, and I was afraid that he (Satan) might insert an evil thought in your hearts.\"",
                "hadithUrdu": "وہ آنحضرت صلی اللہ علیہ وسلم کے پاس ملنے آئیں ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت مسجد میں رمضان کے آخری عشرہ میں اعتکاف کئے ہوئے تھے ۔ عشاء کے وقت تھوڑی دیر انہوں نے آنحضرت صلی اللہ علیہ وسلم سے باتیں کیں اورواپس لوٹنے کے لئے اٹھیں تو آنحضرت صلی اللہ علیہ وسلم بھی انہیں چھوڑآنے کے لئے کھڑے ہو گئے ۔ جب وہ مسجد کے اس دروازہ کے پاس پہنچیں جہاں آنحضرت صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا کا حجرہ تھا ، تو ادھر سے دو انصاری صحابی گزرے اور آنحضرت صلی اللہ علیہ وسلم کو سلام کیا اور آگے بڑھ گئے ۔ لیکن آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ تھوڑی دیر کے لئے ٹھہر جاؤ ۔ یہ صفیہ بنت حی رضی اللہ عنہا میری بیوی ہیں ۔ ان دونوں صحابہ نے عرض کیا ۔ سبحان اللہ ، یا رسول اللہ ۔ ان پر بڑا شاق گزرا ۔ لیکن آپ نے فرمایا کہ شیطان انسان کے اندر خون کی طرح دوڑتا رہتا ہے ، اس لئے مجھے خوف ہوا کہ کہیں وہ تمہارے دل میں کوئی شبہ نہ ڈال دے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ( دوسری سند ) اور ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا ، ان سے سلیمان نے بیان کیا ، ان سے محمد بن ابی عتیق نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے امام زین العابدین علی بن حسین نے کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت صفیہ بنت حی رضی اللہ عنہا نے انہیں خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ،‏.‏ وَحَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ أَبِي عَتِيقٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ، أَنَّ صَفِيَّةَ بِنْتَ حُيَىٍّ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّهَا جَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم تَزُورُهُ وَهْوَ مُعْتَكِفٌ فِي الْمَسْجِدِ فِي الْعَشْرِ الْغَوَابِرِ مِنْ رَمَضَانَ، فَتَحَدَّثَتْ عِنْدَهُ سَاعَةً مِنَ الْعِشَاءِ ثُمَّ قَامَتْ تَنْقَلِبُ، فَقَامَ مَعَهَا النَّبِيُّ صلى الله عليه وسلم يَقْلِبُهَا حَتَّى إِذَا بَلَغَتْ باب الْمَسْجِدِ الَّذِي عِنْدَ مَسْكَنِ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم مَرَّ بِهِمَا رَجُلاَنِ مِنَ الأَنْصَارِ فَسَلَّمَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ نَفَذَا، فَقَالَ لَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَلَى رِسْلِكُمَا، إِنَّمَا هِيَ صَفِيَّةُ بِنْتُ حُيَىٍّ ‏\"‏‏.‏ قَالاَ سُبْحَانَ اللَّهِ يَا رَسُولَ اللَّهِ‏.‏ وَكَبُرَ عَلَيْهِمَا‏.‏ قَالَ ‏\"‏ إِنَّ الشَّيْطَانَ يَجْرِي مِنِ ابْنِ آدَمَ مَبْلَغَ الدَّمِ، وَإِنِّي خَشِيتُ أَنْ يَقْذِفَ فِي قُلُوبِكُمَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5961,
                "hadithNumber": "6220",
                "englishNarrator": "Narrated `Abdullah bin Mughaffal Al-Muzani:",
                "hadithEnglish": "The Prophet (ﷺ) forbade the throwing of stones (with the thumb and the index or middle finger), and said \"It neither hunts a game nor kills (or hurts) an enemy, but it gouges out an eye or breaks a tooth.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے کنکری پھینکنے سے منع کیا تھا اور فرمایا تھا کہ وہ نہ شکار مار سکتی ہے اور نہ دشمن کو کوئی نقصان پہنچا سکتی ہے ، البتہ آنکھ پھوڑ سکتی ہے اور دانت توڑ سکتی ہے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے ، انہوں نے عقبہ بن صہبان ازدی سے سنا ، وہ عبداللہ بن مغفل مزنی سے نقل کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ عُقْبَةَ بْنَ صُهْبَانَ الأَزْدِيَّ، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ الْمُزَنِيِّ، قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنِ الْخَذْفِ وَقَالَ ‏ \"‏ إِنَّهُ لاَ يَقْتُلُ الصَّيْدَ، وَلاَ يَنْكَأُ الْعَدُوَّ، وَإِنَّهُ يَفْقَأُ الْعَيْنَ، وَيَكْسِرُ السِّنَّ ‏\"‏‏.‏",
                "headingArabic": "النَّهْىِ عَنِ الْخَذْفِ",
                "headingUrdu": "پتھر پھینکنا حرام ہے۔",
                "headingEnglish": "It is forbidden to throw stones",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5962,
                "hadithNumber": "6221",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Two men sneezed before the Prophet. The Prophet (ﷺ) said to one of them, \"May Allah bestow His Mercy on you,\" but he did not say that to the other. On being asked (why), the Prophet (ﷺ) said, \"That one praised Allah (at the time of sneezing), while the other did not praise Allah.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے پاس دو اصحاب چھینکے ۔ آنحضرت صلی اللہ علیہ وسلم نے ایک کا جواب یرحمک اللہ ( اللہ تم پر رحم کرے ) سے دیا اور دوسرے کا نہیں ۔ آنحضرت صلی اللہ علیہ وسلم سے اس کی وجہ پوچھی گئی تو فرمایا کہ اس نے الحمدللہ کہا تھا ( اس لئے اس کا جواب دیا ) اور دوسرے نے الحمدللہ نہیں کہا تھا ۔ چھینکنے والے کو الحمدللہ ضرور کہنا چاہئے اور سننے والوں کویرحمک اللہ ۔ ( سے جواب دینا اسلامی تہذیب ہے )",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا سُلَيْمَانُ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ عَطَسَ رَجُلاَنِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَشَمَّتَ أَحَدَهُمَا وَلَمْ يُشَمِّتِ الآخَرَ، فَقِيلَ لَهُ فَقَالَ ‏ \"‏ هَذَا حَمِدَ اللَّهَ، وَهَذَا لَمْ يَحْمَدِ اللَّهَ ‏\"‏‏.‏",
                "headingArabic": "لْحَمْدِ لِلْعَاطِسِ",
                "headingUrdu": "چھینک آنے پر الحمد للہ کہنا",
                "headingEnglish": "To say 'Al-Hamdu-lillah' on sneezing",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5963,
                "hadithNumber": "6222",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) ordered us to do seven (things) and forbade us from seven (other things): He ordered us to pay a visit to the sick, to follow funeral possessions, to say: May Allah be merciful to you to a sneezer, - if he says: Praise be to Allah, to accept invitation (invitation to a wedding banquet), to return greetings, to help the oppressed, and to help others to fulfill their oaths (provided it was not sinful). And he forbade us from seven (things): to wear golden rings or golden bangles, to wear silk (cloth), Dibaj, Sundus and Mayathir.",
                "hadithUrdu": "ہمیں نبی کریم صلی اللہ علیہ وسلم نے سات باتوں کا حکم دیا تھا اور سات کاموں سے روکا تھا ، ہمیں آنحضرت صلی اللہ علیہ وسلم نے بیمار کی مزاج پرسی کرنے ، جنازہ کے پیچھے چلنے ، چھینکنے والے کے جواب دینے ، دعوت کرنے والے کی دعوت قبول کرنے ، سلام کا جواب دینے ، مظلوم کی مدد کرنے اور قسم کھا لینے والے کی قسم پوری کرنے میں مدد دینے کا حکم دیا تھا اور آنحضرت صلی اللہ علیہ وسلم نے ہمیں سات کاموں سے روکا تھا ، سونے کی انگوٹھی سے ، یا بیان کیا کہ سونے کے چھلے سے ، ریشم اوردیبا اور سندس ( دیبا سے باریک ریشمی کپڑا ) پہننے سے اور ریشمی زین سے ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے اشعث بن سلیم نے کہ میں نے معاویہ بن سوید بن مقرن سے سنا اور ان سے حضرت براء رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَشْعَثِ بْنِ سُلَيْمٍ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم بِسَبْعٍ، وَنَهَانَا عَنْ سَبْعٍ، أَمَرَنَا بِعِيَادَةِ الْمَرِيضِ، وَاتِّبَاعِ الْجِنَازَةِ، وَتَشْمِيتِ الْعَاطِسِ، وَإِجَابَةِ الدَّاعِي، وَرَدِّ السَّلاَمِ، وَنَصْرِ الْمَظْلُومِ، وَإِبْرَارِ الْمُقْسِمِ، وَنَهَانَا عَنْ سَبْعٍ، عَنْ خَاتَمِ الذَّهَبِ ـ أَوْ قَالَ حَلْقَةِ الذَّهَبِ ـ وَعَنْ لُبْسِ الْحَرِيرِ، وَالدِّيبَاجِ، وَالسُّنْدُسِ، وَالْمَيَاثِرِ‏.‏",
                "headingArabic": "تَشْمِيتِ الْعَاطِسِ إِذَا حَمِدَ اللَّ",
                "headingUrdu": "چھینکنے والے کو تسمہ دینا اگر وہ اللہ کی حمد کرتا ہے۔",
                "headingEnglish": "Tashmu to the sneezer if he praises Allah",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5964,
                "hadithNumber": "6223",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah likes sneezing and dislikes yawning, so if someone sneezes and then praises Allah, then it is obligatory on every Muslim who heard him, to say: May Allah be merciful to you (Yar-hamuka-l-lah). But as regards yawning, it is from Satan, so one must try one's best to stop it, if one says 'Ha' when yawning, Satan will laugh at him.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ( فرمایا کہ ) اللہ تعالیٰ چھینک کو پسند کرتا ہے اور جمائی کو ناپسند کرتا ہے ۔ اس لئے جب تم میں سے کوئی شخص چھینکے اور الحمدللہ کہے تو ہر مسلمان پر جو اسے سنے ، حق ہے کہ اس کاجواب یرحمک اللہ سے دے ۔ لیکن جمائی شیطان کی طرف سے ہوتی ہے اس لئے جہاں تک ہو سکے اسے روکے کیونکہ جب وہ منہ کھول کر ہاہاہا کہتا ہے تو شیطان اس پر ہنستا ہے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا ہم سے ابن ابی ذئب نے بیان کیا ، ان سے سعید مقبری نے بیان کیا ، ان سے ان کے والد نے ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے",
                "hadithArabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ يُحِبُّ الْعُطَاسَ، وَيَكْرَهُ التَّثَاؤُبَ، فَإِذَا عَطَسَ فَحَمِدَ اللَّهَ، فَحَقٌّ عَلَى كُلِّ مُسْلِمٍ سَمِعَهُ أَنْ يُشَمِّتَهُ، وَأَمَّا التَّثَاوُبُ فَإِنَّمَا هُوَ مِنَ الشَّيْطَانِ، فَلْيَرُدَّهُ مَا اسْتَطَاعَ، فَإِذَا قَالَ هَا‏.‏ ضَحِكَ مِنْهُ الشَّيْطَانُ ‏\"‏‏.‏",
                "headingArabic": "مَا يُسْتَحَبُّ مِنَ الْعُطَاسِ، وَمَا يُكْرَهُ مِنَ التَّثَاؤُبِ",
                "headingUrdu": "چھینکنا، اور جمائی لینا",
                "headingEnglish": "Sneezing, and yawning",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5965,
                "hadithNumber": "6224",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \" If anyone of you sneezes, he should say 'Al-Hamduli l-lah' (Praise be to Allah), and his (Muslim) brother or companion should say to him, 'Yar-hamuka-l-lah' (May Allah bestow his Mercy on you). When the latter says 'Yar-hamuka-llah\", the former should say, 'Yahdikumul-lah wa Yuslih balakum' (May Allah give you guidance and improve your condition).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب تم میں سے کوئی چھینکے تو الحمدللہ کہے اور اس کا بھائی یا اس کا ساتھی ( راوی کو شبہ تھا ) ” یرحمک اللہ “ کہے ۔ جب ساتھی یرحمک اللہ کہے تو اس کے جواب میں چھینکنے والا ” یھدیکم اللہ ویصلح بالکم “",
                "urduNarrator": "ہم سے مالک بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے عبدالعزیز بن ابی سلمہ نے بیان کیا ، انہیں عبداللہ بن دینار نے خبر دی ، وہ ابوصالح سے اور وہ حضرت ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلِ الْحَمْدُ لِلَّهِ‏.‏ وَلْيَقُلْ لَهُ أَخُوهُ أَوْ صَاحِبُهُ يَرْحَمُكَ اللَّهُ‏.‏ فَإِذَا قَالَ لَهُ يَرْحَمُكَ اللَّهُ‏.‏ فَلْيَقُلْ يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ ‏\"‏‏.‏",
                "headingArabic": "إِذَا عَطَسَ كَيْفَ يُشَمَّتُ",
                "headingUrdu": "جب کسی کو چھینک آئے تو کیا کہا جائے؟",
                "headingEnglish": "When somebody sneezes, what should be said?",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5966,
                "hadithNumber": "6225",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Two men sneezed before the Prophet (ﷺ) and he said Tashmit to one of them, while he did not say Tashmit to the other. So that man said, \"O Allah's Messenger (ﷺ)! You said Tashmit to that fellow but you did not say Tashmit to me. \"The Prophet (ﷺ) said, \"That man praised Allah, but you did not praise Allah.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی موجودگی میں دو آدمیوں نے چھینکا ۔ لیکن آنحضرت صلی اللہ علیہ وسلم نے ان میں سے ایک کی چھینک پر یرحمک اللہ کہا اور دوسرے کی چھینک پر نہیں کہا ۔ اس پر دوسرا شخص بولا کہ یا رسول اللہ ، آپ نے ان کی چھینک پر یرحمک اللہ فرمایا ۔ لیکن میری چھینک پر نہیں فرمایا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہوں نے الحمدللہ کہا تھا اور تم نے نہیں کہا تھا ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے سلیمان تیمی نے بیان کیا ، کہا کہ میں نے حضرت انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ يَقُولُ عَطَسَ رَجُلاَنِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَشَمَّتَ أَحَدَهُمَا وَلَمْ يُشَمِّتِ الآخَرَ‏.‏ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ شَمَّتَّ هَذَا وَلَمْ تُشَمِّتْنِي‏.‏ قَالَ ‏ \"‏ إِنَّ هَذَا حَمِدَ اللَّهَ، وَلَمْ تَحْمَدِ اللَّهَ ‏\"‏‏.‏",
                "headingArabic": "لاَ يُشَمَّتُ الْعَاطِسُ إِذَا لَمْ يَحْمَدِ اللَّهَ",
                "headingUrdu": "چھینکنے والے کو الحمدللہ نہ کہنے پر تسمّو نہ کہا جائے",
                "headingEnglish": "Tashmu should not be said to a sneezer if he does not say 'Al-Hamdu-lillah'",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5967,
                "hadithNumber": "6226",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah loves sneezing but dislikes yawning; so if anyone of you sneezes and then praises Allah, every Muslim who hears him (praising Allah) has to say Tashmit to him. But as regards yawning, it is from Satan, so if one of you yawns, he should try his best to stop it, for when anyone of you yawns, Satan laughs at him.\"",
                "hadithUrdu": "اللہ تعالیٰ چھینک کو پسند کرتا ہے کیونکہ وہ بعض دفعہ صحت کی علامت ہے اور جمائی کو ناپسند کرتا ہے ۔ اس لئے جب تم میں سے کوئی شخص چھینکے تو وہ الحمدللہ کہے لیکن جمائی لینا شیطان کی طرف سے ہوتا ہے ۔ اس لئے جب تم میں سے کسی کو جمائی آئے تو وہ اپنی قوت وطاقت کے مطابق اسے رو کے ۔ اس لئے کہ جب تم میں سے کوئی جمائی لیتا ہے تو شیطان ہنستا ہے ۔",
                "urduNarrator": "ہم سے عاصم بن علی نے بیان کیا ، انہوں نے کہا ہم سے ابن ابی ذئب نے بیان کیا ، انہوں نے کہا کہ ہم سے سعید مقبری نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ اللَّهَ يُحِبُّ الْعُطَاسَ وَيَكْرَهُ التَّثَاؤُبَ، فَإِذَا عَطَسَ أَحَدُكُمْ وَحَمِدَ اللَّهَ كَانَ حَقًّا عَلَى كُلِّ مُسْلِمٍ سَمِعَهُ أَنْ يَقُولَ لَهُ يَرْحَمُكَ اللَّهُ‏.‏ وَأَمَّا التَّثَاؤُبُ فَإِنَّمَا هُوَ مِنَ الشَّيْطَانِ، فَإِذَا تَثَاوَبَ أَحَدُكُمْ فَلْيَرُدَّهُ مَا اسْتَطَاعَ، فَإِنَّ أَحَدَكُمْ إِذَا تَثَاءَبَ ضَحِكَ مِنْهُ الشَّيْطَانُ ‏\"‏‏.‏",
                "headingArabic": "إِذَا تَثَاوَبَ فَلْيَضَعْ يَدَهُ عَلَى فِيهِ",
                "headingUrdu": "اگر کسی کو جمائی آئے تو وہ اپنے منہ پر ہاتھ رکھے",
                "headingEnglish": "If someone yawns, he should put his hand over his mouth",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5968,
                "hadithNumber": "6227",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah created Adam in His picture, sixty cubits (about 30 meters) in height. When He created him, He said (to him), \"Go and greet that group of angels sitting there, and listen what they will say in reply to you, for that will be your greeting and the greeting of your offspring.\" Adam (went and) said, 'As-Salamu alaikum (Peace be upon you).' They replied, 'AsSalamu-'Alaika wa Rahmatullah (Peace and Allah's Mercy be on you) So they increased 'Wa Rahmatullah' The Prophet (ﷺ) added 'So whoever will enter Paradise, will be of the shape and picture of Adam Since then the creation of Adam's (offspring) (i.e. stature of human beings is being diminished continuously) to the present time.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے آدم کو اپنی صورت پر بنایا ، ان کی لمبائی ساٹھ ہاتھ تھی ۔ جب انہیں پیدا کر چکا تو فرمایا کہ جاؤ اور ان فرشتوں کو جو بیٹھے ہوئے ہیں ، سلام کرو اور سنو کہ تمہارے سلام کا کیا جواب دیتے ہیں ، کیونکہ یہی تمہارا اور تمہاری اولاد کا سلام ہو گا ۔ آدم علیہ السلام نے کہا السلام علیکم ! فرشتوں نے جواب دیا ، السلام علیک ورحمۃ اللہ ، انہوں نے آدم کے سلام پر ” ورحمۃ اللہ “ بڑھا دیا ۔ پس جو شخص بھی جنت میں جائے گا حضرت آدم علیہ السلام کی صورت کے مطابق ہو کر جائے گا ۔ اس کے بعد سے پھر خلقت کا قد وقامت کم ہوتا گیا ۔ اب تک ایسا ہی ہوتا رہا ۔",
                "urduNarrator": "ہم سے یحییٰ بن جعفر نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، ان سے معمر نے ، ان سے ہمام نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ جَعْفَرٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ خَلَقَ اللَّهُ آدَمَ عَلَى صُورَتِهِ، طُولُهُ سِتُّونَ ذِرَاعًا، فَلَمَّا خَلَقَهُ قَالَ اذْهَبْ فَسَلِّمْ عَلَى أُولَئِكَ النَّفَرِ مِنَ الْمَلاَئِكَةِ جُلُوسٌ، فَاسْتَمِعْ مَا يُحَيُّونَكَ، فَإِنَّهَا تَحِيَّتُكَ وَتَحِيَّةُ ذُرِّيَّتِكَ‏.‏ فَقَالَ السَّلاَمُ عَلَيْكُمْ‏.‏ فَقَالُوا السَّلاَمُ عَلَيْكَ وَرَحْمَةُ اللَّهِ‏.‏ فَزَادُوهُ وَرَحْمَةُ اللَّهِ، فَكُلُّ مَنْ يَدْخُلُ الْجَنَّةَ عَلَى صُورَةِ آدَمَ، فَلَمْ يَزَلِ الْخَلْقُ يَنْقُصُ بَعْدُ حَتَّى الآنَ ‏\"‏‏.‏",
                "headingArabic": "بَدْءِ السَّلاَمِ",
                "headingUrdu": "سلام کیسے شروع ہوا۔",
                "headingEnglish": "How the Salam began",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5969,
                "hadithNumber": "6228",
                "englishNarrator": "Narrated `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Al-Fadl bin `Abbas رضی اللہ عنہما rode behind the Prophet (ﷺ) as his companion rider on the back portion of his she camel on the Day of Nahr (slaughtering of sacrifice, 10th Dhul-Hijja) and Al-Fadl was a handsome man. The Prophet (ﷺ) stopped to give the people verdicts. In the meantime, a beautiful woman From the tribe of Khath'am came, asking the verdict of Allah's Messenger (ﷺ). Al-Fadl started looking at her as her beauty attracted him. The Prophet (ﷺ) looked behind while Al-Fadl was looking at her; so the Prophet (ﷺ) held out his hand backwards and caught the chin of Al-Fadl and turned his face (to the owner sides in order that he should not gaze at her. She said, \"O Allah's Messenger (ﷺ)! The obligation of Performing Hajj enjoined by Allah on His worshipers, has become due (compulsory) on my father who is an old man and who cannot sit firmly on the riding animal. Will it be sufficient that I perform Hajj on his behalf?\" He said, \"Yes.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے حضرت فضل بن عباس رضی اللہ عنہماکو قربانی کے دن اپنی سواری پر اپنے پیچھے بٹھایا ۔ وہ خوبصورت گورے مرد تھے ۔ حضور اکرم صلی اللہ علیہ وسلم لوگو ں کو مسائل بتانے کے لئے کھڑے ہو گئے ۔ اسی دوران میں قبیلہ خثعم کی ایک خوبصورت عورت بھی آنحضرت صلی اللہ علیہ وسلم سے مسئلہ پوچھنے آئی ۔ فضل بھی اس عورت کو دیکھنے لگے ۔ اس کا حسن وجمال ان کو بھلامعلوم ہوا ۔ آنحضرت صلی اللہ علیہ وسلم نے مڑکر دیکھا تو فضل اسے دیکھ رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے اپناہاتھ پیچھے لے جا کر فضل کی ٹھوڑی پکڑی اور ان کا چہرہ دوسری طرف کر دیا ۔ پھر اس عورت نے کہا ، یا رسول اللہ حج کے بارے میں اللہ کا جو اپنے بندوں پر فریضہ ہے وہ میرے والد پر لاگوہوتا ہے ، جو بہت بوڑھے ہو چکے ہیں اور سواری پر سیدھے نہیں بیٹھ سکتے ۔ کیا اگر میں ان کی طرف سے حج کر لو ں تو ان کا حج ادا ہو جائے گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ہو جائے گا ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں سلیمان بن یسار نے خبر دی اور انہیں حضرت عبداللہ بن عباس رضی اللہ عنہما نے خبر دی ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سُلَيْمَانُ بْنُ يَسَارٍ، أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَرْدَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْفَضْلَ بْنَ عَبَّاسٍ يَوْمَ النَّحْرِ خَلْفَهُ عَلَى عَجُزِ رَاحِلَتِهِ، وَكَانَ الْفَضْلُ رَجُلاً وَضِيئًا، فَوَقَفَ النَّبِيُّ صلى الله عليه وسلم لِلنَّاسِ يُفْتِيهِمْ، وَأَقْبَلَتِ امْرَأَةٌ مِنْ خَثْعَمَ وَضِيئَةٌ تَسْتَفْتِي رَسُولَ اللَّهِ صلى الله عليه وسلم فَطَفِقَ الْفَضْلُ يَنْظُرُ إِلَيْهَا، وَأَعْجَبَهُ حُسْنُهَا، فَالْتَفَتَ النَّبِيُّ صلى الله عليه وسلم يَنْظُرُ إِلَيْهَا، فَأَخْلَفَ بِيَدِهِ فَأَخَذَ بِذَقَنِ الْفَضْلِ، فَعَدَلَ وَجْهَهُ عَنِ النَّظَرِ إِلَيْهَا، فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ فَرِيضَةَ اللَّهِ فِي الْحَجِّ عَلَى عِبَادِهِ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا، لاَ يَسْتَطِيعُ أَنْ يَسْتَوِيَ عَلَى الرَّاحِلَةِ، فَهَلْ يَقْضِي عَنْهُ أَنْ أَحُجَّ عَنْهُ قَالَ ‏ \"‏ نَعَمْ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَدْخُلُوا بُيُوتًا غَيْرَ بُيُوتِكُمْ حَتَّى تَسْتَأْنِسُوا وَتُسَلِّمُوا عَلَى أَهْلِهَا ذَلِكُمْ خَيْرٌ لَكُمْ لَعَلَّكُمْ تَذَّكَّرُونَ فَإِنْ لَمْ تَجِدُوا فِيهَا أَحَدًا فَلاَ تَدْخُلُوهَا حَتَّى يُؤْذَنَ لَكُمْ وَإِنْ قِيلَ لَكُمُ ارْجِعُوا فَارْجِعُوا هُوَ أَزْكَى لَكُمْ وَاللَّهُ بِمَا تَعْمَلُونَ عَلِيمٌ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَدْخُلُوا بُيُوتًا غَيْرَ مَسْكُونَةٍ فِيهَا مَتَاعٌ لَكُمْ وَاللَّهُ يَعْلَمُ مَا تُبْدُونَ وَمَا تَكْتُمُونَ}",
                "headingUrdu": "اللہ تعالیٰ فرماتا ہے: اے ایمان والو! اپنے گھروں کے علاوہ دوسرے گھروں میں داخل نہ ہو، جب تک کہ تم اجازت نہ لے لو اور وہاں کے رہنے والوں کو سلام نہ کرو۔ یہ تمہارے لیے بہتر ہے، خوش ہو کہ تم ہوشیار رہو۔ لیکن اگر تم اس میں کسی کو نہ پاؤ تو ان میں بھی مالکوں کی اجازت کے بغیر داخل نہ ہونا۔ اور اگر آپ کو واپس جانے کے لیے کہا جائے تو واپس چلے جائیں، یہ آپ کے لیے زیادہ صاف ہے۔ اور اللہ تمہارے اعمال کو جانتا ہے۔ تم پر کوئی گناہ نہیں کہ تم ان گھروں میں داخل ہو جو کسی کے رہنے کے لیے خاص نہ ہو اور تمہیں ان کے استعمال کی صوابدید ہو۔ اور اللہ جانتا ہے کہ تم ظاہر کرتے ہو اور جو چھپاتے ہو۔",
                "headingEnglish": "Allah says: 'O Believers! Enter not houses other than your own, until you take permission and salute the residents thereof. This is better for you, happy you may be heedful. But if you find not anyone therein, then also enter them not without the permission of the owners; and if you are told to go back, the go back, this is cleaner to you. And Allah knows your deeds. There is no sin on you that you enter those houses which are not specially for anyone's residence and you have discretion to use them. And Allah knows that you disclose  and what you conceal.'",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5970,
                "hadithNumber": "6229",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, 'Beware! Avoid sitting on the roads.\" They (the people) said, \"O Allah s Apostle! We can't help sitting (on the roads) as these are (our places) here we have talks.\" The Prophet (ﷺ) said, '  lf you refuse but to sit, then pay the road its right ' They said, \"What is the right of the road, O Allah's Apostle?\" He said, 'Lowering your gaze, refraining from harming others, returning greeting, and enjoining what is good, and forbidding what is evil.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا راستوں پر بیٹھنے سے بچو ! صحابہ نے عرض کیا یا رسول اللہ ! ہماری یہ مجلس تو بہت ضروری ہیں ، ہم وہیں روزمرہ گفتگو کیا کرتے ہیں ۔ آپ نے فرمایا کہ اچھا جب تم ان مجلسوں میں بیٹھنا ہی چاہتے ہو تو راستے کا حق ادا کیا کرویعنی راستے کو اس کا حق دو ۔ صحابہ نے عرض کیا ، راستے کا حق کیا ہے یا رسول اللہ ! فرمایا ( غیرمحرم عورتوں کو دیکھنے سے ) نظرنیچی رکھنا ، راہ گیروں کو نہ ستانا ، سلام کا جواب دینا ، بھلائی کا حکم دینا اور برائی سے روکنا ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا ہم کو ابوعامر نے خبر دی ، انہوں نے کہا ہم سے زہیر نے بیان کیا ، ان سے زید بن اسلم نے بیان کیا ، ان سے عطاء بن یسار نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، أَخْبَرَنَا أَبُو عَامِرٍ، حَدَّثَنَا زُهَيْرٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِيَّاكُمْ وَالْجُلُوسَ بِالطُّرُقَاتِ ‏\"‏‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ مَا لَنَا مِنْ مَجَالِسِنَا بُدٌّ نَتَحَدَّثُ فِيهَا‏.‏ فَقَالَ ‏\"‏ إِذَا أَبَيْتُمْ إِلاَّ الْمَجْلِسَ فَأَعْطُوا الطَّرِيقَ حَقَّهُ ‏\"‏‏.‏ قَالُوا وَمَا حَقُّ الطَّرِيقِ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ غَضُّ الْبَصَرِ، وَكَفُّ الأَذَى، وَرَدُّ السَّلاَمِ، وَالأَمْرُ بِالْمَعْرُوفِ وَالنَّهْىُ عَنِ الْمُنْكَرِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5971,
                "hadithNumber": "6230",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "When we prayed with the Prophet (ﷺ) we used to say: As-Salam be on Allah from His worshipers, As- Salam be on Gabriel, As-Salam be on Michael, As-Salam be on so-and-so. When the Prophet (ﷺ) finished his prayer, he faced us and said, \"Allah Himself is As-Salam (Peace), so when one sits in the prayer, one should say, 'at-Tahiyatu-li l-lahi Was-Salawatu, Wat-Taiyibatu, As-Salamu 'Alaika aiyuhan- Nabiyyu wa Rah-matul-iahi wa Barakatuhu, As-Salamu 'Alaina wa 'ala 'Ibadillahi assalihin, for if he says so, then it will be for all the pious slave of Allah in the Heavens and the Earth. (Then he should say), 'Ash-hadu an la ilaha illalllahu wa ash-hadu anna Muhammadan `Abduhu wa rasulu-hu,' and then he can choose whatever speech (i.e. invocation) he wishes \" (See Hadith No. 797, Vol. 1).",
                "hadithUrdu": "جب ہم ( ابتداء اسلام میں ) نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے تو کہتے ” سلام ہو اللہ پر اس کے بندوں سے پہلے ، سلام ہو جبرائیل پر ، سلام ہو میکائیل پر ، سلام ہو فلاں پر ، پھر ( ایک مرتبہ ) جب آنحضرت صلی اللہ علیہ وسلم نماز سے فارغ ہوئے تو ہماری طرف متوجہ ہو کر فرمایا کہ اللہ ہی سلام ہے ۔ اس لئے جب تم میں سے کوئی نماز میں بیٹھے تو ” التحیات للہ والصلوات والطیبات السلام علیک ایھا النبی ورحمۃ اللہ وبرکاتہ السلام علیناوعلی عباد اللہ الصالحین ۔ “ الخ پڑھا کرے ۔ کیونکہ جب وہ یہ دعا پڑہے گا تو آسمان و زمین کے ہر صالح بندے کو اس کی یہ دعا پہنچے گی ۔ ” اشہد ان لا ا\u0004\bلٰہ ا\u0004\bلا اللہ واشہد ان محمد ا عبدہ ورسولہ “ اس کے بعد اسے اختیار ہے جو دعا چاہے پڑھے ۔ ( مگر یہ درود شریف پڑھنے کے بعد ہے )",
                "urduNarrator": "ہم سے عمر بن حفص نے بیان کیا ، انہوں نے کہا ہم سے ہمارے والد نے بیان کیا ، انہوں نے کہا ہم سے اعمش نے بیان کیا ، انہوں نے کہا کہ مجھ سے شقیق نے بیان کیا اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي شَقِيقٌ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنَّا إِذَا صَلَّيْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم قُلْنَا السَّلاَمُ عَلَى اللَّهِ قَبْلَ عِبَادِهِ، السَّلاَمُ عَلَى جِبْرِيلَ، السَّلاَمُ عَلَى مِيكَائِيلَ، السَّلاَمُ عَلَى فُلاَنٍ، فَلَمَّا انْصَرَفَ النَّبِيُّ صلى الله عليه وسلم أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ ‏ \"‏ إِنَّ اللَّهَ هُوَ السَّلاَمُ، فَإِذَا جَلَسَ أَحَدُكُمْ فِي الصَّلاَةِ فَلْيَقُلِ التَّحِيَّاتُ لِلَّهِ، وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ‏.‏ فَإِنَّهُ إِذَا قَالَ ذَلِكَ أَصَابَ كُلَّ عَبْدٍ صَالِحٍ فِي السَّمَاءِ وَالأَرْضِ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ‏.‏ ثُمَّ يَتَخَيَّرْ بَعْدُ مِنَ الْكَلاَمِ مَا شَاءَ ‏\"‏‏.‏",
                "headingArabic": "السَّلاَمُ اسْمٌ مِنْ أَسْمَاءِ اللَّهِ تَعَالَى",
                "headingUrdu": "السلام علیکم اللہ عزوجل کے ناموں میں سے ایک نام ہے۔",
                "headingEnglish": "As-Salam is one of the Names of Allah 'Azza wa Jall",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5972,
                "hadithNumber": "6231",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The young should greet the old, the passer by should greet the sitting one, and the small group of persons should greet the large group of persons. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا چھوٹا بڑے کو سلام کرے ، گزرنے والا بیٹھنے والے کو سلام کرے اور چھوٹی جماعت بڑی جماعت کو پہلے سلام کرے ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل ابوالحسن نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا ہم کومعمر نے خبر دی ، انہیں ہمام بن منبہ نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يُسَلِّمُ الصَّغِيرُ عَلَى الْكَبِيرِ، وَالْمَارُّ عَلَى الْقَاعِدِ، وَالْقَلِيلُ عَلَى الْكَثِيرِ ‏\"‏‏.‏",
                "headingArabic": "چھوٹی تعداد کو بڑی تعداد کو سلام کرنا چاہیے۔",
                "headingUrdu": "چھوٹی تعداد کو بڑی تعداد کو سلام کرنا چاہیے۔",
                "headingEnglish": "The small number should greet the large number",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5973,
                "hadithNumber": "6232",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The riding one should greet the walking one, and the walking one should greet the sitting one, and the small number of persons should greet the large number of persons.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا سوار پیدل چلنے والے کو سلام کرے ، پیدل چلنے والا بیٹھے ہوئے کو اورکم تعداد والے بڑی تعدا د والوں کو ۔",
                "urduNarrator": "ہم سے محمد نے بیان کیا ، انہوں نے کہا ہم کو مخلد نے خبر دی ، انہوں نے کہا ہم کو ابن جریج نے خبر دی ، انہوں نے کہا کہ مجھے زیاد نے خبر دی ، انہوں نے عبدالرحمٰن بن زید کے غلام ثابت سے سنا ، اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ۔ انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا مَخْلَدٌ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي زِيَادٌ، أَنَّهُ سَمِعَ ثَابِتًا، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يُسَلِّمُ الرَّاكِبُ عَلَى الْمَاشِي، وَالْمَاشِي عَلَى الْقَاعِدِ، وَالْقَلِيلُ عَلَى الْكَثِيرِ ‏\"‏‏.‏",
                "headingArabic": "تَسْلِيمِ الرَّاكِبِ عَلَى الْمَاشِي",
                "headingUrdu": "سوار کو چاہیے کہ پیدل چلنے والے کو سلام کرے۔",
                "headingEnglish": "The riding person should greet the walking person",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5974,
                "hadithNumber": "6233",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The riding person should greet the walking one, and the walking one should greet the sitting one, and the small number of persons should greet the large number of persons.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، سوار پیدل چلنے والے کو سلام کرے ، پیدل چلنے والا بیٹھے ہوئے شخص کو اور چھوٹی جماعت پہلے بڑی جماعت کو سلام کرے ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، انہوں نے کہا ہم کوروح بن عبادہ نے خبر دی ، انہوں نے کہا ہم سے ابن جریج نے بیان کیا ، انہوں نے کہا کہ مجھے زیاد نے خبر دی ، انہیں ثابت نے خبر دی جو عبدالرحمٰن بن زید کے غلام ہیں ۔ اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي زِيَادٌ، أَنَّ ثَابِتًا، أَخْبَرَهُ ـ وَهْوَ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ ـ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ يُسَلِّمُ الرَّاكِبُ عَلَى الْمَاشِي وَالْمَاشِي عَلَى الْقَاعِدِ، وَالْقَلِيلُ عَلَى الْكَثِيرِ ‏\"‏‏.‏",
                "headingArabic": "تَسْلِيمِ الْمَاشِي عَلَى الْقَاعِدِ",
                "headingUrdu": "پیدل چلنے والا بیٹھنے والے کو سلام کرے۔",
                "headingEnglish": "The walking person should greet the sitting one",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5975,
                "hadithNumber": "6234",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The younger person should greet the older one, and the walking person should greet the sitting one, and the small number of persons should greet the large number of persons.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا چھوٹا بڑے کو سلام کرے ، گزرنے والا بیٹھنے والے کواور کم تعدا د والے بڑی تعداد والوں کو ۔",
                "urduNarrator": "اور ابراہیم بن طہمان نے بیان کیا ، انہوں نے کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا ، ان سے صفوان بن سلیم نے بیان کیا ، ان سے عطاء بن یسار نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ إِبْرَاهِيمُ عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يُسَلِّمُ الصَّغِيرُ عَلَى الْكَبِيرِ، وَالْمَارُّ عَلَى الْقَاعِدِ، وَالْقَلِيلُ عَلَى الْكَثِيرِ ‏\"‏‏.‏",
                "headingArabic": "تَسْلِيمِ الصَّغِيرِ عَلَى الْكَبِيرِ",
                "headingUrdu": "چھوٹا آدمی بڑے کو سلام کرے۔",
                "headingEnglish": "The younger person should greet the older one",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5976,
                "hadithNumber": "6235",
                "englishNarrator": "Narrated Al-Bara' bin 'Azib رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) ordered us to do seven (things): to visit the sick, to follow the funeral processions, to say Tashmit to a sneezer, to help the weak, to help the oppressed ones, to propagate As-Salam (greeting), and to help others to fulfill their oaths (if it is not sinful). He forbade us to drink from silver utensils, to wear gold rings, to ride on silken saddles, to wear silk clothes, Dibaj (thick silk cloth), Qassiy and Istabraq (two kinds of silk). (See Hadith No. 539, Vol. 7)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں سات باتوں کاحکم دیا تھا ۔ بیمار کی مزاج پرسی کرنے کا ، جنازے کے پیچھے چلنے کا ، چھینکنے والے کے جواب دینے کا ۔ کمزور کی مدد کرنے کا ، مظلوم کی مدد کرنے کا ، افشاء سلام ( سلام کا جواب دینے اور بکثرت سلام کرنے ) کا قسم ( حق ) کھانے والے کی قسم پوری کرنے کا ، اور آنحضرت صلی اللہ علیہ وسلم نے چاندی کے برتن میں پینے سے منع فرمایا تھا اور سونے کی انگوٹھی پہننے سے ہمیں منع فرمایا تھا ۔ میثر ( ریشم کی زین ) پر سوار ہونے سے ، ریشم اور دیباج پہننے ، قسی ( ریشمی کپڑا ) اور استبرق پہننے سے ( منع فرمایا تھا ) ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے شیبانی نے ، ان سے اشعث بن ابی الشعثاء نے ، ان سے معاویہ بن سوید بن مقرن نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنِ الشَّيْبَانِيِّ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ـ رضى الله عنهما ـ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَبْعٍ بِعِيَادَةِ الْمَرِيضِ، وَاتِّبَاعِ الْجَنَائِزِ، وَتَشْمِيتِ الْعَاطِسِ، وَنَصْرِ الضَّعِيفِ، وَعَوْنِ الْمَظْلُومِ، وَإِفْشَاءِ السَّلاَمِ، وَإِبْرَارِ الْمُقْسِمِ، وَنَهَى عَنِ الشُّرْبِ فِي الْفِضَّةِ، وَنَهَانَا عَنْ تَخَتُّمِ الذَّهَبِ، وَعَنْ رُكُوبِ الْمَيَاثِرِ، وَعَنْ لُبْسِ الْحَرِيرِ، وَالدِّيبَاجِ، وَالْقَسِّيِّ، وَالإِسْتَبْرَقِ‏.‏",
                "headingArabic": "إِفْشَاءِ السَّلاَمِ",
                "headingUrdu": "سلام کا فروغ",
                "headingEnglish": "Promotion of salutation",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5977,
                "hadithNumber": "6236",
                "englishNarrator": "Narrated 'Abdullah bin 'Amr رضی اللہ عنہ :",
                "hadithEnglish": "A man asked the Prophet, \"What Islamic traits are the best?\" The Prophet said, \"Feed the people, and greet those whom you know and those whom you do not know.\"",
                "hadithUrdu": "ایک صاحب نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا اسلام کی کون سی حالت افضل ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا یہ کہ ( مخلوق خدا کو ) کھا نا کھلاؤاورسلام کرو ، اسے بھی جسے تم پہچانتے ہو اور اسے بھی جسے نہیں پہچانتے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، کہا کہ مجھ سے یزید نے بیان کیا ، ان سے ابوالخیر نے ، ان سے عبداللہ بن عمر و رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي يَزِيدُ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَجُلاً، سَأَلَ النَّبِيَّ صلى الله عليه وسلم أَىُّ الإِسْلاَمِ خَيْرٌ قَالَ ‏ \"‏ تُطْعِمُ الطَّعَامَ، وَتَقْرَأُ السَّلاَمَ عَلَى مَنْ عَرَفْتَ، وَعَلَى مَنْ لَمْ تَعْرِفْ ‏\"‏‏.‏",
                "headingArabic": "السَّلاَمِ لِلْمَعْرِفَةِ وَغَيْرِ الْمَعْرِفَةِ",
                "headingUrdu": "سب کو سلام کرنا",
                "headingEnglish": "To greet everybody",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5951,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=238",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=236",
                "label": "236",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=237",
                "label": "237",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=238",
                "label": "238",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=239",
                "label": "239",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=240",
                "label": "240",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=241",
                "label": "241",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=242",
                "label": "242",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=240",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=240",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=238",
        "to": 5975,
        "total": 40465
    }
}