{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 252,
        "data": [
            {
                "id": 6278,
                "hadithNumber": "6541",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The people were displayed in front of me and I saw one prophet passing by with a large group of his followers, and another prophet passing by with only a small group of people, and another prophet passing by with only ten (persons), and another prophet passing by with only five (persons), and another prophet passed by alone. And then I looked and saw a large multitude of people, so I asked Gabriel, \"Are these people my followers?' He said, 'No, but look towards the horizon.' I looked and saw a very large multitude of people. Gabriel said. 'Those are your followers, and those are seventy thousand (persons) in front of them who will neither have any reckoning of their accounts nor will receive any punishment.' I asked, 'Why?' He said, 'For they used not to treat themselves with branding (cauterization) nor with Ruqya (get oneself treated by the recitation of some Verses of the Qur'an) and not to see evil omen in things, and they used to put their trust (only) in their Lord.\" On hearing that, 'Ukasha bin Mihsan رضی اللہ عنہ got up and said (to the Prophet), \"Invoke Allah to make me one of them.\" The Prophet (ﷺ) said, \"O Allah, make him one of them.\" Then another man got up and said (to the Prophet), \"Invoke Allah to make me one of them.\" The Prophet (ﷺ) said, 'Ukasha has preceded you.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میرے سامنے امتیں پیش کی گئیں کسی نبی کے ساتھ پوری امت گزری ، کسی نبی کے ساتھ چند آدمی گزرے ، کسی نبی کے ساتھ دس آدمی گزرے ، کسی نبی کے ساتھ پانچ آدمی گزرے اور کوئی نبی تنہا گزرا ۔ پھر میں نے دیکھا تو انسانوں کی ایک بہت بڑی جماعت دور سے نظر آئی ۔ میں نے جبرائیل سے پوچھا کیا یہ میری امت ہے ؟ انہوں نے کہا نہیں بلکہ افق کی طرف دیکھو ۔ میں نے دیکھا تو ایک بہت زبردست جماعت دکھائی دی ۔ فرمایا کہ یہ ہے آپ کی امت اور یہ جو آگے آگے سترہزار کی تعداد ہے ان لوگوں سے حساب نہ لیا جائے گا اور نہ ان پر عذاب ہو گا ۔ میں نے پوچھا ، ایسا کیوں ہو گا ؟ انہوں نے کہا کہ اس کی وجہ یہ ہے کہ یہ لوگ داغ نہیں لگواتے تھے ۔ دم جھاڑ نہیں کرواتے تھے ، شگون نہیں لیتے تھے ، اپنے رب پر بھروسہ کرتے تھے ۔ پھر آنحضرت صلی اللہ علیہ وسلم کی طرف عکاشہ بن محصن رضی اللہ عنہ اٹھ کر بڑھے اور عرض کیا کہ حضور دعا فرمائیں کہ اللہ تعالیٰ مجھے بھی ان لوگوں میں کر دے ۔ آنحضرت صلی اللہ علیہ وسلم نے دعا فرمائی کہ اے اللہ ! انہیں بھی ان میں سے کر دے ۔ اس کے بعدایک اور صحابی کھڑے ہوئے اور عرض کیا کہ میرے لیے بھی دعا فرمائیں کہ اللہ تعالیٰ مجھے بھی ان میں سے کر دے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ عکاشہ اس میں تم سے آگے بڑھ گئے ۔",
                "urduNarrator": "ہم سے عمران بن میسرہ نے بیان کیا ، کہا ہم سے محمد بن فضیل نے ، کہا ہم سے حصین بن عبدالرحمٰن نے بیان کیا ( دوسری سند ) اور مجھ سے اسید بن زید نے بیان کیا ، کہا ہم سے ہشیم نے بیان کیا کہ میں سعید بن جبیر کی خدمت میں موجود تھا اس وقت انہوں نے بیان کیا کہ مجھ سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا حُصَيْنٌ،‏.‏ وَحَدَّثَنِي أَسِيدُ بْنُ زَيْدٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ حُصَيْنٍ، قَالَ كُنْتُ عِنْدَ سَعِيدِ بْنِ جُبَيْرٍ فَقَالَ حَدَّثَنِي ابْنُ عَبَّاسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ عُرِضَتْ عَلَىَّ الأُمَمُ، فَأَخَذَ النَّبِيُّ يَمُرُّ مَعَهُ الأُمَّةُ، وَالنَّبِيُّ يَمُرُّ مَعَهُ النَّفَرُ، وَالنَّبِيُّ يَمُرُّ مَعَهُ الْعَشَرَةُ، وَالنَّبِيُّ يَمُرُّ مَعَهُ الْخَمْسَةُ، وَالنَّبِيُّ يَمُرُّ وَحْدَهُ، فَنَظَرْتُ فَإِذَا سَوَادٌ كَثِيرٌ قُلْتُ يَا جِبْرِيلُ هَؤُلاَءِ أُمَّتِي قَالَ لاَ وَلَكِنِ انْظُرْ إِلَى الأُفُقِ‏.‏ فَنَظَرْتُ فَإِذَا سَوَادٌ كَثِيرٌ‏.‏ قَالَ هَؤُلاَءِ أُمَّتُكَ، وَهَؤُلاَءِ سَبْعُونَ أَلْفًا قُدَّامَهُمْ، لاَ حِسَابَ عَلَيْهِمْ وَلاَ عَذَابَ‏.‏ قُلْتُ وَلِمَ قَالَ كَانُوا لاَ يَكْتَوُونَ، وَلاَ يَسْتَرْقُونَ، وَلاَ يَتَطَيَّرُونَ، وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ ‏\"‏‏.‏ فَقَامَ إِلَيْهِ عُكَّاشَةُ بْنُ مِحْصَنٍ فَقَالَ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اجْعَلْهُ مِنْهُمْ ‏\"‏‏.‏ ثُمَّ قَامَ إِلَيْهِ رَجُلٌ آخَرُ قَالَ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ قَالَ ‏\"‏ سَبَقَكَ بِهَا عُكَّاشَةُ ‏\"‏‏.‏",
                "headingArabic": "يَدْخُلُ الْجَنَّةَ سَبْعُونَ أَلْفًا بِغَيْرِ حِسَابٍ",
                "headingUrdu": "ستر ہزار بغیر حساب کے جنت میں داخل ہوں گے۔",
                "headingEnglish": "Seventy thousand will enter Paradise without accounts.",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6279,
                "hadithNumber": "6542",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"From my followers there will enter Paradise a crowd, seventy thousand in number, whose faces will glitter as the moon does when it is full.\" On hearing that, 'Ukasha bin Mihsan Al-Asdi رضی اللہ عنہ got up, lifting his covering sheet, and said, \"O Allah's Messenger (ﷺ)! Invoke Allah that He may make me one of them.\" The Prophet (ﷺ) said, \"O Allah, make him one of them.\" Another man from the Ansar got up and said, \"O Allah's Messenger (ﷺ)! Invoke Allah to make me one of them. \"The Prophet (ﷺ) said (to him), \"'Ukasha has preceded you.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میری امت کی ایک جماعت جنت میں داخل ہو گی جس کی تعداد ستر ہزار ہو گی ۔ ان کے چہرے اس طرح روشن ہوں گے جیسے چودہویں رات کا چاند روشن ہوتا ہے ۔ حضرت ابوہریرہ نے بیان کیا کہ اس پر حضرت عکاشہ بن محصن اسدی رضی اللہ عنہ کھڑے ہوئے ، اپنی دھاری دار کملی جو ان کے جسم پر تھی ، اٹھاتے ہوئے عرض کیا یا رسول اللہ ! اللہ تعالیٰ سے دعا کیجئے کہ مجھے بھی ان میں سے کر دے ۔ آنحضرت صلی اللہ علیہ وسلم نے دعا کی کہ اے اللہ ! انہیں بھی ان میں سے کر دے ۔ اس کے بعد ایک اور صحابی کھڑے ہوئے اور عرض کیا یا رسول اللہ ! دعا کیجئے کہ اللہ مجھے بھی ان میں سے کر دے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ عکاشہ تم پر سبقت لے گئے ۔",
                "urduNarrator": "ہم سے معاذ بن اسد مروزی نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس بن یزید بن خبر دی ، ان سے زہری نے بیان کیا ، کہا کہ مجھ سے سعید بن مسیب نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، حَدَّثَهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ يَدْخُلُ مِنْ أُمَّتِي زُمْرَةٌ هُمْ سَبْعُونَ أَلْفًا، تُضِيءُ وُجُوهُهُمْ إِضَاءَةَ الْقَمَرِ لَيْلَةَ الْبَدْرِ ‏\"‏‏.‏ وَقَالَ أَبُو هُرَيْرَةَ فَقَامَ عُكَّاشَةُ بْنُ مِحْصَنٍ الأَسَدِيُّ يَرْفَعُ نَمِرَةً عَلَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اجْعَلْهُ مِنْهُمْ ‏\"‏‏.‏ ثُمَّ قَامَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ‏.‏ فَقَالَ ‏\"‏ سَبَقَكَ عُكَّاشَةُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6280,
                "hadithNumber": "6543",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Seventy-thousand or seven-hundred thousand of my followers (the narrator is in doubt as to the correct number) will enter Paradise holding each other till the first and the last of them enter Paradise at the same time, and their faces will have a glitter like that of the moon at night when it is full.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جنت میں میری امت کے سترہزار یا سات لاکھ ( راوی کو ان میں سے کسی ایک تعداد میں شک تھا ) آدمی اس طرح داخل ہوں گے کہ بعض بعض کو پکڑے ہوئے ہوں گے اور اس طرح ان میں کے اگلے پچھلے سب جنت میں داخل ہو جائیں گے اور ان کے چہرے چودھویں رات کے چاند کی طرح روشن ہوں گے ۔",
                "urduNarrator": "ہم سے سعید بن ابو مریم نے بیان کیا ، کہا ہم سے ابوغسان نے بیان کیا ، کہا کہ مجھ سے ابوحازم نے بیان کیا ، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَيَدْخُلَنَّ الْجَنَّةَ مِنْ أُمَّتِي سَبْعُونَ أَلْفًا أَوْ سَبْعُمِائَةِ أَلْفٍ ـ شَكَّ فِي أَحَدِهِمَا ـ مُتَمَاسِكِينَ، آخِذٌ بَعْضُهُمْ بِبَعْضٍ، حَتَّى يَدْخُلَ أَوَّلُهُمْ وَآخِرُهُمُ الْجَنَّةَ، وَوُجُوهُهُمْ عَلَى ضَوْءِ الْقَمَرِ لَيْلَةَ الْبَدْرِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6281,
                "hadithNumber": "6544",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet; said, \"The people of Paradise will enter Paradise, and the people of the (Hell) Fire will enter the (Hell) Fire: then a call-maker will get up (and make an announcement) among them, 'O the people of the (Hell) Fire! No death anymore ! And O people of Paradise! No death (anymore) but Eternity.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب اہل جنت جنت میں اور اہل جہنم جہنم میں داخل ہو جائیں گے تو ایک آواز دینے والا ان کے درمیان کھڑا ہو کر پکارے گا کہ اے جہنم والو ! اب تمہیں موت نہیں آئے گی اور اے جنت والو ! تمہیں بھی موت نہیں آئے گی بلکہ ہمیشہ یہیں رہنا ہو گا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے یعقوب بن ابراہیم نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، ان سے صالح نے ، کہا ہم سے نافع نے بیان کیا اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، حَدَّثَنَا نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ، وَأَهْلُ النَّارِ النَّارَ، ثُمَّ يَقُومُ مُؤَذِّنٌ بَيْنَهُمْ يَا أَهْلَ النَّارِ لاَ مَوْتَ، وَيَا أَهْلَ الْجَنَّةِ لاَ مَوْتَ، خُلُودٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6282,
                "hadithNumber": "6545",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \" It will be said to the people of Paradise, 'O people of Paradise! Eternity (for you) and no death,' and to the people of the Fire, 'O people of the Fire, eternity (for you) and no death!\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اہل جنت سے کہا جائے گا کہ اے اہل جنت ! ہمیشہ ( تمہیں یہیں ) رہنا ہے ، تمہیں موت نہیں آئے گی اور اہل دوزخ سے کہا جائے گا کہ اے دوزخ والو ! ہمیشہ ( تم کو یہیں ) رہنا ہے ، تم کو موت نہیں آئے گی ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يُقَالُ لأَهْلِ الْجَنَّةِ خُلُودٌ لاَ مَوْتَ‏.‏ وَلأَهْلِ النَّارِ يَا أَهْلَ النَّارِ خُلُودٌ لاَ مَوْتَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6283,
                "hadithNumber": "6546",
                "englishNarrator": "Narrated `Imran رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I looked into paradise and saw that the majority of its people were the poor, and I looked into the Fire and found that the majority of its people were women.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے بیان کیا کہ میں نے جنت میں جھانک کردیکھا تو وہاں رہنے والے اکثر غریب لوگ تھے اور میں نے جہنم میں جھانک کر دیکھا ( شب معراج میں ) تو وہاں عورتیں تھیں ۔",
                "urduNarrator": "ہم سے عثمان بن ہثیم نے بیان کیا ، کہا ہم سے عوف بن ابی جمیلہ نے بیان کیا ، ان سے ابورجاء عمران عطاردی نے ، ان سے عمران بن حصین رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ، حَدَّثَنَا عَوْفٌ، عَنْ أَبِي رَجَاءٍ، عَنْ عِمْرَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ اطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ وَاطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏‏.‏",
                "headingArabic": "صِفَةِ الْجَنَّةِ وَالنَّارِ",
                "headingUrdu": "جنت اور آگ کی تفصیل",
                "headingEnglish": "The description of Paradise and the Fire",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6284,
                "hadithNumber": "6547",
                "englishNarrator": "Narrated Usama رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I stood at the gate of Paradise and saw that the majority of the people who had entered it were poor people, while the rich were forbidden (to enter along with the poor, because they were waiting the reckoning of their accounts), but the people of the Fire had been ordered to be driven to the Fire. And I stood at the gate of the Fire and found that the majority of the people entering it were women.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، میں جنت کے دروازے پر کھڑا ہوا تو وہاں اکثر داخل ہونے والے محتاج لوگ تھے اور محنت مزدوری کرنے والے تھے اور مالدار لوگ ایک طرف روکے گئے ہیں ، ان کا حساب لینے کے لیے باقی ہے اور جو لوگ دوزخی تھے وہ تو دوزخ کے لیے بھیج دئیے گئے اور میں نے جہنم کے دروازے پر کھڑے ہو کر دیکھا تو اس میں اکثر داخل ہونے والی عورتیں تھیں ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے اسماعیل بن ابراہیم نے بیان کیا ، کہا ہم سے سلیمان تیمی نے بیان کیا ، انہیں ابوعثمان نہدی نے ، انہیں اسامہ بن زید رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنْ أُسَامَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ قُمْتُ عَلَى باب الْجَنَّةِ فَكَانَ عَامَّةُ مَنْ دَخَلَهَا الْمَسَاكِينَ، وَأَصْحَابُ الْجَدِّ مَحْبُوسُونَ، غَيْرَ أَنَّ أَصْحَابَ النَّارِ قَدْ أُمِرَ بِهِمْ إِلَى النَّارِ، وَقُمْتُ عَلَى باب النَّارِ فَإِذَا عَامَّةُ مَنْ دَخَلَهَا النِّسَاءُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6285,
                "hadithNumber": "6548",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"When the people of Paradise have entered Paradise and the people of the Fire have entered the Fire, death will be brought and will be placed between the Fire and Paradise, and then it will be slaughtered, and a call will be made (that), 'O people of Paradise, no more death ! O people of the Fire, no more death ! ' So the people of Paradise will have happiness added to their previous happiness, and the people of the Fire will have sorrow added to their previous sorrow.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب اہل جنت جنت میں چلے جائیں گے اور اہل دوزخ دوزخ میں چلے جائیں گے تو موت کو لایا جائے گا اور اسے جنت اور دوزخ کے درمیان رکھ کر ذبح کر دیا جائے گا ۔ پھر ایک آواز دینے والا آواز دے گا کہ اے جنت والو ! تمہیں اب موت نہیں آئے گی اور اے دوزخ والو ! تمہیں بھی اب موت نہیں آئے گی ۔ اس بات سے جنتی اور زیادہ خوش ہو جائیں گے اور جہنمی اور زیادہ غمگین ہو جائیں گے ۔",
                "urduNarrator": "ہم سے معاذ بن اسد نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا ہم کو عمر بن محمد بن زید نے خبر دی ، انہیں ان کے والد نے ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عُمَرُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ أَبِيهِ، أَنَّهُ حَدَّثَهُ عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا صَارَ أَهْلُ الْجَنَّةِ إِلَى الْجَنَّةِ، وَأَهْلُ النَّارِ إِلَى النَّارِ، جِيءَ بِالْمَوْتِ حَتَّى يُجْعَلَ بَيْنَ الْجَنَّةِ وَالنَّارِ، ثُمَّ يُذْبَحُ، ثُمَّ يُنَادِي مُنَادٍ يَا أَهْلَ الْجَنَّةِ لاَ مَوْتَ، يَا أَهْلَ النَّارِ لاَ مَوْتَ، فَيَزْدَادُ أَهْلُ الْجَنَّةِ فَرَحًا إِلَى فَرَحِهِمْ‏.‏ وَيَزْدَادُ أَهْلُ النَّارِ حُزْنًا إِلَى حُزْنِهِمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6286,
                "hadithNumber": "6549",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Allah will say to the people of Paradise, 'O the people of Paradise!' They will say, 'Labbaik, O our Lord, and Sa`daik!' Allah will say, 'Are you pleased?\" They will say, 'Why should we not be pleased since You have given us what You have not given to anyone of Your creation?' Allah will say, 'I will give you something better than that.' They will reply, 'O our Lord! And what is better than that?' Allah will say, 'I will bestow My pleasure and contentment upon you so that I will never be angry with you after for-ever.' \"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ اہل جنت سے فرمائے گا کہ اے جنت والو ! جنتی جواب دیں گے ہم حاضر ہیں اے ہمارے پروردگار ! تیری سعادت حاصل کرنے کے لیے ۔ اللہ تعالیٰ پوچھے گا کیا اب تم لوگ خوش ہوئے ؟ وہ کہیں گے اب بھی بھلا ہم راضی نہ ہوں گے کیونکہ اب تو تو نے ہمیں وہ سب کچھ دے دیا جو اپنی مخلوق کے کسی آدمی کو نہیں دیا ۔ اللہ تعالیٰ فرمائے گا کہ میں تمہیں اس سے بھی بہتر چیز دوں گا ۔ جنتی کہیں گے اے رب ! اس سے بہتر اور کیا چیز ہو گی ؟ اللہ تعالیٰ فرمائے گا کہ اب میں تمہارے لیے اپنی رضامندی کو ہمیشہ کے لیے دائمی کر دوں گا یعنی اس کے بعد کبھی تم پر ناراض نہیں ہوں گا ۔",
                "urduNarrator": "ہم سے معاذ بن اسد نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو امام مالک بن انس نے خبر دی ، انہیں زید بن اسلم نے ، انہیں عطاء بن یسار نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ يَقُولُ لأَهْلِ الْجَنَّةِ يَا أَهْلَ الْجَنَّةِ‏.‏ يَقُولُونَ لَبَّيْكَ رَبَّنَا وَسَعْدَيْكَ‏.‏ فَيَقُولُ هَلْ رَضِيتُمْ فَيَقُولُونَ وَمَا لَنَا لاَ نَرْضَى وَقَدْ أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِنْ خَلْقِكَ‏.‏ فَيَقُولُ أَنَا أُعْطِيكُمْ أَفْضَلَ مِنْ ذَلِكَ‏.‏ قَالُوا يَا رَبِّ وَأَىُّ شَىْءٍ أَفْضَلُ مِنْ ذَلِكَ فَيَقُولُ أُحِلُّ عَلَيْكُمْ رِضْوَانِي فَلاَ أَسْخَطُ عَلَيْكُمْ بَعْدَهُ أَبَدًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6287,
                "hadithNumber": "6550",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Haritha رضی اللہ عنہ was martyred on the day (of the battle) of Badr while he was young. His mother came to the Prophet (ﷺ) saying, \"O Allah's Messenger (ﷺ)! You know the relation of Haritha رضی اللہ عنہ to me (how fond of him I was); so, if he is in Paradise, I will remain patient and wish for Allah's reward, but if he is not there, then you will see what I will do.\" The Prophet (ﷺ) replied, \"May Allah be merciful upon you! Have you gone mad? (Do you think) it is one Paradise? There are many Paradises and he is in the (most superior) Paradise of Al-Firdaus.\"",
                "hadithUrdu": "حارثہ بن سراقہ رضی اللہ عنہ بر کی لڑائی میں شہید ہو گئے ۔ وہ اس وقت نوعمر تھے تو ان کی والدہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آئیں اور عرض کیا یا رسول اللہ ! آپ کو معلوم ہے کہ حارثہ سے مجھے کتنی محبت تھی ، اگر وہ جنت میں ہے تو میں صبر کر لوں گی اور صبر پر ثواب کی امیدوار رہوں گی اور اگر کوئی اور بات ہے تو آپ دیکھیں گے کہ میں اس کے لیے کیا کرتی ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا افسوس کیا تم پاگل ہو گئی ہو ۔ جنت ایک ہی نہیں ہے ، بہت سی جنتیں ہیں اور وہ ( حارثہ رضی اللہ عنہ ) جنت الفردوس میں ہے ۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے معاویہ بن عمرو نے بیان کیا ، کہا ہم سے ابواسحاق ابراہیم بن محمد نے بیان کیا ، ان سے حمید طویل نے بیان کیا ، کہا کہ میں نے حضرت انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ حُمَيْدٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ أُصِيبَ حَارِثَةُ يَوْمَ بَدْرٍ وَهْوَ غُلاَمٌ، فَجَاءَتْ أُمُّهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ قَدْ عَرَفْتَ مَنْزِلَةَ حَارِثَةَ مِنِّي، فَإِنْ يَكُ فِي الْجَنَّةِ أَصْبِرْ وَأَحْتَسِبْ، وَإِنْ تَكُنِ الأُخْرَى تَرَى مَا أَصْنَعُ‏.‏ فَقَالَ ‏ \"‏ وَيْحَكِ ـ أَوَهَبِلْتِ ـ أَوَجَنَّةٌ وَاحِدَةٌ هِيَ جِنَانٌ كَثِيرَةٌ، وَإِنَّهُ لَفِي جَنَّةِ الْفِرْدَوْسِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6288,
                "hadithNumber": "6551",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The width between the two shoulders of a Kafir (disbeliever) will be equal to the distance covered by a fast rider in three days.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” کافر کے دونوں شانوں کے درمیان تیز چلنے والے کے لیے تین دن کی مسافت کا فاصلہ ہو گا “ ۔",
                "urduNarrator": "ہم سے معاذ بن اسد نے بیان کیا ، کہا ہم کو فصل بن موسیٰ نے خبر دی ، کہا ہم کو فضیل نے خبر دی ، انہیں حازم نے ، انہیں ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَاذُ بْنُ أَسَدٍ، أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى، أَخْبَرَنَا الْفُضَيْلُ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏مَا بَيْنَ مَنْكِبَىِ الْكَافِرِ مَسِيرَةُ ثَلاَثَةِ أَيَّامٍ لِلرَّاكِبِ الْمُسْرِعِ‏\"‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6289,
                "hadithNumber": "6552",
                "englishNarrator": "Narrated Sahl bin Sa'd رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"In Paradise there is a tree so big that in its shade a rider may travel for one hundred years without being able to cross it.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ” جنت میں ایک درخت ہے جس کے سایہ میں سوار سو سال تک چلنے کے بعد بھی اسے طے نہیں کر سکے گا “ ۔",
                "urduNarrator": "اور اسحاق بن ابراہیم نے بیان کیا ، انہوں نے کہا ہم کو مغیرہ بن سلمہ نے خبر دی ، انہوں نے کہا ہم سے وہیب نے بیان کیا ، ان سے ابوحازم نے بیان کیا ، ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا الْمُغِيرَةُ بْنُ سَلَمَةَ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ، لاَ يَقْطَعُهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6290,
                "hadithNumber": "6553",
                "englishNarrator": "Narrated Abu Sa'id رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said: There is a tree in Paradise (so huge) that a fast (or a trained) rider may travel: for one hundred years without being able to cross it.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” جنت میں ایک درخت ہو گا جس کے سایہ میں عمدہ اور تیز رفتار گھوڑے پر سوار شخص سو سال تک چلتا رہے گا اور پھر بھی اسے طے نہ کر سکے گا “ ۔",
                "urduNarrator": "ابوحازم نے بیان کیا کہ پھر میں نے یہ حدیث نعمان بن ابی عیاش سے بیان کی تو انہوں نے کہا کہ مجھ سے ابوسعید رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "قَالَ أَبُو حَازِمٍ فَحَدَّثْتُ بِهِ النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ، فَقَالَ حَدَّثَنِي أَبُو سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ الْجَوَادَ الْمُضَمَّرَ السَّرِيعَ مِائَةَ عَامٍ، مَا يَقْطَعُهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6291,
                "hadithNumber": "6554",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Seventy thousand or seven hundred thousand of my followers will enter Paradise. (Abu Hazim, the sub-narrator, is not sure as to which of the two numbers is correct.) They will be holding on to each other, the first will not entering the last one does, their faces like the moon on a full moon night.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، میری امت میں ستر ہزار یا سات لاکھ آدمی جنت میں جائیں گے ۔ راوی کو شک ہوا کہ سہل سے کون سی تعداد بیان ہوئی تھی ، ( وہ جنت میں اس طرح داخل ہوں گے کہ ) وہ ایک دوسرے کو تھامے ہوئے ہوں گے ۔ ان کا پہلا ابھی اندر داخل نہ ہونے پائے گا کہ جب تک آخری بھی داخل نہ ہو جائے ۔ ان کے چہرے چودھویں رات کے چاند کی طرح روشن ہوں گے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے عبدالعزیز بن ابی حازم نے بیان کیا ، ان سے ابوحازم بن دینار نے ، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيَدْخُلَنَّ الْجَنَّةَ مِنْ أُمَّتِي سَبْعُونَ أَوْ سَبْعُمِائَةِ أَلْفٍ ـ لاَ يَدْرِي أَبُو حَازِمٍ أَيُّهُمَا قَالَ ـ مُتَمَاسِكُونَ، آخِذٌ بَعْضُهُمْ بَعْضًا، لاَ يَدْخُلُ أَوَّلُهُمْ حَتَّى يَدْخُلَ آخِرُهُمْ، وُجُوهُهُمْ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6292,
                "hadithNumber": "6555",
                "englishNarrator": "Narrated Sahl رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The people of Paradise will see the Ghuraf (special abodes) in Paradise as you see a star in the sky.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جنت والے ( اپنے اوپر کے درجوں کے ) بالاخانوں کو اس طرح دیکھیں گے جیسے تم آسمان میں ستاروں کو دیکھتے ہو ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے عبدالعزیز بن ابی حازم نے بیان کیا ، ان سے ان کے والد حازم نے بیان کیا ، ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏إِنَّ أَهْلَ الْجَنَّةِ لَيَتَرَاءَوْنَ الْغُرَفَ فِي الْجَنَّةِ كَمَا تَتَرَاءَوْنَ الْكَوْكَبَ فِي السَّمَاءِ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6293,
                "hadithNumber": "6556",
                "englishNarrator": "Narrated Abu Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "\"As you see a glittering star remaining in the eastern horizon and the western horizon.\"",
                "hadithUrdu": "” جیسے تم مشرقی اور مغربی کناروں میں ڈوبتے ستاروں کو دیکھتے ہو “ ۔",
                "urduNarrator": "راوی ( عبدالعزیز ) نے بیان کیا کہ پھر میں نے یہ حدیث نعمان بن ابی عیاش سے بیان کی تو انہوں نے کہا کہ میں گواہی دیتا ہوں کہ میں نے حضرت ابو سعید خدری رضی اللہ عنہ کو یہ حدیث بیان کرتے سنا اور اس میں وہ اس لفظ کا اضافہ کرتے تھے کہ",
                "hadithArabic": "قَالَ أَبِي فَحَدَّثْتُ النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ، فَقَالَ أَشْهَدُ لَسَمِعْتُ أَبَا سَعِيدٍ يُحَدِّثُ وَيَزِيدُ فِيهِ ‏ \"‏ كَمَا تَرَاءَوْنَ الْكَوْكَبَ الْغَارِبَ فِي الأُفُقِ الشَّرْقِيِّ وَالْغَرْبِيِّ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6294,
                "hadithNumber": "6557",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah will say to the person who will have the minimum punishment in the Fire on the Day of Resurrection, 'If you had things equal to whatever is on the earth, would you ransom yourself (from the punishment) with it?' He will reply, Yes. Allah will say, 'I asked you a much easier thing than this while you were in the backbone of Adam, that is, not to worship others besides Me, but you refused and insisted to worship others besides Me.\"'",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اللہ تعالیٰ قیامت کے دن دوزخ کے سب سے کم عذاب پانے والے سے پوچھے گا ( یعنی ابوطالب سے ) اگر تمہیں روئے زمین کی ساری چیزیں میسر ہوں تو کیا تم ان کو فدیہ میں ( اس عذاب سے نجات پانے کے لیے ) دے دو گے ۔ وہ کہے گا کہ ہاں ۔ اللہ تعالیٰ فرمائے گا کہ میں نے تم سے اس سے بھی سہل چیز کا اس وقت مطالبہ کیا تھا جب تم آدم علیہ السلام کی پیٹھ میں تھے کہ میرے ساتھ کسی کو شریک نہ کرنا لیکن تم نے ( توحید کا ) انکار کیا اور نہ مانا آخر شرک ہی کیا ۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر محمد بن جعفر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابوعمران جونی نے بیان کیا ، کہا میں نے انس بن مالک رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَقُولُ اللَّهُ تَعَالَى لأَهْوَنِ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ لَوْ أَنَّ لَكَ مَا فِي الأَرْضِ مِنْ شَىْءٍ أَكُنْتَ تَفْتَدِي بِهِ فَيَقُولُ نَعَمْ‏.‏ فَيَقُولُ أَرَدْتُ مِنْكَ أَهْوَنَ مِنْ هَذَا وَأَنْتَ فِي صُلْبِ آدَمَ أَنْ لاَ تُشْرِكَ بِي شَيْئًا فَأَبَيْتَ إِلاَّ أَنْ تُشْرِكَ بِي ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6295,
                "hadithNumber": "6558",
                "englishNarrator": "Narrated Hammad from `Amr from Jabir رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Some people will come out of the Fire through intercession looking like The Thaarir.\" I asked `Amr, \"What is the Thaarir?\" He said, Ad Dagh`Abis, and at that time he was toothless. Hammad added: I said to `Amr bin Dinar, \"O Abu Muhammad! Did you hear Jabir bin `Abdullah رضی اللہ عنہما saying, 'I heard the Prophet (ﷺ) saying: 'Some people will come out of the Fire through intercession?\" He said, \"Yes. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کچھ لوگ دوزخ سے شفاعت کے ذریعہ نکالیں گے گویا کہ ” ثعاریر “ ہوں ۔ حماد کہتے ہیں کہ میں نے عمرو بن دینار سے پوچھا کہ ثعاریر کیا چیز ہے ؟ انہوں نے کہا کہ اس سے مراد چھوٹی ککڑیاں ہیں اور ہوا یہ تھا کہ آخر عمر میں عمرو بن دینار کے دانت گرگئے تھے ۔ حماد کہتے ہیں کہ میں نے عمرو بن دینار سے کہا اے ابومحمد ! ( یہ عمرو بن دینار کی کنیت ہے ) کیا آپ نے جابر بن عبداللہ رضی اللہ عنہما سے یہ سنا ہے ؟ انہوں نے بیان کیا کہ ہاں میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا کہ جہنم سے شفاعت کے ذریعہ لوگ نکلیں گے ؟ انہوں نے کہا ہاں بیشک سنا ہے ۔",
                "urduNarrator": "ہم سے ابوالنعمان محمد بن فضل سدوسی نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے عمرو بن دینار نے اور ان سے جابر بن عبداللہ انصاری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرٍو، عَنْ جَابِرٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ يَخْرُجُ مِنَ النَّارِ بِالشَّفَاعَةِ كَأَنَّهُمُ الثَّعَارِيرُ ‏\"‏‏.‏ قُلْتُ مَا الثَّعَارِيرُ قَالَ الضَّغَابِيسُ‏.‏ وَكَانَ قَدْ سَقَطَ فَمُهُ فَقُلْتُ لِعَمْرِو بْنِ دِينَارٍ أَبَا مُحَمَّدٍ سَمِعْتَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ يَخْرُجُ بِالشَّفَاعَةِ مِنَ النَّارِ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6296,
                "hadithNumber": "6559",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Some people will come out of the Fire after they have received a touch of the Fire, changing their color, and they will enter Paradise, and the people of Paradise will name them 'Al- Jahannamiyin' the (Hell) Fire people.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ایک جماعت جہنم سے نکلے گی اس کے بعد کہ جہنم کی آگ نے ان کو جلاڈالا ہو گا اور پھر وہ جنت میں داخل ہوں گے ۔ اہل جنت ان کو جہنمین کے نام سے یاد کریں گے ۔",
                "urduNarrator": "ہم سے ہدبہ بن خالد نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، ان سے قتادہ نے ، کہا ہم سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَخْرُجُ قَوْمٌ مِنَ النَّارِ بَعْدَ مَا مَسَّهُمْ مِنْهَا سَفْعٌ، فَيَدْخُلُونَ الْجَنَّةَ، فَيُسَمِّيهِمْ أَهْلُ الْجَنَّةِ الْجَهَنَّمِيِّينَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6297,
                "hadithNumber": "6560",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"When the people of Paradise have entered Paradise, and the people of the Fire have entered the Fire, Allah will say. 'Take out (of the Fire) whoever has got faith equal to a mustard seed in his heart.' They will come out, and by that time they would have burnt and became like coal, and then they will be thrown into the river of Al-Hayyat (life) and they will spring up just as a seed grows on the bank of a rainwater stream.\" The Prophet (ﷺ) said, \"Don't you see that the germinating seed comes out yellow and twisted?\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب اہل جنت جنت میں اور اہل جہنم جہنم میں داخل ہوچکیں گے تو اللہ تعالیٰ فرمائے گا کہ جس کے دل میں رائی کے دانہ کے برابر بھی ایمان ہو تو اسے دوزخ سے نکال لو ۔ اس وقت ایسے لوگ نکالے جائیں گے اور وہ اس وقت جل کر کوئلے کی طرح ہو گئے ہوں گے ۔ اس کے بعد انہیں ” نہر حیاۃ “ ( زندگی بخش دریا ) میں ڈالا جائے گا ۔ اس وقت وہ اس طرح تروتازہ اور شگفتہ ہو جائیں گے جس طرح سیلاب کی جگہ پر کوڑے کرکٹ کا دانہ ( اسی رات یا دن میں ) اگ آتا ہے یا راوی نے کہا ( حميل السيل کے بجائے ) حميۃ السيل کہا ہے ۔ یعنی جہاں سیلاب کا زور ہو اور نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کیا تم نے دیکھا نہیں کہ اس دانہ سے زرد رنگ کا لپٹا ہوا بارونق پودا اگتا ہے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، کہا ہم سے عمرو بن یحییٰ نے بیان کیا ، ان سے ان کے والد نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ، وَأَهْلُ النَّارِ النَّارَ يَقُولُ اللَّهُ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ فَأَخْرِجُوهُ‏.‏ فَيُخْرَجُونَ قَدِ امْتُحِشُوا وَعَادُوا حُمَمًا، فَيُلْقَوْنَ فِي نَهَرِ الْحَيَاةِ، فَيَنْبُتُونَ كَمَا تَنْبُتُ الْحِبَّةُ فِي حَمِيلِ السَّيْلِ ـ أَوْ قَالَ ـ حَمِيَّةِ السَّيْلِ ‏\"‏‏.‏ وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَلَمْ تَرَوْا أَنَّهَا تَنْبُتُ صَفْرَاءَ مُلْتَوِيَةً ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6298,
                "hadithNumber": "6561",
                "englishNarrator": "Narrated An-Nu`man رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"The person who will have the least punishment from amongst the Hell Fire people on the Day of Resurrection, will be a man under whose arch of the feet a smoldering ember will be placed so that his brain will boil because of it.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ قیامت کے دن عذاب کے اعتبار سے سب سے کم وہ شخص ہو گا جس کے دونوں قدموں کے نیچے آگ کا انگارہ رکھا جائے گا اور اس کی وجہ سے اس کا دماغ کھول رہا ہو گا ۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ میں نے ابواسحاق سبیعی سے سنا ، کہا کہ میں نے نعمان بن بشیر رضی اللہ عنہ سے سنا ، کہا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ أَبَا إِسْحَاقَ، قَالَ سَمِعْتُ النُّعْمَانَ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ لَرَجُلٌ تُوضَعُ فِي أَخْمَصِ قَدَمَيْهِ جَمْرَةٌ يَغْلِي مِنْهَا دِمَاغُهُ‏\"‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6299,
                "hadithNumber": "6562",
                "englishNarrator": "Narrated An-Nu`man bin Bashir رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"The least punished person of the (Hell) Fire people on the Day of Resurrection will be a man under whose arch of the feet two smoldering embers will be placed, because of which his brain will boil just like Al-Mirjal (copper vessel) or a Qum-qum (narrow-necked vessel) is boiling with water.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ قیامت کے دن دوزخمیوں میں عذاب کے اعتبار سے سب سے ہلکا عذاب پانے والا وہ شخص ہو گا جس کے دونوں پیروں کے نیچے دو انگارے رکھ دئیے جائیں گے جن کی وجہ سے اس کا دماغ کھول رہا ہو گا جس طرح ہانڈی اور کیتلی جوش کھاتی ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن رجاء نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے ابواسحاق نے ، ان سے نعمان بن بشیر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ رَجُلٌ عَلَى أَخْمَصِ قَدَمَيْهِ جَمْرَتَانِ يَغْلِي مِنْهُمَا دِمَاغُهُ، كَمَا يَغْلِي الْمِرْجَلُ وَالْقُمْقُمُ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6300,
                "hadithNumber": "6563",
                "englishNarrator": "Narrated `Adi bin Hatim رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) mentioned the Fire and turned his face aside and asked for Allah's protection from it, and then again he mentioned the Fire and turned his face aside and asked for Allah's protection from it and said, \"Protect yourselves from the Hell-Fire, even if with one half of a date, and he who cannot afford that, then (let him do so) by (saying) a good, pleasant word.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے جہنم کا ذکر کیا اور روئے مبارک پھیر لیا اور اس سے پناہ مانگی ۔ پھر جہنم کا ذکر کیا اور روئے مبارک پھیر لیا اور اس سے پناہ مانگی ۔ اس کے بعد فرمایا کہ دوزخ سے بچو صدقہ دے کر خواہ کھجور کے ایک ٹکڑے ہی کے ذریعہ ہو سکے ، جسے یہ بھی نہ ملے اسے چاہئے کہ اچھی بات کہہ کر ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عمرو بن مرہ نے ، ان سے خیثمہ بن عبدالرحمٰن نے اور ان سے عدی بن حاتم رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنْ خَيْثَمَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم ذَكَرَ النَّارَ فَأَشَاحَ بِوَجْهِهِ فَتَعَوَّذَ مِنْهَا، ثُمَّ ذَكَرَ النَّارَ فَأَشَاحَ بِوَجْهِهِ فَتَعَوَّذَ مِنْهَا، ثُمَّ قَالَ ‏ \"‏ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ، فَمَنْ لَمْ يَجِدْ فَبِكَلِمَةٍ طَيِّبَةٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6301,
                "hadithNumber": "6564",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ)s when his uncle, Abu Talib had been mentioned in his presence, saying, \"May be my intercession will help him (Abu Talib) on the Day of Resurrection so that he may be put in a shallow place in the Fire, with fire reaching his ankles and causing his brain to boil.\"",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم کے سامنے آپ کے چچا ابوطالب کا ذکر کیا گیا تھا ، تو آپ نے فرمایا ممکن ہے قیامت کے دن میری شفاعت ان کے کام آ جائے اور انہیں جہنم میں ٹخنوں تک رکھا جائے جس سے ان کا بھیجا کھولتا رہے گا ۔",
                "urduNarrator": "ہم سے ابراہیم بن حمزہ نے بیان کیا ، انہوں نے کہا ہم سے ابن ابی حازم اور دراوردی نے بیان کیا ، ان سے یزید بن عبداللہ بن ہاد نے بیان کیا ، ان سے عبداللہ بن خباب نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، وَالدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَذُكِرَ عِنْدَهُ عَمُّهُ أَبُو طَالِبٍ فَقَالَ ‏ \"‏ لَعَلَّهُ تَنْفَعُهُ شَفَاعَتِي يَوْمَ الْقِيَامَةِ فَيُجْعَلُ فِي ضَحْضَاحٍ مِنَ النَّارِ، يَبْلُغُ كَعْبَيْهِ، يَغْلِي مِنْهُ أُمُّ دِمَاغِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6302,
                "hadithNumber": "6565",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Allah will gather all the people on the Day of Resurrection and they will say, 'Let us request someone to intercede for us with our Lord so that He may relieve us from this place of ours.' Then they will go to Adam and say, 'You are the one whom Allah created with His Own Hands, and breathed in you of His soul, and ordered the angels to prostrate to you; so please intercede for us with our Lord.' Adam will reply, 'I am not fit for this undertaking, and will remember his sin, and will say, 'Go to Noah, the first Apostle sent by Allah' They will go to him and he will say, 'I am not fit for this undertaking', and will remember his sin and say, 'Go to Abraham whom Allah took as a Khalil. They will go to him (and request similarly). He will reply, 'I am not fit for this undertaking,' and will remember his sin and say, 'Go to Moses to whom Allah spoke directly.' They will go to Moses and he will say, 'I am not fit for this undertaking,' and will remember his sin and say, 'Go to Jesus.' They will go to him, and he will say, 'I am not fit for this undertaking, go to Muhammad as Allah has forgiven his past and future sins.' They will come to me and I will ask my Lord's permission, and when I see Him, I will fall down in prostration to Him, and He will leave me in that state as long as (He) Allah will, and then I will be addressed. 'Raise up your head (O Muhammad)! Ask, and your request will be granted, and say, and your saying will be listened to; intercede, and your intercession will be accepted.' Then I will raise my head, and I will glorify and praise my Lord with a saying(i.e. invocation) He will teach me, and then I will intercede, Allah will fix a limit for me (i.e., certain type of people for whom I may intercede), and I will take them out of the (Hell) Fire and let them enter Paradise. Then I will come back (to Allah) and fall in prostration, and will do the same for the third and fourth times till no-one remains in the (Hell) Fire except those whom the Qur'an has imprisoned therein.\" (The sub-narrator, Qatada used to say at that point, \"...those upon whom eternity (in Hell) has been imposed.\") (See Hadith No. 3, Vol 6).",
                "hadithUrdu": "رسول اکرم صلی اللہ علیہ وسلم نے فرمایا ، اللہ تعالیٰ قیامت کے دن لوگوں کو جمع کرے گا ۔ اس وقت لوگ کہیں گے کہ اگر ہم اپنے رب کے حضور میں کسی کی شفاعت لے جائیں تو نفع بخش ثابت ہو سکتی ہے ۔ ممکن ہے ہم اپنی اس حالت سے نجات پا جائیں ۔ چنانچہ لوگ آدم علیہ السلام کے پاس آئیں گے اور عرض کریں گے آپ ہی وہ بزرگ نبی ہیں جنہیں اللہ تعالیٰ نے اپنے ہاتھ سے بنایا اور آپ کے اندر اپنی چھپائی ہوئی روح پھونکی اور فرشتوں کو حکم دیا تو انہوں نے آپ کو سجدہ کیا ، آپ ہمارے رب کے حضور میں ہماری شفاعت کریں ۔ وہ کہیں گے کہ میں تو اس لائق نہیں ہوں ، پھر وہ اپنی لغزش یاد کریں گے اور کہیں گے کہ نوح کے پاس جاؤ ، وہ سب سے پہلے رسول ہیں جنہیں اللہ تعالیٰ نے بھیجا ۔ لوگ نوح کے پاس آئیں گے لیکن وہ بھی یہی جواب دیں گے کہ میں اس لائق نہیں ہوں ۔ وہ اپنی لغزش کا ذکر کریں گے اور کہیں کہ تم ابراہیم کے پاس جاؤ جنہیں اللہ تعالیٰ نے اپنا خلیل بنایا تھا ۔ لوگ ان کے پاس آئیں گے لیکن یہ بھی یہی کہیں گے کہ میں اس لائق نہیں ہوں ، اپنی خطا کا ذکر کریں گے اور کہیں گے کہ تم لوگ موسیٰ کے پاس جاؤ جن سے اللہ تعالیٰ نے کلام کیا تھا ۔ لوگ موسیٰ علیہ السلام کے پاس جائیں گے لیکن وہ بھی یہی جواب دیں گے کہ میں اس لائق نہیں ہوں ، اپنی خطا کا ذکر کریں گے اور کہیں گے کہ عیسیٰ کے پاس جاؤ ۔ لوگ عیسیٰ علیہ السلام کے پاس جائیں گے ، لیکن یہ بھی کہیں گے کہ میں اس لائق نہیں ہوں ، محمد صلی اللہ علیہ وسلم کے پاس جاؤ کیونکہ ان کے تمام اگلے پچھلے گناہ معاف کر دئیے گئے ہیں ۔ چنانچہ لوگ میرے پاس آئیں گے ۔ اس وقت میں اپنے رب سے ( شفاعت کی ) اجازت چاہوں گا اور سجدہ میں گرجاؤں گا ۔ اللہ تعالیٰ جتنی دیر تک چاہے گا مجھے سجدہ میں رہنے دے گا ۔ پھر کہا جائے گا کہ اپنا سراٹھالو ، مانگو ، دیا جائے گا ، کہو ، سنا جائے گا ، شفاعت کرو ، شفاعت قبول کی جائے گی ۔ میں اپنے رب کی اس وقت ایسی حمد بیان کروں گا کہ جو اللہ تعالیٰ مجھے سکھائے گا ۔ پھر شفاعت کروں گا اور میرے لیے حد مقرر کر دی جائے گی اور میں لوگوں کو جہنم سے نکال کر جنت میں داخل کر دوں گا اور اسی طرح سجدہ میں گرجاؤں گا ، تیسری یا چوتھی مرتبہ جہنم میں صرف وہی لوگ باقی رہ جائیں گے جنہیں قرآن نے روکا ہے ( یعنی جن کے جہنم میں ہمیشہ رہنے کا ذکر قرآن میں صراحت کے ساتھ ہے ) قتادہ رحمہ اللہ اس موقع پر کہا کرتے کہ اس سے وہ لوگ مراد ہیں جن پر جہنم ہمیشہ رہنا واجب ہو گیا ہے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے ابوعوانہ نے ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَجْمَعُ اللَّهُ النَّاسَ يَوْمَ الْقِيَامَةِ فَيَقُولُونَ لَوِ اسْتَشْفَعْنَا عَلَى رَبِّنَا حَتَّى يُرِيحَنَا مِنْ مَكَانِنَا‏.‏ فَيَأْتُونَ آدَمَ فَيَقُولُونَ أَنْتَ الَّذِي خَلَقَكَ اللَّهُ بِيَدِهِ، وَنَفَخَ فِيكَ مِنْ رُوحِهِ، وَأَمَرَ الْمَلاَئِكَةَ فَسَجَدُوا لَكَ، فَاشْفَعْ لَنَا عِنْدَ رَبِّنَا‏.‏ فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ خَطِيئَتَهُ وَيَقُولُ ـ ائْتُوا نُوحًا أَوَّلَ رَسُولٍ بَعَثَهُ اللَّهُ‏.‏ فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ خَطِيئَتَهُ ـ ائْتُوا إِبْرَاهِيمَ الَّذِي اتَّخَذَهُ اللَّهُ خَلِيلاً‏.‏ فَيَأْتُونَهُ، فَيَقُولُ لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ خَطِيئَتَهُ ـ ائْتُوا مُوسَى الَّذِي كَلَّمَهُ اللَّهُ فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ، فَيَذْكُرُ خَطِيئَتَهُ ـ ائْتُوا عِيسَى فَيَأْتُونَهُ فَيَقُولُ لَسْتُ هُنَاكُمْ، ائْتُوا مُحَمَّدًا صلى الله عليه وسلم فَقَدْ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ فَيَأْتُونِي فَأَسْتَأْذِنُ عَلَى رَبِّي، فَإِذَا رَأَيْتُهُ وَقَعْتُ سَاجِدًا، فَيَدَعُنِي مَا شَاءَ اللَّهُ، ثُمَّ يُقَالُ ارْفَعْ رَأْسَكَ، سَلْ تُعْطَهْ، وَقُلْ يُسْمَعْ، وَاشْفَعْ تُشَفَّعْ‏.‏ فَأَرْفَعُ رَأْسِي، فَأَحْمَدُ رَبِّي بِتَحْمِيدٍ يُعَلِّمُنِي، ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا، ثُمَّ أُخْرِجُهُمْ مِنَ النَّارِ، وَأُدْخِلُهُمُ الْجَنَّةَ، ثُمَّ أَعُودُ فَأَقَعُ سَاجِدًا مِثْلَهُ فِي الثَّالِثَةِ أَوِ الرَّابِعَةِ حَتَّى مَا بَقِيَ فِي النَّارِ إِلاَّ مَنْ حَبَسَهُ الْقُرْآنُ ‏\"‏‏.‏ وَكَانَ قَتَادَةُ يَقُولُ عِنْدَ هَذَا أَىْ وَجَبَ عَلَيْهِ الْخُلُودُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 6276,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=251",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=249",
                "label": "249",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=250",
                "label": "250",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=251",
                "label": "251",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=252",
                "label": "252",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=253",
                "label": "253",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=254",
                "label": "254",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=255",
                "label": "255",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=253",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=253",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=251",
        "to": 6300,
        "total": 40465
    }
}