{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 235,
        "data": [
            {
                "id": 5853,
                "hadithNumber": "6109",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) entered upon me while there was a curtain having pictures (of animals) in the house. His face got red with anger, and then he got hold of the curtain and tore it into pieces. The Prophet (ﷺ) said, \"Such people as paint these pictures will receive the severest punishment on the Day of Resurrection .\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم اندر تشریف لائے اور گھر میں ایک پردہ لٹکا ہوا تھا جس پر تصویریں تھیں ۔ آنحضرت صلی اللہ علیہ وسلم کے چہرے کا رنگ بدل گیا ۔ پھر آپ نے پردہ پکڑا اور اسے پھاڑ دیا ۔ ام المؤمنین نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، قیامت کے دن ان لوگوں پر سب سے زیادہ عذاب ہو گا ، جو یہ صورتیں بناتے ہیں ۔",
                "urduNarrator": "ہم سے بسرہ بن صفوان نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے قاسم نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَسَرَةُ بْنُ صَفْوَانَ، حَدَّثَنَا إِبْرَاهِيمُ، عَنِ الزُّهْرِيِّ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَفِي الْبَيْتِ قِرَامٌ فِيهِ صُوَرٌ، فَتَلَوَّنَ وَجْهُهُ، ثُمَّ تَنَاوَلَ السِّتْرَ فَهَتَكَهُ، وَقَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مِنْ أَشَدِّ النَّاسِ عَذَابًا يَوْمَ الْقِيَامَةِ الَّذِينَ يُصَوِّرُونَ هَذِهِ الصُّوَرَ ‏\"‏‏.‏",
                "headingArabic": "مَا يَجُوزُ مِنَ الْغَضَبِ وَالشِّدَّةِ لأَمْرِ اللَّهِ",
                "headingUrdu": "اللہ کے لیے جب کوئی ناراض ہو یا سخت ہو تو کیا کہا جائے؟",
                "headingEnglish": "What to say when one is angry or harsh for Allah's sake",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5854,
                "hadithNumber": "6110",
                "englishNarrator": "Narrated Abu Mas`ud رضی اللہ عنہ :",
                "hadithEnglish": "A man came to the Prophet (ﷺ) and said \"I keep away from the morning prayer only because such and such person prolongs the prayer when he leads us in it. The narrator added: I had never seen Allah's Apostle more furious in giving advice than he was on that day. He said, \"O people! There are some among you who make others dislike good deeds) cause the others to have aversion (to congregational prayers). Beware! Whoever among you leads the people in prayer should not prolong it, because among them there are the sick, the old, and the needy.\" (See Hadith No. 670, Vol 1)",
                "hadithUrdu": "ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا میں صبح کی نماز جماعت سے فلاں امام کی وجہ سے نہیں پڑھتا کیونکہ وہ بہت لمبی نماز پڑھاتے ہیں ۔ انہوں نے کہا کہ اس دن ان امام صاحب کو نصیحت کرنے میں آنحضرت صلی اللہ علیہ وسلم کو میں نے جتنا غصہ میں دیکھا ایسا میں نے آپ کو کبھی نہیں دیکھا تھا ، پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا اے لوگو ! تم میں سے کچھ لوگ ( نماز با جماعت پڑھنے سے ) لوگوں کو دور کرنے والے ہیں ، پس جو شخص بھی لوگوں کو نماز پڑھائے مختصر پڑھائے ، کیونکہ نمازیوں میں کوئی بیمار ہوتا ہے کوئی بوڑھا کوئی کام کاج والا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے اسماعیل بن ابی خالد نے بیان کیا ، کہا ہم سے قیس بن ابی حازم نے اور ان سے ابومسعود رضی اللہ عنہ ے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، حَدَّثَنَا قَيْسُ بْنُ أَبِي حَازِمٍ، عَنْ أَبِي مَسْعُودٍ ـ رضى الله عنه ـ قَالَ أَتَى رَجُلٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَ إِنِّي لأَتَأَخَّرُ عَنْ صَلاَةِ الْغَدَاةِ مِنْ أَجْلِ فُلاَنٍ مِمَّا يُطِيلُ بِنَا قَالَ فَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَطُّ أَشَدَّ غَضَبًا فِي مَوْعِظَةٍ مِنْهُ يَوْمَئِذٍ قَالَ فَقَالَ ‏ \"‏ يَا أَيُّهَا النَّاسُ إِنَّ مِنْكُمْ مُنَفِّرِينَ، فَأَيُّكُمْ مَا صَلَّى بِالنَّاسِ فَلْيَتَجَوَّزْ، فَإِنَّ فِيهِمُ الْمَرِيضَ وَالْكَبِيرَ وَذَا الْحَاجَةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5855,
                "hadithNumber": "6111",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "While the Prophet (ﷺ) was praying, he saw sputum (on the wall) of the mosque, in the direction of the Qibla, and so he scraped it off with his hand, and the sign of disgust (was apparent from his face) and then said, \"Whenever anyone of you is in prayer, he should not spit in front of him (in prayer) because Allah is in front of him.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نماز پڑھ رہے تھے کہ آپ نے مسجد میں قبلہ کی جانب منہ کا تھوک دیکھا ۔ پھر آپ نے اسے اپنے ہاتھ سے صاف کیا اور غصہ ہوئے پھر فرمایا جب تم میں سے کوئی شخص نماز میں ہوتا ہے اللہ تعالیٰ اس کے سامنے ہوتا ہے ۔ اس لیے کوئی شخص نماز میں اپنے سامنے نہ تھوکے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے جویریہ نے بیان کیا ، ان سے نافع نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ بَيْنَا النَّبِيُّ صلى الله عليه وسلم يُصَلِّي رَأَى فِي قِبْلَةِ الْمَسْجِدِ نُخَامَةً، فَحَكَّهَا بِيَدِهِ، فَتَغَيَّظَ ثُمَّ قَالَ ‏ \"‏ إِنَّ أَحَدَكُمْ إِذَا كَانَ فِي الصَّلاَةِ فَإِنَّ اللَّهَ حِيَالَ وَجْهِهِ، فَلاَ يَتَنَخَّمَنَّ حِيَالَ وَجْهِهِ فِي الصَّلاَةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5856,
                "hadithNumber": "6112",
                "englishNarrator": "Narrated Zaid bin Khalid Al-Juhani:",
                "hadithEnglish": "A man asked Allah's Messenger (ﷺ) about \"Al-Luqata\" (a lost fallen purse or a thing picked up by somebody). The Prophet (ﷺ) said, \"You should announce it publicly for one year, and then remember and recognize the tying material of its container, and then you can spend it. If its owner came to you, then you should pay him its equivalent.\" The man said, \"O Allah's Messenger (ﷺ)! What about a lost sheep?\" The Prophet said, \"Take it because it is for you, for your brother, or for the wolf.\" The man again said, \"O Allah's Messenger (ﷺ)! What about a lost camel?\" Allah's Messenger (ﷺ) became very angry and furious and his cheeks became red (or his face became red), and he said, \"You have nothing to do with it (the camel) for it has its food and its water container with it till it meets its owner.\"",
                "hadithUrdu": "ایک صاحب نے رسول اللہ صلی اللہ علیہ وسلم سے لقطہٰ ( راستہ میں گری پڑی چیز جسے کسی نے اٹھا لیا ہو ) کے متعلق پوچھا تو آپ نے فرمایا سال بھر لوگوں سے پوچھتے رہو پھر اس کا سر بند ھن اور ظرف پہچان کے رکھ اور خرچ کر ڈال ۔ پھر اگر اس کے بعد اس کا مالک آ جائے تو وہ چیز اسے آپس کر دے ۔ پوچھا یا رسول اللہ ! بھولی بھٹکی بکری کے متعلق کیا حکم ہے ؟ آپ نے فرمایا کہ اسے پکڑ لا کیونکہ وہ تمہارے بھائی کی ہے یا پھر بھیڑ یئے کی ہو گی ۔ پوچھا یا رسول اللہ ! اور کھویا ہوا اونٹ ؟ بیان کیا کہ اس پر آنحضرت صلی اللہ علیہ وسلم ناراض ہو گئے اور آپ کے دونوں رخسار سرخ ہو گئے ، یا راوی نے یوں کہا کہ آپ کا چہرہ سرخ ہو گیا ، پھر آپ نے فرمایا تمہیں اس اونٹ سے کیا غرض ہے اس کے سا تھ تو اس کے پاؤں ہیں اور اس کا پانی ہے وہ کبھی نہ کبھی اپنے مالک کو پا لے گا ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو اسماعیل بن جعفر نے خبر دی ، کہا ہم کو ربیعہ بن ابی عبدالرحمٰن نے خبر دی ، انہیں زید بن خالد جہنی نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، أَخْبَرَنَا رَبِيعَةُ بْنُ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ اللُّقَطَةِ فَقَالَ ‏\"‏ عَرِّفْهَا سَنَةً، ثُمَّ اعْرِفْ وِكَاءَهَا وَعِفَاصَهَا، ثُمَّ اسْتَنْفِقْ بِهَا، فَإِنْ جَاءَ رَبُّهَا فَأَدِّهَا إِلَيْهِ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ فَضَالَّةُ الْغَنَمِ قَالَ ‏\"‏ خُذْهَا، فَإِنَّمَا هِيَ لَكَ، أَوْ لأَخِيكَ، أَوْ لِلذِّئْبِ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ فَضَالَّةُ الإِبِلِ قَالَ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى احْمَرَّتْ وَجْنَتَاهُ ـ أَوِ احْمَرَّ وَجْهُهُ ـ ثُمَّ قَالَ ‏\"‏ مَالَكَ وَلَهَا، مَعَهَا حِذَاؤُهَا وَسِقَاؤُهَا، حَتَّى يَلْقَاهَا رَبُّهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5857,
                "hadithNumber": "6113",
                "englishNarrator": "Narrated Zaid bin Thabit رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) made a small room (with a palm leaf mat). Allah's Messenger (ﷺ) came out (of his house) and prayed in it. Some men came and joined him in his prayer. Then again the next night they came for the prayer, but Allah's Messenger (ﷺ) delayed and did not come out to them. So they raised their voices and knocked the door with small stones (to draw his attention). He came out to them in a state of anger, saying, \"You are still insisting (on your deed, i.e. Tarawih prayer in the mosque) that I thought that this prayer (Tarawih) might become obligatory on you. So you people, offer this prayer at your homes, for the best prayer of a person is the one which he offers at home, except the compulsory (congregational) prayer.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے کھجور کی شاخوں یا بوریئے سے ایک مکان چھوٹے سے حجرے کی طرح بنا لیا تھا ۔ وہاں آ کر آپ تہجد کی نماز پڑھا کرتے تھے ، چند لوگ بھی وہاں آ گئے اور انہوں نے آپ کی اقتداء میں نماز پڑھی پھر سب لوگ دوسری رات بھی آ گئے اور ٹھہرے رہے لیکن آپ گھر ہی میں رہے اور باہر ان کے پاس تشریف نہیں لائے ۔ لوگ آواز بلند کرنے لگے اور دروازے پر کنکریاں ماریں تو آنحضرت صلی اللہ علیہ وسلم غصہ کی حالت میں باہر تشریف لائے اور فرمایا تم چاہتے ہو کہ ہمیشہ یہ نماز پڑھتے رہو تاکہ تم پر فرض ہو جائے ( اس وقت مشکل ہو ) دیکھو تم نفل نمازیں اپنے گھروں میں ہی پڑھا کرو ۔ کیونکہ فرض نمازوں کے سوا آدمی کی بہترین نفل نماز وہ ہے جو گھر میں پڑھی جائے ۔",
                "urduNarrator": "اور مکی بن ابراہیم نے بیان کیا انہوں نے کہا کہ ہم سے عبداللہ بن سعید نے بیان کیا ( دوسری سند ) حضرت امام بخاری نے کہا اورمجھ سے محمد بن زیاد نے بیان کیا ، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا ، انہوں نے کہا ہم سے عبداللہ بن سعید نے بیان کیا ، انہوں نے کہا کہ مجھ سے عمر بن عبیداللہ کے غلام سالم ابو النضر نے بیان کیا ، ان سے بسر بن سعید نے بیان کیا اور ان سے زید بن ثابت رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ الْمَكِّيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ،‏.‏ وَحَدَّثَنِي مُحَمَّدُ بْنُ زِيَادٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنِي سَالِمٌ أَبُو النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ ـ رضى الله عنه ـ قَالَ احْتَجَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم حُجَيْرَةً مُخَصَّفَةً أَوْ حَصِيرًا، فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي فِيهَا، فَتَتَبَّعَ إِلَيْهِ رِجَالٌ وَجَاءُوا يُصَلُّونَ بِصَلاَتِهِ، ثُمَّ جَاءُوا لَيْلَةً فَحَضَرُوا وَأَبْطَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْهُمْ، فَلَمْ يَخْرُجْ إِلَيْهِمْ فَرَفَعُوا أَصْوَاتَهُمْ وَحَصَبُوا الْبَابَ، فَخَرَجَ إِلَيْهِمْ مُغْضَبًا فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا زَالَ بِكُمْ صَنِيعُكُمْ حَتَّى ظَنَنْتُ أَنَّهُ سَيُكْتَبُ عَلَيْكُمْ، فَعَلَيْكُمْ بِالصَّلاَةِ فِي بُيُوتِكُمْ، فَإِنَّ خَيْرَ صَلاَةِ الْمَرْءِ فِي بَيْتِهِ، إِلاَّ الصَّلاَةَ الْمَكْتُوبَةَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5858,
                "hadithNumber": "6114",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The strong is not the one who overcomes the people by his strength, but the strong is the one who controls himself while in anger.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا پہلوان وہ نہیں ہے جو کشتی لڑنے میں غالب ہو جائے بلکہ اصلی پہلوان تو وہ ہے جو غصہ کی حالت میں اپنے آپ پر قابو پائے ۔ بے قابو نہ ہو جائے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں سعید بن مسیب نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ، إِنَّمَا الشَّدِيدُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ ‏\"‏‏.‏",
                "headingArabic": "الْحَذَرِ مِنَ الْغَضَبِ",
                "headingUrdu": "غصے سے ہوشیار رہنا",
                "headingEnglish": "To be cautious from being angry",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5859,
                "hadithNumber": "6115",
                "englishNarrator": "Narrated Sulaiman bin Sarad رضی اللہ عنہ :",
                "hadithEnglish": "Two men abused each other in front of the Prophet (ﷺ) while we were sitting with him. One of the two abused his companion furiously and his face became red. The Prophet (ﷺ) said, \"I know a word (sentence) the saying of which will cause him to relax if this man says it. Only if he said, \"I seek refuge with Allah from Satan, the outcast.' \" So they said to that (furious) man, 'Don't you hear what the Prophet (ﷺ) is saying?\" He said, \"I am not mad.\"",
                "hadithUrdu": "دو آدمیوں نے نبی کریم صلی اللہ علیہ وسلم کی موجودگی میں جھگڑا کیا ، ہم بھی آنحضرت صلی اللہ علیہ وسلم کی خدمت میں بیٹھے ہوئے تھے ۔ ایک شخص دوسرے کو غصہ کی حالت میں گالی دے رہا تھا اور اس کا چہرہ سرخ تھا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں ایک ایسا کلمہ جانتا ہوں کہ اگر یہ شخص اسے کہہ لے تو اس کا غصہ دور ہو جائے ۔ اگر یہ ” اعوذ باللہ من الشیطان الرجیم “ کہہ لے ۔ صحابہ نے اس سے کہا کہ سنتے نہیں ، حضور اکرم صلی اللہ علیہ وسلم کیا فرما رہے ہیں ؟ اس نے کہا کہ کیا میں دیوانہ ہوں ؟",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے اعمش نے ، ان سے عدی بن ثابت نے ، ان سے سلیمان بن صرد رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ صُرَدٍ، قَالَ اسْتَبَّ رَجُلاَنِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم وَنَحْنُ عِنْدَهُ جُلُوسٌ، وَأَحَدُهُمَا يَسُبُّ صَاحِبَهُ مُغْضَبًا قَدِ احْمَرَّ وَجْهُهُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنِّي لأَعْلَمُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ عَنْهُ مَا يَجِدُ لَوْ قَالَ أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ ‏\"‏‏.‏ فَقَالُوا لِلرَّجُلِ أَلاَ تَسْمَعُ مَا يَقُولُ النَّبِيُّ صلى الله عليه وسلم قَالَ إِنِّي لَسْتُ بِمَجْنُونٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5860,
                "hadithNumber": "6116",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "A man said to the Prophet (ﷺ) , \"Advise me! \"The Prophet (ﷺ) said, \"Do not become angry and furious.\" The man asked (the same) again and again, and the Prophet (ﷺ) said in each case, \"Do not become angry and furious.\"",
                "hadithUrdu": "ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے عرض کیا کہ مجھے آپ کوئی نصیحت فرما دیجئیے آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ غصہ نہ ہوا کر ۔ انہوں نے کئی مرتبہ یہ سوال کیا اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ غصہ نہ ہوا کر ۔",
                "urduNarrator": "مجھ سے یحییٰ بن یوسف نے بیان کیا ، کہا ہم کو ابوبکرنے خبر دی جو ابن عیاش ہیں ، انہیں ابو حصین نے ، انہیں ابوصالح نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ يُوسُفَ، أَخْبَرَنَا أَبُو بَكْرٍ ـ هُوَ ابْنُ عَيَّاشٍ ـ عَنْ أَبِي حَصِينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَجُلاً، قَالَ لِلنَّبِيِّ صلى الله عليه وسلم أَوْصِنِي‏.‏ قَالَ ‏\"‏ لاَ تَغْضَبْ ‏\"‏‏.‏ فَرَدَّدَ مِرَارًا، قَالَ ‏\"‏ لاَ تَغْضَبْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5861,
                "hadithNumber": "6117",
                "englishNarrator": "Narrated `Imran bin Husain:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Haya' (pious shyness from committing religeous indiscretions) does not bring anything except good.\" Thereupon Bashir bin Ka`b said, 'It is written in the wisdom paper: Haya' leads to solemnity; Haya' leads to tranquility (peace of mind).\" `Imran said to him, \"I am narrating to you the saying of Allah's Messenger (ﷺ) and you are speaking about your paper (wisdom book)?\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا حیاء سے ہمیشہ بھلائی پیدا ہوتی ہے ۔ اس پر بشیر بن کعب نے کہا کہ حکمت کی کتابوں میں لکھا ہے کہ حیاء سے وقار حاصل ہوتا ہے ، حیاء سے سکینت حاصل ہوتی ہے ۔ عمران نے ان سے کہا میں تجھ سے رسول اللہ صلی اللہ علیہ وسلم کی حدیث بیان کرتا ہوں اور تو اپنی ( دو ورقی ) کتاب کی باتیں مجھ کو سناتا ہے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے ان سے ابو السوا ر عدوی نے بیان کیا ، کہا کہ میں نے عمران بن حصین سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي السَّوَّارِ الْعَدَوِيِّ، قَالَ سَمِعْتُ عِمْرَانَ بْنَ حُصَيْنٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ الْحَيَاءُ لاَ يَأْتِي إِلاَّ بِخَيْرٍ ‏\"‏‏.‏ فَقَالَ بُشَيْرُ بْنُ كَعْبٍ مَكْتُوبٌ فِي الْحِكْمَةِ إِنَّ مِنَ الْحَيَاءِ وَقَارًا، وَإِنَّ مِنَ الْحَيَاءِ سَكِينَةً‏.‏ فَقَالَ لَهُ عِمْرَانُ أُحَدِّثُكَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَتُحَدِّثُنِي عَنْ صَحِيفَتِكَ‏.‏",
                "headingArabic": "الْحَيَاءِ",
                "headingUrdu": "شائستگی",
                "headingEnglish": "Modesty",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5862,
                "hadithNumber": "6118",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) passed by a man who was admonishing his brother regarding Haya' (pious shyness from committing religeous indiscretions) and was saying, \"You are very shy, and I am afraid that might harm you.\" On that, Allah's Messenger (ﷺ) said, \"Leave him, for Haya' is (a part) of Faith.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کا گزر ایک شخص پر سے ہوا جو اپنے بھائی پر حیاء کی وجہ سے ناراض ہو رہا تھا اور کہہ رہا تھا کہ تم بہت شرماتے ہو ، گویا وہ کہہ رہا تھا کہ تم اس کی وجہ سے اپنا نقصان کر لیتے ہو ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اسے چھوڑ دو کہ حیاء ایمان میں سے ہے ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، انہوں نے کہا ہم سے عبدالعزیز بن ابوسلمہ نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے سالم نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما مَرَّ النَّبِيُّ صلى الله عليه وسلم عَلَى رَجُلٍ وَهْوَ يُعَاتَبُ فِي الْحَيَاءِ يَقُولُ إِنَّكَ لَتَسْتَحْيِي‏.‏ حَتَّى كَأَنَّهُ يَقُولُ قَدْ أَضَرَّ بِكَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ دَعْهُ فَإِنَّ الْحَيَاءَ مِنَ الإِيمَانِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5863,
                "hadithNumber": "6119",
                "englishNarrator": "Narrated Abu Sa`id:",
                "hadithEnglish": null,
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم پردہ میں رہنے والی کنواری لڑکی سے بھی زیادہ حیاء والے تھے ۔",
                "urduNarrator": "ہم سے علی بن الجعد نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں قتادہ نے ، انہیں انس رضی اللہ عنہ کے غلام قتادہ نے ، ابوعبداللہ حضرت امام بخاری رحمہ اللہ نے کہا کہ ان کا نام عبداللہ بن ابی عتبہ ہے ، میں نے ابوسعید سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ مَوْلَى، أَنَسٍ ـ قَالَ أَبُو عَبْدِ اللَّهِ اسْمُهُ عَبْدُ اللَّهِ بْنُ أَبِي عُتْبَةَ ـ سَمِعْتُ أَبَا سَعِيدٍ، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم أَشَدَّ حَيَاءً مِنَ الْعَذْرَاءِ فِي خِدْرِهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5864,
                "hadithNumber": "6120",
                "englishNarrator": "Narrated Abu Mas`ud رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, 'One of the sayings of the early Prophets which the people have got is: If you don't feel ashamed (from Haya': pious shyness from committing religeous indiscretions) do whatever you like.\" (See Hadith No 690, 691, Vol 4)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگلے پیغمبروں کا کلام جو لوگوں کو ملا اس میں یہ بھی ہے کہ جب شرم ہی نہ رہی تو پھر جو جی چاہے وہ کرے ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، انہوں نے کہا ہم سے زہیر نے بیان کیا ، انہوں نے کہا ہم سے منصور نے بیان کیا ، ان سے ربعی بن خراش نے بیان کیا ، ان سے ابومسعود انصاری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مَنْصُورٌ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، حَدَّثَنَا أَبُو مَسْعُودٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلاَمِ النُّبُوَّةِ الأُولَى إِذَا لَمْ تَسْتَحِي فَاصْنَعْ مَا شِئْتَ ‏\"‏‏.‏",
                "headingArabic": "إِذَا لَمْ تَسْتَحِي فَاصْنَعْ مَا شِئْتَ",
                "headingUrdu": "\"اور اگر تمہیں شرم نہیں آتی تو جو چاہے کرو۔\"",
                "headingEnglish": "\"And if you do not feel ashamed, then do whatever you like.\"",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5865,
                "hadithNumber": "6121",
                "englishNarrator": "Narrated Um Salama رضی اللہ عنہا :",
                "hadithEnglish": "Um Sulaim رضی اللہ عنہا came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Verily, Allah does not feel shy to tell the truth. If a woman gets a nocturnal sexual discharge (has a wet dream), is it essential for her to take a bath? He replied, \"Yes if she notices a discharge.\"",
                "hadithUrdu": "حضرت ام سلیم رضی اللہ عنہا رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا یا رسول اللہ ! اللہ حق بات سے حیاء نہیں کرتاکیا عورت کو جب احتلام ہو تو اس پر غسل واجب ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں اگر عورت منی کی تری دیکھے تو اس پر بھی غسل واجب ہے ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا مجھ سے امام مالک نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے ، ان سے زینب بنت ابی سلمہ رضی اللہ عنہا نے اور ان سے ام سلمہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ ابْنَةِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ ـ رضى الله عنها ـ قَالَتْ جَاءَتْ أُمُّ سُلَيْمٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ لاَ يَسْتَحِي مِنَ الْحَقِّ، فَهَلْ عَلَى الْمَرْأَةِ غُسْلٌ إِذَا احْتَلَمَتْ فَقَالَ ‏ \"‏ نَعَمْ إِذَا رَأَتِ الْمَاءَ ‏\"‏‏.‏",
                "headingArabic": "مَا لاَ يُسْتَحْيَا مِنَ الْحَقِّ لِلتَّفَقُّهِ فِي الدِّينِ",
                "headingUrdu": "دین کو سمجھنے میں سچائی سے شرم محسوس نہ کریں۔",
                "headingEnglish": "Not feel shy of the truth to comprehend the religion",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5866,
                "hadithNumber": "6122",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The example of a believer is like a green tree, the leaves of which do not fall.\" The people said. \"It is such-and-such tree: It is such-and-such tree.\" I intended to say that it was the datepalm tree, but I was a young boy and felt shy (to answer). The Prophet (ﷺ) said, \"It is the date-palm tree.\" Ibn `Umar رضی اللہ عنہما added, \" I told that to `Umar رضی اللہ عنہ who said, 'Had you said it, I would have preferred it to such-and such a thing.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، مومن کی مثال اس سرسبز درخت کی ہے ، جس کے پتے نہیں چھڑتے ۔ صحابہ نے کہا کہ یہ فلاں درخت ہے ۔ یہ فلاں درخت ہے ۔ میرے دل میں آیا کہ کہوں کہ یہ کھجور کا درخت ہے لیکن چونکہ میں نوجوان تھا ، اس لئے مجھ کو بولتے ہوئے حیاء آئی ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ کھجور کا درخت ہے ۔ اور اسی سند سے شعبہ سے روایت ہے کہ کہا ہم سے خبیب بن عبدالرحمٰن نے ، ان سے حفص بن عاصم نے اور ان سے ابن عمر رضی اللہ عنہما نے اسی طرح بیان کیا اور یہ اضافہ کیا کہ پھر میں نے اس کا ذکر عمر رضی اللہ عنہ سے کیا تو انہوں نے کہا اگر تم نے کہہ دیا ہوتا تو مجھے اتنا اتنا مال ملنے سے بھی زیادہ خوشی حاصل ہوتی ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے محارب بن دثار نے ، کہا کہ میں نے حضرت ابن عمر رضی اللہ عنہا سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَارِبُ بْنُ دِثَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَثَلُ الْمُؤْمِنِ كَمَثَلِ شَجَرَةٍ خَضْرَاءَ، لاَ يَسْقُطُ وَرَقُهَا، وَلاَ يَتَحَاتُّ ‏\"‏‏.‏ فَقَالَ الْقَوْمُ هِيَ شَجَرَةُ كَذَا‏.‏ هِيَ شَجَرَةُ كَذَا، فَأَرَدْتُ أَنْ أَقُولَ هِيَ النَّخْلَةُ‏.‏ وَأَنَا غُلاَمٌ شَابٌّ فَاسْتَحْيَيْتُ، فَقَالَ ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏ وَعَنْ شُعْبَةَ حَدَّثَنَا خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنِ ابْنِ عُمَرَ مِثْلَهُ وَزَادَ فَحَدَّثْتُ بِهِ عُمَرَ فَقَالَ لَوْ كُنْتَ قُلْتَهَا لَكَانَ أَحَبَّ إِلَىَّ مِنْ كَذَا وَكَذَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5867,
                "hadithNumber": "6123",
                "englishNarrator": "Narrated  Anas رضی اللہ عنہ :",
                "hadithEnglish": "\"A woman came to the Prophet (ﷺ) offering herself to him in marriage, saying, \"Have you got any interest in me (i.e. would you like to marry me?)\" Anas's daughter said, \"How shameless that woman was!\" On that Anas رضی اللہ عنہ said, \"She is better than you, for she presented herself to Allah's Messenger (ﷺ) (for marriage).",
                "hadithUrdu": "ایک خاتون نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور اپنے آپ کو آنحضرت صلی اللہ علیہ وسلم کے نکاح کے لئے پیش کیا اور عرض کیا ، کیا آنحضرت صلی اللہ علیہ وسلم کو مجھ سے نکاح کی ضرورت ہے ؟ اس پر انس رضی اللہ عنہ کی صاحبزادی بولیں ، وہ کتنی بے حیاتھی ، انس رضی اللہ عنہ نے کہا کہ وہ تم سے تو اچھی تھیں انہوں نے اپنے آپ کو آنحضرت صلی اللہ علیہ وسلم کے نکاح کے لئے پیش کیا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے مرحوم بن عبدالعزیز نے بیان کیا ، انہوں نے کہا کہ میں نے کہا کہ میں نے ثابت سے سنا اور انہوں نے انس رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا مَرْحُومٌ، سَمِعْتُ ثَابِتًا، أَنَّهُ سَمِعَ أَنَسًا ـ رضى الله عنه ـ يَقُولُ جَاءَتِ امْرَأَةٌ إِلَى النَّبِيِّ صلى الله عليه وسلم تَعْرِضُ عَلَيْهِ نَفْسَهَا فَقَالَتْ هَلْ لَكَ حَاجَةٌ فِيَّ فَقَالَتِ ابْنَتُهُ مَا أَقَلَّ حَيَاءَهَا‏.‏ فَقَالَ هِيَ خَيْرٌ مِنْكِ، عَرَضَتْ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم نَفْسَهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5868,
                "hadithNumber": "6124",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) sent him and Mu`adh bin Jabal to Yemen, he said to them, \"Facilitate things for the people (treat the people in the most agreeable way), and do not make things difficult for them, and give them glad tidings, and let them not have aversion (i.e. to make the people hate good deeds) and you should both work in cooperation and mutual understanding, obey each other.\" Abu Musa رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! We are in a land in which a drink named Al Bit' is prepared from honey, and another drink named Al-Mizr is prepared from barley.\" On that, Allah's Messenger (ﷺ) said, \"All intoxicants (i.e. all alcoholic drinks) are prohibited.\"",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم نے انہیں ( ابوموسیٰ اشعری رضی اللہ عنہ ) اورمعاذ بن جبل کو ( یمن ) بھیجا تو ان سے فرمایا کہ ( لوگوں کے لئے ) آسانیاں پیدا کرنا ، تنگی میں نہ ڈالنا ، انہیں خوشخبری سنانا ، دین سے نفرت نہ دلانا اور تم دونوں آپس میں اتفاق سے کام کرنا ، ابوموسیٰ رضی اللہ عنہ نے عرض کیا ، یا رسول اللہ ! ہم ایسی سرزمین میں جا رہے ہیں جہاں شہد سے شراب بنائی جاتی ہے اور اسے ” تبع “ کہا جاتا ہے اور جو سے شراب بنائی جاتی ہے اور اسے ” مزر “ کہا جاتا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہرنشہ لانے والی چیز حرام ہے ۔",
                "urduNarrator": "مجھ سے اسحاق نے بیان کیا ، کہا ہم سے نضر نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں سعید بن ابی بردہ نے ، انہیں ان کے والد نے اور ان سے ان کے دادا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا النَّضْرُ، أَخْبَرَنَا شُعْبَةُ، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ لَمَّا بَعَثَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمُعَاذَ بْنَ جَبَلٍ قَالَ لَهُمَا ‏\"‏ يَسِّرَا وَلاَ تُعَسِّرَا، وَبَشِّرَا وَلاَ تُنَفِّرَا، وَتَطَاوَعَا ‏\"‏‏.‏ قَالَ أَبُو مُوسَى يَا رَسُولَ اللَّهِ إِنَّا بِأَرْضٍ يُصْنَعُ فِيهَا شَرَابٌ مِنَ الْعَسَلِ، يُقَالُ لَهُ الْبِتْعُ، وَشَرَابٌ مِنَ الشَّعِيرِ، يُقَالُ لَهُ الْمِزْرُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم: «يَسِّرُوا وَلاَ تُعَسِّرُوا»",
                "headingUrdu": "\"لوگوں کے لیے آسانیاں پیدا کرو اور ان کے لیے مشکل نہ بناؤ۔\"",
                "headingEnglish": "\"Make things easy for the people and do not make things difficult for them.\"",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5869,
                "hadithNumber": "6125",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Make things easy for the people, and do not make it difficult for them, and make them calm (with glad tidings) and do not repulse (them ).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، آسانی پیدا کرو ، تنگی نہ پیدا کرو ، لوگوں کو تسلی اور تشفی دو نفرت نہ دلاؤ ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے ابو التیاح نے بیان کیا ، انہوں نے انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَسِّرُوا وَلاَ تُعَسِّرُوا، وَسَكِّنُوا وَلاَ تُنَفِّرُوا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5870,
                "hadithNumber": "6126",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Whenever Allah's Messenger (ﷺ) was given the choice of one of two matters he would choose the easier of the two as long as it was not sinful to do so, but if it was sinful, he would not approach it. Allah's Apostle never took revenge over anybody for his own sake but (he did) only when Allah's legal bindings were outraged, in which case he would take revenge for Allah's sake.\" (See Hadith No. 760. Vol. 4)",
                "hadithUrdu": "جب بھی رسول اللہ صلی اللہ علیہ وسلم کو دو چیزوں میں سے ایک کو اختیار کرنے کا اختیار دیا گیا تو آپ نے ہمیشہ ان میں آسان چیزوں کو اختیار فرمایا ، بشرطیکہ اس میں گناہ کا کوئی پہلو نہ ہوتا ۔ اگر اس میں گناہ کا کوئی پہلو ہوتا تو آنحضرت اس سے سب سے زیادہ دور رہتے اور حضور اکرم صلی اللہ علیہ وسلم نے اپنی ذات کے لئے کسی سے بدلہ نہیں لیا ، البتہ اگر کوئی شخص اللہ کی حرمت وحد کو توڑ تا تو آنحضرت صلی اللہ علیہ وسلم ان سے تو محض اللہ کی رضامندی کے لئے بدلہ لیتے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے مالک نے ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ مَا خُيِّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَمْرَيْنِ قَطُّ إِلاَّ أَخَذَ أَيْسَرَهُمَا، مَا لَمْ يَكُنْ إِثْمًا، فَإِنْ كَانَ إِثْمًا كَانَ أَبْعَدَ النَّاسِ مِنْهُ، وَمَا انْتَقَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِنَفْسِهِ فِي شَىْءٍ قَطُّ، إِلاَّ أَنْ تُنْتَهَكَ حُرْمَةُ اللَّهِ، فَيَنْتَقِمَ بِهَا لِلَّهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5871,
                "hadithNumber": "6127",
                "englishNarrator": "Narrated Al-Azraq bin Qais:",
                "hadithEnglish": "We were in the city of Al-Ahwaz on the bank of a river which had dried up. Then Abu Barza Al- Aslami رضی اللہ عنہ came riding a horse and he started praying and let his horse loose. The horse ran away, so Abu Barza رضی اللہ عنہ interrupted his prayer and went after the horse till he caught it and brought it, and then he offered his prayer. There was a man amongst us who was (from the Khawari) having a different opinion. He came saying. \"Look at this old man! He left his prayer because of a horse.\" On that Abu Barza رضی اللہ عنہ came to us and said, \"Since the time I left Allah's Messenger (ﷺ), nobody has admonished me; My house is very far from this place, and if I had carried on praying and left my horse, I could not have reached my house till night.\" Then Abu Barza رضی اللہ عنہ mentioned that he had been in the company of the Prophet, and that he had seen his leniency.",
                "hadithUrdu": "اہواز نامی ایرانی شہر میں ہم ایک نہر کے کنارے تھے جو خشک پڑی تھی ، پھر ابوبرزہ اسلمی صحابی گھوڑے پر تشریف لائے اور نماز پڑھی اور گھوڑا چھوڑ دیا ۔ گھوڑا بھاگنے لگا تو آپ نے نماز توڑ دی اور اس کا پیچھا کیا ، آخر اس کے قریب پہنچے اور اسے پکڑ لیا ۔ پھر واپس آ کر نماز قضاء کی ، وہاں ایک شخص خارجی تھا ، وہ کہنے لگا کہ اس بوڑھے کو دیکھو اس نے گھوڑے کے لئے نماز توڑ ڈالی ۔ ابوبرزہ اسلمی رضی اللہ عنہ نماز سے فارغ ہو کر آئے اور کہا جب سے میں رسول اللہ صلی اللہ علیہ وسلم سے جدا ہوا ہوں ، کسی نے مجھ کو ملامت نہیں کی اور انہوں نے کہا کہ میرا گھر یہاں سے دور ہے ، اگر میں نماز پڑھتا رہتا اور گھوڑے کو بھاگنے دیتا تو اپنے گھر رات تک بھی نہ پہنچ پاتا اور انہوں نے بیان کیا کہ وہ آنحضرت صلی اللہ علیہ وسلم کی صحبت میں رہے ہیں اور میں نے آنحضرت صلی اللہ علیہ وسلم کو آسان صورتوں کو اختیار کرتے دیکھا ہے ۔",
                "urduNarrator": "ہم سے ابو النعمان بن محمد بن فضل سدوسی نے بیان کیا ، کہا ہم سے حمادبن زید نے بیان کیا ، ان سے ازرق بن قیس نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ الأَزْرَقِ بْنِ قَيْسٍ، قَالَ كُنَّا عَلَى شَاطِئِ نَهْرٍ بِالأَهْوَازِ قَدْ نَضَبَ عَنْهُ الْمَاءُ، فَجَاءَ أَبُو بَرْزَةَ الأَسْلَمِيُّ عَلَى فَرَسٍ، فَصَلَّى وَخَلَّى فَرَسَهُ، فَانْطَلَقَتِ الْفَرَسُ، فَتَرَكَ صَلاَتَهُ وَتَبِعَهَا حَتَّى أَدْرَكَهَا، فَأَخَذَهَا ثُمَّ جَاءَ فَقَضَى صَلاَتَهُ، وَفِينَا رَجُلٌ لَهُ رَأْىٌ، فَأَقْبَلَ يَقُولُ انْظُرُوا إِلَى هَذَا الشَّيْخِ تَرَكَ صَلاَتَهُ مِنْ أَجْلِ فَرَسٍ‏.‏ فَأَقْبَلَ فَقَالَ مَا عَنَّفَنِي أَحَدٌ مُنْذُ فَارَقْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَقَالَ إِنَّ مَنْزِلِي مُتَرَاخٍ فَلَوْ صَلَّيْتُ وَتَرَكْتُ لَمْ آتِ أَهْلِي إِلَى اللَّيْلِ‏.‏ وَذَكَرَ أَنَّهُ صَحِبَ النَّبِيَّ صلى الله عليه وسلم فَرَأَى مِنْ تَيْسِيرِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5872,
                "hadithNumber": "6128",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "A bedouin urinated in the mosque, and the people rushed to beat him. Allah's Messenger (ﷺ) ordered them to leave him and pour a bucket or a tumbler (full) of water over the place where he has passed urine. The Prophet then said, \" You have been sent to make things easy (for the people) and you have not been sent to make things difficult for them.\"",
                "hadithUrdu": "ایک دیہاتی نے مسجد میں پیشاب کر دیا ، لوگ اس کی طرف مارنے کو بڑھے ، لیکن رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اسے چھوڑ دو اور جہاں اس نے پیشاب کیا ہے اس جگہ پر پانی کا ایک ڈول بھرا ہوا بہادو ، کیونکہ تم آسانی کرنے والے بنا کر بھیجے گئے ہو ۔ تنگی کرنے والے بنا کر نہیں بھیجے گئے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ( دوسری سند ) اورلیث بن سعد نے بیان کیا کہ مجھ سے یونس نے بیان کیا ، ان سے ابن شہاب نے ، انہیں عبیداللہ بن عبداللہ بن عتبہ نے خبر دی اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، ح وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُ أَنَّ أَعْرَابِيًّا بَالَ فِي الْمَسْجِدِ، فَثَارَ إِلَيْهِ النَّاسُ لِيَقَعُوا بِهِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ دَعُوهُ، وَأَهْرِيقُوا عَلَى بَوْلِهِ ذَنُوبًا مِنْ مَاءٍ ـ أَوْ سَجْلاً مِنْ مَاءٍ ـ فَإِنَّمَا بُعِثْتُمْ مُيَسِّرِينَ، وَلَمْ تُبْعَثُوا مُعَسِّرِينَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5873,
                "hadithNumber": "6129",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) used to mix with us to the extent that he would say to a younger brother of mine, 'O Aba `Umair! What did the Nughair (a kind of bird) do?\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ہم بچوں سے بھی دل لگی کرتے ، یہاں تک کہ میرے چھوٹے بھائی ابو عمیر نامی سے ( مزاحاً ) فرماتے ” یا ابا عمیر ما فعل النغیر “ سے ابو عمیر ! تیری ، نغیر نامی چڑیا تو بخیر ہے ؟",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے ابو التیاح نے ، کہا میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو التَّيَّاحِ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ إِنْ كَانَ النَّبِيُّ صلى الله عليه وسلم لَيُخَالِطُنَا حَتَّى يَقُولَ لأَخٍ لِي صَغِيرٍ ‏ \"‏ يَا أَبَا عُمَيْرٍ مَا فَعَلَ النُّغَيْرُ ‏\"‏‏.‏",
                "headingArabic": "الاِنْبِسَاطِ إِلَى النَّاسِ",
                "headingUrdu": "لوگوں کے ساتھ خوش گوار رہنا",
                "headingEnglish": "To be cheerful with the people",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5874,
                "hadithNumber": "6130",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I used to play with the dolls in the presence of the Prophet, and my girl friends also used to play with me. When Allah's Messenger (ﷺ) used to enter (my dwelling place) they used to hide themselves, but the Prophet would call them to join and play with me. (The playing with the dolls and similar images is forbidden, but it was allowed for `Aisha at that time, as she was a little girl, not yet reached the age of puberty.) (Fath-ul-Bari page 143, Vol.13)",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کے یہاں لڑکیوں کے ساتھ کھیلتی تھی ، میری بہت سی سہیلیاں تھیں جو میرے ساتھ کھیلا کرتی تھیں ، جب آنحضرت اندر تشریف لاتے تو وہ چھپ جاتیں پھر آنحضرت صلی اللہ علیہ وسلم انہیں میرے پاس بھیجتے اور وہ میرے ساتھ کھیلتیں ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو ابومعاویہ نے خبر دی ، کہا ہم سے ہشام نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كُنْتُ أَلْعَبُ بِالْبَنَاتِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم وَكَانَ لِي صَوَاحِبُ يَلْعَبْنَ مَعِي، فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا دَخَلَ يَتَقَمَّعْنَ مِنْهُ، فَيُسَرِّبُهُنَّ إِلَىَّ فَيَلْعَبْنَ مَعِي‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5875,
                "hadithNumber": "6131",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "A man asked permission to see the Prophet. He said, \"Let Him come in; What an evil man of the tribe he is! (Or, What an evil brother of the tribe he is). But when he entered, the Prophet (ﷺ) spoke to him gently in a polite manner. I said to him, \"O Allah's Apostle! You have said what you have said, then you spoke to him in a very gentle and polite manner? The Prophet (ﷺ) said, \"The worse people, in the sight of Allah are those whom the people leave (undisturbed) to save themselves from their dirty language.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سے ایک شخص نے اندر آنے کی اجازت چاہی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے اندر بلا لو ، یہ اپنی قوم کا بہت ہی برا آدمی ہے ، جب وہ شخص اندر آ گیا تو آنحضرت صلی اللہ علیہ وسلم نے اس کے ساتھ نرمی کے ساتھ گفتگو فرمائی ۔ میں نے عرض کیا یا رسول اللہ ! آپ نے ابھی اس کے متعلق کیا فرمایا تھا اور پھر اتنی نرمی کے ساتھ گفتگو فرمائی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، عائشہ اللہ کے نزدیک ایک مرتبہ کے اعتبار سے وہ شخص سب سے برا ہے جسے لوگ اس کی بد خلقی کی وجہ سے چھوڑدیں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، ان سے ابن المنکدر نے ، ان سے عروہ بن زبیر نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، حَدَّثَهُ عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ‏.‏ أَنَّهُ، اسْتَأْذَنَ عَلَى النَّبِيِّ صلى الله عليه وسلم رَجُلٌ فَقَالَ ‏\"‏ ائْذَنُوا لَهُ فَبِئْسَ ابْنُ الْعَشِيرَةِ ‏\"‏‏.‏ أَوْ ‏\"‏ بِئْسَ أَخُو الْعَشِيرَةِ ‏\"‏‏.‏ فَلَمَّا دَخَلَ أَلاَنَ لَهُ الْكَلاَمَ‏.‏ فَقُلْتُ لَهُ يَا رَسُولَ اللَّهِ قُلْتَ مَا قُلْتَ، ثُمَّ أَلَنْتَ لَهُ فِي الْقَوْلِ‏.‏ فَقَالَ ‏\"‏ أَىْ عَائِشَةُ، إِنَّ شَرَّ النَّاسِ مَنْزِلَةً عِنْدَ اللَّهِ مَنْ تَرَكَهُ ـ أَوْ وَدَعَهُ ـ النَّاسُ اتِّقَاءَ فُحْشِهِ ‏\"‏‏.‏",
                "headingArabic": "الْمُدَارَاةِ مَعَ النَّاسِ",
                "headingUrdu": "لوگوں کے ساتھ نرمی اور خوش اخلاقی سے پیش آنا۔",
                "headingEnglish": "To be gentle and polite with the people.",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5876,
                "hadithNumber": "6132",
                "englishNarrator": "Narrated `Abdullah bin Abu Mulaika:",
                "hadithEnglish": "The Prophet (ﷺ) was given a gift of a few silken cloaks with gold buttons. He distributed them amongst some of his companions and put aside one of them for Makhrama. When Makhrama came, the Prophet said, \"I kept this for you.\" (Aiyub, the sub-narrator held his garment to show how the Prophet (ﷺ) showed the cloak to Makhrama رضی اللہ عنہ who had something unfavorable about his temper.) Ibn-e-Abi Molaikah has reported from Hadrat Miswar bin Makhramah that some robes were presented to the prophet ﷺ.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے پاس ہدیہ میں دیبا کی چند قبائیں آئیں ، ان میں سونے کے بٹن لگے ہوئے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے وہ قبائیں اپنے صحابہ میں تقسیم کر دیں اورمخرمہ کے لئے باقی رکھی ، جب مخرمہ آیا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ میں نے تمہارے لئے چھپا رکھی تھی ۔ ایوب نے کہا یعنی اپنے کپڑے میں چھپا رکھی تھی آپ مخرمہ کو خوش کرنے کے لئے اس کے تکمے یا گھنڈی کو دکھلا رہے تھے کیونکہ وہ ذرا سخت مزاج آدمی تھے ۔ اس حدیث کو حماد بن زید نے بھی ایوب کے واسطہ سے روایت کیا مرسلات میں اور حاتم بن وردان نے کہا ہم سے ایوب نے بیان کیا ، ان سے ابی ملیکہ نے اور ان سے مسور بن مخرمہ رضی اللہ عنہ نے کہ نبی کریم صلی اللہ علیہ وسلم کے پاس چند قبائیں تحفہ میں آئیں پھر ایسی ہی حدیث بیان کی ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، کہا ہم کو ابن علیہ نے خبر دی ، کہا ہم کو ایوب نے خبر دی ، انہیں عبداللہ بن ابی ملیکہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، أَخْبَرَنَا ابْنُ عُلَيَّةَ، أَخْبَرَنَا أَيُّوبُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أُهْدِيَتْ لَهُ أَقْبِيَةٌ مِنْ دِيبَاجٍ مُزَرَّرَةٌ بِالذَّهَبِ، فَقَسَمَهَا فِي نَاسٍ مِنْ أَصْحَابِهِ وَعَزَلَ مِنْهَا وَاحِدًا لِمَخْرَمَةَ، فَلَمَّا جَاءَ قَالَ ‏ \"‏ خَبَأْتُ هَذَا لَكَ ‏\"‏‏.‏ قَالَ أَيُّوبُ بِثَوْبِهِ أَنَّهُ يُرِيهِ إِيَّاهُ، وَكَانَ فِي خُلُقِهِ شَىْءٌ‏.‏ رَوَاهُ حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ وَقَالَ حَاتِمُ بْنُ وَرْدَانَ حَدَّثَنَا أَيُّوبُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ، قَدِمَتْ عَلَى النَّبِيِّ صلى الله عليه وسلم أَقْبِيَةٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5877,
                "hadithNumber": "6133",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A believer is not stung twice (by something) out of one and the same hole.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مومن کوایک سوراخ سے دوبارہ ڈنگ نہیں لگ سکتا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، انہوں نے کہا ان سے عقیل نے بیان کیا ، ان سے زہری نے ، ان سے ابن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ لاَ يُلْدَغُ الْمُؤْمِنُ مِنْ جُحْرٍ وَاحِدٍ مَرَّتَيْنِ ‏\"‏‏.‏",
                "headingArabic": "لاَ يُلْدَغُ الْمُؤْمِنُ مِنْ جُحْرٍ مَرَّتَيْنِ",
                "headingUrdu": "ایک مومن کو ایک ہی سوراخ سے دو بار نہیں ڈسا جائے گا۔",
                "headingEnglish": "A believer not to be stung twice out fo the same hole",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5851,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=234",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=232",
                "label": "232",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=233",
                "label": "233",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=234",
                "label": "234",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=235",
                "label": "235",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=236",
                "label": "236",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=237",
                "label": "237",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=238",
                "label": "238",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=236",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=236",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=234",
        "to": 5875,
        "total": 40465
    }
}