{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 166,
        "data": [
            {
                "id": 4128,
                "hadithNumber": "4330",
                "englishNarrator": "Narrated `Abdullah bin Zaid bin `Asim رضی اللہ عنہ :",
                "hadithEnglish": "When Allah gave to His Apostle the war booty on the day of Hunain, he distributed that booty amongst those whose hearts have been (recently) reconciled (to Islam), but did not give anything to the Ansar. So they seemed to have felt angry and sad as they did not get the same as other people had got. The Prophet (ﷺ) then delivered a sermon before them, saying, \"O, the assembly of Ansar! Didn't I find you astray, and then Allah guided you on the Right Path through me? You were divided into groups, and Allah brought you together through me; you were poor and Allah made you rich through me.\" Whatever the Prophet (ﷺ) said , they (i.e. the Ansar) said, \"Allah and his Apostle have more favours to do.\" The Prophet (ﷺ) said, \"What stops you from answering the Messenger of Allah?\" But whatever he said to them, they replied, \"Allah and His Apostle have more favours to do.\" The Prophet (ﷺ) then said, \"If you wish you could say: 'You came to us in such-and-such state (at Medina).' Wouldn't you be willing to see the people go away with sheep and camels while you go with the Prophet (ﷺ) to your homes? But for the migration, I would have been one of the Ansar, and if the people took their way through a valley or mountain pass, I would select the valley or mountain pass of the Ansar. The Ansar are Shiar (i.e. those clothes which are in direct contact with the body and worn inside the other garments), and the people are Dithar (i.e. those clothes which are not in direct contact with the body and are worn over other garments). No doubt, you will see other people favoured over you, so you should be patient till you meet me at the Tank (of Kauthar).",
                "hadithUrdu": "غزوہ حنین کے موقع پر اللہ تعالیٰ نے اپنے رسول کو جو غنیمت دی تھی آپ نے اس کی تقسیم کمزور ایمان کے لوگوں میں ( جو فتح مکہ کے بعد ایمان لائے تھے ) کر دی اور انصار کو اس میں سے کچھ نہیں دیا۔ اس کا انہیں کچھ ملال ہوا کہ وہ مال جو نبی کریم صلی اللہ علیہ وسلم نے دوسروں کو دیا انہیں کیوں نہیں دیا۔ آپ نے اس کے بعد انہیں خطاب کیا اور فرمایا: اے انصاریو! کیا میں نے تمہیں گمراہ نہیں پایا تھا پھر تم کو میرے ذریعہ اللہ تعالیٰ نے ہدایت نصیب کی اور تم میں آپس میں دشمنی اور نااتفاقی تھی تو اللہ تعالیٰ نے میرے ذریعہ تم میں باہم الفت پیدا کی اور تم محتاج تھے اللہ تعالیٰ نے میرے ذریعہ غنی کیا۔ آپ کے ایک ایک جملے پر انصار کہتے جاتے تھے کہ اللہ اور اس کے رسول کے ہم سب سے زیادہ احسان مند ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میری باتوں کا جواب دینے سے تمہیں کیا چیز مانع رہی؟ بیان کیا کہ آپ صلی اللہ علیہ وسلم کے ہر اشارہ پر انصار عرض کرتے جاتے کہ اللہ اور اس کے رسول کے ہم سب سے زیادہ احسان مند ہیں پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر تم چاہتے تو مجھ سے اس طرح بھی کہہ سکتے تھے ( کہ آپ آئے تو لوگ آپ کو جھٹلا رہے تھے، لیکن ہم نے آپ کی تصدیق کی وغیرہ ) کیا تم اس پر خوش نہیں ہو کہ جب لوگ اونٹ اور بکریاں لے جا رہے ہوں تو تم اپنے گھروں کی طرف رسول اللہ صلی اللہ علیہ وسلم کو ساتھ لے جاؤ؟ اگر ہجرت کی فضیلت نہ ہوتی تو میں بھی انصار کا ایک آدمی ہوتا۔ لوگ خواہ کسی گھاٹی یا وادی میں رہیں گے میں تو انصار کی گھاٹی اور وادی میں رہوں گا۔ انصار استر کی طرح ہیں جو جسم سے ہمیشہ لگا رہتا ہے اور دوسرے لوگ اوپر کے کپڑے یعنی ابرہ کی طرح ہیں۔ تم لوگ ( انصار ) دیکھو گے کہ میرے بعد تم پر دوسروں کو ترجیح دی جائے گی۔ تم ایسے وقت میں صبر کرنا یہاں تک کہ مجھ سے حوض پر آ ملو۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے وہیب بن خالد نے بیان کیا، ان سے عمرو بن یحییٰ نے، ان سے عباد بن تمیم نے، ان سے عبداللہ بن زید بن عاصم رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدِ بْنِ عَاصِمٍ، قَالَ لَمَّا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ صلى الله عليه وسلم يَوْمَ حُنَيْنٍ قَسَمَ فِي النَّاسِ فِي الْمُؤَلَّفَةِ قُلُوبُهُمْ، وَلَمْ يُعْطِ الأَنْصَارَ شَيْئًا، فَكَأَنَّهُمْ وَجَدُوا إِذْ لَمْ يُصِبْهُمْ مَا أَصَابَ النَّاسَ فَخَطَبَهُمْ فَقَالَ ‏\"‏ يَا مَعْشَرَ الأَنْصَارِ أَلَمْ أَجِدْكُمْ ضُلاَّلاً فَهَدَاكُمُ اللَّهُ بِي، وَكُنْتُمْ مُتَفَرِّقِينَ فَأَلَّفَكُمُ اللَّهُ بِي وَعَالَةً، فَأَغْنَاكُمُ اللَّهُ بِي ‏\"‏‏.‏ كُلَّمَا قَالَ شَيْئًا قَالُوا اللَّهُ وَرَسُولُهُ أَمَنُّ‏.‏ قَالَ ‏\"‏ مَا يَمْنَعُكُمْ أَنْ تُجِيبُوا رَسُولَ اللَّهِ صلى الله عليه وسلم ‏\"‏‏.‏ قَالَ كُلَّمَا قَالَ شَيْئًا قَالُوا اللَّهُ وَرَسُولُهُ أَمَنُّ‏.‏ قَالَ ‏\"‏ لَوْ شِئْتُمْ قُلْتُمْ جِئْتَنَا كَذَا وَكَذَا‏.‏ أَتَرْضَوْنَ أَنْ يَذْهَبَ النَّاسُ بِالشَّاةِ وَالْبَعِيرِ، وَتَذْهَبُونَ بِالنَّبِيِّ صلى الله عليه وسلم إِلَى رِحَالِكُمْ، لَوْلاَ الْهِجْرَةُ لَكُنْتُ امْرَأً مِنَ الأَنْصَارِ، وَلَوْ سَلَكَ النَّاسُ وَادِيًا وَشِعْبًا لَسَلَكْتُ وَادِيَ الأَنْصَارِ وَشِعْبَهَا، الأَنْصَارُ شِعَارٌ وَالنَّاسُ دِثَارٌ، إِنَّكُمْ سَتَلْقَوْنَ بَعْدِي أَثَرَةً فَاصْبِرُوا حَتَّى تَلْقَوْنِي عَلَى الْحَوْضِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4129,
                "hadithNumber": "4331",
                "englishNarrator": "Narrated Anas Bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "When Allah gave Allah's Messenger (ﷺ) what he gave of the properties of the Hawazin tribe as a war booty, the Prophet (ﷺ) started giving some men 100 camels each. The Ansar (then) said, \"May Allah forgive Allah's Messenger (ﷺ)s as he gives to Quraish and leaves us although our swords are still dribbling with the blood of Quraish.\" Allah Apostle was informed of their statement, so he sent for the Ansar and gathered them in a leather tent, and did not call anybody else along with them. When they al I gathered, the Prophet (ﷺ) got up and said, \"What is this talk being informed to me about you?\" The learned men amongst the Ansar said, \"O Allah's Messenger (ﷺ)! Our chiefs did not say anything, but some people amongst us who are younger in age said. 'May Allah forgive Allah's Messenger (ﷺ) as he gives (of the booty) to Quraish and leaves us though our swords are still dribbling with their blood.\" The Prophet (ﷺ) said, \"I give to these men who have newly deserted heathenism (and embraced Islam) so as to attract their hearts. Won't you be happy that the people take the wealth while you take the Prophet (ﷺ) with you to your homes? By Allah, what you are taking is better than whatever they are taking.\" They (i.e. the Ansar) said, \"O Allah's Messenger (ﷺ)! We are satisfied.\" The Prophet (ﷺ) then said to them. \"You will find others favored over you greatly, so be patient till you meet Allah and His Apostle and I will be at the Tank then.\" Anas رضی اللہ عنہ added: But they did not remain patient.",
                "hadithUrdu": "جب قبیلہ ہوازن کے مال میں سے اللہ تعالیٰ نے اپنے رسول کو جو دینا تھا وہ دیا تو انصار کے کچھ لوگوں کو رنج ہوا کیونکہ آپ صلی اللہ علیہ وسلم نے کچھ لوگوں کو سو سو اونٹ دے دئیے تھے۔ کچھ لوگوں نے کہا کہ اللہ اپنے رسول کی مغفرت کرے، قریش کو تو آپ عنایت فرما رہے ہیں اور ہم کو آپ نے چھوڑ دیا ہے حالانکہ ہماری تلواروں سے ان کا خون ٹپک رہا ہے۔ انس رضی اللہ عنہ نے بیان کیا کہ انصار کی یہ بات نبی کریم صلی اللہ علیہ وسلم کے کانوں میں آئی تو آپ نے انہیں بلا بھیجا اور چمڑے کے ایک خیمے میں انہیں جمع کیا، ان کے ساتھ ان کے علاوہ کسی کو بھی آپ نے نہیں بلایا تھا۔ جب سب لوگ جمع ہو گئے تو آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور آپ نے فرمایا تمہاری جو بات مجھے معلوم ہوئی ہے کیا وہ صحیح ہے؟ انصار کے جو سمجھدار لوگ تھے انہوں نے عرض کیا: یا رسول اللہ! جو لوگ ہمارے معزز اور سردار ہیں، انہوں نے ایسی کوئی بات نہیں کہی۔ البتہ ہمارے کچھ لوگ جو ابھی نوعمر ہیں، انہوں نے کہا ہے کہ اللہ، رسول اللہ صلی اللہ علیہ وسلم کی مغفرت کرے، قریش کو آپ دے رہے ہیں اور ہمیں آپ نے چھوڑ دیا ہے حالانکہ ہماری تلواروں سے ان کا خون ٹپک رہا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر فرمایا کہ میں ایسے لوگوں کو دیتا ہوں جو ابھی نئے نئے اسلام میں داخل ہوئے ہیں، اس طرح میں ان کی دلجوئی کرتا ہوں۔ کیا تم اس پر راضی نہیں ہو کہ دوسرے لوگ تو مال و دولت لے جائیں اور تم نبی کو اپنے ساتھ اپنے گھر لے جاؤ۔ اللہ کی قسم! جو چیز تم اپنے ساتھ لے جاؤ گے وہ اس سے بہتر ہے جو وہ لے جا رہے ہیں۔ انصار نے عرض کیا: یا رسول اللہ! ہم اس پر راضی ہیں۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میرے بعد تم دیکھو گے کہ تم پر دوسروں کو ترجیح دی جائے گی۔ اس وقت صبر کرنا، یہاں تک کہ اللہ اور اس کے رسول سے آ ملو۔ میں حوض کوثر پر ملوں گا۔ انس رضی اللہ عنہ نے کہا لیکن انصار نے صبر نہیں کیا۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے ہشام بن عروہ نے بیان کیا، انہیں معمر نے خبر دی، ان سے زہری نے بیان کیا اور انہیں انس بن مالک رضی اللہ عنہ نے خبر دی، بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ نَاسٌ مِنَ الأَنْصَارِ حِينَ أَفَاءَ اللَّهُ عَلَى رَسُولِهِ صلى الله عليه وسلم مَا أَفَاءَ مِنْ أَمْوَالِ هَوَازِنَ، فَطَفِقَ النَّبِيُّ صلى الله عليه وسلم يُعْطِي رِجَالاً الْمِائَةَ مِنَ الإِبِلِ فَقَالُوا يَغْفِرُ اللَّهُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يُعْطِي قُرَيْشًا وَيَتْرُكُنَا، وَسُيُوفُنَا تَقْطُرُ مِنْ دِمَائِهِمْ‏.‏ قَالَ أَنَسٌ فَحُدِّثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَقَالَتِهِمْ، فَأَرْسَلَ إِلَى الأَنْصَارِ فَجَمَعَهُمْ فِي قُبَّةٍ مِنْ أَدَمٍ وَلَمْ يَدْعُ مَعَهُمْ غَيْرَهُمْ، فَلَمَّا اجْتَمَعُوا قَامَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا حَدِيثٌ بَلَغَنِي عَنْكُمْ ‏\"‏‏.‏ فَقَالَ فُقَهَاءُ الأَنْصَارِ أَمَّا رُؤَسَاؤُنَا يَا رَسُولَ اللَّهِ فَلَمْ يَقُولُوا شَيْئًا، وَأَمَّا نَاسٌ مِنَّا حَدِيثَةٌ أَسْنَانُهُمْ فَقَالُوا يَغْفِرُ اللَّهُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يُعْطِي قُرَيْشًا وَيَتْرُكُنَا، وَسُيُوفُنَا تَقْطُرُ مِنْ دِمَائِهِمْ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَإِنِّي أُعْطِي رِجَالاً حَدِيثِي عَهْدٍ بِكُفْرٍ، أَتَأَلَّفُهُمْ، أَمَا تَرْضَوْنَ أَنْ يَذْهَبَ النَّاسُ بِالأَمْوَالِ وَتَذْهَبُونَ بِالنَّبِيِّ صلى الله عليه وسلم إِلَى رِحَالِكُمْ، فَوَاللَّهِ لَمَا تَنْقَلِبُونَ بِهِ خَيْرٌ مِمَّا يَنْقَلِبُونَ بِهِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ قَدْ رَضِينَا‏.‏ فَقَالَ لَهُمُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ سَتَجِدُونَ أُثْرَةً شَدِيدَةً، فَاصْبِرُوا حَتَّى تَلْقَوُا اللَّهَ وَرَسُولَهُ صلى الله عليه وسلم فَإِنِّي عَلَى الْحَوْضِ ‏\"‏‏.‏ قَالَ أَنَسٌ فَلَمْ يَصْبِرُوا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4130,
                "hadithNumber": "4332",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When it was the day of the Conquest (of Mecca) Allah's Messenger (ﷺ) distributed the war booty amongst the people of Quraish which caused the Ansar to become angry. So the Prophet (ﷺ) said, \"Won't you be pleased that the people take the worldly things and you take Allah's Messenger (ﷺ) with you? \"They said, \"Yes.\" The Prophet (ﷺ) said, \"If the people took their way through a valley or mountain pass, I would take my way through the Ansar's valley or mountain pass.\"",
                "hadithUrdu": "فتح مکہ کے زمانے میں نبی کریم صلی اللہ علیہ وسلم نے قریش میں ( حنین کی ) غنیمت کی تقسیم کر دی۔ انصار رضی اللہ عنہم اس سے رنجیدہ ہوئے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کیا تم اس پر راضی نہیں ہو کہ دوسرے لوگ دنیا اپنے ساتھ لے جائیں اور تم اپنے ساتھ رسول اللہ صلی اللہ علیہ وسلم کو لے جاؤ۔ انصار نے عرض کیا کہ ہم اس پر خوش ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ لوگ دوسرے کسی وادی یا گھاٹی میں رہیں تو میں انصار کی وادی یا گھاٹی میں رہوں گا۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے ابوالتیاح نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسٍ، قَالَ لَمَّا كَانَ يَوْمَ فَتْحِ مَكَّةَ قَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم غَنَائِمَ بَيْنَ قُرَيْشٍ‏.‏ فَغَضِبَتِ الأَنْصَارُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمَا تَرْضَوْنَ أَنْ يَذْهَبَ النَّاسُ بِالدُّنْيَا، وَتَذْهَبُونَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏‏.‏ قَالُوا بَلَى‏.‏ قَالَ ‏\"‏ لَوْ سَلَكَ النَّاسُ وَادِيًا أَوْ شِعْبًا لَسَلَكْتُ وَادِيَ الأَنْصَارِ أَوْ شِعْبَهُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4131,
                "hadithNumber": "4333",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When it was the day of (the battle of) Hunain, the Prophet (ﷺ) confronted the tribe of Hawazin while there were ten-thousand (men) besides the Tulaqa' (i.e. those who had embraced Islam on the day of the Conquest of Mecca) with the Prophet. When they (i.e. Muslims) fled, the Prophet (ﷺ) said, \"O the group of Ansari\" They replied, \"Labbaik, O Allah's Messenger (ﷺ) and Sadaik! We are under your command.\" Then the Prophet (ﷺ) got down (from his mule) and said, \"I am Allah's Slave and His Apostle.\" Then the pagans were defeated. The Prophet (ﷺ) distributed the war booty amongst the Tulaqa and Muhajirin (i.e. Emigrants) and did not give anything to the Ansar. So the Ansar spoke (i.e. were dissatisfied) and he called them and made them enter a leather tent and said, Won't you be pleased that the people take the sheep and camels, and you take Allah's Messenger (ﷺ) along with you?\" The Prophet (ﷺ) added, \"If the people took their way through a valley and the Ansar took their way through a mountain pass, then I would choose a mountain pass of the Ansar.\"",
                "hadithUrdu": "غزوہ حنین میں جب قبیلہ ہوازن سے جنگ شروع ہوئی تو نبی کریم صلی اللہ علیہ وسلم کے ساتھ دس ہزار فوج تھی۔ قریش کے وہ لوگ بھی ساتھ تھے جنہیں فتح مکہ کے بعد نبی کریم صلی اللہ علیہ وسلم نے چھوڑ دیا تھا پھر سب نے پیٹھ پھیر لی۔ آپ صلی اللہ علیہ وسلم نے پکارا: اے انصاریو! انہوں نے جواب دیا کہ ہم حاضر ہیں، یا رسول اللہ! آپ کے ہر حکم کی تعمیل کے لیے ہم حاضر ہیں۔ ہم آپ کے سامنے ہیں۔ پھر آپ صلی اللہ علیہ وسلم اپنی سواری سے اتر گئے اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں اللہ کا بندہ اور اس کا رسول ہوں پھر مشرکین کی ہار ہو گئی۔ جن لوگوں کو آپ صلی اللہ علیہ وسلم نے فتح مکہ کے بعد چھوڑ دیا تھا اور مہاجرین کو نبی کریم صلی اللہ علیہ وسلم نے دیا لیکن انصار کو کچھ نہیں دیا۔ اس پر انصار رضی اللہ عنہم نے اپنے غم کا اظہار کیا تو آپ نے انہیں بلایا اور ایک خیمہ میں جمع کیا پھر فرمایا کہ تم اس پر راضی نہیں ہو کہ دوسرے لوگ بکری اور اونٹ اپنے ساتھ لے جائیں اور تم رسول اللہ صلی اللہ علیہ وسلم کو اپنے ساتھ لے جاؤ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر لوگ کسی وادی یا گھاٹی میں رہیں اور انصار دوسری گھاٹی میں رہیں تو میں انصار کی گھاٹی کو اختیار کروں گا۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے ازہر بن سعد سمان نے بیان کیا اور ان سے عبداللہ بن عون نے، انہیں ہشام بن زید بن انس نے خبر دی اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَزْهَرُ، عَنِ ابْنِ عَوْنٍ، أَنْبَأَنَا هِشَامُ بْنُ زَيْدِ بْنِ أَنَسٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمَّا كَانَ يَوْمَ حُنَيْنٍ الْتَقَى هَوَازِنُ وَمَعَ النَّبِيِّ صلى الله عليه وسلم عَشَرَةُ آلاَفٍ وَالطُّلَقَاءُ فَأَدْبَرُوا قَالَ ‏\"‏ يَا مَعْشَرَ الأَنْصَارِ ‏\"‏‏.‏ قَالُوا لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْدَيْكَ، لَبَّيْكَ نَحْنُ بَيْنَ يَدَيْكَ، فَنَزَلَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَنَا عَبْدُ اللَّهِ وَرَسُولُهُ ‏\"‏‏.‏ فَانْهَزَمَ الْمُشْرِكُونَ، فَأَعْطَى الطُّلَقَاءَ وَالْمُهَاجِرِينَ وَلَمْ يُعْطِ الأَنْصَارَ شَيْئًا فَقَالُوا، فَدَعَاهُمْ فَأَدْخَلَهُمْ فِي قُبَّةٍ فَقَالَ ‏\"‏ أَمَا تَرْضَوْنَ أَنْ يَذْهَبَ النَّاسُ بِالشَّاةِ وَالْبَعِيرِ، وَتَذْهَبُونَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏لَوْ سَلَكَ النَّاسُ وَادِيًا وَسَلَكَتِ الأَنْصَارُ شِعْبًا لاَخْتَرْتُ شِعْبَ الأَنْصَارِ ‏\"‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4132,
                "hadithNumber": "4334",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) gathered some people of Ansar and said, \"The People of Quraish are still close to their Pre-lslamic period of ignorance and have suffered a lot, and I want to help them and attract their hearts (by giving them the war booty). Won't you be pleased that the people take the worldly things) and you take Allah's Messenger (ﷺ) with you to your homes?\" They said, \"Yes, (i.e. we are pleased with this distribution).\" The Prophet (ﷺ) said, \"'If the people took their way through a valley and the Ansar took their way through a mountain pass, then I would take the Ansar's valley or the Ansar's mountain pass.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے انصار کے کچھ لوگوں کو جمع کیا اور فرمایا کہ قریش کے کفر کا اور ان کی بربادیوں کا زمانہ قریب ہے۔ میرا مقصد صرف ان کی دلجوئی اور تالیف قلب تھا۔ کیا تم اس پر راضی اور خوش نہیں ہو کہ لوگ دنیا اپنے ساتھ لے کر جائیں اور تم اللہ کے رسول کو اپنے گھر لے جاؤ؟ سب انصاری بولے، کیوں نہیں ( ہم اسی پر راضی ہیں ) نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر دوسرے لوگ کسی وادی میں چلیں اور انصار کسی اور گھاٹی میں چلیں تو میں انصار کی وادی یا گھاٹی میں چلوں گا۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا، انہوں نے کہا، ہم سے غندر نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، انہوں نے کہا کہ میں نے قتادہ سے سنا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ جَمَعَ النَّبِيُّ صلى الله عليه وسلم نَاسًا مِنَ الأَنْصَارِ، فَقَالَ ‏\"‏ إِنَّ قُرَيْشًا حَدِيثُ عَهْدٍ بِجَاهِلِيَّةٍ وَمُصِيبَةٍ، وَإِنِّي أَرَدْتُ أَنْ أَجْبُرَهُمْ وَأَتَأَلَّفَهُمْ أَمَا تَرْضَوْنَ أَنْ يَرْجِعَ النَّاسُ بِالدُّنْيَا، وَتَرْجِعُونَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى بُيُوتِكُمْ ‏\"‏‏.‏ قَالُوا بَلَى‏.‏ قَالَ ‏\"‏ لَوْ سَلَكَ النَّاسُ وَادِيًا وَسَلَكَتِ الأَنْصَارُ شِعْبًا لَسَلَكْتُ وَادِيَ الأَنْصَارِ أَوْ شِعْبَ الأَنْصَارِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4133,
                "hadithNumber": "4335",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "When the Prophet (ﷺ) distribute the war booty of Hunain, a man from the Ansar said, \"He (i.e. the Prophet), did not intend to please Allah in this distribution.\" So I came to the Prophet (ﷺ) and informed him of that (statement) whereupon the color of his face changed and he said, \"May Allah bestow His Mercy on Moses, for he was troubled with more than this, but he remained patient.\"",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم حنین کے مال غنیمت کی تقسیم کر رہے تھے تو انصار کے ایک شخص نے ( جو منافق تھا ) کہا کہ اس تقسیم میں اللہ کی خوشنودی کا کوئی خیال نہیں رکھا گیا۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر آپ صلی اللہ علیہ وسلم کو اس بدگو کی اطلاع دی تو آپ صلی اللہ علیہ وسلم کے چہرہ مبارک کا رنگ بدل گیا پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ موسیٰ علیہ السلام پر رحم فرمائے، انہیں اس سے بھی زیادہ دکھ پہنچایا گیا پس انہوں نے صبر کیا۔",
                "urduNarrator": "ہم سے قبیصہ نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے اعمش نے، ان سے ابووائل نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ لَمَّا قَسَمَ النَّبِيُّ صلى الله عليه وسلم قِسْمَةَ حُنَيْنٍ قَالَ رَجُلٌ مِنَ الأَنْصَارِ مَا أَرَادَ بِهَا وَجْهَ اللَّهِ‏.‏ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرْتُهُ، فَتَغَيَّرَ وَجْهُهُ ثُمَّ قَالَ ‏ \"‏ رَحْمَةُ اللَّهِ عَلَى مُوسَى، لَقَدْ أُوذِيَ بِأَكْثَرَ مِنْ هَذَا فَصَبَرَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4134,
                "hadithNumber": "4336",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "When it was the day of Hunain, Prophet favored some people over some others (in the distribution of the booty). He gave Al-Aqra' one-hundred camels and gave Uyaina the same, and also gave other people (of Quraish). A man said, \"Allah's Pleasure was not the aim, in this distribution.\" I said, \"I will inform the Prophet (about your statement).\" The Prophet (ﷺ) said, \"May Allah bestow Mercy on Moses, for he was troubled more this but he remained patient.\"",
                "hadithUrdu": "غزوہ حنین کے موقع پر رسول اللہ صلی اللہ علیہ وسلم نے چند لوگوں کو بہت بہت جانور دئیے۔ چنانچہ اقرع بن حابس کو جن کا دل بہلانا منظور تھا، سو اونٹ دئیے۔ عیینہ بن حصن فزاری کو بھی اتنے ہی دئیے اور اسی طرح دوسرے اشراف عرب کو دیا۔ اس پر ایک شخص نے کہا کہ اس تقسیم میں اللہ کی رضا کا کوئی خیال نہیں کیا گیا۔ ( ابن مسعود رضی اللہ عنہ نے بیان کیا کہ ) میں نے کہا کہ میں اس کی خبر رسول اللہ صلی اللہ علیہ وسلم کو کروں گا۔ جب نبی کریم صلی اللہ علیہ وسلم نے یہ کلمہ سنا تو فرمایا کہ اللہ موسیٰ علیہ السلام پر رحم فرمائے کہ انہیں اس سے بھی زیادہ دکھ دیا گیا تھا لیکن انہوں نے صبر کیا۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے منصور نے، ان سے ابووائل نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ لَمَّا كَانَ يَوْمُ حُنَيْنٍ آثَرَ النَّبِيُّ صلى الله عليه وسلم نَاسًا، أَعْطَى الأَقْرَعَ مِائَةً مِنَ الإِبِلِ، وَأَعْطَى عُيَيْنَةَ مِثْلَ ذَلِكَ، وَأَعْطَى نَاسًا، فَقَالَ رَجُلٌ مَا أُرِيدَ بِهَذِهِ الْقِسْمَةِ وَجْهُ اللَّهِ‏.‏ فَقُلْتُ لأُخْبِرَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ رَحِمَ اللَّهُ مُوسَى‏.‏ قَدْ أُوذِيَ بِأَكْثَرَ مِنْ هَذَا فَصَبَرَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4135,
                "hadithNumber": "4337",
                "englishNarrator": "Narrated Anas Bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "When it was the day (of the battle) of Hunain, the tributes of Hawazin and Ghatafan and others, along with their animals and offspring (and wives) came to fight against the Prophet (ﷺ) The Prophet (ﷺ) had with him, ten thousand men and some of the Tulaqa. The companions fled, leaving the Prophet (ﷺ) alone. The Prophet then made two calls which were clearly distinguished from each other. He turned right and said, \"O the group of Ansar!\" They said, \"Labbaik, O Allah's Messenger (ﷺ)! Rejoice, for we are with you!\" Then he turned left and said, \"O the group of Ansar!\" They said, \"Labbaik! O Allah's Messenger (ﷺ)! Rejoice, for we are with you!\" The Prophet (ﷺ) at that time, was riding on a white mule; then he dismounted and said, \"I am Allah's Slave and His Apostle.\" The infidels then were defeated, and on that day the Prophet (ﷺ) gained a large amount of booty which he distributed amongst the Muhajirin and the Tulaqa and did not give anything to the Ansar. The Ansar said, \"When there is a difficulty, we are called, but the booty is given to other than us.\" The news reached the Prophet (ﷺ) and he gathered them in a leather tent and said, \"What is this news reaching me from you, O the group of Ansar?\" They kept silent, He added,\" O the group of Ansar! Won't you be happy that the people take the worldly things and you take Allah's Messenger (ﷺ) to your homes reserving him for yourself?\" They said, \"Yes.\" Then the Prophet said, \"If the people took their way through a valley, and the Ansar took their way through a mountain pass, surely, I would take the Ansar's mountain pass.\" Hisham said, \"O Abu Hamza (i.e. Anas)! Did you witness that? \" He replied, \"And how could I be absent from him?\"",
                "hadithUrdu": "جب حنین کا دن ہوا تو قبیلہ ہوازن اور غطفان اپنے مویشی اور بال بچوں کو ساتھ لے کر جنگ کے لیے نکلے۔ اس وقت نبی کریم صلی اللہ علیہ وسلم کے ساتھ دس ہزار کا لشکر تھا۔ ان میں کچھ لوگ وہ بھی تھے، جنہیں نبی کریم صلی اللہ علیہ وسلم نے فتح مکہ کے بعد احسان رکھ کر چھوڑ دیا تھا، پھر ان سب نے پیٹھ پھیر لی اور نبی کریم صلی اللہ علیہ وسلم تنہا رہ گئے۔ اس دن آپ صلی اللہ علیہ وسلم نے دو مرتبہ پکارا دونوں پکار ایک دوسرے سے الگ الگ تھیں، آپ صلی اللہ علیہ وسلم نے دائیں طرف متوجہ ہو کر پکارا: اے انصاریو! انہوں نے جواب دیا ہم حاضر ہیں: یا رسول اللہ! آپ کو بشارت ہو، ہم آپ کے ساتھ ہیں، لڑنے کو تیار ہیں۔ پھر آپ بائیں طرف متوجہ ہوئے اور آواز دی، اے انصاریو! انہوں نے ادھر سے جواب دیا کہ ہم حاضر ہیں، یا رسول اللہ! بشارت ہو، ہم آپ کے ساتھ ہیں۔ آپ صلی اللہ علیہ وسلم اس وقت ایک سفید خچر پر سوار تھے پھر آپ اتر گئے اور فرمایا کہ میں اللہ کا بندہ اور اس کا رسول ہوں۔ انجام کار کافروں کو ہار ہوئی اور اس لڑائی میں بہت زیادہ غنیمت حاصل ہوئی۔ آپ صلی اللہ علیہ وسلم نے اسے مہاجرین میں اور قریشیوں میں تقسیم کر دیا ( جنہیں فتح مکہ کے موقع پر احسان رکھ کر چھوڑ دیا تھا ) انصار کو ان میں سے کچھ نہیں عطا فرمایا۔ انصار ( کے بعض نوجوانوں ) نے کہا کہ جب سخت وقت آتا ہے تو ہمیں بلایا جاتا ہے اور غنیمت دوسروں کو تقسیم کر دی جاتی ہے۔ یہ بات نبی کریم صلی اللہ علیہ وسلم تک پہنچی تو آپ نے انصار کو ایک خیمہ میں جمع کیا اور فرمایا اے انصاریو! کیا وہ بات صحیح ہے جو تمہارے بارے میں مجھے معلوم ہوئی ہے؟ اس پر وہ خاموش ہو گئے پھر آپ صلی اللہ علیہ وسلم نے فرمایا: اے انصاریو! کیا تم اس پر خوش نہیں ہو کہ لوگ دنیا اپنے ساتھ لے جائیں اور تم رسول اللہ کو اپنے گھر لے جاؤ۔ انصاریوں نے عرض کیا ہم اسی پر خوش ہیں۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر لوگ کسی وادی میں چلیں اور انصار کسی گھاٹی میں چلیں تو میں انصار ہی کی گھاٹی میں چلنا پسند کروں گا۔ اس پر ہشام نے پوچھا: اے ابوحمزہ! کیا آپ وہاں موجود تھے؟ انہوں نے کہا کہ میں آپ صلی اللہ علیہ وسلم سے غائب ہی کب ہوتا تھا۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے معاذ نے بیان کیا، کہا ہم سے عبداللہ بن عون نے، ان سے ہشام بن زید بن انس بن مالک نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ هِشَامِ بْنِ زَيْدِ بْنِ أَنَسِ بْنِ مَالِكٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ لَمَّا كَانَ يَوْمُ حُنَيْنٍ أَقْبَلَتْ هَوَازِنُ وَغَطَفَانُ وَغَيْرُهُمْ بِنَعَمِهِمْ وَذَرَارِيِّهِمْ، وَمَعَ النَّبِيِّ صلى الله عليه وسلم عَشَرَةُ آلاَفٍ وَمِنَ الطُّلَقَاءِ، فَأَدْبَرُوا عَنْهُ حَتَّى بَقِيَ وَحْدَهُ، فَنَادَى يَوْمَئِذٍ نِدَاءَيْنِ لَمْ يَخْلِطْ بَيْنَهُمَا، الْتَفَتَ عَنْ يَمِينِهِ، فَقَالَ ‏\"‏ يَا مَعْشَرَ الأَنْصَارِ ‏\"‏‏.‏ قَالُوا لَبَّيْكَ يَا رَسُولَ اللَّهِ، أَبْشِرْ نَحْنُ مَعَكَ‏.‏ ثُمَّ الْتَفَتَ عَنْ يَسَارِهِ، فَقَالَ ‏\"‏ يَا مَعْشَرَ الأَنْصَارِ ‏\"‏‏.‏ قَالُوا لَبَّيْكَ يَا رَسُولَ اللَّهِ، أَبْشِرْ نَحْنُ مَعَكَ‏.‏ وَهْوَ عَلَى بَغْلَةٍ بَيْضَاءَ، فَنَزَلَ فَقَالَ ‏\"‏ أَنَا عَبْدُ اللَّهِ وَرَسُولُهُ ‏\"‏، فَانْهَزَمَ الْمُشْرِكُونَ، فَأَصَابَ يَوْمَئِذٍ غَنَائِمَ كَثِيرَةً، فَقَسَمَ فِي الْمُهَاجِرِينَ وَالطُّلَقَاءِ وَلَمْ يُعْطِ الأَنْصَارَ شَيْئًا، فَقَالَتِ الأَنْصَارُ إِذَا كَانَتْ شَدِيدَةٌ فَنَحْنُ نُدْعَى، وَيُعْطَى الْغَنِيمَةَ غَيْرُنَا‏.‏ فَبَلَغَهُ ذَلِكَ، فَجَمَعَهُمْ فِي قُبَّةٍ، فَقَالَ ‏\"‏ يَا مَعْشَرَ الأَنْصَارِ مَا حَدِيثٌ بَلَغَنِي عَنْكُمْ ‏\"‏‏.‏ فَسَكَتُوا فَقَالَ ‏\"‏ يَا مَعْشَرَ الأَنْصَارِ أَلاَ تَرْضَوْنَ أَنْ يَذْهَبَ النَّاسُ بِالدُّنْيَا، وَتَذْهَبُونَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم تَحُوزُونَهُ إِلَى بُيُوتِكُمْ ‏\"‏‏.‏ قَالُوا بَلَى‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ سَلَكَ النَّاسُ وَادِيًا، وَسَلَكَتِ الأَنْصَارُ شِعْبًا لأَخَذْتُ شِعْبَ الأَنْصَارِ ‏\"‏‏.‏ فَقَالَ هِشَامٌ يَا أَبَا حَمْزَةَ، وَأَنْتَ شَاهِدٌ ذَاكَ قَالَ وَأَيْنَ أَغِيبُ عَنْهُ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4136,
                "hadithNumber": "4338",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) sent a Sariya towards Najd and I was in it, and our share from the booty amounted to twelve camels each, and we were given an additional camel each. So we returned with thirteen camels each.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے نجد کی طرف ایک لشکر روانہ کیا تھا، میں بھی اس میں شریک تھا۔ اس میں ہمارا حصہ ( مال غنیمت میں ) بارہ بارہ اونٹ پڑے اور ایک ایک اونٹ ہمیں اور فالتو دیا گیا۔ اس طرح ہم تیرہ تیرہ اونٹ ساتھ لے کر واپس آئے۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، کہا ہم سے ایوب سختیانی نے بیان کیا، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم سَرِيَّةً قِبَلَ نَجْدٍ، فَكُنْتُ فِيهَا، فَبَلَغَتْ سِهَامُنَا اثْنَىْ عَشَرَ بَعِيرًا، وَنُفِّلْنَا بَعِيرًا بَعِيرًا، فَرَجَعْنَا بِثَلاَثَةَ عَشَرَ بَعِيرًا‏.‏",
                "headingArabic": "السَّرِيَّةِ الَّتِي قِبَلَ نَجْدٍ",
                "headingUrdu": "سریہ جو نجد کی طرف بھیجی گئی۔",
                "headingEnglish": "The Sariya which was sent towards Najd",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4137,
                "hadithNumber": "4339",
                "englishNarrator": "Narrated Salim's father:",
                "hadithEnglish": "The Prophet (ﷺ) sent Khalid bin Al-Walid رضی اللہ عنہ to the tribe of Jadhima and Khalid رضی اللہ عنہ invited them to Islam but they could not express themselves by saying, \"Aslamna (i.e. we have embraced Islam),\" but they started saying \"Saba'na! Saba'na (i.e. we have come out of one religion to another).\" Khalid رضی اللہ عنہ kept on killing (some of) them and taking (some of) them as captives and gave every one of us his Captive. When there came the day then Khalid رضی اللہ عنہ ordered that each man (i.e. Muslim soldier) should kill his captive, I said, \"By Allah, I will not kill my captive, and none of my companions will kill his captive.\" When we reached the Prophet, we mentioned to him the whole story. On that, the Prophet (ﷺ) raised both his hands and said twice, \"O Allah! I am free from what Khalid has done.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے خالد بن ولید رضی اللہ عنہ کو بنی جذیمہ کی طرف بھیجا۔ خالد بن ولید رضی اللہ عنہ نے انہیں اسلام کی دعوت دی لیکن انہیں «أسلمنا‏.‏» ”ہم اسلام لائے“ کہنا نہیں آتا تھا، اس کے بجائے وہ «صبأنا‏.‏، صبأنا‏.‏» ”ہم بےدین ہو گئے، یعنی اپنے آبائی دین سے ہٹ گئے“ کہنے لگے۔ خالد رضی اللہ عنہ نے انہیں قتل کرنا اور قید کرنا شروع کر دیا اور پھر ہم میں سے ہر شخص کو اس کا قیدی اس کی حفاظت کے لیے دے دیا پھر جب ایک دن خالد رضی اللہ عنہ نے ہم سب کو حکم دیا کہ ہم اپنے قیدیوں کو قتل کر دیں۔ میں نے کہا: اللہ کی قسم! میں اپنے قیدی کو قتل نہیں کروں گا اور نہ میرے ساتھیوں میں کوئی اپنے قیدی کو قتل کرے گا آخر جب ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ سے صورت حال بیان کیا تو آپ نے ہاتھ اٹھا کر دعا کی۔ اے اللہ! میں اس فعل سے بیزاری کا اعلان کرتا ہوں، جو خالد نے کیا۔ دو مرتبہ آپ صلی اللہ علیہ وسلم نے یہی فرمایا۔",
                "urduNarrator": "مجھ سے محمود بن غیلان نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، انہیں معمر نے خبر دی۔ (دوسری سند) اور مجھ سے نعیم بن حماد نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، انہیں معمر نے، انہیں زہری نے، انہیں سالم نے اور ان سے ان کے والد عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، وَحَدَّثَنِي نُعَيْمٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم خَالِدَ بْنَ الْوَلِيدِ إِلَى بَنِي جَذِيمَةَ، فَدَعَاهُمْ إِلَى الإِسْلاَمِ فَلَمْ يُحْسِنُوا أَنْ يَقُولُوا أَسْلَمْنَا‏.‏ فَجَعَلُوا يَقُولُونَ صَبَأْنَا، صَبَأْنَا‏.‏ فَجَعَلَ خَالِدٌ يَقْتُلُ مِنْهُمْ وَيَأْسِرُ، وَدَفَعَ إِلَى كُلِّ رَجُلٍ مِنَّا أَسِيرَهُ، حَتَّى إِذَا كَانَ يَوْمٌ أَمَرَ خَالِدٌ أَنْ يَقْتُلَ كُلُّ رَجُلٍ مِنَّا أَسِيرَهُ فَقُلْتُ وَاللَّهِ لاَ أَقْتُلُ أَسِيرِي، وَلاَ يَقْتُلُ رَجُلٌ مِنْ أَصْحَابِي أَسِيرَهُ، حَتَّى قَدِمْنَا عَلَى النَّبِيِّ صلى الله عليه وسلم فَذَكَرْنَاهُ، فَرَفَعَ النَّبِيُّ صلى الله عليه وسلم يَدَهُ فَقَالَ ‏ \"‏ اللَّهُمَّ إِنِّي أَبْرَأُ إِلَيْكَ مِمَّا صَنَعَ خَالِدٌ ‏\"‏‏.‏ مَرَّتَيْنِ‏.‏",
                "headingArabic": "بَعْثِ النَّبِيِّ صلى الله عليه وسلم خَالِدَ بْنَ الْوَلِيدِ إِلَى بَنِي جَذِيمَةَ",
                "headingUrdu": "خالد بن ولید کو بنو جذیمہ بھیجنا",
                "headingEnglish": "Sending Khalid bin Al-Walid to Banu Jadhima",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4138,
                "hadithNumber": "4340",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) sent a Sariya under the command of a man from the Ansar and ordered the soldiers to obey him. He (i.e. the commander) became angry and said \"Didn't the Prophet (ﷺ) order you to obey me!\" They replied, \"Yes.\" He said, \"Collect fire-wood for me.\" So they collected it. He said, \"Make a fire.\" When they made it, he said, \"Enter it (i.e. the fire).\" So they intended to do that and started holding each other and saying, \"We run towards (i.e. take refuge with) the Prophet (ﷺ) from the fire.\" They kept on saying that till the fire was extinguished and the anger of the commander abated. When that news reached the Prophet (ﷺ) he said, \"If they had entered it (i.e. the fire), they would not have come out of it till the Day of Resurrection. Obedience (to somebody) is required when he enjoins what is good.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک مختصر لشکر روانہ کیا اور اس کا امیر ایک انصاری صحابی ( عبداللہ بن حذافہ سہمی رضی اللہ عنہ ) کو بنایا اور لشکریوں کو حکم دیا کہ سب اپنے امیر کی اطاعت کریں پھر امیر کسی وجہ سے غصہ ہو گئے اور اپنے فوجیوں سے پوچھا کہ کیا تمہیں رسول اللہ صلی اللہ علیہ وسلم نے میری اطاعت کرنے کا حکم نہیں فرمایا ہے؟ سب نے کہا کہ ہاں فرمایا ہے۔ انہوں نے کہا پھر تم سب لکڑیاں جمع کرو۔ انہوں نے لکڑیاں جمع کیں تو امیر نے حکم دیا کہ اس میں آگ لگاؤ اور انہوں نے آگ لگا دی۔ اب انہوں نے حکم دیا کہ سب اس میں کود جاؤ۔ فوجی کود جانا ہی چاہتے تھے کہ انہیں میں سے بعض نے بعض کو روکا اور کہا کہ ہم تو اس آگ ہی کے خوف سے رسول اللہ صلی اللہ علیہ وسلم کی طرف آئے ہیں! ان باتوں میں وقت گزر گیا اور آگ بھی بجھ گئی۔ اس کے بعد امیر کا غصہ ٹھنڈا ہو گیا۔ جب اس کی خبر رسول اللہ صلی اللہ علیہ وسلم کو پہنچی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر یہ لوگ اس میں کود جاتے تو پھر قیامت تک اس میں سے نہ نکلتے۔ اطاعت کا حکم صرف نیک کاموں کے لیے ہے۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے عبدالواحد بن زیاد نے بیان کیا، کہا ہم سے اعمش نے بیان کیا، کہا مجھ سے سعد بن عبیدہ نے بیان کیا، ان سے ابوعبدالرحمٰن اسلمی نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي سَعْدُ بْنُ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم سَرِيَّةً فَاسْتَعْمَلَ رَجُلاً مِنَ الأَنْصَارِ، وَأَمَرَهُمْ أَنْ يُطِيعُوهُ، فَغَضِبَ فَقَالَ أَلَيْسَ أَمَرَكُمُ النَّبِيُّ صلى الله عليه وسلم أَنْ تُطِيعُونِي‏.‏ قَالُوا بَلَى‏.‏ قَالَ فَاجْمَعُوا لِي حَطَبًا‏.‏ فَجَمَعُوا، فَقَالَ أَوْقِدُوا نَارًا‏.‏ فَأَوْقَدُوهَا، فَقَالَ ادْخُلُوهَا‏.‏ فَهَمُّوا، وَجَعَلَ بَعْضُهُمْ يُمْسِكُ بَعْضًا، وَيَقُولُونَ فَرَرْنَا إِلَى النَّبِيِّ صلى الله عليه وسلم مِنَ النَّارِ‏.‏ فَمَا زَالُوا حَتَّى خَمَدَتِ النَّارُ، فَسَكَنَ غَضَبُهُ، فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لَوْ دَخَلُوهَا مَا خَرَجُوا مِنْهَا إِلَى يَوْمِ الْقِيَامَةِ، الطَّاعَةُ فِي الْمَعْرُوفِ ‏\"‏‏.‏",
                "headingArabic": "سَرِيَّةُ عَبْدِ اللَّهِ بْنِ حُذَافَةَ السَّهْمِيِّ وَعَلْقَمَةَ بْنِ مُجَزِّزٍ الْمُدْلِجِيِّ",
                "headingUrdu": "انصار کی ساریہ",
                "headingEnglish": "The Sariya of the Ansar",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4139,
                "hadithNumber": "4341, 4342",
                "englishNarrator": "Narrated Abu Burda رضی اللہ عنہ :",
                "hadithEnglish": "Allah Apostle ﷺ dispatched Hadrat Abu  Musa and Mu`adh bin Jabal رضی اللہ عنہما towards Yemen (as rulers) and sent them to separate provinces for Yemen comprised two provinces. Then, he ﷺ urged both of people harshly; strive to please the people and not to render them offended. So, both of them went to their respective provinces and when any of them happened to visit his border area adjoining the province of his Companion, he would visit him and greet him. So, once Hadrat Muadh رضی اللہ عنہ paid a visit to his border areas ner to the province of Hadrat Abu Musa رضی اللہ عنہ riding his mule. He reached him while he was sitting and many people had surrounded him. Lo and behold! There was a man beside him with his hands fastened with his neck. He asked: O Abdullah bin Qais! Why he has been tied? He replied: This man has lapsed back to infidelity after embracing Islam. He said: I will not dismount until he is killed. He said: He has been brought only for for this purpose, so you my dismount. He said: I will not dismount until he is killed. So, he issued orders to kill him and he was killed, then he dismounted, and asked: I Abdullah! How do you recite the Quran? He replied: I recite it piecemeal. Then Hadrat Abu Musa رضی اللہ عنہ inquired: O Muadh! How do you recite the Quran? He replied: I sleep in the first part of the night, then get up after enjoying sleep and recite the Quran asa much as Allah please, so I consider my sleep (an act of: Irfan) a reward as I consider my being awake (for worship) a reward.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ابوموسیٰ اشعری اور معاذ بن جبل رضی اللہ عنہما کو یمن کا حاکم بنا کر بھیجا۔ راوی نے بیان کیا کہ دونوں صحابیوں کو اس کے ایک ایک صوبے میں بھیجا۔ راوی نے بیان کیا کہ یمن کے دو صوبے تھے۔ پھر نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ دیکھو لوگوں کے لیے آسانیاں پیدا کرنا، دشواریاں نہ پیدا کرنا، انہیں خوش کرنے کی کوشش کرنا، دین سے نفرت نہ دلانا۔ یہ دونوں بزرگ اپنے اپنے کاموں پر روانہ ہو گئے۔ دونوں میں سے جب کوئی اپنے علاقے کا دورہ کرتے کرتے اپنے دوسرے ساتھی کے پاس پہنچ جاتا تو ان سے تازی ( ملاقات ) کے لیے آتا اور سلام کرتا۔ ایک مرتبہ معاذ رضی اللہ عنہ اپنے علاقہ میں اپنے صاحب ابوموسیٰ رضی اللہ عنہ کے قریب پہنچ گئے اور اپنے خچر پر ان سے ملاقات کے لیے چلے۔ جب ان کے قریب پہنچے تو دیکھا کہ وہ بیٹھے ہوئے ہیں اور ان کے پاس کچھ لوگ جمع ہیں اور ایک شخص ان کے سامنے ہے جس کی مشکیں کسی ہوئی ہیں۔ معاذ رضی اللہ عنہ نے ان سے پوچھا: اے عبداللہ بن قیس! یہ کیا واقعہ ہے؟ ابوموسیٰ رضی اللہ عنہ نے بتلایا کہ یہ شخص اسلام لانے کے بعد مرتد ہو گیا ہے۔ انہوں نے کہا کہ پھر جب تک اسے قتل نہ کر دیا جائے میں اپنی سواری سے نہیں اتروں گا۔ موسیٰ رضی اللہ عنہ نے کہا کہ قتل کرنے ہی کے لیے اسے یہاں لایا گیا ہے۔ آپ اتر جائیں لیکن انہوں نے اب بھی یہی کہا کہ جب تک اسے قتل نہ کیا جائے گا میں نہ اتروں گا۔ آخر موسیٰ رضی اللہ عنہ نے حکم دیا اور اسے قتل کر دیا گیا۔ تب وہ اپنی سواری سے اترے اور پوچھا، عبداللہ! آپ قرآن کس طرح پڑھتے ہیں؟ انہوں نے کہا میں تو تھوڑا تھوڑا ہر وقت پڑھتا رہتا ہوں پھر انہوں نے معاذ رضی اللہ عنہ سے پوچھا کہ معاذ! آپ قرآن مجید کس طرح پڑھتے ہیں؟ معاذ رضی اللہ عنہ نے کہا کہ میں تو رات کے شروع میں سوتا ہوں پھر اپنی نیند کا ایک حصہ پورا کر کے میں اٹھ بیٹھتا ہوں اور جو کچھ اللہ تعالیٰ نے میرے لیے مقدر کر رکھا ہے اس میں قرآن مجید پڑھتا ہوں۔ اس طرح بیداری میں جس ثواب کی امید اللہ تعالیٰ سے رکھتا ہوں سونے کی حالت کے ثواب کا بھی اس سے اسی طرح امیدوار رہتا ہوں۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، کہا ہم سے عبدالملک بن عمیر نے بیان کیا، ان سے ابوبردہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ أَبِي بُرْدَةَ، قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا مُوسَى وَمُعَاذَ بْنَ جَبَلٍ إِلَى الْيَمَنِ، قَالَ وَبَعَثَ كُلَّ وَاحِدٍ مِنْهُمَا عَلَى مِخْلاَفٍ قَالَ وَالْيَمَنُ مِخْلاَفَانِ ثُمَّ قَالَ ‏ \"‏ يَسِّرَا وَلاَ تُعَسِّرَا، وَبَشِّرَا وَلاَ تُنَفِّرَا ‏\"‏‏.‏ فَانْطَلَقَ كُلُّ وَاحِدٍ مِنْهُمَا إِلَى عَمَلِهِ، وَكَانَ كُلُّ وَاحِدٍ مِنْهُمَا إِذَا سَارَ فِي أَرْضِهِ كَانَ قَرِيبًا مِنْ صَاحِبِهِ أَحْدَثَ بِهِ عَهْدًا، فَسَلَّمَ عَلَيْهِ، فَسَارَ مُعَاذٌ فِي أَرْضِهِ قَرِيبًا مِنْ صَاحِبِهِ أَبِي مُوسَى، فَجَاءَ يَسِيرُ عَلَى بَغْلَتِهِ حَتَّى انْتَهَى إِلَيْهِ، وَإِذَا هُوَ جَالِسٌ، وَقَدِ اجْتَمَعَ إِلَيْهِ النَّاسُ، وَإِذَا رَجُلٌ عِنْدَهُ قَدْ جُمِعَتْ يَدَاهُ إِلَى عُنُقِهِ فَقَالَ لَهُ مُعَاذٌ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ، أَيَّمَ هَذَا قَالَ هَذَا رَجُلٌ كَفَرَ بَعْدَ إِسْلاَمِهِ‏.‏ قَالَ لاَ أَنْزِلُ حَتَّى يُقْتَلَ‏.‏ قَالَ إِنَّمَا جِيءَ بِهِ لِذَلِكَ فَانْزِلْ‏.‏ قَالَ مَا أَنْزِلُ حَتَّى يُقْتَلَ فَأَمَرَ بِهِ فَقُتِلَ ثُمَّ نَزَلَ فَقَالَ يَا عَبْدَ اللَّهِ، كَيْفَ تَقْرَأُ الْقُرْآنَ قَالَ أَتَفَوَّقُهُ تَفَوُّقًا‏.‏ قَالَ فَكَيْفَ تَقْرَأُ أَنْتَ يَا مُعَاذُ قَالَ أَنَامُ أَوَّلَ اللَّيْلِ فَأَقُومُ وَقَدْ قَضَيْتُ جُزْئِي مِنَ النَّوْمِ، فَأَقْرَأُ مَا كَتَبَ اللَّهُ لِي، فَأَحْتَسِبُ نَوْمَتِي كَمَا أَحْتَسِبُ قَوْمَتِي‏.‏",
                "headingArabic": "بَعْثُ أَبِي مُوسَى وَمُعَاذٍ إِلَى الْيَمَنِ قَبْلَ حَجَّةِ الْوَدَاعِ",
                "headingUrdu": "ابو موسی اور معاذ کو یمن بھیجنا",
                "headingEnglish": "Sending Abu Musa and Mu'adh to Yemen",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4140,
                "hadithNumber": "4343",
                "englishNarrator": "Narrated Abu Musa Al-Ash`ari رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) had sent him to Yemen and he asked the Prophet (ﷺ) about certain (alcoholic) drink which used to be prepared there The Prophet (ﷺ) said, \"What are they?\" Abu Musa رضی اللہ عنہ said, \"Al-Bit' and Al-Mizr?\" He said, \"Al-Bit is an alcoholic drink made from honey; and Al-Mizr is an alcoholic drink made from barley.\" The Prophet (ﷺ) said, \"All intoxicants are prohibited.\" Jareer, Abdul Wahid, Shaibani reported it from Hadrat Abu Burdah.",
                "hadithUrdu": "Tنبی کریم صلی اللہ علیہ وسلم نے انہیں یمن بھیجا۔ ابوموسیٰ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے ان شربتوں کا مسئلہ پوچھا جو یمن میں بنائے جاتے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ وہ کیا ہیں؟ ابوموسیٰ رضی اللہ عنہ نے بتایا کہ ”بتع“ اور ”مزر“ ( سعید بن ابی بردہ نے کہا کہ ) میں نے ابوبردہ ( اپنے والد ) سے پوچھا ”بتع“ کیا چیز ہے؟ انہوں نے بتایا کہ شہد سے تیاری کی ہوئی شراب اور ”مزر“ جَو سے تیار کی ہوئی شراب۔ نبی کریم صلی اللہ علیہ وسلم نے جواب میں فرمایا کہ ہر نشہ آور چیز پینا حرام ہے۔ اس کی روایت جریر اور عبدالواحد نے شیبانی سے کی ہے اور انہوں نے ابوبردہ سے کی ہے۔",
                "urduNarrator": "مجھ سے اسحاق نے بیان کیا، کہا ہم سے خالد نے، ان سے شیبانی نے، ان سے سعید بن ابی بردہ نے، ان سے ان کے والد نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا خَالِدٌ، عَنِ الشَّيْبَانِيِّ، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَهُ إِلَى الْيَمَنِ، فَسَأَلَهُ عَنْ أَشْرِبَةٍ تُصْنَعُ بِهَا، فَقَالَ ‏\"‏ وَمَا هِيَ ‏\"‏‏.‏ قَالَ الْبِتْعُ وَالْمِزْرُ‏.‏ فَقُلْتُ لأَبِي بُرْدَةَ مَا الْبِتْعُ قَالَ نَبِيذُ الْعَسَلِ، وَالْمِزْرُ نَبِيذُ الشَّعِيرِ‏.‏ فَقَالَ ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏‏.‏ رَوَاهُ جَرِيرٌ وَعَبْدُ الْوَاحِدِ عَنِ الشَّيْبَانِيِّ عَنْ أَبِي بُرْدَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4141,
                "hadithNumber": "4344, 4345",
                "englishNarrator": "Narrated Abu Burda:",
                "hadithEnglish": "The Prophet (ﷺ) sent his (i.e. Abu Burda's) grandfather, Abu Musa رضی اللہ عنہ and Mu`adh رضی اللہ عنہ to Yemen and said to both of them \"Facilitate things for the people (Be kind and lenient) and do not make things difficult (for people), and give them good tidings, and do not repulse them and both of you should obey each other.\" Abu Musa رضی اللہ عنہ said, \"O Allah's Prophet! In our land there is an alcoholic drink (prepared) from barley called Al-Mizr, and another (prepared) from honey, called Al-Bit.\" The Prophet (ﷺ) said, \"All intoxicants are prohibited.\" Then both of them proceeded and Mu`adh رضی اللہ عنہ asked Abu Musa رضی اللہ عنہ , \"How do you recite the Qur'an?\" Abu Musa رضی اللہ عنہ replied, \"I recite it while I am standing, sitting or riding my riding animals, at intervals and piecemeal.\" Mu`adh رضی اللہ عنہ said, \"But I sleep and then get up. I sleep and hope for Allah's Reward for my sleep as I seek His Reward for my night prayer.\" Then he (i.e. Mu`adh) pitched a tent and they started visiting each other. Once Mu`adh رضی اللہ عنہ paid a visit to Abu Musa رضی اللہ عنہ and saw a chained man. Mu`adh رضی اللہ عنہ asked, \"What is this?\" Abu Musa رضی اللہ عنہ said, \"(He was) a Jew who embraced Islam and has now turned apostate.\" Mu`adh رضی اللہ عنہ said, \"I will surely chop off his neck!\" Aqadi and Wahab have reported likewise from Shobah. Hadrat Abu Musa Ashari رضی اللہ عنہ has reported from the prophet ﷺ. Moreover, Jareer bin Abdul Hameed from Shaibani and he has reported from Hadrat Abu Burdah رضی اللہ عنہ .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ان کے دادا ابوموسیٰ رضی اللہ عنہ اور معاذ بن جبل رضی اللہ عنہ کو یمن کا حاکم بنا کر بھیجا اور فرمایا کہ لوگوں کے لیے آسانی پیدا کرنا، ان کو دشواریوں میں نہ ڈالنا۔ لوگوں کو خوش خبریاں دینا دین سے نفرت نہ دلانا اور تم دونوں آپس میں موافقت رکھنا۔ اس پر ابوموسیٰ اشعری رضی اللہ عنہ نے عرض کیا: اے اللہ کے نبی! ہمارے ملک میں جَو سے ایک شراب تیار ہوتی ہے جس کا نام ”مزر“ ہے اور شہد سے ایک شراب تیار ہوتی ہے جو ”بتع“ کہلاتی ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہر نشہ لانے والی چیز حرام ہے۔ پھر دونوں بزرگ روانہ ہوئے۔ معاذ رضی اللہ عنہ نے ابوموسیٰ رضی اللہ عنہ سے پوچھا آپ قرآن کس طرح پڑھتے ہیں؟ انہوں نے بتایا کہ کھڑے ہو کر بھی، بیٹھ کر بھی اور اپنی سواری پر بھی اور میں تھوڑے تھوڑے عرصہ بعد پڑھتا ہی رہتا ہوں۔ معاذ رضی اللہ عنہ نے کہا لیکن میرا معمول یہ ہے کہ شروع رات میں، میں سو جاتا ہوں اور پھر بیدار ہو جاتا ہوں۔ اس طرح میں اپنی نیند پر بھی ثواب کا امیدوار ہوں جس طرح بیدار ہو کر ( عبادت کرنے پر ) ثواب کی مجھے امید ہے اور انہوں نے ایک خیمہ لگا لیا اور ایک دوسرے سے ملاقات برابر ہوتی رہتی۔ ایک مرتبہ معاذ رضی اللہ عنہ ابوموسیٰ رضی اللہ عنہ سے ملنے کے لیے آئے، دیکھا ایک شخص بندھا ہوا ہے۔ پوچھا یہ کیا بات ہے؟ ابوموسیٰ رضی اللہ عنہ نے بتلایا کہ یہ ایک یہودی ہے، پہلے خود اسلام لایا اب یہ مرتد ہو گیا ہے۔ معاذ رضی اللہ عنہ نے کہا کہ میں اسے قتل کئے بغیر ہرگز نہ رہوں گا۔ مسلم بن ابراہیم کے ساتھ اس حدیث کو عبدالملک بن عمرو عقدی اور وہب بن جریر نے شعبہ سے روایت کیا ہے اور وکیع، نضر اور ابوداؤد نے اس کو شعبہ سے، انہوں نے سعید سے، انہوں اپنے باپ بردہ سے، انہوں نے سعید کے دادا ابوموسیٰ رضی اللہ عنہ سے، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کیا اور جریر بن عبد الحمید نے اس کو شیبانی سے روایت کیا، انہوں نے ابوبردہ سے۔",
                "urduNarrator": "ہم سے مسلم نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے سعید بن ابی بردہ نے اور ان کے والد نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم جَدَّهُ أَبَا مُوسَى، وَمُعَاذًا إِلَى الْيَمَنِ فَقَالَ ‏\"‏ يَسِّرَا وَلاَ تُعَسِّرَا، وَبَشِّرَا وَلاَ تُنَفِّرَا، وَتَطَاوَعَا ‏\"‏‏.‏ فَقَالَ أَبُو مُوسَى يَا نَبِيَّ اللَّهِ، إِنَّ أَرْضَنَا بِهَا شَرَابٌ مِنَ الشَّعِيرِ الْمِزْرُ، وَشَرَابٌ مِنَ الْعَسَلِ الْبِتْعُ‏.‏ فَقَالَ ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏‏.‏ فَانْطَلَقَا فَقَالَ مُعَاذٌ لأَبِي مُوسَى كَيْفَ تَقْرَأُ الْقُرْآنَ قَالَ قَائِمًا وَقَاعِدًا وَعَلَى رَاحِلَتِهِ وَأَتَفَوَّقُهُ تَفَوُّقًا‏.‏ قَالَ أَمَّا أَنَا فَأَنَامُ وَأَقُومُ، فَأَحْتَسِبُ نَوْمَتِي كَمَا أَحْتَسِبُ قَوْمَتِي، وَضَرَبَ فُسْطَاطًا، فَجَعَلاَ يَتَزَاوَرَانِ، فَزَارَ مُعَاذٌ أَبَا مُوسَى، فَإِذَا رَجُلٌ مُوثَقٌ، فَقَالَ مَا هَذَا فَقَالَ أَبُو مُوسَى يَهُودِيٌّ أَسْلَمَ ثُمَّ ارْتَدَّ‏.‏ فَقَالَ مُعَاذٌ لأَضْرِبَنَّ عُنُقَهُ‏.‏ تَابَعَهُ الْعَقَدِيُّ وَوَهْبٌ عَنْ شُعْبَةَ‏.‏ وَقَالَ وَكِيعٌ وَالنَّضْرُ وَأَبُو دَاوُدَ عَنْ شُعْبَةَ، عَنْ سَعِيدٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ رَوَاهُ جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ عَنِ الشَّيْبَانِيِّ عَنْ أَبِي بُرْدَةَ‏.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4142,
                "hadithNumber": "4346",
                "englishNarrator": "Narrated Abu Musa Al-Ash`ari رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent me (as a governor) to the land of my people, and I came while Allah's Messenger (ﷺ) was encamping at a place called Al-Abtah. The Prophet (ﷺ) said, \"Have you made the intention to perform the Hajj, O `Abdullah bin Qais?\" I replied, \"Yes, O Allah's Messenger (ﷺ)!\" He said, \"What did you say?\" I replied, \"I said, 'Labbaik' and expressed the same intention as yours.\" He said, \"Have you driven the Hadi along with you?\" I replied, \"No, I did not drive the Hadi.\" He said, \"So perform the Tawaf of the Ka`ba and then the Sai, between Safa and Marwa and then finish the state of Ihram.\" So I did the same, and one of the women of (the tribe of) Banu-Qais combed my hair. We continued follow in that tradition till the caliphate of `Umar رضی اللہ عنہ .",
                "hadithUrdu": "مجھے رسول اللہ صلی اللہ علیہ وسلم نے میری قوم کے وطن ( یمن ) میں بھیجا۔ پھر میں آیا تو نبی کریم صلی اللہ علیہ وسلم ( مکہ کی ) وادی ابطح میں پڑاؤ کئے ہوئے تھے۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا: عبداللہ بن قیس! تم نے حج کا احرام باندھا لیا؟ میں نے عرض کیا: جی ہاں یا رسول اللہ! آپ نے دریافت فرمایا کہ کلمات احرام کس طرح کہے؟ بیان کیا کہ میں نے عرض کیا ( کہ یوں کلمات ادا کئے ہیں ) ”اے اللہ میں حاضر ہوں، اور جس طرح آپ صلی اللہ علیہ وسلم نے احرام باندھا ہے، میں نے بھی اسی طرح باندھا ہے۔“ فرمایا تم اپنے ساتھ قربانی کا جانور بھی لائے ہو؟ میں نے کہا کہ کوئی جانور تو میں اپنے ساتھ نہیں لایا۔ فرمایا تم پھر پہلے بیت اللہ کا طواف اور صفا اور مروہ کی سعی کر لو۔ ان رکنوں کی ادائیگی کے بعد حلال ہو جانا۔ میں نے اسی طرح کیا اور بنو قیس کی خاتون نے میرے سر میں کنگھا کیا اور اسی قاعدے پر ہم اس وقت تک چلتے رہے جب تک عمر رضی اللہ عنہ خلیفہ ہوئے ( اسی کو حج تمتع کہتے ہیں اور یہ بھی سنت ہے ) ۔",
                "urduNarrator": "ہم سے عباس بن ولید نے بیان کیا، کہا ہم سے عبدالواحد بن زیاد نے بیان کیا، ان سے ایوب بن عائذ نے، ان سے قیس بن مسلم نے بیان کیا، کہا میں نے طارق بن شہاب سے سنا، انہوں نے کہا کہ مجھ سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنِي عَبَّاسُ بْنُ الْوَلِيدِ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنْ أَيُّوبَ بْنِ عَائِذٍ، حَدَّثَنَا قَيْسُ بْنُ مُسْلِمٍ، قَالَ سَمِعْتُ طَارِقَ بْنَ شِهَابٍ، يَقُولُ حَدَّثَنِي أَبُو مُوسَى الأَشْعَرِيُّ ـ رضى الله عنه ـ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى أَرْضِ قَوْمِي، فَجِئْتُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم مُنِيخٌ بِالأَبْطَحِ فَقَالَ ‏\"‏ أَحَجَجْتَ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ ‏\"‏‏.‏ قُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ كَيْفَ قُلْتَ ‏\"‏‏.‏ قَالَ قُلْتُ لَبَّيْكَ إِهْلاَلاً كَإِهْلاَلِكَ‏.‏ قَالَ ‏\"‏ فَهَلْ سُقْتَ مَعَكَ هَدْيًا ‏\"‏‏.‏ قُلْتُ لَمْ أَسُقْ‏.‏ قَالَ ‏\"‏ فَطُفْ بِالْبَيْتِ وَاسْعَ بَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ حِلَّ ‏\"‏‏.‏ فَفَعَلْتُ حَتَّى مَشَطَتْ لِي امْرَأَةٌ مِنْ نِسَاءِ بَنِي قَيْسٍ، وَمَكُثْنَا بِذَلِكَ حَتَّى اسْتُخْلِفَ عُمَرُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4143,
                "hadithNumber": "4347",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said to Mu`adh bin Jabal رضی اللہ عنہ when he sent him to Yemen. \"You will come to the people of Scripture, and when you reach them, invite them to testify that none has the right to be worshipped except Allah and that Muhammad is His Apostle. And if they obey you in that, then tell them that Allah has enjoined on them five prayers to be performed every day and night. And if they obey you in that, then tell them that Allah has enjoined on them Sadaqa (i.e. rak`at) to be taken from the rich amongst them and given to the poor amongst them. And if they obey you in that, then be cautious! Don't take their best properties (as Zakat) and be afraid of the curse of an oppressed person as there is no screen between his invocation and Allah. Imam Bukhari says: طوعت‏ and طاعت are synonyms as are طعت and وطعت and وأطعت‏ .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے معاذ بن جبل رضی اللہ عنہ کو یمن کا ( حاکم بنا کر بھیجتے وقت انہیں ) ہدایت فرمائی تھی کہ تم ایک ایسی قوم کی طرف جا رہے ہو جو اہل کتاب یہودی اور نصرانی وغیرہ میں سے ہیں۔ اس لیے جب تم وہاں پہنچو تو پہلے انہیں اس کی دعوت دو کہ وہ گواہی دیں کہ اللہ کے سوا کوئی معبود نہیں اور محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں۔ اگر اس میں وہ تمہاری بات مان لیں تو پھر انہیں بتاؤ کہ اللہ تعالیٰ نے روزانہ ان پر پانچ وقت کی نمازیں فرض کی ہیں، جب یہ بھی مان لیں تو انہیں بتاؤ کہ اللہ تعالیٰ نے ان پر زکوٰۃ کو بھی فرض کیا ہے، جو ان کے مالدار لوگوں سے لی جائے گی اور انہیں کے غریبوں میں تقسیم کر دی جائے گی۔ جب یہ بھی مان جائیں تو ( پھر زکوٰۃ وصول کرتے وقت ) ان کا سب سے عمدہ مال لینے سے پرہیز کرنا اور مظلوم کی آہ سے ہر وقت ڈرتے رہنا کہ اس کے اور اللہ کے درمیان کوئی رکاوٹ نہیں ہوتی ہے۔ ابوعبداللہ امام بخاری رحمہ اللہ نے کہا کہ سورۃ المائدہ میں جو «طوعت‏» کا لفظ آیا ہے اس کا وہی معنی ہے جو «طاعت» اور «أطاعت» کا ہے جیسے کہتے ہیں «طعت وطعت وأطعت‏.‏» سب کا معنی ایک ہی ہے۔",
                "urduNarrator": "مجھ سے حبان بن موسیٰ نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، انہیں زکریا بن اسحاق نے، انہیں یحییٰ بن عبداللہ بن صیفی نے، انہیں ابن عباس رضی اللہ عنہما کے غلام ابومعبد نافذ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي حِبَّانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ زَكَرِيَّاءَ بْنِ إِسْحَاقَ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ، عَنْ أَبِي مَعْبَدٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمُعَاذِ بْنِ جَبَلٍ حِينَ بَعَثَهُ إِلَى الْيَمَنِ ‏ \"‏ إِنَّكَ سَتَأْتِي قَوْمًا مِنْ أَهْلِ الْكِتَابِ، فَإِذَا جِئْتَهُمْ فَادْعُهُمْ إِلَى أَنْ يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، فَإِنْ هُمْ طَاعُوا لَكَ بِذَلِكَ فَأَخْبِرْهُمْ أَنَّ اللَّهَ قَدْ فَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ، فَإِنْ هُمْ طَاعُوا لَكَ بِذَلِكَ، فَأَخْبِرْهُمْ أَنَّ اللَّهَ قَدْ فَرَضَ عَلَيْكُمْ صَدَقَةً، تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ، فَتُرَدُّ عَلَى فُقَرَائِهِمْ، فَإِنْ هُمْ طَاعُوا لَكَ بِذَلِكَ، فَإِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ، وَاتَّقِ دَعْوَةَ الْمَظْلُومِ فَإِنَّهُ لَيْسَ بَيْنَهُ وَبَيْنَ اللَّهِ حِجَابٌ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ ‏{‏طَوَّعَتْ‏}‏ طَاعَتْ وَأَطَاعَتْ لُغَةٌ، طِعْتُ وَطُعْتُ وَأَطَعْتُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4144,
                "hadithNumber": "4348",
                "englishNarrator": "Narrated Mu`adh رضی اللہ عنہ :",
                "hadithEnglish": "When he arrived at Yemen, he led them (i.e. the people of Yemen) in the Fajr prayer wherein he recited: 'Allah took Abraham as a Khalil.' A man amongst the people said, \"(How) glad the mother of Abraham is!\" (In another narration) `Amr said, \"The Prophet (ﷺ) sent Mu`adh to Yemen and he (led the people) in the Fajr prayer and recited: 'Allah took Abraham as a Khalil. A man behind him said, \"(How) glad the mother of Abraham is!\"",
                "hadithUrdu": "جب وہ یمن پہنچے تو یمن والوں کو صبح کی نماز پڑھائی اور نماز میں آیت «واتخذ الله إبراهيم خليلا‏» کی قرآت کی تو ان میں سے ایک صاحب ( نماز ہی میں ) بولے کہ ابراہیم کی والدہ کی آنکھ ٹھنڈی ہو گئی ہو گی۔ معاذ بن معاذ بغوی نے شعبہ سے، انہوں نے حبیب سے، انہوں نے سعید سے، انہوں نے عمرو بن میمون سے اس حدیث میں صرف اتنا بڑھایا ہے کہ نبی کریم صلی اللہ علیہ وسلم نے معاذ کو یمن بھیجا وہاں انہوں نے صبح کی نماز میں سورۃ نساء پڑھی جب اس آیت پر پہنچے «واتخذ الله إبراهيم خليلا‏» تو ایک صاحب جو ان کے پیچھے کھڑے ہوئے تھے کہا کہ ابراہیم کی والدہ کی آنکھ ٹھنڈی ہو گئی ہو گی۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، ان سے حبیب بن ابی ثابت نے بیان کیا، ان سے سعید بن جبیر نے بیان کیا، ان سے عمرو بن میمون نے اور ان سے معاذ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، أَنَّ مُعَاذًا ـ رضى الله عنه ـ لَمَّا قَدِمَ الْيَمَنَ صَلَّى بِهِمِ الصُّبْحَ فَقَرَأَ ‏{‏وَاتَّخَذَ اللَّهُ إِبْرَاهِيمَ خَلِيلاً‏}‏ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ لَقَدْ قَرَّتْ عَيْنُ أُمِّ إِبْرَاهِيمَ‏.‏ زَادَ مُعَاذٌ عَنْ شُعْبَةَ عَنْ حَبِيبٍ عَنْ سَعِيدٍ عَنْ عَمْرٍو أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ مُعَاذًا إِلَى الْيَمَنِ، فَقَرَأَ مُعَاذٌ فِي صَلاَةِ الصُّبْحِ سُورَةَ النِّسَاءِ فَلَمَّا قَالَ ‏{‏وَاتَّخَذَ اللَّهُ إِبْرَاهِيمَ خَلِيلاً‏}‏ قَالَ رَجُلٌ خَلْفَهُ قَرَّتْ عَيْنُ أُمِّ إِبْرَاهِيمَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4145,
                "hadithNumber": "4349",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent us to Yemen along with Khalid bin Al-Walid رضی اللہ عنہ . Later on he sent `Ali bin Abi Talib رضی اللہ عنہ in his place. The Prophet (ﷺ) said to `Ali, \"Give Khalid's companions the choice of either staying with you (in Yemen) or returning to Medina.\" I was one of those who stayed with him (i.e. `Ali) and got several Awaq (of silver from the war booty.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں خالد بن ولید رضی اللہ عنہ کے ساتھ یمن بھیجا، بیان کیا کہ پھر اس کے بعد ان کی جگہ علی رضی اللہ عنہ کو بھیجا اور آپ نے انہیں ہدایت کی کہ خالد کے ساتھیوں سے کہو کہ جو ان میں سے تمہارے ساتھ یمن میں رہنا چاہے وہ تمہارے ساتھ پھر یمن کو لوٹ جائے اور جو وہاں سے واپس آنا چاہے وہ چلا آئے۔ براء رضی اللہ عنہ کہتے ہیں کہ میں ان لوگوں میں سے تھا جو یمن کو لوٹ گئے۔ انہوں نے بیان کیا کہ مجھے غنیمت میں کئی اوقیہ چاندی کے ملے تھے۔",
                "urduNarrator": "مجھ سے احمد بن عثمان بن حکیم نے بیان کیا، کہا ہم سے شریح بن مسلمہ نے بیان کیا، کہا ہم سے ابراہیم بن یوسف بن اسحاق بن ابی اسحاق نے بیان کیا، کہا مجھ سے میرے والد نے بیان کیا، ان سے ابواسحاق نے کہا کہ میں نے براء بن عازب رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ عُثْمَانُ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ بْنِ إِسْحَاقَ بْنِ أَبِي إِسْحَاقَ، حَدَّثَنِي أَبِي، عَنْ أَبِي إِسْحَاقَ، سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ‏.‏ بَعَثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ خَالِدِ بْنِ الْوَلِيدِ إِلَى الْيَمَنِ، قَالَ ثُمَّ بَعَثَ عَلِيًّا بَعْدَ ذَلِكَ مَكَانَهُ فَقَالَ مُرْ أَصْحَابَ خَالِدٍ، مَنْ شَاءَ مِنْهُمْ أَنْ يُعَقِّبَ مَعَكَ فَلْيُعَقِّبْ، وَمَنْ شَاءَ فَلْيُقْبِلْ‏.‏ فَكُنْتُ فِيمَنْ عَقَّبَ مَعَهُ، قَالَ فَغَنِمْتُ أَوَاقٍ ذَوَاتِ عَدَدٍ‏.‏",
                "headingArabic": "بَعْثُ عَلِيِّ بْنِ أَبِي طَالِبٍ ـ عَلَيْهِ السَّلاَمُ ـ وَخَالِدِ بْنِ الْوَلِيدِ ـ رضى الله عنه ـ إِلَى الْيَمَنِ قَبْلَ حَجَّةِ الْوَدَاعِ",
                "headingUrdu": "علی اور خالد رضی اللہ عنہ کو یمن بھیجنا",
                "headingEnglish": "Sending 'Ali and Khalid رضي الله عنهما to Yemen",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4146,
                "hadithNumber": "4350",
                "englishNarrator": "Narrated Buraida:",
                "hadithEnglish": "The Prophet (ﷺ) sent `Ali رضی اللہ عنہ to Khalid رضی اللہ عنہ to bring the Khumus (of the booty) and I hated `Ali رضی اللہ عنہ , and `Ali رضی اللہ عنہ had taken a bath (after a sexual act with a slave-girl from the Khumus). I said to Khalid رضی اللہ عنہ , \"Don't you see this (i.e. `Ali)?\" When we reached the Prophet (ﷺ) I mentioned that to him. He said, \"O Buraida! Do you hate `Ali رضی اللہ عنہ ?\" I said, \"Yes.\" He said, \"Do you hate him, for he deserves more than that from the Khumlus.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے خالد بن ولید رضی اللہ عنہ کی جگہ علی رضی اللہ عنہ کو ( یمن ) بھیجا تاکہ غنیمت کے خمس ( پانچواں حصہ ) کو ان سے لے آئیں۔ مجھے علی رضی اللہ عنہ سے بہت بغض تھا اور میں نے انہیں غسل کرتے دیکھا تھا۔ میں نے خالد رضی اللہ عنہ سے کہا تم دیکھتے ہو علی رضی اللہ عنہ نے کیا کیا ( اور ایک لونڈی سے صحبت کی ) پھر جب ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو میں نے آپ سے بھی اس کا ذکر کیا۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا ( بریدہ ) کیا تمہیں علی رضی اللہ عنہ کی طرف سے بغض ہے؟ میں نے عرض کیا کہ جی ہاں، فرمایا علی سے دشمنی نہ رکھنا کیونکہ خمس ( غنیمت کے پانچویں حصے ) میں اس سے بھی زیادہ حق ہے۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا، کہا ہم سے روح بن عبادہ نے بیان کیا، کہا ہم سے علی بن سوید بن منجوف نے بیان کیا، ان سے عبداللہ بن بریدہ نے اور ان سے ان کے والد (بریدہ بن حصیب) نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا عَلِيُّ بْنُ سُوَيْدِ بْنِ مَنْجُوفٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ بَعَثَ النَّبِيُّ صلى الله عليه وسلم عَلِيًّا إِلَى خَالِدٍ لِيَقْبِضَ الْخُمُسَ وَكُنْتُ أُبْغِضُ عَلِيًّا، وَقَدِ اغْتَسَلَ، فَقُلْتُ لِخَالِدٍ أَلاَ تَرَى إِلَى هَذَا فَلَمَّا قَدِمْنَا عَلَى النَّبِيِّ صلى الله عليه وسلم ذَكَرْتُ ذَلِكَ لَهُ فَقَالَ ‏\"‏ يَا بُرَيْدَةُ أَتُبْغِضُ عَلِيًّا ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ لاَ تُبْغِضْهُ فَإِنَّ لَهُ فِي الْخُمُسِ أَكْثَرَ مِنْ ذَلِكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4147,
                "hadithNumber": "4351",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "`Ali bin Abi Talib رضی اللہ عنہ sent a piece of gold not yet taken out of its ore, in a tanned leather container to Allah's Messenger (ﷺ) . Allah's Messenger (ﷺ) distributed that amongst four Persons: 'Uyaina bin Badr, Aqra bin H`Abis, Zaid Al-Khail and the fourth was either Alqama or Amir bin at-Tufail رضی اللہ عنہ . On that, one of his companions said, \"We are more deserving of this (gold) than these (persons).\" When that news reached the Prophet (ﷺ) , he said, \"Don't you trust me though I am the truth worthy man of the One in the Heavens, and I receive the news of Heaven (i.e. Divine Inspiration) both in the morning and in the evening?\" There got up a man with sunken eyes, raised cheek bones, raised forehead, a thick beard, a shaven head and a waist sheet that was tucked up and he said, \"O Allah's Messenger (ﷺ)! Be afraid of Allah.\" The Prophet (ﷺ) said, \"Woe to you! Am I not of all the people of the earth the most entitled to fear Allah?\" Then that man went away. Khalid bin Al-Wahd said, \"O Allah's Messenger (ﷺ)! Shall I chop his neck off?\" The Prophet (ﷺ) said, \"No, for he may offer prayers.\" Khalid رضی اللہ عنہ said, \"Numerous are those who offer prayers and say by their tongues (i.e. mouths) what is not in their hearts.\" Allah's Messenger (ﷺ) said, \"I have not been ordered (by Allah) to search the hearts of the people or cut open their bellies.\" Then the Prophet looked at him (i.e. that man) while the latter was going away and said, \"From the offspring of this (man there will come out (people) who will recite the Qur'an continuously and elegantly but it will not exceed their throats. (They will neither understand it nor act upon it). They would go out of the religion (i.e. Islam) as an arrow goes through a game's body.\" I think he also said, \"If I should be present at their time I would kill them as the nations a Thamud were killed.\"",
                "hadithUrdu": "یمن سے علی بن ابی طالب رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے پاس بیری کے پتوں سے دباغت دئیے ہوئے چمڑے کے ایک تھیلے میں سونے کے چند ڈلے بھیجے۔ ان سے ( کان کی ) مٹی بھی ابھی صاف نہیں کی گئی تھی۔ راوی نے بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے وہ سونا چار آدمیوں میں تقسیم کر دیا۔ عیینہ بن بدر، اقرع بن حابس، زید بن خیل اور چوتھے علقمہ رضی اللہ عنہم تھے یا عامر بن طفیل رضی اللہ عنہ تھے۔ آپ کے اصحاب میں سے ایک صاحب نے اس پر کہا کہ ان لوگوں سے زیادہ ہم اس سونے کے مستحق تھے۔ راوی نے بیان کیا کہ جب نبی کریم صلی اللہ علیہ وسلم کو معلوم ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم مجھ پر اعتبار نہیں کرتے حالانکہ اس اللہ نے مجھ پر اعتبار کیا ہے جو آسمان پر ہے اور اس کی جو آسمان پر ہے وحی میرے پاس صبح و شام آتی ہے۔ راوی نے بیان کیا کہ پھر ایک شخص جس کی آنکھیں دھنسی ہوئی تھیں، دونوں رخسار پھولے ہوئے تھے، پیشانی بھی ابھری ہوئی تھی، گھنی داڑھی اور سر منڈا ہوا، تہبند اٹھائے ہوئے تھا، کھڑا ہوا اور کہنے لگا: یا رسول اللہ! اللہ سے ڈرئیے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ افسوس تجھ پر، کیا میں اس روئے زمین پر اللہ سے ڈرنے کا سب سے زیادہ مستحق نہیں ہوں؟ راوی نے بیان کیا پھر وہ شخص چلا گیا۔ خالد بن ولید رضی اللہ عنہ نے عرض کیا: یا رسول اللہ! میں کیوں نہ اس شخص کی گردن مار دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں شاید وہ نماز پڑھتا ہو اس پر خالد رضی اللہ عنہ نے عرض کیا کہ بہت سے نماز پڑھنے والے ایسے ہیں جو زبان سے اسلام کا دعویٰ کرتے ہیں اور ان کے دل میں وہ نہیں ہوتا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کا حکم نہیں ہوا ہے کہ لوگوں کے دلوں کی کھوج لگاؤں اور نہ اس کا حکم ہوا کہ ان کے پیٹ چاک کروں۔ راوی نے کہا پھر نبی کریم صلی اللہ علیہ وسلم نے اس ( منافق ) کی طرف دیکھا تو وہ پیٹھ پھیر کر جا رہا تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کی نسل سے ایک ایسی قوم نکلے گی جو کتاب اللہ کی تلاوت بڑی خوش الحانی کے ساتھ کرے گی لیکن وہ ان کے حلق سے نیچے نہیں اترے گا۔ دین سے وہ لوگ اس طرح نکل چکے ہوں گے جیسے تیر جانور کے پار نکل جاتا ہے اور میرا خیال ہے کہ آپ صلی اللہ علیہ وسلم نے یہ بھی فرمایا کہ اگر میں ان کے دور میں ہوا تو ثمود کی قوم کی طرح ان کو بالکل قتل کر ڈالوں گا۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے عبدالواحد بن زیاد نے بیان کیا، ان سے عمارہ بن قعقاع بن شبرمہ نے بیان کیا، ان سے عبدالرحمٰن بن ابی نعیم نے بیان کیا، کہا کہ میں نے ابو سعید خدری رضی اللہ عنہ سے سنا وہ کہتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ بْنِ شُبْرُمَةَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنِ أَبِي نُعْمٍ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ بَعَثَ عَلِيُّ بْنُ أَبِي طَالِبٍ ـ رضى الله عنه ـ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الْيَمَنِ بِذُهَيْبَةٍ فِي أَدِيمٍ مَقْرُوظٍ لَمْ تُحَصَّلْ مِنْ تُرَابِهَا، قَالَ فَقَسَمَهَا بَيْنَ أَرْبَعَةِ نَفَرٍ بَيْنَ عُيَيْنَةَ بْنِ بَدْرٍ، وَأَقْرَعَ بْنِ حَابِسٍ وَزَيْدِ الْخَيْلِ، وَالرَّابِعُ إِمَّا عَلْقَمَةُ وَإِمَّا عَامِرُ بْنُ الطُّفَيْلِ، فَقَالَ رَجُلٌ مِنْ أَصْحَابِهِ كُنَّا نَحْنُ أَحَقَّ بِهَذَا مِنْ هَؤُلاَءِ‏.‏ قَالَ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَلاَ تَأْمَنُونِي وَأَنَا أَمِينُ مَنْ فِي السَّمَاءِ، يَأْتِينِي خَبَرُ السَّمَاءِ صَبَاحًا وَمَسَاءً ‏\"‏‏.‏ قَالَ فَقَامَ رَجُلٌ غَائِرُ الْعَيْنَيْنِ، مُشْرِفُ الْوَجْنَتَيْنِ، نَاشِزُ الْجَبْهَةِ، كَثُّ اللِّحْيَةِ، مَحْلُوقُ الرَّأْسِ، مُشَمَّرُ الإِزَارِ، فَقَالَ يَا رَسُولَ اللَّهِ، اتَّقِ اللَّهَ‏.‏ قَالَ ‏\"‏ وَيْلَكَ أَوَلَسْتُ أَحَقَّ أَهْلِ الأَرْضِ أَنْ يَتَّقِيَ اللَّهَ ‏\"‏‏.‏ قَالَ ثُمَّ وَلَّى الرَّجُلُ، قَالَ خَالِدُ بْنُ الْوَلِيدِ يَا رَسُولَ اللَّهِ، أَلاَ أَضْرِبُ عُنُقَهُ قَالَ ‏\"‏ لاَ، لَعَلَّهُ أَنْ يَكُونَ يُصَلِّي ‏\"‏‏.‏ فَقَالَ خَالِدٌ وَكَمْ مِنْ مُصَلٍّ يَقُولُ بِلِسَانِهِ مَا لَيْسَ فِي قَلْبِهِ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي لَمْ أُومَرْ أَنْ أَنْقُبَ قُلُوبَ النَّاسِ، وَلاَ أَشُقَّ بُطُونَهُمْ ‏\"‏ قَالَ ثُمَّ نَظَرَ إِلَيْهِ وَهْوَ مُقَفٍّ فَقَالَ ‏\"‏ إِنَّهُ يَخْرُجُ مِنْ ضِئْضِئِ هَذَا قَوْمٌ يَتْلُونَ كِتَابَ اللَّهِ رَطْبًا، لاَ يُجَاوِزُ حَنَاجِرَهُمْ، يَمْرُقُونَ مِنَ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ ‏\"‏‏.‏ وَأَظُنُّهُ قَالَ ‏\"‏ لَئِنْ أَدْرَكْتُهُمْ لأَقْتُلَنَّهُمْ قَتْلَ ثَمُودَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4148,
                "hadithNumber": "4352",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "\"The Prophet (ﷺ) ordered `Ali رضی اللہ عنہ to keep the state of Ihram.\" Jabir رضی اللہ عنہ added, \"Ali bin Abi Talib returned (from Yemen) when he was a governor (of Yemen). The Prophet (ﷺ) said to him, 'With what intention have you assumed the state of Ihram?' `Ali رضی اللہ عنہ said, \"I have assumed Ihram with an intention as that of the Prophet.\" Then the Prophet (ﷺ) said (to him), 'Offer a Hadi and keep the state of Ihram in which you are now.' `Ali رضی اللہ عنہ slaughtered a Hadi on his behalf.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ سے ( جب وہ یمن سے مکہ آئے ) فرمایا تھا کہ وہ اپنے احرام پر باقی رہیں۔ محمد بن بکر نے ابن جریج سے اتنا بڑھایا کہ ان سے عطاء نے بیان کیا کہ جابر رضی اللہ عنہ نے کہا علی رضی اللہ عنہ اپنی ولایت ( یمن ) سے آئے تو آپ صلی اللہ علیہ وسلم نے ان سے دریافت فرمایا کہ علی! تم نے احرام کس طرح باندھا ہے؟ عرض کیا کہ جس طرح احرام آپ نے باندھا ہو۔ فرمایا پھر قربانی کا جانور بھیج دو اور جس طرح احرام باندھا ہے، اسی کے مطابق عمل کرو۔ بیان کیا کہ علی رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے لیے قربانی کے جانور لائے تھے۔",
                "urduNarrator": "ہم سے مکی بن ابراہیم نے بیان کیا، ان سے ابن جریج نے کہ عطاء بن ابی رباح نے بیان کیا اور ان سے جابر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ جُرَيْجٍ، قَالَ عَطَاءٌ قَالَ جَابِرٌ أَمَرَ النَّبِيُّ صلى الله عليه وسلم عَلِيًّا أَنْ يُقِيمَ عَلَى إِحْرَامِهِ‏.‏ زَادَ مُحَمَّدُ بْنُ بَكْرٍ عَنِ ابْنِ جُرَيْجٍ، قَالَ عَطَاءٌ قَالَ جَابِرٌ فَقَدِمَ عَلِيُّ بْنُ أَبِي طَالِبٍ رضى الله عنه بِسِعَايَتِهِ، قَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِمَ أَهْلَلْتَ يَا عَلِيُّ ‏\"‏‏.‏ قَالَ بِمَا أَهَلَّ بِهِ النَّبِيُّ صلى الله عليه وسلم قَالَ ‏\"‏ فَأَهْدِ وَامْكُثْ حَرَامًا كَمَا أَنْتَ ‏\"‏‏.‏ قَالَ وَأَهْدَى لَهُ عَلِيٌّ هَدْيًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4149,
                "hadithNumber": "4353, 4354",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) assumed the state of Ihram for Umra and Hajj, and we to assumed it for Hajj with him. When we arrived at Mecca, the Prophet (ﷺ) said, \"Whoever does not possess a Hadi should regard his Ihram for Umra only.\" The Prophet (ﷺ) had a Hadi with him. `Ali bin Abi Talib رضی اللہ عنہ came to us from Yemen with the intention of performing Hajj. The Prophet (ﷺ) said (to him), \"With what intention have you assumed the Ihram, for your wife is with us?\" `Ali رضی اللہ عنہ said, \"I assumed the lhram with the same intention as that of the Prophet (ﷺ) .\" The Prophet (ﷺ) said, \"Keep on the state of lhram, as we have got the Hadi.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے عمرہ اور حج دونوں کا احرام باندھا تھا اور ہم نے بھی آپ کے ساتھ حج ہی کا احرام باندھا تھا۔ پھر ہم جب مکہ آئے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس کے ساتھ قربانی کا جانور نہ ہو وہ اپنے حج کے احرام کو عمرہ کا احرام کر لے ( اور طواف اور سعی کر کے احرام کھول دے ) اور نبی کریم صلی اللہ علیہ وسلم کے ساتھ قربانی کا جانور تھا۔ پھر علی بن ابی طالب رضی اللہ عنہ یمن سے لوٹ کر حج کا احرام باندھ کر آئے۔ آپ صلی اللہ علیہ وسلم نے ان سے دریافت فرمایا کہ تم نے کس طرح احرام باندھا ہے؟ ہمارے ساتھ تمہاری زوجہ فاطمہ بھی ہیں۔ انہوں نے عرض کیا کہ میں نے اسی طرح کا احرام باندھا ہے جس طرح آپ صلی اللہ علیہ وسلم نے باندھا ہو۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر اپنے احرام پر قائم رہو، کیونکہ ہمارے ساتھ قربانی کا جانور ہے۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے بشر بن مفضل نے بیان کیا، ان سے حمید طویل نے، کہا ہم سے بکر بن عبداللہ نے بیان کیا، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے ذکر کیا کہ انس رضی اللہ عنہ نے ان سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ حُمَيْدٍ الطَّوِيلِ، حَدَّثَنَا بَكْرٌ، أَنَّهُ ذَكَرَ لاِبْنِ عُمَرَ أَنَّ أَنَسًا حَدَّثَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَهَلَّ بِعُمْرَةٍ وَحَجَّةٍ، فَقَالَ أَهَلَّ النَّبِيُّ صلى الله عليه وسلم بِالْحَجِّ، وَأَهْلَلْنَا بِهِ مَعَهُ، فَلَمَّا قَدِمْنَا مَكَّةَ قَالَ ‏\"‏ مَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ فَلْيَجْعَلْهَا عُمْرَةً ‏\"‏‏.‏ وَكَانَ مَعَ النَّبِيِّ صلى الله عليه وسلم هَدْىٌ، فَقَدِمَ عَلَيْنَا عَلِيُّ بْنُ أَبِي طَالِبٍ مِنَ الْيَمَنِ حَاجًّا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِمَ أَهْلَلْتَ فَإِنَّ مَعَنَا أَهْلَكَ ‏\"‏‏.‏ قَالَ أَهْلَلْتُ بِمَا أَهَلَّ بِهِ النَّبِيُّ صلى الله عليه وسلم‏.‏ قَالَ ‏\"‏ فَأَمْسِكْ، فَإِنَّ مَعَنَا هَدْيًا ‏\"‏‏.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4150,
                "hadithNumber": "4355",
                "englishNarrator": "Hadrat Jareer (bin Abdullah Bajali) رضی اللہ عنہ says:",
                "hadithEnglish": "In the Pre-lslamic Period of Ignorance, there was a house called Dhu-l-Khalasa or Al-Ka`ba Al- Yamaniya or Al-Ka`ba Ash-Shamiya. The Prophet (ﷺ) said to me: Won't you gladden meby razing it. So, I ventured towards it along with one hundred and fifty riders and wrecked it, and killed the people all around. Then we apprised the prophet ﷺ of this account and he ﷺ invoked Allah for us and for the people of Ahmas.",
                "hadithUrdu": "زمانہ جاہلیت میں ایک بت خانہ  ذوالخلصہ تھا جسے  الکعبہ یمنیہ یا الکعبہ الشامیہ کہا جاتا تھا۔ مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے مجھ  سےفرمایا کہ ذوالخلصہ کی تکلیف  سے مجھےکیوں نہیں نجات دلاتے? چنانچہ میں نےڈیڑھ سو سواروں کےساتھ سفر کیا‘پھرہم نے اس کو مسمارکردیااو راس میں ہم نےجس  کوبھی قتل کر دیاپھر میں آپ کی خدمت میں حاضر ہوا او ر  آپ   کو  اس  کی خبردی تو آپ صلی اللہ علیہ وسلم نےہمارےاو ر قبیلہ احمس کے لیے بہت دعا فرمائی۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے خالد بن عبداللہ طحان نے بیان کیا، ان سے بیان بن بشر نے بیان کیا، ان سے قیس نے اور ان سے جریر بن عبداللہ بجلی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدٌ، حَدَّثَنَا بَيَانٌ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ، قَالَ كَانَ بَيْتٌ فِي الْجَاهِلِيَّةِ يُقَالُ لَهُ ذُو الْخَلَصَةِ وَالْكَعْبَةُ الْيَمَانِيَةُ وَالْكَعْبَةُ الشَّأْمِيَّةُ، فَقَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَلاَ تُرِيحُنِي مِنْ ذِي الْخَلَصَةِ ‏\"‏‏.‏ فَنَفَرْتُ فِي مِائَةٍ وَخَمْسِينَ رَاكِبًا، فَكَسَرْنَاهُ وَقَتَلْنَا مَنْ وَجَدْنَا عِنْدَهُ، فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرْتُهُ، فَدَعَا لَنَا وَلأَحْمَسَ‏.‏",
                "headingArabic": "غَزْوَةُ ذِي الْخَلَصَةِ",
                "headingUrdu": "غزوہ ذوالخلصہ",
                "headingEnglish": "Ghazwa Dhul-Khalasa",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4151,
                "hadithNumber": "4356",
                "englishNarrator": "Narrated Jarir رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said to me, \"Won't you relieve me from Dhu-l-Khalasa?\" And that was a house (in Yemem belonging to the tribe of) Khatham called Al-Ka`ba Al Yamaniya. I proceeded with one-hundred and-fifty cavalry from Ahmas (tribe) who were horse riders. I used not to sit firm on horses, so the Prophet (ﷺ) stroke me over my chest till I saw the mark of his fingers over my chest, and then he said, 'O Allah! Make him (i.e. Jarir) firm and one who guides others and is guided on the right path.\" So Jarir proceeded to it dismantled and burnt it, and then sent a messenger to Allah's Messenger (ﷺ). The messenger of Jarir said (to the Prophet), \"By Him Who sent you with the Truth, I did not leave that place till it was like a scabby camel.\" The Prophet (ﷺ) blessed the horses of Ahmas and their men five times. The transmitter narrates: He ﷺ invoked blessed five times for the people and the horses of the tribe.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ تم مجھے ذوالخلصہ سے کیوں نہیں بےفکر کرتے؟ یہ قبیلہ خثعم کا ایک بت خانہ تھا۔ اسے کعبہ یمانیہ بھی کہتے تھے۔ چنانچہ میں ڈیڑھ سو قبیلہ احمس کے سواروں کو لے کر روانہ ہوا۔ یہ سب اچھے شہسوا ر تھے۔ مگر میں گھوڑے کی سواری اچھی طرح نہیں کر سکتا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے میرے سینے پر ہاتھ مارا یہاں تک کہ میں نے آپ کی انگلیوں کا اثر اپنے سینے میں پایا۔ پھر آپ نے دعا کی کہ اے اللہ! اسے گھوڑے کا اچھا سوار بنا دے اور اسے راستہ بتلانے والا اور خود راستہ پایا ہوا بنا دے۔ پھر وہ اس بت خانے کی طرف روانہ ہوئے اور اسے ڈھا کر اس میں آگ لگا دی۔ پھر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اطلاع بھیجی۔ جریر کے ایلچی نے آ کر عرض کیا: اس ذات کی قسم! جس نے آپ کو حق کے ساتھ مبعوث کیا، میں اس وقت تک آپ کی خدمت میں حاضر ہونے کے لیے نہیں چلا جب تک وہ خارش زدہ اونٹ کی طرح جل کر ( سیاہ ) نہیں ہو گیا۔ بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے قبیلہ احمس کے گھوڑوں اور لوگوں کے لیے پانچ مرتبہ برکت کی دعا فرمائی۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے یحییٰ بن سعد قطان نے بیان کیا، کہا ہم سے اسماعیل بن ابی خالد نے بیان کیا، کہا ہم سے قیس بن ابی حازم نے بیان کیا، کہا مجھ سے جریر بن عبداللہ بجلی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا قَيْسٌ، قَالَ قَالَ لِي جَرِيرٌ ـ رضى الله عنه ـ قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَلاَ تُرِيحُنِي مِنْ ذِي الْخَلَصَةِ ‏\"‏‏.‏ وَكَانَ بَيْتًا فِي خَثْعَمَ يُسَمَّى الْكَعْبَةَ الْيَمَانِيَةَ، فَانْطَلَقْتُ فِي خَمْسِينَ وَمِائَةِ فَارِسٍ مِنْ أَحْمَسَ، وَكَانُوا أَصْحَابَ خَيْلٍ، وَكُنْتُ لاَ أَثْبُتُ عَلَى الْخَيْلِ، فَضَرَبَ فِي صَدْرِي حَتَّى رَأَيْتُ أَثَرَ أَصَابِعِهِ فِي صَدْرِي، وَقَالَ ‏\"‏ اللَّهُمَّ ثَبِّتْهُ، وَاجْعَلْهُ هَادِيًا مَهْدِيًّا ‏\"‏‏.‏ فَانْطَلَقَ إِلَيْهَا فَكَسَرَهَا وَحَرَّقَهَا، ثُمَّ بَعَثَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ جَرِيرٍ وَالَّذِي بَعَثَكَ بِالْحَقِّ، مَا جِئْتُكَ حَتَّى تَرَكْتُهَا كَأَنَّهَا جَمَلٌ أَجْرَبُ‏.‏ قَالَ فَبَارَكَ فِي خَيْلِ أَحْمَسَ وَرِجَالِهَا خَمْسَ مَرَّاتٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4152,
                "hadithNumber": "4357",
                "englishNarrator": "Narrated Jareer رضی اللہ عنہ :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) said to me, \"Won't you relieve me from Dhul-Khalasa?\" I replied, \"Yes, (I will relieve you).\" So I proceeded along with one-hundred and fifty cavalry from Ahmas tribe who were skillful in riding horses. I used not to sit firm over horses, so I informed the Prophet (ﷺ) of that, and he stroke my chest with his hand till I saw the marks of his hand over my chest and he said, O Allah! Make him firm and one who guides others and is guided (on the right path).' Since then I have never fallen from a horse. Dhul-l--Khulasa was a house in Yemen belonging to the tribe of Khatham and Bajaila, and in it there were idols which were worshipped, and it was called Al-Ka`ba.\" Jarir رضی اللہ عنہ went there, burnt it with fire and dismantled it. When Jarir رضی اللہ عنہ reached Yemen, there was a man who used to foretell and give good omens by casting arrows of divination. Someone said to him. \"The messenger of Allah's Messenger (ﷺ) is present here and if he should get hold of you, he would chop off your neck.\" One day while he was using them (i.e. arrows of divination), Jarir رضی اللہ عنہ stopped there and said to him, \"Break them (i.e. the arrows) and testify that None has the right to be worshipped except Allah, or else I will chop off your neck.\" So the man broke those arrows and testified that none has the right to be worshipped except Allah. Then Jarir رضی اللہ عنہ sent a man called Abu Artata رضی اللہ عنہ from the tribe of Ahmas to the Prophet to convey the good news (of destroying Dhu-l-Khalasa). So when the messenger reached the Prophet, he said, \"O Allah's Messenger (ﷺ)! By Him Who sent you with the Truth, I did not leave it till it was like a scabby camel.\" Then the Prophet (ﷺ) blessed the horses of Ahmas and their men five times.",
                "hadithUrdu": "مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ذوالخلصہ سے مجھے کیوں نہیں بےفکری دلاتے! میں نے عرض کیا میں حکم کی تعمیل کروں گا۔ چنانچہ قبیلہ احمس کے ڈیڑھ سو سواروں کو ساتھ لے کر میں روانہ ہوا۔ یہ سب اچھے سوار تھے، لیکن میں سواری اچھی طرح نہیں کر پاتا تھا۔ میں نے اس کے متعلق نبی کریم صلی اللہ علیہ وسلم سے ذکر کیا تو آپ نے اپنا ہاتھ میرے سینے پر مارا جس کا اثر میں نے اپنے سینہ میں دیکھا اور نبی کریم صلی اللہ علیہ وسلم نے دعا فرمائی ”اے اللہ! اسے اچھا سوار بنا دے اور اسے ہدایت کرنے والا اور خود ہدایت پایا ہوا بنا دے۔“ راوی نے بیان کیا کہ پھر اس کے بعد میں کبھی کسی گھوڑے سے نہیں گرا۔ راوی نے بیان کیا کہ ذوالخلصہ ایک ( بت خانہ ) تھا، یمن میں قبیلہ خثعم اور بجیلہ کا، اس میں بت تھے جن کی پوجا کی جاتی تھی اور اسے کعبہ بھی کہتے تھے۔ بیان کیا کہ پھر جریر وہاں پہنچے اور اسے آگ لگا دی اور منہدم کر دیا۔ بیان کیا کہ جب جریر رضی اللہ عنہ یمن پہنچے تو وہاں ایک شخص تھا جو تیروں سے فال نکالا کرتا تھا۔ اس سے کسی نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کے ایلچی یہاں آ گئے ہیں۔ اگر انہوں نے تمہیں پا لیا تو تمہاری گردن مار دیں گے۔ بیان کیا کہ ابھی وہ فال نکال ہی رہے تھے کہ جریر رضی اللہ عنہ وہاں پہنچ گئے۔ آپ نے اس سے فرمایا کہ یہ فال کے تیر توڑ کر کلمہ لا الٰہ الا اللہ پڑھ لے ورنہ میں تیری گردن مار دوں گا۔ راوی نے بیان کیا اس شخص نے تیر وغیرہ توڑ ڈالے اور کلمہ ایمان کی گواہی دی۔ اس کے بعد جریر رضی اللہ عنہ نے قبیلہ احمس کے ایک صحابی ابوارطاط رضی اللہ عنہ نامی کو نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بھیجا جب وہ خدمت میں حاضر ہوئے تو انہوں نے عرض کیا: یا رسول اللہ! اس ذات کی قسم جس نے آپ کو حق کے ساتھ مبعوث کیا ہے۔ میں آپ کی خدمت میں حاضر ہونے کے لیے اس وقت تک نہیں چلا جب تک اس بت کدہ کو خارش زدہ اونٹ کی طرح جلا کر سیاہ نہیں کر دیا۔ بیان کیا کہ پھر آپ صلی اللہ علیہ وسلم نے قبیلہ احمس کے گھوڑوں اور سواروں کے لیے پانچ مرتبہ برکت کی دعا فرمائی۔",
                "urduNarrator": "ہم سے یوسف بن موسیٰ نے بیان کیا، کہا ہم کو خبر دی ابواسامہ نے، انہیں اسماعیل بن ابی خالد نے، انہیں قیس بن ابی حازم نے اور ان سے جریر بن عبداللہ بجلی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، أَخْبَرَنَا أَبُو أُسَامَةَ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ تُرِيحُنِي مِنْ ذِي الْخَلَصَةِ ‏\"‏‏.‏ فَقُلْتُ بَلَى‏.‏ فَانْطَلَقْتُ فِي خَمْسِينَ وَمِائَةِ فَارِسٍ مِنْ أَحْمَسَ وَكَانُوا أَصْحَابَ خَيْلٍ وَكُنْتُ لاَ أَثْبُتُ عَلَى الْخَيْلِ، فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَضَرَبَ يَدَهُ عَلَى صَدْرِي حَتَّى رَأَيْتُ أَثَرَ يَدِهِ فِي صَدْرِي وَقَالَ ‏\"‏ اللَّهُمَّ ثَبِّتْهُ وَاجْعَلْهُ هَادِيًا مَهْدِيًّا ‏\"‏‏.‏ قَالَ فَمَا وَقَعْتُ عَنْ فَرَسٍ بَعْدُ‏.‏ قَالَ وَكَانَ ذُو الْخَلَصَةِ بَيْتًا بِالْيَمَنِ لِخَثْعَمَ وَبَجِيلَةَ، فِيهِ نُصُبٌ تُعْبَدُ، يُقَالُ لَهُ الْكَعْبَةُ‏.‏ قَالَ فَأَتَاهَا فَحَرَّقَهَا بِالنَّارِ وَكَسَرَهَا‏.‏ قَالَ وَلَمَّا قَدِمَ جَرِيرٌ الْيَمَنَ كَانَ بِهَا رَجُلٌ يَسْتَقْسِمُ بِالأَزْلاَمِ فَقِيلَ لَهُ إِنَّ رَسُولَ رَسُولِ اللَّهِ صلى الله عليه وسلم هَا هُنَا فَإِنْ قَدَرَ عَلَيْكَ ضَرَبَ عُنُقَكَ‏.‏ قَالَ فَبَيْنَمَا هُوَ يَضْرِبُ بِهَا إِذْ وَقَفَ عَلَيْهِ جَرِيرٌ فَقَالَ لَتَكْسِرَنَّهَا وَلَتَشْهَدَنَّ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَوْ لأَضْرِبَنَّ عُنُقَكَ‏.‏ قَالَ فَكَسَرَهَا وَشَهِدَ، ثُمَّ بَعَثَ جَرِيرٌ رَجُلاً مِنْ أَحْمَسَ يُكْنَى أَبَا أَرْطَاةَ إِلَى النَّبِيِّ صلى الله عليه وسلم يُبَشِّرُهُ بِذَلِكَ، فَلَمَّا أَتَى النَّبِيَّ صلى الله عليه وسلم قَالَ يَا رَسُولَ اللَّهِ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا جِئْتُ حَتَّى تَرَكْتُهَا كَأَنَّهَا جَمَلٌ أَجْرَبُ‏.‏ قَالَ فَبَرَّكَ النَّبِيُّ صلى الله عليه وسلم عَلَى خَيْلِ أَحْمَسَ وَرِجَالِهَا خَمْسَ مَرَّاتٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4126,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=165",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=163",
                "label": "163",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=164",
                "label": "164",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=165",
                "label": "165",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=166",
                "label": "166",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=167",
                "label": "167",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=168",
                "label": "168",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=169",
                "label": "169",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=167",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=167",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=165",
        "to": 4150,
        "total": 40465
    }
}