{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 3,
        "data": [
            {
                "id": 51,
                "hadithNumber": "51",
                "englishNarrator": "Narrated 'Abdullah bin 'Abbas:",
                "hadithEnglish": "I was informed by Abu Sufyan that Heraclius said to him, \"I asked you whether they (followers of Muhammad) were increasing or decreasing. You replied that they were increasing. And in fact, this is the way of true Faith till it is complete in all respects. I further asked you whether there was anybody, who, after embracing his (the Prophets) religion (Islam) became displeased and discarded it. You replied in the negative, and in fact, this is (a sign of) true faith. When its delight enters the heart and mixes with them completely, nobody can be displeased with it.\"",
                "hadithUrdu": "ہرقل ( روم کے بادشاہ ) نے ان سے کہا ۔ میں نے تم سے پوچھا تھا کہ اس رسول کے ماننے والے بڑھ رہے ہیں یا گھٹ رہے ہیں ۔ تو نے جواب میں بتلایا کہ وہ بڑھ رہے ہیں ۔ ( ٹھیک ہے ) ایمان کا یہی حال رہتا ہے یہاں تک کہ وہ پورا ہو جائے اور میں نے تجھ سے پوچھا تھا کہ کوئی اس کے دین میں آ کر پھر اس کو برا جان کر پھر جاتا ہے ؟ تو نے کہا ۔ نہیں ، اور ایمان کا یہی حال ہے ۔ جب اس کی خوشی دل میں سما جاتی ہے تو پھر اس کو کوئی برا نہیں سمجھ سکتا ۔",
                "urduNarrator": "ہم سے ابراہیم بن حمزہ نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، انھوں نے صالح بن کیسان سے ، انھوں نے ابن شہاب سے ، انھوں نے عبیداللہ بن عبداللہ سے ، ان کو عبداللہ بن عباس رضی اللہ عنہما نے خبر دی ، ان کو ابوسفیان بن حرب نے کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ قَالَ أَخْبَرَنِي أَبُو سُفْيَانَ، أَنَّ هِرَقْلَ، قَالَ لَهُ سَأَلْتُكَ هَلْ يَزِيدُونَ أَمْ يَنْقُصُونَ، فَزَعَمْتَ أَنَّهُمْ يَزِيدُونَ، وَكَذَلِكَ الإِيمَانُ حَتَّى يَتِمَّ‏.‏ وَسَأَلْتُكَ هَلْ يَرْتَدُّ أَحَدٌ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ، فَزَعَمْتَ أَنْ لاَ، وَكَذَلِكَ الإِيمَانُ حِينَ تُخَالِطُ بَشَاشَتُهُ الْقُلُوبَ، لاَ يَسْخَطُهُ أَحَدٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 2,
                    "chapterNumber": "2",
                    "chapterEnglish": "Belief",
                    "chapterUrdu": "ایمان کے بیان میں",
                    "chapterArabic": "كتاب الإيمان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 52,
                "hadithNumber": "52",
                "englishNarrator": "Narrated An-Nu'man bin Bashir:",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, 'Both legal and illegal things are evident but in between them there are doubtful (suspicious) things and most of the people have no knowledge about them. So whoever saves himself from these suspicious things saves his religion and his honor. And whoever indulges in these suspicious things is like a shepherd who grazes (his animals) near the Hima (private pasture) of someone else and at any moment he is liable to get in it. (O people!) Beware! Every king has a Hima and the Hima of Allah on the earth is His illegal (forbidden) things. Beware! There is a piece of flesh in the body if it becomes good (reformed) the whole body becomes good but if it gets spoilt the whole body gets spoilt and that is the heart.",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم سے سنا آپ صلی اللہ علیہ وسلم فرماتے تھے حلال کھلا ہوا ہے اور حرام بھی کھلا ہوا ہے اور ان دونوں کے درمیان بعض چیزیں شبہ کی ہیں جن کو بہت لوگ نہیں جانتے ( کہ حلال ہیں یا حرام ) پھر جو کوئی شبہ کی چیزوں سے بھی بچ گیا اس نے اپنے دین اور عزت کو بچا لیا اور جو کوئی ان شبہ کی چیزوں میں پڑ گیا اس کی مثال اس چرواہے کی ہے جو ( شاہی محفوظ ) چراگاہ کے آس پاس اپنے جانوروں کو چرائے ۔ وہ قریب ہے کہ کبھی اس چراگاہ کے اندر گھس جائے ( اور شاہی مجرم قرار پائے ) سن لو ہر بادشاہ کی ایک چراگاہ ہوتی ہے ۔ اللہ کی چراگاہ اس کی زمین پر حرام چیزیں ہیں ۔ ( پس ان سے بچو اور ) سن لو بدن میں ایک گوشت کا ٹکڑا ہے جب وہ درست ہو گا سارا بدن درست ہو گا اور جہاں بگڑا سارا بدن بگڑ گیا ۔ سن لو وہ ٹکڑا آدمی کا دل ہے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے زکریا نے ، انھوں نے عامر سے ، کہا میں نے نعمان بن بشیر رضی اللہ عنہما سے سنا ، وہ کہتے تھے میں نے",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْحَلاَلُ بَيِّنٌ وَالْحَرَامُ بَيِّنٌ، وَبَيْنَهُمَا مُشَبَّهَاتٌ لاَ يَعْلَمُهَا كَثِيرٌ مِنَ النَّاسِ، فَمَنِ اتَّقَى الْمُشَبَّهَاتِ اسْتَبْرَأَ لِدِيِنِهِ وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ كَرَاعٍ يَرْعَى حَوْلَ الْحِمَى، يُوشِكُ أَنْ يُوَاقِعَهُ‏.‏ أَلاَ وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلاَ إِنَّ حِمَى اللَّهِ فِي أَرْضِهِ مَحَارِمُهُ، أَلاَ وَإِنَّ فِي الْجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ، وَإِذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ‏.‏ أَلاَ وَهِيَ الْقَلْبُ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ مَنِ اسْتَبْرَأَ لِدِينِهِ",
                "headingUrdu": "اس شخص کی برتری جو اپنے دین کی خاطر تمام مشتبہ (غیر واضح) چیزوں کو چھوڑ دیتا ہے۔",
                "headingEnglish": "The superiority of that person who leaves all doubtful (unclear) things for the sake of his religion",
                "chapterId": "2",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 2,
                    "chapterNumber": "2",
                    "chapterEnglish": "Belief",
                    "chapterUrdu": "ایمان کے بیان میں",
                    "chapterArabic": "كتاب الإيمان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 53,
                "hadithNumber": "53",
                "englishNarrator": "Narrated Abu Jamra:",
                "hadithEnglish": "I used to sit with Ibn 'Abbas and he made me sit on his sitting place. He requested me to stay with him in order that he might give me a share from his property. So I stayed with him for two months. Once he told (me) that when the delegation of the tribe of 'Abdul Qais came to the Prophet, the Prophet (ﷺ) asked them, \"Who are the people (i.e. you)? (Or) who are the delegate?\" They replied, \"We are from the tribe of Rabi'a.\" Then the Prophet (ﷺ) said to them, \"Welcome! O people (or O delegation of 'Abdul Qais)! Neither will you have disgrace nor will you regret.\" They said, \"O Allah's Messenger (ﷺ)! We cannot come to you except in the sacred month and there is the infidel tribe of Mudar intervening between you and us. So please order us to do something good (religious deeds) so that we may inform our people whom we have left behind (at home), and that we may enter Paradise (by acting on them).\" Then they asked about drinks (what is legal and what is illegal). The Prophet (ﷺ) ordered them to do four things and forbade them from four things. He ordered them to believe in Allah Alone and asked them, \"Do you know what is meant by believing in Allah Alone?\" They replied, \"Allah and His Apostle know better.\" Thereupon the Prophet (ﷺ) said, \"It means: \r\n1. To testify that none has the right to be worshipped but Allah and Muhammad is Allah's Messenger (ﷺ). \r\n2. To offer prayers perfectly \r\n3. To pay the Zakat (obligatory charity) \r\n4. To observe fast during the month of Ramadan. \r\n5. And to pay Al-Khumus (one fifth of the booty to be given in Allah's Cause). \r\nThen he forbade them four things, namely, Hantam, Dubba,' Naqir Ann Muzaffat or Muqaiyar; (These were the names of pots in which Alcoholic drinks were prepared) (The Prophet (ﷺ) mentioned the container of wine and he meant the wine itself). The Prophet (ﷺ) further said (to them): \"Memorize them (these instructions) and convey them to the people whom you have left behind.\"",
                "hadithUrdu": "میں عبداللہ بن عباس رضی اللہ عنہما کے پاس بیٹھا کرتا تھا وہ مجھ کو خاص اپنے تخت پر بٹھاتے ( ایک دفعہ ) کہنے لگے کہ تم میرے پاس مستقل طور پر رہ جاؤ میں اپنے مال میں سے تمہارا حصہ مقرر کر دوں گا ۔ تو میں دو ماہ تک ان کی خدمت میں رہ گیا ۔ پھر کہنے لگے کہ عبدالقیس کا وفد جب آنحضرت صلی اللہ علیہ وسلم کے پاس آیا تو آپ نے پوچھا کہ یہ کون سی قوم کے لوگ ہیں یا یہ وفد کہاں کا ہے ؟ انھوں نے کہا کہ ربیعہ خاندان کے لوگ ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا مرحبا اس قوم کو یا اس وفد کو نہ ذلیل ہونے والے نہ شرمندہ ہونے والے ( یعنی ان کا آنا بہت خوب ہے ) وہ کہنے لگے اے اللہ کے رسول ! ہم آپ کی خدمت میں صرف ان حرمت والے مہینوں میں آ سکتے ہیں کیونکہ ہمارے اور آپ کے درمیان مضر کے کافروں کا قبیلہ آباد ہے ۔ پس آپ ہم کو ایک ایسی قطعی بات بتلا دیجئیے جس کی خبر ہم اپنے پچھلے لوگوں کو بھی کر دیں جو یہاں نہیں آئے اور اس پر عمل درآمد کر کے ہم جنت میں داخل ہو جائیں اور انھوں نے آپ سے اپنے برتنوں کے بارے میں بھی پوچھا ۔ آپ صلی اللہ علیہ وسلم نے ان کو چار باتوں کا حکم دیا اور چار قسم کے برتنوں کو استعمال میں لانے سے منع فرمایا ۔ ان کو حکم دیا کہ ایک اکیلے خدا پر ایمان لاؤ ۔ پھر آپ صلی اللہ علیہ وسلم نے پوچھا کہ جانتے ہو ایک اکیلے خدا پر ایمان لانے کا مطلب کیا ہے ؟ انھوں نے کہا کہ اللہ اور اس کے رسول ہی کو معلوم ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس بات کی گواہی دینا کہ اللہ کے سوا کوئی مبعود نہیں اور یہ کہ حضرت محمد صلی اللہ علیہ وسلم اس کے سچے رسول ہیں اور نماز قائم کرنا اور زکوٰۃ ادا کرنا اور رمضان کے روزے رکھنا اور مال غنیمت سے جو ملے اس کا پانچواں حصہ ( مسلمانوں کے بیت المال میں ) داخل کرنا اور چار برتنوں کے استعمال سے آپ صلی اللہ علیہ وسلم نے ان کو منع فرمایا ۔ سبز لاکھی مرتبان سے اور کدو کے بنائے ہوئے برتن سے ، لکڑی کے کھودے ہوئے برتن سے ، اور روغنی برتن سے اور فرمایا کہ ان باتوں کو حفظ کر لو اور ان لوگوں کو بھی بتلا دینا جو تم سے پیچھے ہیں اور یہاں نہیں آئے ہیں ۔",
                "urduNarrator": "ہم سے علی بن جعد نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انھوں نے ابوجمرہ سے نقل کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، قَالَ أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، قَالَ كُنْتُ أَقْعُدُ مَعَ ابْنِ عَبَّاسٍ، يُجْلِسُنِي عَلَى سَرِيرِهِ فَقَالَ أَقِمْ عِنْدِي حَتَّى أَجْعَلَ لَكَ سَهْمًا مِنْ مَالِي، فَأَقَمْتُ مَعَهُ شَهْرَيْنِ، ثُمَّ قَالَ إِنَّ وَفْدَ عَبْدِ الْقَيْسِ لَمَّا أَتَوُا النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ الْقَوْمُ أَوْ مَنِ الْوَفْدُ ‏\"‏‏.‏ قَالُوا رَبِيعَةُ‏.‏ قَالَ ‏\"‏ مَرْحَبًا بِالْقَوْمِ ـ أَوْ بِالْوَفْدِ ـ غَيْرَ خَزَايَا وَلاَ نَدَامَى ‏\"‏‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ، إِنَّا لاَ نَسْتَطِيعُ أَنْ نَأْتِيَكَ إِلاَّ فِي شَهْرِ الْحَرَامِ، وَبَيْنَنَا وَبَيْنَكَ هَذَا الْحَىُّ مِنْ كُفَّارِ مُضَرَ، فَمُرْنَا بِأَمْرٍ فَصْلٍ، نُخْبِرْ بِهِ مَنْ وَرَاءَنَا، وَنَدْخُلْ بِهِ الْجَنَّةَ‏.‏ وَسَأَلُوهُ عَنِ الأَشْرِبَةِ‏.‏ فَأَمَرَهُمْ بِأَرْبَعٍ، وَنَهَاهُمْ عَنْ أَرْبَعٍ، أَمَرَهُمْ بِالإِيمَانِ بِاللَّهِ وَحْدَهُ‏.‏ قَالَ ‏\"‏ أَتَدْرُونَ مَا الإِيمَانُ بِاللَّهِ وَحْدَهُ ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامُ الصَّلاَةِ، وَإِيتَاءُ الزَّكَاةِ، وَصِيَامُ رَمَضَانَ، وَأَنْ تُعْطُوا مِنَ الْمَغْنَمِ الْخُمُسَ ‏\"‏‏.‏ وَنَهَاهُمْ عَنْ أَرْبَعٍ عَنِ الْحَنْتَمِ وَالدُّبَّاءِ وَالنَّقِيرِ وَالْمُزَفَّتِ‏.‏ وَرُبَّمَا قَالَ الْمُقَيَّرِ‏.‏ وَقَالَ ‏\"‏ احْفَظُوهُنَّ وَأَخْبِرُوا بِهِنَّ مَنْ وَرَاءَكُمْ ‏\"‏‏.‏",
                "headingArabic": "أَدَاءُ الْخُمُسِ مِنَ الإِيمَانِ",
                "headingUrdu": "الخمس (اللہ کی راہ میں مال غنیمت کا پانچواں حصہ) ادا کرنا ایمان کا حصہ ہے۔",
                "headingEnglish": "To pay Al-Khumus (one-fifth of the war booty to be given in Allah's Cause) is a part of faith",
                "chapterId": "2",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 2,
                    "chapterNumber": "2",
                    "chapterEnglish": "Belief",
                    "chapterUrdu": "ایمان کے بیان میں",
                    "chapterArabic": "كتاب الإيمان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 54,
                "hadithNumber": "54",
                "englishNarrator": "Narrated 'Umar bin Al-Khattab:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The reward of deeds depends upon the intention and every person will get the reward according to what he has intended. So whoever emigrated for Allah and His Apostle, then his emigration was for Allah and His Apostle. And whoever emigrated for worldly benefits or for a woman to marry, his emigration was for what he emigrated for.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا عمل نیت ہی سے صحیح ہوتے ہیں ( یا نیت ہی کے مطابق ان کا بدلا ملتا ہے ) اور ہر آدمی کو وہی ملے گا جو نیت کرے گا ۔ پس جو کوئی اللہ اور اس کے رسول کی رضا کے لیے ہجرت کرے اس کی ہجرت اللہ اور اس کے رسول کی طرف ہو گی اور جو کوئی دنیا کمانے کے لیے یا کسی عورت سے شادی کرنے کے لیے ہجرت کرے گا تو اس کی ہجرت ان ہی کاموں کے لیے ہو گی ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم کو امام مالک رحمہ اللہ نے خبر دی ، انھوں نے یحییٰ بن سعید سے ، انھوں نے محمد بن ابراہیم سے ، انھوں نے علقمہ بن وقاص سے ، انھوں نے حضرت عمر رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ، عَنْ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الأَعْمَالُ بِالنِّيَّةِ، وَلِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا، أَوِ امْرَأَةٍ يَتَزَوَّجُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ ‏\"‏‏.‏",
                "headingArabic": "مَا جَاءَ أَنَّ الأَعْمَالَ بِالنِّيَّةِ وَالْحِسْبَةِ وَلِكُلِّ امْرِئٍ مَا نَوَى",
                "headingUrdu": "اس بیان کے بارے میں کیا کہا گیا ہے: \"اعمال کا دارومدار نیت اور اللہ سے اجر کی امید پر ہے۔\"",
                "headingEnglish": "What is said regarding the statement: \"The reward of deeds depends upon the intention and hoping to get rewards from Allah.\"",
                "chapterId": "2",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 2,
                    "chapterNumber": "2",
                    "chapterEnglish": "Belief",
                    "chapterUrdu": "ایمان کے بیان میں",
                    "chapterArabic": "كتاب الإيمان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 55,
                "hadithNumber": "55",
                "englishNarrator": "Narrated Abu Mas'ud:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If a man spends on his family (with the intention of having a reward from Allah) sincerely for Allah's sake then it is a (kind of) alms-giving in reward for him.",
                "hadithUrdu": "انھوں نے آنحضرت صلی اللہ علیہ وسلم سے کہ آپ صلی اللہ علیہ وسلم نے فرمایا جب آدمی ثواب کی نیت سے اپنے اہل و عیال پر خرچ کرے پس وہ بھی اس کے لیے صدقہ ہے ۔",
                "urduNarrator": "ہم سے حجاج بن منہال نے بیان کیا ، وہ کہتے ہیں کہ ہم سے شعبہ نے بیان کیا ، وہ کہتے ہیں مجھ کو عدی بن ثابت نے خبر دی ، انھوں نے عبداللہ بن یزید سے سنا ، انھوں نے عبداللہ بن مسعود سے نقل کیا ،",
                "hadithArabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَدِيُّ بْنُ ثَابِتٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ، عَنْ أَبِي مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَنْفَقَ الرَّجُلُ عَلَى أَهْلِهِ يَحْتَسِبُهَا فَهُوَ لَهُ صَدَقَةٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 2,
                    "chapterNumber": "2",
                    "chapterEnglish": "Belief",
                    "chapterUrdu": "ایمان کے بیان میں",
                    "chapterArabic": "كتاب الإيمان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 56,
                "hadithNumber": "56",
                "englishNarrator": "Narrated Sa'd bin Abi Waqqas:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"You will be rewarded for whatever you spend for Allah's sake even if it were a morsel which you put in your wife's mouth.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا بیشک تو جو کچھ خرچ کرے اور اس سے تیری نیت اللہ کی رضا حاصل کرنی ہو تو تجھ کو اس کا ثواب ملے گا ۔ یہاں تک کہ اس پر بھی جو تو اپنی بیوی کے منہ میں ڈالے ۔",
                "urduNarrator": "ہم سے حکم بن نافع نے بیان کیا ، کہا ہم کو شعیب نے زہری سے خبر دی ، انھوں نے کہا کہ مجھ سے عامر بن سعد نے سعد بن ابی وقاص سے بیان کیا ، انھوں نے ان کو خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي عَامِرُ بْنُ سَعْدٍ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ \"إِنَّكَ لَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلَّا أُجِرْتَ عَلَيْهَا حَتَّى مَا تَجْعَلُ فِي فَمِ امْرَأَتِكَ\"",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 2,
                    "chapterNumber": "2",
                    "chapterEnglish": "Belief",
                    "chapterUrdu": "ایمان کے بیان میں",
                    "chapterArabic": "كتاب الإيمان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 57,
                "hadithNumber": "57",
                "englishNarrator": "Narrated Jarir bin Abdullah:",
                "hadithEnglish": "I gave the pledge of allegiance to Allah's Messenger (ﷺ) for the following: \r\n1. offer prayers perfectly \r\n2. pay the Zakat (obligatory charity) \r\n3. and be sincere and true to every Muslim.",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم سے میں نے نماز قائم کرنے اور زکوٰۃ ادا کرنے اور ہر مسلمان کی خیرخواہی کرنے پر بیعت کی ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، انھوں نے کہا ہم سے یحییٰ بن سعید بن قطان نے بیان کیا ، انھوں نے اسماعیل سے ، انھوں نے کہا مجھ سے قیس بن ابی حازم نے بیان کیا ، انھوں نے جریر بن عبداللہ بجلی رضی اللہ عنہ سے سنا ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي قَيْسُ بْنُ أَبِي حَازِمٍ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، قَالَ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى إِقَامِ الصَّلاَةِ، وَإِيتَاءِ الزَّكَاةِ، وَالنُّصْحِ لِكُلِّ مُسْلِمٍ‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الدِّينُ النَّصِيحَةُ لِلَّهِ وَلِرَسُولِهِ وَلأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ»",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کا فرمان ہے: دین اللہ، اس کے رسول صلی اللہ علیہ وسلم، مسلمانوں کے حکمرانوں اور تمام مسلمانوں کے لیے ناصح ہے۔",
                "headingEnglish": "The statement of the Prophet (saws): Religion is An-Nasihah (to be sincere and true) to Allah, to His Messenger (Muhammad (saws)), to the Muslim rulers, and to all the Muslims",
                "chapterId": "2",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 2,
                    "chapterNumber": "2",
                    "chapterEnglish": "Belief",
                    "chapterUrdu": "ایمان کے بیان میں",
                    "chapterArabic": "كتاب الإيمان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 58,
                "hadithNumber": "58",
                "englishNarrator": "Narrated Ziyad bin'Ilaqa:",
                "hadithEnglish": "I heard Jarir bin 'Abdullah (Praising Allah). On the day when Al-Mughira bin Shu'ba died, he (Jarir) got up (on the pulpit) and thanked and praised Allah and said, \"Be afraid of Allah alone Who has none along with Him to be worshipped.(You should) be calm and quiet till the (new) chief comes to you and he will come to you soon. Ask Allah's forgiveness for your (late) chief because he himself loved to forgive others.\" Jarir added, \"Amma badu (now then), I went to the Prophet and said, 'I give my pledge of allegiance to you for Islam.\" The Prophet (ﷺ) conditioned (my pledge) for me to be sincere and true to every Muslim so I gave my pledge to him for this. By the Lord of this mosque! I am sincere and true to you (Muslims). Then Jarir asked for Allah's forgiveness and came down (from the pulpit).",
                "hadithUrdu": "جس دن مغیرہ بن شعبہ ( حاکم کوفہ ) کا انتقال ہوا تو وہ خطبہ کے لیے کھڑے ہوئے اور اللہ کی تعریف اور خوبی بیان کی اور کہا تم کو اکیلے اللہ کا ڈر رکھنا چاہیے اس کا کوئی شریک نہیں اور تحمل اور اطمینان سے رہنا چاہیے اس وقت تک کہ کوئی دوسرا حاکم تمہارے اوپر آئے اور وہ ابھی آنے والا ہے ۔ پھر فرمایا کہ اپنے مرنے والے حاکم کے لیے دعائے مغفرت کرو کیونکہ وہ ( مغیرہ ) بھی معافی کو پسند کرتا تھا پھر کہا کہ اس کے بعد تم کو معلوم ہونا چاہیے کہ میں ایک دفعہ آنحضرت صلی اللہ علیہ وسلم کے پاس آیا اور میں نے عرض کیا کہ میں آپ سے اسلام پر بیعت کرتا ہوں آپ صلی اللہ علیہ وسلم نے مجھ سے ہر مسلمان کی خیرخواہی کے لیے شرط کی ، پس میں نے اس شرط پر آپ سے بیعت کر لی ( پس ) اس مسجد کے رب کی قسم کہ میں تمہارا خیرخواہ ہوں پھر استغفار کیا اور منبر سے اتر آئے ۔",
                "urduNarrator": "ہم سے ابونعمان نے بیان کیا ، کہا ہم سے ابوعوانہ نے بیان کیا ، انھوں نے زیاد سے ، انھوں نے علاقہ سے ، کہا میں نے جریر بن عبداللہ سے سنا",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، قَالَ سَمِعْتُ جَرِيرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ يَوْمَ مَاتَ الْمُغِيرَةُ بْنُ شُعْبَةَ قَامَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَقَالَ عَلَيْكُمْ بِاتِّقَاءِ اللَّهِ وَحْدَهُ لاَ شَرِيكَ لَهُ، وَالْوَقَارِ وَالسَّكِينَةِ حَتَّى يَأْتِيَكُمْ أَمِيرٌ، فَإِنَّمَا يَأْتِيكُمُ الآنَ، ثُمَّ قَالَ اسْتَعْفُوا لأَمِيرِكُمْ، فَإِنَّهُ كَانَ يُحِبُّ الْعَفْوَ‏.‏ ثُمَّ قَالَ أَمَّا بَعْدُ، فَإِنِّي أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم قُلْتُ أُبَايِعُكَ عَلَى الإِسْلاَمِ‏.‏ فَشَرَطَ عَلَىَّ وَالنُّصْحِ لِكُلِّ مُسْلِمٍ‏.‏ فَبَايَعْتُهُ عَلَى هَذَا، وَرَبِّ هَذَا الْمَسْجِدِ إِنِّي لَنَاصِحٌ لَكُمْ‏.‏ ثُمَّ اسْتَغْفَرَ وَنَزَلَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "2",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 2,
                    "chapterNumber": "2",
                    "chapterEnglish": "Belief",
                    "chapterUrdu": "ایمان کے بیان میں",
                    "chapterArabic": "كتاب الإيمان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 59,
                "hadithNumber": "59",
                "englishNarrator": "Narrated Abu Huraira:",
                "hadithEnglish": "While the Prophet (ﷺ) was saying something in a gathering, a Bedouin came and asked him, \"When would the Hour (Doomsday) take place?\" Allah's Messenger (ﷺ) continued his talk, so some people said that Allah's Messenger (ﷺ) had heard the question, but did not like what that Bedouin had asked. Some of them said that Allah's Messenger (ﷺ) had not heard it. When the Prophet (ﷺ) finished his speech, he said, \"Where is the questioner, who inquired about the Hour (Doomsday)?\" The Bedouin said, \"I am here, O Allah's Apostle .\" Then the Prophet (ﷺ) said, \"When honesty is lost, then wait for the Hour (Doomsday).\" The Bedouin said, \"How will that be lost?\" The Prophet (ﷺ) said, \"When the power or authority comes in the hands of unfit persons, then wait for the Hour (Doomsday.)\"",
                "hadithUrdu": "ایک بار آنحضرت صلی اللہ علیہ وسلم لوگوں میں بیٹھے ہوئے ان سے باتیں کر رہے تھے ۔ اتنے میں ایک دیہاتی آپ کے پاس آیا اور پوچھنے لگا کہ قیامت کب آئے گی ؟ آپ صلی اللہ علیہ وسلم اپنی گفتگو میں مصروف رہے ۔ بعض لوگ ( جو مجلس میں تھے ) کہنے لگے آپ صلی اللہ علیہ وسلم نے دیہاتی کی بات سنی لیکن پسند نہیں کی اور بعض کہنے لگے کہ نہیں بلکہ آپ نے اس کی بات سنی ہی نہیں ۔ جب آپ صلی اللہ علیہ وسلم اپنی باتیں پوری کر چکے تو میں سمجھتا ہوں کہ آپ صلی اللہ علیہ وسلم نے یوں فرمایا وہ قیامت کے بارے میں پوچھنے والا کہاں گیا اس ( دیہاتی ) نے کہا ( حضور ) میں موجود ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب امانت ( ایمانداری دنیا سے ) اٹھ جائے تو قیامت قائم ہونے کا انتظار کر ۔ اس نے کہا ایمانداری اٹھنے کا کیا مطلب ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب ( حکومت کے کاروبار ) نالائق لوگوں کو سونپ دئیے جائیں تو قیامت کا انتظار کر ۔",
                "urduNarrator": "ہم سے محمد بن سنان نے بیان کیا ، کہا ہم سے فلیح نے بیان کیا ( دوسری سند ) اور مجھ سے ابراہیم بن المنذر نے بیان کیا ، کہا مجھ سے میرے باپ ( فلیح ) نے بیان کیا ، کہا ہلال بن علی نے ، انھوں نے عطاء بن یسار سے نقل کیا ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، قَالَ حَدَّثَنَا فُلَيْحٌ، ح وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي هِلاَلُ بْنُ عَلِيٍّ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ بَيْنَمَا النَّبِيُّ صلى الله عليه وسلم فِي مَجْلِسٍ يُحَدِّثُ الْقَوْمَ جَاءَهُ أَعْرَابِيٌّ فَقَالَ مَتَى السَّاعَةُ فَمَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم يُحَدِّثُ، فَقَالَ بَعْضُ الْقَوْمِ سَمِعَ مَا قَالَ، فَكَرِهَ مَا قَالَ، وَقَالَ بَعْضُهُمْ بَلْ لَمْ يَسْمَعْ، حَتَّى إِذَا قَضَى حَدِيثَهُ قَالَ ‏\"‏ أَيْنَ ـ أُرَاهُ ـ السَّائِلُ عَنِ السَّاعَةِ ‏\"‏‏.‏ قَالَ هَا أَنَا يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَإِذَا ضُيِّعَتِ الأَمَانَةُ فَانْتَظِرِ السَّاعَةَ ‏\"‏‏.‏ قَالَ كَيْفَ إِضَاعَتُهَا قَالَ ‏\"‏ إِذَا وُسِّدَ الأَمْرُ إِلَى غَيْرِ أَهْلِهِ فَانْتَظِرِ السَّاعَةَ ‏\"‏‏.‏",
                "headingArabic": "مَنْ سُئِلَ عِلْمًا وَهُوَ مُشْتَغِلٌ فِي حَدِيثِهِ فَأَتَمَّ الْحَدِيثَ ثُمَّ أَجَابَ السَّائِلَ",
                "headingUrdu": "جس سے علم کے متعلق سوال کیا گیا جب وہ کسی گفتگو میں مصروف ہو تو اس نے بات ختم کی اور پھر سائل کو جواب دیا۔",
                "headingEnglish": "Whoever is asked about knowledge while he is busy in some conversation, so he finished talking and then answered the questioner",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 60,
                "hadithNumber": "60",
                "englishNarrator": "Narrated `Abdullah bin `Amr:",
                "hadithEnglish": "Once the Prophet (ﷺ) remained behind us in a journey. He joined us while we were performing ablution for the prayer which was over-due. We were just passing wet hands over our feet (and not washing them properly) so the Prophet (ﷺ) addressed us in a loud voice and said twice or thrice: \"Save your heels from the fire.\"",
                "hadithUrdu": "ایک سفر میں جو ہم نے کیا تھا آنحضرت صلی اللہ علیہ وسلم ہم سے پیچھے رہ گئے اور آپ صلی اللہ علیہ وسلم ہم سے اس وقت ملے جب ( عصر کی ) نماز کا وقت آن پہنچا تھا ہم ( جلدی جلدی ) وضو کر رہے تھے ۔ پس پاؤں کو خوب دھونے کے بدل ہم یوں ہی سا دھو رہے تھے ۔ ( یہ حال دیکھ کر ) آپ صلی اللہ علیہ وسلم نے بلند آواز سے پکارا دیکھو ایڑیوں کی خرابی دوزخ سے ہونے والی ہے دو یا تین بار آپ صلی اللہ علیہ وسلم نے ( یوں ہی بلند آواز سے ) فرمایا ۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے ابوعوانہ نے ابوبشر سے بیان کیا ، انھوں نے یوسف بن ماہک سے ، انھوں نے عبداللہ بن عمرو سے ، انھوں نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، عَارِمُ بْنُ الْفَضْلِ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ تَخَلَّفَ عَنَّا النَّبِيُّ صلى الله عليه وسلم فِي سَفْرَةٍ سَافَرْنَاهَا، فَأَدْرَكَنَا وَقَدْ أَرْهَقَتْنَا الصَّلاَةُ وَنَحْنُ نَتَوَضَّأُ، فَجَعَلْنَا نَمْسَحُ عَلَى أَرْجُلِنَا، فَنَادَى بِأَعْلَى صَوْتِهِ ‏ \"‏ وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ ‏\"‏‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا‏.‏",
                "headingArabic": "مَنْ رَفَعَ صَوْتَهُ بِالْعِلْمِ",
                "headingUrdu": "جو علم (پہنچانے) میں آواز بلند کرے۔",
                "headingEnglish": "Whoever raises his voice in (conveying) knowledge",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 61,
                "hadithNumber": "61",
                "englishNarrator": "Narrated Ibn `Umar:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Amongst the trees, there is a tree, the leaves of which do not fall and is like a Muslim. Tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas. And I thought of the date-palm tree but felt shy to answer the others then asked, \"What is that tree, O Allah's Messenger (ﷺ) ?\" He replied, \"It is the date-palm tree.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا درختوں میں ایک درخت ایسا ہے کہ اس کے پتے نہیں جھڑتے اور مسلمان کی مثال اسی درخت کی سی ہے ۔ بتاؤ وہ کون سا درخت ہے ؟ یہ سن کر لوگوں کا خیال جنگل کے درختوں کی طرف دوڑا ۔ عبداللہ رضی اللہ عنہ نے کہا میرے دل میں آیا کہ وہ کھجور کا درخت ہے ۔ مگر میں اپنی ( کم سنی کی ) شرم سے نہ بولا ۔ آخر صحابہ نے آنحضرت صلی اللہ علیہ وسلم ہی سے پوچھا کہ وہ کون سا درخت ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا وہ کھجور کا درخت ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، انھوں نے عبداللہ بن دینار سے ، انھوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنَ الشَّجَرِ شَجَرَةً لاَ يَسْقُطُ وَرَقُهَا، وَإِنَّهَا مَثَلُ الْمُسْلِمِ، فَحَدِّثُونِي مَا هِيَ ‏\"‏‏.‏ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَوَادِي‏.‏ قَالَ عَبْدُ اللَّهِ وَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ، فَاسْتَحْيَيْتُ ثُمَّ قَالُوا حَدِّثْنَا مَا هِيَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ الْمُحَدِّثِ حَدَّثَنَا أَوْ، أَخْبَرَنَا وَأَنْبَأَنَا",
                "headingUrdu": "راویوں کی طرف سے استعمال ہونے والے مختلف الفاظ کے متعلق جو روایت کے تصور کے حوالے سے مختلف معنی بیان کرتے ہیں اور جن کی اہمیت صرف اہل حدیث کے لیے ہے۔",
                "headingEnglish": "Concerning the variety of words used by narrators conveying different significations regarding the concept of narrating and which has importance for the Hadith scholars only",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 62,
                "hadithNumber": "62",
                "englishNarrator": "Narrated Ibn `Umar:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Amongst the trees, there is a tree, the leaves of which do not fall and is like a Muslim. Tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas. And I thought of the date-palm tree. The others then asked, \"Please inform us what is that tree, O Allah's Messenger (ﷺ)?\" He replied, \"It is the date-palm tree.\"",
                "hadithUrdu": "( ایک مرتبہ ) آپ صلی اللہ علیہ وسلم نے فرمایا درختوں میں سے ایک درخت ایسا ہے کہ اس کے پتے نہیں جھڑتے اور مسلمان کی بھی یہی مثال ہے بتلاؤ وہ کون سا درخت ہے ؟ یہ سن کر لوگوں کے خیالات جنگل کے درختوں میں چلے گئے ۔ عبداللہ نے کہا کہ میرے دل میں آیا کہ بتلا دوں کہ وہ کھجور کا درخت ہے لیکن ( وہاں بہت سے بزرگ موجود تھے اس لیے ) مجھ کو شرم آئی ۔ آخر صحابہ نے عرض کیا یا رسول اللہ ! آپ ہی بیان فرما دیجیئے ۔ آپ صلی اللہ علیہ وسلم نے بتلایا کہ وہ کھجور کا درخت ہے ۔",
                "urduNarrator": "ہم سے خالد بن مخلد نے بیان کیا ، کہا ہم سے سلیمان بن بلال نے بیان کیا ، کہا ہم سے عبداللہ بن دینار نے بیان کیا ، انھوں نے عبداللہ بن عمر رضی اللہ عنہما سے انھوں نے آنحضرت صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ مِنَ الشَّجَرِ شَجَرَةً لاَ يَسْقُطُ وَرَقُهَا، وَإِنَّهَا مَثَلُ الْمُسْلِمِ، حَدِّثُونِي مَا هِيَ ‏\"‏‏.‏ قَالَ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَوَادِي‏.‏ قَالَ عَبْدُ اللَّهِ فَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ، ثُمَّ قَالُوا حَدِّثْنَا مَا هِيَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏",
                "headingArabic": "طَرْحِ الإِمَامِ الْمَسْأَلَةَ عَلَى أَصْحَابِهِ لِيَخْتَبِرَ مَا عِنْدَهُمْ مِنَ الْعِلْمِ",
                "headingUrdu": "امام اپنے اصحاب سے ان کے علم کو جانچنے کے لیے سوال کرتے ہیں۔",
                "headingEnglish": "The Imam questioning his companions in order to test their knowledge",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 63,
                "hadithNumber": "63",
                "englishNarrator": "Narrated Anas bin Malik:",
                "hadithEnglish": "While we were sitting with the Prophet (ﷺ) in the mosque, a man came riding on a camel. He made his camel kneel down in the mosque, tied its foreleg and then said: \"Who amongst you is Muhammad?\" At that time the Prophet (ﷺ) was sitting amongst us (his companions) leaning on his arm. We replied, \"This white man reclining on his arm.\" The man then addressed him, \"O Son of `Abdul Muttalib.\" The Prophet (ﷺ) said, \"I am here to answer your questions.\" The man said to the Prophet, \"I want to ask you something and will be hard in questioning. So do not get angry.\" The Prophet (ﷺ) said, \"Ask whatever you want.\" The man said, \"I ask you by your Lord, and the Lord of those who were before you, has Allah sent you as an Apostle to all the mankind?\" The Prophet (ﷺ) replied, \"By Allah, yes.\" The man further said, \"I ask you by Allah. Has Allah ordered you to offer five prayers in a day and night (24 hours).? He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah! Has Allah ordered you to observe fasts during this month of the year (i.e. Ramadan)?\" He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah. Has Allah ordered you to take Zakat (obligatory charity) from our rich people and distribute it amongst our poor people?\" The Prophet (ﷺ) replied, \"By Allah, yes.\" Thereupon that man said, \"I have believed in all that with which you have been sent, and I have been sent by my people as a messenger, and I am Dimam bin Tha`laba from the brothers of Bani Sa`d bin Bakr.\"",
                "hadithUrdu": "ایک بار ہم مسجد میں آنحضرت صلی اللہ علیہ وسلم کے ساتھ بیٹھے ہوئے تھے ، اتنے میں ایک شخص اونٹ پر سوار ہو کر آیا اور اونٹ کو مسجد میں بٹھا کر باندھ دیا ۔ پھر پوچھنے لگا ( بھائیو ) تم لوگوں میں محمد ( صلی اللہ علیہ وسلم ) کون سے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت لوگوں میں تکیہ لگائے بیٹھے ہوئے تھے ۔ ہم نے کہا ( حضرت ) محمد ( صلی اللہ علیہ وسلم ) یہ سفید رنگ والے بزرگ ہیں جو تکیہ لگائے ہوئے تشریف فرما ہیں ۔ تب وہ آپ سے مخاطب ہوا کہ اے عبدالمطلب کے فرزند ! آپ صلی اللہ علیہ وسلم نے فرمایا ۔ کہو میں آپ کی بات سن رہا ہوں ۔ وہ بولا میں آپ صلی اللہ علیہ وسلم سے کچھ دینی باتیں دریافت کرنا چاہتا ہوں اور ذرا سختی سے بھی پوچھوں گا تو آپ اپنے دل میں برا نہ مانئے گا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا نہیں جو تمہارا دل چاہے پوچھو ۔ تب اس نے کہا کہ میں آپ کو آپ کے رب اور اگلے لوگوں کے رب تبارک وتعالیٰ کی قسم دے کر پوچھتا ہوں کیا آپ کو اللہ نے دنیا کے سب لوگوں کی طرف رسول بنا کر بھیجا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ہاں یا میرے اللہ ! پھر اس نے کہا میں آپ صلی اللہ علیہ وسلم کو اللہ کی قسم دیتا ہوں کیا اللہ نے آپ صلی اللہ علیہ وسلم کو رات دن میں پانچ نمازیں پڑھنے کا حکم فرمایا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ہاں یا میرے اللہ ! پھر کہنے لگا میں آپ کو اللہ کی قسم دے کر پوچھتا ہوں کہ کیا اللہ نے آپ کو یہ حکم دیا ہے کہ سال بھر میں اس مہینہ رمضان کے روزے رکھو ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ہاں یا میرے اللہ ! پھر کہنے لگا میں آپ صلی اللہ علیہ وسلم کو اللہ کی قسم دے کر پوچھتا ہوں کہ کیا اللہ نے آپ کو یہ حکم دیا ہے کہ آپ ہم میں سے جو مالدار لوگ ہیں ان سے زکوٰۃ وصول کر کے ہمارے محتاجوں میں بانٹ دیا کریں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ہاں یا میرے اللہ ! تب وہ شخص کہنے لگا جو حکم آپ صلی اللہ علیہ وسلم اللہ کے پاس سے لائے ہیں ، میں ان پر ایمان لایا اور میں اپنی قوم کے لوگوں کا جو یہاں نہیں آئے ہیں بھیجا ہوا ( تحقیق حال کے لیے ) آیا ہوں ۔ میرا نام ضمام بن ثعلبہ ہے ، میں بنی سعد بن بکر کے خاندان سے ہوں ۔ اس حدیث کو ( لیث کی طرح ) موسیٰ اور علی بن عبدالحمید نے سلیمان سے روایت کیا ، انھوں نے ثابت سے ، انھوں نے انس سے ، انھوں نے یہی مضمون آنحضرت صلی اللہ علیہ وسلم سے نقل کیا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، انھوں نے سعید مقبری سے ، انھوں نے شریک بن عبداللہ بن ابی نمر سے ، انھوں نے انس بن مالک سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدٍ ـ هُوَ الْمَقْبُرِيُّ ـ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ بَيْنَمَا نَحْنُ جُلُوسٌ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي الْمَسْجِدِ، دَخَلَ رَجُلٌ عَلَى جَمَلٍ فَأَنَاخَهُ فِي الْمَسْجِدِ، ثُمَّ عَقَلَهُ، ثُمَّ قَالَ لَهُمْ أَيُّكُمْ مُحَمَّدٌ وَالنَّبِيُّ صلى الله عليه وسلم مُتَّكِئٌ بَيْنَ ظَهْرَانَيْهِمْ‏.‏ فَقُلْنَا هَذَا الرَّجُلُ الأَبْيَضُ الْمُتَّكِئُ‏.‏ فَقَالَ لَهُ الرَّجُلُ ابْنَ عَبْدِ الْمُطَّلِبِ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ قَدْ أَجَبْتُكَ ‏\"‏‏.‏ فَقَالَ الرَّجُلُ لِلنَّبِيِّ صلى الله عليه وسلم إِنِّي سَائِلُكَ فَمُشَدِّدٌ عَلَيْكَ فِي الْمَسْأَلَةِ فَلاَ تَجِدْ عَلَىَّ فِي نَفْسِكَ‏.‏ فَقَالَ ‏\"‏ سَلْ عَمَّا بَدَا لَكَ ‏\"‏‏.‏ فَقَالَ أَسْأَلُكَ بِرَبِّكَ وَرَبِّ مَنْ قَبْلَكَ، آللَّهُ أَرْسَلَكَ إِلَى النَّاسِ كُلِّهِمْ فَقَالَ ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏‏.‏ قَالَ أَنْشُدُكَ بِاللَّهِ، آللَّهُ أَمَرَكَ أَنْ نُصَلِّيَ الصَّلَوَاتِ الْخَمْسَ فِي الْيَوْمِ وَاللَّيْلَةِ قَالَ ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏‏.‏ قَالَ أَنْشُدُكَ بِاللَّهِ، آللَّهُ أَمَرَكَ أَنْ نَصُومَ هَذَا الشَّهْرَ مِنَ السَّنَةِ قَالَ ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏‏.‏ قَالَ أَنْشُدُكَ بِاللَّهِ، آللَّهُ أَمَرَكَ أَنْ تَأْخُذَ هَذِهِ الصَّدَقَةَ مِنْ أَغْنِيَائِنَا فَتَقْسِمَهَا عَلَى فُقَرَائِنَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ نَعَمْ ‏\"‏‏.‏ فَقَالَ الرَّجُلُ آمَنْتُ بِمَا جِئْتَ بِهِ، وَأَنَا رَسُولُ مَنْ وَرَائِي مِنْ قَوْمِي، وَأَنَا ضِمَامُ بْنُ ثَعْلَبَةَ أَخُو بَنِي سَعْدِ بْنِ بَكْرٍ‏.‏ رَوَاهُ مُوسَى وَعَلِيُّ بْنُ عَبْدِ الْحَمِيدِ عَنْ سُلَيْمَانَ عَنْ ثَابِتٍ عَنْ أَنَسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا‏.‏",
                "headingArabic": "مَا جَاءَ فِي الْعِلْمِ",
                "headingUrdu": "علم کے بارے میں کیا کہا جاتا ہے۔",
                "headingEnglish": "What is said about knowledge",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 64,
                "hadithNumber": "64",
                "englishNarrator": "Narrated `Abdullah bin `Abbas:",
                "hadithEnglish": "Once Allah's Messenger (ﷺ) gave a letter to a person and ordered him to go and deliver it to the Governor of Bahrain. (He did so) and the Governor of Bahrain sent it to Chousroes, who read that letter and then tore it to pieces. (The sub-narrator (Ibn Shihab) thinks that Ibn Al-Musaiyab said that Allah's Messenger (ﷺ) invoked Allah against them (saying), \"May Allah tear them into pieces, and disperse them all totally.)\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو اپنا ایک خط دے کر بھیجا اور اسے یہ حکم دیا کہ اسے حاکم بحرین کے پاس لے جائے ۔ بحرین کے حاکم نے وہ خط کسریٰ ( شاہ ایران ) کے پاس بھیج دیا ۔ جس وقت اس نے وہ خط پڑھا تو چاک کر ڈالا ( راوی کہتے ہیں ) اور میرا خیال ہے کہ ابن مسیب نے ( اس کے بعد ) مجھ سے کہا کہ ( اس واقعہ کو سن کر ) رسول اللہ صلی اللہ علیہ وسلم نے اہل ایران کے لیے بددعا کی کہ وہ ( بھی چاک شدہ خط کی طرح ) ٹکڑے ٹکڑے ہو جائیں ۔",
                "urduNarrator": "اسماعیل بن عبداللہ نے ہم سے بیان کیا ، ان سے ابراہیم بن سعد نے صالح کے واسطے سے روایت کی ، انھوں نے ابن شہاب سے ، انھوں نے عبیداللہ بن عبداللہ بن عتبہ بن مسعود رضی اللہ عنہ سے نقل کیا کہ ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ بِكِتَابِهِ رَجُلاً، وَأَمَرَهُ أَنْ يَدْفَعَهُ إِلَى عَظِيمِ الْبَحْرَيْنِ، فَدَفَعَهُ عَظِيمُ الْبَحْرَيْنِ إِلَى كِسْرَى، فَلَمَّا قَرَأَهُ مَزَّقَهُ‏.‏ فَحَسِبْتُ أَنَّ ابْنَ الْمُسَيَّبِ قَالَ فَدَعَا عَلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُمَزَّقُوا كُلَّ مُمَزَّقٍ‏.‏",
                "headingArabic": "مَا يُذْكَرُ فِي الْمُنَاوَلَةِ وَكِتَابِ أَهْلِ الْعِلْمِ بِالْعِلْمِ إِلَى الْبُلْدَانِ",
                "headingUrdu": "ایک دوسرے سے ہاتھ بٹانے (علم کی کتابوں کے) اور مذہبی علماء کی طرف سے مختلف ممالک میں علم لکھنے کے بارے میں کیا کہا جاتا ہے۔",
                "headingEnglish": "What is said regarding the hand to hand exchange (of books of knowledge), and the writing of knowledge by religious scholars to different countries",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 65,
                "hadithNumber": "65",
                "englishNarrator": "Narrated Anas bin Malik:",
                "hadithEnglish": "Once the Prophet (ﷺ) wrote a letter or had an idea of writing a letter. The Prophet (ﷺ) was told that they (rulers) would not read letters unless they were sealed. So the Prophet (ﷺ) got a silver ring made with \"Muhammad Allah's Messenger (ﷺ)\" engraved on it. As if I were just observing its white glitter in the hand of the Prophet.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ( کسی بادشاہ کے نام دعوت اسلام دینے کے لیے ) ایک خط لکھا یا لکھنے کا ارادہ کیا تو آپ صلی اللہ علیہ وسلم سے کہا گیا کہ وہ بغیر مہر کے خط نہیں پڑھتے ( یعنی بے مہر کے خط کو مستند نہیں سمجھتے ) تب آپ صلی اللہ علیہ وسلم نے چاندی کی انگوٹھی بنوائی ۔ جس میں «محمد رسول الله‏» کندہ تھا ۔ گویا میں ( آج بھی ) آپ صلی اللہ علیہ وسلم کے ہاتھ میں اس کی سفیدی دیکھ رہا ہوں ۔ ( شعبہ راوی حدیث کہتے ہیں کہ ) میں نے قتادہ سے پوچھا کہ یہ کس نے کہا ( کہ ) اس پر «محمد رسول الله‏» کندہ تھا ؟ انھوں نے جواب دیا ، انس رضی اللہ عنہ نے ۔",
                "urduNarrator": "ہم سے ابوالحسن محمد بن مقاتل نے بیان کیا ، ان سے عبداللہ نے ، انہیں شعبہ نے قتادہ سے خبر دی ، وہ حضرت انس بن مالک رضی اللہ عنہ سے روایت کرتے ہیں ، انھوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَتَبَ النَّبِيُّ صلى الله عليه وسلم كِتَابًا ـ أَوْ أَرَادَ أَنْ يَكْتُبَ ـ فَقِيلَ لَهُ إِنَّهُمْ لاَ يَقْرَءُونَ كِتَابًا إِلاَّ مَخْتُومًا‏.‏ فَاتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ نَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏ كَأَنِّي أَنْظُرُ إِلَى بَيَاضِهِ فِي يَدِهِ‏.‏ فَقُلْتُ لِقَتَادَةَ مَنْ قَالَ نَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ قَالَ أَنَسٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 66,
                "hadithNumber": "66",
                "englishNarrator": "Narrated Abu Waqid Al-Laithi:",
                "hadithEnglish": "While Allah's Messenger (ﷺ) was sitting in the mosque with some people, three men came. Two of them came in front of Allah's Messenger (ﷺ) and the third one went away. The two persons kept on standing before Allah's Messenger (ﷺ) for a while and then one of them found a place in the circle and sat there while the other sat behind the gathering, and the third one went away. When Allah's Messenger (ﷺ) finished his preaching, he said, \"Shall I tell you about these three persons? One of them betook himself to Allah, so Allah took him into His grace and mercy and accommodated him, the second felt shy from Allah, so Allah sheltered Him in His mercy (and did not punish him), while the third turned his face from Allah and went away, so Allah turned His face from him likewise. \"",
                "hadithUrdu": "( ایک مرتبہ ) رسول اللہ صلی اللہ علیہ وسلم مسجد میں تشریف فرما تھے اور لوگ آپ صلی اللہ علیہ وسلم کے اردگرد بیٹھے ہوئے تھے کہ تین آدمی وہاں آئے ( ان میں سے ) دو رسول اللہ صلی اللہ علیہ وسلم کے سامنے پہنچ گئے اور ایک واپس چلا گیا ۔ ( راوی کہتے ہیں کہ ) پھر وہ دونوں رسول اللہ صلی اللہ علیہ وسلم کے سامنے کھڑے ہو گئے ۔ اس کے بعد ان میں سے ایک نے ( جب ) مجلس میں ( ایک جگہ کچھ ) گنجائش دیکھی ، تو وہاں بیٹھ گیا اور دوسرا اہل مجلس کے پیچھے بیٹھ گیا اور تیسرا جو تھا وہ لوٹ گیا ۔ تو جب رسول اللہ صلی اللہ علیہ وسلم ( اپنی گفتگو سے ) فارغ ہوئے ( تو صحابہ رضی اللہ عنہم سے ) فرمایا کہ کیا میں تمہیں تین آدمیوں کے بارے میں نہ بتاؤں ؟ تو ( سنو ) ان میں سے ایک نے اللہ سے پناہ چاہی اللہ نے اسے پناہ دی اور دوسرے کو شرم آئی تو اللہ بھی اس سے شرمایا ( کہ اسے بھی بخش دیا ) اور تیسرے شخص نے منہ موڑا ، تو اللہ نے ( بھی ) اس سے منہ موڑ لیا ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، کہا ان سے مالک نے اسحاق بن عبداللہ بن ابی طلحہ کے واسطے سے ذکر کیا ، بیشک ابومرہ مولیٰ عقیل بن ابی طالب نے انہیں ابوواقد اللیثی سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّ أَبَا مُرَّةَ، مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَخْبَرَهُ عَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَيْنَمَا هُوَ جَالِسٌ فِي الْمَسْجِدِ وَالنَّاسُ مَعَهُ، إِذْ أَقْبَلَ ثَلاَثَةُ نَفَرٍ، فَأَقْبَلَ اثْنَانِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَذَهَبَ وَاحِدٌ، قَالَ فَوَقَفَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَمَّا أَحَدُهُمَا فَرَأَى فُرْجَةً فِي الْحَلْقَةِ فَجَلَسَ فِيهَا، وَأَمَّا الآخَرُ فَجَلَسَ خَلْفَهُمْ، وَأَمَّا الثَّالِثُ فَأَدْبَرَ ذَاهِبًا، فَلَمَّا فَرَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلاَ أُخْبِرُكُمْ عَنِ النَّفَرِ الثَّلاَثَةِ أَمَّا أَحَدُهُمْ فَأَوَى إِلَى اللَّهِ، فَآوَاهُ اللَّهُ، وَأَمَّا الآخَرُ فَاسْتَحْيَا، فَاسْتَحْيَا اللَّهُ مِنْهُ، وَأَمَّا الآخَرُ فَأَعْرَضَ، فَأَعْرَضَ اللَّهُ عَنْهُ ‏\"‏‏.‏",
                "headingArabic": "مَنْ قَعَدَ حَيْثُ يَنْتَهِي بِهِ الْمَجْلِسُ وَمَنْ رَأَى فُرْجَةً فِي الْحَلْقَةِ فَجَلَسَ فِيهَا‏.‏",
                "headingUrdu": "جو بھی محفل کے آخری سرے پر بیٹھا تھا۔ اور جس نے کسی مجلس میں جگہ پائی اور وہیں بیٹھ گیا۔",
                "headingEnglish": "Whoever sat at the farther end of a gathering. And whoever found a place amongst a gathering and took his seat there",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 67,
                "hadithNumber": "67",
                "englishNarrator": "Narrated `Abdur-Rahman bin Abi Bakra's father:",
                "hadithEnglish": "Once the Prophet (ﷺ) was riding his camel and a man was holding its rein. The Prophet (ﷺ) asked, \"What is the day today?\" We kept quiet, thinking that he might give that day another name. He said, \"Isn't it the day of Nahr (slaughtering of the animals of sacrifice)\" We replied, \"Yes.\" He further asked, \"Which month is this?\" We again kept quiet, thinking that he might give it another name. Then he said, \"Isn't it the month of Dhul-Hijja?\" We replied, \"Yes.\" He said, \"Verily! Your blood, property and honor are sacred to one another (i.e. Muslims) like the sanctity of this day of yours, in this month of yours and in this city of yours. It is incumbent upon those who are present to inform those who are absent because those who are absent might comprehend (what I have said) better than the present audience.\"",
                "hadithUrdu": "وہ ( ایک دفعہ ) رسول اللہ صلی اللہ علیہ وسلم کا تذکرہ کرتے ہوئے کہنے لگے کہ رسول اللہ صلی اللہ علیہ وسلم اپنے اونٹ پر بیٹھے ہوئے تھے اور ایک شخص نے اس کی نکیل تھام رکھی تھی ، آپ صلی اللہ علیہ وسلم نے پوچھا آج یہ کون سا دن ہے ؟ ہم خاموش رہے ، حتیٰ کہ ہم سمجھے کہ آج کے دن کا آپ کوئی دوسرا نام اس کے نام کے علاوہ تجویز فرمائیں گے ( پھر ) آپ صلی اللہ علیہ وسلم نے فرمایا ، کیا آج قربانی کا دن نہیں ہے ؟ ہم نے عرض کیا ، بیشک ۔ ( اس کے بعد ) آپ صلی اللہ علیہ وسلم نے فرمایا ، یہ کون سا مہینہ ہے ؟ ہم ( اس پر بھی ) خاموش رہے اور یہ ( ہی ) سمجھے کہ اس مہینے کا ( بھی ) آپ اس کے نام کے علاوہ کوئی دوسرا نام تجویز فرمائیں گے ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا ، کیا یہ ذی الحجہ کا مہینہ نہیں ہے ؟ ہم نے عرض کیا ، بیشک ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، تو یقیناً تمہاری جانیں اور تمہارے مال اور تمہاری آبرو تمہارے درمیان اسی طرح حرام ہیں جس طرح آج کے دن کی حرمت تمہارے اس مہینے اور اس شہر میں ہے ۔ پس جو شخص حاضر ہے اسے چاہیے کہ غائب کو یہ ( بات ) پہنچا دے ، کیونکہ ایسا ممکن ہے کہ جو شخص یہاں موجود ہے وہ ایسے شخص کو یہ خبر پہنچائے ، جو اس سے زیادہ ( حدیث کا ) یاد رکھنے والا ہو ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، ان سے بشر نے ، ان سے ابن عون نے ابن سیرین کے واسطے سے ، انھوں نے عبدالرحمٰن بن ابی بکرہ سے نقل کیا ، انھوں نے اپنے باپ سے روایت کی کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا بِشْرٌ، قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ ابْنِ سِيرِينَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، ذَكَرَ النَّبِيَّ صلى الله عليه وسلم قَعَدَ عَلَى بَعِيرِهِ، وَأَمْسَكَ إِنْسَانٌ بِخِطَامِهِ ـ أَوْ بِزِمَامِهِ ـ قَالَ ‏\"‏ أَىُّ يَوْمٍ هَذَا ‏\"‏‏.‏ فَسَكَتْنَا حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ سِوَى اسْمِهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَأَىُّ شَهْرٍ هَذَا ‏\"‏‏.‏ فَسَكَتْنَا حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ فَقَالَ ‏\"‏ أَلَيْسَ بِذِي الْحِجَّةِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ بَيْنَكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا‏.‏ لِيُبَلِّغِ الشَّاهِدُ الْغَائِبَ، فَإِنَّ الشَّاهِدَ عَسَى أَنْ يُبَلِّغَ مَنْ هُوَ أَوْعَى لَهُ مِنْهُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏رُبَّ مُبَلَّغٍ أَوْعَى مِنْ سَامِعٍ ‏\"‏",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کا فرمان: ممکن ہے کہ جس شخص کو کوئی اطلاع بالواسطہ ملے وہ اس کو اس شخص سے بہتر سمجھے جس نے اسے براہ راست اس کے منبع سے سنا ہو۔",
                "headingEnglish": "The Statement of the Prophet (saws): lt is probable that a person who receives a piece of information indirectly may comprehend it better than he who has heard it directly from its source",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 68,
                "hadithNumber": "68",
                "englishNarrator": "Narrated Ibn Mas`ud:",
                "hadithEnglish": "The Prophet (ﷺ) used to take care of us in preaching by selecting a suitable time, so that we might not get bored. (He abstained from pestering us with sermons and knowledge all the time).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں نصیحت فرمانے کے لیے کچھ دن مقرر کر دیئے تھے اس ڈر سے کہ کہیں ہم کبیدہ خاطر نہ ہو جائیں ۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا ، انہیں سفیان نے اعمش سے خبر دی ، وہ ابووائل سے روایت کرتے ہیں ، وہ عبداللہ بن مسعود رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنِ ابْنِ مَسْعُودٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الأَيَّامِ، كَرَاهَةَ السَّآمَةِ عَلَيْنَا‏.‏",
                "headingArabic": "مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَخَوَّلُهُمْ بِالْمَوْعِظَةِ وَالْعِلْمِ كَىْ لاَ يَنْفِرُوا",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم تبلیغ میں مناسب وقت کا انتخاب کرتے ہوئے لوگوں کا خیال رکھتے تھے تاکہ وہ بھاگ نہ جائیں (انہیں ہر وقت دینی باتوں اور علم سے تنگ یا تنگ نہیں کیا)",
                "headingEnglish": "The Prophet (saws) used to take care of the people in preaching by selecting a suitable time so that they might not run away (never made them averse or bored them with religious talk and knowledge all the time)",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 69,
                "hadithNumber": "69",
                "englishNarrator": "Narrated Anas bin Malik:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Facilitate things to people (concerning religious matters), and do not make it hard for them and give them good tidings and do not make them run away (from Islam).",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا ، آسانی کرو اور سختی نہ کرو اور خوش کرو اور نفرت نہ دلاؤ ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، ان سے یحییٰ بن سعید نے ، ان سے شعبہ نے ، ان سے ابوالتیاح نے ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے نقل کیا ، وہ رسول اللہ صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي أَبُو التَّيَّاحِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَسِّرُوا وَلاَ تُعَسِّرُوا، وَبَشِّرُوا وَلاَ تُنَفِّرُوا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 70,
                "hadithNumber": "70",
                "englishNarrator": "Narrated Abu Wail:",
                "hadithEnglish": "`Abdullah used to give a religious talk to the people on every Thursday. Once a man said, \"O Aba `Abdur-Rahman! (By Allah) I wish if you could preach us daily.\" He replied, \"The only thing which prevents me from doing so, is that I hate to bore you, and no doubt I take care of you in preaching by selecting a suitable time just as the Prophet (ﷺ) used to do with us, for fear of making us bored.\"",
                "hadithUrdu": "عبداللہ ( ابن مسعود ) رضی اللہ عنہ ہر جمعرات کے دن لوگوں کو وعظ سنایا کرتے تھے ۔ ایک آدمی نے ان سے کہا اے ابوعبدالرحمن ! میں چاہتا ہوں کہ تم ہمیں ہر روز وعظ سنایا کرو ۔ انھوں نے فرمایا ، تو سن لو کہ مجھے اس امر سے کوئی چیز مانع ہے تو یہ کہ میں یہ بات پسند نہیں کرتا کہ کہیں تم تنگ نہ ہو جاؤ اور میں وعظ میں تمہاری فرصت کا وقت تلاش کیا کرتا ہوں جیسا کہ رسول اللہ صلی اللہ علیہ وسلم اس خیال سے کہ ہم کبیدہ خاطر نہ ہو جائیں ، وعظ کے لیے ہمارے اوقات فرصت کا خیال رکھتے تھے ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، ان سے جریر نے منصور کے واسطے سے نقل کیا ، وہ ابووائل سے روایت کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، قَالَ كَانَ عَبْدُ اللَّهِ يُذَكِّرُ النَّاسَ فِي كُلِّ خَمِيسٍ، فَقَالَ لَهُ رَجُلٌ يَا أَبَا عَبْدِ الرَّحْمَنِ لَوَدِدْتُ أَنَّكَ ذَكَّرْتَنَا كُلَّ يَوْمٍ‏.‏ قَالَ أَمَا إِنَّهُ يَمْنَعُنِي مِنْ ذَلِكَ أَنِّي أَكْرَهُ أَنْ أُمِلَّكُمْ، وَإِنِّي أَتَخَوَّلُكُمْ بِالْمَوْعِظَةِ كَمَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَخَوَّلُنَا بِهَا، مَخَافَةَ السَّآمَةِ عَلَيْنَا‏.‏",
                "headingArabic": "مَنْ جَعَلَ لأَهْلِ الْعِلْمِ أَيَّامًا مَعْلُومَةً",
                "headingUrdu": "جس نے طلبہ کو (دینی تقریر) دینے کے لیے ایک خاص دن مقرر کیا۔",
                "headingEnglish": "Whoever fixed a special day for giving (a religious talk) to the students",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 71,
                "hadithNumber": "71",
                "englishNarrator": "Narrated Muawiya:",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"If Allah wants to do good to a person, He makes him comprehend the religion. I am just a distributor, but the grant is from Allah. (And remember) that this nation (true Muslims) will keep on following Allah's teachings strictly and they will not be harmed by any one going on a different path till Allah's order (Day of Judgment) is established.\"",
                "hadithUrdu": "وہ خطبہ میں فرما رہے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا کہ جس شخص کے ساتھ اللہ تعالیٰ بھلائی کا ارادہ کرے اسے دین کی سمجھ عنایت فرما دیتا ہے اور میں تو محض تقسیم کرنے والا ہوں ، دینے والا تو اللہ ہی ہے اور یہ امت ہمیشہ اللہ کے حکم پر قائم رہے گی اور جو شخص ان کی مخالفت کرے گا ، انہیں نقصان نہیں پہنچا سکے گا ، یہاں تک کہ اللہ کا حکم ( قیامت ) آ جائے ( اور یہ عالم فنا ہو جائے ) ۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ، ان سے وہب نے یونس کے واسطے سے نقل کیا ، وہ ابن شہاب سے نقل کرتے ہیں ، ان سے حمید بن عبدالرحمٰن نے کہا کہ میں نے معاویہ سے سنا ۔",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ قَالَ حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ سَمِعْتُ مُعَاوِيَةَ، خَطِيبًا يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ، وَإِنَّمَا أَنَا قَاسِمٌ وَاللَّهُ يُعْطِي، وَلَنْ تَزَالَ هَذِهِ الأُمَّةُ قَائِمَةً عَلَى أَمْرِ اللَّهِ لاَ يَضُرُّهُمْ مَنْ خَالَفَهُمْ حَتَّى يَأْتِيَ أَمْرُ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": "مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ",
                "headingUrdu": "اگر اللہ تعالیٰ کسی بندے کے ساتھ بھلائی کرنا چاہتا ہے تو اسے (دین) کی سمجھ عطا فرما دیتا ہے۔ [قرآن کی تفہیم اور سنت رسول (ص) کے قانونی طریقے]",
                "headingEnglish": "If Allah Jalla Jalalahu wants to do good to a person, He makes him comprehend (the religion). [The understanding of the Qur'an and As-Sunna (legal ways) of the Prophet (Muhammad (saws))]",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 72,
                "hadithNumber": "72",
                "englishNarrator": "Narrated Ibn `Umar:",
                "hadithEnglish": "We were with the Prophet (ﷺ) and fresh dates of a palm tree were brought to him. On that he said, \"Amongst the trees, there is a tree which resembles a Muslim.\" I wanted to say that it was the datepalm tree but as I was the youngest of all (of them) I kept quiet. And then the Prophet (ﷺ) said, \"It is the date-palm tree.\"",
                "hadithUrdu": "میں عبداللہ بن عمر رضی اللہ عنہما کے ساتھ مدینے تک رہا ، میں نے ( اس ) ایک حدیث کے سوا ان سے رسول اللہ صلی اللہ علیہ وسلم کی کوئی اور حدیث نہیں سنی ، وہ کہتے تھے کہ ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر تھے کہ آپ صلی اللہ علیہ وسلم کے پاس کھجور کا ایک گابھا لایا گیا ۔ ( اسے دیکھ کر ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ درختوں میں ایک درخت ایسا ہے اس کی مثال مسلمان کی طرح ہے ۔ ( ابن عمر رضی اللہ عنہما کہتے ہیں کہ یہ سن کر ) میں نے ارادہ کیا کہ عرض کروں کہ وہ ( درخت ) کھجور کا ہے مگر چونکہ میں سب میں چھوٹا تھا اس لیے خاموش رہا ۔ ( پھر ) رسول اللہ صلی اللہ علیہ وسلم نے خود ہی فرمایا کہ وہ کھجور ہے ۔",
                "urduNarrator": "ہم سے علی ( بن مدینی ) نے بیان کیا ، ان سے سفیان نے ، ان سے ابن ابی نجیح نے مجاہد کے واسطے سے نقل کیا ، وہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ قَالَ لِي ابْنُ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ، قَالَ صَحِبْتُ ابْنَ عُمَرَ إِلَى الْمَدِينَةِ فَلَمْ أَسْمَعْهُ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلاَّ حَدِيثًا وَاحِدًا، قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأُتِيَ بِجُمَّارٍ فَقَالَ ‏\"‏ إِنَّ مِنَ الشَّجَرِ شَجَرَةً مَثَلُهَا كَمَثَلِ الْمُسْلِمِ ‏\"‏‏.‏ فَأَرَدْتُ أَنْ أَقُولَ هِيَ النَّخْلَةُ، فَإِذَا أَنَا أَصْغَرُ الْقَوْمِ فَسَكَتُّ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هِيَ النَّخْلَةُ ‏\"‏‏.‏",
                "headingArabic": "الْفَهْمِ فِي الْعِلْمِ",
                "headingUrdu": "(فہم) علم کی برتری",
                "headingEnglish": "(The superiority of) comprehending knowledge",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 73,
                "hadithNumber": "73",
                "englishNarrator": "Narrated `Abdullah bin Mas`ud:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Do not wish to be like anyone except in two cases. (The first is) A person, whom Allah has given wealth and he spends it righteously; (the second is) the one whom Allah has given wisdom (the Holy Qur'an) and he acts according to it and teaches it to others.\" (Fath-al-Bari page 177 Vol. 1)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے کہ حسد صرف دو باتوں میں جائز ہے ۔ ایک تو اس شخص کے بارے میں جسے اللہ نے دولت دی ہو اور وہ اس دولت کو راہ حق میں خرچ کرنے پر بھی قدرت رکھتا ہو اور ایک اس شخص کے بارے میں جسے اللہ نے حکمت ( کی دولت ) سے نوازا ہو اور وہ اس کے ذریعہ سے فیصلہ کرتا ہو اور ( لوگوں کو ) اس حکمت کی تعلیم دیتا ہو ۔",
                "urduNarrator": "ہم سے حمیدی نے بیان کیا ، ان سے سفیان نے ، ان سے اسماعیل بن ابی خالد نے دوسرے لفظوں میں بیان کیا ، ان لفظوں کے علاوہ جو زہری نے ہم سے بیان کئے ، وہ کہتے ہیں میں نے قیس بن ابی حازم سے سنا ، انھوں نے عبداللہ بن مسعود رضی اللہ عنہما سے سنا ، وہ کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَلَى غَيْرِ مَا حَدَّثَنَاهُ الزُّهْرِيُّ، قَالَ سَمِعْتُ قَيْسَ بْنَ أَبِي حَازِمٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ حَسَدَ إِلاَّ فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ مَالاً فَسُلِّطَ عَلَى هَلَكَتِهِ فِي الْحَقِّ، وَرَجُلٌ آتَاهُ اللَّهُ الْحِكْمَةَ، فَهْوَ يَقْضِي بِهَا وَيُعَلِّمُهَا ‏\"‏‏.‏",
                "headingArabic": "الاِغْتِبَاطِ فِي الْعِلْمِ وَالْحِكْمَةِ",
                "headingUrdu": "اس شخص کی طرح بننا چاہتے ہیں جس کے پاس علم اور حکمت ہے",
                "headingEnglish": "Wish to be like the one who has knowledge and Al-Hikmah [wisdom i.e., the knowledge of the Qur'an and the Sunna (legal ways) of the Prophet (saws)]",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 74,
                "hadithNumber": "74",
                "englishNarrator": "Narrated Ibn `Abbas:",
                "hadithEnglish": "That he differed with Hur bin Qais bin Hisn Al-Fazari regarding the companion of (the Prophet) Moses. Ibn `Abbas said that he was Al Khadir. Meanwhile, Ubai bin Ka`b passed by them and Ibn `Abbas called him, saying \"My friend (Hur) and I have differed regarding Moses' companion, whom Moses asked the way to meet. Have you heard the Prophet (ﷺ) mentioning something about him? He said, \"Yes. I heard Allah's Messenger (ﷺ) saying, \"While Moses was sitting in the company of some Israelites, a man came and asked him. \"Do you know anyone who is more learned than you? Moses replied: \"No.\" So Allah sent the Divine Inspiration to Moses: 'Yes, Our slave Khadir (is more learned than you.)' Moses asked (Allah) how to meet him (Khadir). So Allah made the fish as a sign for him and he was told that when the fish was lost, he should return (to the place where he had lost it) and there he would meet him (Al-Khadir). So Moses went on looking for the sign of the fish in the sea. The servant-boy of Moses said to him: Do you remember when we betook ourselves to the rock, I indeed forgot the fish, none but Satan made me forget to remember it. On that Moses said: 'That is what we have been seeking? (18.64) So they went back retracing their footsteps, and found Khadir. (And) what happened further to them is narrated in the Holy Qur'an by Allah. (18.54 up to 18.82)",
                "hadithUrdu": "وہ اور حر بن قیس بن حصن فزاری حضرت موسیٰ علیہ السلام کے ساتھی کے بارے میں بحثے ۔ حضرت ابن عباس رضی اللہ عنہما نے فرمایا کہ وہ خضر علیہ السلام تھے ۔ پھر ان کے پاس سے ابی بن کعب گزرے تو عبداللہ بن عباس رضی اللہ عنہما نے انہیں بلایا اور کہا کہ میں اور میرے یہ رفیق موسیٰ علیہ السلام کے اس ساتھی کے بارے میں بحث کر رہے ہیں جس سے انھوں نے ملاقات چاہی تھی ۔ کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے بارے میں کچھ ذکر سنا ہے ۔ انھوں نے کہا ، ہاں میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ہے ۔ ایک دن حضرت موسیٰ بنی اسرائیل کی ایک جماعت میں بیٹھے ہوئے تھے کہ اتنے میں ایک شخص آیا اور اس نے آپ سے پوچھا کیا آپ جانتے ہیں کہ ( دنیا میں ) کوئی آپ سے بھی بڑھ کر عالم موجود ہے ؟ حضرت موسیٰ علیہ السلام نے فرمایا نہیں ۔ اس پر اللہ تعالیٰ نے حضرت موسیٰ علیہ اسلام کے پاس وحی بھیجی کہ ہاں ہمارا بندہ خضر ہے ( جس کا علم تم سے زیادہ ہے ) حضرت موسیٰ علیہ السلام نے اللہ سے دریافت کیا کہ خضر علیہ السلام سے ملنے کی کیا صورت ہے ؟ اللہ تعالیٰ نے ایک مچھلی کو ان سے ملاقات کی علامت قرار دیا اور ان سے کہہ دیا کہ جب تم اس مچھلی کو گم کر دو تو ( واپس ) لوٹ جاؤ ، تب خضر سے تمہاری ملاقات ہو گی ۔ تب موسیٰ ( چلے اور ) دریا میں مچھلی کی علامت تلاش کرتے رہے ۔ اس وقت ان کے ساتھی نے کہا جب ہم پتھر کے پاس تھے ، کیا آپ نے دیکھا تھا ، میں اس وقت مچھلی کا کہنا بھول گیا اور شیطان ہی نے مجھے اس کا ذکر بھلا دیا ۔ موسیٰ علیہ السلام نے کہا ، اسی مقام کی ہمیں تلاش تھی ۔ تب وہ اپنے نشانات قدم پر ( پچھلے پاؤں ) باتیں کرتے ہوئے لوٹے ( وہاں ) انھوں نے خضر علیہ السلام کو پایا ۔ پھر ان کا وہی قصہ ہے جو اللہ نے اپنی کتاب قرآن میں بیان کیا ہے ۔",
                "urduNarrator": "ہم سے محمد بن غریر زہری نے بیان کیا ، ان سے یعقوب بن ابراہیم نے ، ان سے ان کے باپ ( ابراہیم ) نے ، انھوں نے صالح سے سنا ، انھوں نے ابن شہاب سے ، وہ بیان کرتے ہیں کہ انہیں عبیداللہ بن عبداللہ نے حضرت ابن عباس رضی اللہ عنہما کے واسطے سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ غُرَيْرٍ الزُّهْرِيُّ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَ أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ أَخْبَرَهُ عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ تَمَارَى هُوَ وَالْحُرُّ بْنُ قَيْسِ بْنِ حِصْنٍ الْفَزَارِيُّ فِي صَاحِبِ مُوسَى قَالَ ابْنُ عَبَّاسٍ هُوَ خَضِرٌ‏.‏ فَمَرَّ بِهِمَا أُبَىُّ بْنُ كَعْبٍ، فَدَعَاهُ ابْنُ عَبَّاسٍ فَقَالَ إِنِّي تَمَارَيْتُ أَنَا وَصَاحِبِي، هَذَا فِي صَاحِبِ مُوسَى الَّذِي سَأَلَ مُوسَى السَّبِيلَ إِلَى لُقِيِّهِ، هَلْ سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم يَذْكُرُ شَأْنَهُ قَالَ نَعَمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ بَيْنَمَا مُوسَى فِي مَلإٍ مِنْ بَنِي إِسْرَائِيلَ، جَاءَهُ رَجُلٌ فَقَالَ هَلْ تَعْلَمُ أَحَدًا أَعْلَمَ مِنْكَ قَالَ مُوسَى لاَ‏.‏ فَأَوْحَى اللَّهُ إِلَى مُوسَى بَلَى، عَبْدُنَا خَضِرٌ، فَسَأَلَ مُوسَى السَّبِيلَ إِلَيْهِ، فَجَعَلَ اللَّهُ لَهُ الْحُوتَ آيَةً، وَقِيلَ لَهُ إِذَا فَقَدْتَ الْحُوتَ فَارْجِعْ، فَإِنَّكَ سَتَلْقَاهُ، وَكَانَ يَتَّبِعُ أَثَرَ الْحُوتِ فِي الْبَحْرِ، فَقَالَ لِمُوسَى فَتَاهُ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ، وَمَا أَنْسَانِيهِ إِلاَّ الشَّيْطَانُ أَنْ أَذْكُرَهُ‏.‏ قَالَ ذَلِكَ مَا كُنَّا نَبْغِي، فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا، فَوَجَدَا خَضِرًا‏.‏ فَكَانَ مِنْ شَأْنِهِمَا الَّذِي قَصَّ اللَّهُ ـ عَزَّ وَجَلَّ ـ فِي كِتَابِهِ ‏\"‏‏.‏",
                "headingArabic": "مَا ذُكِرَ فِي ذَهَابِ مُوسَى صلى الله عليه وسلم فِي الْبَحْرِ إِلَى الْخَضِرِ",
                "headingUrdu": "حضرت موسیٰ (علیہ السلام) کے سمندر میں خضر سے ملنے کے سفر کے بارے میں کیا کہا گیا ہے؟",
                "headingEnglish": "What has been said about the journey of Prophet Musa ('alaihi as-salam) (when he went) in the sea to meet Al-Khidr",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 75,
                "hadithNumber": "75",
                "englishNarrator": "Narrated Ibn `Abbas:",
                "hadithEnglish": "Once the Prophet (ﷺ) embraced me and said, \"O Allah! Bestow on him the knowledge of the Book (Qur'an).",
                "hadithUrdu": "( ایک مرتبہ ) رسول اللہ صلی اللہ علیہ وسلم نے مجھے ( سینے سے ) لگا لیا اور دعا دیتے ہوئے فرمایا کہ ’’ اے اللہ اسے علم کتاب ( قرآن ) عطا فرمائیو ‘‘ ۔",
                "urduNarrator": "ہم سے ابومعمر نے بیان کیا ، ان سے عبدالوارث نے ، ان سے خالد نے عکرمہ کے واسطے سے بیان کیا ، وہ حضرت ابن عباس رضی اللہ عنہما سے روایت کرتے ہیں ۔ انھوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ضَمَّنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏ \"‏ اللَّهُمَّ عَلِّمْهُ الْكِتَابَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ اللَّهُمَّ عَلِّمْهُ الْكِتَابَ ‏\"‏",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کا فرمان ہے: \"اے اللہ! اسے (ابن عباس) کو کتاب (قرآن) کا علم عطا فرما۔",
                "headingEnglish": "The statement of the Prophet (saws): \"O Allah! Bestow on him (Ibn Abbas) the knowledge of the Book (the Qur'an)",
                "chapterId": "3",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 3,
                    "chapterNumber": "3",
                    "chapterEnglish": "Knowledge",
                    "chapterUrdu": "علم کے بیان میں",
                    "chapterArabic": "كتاب العلم",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 51,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=3",
                "label": "3",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=4",
                "label": "4",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=5",
                "label": "5",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=6",
                "label": "6",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=7",
                "label": "7",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=8",
                "label": "8",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=9",
                "label": "9",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=10",
                "label": "10",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=4",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=4",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=2",
        "to": 75,
        "total": 40465
    }
}