{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 232,
        "data": [
            {
                "id": 5778,
                "hadithNumber": "6031",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) was not one who would abuse (others) or say obscene words, or curse (others), and if he wanted to admonish anyone of us, he used to say: \"What is wrong with him, his forehead be dusted!\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نہ گالی دیتے تھے نہ بدگو تھے نہ بدخو تھے اور نہ لعنت ملامت کرتے تھے ۔ اگر ہم میں سے کسی پر ناراض ہوتے اتنا فرماتے اسے کیا ہو گیا ہے ۔ اس کی پیشانی میں خاک لگے ۔",
                "urduNarrator": "ہم سے اصبغ بن فرج نے بیان کیا ، انہوں نے کہا کہ مجھے عبداللہ بن وہب نے خبر دی انہوں نے کہا ہم کو ابو یحییٰ فلیح بن سلیمان نے خبر دی ، انہیں ہلال بن اسامہ نے بیان کیا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَصْبَغُ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، أَخْبَرَنَا أَبُو يَحْيَى، هُوَ فُلَيْحُ بْنُ سُلَيْمَانَ عَنْ هِلاَلِ بْنِ أُسَامَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ لَمْ يَكُنِ النَّبِيُّ صلى الله عليه وسلم سَبَّابًا وَلاَ فَحَّاشًا وَلاَ لَعَّانًا، كَانَ يَقُولُ لأَحَدِنَا عِنْدَ الْمَعْتَبَةِ ‏ \"‏ مَا لَهُ، تَرِبَ جَبِينُهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5779,
                "hadithNumber": "6032",
                "englishNarrator": "Narrated 'Aisha رضی اللہ عنہا :",
                "hadithEnglish": "A man asked permission to enter upon the Prophet. When the Prophet (ﷺ) saw him, he said, \"What an evil brother of his tribe! And what an evil son of his tribe!\" When that man sat down, the Prophet (ﷺ) behaved with him in a nice and polite manner and was completely at ease with him. When that person had left, 'Aisha  رضی اللہ عنہا said (to the Prophet). \"O Allah's Apostle! When you saw that man, you said so-and-so about him, then you showed him a kind and polite behavior, and you enjoyed his company?\" Allah's Messenger (ﷺ) said, \"O 'Aisha! Have you ever seen me speaking a bad and dirty language? (Remember that) the worst people in Allah's sight on the Day of Resurrection will be those whom the people leave (undisturbed) to be away from their evil (deeds).\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے ایک شخص نے اندر آنے کی اجازت چاہی ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے دیکھ کر فرمایا کہ برا ہے فلاں قبیلہ کا بھائی ۔ یا ( آپ نے فرمایا ) کہ برا ہے فلاں قبیلہ کا بیٹا ۔ پھر جب وہ آنحضرت صلی اللہ علیہ وسلم کے پاس آبیٹھا تو آپ اس کے ساتھ بہت خوش خلقی کے ساتھ پیش آئے ۔ وہ شخص جب چلا گیا تو حضرت عائشہ رضی اللہ عنہا نے آپ سے عرض کیا یا رسول اللہ ! جب آپ نے اسے دیکھا تھا تو اس کے متعلق یہ کلمات فرمائے تھے ، جب آپ اس سے ملے تو بہت ہی خندہ پیشانی سے ملے ۔ آنحضرت نے فرمایا اے عائشہ ! تم نے مجھے بدگو کب پایا ۔ اللہ کے یہاں قیامت کے دن وہ لوگ بدترین ہوں گے جن کے شر کے ڈر سے لوگ اس سے ملنا چھوڑ دیں ۔",
                "urduNarrator": "ہم سے عمرو بن عیسیٰ نے بیان کیا ، کہا ہم سے محمد بن سواء نے بیان کیا ، کہا ہم سے روح ابن قاسم نے بیان کیا ، ان سے محمد بن منکدر نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عِيسَى، حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ، حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَجُلاً، اسْتَأْذَنَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَلَمَّا رَآهُ قَالَ ‏\"‏ بِئْسَ أَخُو الْعَشِيرَةِ، وَبِئْسَ ابْنُ الْعَشِيرَةِ ‏\"‏‏.‏ فَلَمَّا جَلَسَ تَطَلَّقَ النَّبِيُّ صلى الله عليه وسلم فِي وَجْهِهِ وَانْبَسَطَ إِلَيْهِ، فَلَمَّا انْطَلَقَ الرَّجُلُ قَالَتْ لَهُ عَائِشَةُ يَا رَسُولَ اللَّهِ حِينَ رَأَيْتَ الرَّجُلَ قُلْتَ لَهُ كَذَا وَكَذَا، ثُمَّ تَطَلَّقْتَ فِي وَجْهِهِ وَانْبَسَطْتَ إِلَيْهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا عَائِشَةُ مَتَى عَهِدْتِنِي فَحَّاشًا، إِنَّ شَرَّ النَّاسِ عِنْدَ اللَّهِ مَنْزِلَةً يَوْمَ الْقِيَامَةِ مَنْ تَرَكَهُ النَّاسُ اتِّقَاءَ شَرِّهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5780,
                "hadithNumber": "6033",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) was the best among the people (both in shape and character) and was the most generous of them, and was the bravest of them. Once, during the night, the people of Medina got afraid (of a sound). So the people went towards that sound, but the Prophet (ﷺ) having gone to that sound before them, met them while he was saying, \"Don't be afraid, don't be afraid.\" (At that time) he was riding a horse belonging to Abu Talha and it was naked without a saddle, and he was carrying a sword slung at his neck. The Prophet (ﷺ) said, \"I found it (the horse) like a sea, or, it is the sea indeed.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سب سے زیادہ خوبصورت سب سے زیادہ سخی اور سب سے زیادہ بہادر تھے ۔ ایک رات مدینہ والے ( شہر کے باہر شورسن کر ) گھبرا گئے ۔ ( کہ شاید دشمن نے حملہ کیا ہے ) سب لوگ اس شور کی طرف بڑھے ۔ لیکن آنحضرت صلی اللہ علیہ وسلم آواز کی طرف بڑھنے والوں میں سب سے آگے تھے اورفرماتے جاتے تھے کہ کوئی ڈر کی بات نہیں ، کوئی ڈر کی بات نہیں ، آنحضرت صلی اللہ علیہ وسلم اس وقت ابوطلحہ کے ( مندوب نامی ) گھوڑے کی ننگی پیٹھ پر سوار تھے ، اس پر کوئی زین نہیں تھی اور گلے میں تلوار لٹک رہی تھی ۔ آپ نے فرمایا کہ میں نے اس گھوڑے کو سمندر پایا ۔ یا فرمایا کہ یہ تیز دوڑنے میں سمندر کی طرح تھا ۔",
                "urduNarrator": "ہم سے عمرو بن عون نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا حَمَّادٌ ـ هُوَ ابْنُ زَيْدٍ ـ عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم أَحْسَنَ النَّاسِ وَأَجْوَدَ النَّاسِ وَأَشْجَعَ النَّاسِ، وَلَقَدْ فَزِعَ أَهْلُ الْمَدِينَةِ ذَاتَ لَيْلَةٍ فَانْطَلَقَ النَّاسُ قِبَلَ الصَّوْتِ، فَاسْتَقْبَلَهُمُ النَّبِيُّ صلى الله عليه وسلم قَدْ سَبَقَ النَّاسَ إِلَى الصَّوْتِ وَهْوَ يَقُولُ ‏\"‏ لَنْ تُرَاعُوا، لَنْ تُرَاعُوا ‏\"‏‏.‏ وَهْوَ عَلَى فَرَسٍ لأَبِي طَلْحَةَ عُرْىٍ مَا عَلَيْهِ سَرْجٌ، فِي عُنُقِهِ سَيْفٌ فَقَالَ ‏\"‏ لَقَدْ وَجَدْتُهُ بَحْرًا ‏\"‏‏.‏ أَوْ ‏\"‏ إِنَّهُ لَبَحْرٌ ‏\"‏‏.‏",
                "headingArabic": "حُسْنِ الْخُلُقِ، وَالسَّخَاءِ، وَمَا يُكْرَهُ مِنَ الْبُخْلِ",
                "headingUrdu": "اچھا کردار، سخاوت اور کنجوسی",
                "headingEnglish": "Good character, generosity, and miserliness",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5781,
                "hadithNumber": "6034",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "Never was the Prophet (ﷺ) asked for a thing to be given for which his answer was 'no'.",
                "hadithUrdu": "کبھی ایسا نہیں ہوا کہ رسول اللہ صلی اللہ علیہ وسلم سے کسی نے کوئی چیز مانگی ہو اور آپ نے اس کے دینے سے انکار کیا ہو ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان نے خبر دی ، ان سے ابن منکدر نے بیان کیا ، انہوں نے حضرت جابر رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرًا ـ رضى الله عنه ـ يَقُولُ مَا سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ شَىْءٍ قَطُّ فَقَالَ لاَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5782,
                "hadithNumber": "6035",
                "englishNarrator": "Narrated Masruq:",
                "hadithEnglish": "We were sitting with `Abdullah bin `Amr who was narrating to us (Hadith): He said, \"Allah's Messenger (ﷺ) was neither a Fahish nor a Mutafahhish, and he used to say, 'The best among you are the best in character (having good manners).\"'",
                "hadithUrdu": "ہم عبداللہ بن عمرو کے پاس بیٹھے ہوئے تھے ، وہ ہم سے باتیں کر رہے تھے اسی دوران انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نہ بدگو تھے نہ بد زبانی کرتے تھے ( کہ منہ سے گالیاں نکالیں ) بلکہ آپ فرمایا کرتے تھے کہ تم میں سب سے زیادہ بہتر وہ ہے جس کے اخلاق سب سے اچھے ہوں ۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا مجھ سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا مجھ سے شفیق نے بیان کیا ، ان سے مسروق نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي شَقِيقٌ، عَنْ مَسْرُوقٍ، قَالَ كُنَّا جُلُوسًا مَعَ عَبْدِ اللَّهِ بْنِ عَمْرٍو يُحَدِّثُنَا إِذْ قَالَ لَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاحِشًا وَلاَ مُتَفَحِّشًا، وَإِنَّهُ كَانَ يَقُولُ ‏ \"‏ إِنَّ خِيَارَكُمْ أَحَاسِنُكُمْ أَخْلاَقًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5783,
                "hadithNumber": "6036",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "A woman brought a Burda (sheet) to the Prophet. Sahl رضی اللہ عنہ asked the people, \"Do you know what is a Burda?\" The people replied, \"It is a 'Shamla', a sheet with a fringe.\" That woman said, \"O Allah's Messenger (ﷺ)! I have brought it so that you may wear it.\" So the Prophet (ﷺ) took it because he was in need of it and wore it. A man among his companions, seeing him wearing it, said, \"O Allah's Apostle! Please give it to me to wear.\" The Prophet (ﷺ) said, \"Yes.\" (and gave him that sheet). When the Prophet left, the man was blamed by his companions who said, \"It was not nice on your part to ask the Prophet for it while you know that he took it because he was in need of it, and you also know that he (the Prophet) never turns down anybody's request that he might be asked for.\" That man said, \"I just wanted to have its blessings as the Prophet (ﷺ) had put it on, so l hoped that I might be shrouded in it.\"",
                "hadithUrdu": "ایک خاتون نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ” بردہ “ لے کر ائیں پھر حضرت سہل نے موجود لوگوں سے کہا تمہیں معلوم ہے ، کہ بردہ کیا چیز ہے ؟ لوگوں نے کہا کہ بردہ شملہ کو کہتے ہیں ۔ سہل رضی اللہ عنہ نے کہا کہ ہاں لنگی جس میں حاشیہ بنا ہوا ہوتا ہے تو اس خاتون نے عرض کیا کہ یا رسول اللہ ! میں یہ لنگی آپ کے پہننے کے لئے لائی ہوں ۔ حضور اکرم صلی اللہ علیہ وسلم نے وہ لنگی ان سے قبول کر لی ۔ اس وقت آپ کو اس کی ضرورت بھی تھی پھر آپ نے پہن لیا ۔ صحابہ میں سے ایک صحابی عبدالرحمٰن بن عوف رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم کے بدن پروہ لنگی دیکھی تو عرض کیا یا رسول اللہ ! یہ بڑی عمدہ لنگی ہے ، آپ مجھے اس کو عنایت فرما دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ لے لو ، جب آنحضرت صلی اللہ علیہ وسلم وہاں سے اٹھ کر تشریف لے گئے تو اندر جا کر وہ لنگی بدل کرتہہ کر کے عبدالرحمٰن کو بھیج دی تو لوگوں نے ان صاحب کو ملامت سے کہا کہ تم نے آنحضرت صلی اللہ علیہ وسلم سے لنگی مانگ کر اچھا نہیں کیا ، تم نے دیکھ لیا تھا کہ آنحضرت صلی اللہ علیہ وسلم نے اسے اس طرح قبول کیا تھا گویا آپ کو اس کی ضرورت تھی ۔ اس کے باوجود تم نے لنگی آنحضرت صلی اللہ علیہ وسلم سے مانگی ، حالانکہ تمہیں معلوم ہے کہ آنحضرت صلی اللہ علیہ وسلم سے جب بھی کوئی چیز مانگی جاتی ہے تو آپ انکار نہیں کرتے ۔ اس صحابی نے عرض کیا کہ میں تو صرف اس کی برکت کا امیدوار ہوں کہ آنحضرت صلی اللہ علیہ وسلم اسے پہن چکے تھے میری غرض یہ تھی کہ میں اس لنگی میں کفن دیا جاؤں گا ۔",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم سے ابو غسان ( محمد بن مطرف ) نے بیان کیا کہ کہا مجھ سے ابوحازم نے بیان کیا ، ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ جَاءَتِ امْرَأَةٌ إِلَى النَّبِيِّ صلى الله عليه وسلم بِبُرْدَةٍ‏.‏ فَقَالَ سَهْلٌ لِلْقَوْمِ أَتَدْرُونَ مَا الْبُرْدَةُ فَقَالَ الْقَوْمُ هِيَ شَمْلَةٌ‏.‏ فَقَالَ سَهْلٌ هِيَ شَمْلَةٌ مَنْسُوجَةٌ فِيهَا حَاشِيَتُهَا ـ فَقَالَتْ يَا رَسُولَ اللَّهِ أَكْسُوكَ هَذِهِ‏.‏ فَأَخَذَهَا النَّبِيُّ صلى الله عليه وسلم مُحْتَاجًا إِلَيْهَا، فَلَبِسَهَا، فَرَآهَا عَلَيْهِ رَجُلٌ مِنَ الصَّحَابَةِ فَقَالَ يَا رَسُولَ اللَّهِ مَا أَحْسَنَ هَذِهِ فَاكْسُنِيهَا‏.‏ فَقَالَ ‏ \"‏ نَعَمْ ‏\"‏‏.‏ فَلَمَّا قَامَ النَّبِيُّ صلى الله عليه وسلم لاَمَهُ أَصْحَابُهُ قَالُوا مَا أَحْسَنْتَ حِينَ رَأَيْتَ النَّبِيَّ صلى الله عليه وسلم أَخَذَهَا مُحْتَاجًا إِلَيْهَا، ثُمَّ سَأَلْتَهُ إِيَّاهَا، وَقَدْ عَرَفْتَ أَنَّهُ لاَ يُسْأَلُ شَيْئًا فَيَمْنَعَهُ‏.‏ فَقَالَ رَجَوْتُ بَرَكَتَهَا حِينَ لَبِسَهَا النَّبِيُّ صلى الله عليه وسلم لَعَلِّي أُكَفَّنُ فِيهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5784,
                "hadithNumber": "6037",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Time will pass rapidly, good deeds will decrease, and miserliness will be thrown (in the hearts of the people), and the Harj (will increase).\" They asked, \"What is the Harj?\" He replied, \"(It is) killing (murdering), (it is) murdering (killing).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا زمانہ جلدی جلدی گزر ے گا اور دین کا علم دنیا میں کم ہو جائے گا اور دلوں میں بخیلی سما جائے گی اور لڑائی بڑھ جائے گی ۔ صحابہ رضی اللہ عنہم نے عرض کیا ” ہرج “ کیا ہوتا ہے ؟ فرمایا قتل خون ریزی ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے کہا کہ مجھے حمید بن عبدالرحمٰن نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَتَقَارَبُ الزَّمَانُ وَيَنْقُصُ الْعَمَلُ، وَيُلْقَى الشُّحُّ وَيَكْثُرُ الْهَرْجُ ‏\"‏‏.‏ قَالُوا وَمَا الْهَرْجُ قَالَ ‏\"‏ الْقَتْلُ، الْقَتْلُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5785,
                "hadithNumber": "6038",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "I served the Prophet (ﷺ) for ten years, and he never said to me, \"Uf\" (a minor harsh word denoting impatience) and never blamed me by saying, \"Why did you do so or why didn't you do so?\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کی دس سال تک خدمت کی لیکن آپ نے کبھی مجھے اف تک نہیں کہا اور نہ کبھی یہ کہا کہ فلاں کام کیوں کیا اور فلاں کام کیوں نہیں کیا ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے سلام بن مسکین سے سنا ، کہا کہ میں نے ثابت سے سنا ، کہا کہ ہم سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، سَمِعَ سَلاَّمَ بْنَ مِسْكِينٍ، قَالَ سَمِعْتُ ثَابِتًا، يَقُولُ حَدَّثَنَا أَنَسٌ ـ رضى الله عنه ـ قَالَ خَدَمْتُ النَّبِيَّ صلى الله عليه وسلم عَشْرَ سِنِينَ، فَمَا قَالَ لِي أُفٍّ‏.‏ وَلاَ لِمَ صَنَعْتَ وَلاَ أَلاَّ صَنَعْتَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5786,
                "hadithNumber": "6039",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) use to do at home. She replied. \"He used to keep himself busy serving his family and when it was time for the prayer, he would get up for prayer.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنے گھر میں کیا کرتے تھے ؟ فرمایا آنحضرت صلی اللہ علیہ وسلم اپنے گھر کے کام کاج کرتے اور جب نماز کاوقت ہو جاتا تو نماز کے لئے مسجد تشریف لے جاتے تھے ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حکم نے ، ان سے ابراہیم نخعی نے ، ان سے اسود نے بیان کیا کہ میں نے حضرت عائشہ رضی اللہ عنہا سے پوچھا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ سَأَلْتُ عَائِشَةَ مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَصْنَعُ فِي أَهْلِهِ قَالَتْ كَانَ فِي مِهْنَةِ أَهْلِهِ، فَإِذَا حَضَرَتِ الصَّلاَةُ قَامَ إِلَى الصَّلاَةِ‏.‏",
                "headingArabic": "كَيْفَ يَكُونُ الرَّجُلُ فِي أَهْلِهِ",
                "headingUrdu": "آدمی کو اپنے گھر والوں کے ساتھ کیسا رہنا چاہیے؟",
                "headingEnglish": "How should a man be with his family?",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5787,
                "hadithNumber": "6040",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If Allah loves a person, He calls Gabriel saying: 'Allah loves so and so; O Gabriel, love him.' Gabriel would love him, and then Gabriel would make an announcement among the residents of the Heaven, 'Allah loves so-and-so, therefore, you should love him also.' So, all the residents of the Heavens would love him and then he is granted the pleasure of the people of the earth.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جب اللہ کسی بندہ سے محبت کرتا ہے تو جبرائیل علیہ السلام کو آواز دیتا ہے کہ اللہ فلاں بندہ سے محبت کرتا ہے تم بھی اس سے محبت کرو ۔ جبرائیل علیہ السلام بھی اس سے محبت کرنے لگتے ہیں ، پھر وہ تمام آسمان والوں میں آواز دیتے ہیں کہ اللہ فلاں بندہ سے محبت کرتا ہے ۔ تم بھی اس سے محبت کرو ۔ پھر تمام آسمان والے اس سے محبت کرنے لگتے ہیں ۔ اس کے بعد وہ زمین میں بھی ( بندگان خدا کا ) مقبول اورمحبوب بن جاتا ہے ۔",
                "urduNarrator": "ہم سے عمرو بن علی نے بیان کیا ، کہا ہم سے ابو عاصم نے ، ان سے ابن جریج نے ، کہا مجھ کو موسیٰ بن عقبہ نے خبر دی ، انہیں نافع نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَحَبَّ اللَّهُ عَبْدًا نَادَى جِبْرِيلَ إِنَّ اللَّهَ يُحِبُّ فُلاَنًا، فَأَحِبَّهُ‏.‏ فَيُحِبُّهُ جِبْرِيلُ، فَيُنَادِي جِبْرِيلُ فِي أَهْلِ السَّمَاءِ إِنَّ اللَّهَ يُحِبُّ فُلاَنًا، فَأَحِبُّوهُ‏.‏ فَيُحِبُّهُ أَهْلُ السَّمَاءِ، ثُمَّ يُوضَعُ لَهُ الْقَبُولُ فِي أَهْلِ الأَرْضِ ‏\"‏‏.‏",
                "headingArabic": "الْمِقَةِ مِنَ اللَّهِ تَعَالَى",
                "headingUrdu": "محبت اللہ تعالیٰ کی طرف سے ہے۔",
                "headingEnglish": "Love is from Allah Most High",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5788,
                "hadithNumber": "6041",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"None will have the sweetness (delight) of Faith (a) till he loves a person and loves him only for Allah's sake, (b) and till it becomes dearer to him to be thrown in the fire than to revert to disbelief (Heathenism) after Allah has brought him out of it, (c) and till Allah and His Apostle become dearer to him than anything else.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کوئی شخص ایمان کی حلاوت ( مٹھاس ) اس وقت تک نہیں پا سکتا جب تک وہ کسی شخص سے محبت کرئے تو صرف اللہ کے لئے کرے اور اس کو آگ میں ڈالا جانا اچھا لگے لیکن ایمان کے بعد کفر میں جانا اسے پسند نہ ہو ، اور جب تک اللہ اور اس کے رسول سے اسے ان کے سوا دوسری تمام چیزوں کے مقابلے میں زیادہ محبت نہ ہو ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَجِدُ أَحَدٌ حَلاَوَةَ الإِيمَانِ حَتَّى يُحِبَّ الْمَرْءَ، لاَ يُحِبُّهُ إِلاَّ لِلَّهِ، وَحَتَّى أَنْ يُقْذَفَ فِي النَّارِ أَحَبُّ إِلَيْهِ مِنْ أَنْ يَرْجِعَ إِلَى الْكُفْرِ، بَعْدَ إِذْ أَنْقَذَهُ اللَّهُ، وَحَتَّى يَكُونَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا ‏\"‏‏.‏",
                "headingArabic": "الْحُبِّ فِي اللَّهِ",
                "headingUrdu": "اللہ کے لیے محبت کرنا",
                "headingEnglish": "To love for Allah's sake",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5789,
                "hadithNumber": "6042",
                "englishNarrator": "Narrated `Abdullah bin Zam`a رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) forbade laughing at a person who passes wind, and said, \"How does anyone of you beat his wife as he beats the stallion camel and then he may embrace (sleep with) her?\" And Hisham said, \"As he beats his slave\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے کسی کی ریح خارج ہونے پر ہنسنے سے منع فرمایا اور آپ نے یہ بھی فرمایا کہ تم میں سے کس طرح ایک شخص اپنی بیوی کو زور سے مارتا ہے جیسے اونٹ ، حالانکہ اس کی پوری امید ہے کہ شام میں اسے وہ گلے لگائے گا ۔ اور ثوری ، وہیب اور ابومعاویہ نے ہشام سے بیان کیا کہ ( جانور کی طرح ) کے بجائے لفظ غلام کی طرح کا استعمال کیا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے عبداللہ بن زمعہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ، قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَضْحَكَ الرَّجُلُ مِمَّا يَخْرُجُ مِنَ الأَنْفُسِ وَقَالَ ‏\"‏ بِمَ يَضْرِبُ أَحَدُكُمُ امْرَأَتَهُ ضَرْبَ الْفَحْلِ، ثُمَّ لَعَلَّهُ يُعَانِقُهَا ‏\"‏‏.‏ وَقَالَ الثَّوْرِيُّ وَوُهَيْبٌ وَأَبُو مُعَاوِيَةَ عَنْ هِشَامٍ ‏\"‏ جَلْدَ الْعَبْدِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ يَسْخَرْ قَوْمٌ مِنْ قَوْمٍ عَسَى أَنْ يَكُونُوا خَيْرًا مِنْهُمْ}}",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: {اے ایمان والو، کوئی قوم کسی دوسرے کا مذاق نہ اڑائے، شاید وہ ان سے بہتر ہوں۔",
                "headingEnglish": "Allah says: {O you who believe, let no people make fun of others, perhaps they are better than them.",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5790,
                "hadithNumber": "6043",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said at Mina, \"Do you know what day is today?\" They (the people) replied, \"Allah and His Apostle know better,\" He said \"Today is 10th of Dhul-Hijja, the sacred (forbidden) day. Do you know what town is this town?\" They (the people) replied, \"Allah and His Apostle know better.\" He said, \"This is the (forbidden) Sacred town (Mecca a sanctuary).\" And do you know which month is this month?\" They (the People) replied, \"Allah and His Apostle know better.\" He said, ''This is the Sacred (forbidden) month .\" He added, \"Allah has made your blood, your properties and your honor Sacred to one another (i.e. Muslims) like the sanctity of this day of yours in this month of yours, in this town of yours.\" (See Hadith No. 797, Vol. 2.)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ( حجۃ الوداع ) کے موقع پر منیٰ میں فرمایا تم جانتے ہو یہ کون سا دن ہے ؟ صحابہ بولے اللہ اور اس کے رسول کو زیادہ علم ہے ۔ فرمایا یہ حرمت والا دن ہے ” تم جانتے ہو یہ کون سا شہر ہے ؟ صحابہ بولے اللہ اور اس رسول کو زیادہ علم ہے ، فرمایا یہ حرمت والا شہر ہے ۔ تم جانتے ہو یہ کون سا مہینہ ہے ؟ صحابہ بولے اللہ اور اس کے رسول کو زیادہ علم ہے فرمایا یہی حرمت والا مہینہ ہے ۔ پھر فرمایا بلاشبہ اللہ نے تم پر تمہارا ( ایک دوسرے کا ) خون ، مال اور عزت اسی طرح حرام کیا ہے جیسے اس دن کواس نے تمہارے اس مہینہ میں اور تمہارے اس شہر میں حرمت والا بنایا ہے ۔",
                "urduNarrator": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہا ہم سے یزید بن ہارون نے بیان کیا ، انہوں نے کہا ہم کو عاصم بن محمد بن زید نے خبر دی ، انہوں نے کہا مجھے میرے والد اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَاصِمُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، رضى الله عنهما قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم بِمِنًى ‏\"‏ أَتَدْرُونَ أَىُّ يَوْمٍ هَذَا ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ فَإِنَّ هَذَا يَوْمٌ حَرَامٌ، أَفَتَدْرُونَ أَىُّ بَلَدٍ هَذَا ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ بَلَدٌ حَرَامٌ، أَتَدْرُونَ أَىُّ شَهْرٍ هَذَا ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ شَهْرٌ حَرَامٌ ‏\"‏‏.‏ قَالَ ‏\"‏ فَإِنَّ اللَّهَ حَرَّمَ عَلَيْكُمْ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ، كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5791,
                "hadithNumber": "6044",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Abusing a Muslim is Fusuq (i.e., an evil-doing), and killing him is Kufr (disbelief).Ghundar has also reported from Shobah likewise.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مسلمان کو گالی دینا گناہ ہے اور اس کو قتل کرنا کفر ہے ۔ غندر نے شعبہ سے روایت کرنے میں سلیمان کی متابعت کی ہے ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے منصور نے بیان کیا ، کہا میں نے ابووائل سے سنا اور وہ عبداللہ بن مسعود رضی اللہ عنہما سے بیان کرتے تھے کہ انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ سِبَابُ الْمُسْلِمِ فُسُوقٌ، وَقِتَالُهُ كُفْرٌ ‏\"‏‏.‏ تَابَعَهُ غُنْدَرٌ عَنْ شُعْبَةَ‏.‏",
                "headingArabic": "مَا يُنْهَى مِنَ السِّبَابِ وَاللَّعْنِ",
                "headingUrdu": "برے ناموں سے پکارنا اور لعنت ملامت کرنا",
                "headingEnglish": "Calling bad names and cursing",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5792,
                "hadithNumber": "6045",
                "englishNarrator": "Narrated Abu Dhar رضی اللہ عنہ :",
                "hadithEnglish": "He heard the Prophet (ﷺ) saying, \"If somebody accuses another of Fusuq (by calling him 'Fasiq' i.e. a wicked person) or accuses him of Kufr, such an accusation will revert to him (i.e. the accuser) if his companion (the accused) is innocent.\"",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر کوئی شخص کسی شخص کو کافر یا فاسق کہے اور وہ درحقیقت کافر یا فاسق نہ ہو تو خود کہنے والا فاسق اورکافر ہو جائے گا ۔",
                "urduNarrator": "ہم سے ابو معمر عبداللہ بن عمرو نے بیان کیا ، انہوں نے کہا ہم سے عبدالوارث نے بیان کیا ، ان سے حسین بن ذکوان معلم نے بیان کیا ، ان سے عبداللہ بن بریدہ نے بیان کیا ، انہوں نے کہا مجھ سے یحییٰ بن یعمر نے بیان کیا ، ان سے ابوالاسود دیلی نے بیان کیا اور ان سے حضرت ابوذر غفاری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْحُسَيْنِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، حَدَّثَنِي يَحْيَى بْنُ يَعْمَرَ، أَنَّ أَبَا الأَسْوَدِ الدِّيلِيَّ، حَدَّثَهُ عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يَرْمِي رَجُلٌ رَجُلاً بِالْفُسُوقِ، وَلاَ يَرْمِيهِ بِالْكُفْرِ، إِلاَّ ارْتَدَّتْ عَلَيْهِ، إِنْ لَمْ يَكُنْ صَاحِبُهُ كَذَلِكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5793,
                "hadithNumber": "6046",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) was neither a Fahish (one who had a bad tongue) nor a Sabbaba (one who abuses others) and he used to say while admonishing somebody, \"What is wrong with him? May dust be on his forehead!\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم فحش گو نہیں تھے ، نہ آپ لعنت ملامت کرنے والے تھے اور نہ گالی دیتے تھے ، آپ کو بہت غصہ آتا تو صرف اتنا کہہ دیتے ، اسے کیا ہو گیا ہے ، اس کی پیشانی پہ خاک لگے ۔",
                "urduNarrator": "ہم سے محمد بن سنان نے بیان کیا ، کہا ہم سے فلیح بن سلیمان نے بیان کیا کہا ہم سے ہلال بن علی نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، حَدَّثَنَا هِلاَلُ بْنُ عَلِيٍّ، عَنْ أَنَسٍ، قَالَ لَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاحِشًا وَلاَ لَعَّانًا وَلاَ سَبَّابًا، كَانَ يَقُولُ عِنْدَ الْمَعْتَبَةِ ‏ \"‏ مَا لَهُ، تَرِبَ جَبِينُهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5794,
                "hadithNumber": "6047",
                "englishNarrator": "Narrated Thabit bin Ad-Dahhak رضی اللہ عنہ :",
                "hadithEnglish": "(who was one of the companions who gave the pledge of allegiance to the Prophet (ﷺ) underneath the tree (Al-Hudaibiya)) Allah's Messenger (ﷺ) said, \"Whoever swears by a religion other than Islam (i.e. if somebody swears by saying that he is a non-Muslim e.g., a Jew or a Christian, etc.) in case he is telling a lie, he is really so if his oath is false, and a person is not bound to fulfill a vow about a thing which he does not possess. And if somebody commits suicide with anything in this world, he will be tortured with that very thing on the Day of Resurrection; And if somebody curses a believer, then his sin will be as if he murdered him; And whoever accuses a believer of Kufr (disbelief), then it is as if he killed him.\"",
                "hadithUrdu": "(وہ ان صحابیوں میں سے تھے جنہوں نے درخت (الحدیبیہ) کے نیچے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی تھی) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو اسلام کے سوا کسی اور مذہب پر قسم کھائے ( کہ اگر میں نے فلاں کام کیا تو میں نصرانی ہوں ، یہودی ہوں ) تو وہ ایسا ہو جائے گا جیسے کہ اس نے کہا اور کسی انسان پر ان چیزوں کی نذر صحیح نہیں ہوتی جو اس کے اختیار میں نہ ہوں اور جس نے دنیا میں کسی چیز سے خودکشی کر لی اسے اسی چیز سے آخرت میں عذاب ہو گا اور جس نے کسی مسلمان پر لعنت بھیجی تو یہ اس کے خون کرنے کے برابر ہے اور جو شخص کسی مسلمان کو کافر کہے تو وہ ایسا ہے جیسے اس کا خون کیا ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے عثمان بن عمر نے ، کہا ہم سے علی بن مبارک نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے ، ان سے ابوقلابہ نے کہ ثابت بن ضحاک رضی اللہ عنہ اصحاب شجر ( بیعت رضوان کرنے والوں ) میں سے تھے ، انہوں نے ان سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي قِلاَبَةَ، أَنَّ ثَابِتَ بْنَ الضَّحَّاكِ، وَكَانَ، مِنْ أَصْحَابِ الشَّجَرَةِ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ حَلَفَ عَلَى مِلَّةٍ غَيْرِ الإِسْلاَمِ فَهْوَ كَمَا قَالَ، وَلَيْسَ عَلَى ابْنِ آدَمَ نَذْرٌ فِيمَا لاَ يَمْلِكُ، وَمَنْ قَتَلَ نَفْسَهُ بِشَىْءٍ فِي الدُّنْيَا عُذِّبَ بِهِ يَوْمَ الْقِيَامَةِ، وَمَنْ لَعَنَ مُؤْمِنًا فَهْوَ كَقَتْلِهِ، وَمَنْ قَذَفَ مُؤْمِنًا بِكُفْرٍ فَهْوَ كَقَتْلِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5795,
                "hadithNumber": "6048",
                "englishNarrator": "Narrated Sulaiman bin Surad:",
                "hadithEnglish": "A man from the companions of the Prophet (ﷺ) said, \"Two men abused each other in front of the Prophet (ﷺ) and one of them became angry and his anger became so intense that his face became swollen and changed. The Prophet (ﷺ) said, \"I know a word the saying of which will cause him to relax if he does say it.\" Then a man went to him and informed him of the statement of the Prophet (ﷺ) and said, \"Seek refuge with Allah from Satan.\" On that, angry man said, 'Do you find anything wrong with me? Am I insane? Go away!\"",
                "hadithUrdu": "حضور اکرم صلی اللہ علیہ وسلم کے سامنے دو آدمیوں نے آپس میں گالی گلوچ کی ایک صاحب کو غصہ آ گیا اور بہت زیادہ آیا ، ان کا چہرہ پھول گیا اوررنگ بدل دیا گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس وقت فرمایا کہ مجھے ایک کلمہ معلوم ہے کہ اگر ( غصہ کرنے والا شخص ) اسے کہہ لے تو اس کا غصہ دور ہو جائے گا ۔ چنانچہ ایک صاحب نے جا کر غصہ ہونے والے کو آنحضرت صلی اللہ علیہ وسلم کا ارشاد سنایا اور کہا شیطان سے اللہ کی پناہ مانگ وہ کہنے لگا کیا تم مجھ کو روگی سمجھتے ہو یا دیوانہ ؟ جا اپنا راستہ لے ۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا کہ مجھ سے عدی بن ثابت نے بیان کیا کہ میں نے سلیمان بن صرد سے سنا وہ نبی کریم صلی اللہ علیہ وسلم کے صحابی ہیں ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي عَدِيُّ بْنُ ثَابِتٍ، قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ صُرَدٍ، رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ اسْتَبَّ رَجُلاَنِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَغَضِبَ أَحَدُهُمَا، فَاشْتَدَّ غَضَبُهُ حَتَّى انْتَفَخَ وَجْهُهُ وَتَغَيَّرَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنِّي لأَعْلَمُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ عَنْهُ الَّذِي يَجِدُ ‏\"‏‏.‏ فَانْطَلَقَ إِلَيْهِ الرَّجُلُ فَأَخْبَرَهُ بِقَوْلِ النَّبِيِّ صلى الله عليه وسلم وَقَالَ تَعَوَّذْ بِاللَّهِ مِنَ الشَّيْطَانِ‏.‏ فَقَالَ أَتُرَى بِي بَأْسٌ أَمَجْنُونٌ أَنَا اذْهَبْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5796,
                "hadithNumber": "6049",
                "englishNarrator": "Narrated 'Ubada bin As-Samit رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) went out to inform the people about the (date of the Night of decree (Al-Qadr). There happened a quarrel between two Muslim men. The Prophet (ﷺ) said, \"I came out to inform you about the Night of Al-Qadr, but as so-and-so and so-and-so quarrelled, so the news about it had been taken away; and may be it was better for you. So look for it in the ninth, the seventh, or the fifth (of the last ten days of Ramadan).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم لوگوں کو لیلۃالقدر کی بشارت دینے کے لئے حجرے سے باہر تشریف لائے ، لیکن مسلمانوں کے دو آدمی اس وقت آپس میں کسی بات پر لڑنے لگے ۔ آپ نے فرمایا کہ میں تمہیں ( لیلۃالقدر کے متعلق ) بتانے کے لئے نکلا تھا لیکن فلاں فلاں آپس میں لڑنے لگے اور ( میرے علم سے ) وہ اٹھالی گئی ۔ ممکن ہے کہ یہی تمہارے لئے اچھا ہو ۔ اب تم اسے 29 رمضان اور 27 رمضان اور 25 رمضان کی راتوں میں تلاش کرو ۔",
                "urduNarrator": "ہم سے مسددنے بیان کیا ، کہا ہم سے بشر بن مفضل نے بیان کیا ، ان سے حمید نے بیان کیا ، ان سے انس رضی اللہ عنہ نے بیان کیا کہ مجھ سے عبادہ بن صامت رضی اللہ عنہ نے کہا ،",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ حُمَيْدٍ، قَالَ قَالَ أَنَسٌ حَدَّثَنِي عُبَادَةُ بْنُ الصَّامِتِ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيُخْبِرَ النَّاسَ بِلَيْلَةِ الْقَدْرِ، فَتَلاَحَى رَجُلاَنِ مِنَ الْمُسْلِمِينَ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ خَرَجْتُ لأُخْبِرَكُمْ، فَتَلاَحَى فُلاَنٌ وَفُلاَنٌ وَإِنَّهَا رُفِعَتْ، وَعَسَى أَنْ يَكُونَ خَيْرًا لَكُمْ، فَالْتَمِسُوهَا فِي التَّاسِعَةِ وَالسَّابِعَةِ وَالْخَامِسَةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5797,
                "hadithNumber": "6050",
                "englishNarrator": "Narrated Ma'rur:",
                "hadithEnglish": "I saw Abu Dhar رضی اللہ عنہ wearing a Burd (garment) and his slave too was wearing a Burd, so I said (to Abu Dhar), \"If you take this (Burda of your slave) and wear it (along with yours), you will have a nice suit (costume) and you may give him another garment.\" Abu Dhar رضی اللہ عنہ said, \"There was a quarrel between me and another man whose mother was a non-Arab and I called her bad names. The man mentioned (complained about) me to the Prophet. The Prophet (ﷺ) said, \"Did you abuse so-and-so?\" I said, \"Yes\" He said, \"Did you call his mother bad names?\" I said, \"Yes\". He said, \"You still have the traits of (the Pre-lslamic period of) ignorance.\" I said. \"(Do I still have ignorance) even now in my old age?\" He said, \"Yes, they (slaves or servants) are your brothers, and Allah has put them under your command. So the one under whose hand Allah has put his brother, should feed him of what he eats, and give him dresses of what he wears, and should not ask him to do a thing beyond his capacity. And if at all he asks him to do a hard task, he should help him therein.\"",
                "hadithUrdu": "میں نے ابوذر رضی اللہ عنہ کے جسم پر ایک چادر دیکھی اور ان کے غلام کے جسم پر بھی ایک ویسی ہی چادر تھی ، میں نے عرض کیا اگر اپنے غلام کی چادر لے لیں اور اسے بھی پہن لیں تو ایک رنگ کا جوڑا ہو جائے غلام کو دوسرا کپڑا دے دیں ۔ حضرت ابوذر رضی اللہ عنہ نے اس پر کہا کہ مجھ میں اور ایک صاحب ( بلال رضی اللہ عنہ ) میں تکرار ہو گئی تھی تو ان کی ماں عجمی تھیں ، میں نے اس بارے میں ان کو طعنہ دے دیا انہوں نے جا کر یہ بات نبی کریم صلی اللہ علیہ وسلم سے کہہ دی ۔ آنحضرت صلی اللہ علیہ وسلم نے مجھ سے دریافت فرمایا کیا تم نے اس سے جھگڑا کیا ہے ؟ میں نے عرض کیا جی ہاں ۔ دریافت کی تم نے اسے اس کی ماں کی وجہ سے طعنہ دیا ہے ؟ میں نے عرض کیا جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے اندر ابھی جاہلیت کی بو باقی ہے ۔ میں نے عرض کیا یا رسول اللہ ! اس بڑھاپے میں بھی ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں یاد رکھو یہ ( غلام بھی ) تمہارے بھائی ہیں ، اللہ تعالیٰ نے انہیں تمہاری ما تحتیٰ میں دیا ہے ، پس اللہ تعالیٰ جس کی ما تحتیٰ میں بھی اس کے بھائی کو رکھے اسے چاہئے کہ جو وہ کھائے اسے بھی کھلائے اور جو وہ پہنے اسے بھی پہنائے اور اسے ایسا کام کرنے کے لیے نہ کہے ، جو اس کے بس میں نہ ہو اگر اسے کوئی ایسا کام کرنے کے لئے کہنا ہی پڑے تو اس کام میں اس کی مدد کرے ۔",
                "urduNarrator": "مجھ سے عمر بن حفص بن غیاث نے بیان کیا ، کہا مجھ سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، ان سے معرور نے اور ان سے حضرت ابوذر رضی اللہ عنہ نے ، معرور نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنِ الْمَعْرُورِ، عَنْ أَبِي ذَرٍّ، قَالَ رَأَيْتُ عَلَيْهِ بُرْدًا وَعَلَى غُلاَمِهِ بُرْدًا فَقُلْتُ لَوْ أَخَذْتَ هَذَا فَلَبِسْتَهُ كَانَتْ حُلَّةً، وَأَعْطَيْتَهُ ثَوْبًا آخَرَ‏.‏ فَقَالَ كَانَ بَيْنِي وَبَيْنَ رَجُلٍ كَلاَمٌ، وَكَانَتْ أُمُّهُ أَعْجَمِيَّةً، فَنِلْتُ مِنْهَا فَذَكَرَنِي إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ لِي ‏\"‏ أَسَابَبْتَ فُلاَنًا ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ أَفَنِلْتَ مِنْ أُمِّهِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ إِنَّكَ امْرُؤٌ فِيكَ جَاهِلِيَّةٌ ‏\"‏‏.‏ قُلْتُ عَلَى حِينِ سَاعَتِي هَذِهِ مِنْ كِبَرِ السِّنِّ قَالَ ‏\"‏ نَعَمْ، هُمْ إِخْوَانُكُمْ، جَعَلَهُمُ اللَّهُ تَحْتَ أَيْدِيكُمْ، فَمَنْ جَعَلَ اللَّهُ أَخَاهُ تَحْتَ يَدِهِ فَلْيُطْعِمْهُ مِمَّا يَأْكُلُ، وَلْيُلْبِسْهُ مِمَّا يَلْبَسُ، وَلاَ يُكَلِّفُهُ مِنَ الْعَمَلِ مَا يَغْلِبُهُ، فَإِنْ كَلَّفَهُ مَا يَغْلِبُهُ فَلْيُعِنْهُ عَلَيْهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5798,
                "hadithNumber": "6051",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) led us in the Zuhr prayer, offering only two rak`at and then (finished it) with Taslim, and went to a piece of wood in front of the mosque and put his hand over it. Abu Bakr and `Umar were also present among the people on that day but dared not talk to him (about his unfinished prayer). And the hasty people went away, wondering. \"Has the prayer been shortened\" Among the people there was a man whom the Prophet (ﷺ) used to call Dhul-Yadain (the longarmed). He said, \"O Allah's Prophet! Have you forgotten or has the prayer been shortened?\" The Prophet (ﷺ) said, \"Neither have I forgotten, nor has it been shortened.\" They (the people) said, \"Surely, you have forgotten, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said, Dhul-Yadain has told the truth.\" So the Prophet (ﷺ) got up and offered other two rak`at and finished his prayer with Taslim. Then he said Takbir, performed a prostration of ordinary duration or longer, then he raised his head and said Takbir and performed another prostration of ordinary duration or longer and then raised his head and said Takbir (i.e. he performed the two prostrations of Sahu, i.e., forgetfulness).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ہمیں ظہر کی نماز دو رکعت پڑھائی اور سلام پھیر دیا اس کے بعد آپ مسجد کے آگے کے حصہ یعنی دالان میں ایک لکڑی پر سہارا لے کر کھڑے ہو گئے اور اس پر اپنا ہاتھ رکھا ، حاضرین میں حضرت ابوبکر اور عمر بھی موجود تھے مگر آپ کے دبدبے کی وجہ سے کچھ بول نہ سکے اور جلد باز لوگ مسجد سے باہر نکل گئے آپس میں صحابہ نے کہا کہ شاید نماز میں رکعات کم ہو گئیں ہیں اسی لیے آنحضرت صلی اللہ علیہ وسلم نے ظہر کی نماز چار کے بجائے صرف دو ہی رکعات پڑھائیں ہیں ۔ حاضرین میں ایک صحابی تھے جنہیں آپ ” ذوالیدین “ ( لمبے ہاتھوںوالا ) کہہ کر مخاطب فرمایا کرتے تھے ، انہوں نے عرض کیا اے اللہ کے نبی ! نماز کی رکعات کم ہو گئیں ہیں یا آپ بھول گئے ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، نہ میں بھولا ہوں اور نہ نماز کی رکعات کم ہوئیں ہیں ۔ صحابہ نے عرض کیا نہیں یا رسول اللہ ! آپ بھول گئے ہیں ، چنانچہ آپ نے یاد کر کے فرمایا کہ ذوالیدین نے صحیح کہا ہے ۔ پھر آپ کھڑے ہوئے اور دو رکعات اور پڑھائیں پھر سلام پھیرا اور تکبیر کہہ کر سجدہ ( سہو ) میں گئے ، نماز کے سجدہ کی طرح بلکہ اس سے بھی زیادہ لمبا سجدہ کیا پھر سر اٹھایا اور تکبیر کہہ کر پھر سجدہ میں گئے پہلے سجدہ کی طرح یا اس سے بھی لمبا ۔ پھر سر اٹھایا اور تکبیر کہی ۔",
                "urduNarrator": "ہم سے حفص بن عمر حوضی نے بیان کیا ، کہا ہم سے یزید بن ابراہیم نے بیان کیا ، کہا ہم سے محمد بن سیرین نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا مُحَمَّدٌ، عَنْ أَبِي هُرَيْرَةَ، صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم الظُّهْرَ رَكْعَتَيْنِ، ثُمَّ سَلَّمَ، ثُمَّ قَامَ إِلَى خَشَبَةٍ فِي مُقَدَّمِ الْمَسْجِدِ، وَوَضَعَ يَدَهُ عَلَيْهَا، وَفِي الْقَوْمِ يَوْمَئِذٍ أَبُو بَكْرٍ وَعُمَرُ، فَهَابَا أَنْ يُكَلِّمَاهُ، وَخَرَجَ سَرَعَانُ النَّاسِ فَقَالُوا قَصُرَتِ الصَّلاَةُ‏.‏ وَفِي الْقَوْمِ رَجُلٌ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدْعُوهُ ذَا الْيَدَيْنِ فَقَالَ يَا نَبِيَّ اللَّهِ أَنَسِيتَ أَمْ قَصُرَتْ‏.‏ فَقَالَ ‏\"‏ لَمْ أَنْسَ وَلَمْ تَقْصُرْ ‏\"‏‏.‏ قَالُوا بَلْ نَسِيتَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ صَدَقَ ذُو الْيَدَيْنِ ‏\"‏‏.‏ فَقَامَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ سَلَّمَ، ثُمَّ كَبَّرَ، فَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ، ثُمَّ رَفَعَ رَأْسَهُ وَكَبَّرَ، ثُمَّ وَضَعَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ، ثُمَّ رَفَعَ رَأْسَهُ وَكَبَّرَ‏.‏",
                "headingArabic": "مَا يَجُوزُ مِنْ ذِكْرِ النَّاسِ نَحْوَ قَوْلِهِمُ الطَّوِيلُ وَالْقَصِيرُ",
                "headingUrdu": "کسی کو لمبا یا چھوٹا بیان کرنا",
                "headingEnglish": "Describing somebody as tall or short",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5799,
                "hadithNumber": "6052",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) passed by two graves and said, \"Both of them (persons in the grave) are being tortured, and they are not being tortured for a major sin. This one used not to save himself from being soiled with his urine, and the other used to go about with calumnies (among the people to rouse hostilities, e.g., one goes to a person and tells him that so-and-so says about him such-and-such evil things). The Prophet (ﷺ) then asked for a green leaf of a date-palm tree, split it into two pieces and planted one on each grave and said, \"It is hoped that their punishment may be abated till those two pieces of the leaf get dried.\" (See Hadith No 215, Vol 1).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم دو قبروں کے پاس سے گزرے اور فرمایا کہ ان دونوں مردوں کو عذاب ہو رہا ہے اور یہ کسی بڑے گناہ کی وجہ سے عذاب میں گرفتار نہیں ہیں بلکہ یہ ( ایک قبر کا مردہ ) اپنے پیشاب کی چھینٹوں سے نہیں بچتا تھا ( یا پیشاب کرتے وقت پردہ نہیں کرتا تھا ) اور یہ ( دوسری قبر والا مردہ ) چغل خور تھا ، پھر آپ نے ایک ہری شاخ منگائی اور اسے دو ٹکڑوں میں توڑ کر دونوں قبروں پر گاڑ دیا اس کے بعد فرمایا کہ جب تک یہ شاخیں سوکھ نہ جائیں اس وقت تک شاید ان دونوں کا عذاب ہلکا رہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن موسیٰ بلخی نے بیان کیا ، کہا ہم سے وکیع نے بیان کیا ، ان سے اعمش نے بیان کیا ، انہوں نے مجاہد سے سنا ، وہ طاؤس سے بیان کرتے تھے اور وہ حضرت ابن عباس رضی اللہ عنہما سے ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ مُجَاهِدًا، يُحَدِّثُ عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى قَبْرَيْنِ فَقَالَ ‏\"‏ إِنَّهُمَا لَيُعَذَّبَانِ، وَمَا يُعَذَّبَانِ فِي كَبِيرٍ، أَمَّا هَذَا فَكَانَ لاَ يَسْتَتِرُ مِنْ بَوْلِهِ، وَأَمَّا هَذَا فَكَانَ يَمْشِي بِالنَّمِيمَةِ ‏\"‏‏.‏ ثُمَّ دَعَا بِعَسِيبٍ رَطْبٍ، فَشَقَّهُ بِاثْنَيْنِ، فَغَرَسَ عَلَى هَذَا وَاحِدًا وَعَلَى هَذَا وَاحِدًا ثُمَّ قَالَ ‏\"‏ لَعَلَّهُ يُخَفَّفُ عَنْهُمَا، مَا لَمْ يَيْبَسَا ‏\"‏‏.‏",
                "headingArabic": "الْغِيبَةِ",
                "headingUrdu": "غیبت کرنا",
                "headingEnglish": "Backbiting",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5800,
                "hadithNumber": "6053",
                "englishNarrator": "Narrated Abu Usaid As-Sa`idi رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The best family among the Ansar is the Banu An-Najjar. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، قبیلہ انصار میں سب سے بہتر گھرانہ بنو نجار کا گھرانہ ہے ۔",
                "urduNarrator": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابوالزناد نے ، ان سے ابوسلمہ نے اور ان سے حضرت ابواسید ساعدی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي أُسَيْدٍ السَّاعِدِيِّ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ خَيْرُ دُورِ الأَنْصَارِ بَنُو النَّجَّارِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ خَيْرُ دُورِ الأَنْصَارِ ‏\"‏",
                "headingUrdu": "\"انصار میں سب سے بہترین خاندان\"",
                "headingEnglish": "\"The best family among the Ansar\"",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5801,
                "hadithNumber": "6054",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "A man asked permission to enter upon Allah's Messenger (ﷺ). The Prophet (ﷺ) said, \"Admit him. What an evil brother of his people or a son of his people.\" But when the man entered, the Prophet (ﷺ) spoke to him in a very polite manner. (And when that person left) I said, \"O Allah's Messenger (ﷺ)! You had said what you had said, yet you spoke to him in a very polite manner?\" The Prophet (ﷺ) said, \"O `Aisha! The worst people are those whom the people desert or leave in order to save themselves from their dirty language or from their transgression.\"",
                "hadithUrdu": "ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے اندر آنے کی اجازت چاہی تو آپ نے فرمایا کہ اسے اجازت دے دو ، فلاں قبیلہ کا یہ برا آدمی ہے جب وہ شخص اندر آیا تو آپ نے اس کے ساتھ بڑی نرمی سے گفتگو کی ، میں نے عرض کیا یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! آپ کو اس کے متعلق جو کچھ کہنا تھا وہ ارشاد فرمایا اور پھر اس کے ساتھ نرم گفتگو کی ۔ آپ نے فرمایا ، عائشہ ! وہ بدترین آدمی ہے جسے اس کی بدکلامی کے ڈر سے لوگ چھوڑ دیں ۔",
                "urduNarrator": "ہم سے صدقہ بن فضل نے بیان کیا ، انہوں نے کہا ہم کو سفیان بن عیینہ نے خبر دی ، انہوں نے محمد بن منکدر سے سنا ، انہوں نے عروہ بن زبیر سے سنا اور انہیں ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے خبر دی ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، سَمِعْتُ ابْنَ الْمُنْكَدِرِ، سَمِعَ عُرْوَةَ بْنَ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ قَالَتِ، اسْتَأْذَنَ رَجُلٌ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ ائْذَنُوا لَهُ بِئْسَ، أَخُو الْعَشِيرَةِ أَوِ ابْنُ الْعَشِيرَةِ ‏\"‏‏.‏ فَلَمَّا دَخَلَ أَلاَنَ لَهُ الْكَلاَمَ قُلْتُ يَا رَسُولَ اللَّهِ قُلْتَ الَّذِي قُلْتَ، ثُمَّ أَلَنْتَ لَهُ الْكَلاَمَ قَالَ ‏\"‏ أَىْ عَائِشَةُ، إِنَّ شَرَّ النَّاسِ مَنْ تَرَكَهُ النَّاسُ ـ أَوْ وَدَعَهُ النَّاسُ ـ اتِّقَاءَ فُحْشِهِ ‏\"‏‏.‏",
                "headingArabic": "مَا يَجُوزُ مِنِ اغْتِيَابِ أَهْلِ الْفَسَادِ وَالرِّيَبِ",
                "headingUrdu": "غیبت کرنے والے، بدکار اور مشکوک لوگ",
                "headingEnglish": "Backbitings, wicked and suspicious people",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5802,
                "hadithNumber": "6055",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Once the Prophet (ﷺ) went through the grave-yards of Medina and heard the voices of two humans who were being tortured in their graves. The Prophet (ﷺ) said, \"They are being punished, but they are not being punished because of a major sin, yet their sins are great. One of them used not to save himself from (being soiled with) the urine, and the other used to go about with calumnies (Namima).\" Then the Prophet asked for a green palm tree leaf and split it into two pieces and placed one piece on each grave, saying, \"I hope that their punishment may be abated as long as these pieces of the leaf are not dried.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم مدینہ منورہ کے کسی باغ سے تشریف لائے تو آپ نے دو ( مردہ ) انسانوں کی آواز سنی جنہیں ان کی قبر وں میں عذاب دیا جا رہا تھا پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا انہیں عذاب ہو رہا ہے اور کسی بڑے گناہ کی وجہ سے انہیں عذاب نہیں ہو رہا ہے ۔ ان میں سے ایک شخص پیشاب کے چھینٹوں سے نہیں بچتا تھا اور دوسرا چغل خور تھا ۔ پھر آپ نے کھجور کی ایک ہری شاخ منگوائی اور اسے دو حصوں میں توڑ ا اور ایک ٹکڑا ایک کی قبر پر اور دوسرا دوسرے کی قبر پر گاڑ دیا ۔ پھر فرمایا شاید کہ ان کے عذاب میں اس وقت تک کے لیے کمی کر دی جائے ، جب تک یہ سوکھ نہ جائیں ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو عبیدہ بن عبدالرحمٰن نے خبر دی ، انہیں منصور بن معمر نے ، انہیں مجاہد نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا عَبِيدَةُ بْنُ حُمَيْدٍ أَبُو عَبْدِ الرَّحْمَنِ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم مِنْ بَعْضِ حِيطَانِ الْمَدِينَةِ، فَسَمِعَ صَوْتَ إِنْسَانَيْنِ يُعَذَّبَانِ فِي قُبُورِهِمَا فَقَالَ ‏\"‏ يُعَذَّبَانِ، وَمَا يُعَذَّبَانِ فِي كَبِيرَةٍ، وَإِنَّهُ لَكَبِيرٌ، كَانَ أَحَدُهُمَا لاَ يَسْتَتِرُ مِنَ الْبَوْلِ، وَكَانَ الآخَرُ يَمْشِي بِالنَّمِيمَةِ ‏\"‏‏.‏ ثُمَّ دَعَا بِجَرِيدَةٍ فَكَسَرَهَا بِكِسْرَتَيْنِ أَوْ ثِنْتَيْنِ، فَجَعَلَ كِسْرَةً فِي قَبْرِ هَذَا، وَكِسْرَةً فِي قَبْرِ هَذَا، فَقَالَ ‏\"‏ لَعَلَّهُ يُخَفَّفُ عَنْهُمَا مَا لَمْ يَيْبَسَا ‏\"‏‏.‏",
                "headingArabic": "النَّمِيمَةُ مِنَ الْكَبَائِرِ",
                "headingUrdu": "گناہ کبیرہ میں سے ہے۔",
                "headingEnglish": "An_namima is one of the great sins",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5776,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=231",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=229",
                "label": "229",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=230",
                "label": "230",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=231",
                "label": "231",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=232",
                "label": "232",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=233",
                "label": "233",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=234",
                "label": "234",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=235",
                "label": "235",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=233",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=233",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=231",
        "to": 5800,
        "total": 40465
    }
}