{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 181,
        "data": [
            {
                "id": 4503,
                "hadithNumber": "4724",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "One night Allah's Messenger (ﷺ) came to him and Fatima رضی اللہ عنہا and said, \"Don't you (both offer the (Tahajjud) prayer? \"رجما بالغيب‏'' : without seeing, guessing at random. ''فُرُطًا‏'' : in regret. ''سُرَادِقُهَا‏'' : all surrounding like the tents. ''يُحَاوِرُهُ‏'' derived from ''الْمُحَاوَرَةِ '' 0 '' هُوَ اللَّهُ رَبِّي'' .  i.e. Only Allah is my Lord. Here ''ء'' has been omitted and one ''ن'' has been merged into the other. ''زَلَقًا‏'': slipprey place. ''‏هُنَالِكَ الْوَلاَيَةُ‏'' Its infinitive is ''الْوَلِيِّ‏'' means heir. ''‏   ''عُقْبَى'' , ''عُقْبَةٌ'' , ''عُقُبًا‏and ''عَاقِبَةٌ'' are synonyms, all mean hereafter.  ''قِبَلاً'' , ''قُبُلاً'' , ''قَبَلاً'' (can be read in all three ways) mean: To appear before someone. ''ليدحضوا‏'' so as to lead  astray. ''الدَّحْضُ '' means to lead astray.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم رات کے وقت ان کے اور فاطمہ رضی اللہ عنہا کے گھر آئے اور فرمایا۔ تم لوگ تہجد کی نماز نہیں پڑھتے ( آخر حدیث تک ) ۔ «رجما بالغيب‏» یعنی سنی سنائی اور ان کو خود کچھ علم نہیں۔ «فرطا‏» ندامت، شرمندگی۔ «سرادقها‏» یعنی قناتوں کی طرح سب طرف سے ان کو آگ گھیر لے گی جیسے کوٹھری کو سب طرف سے خیمے گھیر لیتے ہیں۔ «يحاوره‏»،‏‏‏‏ «محاورة» سے نکلا ہے یعنی گفتگو کرنا، تکرار کرنا۔ «لكنا هو الله ربي‏» اصل میں «لكن أنا هو الله ربي» تھا «أنا» کا ہمزہ حذف کر کے نون کو نون میں ادغام کر دیا «لكنا» ہو گیا۔ «خلالهما نهرا» یعنی «بينهما» ان کے بیچ میں۔ «زلقا» چکنا، صاف جس پر پاؤں پھسلے ( جمے نہیں ) ۔ «هنالك الولاية‏»،‏‏‏‏ «ولايت‏»،‏‏‏‏ «ولي» کا مصدر ہے۔ «عقبا‏»،‏‏‏‏ «عاقبت» اسی طرح «عقبى» اور «عقبة» سب کا ایک ہی معنی ہے یعنی آخرت۔ «قبلا» اور «قبلا» اور «قبلا» ( تینوں طرح پڑھا ہے ) یعنی سامنے آنا۔ «ليدحضوا‏»،‏‏‏‏ «دحض» سے نکلا ہے یعنی پھسلانا ( مطلب یہ ہے کہ حق بات کو ناحق کریں ) ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا، کہا ہم سے یعقوب بن ابراہیم بن سعد نے بیان کیا، کہا ہم سے میرے والد نے بیان کیا، ان سے صالح نے، ان سے ابن شہاب نے، کہا مجھے علی بن حسین نے خبر دی، انہیں حسین بن علی رضی اللہ عنہما نے خبر دی اور انہیں علی رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ حُسَيْنَ بْنَ عَلِيٍّ، أَخْبَرَهُ عَنْ عَلِيٍّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَرَقَهُ وَفَاطِمَةَ قَالَ ‏\"‏ أَلاَ تُصَلِّيَانِ ‏\"‏‏.‏ ‏{‏رَجْمًا بِالْغَيْبِ‏}‏ لَمْ يَسْتَبِنْ‏.‏ ‏{‏فُرُطًا‏}‏ نَدَمًا ‏{‏سُرَادِقُهَا‏}‏ مِثْلُ السُّرَادِقِ، وَالْحُجْرَةِ الَّتِي تُطِيفُ بِالْفَسَاطِيطِ، ‏{‏يُحَاوِرُهُ‏}‏ مِنَ الْمُحَاوَرَةِ ‏{‏لَكِنَّا هُوَ اللَّهُ رَبِّي‏}‏ أَىْ لَكِنْ أَنَا هُوَ اللَّهُ رَبِّي ثُمَّ حَذَفَ الأَلِفَ وَأَدْغَمَ إِحْدَى النُّونَيْنِ فِي الأُخْرَى‏.‏ ‏{‏زَلَقًا‏}‏ لاَ يَثْبُتُ فِيهِ قَدَمٌ‏.‏ ‏{‏هُنَالِكَ الْوَلاَيَةُ‏}‏ مَصْدَرُ الْوَلِيِّ‏.‏ ‏{‏عُقُبًا‏}‏ عَاقِبَةٌ وَعُقْبَى وَعُقْبَةٌ وَاحِدٌ وَهْىَ الآخِرَةُ قِبَلاً وَقُبُلاً وَقَبَلاً اسْتِئْنَافًا ‏{‏لِيُدْحِضُوا‏}‏ لِيُزِيلُوا، الدَّحْضُ الزَّلَقُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4504,
                "hadithNumber": "4725",
                "englishNarrator": "Narrated Sa`id bin Jubair:",
                "hadithEnglish": "I said to Ibn `Abbas رضی اللہ عنہما , \"Nauf Al-Bikali claims that Moses, the companion of Al-Khadir was not the Moses of the children of Israel\" Ibn `Abbas رضی اللہ عنہما said, \"The enemy of Allah (Nauf) told a lie.\" Narrated Ubai bin Ka`b that he heard Allah's Messenger (ﷺ) saying, \"Moses got up to deliver a speech before the children of Israel and he was asked, Who is the most learned person among the people?' Moses replied, 'I (am the most learned).' Allah admonished him for he did not ascribe knowledge to Allah alone. So Allah revealed to him: 'At the junction of the two seas there is a slave of Ours who is more learned than you.' Moses asked, 'O my Lord, how can I meet him?' Allah said, 'Take a fish and put it in a basket (and set out), and where you, will lose the fish, you will find him.' So Moses (took a fish and put it in a basket and) set out, along with his boy-servant Yusha` bin Noon, till they reached a rock (on which) they both lay their heads and slept. The fish moved vigorously in the basket and got out of it and fell into the sea and there it took its way through the sea (straight) as in a tunnel). (18.61) Allah stopped the current of water on both sides of the way created by the fish, and so that way was like a tunnel. When Moses got up, his companion forgot to tell him about the fish, and so they carried on their journey during the rest of the day and the whole night. The next morning Moses asked his boy-servant 'Bring us our early meal; no doubt, we have suffered much fatigue in this journey of ours.' (18.62) Moses did not get tired till he had passed the place which Allah had ordered him to seek after. His boy-servant then said to him,' 'Do you remember when we be-took ourselves to the rock I indeed forgot the fish, none but Satan made me forget to remember it. It took its course into the sea in a marvelous way.' (18.63) There was a tunnel for the fish and for Moses and his boy-servant there was astonishment. Moses said, 'That is what we have been seeking'. So they went back retracing their footsteps. (18.64) They both returned, retracing their steps till they reached the rock. Behold ! There they found a man covered with a garment. Moses greeted him. Al-Khadir said astonishingly. 'Is there such a greeting in your land?' Moses said, 'I am Moses.' He said, 'Are you the Moses of the children of Israel?' Moses said, 'I have come to you so that you may teach me of what you have been taught. Al-Khadir said, 'You will not be able to have patience with me. (18.66) O Moses! I have some of Allah's knowledge which He has bestowed upon me but you do not know it; and you too, have some of Allah's knowledge which He has bestowed upon you, but I do not know it.\" Moses said, \"Allah willing, you will find me patient, and I will not disobey you in anything.' (18.6) Al-Khadir said to him. 'If you then follow me, do not ask me about anything until I myself speak to you concerning it.' (18.70), After that both of them proceeded along the sea coast, till a boat passed by and they requested the crew to let them go on board. The crew recognized Al-Khadir and allowed them to get on board free of charge. When they got on board suddenly Moses saw that Al-Khadir had pulled out one of the planks of the boat with an adze. Moses said to him.' These people gave us a free lift, yet you have scuttled their boat so as to drown its people! Truly, you have done a dreadful thing.' (18.71) Al-Khadir said, 'Didn't I say that you can have no patience with me ?' (18.72) Moses said, 'Call me not to account for what I forgot and be not hard upon me for my affair (with you.)\" (18.73) Allah's Messenger (ﷺ) said, \"The first excuse given by Moses, was that he had forgotten. Then a sparrow came and sat over the edge of the boat and dipped its beak once in the sea. Al-Khadir said to Moses, 'My knowledge and your knowledge, compared to Allah's knowledge is like what this sparrow has taken out of the sea.' Then they both got out of the boat, and while they were walking on the sea shore, Al-Khadir saw a boy playing with other boys. Al-Khadir got hold of the head of that boy and pulled it out with his hands and killed him. Moses said, 'Have you killed an innocent soul who has killed nobody! Truly, you have done an illegal thing.' (18.74) He said, \"Didn't I tell you that you can have no patience with me?' (18.75) (The sub narrator said, the second blame was stronger than the first one.) Moses said, 'If I ask you about anything after this, keep me not in your company, you have received an excuse from me.' (18.76) Then they both proceeded until they came to the inhabitants of a town. They asked them food but they refused to entertain them. (In that town) they found there a wall on the point of falling down. (18.77) Al-Khadir set it up straight with his own hands. Moses said, 'These are people to whom we came, but they neither fed us nor received us as guests. If you had wished, you could surely have exacted some recompense for it. Al-Khadir said, 'This is the parting between me and you ..that is the interpretation of (those things) over which you were unable to hold patience.' (18.78-82) Allah's Messenger (ﷺ) said, \"We wished that Moses could have been more patient so that Allah might have described to us more about their story.\" Saeed bin jubair narrates that Hadith Ibn-e-Abbas رضی اللہ عنہما and would read: '' وَأَمَّا الْغُلاَمُ فَكَانَ كَافِرًا وَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ‏.‏'' (As for the young man, he was an infidel and his parents were Believed.)",
                "hadithUrdu": "میں نے ابن عباس رضی اللہ عنہما سے کہا نوف بکالی کہتا ہے ( جو کعب احبار کا رہیب تھا ) کہ جن موسیٰ کی خضر کے ساتھ ملاقات ہوئی تھی وہ بنی اسرائیل کے ( رسول ) موسیٰ کے علاوہ دوسرے ہیں۔ ( یعنی موسیٰ بن میثا بن افراثیم بن یوسف بن یعقوب ) ابن عباس رضی اللہ عنہما نے کہا دشمن خدا نے غلط کہا۔ مجھ سے ابی بن کعب نے بیان کیا کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ موسیٰ علیہ السلام بنی اسرائیل کو وعظ سنانے کے لیے کھڑے ہوئے تو ان سے پوچھا گیا کہ انسانوں میں سب سے زیادہ علم کسے ہے؟ انہوں نے فرمایا کہ مجھے۔ اس پر اللہ تعالیٰ نے ان پر غصہ کیا کیونکہ انہوں نے علم کو اللہ تعالیٰ کی طرف منسوب نہیں کیا تھا۔ اللہ تعالیٰ نے انہیں وحی کے ذریعہ بتایا کہ دو دریاؤں ( فارس اور روم ) کے سنگم پر میرا ایک بندہ ہے جو تم سے زیادہ علم رکھتا ہے۔ موسیٰ علیہ السلام نے عرض کیا: اے رب! میں ان تک کیسے پہنچ پاؤں گا؟ اللہ تعالیٰ نے بتایا کہ اپنے ساتھ ایک مچھلی لے لو اور اسے ایک زنبیل میں رکھ لو، وہ جہاں گم ہو جائے ( زندہ ہو کر دریا میں کود جائے ) بس میرا وہ بندہ وہیں ملے گا چنانچہ آپ نے مچھلی لی اور زنبیل میں رکھ کر روانہ ہوئے۔ آپ کے ساتھ آپ کے خادم یوشع بن نون بھی تھے۔ جب یہ دونوں چٹان کے پاس آئے تو سر رکھ کر سو گئے، ادھر مچھلی زنبیل میں تڑپی اور اس سے نکل گئی اور اس نے دریا میں اپنا راستہ پا لیا۔ مچھلی جہاں گری تھی اللہ تعالیٰ نے وہاں پانی کی روانی کو روک دیا اور پانی ایک طاق کی طرح اس پر بن گیا ( یہ حال یوشع اپنی آنکھوں سے دیکھ رہے تھے ) پھر جب موسیٰ علیہ السلام بیدار ہوئے تو یوشع ان کو مچھلی کے متعلق بتانا بھول گئے۔ اس لیے دن اور رات کا جو حصہ باقی تھا اس میں چلتے رہے، دوسرے دن موسیٰ علیہ السلام نے اپنے خادم سے فرمایا کہ اب کھانا لاؤ، ہم کو سفر نے بہت تھکا دیا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ موسیٰ علیہ السلام اس وقت تک نہیں تھکے جب تک وہ اس مقام سے نہ گزر چکے جس کا اللہ تعالیٰ نے انہیں حکم دیا تھا۔ اب ان کے خادم نے کہا آپ نے نہیں دیکھا جب ہم چٹان کے پاس تھے تو مچھلی کے متعلق بتانا بھول گیا تھا اور صرف شیطانوں نے یاد رہنے نہیں دیا۔ اس نے تو عجیب طریقہ سے اپنا راستہ بنا لیا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا: مچھلی نے تو دریا میں اپنا راستہ لیا اور موسیٰ اور ان کے خادم کو ( مچھلی کا جو نشان پانی میں اب تک موجود تھا ) دیکھ کر تعجب ہوا۔ موسیٰ علیہ السلام نے فرمایا کہ یہ وہی جگہ تھی جس کی تلاش میں ہم تھے، چنانچہ دونوں حضرات پیچھے اسی راستہ سے لوٹے۔ بیان کیا کہ دونوں حضرات پیچھے اپنے نقش قدم پر چلتے چلتے آخر اس چٹان تک پہنچ گئے وہاں انہوں نے دیکھا کہ ایک صاحب ( خضر علیہ السلام ) کپڑے میں لپٹے ہوئے وہاں بیٹھے ہیں۔ موسیٰ علیہ السلام نے انہیں سلام کیا۔ خضر علیہ السلام نے کہا ( تم کون ہو ) تمہارے ملک میں ”سلام“ کہاں سے آ گیا۔ موسیٰ علیہ السلام نے فرمایا کہ میں موسیٰ ہوں۔ پوچھا بنی اسرائیل کے موسیٰ؟ فرمایا کہ جی ہاں۔ آپ کے پاس اس غرض سے حاضر ہوا ہوں تاکہ جو ہدایت کا علم آپ کو حاصل ہے وہ مجھے بھی سکھا دیں۔ خضر علیہ السلام نے فرمایا، موسیٰ! آپ میرے ساتھ صبر نہیں کر سکتے مجھے اللہ تعالیٰ کی طرف سے ایک خاص علم ملا ہے جسے آپ نہیں جانتے، اسی طرح آپ کو اللہ تعالیٰ کی طرف سے جو علم ملا ہے وہ میں نہیں جانتا۔ موسیٰ علیہ السلام نے فرمایا ان شاءاللہ آپ مجھے صابر پائیں گے اور میں کسی معاملے میں آپ کے خلاف نہیں کروں گا۔ خضر علیہ السلام نے فرمایا، اچھا اگر آپ میرے ساتھ چلیں تو کسی چیز کے متعلق سوال نہ کریں یہاں تک کہ میں خود آپ کو اس کے متعلق بتا دوں گا۔ اب یہ دونوں سمندر کے کنارے کنارے روانہ ہوئے اتنے میں ایک کشتی گزری، انہوں نے کشتی والوں سے بات کی کہ انہیں بھی اس پر سوار کر لیں۔ کشتی والوں نے خضر علیہ السلام کو پہچان لیا اور کسی کرایہ کے بغیر انہیں سوار کر لیا۔ جب یہ دونوں کشتی پر بیٹھ گئے تو خضر علیہ السلام نے کلہاڑے سے کشتی کا ایک تختہ نکال ڈالا۔ اس پر موسیٰ علیہ السلام نے دیکھا تو خضر علیہ السلام سے کہا کہ ان لوگوں نے ہمیں بغیر کسی کرایہ کے اپنی کشتی میں سوار کر لیا تھا اور آپ نے انہیں کی کشتی چیر ڈالی تاکہ سارے مسافر ڈوب جائیں۔ بلاشبہ آپ نے یہ بڑا ناگوار کام کیا ہے۔ خضر علیہ السلام نے فرمایا، کیا میں نے آپ سے پہلے ہی نہ کہا تھا کہ آپ میرے ساتھ صبر نہیں کر سکتے۔ موسیٰ علیہ السلام نے فرمایا جو بات میں بھول گیا تھا اس پر مجھے معاف کر دیں اور میرے معاملہ میں تنگی نہ کریں۔ بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، یہ پہلی مرتبہ موسیٰ علیہ السلام نے بھول کر انہیں ٹوکا تھا۔ راوی نے بیان کیا کہ اتنے میں ایک چڑیا آئی اور اس نے کشتی کے کنارے بیٹھ کر سمندر میں ایک مرتبہ اپنی چونچ ماری تو خضر علیہ السلام نے موسیٰ علیہ السلام سے کہا کہ میرے اور آپ کے علم کی حیثیت اللہ کے علم کے مقابلے میں اس سے زیادہ نہیں ہے جتنا اس چڑیا نے اس سمندر کے پانی سے کم کیا ہے۔ پھر یہ دونوں کشتی سے اتر گئے، ابھی وہ سمندر کے کنارے چل ہی رہے تھے کہ خضر علیہ السلام نے ایک بچہ کو دیکھا جو دوسرے بچوں کے ساتھ کھیل رہا تھا۔ آپ نے اس بچے کا سر اپنے ہاتھ میں دبایا اور اسے ( گردن سے ) اکھاڑ دیا اور اس کی جان لے لی۔ موسیٰ علیہ السلام اس پر بولے، آپ نے ایک بےگناہ کی جان بغیر کسی جان کے بدلے کے لے لی، یہ آپ نے بڑا ناپسند کام کیا۔ خضر علیہ السلام نے فرمایا کہ میں تو پہلے ہی کہہ چکا تھا کہ آپ میرے ساتھ صبر نہیں کر سکتے۔ سفیان بن عیینہ ( راوی حدیث ) نے کہا اور یہ کام تو پہلے سے بھی زیادہ سخت تھا۔ موسیٰ علیہ السلام نے آخر اس مرتبہ بھی معذرت کی کہ اگر میں نے اس کے بعد پھر آپ سے سوال کیا تو آپ مجھے ساتھ نہ رکھئے گا۔ آپ میرا باربار عذر سن چکے ہیں ( اس کے بعد میرے لیے بھی عذر کا کوئی موقع نہ رہے گا ) پھر دونوں روانہ ہوئے، یہاں تک کہ ایک بستی میں پہنچے اور بستی والوں سے کہا کہ ہمیں اپنا مہمان بنا لو، لیکن انہوں نے میزبانی سے انکار کیا، پھر انہیں بستی میں ایک دیوار دکھائی دی جو بس گرنے ہی والی تھی۔ بیان کیا کہ دیوار جھک رہی تھی۔ خضر علیہ السلام کھڑے ہو گئے اور دیوار اپنے ہاتھ سے سیدھی کر دی۔ موسیٰ علیہ السلام نے فرمایا کہ ان لوگوں کے یہاں ہم آئے اور ان سے کھانے کے لیے کہا، لیکن انہوں نے ہماری میزبانی سے انکار کیا، اگر آپ چاہتے تو دیوار کے اس سیدھا کرنے کے کام پر اجرت لے سکتے تھے۔ خضر علیہ السلام نے فرمایا کہ بس اب میرے اور آپ کے درمیان جدائی ہے، اللہ تعالیٰ کے ارشاد «ذلك تأويل ما لم تسطع عليه صبرا‏» تک۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، ہم تو چاہتے تھے کہ موسیٰ نے صبر کیا ہوتا تاکہ اللہ تعالیٰ ان کے اور واقعات ہم سے بیان کرتا۔ سعید بن جبیر نے بیان کیا کہ عبداللہ بن عباس رضی اللہ عنہما اس آیت کی تلاوت کرتے تھے ( جس میں خضر علیہ السلام نے اپنے کاموں کی وجہ بیان کی ہے کہ ) کشتی والوں کے آگے ایک بادشاہ تھا جو ہر اچھی کشتی کو چھین لیا کرتا تھا اور اس کی بھی آپ تلاوت کرتے تھے کہ اور وہ غلام ( جس کی گردن خضر علیہ السلام نے توڑ دی تھی ) تو وہ ( اللہ کے علم میں ) کافر تھا اور اس کے والدین مومن تھے۔",
                "urduNarrator": "ہم سے عبدااللہ بن زبیر حمیدی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے عمرو بن دینار نے بیان کیا، کہا کہ مجھے سعید بن جبیر نے خبر دی، کہا کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ إِنَّ نَوْفًا الْبَكَالِيَّ يَزْعُمُ أَنَّ مُوسَى صَاحِبَ الْخَضِرِ لَيْسَ هُوَ مُوسَى صَاحِبَ بَنِي إِسْرَائِيلَ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ كَذَبَ عَدُوُّ اللَّهِ حَدَّثَنِي أُبَىُّ بْنُ كَعْبٍ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ مُوسَى قَامَ خَطِيبًا فِي بَنِي إِسْرَائِيلَ فَسُئِلَ أَىُّ النَّاسِ أَعْلَمُ فَقَالَ أَنَا فَعَتَبَ اللَّهُ عَلَيْهِ، إِذْ لَمْ يَرُدَّ الْعِلْمَ إِلَيْهِ فَأَوْحَى اللَّهُ إِلَيْهِ إِنَّ لِي عَبْدًا بِمَجْمَعِ الْبَحْرَيْنِ، هُوَ أَعْلَمُ مِنْكَ قَالَ مُوسَى يَا رَبِّ فَكَيْفَ لِي بِهِ قَالَ تَأْخُذُ مَعَكَ حُوتًا فَتَجْعَلُهُ فِي مِكْتَلٍ، فَحَيْثُمَا فَقَدْتَ الْحُوتَ فَهْوَ ثَمَّ، فَأَخَذَ حُوتًا فَجَعَلَهُ فِي مِكْتَلٍ ثُمَّ انْطَلَقَ، وَانْطَلَقَ مَعَهُ بِفَتَاهُ يُوشَعَ بْنِ نُونٍ، حَتَّى إِذَا أَتَيَا الصَّخْرَةَ وَضَعَا رُءُوسَهُمَا فَنَامَا، وَاضْطَرَبَ الْحُوتُ فِي الْمِكْتَلِ، فَخَرَجَ مِنْهُ، فَسَقَطَ فِي الْبَحْرِ فَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ سَرَبًا، وَأَمْسَكَ اللَّهُ عَنِ الْحُوتِ جِرْيَةَ الْمَاءِ فَصَارَ عَلَيْهِ مِثْلَ الطَّاقِ فَلَمَّا اسْتَيْقَظَ، نَسِيَ صَاحِبُهُ أَنْ يُخْبِرَهُ بِالْحُوتِ، فَانْطَلَقَا بَقِيَّةَ يَوْمِهِمَا وَلَيْلَتَهُمَا، حَتَّى إِذَا كَانَ مِنَ الْغَدِ قَالَ مُوسَى لِفَتَاهُ آتِنَا غَدَاءَنَا لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَذَا نَصَبًا قَالَ وَلَمْ يَجِدْ مُوسَى النَّصَبَ حَتَّى جَاوَزَ الْمَكَانَ الَّذِي أَمَرَ اللَّهُ بِهِ فَقَالَ لَهُ فَتَاهُ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ وَمَا أَنْسَانِيهِ إِلاَّ الشَّيْطَانُ أَنْ أَذْكُرَهُ، وَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ عَجَبًا قَالَ فَكَانَ لِلْحُوتِ سَرَبًا وَلِمُوسَى وَلِفَتَاهُ عَجَبًا فَقَالَ مُوسَى ذَلِكَ مَا كُنَّا نَبْغِي فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا قَالَ رَجَعَا يَقُصَّانِ آثَارَهُمَا حَتَّى انْتَهَيَا إِلَى الصَّخْرَةِ، فَإِذَا رَجُلٌ مُسَجًّى ثَوْبًا، فَسَلَّمَ عَلَيْهِ مُوسَى‏.‏ فَقَالَ الْخَضِرُ وَأَنَّى بِأَرْضِكَ السَّلاَمُ قَالَ أَنَا مُوسَى‏.‏ قَالَ مُوسَى بَنِي إِسْرَائِيلَ قَالَ نَعَمْ أَتَيْتُكَ لِتُعَلِّمَنِي مِمَّا عُلِّمْتَ رَشَدًا‏.‏ قَالَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِي صَبْرًا، يَا مُوسَى إِنِّي عَلَى عِلْمٍ مِنْ عِلْمِ اللَّهِ عَلَّمَنِيهِ لاَ تَعْلَمُهُ أَنْتَ وَأَنْتَ عَلَى عِلْمٍ مِنْ عِلْمِ اللَّهِ عَلَّمَكَ اللَّهُ لاَ أَعْلَمُهُ‏.‏ فَقَالَ مُوسَى سَتَجِدُنِي إِنْ شَاءَ اللَّهُ صَابِرًا، وَلاَ أَعْصِي لَكَ أَمْرًا‏.‏ فَقَالَ لَهُ الْخَضِرُ، فَإِنِ اتَّبَعْتَنِي فَلاَ تَسْأَلْنِي عَنْ شَىْءٍ حَتَّى أُحْدِثَ لَكَ مِنْهُ ذِكْرًا، فَانْطَلَقَا يَمْشِيَانِ عَلَى سَاحِلِ الْبَحْرِ، فَمَرَّتْ سَفِينَةٌ فَكَلَّمُوهُمْ أَنْ يَحْمِلُوهُمْ، فَعَرَفُوا الْخَضِرَ، فَحَمَلُوهُ بِغَيْرِ نَوْلٍ فَلَمَّا رَكِبَا فِي السَّفِينَةِ، لَمْ يَفْجَأْ إِلاَّ وَالْخَضِرُ قَدْ قَلَعَ لَوْحًا مِنْ أَلْوَاحِ السَّفِينَةِ بِالْقَدُومِ‏.‏ فَقَالَ لَهُ مُوسَى قَوْمٌ حَمَلُونَا بِغَيْرِ نَوْلٍ، عَمَدْتَ إِلَى سَفِينَتِهِمْ فَخَرَقْتَهَا لِتُغْرِقَ أَهْلَهَا لَقَدْ جِئْتَ شَيْئًا إِمْرًا‏.‏ قَالَ أَلَمْ أَقُلْ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِي صَبْرًا‏.‏ قَالَ لاَ تُؤَاخِذْنِي بِمَا نَسِيتُ وَلاَ تُرْهِقْنِي مِنْ أَمْرِي عُسْرًا ‏\"‏‏.‏ قَالَ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَكَانَتِ الأُولَى مِنْ مُوسَى نِسْيَانًا قَالَ وَجَاءَ عُصْفُورٌ فَوَقَعَ عَلَى حَرْفِ السَّفِينَةِ فَنَقَرَ فِي الْبَحْرِ نَقْرَةً، فَقَالَ لَهُ الْخَضِرُ مَا عِلْمِي وَعِلْمُكَ مِنْ عِلْمِ اللَّهِ إِلاَّ مِثْلُ مَا نَقَصَ هَذَا الْعُصْفُورُ مِنْ هَذَا الْبَحْرِ ثُمَّ خَرَجَا مِنَ السَّفِينَةِ، فَبَيْنَا هُمَا يَمْشِيَانِ عَلَى السَّاحِلِ، إِذْ أَبْصَرَ الْخَضِرُ غُلاَمًا يَلْعَبُ مَعَ الْغِلْمَانِ، فَأَخَذَ الْخَضِرُ رَأْسَهُ بِيَدِهِ فَاقْتَلَعَهُ بِيَدِهِ فَقَتَلَهُ‏.‏ فَقَالَ لَهُ مُوسَى أَقَتَلْتَ نَفْسًا زَاكِيَةً بِغَيْرِ نَفْسٍ لَقَدْ جِئْتَ شَيْئًا نُكْرًا‏.‏ قَالَ أَلَمْ أَقُلْ لَكَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِي صَبْرًا قَالَ وَهَذَا أَشَدُّ مِنَ الأُولَى، قَالَ إِنْ سَأَلْتُكَ عَنْ شَىْءٍ بَعْدَهَا فَلاَ تُصَاحِبْنِي قَدْ بَلَغْتَ مِنْ لَدُنِّي عُذْرًا فَانْطَلَقَا حَتَّى إِذَا أَتَيَا أَهْلَ قَرْيَةٍ اسْتَطْعَمَا أَهْلَهَا فَأَبَوْا أَنْ يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ ـ قَالَ مَائِلٌ ـ فَقَامَ الْخَضِرُ فَأَقَامَهُ بِيَدِهِ فَقَالَ مُوسَى قَوْمٌ أَتَيْنَاهُمْ فَلَمْ يُطْعِمُونَا، وَلَمْ يُضَيِّفُونَا، لَوْ شِئْتَ لاَتَّخَذْتَ عَلَيْهِ أَجْرًا‏.‏ قَالَ ‏{‏هَذَا فِرَاقُ بَيْنِي وَبَيْنِكَ‏}‏ إِلَى قَوْلِهِ ‏{‏ذَلِكَ تَأْوِيلُ مَا لَمْ تَسْطِعْ عَلَيْهِ صَبْرًا‏}‏‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَدِدْنَا أَنَّ مُوسَى كَانَ صَبَرَ حَتَّى يَقُصَّ اللَّهُ عَلَيْنَا مِنْ خَبَرِهِمَا ‏\"‏‏.‏ قَالَ سَعِيدُ بْنُ جُبَيْرٍ فَكَانَ ابْنُ عَبَّاسٍ يَقْرَأُ وَكَانَ أَمَامَهُمْ مَلِكٌ يَأْخُذُ كُلَّ سَفِينَةٍ صَالِحَةٍ غَصْبًا، وَكَانَ يَقْرَأُ وَأَمَّا الْغُلاَمُ فَكَانَ كَافِرًا وَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ‏.‏",
                "headingArabic": "{‏وَإِذْ قَالَ مُوسَى لِفَتَاهُ لاَ أَبْرَحُ حَتَّى أَبْلُغَ مَجْمَعَ الْبَحْرَيْنِ أَوْ أَمْضِيَ حُقُبًا‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’اور (یاد کرو) جب موسیٰ (علیہ السلام) نے اپنے نوکر سے کہا کہ میں اس وقت تک سفر نہیں چھوڑوں گا جب تک کہ میں دو سمندروں کے سنگم پر نہ پہنچ جاؤں یا (یہاں تک کہ) سال گزاروں۔ سفر میں سال.\" (V.18:60)",
                "headingEnglish": "The Statement of Allah the Exalted: \"And (remember) when Mūsa (Moses) said to his boy-servant: 'I will not give up (travelling) until I reach the junction of the two seas or (until) I spend years and years in travelling.\" (V.18:60)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4505,
                "hadithNumber": "4726",
                "englishNarrator": "Narrated Ibn Juraij:",
                "hadithEnglish": "Ya`la bin Muslim and `Amr bin Dinar and some others narrated the narration of Sa`id bin Jubair. Narrated Sa`id: While we were at the house of Ibn `Abbas رضی اللہ عنہما, Ibn `Abbas رضی اللہ عنہما said, \"Ask me (any question)\" I said, \"O Abu `Abbas! May Allah let me be sacrificed for you ! There is a man at Kufa who is a storyteller called Nauf; who claims that he (Al-Khadir's companion) is not Moses of Bani Israel.\" As for `Amr, he said to me, \"Ibn `Abbas رضی اللہ عنہما said, \"(Nauf) the enemy of Allah told a lie.\" But Ya`la said to me, \"Ibn `Abbas رضی اللہ عنہما said, Ubai bin Ka`b said, Allah's Messenger (ﷺ) said, 'Once Moses, Allah's Messenger (ﷺ), preached to the people till their eyes shed tears and their hearts became tender, whereupon he finished his sermon. Then a man came to Moses and asked, 'O Allah's Messenger (ﷺ)! Is there anyone on the earth who is more learned than you?' Moses replied, 'No.' So Allah admonished him (Moses), for he did not ascribe all knowledge to Allah. It was said, (on behalf of Allah), 'Yes, (there is a slave of ours who knows more than you ).' Moses said, 'O my Lord! Where is he?' Allah said, 'At the junction of the two seas.' Moses said, 'O my Lord ! Tell I me of a sign whereby I will recognize the place.' \" `Amr said to me, Allah said, \"That place will be where the fish will leave you.\" Ya`la said to me, \"Allah said (to Moses), 'Take a dead fish (and your goal will be) the place where it will become alive.' \" So Moses took a fish and put it in a basket and said to his boy-servant \"I don't want to trouble you, except that you should inform me as soon as this fish leaves you.\" He said (to Moses).\" You have not demanded too much.\" And that is as mentioned by Allah: 'And (remember) when Moses said to his attendant .... ' (18.60) Yusha` bin Noon. (Sa`id did not state that). The Prophet (ﷺ) said, \"While the attendant was in the shade of the rock at a wet place, the fish slipped out (alive) while Moses was sleeping. His attend an said (to himself), \"I will not wake him, but when he woke up, he forgot to tell him The fish slipped out and entered the sea. Allah stopped the flow of the sea. where the fish was, so that its trace looked as if it was made on a rock. `Amr forming a hole with his two thumbs an index fingers, said to me, \"Like this, as in its trace was made on a rock.\" Moses said \"We have suffered much fatigue on this journey of ours.\" (This was not narrated by Sa`id). Then they returned back and found Al-Khadir. `Uthman bin Abi Sulaiman said to me, (they found him) on a green carpet in the middle of the sea. Al-Khadir was covered with his garment with one end under his feet and the other end under his head. When Moses greeted, he uncovered his face and said astonishingly, 'Is there such a greeting in my land? Who are you?' Moses said, 'I am Moses.' Al- Khadir said, 'Are you the Moses of Bani Israel?' Moses said, 'Yes.' Al-Khadir said, \"What do you want?' Moses said, ' I came to you so that you may teach me of the truth which you were taught.' Al- Khadir said, 'Is it not sufficient for you that the Torah is in your hands and the Divine Inspiration comes to you, O Moses? Verily, I have a knowledge that you ought not learn, and you have a knowledge which I ought not learn.' At that time a bird took with its beak (some water) from the sea: Al-Khadir then said, 'By Allah, my knowledge and your knowledge besides Allah's Knowledge is like what this bird has taken with its beak from the sea.' Until, when they went on board the boat (18.71). They found a small boat which used to carry the people from this sea-side to the other sea-side. The crew recognized Al-Khadir and said, 'The pious slave of Allah.' (We said to Sa`id \"Was that Khadir?\" He said, \"Yes.\") The boat men said, 'We will not get him on board with fare.' Al-Khadir scuttled the boat and then plugged the hole with a piece of wood. Moses said, 'Have you scuttled it in order to drown these people surely, you have done a dreadful thing. (18.71) (Mujahid said. \"Moses said so protestingly.\") Al-Khadir said, didn't I say that you can have no patience with me?' (18.72) The first inquiry of Moses was done because of forgetfulness, the second caused him to be bound with a stipulation, and the third was done intentionally. Moses said, 'Call me not to account for what I forgot and be not hard upon me for my affair (with you).' (18.73) (Then) they found a boy and Al-Khadir killed him. Ya`la- said: Sa`id said 'They found boys playing and Al-Khadir got hold of a handsome infidel boy laid him down and then slew him with knife. Moses said, 'Have you killed a innocent soul who has killed nobody' (18.74) Then they proceeded and found a wall which was on the point of falling down, and Al-Khadir set it up straight. Sa`id moved his hand thus and said 'Al-Khadir raised his hand and the wall became straight. Ya`la said, 'I think Sa`id said, 'Al-Khadir touched the wall with his hand and it became straight (Moses said to Al-Khadir), 'If you had wished, you could have taken wages for it.' Sa`id said, 'Wages that we might had eaten.' And there was a king in furor (ahead) of them\" (18.79) And there was in front of them. Ibn `Abbas رضی اللہ عنہما recited: 'In front of them (was) a king.' It is said on the authority of somebody other than Sa`id that the king was Hudad bin Budad. They say that the boy was called Haisur. 'A king who seized every ship by force. (18.79) So I wished that if that boat passed by him, he would leave it because of its defect and when they have passed they would repair it and get benefit from it. Some people said that they closed that hole with a bottle, and some said with tar. 'His parents were believers, and he (the boy) was a non-believer and we (Khadir) feared lest he would oppress them by obstinate rebellion and disbelief.' (18.80) (i.e. that their love for him would urge them to follow him in his religion, 'so we (Khadir) desired that their Lord should change him for them for one better in righteousness and near to mercy' (18:81). This was in reply to Moses' saying: Have you killed an innocent soul.'? (18.74). 'Near to mercy\" means they will be more merciful to him than they were to the former whom Khadir had killed. Other than Sa`id, said that they were compensated with a girl. Dawud bin Abi `Asim said on the authority of more than one that this next child was a girl.",
                "hadithUrdu": "مجھے یعلیٰ بن مسلم اور عمرو بن دینار نے خبر دی سعید بن جبیر سے، دونوں میں سے ایک اپنے ساتھی اور دیگر راوی کے مقابلہ میں بعض الفاظ زیادہ کہتا ہے اور ان کے علاوہ ایک اور صاحب نے بھی سعید بن جبیر سے سن کر بیان کیا کہ انہوں نے کہا ہم ابن عباس رضی اللہ عنہما کی خدمت میں ان کے گھر حاضر تھے۔ انہوں نے فرمایا کہ دین کی باتیں مجھ سے کچھ پوچھو۔ میں نے عرض کیا: اے ابوعباس! اللہ آپ پر مجھے قربان کرے کوفہ میں ایک واعظ شخص نوف نامی ( نوف بکالی ) ہے اور وہ کہتا ہے کہ موسیٰ، خضر علیہ السلام سے ملنے والے وہ نہیں تھے جو بنی اسرائیل کے پیغمبر موسیٰ علیہ السلام ہوئے ہیں ( ابن جریج نے بیان کیا کہ ) عمرو بن دینار نے تو روایت اس طرح بیان کی کہ ابن عباس نے کہا دشمن خدا جھوٹی بات کہتا ہے اور یعلیٰ بن مسلم نے اپنی روایت میں اس طرح مجھ سے بیان کیا کہ ابن عباس رضی اللہ عنہما نے کہا کہ مجھ سے ابی بن کعب رضی اللہ عنہ نے بیان کیا، کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ موسیٰ علیہ السلام اللہ کے رسول تھے ایک دن آپ نے لوگوں ( بنی اسرائیل ) کو ایسا وعظ فرمایا کہ لوگوں کی آنکھوں سے آنسو نکل پڑے اور دل پسیج گئے تو آپ واپس جانے کے لیے مڑے۔ اس وقت ایک شخص نے ان سے پوچھا: اے اللہ کے رسول! کیا دنیا میں آپ سے بڑا کوئی عالم ہے؟ انہوں نے کہا کہ نہیں، اس پر اللہ نے موسیٰ علیہ السلام پر عتاب نازل کیا، کیونکہ انہوں نے علم کی نسبت اللہ تعالیٰ کی طرف نہیں کی تھی۔ ( ان کو یوں کہنا چاہئے تھا کہ اللہ ہی جانتا ہے ) ۔ ان سے کہا گیا کہ ہاں تم سے بھی بڑا عالم ہے۔ موسیٰ علیہ السلام نے عرض کیا، اے پروردگار! وہ کہاں ہے۔ اللہ نے فرمایا جہاں ( فارس اور روم کے ) دو دریا ملے ہیں۔ موسیٰ علیہ السلام نے عرض کیا: اے پروردگار! میرے لیے ان کی کوئی نشانی ایسی بتلا دے کہ میں ان تک پہنچ جاؤں۔ اب عمرو بن دینار نے مجھ سے اپنی روایت اس طرح بیان کی ہے کہ اللہ تعالیٰ نے فرمایا، جہاں تم سے مچھلی تمہاری زنبیل سے چل دے ( وہیں وہ ملیں گے ) اور یعلیٰ نے حدیث اس طرح بیان کی کہ ایک مردہ مچھلی ساتھ لے لو، جہاں اس مچھلی میں جان پڑ جائے ( وہیں وہ ملیں گے ) موسیٰ علیہ السلام نے مچھلی ساتھ لے لی اور اسے ایک زنبیل میں رکھ لیا۔ آپ نے اپنے ساتھی یوشع سے فرمایا کہ میں بس تمہیں اتنی تکلیف دیتا ہوں کہ جب یہ مچھلی زنبیل سے نکل کر چل دے تو مجھے بتانا۔ انہوں نے عرض کیا کہ یہ کون سی بڑی تکلیف ہے۔ اسی کی طرف اشارہ ہے اللہ تعالیٰ کے ارشاد «وإذ قال موسى لفتاه‏» میں وہ «فتي» ( رفیق سفر ) یوشع ابن نون تھے۔ سعید بن جبیر ( راوی حدیث ) نے اپنی روایت میں یوشع بن نون کا نام نہیں لیا۔ بیان کیا کہ پھر موسیٰ علیہ السلام ایک چٹان کے سایہ میں ٹھہر گئے جہاں نمی اور ٹھنڈ تھی۔ اس وقت مچھلی تڑپی اور دریا میں کود گئی۔ موسیٰ علیہ السلام سو رہے تھے اس لیے یوشع نے سوچا کہ آپ کو جگانا نہ چاہئے۔ لیکن جب موسیٰ علیہ السلام بیدار ہوئے تو مچھلی کا حال کہنا بھول گئے۔ اسی عرصہ میں مچھلی تڑپ کر پانی میں چلی گئی۔ اللہ تعالیٰ نے مچھلی کی جگہ پانی کے بہاؤ کو روک دیا اور مچھلی کا نشان پتھر پر جس پر سے گئی تھی بن گیا۔ عمرو بن دینار نے مجھ ( ابن جریج ) سے بیان کیا کہ اس کا نشان پتھر پہ بن گیا اور دونوں انگوٹھوں اور کلمہ کی انگلیوں کو ملا کر ایک حلقہ کی طرح اس کو بتایا۔ بیدار ہونے کے بعد موسیٰ علیہ السلام باقی دن اور باقی رات چلتے رہے۔ آخر کہنے لگے۔ ہمیں اب اس سفر میں تھکن ہو رہی ہے۔ ان کے خادم نے عرض کیا۔ اللہ نے آپ کی تھکن کو دور کر دیا ہے ( اور مچھلی زندہ ہو گئی ہے ) ۔ ابن جریج نے بیان کیا کہ یہ ٹکڑا سعید بن جبیر کی روایت میں نہیں ہے۔ پھر موسیٰ علیہ السلام اور یوشع دونوں واپس لوٹے اور خضر علیہ السلام سے ملاقات ہوئی ( ابن جریج نے کہا ) مجھ سے عثمان بن ابی سلیمان نے بیان کیا کہ خضر علیہ السلام دریا کے بیچ میں ایک چھوٹے سے سبز زین پوش پر تشریف رکھتے تھے۔ اور سعید بن جبیر نے یوں بیان کیا کہ وہ اپنے کپڑے سے تمام جسم لپیٹے ہوئے تھے۔ کپڑے کا ایک کنارہ ان کے پاؤں کے نیچے تھا اور دوسرا سر کے تلے تھا۔ موسیٰ علیہ السلام نے پہنچ کو سلام کیا تو خضر علیہ السلام نے اپنا چہرہ کھولا اور کہا، میری اس زمین میں سلام کا رواج کہاں سے آ گیا۔ آپ کون ہیں؟ موسیٰ علیہ السلام نے فرمایا کہ میں موسیٰ ہوں۔ پوچھا، موسیٰ بنی اسرائیل؟ فرمایا کہ ہاں! پوچھا، آپ کیوں آئے ہیں؟ فرمایا کہ میرے آنے کا مقصد یہ ہے کہ جو ہدایت کا علم آپ کو اللہ نے دیا ہے وہ مجھے بھی سکھا دیں۔ اس پر خضر علیہ السلام نے فرمایا کہ موسیٰ کیا آپ کے لیے یہ کافی نہیں ہے اس کا پورا سیکھنا آپ کے لیے مناسب نہیں ہے۔ اسی طرح آپ کو جو علم حاصل ہے اس کا پورا سیکھنا میرے لیے مناسب نہیں۔ اس عرصہ میں ایک چڑیا نے اپنی چونچ سے دریا کا پانی لیا تو خضر علیہ السلام نے فرمایا: اللہ کی قسم! میرا اور آپ کا علم اللہ کے علم کے مقابلے میں اس سے زیادہ نہیں ہے۔ جتنا اس چڑیا نے دریا کا پانی اپنی چونچ میں لیا ہے۔ کشتی پر چڑھنے کے وقت انہوں نے چھوٹی چھوٹی کشتیاں دیکھیں جو ایک کنارے والوں کو دوسرے کنارے پر لے جا کر چھوڑ آتی تھیں۔ کشتی والوں نے خضر علیہ السلام کو پہچان لیا اور کہا کہ یہ اللہ کے صالح بندے ہیں ہم ان سے کرایہ نہیں لیں گے۔ لیکن خضر علیہ السلام نے کشتی میں شگاف کر دیئے اور اس میں ( تختوں کی جگہ ) کیلیں گاڑ دیں۔ موسیٰ علیہ السلام نے کہا آپ نے اس لیے اسے پھاڑ ڈالا کہ اس کے مسافروں کو ڈبو دیں۔ بلاشبہ آپ نے ایک بڑا ناگوار کام کیا ہے۔ مجاہد نے آیت میں «إمرا» کا ترجمہ «منكرا» کیا ہے۔ خضر علیہ السلام نے فرمایا میں نے پہلے ہی نہ کہا تھا کہ آپ میرے ساتھ صبر نہیں کر سکتے۔ موسیٰ علیہ السلام کا پہلا سوال تو بھولنے کی وجہ سے تھا لیکن دوسرا بطور شرط تھا اور تیسرا قصداً انہوں نے کیا تھا۔ موسیٰ علیہ السلام نے اس پہلے سوال پر کہا کہ جو میں بھول گیا اس پر مجھ سے مؤاخذہ نہ کیجئے اور میرے معاملہ میں تنگی نہ کیجئے۔ پھر انہیں ایک بچہ ملا تو خضر علیہ السلام نے اسے قتل کر دیا۔ یعلیٰ نے بیان کیا کہ سعید بن جبیر نے کہا کہ خضر علیہ السلام کو چند بچے ملے جو کھیل رہے تھے آپ نے ان میں سے ایک بچہ کو پکڑا جو کافر اور چالاک تھا اور اسے لٹا کر چھری سے ذبح کر دیا۔ موسیٰ علیہ السلام نے فرمایا، آپ نے بلا کسی خون کے ایک بےگناہ جان کو جس نے کہ برا کام نہیں کیا تھا، قتل کر ڈالا۔ ابن عباس رضی اللہ عنہما آیت میں «زكية» کی جگہ «زاكية» پڑھا کرتے تھے۔ بمعنی «مسلمة» جیسے «غلاما زكيا» میں ہے۔ پھر وہ دونوں بزرگ آگے بڑھے تو ایک دیوار پر نظر پڑی جو بس گرنے ہی والی تھی۔ خضر علیہ السلام نے اسے ٹھیک کر دیا۔ سعید بن جبیر نے اپنے ہاتھ سے اشارہ کر کے بتایا کہ اس طرح۔ یعلیٰ بن مسلم نے بیان کیا میرا خیال ہے کہ سعید بن جبیر نے بیان کیا کہ خضر نے دیوار پر ہاتھ پھیر کر اسے ٹھیک کر دیا۔ موسیٰ علیہ السلام نے فرمایا کہ اگر آپ چاہتے تو اس پر اجرت لے سکتے تھے۔ سعید بن جبیر نے اس کی تشریح کی کہ اجرت جسے ہم کھا سکتے۔ آیت «وكان وراءهم» کی ابن عباس رضی اللہ عنہما نے قرآت «وكان أمامهم» کی یعنی کشتی جہاں جا رہی تھی اس ملک میں ایک بادشاہ تھا۔ سعید کے سوا دوسرے راوی سے اس بادشاہ کا نام ہدد بن بدد نقل کرتے ہیں اور جس بچہ کو خضر علیہ السلام نے قتل کیا تھا اس کا نام لوگ جیسور بیان کرتے ہیں۔ وہ بادشاہ ہر ( نئی ) کشتی کو زبردستی چھین لیا کرتا تھا۔ اس لیے میں نے چاہا کہ جب یہ کشتی اس کے سامنے سے گزرے تو اس کے اس عیب کی وجہ سے اسے نہ چھینے۔ جب کشتی والے اس بادشاہ کی سلطنت سے گزر جائیں گے تو وہ خود اسے ٹھیک کر لیں گے اور اسے کام میں لاتے رہیں گے۔ بعض لوگوں کا تو یہ خیال ہے کہ انہوں نے کشتی کو پھر سیسہ لگا کر جوڑا تھا اور بعض کہتے ہیں کہ تار کول سے جوڑا تھا ( اور جس بچہ کو قتل کر دیا تھا ) تو اس کے والدین مومن تھے اور وہ بچہ ( اللہ کی تقدیر میں ) کافر تھا۔ اس لیے ہمیں ڈر تھا کہ کہیں ( بڑا ہو کر ) وہ انہیں بھی کفر میں مبتلا نہ کر دے کہ اپنے لڑکے سے انتہائی محبت انہیں اس کے دین کی اتباع پر مجبور کر دے۔ اس لیے ہم نے چاہا کہ اللہ اس کے بدلے میں انہیں کوئی نیک اور اس سے بہتر اولاد دے۔ «وأقرب رحما» یعنی اس کے والدین اس بچہ پر جو اب اللہ تعالیٰ انہیں دے گا پہلے سے زیادہ بہتر مہربان ہوں جسے خضر علیہ السلام نے قتل کر دیا ہے۔ سعید بن جبیر رضی اللہ عنہ نے کہا کہ ان والدین کو اس بچے کے بدلے ایک لڑکی دی گئی تھی۔ داود بن ابی عاصم رحمہ اللہ کئی راویوں سے نقل کرتے ہیں کہ وہ لڑکی ہی تھی۔",
                "urduNarrator": "ہم سے ابراہیم بن موسی نے بیان کیا، کہا ہم کو ہشام بن یوسف نے خبر دی، انہیں ابن جریر نے خبر دی، کہا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي يَعْلَى بْنُ مُسْلِمٍ، وَعَمْرُو بْنُ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِ وَغَيْرَهُمَا قَدْ سَمِعْتُهُ يُحَدِّثُهُ عَنْ سَعِيدٍ قَالَ إِنَّا لَعِنْدَ ابْنِ عَبَّاسٍ فِي بَيْتِهِ، إِذْ قَالَ سَلُونِي قُلْتُ أَىْ أَبَا عَبَّاسٍ ـ جَعَلَنِي اللَّهُ فِدَاكَ ـ بِالْكُوفَةِ رَجُلٌ قَاصٌّ يُقَالُ لَهُ نَوْفٌ، يَزْعُمُ أَنَّهُ لَيْسَ بِمُوسَى بَنِي إِسْرَائِيلَ، أَمَّا عَمْرٌو فَقَالَ لِي قَالَ قَدْ كَذَبَ عَدُوُّ اللَّهِ، وَأَمَّا يَعْلَى فَقَالَ لِي قَالَ ابْنُ عَبَّاسٍ حَدَّثَنِي أُبَىُّ بْنُ كَعْبٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مُوسَى رَسُولُ اللَّهِ ـ عَلَيْهِ السَّلاَمُ ـ قَالَ ذَكَّرَ النَّاسَ يَوْمًا حَتَّى إِذَا فَاضَتِ الْعُيُونُ، وَرَقَّتِ الْقُلُوبُ وَلَّى، فَأَدْرَكَهُ رَجُلٌ، فَقَالَ أَىْ رَسُولَ اللَّهِ هَلْ فِي الأَرْضِ أَحَدٌ أَعْلَمُ مِنْكَ قَالَ لاَ، فَعَتَبَ عَلَيْهِ إِذْ لَمْ يَرُدَّ الْعِلْمَ إِلَى اللَّهِ قِيلَ بَلَى قَالَ أَىْ رَبِّ فَأَيْنَ قَالَ بِمَجْمَعِ الْبَحْرَيْنِ قَالَ أَىْ رَبِّ اجْعَلْ لِي عَلَمًا أَعْلَمُ ذَلِكَ بِهِ ‏\"‏‏.‏ فَقَالَ لِي عَمْرٌو قَالَ ‏\"‏ حَيْثُ يُفَارِقُكَ الْحُوتُ ‏\"‏‏.‏ وَقَالَ لِي يَعْلَى قَالَ ‏\"‏ خُذْ نُونًا مَيِّتًا حَيْثُ يُنْفَخُ فِيهِ الرُّوحُ، فَأَخَذَ حُوتًا فَجَعَلَهُ فِي مِكْتَلٍ فَقَالَ لِفَتَاهُ لاَ أُكَلِّفُكَ إِلاَّ أَنْ تُخْبِرَنِي بِحَيْثُ يُفَارِقُكَ الْحُوتُ‏.‏ قَالَ مَا كَلَّفْتَ كَثِيرًا فَذَلِكَ قَوْلُهُ جَلَّ ذِكْرُهُ ‏{‏وَإِذْ قَالَ مُوسَى لِفَتَاهُ‏}‏ يُوشَعَ بْنِ نُونٍ ـ لَيْسَتْ عَنْ سَعِيدٍ ـ قَالَ فَبَيْنَمَا هُوَ فِي ظِلِّ صَخْرَةٍ فِي مَكَانٍ ثَرْيَانَ، إِذْ تَضَرَّبَ الْحُوتُ، وَمُوسَى نَائِمٌ، فَقَالَ فَتَاهُ لاَ أُوقِظُهُ حَتَّى إِذَا اسْتَيْقَظَ نَسِيَ أَنْ يُخْبِرَهُ، وَتَضَرَّبَ الْحُوتُ، حَتَّى دَخَلَ الْبَحْرَ فَأَمْسَكَ اللَّهُ عَنْهُ جِرْيَةَ الْبَحْرِ حَتَّى كَأَنَّ أَثَرَهُ فِي حَجَرٍ ـ قَالَ لِي عَمْرٌو هَكَذَا كَأَنَّ أَثَرَهُ فِي حَجَرٍ، وَحَلَّقَ بَيْنَ إِبْهَامَيْهِ وَاللَّتَيْنِ تَلِيانِهِمَا ـ لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَذَا نَصَبًا قَالَ قَدْ قَطَعَ اللَّهُ عَنْكَ النَّصَبَ ـ لَيْسَتْ هَذِهِ عَنْ سَعِيدٍ ـ أَخْبَرَهُ، فَرَجَعَا فَوَجَدَا خَضِرًا ـ قَالَ لِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ ـ عَلَى طِنْفِسَةٍ خَضْرَاءَ عَلَى كَبِدِ الْبَحْرِ ـ قَالَ سَعِيدُ بْنُ جُبَيْرٍ ـ مُسَجًّى بِثَوْبِهِ قَدْ جَعَلَ طَرَفَهُ تَحْتَ رِجْلَيْهِ، وَطَرَفَهُ تَحْتَ رَأْسِهِ، فَسَلَّمَ عَلَيْهِ مُوسَى، فَكَشَفَ عَنْ وَجْهِهِ، وَقَالَ هَلْ بِأَرْضِي مِنْ سَلاَمٍ مَنْ أَنْتَ قَالَ أَنَا مُوسَى‏.‏ قَالَ مُوسَى بَنِي إِسْرَائِيلَ قَالَ نَعَمْ‏.‏ قَالَ فَمَا شَأْنُكَ قَالَ جِئْتُ لِتُعَلِّمَنِي مِمَّا عُلِّمْتَ رَشَدًا‏.‏ قَالَ أَمَا يَكْفِيكَ أَنَّ التَّوْرَاةَ بِيَدَيْكَ، وَأَنَّ الْوَحْىَ يَأْتِيكَ، يَا مُوسَى إِنَّ لِي عِلْمًا لاَ يَنْبَغِي لَكَ أَنْ تَعْلَمَهُ وَإِنَّ لَكَ عِلْمًا لاَ يَنْبَغِي لِي أَنْ أَعْلَمَهُ، فَأَخَذَ طَائِرٌ بِمِنْقَارِهِ مِنَ الْبَحْرِ وَقَالَ وَاللَّهِ مَا عِلْمِي وَمَا عِلْمُكَ فِي جَنْبِ عِلْمِ اللَّهِ إِلاَّ كَمَا أَخَذَ هَذَا الطَّائِرُ بِمِنْقَارِهِ مِنَ الْبَحْرِ، حَتَّى إِذَا رَكِبَا فِي السَّفِينَةِ وَجَدَا مَعَابِرَ صِغَارًا تَحْمِلُ أَهْلَ هَذَا السَّاحِلِ إِلَى أَهْلِ هَذَا السَّاحِلِ الآخَرِ عَرَفُوهُ، فَقَالُوا عَبْدُ اللَّهِ الصَّالِحُ ـ قَالَ قُلْنَا لِسَعِيدٍ خَضِرٌ قَالَ نَعَمْ ـ لاَ نَحْمِلُهُ بِأَجْرٍ، فَخَرَقَهَا وَوَتَدَ فِيهَا وَتِدًا‏.‏ قَالَ مُوسَى أَخَرَقْتَهَا لِتُغْرِقَ أَهْلَهَا لَقَدْ جِئْتَ شَيْئًا إِمْرًا ـ قَالَ مُجَاهِدٌ مُنْكَرًا ـ قَالَ أَلَمْ أَقُلْ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِي صَبْرًا كَانَتِ الأُولَى نِسْيَانًا وَالْوُسْطَى شَرْطًا وَالثَّالِثَةُ عَمْدًا قَالَ لاَ تُؤَاخِذْنِي بِمَا نَسِيتُ وَلاَ تُرْهِقْنِي مِنْ أَمْرِي عُسْرًا، لَقِيَا غُلاَمًا فَقَتَلَهُ ـ قَالَ يَعْلَى قَالَ سَعِيدٌ ـ وَجَدَ غِلْمَانًا يَلْعَبُونَ، فَأَخَذَ غُلاَمًا كَافِرًا ظَرِيفًا فَأَضْجَعَهُ، ثُمَّ ذَبَحَهُ بِالسِّكِّينِ‏.‏ قَالَ أَقَتَلْتَ نَفْسًا زَكِيَّةً بِغَيْرِ نَفْسٍ لَمْ تَعْمَلْ بِالْحِنْثِ ـ وَكَانَ ابْنُ عَبَّاسٍ قَرَأَهَا زَكِيَّةً زَاكِيَةً مُسْلِمَةً كَقَوْلِكَ غُلاَمًا زَكِيًّا ـ فَانْطَلَقَا، فَوَجَدَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ فَأَقَامَهُ ـ قَالَ سَعِيدٌ بِيَدِهِ هَكَذَا ـ وَرَفَعَ يَدَهُ فَاسْتَقَامَ ـ قَالَ يَعْلَى ـ حَسِبْتُ أَنَّ سَعِيدًا قَالَ فَمَسَحَهُ بِيَدِهِ فَاسْتَقَامَ، لَوْ شِئْتَ لاَتَّخَذْتَ عَلَيْهِ أَجْرًا ـ قَالَ سَعِيدٌ أَجْرًا نَأْكُلُهُ ـ وَكَانَ وَرَاءَهُمْ، وَكَانَ أَمَامَهُمْ ـ قَرَأَهَا ابْنُ عَبَّاسٍ أَمَامَهُمْ مَلِكٌ ـ يَزْعُمُونَ عَنْ غَيْرِ سَعِيدٍ أَنَّهُ هُدَدُ بْنُ بُدَدٍ، وَالْغُلاَمُ الْمَقْتُولُ، اسْمُهُ يَزْعُمُونَ جَيْسُورٌ مَلِكٌ يَأْخُذُ كُلَّ سَفِينَةٍ غَصْبًا، فَأَرَدْتُ إِذَا هِيَ مَرَّتْ بِهِ أَنْ يَدَعَهَا لِعَيْبِهَا، فَإِذَا جَاوَزُوا أَصْلَحُوهَا فَانْتَفَعُوا بِهَا وَمِنْهُمْ مَنْ يَقُولُ سَدُّوهَا بِقَارُورَةٍ وَمِنْهُمْ مَنْ يَقُولُ بِالْقَارِ، كَانَ أَبَوَاهُ مُؤْمِنَيْنِ، وَكَانَ كَافِرًا فَخَشِينَا أَنْ يُرْهِقَهُمَا طُغْيَانًا وَكُفْرًا، أَنْ يَحْمِلَهُمَا حُبُّهُ عَلَى أَنْ يُتَابِعَاهُ عَلَى دِينِهِ فَأَرَدْنَا أَنْ يُبَدِّلَهُمَا رَبُّهُمَا خَيْرًا مِنْهُ زَكَاةً لِقَوْلِهِ أَقَتَلْتَ نَفْسًا زَكِيَّةً وَأَقْرَبَ رُحْمًا هُمَا بِهِ أَرْحَمُ مِنْهُمَا بِالأَوَّلِ، الَّذِي قَتَلَ خَضِرٌ وَزَعَمَ غَيْرُ سَعِيدٍ أَنَّهُمَا أُبْدِلاَ جَارِيَةً، وأَمَّا دَاوُدُ بْنُ أَبِي عَاصِمٍ فَقَالَ عَنْ غَيْرِ وَاحِدٍ إِنَّهَا جَارِيَةٌ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏فَلَمَّا بَلَغَا مَجْمَعَ بَيْنِهِمَا نَسِيَا حُوتَهُمَا فَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ سَرَبًا‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’لیکن جب وہ دونوں سمندروں کے سنگم پر پہنچے تو اپنی مچھلی کو بھول گئے اور اس نے سمندر میں سرنگ کی طرح راستہ اختیار کیا۔‘‘ (V.18:61)",
                "headingEnglish": "The Statement of Allah the Most High: \"But when they reached the junction of the two seas, they forgot their fish, and it took its way through the sea as in a tunnel.\" (V.18:61)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4506,
                "hadithNumber": "4727",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\" claims that Moses of Bani Israel was not Moses, the companion of Al-Khadir.\" Ibn `Abbas رضی اللہ عنہما said, \"Allah's enemy tells a lie! Ubai bin Ka`b narrated to us that Allah's Messenger (ﷺ) said, 'Moses got up to deliver a sermon before Bani Israel and he was asked, 'Who is the most learned person among the people?' Moses replied, 'I (am the most learned).' Allah then admonished Moses for he did not ascribe all knowledge to Allah only (Then) came the Divine Inspiration:-- 'Yes, one of Our slaves at the junction of the two seas is more learned than you.' Moses said, 'O my Lord ! How can meet him?' Allah said, 'Take a fish in a basket and wherever the fish is lost, follow it (you will find him at that place). So Moses set out along with his attendant Yusha` bin Noon, and they carried with them a fish till they reached a rock and rested there. Moses put his head down and slept. (Sufyan, a sub-narrator said that somebody other than `Amr said) 'At the rock there was a water spring called 'Al-Hayat' and none came in touch with its water but became alive. So some of the water of that spring fell over that fish, so it moved and slipped out of the basket and entered the sea. When Moses woke up, he asked his attendant, 'Bring our early meal' (18.62). The narrator added: Moses did not suffer from fatigue except after he had passed the place he had been ordered to observe. His attendant Yusha` bin Noon said to him, 'Do you remember (what happened) when we betook ourselves to the rock? I did indeed forget (about) the fish ...' (18.63) The narrator added: So they came back, retracing their steps and then they found in the sea, the way of the fish looking like a tunnel. So there was an astonishing event for his attendant, and there was tunnel for the fish. When they reached the rock, they found a man covered with a garment. Moses greeted him. The man said astonishingly, 'Is there any such greeting in your land?' Moses said, 'I am Moses.' The man said, 'Moses of Bani Israel?' Moses said, 'Yes,' and added, 'may I follow you so that you teach me something of the Knowledge which you have been taught?' (18.66). Al-Khadir said to him, 'O Moses! You have something of Allah's knowledge which Allah has taught you and which I do not know; and I have something of Allah's knowledge which Allah has taught me and which you do not know.' Moses said, 'But I will follow you.' Al-Khadir said, 'Then if you follow me, ask me no question about anything until I myself speak to you concerning it.' (18.70). After that both of them proceeded along the seashore. There passed by them a boat whose crew recognized Al-Khadir and received them on board free of charge. So they both got on board. A sparrow came and sat on the edge of the boat and dipped its beak unto the sea. Al-Khadir said to Moses. 'My knowledge and your knowledge and all the creation's knowledge compared to Allah's knowledge is not more than the water taken by this sparrow's beak.' Then Moses was startled by Al-Khadir's action of taking an adze and scuttling the boat with it. Moses said to him, 'These people gave us a free lift, but you intentionally scuttled their boat so as to drown them. Surely you have...' (18.71) Then they both proceeded and found a boy playing with other boys. Al-Khadir took hold of him by the head and cut it off. Moses said to him, 'Have you killed an innocent soul who has killed nobody? Surely you have done an illegal thing! ' (18.74) He said, \"Didn't I tell you that you will not be able to have patient with me up to ..but they refused to entertain them as their guests. There they found a wall therein at the point of collapsing.' (18.75-77) Al-Khadir moved his hand thus and set it upright (repaired it). Moses said to him, 'When we entered this town, they neither gave us hospitality nor fed us; if you had wished, you could have taken wages for it,' Al- Khadir said, 'This is the parting between you and me I will tell you the interpretation of (those things) about which you were unable to hold patience.'...(18.78) Allah's Messenger (ﷺ) said, 'We wished that Moses could have been more patient so that He (Allah) could have described to us more about their story.' Ibn `Abbas رضی اللہ عنہما used to recite:-- 'And in front (ahead) of them there was a king who used to seize every (serviceable) boat by force. (18.79) ...and as for the boy he was a disbeliever. \"",
                "hadithUrdu": "موسیٰ علیہ السلام جو اللہ کے نبی تھے وہ نہیں ہیں جنہوں نے خضر علیہ السلام سے ملاقات کی تھی۔ ابن عباس رضی اللہ عنہما نے کہا، دشمن خدا نے غلط بات کہی ہے۔ ہم سے ابی بن کعب نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ موسیٰ علیہ السلام بنی اسرائیل کو وعظ کرنے کے لیے کھڑے ہوئے تو ان سے پوچھا گیا کہ سب سے بڑا عالم کون شخص ہے۔ موسیٰ علیہ السلام نے فرمایا کہ میں ہوں۔ اللہ تعالیٰ نے اس پر غصہ کیا، کیونکہ انہوں نے علم کی نسبت اللہ کی طرف نہیں کی تھی اور ان کے پاس وحی بھیجی کہ ہاں، میرے بندوں میں سے ایک بندہ دو دریاؤں کے ملنے کی جگہ پر ہے اور وہ تم سے بڑا عالم ہے۔ موسیٰ علیہ السلام نے عرض کیا: اے پروردگار! ان تک پہنچنے کا طریقہ کیا ہو گا؟ اللہ تعالیٰ نے فرمایا کہ ایک مچھلی زنبیل میں ساتھ لے لو۔ پھر جہاں وہ مچھلی گم ہو جائے وہیں انہیں تلاش کرو۔ بیان کیا کہ موسیٰ علیہ السلام نکل پڑے اور آپ کے ساتھ آپ کے رفیق سفر یوشع بن نون بھی تھے۔ مچھلی ساتھ تھی۔ جب چٹان تک پہنچے تو وہاں ٹھہر گئے۔ موسیٰ علیہ السلام اپنا سر رکھ کر وہیں سو گئے، عمرو کی روایت کے سوا دوسری روایت کے حوالہ سے سفیان نے بیان کیا کہ اس چٹان کی جڑ میں ایک چشمہ تھا، جسے ”حیات“ کہا جاتا تھا۔ جس چیز پر بھی اس کا پانی پڑ جاتا وہ زندہ ہو جاتی تھی۔ اس مچھلی پر بھی اس کا پانی پڑا تو اس کے اندر حرکت پیدا ہو گئی اور وہ اپنی زنبیل سے نکل کر دریا میں چلی گئی۔ موسیٰ علیہ السلام جب بیدار ہوئے تو انہوں نے اپنے ساتھی سے فرمایا «قال لفتاه آتنا غداءنا‏» کہ ”ہمارا ناشتہ لاؤ“ الآیۃ۔ بیان کیا کہ سفر میں موسیٰ علیہ السلام کو اس وقت تک کوئی تھکن نہیں ہوئی جب تک وہ مقررہ جگہ سے آگے نہیں بڑھ گئے۔ رفیق سفر یوشع بن نون نے اس پر کہا «أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت‏» ”آپ نے دیکھا جب ہم چٹان کے نیچے بیٹھے ہوئے تھے تو میں مچھلی کے متعلق کہنا بھول گیا“ الآیۃ۔ بیان کیا کہ پھر وہ دونوں الٹے پاؤں واپس لوٹے۔ دیکھا کہ جہاں مچھلی پانی میں گری تھی وہاں اس کے گزرنے کی جگہ طاق کی سی صورت بنی ہوئی ہے۔ مچھلی تو پانی میں چلی گئی تھی لیکن یوشع بن نون کو اس طرح پانی کے رک جانے پر تعجب تھا۔ جب چٹان پر پہنچے تو دیکھا کہ ایک بزرگ کپڑے میں لپٹے ہوئے وہاں موجود ہیں۔ موسیٰ علیہ السلام نے انہیں سلام کیا تو انہوں نے فرمایا کہ تمہاری زمین میں سلام کہاں سے آ گیا؟ آپ نے فرمایا کہ میں موسیٰ ہوں۔ پوچھا بنی اسرائیل کے موسیٰ؟ فرمایا کہ جی ہاں! موسیٰ علیہ السلام نے ان سے کہا کیا آپ کے ساتھ رہ سکتا ہوں تاکہ جو ہدایت کا علم اللہ تعالیٰ نے آپ کو دیا ہے وہ آپ مجھے بھی سکھا دیں۔ خضر علیہ السلام نے جواب دیا کہ آپ کو اللہ کی طرف سے ایسا علم حاصل ہے جو میں نہیں جانتا اور اسی طرح مجھے اللہ کی طرف سے ایسا علم حاصل ہے جو آپ نہیں جانتے۔ موسیٰ علیہ السلام نے فرمایا، لیکن میں آپ کے ساتھ رہوں گا۔ خضر علیہ السلام نے اس پر کہا کہ اگر آپ کو میرے ساتھ رہنا ہی ہے تو پھر مجھ سے کسی چیز کے متعلق نہ پوچھئے گا، میں خود آپ کو بتاؤں گا۔ چنانچہ دونوں حضرات دریا کے کنارے روانہ ہوئے، ان کے قریب سے ایک کشتی گزری تو خضر علیہ السلام کو کشتی والوں نے پہچان لیا اور اپنی کشتی میں ان کو بغیر کرایہ کے چڑھا لیا دونوں کشتی میں سوار ہو گئے۔ بیان کیا کہ اسی عرصہ میں ایک چڑیا کشتی کے کنارے آ کے بیٹھی اور اس نے اپنی چونچ کو دریا میں ڈالا تو خضر علیہ السلام نے موسیٰ علیہ السلام سے فرمایا کہ میرا، آپ کا اور تمام مخلوقات کا علم اللہ کے علم کے مقابلہ میں اس سے زیادہ نہیں ہے جتنا اس چڑیا نے اپنی چونچ میں دریا کا پانی لیا ہے۔ بیان کیا کہ پھر یکدم جب خضر علیہ السلام نے بسولا اٹھایا اور کشتی کو پھاڑ ڈالا تو موسیٰ علیہ السلام اس طرف متوجہ ہوئے اور فرمایا ان لوگوں نے ہمیں بغیر کسی کرایہ کے اپنی کشتی میں سوار کر لیا تھا اور آپ نے اس کا بدلہ یہ دیا ہے کہ ان کی کشتی ہی چیر ڈالی تاکہ اس کے مسافر ڈوب مریں۔ بلاشبہ آپ نے بڑا نا مناسب کام کیا ہے۔ پھر وہ دونوں آگے بڑھے تو دیکھا کہ ایک بچہ جو بہت سے دوسرے بچوں کے ساتھ کھیل رہا تھا، خضر نے اس کا سر پکڑا اور کاٹ ڈالا۔ اس پر موسیٰ علیہ السلام بول پڑے کہ آپ نے بلا کسی خون و بدلہ کے ایک معصوم بچے کی جان لے لی، یہ تو بڑی بری بات ہے۔ خضر علیہ السلام نے فرمایا، میں نے آپ سے پہلے ہی نہیں کہہ دیا تھا کہ آپ میرے ساتھ صبر نہیں کر سکتے، اللہ تعالیٰ کے ارشاد ”پس اس بستی والوں نے ان کی میزبانی سے انکار کیا، پھر اس بستی میں انہیں ایک دیوار دکھائی دی جو بس گرنے ہی والی تھی۔ خضر علیہ السلام نے اپنا ہاتھ یوں اس پر پھیرا اور اسے سیدھا کر دیا۔ موسیٰ علیہ السلام نے فرمایا ہم اس بستی میں آئے تو انہوں نے ہماری میزبانی سے انکار کیا اور ہمیں کھانا بھی نہیں دیا اگر آپ چاہتے تو اس پر اجرت لے سکتے تھے۔ خضر علیہ السلام نے فرمایا بس یہاں سے اب میرے اور آپ کے درمیان جدائی ہے اور میں آپ کو ان کاموں کی وجہ بتاؤں گا جن پر آپ صبر نہیں کر سکے تھے۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے فرمایا۔ کاش موسیٰ علیہ السلام نے صبر کیا ہوتا اور اللہ تعالیٰ ان کے سلسلے میں اور واقعات ہم سے بیان کرتا۔ بیان کیا کہ ابن عباس رضی اللہ عنہما «وكان وراءهم ملك» کی بجائے «وكان أمامهم ملك يأخذ كل سفينة صالحة غصبا» قرآت کرتے تھے اور بچہ ( جسے قتل کیا تھا ) اس کے والدین مومن تھے۔ اور یہ بچہ ( مشیت الٰہی میں ) کافر تھا۔",
                "urduNarrator": "مجھ سے قتیبہ بن سعید نے بیان کیا، کہا کہ مجھ سے سفیان بن عیینہ نے بیان کیا، کہا ان سے عمرو بن دینار نے اور ان سے سعید بن جبیر نے بیان کیا کہ میں نے ابن عباس رضی اللہ عنہما سے عرض کیا۔ نوف بکالی کہتے ہیں کہ",
                "hadithArabic": "حَدَّثَنِي قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنِي سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ إِنَّ نَوْفًا الْبَكَالِيَّ يَزْعُمُ أَنَّ مُوسَى بَنِي إِسْرَائِيلَ لَيْسَ بِمُوسَى الْخَضِرِ‏.‏ فَقَالَ كَذَبَ عَدُوُّ اللَّهِ حَدَّثَنَا أُبَىُّ بْنُ كَعْبٍ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ قَامَ مُوسَى خَطِيبًا فِي بَنِي إِسْرَائِيلَ فَقِيلَ لَهُ أَىُّ النَّاسِ أَعْلَمُ قَالَ أَنَا، فَعَتَبَ اللَّهُ عَلَيْهِ، إِذْ لَمْ يَرُدَّ الْعِلْمَ إِلَيْهِ، وَأَوْحَى إِلَيْهِ بَلَى عَبْدٌ مِنْ عِبَادِي بِمَجْمَعِ الْبَحْرَيْنِ، هُوَ أَعْلَمُ مِنْكَ قَالَ أَىْ رَبِّ كَيْفَ السَّبِيلُ إِلَيْهِ قَالَ تَأْخُذُ حُوتًا فِي مِكْتَلٍ فَحَيْثُمَا فَقَدْتَ الْحُوتَ فَاتَّبِعْهُ قَالَ فَخَرَجَ مُوسَى، وَمَعَهُ فَتَاهُ يُوشَعُ بْنُ نُونٍ، وَمَعَهُمَا الْحُوتُ حَتَّى انْتَهَيَا إِلَى الصَّخْرَةِ، فَنَزَلاَ عِنْدَهَا قَالَ فَوَضَعَ مُوسَى رَأْسَهُ فَنَامَ ـ قَالَ سُفْيَانُ وَفِي حَدِيثِ غَيْرِ عَمْرٍو قَالَ ـ وَفِي أَصْلِ الصَّخْرَةِ عَيْنٌ يُقَالُ لَهَا الْحَيَاةُ لاَ يُصِيبُ مِنْ مَائِهَا شَىْءٌ إِلاَّ حَيِيَ، فَأَصَابَ الْحُوتَ مِنْ مَاءِ تِلْكَ الْعَيْنِ، قَالَ فَتَحَرَّكَ، وَانْسَلَّ مِنَ الْمِكْتَلِ، فَدَخَلَ الْبَحْرَ فَلَمَّا اسْتَيْقَظَ مُوسَى ‏{‏قَالَ لِفَتَاهُ آتِنَا غَدَاءَنَا‏}‏ الآيَةَ قَالَ وَلَمْ يَجِدِ النَّصَبَ حَتَّى جَاوَزَ مَا أُمِرَ بِهِ، قَالَ لَهُ فَتَاهُ يُوشَعُ بْنُ نُونٍ ‏{‏أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ‏}‏ الآيَةَ قَالَ فَرَجَعَا يَقُصَّانِ فِي آثَارِهِمَا، فَوَجَدَا فِي الْبَحْرِ كَالطَّاقِ مَمَرَّ الْحُوتِ، فَكَانَ لِفَتَاهُ عَجَبًا، وَلِلْحُوتِ سَرَبًا قَالَ فَلَمَّا انْتَهَيَا إِلَى الصَّخْرَةِ، إِذْ هُمَا بِرَجُلٍ مُسَجًّى بِثَوْبٍ، فَسَلَّمَ عَلَيْهِ مُوسَى قَالَ وَأَنَّى بِأَرْضِكَ السَّلاَمُ فَقَالَ أَنَا مُوسَى‏.‏ قَالَ مُوسَى بَنِي إِسْرَائِيلَ قَالَ نَعَمْ هَلْ أَتَّبِعُكَ عَلَى أَنْ تُعَلِّمَنِي مِمَّا عُلِّمْتَ رَشَدًا‏.‏ قَالَ لَهُ الْخَضِرُ يَا مُوسَى إِنَّكَ عَلَى عِلْمٍ مِنْ عِلْمِ اللَّهِ عَلَّمَكَهُ اللَّهُ لاَ أَعْلَمُهُ، وَأَنَا عَلَى عِلْمٍ مِنْ عِلْمِ اللَّهِ عَلَّمَنِيهِ اللَّهُ لاَ تَعْلَمُهُ‏.‏ قَالَ بَلْ أَتَّبِعُكَ‏.‏ قَالَ فَإِنِ اتَّبَعْتَنِي فَلاَ تَسْأَلْنِي عَنْ شَىْءٍ حَتَّى أُحْدِثَ لَكَ مِنْهُ ذِكْرًا، فَانْطَلَقَا يَمْشِيَانِ عَلَى السَّاحِلِ فَمَرَّتْ بِهِمَا سَفِينَةٌ فَعُرِفَ الْخَضِرُ فَحَمَلُوهُمْ فِي سَفِينَتِهِمْ بِغَيْرِ نَوْلٍ ـ يَقُولُ بِغَيْرِ أَجْرٍ ـ فَرَكِبَا السَّفِينَةَ قَالَ وَوَقَعَ عُصْفُورٌ عَلَى حَرْفِ السَّفِينَةِ، فَغَمَسَ مِنْقَارَهُ الْبَحْرَ فَقَالَ الْخَضِرُ لِمُوسَى مَا عِلْمُكَ وَعِلْمِي وَعِلْمُ الْخَلاَئِقِ فِي عِلْمِ اللَّهِ إِلاَّ مِقْدَارُ مَا غَمَسَ هَذَا الْعُصْفُورُ مِنْقَارَهُ قَالَ فَلَمْ يَفْجَأْ مُوسَى، إِذْ عَمَدَ الْخَضِرُ إِلَى قَدُومٍ فَخَرَقَ السَّفِينَةَ، فَقَالَ لَهُ مُوسَى قَوْمٌ حَمَلُونَا بِغَيْرِ نَوْلٍ، عَمَدْتَ إِلَى سَفِينَتِهِمْ فَخَرَقْتَهَا ‏{‏لِتُغْرِقَ أَهْلَهَا لَقَدْ جِئْتَ‏}‏ الآيَةَ فَانْطَلَقَا إِذَا هُمَا بِغُلاَمٍ يَلْعَبُ مَعَ الْغِلْمَانِ، فَأَخَذَ الْخَضِرُ بِرَأْسِهِ فَقَطَعَهُ‏.‏ قَالَ لَهُ مُوسَى ‏{‏أَقَتَلْتَ نَفْسًا زَكِيَّةً بِغَيْرِ نَفْسٍ لَقَدْ جِئْتَ شَيْئًا نُكْرًا * قَالَ أَلَمْ أَقُلْ لَكَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا‏}‏ إِلَى قَوْلِهِ ‏{‏فَأَبَوْا أَنْ يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ‏}‏ فَقَالَ بِيَدِهِ هَكَذَا فَأَقَامَهُ، فَقَالَ لَهُ مُوسَى إِنَّا دَخَلْنَا هَذِهِ الْقَرْيَةَ، فَلَمْ يُضَيِّفُونَا وَلَمْ يُطْعِمُونَا، لَوْ شِئْتَ لاَتَّخَذْتَ عَلَيْهِ أَجْرًا‏.‏ قَالَ هَذَا فِرَاقُ بَيْنِي وَبَيْنِكَ سَأُنَبِّئُكَ بِتَأْوِيلِ مَا لَمْ تَسْتَطِعْ عَلَيْهِ صَبْرًا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَدِدْنَا أَنَّ مُوسَى صَبَرَ حَتَّى يُقَصَّ عَلَيْنَا مِنْ أَمْرِهِمَا ‏\"‏‏.‏ قَالَ وَكَانَ ابْنُ عَبَّاسٍ يَقْرَأُ وَكَانَ أَمَامَهُمْ مَلِكٌ يَأْخُذُ كُلَّ سَفِينَةٍ صَالِحَةٍ غَصْبًا، وَأَمَّا الْغُلاَمُ فَكَانَ كَافِرًا‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏قُلْ هَلْ نُنَبِّئُكُمْ بِالأَخْسَرِينَ أَعْمَالاً‏}",
                "headingUrdu": "ارشادِ باری تعالیٰ ہے: \"(اے محمد صلی اللہ علیہ وسلم) کہو: کیا ہم تمہیں (ان کے) اعمال کے لحاظ سے سب سے زیادہ خسارہ پانے والے بتادیں؟\" (V.18:103)",
                "headingEnglish": "The Statement of Allah the Most High: \"Say (O Muḥammad pbuh): 'Shall We tell you the greatest losers in respect of (their) deeds?\" (V.18:103)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4507,
                "hadithNumber": "4728",
                "englishNarrator": "Narrated Mus`ab:",
                "hadithEnglish": "I asked my father, \"Was the Verse:-- 'Say: (O Muhammad) Shall We tell you the greatest losers in respect of their deeds?'(18.103) revealed regarding Al-Haruriyya?\" He said, \"No, but regarding the Jews and the Christians, for the Jews disbelieved Muhammad and the Christians disbelieved in Paradise and say that there are neither meals nor drinks therein. Al- Hururiyya are those people who break their pledge to Allah after they have confirmed that they will fulfill it, and Sa`d رضی اللہ عنہ used to call them 'Al-Fasiqin (evildoers who forsake Allah's obedience).",
                "hadithUrdu": "میں نے اپنے والد ( سعد بن ابی وقاص رضی اللہ عنہ ) سے آیت «قل هل ننبئكم بالأخسرين أعمالا‏» کے متعلق سوال کیا کہ ان سے کون لوگ مراد ہیں؟ کیا ان سے خوارج مراد ہیں؟ انہوں نے کہا کہ نہیں، اس سے مراد یہود و نصاریٰ ہیں۔ یہود نے تو محمد صلی اللہ علیہ وسلم کی تکذیب کی اور نصاریٰ نے جنت کا انکار کیا اور کہا کہ اس میں کھانے پینے کی کوئی چیز نہیں ملے گی اور خوارج وہ ہیں جنہوں نے اللہ کے عہد و میثاق کو توڑا سعد رضی اللہ عنہ انہیں فاسق کہا کرتے تھے۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے عمرو بن مرہ نے، ان سے مصعب بن سعد بن ابی وقاص نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنْ مُصْعَبٍ، قَالَ سَأَلْتُ أَبِي ‏{‏قُلْ هَلْ نُنَبِّئُكُمْ بِالأَخْسَرِينَ أَعْمَالاً‏}‏ هُمُ الْحَرُورِيَّةُ قَالَ لاَ، هُمُ الْيَهُودُ وَالنَّصَارَى، أَمَّا الْيَهُودُ فَكَذَّبُوا مُحَمَّدًا صلى الله عليه وسلم وَأَمَّا النَّصَارَى كَفَرُوا بِالْجَنَّةِ وَقَالُوا لاَ طَعَامَ فِيهَا وَلاَ شَرَابَ، وَالْحَرُورِيَّةُ الَّذِينَ يَنْقُضُونَ عَهْدَ اللَّهِ مِنْ بَعْدِ مِيثَاقِهِ، وَكَانَ سَعْدٌ يُسَمِّيهِمُ الْفَاسِقِينَ‏.‏",
                "headingArabic": "‏{‏قَالَ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ‏}‏ الآيَةَ",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: \"آپ صلی اللہ علیہ وسلم نے فرمایا: تمہیں یاد ہے جب ہم نے اپنے آپ کو چٹان سے پکڑ لیا تھا۔\" (V.18:63)",
                "headingEnglish": "The Statement of Allāh the Exalted: \"He said: 'Do you remember when we betook ourselves to the rock.\" (V.18:63)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4508,
                "hadithNumber": "4729",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"On the Day of Resurrection, a huge fat man will come who will not weigh, the weight of the wing of a mosquito in Allah's Sight.\" and then the Prophet (ﷺ) added, 'We shall not give them any weight on the Day of Resurrection ' (18.105) Yahya bin Bokhair from Mogheerah bin Abdur Rehman and he from Abu Zinad reports it in the same way.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ بلاشبہ قیامت کے دن ایک بہت بھاری بھر کم موٹا تازہ شخص آئے گا لیکن وہ اللہ کے نزدیک مچھر کے پر کے برابر بھی کوئی قدر نہیں رکھے گا اور فرمایا کہ پڑھو «فلا نقيم لهم يوم القيامة وزنا‏» ”قیامت کے دن ہم ان کا کوئی وزن نہ کریں گے۔“ اس حدیث کو محمد بن عبداللہ نے یحییٰ بن بکیر سے، انہوں نے مغیرہ بن عبدالرحمٰن سے، انہوں نے ابوالزناد سے ایسا ہی روایت کیا ہے۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ ذہلی نے بیان کیا، کہا ہم سے سعید بن ابی مریم نے بیان کیا، کہا ہم کو مغیرہ بن عبدالرحمٰن نے خبر دی، کہا کہ مجھ سے ابوالزناد نے بیان کیا، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا الْمُغِيرَةُ، قَالَ حَدَّثَنِي أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّهُ لَيَأْتِي الرَّجُلُ الْعَظِيمُ السَّمِينُ يَوْمَ الْقِيَامَةِ لاَ يَزِنُ عِنْدَ اللَّهِ جَنَاحَ بَعُوضَةٍ وَقَالَ اقْرَءُوا ‏{‏فَلاَ نُقِيمُ لَهُمْ يَوْمَ الْقِيَامَةِ وَزْنًا‏}‏ ‏\"‏‏.‏ وَعَنْ يَحْيَى بْنِ بُكَيْرٍ عَنِ الْمُغِيرَةِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي الزِّنَادِ مِثْلَهُ‏.‏",
                "headingArabic": "‏{‏أُولَئِكَ الَّذِينَ كَفَرُوا بِآيَاتِ رَبِّهِمْ وَلِقَائِهِ فَحَبِطَتْ أَعْمَالُهُمْ‏}‏ الآيَةَ",
                "headingUrdu": "’’یہ وہ لوگ ہیں جنہوں نے اپنے رب کی آیات اور اس سے ملاقات (آخرت میں) کو جھٹلایا، پس ان کے اعمال رائیگاں ہیں۔‘‘ V.18:105)",
                "headingEnglish": "\"They are those who deny in the Ayāt (proofs, evidences, verses, lessons, signs, revelations, etc.) of their Lord and the Meeting with Him (in the Hereafter). So their works are in vain...\" (V.18:105)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4509,
                "hadithNumber": "4730",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"On the Day of Resurrection Death will be brought forward in the shape of a black and white ram. Then a call maker will call, 'O people of Paradise!' Thereupon they will stretch their necks and look carefully. The caller will say, 'Do you know this?' They will say, 'Yes, this is Death.' By then all of them will have seen it. Then it will be announced again, 'O people of Hell !' They will stretch their necks and look carefully. The caller will say, 'Do you know this?' They will say, 'Yes, this is Death.' And by then all of them will have seen it. Then it (that ram) will be slaughtered and the caller will say, 'O people of Paradise! Eternity for you and no death O people of Hell! Eternity for you and no death.\"' Then the Prophet, recited:-- 'And warn them of the Day of distress carelessnesswhen the case has been decided, while (now) they are in a state of  (i.e. the people of the world) and they do not believe.' (19.39)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ قیامت کے دن موت ایک چتکبرے مینڈھے کی شکل میں لائی جائے گی۔ ایک آواز دینے والا فرشتہ آواز دے گا کہ اے جنت والو! تمام جنتی گردن اٹھا اٹھا کر دیکھیں گے، آواز دینے والا فرشتہ پوچھے گا۔ تم اس مینڈھے کو بھی پہچانتے ہو؟ وہ بولیں گے کہ ہاں، یہ موت ہے اور ان سے ہر شخص اس کا ذائقہ چکھ چکا ہو گا۔ پھر اسے ذبح کر دیا جائے گا اور آواز دینے والا جنتیوں سے کہے گا کہ اب تمہارے لیے ہمیشگی ہے، موت تم پر کبھی نہ آئے گی اور اے جہنم والو! تمہیں بھی ہمیشہ اسی طرح رہنا ہے، تم پر بھی موت کبھی نہیں آئے گی۔ پھر آپ صلی اللہ علیہ وسلم نے یہ آیت تلاوت کی «وأنذرهم يوم الحسرة إذ قضي الأمر وهم في غفلة‏» الخ ”اور انہیں حسرت کے دن سے ڈرا دو۔ جبکہ اخیر فیصلہ کر دیا جائے گا اور یہ لوگ غفلت میں پڑے ہوئے ہیں ( یعنی دنیادار لوگ ) اور ایمان نہیں لاتے۔“",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا ہم سے ہمارے والد نے، ہم سے اعمش نے، ہم سے ابوصالح نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُؤْتَى بِالْمَوْتِ كَهَيْئَةِ كَبْشٍ أَمْلَحَ فَيُنَادِي مُنَادٍ يَا أَهْلَ الْجَنَّةِ، فَيَشْرَئِبُّونَ وَيَنْظُرُونَ فَيَقُولُ هَلْ تَعْرِفُونَ هَذَا فَيَقُولُونَ نَعَمْ هَذَا الْمَوْتُ، وَكُلُّهُمْ قَدْ رَآهُ، ثُمَّ يُنَادِي يَا أَهْلَ النَّارِ، فَيَشْرَئِبُّونَ وَيَنْظُرُونَ، فَيَقُولُ هَلْ تَعْرِفُونَ هَذَا فَيَقُولُونَ نَعَمْ هَذَا الْمَوْتُ، وَكُلُّهُمْ قَدْ رَآهُ، فَيُذْبَحُ ثُمَّ يَقُولُ يَا أَهْلَ الْجَنَّةِ، خُلُودٌ فَلاَ مَوْتَ، وَيَا أَهْلَ النَّارِ، خُلُودٌ فَلاَ مَوْتَ ثُمَّ قَرَأَ ‏{‏وَأَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ إِذْ قُضِيَ الأَمْرُ وَهُمْ فِي غَفْلَةٍ‏}‏ وَهَؤُلاَءِ فِي غَفْلَةٍ أَهْلُ الدُّنْيَا ‏{‏وَهُمْ لاَ يُؤْمِنُونَ‏}‏‏\"‏",
                "headingArabic": "‏{‏وَكَانَ الإِنْسَانُ أَكْثَرَ شَىْءٍ جَدَلاً‏}‏",
                "headingUrdu": "\"لیکن انسان کسی بھی چیز سے زیادہ جھگڑالو ہوتا ہے۔\" (V.18:54)",
                "headingEnglish": "\"But man is ever more quarrelsome than anything.\" (V.18:54)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4510,
                "hadithNumber": "4731",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said to Gabriel, \"What prevents you from visiting us more often than you visit us now?\" So there was revealed:-- 'And we (angels) descend not but by the command of your Lord. To Him belongs what is before us and what is behind us...'(19.64)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے جبرائیل علیہ السلام نے فرمایا ”جیسا کہ اب آپ ہماری ملاقات کو آیا کرتے ہیں، اس سے زیادہ آپ ہم سے ملنے کے لیے کیوں نہیں آیا کرتے؟ اس پر یہ آیت نازل ہوئی «وما نتنزل إلا بأمر ربك له ما بين أيدينا وما خلفنا‏» الخ یعنی ”ہم ( فرشتے ) نازل نہیں ہوتے بجز آپ کے پروردگار کے حکم کے، اسی کی ملک ہے جو کچھ ہمارے آگے ہے اور جو کچھ ہمارے پیچھے ہے۔“",
                "urduNarrator": "ہم سے ابونعیم فضل بن دکین نے بیان کیا، کہا ہم سے عمر بن ذر نے بیان کیا، کہا کہ میں نے اپنے والد سے سنا، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عُمَرُ بْنُ ذَرٍّ، قَالَ سَمِعْتُ أَبِي، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِجِبْرِيلَ ‏\"‏ مَا يَمْنَعُكَ أَنْ تَزُورَنَا أَكْثَرَ مِمَّا تَزُورُنَا فَنَزَلَتْ ‏{‏وَمَا نَتَنَزَّلُ إِلاَّ بِأَمْرِ رَبِّكَ لَهُ مَا بَيْنَ أَيْدِينَا وَمَا خَلْفَنَا‏}‏‏\"‏",
                "headingArabic": "‏{‏وَإِذْ قَالَ مُوسَى لِفَتَاهُ لاَ أَبْرَحُ حَتَّى أَبْلُغَ مَجْمَعَ الْبَحْرَيْنِ أَوْ أَمْضِيَ حُقُبًا‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’اور (یاد کرو) جب موسیٰ (علیہ السلام) نے اپنے نوکر سے کہا کہ میں اس وقت تک سفر نہیں چھوڑوں گا جب تک کہ میں دو سمندروں کے سنگم پر نہ پہنچ جاؤں یا (یہاں تک کہ) سال گزاروں۔ سفر میں سال.\" (V.18:60)",
                "headingEnglish": "The Statement of Allah the Exalted: \"And (remember) when Mūsa (Moses) said to his boy-servant: 'I will not give up (travelling) until I reach the junction of the two seas or (until) I spend years and years in travelling.\" (V.18:60)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4511,
                "hadithNumber": "4732",
                "englishNarrator": "Narrated Khabbab رضی اللہ عنہ :",
                "hadithEnglish": "I came to Al-`Asi bin Wail As-Sahmi and demanded something which he owed me. He said, \"I will not give you (your money) till you disbelieve in Muhammad.\" I said, \"No, I shall not disbelieve in Muhammad till you die and then be resurrected.\" He said, \"Will I die and then be resurrected?\" I said, 'Yes'. He said', \"Then I will have wealth and children there, and I will pay you (there).\" So this Verse was revealed:-- 'Have you then seen him who disbelieved in Our Signs and (yet) says: I shall certainly be given wealth and children? (19.77) Sufyan thauri, Shobah, Hafs Abu Moaviyah and Waki reported it from Aamash.",
                "hadithUrdu": "میں عاص بن وائل سہمی کے پاس اپنا حق مانگنے گیا تو وہ کہنے لگا کہ جب تک تم محمد صلی اللہ علیہ وسلم سے کفر نہیں کرو گے میں تمہیں مزدوری نہیں دوں گا۔ میں نے اس پر کہا کہ یہ کبھی نہیں کر سکتا۔ یہاں تک کہ تم مرنے کے بعد پھر زندہ کئے جاؤ۔ اس پر وہ بولا، کیا مرنے کے بعد پھر مجھے زندہ کیا جائے گا؟ میں نے کہا ہاں، ضرور، کہنے لگا کہ پھر وہاں بھی میرے پاس مال اولاد ہو گی اور میں وہیں تمہاری مزدوری بھی دے دوں گا۔ اس پر یہ آیت نازل ہوئی «أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏» کہ ”بھلا آپ نے اس شخص کو بھی دیکھا جو ہماری نشانیوں سے کفر کرتا ہے اور کہتا ہے کہ مجھے مال اور اولاد مل کر رہیں گے۔“ اس حدیث کو سفیان ثوری اور شعبہ اور حفص اور ابومعاویہ اور وکیع نے بھی اعمش سے روایت کیا ہے۔",
                "urduNarrator": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے اعمش نے، ان سے ابوالضحیٰ (مسلم بن صبیح) نے، ان سے مسروق بن اجدع نے بیان کیا کہ میں نے خباب بن ارت رضی اللہ عنہ سے سنا، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، قَالَ سَمِعْتُ خَبَّابًا، قَالَ جِئْتُ الْعَاصِيَ بْنَ وَائِلٍ السَّهْمِيَّ أَتَقَاضَاهُ حَقًّا لِي عِنْدَهُ، فَقَالَ لاَ أُعْطِيكَ حَتَّى تَكْفُرَ بِمُحَمَّدٍ فَقُلْتُ لاَ حَتَّى تَمُوتَ ثُمَّ تُبْعَثَ‏.‏ قَالَ وَإِنِّي لَمَيِّتٌ ثُمَّ مَبْعُوثٌ قُلْتُ نَعَمْ‏.‏ قَالَ إِنَّ لِي هُنَاكَ مَالاً وَوَلَدًا فَأَقْضِيكَهُ، فَنَزَلَتْ هَذِهِ الآيَةُ ‏{‏أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لأُوتَيَنَّ مَالاً وَوَلَدًا‏}‏ رَوَاهُ الثَّوْرِيُّ وَشُعْبَةُ وَحَفْصٌ وَأَبُو مُعَاوِيَةَ وَوَكِيعٌ عَنِ الأَعْمَشِ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏فَلَمَّا بَلَغَا مَجْمَعَ بَيْنِهِمَا نَسِيَا حُوتَهُمَا فَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ سَرَبًا‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’لیکن جب وہ دونوں سمندروں کے سنگم پر پہنچے تو اپنی مچھلی کو بھول گئے اور اس نے سمندر میں سرنگ کی طرح راستہ اختیار کیا۔‘‘ (V.18:61)",
                "headingEnglish": "The Statement of Allah the Most High: \"But when they reached the junction of the two seas, they forgot their fish, and it took its way through the sea as in a tunnel.\" (V.18:61)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4512,
                "hadithNumber": "4733",
                "englishNarrator": "Narrated Khabbab رضی اللہ عنہ :",
                "hadithEnglish": "I was a blacksmith in Mecca Once I made a sword for Al-`Asi bin Wail As-Sahmi. When I went to demand its price, he said, \"I will not give it to you till you disbelieve in Muhammad.\" I said, \"I shall not disbelieve in Muhammad till Allah make you die and then bring you to life again.\" He said, \"If Allah should make me die and then resurrect me and I would have wealth and children.\" So Allah revealed:-- 'Have you seen him who disbelieved in Our Signs, and (yet) says I shall certainly be given wealth and children? Has he known the unseen or has he taken a covenant from (Allah) the Beneficent?' (19.77- 78) In this report the word ''مَوْثِقًا‏'' has been used but report of Ashjani from Sufyan does not have the words ''سَيْفًا '' as well as ''مَوْثِقًا‏''.''",
                "hadithUrdu": "میں مکہ میں لوہار تھا اور عاص بن وائل سہمی کے لیے میں نے ایک تلوار بنائی تھی۔ میری مزدوری باقی تھی اس لیے ایک دن میں اس کو مانگنے آیا تو کہنے لگا کہ اس وقت تک نہیں دوں گا جب تک تم محمد صلی اللہ علیہ وسلم سے پھر نہیں جاؤ گے۔ میں نے کہا کہ میں نبی کریم صلی اللہ علیہ وسلم سے ہرگز نہیں پھروں گا یہاں تک کہ اللہ تجھے مار دے اور پھر زندہ کر دے اور وہ کہنے لگا کہ جب اللہ تعالیٰ مجھے مار کر دوبارہ زندہ کر دے گا تو میرے پاس اس وقت بھی مال و اولاد ہو گی۔ اور اسی وقت تم اپنی مزدوری مجھ سے لے لینا۔ اس پر اللہ تعالیٰ نے یہ آیت نازل کی «أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا * أطلع الغيب أم اتخذ عند الرحمن عهدا‏» کہ ”بھلا تو نے اس شخص کو بھی دیکھا جو ہماری آیتوں کا انکار کرتا ہے اور کہتا ہے کہ مجھے تو مال و اولاد مل کر ہی رہیں گے تو کیا یہ غیب پر مطلع ہو گیا ہے یا اس نے خدائے رحمن سے کوئی وعدہ لے لیا ہے۔“ «عهد‏» کا معنی مضبوط اقرار۔ عبیداللہ اشجعی نے بھی اس حدیث کو سفیان ثوری سے روایت کیا ہے لیکن اس میں تلوار بنانے کا ذکر نہیں ہے نہ عہد کی تفسیر مذکور ہے۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم کو سفیان ثوری نے خبر دی، انہیں اعمش نے، انہیں ابوالضحیٰ نے، انہیں مسروق نے اور ان سے خباب بن ارت رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ خَبَّابٍ، قَالَ كُنْتُ قَيْنًا بِمَكَّةَ، فَعَمِلْتُ لِلْعَاصِي بْنِ وَائِلِ السَّهْمِيِّ سَيْفًا، فَجِئْتُ أَتَقَاضَاهُ فَقَالَ لاَ أُعْطِيكَ حَتَّى تَكْفُرَ بِمُحَمَّدٍ‏.‏ قُلْتُ لاَ أَكْفُرُ بِمُحَمَّدٍ صلى الله عليه وسلم حَتَّى يُمِيتَكَ اللَّهُ، ثُمَّ يُحْيِيَكَ‏.‏ قَالَ إِذَا أَمَاتَنِي اللَّهُ ثُمَّ بَعَثَنِي، وَلِي مَالٌ وَوَلَدٌ فَأَنْزَلَ اللَّهُ ‏{‏أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لأُوتَيَنَّ مَالاً وَوَلَدًا * أَطَّلَعَ الْغَيْبَ أَمِ اتَّخَذَ عِنْدَ الرَّحْمَنِ عَهْدًا‏}‏‏.‏ قَالَ مَوْثِقًا‏.‏ لَمْ يَقُلِ الأَشْجَعِيُّ عَنْ سُفْيَانَ سَيْفًا وَلاَ مَوْثِقًا‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏فَلَمَّا جَاوَزَا قَالَ لِفَتَاهُ آتِنَا غَدَاءَنَا لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَذَا نَصَبًا‏}‏ إِلَى قَوْلِهِ ‏{‏قَصَصًا}‏",
                "headingUrdu": "ارشادِ باری تعالیٰ ہے: ’’پھر جب وہ (مقررہ جگہ سے آگے) آگے بڑھے تو موسیٰ (علیہ السلام) نے اپنے نوکر سے کہا کہ ہمارے لیے صبح کا کھانا لاؤ، بے شک ہم بہت تھکاوٹ میں مبتلا ہیں۔ یہ، ہمارا سفر... (تک) ان کے نقش قدم کو پیچھے ہٹانا!\" (V.18:62,63)",
                "headingEnglish": "The Statement of Allah the Most High: \"So, when they had passed further on (beyond that fixed place), Mūsa (Moses) said to his boy-servant, 'Bring us our morning meal; truly, we have suffered much fatigue in this, our journey... (up to) retracing their footsteps!\" (V.18:62,63)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4513,
                "hadithNumber": "4734",
                "englishNarrator": "Narrated Khabbab رضی اللہ عنہ :",
                "hadithEnglish": "\"During the pre-lslamic period, I was a blacksmith and Al-Asi bin Wail owed me a debt.\" So Khabbab went to him to demand the debt. He said, \"I will not give you (your due) till you disbelieve in Muhammad.\" Khabbab said, \"By Allah, I shall not disbelieve in Muhammad till Allah makes you die and then resurrects you.\" Al-Asi said, \"So leave me till I die and then be resurrected, for I will be given wealth and children whereupon I will pay you your debt.\" So this Verse was revealed:-- 'Have you seen him who disbelieved in Our Signs and, (yet) says: I shall certainly be given wealth and children.' (19.77)",
                "hadithUrdu": "میں زمانہ جاہلیت میں لوہاری کا کام کرتا تھا اور عاص بن وائل پر میرا کچھ قرض تھا۔ بیان کیا کہ میں اس کے پاس اپنا قرض مانگنے گیا تو وہ کہنے لگا کہ جب تک تم محمد صلی اللہ علیہ وسلم کا انکار نہیں کرتے، تمہاری مزدوری نہیں مل سکتی۔ میں نے اس پر جواب دیا کہ اللہ کی قسم! میں ہرگز نبی کریم صلی اللہ علیہ وسلم کا انکار نہیں کر سکتا، یہاں تک کہ اللہ تعالیٰ تجھے مار دے اور پھر تجھے دوبارہ زندہ کر دے۔ عاص کہنے لگا کہ پھر مرنے تک مجھ سے قرض نہ مانگو۔ مرنے کے بعد جب میں زندہ رہوں گا تو مجھے مال و اولاد بھی ملیں گے اور اس وقت تمہارا قرض ادا کر دوں گا۔ اس پر یہ آیت نازل ہوئی «أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏» لخ۔",
                "urduNarrator": "ہم سے بشر بن خالد نے بیان کیا، کہا ہم سے محمد بن جعفر نے بیان کیا، ان سے شعبہ نے، ان سے سلیمان اعمش نے، انہوں نے ابوالضحیٰ سے سنا، ان سے مسروق نے بیان کیا کہ خباب بن ارت رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا بِشْرُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، سَمِعْتُ أَبَا الضُّحَى، يُحَدِّثُ عَنْ مَسْرُوقٍ، عَنْ خَبَّابٍ، قَالَ كُنْتُ قَيْنًا فِي الْجَاهِلِيَّةِ، وَكَانَ لِي دَيْنٌ عَلَى الْعَاصِي بْنِ وَائِلٍ قَالَ فَأَتَاهُ يَتَقَاضَاهُ، فَقَالَ لاَ أُعْطِيكَ حَتَّى تَكْفُرَ بِمُحَمَّدٍ فَقَالَ وَاللَّهِ لاَ أَكْفُرُ حَتَّى يُمِيتَكَ اللَّهُ ثُمَّ تُبْعَثَ‏.‏ قَالَ فَذَرْنِي حَتَّى أَمُوتَ ثُمَّ أُبْعَثَ، فَسَوْفَ أُوتَى مَالاً وَوَلَدًا، فَأَقْضِيكَ فَنَزَلَتْ هَذِهِ الآيَةُ ‏{‏أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لأُوتَيَنَّ مَالاً وَوَلَدًا‏}‏",
                "headingArabic": "قَوْلِهِ ‏{‏قُلْ هَلْ نُنَبِّئُكُمْ بِالأَخْسَرِينَ أَعْمَالاً‏}‏",
                "headingUrdu": "ارشادِ باری تعالیٰ ہے: \"(اے محمد صلی اللہ علیہ وسلم) کہو: کیا ہم تمہیں (ان کے) اعمال کے لحاظ سے سب سے زیادہ خسارہ پانے والے بتادیں؟\" (V.18:103)",
                "headingEnglish": "The Statement of Allah the Most High: \"Say (O Muḥammad pbuh): 'Shall We tell you the greatest losers in respect of (their) deeds?\" (V.18:103)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4514,
                "hadithNumber": "4735",
                "englishNarrator": "Narrated Khabbab:",
                "hadithEnglish": "I was a blacksmith and Al-Asi Bin Wail owed me a debt, so I went to him to demand it. He said to me. \"I will not pay you your debt till you disbelieve in Muhammad.\" I said, \"I will not disbelieve in Muhammad till you die and then be resurrected.\" He said, \"Will I be resurrected after my death? If so, I shall pay you (there) if I should find wealth and children.\" So there was revealed:-- 'Have you seen him who disbelieved in Our Signs, and yet says: I shall certainly be given wealth and children? Has he, known to the unseen or has he taken a covenant from (Allah) the Beneficent? Nay ! We shall record what he says, and we shall add and add to his punishment. And We shall inherit from him all that he talks of, and he shall appear before Us alone.' (19.77-80)",
                "hadithUrdu": "میں پہلے لوہار تھا اور عاص بن وائل پر میرا قرض چاہئے تھا۔ میں اس کے پاس تقاضا کرنے گیا تو کہنے لگا کہ جب تک تم محمد صلی اللہ علیہ وسلم سے نہ پھر جاؤ گے تمہارا قرض نہیں دوں گا، میں نے کہا کہ میں نبی کریم صلی اللہ علیہ وسلم کے دین سے ہرگز نہیں پھروں گا۔ یہاں تک کہ اللہ تعالیٰ تجھے مار دے اور پھر زندہ کر دے۔ اس نے کہا کیا موت کے بعد میں دوبارہ زندہ کیا جاؤں گا پھر تو مجھے مال و اولاد بھی مل جائیں گے اور اسی وقت تمہارا قرض بھی ادا کر دوں گا۔ راوی نے بیان کیا کہ اس کے متعلق آیت نازل ہوئی «أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا * أطلع الغيب أم اتخذ عند الرحمن عهدا * كلا سنكتب ما يقول ونمد له من العذاب مدا * ونرثه ما يقول ويأتينا فردا‏» کہ ”بھلا تم نے اس شخص کو بھی دیکھا جو ہماری آیتوں کا انکار کرتا ہے اور کہتا ہے کہ مجھے تو مال اور اولاد مل کر رہیں گے، تو کیا یہ غیب پر آگاہ ہو گیا ہے۔ یا اس نے خدائے رحمن سے کوئی عہد کر لیا ہے؟ ہرگز نہیں، البتہ ہم اس کا کہا ہوا بھی لکھ لیتے ہیں اور اس کے لیے عذاب بڑھاتے ہی چلے جائیں گے اور اس کی کہی ہوئی کے ہم ہی مالک ہوں گے اور وہ ہمارے پاس اکیلا آئے گا۔“",
                "urduNarrator": "ہم سے یحییٰ بن موسیٰ بلخی نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، ان سے اعمش نے، ان سے ابوالضحیٰ نے، ان سے مسروق نے اور ان سے خباب بن ارت نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ خَبَّابٍ، قَالَ كُنْتُ رَجُلاً قَيْنًا، وَكَانَ لِي عَلَى الْعَاصِي بْنِ وَائِلٍ دَيْنٌ فَأَتَيْتُهُ أَتَقَاضَاهُ، فَقَالَ لِي لاَ أَقْضِيكَ حَتَّى تَكْفُرَ بِمُحَمَّدٍ‏.‏ قَالَ قُلْتُ لَنْ أَكْفُرَ بِهِ حَتَّى تَمُوتَ ثُمَّ تُبْعَثَ‏.‏ قَالَ وَإِنِّي لَمَبْعُوثٌ مِنْ بَعْدِ الْمَوْتِ فَسَوْفَ أَقْضِيكَ إِذَا رَجَعْتُ إِلَى مَالٍ وَوَلَدٍ‏.‏ قَالَ فَنَزَلَتْ ‏{‏أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لأُوتَيَنَّ مَالاً وَوَلَدًا * أَطَّلَعَ الْغَيْبَ أَمِ اتَّخَذَ عِنْدَ الرَّحْمَنِ عَهْدًا * كَلاَّ سَنَكْتُبُ مَا يَقُولُ وَنَمُدُّ لَهُ مِنَ الْعَذَابِ مَدًّا * وَنَرِثُهُ مَا يَقُولُ وَيَأْتِينَا فَرْدًا‏}‏‏.‏",
                "headingArabic": "‏{‏قَالَ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ‏}‏ الآيَةَ",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: \"آپ صلی اللہ علیہ وسلم نے فرمایا: تمہیں یاد ہے جب ہم نے اپنے آپ کو چٹان سے پکڑ لیا تھا۔\" (V.18:63)",
                "headingEnglish": "The Statement of Allāh the Exalted: \"He said: 'Do you remember when we betook ourselves to the rock.\" (V.18:63)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4515,
                "hadithNumber": "4736",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Adam and Moses met, and Moses said to Adam \"You are the one who made people miserable and turned them out of Paradise.\" Adam said to him, \"You are the one whom Allah selected for His message and whom He selected for Himself and upon whom He revealed the Torah.\" Moses said, 'Yes.' Adam said, \"Did you find that written in my fate before my creation?' Moses said, 'Yes.' So Adam overcame Moses with this argument.\" Hadrat Moses' objection. ''اليم'' means: Ocean.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ( عالم مثال میں ) آدم علیہ السلام اور موسیٰ علیہ السلام کی ملاقات ہوئی تو موسیٰ علیہ السلام نے آدم علیہ السلام سے کہا کہ آپ ہی نے لوگوں کو پریشانی میں ڈالا اور انہیں جنت سے نکالا۔ آدم علیہ السلام نے جواب دیا کہ آپ وہی ہیں جنہیں اللہ تعالیٰ نے اپنی رسالت کے لیے پسند کیا اور خود اپنے لیے پسند کیا اور آپ پر توریت نازل کی۔ موسیٰ علیہ السلام نے کہا کہ جی ہاں۔ اس پر آدم علیہ السلام نے فرمایا کہ پھر آپ نے تو دیکھا ہی ہو گا کہ میری پیدائش سے پہلے ہی یہ سب کچھ میرے لیے لکھ دیا گیا تھا۔ موسیٰ علیہ السلام نے فرمایا کہ جی ہاں معلوم ہے۔ چنانچہ آدم علیہ السلام موسیٰ علیہ السلام پر غالب آ گئے۔ «اليم» کے معنی دریا کے ہیں۔",
                "urduNarrator": "ہم سے صلت بن محمد نے بیان کیا، کہا ہم سے مہدی بن میمون نے، ان سے محمد بن سیرین نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْتَقَى آدَمُ وَمُوسَى، فَقَالَ مُوسَى لآدَمَ أَنْتَ الَّذِي أَشْقَيْتَ النَّاسَ وَأَخْرَجْتَهُمْ مِنَ الْجَنَّةِ قَالَ لَهُ آدَمُ أَنْتَ الَّذِي اصْطَفَاكَ اللَّهُ بِرِسَالَتِهِ، وَاصْطَفَاكَ لِنَفْسِهِ وَأَنْزَلَ عَلَيْكَ التَّوْرَاةَ قَالَ نَعَمْ‏.‏ قَالَ فَوَجَدْتَهَا كُتِبَ عَلَىَّ قَبْلَ أَنْ يَخْلُقَنِي قَالَ نَعَمْ‏.‏ فَحَجَّ آدَمُ مُوسَى ‏\"‏‏.‏ الْيَمُّ الْبَحْرُ‏.‏",
                "headingArabic": null,
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور میں نے تمہیں اپنے لیے چن لیا ہے۔‘‘ (V.20:41) (یعنی، میری وحی اور میرے پیغام کے لیے، یا آپ کو اپنے لیے پیدا کیا یا آپ کو تقویت دی اور سکھایا کہ اپنے بندوں کو میرا پیغام کیسے پہنچانا ہے)]\"۔",
                "headingEnglish": "The Statement of Allāh the Exalted: \"And I have chosen you for Myself.\" (V.20:41) (i.e., for My Revelation and My Message, or created you for Myself or strengthened and taught you as to how to preach My Message to My worshippers)] .\"",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4516,
                "hadithNumber": "4737",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) arrived at Medina, he found the Jews observing the fast on the day of 'Ashura' (10th of Muharram). The Prophet (ﷺ) asked them (about it) and they replied, \"This is the day when Moses became victorious over Pharaoh.\" The Prophet (ﷺ) said (to the Muslims), \"We are nearer to Moses than they, so fast on this day.\"",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم مدینہ تشریف لائے تو یہودی عاشورہ کا روزہ رکھتے تھے۔ نبی کریم صلی اللہ علیہ وسلم نے ان سے اس کے متعلق پوچھا تو انہوں نے بتایا کہ اس دن موسیٰ علیہ السلام نے فرعون پر غلبہ پایا تھا۔ آپ صلی اللہ علیہ وسلم نے اس پر فرمایا کہ پھر ہم ان کے مقابلے میں موسیٰ کے زیادہ حقدار ہیں۔ مسلمانو! تم لوگ بھی اس دن روزہ رکھو ( پھر آپ صلی اللہ علیہ وسلم نے یہود کی مشابہت سے بچنے کے لیے اس کے ساتھ ایک روزہ اور ملانے کا حکم صادر فرمایا جو اب بھی مسنون ہے۔ )",
                "urduNarrator": "مجھ سے یعقوب بن ابراہیم نے بیان کیا، کہا ہم سے روح بن عبادہ نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے ابوبشر نے بیان کیا، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ، وَالْيَهُودُ تَصُومُ عَاشُورَاءَ، فَسَأَلَهُمْ، فَقَالُوا هَذَا الْيَوْمُ الَّذِي ظَهَرَ فِيهِ مُوسَى عَلَى فِرْعَوْنَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ نَحْنُ أَوْلَى بِمُوسَى مِنْهُمْ فَصُومُوهُ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَلَقَدْ أَوْحَيْنَا إِلَى مُوسَى أَنْ أَسْرِ بِعِبَادِي فَاضْرِبْ لَهُمْ طَرِيقًا فِي الْبَحْرِ يَبَسًا لاَ تَخَافُ دَرَكًا وَلاَ تَخْشَى * فَأَتْبَعَهُمْ فِرْعَوْنُ بِجُنُودِهِ فَغَشِيَهُمْ مِنَ الْيَمِّ مَا غَشِيَهُمْ * وَأَضَلَّ فِرْعَوْنُ قَوْمَهُ وَمَا هَدَى‏}‏",
                "headingUrdu": "اور بیشک ہم نے موسیٰ (علیہ السلام) کی طرف وحی بھیجی کہ عبادی (میرے بندوں) کے ساتھ راتوں رات سفر کرو اور ان کے لیے سمندر میں خشک راستہ بنا دو، اس ڈر سے کہ فرعون پکڑ نہ جائے۔ اور نہ ہی ڈرنا (سمندر میں ڈوبنے سے)۔ پھر فرعون نے اپنے لشکروں کے ساتھ ان کا تعاقب کیا، لیکن سمندر کے پانی نے انہیں مکمل طور پر ڈھانپ لیا اور انہیں ڈھانپ لیا، اور فرعون نے اپنی قوم کو گمراہ کر دیا، اور اس نے ان کی رہنمائی نہ کی۔\" (V.20:77-79)",
                "headingEnglish": "\"And indeed We revealed to Musa (Moses) (saying): 'Travel by night with 'Ibâdi (My slaves) and strike a dry path for them in the sea, fearing neither to be overtaken [by Fir'aūn (Pharaoh)], nor being afraid (of drowning in the sea).' Then Fir'aūn (Pharaoh) pursued them with his hosts, but the sea-water completely overwhelmed them and covered them up. And Fir'aun (Pharaoh) led his people astray, and he did not guide them.\" (V.20:77-79)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4517,
                "hadithNumber": "4738",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Moses argued with Adam and said to him (Adam), 'You are the one who got the people out of Paradise by your sin, and thus made them miserable.\" Adam replied, 'O Moses! You are the one whom Allah selected for His Message and for His direct talk. Yet you blame me for a thing which Allah had ordained for me before He created me?.\" Allah's Messenger (ﷺ) further said, \"So Adam overcame Moses by this Argument.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ موسیٰ علیہ السلام نے آدم علیہ السلام سے بحث کی اور ان سے کہا کہ آپ ہی نے اپنی غلطی کے نتیجہ میں انسانوں کو جنت سے نکالا اور مشقت میں ڈالا۔ آدم علیہ السلام بولے کہ اے موسیٰ! آپ کو اللہ نے اپنی رسالت کے لیے پسند فرمایا اور ہم کلامی کا شرف بخشا۔ کیا آپ ایک ایسی بات پر مجھے ملامت کرتے ہیں جسے اللہ تعالیٰ نے میری پیدائش سے بھی پہلے میرے لیے مقرر کر دیا تھا۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا چنانچہ آدم علیہ السلام موسیٰ علیہ السلام پر بحث میں غالب آ گئے۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا، انہوں نے کہا ہم سے ایوب بن نجار نے بیان کیا، ان سے یحییٰ بن ابی بکر نے، ان سے ابوسلمہ بن عبدالرحمٰن نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَيُّوبُ بْنُ النَّجَّارِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ حَاجَّ مُوسَى آدَمَ، فَقَالَ لَهُ أَنْتَ الَّذِي أَخْرَجْتَ النَّاسَ مِنَ الْجَنَّةِ بِذَنْبِكَ وَأَشْقَيْتَهُمْ‏.‏ قَالَ قَالَ آدَمُ يَا مُوسَى أَنْتَ الَّذِي اصْطَفَاكَ اللَّهُ بِرِسَالَتِهِ وَبِكَلاَمِهِ أَتَلُومُنِي عَلَى أَمْرٍ كَتَبَهُ اللَّهُ عَلَىَّ قَبْلَ أَنْ يَخْلُقَنِي أَوْ قَدَّرَهُ عَلَىَّ قَبْلَ أَنْ يَخْلُقَنِي ‏\"‏‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَحَجَّ آدَمُ مُوسَى ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏فَلاَ يُخْرِجَنَّكُمَا مِنَ الْجَنَّةِ فَتَشْقَى‏}‏",
                "headingUrdu": "اللہ عزوجل کا فرمان ہے: \"...پس وہ تم دونوں کو جنت سے نہ نکالے تاکہ تم پریشان ہو جاؤ۔\" (V.20:117)",
                "headingEnglish": "The Statement of Allah the Exalted: \"...So let him not get you both out of Paradise, so that you be distressed.\" (V.20:117)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4518,
                "hadithNumber": "4739",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The Suras of Bani Israel, Al-Kahf, Mariyam, Taha and Al-Anbiya are from the very old Suras which I learnt by heart, and they are my first property. Qatadah says: ''جُذَاذًا‏'' means: To tear into pieces. Hasan Basri says: ''‏فِي فَلَكٍ‏'': The stars spin in the sky as the spinning-wheel spins. Hadrat Ibn-e- Abbas رضی اللہ عنہ says: ''نَفَشَتْ‏'' grazed. ''يُصْحَبُونَ‏': they will be prevented. ''‏أُمَّتُكُمْ أُمَّةً وَاحِدَةً‏'' in Ethiopian language it means fuel. The other learned people say: ''أَحَسُّوا‏'' means: Had an expectation  from him. It is from ''خَامِدِينَ‏'' ''أَحْسَسْتُ‏'' means: extinguished. ''حَصِيدٌ'' uprooted. It is used for singlar dual and plual each. ''‏لاَ يَسْتَحْسِرُونَ‏'': they do not get sick of and ''حَسِيرٌ'' has been derived from it as ''حَسَرْتُ بَعِيرِي''. I have made my camel tired. ''عَمِيقٌ '': far- flung areas. ''نُكِسُوا‏'': turned back. ''صَنْعَةَ لَبُوسٍ'' coats of mail. ''‏تَقَطَّعُوا أَمْرَهُمْ‏'' differed. ''وَالْهَمْسُ '' , وَالْحِسُّ  ''الْحَسِيسُ '' and ''وَالْجَرْسُ'' are synonyms mean faint sound. ''آذَنَّاكَ‏'' notified you. ''آذَنْتُكُمْ‏'' I informed you. So matter is on equal basis and we did not employ any treachery. ''‏لَعَلَّكُمْ تُسْأَلُونَ'': happily you may understand. ''ارْتَضَى‏'' agreed. '' التَّمَاثِيلُ‏''  idols,  ''السِّجِلُّ'' means: register.",
                "hadithUrdu": "سورۃ بنی اسرائیل اور سورۃ کہف اور سورۃ مریم اور سورۃ طہٰ اور سورۃ انبیاء اگلی بہت فصیح سورتوں میں سے ہیں ( جو مکہ میں اتری تھیں ) اور میری پرانی یاد کی ہوئی ہیں۔ قتادہ نے کہا «جذاذا‏» کا معنی ٹکڑے ٹکڑے۔ اور حسن بصری نے کہا «كل في فلك‏» یعنی ہر ایک تارہ ایک ایک آسمان میں گول گھومتا ہے، جیسے سوت کاتنے کا چرخہ۔ «يسبحون‏» یعنی گول گھومتے ہیں۔ ابن عباس رضی اللہ عنہما نے کہا «نفشت‏» کے معنی چر گئیں۔ «يصحبون‏» کے معنی روکے جائیں گے۔ بچائے جائیں گے۔ «أمتكم أمة واحدة‏» یعنی تمہارا دین اور مذہب ایک ہی دین اور مذہب ہے۔ اور عکرمہ نے کہا «حصب‏» حبشی زبان میں جلانے کی لکڑیوں ایندھن کو کہتے ہیں۔ اور لوگوں نے کہا لفظ «أحسوا‏» کے معنی توقع پائی یہ «أحسست‏» سے نکلا ہے یعنی آہٹ پائی۔ «خامدين‏» کے معنی بجھے ہوئے ( یعنی مرے ہوئے ) ۔ «حصيد» کے معنی جڑ سے اکھاڑا گیا، واحد اور تثنیہ اور جمع سب پر یہی لفظ بولا جاتا ہے۔ «لا يستحسرون‏» کے معنی نہیں تھکے اسی سے ہے لفظ «حسير» تھکا ہوا۔ اور «حسرت بعيري‏.‏» کے معنی میں نے اپنے اونٹ کو تھکا دیا۔ «عميق» ‏‏‏‏ کے معنی دور دراز۔ «نكسوا‏» یہ کفر کی طرف پھیرے گئے۔ «صنعة لبوس‏» زرہیں بنانا۔ «تقطعوا أمرهم‏» یعنی اختلاف کیا، جدا جدا طریقہ اختیار کیا۔ «لا يسمعون حسيسها» کے معنی اور لفظ «حس» اور «جرس» اور «همس» کے معانی ایک ہی ہیں یعنی پست آواز۔ «آذناك‏» ہم نے تجھ کو آگاہ کیا عرب لوگ کہتے ہیں۔ «آذنتكم‏» یعنی میں نے تم کو خبر دی تم ہم برابر ہو گئے میں نے کوئی دغا نہیں کی جب آپ مخاطب کو کسی بات کی خبر دے چکے تو آپ اور وہ دونوں برابر ہو گئے اور آپ نے اس سے کوئی دغا نہیں کی۔ اور مجاہد نے کہا «لعلكم تسألون‏» کے معنی یہ ہیں شاید تم سمجھو۔ «ارتضى‏» کے معنی پسند کیا راضی ہوا۔ «التماثيل‏» کے معنی مورتیں بت۔ «السجل» معنی کے خطوں کا مجموعہ دفتر۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر نے، کہا ہم سے شعبہ نے، انہوں نے ابواسحاق سے سنا، کہا میں نے عبدالرحمٰن بن یزید سے سنا، انہوں نے عبداللہ بن مسعود رضی اللہ عنہ سے وہ کہتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ، عَنْ عَبْدِ اللَّهِ، قَالَ بَنِي إِسْرَائِيلَ وَالْكَهْفُ وَمَرْيَمُ وَطَهَ وَالأَنْبِيَاءُ هُنَّ مِنَ الْعِتَاقِ الأُوَلِ، وَهُنَّ مِنْ تِلاَدِي‏.‏ وَقَالَ قَتَادَةُ ‏{‏جُذَاذًا‏}‏ قَطَّعَهُنَّ‏.‏ وَقَالَ الْحَسَنُ ‏{‏فِي فَلَكٍ‏}‏ مِثْلِ فَلْكَةِ الْمِغْزَلِ ‏{‏يَسْبَحُونَ‏}‏ يَدُورُونَ‏.‏ قَالَ ابْنُ عَبَّاسٍ ‏{‏نَفَشَتْ‏}‏ رَعَتْ ‏{‏يُصْحَبُونَ‏}‏ يُمْنَعُونَ‏.‏ ‏{‏أُمَّتُكُمْ أُمَّةً وَاحِدَةً‏}‏ قَالَ دِينُكُمْ دِينٌ وَاحِدٌ‏.‏ وَقَالَ عِكْرِمَةُ‏.‏ ‏{‏حَصَبُ‏}‏ حَطَبُ بِالْحَبَشِيَّةِ‏.‏ وَقَالَ غَيْرُهُ ‏{‏أَحَسُّوا‏}‏ تَوَقَّعُوهُ مِنْ أَحْسَسْتُ‏.‏ ‏{‏خَامِدِينَ‏}‏ هَامِدِينَ‏.‏ حَصِيدٌ مُسْتَأْصَلٌ يَقَعُ عَلَى الْوَاحِدِ وَالاِثْنَيْنِ وَالْجَمِيعِ‏.‏ ‏{‏لاَ يَسْتَحْسِرُونَ‏}‏ لاَ يُعْيُونَ، وَمِنْهُ حَسِيرٌ، وَحَسَرْتُ بَعِيرِي‏.‏ عَمِيقٌ بَعِيدٌ‏.‏ ‏{‏نُكِسُوا‏}‏ رُدُّوا‏.‏ ‏{‏صَنْعَةَ لَبُوسٍ‏}‏ الدُّرُوعُ‏.‏ ‏{‏تَقَطَّعُوا أَمْرَهُمْ‏}‏ اخْتَلَفُوا، الْحَسِيسُ وَالْحِسُّ وَالْجَرْسُ وَالْهَمْسُ وَاحِدٌ، وَهْوَ مِنَ الصَّوْتِ الْخَفِيِّ ‏{‏آذَنَّاكَ‏}‏ أَعْلَمْنَاكَ ‏{‏آذَنْتُكُمْ‏}‏ إِذَا أَعْلَمْتَهُ فَأَنْتَ وَهْوَ عَلَى سَوَاءٍ لَمْ تَغْدِرْ‏.‏ وَقَالَ مُجَاهِدٌ ‏{‏لَعَلَّكُمْ تُسْأَلُونَ‏}‏ تُفْهَمُونَ ‏{‏ارْتَضَى‏}‏ رَضِيَ‏.‏ ‏{‏التَّمَاثِيلُ‏}‏ الأَصْنَامُ، السِّجِلُّ الصَّحِيفَةُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4519,
                "hadithNumber": "4740",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) delivered a sermon and said, \"You (people) will be gathered before Allah (on the Day of Resurrection) bare-footed, naked and uncircumcised.\" (The Prophet (ﷺ) then recited):-- 'As We began the first creation We shall repeat it. (It is) a promise We have undertaken and truly We shall do it.' and added, \"The first man who will be dressed on the Day of Resurrection, will be Abraham. Lo! Some men from my followers will be brought and taken towards the left side, whereupon I will say, 'O Lord, (these are) my companions!' It will be said, 'You do not know what new things they introduced (into the religion) after you.' I will then say as the righteous pious slave, Jesus, said, 'I was a witness over them while I dwelt among them...(to His Statement)..and You are the Witness to all things.' (5.117) Then it will be said, '(O Muhammad) These people never stopped to apostate since you left them.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک دن خطبہ سنایا۔ فرمایا تم قیامت کے دن اللہ کے سامنے ننگے پاؤں ننگے بدن بےختنہ حشر کئے جاؤ گے جیسا کہ ارشاد باری ہے «كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين‏» پھر سب سے پہلے قیامت کے دن ابراہیم علیہ السلام کو کپڑے پہنائے جائیں گے۔ سن لو! میری امت کے کچھ لوگ لائے جائیں گے فرشتے ان کو پکڑ کر بائیں طرف والے دوزخیوں میں لے جائیں گے۔ میں عرض کروں گا پروردگار! یہ تو میرے ساتھ والے ہیں۔ ارشاد ہو گا تم نہیں جانتے انہوں نے تمہاری وفات کے بعد کیا کیا کرتوت کئے ہیں۔ اس وقت میں وہی کہوں گا جو اللہ کے نیک بندے عیسیٰ علیہ السلام نے کہا کہ میں جب تک ان لوگوں میں رہا ان کا حال دیکھتا رہا آخر آیت تک۔ ارشاد ہو گا یہ لوگ اپنی ایڑیوں کے بل اسلام سے پھر گئے جب تو ان سے جدا ہوا۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا، انہوں نے کہا ہم سے شعبہ نے بیان کیا، ان سے مغیرہ بن نعمان نے جو قبیلہ نخعی کا ایک بوڑھا تھا، ان سے سعید بن جبیر نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ، شَيْخٍ مِنَ النَّخَعِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَطَبَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ إِنَّكُمْ مَحْشُورُونَ إِلَى اللَّهِ حُفَاةً عُرَاةً غُرْلاً ‏{‏كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْدًا عَلَيْنَا إِنَّا كُنَّا فَاعِلِينَ‏}‏ ثُمَّ إِنَّ أَوَّلَ مَنْ يُكْسَى يَوْمَ الْقِيَامَةِ إِبْرَاهِيمُ، أَلاَ إِنَّهُ يُجَاءُ بِرِجَالٍ مِنْ أُمَّتِي، فَيُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ، فَأَقُولُ يَا رَبِّ أَصْحَابِي فَيُقَالُ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ ‏{‏وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ‏}‏ إِلَى قَوْلِهِ ‏{‏شَهِيدٌ‏}‏ فَيُقَالُ إِنَّ هَؤُلاَءِ لَمْ يَزَالُوا مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ مُنْذُ فَارَقْتَهُمْ ‏\"‏‏.‏",
                "headingArabic": "‏{‏كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُّعِيدُهُ ۚ وَعْدًا عَلَيْنَا ۚ‏}‏",
                "headingUrdu": "\"جیسا کہ ہم نے پہلی تخلیق شروع کی تھی، ہم اسے دوبارہ کریں گے، (یہ) ہم پر ایک وعدہ ہے، ہم اسے ضرور کریں گے.\" (V.21:104)",
                "headingEnglish": "\"As We began the first creation, We shall repeat it. (It is) a promise binding upon Us. Truly, We shall do it.\" (V.21:104)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4520,
                "hadithNumber": "4741",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"On the day of Resurrection Allah will say, 'O Adam!' Adam will reply, 'Labbaik our Lord, and Sa`daik ' Then there will be a loud call (saying), Allah orders you to take from among your offspring a mission for the (Hell) Fire.' Adam will say, 'O Lord! Who are the mission for the (Hell) Fire?' Allah will say, 'Out of each thousand, take out 999.' At that time every pregnant female shall drop her load (have a miscarriage) and a child will have grey hair. And you shall see mankind as in a drunken state, yet not drunk, but severe will be the torment of Allah.\" (22.2) (When the Prophet (ﷺ) mentioned this), the people were so distressed (and afraid) that their faces got changed (in color) whereupon the Prophet (ﷺ) said, \"From Gog and Magog nine-hundred ninety-nine will be taken out and one from you. You Muslims (compared to the large number of other people) will be like a black hair on the side of a white ox, or a white hair on the side of a black ox, and I hope that you will be onefourth of the people of Paradise.\" On that, we said, \"Allahu-Akbar!\" Then he said, \"I hope that you will be) one-third of the people of Paradise.\" We again said, \"Allahu-Akbar!\" Then he said, \"(I hope that you will be) one-half of the people of Paradise.\" So we said, Allahu Akbar.\" He inhabitants of Paradise. Whereupon, we again shouted; Allah is the Greatest. Abu Osamah has reported from Amash: you will see people as they are drunk and they will not be drunk and said: Nine-hundred and ninety-nine out of each thousand. Jareer, Isa bin younus and Abu Moaviyah said: They are drunk and they will not be drunk.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ پاک قیامت کے دن آدم علیہ السلام سے فرمائے گا۔ اے آدم! وہ عرض کریں گے، میں حاضر ہوں اے رب! تیری فرمانبرداری کے لیے۔ پروردگار آواز سے پکارے گا ( یا فرشتہ پروردگار کی طرف سے آواز دے گا ) اللہ حکم دیتا ہے کہ اپنی اولاد میں سے دوزخ کا جتھا نکالو۔ وہ عرض کریں گے اے پروردگار! دوزخ کا جتھا کتنا نکالوں۔ حکم ہو گا ( راوی نے کہا میں سمجھتا ہوں ) ہر ہزار آدمیوں میں نو سو ننانوے ( گویا ہزار میں ایک جنتی ہو گا ) یہ ایسا سخت وقت ہو گا کہ پیٹ والی کا حمل گر جائے گا اور بچہ ( فکر کے مارے ) بوڑھا ہو جائے گا ( یعنی جو بچپن میں مرا ہو ) اور تو قیامت کے دن لوگوں کو ایسا دیکھے گا جیسے وہ نشہ میں متوالے ہو رہے ہیں حالانکہ ان کو نشہ نہ ہو گا بلکہ اللہ کا عذاب ایسا سخت ہو گا ( یہ حدیث جو صحابہ حاضر تھے ان پر سخت گزری۔ ان کے چہرے ( مارے ڈر کے ) بدل گئے۔ اس وقت نبی کریم صلی اللہ علیہ وسلم نے ان کی تسلی کے لیے فرمایا ( تم اتنا کیوں ڈرتے ہو ) اگر یاجوج ماجوج ( جو کافر ہیں ) کی نسل تم سے ملائی جائے تو ان میں سے نو سو ننانوے کے مقابل تم میں سے ایک آدمی پڑے گا۔ غرض تم لوگ حشر کے دن دوسرے لوگوں کی نسبت ( جو دوزخی ہوں گے ) ایسے ہو گے جیسے سفید بیل کے جسم پر ایک بال کالا ہوتا ہے یا جیسے کالے بیل کے جسم پر ایک دو بال سفید ہوتے ہیں اور مجھ کو امید ہے تم لوگ سارے جنتیوں کا چوتھائی حصہ ہو گے ( باقی تین حصوں میں اور سب امتیں ہوں گی ) ۔ یہ سن کر ہم نے اللہ اکبر کہا۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا نہیں بلکہ تم تہائی ہو گے ہم نے پھر نعرہ تکبیر بلند کیا پھر فرمایا نہیں بلکہ آدھا حصہ ہو گے ( آدھے حصہ میں اور امتیں ہوں گی ) ہم نے پھر نعرہ تکبیر بلند کیا اور ابواسامہ نے اعمش سے یوں روایت کیا «ترى الناس سكارى وما هم بسكارى‏» جیسے مشہور قرآت ہے اور کہا کہ ہر ہزار میں سے نو سو ننانوے نکالو ( تو ان کی روایت حفص بن غیاث کے موافق ہے ) اور جریر بن عبدالحمید اور عیسیٰ بن یونس اور ابومعاویہ نے یوں نقل کیا «سكرى وما هم بسكرى‏» ( حمزہ اور کسائی کی بھی یہی قرآت ہے ) ۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا ہم سے ہمارے والد نے بیان کیا، کہا ہم سے اعمش نے بیان کیا، ان سے ابوصالح نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَقُولُ اللَّهُ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ يَا آدَمُ‏.‏ يَقُولُ لَبَّيْكَ رَبَّنَا وَسَعْدَيْكَ، فَيُنَادَى بِصَوْتٍ إِنَّ اللَّهَ يَأْمُرُكَ أَنْ تُخْرِجَ مِنْ ذُرِّيَّتِكَ بَعْثًا إِلَى النَّارِ‏.‏ قَالَ يَا رَبِّ وَمَا بَعْثُ النَّارِ قَالَ مِنْ كُلِّ أَلْفٍ ـ أُرَاهُ قَالَ ـ تِسْعَمِائَةٍ وَتِسْعَةً وَتِسْعِينَ فَحِينَئِذٍ تَضَعُ الْحَامِلُ حَمْلَهَا وَيَشِيبُ الْوَلِيدُ ‏{‏وَتَرَى النَّاسَ سُكَارَى وَمَا هُمْ بِسُكَارَى وَلَكِنَّ عَذَابَ اللَّهِ شَدِيدٌ‏}‏ ‏\"‏‏.‏ فَشَقَّ ذَلِكَ عَلَى النَّاسِ حَتَّى تَغَيَّرَتْ وُجُوهُهُمْ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مِنْ يَأْجُوجَ وَمَأْجُوجَ تِسْعَمِائَةٍ وَتِسْعَةً وَتِسْعِينَ، وَمِنْكُمْ وَاحِدٌ، ثُمَّ أَنْتُمْ فِي النَّاسِ كَالشَّعْرَةِ السَّوْدَاءِ فِي جَنْبِ الثَّوْرِ الأَبْيَضِ، أَوْ كَالشَّعْرَةِ الْبَيْضَاءِ فِي جَنْبِ الثَّوْرِ الأَسْوَدِ، وَإِنِّي لأَرْجُو أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ فَكَبَّرْنَا ثُمَّ قَالَ ‏\"‏ ثُلُثَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ فَكَبَّرْنَا ثُمَّ قَالَ ‏\"‏ شَطْرَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ فَكَبَّرْنَا‏.‏ قَالَ أَبُو أُسَامَةَ عَنِ الأَعْمَشِ ‏{‏تَرَى النَّاسَ سُكَارَى وَمَا هُمْ بِسُكَارَى‏}‏ وَقَالَ مِنْ كُلِّ أَلْفٍ تِسْعَمِائَةٍ وَتِسْعَةً وَتِسْعِينَ‏.‏ وَقَالَ جَرِيرٌ وَعِيسَى بْنُ يُونُسَ وَأَبُو مُعَاوِيَةَ ‏{‏سَكْرَى وَمَا هُمْ بِسَكْرَى‏}‏‏.‏",
                "headingArabic": "‏{‏وَتَرَى النَّاسَ سُكَارَى‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور تم لوگوں کو نشے کی حالت میں دیکھو گے‘‘ (V.22:2)",
                "headingEnglish": "The Statement of Allah the Most High.: \"...And you shall see mankind as in a drunken state...\" (V.22:2)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4521,
                "hadithNumber": "4742",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Regarding the Verse: \"And among men is he who worships Allah's as it were on the very edge.\" (22.11). A man used to come to Medina as if his wife brought a son and his mares produces offspring. He would say, \"This religion (Islam) is good,\" but if his wife did not give birth to a child and his mares produced no offspring, he would say, \"This religion is bad.\"",
                "hadithUrdu": "آیت «ومن الناس من يعبد الله على حرف‏» ”اور انسانوں میں کوئی ایسا بھی ہوتا ہے جو اللہ کی عبادت کنارہ پر ( کھڑا ہو کر ) کرتا ہے۔“ کے متعلق فرمایا کہ بعض لوگ مدینہ آتے ( اور اپنے اسلام کا اظہار کرتے ) اس کے بعد اگر اس کی بیوی کے یہاں لڑکا پیدا ہوتا اور گھوڑی بھی بچہ دیتی تو وہ کہتے کہ یہ دین ( اسلام ) بڑا اچھا دین ہے، لیکن اگر ان کے یہاں لڑکا نہ پیدا ہوتا اور گھوڑی بھی کوئی بچہ نہ دیتی تو کہتے کہ یہ تو برا دین ہے اس پر مذکور بالا آیت نازل ہوئی۔",
                "urduNarrator": "مجھ سے ابراہیم بن حارث نے بیان کیا، کہا ہم سے یحییٰ بن ابی بکیر نے، کہا ہم سے اسرائیل نے بیان کیا، ان سے ابوحصین نے ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْحَارِثِ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي حَصِينٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ ‏{‏وَمِنَ النَّاسِ مَنْ يَعْبُدُ اللَّهَ عَلَى حَرْفٍ‏}‏ قَالَ كَانَ الرَّجُلُ يَقْدَمُ الْمَدِينَةَ، فَإِنْ وَلَدَتِ امْرَأَتُهُ غُلاَمًا، وَنُتِجَتْ خَيْلُهُ قَالَ هَذَا دِينٌ صَالِحٌ‏.‏ وَإِنْ لَمْ تَلِدِ امْرَأَتُهُ وَلَمْ تُنْتَجْ خَيْلُهُ قَالَ هَذَا دِينُ سُوءٍ‏.‏",
                "headingArabic": "‏{‏وَمِنَ النَّاسِ مَنْ يَعْبُدُ اللَّهَ عَلَى حَرْفٍ فَإِنْ أَصَابَهُ خَيْرٌ اطْمَأَنَّ بِهِ وَإِنْ أَصَابَتْهُ فِتْنَةٌ انْقَلَبَ عَلَى وَجْهِهِ خَسِرَ الدُّنْيَا وَالآخِرَةَ‏}‏ إِلَى قَوْلِهِ ‏{‏ذَلِكَ هُوَ الضَّلاَلُ الْبَعِيدُ‏}‏",
                "headingUrdu": "\"اور انسانوں میں سے کوئی ایسا ہے جو اللہ کی عبادت کرتا ہے جیسا کہ وہ بالکل کنارے پر (یعنی شک میں)...\" (V.22:11)",
                "headingEnglish": "\"And among mankind is he who worships Allah as it were, upon the very edge (i.e., in doubt)...\" (V.22:11)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4522,
                "hadithNumber": "4743",
                "englishNarrator": "Narrated Abu Dharr رضی اللہ عنہ :",
                "hadithEnglish": "He used to take an oath confirming that the Verse: 'These two opponents (believers, and disbelievers) dispute with each other about their Lord.' (22.19) was Revealed in connection with Hamza and his two companions and `Utbah and his two companions on the day when they ease out of the battle of Badr. Sufyan has reported it from  Abu Hashim. Uthman, Jareer, Masoor, Abu Hashim reported his saying from Abu Mijliz.",
                "hadithUrdu": "یہ آیت «هذان خصمان اختصموا في ربهم‏» ”یہ دو فریق ہیں، جنہوں نے اپنے پروردگار کے بارے میں جھگڑا کیا۔“ حمزہ اور آپ کے دونوں ساتھیوں ( علی بن ابی طالب رضی اللہ عنہ اور عبیدہ بن حارث رضی اللہ عنہ مسلمانوں کی طرف سے ) اور ( مشرکین کی طرف سے ) عتبہ اور اس کے دونوں ساتھیوں ( شیبہ اور ولید بن عتبہ ) کے بارے میں نازل ہوئی تھی، جب انہوں نے بدر کی لڑائی میں میدان میں آ کر مقابلہ کی دعوت دی تھی۔ اس روایت کو سفیان نے ابوہاشم سے اور عثمان نے جریر سے، انہوں نے منصور سے، انہوں نے ابوہاشم سے اور انہوں نے ابومجلز سے اسی طرح نقل کیا ہے۔",
                "urduNarrator": "ہم سے حجاج بن منہال نے بیان کیا، کہا ہم سے ہشیم نے بیان کیا، کہا ہم کو ابوہاشم نے خبر دی، انہیں ابومجلز نے، انہیں قیس بن عباد نے اور انہیں ابوذر رضی اللہ عنہ نے وہ قسم کھا کر بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو هَاشِمٍ، عَنْ أَبِي مِجْلَزٍ، عَنْ قَيْسِ بْنِ عُبَادٍ، عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ أَنَّهُ كَانَ يُقْسِمُ فِيهَا إِنَّ هَذِهِ الآيَةَ ‏{‏هَذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ‏}‏ نَزَلَتْ فِي حَمْزَةَ وَصَاحِبَيْهِ، وَعُتْبَةَ وَصَاحِبَيْهِ يَوْمَ بَرَزُوا فِي يَوْمِ بَدْرٍ رَوَاهُ سُفْيَانُ عَنْ أَبِي هَاشِمٍ‏.‏ وَقَالَ عُثْمَانُ عَنْ جَرِيرٍ عَنْ مَنْصُورٍ عَنْ أَبِي هَاشِمٍ عَنْ أَبِي مِجْلَزٍ قَوْلَهُ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏هَذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا ارشاد ہے: ’’یہ دونوں مخالف (مومن و کافر) اپنے رب کے بارے میں ایک دوسرے سے جھگڑتے ہیں‘‘ (آیت 22:19)",
                "headingEnglish": "The Statement of Allah the Exalted: \"These two opponents (believers and disbelievers) dispute with each other about their Lord...\" (V.22:19)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4523,
                "hadithNumber": "4744",
                "englishNarrator": "Narrated Qais bin Ubad:",
                "hadithEnglish": "`Ali رضی اللہ عنہ said, \"I will be the first to kneel before the Beneficent on the Day of Resurrection because of the dispute.\" Qais said; This Verse: 'These two opponents (believers and disbelievers dispute with each other about their Lord,' (22.19) was revealed in connection with those who came out for the Battle of Badr, i.e. `Ali, Hamza, 'Ubaida, Shaiba bin Rabi`a, `Utba bin Rabi`a and Al-Walid bin `Utba.",
                "hadithUrdu": "علی بن ابی طالب رضی اللہ عنہ نے بیان کیا کہ میں پہلا شخص ہوں گا۔ جو رحمن کے حضور میں قیامت کے دن اپنا دعویٰ پیش کرنے کے لیے چہار زانو بیٹھوں گا۔ قیس نے کہا کہ آپ ہی لوگوں کے بارے میں یہ آیت نازل ہوئی تھی «هذان خصمان اختصموا في ربهم‏» کہ یہ دو فریق ہیں جنہوں نے اپنے پروردگار کے بارے میں جھگڑا کیا“ بیان کیا کہ یہی وہ لوگ ہیں جنہوں نے بدر کی لڑائی میں دعوت مقابلہ دی تھی۔ یعنی ( مسلمانوں کی طرف سے ) علی، حمزہ اور عبیدہ رضی اللہ عنہم نے اور ( کفار کی طرف سے ) شیبہ بن ربیعہ، عتبہ بن ربیعہ اور ولید بن عتبہ نے۔",
                "urduNarrator": "ہم سے حجاج بن منہال نے بیان کیا، کہا ہم سے معتمر بن سلیمان نے بیان کیا، کہا کہ میں نے اپنے والد سلیمان سے سنا، انہوں نے ابومجلز سے سن کر کہا کہ یہ خود ان ( ابومجلز ) کا قول ہے، ان سے قیس بن عباد نے اور ان سے",
                "hadithArabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ أَبِي قَالَ، حَدَّثَنَا أَبُو مِجْلَزٍ، عَنْ قَيْسِ بْنِ عُبَادٍ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ ـ رضى الله عنه ـ قَالَ أَنَا أَوَّلُ، مَنْ يَجْثُو بَيْنَ يَدَىِ الرَّحْمَنِ لِلْخُصُومَةِ يَوْمَ الْقِيَامَةِ‏.‏ قَالَ قَيْسٌ وَفِيهِمْ نَزَلَتْ ‏{‏هَذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ‏}‏ قَالَ هُمُ الَّذِينَ بَارَزُوا يَوْمَ بَدْرٍ عَلِيٌّ وَحَمْزَةُ وَعُبَيْدَةُ وَشَيْبَةُ بْنُ رَبِيعَةَ وَعُتْبَةُ بْنُ رَبِيعَةَ وَالْوَلِيدُ بْنُ عُتْبَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4524,
                "hadithNumber": "4745",
                "englishNarrator": "Narrated Sahl bin Saud:",
                "hadithEnglish": "Uwaimir came to `Asim bin `Adi who was the chief of Bani Ajlan and said, \"What do you say about a man who has found another man with his wife? Should he kill him whereupon you would kill him (i.e. the husband), or what should he do? Please ask Allah's Messenger (ﷺ) about this matter on my behalf.\" `Asim then went to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! (And asked him that question) but Allah's Messenger (ﷺ) disliked the question,\" When 'Uwaimir asked `Asim (about the Prophet's answer) `Asim replied that Allah's Messenger (ﷺ) disliked such questions and considered it shameful. \"Uwaimir then said, \"By Allah, I will not give up asking unless I ask Allah's Messenger (ﷺ) about it.\" Uwaimir came (to the Prophet ) and said, \"O Allah's Messenger (ﷺ)! A man has found another man with his wife! Should he kill him whereupon you would kill him (the husband, in Qisas) or what should he do?\" Allah's Messenger (ﷺ) said, \"Allah has revealed regarding you and your wife's case in the Qur'an \"So Allah's Messenger (ﷺ) ordered them to perform the measures of Mula'ana according to what Allah had mentioned in His Book. So 'Uwaimir did Mula'ana with her and said, \"O Allah's Messenger (ﷺ)! If I kept her I would oppress her.\" So 'Uwaimir divorced her and so divorce became a tradition after them for those who happened to be involved in a case of Mula'ana. Allah's Messenger (ﷺ) then said, \"Look! If she (Uwaimir's wife) delivers a black child with deep black large eyes, big hips and fat legs, then I will be of the opinion that 'Uwaimir has spoken the truth; but if she delivers a red child looking like a Wahra then we will consider that 'Uwaimir has told a lie against her.\" Later on she delivered a child carrying the qualities which Allah's Messenger (ﷺ) had mentioned as a proof for 'Uwaimir's claim; therefore the child was ascribed to its mother henceforth.",
                "hadithUrdu": "عویمر بن حارث بن زید بن جد بن عجلان عاصم بن عدی کے پاس آئے۔ عاصم بنی عجلان کے سردار تھے۔ انہوں نے آپ سے کہا کہ آپ لوگوں کا ایک ایسے شخص کے بارے میں کیا خیال ہے جو اپنی بیوی کے ساتھ کسی غیر مرد کو پا لیتا ہے کیا وہ اسے قتل کر دے؟ لیکن تم پھر اسے قصاص میں قتل کر دو گے! آخر ایسی صورت میں انسان کیا طریقہ اختیار کرے؟ رسول اللہ صلی اللہ علیہ وسلم سے اس کے متعلق پوچھ کے مجھے بتائیے۔ چنانچہ عاصم، نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا: یا رسول اللہ! ( صورت مذکورہ میں خاوند کیا کرے ) نبی کریم صلی اللہ علیہ وسلم نے ان مسائل ( میں سوال و جواب ) کو ناپسند فرمایا۔ جب عویمر نے ان سے پوچھا تو انہوں نے بتا دیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان مسائل کو ناپسند فرمایا ہے۔ عویمر نے ان سے کہا کہ واللہ میں خود نبی کریم صلی اللہ علیہ وسلم سے اسے پوچھوں گا۔ چنانچہ وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا۔ یا رسول اللہ! ایک شخص اپنی بیوی کے ساتھ ایک غیر مرد کو دیکھتا ہے کیا وہ اس کو قتل کر دے؟ لیکن پھر آپ قصاص میں اس کو قتل کریں گے۔ ایسی صورت میں اس کو کیا کرنا چاہئے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے تمہارے اور تمہاری بیوی کے بارے میں قرآن کی آیت اتاری ہے۔ پھر آپ نے انہیں قرآن کے بتائے ہوئے طریقہ کے مطابق لعان کا حکم دیا۔ اور عویمر نے اپنی بیوی کے ساتھ لعان کیا، پھر انہوں نے کہا: یا رسول اللہ! اگر میں اپنی بیوی کو روکے رکھوں تو میں ظالم ہوں گا۔ اس لیے عویمر نے اسے طلاق دے دی۔ اس کے لعان کے بعد میاں بیوی میں جدائی کا طریقہ جاری ہو گیا۔ نبی کریم صلی اللہ علیہ وسلم نے پھر فرمایا کہ دیکھتے رہو اگر اس عورت کے کالا، بہت کالی پتلیوں والا، بھاری سرین اور بھری ہوئی پنڈلیوں والا بچہ پیدا ہو تو میرا خیال ہے کہ عویمر نے الزام غلط نہیں لگایا ہے۔ لیکن اگر سرخ سرخ گر گٹ جیسا پیدا ہو تو میرا خیال ہے کہ عویمر نے غلط الزام لگایا ہے۔ اس کے بعد ان عورت کے جو بچہ پیدا ہوا وہ انہیں صفات کے مطابق تھا جو نبی کریم صلی اللہ علیہ وسلم نے بیان کی تھیں اور جس سے عویمر کی تصدیق ہوتی تھی۔ چنانچہ اس لڑکے کا نسب اس کی ماں کی طرف رکھا گیا۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے محمد بن یوسف فریابی نے، کہا ہم سے امام اوزاعی نے، کہا کہ مجھ سے زہری نے بیان کیا۔ ان سے سہل بن سعد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ عُوَيْمِرًا، أَتَى عَاصِمَ بْنَ عَدِيٍّ وَكَانَ سَيِّدَ بَنِي عَجْلاَنَ فَقَالَ كَيْفَ تَقُولُونَ فِي رَجُلٍ وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَصْنَعُ سَلْ لِي رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَأَتَى عَاصِمٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسَائِلَ، فَسَأَلَهُ عُوَيْمِرٌ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَرِهَ الْمَسَائِلَ وَعَابَهَا، قَالَ عُوَيْمِرٌ وَاللَّهِ لاَ أَنْتَهِي حَتَّى أَسْأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَجَاءَ عُوَيْمِرٌ فَقَالَ يَا رَسُولَ اللَّهِ رَجُلٌ وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً، أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَصْنَعُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ أَنْزَلَ اللَّهُ الْقُرْآنَ فِيكَ وَفِي صَاحِبَتِكَ ‏\"‏‏.‏ فَأَمَرَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْمُلاَعَنَةِ بِمَا سَمَّى اللَّهُ فِي كِتَابِهِ، فَلاَعَنَهَا ثُمَّ قَالَ يَا رَسُولَ اللَّهِ، إِنْ حَبَسْتُهَا فَقَدْ ظَلَمْتُهَا، فَطَلَّقَهَا، فَكَانَتْ سُنَّةً لِمَنْ كَانَ بَعْدَهُمَا فِي الْمُتَلاَعِنَيْنِ، ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْظُرُوا فَإِنْ جَاءَتْ بِهِ أَسْحَمَ أَدْعَجَ الْعَيْنَيْنِ عَظِيمَ الأَلْيَتَيْنِ خَدَلَّجَ السَّاقَيْنِ فَلاَ أَحْسِبُ عُوَيْمِرًا إِلاَّ قَدْ صَدَقَ عَلَيْهَا، وَإِنْ جَاءَتْ بِهِ أُحَيْمِرَ كَأَنَّهُ وَحَرَةٌ فَلاَ أَحْسِبُ عُوَيْمِرًا، إِلاَّ قَدْ كَذَبَ عَلَيْهَا ‏\"‏‏.‏ فَجَاءَتْ بِهِ عَلَى النَّعْتِ الَّذِي نَعَتَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ تَصْدِيقِ عُوَيْمِرٍ، فَكَانَ بَعْدُ يُنْسَبُ إِلَى أُمِّهِ‏.‏",
                "headingArabic": "قَوْلِهِ عَزَّ وَجَلَّ ‏{‏وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ وَلَمْ يَكُنْ لَهُمْ شُهَدَاءُ إِلاَّ أَنْفُسُهُمْ فَشَهَادَةُ أَحَدِهِمْ أَرْبَعُ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الصَّادِقِينَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور ان لوگوں کے لیے جو اپنی بیویوں پر تہمت لگاتے ہیں لیکن ان کے پاس اپنے سوا کوئی گواہ نہیں‘‘ (V.24:6)",
                "headingEnglish": "The Statement of Allah the Exalted: \"And for those who accuse their wives, but have no witnesses except themselves...\" (V.24:6)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4525,
                "hadithNumber": "4746",
                "englishNarrator": "Narrated Sahl bin Sa`d:",
                "hadithEnglish": "A man came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Suppose a man saw another man with his wife, should he kill him whereupon you might kill him (i.e. the killer) (in Qisas) or what should he do?\" So Allah revealed concerning their case what is mentioned of the order of Mula'ana. Allah's Apostle said to the man, \"The matter between you and your wife has been decided.\" So they did Mula'ana in the presence of Allah's Messenger (ﷺ) and I was present there, and then the man divorced his wife. So it became a tradition to dissolve the marriage of those spouses who were involved in a case of Mula'ana. The woman was pregnant and the husband denied that he was the cause of her pregnancy, so the son was (later) ascribed to her. Then it became a tradition that such a son would be the heir of his mother, and she would inherit of him what Allah prescribed for her.",
                "hadithUrdu": "ایک صاحب ( یعنی عویمر ) رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا: یا رسول اللہ! ایسے شخص کے متعلق آپ کا کیا ارشاد ہے جس نے اپنی بیوی کے ساتھ ایک غیر مرد کو دیکھا ہو کیا وہ اسے قتل کر دے؟ لیکن پھر آپ قصاص میں قاتل کو قتل کر دیں گے۔ پھر اسے کیا کرنا چاہئے؟ انہیں کے متعلق اللہ تعالیٰ نے دو آیات نازل کیں جن میں لعان کا ذکر ہے۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ تمہارے اور تمہاری بیوی کے بارے میں فیصلہ کیا جا چکا ہے۔ راوی نے بیان کیا کہ پھر دونوں میاں بیوی نے لعان کیا اور میں اس وقت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا۔ پھر آپ نے دونوں میں جدائی کرا دی اور دو لعان کرنے والوں میں اس کے بعد یہی طریقہ قائم ہو گیا کہ ان میں جدائی کرا دی جائے۔ ان کی بیوی حاملہ تھیں، لیکن انہوں نے اس کا بھی انکار کر دیا۔ چنانچہ جب بچہ پیدا ہوا تو اسے ماں ہی کے نام سے پکارا جانے لگا۔ میراث کا یہ طریقہ ہوا کہ بیٹا ماں کا وارث ہوتا ہے اور ماں اللہ کے مقرر کئے ہوئے حصہ کے مطابق بیٹے کی وارث ہوتی ہے۔",
                "urduNarrator": "مجھ سےسلیمان بن داؤد ابوالربیع سلیمان بن داؤد نے بیان کیا، کہا ہم سے فلیح نے، ان سے زہری نے، ان سے سہل بن سعد نے کہ",
                "hadithArabic": "حَدَّثَنِي سُلَيْمَانُ بْنُ دَاوُدَ أَبُو الرَّبِيعِ، حَدَّثَنَا فُلَيْحٌ، عَنِ الزُّهْرِيِّ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ رَجُلاً، أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ، أَرَأَيْتَ رَجُلاً رَأَى مَعَ امْرَأَتِهِ رَجُلاً أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَأَنْزَلَ اللَّهُ فِيهِمَا مَا ذُكِرَ فِي الْقُرْآنِ مِنَ التَّلاَعُنِ، فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ قَدْ قُضِيَ فِيكَ وَفِي امْرَأَتِكَ ‏\"‏‏.‏ قَالَ فَتَلاَعَنَا، وَأَنَا شَاهِدٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَفَارَقَهَا فَكَانَتْ سُنَّةً أَنْ يُفَرَّقَ بَيْنَ الْمُتَلاَعِنَيْنِ وَكَانَتْ حَامِلاً، فَأَنْكَرَ حَمْلَهَا وَكَانَ ابْنُهَا يُدْعَى إِلَيْهَا، ثُمَّ جَرَتِ السُّنَّةُ فِي الْمِيرَاثِ أَنْ يَرِثَهَا، وَتَرِثَ مِنْهُ مَا فَرَضَ اللَّهُ لَهَا‏.‏",
                "headingArabic": "‏{‏وَالْخَامِسَةُ أَنَّ لَعْنَةَ اللَّهِ عَلَيْهِ إِنْ كَانَ مِنَ الْكَاذِبِينَ‏}‏",
                "headingUrdu": "\"اور پانچویں (گواہی) اس پر اللہ کی لعنت ہو اگر وہ جھوٹ بولنے والوں میں سے ہو۔\" (V.24:7)",
                "headingEnglish": "\"And the fifth (testimony should be) the invoking of the Curse of Allah on him if he is of those who tell a lie (against her) .\" (V.24:7)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4526,
                "hadithNumber": "4747",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Hilal bin Umaiya accused his wife of committing illegal sexual intercourse with Sharik bin Sahma' and filed the case before the Prophet. The Prophet (ﷺ) said (to Hilal), \"Either you bring forth a proof (four witnesses) or you will receive the legal punishment (lashes) on your back.\" Hilal said, \"O Allah's Apostle! If anyone of us saw a man over his wife, would he go to seek after witnesses?\" The Prophet (ﷺ) kept on saying, \"Either you bring forth the witnesses or you will receive the legal punishment (lashes) on your back.\" Hilal then said, \"By Him Who sent you with the Truth, I am telling the truth and Allah will reveal to you what will save my back from legal punishment.\" Then Gabriel came down and revealed to him:-- 'As for those who accuse their wives...' (24.6-9) The Prophet (ﷺ) recited it till he reached: '... (her accuser) is telling the truth.' Then the Prophet (ﷺ) left and sent for the woman, and Hilal went (and brought) her and then took the oaths (confirming the claim). The Prophet (ﷺ) was saying, \"Allah knows that one of you is a liar, so will any of you repent?\" Then the woman got up and took the oaths and when she was going to take the fifth one, the people stopped her and said, \"It (the fifth oath) will definitely bring Allah's curse on you (if you are guilty).\" So she hesitated and recoiled (from taking the oath) so much that we thought that she would withdraw her denial. But then she said, \"I will not dishonor my family all through these days,\" and carried on (the process of taking oaths). The Prophet (ﷺ) then said, \"Watch her; if she delivers a black-eyed child with big hips and fat shins then it is Sharik bin Sahma's child.\" Later she delivered a child of that description. So the Prophet (ﷺ) said, \"If the case was not settled by Allah's Law, I would punish her severely.\"",
                "hadithUrdu": "ہلال بن امیہ نے نبی کریم صلی اللہ علیہ وسلم کے سامنے اپنی بیوی پر شریک بن سحماء کے ساتھ تہمت لگائی۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس کے گواہ لاؤ ورنہ تمہاری پیٹھ پر حد لگائی جائے گی۔ انہوں نے عرض کیا: یا رسول اللہ! ایک شخص اپنی بیوی کے ساتھ ایک غیر کو مبتلا دیکھتا ہے تو کیا وہ ایسی حالت میں گواہ تلاش کرنے جائے گا؟ لیکن آپ یہی فرماتے رہے کہ گواہ لاؤ، ورنہ تمہاری پیٹھ پر حد جاری کی جائے گی۔ اس پر ہلال نے عرض کیا۔ اس ذات کی قسم جس نے آپ کو حق کے ساتھ نبی بنا کر بھیجا ہے میں سچا ہوں اور اللہ تعالیٰ خود ہی کوئی ایسی آیت نازل فرمائے گا۔ جس کے ذریعہ میرے اوپر سے حد دور ہو جائے گی۔ اتنے میں جبرائیل علیہ السلام تشریف لائے اور یہ آیت نازل ہوئی «والذين يرمون أزواجهم‏» سے «إن كان من الصادقين‏» ۔ ( جس میں ایسی صورت میں لعان کا حکم ہے ) جب نزول وحی کا سلسلہ ختم ہوا تو نبی کریم صلی اللہ علیہ وسلم نے ہلال کو آدمی بھیج کر بلوایا وہ آئے اور آیت کے مطابق چار مرتبہ قسم کھائی۔ نبی کریم صلی اللہ علیہ وسلم نے اس موقع پر فرمایا کہ اللہ خوب جانتا ہے کہ تم میں سے ایک ضرور جھوٹا ہے تو کیا وہ توبہ کرنے پر تیار نہیں ہے۔ اس کے بعد ان کی بیوی کھڑی ہوئیں اور انہوں نے بھی قسم کھائی، جب وہ پانچویں پر پہنچیں ( اور چار مرتبہ اپنی برات کی قسم کھانے کے بعد، کہنے لگیں کہ اگر میں جھوٹی ہوں تو مجھ پر اللہ کا غضب ہو ) تو لوگوں نے انہیں روکنے کی کوشش کی اور کہا کہ ( اگر تم جھوٹی ہو تو ) اس سے تم پر اللہ کا عذاب ضرور نازل ہو گا۔ ابن عباس رضی اللہ عنہا نے بیان کیا کہ اس پر وہ ہچکچائیں ہم نے سمجھا کہ اب وہ اپنا بیان واپس لے لیں گی۔ لیکن یہ کہتے ہوئے کہ زندگی بھر کے لیے میں اپنی قوم کو رسوا نہیں کروں گی۔ پانچویں بار قسم کھائی۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ دیکھنا اگر بچہ خوب سیاہ آنکھوں والا، بھاری سرین اور بھری بھری پنڈلیوں والا پیدا ہوا تو پھر وہ شریک بن سحماء ہی کا ہو گا۔ چنانچہ جب پیدا ہوا تو وہ اسی شکل و صورت کا تھا نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر کتاب اللہ کا حکم نہ آ چکا ہوتا تو میں اسے رجمی سزا دیتا۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا، کہا ہم سے ابن ابی عدی نے بیان کیا، ان سے ہشام بن حسان نے ان سے عکرمہ نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ هِشَامِ بْنِ حَسَّانَ، حَدَّثَنَا عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ هِلاَلَ بْنَ أُمَيَّةَ، قَذَفَ امْرَأَتَهُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم بِشَرِيكِ بْنِ سَحْمَاءَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ الْبَيِّنَةَ أَوْ حَدٌّ فِي ظَهْرِكَ ‏\"‏‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِذَا رَأَى أَحَدُنَا عَلَى امْرَأَتِهِ رَجُلاً يَنْطَلِقُ يَلْتَمِسُ الْبَيِّنَةَ‏.‏ فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏\"‏ الْبَيِّنَةَ وَإِلاَّ حَدٌّ فِي ظَهْرِكَ ‏\"‏ فَقَالَ هِلاَلٌ وَالَّذِي بَعَثَكَ بِالْحَقِّ إِنِّي لَصَادِقٌ، فَلَيُنْزِلَنَّ اللَّهُ مَا يُبَرِّئُ ظَهْرِي مِنَ الْحَدِّ، فَنَزَلَ جِبْرِيلُ، وَأَنْزَلَ عَلَيْهِ ‏{‏وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ‏}‏ فَقَرَأَ حَتَّى بَلَغَ ‏{‏إِنْ كَانَ مِنَ الصَّادِقِينَ‏}‏ فَانْصَرَفَ النَّبِيُّ صلى الله عليه وسلم فَأَرْسَلَ إِلَيْهَا فَجَاءَ هِلاَلٌ، فَشَهِدَ، وَالنَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ اللَّهَ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ فَهَلْ مِنْكُمَا تَائِبٌ ‏\"‏‏.‏ ثُمَّ قَامَتْ فَشَهِدَتْ فَلَمَّا كَانَتْ عِنْدَ الْخَامِسَةِ وَقَّفُوهَا، وَقَالُوا إِنَّهَا مُوجِبَةٌ‏.‏ قَالَ ابْنُ عَبَّاسٍ فَتَلَكَّأَتْ وَنَكَصَتْ حَتَّى ظَنَنَّا أَنَّهَا تَرْجِعُ ثُمَّ قَالَتْ لاَ أَفْضَحُ قَوْمِي سَائِرَ الْيَوْمِ، فَمَضَتْ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَبْصِرُوهَا فَإِنْ جَاءَتْ بِهِ أَكْحَلَ الْعَيْنَيْنِ سَابِغَ الأَلْيَتَيْنِ خَدَلَّجَ السَّاقَيْنِ، فَهْوَ لِشَرِيكِ بْنِ سَحْمَاءَ ‏\"‏‏.‏ فَجَاءَتْ بِهِ كَذَلِكَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْلاَ مَا مَضَى مِنْ كِتَابِ اللَّهِ لَكَانَ لِي وَلَهَا شَأْنٌ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَيَدْرَأُ عَنْهَا الْعَذَابَ أَنْ تَشْهَدَ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الْكَاذِبِينَ‏}‏",
                "headingUrdu": "\"لیکن یہ اس سے سزا (سنگسار کی موت) کو ٹال دے گا...\" (V.24:8)",
                "headingEnglish": "\"But it shall avert the punishment (of stoning to death) from her...\" (V.24:8)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4527,
                "hadithNumber": "4748",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "A man accused his wife of illegal sexual intercourse and denied his paternity to her (conceived) child during the lifetime of Allah's Messenger (ﷺ). Allah's Messenger (ﷺ) ordered them both to do Mula'ana as Allah decreed and then gave his decision that the child would be for the mother, and a divorce decree was issued for the couple involved in a case of Mula'ana.",
                "hadithUrdu": "ایک صاحب نے اپنی بیوی پر رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں ایک غیر مرد کے ساتھ تہمت لگائی اور کہا کہ عورت کا حمل میرا نہیں ہے۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم کے حکم سے دونوں میاں بیوی نے اللہ کے فرمان کے مطابق لعان کیا۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے بچہ کے بارے میں فیصلہ کیا کہ وہ عورت ہی کا ہو گا اور لعان کرنے والے دونوں میاں بیوی میں جدائی کروا دی۔",
                "urduNarrator": "ہم سے مقدم بن محمد بن یحییٰ نے بیان کیا، کہا مجھ سے میرے چچا قاسم بن یحییٰ نے بیان کیا، ان سے عبیداللہ نے، قاسم نے عبیداللہ سے سنا تھا اور عبیداللہ نے نافع سے اور انہوں نے ابن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا مُقَدَّمُ بْنُ مُحَمَّدِ بْنِ يَحْيَى، حَدَّثَنَا عَمِّي الْقَاسِمُ بْنُ يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، وَقَدْ سَمِعَ مِنْهُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَجُلاً، رَمَى امْرَأَتَهُ فَانْتَفَى مِنْ وَلَدِهَا فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَمَرَ بِهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَتَلاَعَنَا كَمَا قَالَ اللَّهُ، ثُمَّ قَضَى بِالْوَلَدِ لِلْمَرْأَةِ وَفَرَّقَ بَيْنَ الْمُتَلاَعِنَيْنِ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَالْخَامِسَةُ أَنَّ غَضَبَ اللَّهِ عَلَيْهَا إِنْ كَانَ مِنَ الصَّادِقِينَ‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’اور پانچویں (گواہی) یہ ہونی چاہیے کہ اگر وہ (اس کا شوہر) سچ بولے تو اس پر اللہ کا غضب ہو‘‘۔ (V.24:9)",
                "headingEnglish": "The Statement of Allah the Exalted: \"And the fifth (testimony) should be that the Wrath of Allah be upon her if he (her husband) speaks the truth.\" (V.24:9)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4501,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=180",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=178",
                "label": "178",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=179",
                "label": "179",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=180",
                "label": "180",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=181",
                "label": "181",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=182",
                "label": "182",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=183",
                "label": "183",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=184",
                "label": "184",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=182",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=182",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=180",
        "to": 4525,
        "total": 40465
    }
}