{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 35,
        "data": [
            {
                "id": 851,
                "hadithNumber": "875",
                "englishNarrator": "Narrated Umm Salama رضی اللہ عنہا :",
                "hadithEnglish": "Whenever Allah's Messenger (ﷺ) completed the Salat with Taslim, the women used to get up immediately and Allah's Messenger (ﷺ) would remain at his place for sometime before getting up. The subnarrator (Az-Zuhri) said, \"We think, and Allah knows better, that he did so, so that the women might leave before the men could catch up with them.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب سلام پھیرتے تو آپ صلی اللہ علیہ وسلم کے سلام پھیرتے ہی عورتیں جانے کے لیے اٹھ جاتی تھیں اور آنحضور صلی اللہ علیہ وسلم تھوڑی دیر ٹھہرے رہتے کھڑے نہ ہوتے ۔ زہری نے کہا کہ ہم یہ سمجھتے ہیں ، آگے اللہ جانے ، یہ اس لیے تھا تاکہ عورتیں مردوں سے پہلے نکل جائیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، انہوں نے کہا کہ ہم سے ابراہیم بن سعد نے بیان کیا ، انہوں نے زہری سے بیان کیا ، ان سے ہند بنت حارث نے بیان کیا ، ان سے ام سلمہ رضی اللہ عنہا نے ، انہوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ هِنْدَ بِنْتِ الْحَارِثِ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا سَلَّمَ قَامَ النِّسَاءُ حِينَ يَقْضِي تَسْلِيمَهُ، وَهُوَ يَمْكُثُ فِي مَقَامِهِ يَسِيرًا قَبْلَ أَنْ يَقُومَ‏.‏ قَالَتْ نُرَى ـ وَاللَّهُ أَعْلَمُ ـ أَنَّ ذَلِكَ كَانَ لِكَىْ يَنْصَرِفَ النِّسَاءُ قَبْلَ أَنْ يُدْرِكَهُنَّ الرِّجَالُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "11",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 11,
                    "chapterNumber": "11",
                    "chapterEnglish": "Call to Prayers (Adhaan) (Sufa-Tu-Salat)",
                    "chapterUrdu": "اذان کے مسائل کے بیان میں (صفة الصلوة)",
                    "chapterArabic": "كتاب الأذان (صفة الصلوة)",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 852,
                "hadithNumber": "876",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ reports that he heard Allah's Messenger (ﷺ) saying:",
                "hadithEnglish": "\"We (Muslims) are the last (to come) but (will be) the foremost on the Day of Resurrection though the former nations were given the Holy Scriptures before us. And this was their day (Friday) the celebration of which was made compulsory for them but they differed about it. So Allah gave us the guidance for it (Friday) and all the other people are behind us in this respect: the Jews' (holy day is) tomorrow (i.e. Saturday) and the Christians' (is) the day after tomorrow (i.e. Sunday).\"",
                "hadithUrdu": "ہم دنیا میں تمام امتوں کے بعد ہونے کے باوجود قیامت میں سب سے آگے رہیں گے فرق صرف یہ ہے کہ کتاب انہیں ہم سے پہلے دی گئی تھی ۔ یہی ( جمعہ ) ان کا بھی دن تھا جو تم پر فرض ہوا ہے ۔ لیکن ان کا اس کے بارے میں اختلاف ہوا اور اللہ تعالیٰ نے ہمیں یہ دن بتا دیا اس لیے لوگ اس میں ہمارے تابع ہوں گے ۔ یہود دوسرے دن ہوں گے اور نصاریٰ تیسرے دن ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا کہ ہمیں شعیب نے خبر دی ، کہا کہ ہم سے ابوالزناد نے بیان کیا ، ان سے ربیعہ بن حارث کے غلام عبدالرحمٰن بن ہرمز اعرج نے بیان کیا کہ انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا اور آپ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، قَالَ حَدَّثَنَا أَبُو الزِّنَادِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ هُرْمُزَ الأَعْرَجَ، مَوْلَى رَبِيعَةَ بْنِ الْحَارِثِ حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ، بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا، ثُمَّ هَذَا يَوْمُهُمُ الَّذِي فُرِضَ عَلَيْهِمْ فَاخْتَلَفُوا فِيهِ، فَهَدَانَا اللَّهُ، فَالنَّاسُ لَنَا فِيهِ تَبَعٌ، الْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ ‏\"‏‏.‏",
                "headingArabic": "فَرْضِ الْجُمُعَةِ",
                "headingUrdu": "نماز جمعہ اور خطبہ کا نسخہ",
                "headingEnglish": "The prescription of Jumu'ah prayer and Khutba",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 853,
                "hadithNumber": "877",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) (p.b.u.h) said, \"Anyone of you attending the Friday (prayers) should take a bath.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم میں سے جب کوئی شخص جمعہ کی نماز کے لیے آنا چا ہے تو اسے غسل کر لینا چاہیے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک نے نافع سے خبر دی اور ان کو حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا جَاءَ أَحَدُكُمُ الْجُمُعَةَ فَلْيَغْتَسِلْ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ الْغُسْلِ يَوْمَ الْجُمُعَةِ، وَهَلْ عَلَى الصَّبِيِّ شُهُودُ يَوْمِ الْجُمُعَةِ أَوْ عَلَى النِّسَاءِ",
                "headingUrdu": "جمعہ کے دن غسل کرنے کی فضیلت",
                "headingEnglish": "The superiority of taking a bath on friday",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 854,
                "hadithNumber": "878",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "While `Umar bin Al-Khattab رضی اللہ عنہ was standing and delivering the sermon on a Friday, one of the companions of the Prophet, who was one of the foremost Muhajirs (emigrants) came. `Umar رضی اللہ عنہ said to him, \"What is the time now?\" He replied, \"I was busy and could not go back to my house till I heard the Adhan. I did not perform more than the ablution.\" Thereupon `Umar رضی اللہ عنہ said to him, \"Did you perform only the ablution although you know that Allah's Messenger (ﷺ) (p.b.u.h) used to order us to take a bath (on Fridays)?\"",
                "hadithUrdu": "عمر بن خطاب رضی اللہ عنہ جمعہ کے دن کھڑے خطبہ دے رہے تھے کہ اتنے میں نبی کریم صلی اللہ علیہ وسلم کے اگلے صحابہ مہاجرین میں سے ایک بزرگ تشریف لائے ( یعنی حضرت عثمان رضی اللہ عنہ ) عمر رضی اللہ عنہ نے ان سے کہا بھلا یہ کون سا وقت ہے انہوں نے فرمایا کہ میں مشغول ہو گیا تھا اور گھر واپس آتے ہی اذان سنی ، اس لیے میں وضو سے زیادہ اور کچھ ( غسل ) نہ کر سکا ۔ حضرت عمر رضی اللہ عنہ نے فرمایا کہ وضو بھی اچھا ہے ۔ حالانکہ آپ کو معلوم ہے کہ نبی کریم صلی اللہ علیہ وسلم غسل کے لیے فرماتے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد بن اسماء نے بیان کیا ، انہوں نے کہا کہ ہم سے جویریہ بن اسماء نے امام مالک سے بیان کیا ، ان سے زہری نے ، ان سے سالم بن عبداللہ بن عمر رضی اللہ عنہما نے ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، قَالَ أَخْبَرَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، بَيْنَمَا هُوَ قَائِمٌ فِي الْخُطْبَةِ يَوْمَ الْجُمُعَةِ إِذْ دَخَلَ رَجُلٌ مِنَ الْمُهَاجِرِينَ الأَوَّلِينَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فَنَادَاهُ عُمَرُ أَيَّةُ سَاعَةٍ هَذِهِ قَالَ إِنِّي شُغِلْتُ فَلَمْ أَنْقَلِبْ إِلَى أَهْلِي حَتَّى سَمِعْتُ التَّأْذِينَ، فَلَمْ أَزِدْ أَنْ تَوَضَّأْتُ‏.‏ فَقَالَ وَالْوُضُوءُ أَيْضًا وَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْمُرُ بِالْغُسْلِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 855,
                "hadithNumber": "879",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) (p.b.u.h) said, \"The taking of a bath on Friday is compulsory for every male (Muslim) who has attained the age of puberty.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جمعہ کے دن ہر بالغ کے لیے غسل ضروری ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے حدیث بیان کی ، انہوں نے کہا کہ ہمیں مالک نے صفوان بن سلیم کے واسطہ سے خبر دی ، انہیں عطاء بن یسار نے ، انہیں حضرت ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 856,
                "hadithNumber": "880",
                "englishNarrator": "Narrated Abu Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "I testify that Allah's Messenger (ﷺ) said, \"The taking of a bath on Friday is compulsory for every male Muslim who has attained the age of puberty and (also) the cleaning of his teeth with Siwak, and the using of perfume if it is available.\" `Amr (a sub-narrator) said, \"I confirm that the taking of a bath is compulsory, but as for the Siwak and the using of perfume, Allah knows better whether it is obligatory or not, but according to the Hadith it is as above.\"\r\nImam Abu Abdullah Bukhari said: This is the brother of Muhammad bin Munkadir and the name of Abu Bakr cannot be known. Bukair bin Ashajj and saeed bin Abu Hilal and many a man have reported it from him and the Kunyat (teknonym) of Muhammad bin Al-Munkadir is Abu Bakr and Abu Abdullah.",
                "hadithUrdu": "میں گواہ ہوں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جمعہ کے دن ہر جوان پر غسل ، مسواک اور خوشبو لگانا اگر میسر ہو ، ضروری ہے ۔ عمرو بن سلیم نے کہا کہ غسل کے متعلق تو میں گواہی دیتا ہوں کہ وہ واجب ہے لیکن مسواک اور خوشبو کا علم اللہ تعالیٰ کو زیادہ ہے کہ وہ بھی واجب ہیں یا نہیں ۔ لیکن حدیث میں اسی طرح ہے ۔ \r\nابوعبداللہ ( امام بخاری رحمہ اللہ ) نے فرمایا کہ ابوبکر بن منکدر محمد بن منکدر کے بھائی تھے اور ان کا نام معلوم نہیں ( ابوبکر ان کی کنیت تھی ) بکیر بن اشج ۔ سعید بن ابی ہلال اور بہت سے لوگ ان سے روایت کرتے ہیں ۔ اور محمد بن منکدر ان کے بھائی کی کنیت ابوبکر اور ابوعبداللہ بھی تھی ۔",
                "urduNarrator": "ہم سے علی بن مدینی نے بیان کیا ، انہوں نے کہا کہ ہمیں حرمی بن عمارہ نے خبر دی انہوں نے کہا کہ ہم سے شعبہ بن حجاج نے ابوبکر بن منکدر سے بیان کیا ، انہوں نے کہا کہ مجھ سے عمرو بن سلیم انصاری نے بیان کیا ، انہوں نے کہا کہ میں گواہ ہوں کہ ابو سعید خدری رضی اللہ عنہ نے فرمایا تھا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، قَالَ حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ، قَالَ حَدَّثَنِي عَمْرُو بْنُ سُلَيْمٍ الأَنْصَارِيُّ، قَالَ أَشْهَدُ عَلَى أَبِي سَعِيدٍ قَالَ أَشْهَدُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْغُسْلُ يَوْمَ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ، وَأَنْ يَسْتَنَّ وَأَنْ يَمَسَّ طِيبًا إِنْ وَجَدَ ‏\"‏‏.‏ قَالَ عَمْرٌو أَمَّا الْغُسْلُ فَأَشْهَدُ أَنَّهُ وَاجِبٌ، وَأَمَّا الاِسْتِنَانُ وَالطِّيبُ فَاللَّهُ أَعْلَمُ أَوَاجِبٌ هُوَ أَمْ لاَ، وَلَكِنْ هَكَذَا فِي الْحَدِيثِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ هُوَ أَخُو مُحَمَّدِ بْنِ الْمُنْكَدِرِ وَلَمْ يُسَمَّ أَبُو بَكْرٍ هَذَا‏.‏ رَوَاهُ عَنْهُ بُكَيْرُ بْنُ الأَشَجِّ وَسَعِيدُ بْنُ أَبِي هِلاَلٍ وَعِدَّةٌ‏.‏ وَكَانَ مُحَمَّدُ بْنُ الْمُنْكَدِرِ يُكْنَى بِأَبِي بَكْرٍ وَأَبِي عَبْدِ اللَّهِ‏.‏",
                "headingArabic": "الطِّيبِ لِلْجُمُعَةِ",
                "headingUrdu": "جمعہ کے لیے جانے سے پہلے خوشبو لگانا",
                "headingEnglish": "To perfume before going for the Friday (prayer)",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 857,
                "hadithNumber": "881",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) (p.b.u.h) said, \"Any person who takes a bath on Friday like the bath of Janaba and then goes for the prayer (in the first hour i.e. early), it is as if he had sacrificed a camel (in Allah's cause); and whoever goes in the second hour it is as if he had sacrificed a cow; and whoever goes in the third hour, then it is as if he had sacrificed a horned ram; and if one goes in the fourth hour, then it is as if he had sacrificed a hen; and whoever goes in the fifth hour then it is as if he had offered an egg. When the Imam comes out (i.e. starts delivering the Khutba), the angels present themselves to listen to the Khutba.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص جمعہ کے دن غسل جنابت کر کے نماز پڑھنے جائے تو گویا اس نے ایک اونٹ کی قربانی دی ( اگر اول وقت مسجد میں پہنچا ) اور اگر بعد میں گیا تو گویا ایک گائے کی قربانی دی اور جو تیسرے نمبر پر گیا تو گویا اس نے ایک سینگ والے مینڈھے کی قربانی دی ۔ اور جو کوئی چوتھے نمبر پر گیا تو اس نے گویا ایک مرغی کی قربانی دی اور جو کوئی پانچویں نمبر پر گیا اس نے گویا انڈا اللہ کی راہ میں دیا ۔ لیکن جب امام خطبہ کے لیے باہر آ جاتا ہے تو فرشتے خطبہ سننے میں مشغول ہو جاتے ہیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک نے ابوبکر بن عبدالرحمٰن کے غلام سمی سے خبر دی ، جنہیں ابوصالح سمان نے ، انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ ثُمَّ رَاحَ فَكَأَنَّمَا قَرَّبَ بَدَنَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ، وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً، فَإِذَا خَرَجَ الإِمَامُ حَضَرَتِ الْمَلاَئِكَةُ يَسْتَمِعُونَ الذِّكْرَ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ الْجُمُعَةِ",
                "headingUrdu": "جمعہ کی فضیلت (نماز اور خطبہ)",
                "headingEnglish": "The superiority of Jumu'ah (prayer and Khutba)",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 858,
                "hadithNumber": "882",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "While `Umar (bin Al-Khattab) رضی اللہ عنہ was delivering the Khutba on a Friday, a man entered (the mosque). `Umar رضی اللہ عنہ asked him, \"What has detained you from the prayer?\" The man said, \"It was only that when I heard the Adhan I performed ablution (for the prayer).\" On that `Umar said, \"Did you not hear the Prophet saying: 'Anyone of you going out for the Jumua prayer should take a bath'?\".",
                "hadithUrdu": "عمر بن خطاب رضی اللہ عنہ جمعہ کے دن خطبہ دے رہے تھے کہ ایک بزرگ ( حضرت عثمان رضی اللہ عنہ ) داخل ہوئے ۔ عمر بن خطاب رضی اللہ عنہ نے فرمایا کہ آپ لوگ نماز کے لیے آنے میں کیوں دیر کرتے ہیں ۔ ( اول وقت کیوں نہیں آتے ) آنے والے بزرگ نے فرمایا کہ دیر صرف اتنی ہوئی کہ اذان سنتے ہی میں نے وضو کیا ( اور پھر حاضر ہوا ) آپ نے فرمایا کہ کیا آپ لوگوں نے نبی کریم صلی اللہ علیہ وسلم سے یہ حدیث نہیں سنی ہے کہ جب کوئی جمعہ کے لیے جائے تو غسل کر لینا چاہیے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے شیبان بن عبدالرحمٰن نے یحییٰ بن ابی کثیر سے بیان کیا ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ عُمَرَ ـ رضى الله عنه ـ بَيْنَمَا هُوَ يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ دَخَلَ رَجُلٌ فَقَالَ عُمَرُ لِمَ تَحْتَبِسُونَ عَنِ الصَّلاَةِ فَقَالَ الرَّجُلُ مَا هُوَ إِلاَّ سَمِعْتُ النِّدَاءَ تَوَضَّأْتُ‏.‏ فَقَالَ أَلَمْ تَسْمَعُوا النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا رَاحَ أَحَدُكُمْ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 859,
                "hadithNumber": "883",
                "englishNarrator": "Narrated Salman-Al-Farsi رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (p.b.u.h) said, \"Whoever takes a bath on Friday, purifies himself as much as he can, then uses his (hair) oil or perfumes himself with the scent of his house, then proceeds (for the Jumua prayer) and does not separate two persons sitting together (in the mosque), then prays as much as (Allah has) written for him and then remains silent while the Imam is delivering the Khutba, his sins in-between the present and the last Friday would be forgiven.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص جمعہ کے دن غسل کرے اور خوب اچھی طرح سے پاکی حاصل کرے اور تیل استعمال کرے یا گھر میں جو خوشبو میسر ہو استعمال کرے پھر نماز جمعہ کے لیے نکلے اور مسجد میں پہنچ کر دو آدمیوں کے درمیان نہ گھسے ، پھر جتنی ہو سکے نفل نماز پڑھے اور جب امام خطبہ شروع کرے تو خاموش سنتا رہے تو اس کے اس جمعہ سے لے کر دوسرے جمعہ تک سارے گناہ معاف کر دیئے جاتے ہیں ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے ابن ابی ذئب نے سعید مقبری سے بیان کیا ، کہا کہ مجھے میرے باپ ابوسعید مقبری نے عبداللہ بن ودیعہ سے خبر دی ، ان سے حضرت سلمان فارسی رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، قَالَ أَخْبَرَنِي أَبِي، عَنِ ابْنِ وَدِيعَةَ، عَنْ سَلْمَانَ الْفَارِسِيِّ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَغْتَسِلُ رَجُلٌ يَوْمَ الْجُمُعَةِ، وَيَتَطَهَّرُ مَا اسْتَطَاعَ مِنْ طُهْرٍ، وَيَدَّهِنُ مِنْ دُهْنِهِ، أَوْ يَمَسُّ مِنْ طِيبِ بَيْتِهِ ثُمَّ يَخْرُجُ، فَلاَ يُفَرِّقُ بَيْنَ اثْنَيْنِ، ثُمَّ يُصَلِّي مَا كُتِبَ لَهُ، ثُمَّ يُنْصِتُ إِذَا تَكَلَّمَ الإِمَامُ، إِلاَّ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الأُخْرَى ‏\"‏‏.‏",
                "headingArabic": "الدُّهْنِ لِلْجُمُعَةِ",
                "headingUrdu": "جمعہ کی نماز کے لیے بالوں کا تیل استعمال کرنا",
                "headingEnglish": "To use (hair) oil for the Friday prayer",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 860,
                "hadithNumber": "884",
                "englishNarrator": "Narrated Tawus:",
                "hadithEnglish": "I said to Ibn `Abbas  رضی اللہ عنہما , \"The people are narrating that the Prophet (ﷺ) said, 'Take a bath on Friday and wash your heads (i.e. take a thorough bath) even though you were not Junub and use perfume'.\" On that Ibn `Abbas رضی اللہ عنہما replied, \"I know about the bath, (i.e. it is essential) but I do not know about the perfume (i.e. whether it is essential or not.)",
                "hadithUrdu": "میں نے عبداللہ بن عباس رضی اللہ عنہما سے پوچھا کہ لوگ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ جمعہ کے دن اگرچہ جنابت نہ ہو لیکن غسل کرو اور اپنے سر دھویا کرو اور خوشبو لگایا کرو ۔ ابن عباس رضی اللہ عنہما نے کہا کہ غسل کا حکم تو ٹھیک ہے لیکن خوشبو کے متعلق مجھے علم نہیں ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی کہ طاؤس بن کیسان نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ طَاوُسٌ قُلْتُ لاِبْنِ عَبَّاسٍ ذَكَرُوا أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ اغْتَسِلُوا يَوْمَ الْجُمُعَةِ وَاغْسِلُوا رُءُوسَكُمْ وَإِنْ لَمْ تَكُونُوا جُنُبًا، وَأَصِيبُوا مِنَ الطِّيبِ ‏\"‏‏.‏ قَالَ ابْنُ عَبَّاسٍ أَمَّا الْغُسْلُ فَنَعَمْ، وَأَمَّا الطِّيبُ فَلاَ أَدْرِي‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 861,
                "hadithNumber": "885",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The statement of the Prophet (ﷺ) regarding the taking of a bath on Friday and then I asked him whether the Prophet (ﷺ) had ordered perfume or (hair) oil to be used if they could be found in one's house. He (Ibn `Abbas) replied that he did not know about it.",
                "hadithUrdu": "آپ نے جمعہ کے دن غسل کے بارے میں نبی کریم صلی اللہ علیہ وسلم کی حدیث کا ذکر کیا تو میں نے کہا کہ کیا تیل اور خوشبو کا استعمال بھی ضروری ہے ؟ آپ نے فرمایا کہ مجھے معلوم نہیں ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، انہوں نے کہا کہ ہمیں ہشام بن یوسف نے خبر دی ، کہ انہیں ابن جریج نے خبر دی انہوں نے کہا کہ مجھے ابراہیم بن میسرہ نے طاؤس سے خبر دی اور انہیں حضرت عبداللہ بن عباس رضی اللہ عنہما نے ،",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ ذَكَرَ قَوْلَ النَّبِيِّ صلى الله عليه وسلم فِي الْغُسْلِ يَوْمَ الْجُمُعَةِ فَقُلْتُ لاِبْنِ عَبَّاسٍ أَيَمَسُّ طِيبًا أَوْ دُهْنًا إِنْ كَانَ عِنْدَ أَهْلِهِ فَقَالَ لاَ أَعْلَمُهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 862,
                "hadithNumber": "886",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "`Umar bin Al-Khattab رضی اللہ عنہ  saw a silken cloak (being sold) at the gate of the Mosque and said to Allah's Apostle, \"I wish you would buy this to wear on Fridays and also on occasions of the arrivals of the delegations.\" Allah's Messenger (ﷺ) replied, \"This will be worn by a person who will have no share (reward) in the Hereafter.\" Later on similar cloaks were given to Allah's Messenger (ﷺ) and he gave one of them to `Umar bin Al-Khattab رضی اللہ عنہ . On that `Umar said, \"O Allah's Messenger (ﷺ)! You have given me this cloak although on the cloak of Atarid (a cloak merchant who was selling that silken cloak at the gate of the mosque) you passed such and such a remark.\" Allah's Messenger (ﷺ) replied, \"I have not given you this to wear\". And so `Umar bin Al-Khattab رضی اللہ عنہ gave it to his pagan brother in Mecca to wear.",
                "hadithUrdu": "عمر بن خطاب رضی اللہ عنہ نے ( ریشم کا ) دھاری دار جوڑا مسجدنبوی کے دروازے پر بکتا دیکھا تو کہنے لگے یا رسول اللہ ! بہتر ہو اگر آپ اسے خرید لیں اور جمعہ کے دن اور وفود جب آپ صلی اللہ علیہ وسلم کے پاس آئیں تو ان کی ملاقات کے لیے آپ اسے پہنا کریں ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے تو وہی پہن سکتا ہے جس کا آخرت میں کوئی حصہ نہ ہو ۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم کے پاس اسی طرح کے کچھ جوڑے آئے تو اس میں سے ایک جوڑا آپ نے عمر بن خطاب رضی اللہ عنہ کو عطا فرمایا ۔ انہوں نے عرض کیا یا رسول اللہ ! آپ مجھے یہ جوڑا پہنا رہے ہیں حالانکہ اس سے پہلے عطارد کے جوڑے کے بارے میں آپ نے کچھ ایسا فرمایا تھا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے اسے تمہیں خود پہننے کے لیے نہیں دیا ہے ، چنانچہ حضرت عمر رضی اللہ عنہ نے اسے اپنے ایک مشرک بھائی کو پہنا دیا جو مکے میں رہتا تھا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک نے نافع سے خبر دی ، انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، رَأَى حُلَّةَ سِيَرَاءَ عِنْدَ باب الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ، لَوِ اشْتَرَيْتَ هَذِهِ فَلَبِسْتَهَا يَوْمَ الْجُمُعَةِ وَلِلْوَفْدِ إِذَا قَدِمُوا عَلَيْكَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لاَ خَلاَقَ لَهُ فِي الآخِرَةِ ‏\"‏‏.‏ ثُمَّ جَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْهَا حُلَلٌ، فَأَعْطَى عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ مِنْهَا حُلَّةً فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ، كَسَوْتَنِيهَا وَقَدْ قُلْتَ فِي حُلَّةِ عُطَارِدٍ مَا قُلْتَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي لَمْ أَكْسُكَهَا لِتَلْبَسَهَا ‏\"‏‏.‏ فَكَسَاهَا عُمَرُ بْنُ الْخَطَّابِ ـ رضى الله عنه ـ أَخًا لَهُ بِمَكَّةَ مُشْرِكًا‏.‏",
                "headingArabic": "يَلْبَسُ أَحْسَنَ مَا يَجِدُ",
                "headingUrdu": "بہترین لباس پہننا (نماز جمعہ کے لیے)",
                "headingEnglish": "To wear the best clothes (for the Jumu'ah prayer)",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 863,
                "hadithNumber": "887",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If I had not found it hard for my followers or the people, I would have ordered them to clean their teeth with Siwak for every prayer.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر مجھے اپنی امت یا لوگوں کی تکلیف کا خیال نہ ہوتا تو میں ہر نماز کے لیے ان کو مسواک کا حکم دے دیتا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا کہ ہمیں امام مالک رحمہ اللہ نے ابوالزناد سے خبر دی ، ان سے اعرج نے ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي ـ أَوْ عَلَى النَّاسِ ـ لأَمَرْتُهُمْ بِالسِّوَاكِ مَعَ كُلِّ صَلاَةٍ ‏\"‏‏.‏",
                "headingArabic": "السِّوَاكِ يَوْمَ الْجُمُعَةِ",
                "headingUrdu": "بہترین لباس پہننا (نماز جمعہ کے لیے)",
                "headingEnglish": "To clean the teeth with Siwak on Friday",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 864,
                "hadithNumber": "888",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"I have told you repeatedly to use the Siwak. (The Prophet (ﷺ) put emphasis on the use of the Siwak.)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں تم سے مسواک کے بارے میں بہت کچھ کہہ چکا ہوں ۔",
                "urduNarrator": "ہم سے ابومعمر عبداللہ نے بیان کیا ، کہا کہ ہم سے عبدالوارث نے بیان کیا ، کہا کہ ہم سے شعیب بن حبحاب نے بیان کیا ، کہا کہ ہم سے انس رضی اللہ عنہ نے بیان کیا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ الْحَبْحَابِ، حَدَّثَنَا أَنَسٌ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَكْثَرْتُ عَلَيْكُمْ فِي السِّوَاكِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 865,
                "hadithNumber": "889",
                "englishNarrator": "Narrated Hudhaifa رضی اللہ عنہ :",
                "hadithEnglish": "When the Prophet (p.b.u.h) got up at night (for the night prayer), he used to clean his mouth .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب رات کو اٹھتے تو منہ کو مسواک سے خوب صاف کرتے ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، کہ ہمیں سفیان ثوری نے منصور بن معمر اور حصین بن عبدالرحمٰن سے خبر دی ، انہیں ابووائل نے ، انہیں حذیفہ بن یمان رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، وَحُصَيْنٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَامَ مِنَ اللَّيْلِ يَشُوصُ فَاهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 866,
                "hadithNumber": "890",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "`Abdur-Rahman bin Abi Bakr came holding a Siwak with which he was cleaning his teeth. Allah's Apostle looked at him. I requested `Abdur-Rahman to give the Siwak to me and after he gave it to me I divided it, chewed it and gave it to Allah's Messenger (ﷺ). Then he cleaned his teeth with it and (at that time) he was resting against my chest.",
                "hadithUrdu": "عبدالرحمن بن ابی بکر ( ایک مرتبہ ) آئے ۔ ان کے ہاتھ میں مسواک تھی جسے وہ استعمال کیا کرتے تھے ۔ رسول اللہ صلی اللہ علیہ وسلم نے بیماری کی حالت میں ان سے کہا عبدالرحمٰن یہ مسواک مجھے دیدے ۔ انہوں نے دے دی ۔ میں نے اس کے سرے کو پہلے توڑا یعنی اتنی لکڑی نکال دی جو عبدالرحمٰن اپنے منہ سے لگایا کرتے تھے ، پھر اسے چبا کر رسول اللہ صلی اللہ علیہ وسلم کو دے دیا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس سے دانت صاف کئے اور آپ صلی اللہ علیہ وسلم اس وقت میرے سینے پر ٹیک لگائے ہوئے تھے ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ ہم سے سلیمان بن ہلال نے بیان کیا کہ ہشام بن عروہ نے کہا کہ مجھے میرے باپ عروہ بن زبیر نے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا سے خبر دی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، قَالَ قَالَ هِشَامُ بْنُ عُرْوَةَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ، وَمَعَهُ سِوَاكٌ يَسْتَنُّ بِهِ، فَنَظَرَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ لَهُ أَعْطِنِي هَذَا السِّوَاكَ يَا عَبْدَ الرَّحْمَنِ‏.‏ فَأَعْطَانِيهِ فَقَصَمْتُهُ ثُمَّ مَضَغْتُهُ، فَأَعْطَيْتُهُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَاسْتَنَّ بِهِ وَهْوَ مُسْتَسْنِدٌ إِلَى صَدْرِي‏.‏",
                "headingArabic": "مَنْ تَسَوَّكَ بِسِوَاكِ غَيْرِهِ",
                "headingUrdu": "جو اپنے دانت مسواک سے صاف کرے۔",
                "headingEnglish": "Whoever cleans his teeth with Siwak",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 867,
                "hadithNumber": "891",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) used to recite the following in the Fajr prayer of Friday, \"Alif, Lam, Mim, Tanzil\" (Suratas- Sajda #32) and \"Hal-ata-ala-l-Insani\" (i.e. Surah-Ad-Dahr #76).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جمعہ کے دن فجر کی نماز میں «الم تنزيل‏» اور «هل أتى على الإنسان‏» پڑھا کرتے تھے ۔",
                "urduNarrator": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان ثوری نے سعد بن ابراہیم کے واسطے سے بیان کیا ، ان سے عبدالرحمٰن بن ہرمز نے ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ ـ هُوَ ابْنُ هُرْمُزَ ـ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ فِي الْجُمُعَةِ فِي صَلاَةِ الْفَجْرِ ‏{‏الم * تَنْزِيلُ‏}‏ السَّجْدَةَ وَ‏{‏هَلْ أَتَى عَلَى الإِنْسَانِ‏}‏",
                "headingArabic": "مَا يُقْرَأُ فِي صَلاَةِ الْفَجْرِ يَوْمَ الْجُمُعَةِ",
                "headingUrdu": "جمعہ کے دن فجر کی نماز میں کیا پڑھنا چاہیے؟",
                "headingEnglish": "What should be recited in the Fajr prayer on Friday",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 868,
                "hadithNumber": "892",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The first Jumua prayer which was offered after a Jumua prayer offered at the mosque of Allah's Apostle took place in the mosque of the tribe of `Abdul Qais at Jawathi in Bahrain.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی مسجد کے بعد سب سے پہلا جمعہ بنو عبدالقیس کی مسجد میں ہوا جو بحرین کے ملک جواثی میں تھی ۔",
                "urduNarrator": "ہم سے محمد بن مثنی نے بیان کیا ، انہوں نے کہا کہ ہم سے ابوعامر عقدی نے بیان کیا ، انہوں نے کہا کہ ہم سے ابراہیم بن طہمان نے بیان کیا ، ان سے ابوجمرہ نضر بن عبدالرحمٰن ضبعی نے ، ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے ، آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنْ أَبِي جَمْرَةَ الضُّبَعِيِّ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ إِنَّ أَوَّلَ جُمُعَةٍ جُمِّعَتْ بَعْدَ جُمُعَةٍ فِي مَسْجِدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي مَسْجِدِ عَبْدِ الْقَيْسِ بِجُوَاثَى مِنَ الْبَحْرَيْنِ‏.‏",
                "headingArabic": "الْجُمُعَةِ فِي الْقُرَى وَالْمُدْنِ",
                "headingUrdu": "دیہاتوں اور قصبوں میں نماز جمعہ اور خطبہ پڑھنا",
                "headingEnglish": "To offer Jumu'ah prayer and Khutba in villages and towns",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 869,
                "hadithNumber": "893",
                "englishNarrator": "Narrated Ibn `Umar:",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"All of you are Guardians.\" Yunis said: Ruzaiq bin Hukaim wrote to Ibn Shihab while I was with him at Wadi-al-Qura saying, \"Shall I lead the Jumua prayer?\" Ruzaiq was working on the land (i.e. farming) and there was a group of Sudanese people and some others with him; Ruzaiq was then the Governor of Aila. Ibn Shihab wrote (to Ruzaiq) ordering him to lead the Jumua prayer and telling him that Salim told him that `Abdullah bin `Umar had said, \"I heard Allah's Apostle saying, 'All of you are guardians and responsible for your wards and the things under your care. The Imam (i.e. ruler) is the guardian of his subjects and is responsible for them and a man is the guardian of his family and is responsible for them. A woman is the guardian of her husband's house and is responsible for it. A servant is the guardian of his master's belongings and is responsible for them.' I thought that he also said, 'A man is the guardian of his father's property and is responsible for it. All of you are guardians and responsible for your wards and the things under your care.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کو یہ کہتے ہوئے سنا کہ تم میں سے ہر شخص نگہبان ہے اور لیث نے اس میں یہ زیادتی کی کہ یونس نے بیان کیا کہ رزیق بن حکیم نے ابن شہاب کو لکھا ، ان دنوں میں بھی وادی القریٰ میں ابن شہاب کے پاس ہی تھا کہ کیا میں جمعہ پڑھا سکتا ہوں ۔ رزیق ( ایلہ کے اطراف میں ) ایک زمین کاشت کروا رہے تھے ۔ وہاں حبشہ وغیرہ کے کچھ لوگ موجود تھے ۔ اس زمانہ میں رزیق ایلہ میں ( حضرت عمر بن عبدالعزیز کی طرف سے ) حاکم تھے ۔ ابن شہاب رحمہ اللہ نے انہیں لکھوایا ، میں وہیں سن رہا تھا کہ رزیق جمعہ پڑھائیں ۔ ابن شہاب رزیق کو یہ خبر دے رہے تھے کہ سالم نے ان سے حدیث بیان کی کہ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ۔ آپ نے فرمایا کہ تم میں سے ہر ایک نگراں ہے اور اس کے ماتحتوں کے متعلق اس سے سوال ہو گا ۔ امام نگراں ہے اور اس سے سوال اس کی رعایا کے بارے میں ہو گا ۔ انسان اپنے گھر کا نگراں ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ عورت اپنے شوہر کے گھر کی نگراں ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ خادم اپنے آقا کے مال کا نگراں ہے اور اس سے اس کی رعیت کے بارے میں سوال ہو گا ۔ ابن عمر رضی اللہ عنہما نے فرمایا کہ میرا خیال ہے کہ آپ صلی اللہ علیہ وسلم نے یہ بھی فرمایا کہ انسان اپنے باپ کے مال کا نگراں ہے اور اس کی رعیت کے بارے میں اس سے سوال ہو گا اور تم میں سے ہر شخص نگراں ہے اور سب سے اس کی رعیت کے بارے میں سوال ہو گا ۔",
                "urduNarrator": "ہم سے بشر بن محمد مروزی نے بیان کیا ، کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ، کہا کہ ہمیں یونس بن یزید نے زہری سے خبر دی ، انہیں سالم بن عبداللہ نے ابن عمر سے خبر دی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنَا سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ كُلُّكُمْ رَاعٍ ‏\"‏‏.‏ وَزَادَ اللَّيْثُ قَالَ يُونُسُ كَتَبَ رُزَيْقُ بْنُ حُكَيْمٍ إِلَى ابْنِ شِهَابٍ ـ وَأَنَا مَعَهُ يَوْمَئِذٍ بِوَادِي الْقُرَى ـ هَلْ تَرَى أَنْ أُجَمِّعَ‏.‏ وَرُزَيْقٌ عَامِلٌ عَلَى أَرْضٍ يَعْمَلُهَا، وَفِيهَا جَمَاعَةٌ مِنَ السُّودَانِ وَغَيْرِهِمْ، وَرُزَيْقٌ يَوْمَئِذٍ عَلَى أَيْلَةَ، فَكَتَبَ ابْنُ شِهَابٍ ـ وَأَنَا أَسْمَعُ ـ يَأْمُرُهُ أَنْ يُجَمِّعَ، يُخْبِرُهُ أَنَّ سَالِمًا حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ كُلُّكُمْ رَاعٍ، وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ، الإِمَامُ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالرَّجُلُ رَاعٍ فِي أَهْلِهِ وَهْوَ مَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالْمَرْأَةُ رَاعِيَةٌ فِي بَيْتِ زَوْجِهَا وَمَسْئُولَةٌ عَنْ رَعِيَّتِهَا، وَالْخَادِمُ رَاعٍ فِي مَالِ سَيِّدِهِ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ ـ قَالَ وَحَسِبْتُ أَنْ قَدْ قَالَ ـ وَالرَّجُلُ رَاعٍ فِي مَالِ أَبِيهِ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ وَكُلُّكُمْ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 870,
                "hadithNumber": "894",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"Anyone of you coming for the Jumua prayer should take a bath.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا کہ تم میں سے جو شخص جمعہ پڑھنے آئے تو غسل کرے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی ، انہوں نے کہا کہ مجھ سے سالم بن عبداللہ نے بیان کیا ، انہوں نے ( اپنے والد ) عبداللہ بن عمر رضی اللہ عنہما سے سنا وہ فرماتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ جَاءَ مِنْكُمُ الْجُمُعَةَ فَلْيَغْتَسِلْ ‏\"‏‏.‏",
                "headingArabic": "هَلْ عَلَى مَنْ لَمْ يَشْهَدِ الْجُمُعَةَ غُسْلٌ مِنَ النِّسَاءِ وَالصِّبْيَانِ وَغَيْرِهِمْ",
                "headingUrdu": "کیا ان لوگوں کے لیے غسل ضروری ہے جو جمعہ کی نماز کے لیے حاضر نہیں ہوتے؟",
                "headingEnglish": "Is the bath necessary for those who do not present themselves for the Jumu'ah prayer",
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 871,
                "hadithNumber": "895",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The taking of a bath on Friday is compulsory for every Muslim who has attained the age of puberty.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ہر بالغ کے اوپر جمعہ کے دن غسل واجب ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے صفوان بن سلیم نے ، ان سے عطاء بن یسار نے ، ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 872,
                "hadithNumber": "896, 897",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said \"We are the last (to come amongst the nations) but (will be) the foremost on the Day of Resurrection. They were given the Holy Scripture before us and we were given the Quran after them. And this was the day (Friday) about which they differed and Allah gave us the guidance (for that). So tomorrow (i.e. Saturday) is the Jews' (day), and the day after tomorrow (i.e. Sunday) is the Christians'.\" The Prophet (p.b.u.h) remained silent (for a while) and then said, \"It is obligatory for every Muslim that he should take a bath once in seven days, when he should wash his head and body.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہم ( دنیا میں ) تو بعد میں آئے لیکن قیامت کے دن سب سے آگے ہونگے ، فرق صرف یہ ہے کہ یہود و نصاریٰ کو کتاب ہم سے پہلے دی گئی اور ہمیں بعد میں ۔ تو یہ دن ( جمعہ ) وہ ہے جس کے بارے میں اہل کتاب نے اختلاف کیا ، اللہ تعالیٰ نے ہمیں یہ دن بتلا دیا ( اس کے بعد ) دوسرا دن ( ہفتہ ) یہود کا دن ہے اور تیسرا دن ( اتوار ) نصاری کا ۔ آپ پھر خاموش ہو گئے۔ اس کے بعد فرمایا کہ ہر مسلمان پر حق ہے ( اللہ تعالیٰ کا ) ہر سات دن میں ایک دن جمعہ میں غسل کرے جس میں اپنے سر اور بدن کو دھوئے ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا کہ ہم سے وہیب بن خالد نے بیان کیا ، کہا کہ ہم سے عبداللہ بن طاؤس نے بیان کیا ، ان سے ان کے باپ طاؤس نے ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ، أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا، وَأُوتِينَاهُ مِنْ بَعْدِهِمْ، فَهَذَا الْيَوْمُ الَّذِي اخْتَلَفُوا فِيهِ فَهَدَانَا اللَّهُ، فَغَدًا لِلْيَهُودِ وَبَعْدَ غَدٍ لِلنَّصَارَى ‏\"‏‏.‏ فَسَكَتَ‏.‏ثُمَّ قَالَ ‏\"‏ حَقٌّ عَلَى كُلِّ مُسْلِمٍ أَنْ يَغْتَسِلَ فِي كُلِّ سَبْعَةِ أَيَّامٍ يَوْمًا يَغْسِلُ فِيهِ رَأْسَهُ وَجَسَدَهُ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ حَقٌّ عَلَى كُلِّ مُسْلِمٍ أَنْ يَغْتَسِلَ فِي كُلِّ سَبْعَةِ أَيَّامٍ يَوْمًا يَغْسِلُ فِيهِ رَأْسَهُ وَجَسَدَهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 873,
                "hadithNumber": "898",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"It is Allah's right on every Muslim that he should take a bath (at least) once in seven days.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ کا ہر مسلمان پر حق ہے کہ ہر سات دن میں ایک دن ( جمعہ ) غسل کرے ۔",
                "urduNarrator": "اس حدیث کی روایت ابان بن صالح نے مجاہد سے کی ہے ، ان سے طاؤس نے ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "رَوَاهُ أَبَانُ بْنُ صَالِحٍ عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم  \"‏ لِلَّهِ تَعَالَى عَلَى كُلِّ مُسْلِمٍ حَقٌّ أَنْ يَغْتَسِلَ فِي كُلِّ سَبْعَةِ أَيَّامٍ يَوْمًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 874,
                "hadithNumber": "899",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (p.b.u.h) said, \"Allow women to go to the Mosques at night.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا عورتوں کو رات کے وقت مسجدوں میں آنے کی اجازت دے دیا کرو ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا کہ ہم سے شبابہ نے بیان کیا ، کہا کہ ہم سے ورقاء بن عمرو نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے مجاہد نے ، ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا وَرْقَاءُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ ائْذَنُوا لِلنِّسَاءِ بِاللَّيْلِ إِلَى الْمَسَاجِدِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 875,
                "hadithNumber": "900",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "One of the wives of `Umar (bin Al-Khattab) رضی اللہ عنہ used to offer the Fajr and the `Isha' prayer in congregation in the Mosque. She was asked why she had come out for the prayer as she knew that `Umar رضی اللہ عنہ disliked it, and he has great ghaira (self-respect). She replied, \"What prevents him from stopping me from this act?\" The other replied, \"The statement of Allah's Messenger (ﷺ) : 'Do not stop Allah's women-slaves from going to Allah's Mosques' prevents him.\"",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ کی ایک بیوی تھیں جو صبح اور عشاء کی نماز جماعت سے پڑھنے کے لیے مسجد میں آیا کرتی تھیں ۔ ان سے کہا گیا کہ باوجود اس علم کے کہ حضرت عمر رضی اللہ عنہ اس بات کو مکروہ جانتے ہیں اور وہ غیرت محسوس کرتے ہیں پھر آپ مسجد میں کیوں جاتی ہیں ۔ اس پر انہوں نے جواب دیا کہ پھر وہ مجھے منع کیوں نہیں کر دیتے ۔ لوگوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کی اس حدیث کی وجہ سے کہ اللہ کی بندیوں کو اللہ کی مسجدوں میں آنے سے مت روکو ۔",
                "urduNarrator": "ہم سے یوسف بن موسیٰ نے بیان کیا ، کہا کہ ہم سے ابواسامہ نے بیان کیا کہا کہ ہم سے عبیداللہ ابن عمر نے بیان کیا ، ان سے نافع نے ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَتِ امْرَأَةٌ لِعُمَرَ تَشْهَدُ صَلاَةَ الصُّبْحِ وَالْعِشَاءِ فِي الْجَمَاعَةِ فِي الْمَسْجِدِ، فَقِيلَ لَهَا لِمَ تَخْرُجِينَ وَقَدْ تَعْلَمِينَ أَنَّ عُمَرَ يَكْرَهُ ذَلِكَ وَيَغَارُ قَالَتْ وَمَا يَمْنَعُهُ أَنْ يَنْهَانِي قَالَ يَمْنَعُهُ قَوْلُ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَمْنَعُوا إِمَاءَ اللَّهِ مَسَاجِدَ اللَّهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "12",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 12,
                    "chapterNumber": "12",
                    "chapterEnglish": "Friday Prayer",
                    "chapterUrdu": "جمعہ کے بیان میں",
                    "chapterArabic": "كتاب الجمعة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 851,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=34",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=32",
                "label": "32",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=33",
                "label": "33",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=34",
                "label": "34",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=35",
                "label": "35",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=36",
                "label": "36",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=37",
                "label": "37",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=38",
                "label": "38",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=36",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=36",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=34",
        "to": 875,
        "total": 40465
    }
}