{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 168,
        "data": [
            {
                "id": 4178,
                "hadithNumber": "4386",
                "englishNarrator": "Narrated `Imran bin Husain رضی اللہ عنہما :",
                "hadithEnglish": "The people of Banu Tamim came to Allah's Messenger (ﷺ), and he said, \"Be glad (i.e. have good tidings). O Banu Tamim!\" They said, \"As you have given us good tidings then give us (some material things).\" On that the features of Allah's Messenger (ﷺ) changed (i.e. he took it ill). Then some people from Yemen came, and the Prophet (ﷺ) said (to them) \"Accept good tidings as Banu Tamim have not accepted them.\" They said, \"We accept them, O Allah's Messenger (ﷺ)!\"",
                "hadithUrdu": "بنو تمیم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے بنو تمیم! بشارت قبول کرو۔ انہوں نے کہا کہ جب آپ نے ہمیں بشارت دی ہے تو کچھ روپے بھی عنایت فرمائیے۔ اس پر آپ صلی اللہ علیہ وسلم کے چہرے کا رنگ بدل گیا۔ پھر یمن کے کچھ اشعری لوگ آئے، آپ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ بنو تمیم نے بشارت قبول نہیں کی، یمن والو! تم قبول کر لو۔ وہ بولے ہم نے قبول کی یا رسول اللہ۔",
                "urduNarrator": "مجھ سے عمرو بن علی نے بیان کیا، کہا ہم سے ابوعاصم نبیل نے بیان کیا۔ کہا ہم سے سفیان ثوری نے بیان کیا، کہا ہم سے ابوصخرہ جامع بن شداد نے بیان کیا، کہا ہم سے صفوان بن محرز مازنی نے بیان کیا، کہا ہم سے عمران بن حصین رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَبُو صَخْرَةَ، جَامِعُ بْنُ شَدَّادٍ حَدَّثَنَا صَفْوَانُ بْنُ مُحْرِزٍ الْمَازِنِيُّ، حَدَّثَنَا عِمْرَانُ بْنُ حُصَيْنٍ، قَالَ جَاءَتْ بَنُو تَمِيمٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَبْشِرُوا يَا بَنِي تَمِيمٍ ‏\"‏‏.‏ قَالُوا أَمَّا إِذْ بَشَّرْتَنَا فَأَعْطِنَا‏.‏ فَتَغَيَّرَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَجَاءَ نَاسٌ مِنْ أَهْلِ الْيَمَنِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اقْبَلُوا الْبُشْرَى إِذْ لَمْ يَقْبَلْهَا بَنُو تَمِيمٍ ‏\"‏‏.‏ قَالُوا قَدْ قَبِلْنَا يَا رَسُولَ اللَّهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4179,
                "hadithNumber": "4387",
                "englishNarrator": "Narrated Abu Masud رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) beckoned with his hand towards Yemen and said, \"Belief is there.\" The harshness and mercilessness are the qualities of those farmers etc, who are busy with their camels and pay no attention to the religion (is towards the east) from where the side of the head of Satan will appear; those are the tribes of Rabi`a and Mudar.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ایمان تو ادھر ہے اور آپ نے اپنے ہاتھ سے یمن کی طرف اشارہ کیا اور بےرحمی اور سخت دلی اونٹ کی دم کے پیچھے پیچھے چلانے والوں میں ہے، جدھر سے شیطان کے دونوں سینگ نکلتے ہیں ( یعنی مشرق ) قبیلہ ربیعہ اور مضر کے لوگوں میں۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد جعفی نے بیان کیا، کہا ہم سے وہب بن جریر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے اسماعیل بن ابی خالد نے، ان سے قیس بن ابی حازم نے اور ان سے ابومسعود رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ أَبِي مَسْعُودٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ الإِيمَانُ هَا هُنَا ‏\"‏‏.‏ وَأَشَارَ بِيَدِهِ إِلَى الْيَمَنِ ‏\"‏ وَالْجَفَاءُ وَغِلَظُ الْقُلُوبِ فِي الْفَدَّادِينَ، عِنْدَ أُصُولِ أَذْنَابِ الإِبِلِ مِنْ حَيْثُ يَطْلُعُ قَرْنَا الشَّيْطَانِ رَبِيعَةَ وَمُضَرَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4180,
                "hadithNumber": "4388",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The people of Yemen have come to you and they are more gentle and soft-hearted. Belief is Yemenite and Wisdom is Yemenite, while pride and haughtiness are the qualities of the owners of camels (i.e. bedouins). Calmness and solemnity are the characters of the owners of sheep.\" Ghunder from Shobah, Sulaiman, Dhakwan, Hadrat Abu Hurairah رضی اللہ عنہ and he reported it from the prophet ﷺ. (It is the second authorityof this Hadith).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے یہاں اہل یمن آ گئے ہیں، ان کے دل کے پردے باریک، دل نرم ہوتے ہیں، ایمان یمن والوں کا ہے اور حکمت بھی یمن کی اچھی ہے اور فخر و تکبر اونٹ والوں میں ہوتا ہے اور اطمینان اور سہولت بکری والوں میں۔ اور غندر نے بیان کیا اس حدیث کو شعبہ سے، ان سے سلیمان نے، انہوں نے ذکوان سے سنا، انہوں نے ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے محمد بن ابی عدی نے بیان کیا، ان سے شعبہ نے، ان سے سلیمان نے، ان سے ذکوان نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ ذَكْوَانَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَتَاكُمْ أَهْلُ الْيَمَنِ، هُمْ أَرَقُّ أَفْئِدَةً وَأَلْيَنُ قُلُوبًا، الإِيمَانُ يَمَانٍ وَالْحِكْمَةُ يَمَانِيَةٌ، وَالْفَخْرُ وَالْخُيَلاَءُ فِي أَصْحَابِ الإِبِلِ، وَالسَّكِينَةُ وَالْوَقَارُ فِي أَهْلِ الْغَنَمِ ‏\"‏‏.‏ وَقَالَ غُنْدَرٌ عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، سَمِعْتُ ذَكْوَانَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4181,
                "hadithNumber": "4389",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Belief is Yemenite while afflictions appear from there (the east) from where the side of the head of Satan will appear.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ایمان یمن کا ہے اور فتنہ ( دین کی خرابی ) ادھر سے ہے اور ادھر ہی سے شیطان کے سر کا کونا نمودار ہو گا۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا، کہا کہ مجھ سے میرے بھائی عبدالحمید نے بیان کیا، ان سے ابن بلال نے، ان سے ثور بن زید نے، ان سے ابوالغیث (سالم) نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ الإِيمَانُ يَمَانٍ، وَالْفِتْنَةُ هَا هُنَا، هَا هُنَا يَطْلُعُ قَرْنُ الشَّيْطَانِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4182,
                "hadithNumber": "4390",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The people of Yemen have come to you, and they are more soft hearted and gentle hearted people. The capacity for understanding religion is Yemenite and Wisdom is Yemenite.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے یہاں اہل یمن آئے ہیں جو نرم دل رقیق القلب ہیں، دین کی سمجھ یمن والوں میں ہے اور حکمت بھی یمن کی ہے۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، کہا ہم سے ابوالزناد نے بیان کیا، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَتَاكُمْ أَهْلُ الْيَمَنِ، أَضْعَفُ قُلُوبًا وَأَرَقُّ أَفْئِدَةً، الْفِقْهُ يَمَانٍ، وَالْحِكْمَةُ يَمَانِيَةٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4183,
                "hadithNumber": "4391",
                "englishNarrator": "Narrated Alqama:",
                "hadithEnglish": "We were sitting with Ibn Masud رضی اللہ عنہ when Khabbab رضی اللہ عنہ came and said, \"O Abu `Abdur-Rahman! Can these young fellows recite Qur'an as you do?\" Ibn Mas`ud رضی اللہ عنہ said, \"If you wish I can order one of them to recite (Qur'an) for you .\" Khabbab replied, \"Yes. \"Ibn Mas`ud رضی اللہ عنہ said, \"Recite, O 'Alqama!\" On that, Zaid bin Hudair, the brother of Ziyad bin Hudair said, (to Ibn Mas`ud رضی اللہ عنہ), \"Why have you ordered 'Alqama to recite though he does not recite better than we?\" Ibn Mas`ud رضی اللہ عنہ said, \"If you like, I would tell you what the Prophet (ﷺ) said about your nation and his (i.e. 'Alqama's) nation.\" So I recited fifty Verses from Sura-Maryam. `Abdullah (bin Mas`ud رضی اللہ عنہ) said to Khabbab رضی اللہ عنہ, \"What do you think (about 'Alqama's recitation)?\" Khabbab رضی اللہ عنہ said, \"He has recited well.\" `Abdullah رضی اللہ عنہ said, \"Whatever I recite, 'Alqama recites.\" Then `Abdullah رضی اللہ عنہ turned towards Khabbab رضی اللہ عنہ and saw that he was wearing a gold ring, whereupon he said, \"Hasn't the time for its throwing away come yet?\" Khabbab رضی اللہ عنہ said, \"You will not see me wearing it after today,\" and he throw it away. The same hadith has been narrated by Ghandar from Shuba.",
                "hadithUrdu": "ہم عبداللہ بن مسعود رضی اللہ عنہ کے پاس بیٹھے ہوئے تھے۔ اتنے میں خباب بن ارت رضی اللہ عنہ مشہور صحابی تشریف لائے اور کہا: ابوعبدالرحمٰن! کیا یہ نوجوان لوگ ( جو تمہارے شاگرد ہیں ) اسی طرح قرآن پڑھ سکتے ہیں جیسے آپ پڑھتے ہیں؟ ابن مسعود رضی اللہ عنہ نے کہا کہ اگر آپ چاہیں تو میں کسی سے تلاوت کے لیے کہوں؟ انہوں نے فرمایا کہ ضرور۔ اس پر ابن مسعود رضی اللہ عنہ نے کہا: علقمہ! تم پڑھو، زید بن حدیر، زیاد بن حدیر کے بھائی، بولے آپ علقمہ سے تلاوت قرآن کے لیے فرماتے ہیں حالانکہ وہ ہم سب سے اچھے قاری نہیں ہیں۔ ابن مسعود رضی اللہ عنہ نے کہا اگر تم چاہو تو میں تمہیں وہ حدیث سنا دوں جو رسول اللہ صلی اللہ علیہ وسلم نے تمہاری قوم کے حق میں فرمائی تھی۔ خیر علقمہ کہتے ہیں کہ میں نے سورۃ مریم کی پچاس آیتیں پڑھ کر سنائیں۔ عبداللہ بن مسعود رضی اللہ عنہ نے خباب رضی اللہ عنہ سے پوچھا کہو کیسا پڑھتا ہے؟ خباب رضی اللہ عنہ نے کہا بہت خوب پڑھا۔ عبداللہ بن مسعود رضی اللہ عنہ نے کہا کہ جو آیت بھی میں جس طرح پڑھتا ہوں علقمہ بھی اسی طرح پڑھتا ہے، پھر انہوں نے خباب رضی اللہ عنہ کو دیکھا، ان کے ہاتھ میں سونے کی انگوٹھی تھی، تو کہا: کیا ابھی وقت نہیں آیا ہے کہ یہ انگوٹھی پھینک دی جائے۔ خباب رضی اللہ عنہ نے کہا کہ آج کے بعد آپ یہ انگوٹھی میرے ہاتھ میں نہیں دیکھیں گے۔ چنانچہ انہوں نے انگوٹھی اتار دی۔ اسی حدیث کو غندر نے شعبہ سے روایت کیا ہے۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا، ان سے ابوحمزہ محمد بن میمون نے، ان سے اعمش نے، ان سے ابراہیم نخعی نے اور ان سے علقمہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ كُنَّا جُلُوسًا مَعَ ابْنِ مَسْعُودٍ، فَجَاءَ خَبَّابٌ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ، أَيَسْتَطِيعُ هَؤُلاَءِ الشَّبَابُ أَنْ يَقْرَءُوا كَمَا تَقْرَأُ قَالَ أَمَا إِنَّكَ لَوْ شِئْتَ أَمَرْتُ بَعْضَهُمْ يَقْرَأُ عَلَيْكَ قَالَ أَجَلْ‏.‏ قَالَ اقْرَأْ يَا عَلْقَمَةُ‏.‏ فَقَالَ زَيْدُ بْنُ حُدَيْرٍ أَخُو زِيَادِ بْنِ حُدَيْرٍ أَتَأْمُرُ عَلْقَمَةَ أَنْ يَقْرَأَ وَلَيْسَ بِأَقْرَئِنَا قَالَ أَمَا إِنَّكَ إِنْ شِئْتَ أَخْبَرْتُكَ بِمَا قَالَ النَّبِيُّ صلى الله عليه وسلم فِي قَوْمِكَ وَقَوْمِهِ‏.‏ فَقَرَأْتُ خَمْسِينَ آيَةً مِنْ سُورَةِ مَرْيَمَ، فَقَالَ عَبْدُ اللَّهِ كَيْفَ تَرَى قَالَ قَدْ أَحْسَنَ‏.‏ قَالَ عَبْدُ اللَّهِ مَا أَقْرَأُ شَيْئًا إِلاَّ وَهُوَ يَقْرَؤُهُ، ثُمَّ الْتَفَتَ إِلَى خَبَّابٍ وَعَلَيْهِ خَاتَمٌ مِنْ ذَهَبٍ فَقَالَ أَلَمْ يَأْنِ لِهَذَا الْخَاتَمِ أَنْ يُلْقَى قَالَ أَمَا إِنَّكَ لَنْ تَرَاهُ عَلَىَّ بَعْدَ الْيَوْمِ، فَأَلْقَاهُ‏.‏ رَوَاهُ غُنْدَرٌ عَنْ شُعْبَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4184,
                "hadithNumber": "4392",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Tufail bin `Amr رضی اللہ عنہ came to the Prophet (ﷺ) and said, \"The Daus (nation) have perished as they disobeyed and refused to accept Islam. So invoke Allah against them.\" But the Prophet (ﷺ) said, \"O Allah! Give guidance to the Daus (tribe) and bring them (to Islam)!\"",
                "hadithUrdu": "طفیل بن عمرو رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ قبیلہ دوس تو تباہ ہوا۔ اس نے نافرمانی اور انکار کیا ( اسلام قبول نہیں کیا ) آپ اللہ سے ان کے لیے دعا کیجئے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اے اللہ! قبیلہ دوس کو ہدایت دے اور انہیں میرے یہاں لے آ۔“",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے عبداللہ بن ذکوان نے بیان کیا، ان سے عبدالرحمٰن اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ ذَكْوَانَ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ جَاءَ الطُّفَيْلُ بْنُ عَمْرٍو إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنَّ دَوْسًا قَدْ هَلَكَتْ، عَصَتْ وَأَبَتْ، فَادْعُ اللَّهَ عَلَيْهِمْ‏.‏ فَقَالَ ‏ \"‏ اللَّهُمَّ اهْدِ دَوْسًا وَأْتِ بِهِمْ ‏\"‏‏.‏",
                "headingArabic": "قِصَّةُ دَوْسٍ وَالطُّفَيْلِ بْنِ عَمْرٍو الدَّوْسِيِّ",
                "headingUrdu": "باب: داؤس اور طفیل بن عمرو الدوسی کا قصہ",
                "headingEnglish": "The story of Daus and Tufail bin ‘Amr Ad-Dausi",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4185,
                "hadithNumber": "4393",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "When I came to the Prophet (ﷺ) said on my way, \"O what a long tedious tiresome night; nevertheless, it has rescued me from the place of Heathenism.\" A slave of mine ran away on the way. When I reached the Prophet (ﷺ) I gave him the oath of allegiance (for Islam), and while I was sitting with him, suddenly the slave appeared. The Prophet (ﷺ) said to me. \"O Abu Huraira! Here is your slave,\" I said, \"He (i.e. the slave) is (free) for Allah's Sake,\" and manumitted him.",
                "hadithUrdu": "جب میں اپنے وطن سے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہونے کے لیے چلا تو راستے میں، میں نے یہ شعر پڑھا ( ترجمہ ) ”کیسی ہے تکلیف کی لمبی یہ رات، خیر اس نے کفر سے دی ہے نجات“ اور میرا غلام راستے میں بھاگ گیا تھا، پھر میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ سے بیعت کی، ابھی آپ کے پاس میں بیٹھا ہی ہوا تھا کہ وہ غلام دکھائی دیا، آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: ابوہریرہ! یہ ہے تمہارا غلام! میں نے کہا اللہ کے لیے میں نے اس کو اب آزاد کر دیا۔",
                "urduNarrator": "مجھ سے محمد بن علاء نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، کہا ہم سے اسماعیل بن ابی خالد نے بیان کیا، ان سے قیس نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لَمَّا قَدِمْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم قُلْتُ فِي الطَّرِيقِ: يَا لَيْلَةً مِنْ طُولِهَا وَعَنَائِهَا     عَلَى أَنَّهَا مِنْ دَارَةِ الْكُفْرِ نَجَّتِ وَأَبَقَ غُلاَمٌ لِي فِي الطَّرِيقِ، فَلَمَّا قَدِمْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَبَايَعْتُهُ، فَبَيْنَا أَنَا عِنْدَهُ إِذْ طَلَعَ الْغُلاَمُ، فَقَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَا أَبَا هُرَيْرَةَ هَذَا غُلاَمُكَ ‏\"‏‏.‏ فَقُلْتُ هُوَ لِوَجْهِ اللَّهِ تَعَالَى‏.‏ فَأَعْتَقْتُهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4186,
                "hadithNumber": "4394",
                "englishNarrator": "Narrated `Adi bin Hatim رضی اللہ عنہ :",
                "hadithEnglish": "We came to `Umar رضی اللہ عنہ in a delegation (during his rule). He started calling the men one by one, calling each by his name. (As he did not call me early) I said to him. \"Don't you know me, O chief of the Believers?\" He said, \"Yes, you embraced Islam when they (i.e. your people) disbelieved; you have come (to the Truth) when they ran away; you fulfilled your promises when they broke theirs; and you recognized it (i.e. the Truth of Islam) when they denied it.\" On that, `Adi رضی اللہ عنہ said, \"I therefore don't care.\"",
                "hadithUrdu": "ہم عمر رضی اللہ عنہ کی خدمت میں ( ان کی دور خلافت میں ) ایک وفد کی شکل میں آئے۔ وہ ایک ایک شخص کو نام لے لے کر بلاتے جاتے تھے ) میں نے ان سے کہا کیا آپ مجھے پہچانتے نہیں؟ اے امیرالمؤمنین! فرمایا کیا تمہیں بھی نہیں پہچانوں گا، تم اس وقت اسلام لائے جب یہ سب کفر پر قائم تھے۔ تم نے اس وقت توجہ کی جب یہ سب منہ موڑ رہے تھے۔ تم نے اس وقت وفا کی جب یہ سب بے وفائی کر رہے تھے اور اس وقت پہچانا جب ان سب نے انکار کیا تھا۔ عدی رضی اللہ عنہ نے کہا بس اب مجھے کوئی پرواہ نہیں۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے ابوعوانہ نے بیان کیا، کہا ہم سے عبدالملک بن عمیر نے بیان کیا، ان سے عمرو بن حریث نے اور ان سے عدی بن حاتم رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ عَمْرِو بْنِ حُرَيْثٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ أَتَيْنَا عُمَرَ فِي وَفْدٍ، فَجَعَلَ يَدْعُو رَجُلاً رَجُلاً وَيُسَمِّيهِمْ فَقُلْتُ أَمَا تَعْرِفُنِي يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ بَلَى، أَسْلَمْتَ إِذْ كَفَرُوا، وَأَقْبَلْتَ إِذْ أَدْبَرُوا، وَوَفَيْتَ إِذْ غَدَرُوا، وَعَرَفْتَ إِذْ أَنْكَرُوا‏.‏ فَقَالَ عَدِيٌّ فَلاَ أُبَالِي إِذًا‏.‏",
                "headingArabic": "قِصَّةِ وَفْدِ طَيِّئٍ وَحَدِيثِ عَدِيِّ بْنِ حَاتِمٍ",
                "headingUrdu": "طائی کا وفد",
                "headingEnglish": "The delegation of Taiy’",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4187,
                "hadithNumber": "4395",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "We went out with Allah's Messenger (ﷺ) during Hajjat-ul-Wada` and we assumed the Ihram for `Umra. Then Allah's Messenger (ﷺ) said to us, \"Whoever has got the Hadi should assume the Ihram for Hajj and `Umra and should not finish his Ihram till he has performed both (`Umra and Hajj).\" I arrived at Mecca along with him (i.e. the Prophet (ﷺ) ) while I was menstruating, so I did not perform the Tawaf around the Ka`ba or between Safa and Marwa. I informed Allah's Messenger (ﷺ) about that and he said, \"Undo your braids and comb your hair, and then assume the lhram for Hajj and leave the `Umra.\" I did so, and when we performed and finished the Hajj, Allah's Messenger (ﷺ)s sent me to at-Tan`im along with (my brother) `Abdur-Rahman bin Abu Bakr As-Siddiq رضی اللہ عنہ , to perform the `Umra. The Prophet (ﷺ) said, \"This `Umra is in lieu of your missed `Umra.\" Those who had assumed the lhram for `Umra, performed the Tawaf around the Ka`ba and between Safa and Marwa, and then finished their Ihram, and on their return from Mina, they performed another Tawaf (around the Ka`ba and between Safa and Marwa), but those who combined their Hajj and `Umra, performed only one Tawaf (between Safa and Marwa) (for both).",
                "hadithUrdu": "حجۃ الوداع کے موقع پر ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ روانہ ہوئے۔ ہم نے عمرہ کا احرام باندھا تھا پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس کے ساتھ ہدی ہو وہ عمرہ کے ساتھ حج کا بھی احرام باندھ لے اور جب تک دونوں کے ارکان نہ ادا کر لے احرام نہ کھولے۔ پھر میں آپ صلی اللہ علیہ وسلم کے ساتھ جب مکہ آئی تو مجھ کو حیض آ گیا۔ اس لیے نہ بیت اللہ کا طواف کر سکی اور نہ صفا اور مروہ کی سعی کر سکی۔ میں نے اس کی شکایت آپ صلی اللہ علیہ وسلم سے کی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ سر کھول لے اور کنگھا کر لے۔ اس کے بعد حج کا احرام باندھ لو اور عمرہ چھوڑ دو۔ میں نے ایسا ہی کیا۔ پھر جب ہم حج ادا کر چکے تو نبی کریم صلی اللہ علیہ وسلم نے مجھے ( میرے بھائی ) عبدالرحمٰن بن ابی بکر رضی اللہ عنہما کے ساتھ تنعیم سے ( عمرہ کی ) نیت کرنے کے لیے بھیجا اور میں نے عمرہ کیا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہ تمہارے اس چھوٹے ہوئے عمرہ کی قضاء ہے۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ جن لوگوں نے صرف عمرہ کا احرام باندھا تھا۔ انہوں نے بیت اللہ کے طواف اور صفا اور مروہ کی سعی کے بعد احرام کھول دیا۔ پھر منیٰ سے واپسی کے بعد انہوں نے دوسرا طواف ( حج کا ) کیا، لیکن جن لوگوں نے حج اور عمرہ دونوں کا احرام ایک ساتھ باندھا تھا، انہوں نے ایک ہی طواف کیا۔",
                "urduNarrator": "ہم سے اسماعیل بن عبداللہ نے بیان کیا، کہا ہم سے امام مالک نے بیان کیا، ان سے ابن شہاب نے، ان سے عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ، فَأَهْلَلْنَا بِعُمْرَةٍ، ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ كَانَ مَعَهُ هَدْىٌ فَلْيُهْلِلْ بِالْحَجِّ مَعَ الْعُمْرَةِ، ثُمَّ لاَ يَحِلَّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا ‏\"‏‏.‏ فَقَدِمْتُ مَعَهُ مَكَّةَ وَأَنَا حَائِضٌ، وَلَمْ أَطُفْ بِالْبَيْتِ وَلاَ بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَشَكَوْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ انْقُضِي رَأْسَكِ، وَامْتَشِطِي وَأَهِلِّي بِالْحَجِّ وَدَعِي الْعُمْرَةَ ‏\"‏‏.‏ فَفَعَلْتُ فَلَمَّا قَضَيْنَا الْحَجَّ أَرْسَلَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ إِلَى التَّنْعِيمِ فَاعْتَمَرْتُ فَقَالَ ‏\"‏ هَذِهِ مَكَانَ عُمْرَتِكِ ‏\"‏‏.‏ قَالَتْ فَطَافَ الَّذِينَ أَهَلُّوا بِالْعُمْرَةِ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ، ثُمَّ حَلُّوا، ثُمَّ طَافُوا طَوَافًا آخَرَ بَعْدَ أَنْ رَجَعُوا مِنْ مِنًى، وَأَمَّا الَّذِينَ جَمَعُوا الْحَجَّ وَالْعُمْرَةَ فَإِنَّمَا طَافُوا طَوَافًا وَاحِدًا‏.‏",
                "headingArabic": "حَجَّةُ الْوَدَاعِ",
                "headingUrdu": "حجۃ الوداع",
                "headingEnglish": "Hajjat-ul-Wada",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4188,
                "hadithNumber": "4396",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "'If he (i.e. the one intending to perform `Umra) has performed the Tawaf around the Ka`ba, his Ihram is considered to have finished.' said, 'What proof does Ibn `Abbas رضی اللہ عنہما has as to this saying?\" `Ata' said, \"(The proof is taken) from the Statement of Allah:-- \"And afterwards they are brought For sacrifice unto Ancient House (Ka`ba at Mecca)\" (22.33) and from the order of the Prophet to his companions to finish their Ihram during Hajjat-ul-Wada`.\" I said (to `Ata'), \"That (i.e. finishing the Ihram) was after coming form `Arafat.\" `Ata' said, \"Ibn `Abbas رضی اللہ عنہما used to allow it before going to `Arafat (after finishing the `Umra) and after coming from it (i.e. after performing the Hajj).",
                "hadithUrdu": "( عمرہ کرنے والا ) صرف بیت اللہ کے طواف سے حلال ہو سکتا ہے۔ ( ابن جریج نے کہا ) میں نے عطاء سے پوچھا کہ ابن عباس رضی اللہ عنہما نے یہ مسئلہ کہاں سے نکالا؟ انہوں نے بتایا کہ اللہ تعالیٰ کے ارشاد «ثم محلها إلى البيت العتيق‏» ( سورۃ الحج ) سے اور نبی کریم صلی اللہ علیہ وسلم کے اس حکم کی وجہ سے جو آپ نے اپنے اصحاب کو حجۃ الوداع میں احرام کھول دینے کے لیے دیا تھا میں نے کہا کہ یہ حکم تو عرفات میں ٹھہرنے کے بعد کے لیے ہے۔ انہوں نے کہا لیکن ابن عباس رضی اللہ عنہما کا یہ مذہب تھا کہ عرفات میں ٹھہرنے سے پہلے اور بعد ہر حال میں جب طواف کر لے تو احرام کھول ڈالنا درست ہے۔",
                "urduNarrator": "مجھ سے عمرو بن علی فلاس نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، کہا مجھ سے عطاء بن ابی رباح نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ حَدَّثَنِي عَطَاءٌ، عَنِ ابْنِ عَبَّاسٍ، إِذَا طَافَ بِالْبَيْتِ فَقَدْ حَلَّ‏.‏ فَقُلْتُ مِنْ أَيْنَ قَالَ هَذَا ابْنُ عَبَّاسٍ قَالَ مِنْ قَوْلِ اللَّهِ تَعَالَى ‏{‏ثُمَّ مَحِلُّهَا إِلَى الْبَيْتِ الْعَتِيقِ‏}‏ وَمِنْ أَمْرِ النَّبِيِّ صلى الله عليه وسلم أَصْحَابَهُ أَنْ يَحِلُّوا فِي حَجَّةِ الْوَدَاعِ‏.‏ قُلْتُ إِنَّمَا كَانَ ذَلِكَ بَعْدَ الْمُعَرَّفِ‏.‏ قَالَ كَانَ ابْنُ عَبَّاسٍ يَرَاهُ قَبْلُ وَبَعْدُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4189,
                "hadithNumber": "4397",
                "englishNarrator": "Narrated Abu Musa Al-Ash`ari رضی اللہ عنہ :",
                "hadithEnglish": "I came to the Prophet (ﷺ) at a place called Al-Batha'. The Prophet (ﷺ) said, \"Did you assume the Ihram for Hajj?\" I said, \"Yes,\" He said, \"How did you express your intention (for performing Hajj)? \" I said, \"Labbaik (i.e. I am ready) to assume the Ihram with the same intention as that of Allah's Messenger (ﷺ).\" The Prophet said, \"Perform the Tawaf around the Ka`ba and between Safa and Marwa, and then finish your Ihram.\" So I performed the Tawaf around the Ka`ba and between Safa and Marwa and then I came to a woman from the tribe of Qais who removed the lice from my head.",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا۔ اس وقت آپ صلی اللہ علیہ وسلم وادی بطحاء ( سنگریزی زمین ) میں قیام کئے ہوئے تھے۔ آپ نے پوچھا تم نے حج کا احرام باندھ لیا؟ میں نے عرض کیا کہ جی ہاں۔ دریافت فرمایا، احرام کس طرح باندھا ہے؟ عرض کیا ( اس طرح ) کہ میں بھی اسی طرح احرام باندھتا ہوں جس طرح نبی کریم صلی اللہ علیہ وسلم نے باندھا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پہلے ( عمرہ کرنے کے لیے ) بیت اللہ کا طواف کر، پھر صفا اور مروہ کی سعی کر، پھر حلال ہو جا۔ چنانچہ میں بیت اللہ کا طواف اور صفا اور مروہ کی سعی کر کے قبیلہ قیس کی ایک عورت کے گھر آیا اور انہوں نے میرے سر سے جوئیں نکالیں۔",
                "urduNarrator": "مجھ سے بیان بن عمرو نے بیان کیا، کہا ہم سے نضر بن شمیل نے بیان کیا، انہیں شعبہ نے خبر دی، ان سے قیس بن مسلم نے بیان کیا، انہوں نے طارق بن شہاب سے سنا اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي بَيَانٌ، حَدَّثَنَا النَّضْرُ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَيْسٍ، قَالَ سَمِعْتُ طَارِقًا، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ قَدِمْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم بِالْبَطْحَاءِ فَقَالَ ‏\"‏ أَحَجَجْتَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ كَيْفَ أَهْلَلْتَ ‏\"‏‏.‏ قُلْتُ لَبَّيْكَ بِإِهْلاَلٍ كَإِهْلاَلِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ ‏\"‏ طُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ حِلَّ ‏\"‏‏.‏ فَطُفْتُ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ، وَأَتَيْتُ امْرَأَةً مِنْ قَيْسٍ فَفَلَتْ رَأْسِي‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4190,
                "hadithNumber": "4398",
                "englishNarrator": "Narrated Abdullah bin Umar رضی اللہ عنہما :",
                "hadithEnglish": "Hafsa رضی اللہ عنہا (the wife of the Prophet) The Prophet (ﷺ) ordered all his wives to finish their Ihram during the year of Hajjat-ul-Wada`. On that, I asked the Prophet (ﷺ) \"What stops you from finishing your lhram?\" He said, \"I have matted my hair and garlanded my Hadi. So I will not finish my Ihram unless I have slaughtered my Hadi.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حفصہ رضی اللہ عنہا نے انہیں خبر دی کہ نبی کریم صلی اللہ علیہ وسلم نے حجۃ الوداع کے موقع پر اپنی بیویوں کو حکم دیا کہ ( عمرہ کرنے کے بعد ) حلال ہو جائیں ( یعنی احرام کھول دیں ) حفصہ رضی اللہ عنہا نے عرض کیا ( یا رسول اللہ! ) پھر آپ کیوں نہیں حلال ہوتے؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے تو اپنے بالوں کو جما لیا ہے اور اپنی قربانی کو ہار پہنا دیا ہے، اس لیے میں جب تک قربانی نہ کر لوں اس وقت تک احرام نہیں کھول سکتا۔",
                "urduNarrator": "مجھ سے ابراہیم بن المنذر نے بیان کیا، کہا ہم کو انس بن عیاض نے خبر دی، کہا ہم سے موسیٰ بن عقبہ نے بیان کیا، ان سے نافع نے انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، أَخْبَرَنَا أَنَسُ بْنُ عِيَاضٍ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، أَخْبَرَهُ أَنَّ حَفْصَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ أَزْوَاجَهُ أَنْ يَحْلِلْنَ عَامَ حَجَّةِ الْوَدَاعِ، فَقَالَتْ حَفْصَةُ فَمَا يَمْنَعُكَ فَقَالَ ‏ \"‏ لَبَّدْتُ رَأْسِي وَقَلَّدْتُ هَدْيِي، فَلَسْتُ أَحِلُّ حَتَّى أَنْحَرَ هَدْيِي ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4191,
                "hadithNumber": "4399",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "A woman from the tribe of Khath'am asked for the verdict of Allah's Messenger (ﷺ) (regarding something) during Hajjat-ul-Wada` while Al-Fadl bin `Abbas رضی اللہ عنہما was the companion-rider behind Allah's Messenger (ﷺ). She asked, \"Allah's ordained obligation (i.e. compulsory Hajj) enjoined on His slaves has become due on my old father who cannot sit firmly on the riding animal. Will it be sufficient if I perform the Hajj on his behalf?\" He said, \"Yes.\"",
                "hadithUrdu": "قبیلہ خثعم کی ایک عورت نے حجۃ الوداع کے موقع پر رسول اللہ صلی اللہ علیہ وسلم سے ایک مسئلہ پوچھا، فضل بن عباس رضی اللہ عنہما نبی کریم صلی اللہ علیہ وسلم ہی کی سواری پر آپ کے پیچھے بیٹھے ہوئے تھے۔ انہوں نے پوچھا کہ یا رسول اللہ! اللہ کا جو فریضہ اس کے بندوں پر ہے ( یعنی حج ) میرے والد پر بھی فرض ہو چکا ہے لیکن بڑھاپے کی وجہ سے ان کی حالت یہ ہے کہ وہ سواری پر نہیں بیٹھ سکتے۔ تو کیا میں ان کی طرف سے حج ادا کر سکتی ہوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں! کر سکتی ہو۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا، کہا کہ مجھ سے شعیب نے بیان کیا، ان سے زہری نے، (دوسری سند) (اور امام بخاری رحمہ اللہ علیہ نے کہا) اور مجھ سے محمد بن یوسف فریابی نے بیان کیا، کہا ہم سے امام اوزاعی نے بیان کیا، کہا کہ مجھے ابن شہاب نے خبر دی، انہیں سلیمان بن یسار نے اور انہیں ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ حَدَّثَنِي شُعَيْبٌ، عَنِ الزُّهْرِيِّ، وَقَالَ، مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ امْرَأَةً، مِنْ خَثْعَمَ اسْتَفْتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ وَالْفَضْلُ بْنُ عَبَّاسٍ رَدِيفُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ فَرِيضَةَ اللَّهِ عَلَى عِبَادِهِ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا لاَ يَسْتَطِيعُ أَنْ يَسْتَوِيَ عَلَى الرَّاحِلَةِ، فَهَلْ يَقْضِي أَنْ أَحُجَّ عَنْهُ قَالَ ‏ \"‏ نَعَمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4192,
                "hadithNumber": "4400",
                "englishNarrator": "Narrated (Abdullah) bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) arrived (at Mecca) in the year of the Conquest (of Mecca) while Usama رضی اللہ عنہ was riding behind him on (his she-camel)'. Al-Qaswa.' Bilal and `Uthman bin Talha رضی اللہ عنہما were accompanying him. When he made his she-camel kneel down near the Ka`ba, he said to `Uthman رضی اللہ عنہ, \"Get us the key (of the Ka`ba). He brought the key to him and opened the gate (of the Ka`ba), for him. The Prophet, Usama, Bilal and `Uthman رضی اللہ عنہ (bin Talha) entered the Ka`ba and then closed the gate behind them (from inside). The Prophet (ﷺ) stayed there for a long period and then came out. The people rushed to get in, but I went in before them and found Bilal رضی اللہ عنہ standing behind the gate, and I said to him, \"Where did the Prophet (ﷺ) pray?\" He said, \"He prayed between those two front pillars.\" The Ka`ba was built on six pillars, arranged in two rows, and he prayed between the two pillars of the front row leaving the gate of the Ka`ba at his back and facing (in prayer) the wall which faces one when one enters the Ka`ba. Between him and that wall (was the distance of about three cubits). But I forgot to ask Bilal رضی اللہ عنہ about the number of rak`at the Prophet (ﷺ) had prayed. There was a red piece of marble at the place where he (i.e. the Prophet) had offered the prayer.",
                "hadithUrdu": "فتح مکہ کے دن نبی کریم صلی اللہ علیہ وسلم تشریف لائے، آپ صلی اللہ علیہ وسلم کی قصواء اونٹنی پر پیچھے اسامہ رضی اللہ عنہ بیٹھے ہوئے تھے اور آپ کے ساتھ بلال اور عثمان بن طلحہ رضی اللہ عنہما بھی تھے آپ نے کعبہ کے پاس اپنی اونٹنی بٹھا دی اور عثمان رضی اللہ عنہ سے فرمایا کہ کعبہ کی کنجی لاؤ، وہ کنجی لائے اور دروازہ کھولا۔ آپ اندر داخل ہوئے تو آپ صلی اللہ علیہ وسلم کے ساتھ اسامہ، بلال اور عثمان رضی اللہ عنہم بھی اندر گئے، پھر دروازہ اندر سے بند کر لیا اور دیر تک اندر ( نماز اور دعاؤں میں مشغول ) رہے۔ جب آپ صلی اللہ علیہ وسلم باہر تشریف لائے تو لوگ اندر جانے کے لیے ایک دوسرے سے آگے بڑھنے لگے اور میں سب سے آگے بڑھ گیا۔ میں نے دیکھا کہ بلال رضی اللہ عنہ دروازے کے پیچھے کھڑے ہوئے ہیں۔ میں نے ان سے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم نے نماز کہاں پڑھی تھی؟ انہوں نے بتایا کہ خانہ کعبہ میں چھ ستون تھے۔ دو قطاروں میں اور آپ صلی اللہ علیہ وسلم نے آگے کی قطار کے دو ستونوں کے درمیان نماز پڑھی تھی۔ کعبہ کا دروازہ آپ صلی اللہ علیہ وسلم کی پیٹھ کی طرف تھا اور چہرہ مبارک اس طرف تھا، جدھر دروازے سے اندر جاتے ہوئے چہرہ کرنا پڑتا ہے۔ آپ کے اور دیوار کے درمیان ( تین ہاتھ کا فاصلہ تھا ) ۔ ابن عمر رضی اللہ عنہما نے بیان کیا کہ یہ پوچھنا میں بھول گیا کہ نبی کریم صلی اللہ علیہ وسلم نے کتنی رکعت نماز پڑھی تھی۔ جس جگہ آپ نے نماز پڑھی تھی وہاں سرخ سنگ مرمر بچھا ہوا تھا۔",
                "urduNarrator": "مجھ سے محمد بن رافع نے بیان کیا، کہا ہم سے سریج بن نعمان نے بیان کیا، ان سے فلیح بن سلیمان نے بیان کیا ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدٌ، حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ، حَدَّثَنَا فُلَيْحٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَقْبَلَ النَّبِيُّ صلى الله عليه وسلم عَامَ الْفَتْحِ وَهْوَ مُرْدِفٌ أُسَامَةَ عَلَى الْقَصْوَاءِ‏.‏ وَمَعَهُ بِلاَلٌ وَعُثْمَانُ بْنُ طَلْحَةَ حَتَّى أَنَاخَ عِنْدَ الْبَيْتِ، ثُمَّ قَالَ لِعُثْمَانَ ‏ \"‏ ائْتِنَا بِالْمِفْتَاحِ ‏\"‏، فَجَاءَهُ بِالْمِفْتَاحِ فَفَتَحَ لَهُ الْبَابَ، فَدَخَلَ النَّبِيُّ صلى الله عليه وسلم وَأُسَامَةُ وَبِلاَلٌ وَعُثْمَانُ، ثُمَّ أَغْلَقُوا عَلَيْهِمِ الْبَابَ، فَمَكَثَ نَهَارًا طَوِيلاً ثُمَّ خَرَجَ، وَابْتَدَرَ النَّاسُ الدُّخُولَ، فَسَبَقْتُهُمْ فَوَجَدْتُ بِلاَلاً قَائِمًا مِنْ وَرَاءِ الْبَابِ فَقُلْتُ لَهُ أَيْنَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ صَلَّى بَيْنَ ذَيْنِكَ الْعَمُودَيْنِ الْمُقَدَّمَيْنِ‏.‏ وَكَانَ الْبَيْتُ عَلَى سِتَّةِ أَعْمِدَةٍ سَطْرَيْنِ، صَلَّى بَيْنَ الْعَمُودَيْنِ مِنَ السَّطْرِ الْمُقَدَّمِ، وَجَعَلَ باب الْبَيْتِ خَلْفَ ظَهْرِهِ، وَاسْتَقْبَلَ بِوَجْهِهِ الَّذِي يَسْتَقْبِلُكَ حِينَ تَلِجُ الْبَيْتَ بَيْنَهُ وَبَيْنَ الْجِدَارِ، قَالَ وَنَسِيتُ أَنْ أَسْأَلَهُ كَمْ صَلَّى وَعِنْدَ الْمَكَانِ الَّذِي صَلَّى فِيهِ مَرْمَرَةٌ حَمْرَاءُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4193,
                "hadithNumber": "4401",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا (the wife of the prophet):",
                "hadithEnglish": "Safiya bin Huyai رضی اللہ عنہا , the wife of the Prophet (ﷺ) menstruated during Hajjat-ul- Wada` The Prophet (ﷺ) said, \"Is she going to detain us?\" I said to him, \"She has already come to Mecca and performed the Tawaf (ul-ifada) around the Ka`ba, O Allah's Messenger (ﷺ).\" The Prophet (ﷺ) said, \" Let her then proceed on (to Medina).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی زوجہ صفیہ رضی اللہ عنہا حجۃ الوداع کے موقع پر حائضہ ہو گئی تھیں۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کیا ابھی ہمیں ان کی وجہ سے رکنا پڑے گا؟ میں نے عرض کیا: یا رسول اللہ! یہ تو مکہ لوٹ کر طواف زیارت کر چکی ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر اسے چلنا چاہئیے ( طواف وداع کی ضرورت نہیں ) ۔",
                "urduNarrator": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا کہ ہم کو شعیب نے خبر دی، انہیں زہری نے، کہا مجھ سے عروہ بن زبیر اور ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُمَا أَنَّ صَفِيَّةَ بِنْتَ حُيَىٍّ زَوْجَ النَّبِيِّ صلى الله عليه وسلم حَاضَتْ فِي حَجَّةِ الْوَدَاعِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَحَابِسَتُنَا هِيَ ‏\"‏‏.‏ فَقُلْتُ إِنَّهَا قَدْ أَفَاضَتْ يَا رَسُولَ اللَّهِ وَطَافَتْ بِالْبَيْتِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَلْتَنْفِرْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4194,
                "hadithNumber": "4402, 4403",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "We were talking about Hajjat-ul-Wada`, while the Prophet (ﷺ) was amongst us. We did not know what Hajjat-ul-Wada` signified. The Prophet (ﷺ) praised Allah and then mentioned Al-Masih Ad-Dajjal and described him extensively, saying, \"Allah did not send any prophet but that prophet warned his nation of Al-Masih Ad-Dajjal. Noah and the prophets following him warned (their people) of him. He will appear amongst you (O Muhammad's followers), and if it happens that some of his qualities may be hidden from you, but your Lord's State is clear to you and not hidden from you. The Prophet (ﷺ) said it thrice. Verily, your Lord is not blind in one eye, while he (i.e. Ad-Dajjal) is blind in the right eye which looks like a grape bulging out (of its cluster).\"  No doubt,! Allah has made your blood and your properties sacred to one another like the sanctity of this day of yours, in this town of yours, in this month of yours.\" The Prophet (ﷺ) added: No doubt! Haven't I conveyed Allah's Message to you? \" They replied, \"Yes,\" The Prophet (ﷺ) said thrice, \"O Allah! Be witness for it.\" The Prophet (ﷺ) added, \"Woe to you!\" (or said), \"May Allah be merciful to you! Do not become infidels after me (i.e. my death) by cutting the necks (throats) of one another.\"",
                "hadithUrdu": "ہم ( حجۃ الوداع ) کہا کرتے تھے، جبکہ نبی کریم صلی اللہ علیہ وسلم موجود تھے اور ہم نہیں سمجھتے تھے کہ حجۃ الوداع کا مفہوم کیا ہے۔ پھر نبی کریم صلی اللہ علیہ وسلم نے اللہ کی حمد اور اس کی ثنا بیان کی پھر مسیح دجال کا ذکر تفصیل کے ساتھ کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جتنے بھی انبیاء اللہ نے بھیجے ہیں، سب نے دجال سے اپنی امت کو ڈرایا ہے۔ نوح علیہ السلام نے اپنی امت کو اس سے ڈرایا اور دوسرے بعد میں آنے والے انبیاء نے بھی اور وہ تم ہی میں سے نکلے گا۔ پس یاد رکھنا کہ تم کو اس کے جھوٹے ہونے کی اور کوئی دلیل نہ معلوم ہو تو یہی دلیل کافی ہے کہ وہ مردود کانا ہو گا اور تمہارا رب کانا نہیں ہے اس کی آنکھ ایسی معلوم ہو گی جیسے انگور کا دانہ!۔کوئی شک،! اللہ تعالیٰ نے تمہارے خون اور تمہارے مال کو ایک دوسرے پر اسی طرح حرمت والا بنا دیا ہے جیسا کہ تمہارے اس دن کی حرمت، تمہاری اس بستی میں، اس مہینے میں۔ آپ کو پیغام دیں؟\" انہوں نے جواب دیا، \"ہاں\" رسول اللہ صلی اللہ علیہ وسلم نے تین مرتبہ فرمایا: \"اے اللہ! اس پر گواہ رہ۔\" آپ صلی اللہ علیہ وسلم نے مزید فرمایا: تم پر افسوس! (یا فرمایا) اللہ تم پر رحم کرے، میرے بعد ایک دوسرے کی گردنیں (گلے) کاٹ کر کافر نہ بن جانا۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا، کہا کہ مجھے عبداللہ بن وہب نے خبر دی، کہا کہ مجھ سے عمر بن محمد نے بیان کیا، ان سے ان کے والد نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، أَنَّ أَبَاهُ، حَدَّثَهُ عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كُنَّا نَتَحَدَّثُ بِحَجَّةِ الْوَدَاعِ وَالنَّبِيُّ صلى الله عليه وسلم بَيْنَ أَظْهُرِنَا، وَلاَ نَدْرِي مَا حَجَّةُ الْوَدَاعِ، فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ ذَكَرَ الْمَسِيحَ الدَّجَّالَ فَأَطْنَبَ فِي ذِكْرِهِ وَقَالَ ‏\"‏ مَا بَعَثَ اللَّهُ مِنْ نَبِيٍّ إِلاَّ أَنْذَرَ أُمَّتَهُ، أَنْذَرَهُ نُوحٌ وَالنَّبِيُّونَ مِنْ بَعْدِهِ، وَإِنَّهُ يَخْرُجُ فِيكُمْ، فَمَا خَفِيَ عَلَيْكُمْ مِنْ شَأْنِهِ فَلَيْسَ يَخْفَى عَلَيْكُمْ أَنَّ رَبَّكُمْ لَيْسَ عَلَى مَا يَخْفَى عَلَيْكُمْ ثَلاَثًا، إِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ، وَإِنَّهُ أَعْوَرُ عَيْنِ الْيُمْنَى، كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ ‏\"‏‏.‏ ‏\"‏ أَلاَ إِنَّ اللَّهَ حَرَّمَ عَلَيْكُمْ دِمَاءَكُمْ وَأَمْوَالَكُمْ، كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا، أَلاَ هَلْ بَلَّغْتُ ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اشْهَدْ، ثَلاَثًا، وَيْلَكُمْ، أَوْ وَيْحَكُمُ، انْظُرُوا لاَ تَرْجِعُوا بَعْدِي كُفَّارًا، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4195,
                "hadithNumber": "4404",
                "englishNarrator": "Narrated Zaid bin Arqam رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) fought nineteen Ghazwas and performed only one Hajj after he migrated (to Medina), and did not perform another Hajj after it, and that was Hajj-ul-Wada`,' Abu 'Is-haq said, \"He performed when he was in Mecca.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے انیس غزوے کئے اور ہجرت کے بعد صرف ایک حج کیا۔ اس حج کے بعد پھر آپ صلی اللہ علیہ وسلم نے کوئی حج نہیں کیا۔ یہ حج، حجۃ الوداع تھا۔ ابواسحاق نے بیان کیا کہ دوسرا حج آپ صلی اللہ علیہ وسلم نے ( ہجرت سے پہلے ) مکہ میں کیا تھا۔",
                "urduNarrator": "ہم سے عمرو بن خالد نے بیان کیا، کہا ہم سے زہیر بن معاویہ نے بیان کیا، کہا ہم سے ابواسحاق سبیعی نے بیان کیا، کہا کہ مجھ سے زید بن ارقم رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ حَدَّثَنِي زَيْدُ بْنُ أَرْقَمَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم غَزَا تِسْعَ عَشْرَةَ غَزْوَةً، وَأَنَّهُ حَجَّ بَعْدَ مَا هَاجَرَ حَجَّةً وَاحِدَةً لَمْ يَحُجَّ بَعْدَهَا حَجَّةَ الْوَدَاعِ‏.‏ قَالَ أَبُو إِسْحَاقَ وَبِمَكَّةَ أُخْرَى‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4196,
                "hadithNumber": "4405",
                "englishNarrator": "Narrated Jarir رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) ordered me during Hajjatul-Wada`. \"Ask the people to listen.\" He then said, \"Do not become infidels after me by cutting the necks (throats) of one another. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے حجۃ الوداع کے موقع پر جریر رضی اللہ عنہ سے فرمایا تھا لوگوں کو خاموش کر دو، پھر فرمایا، میرے بعد کافر نہ بن جانا کہ ایک دوسرے کی گردن مارنے لگو۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا، انہوں نے کہا ہم سے شعبہ بن حجاج نے بیان کیا، ان سے علی بن مدرک نے بیان کیا، ان سے ابوزرعہ ہرم بن عمرو بن جریر نے بیان کیا اور ان سے جریر بن عبداللہ بجلی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ جَرِيرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ فِي حَجَّةِ الْوَدَاعِ لِجَرِيرٍ ‏\"‏ اسْتَنْصِتِ النَّاسَ ‏\"‏ فَقَالَ ‏\"‏ لاَ تَرْجِعُوا بَعْدِي كُفَّارًا، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4197,
                "hadithNumber": "4406",
                "englishNarrator": "Narrated Abu Bakra رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Time has taken its original shape which it had when Allah created the Heavens and the Earth. The year is of twelve months, four of which are sacred, and out of these (four) three are in succession, i.e. Dhul-Qa'da, Dhul-Hijja and Al-Muharram, and the fourth is Rajab which is named after the Mudar tribe, between (the month of) Jumaida (ath-thania) and Sha'ban.\" Then the Prophet (ﷺ) asked, \"Which is this month?\" We said, \"Allah and His Apostle know better.\" On that the Prophet (ﷺ) kept quiet so long that we thought that he might name it with another name. Then the Prophet (ﷺ) said, \"Isn't it the month of Dhul-Hijja?\" We replied, \"Yes.\" Then he said, \"Which town is this?\" \"We replied, \"Allah and His Apostle know better.\" On that he kept quiet so long that we thought that he might name it with another name. Then he said, \"Isn't it the town of Mecca?\" We replied, \"Yes, \" Then he said, \"Which day is today?\" We replied, \"Allah and His Apostle know better.\" He kept quiet so long that we thought that he might name it with another name. Then he said, \"Isn't it the day of An- Nahr (i.e. sacrifice)?\" We replied, \"Yes.\" He said, \"So your blood, your properties, (The sub-narrator Muhammad said, 'I think the Prophet (ﷺ) also said: And your honor..) are sacred to one another like the sanctity of this day of yours, in this city of yours, in this month of yours; and surely, you will meet your Lord, and He will ask you about your deeds. Beware! Do not become infidels after me, cutting the throats of one another. It is incumbent on those who are present to convey this message (of mine) to those who are absent. May be that some of those to whom it will be conveyed will understand it better than those who have actually heard it.\" (The sub-narrator, Muhammad, on remembering that narration, used to say, \"Muhammad spoke the truth!\") He (i.e. Prophet) then added twice, \"No doubt! Haven't I conveyed (Allah's Message) to you?\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ زمانہ اپنی اصل حالت پر گھوم کر آ گیا ہے۔ اس دن کی طرح جب اللہ نے زمین و آسمان کو پیدا کیا تھا۔ دیکھو! سال کے بارہ مہینے ہوتے ہیں۔ چار ان میں سے حرمت والے مہینے ہیں۔ تین لگاتار ہیں، ذی قعدہ، ذی الحجہ اور محرم ( اور چوتھا ) رجب مضر جو جمادی الاولیٰ اور شعبان کے بیچ میں پڑتا ہے۔ ( پھر آپ نے دریافت فرمایا ) یہ کون سا مہینہ ہے؟ ہم نے کہا کہ اللہ اور ان کے رسول کو بہتر علم ہے۔ اس پر آپ صلی اللہ علیہ وسلم خاموش ہو گئے۔ ہم نے سمجھا شاید آپ مشہور نام کے سوا اس کا کوئی اور نام رکھیں گے۔ لیکن آپ نے فرمایا: کیا یہ ذی الحجہ نہیں ہے؟ ہم بولے کہ کیوں نہیں۔ پھر دریافت فرمایا اور یہ شہر کون سا ہے؟ ہم بولے کہ اللہ اور اس کے رسول کو زیادہ بہتر علم ہے۔ پھر آپ صلی اللہ علیہ وسلم خاموش ہو گئے۔ ہم نے سمجھا شاید اس کا کوئی اور نام آپ صلی اللہ علیہ وسلم رکھیں گے، جو مشہور نام کے علاوہ ہو گا۔، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا: کیا یہ مکہ نہیں ہے؟ ہم بولے کیوں نہیں ( یہ مکہ ہی ہے ) پھر آپ صلی اللہ علیہ وسلم نے دریافت فرمایا اور یہ دن کون سا ہے؟ ہم بولے کہ اللہ اور اس کے رسول کو زیادہ بہتر علم ہے، پھر آپ صلی اللہ علیہ وسلم خاموش ہو گئے اور ہم نے سمجھا شاید اس کا آپ صلی اللہ علیہ وسلم اس کے مشہور نام کے سوا کوئی اور نام رکھیں گے، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا: کیا یہ یوم النحر ( قربانی کا دن ) نہیں ہے؟ ہم بولے کہ کیوں نہیں۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا: پس تمہارا خون اور تمہارا مال۔ محمد نے بیان کیا کہ میرا خیال ہے کہ ابوبکرہ رضی اللہ عنہ نے یہ بھی کہا، اور تمہاری عزت تم پر اسی طرح حرام ہے جس طرح یہ دن کا تمہارے اس شہر اور تمہارے اس مہینے میں اور تم بہت جلد اپنے رب سے ملو گے اور وہ تم سے تمہارے اعمال کے بارے میں سوال کرے گا۔ ہاں، پس میرے بعد تم گمراہ نہ ہو جانا کہ ایک دوسرے کی گردن مارنے لگو۔ ہاں اور جو یہاں موجود ہیں وہ ان لوگوں کو پہنچا دیں جو موجود نہیں ہیں، ہو سکتا ہے کہ جسے وہ پہنچائیں ان میں سے کوئی ایسا بھی ہو جو یہاں بعض سننے والوں سے زیادہ اس ( حدیث ) کو یاد رکھ سکتا ہو۔ محمد بن سیرین جب اس حدیث کا ذکر کرتے تو فرماتے کہ محمد صلی اللہ علیہ وسلم نے سچ فرمایا۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ تو کیا میں نے پہنچا دیا۔ آپ صلی اللہ علیہ وسلم نے دو مرتبہ یہ جملہ فرمایا۔",
                "urduNarrator": "مجھ سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے عبدالوہاب ثقفی نے بیان کیا، کہا ہم سے ایوب سختیانی نے بیان کیا، ان سے محمد بن سیرین نے، ان سے عبدالرحمٰن بن ابی بکرہ رضی اللہ عنہما نے اور ان سے ابوبکرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنِ ابْنِ أَبِي بَكْرَةَ، عَنْ أَبِي بَكْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الزَّمَانُ قَدِ اسْتَدَارَ كَهَيْئَةِ يَوْمَ خَلَقَ السَّمَوَاتِ وَالأَرْضَ، السَّنَةُ اثْنَا عَشَرَ شَهْرًا مِنْهَا أَرْبَعَةٌ حُرُمٌ ثَلاَثَةٌ مُتَوَالِيَاتٌ ذُو الْقَعْدَةِ وَذُو الْحِجَّةِ وَالْمُحَرَّمُ، وَرَجَبُ مُضَرَ الَّذِي بَيْنَ جُمَادَى وَشَعْبَانَ، أَىُّ شَهْرٍ هَذَا ‏\"‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَ ذُو الْحِجَّةِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَأَىُّ بَلَدٍ هَذَا ‏\"‏‏.‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ، فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَ الْبَلْدَةَ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَأَىُّ يَوْمٍ هَذَا ‏\"‏ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ، فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَ يَوْمَ النَّحْرِ ‏\"‏‏.‏ قُلْنَا بَلَى‏.‏ قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ ـ قَالَ مُحَمَّدٌ وَأَحْسِبُهُ قَالَ وَأَعْرَاضَكُمْ ـ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا وَسَتَلْقَوْنَ رَبَّكُمْ، فَسَيَسْأَلُكُمْ عَنْ أَعْمَالِكُمْ، أَلاَ فَلاَ تَرْجِعُوا بَعْدِي ضُلاَّلاً، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ، أَلاَ لِيُبَلِّغِ الشَّاهِدُ الْغَائِبَ، فَلَعَلَّ بَعْضَ مَنْ يُبَلَّغُهُ أَنْ يَكُونَ أَوْعَى لَهُ مِنْ بَعْضِ مَنْ سَمِعَهُ ـ فَكَانَ مُحَمَّدٌ إِذَا ذَكَرَهُ يَقُولُ صَدَقَ مُحَمَّدٌ صلى الله عليه وسلم ثُمَّ قَالَ ـ أَلاَ هَلْ بَلَّغْتُ‏.‏ مَرَّتَيْنِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4198,
                "hadithNumber": "4407",
                "englishNarrator": "Narrated Tariq bin Shibab:",
                "hadithEnglish": "Some Jews said, \"Had this Verse been revealed to us, we would have taken that day as `Id (festival).\" `Umar رضی اللہ عنہ said, \"What Verse?\" They said:-- \"This day I have Perfected your religion for you, Completed My Favor upon you And have chosen for you Islam as your religion\" (5.3) `Umar رضی اللہ عنہ said, \"I know the place where it was revealed; It was revealed while Allah's Messenger (ﷺ) was staying at `Arafat.\"",
                "hadithUrdu": "چند یہودیوں نے کہا کہ اگر یہ آیت ہمارے یہاں نازل ہوئی ہوتی تو ہم اس دن عید منایا کرتے۔ عمر رضی اللہ عنہ نے فرمایا، کون سی آیت؟ انہوں نے کہا «اليوم أكملت لكم دينكم وأتممت عليكم نعمتي‏» ”آج میں نے تم پر اپنے دین کو مکمل کیا اور اپنی نعمت تم پر پوری کر دی۔“ اس پر عمر رضی اللہ عنہ نے فرمایا کہ مجھے خوب معلوم ہے کہ یہ آیت کہاں نازل ہوئی تھی۔ جب یہ آیت نازل ہوئی تو رسول صلی اللہ علیہ وسلم میدان عرفات میں کھڑے ہوئے تھے ( یعنی حجۃ الوداع میں ) ۔",
                "urduNarrator": "ہم سے محمد بن یوسف فریابی نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے قیس بن مسلم نے، ان سے طارق بن شہاب نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، أَنَّ أُنَاسًا، مِنَ الْيَهُودِ قَالُوا لَوْ نَزَلَتْ هَذِهِ الآيَةُ فِينَا لاَتَّخَذْنَا ذَلِكَ الْيَوْمَ عِيدًا‏.‏ فَقَالَ عُمَرُ أَيَّةُ آيَةٍ فَقَالُوا ‏{‏الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي‏}‏‏.‏ فَقَالَ عُمَرُ إِنِّي لأَعْلَمُ أَىَّ مَكَانٍ أُنْزِلَتْ، أُنْزِلَتْ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَاقِفٌ بِعَرَفَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4199,
                "hadithNumber": "4408",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "We set out with Allah's Messenger (ﷺ), and some of us assumed the lhram for `Umra, some assumed it for Hajj, and some assumed it for both Hajj and `Umra. Allah's Messenger (ﷺ) assumed the Ihram for Hajj. So those who had assumed the Ihram for Hajj or for both Hajj and `Umra, did not finish their Ihram till the day of An-Nahr (i.e. slaughter of sacrifices). Malik also narrated as above, saying, \"(We set out) with Allah's Messenger (ﷺ) in Hajjat-ul-Wada`...)\" This hadith also reaches us through another chain.",
                "hadithUrdu": "ہم جب رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( حج کے لیے ) نکلے تو کچھ لوگ ہم میں سے عمرہ کا احرام باندھے ہوئے تھے، کچھ حج کا اور کچھ عمرہ اور حج دونوں کا۔ نبی کریم صلی اللہ علیہ وسلم نے بھی حج کا احرام باندھا تھا۔ جو لوگ حج کا احرام باندھے ہوئے تھے یا جنہوں نے حج اور عمرہ دونوں کا احرام باندھا تھا، وہ قربانی کے دن حلال ہوئے تھے۔ ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، پھر یہی حدیث بیان کی۔ اس میں یوں ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حجۃ الوداع ( کے لیے ہم نکلے ) ہم سے اسماعیل بن ابی اویس نے بیان کیا، ہم سے امام مالک نے بیان کیا، اسی طرح جو پہلے مذکور ہوا۔ ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا ہم کو امام مالک نے خبر دی، پھر یہی حدیث بیان کی۔ اس میں یوں ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حجۃ الوداع ( کے لیے ہم نکلے ) ہم سے اسماعیل بن ابی اویس نے بیان کیا، ہم سے امام مالک نے بیان کیا، اسی طرح جو پہلے مذکور ہوا۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا، ان سے امام مالک نے بیان کیا، ان سے ابوالاسود محمد بن عبدالرحمٰن بن نوفل نے، ان سے عروہ بن زبیر رضی اللہ عنہ نے بیان کیا اور ان سے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي الأَسْوَدِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ، وَمِنَّا مَنْ أَهَلَّ بِحَجَّةٍ، وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ، وَأَهَلَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْحَجِّ، فَأَمَّا مَنْ أَهَلَّ بِالْحَجِّ أَوْ جَمَعَ الْحَجَّ وَالْعُمْرَةَ فَلَمْ يَحِلُّوا حَتَّى يَوْمَ النَّحْرِ‏.‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ أَخْبَرَنَا مَالِكٌ وَقَالَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ‏.‏ حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا مَالِكٌ مِثْلَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4200,
                "hadithNumber": "4409",
                "englishNarrator": "Narrated Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) visited me during Hajjat ul-Wada` while I was suffering from a disease which brought me to the verge of death. I said, \"O Allah's Messenger (ﷺ)! My ailment has reached such a (bad) state as you see, and I have much wealth, but I have no-one to inherit from me except my only daughter. Shall I give 2/3 of my property as alms (in charity)?\" The Prophet (ﷺ) said, \"No,\" I said, \"Shall I give half of my property as alms?\" He said, \"No.\" I said, \"(Shall I give) 1/3 of it? \" He replied, \" 1/3, and even 1/3 is too much. It is better for you to leave your inheritors wealthy rather than to leave them poor, begging people (for their sustenance); and whatever you spend for Allah's Sake, you will get reward for it even for the morsel of food which you put in your wives mouth.\" I said, \"O Allah's Messenger (ﷺ)! Should I remain (in Mecca) behind my companions (who are going with you to Medina)?\" The Prophet (ﷺ) said, \"If you remain behind, any good deed which you will do for Allah's Sake, will upgrade and elevate you. May be you will live longer so that some people may benefit by you and some other (i.e. infidels) may get harmed by you.\" The Prophet (ﷺ) then added, \"O Allah! Complete the Migration of my companions and do not turn them on their heels. But the poor Sa`d bin Khaula (not the above mentioned Sa`d) (died in Mecca) .\" Allah's Messenger (ﷺ) pitied Sa`d for he died in Mecca.",
                "hadithUrdu": "حجۃ الوداع کے موقع پر نبی کریم صلی اللہ علیہ وسلم میری عیادت کے لیے تشریف لائے۔ بیماری نے مجھے موت کے منہ میں لا ڈالا تھا۔ میں نے عرض کیا: یا رسول اللہ! جیسا کہ آپ نے ملاحظہ فرمایا ہے، میرا مرض اس حد کو پہنچ گیا ہے اور میرے پاس مال ہے، جس کی وارث خالی میری ایک لڑکی ہے، تو کیا میں اپنا دو تہائی مال خیرات کر دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں۔ میں نے عرض کیا، آدھا کر دوں۔ فرمایا کہ نہیں۔ میں نے فرمایا کیا پھر تہائی کر دوں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تہائی بھی بہت ہے۔ تم اپنے وارثوں کو مالدار چھوڑ کر جاؤ تو یہ اس سے بہتر ہے کہ انہیں محتاج چھوڑو اور وہ لوگوں کے سامنے ہاتھ پھیلاتے پھریں اور تم جو کچھ بھی خرچ کرو گے، اگر اس سے اللہ کی رضا مقصود رہی تو تمہیں اس پر ثواب ملے گا۔ حتیٰ کہ اس لقمہ پر بھی تمہیں ثواب ملے گا جو تم اپنی بیوی کے منہ میں رکھو گے۔ میں نے عرض کیا: یا رسول اللہ! ( بیماری کی وجہ سے ) کیا میں اپنے ساتھیوں کے ساتھ ( مدینہ ) نہیں جا سکوں گا؟ فرمایا اگر تم نہیں جا سکے تب بھی اگر تم اللہ کی رضا جوئی کے لیے کوئی عمل کرو گے تو تمہارا درجہ اللہ کے یہاں اور بلند ہو گا اور امید ہے کہ تم ابھی زندہ رہو گے اور تم سے کچھ لوگوں ( مسلمانوں ) کو نفع پہنچے گا اور کچھ لوگوں ( اسلام کے دشمنوں ) کو نقصان پہنچے گا۔ اے اللہ! میرے ساتھیوں کی ہجرت کو کامل فرما اور انہیں پیچھے نہ ہٹا لیکن نقصان میں تو سعد بن خولہ رہے۔ نبی کریم صلی اللہ علیہ وسلم نے ان کے مکہ میں وفات پا جانے کی وجہ سے ظاہر فرمایا۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، کہا ہم سے ابراہیم بن سعد نے بیان کیا، کہا ہم سے ابن شہاب نے، ان سے عامر بن سعد بن ابی وقاص رضی اللہ عنہ نے اور ان سے ان کے والد سعد رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ ـ هُوَ ابْنُ سَعْدٍ ـ حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ عَادَنِي النَّبِيُّ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ مِنْ وَجَعٍ، أَشْفَيْتُ مِنْهُ عَلَى الْمَوْتِ، فَقُلْتُ يَا رَسُولَ اللَّهِ بَلَغَ بِي مِنَ الْوَجَعِ مَا تَرَى، وَأَنَا ذُو مَالٍ وَلاَ يَرِثُنِي إِلاَّ ابْنَةٌ لِي وَاحِدَةٌ أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ أَفَأَتَصَدَّقُ بِشَطْرِهِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَالثُّلُثِ قَالَ ‏\"‏ وَالثُّلُثُ كَثِيرٌ، إِنَّكَ أَنْ تَذَرَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ، وَلَسْتَ تُنْفِقُ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلاَّ أُجِرْتَ بِهَا، حَتَّى اللُّقْمَةَ تَجْعَلُهَا فِي فِي امْرَأَتِكَ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ آأُخَلَّفُ بَعْدَ أَصْحَابِي قَالَ ‏\"‏ إِنَّكَ لَنْ تُخَلَّفَ فَتَعْمَلَ عَمَلاً تَبْتَغِي بِهِ وَجْهَ اللَّهِ إِلاَّ ازْدَدْتَ بِهِ دَرَجَةً وَرِفْعَةً، وَلَعَلَّكَ تُخَلَّفُ حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ وَيُضَرَّ بِكَ آخَرُونَ، اللَّهُمَّ أَمْضِ لأَصْحَابِي هِجْرَتَهُمْ، وَلاَ تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ‏.‏ لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ رَثَى لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُوُفِّيَ بِمَكَّةَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4201,
                "hadithNumber": "4410",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) got his head shaved during Hajjat-ul-Wada`.'",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے حجۃ الوداع میں اپنا سر منڈوایا تھا۔",
                "urduNarrator": "مجھ سے ابراہیم بن منذر خزامی نے بیان کیا، انہوں نے کہا ہم سے ابوضمرہ انس بن عیاض نے بیان کیا، انہوں نے کہا ہم سے موسیٰ بن عقبہ نے بیان کیا، ان سے نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَلَقَ رَأْسَهُ فِي حَجَّةِ الْوَدَاعِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4202,
                "hadithNumber": "4411",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "During Hajjat-ul-Wada`, the Prophet (ﷺ) and some of his companions got their heads shaved while some of his companions got their head-hair cut short.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم اور آپ صلی اللہ علیہ وسلم کے ساتھ آپ کے بعض اصحاب نے حجۃ الوداع کے موقع پر سر منڈوایا تھا اور بعض دوسرے صحابہ رضی اللہ عنہم نے صرف ترشوا لیا تھا۔",
                "urduNarrator": "ہم سے عبیداللہ بن سعید نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا، کہا ہم سے ابن جریج نے بیان کیا، ان سے موسیٰ بن عقبہ نے، انہیں نافع نے اور انہیں ابن عمر رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، أَخْبَرَهُ ابْنُ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم حَلَقَ فِي حَجَّةِ الْوَدَاعِ وَأُنَاسٌ مِنْ أَصْحَابِهِ وَقَصَّرَ بَعْضُهُمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4176,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=167",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=165",
                "label": "165",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=166",
                "label": "166",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=167",
                "label": "167",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=168",
                "label": "168",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=169",
                "label": "169",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=170",
                "label": "170",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=171",
                "label": "171",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=169",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=169",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=167",
        "to": 4200,
        "total": 40465
    }
}