{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 189,
        "data": [
            {
                "id": 4703,
                "hadithNumber": "4926",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "He heard Allah's Messenger (ﷺ) describing the period of pause of the Divine Inspiration, and in his description he said, \"While I was walking I heard a voice from the sky. I looked up towards the sky, and behold! I saw the same Angel who came to me in the Cave of Hira', sitting on a chair between the sky and the earth. I was so terrified by him that I fell down on the ground. Then I went to my wife and said, 'Wrap me in garments! Wrap me in garments!' They wrapped me, and then Allah revealed: \"O you, (Muhammad) wrapped-up! Arise and warn...and desert the idols.\" (74.1-5) Abu Salama said....Rujz means idols.\" After that, the Divine Inspiration started coming more frequently and regularly.",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، نبی کریم صلی اللہ علیہ وسلم درمیان میں وحی کے سلسلے کے رک جانے سے متعلق بیان فرما رہے تھے کہ میں چل رہا تھا کہ میں نے آسمان کی طرف سے آواز سنی۔ اپنی نظر آسمان کی طرف اٹھا کر دیکھا تو وہی فرشتہ نظر آیا جو میرے پاس غار حرا میں آیا تھا۔ وہ کرسی پر آسمان اور زمین کے درمیان میں بیٹھا ہوا تھا۔ میں نے اسے دیکھ کر اتنا ڈرا کہ زمین پر گر پڑا۔ پھر میں اپنی بیوی کے پاس آیا اور ان سے کہا کہ مجھے کپڑا اوڑھا دو، مجھے کپڑا اوڑھا دو! مجھے کپڑا اوڑھا دو۔ پھر اللہ تعالیٰ نے یہ آیت نازل کی «يا أيها المدثر‏» سے «والرجز فاهجر‏» تک ابوسلمہ نے بیان کیا کہ «الرجز» بت کے معنی میں ہے۔ پھر وحی گرم ہو گئی اور سلسلہ نہیں ٹوٹا۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے بیان کیا، ان سے ابن شہاب نے بیان کیا کہ میں نے ابوسلمہ سے سنا، انہوں نے بیان کیا کہ میں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا،",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، قَالَ ابْنُ شِهَابٍ سَمِعْتُ أَبَا سَلَمَةَ، قَالَ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يُحَدِّثُ عَنْ فَتْرَةِ الْوَحْىِ ‏\"‏ فَبَيْنَا أَنَا أَمْشِي سَمِعْتُ صَوْتًا مِنَ السَّمَاءِ فَرَفَعْتُ بَصَرِي قِبَلَ السَّمَاءِ، فَإِذَا الْمَلَكُ الَّذِي جَاءَنِي بِحِرَاءٍ قَاعِدٌ عَلَى كُرْسِيٍّ بَيْنَ السَّمَاءِ وَالأَرْضِ، فَجَئِثْتُ مِنْهُ حَتَّى هَوَيْتُ إِلَى الأَرْضِ، فَجِئْتُ أَهْلِي فَقُلْتُ زَمِّلُونِي زَمِّلُونِي‏.‏ فَزَمَّلُونِي فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ‏}‏ إِلَى قَوْلِهِ ‏{‏فَاهْجُرْ‏}‏ ‏\"‏ ـ قَالَ أَبُو سَلَمَةَ وَالرِّجْزَ الأَوْثَانَ ـ ‏\"‏ ثُمَّ حَمِيَ الْوَحْىُ وَتَتَابَعَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَالرِّجْزَ فَاهْجُرْ‏}‏",
                "headingUrdu": "(V.74:5)\"اور رجز (بتوں) سے دور رہو\"",
                "headingEnglish": "\"And keep away from Ar-Rujz (the idols)\" (V.74:5)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4704,
                "hadithNumber": "4927",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) used to move his tongue when the divine Inspiration was being revealed to him. (Sufyan, a subnarrator, demonstrated (how the Prophet (ﷺ) used to move his lips) and added. \"In order to memorize it.\" So Allah revealed: \"Move not your tongue concerning (the Qur'an) to make haste therewith.\" (75.16)",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم پر وحی نازل ہوتی تو آپ صلی اللہ علیہ وسلم اس پر اپنی زبان ہلایا کرتے تھے۔ سفیان نے کہا کہ اس ہلانے سے آپ کا مقصد وحی کو یاد کرنا ہوتا تھا۔ اس پر اللہ تعالیٰ نے یہ آیت نازل کی «لا تحرك به لسانك لتعجل به‏» ”آپ جلدی جلدی لینے کے لیے اس پر زبان نہ ہلایا کریں.",
                "urduNarrator": "ہم سے حمیدی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا ہم سے موسیٰ بن ابی عائشہ نے بیان کیا اور موسیٰ ثقہ تھے، انہوں نے سعید بن جبیر سے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا مُوسَى بْنُ أَبِي عَائِشَةَ ـ وَكَانَ ثِقَةً ـ عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا نَزَلَ عَلَيْهِ الْوَحْىُ حَرَّكَ بِهِ لِسَانَهُ ـ وَوَصَفَ سُفْيَانُ ـ يُرِيدُ أَنْ يَحْفَظَهُ فَأَنْزَلَ اللَّهُ ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ‏}‏",
                "headingArabic": "وَقَوْلُهُ ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’اپنی زبان (قرآن کے بارے میں) اس کے لیے جلدی نہ کرو۔‘‘ (V.75:16)",
                "headingEnglish": "The Statement of Allah the Exalted: \"Move not your tongue concerning (the Qur'an, O Muḥammad pbuh) to make haste therewith.\" (V.75:16)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4705,
                "hadithNumber": "4928",
                "englishNarrator": "Narrated Musa bin Abi Aisha:",
                "hadithEnglish": "That he asked Sa`id bin Jubair regarding (the statement of Allah). 'Move not your tongue concerning (the Qur'an) to make haste therewith.' He said, \"Ibn `Abbas رضی اللہ عنہما said that the Prophet (ﷺ) used to move his lips when the Divine Inspiration was being revealed to him. So the Prophet (ﷺ) was ordered not to move his tongue, which he used to do, lest some words should escape his memory. 'It is for Us to collect it' means, We will collect it in your chest;' and its recitation' means, We will make you recite it. 'But when We recite it (i.e. when it is revealed to you), follow its recital; it is for Us to explain it and make it clear,' (i.e. We will explain it through your tongue).",
                "hadithUrdu": "انہوں نے سعید بن جبیر سے اللہ تعالیٰ کے ارشاد «لا تحرك به لسانك‏» الایۃ یعنی ”آپ قرآن کو لینے کے لیے زبان نہ ہلایا کریں“ کے متعلق پوچھا تو انہوں نے بیان کیا کہ ابن عباس رضی اللہ عنہما نے کہا جب نبی کریم صلی اللہ علیہ وسلم پر وحی نازل ہوئی تو آپ صلی اللہ علیہ وسلم اپنے ہونٹ ہلایا کرتے تھے اس لیے آپ سے کہا گیا «لا تحرك به لسانك‏» الخ یعنی وحی پر اپنی زبان نہ ہلایا کریں، اس کا تمہارے دل میں جما دینا اور اس کا پڑھا دینا ہمارا کام ہے۔ جب ہم اس کو پڑھ چکیں یعنی جبرائیل تجھ کو سنا چکیں تو جیسا جبرائیل نے پڑھ کر سنایا تو بھی اس طرح پڑھ۔ پھر یہ بھی ہمارا ہی کام ہے کہ ہم تیری زبان سے اس کو پڑھوا دیں گے۔",
                "urduNarrator": "ہم سے عبداللہ بن موسیٰ نے بیان کیا، کہا ہم سے اسرائیل نے، ان سے موسیٰ بن ابی عائشہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، أَنَّهُ سَأَلَ سَعِيدَ بْنَ جُبَيْرٍ عَنْ قَوْلِهِ تَعَالَى ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ‏}‏ قَالَ وَقَالَ ابْنُ عَبَّاسٍ كَانَ يُحَرِّكُ شَفَتَيْهِ إِذَا أُنْزِلَ عَلَيْهِ، فَقِيلَ لَهُ ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ‏}‏ ـ يَخْشَى أَنْ يَنْفَلِتَ مِنْهُ ـ ‏{‏إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ‏}‏ أَنْ نَجْمَعَهُ فِي صَدْرِكَ، وَقُرْآنَهُ أَنْ تَقْرَأَهُ ‏{‏فَإِذَا قَرَأْنَاهُ‏}‏ يَقُولُ أُنْزِلَ عَلَيْهِ ‏{‏فَاتَّبِعْ قُرْآنَهُ * ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ‏}‏ أَنْ نُبَيِّنَهُ عَلَى لِسَانِكَ‏.‏",
                "headingArabic": "‏{‏إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ‏}‏",
                "headingUrdu": "\"اسے جمع کرنا اور آپ کو (اے محمد صلی اللہ علیہ وسلم) اس کی تلاوت کی توفیق دینا ہمارے ذمہ ہے۔\" (V.75:17)",
                "headingEnglish": "\"It is for Us to collect it and to give you (O Muḥammad pbuh), the ability to recite it (the Qur'ān) .\" (V.75:17)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4706,
                "hadithNumber": "4929",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "(as regards) Allah's Statement: \"Move not your tongue concerning (the Qur'an) to make haste therewith.\" (75.16) When Gabriel revealed the Divine Inspiration in Allah's Messenger (ﷺ) , he (Allah's Messenger (ﷺ)) moved his tongue and lips, and that state used to be very hard for him, and that movement indicated that revelation was taking place. So Allah revealed in Surat Al-Qiyama which begins: 'I do swear by the Day of Resurrection...' (75) the Verses:-- 'Move not your tongue concerning (the Qur'an) to make haste therewith. It is for Us to collect it (Qur'an) in your mind, and give you the ability to recite it by heart. (75.16-17) Ibn `Abbas added: It is for Us to collect it (Qur'an) (in your mind), and give you the ability to recite it by heart means, \"When We reveal it, listen. Then it is for Us to explain it,\" means, 'It is for us to explain it through your tongue.' So whenever Gabriel came to Allah's Messenger (ﷺ) ' he would keep quiet (and listen), and when the Angel left, the Prophet (ﷺ) would recite that revelation as Allah promised him. ''أَوْلَى لَكَ فَأَوْلَى'': Woe is near to you, now woe is near is a warning.",
                "hadithUrdu": "اللہ تعالیٰ کے ارشاد «لا تحرك به لسانك لتعجل به‏» الایۃ یعنی ”آپ اس کو جلدی جلدی لینے کے لیے اس پر زبان نہ ہلایا کریں“ کے متعلق بتلایا کہ جب جبرائیل آپ پر وحی نازل کرتے تو رسول اللہ صلی اللہ علیہ وسلم اپنی زبان اور ہونٹ ہلایا کرتے تھے اور آپ پر یہ بہت سخت گزرتا، یہ آپ کے چہرے سے بھی ظاہر ہوتا تھا۔ اس لیے اللہ تعالیٰ نے وہ آیت نازل کی جو سورۃ «لا أقسم بيوم القيامة‏» میں ہے یعنی «لا تحرك به لسانك» الایۃ یعنی ”آپ اس کو جلدی جلدی لینے کے لیے اس پر زبان نہ ہلایا کریں۔ یہ تو ہمارے ذمہ ہے اس کا جمع کر دینا اور اس کا پڑھوانا، پھر جب ہم اسے پڑھنے لگیں تو آپ اس کے پیچھے یاد کرتے جایا کریں۔ یعنی جب ہم وحی نازل کریں تو آپ غور سے سنیں۔ پھر اس کا بیان کرا دینا بھی ہمارے ذمہ ہے۔“ یعنی یہ بھی ہمارے ذمہ ہے کہ ہم اسے آپ کی زبانی لوگوں کے سامنے بیان کرا دیں۔ بیان کیا کہ چنانچہ اس کے بعد جب جبرائیل علیہ السلام وحی لے کر آتے تو نبی کریم صلی اللہ علیہ وسلم خاموش ہو جاتے اور جب چلے جاتے تو پڑھتے جیسا کہ اللہ تعالیٰ نے آپ سے وعدہ کیا تھا۔ آیت «أولى لك فأولى‏» میں «تهديد» یعنی ڈرانا دھمکانا مراد ہے۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے موسیٰ بن ابی عائشہ نے، ان سے سعید بن جبیر نے، ان سے ابن عباس رضی اللہ عنہما نے",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ‏}‏ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا نَزَلَ جِبْرِيلُ بِالْوَحْىِ، وَكَانَ مِمَّا يُحَرِّكُ بِهِ لِسَانَهُ وَشَفَتَيْهِ فَيَشْتَدُّ عَلَيْهِ وَكَانَ يُعْرَفُ مِنْهُ، فَأَنْزَلَ اللَّهُ الآيَةَ الَّتِي فِي ‏{‏لاَ أُقْسِمُ بِيَوْمِ الْقِيَامَةِ‏}‏ ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ * إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ‏}‏ قَالَ عَلَيْنَا أَنْ نَجْمَعَهُ فِي صَدْرِكَ، وَقُرْآنَهُ ‏{‏فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ‏}‏ فَإِذَا أَنْزَلْنَاهُ فَاسْتَمِعْ ‏{‏ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ‏}‏ عَلَيْنَا أَنْ نُبَيِّنَهُ بِلِسَانِكَ ـ قَالَ ـ فَكَانَ إِذَا أَتَاهُ جِبْرِيلُ أَطْرَقَ، فَإِذَا ذَهَبَ قَرَأَهُ كَمَا وَعَدَهُ اللَّهُ‏.‏ ‏{‏أَوْلَى لَكَ فَأَوْلَى‏}‏ تَوَعُّدٌ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ‏}‏",
                "headingUrdu": "\"اور جب ہم اسے آپ پر پڑھ کر سنائیں تو اس کی (قرآن) کی پیروی کرو۔\" (V.75:18)",
                "headingEnglish": "\"And when We have recited it to you [O Muḥammad PBUH through Jibril (Gabriel) a.s.], then follow its (the Qur'an's) recital.\" (V.75:18)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4707,
                "hadithNumber": "4930",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "We were with the Prophet (ﷺ) when Surat Wal-Mursalat was revealed to him. While we were receiving it from his mouth, a snake suddenly came and we ran to kill it, but it outstripped us and entered its hole quickly. Allah's le said, \"It has escaped your evil, and you too, have escaped its evil.\"",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے اور آپ پر سورۃ والمرسلات نازل ہوئی تھی اور ہم اس کو آپ کے منہ سے سیکھ رہے تھے کہ اتنے میں ایک سانپ نکل آیا۔ ہم لوگ اس کے مارنے کو بڑھے لیکن وہ بچ نکلا اور اپنے سوراخ میں گھس گیا۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ وہ تمہارے شر سے بچ گیا اور تم اس کے شر سے بچ گئے۔",
                "urduNarrator": "ہم سے محمود نے بیان کیا، کہا ہم سے عبیداللہ نے بیان کیا، ان سے اسرائیل نے، ان سے منصور نے، ان سے ابراہیم نے، ان سے علقمہ نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ إِسْرَائِيلَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأُنْزِلَتْ عَلَيْهِ وَالْمُرْسَلاَتِ، وَإِنَّا لَنَتَلَقَّاهَا مِنْ فِيهِ فَخَرَجَتْ حَيَّةٌ، فَابْتَدَرْنَاهَا فَسَبَقَتْنَا فَدَخَلَتْ جُحْرَهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ وُقِيَتْ شَرَّكُمْ، كَمَا وُقِيتُمْ شَرَّهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4708,
                "hadithNumber": "4931",
                "englishNarrator": "Narrated `Abdullah:",
                "hadithEnglish": "(Similarly--as no. 452 above.)",
                "hadithUrdu": "اور یحییٰ بن آدم کے ساتھ اس حدیث کو اسود بن عامر نے اسرائیل سے روایت کی اور حفص بن غیاث اور ابومعاویہ اور سلیمان بن قرم نے اعمش سے، انہوں نے ابراہیم سے، انہوں نے اسود سے روایت کیا اور یحییٰ بن حماد ( شیخ بخاری ) نے کہا ہم کو ابوعوانہ نے خبر دی، انہوں نے مغیرہ بن مقسم سے، انہوں نے ابراہیم سے، انہوں نے علقمہ سے، انہوں نے عبداللہ بن مسعود سے اور محمد بن اسحاق نے اس حدیث کو عبدالرحمٰن بن اسود سے روایت کیا، انہوں نے اپنے والد اسود سے، انہوں نے عبداللہ بن مسعود سے بیان کیا۔",
                "urduNarrator": "ہم سے عبدہ بن عبداللہ خزاعی نے بیان کیا، کہا ہم کو یحییٰ بن آدم نے خبر دی، انہیں اسرائیل نے، انہیں منصور نے یہی حدیث اور اسرائیل نے اس حدیث کو اعمش سے، انہوں نے ابراہیم سے، انہوں نے علقمہ سے، انہوں نے عبداللہ بن مسعود رضی اللہ عنہ سے بھی روایت کیا ہے",
                "hadithArabic": "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ ، أَخْبَرَنَا يَحْيَى بْنُ آدَمَ ، عَنْ إِسْرَائِيلَ ، عَنْ مَنْصُورٍ بِهَذَا ، وَعَنْ إِسْرَائِيلَ ، عَنْ الْأَعْمَشِ ، عَنْ إِبْرَاهِيمَ ، عَنْ عَلْقَمَةَ ، عَنْ عَبْدِ اللَّهِ مِثْلَهُ ، وَتَابَعَهُ أَسْوَدُ بْنُ عَامِرٍ ، عَنْ إِسْرَائِيلَ ، وَقَالَ حَفْصٌ ، وَأَبُو مُعَاوِيَةَ ، وَسُلَيْمَانُ بْنُ قَرْمٍ ، عَنْ الْأَعْمَشِ ، عَنْ إِبْرَاهِيمَ ، عَنْ الْأَسْوَدِ ، قَالَ يَحْيَى بْنُ حَمَّادٍ : أَخْبَرَنَا أَبُو عَوَانَةَ ، عَنْ مُغِيرَةَ ، عَنْ إِبْرَاهِيمَ ، عَنْ عَلْقَمَةَ ، عَنْ عَبْدِ اللَّهِ ،وَقَالَ ابْنُ إِسْحَاقَ ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ ، عَنْ أَبِيهِ ، عَنْ عَبْدِ اللَّهِ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4709,
                "hadithNumber": "4932",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "(as regards the explanation of Hadith 454). 'Indeed, it (Hell) throws about sparks (huge) as Forts.' We used to collect wood in the form of logs, three cubits long or shorter. for heating purposes in winter., and we used to call such wood, the Qasr.",
                "hadithUrdu": "آیت «إنها ترمي بشرر كالقصر» یعنی ”وہ انگارے برسائے گی جیسے بڑے محل“ کے متعلق پوچھا اور انہوں نے کہا کہ ہم تین تین ہاتھ کی لکڑیاں اٹھا کر رکھتے تھے۔ ایسا ہم جاڑوں کے لیے کرتے تھے ( تاکہ وہ جلانے کے کام آئیں ) اور ان کا نام «قصر‏.‏» رکھتے تھے۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم کو سفیان نے خبر دی، کہا ہم سے عبدالرحمٰن بن عابس نے بیان کیا کہا میں نے ابن عباس رضی اللہ عنہما سے",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَابِسٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، إِنَّهَا تَرْمِي بِشَرَرٍ كَالْقَصْرِ قَالَ كُنَّا نَرْفَعُ الْخَشَبَ بِقَصَرٍ ثَلاَثَةَ أَذْرُعٍ أَوْ أَقَلَّ، فَنَرْفَعُهُ لِلشِّتَاءِ فَنُسَمِّيهِ الْقَصَرَ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏إِنَّهَا تَرْمِي بِشَرَرٍ كَالْقَصْرِ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"بے شک یہ (جہنم) القصر (ایک قلعہ یا لکڑی کی ایک بڑی کٹ) جیسی چنگاریاں پھینکتی ہے۔\" (V.77:32)",
                "headingEnglish": "The Statement of Allah ta'ala: \"Verily! It (Hell) throws sparks (huge) as Al-Qasr (a fort or a huge log of wood) .\" (V.77:32)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4710,
                "hadithNumber": "4933",
                "englishNarrator": "Narrated Ibn 'Abbas رضی اللہ عنہما :",
                "hadithEnglish": "(regarding) the explanation of \"... It throws sparks as Al-Qasr ...\" (V. 77:32): We used to collect logs of wood, three cubits long or longer, to store for heating purposes in winter, and we used to call it Al- Qasr, it also means a castle or a fort. \"As if they were Jimalatun Sufr (yellow camels or bundles of ropes)\" (V.77:33): means the ropes of a ship which are made in bundles till it become as wide as men's waists.",
                "hadithUrdu": "آیت «ترمي بشرر‏ كالقصر» کے متعلق۔ آپ نے فرمایا کہ ہم تین ہاتھ یا اس سے بھی لمبی لکڑیاں اٹھا کر جاڑوں کے لیے رکھ لیتے تھے۔ ایسی لکڑیوں کو ہم «قصر‏.‏» کہتے تھے، «كأنه جمالات صفر‏» سے مراد کشتی کی رسیاں ہیں جو جوڑ کر رکھی جائیں، وہ آدمی کی کمر برابر موٹی ہو جائیں۔",
                "urduNarrator": "ہم سے عمرو بن علی نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، انہوں نے کہا ہمیں سفیان نے خبر دی، ان سے عبدالرحمٰن بن عابس نے بیان کیا اور انہوں نے ابن عباس رضی اللہ عنہما سے سنا،",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَابِسٍ، سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ ‏{‏تَرْمِي بِشَرَرٍ‏}‏ كُنَّا نَعْمِدُ إِلَى الْخَشَبَةِ ثَلاَثَةَ أَذْرُعٍ وَفَوْقَ ذَلِكَ، فَنَرْفَعُهُ لِلشِّتَاءِ فَنُسَمِّيهِ الْقَصَرَ‏.‏ ‏{‏كَأَنَّهُ جِمَالاَتٌ صُفْرٌ‏}‏ حِبَالُ السُّفْنِ تُجْمَعُ حَتَّى تَكُونَ كَأَوْسَاطِ الرِّجَالِ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏كَأَنَّهُ جِمَالاَتٌ صُفْرٌ‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’گویا وہ پیلے رنگ کے اونٹ ہیں یا رسیوں کے گٹھے ہیں۔‘‘ (V.77:33)",
                "headingEnglish": "The Statement of Allah the Most High: \"As if they were yellow camels or bundles of ropes.\" (V.77:33)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4711,
                "hadithNumber": "4934",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "While we were with the Prophet (ﷺ) in a cave, Surat wal-Mursalat was revealed to him and he recited it, and I heard it directly from his mouth as soon as he recited its revelation. Suddenly a snake sprang at us, and the Prophet (ﷺ) said, \"Kill it!\" We ran to kill it but it escaped quickly. The Prophet (ﷺ) said. \"It has escaped your evil, and you too have escaped its evil.\" Amr bin Hafs states  that he has learnt this Hadith hearing from his father who was present there in the cave of Mina.",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک غار میں تھے کہ نبی کریم صلی اللہ علیہ وسلم پر سورۃ والمرسلات نازل ہوئی، پھر نبی کریم صلی اللہ علیہ وسلم نے اس کی تلاوت کی اور میں نے اسے آپ ہی کے منہ سے یاد کر لیا۔ وحی سے آپ کی منہ کی تازگی اس وقت بھی باقی تھی کہ اتنے میں غار کی طرف ایک سانپ لپکا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسے مار ڈالو۔ ہم اس کی طرف بڑھے لیکن وہ بھاگ گیا۔ نبی کریم صلی اللہ علیہ وسلم نے اس پر فرمایا کہ وہ بھی تمہارے شر سے اس طرح بچ نکلا جیسا کہ تم اس کے شر سے بچ گئے۔ عمر بن حفص نے کہا مجھے یہ حدیث یاد ہے، میں نے اپنے والد سے سنی تھی، انہوں نے اتنا اور بڑھایا تھا کہ وہ غار منیٰ میں تھا۔",
                "urduNarrator": "ہم سے عمر بن حفص نے بیان کیا، کہ مجھ سے میرے والد نے بیان کیا، کہا ہم سے اعمش نے بیان کیا، کہا مجھ سے ابراہیم نے بیان کیا، ان سے اسود نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي إِبْرَاهِيمُ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، قَالَ بَيْنَمَا نَحْنُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي غَارٍ إِذْ نَزَلَتْ عَلَيْهِ وَالْمُرْسَلاَتِ، فَإِنَّهُ لَيَتْلُوهَا وَإِنِّي لأَتَلَقَّاهَا مِنْ فِيهِ وَإِنَّ فَاهُ لَرَطْبٌ بِهَا، إِذْ وَثَبَتْ عَلَيْنَا حَيَّةٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اقْتُلُوهَا ‏\"‏‏.‏ فَابْتَدَرْنَاهَا فَذَهَبَتْ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وُقِيَتْ شَرَّكُمْ، كَمَا وُقِيتُمْ شَرَّهَا ‏\"‏‏.‏ قَالَ عُمَرُ حَفِظْتُهُ مِنْ أَبِي فِي غَارٍ بِمِنًى‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏هَذَا يَوْمُ لاَ يَنْطِقُونَ‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’وہ وہ دن ہوگا جب وہ (اس کے کچھ حصے میں) بات نہیں کریں گے۔‘‘ (V.77:35)",
                "headingEnglish": "The Statement of Allah the Most High: \"That will be a Day when they shall not speak (during some part of it) .\" (V.77:35)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4712,
                "hadithNumber": "4935",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) said, 'Between the two sounds of the trumpet, there will be forty.\" Somebody asked Abu Huraira رضی اللہ عنہ, \"Forty days?\" But he refused to reply. Then he asked, \"Forty months?\" He refused to reply. Then he asked, \"Forty years?\" Again, he refused to reply. Abu Huraira added. \"Then (after this period) Allah will send water from the sky and then the dead bodies will grow like vegetation grows, There is nothing of the human body that does not decay except one bone; that is the little bone at the end of the coccyx of which the human body will be recreated on the Day of Resurrection.\" (See Hadith No. 338)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ دو صور پھونکے جانے کے درمیان چالیس فاصلہ ہو گا۔ ابوہریرہ رضی اللہ عنہ کے شاگردوں نے پوچھا کیا چالیس دن مراد ہیں؟ انہوں نے کہا کہ مجھے معلوم نہیں پھر شاگردوں نے پوچھا کیا چالیس مہینے مراد ہیں؟ انہوں نے کہا کہ مجھے معلوم نہیں۔ شاگردوں نے پوچھا کیا چالیس سال مراد ہیں؟ کہا کہ مجھے معلوم نہیں۔ کہا کہ پھر اللہ تعالیٰ آسمان سے پانی برسائے گا۔ جس کی وجہ سے تمام مردے جی اٹھیں گے جیسے سبزیاں پانی سے اگ آتی ہیں۔ اس وقت انسان کا ہر حصہ گل چکا ہو گا۔ سوا ریڑھ کی ہڈی کے اور اس سے قیامت کے دن تمام مخلوق دوبارہ بنائی جائے گی۔",
                "urduNarrator": "ہم سے محمد نے بیان کیا، کہا ہم کو ابومعاویہ نے خبر دی، انہیں اعمش نے، انہیں ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا بَيْنَ النَّفْخَتَيْنِ أَرْبَعُونَ ‏\"‏‏.‏ قَالَ أَرْبَعُونَ يَوْمًا قَالَ أَبَيْتُ‏.‏ قَالَ أَرْبَعُونَ شَهْرًا قَالَ أَبَيْتُ‏.‏ قَالَ أَرْبَعُونَ سَنَةً قَالَ أَبَيْتُ‏.‏ قَالَ ‏\"‏ ثُمَّ يُنْزِلُ اللَّهُ مِنَ السَّمَاءِ مَاءً‏.‏ فَيَنْبُتُونَ كَمَا يَنْبُتُ الْبَقْلُ لَيْسَ مِنَ الإِنْسَانِ شَىْءٌ إِلاَّ يَبْلَى إِلاَّ عَظْمًا وَاحِدًا وَهْوَ عَجْبُ الذَّنَبِ، وَمِنْهُ يُرَكَّبُ الْخَلْقُ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
                "headingArabic": "‏{‏يَوْمَ يُنْفَخُ فِي الصُّورِ فَتَأْتُونَ أَفْوَاجًا‏}‏ زُمَرًا",
                "headingUrdu": "\"جس دن صور پھونکا جائے گا، اور تم لوگ گروہ در گروہ نکلو گے۔\" (V.78:18)",
                "headingEnglish": "\"The Day when the Trumpet will be blown, and you shall come forth in crowds (groups after groups) .\" (V.78:18)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4713,
                "hadithNumber": "4936",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "I saw Allah's Messenger (ﷺ) pointing with his index and middle fingers, saying. \"The time of my Advent and the Hour are like these two fingers.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہا آپ اپنی بیچ کی انگلی اور انگوٹھے کے قریب والی انگلی کے اشارے سے فرما رہے تھے کہ میں ایسے وقت میں مبعوث ہوا ہوں کہ میرے اور قیامت کے درمیان صرف ان دو کے برابر فاصلہ ہے۔",
                "urduNarrator": "ہم سے احمد بن مقدام نے بیان کیا، انہوں نے کہا ہم سے فضیل بن سلیمان نے بیان کیا، انہوں نے کہا ہم سے ابوحازم نے بیان کیا، انہوں نے کہا ہم سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ الْمِقْدَامِ، حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا أَبُو حَازِمٍ، حَدَّثَنَا سَهْلُ بْنُ سَعْدٍ ـ رضى الله عنه ـ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ بِإِصْبَعَيْهِ هَكَذَا بِالْوُسْطَى وَالَّتِي تَلِي الإِبْهَامَ ‏ \"‏ بُعِثْتُ وَالسَّاعَةَ كَهَاتَيْنِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4714,
                "hadithNumber": "4937",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Such a person as recites the Qur'an and masters it by heart, will be with the noble righteous scribes (in Heaven). And such a person exerts himself to learn the Qur'an by heart, and recites it with great difficulty, will have a double reward.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس شخص کی مثال جو قرآن پڑھتا ہے اور وہ اس کا حافظ بھی ہے، مکرم اور نیک لکھنے والے ( فرشتوں ) جیسی ہے اور جو شخص قرآن مجید باربار پڑھتا ہے۔ پھر بھی وہ اس کے لیے دشوار ہے تو اسے دوگنا ثواب ملے گا۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، کہا ہم سے قتادہ نے بیان کیا، کہا کہ میں نے زرارہ بن اوفی سے سنا، وہ سعد بن ہشام سے بیان کرتے تھے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا قَتَادَةُ، قَالَ سَمِعْتُ زُرَارَةَ بْنَ أَوْفَى، يُحَدِّثُ عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَثَلُ الَّذِي يَقْرَأُ الْقُرْآنَ وَهْوَ حَافِظٌ لَهُ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ، وَمَثَلُ الَّذِي يَقْرَأُ الْقُرْآنَ وَهْوَ يَتَعَاهَدُهُ وَهْوَ عَلَيْهِ شَدِيدٌ، فَلَهُ أَجْرَانِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4715,
                "hadithNumber": "4938",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"On the Day when all mankind will stand before the Lord of the Worlds, some of them will be enveloped in their sweat up to the middle of their ears.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس دن لوگ دونوں جہان کے پالنے والے کے سامنے حساب دینے کے لیے کھڑے ہوں گے تو کانوں کی لو تک پسینہ میں ڈوب جائیں گے۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا، انہوں نے کہا ہم سے معن نے بیان کیا، انہوں نے کہا کہ مجھ سے مالک نے بیان کیا، ان سے نافع اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا مَعْنٌ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ ‏{‏يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ‏}‏ حَتَّى يَغِيبَ أَحَدُهُمْ فِي رَشْحِهِ إِلَى أَنْصَافِ أُذُنَيْهِ ‏\"‏‏.‏",
                "headingArabic": "{يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ}",
                "headingUrdu": "\"جس دن (تمام) انسان رب العالمین (انسان، جن اور تمام موجودات) کے سامنے کھڑے ہوں گے\" (83:6)",
                "headingEnglish": "\"The Day when (all) mankind will stand before the Lord of the 'Alamīn (mankind, jinn and all that exists)\" (V.83:6)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4716,
                "hadithNumber": "4939",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I heard the Prophet ﷺ narrates that she say: Solaiman bin Harb, from Hammad bin Zaid, from Ayyub, from Ibn-e-Abi Molaikah, reports from Hadrat Aishah رضی اللہ عنہا that the Prophet ﷺ said: None is called to account but he gets ruined. She says that she then submitted: O Allah's Apostle! May Allah you! Doesn't Allah sacrifice me over say: Then as to one who is given his record in his right hand. He will soon have an easy reckoning? He said: It is the presentation of the record sheets but whosoever undergoes a cross examination of the deeds will be ruined.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا۔ہم سے سلیمان بن حرب نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، وہ ایوب کے واسطہ سے، وہ ابن ابی ملیکہ سے، انہوں نے عائشہ رضی اللہ عنہا سے، وہ نبی کریم صلی اللہ علیہ وسلم سے سنا۔ہم سے مسدد نے یحییٰ کی سند سے، ابو یونس کی سند سے، حاتم بن ابی صغیرہ نے، ابن ابی ملیکہ کی سند سے، القاسم کی سند سے، عائشہ رضی اللہ عنہا نے کہا  کہ میں نےعرض  کیا یا رسول اللہ! اللہ مجھے آپ پر قربان کرے,  کیا اللہ تعالیٰ نے یہ ارشاد نہیں فرمایا کہ فاما من اوتی کتبه بیمینه فسوف يحاسب حسابا يسيرا \"تو جس کسی کا نامہ اعمال اس کے داہنے ہاتھ میں ملے گا سو اس سے آسان حساب لیا جائے گا آنحضرت نے فرمایا آیت میں جس حساب کا ذکر ہے وہ تو پیشی ہوگی ۔ وہ صرف پیش کئے جائیں گے ( اور بغیر حساب چھوٹ جائیں گے ) لیکن جس سے بھی پوری طرح حساب لے لیا گیا وہ ہلاک ہو گا۔",
                "urduNarrator": "ہم سے عمرو بن علی نے بیان کیا، کہا ہم سے یحییٰ نے بیان کیا، ان سے عثمان بن اسود نے بیان کیا، انہوں نے ابن ابی ملیکہ سے سنا اور انہوں نے عائشہ رضی اللہ عنہا سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، عَنْ عُثْمَانَ بْنِ الأَسْوَدِ، قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنْ أَبِي يُونُسَ، حَاتِمِ بْنِ أَبِي صَغِيرَةَ عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَيْسَ أَحَدٌ يُحَاسَبُ إِلاَّ هَلَكَ ‏\"‏‏.‏ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ جَعَلَنِي اللَّهُ فِدَاءَكَ، أَلَيْسَ يَقُولُ اللَّهُ عَزَّ وَجَلَّ ‏{‏فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ * فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا‏}‏‏.‏ قَالَ ‏\"‏ ذَاكَ الْعَرْضُ يُعْرَضُونَ، وَمَنْ نُوقِشَ الْحِسَابَ هَلَكَ ‏\"‏‏.‏",
                "headingArabic": "{فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا}",
                "headingUrdu": "’’اسے یقیناً آسان حساب ملے گا۔‘‘ (V.84:8)",
                "headingEnglish": "\"He surely will receive an easy reckoning.\" (V.84:8)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4717,
                "hadithNumber": "4940",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "(as regards the Verse):--'You shall surely travel from stage to stage (in this life and in the Hereafter).' (It means) from one state to another. That concerns your Prophet.",
                "hadithUrdu": "«لتركبن طبقا عن طبق‏» یعنی ”تم کو ضرور ایک حالت کے بعد دوسرے حالت پر پہنچنا ہے۔“ بیان کیا کہ یہاں مراد نبی کریم صلی اللہ علیہ وسلم ہیں کہ آپ کو کامیابی رفتہ رفتہ حاصل ہو گی۔",
                "urduNarrator": "ہم سے سعید بن نضر نے بیان کیا، کہا ہم کو ہشیم نے خبر دی، کہا مجھ کو ابوبشر جعفر بن ایاس نے خبر دی، ان سے مجاہد نے بیان کیا کہ ابن عباس رضی اللہ عنہما نے کہا",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ النَّضْرِ، أَخْبَرَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، جَعْفَرُ بْنُ إِيَاسٍ عَنْ مُجَاهِدٍ، قَالَ قَالَ ابْنُ عَبَّاسٍ ‏{‏لَتَرْكَبُنَّ طَبَقًا عَنْ طَبَقٍ‏}‏ حَالاً بَعْدَ حَالٍ، قَالَ هَذَا نَبِيُّكُمْ صلى الله عليه وسلم‏.‏",
                "headingArabic": "‏{‏لَتَرْكَبُنَّ طَبَقًا عَنْ طَبَقٍ‏}‏",
                "headingUrdu": "’’تم یقیناً مرحلہ سے دوسرے مرحلے (دنیا اور آخرت میں) سفر کرو گے‘‘ (V.84:19)",
                "headingEnglish": "\"You shall certainly travel from stage to stage (in this life and in the Hereafter)\" (V.84:19)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4718,
                "hadithNumber": "4941",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "The first of the companions of the Prophet (ﷺ) who came to us (in Medina), were Mus`ab bin `Umar and Ibn Um Maktum رضی اللہ عنہما , and they started teaching us the Qur'an. Then came `Ammar, Bilal and Sa`d رضی اللہ عنہم . Afterwards `Umar bin Al-Kkattab رضی اللہ عنہ came along with a batch of twenty (men): and after that the Prophet (ﷺ) came. I never saw the people of Medina so pleased with anything as they were with his arrival, so that even the little boys and girls were saying, \"This is Allah's Messenger (ﷺ) who has come.\" He (the Prophet (ﷺ) ) did not come (to Medina) till I had learnt Surat Al-Ala and also other similar Suras.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے ( مہاجر ) صحابہ میں سب سے پہلے ہمارے پاس مدینہ تشریف لانے والے مصعب بن عمیر اور ابن ام مکتوم رضی اللہ عنہما تھے۔ مدینہ پہنچ کر ان بزرگوں نے ہمیں قرآن مجید پڑھانا شروع کر دیا۔ پھر عمار، بلال اور سعد رضی اللہ عنہم آئے۔ اور عمر بن خطاب رضی اللہ عنہ بیس صحابہ کو ساتھ لے کر آئے اس کے بعد نبی کریم صلی اللہ علیہ وسلم تشریف لائے میں نے کبھی مدینہ والوں کو اتنا خوش ہونے والا نہیں دیکھا تھا، جتنا وہ نبی کریم صلی اللہ علیہ وسلم کی آمد پر خوش ہوئے تھے۔ بچیاں اور بچے بھی کہنے لگے تھے کہ آپ اللہ کے رسول ہیں، ہمارے یہاں تشریف لائے ہیں۔ میں نے نبی کریم صلی اللہ علیہ وسلم کی مدینہ میں تشریف آوری سے پہلے ہی «سبح اسم ربك الأعلى‏» اور اس جیسی اور سورتیں پڑھ لی تھیں۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا، کہا کہ مجھے میرے والد نے خبر دی، انہیں شعبہ نے، انہیں ابواسحاق نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ أَوَّلُ مَنْ قَدِمَ عَلَيْنَا مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مُصْعَبُ بْنُ عُمَيْرٍ وَابْنُ أُمِّ مَكْتُومٍ فَجَعَلاَ يُقْرِئَانِنَا الْقُرْآنَ، ثُمَّ جَاءَ عَمَّارٌ وَبِلاَلٌ وَسَعْدٌ ثُمَّ جَاءَ عُمَرُ بْنُ الْخَطَّابِ فِي عِشْرِينَ ثُمَّ جَاءَ النَّبِيُّ صلى الله عليه وسلم فَمَا رَأَيْتُ أَهْلَ الْمَدِينَةِ فَرِحُوا بِشَىْءٍ فَرَحَهُمْ بِهِ، حَتَّى رَأَيْتُ الْوَلاَئِدَ وَالصِّبْيَانَ يَقُولُونَ هَذَا رَسُولُ اللَّهِ قَدْ جَاءَ‏.‏ فَمَا جَاءَ حَتَّى قَرَأْتُ ‏{‏سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى‏}‏ فِي سُوَرٍ مِثْلِهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4719,
                "hadithNumber": "4942",
                "englishNarrator": "Narrated `Abdullah bin Zama رضی اللہ عنہ :",
                "hadithEnglish": "That he heard the Prophet (ﷺ) delivering a sermon, and he mentioned the shecamel and the one who hamstrung it. Allah's Messenger (ﷺ) recited:-- 'When, the most wicked man among them went forth (to hamstrung the she-camel).' (91.12.) Then he said, \"A tough man whose equal was rare and who enjoyed the protection of his people, like Abi Zama went forth to (hamstrung) it.\" The Prophet (ﷺ) then mentioned about the women (in his sermon). \"It is not wise for anyone of you to lash his wife like a slave, for he might sleep with her the same evening.\" Then he advised them not to laugh when somebody breaks wind and said, \"Why should anybody laugh at what he himself does?\" Hadrat Abdullah bin Zamah reports that the prophet ﷺ said: Like Abu Zamah, the uncle of Hadrat Zubair bin Awwam.",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا، نبی کریم صلی اللہ علیہ وسلم نے اپنے ایک خطبہ میں صالح علیہ السلام کی اونٹنی کا ذکر فرمایا اور اس شخص کا بھی ذکر فرمایا جس نے اس کی کونچیں کاٹ ڈالی تھیں پھر آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا «إذ انبعث أشقاها‏» یعنی اس اونٹنی کو مار ڈالنے کے لیے ایک مفسد بدبخت ( قدار نامی ) کو اپنی قوم میں ابوزمعہ کی طرح غالب اور طاقتور تھا اٹھا۔ نبی کریم صلی اللہ علیہ وسلم نے عورتوں کے حقوق کا بھی ذکر فرمایا کہ تم میں بعض اپنی بیوی کو غلام کی طرح کوڑے مارتے ہیں حالانکہ اسی دن کے ختم ہونے پر وہ اس سے ہمبستری بھی کرتے ہیں۔ پھر آپ نے انہیں ریاح خارج ہونے پر ہنسنے سے منع فرمایا اور فرمایا کہ ایک کام جو تم میں ہر شخص کرتا ہے اسی پر تم دوسروں پر کس طرح ہنستے ہو۔ ابومعاویہ نے بیان کیا کہ ہم سے ہشام بن عروہ بن زبیر نے، ان سے عبداللہ بن زمعہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ( اس حدیث میں ) یوں فرمایا ابوزمعہ کی طرح جو زبیر بن عوام کا چچا تھا۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا، کہا ہم سے وہیب نے بیان کیا، ہم سے ہشام بن عروہ نے بیان کیا، ان سے ان کے والد نے اور انہیں عبداللہ بن زمعہ رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، أَنَّهُ أَخْبَرَهُ عَبْدُ اللَّهِ بْنُ زَمْعَةَ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ وَذَكَرَ النَّاقَةَ وَالَّذِي عَقَرَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ‏{‏إِذِ انْبَعَثَ أَشْقَاهَا‏}‏ انْبَعَثَ لَهَا رَجُلٌ عَزِيزٌ عَارِمٌ، مَنِيعٌ فِي رَهْطِهِ، مِثْلُ أَبِي زَمْعَةَ ‏\"‏‏.‏ وَذَكَرَ النِّسَاءَ فَقَالَ ‏\"‏ يَعْمِدُ أَحَدُكُمْ يَجْلِدُ امْرَأَتَهُ جَلْدَ الْعَبْدِ، فَلَعَلَّهُ يُضَاجِعُهَا مِنْ آخِرِ يَوْمِهِ ‏\"‏‏.‏ ثُمَّ وَعَظَهُمْ فِي ضَحِكِهِمْ مِنَ الضَّرْطَةِ وَقَالَ ‏\"‏ لِمَ يَضْحَكُ أَحَدُكُمْ مِمَّا يَفْعَلُ ‏\"‏‏.‏ وَقَالَ أَبُو مُعَاوِيَةَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مِثْلُ أَبِي زَمْعَةَ عَمِّ الزُّبَيْرِ بْنِ الْعَوَّامِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4720,
                "hadithNumber": "4943",
                "englishNarrator": "Narrated Alqama:",
                "hadithEnglish": "I went to Sham with a group of the companions of `Abdullah (bin Mas`ud رضی اللہ عنہ). Abu Ad-Darda' رضی اللہ عنہ heard of our arrival so he came to us and said, \"Is there anybody among you who can recite (Qur'an)\" We replied in the affirmative. Then he asked, \"Who is the best reciter?\" They pointed at me. Then he told me to recite, so I recited the verse:-- 'By the night as it envelops 'By the day as it appears in brightness; By (Him Who created) male and the female.' (92.1-3) Abu Ad-Darda' رضی اللہ عنہ then said to me, \"Did you hear it (like this) from the mouth of your friend (`Abdullah bin Mas`ud رضی اللہ عنہ )?\" I said, \"Yes.\" He said, \"I too, heard it (like this) from the mouth of the Prophet, but these people do not consider this recitation as the correct one.\"",
                "hadithUrdu": "عبداللہ بن مسعود رضی اللہ عنہ کے شاگردوں کے ساتھ میں ملک شام پہنچا ہمارے متعلق ابو الدرداء رضی اللہ عنہ نے سنا تو ہم سے ملنے خود تشریف لائے اور دریافت فرمایا تم میں کوئی قرآن مجید کا قاری بھی ہے؟ ہم سے کہا جی ہاں ہے۔ دریافت فرمایا کہ سب سے اچھا قاری کون ہے؟ لوگوں نے میری طرف اشارہ کیا۔ آپ نے فرمایا کہ پھر کوئی آیت تلاوت کرو۔ میں نے «والليل إذا يغشى * والنهار إذا تجلى * والذكر والأنثى‏» کی تلاوت کی۔ ابوالدرداء رضی اللہ عنہ نے پوچھا کیا تم نے خود یہ آیت اپنے استاد عبداللہ بن مسعود رضی اللہ عنہ کی زبانی اسی طرح سنی ہے؟ میں نے کہا جی ہاں۔ انہوں نے اس پر کہا کہ میں نے بھی نبی کریم صلی اللہ علیہ وسلم کی زبانی یہ آیت اسی طرح سنی ہے، لیکن یہ شام والے ہم پر انکار کرتے ہیں۔",
                "urduNarrator": "ہم سے قبیصہ بن عقبہ نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے اعمش نے، ان سے ابراہیم نخعی نے اور ان سے علقمہ بن قیس نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ دَخَلْتُ فِي نَفَرٍ مِنْ أَصْحَابِ عَبْدِ اللَّهِ الشَّأْمَ فَسَمِعَ بِنَا أَبُو الدَّرْدَاءِ فَأَتَانَا فَقَالَ أَفِيكُمْ مَنْ يَقْرَأُ فَقُلْنَا نَعَمْ‏.‏ قَالَ فَأَيُّكُمْ أَقْرَأُ فَأَشَارُوا إِلَىَّ فَقَالَ اقْرَأْ‏.‏ فَقَرَأْتُ ‏{‏وَاللَّيْلِ إِذَا يَغْشَى * وَالنَّهَارِ إِذَا تَجَلَّى * وَالذَّكَرِ وَالأُنْثَى‏}‏‏.‏ قَالَ أَنْتَ سَمِعْتَهَا مِنْ فِي صَاحِبِكَ قُلْتُ نَعَمْ‏.‏ قَالَ وَأَنَا سَمِعْتُهَا مِنْ فِي النَّبِيِّ صلى الله عليه وسلم وَهَؤُلاَءِ يَأْبَوْنَ عَلَيْنَا‏.‏",
                "headingArabic": "‏{‏وَالنَّهَارِ إِذَا تَجَلَّى‏}‏",
                "headingUrdu": "\"دن کی قسم جیسے وہ چمکتا ہوا نظر آتا ہے۔\" (V.92:2)",
                "headingEnglish": "\"By the day as it appears in brightness.\" (V.92:2)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4721,
                "hadithNumber": "4944",
                "englishNarrator": "Narrated Ibrahim:",
                "hadithEnglish": "The companions of `Abdullah (bin Mas`ud رضی اللہ عنہ ) came to Abu Darda' رضی اللہ عنہ , (and before they arrived at his home), he looked for them and found them. Then he asked them,: 'Who among you can recite (Qur'an) as `Abdullah recites it?\" They replied, \"All of us.\" He asked, \"Who among you knows it by heart?\" They pointed at 'Alqama. Then he asked Alqama. \"How did you hear `Abdullah bin Mas`ud reciting Surat Al-Lail (The Night)?\" Alqama recited: 'By the male and the female.' Abu Ad-Darda said, \"I testify that I heard me Prophet reciting it likewise, but these people want me to recite it:-- 'And by Him Who created male and female.' but by Allah, I will not follow them.\"",
                "hadithUrdu": "عبداللہ بن مسعود رضی اللہ عنہ کے کچھ شاگرد ابو الدرداء رضی اللہ عنہ کے یہاں ( شام ) آئے انہوں نے انہیں تلاش کیا اور پا لیا۔ پھر ان سے پوچھا کہ تم میں کون عبداللہ بن مسعود رضی اللہ عنہ کی قرآت کے مطابق قرآت کر سکتا ہے؟ شاگروں نے کہا کہ ہم سب کر سکتے ہیں۔ پھر پوچھا کسے ان کی قرآت زیادہ محفوظ ہے؟ سب نے علقمہ کی طرف اشارہ کیا۔ انہوں نے دریافت کیا انہیں سورۃ «والليل إذا يغشى‏» کی قرآت کرتے کس طرح سنا ہے؟ علقمہ نے کہا کہ «والذكر والأنثى‏» ( بغیر خلق کے ) کہا کہ میں گواہی دیتا ہوں کہ میں نے بھی رسول اللہ صلی اللہ علیہ وسلم کو اسی طرح قرآت کرتے ہوئے سنا ہے۔ لیکن یہ لوگ ( یعنی شام والے ) چاہتے ہیں کہ «وما خلق الذكر والأنثى‏» پڑھوں۔ اللہ کی قسم میں ان کی پیروی نہیں کروں گا۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا، کہا مجھ سے میرے والد نے، کہا ہم سے اعمش نے، ان سے ابراہیم نخعی نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، قَالَ قَدِمَ أَصْحَابُ عَبْدِ اللَّهِ عَلَى أَبِي الدَّرْدَاءِ فَطَلَبَهُمْ فَوَجَدَهُمْ فَقَالَ أَيُّكُمْ يَقْرَأُ عَلَى قِرَاءَةِ عَبْدِ اللَّهِ قَالَ كُلُّنَا‏.‏ قَالَ فَأَيُّكُمْ يَحْفَظُ وَأَشَارُوا إِلَى عَلْقَمَةَ‏.‏ قَالَ كَيْفَ سَمِعْتَهُ يَقْرَأُ ‏{‏وَاللَّيْلِ إِذَا يَغْشَى‏}‏‏.‏ قَالَ عَلْقَمَةُ ‏{‏وَالذَّكَرِ وَالأُنْثَى‏}‏‏.‏ قَالَ أَشْهَدُ أَنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ هَكَذَا، وَهَؤُلاَءِ يُرِيدُونِي عَلَى أَنْ أَقْرَأَ ‏{‏وَمَا خَلَقَ الذَّكَرَ وَالأُنْثَى‏}‏ وَاللَّهِ لاَ أُتَابِعُهُمْ‏.‏",
                "headingArabic": "‏{‏وَمَا خَلَقَ الذَّكَرَ وَالأُنْثَى‏}‏",
                "headingUrdu": "\"اس کی قسم جس نے نر اور مادہ کو پیدا کیا۔\" (V.92:3)",
                "headingEnglish": "\"By Him Who created male and female.\" (V.92:3)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4722,
                "hadithNumber": "4945",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "We were in the company of the Prophet (ﷺ) in a funeral procession at Baqi Al-Gharqad. He said, \"There is none of you but has his place written for him in Paradise or in the Hell- Fire.\" They said, \"O Allah's Apostle! Shall we depend (on this fact and give up work)?\" He said, \"Carry on doing (good deeds), for every body will find it easy to do (what will lead him to his destined place).\" Then he recited: 'As for him who gives (in charity) and keeps his duty to Allah, and believes in the Best reward from Allah (i.e. Allah will compensate him for what he will spend in Allah's way). So, We will make smooth for him the path of ease. But he who is a greedy miser....for him, the path for evil.' (92.5-10)\r\nMusaddad narrated from us, Abd al-Wahid narrated from us, Al-Aamish narrated from us, he from Sa’d ibn Ubaydah, he from Abu Abd al-Rahman, `Ali رضی اللہ عنہ said, \"We were sitting with the Prophet,\" (He then mentioned the Hadith above (469).",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ بقیع الغرقد ( مدینہ منورہ کے قبرستان ) میں ایک جنازہ میں تھے۔ نبی کریم صلی اللہ علیہ وسلم نے اس موقع پر فرمایا کہ تم میں کوئی ایسا نہیں جس کا ٹھکانا جنت یا جہنم میں لکھا نہ جا چکا ہو۔ صحابہ نے عرض کیا: یا رسول اللہ! پھر کیوں نہ ہم اپنی تقدیر پر بھروسہ کر لیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ عمل کرتے رہو کہ ہر شخص کو اسی عمل کی توفیق ملتی رہتی ہے ( جس کے لیے وہ پیدا کیا گیا ہے ) پھر آپ صلی اللہ علیہ وسلم نے آیت «فأما من أعطى واتقى * وصدق بالحسنى‏» آخر تک پڑھی۔ یعنی ہم اس کے لیے نیک کام آسان کر دیں گے۔\r\nہم سے مصدّد نے بیان کیا، ہم سے عبد الواحد نے بیان کیا، ہم سے الاعمش نے بیان کیا، وہ سعد بن عبیدہ سے، وہ ابو عبدالرحمٰن سے، وہ علی رضی اللہ عنہ سے۔ - جس نے کہا: ہم بیٹھے ہوئے تھے رسول اللہ صلی اللہ علیہ وسلم نے حدیث ذکر کی۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے اعمش نے، ان سے سعد بن عبیدہ نے، ان سے ابوعبدالرحمٰن سلمی نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي بَقِيعِ الْغَرْقَدِ فِي جَنَازَةٍ فَقَالَ ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَقَدْ كُتِبَ مَقْعَدُهُ مِنَ الْجَنَّةِ وَمَقْعَدُهُ مِنَ النَّارِ ‏\"‏‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ أَفَلاَ نَتَّكِلُ فَقَالَ ‏\"‏ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ ‏\"‏‏.‏ ثُمَّ قَرَأَ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى * وَصَدَّقَ بِالْحُسْنَى‏}‏ إِلَى قَوْلِهِ ‏{‏لِلْعُسْرَى‏}‏.\r\nحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ كُنَّا قُعُودًا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَذَكَرَ الْحَدِيثَ‏.‏",
                "headingArabic": "قَوْلُهُ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى‏}‏",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’جو شخص صدقہ کرتا ہے اور اللہ سے ڈرتا ہے اور اس سے ڈرتا ہے‘‘۔ (V.92:5)",
                "headingEnglish": "The Statement of Allah the Exalted: \"As for him who gives (in charity) and keeps his duty to Allah and fears Him.\" (V.92:5)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4723,
                "hadithNumber": "4946",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "While the Prophet (ﷺ) was in a funeral procession, he took a small stick and started scraping the earth with it and said, \"There is none among you but has his place written for him, either in the Hell Fire or in Paradise.\" They (the people) said, \"Allah's Messenger (ﷺ)! Shall we depend on this (and leave work)?\" He replied. \"Carry on doing (good deeds), for everybody will find easy (to do) such deeds as will lead him to his destined place.\" The Prophet (ﷺ) then recited:-- 'As for him who gives (in charity) and keeps his duty to Allah, and believes in the Best Reward.'.....(92.5-10) Shobah states that Mansour narrated me this Hadith, so I did not reject it by the Hadith of Solaiman.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک جنازہ میں تھے، آپ نے ایک لکڑی اٹھائی اور اس سے زمین کریدتے ہوئے فرمایا کہ تم میں کوئی شخص ایسا نہیں جس کا جنت یا دوزخ کا ٹھکانا لکھا نہ جا چکا ہو۔ صحابہ نے عرض کیا: یا رسول اللہ! کیا پھر ہم اسی پر بھروسہ نہ کر لیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ عمل کرتے رہو کہ ہر شخص کو توفیق دی گئی ہے ( انہیں اعمال کی جن کے لیے وہ پیدا کیا گیا ہے ) «فأما من أعطى واتقى * وصدق بالحسنى‏» ”سو جس نے دیا اور اللہ سے ڈرا اور اچھی بات کو سچا سمجھا“ آخر آیت تک۔ شعبہ نے بیان کیا کہ مجھ سے یہ حدیث منصور بن معتمر نے بھی بیان کی اور انہوں نے بھی سلیمان اعمش سے اسی کے موافق بیان کی، اس میں کوئی خلاف نہیں کیا۔",
                "urduNarrator": "ہم سے بشر بن خالد نے بیان کیا، کہا ہم کو محمد بن جعفر نے خبر دی، کہا ہم سے شعبہ نے بیان کیا، ان سے سلیمان اعمش نے، ان سے سعد بن عبیدہ نے، ان سے ابوعبدالرحمٰن سلمی نے اور ان سے علی رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ أَنَّهُ كَانَ فِي جَنَازَةٍ فَأَخَذَ عُودًا يَنْكُتُ فِي الأَرْضِ فَقَالَ ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَقَدْ كُتِبَ مَقْعَدُهُ مِنَ النَّارِ أَوْ مِنَ الْجَنَّةِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ أَفَلاَ نَتَّكِلُ قَالَ ‏\"‏ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى * وَصَدَّقَ بِالْحُسْنَى‏}‏ الآيَةَ‏.‏ قَالَ شُعْبَةُ وَحَدَّثَنِي بِهِ مَنْصُورٌ فَلَمْ أُنْكِرْهُ مِنْ حَدِيثِ سُلَيْمَانَ‏\"‏‏.‏",
                "headingArabic": "‏{‏فَسَنُيَسِّرُهُ لِلْيُسْرَى‏}‏",
                "headingUrdu": "\"ہم اس کے لیے آسانی کا راستہ ہموار کر دیں گے۔\" (V.92:7)",
                "headingEnglish": "\"We will make smooth for him the path of ease (goodness) .\" (V.92:7)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4724,
                "hadithNumber": "4947",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "We were in the company of the Prophet (ﷺ) and he said, \"There is none among you but has his place written for him, either in Paradise or in the Hell-Fire.\" We said, \"O Allah's Messenger (ﷺ)! Shall we depend (on this fact and give up work)?\" He replied, \"No! Carry on doing good deeds, for everybody will find easy (to do) such deeds as will lead him to his destined place.\" Then the Prophet (ﷺ) recited: 'As for him who gives (in charity) and keeps his duty to Allah, and believes in the Best reward. We will make smooth for him the path of ease....the path for evil.' (92.5-10)",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہم میں کوئی ایسا نہیں جس کا جہنم کا ٹھکانا اور جنت کا ٹھکانا لکھا نہ جا چکا ہو۔ ہم نے عرض کیا: یا رسول اللہ! پھر ہم اسی پر بھروسہ کیوں نہ کر لیں؟ فرمایا نہیں عمل کرتے رہو کیونکہ ہر شخص کو آسانی دی گئی ہے اور اس کے بعد آپ نے اس آیت کی تلاوت کی «فأما من أعطى واتقى * وصدق بالحسنى * فسنيسره لليسرى‏» یعنی ”سو جس نے دیا اور اللہ سے ڈرا اور اچھی بات کو سچا سمجھا اس کے لیے راحت کی چیز آسان کر دیں گے۔“ تا «فسنيسره للعسرى‏» ۔",
                "urduNarrator": "ہم سے یحییٰ بن موسیٰ بلخی نے بیان کیا، کہا ہم سے وکیع نے بیان کیا، ان سے اعمش نے، ان سے سعد بن عبیدہ نے، ان سے ابوعبدالرحمٰن سلمی نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ ـ عَلَيْهِ السَّلاَمُ ـ قَالَ كُنَّا جُلُوسًا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَقَدْ كُتِبَ مَقْعَدُهُ مِنَ الْجَنَّةِ وَمَقْعَدُهُ مِنَ النَّارِ ‏\"‏‏.‏ فَقُلْنَا يَا رَسُولَ اللَّهِ أَفَلاَ نَتَّكِلُ قَالَ ‏\"‏ لاَ، اعْمَلُوا فَكُلٌّ مُيَسَّرٌ ‏\"‏‏.‏ ثُمَّ قَرَأَ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى * وَصَدَّقَ بِالْحُسْنَى * فَسَنُيَسِّرُهُ لِلْيُسْرَى‏}‏ إِلَى قَوْلِهِ ‏{‏فَسَنُيَسِّرُهُ لِلْعُسْرَى‏}‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَأَمَّا مَنْ بَخِلَ وَاسْتَغْنَى‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"مگر وہ جو لالچی بخیل ہے اور اپنے آپ کو خود کفیل سمجھتا ہے۔\" (V.92:8)",
                "headingEnglish": "The Statement of Allah the Most High: \"But he who is [a] greedy miser and thinks himself self-sufficient.\" (V.92:8)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4725,
                "hadithNumber": "4948",
                "englishNarrator": "Narrated `Ali:",
                "hadithEnglish": "While we were in a funeral procession in Baqi Al-Gharqad, Allah's Messenger (ﷺ) came and sat down, and we sat around him. He had a small stick in his hand and he bent his head and started scraping the ground with it. He then said, \"There is none among you, and no created soul but has his place written for him either in Paradise or in the Hell-Fire, and also has his happy or miserable fate (in the Hereafter) written for him.\" A man said, \"O Allah's Messenger (ﷺ)! Shall we depend upon what is written for us and give up doing (good) deeds? For whoever among us is destined to be fortunate (in the Hereafter), will join the fortunate peoples and whoever among us is destined to be miserable will do such deeds as are characteristic of the people who are destined to misery.\" The Prophet (ﷺ) said, \"Those who are destined to be happy (in the Hereafter) will find it easy and pleasant to do the deeds characteristic of those destined to happiness, while those who are to be among the miserable (in the Hereafter), will find it easy to do the deeds characteristic of those destined to misery.\" Then he recited: 'As for him who gives (in charity) and keeps his duty to Allah and believes in the Best reward from Allah,' (92.5-6)",
                "hadithUrdu": "ہم بقیع الغرقد میں ایک جنازہ کے ساتھ تھے۔ پھر رسول اللہ صلی اللہ علیہ وسلم بھی تشریف لائے۔ آپ بیٹھ گئے اور ہم بھی آپ کے چاروں طرف بیٹھ گئے۔ آپ کے ہاتھ میں چھڑی تھی۔ آپ نے سر جھکا لیا پھر چھڑی سے زمین کو کریدنے لگے۔ پھر فرمایا کہ تم میں کوئی شخص ایسا نہیں، کوئی پیدا ہونے والی جان ایسی نہیں جس کا جنت اور جہنم کا ٹھکانا لکھا نہ جا چکا ہو۔ یہ لکھا جا چکا ہے کہ کون نیک ہے اور کون برا ہے۔ ایک صاحب نے عرض کیا: یا رسول اللہ! پھر کیا حرج ہے اگر ہم اپنی اسی تقدیر پر بھروسہ کر لیں اور نیک عمل کرنا چھوڑ دیں جو ہم میں نیک ہو گا، وہ نیکیوں کے ساتھ جا ملے گا اور جو برا ہو گا اس سے بروں کے سے اعمال ہو جائیں گے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جو لوگ نیک ہوتے ہیں انہیں نیکوں ہی کے عمل کی توفیق حاصل ہوتی ہے اور جو برے ہوتے ہیں انہیں بروں ہی جیسے عمل کرنے کی توفیق ہوتی ہے۔ پھر آپ صلی اللہ علیہ وسلم نے اس آیت کی تلاوت کی «فأما من أعطى واتقى * وصدق بالحسنى‏» یعنی ”سو جس نے دیا اور اللہ سے ڈرا اور اچھی بات کو سچا سمجھا سو ہم اس کے لیے نیک کاموں کو آسان کر دیں گے۔“",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا، انہوں نے کہا ہم سے جریر بن عبدالحمید نے بیان کیا، ان سے منصور نے، ان سے سعد بن عبیدہ نے بیان کیا، ان سے ابوعبدالرحمٰن سلمی نے بیان کیا، اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ كُنَّا فِي جَنَازَةٍ فِي بَقِيعِ الْغَرْقَدِ، فَأَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَعَدَ وَقَعَدْنَا حَوْلَهُ، وَمَعَهُ مِخْصَرَةٌ فَنَكَّسَ، فَجَعَلَ يَنْكُتُ بِمِخْصَرَتِهِ ثُمَّ قَالَ ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ وَمَا مِنْ نَفْسٍ مَنْفُوسَةٍ إِلاَّ كُتِبَ مَكَانُهَا مِنَ الْجَنَّةِ وَالنَّارِ، وَإِلاَّ قَدْ كُتِبَتْ شَقِيَّةً أَوْ سَعِيدَةً ‏\"‏‏.‏ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَفَلاَ نَتَّكِلُ عَلَى كِتَابِنَا وَنَدَعُ الْعَمَلَ فَمَنْ كَانَ مِنَّا مِنْ أَهْلِ السَّعَادَةِ فَسَيَصِيرُ إِلَى أَهْلِ السَّعَادَةِ، وَمَنْ كَانَ مِنَّا مِنْ أَهْلِ الشَّقَاءِ فَسَيَصِيرُ إِلَى عَمَلِ أَهْلِ الشَّقَاوَةِ‏.‏ قَالَ ‏\"‏ أَمَّا أَهْلُ السَّعَادَةِ فَيُيَسَّرُونَ لِعَمَلِ أَهْلِ السَّعَادَةِ وَأَمَّا أَهْلُ الشَّقَاوَةِ فَيُيَسَّرُونَ لِعَمَلِ أَهْلِ الشَّقَاءِ ‏\"‏‏.‏ ثُمَّ قَرَأَ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى * وَصَدَّقَ بِالْحُسْنَى‏}‏ الآيَةَ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَكَذَّبَ بِالْحُسْنَى‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان: \"اور الحسنہ کو جھٹلاتا ہے...\" (V.92:9)۔",
                "headingEnglish": "The Statement of Allah the Most High: \"And belies Al-Ḥusnā ...\" (V.92:9).",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4726,
                "hadithNumber": "4949",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "While the Prophet (ﷺ) was in a funeral procession. he picked up something and started scraping the ground with it, and said, \"There is none among you but has his place written for him either in the Hell Fire or in Paradise.\" They said, \"O Allah's Messenger (ﷺ)! Shall we not depend upon what has been written for us and give up deeds? He said, \"Carry on doing (good) deeds, for everybody will find easy to do such deeds as will lead him to his destined place for which he has been created. So he who is destined to be among the happy (in the Hereafter), will find it easy to do the deeds characteristic of such people, while he who is destined to be among the miserable ones, will find it easy to do the deeds characteristic of such people.\" Then he recited: 'As for him who gives (in charity) and fears Allah, and believes in the best....' (92.5-10)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک جنازے میں تشریف رکھتے تھے۔ پھر آپ صلی اللہ علیہ وسلم نے ایک چیز لی اور اس سے زمین کریدنے لگے اور فرمایا، تم میں کوئی ایسا شخص نہیں جس کا جہنم کا ٹھکانا یا جنت کا ٹھکانا لکھا نہ جا چکا ہو۔ صحابہ نے عرض کیا کہ یا رسول اللہ! تو پھر ہم کیوں اپنی تقدیر پر بھروسہ نہ کر لیں اور نیک عمل کرنا چھوڑ دیں۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نیک عمل کرو، ہر شخص کو ان اعمال کی توفیق دی جاتی ہے جن کے لیے وہ پیدا کیا گیا ہے جو شخص نیک ہو گا اسے نیکوں کے عمل کی توفیق ملی ہوتی ہے اور جو بدبخت ہوتا ہے اسے بدبختوں کے عمل کی توفیق ملتی ہے پھر آپ صلی اللہ علیہ وسلم نے آیت «فأما من أعطى واتقى * وصدق بالحسنى‏» آخر تک پڑھی یعنی ”سو جس نے دیا اور اللہ سے ڈرا اور اچھی بات کو سچا سمجھا، سو ہم اس کے لیے نیک عملوں کو آسان کر دیں گے۔“",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے اعمش نے بیان کیا، کہا کہ میں نے سعد بن عبیدہ سے سنا، ان سے ابوعبدالرحمٰن سلمی بیان کرتے تھے کہ علی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ سَعْدَ بْنَ عُبَيْدَةَ، يُحَدِّثُ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم فِي جَنَازَةٍ فَأَخَذَ شَيْئًا فَجَعَلَ يَنْكُتُ بِهِ الأَرْضَ فَقَالَ ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَقَدْ كُتِبَ مَقْعَدُهُ مِنَ النَّارِ وَمَقْعَدُهُ مِنَ الْجَنَّةِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ أَفَلاَ نَتَّكِلُ عَلَى كِتَابِنَا وَنَدَعُ الْعَمَلَ قَالَ ‏\"‏ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ، أَمَّا مَنْ كَانَ مِنْ أَهْلِ السَّعَادَةِ فَيُيَسَّرُ لِعَمَلِ أَهْلِ السَّعَادَةِ، وَأَمَّا مَنْ كَانَ مِنْ أَهْلِ الشَّقَاءِ فَيُيَسَّرُ لِعَمَلِ أَهْلِ الشَّقَاوَةِ ‏\"‏‏.‏ ثُمَّ قَرَأَ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى * وَصَدَّقَ بِالْحُسْنَى‏}‏ الآيَةَ‏.‏",
                "headingArabic": "‏{‏فَسَنُيَسِّرُهُ لِلْعُسْرَى‏}‏",
                "headingUrdu": "\"ہم اس کے لیے برائی کا راستہ ہموار کر دیں گے۔\" (V.92:10)",
                "headingEnglish": "\"We will make smooth for him the path for evil.\" (V.92:10)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4727,
                "hadithNumber": "4950",
                "englishNarrator": "Narrated Jundub bin Sufyan رضی اللہ عنہ :",
                "hadithEnglish": "Once Allah's Messenger (ﷺ) became sick and could not offer his night prayer (Tahajjud) for two or three nights. Then a lady (the wife of Abu Lahab) came and said, \"O Muhammad! I think that your Satan has forsaken you, for I have not seen him with you for two or three nights!\" On that Allah revealed: 'By the fore-noon, and by the night when it darkens, your Lord (O Muhammad) has neither forsaken you, nor hated you.' (93.1-3)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم بیمار پڑ گئے اور دو یا تین راتوں کو ( تہجد کے لیے ) نہیں اٹھ سکے۔ پھر ایک عورت ( ابولہب کی عورت عوراء ) آئی اور کہنے لگی۔ اے محمد! میرا خیال ہے کہ تمہارے شیطان نے تمہیں چھوڑ دیا ہے۔ دو یا تین راتوں سے دیکھ رہی ہوں کہ تمہارے پاس وہ نہیں آیا۔ اس پر اللہ تعالیٰ نے یہ آیت نازل کی «والضحى * والليل إذا سجى * ما ودعك ربك وما قلى‏» آخر تک یعنی ”قسم ہے دن کی روشنی کی اور رات کی جب وہ قرار پکڑے کہ آپ کے پروردگار نے نہ آپ کو چھوڑا ہے اور نہ آپ سے بیزار ہوا ہے۔“",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، کہا ہم سے زہیر نے بیان کیا، ان سے اسود بن قیس نے بیان کیا کہ میں نے جندب بن سفیان رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا الأَسْوَدُ بْنُ قَيْسٍ، قَالَ سَمِعْتُ جُنْدُبَ بْنَ سُفْيَانَ ـ رضى الله عنه ـ قَالَ اشْتَكَى رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمْ يَقُمْ لَيْلَتَيْنِ أَوْ ثَلاَثًا، فَجَاءَتِ امْرَأَةٌ فَقَالَتْ يَا مُحَمَّدُ إِنِّي لأَرْجُو أَنْ يَكُونَ شَيْطَانُكَ قَدْ تَرَكَكَ، لَمْ أَرَهُ قَرِبَكَ مُنْذُ لَيْلَتَيْنِ أَوْ ثَلاَثًا‏.‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏وَالضُّحَى * وَاللَّيْلِ إِذَا سَجَى * مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَى‏}‏",
                "headingArabic": "قَوْلُهُ ‏{‏مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَى‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’تمہارے رب (اے محمد صلی اللہ علیہ وسلم) نے نہ تو تمہیں چھوڑا ہے اور نہ ہی تم سے نفرت کی۔ (V.93:3)",
                "headingEnglish": "The Statement of Allah the Most High: \"Your Lord (O Muḥammad pbuh) has neither forsaken you nor hates you.\" (V.93:3)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4701,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=188",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=186",
                "label": "186",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=187",
                "label": "187",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=188",
                "label": "188",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=189",
                "label": "189",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=190",
                "label": "190",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=191",
                "label": "191",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=192",
                "label": "192",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=190",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=190",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=188",
        "to": 4725,
        "total": 40465
    }
}