{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 234,
        "data": [
            {
                "id": 5828,
                "hadithNumber": "6083",
                "englishNarrator": "Narrated `Asim رضی اللہ عنہ :",
                "hadithEnglish": "I said to Anas bin Malik رضی اللہ عنہ , \"Did it reach you that the Prophet (ﷺ) said, \"There is no treaty of brotherhood in Islam'?\" Anas said, \"The Prophet (ﷺ) made a treaty (of brotherhood) between the Ansar and the Quraish in my home.\"",
                "hadithUrdu": "میں نے حضرت انس بن مالک رضی اللہ عنہ سے پوچھا ، کیا تم کو یہ بات معلوم ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسلام میں معاہدہ ( حلف ) کی کوئی اصل نہیں ؟ انس رضی اللہ عنہ نے فرمایا کہ آنحضور صلی اللہ علیہ وسلم نے خود قریش اور انصار کے درمیان میرے گھر میں حلف کرائی تھی ۔",
                "urduNarrator": "ہم سے محمد بن صباح نے بیان کیا ، کہا ہم سے اسماعیل بن زکریا نے بیان کیا ، کہا ہم سے عاصم بن سلیمان احول نے بیان کیا ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ صَبَّاحٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا عَاصِمٌ، قَالَ قُلْتُ لأَنَسِ بْنِ مَالِكٍ أَبَلَغَكَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ حِلْفَ فِي الإِسْلاَمِ ‏\"‏‏.‏ فَقَالَ قَدْ حَالَفَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ قُرَيْشٍ وَالأَنْصَارِ فِي دَارِي‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5829,
                "hadithNumber": "6084",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Rifa`a Al-Qurazi divorced his wife irrevocably (i.e. that divorce was the final). Later on `Abdur- Rahman bin Az-Zubair رضی اللہ عنہما married her after him. She came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I was Rifa`a's wife and he divorced me thrice, and then I was married to `Abdur-Rahman bin AzZubair رضی اللہ عنہما , who, by Allah has nothing with him except something like this fringe, O Allah's Messenger (ﷺ),\" showing a fringe she had taken from her covering sheet. Abu Bakr رضی اللہ عنہ was sitting with the Prophet (ﷺ) while Khalid Ibn Sa`id bin Al-As was sitting at the gate of the room waiting for admission. Khalid started calling Abu Bakr, \"O Abu Bakr! Why don't you reprove this lady from what she is openly saying before Allah's Apostle?\" Allah's Messenger (ﷺ) did nothing except smiling, and then said (to the lady), \"Perhaps you want to go back to Rifa`a? No, (it is not possible), unless and until you enjoy the sexual relation with him (`Abdur Rahman), and he enjoys the sexual relation with you.\"",
                "hadithUrdu": "رفاعہ قرظی نے اپنی بیوی کو طلاق دے دی اور طلاق رجعی نہیں دی ۔ اس کے بعد ان سے عبدالرحمٰن بن زبیر رضی اللہ عنہما نے نکاح کر لیا ، لیکن وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کیا ، یا رسول اللہ ! میں رفاعہ رضی اللہ عنہ کے نکاح میں تھی لیکن انہوں نے مجھے تین طلاقیں دے دیں ۔ پھر مجھ سے عبدالرحمٰن بن زبیر رضی اللہ عنہما نے نکاح کر لیا ، لیکن اللہ کی قسم ان کے پاس تو پلو کی طرح کے سوا اور کچھ نہیں ۔ ( مراد یہ کہ وہ نامرد ہیں ) اور انہوں نے اپنے چادر کا پلو پکڑ کر بتایا ( راوی نے بیان کیا کہ ) حضرت ابوبکر رضی اللہ عنہ آنحضرت صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے اور سعید بن العاص کے لڑکے خالد حجرہ کے دروازے پر تھے اور اندر داخل ہونے کی اجازت کے منتظر تھے ۔ خالد بن سعید اس پر حضرت ابوبکر رضی اللہ عنہ کو آواز دے کر کہنے لگے کہ آپ اس عورت کو ڈانتے نہیں کہ آنحضرت صلی اللہ علیہ وسلم کے سامنے کس طرح کی بات کہتی ہے اور حضور اکرم صلی اللہ علیہ وسلم نے تبسم کے سوا اور کچھ نہیں فرمایا ۔ پھر فرمایا غالباً تم رفاعہ کے پاس دوبارہ جانا چاہتی ہو لیکن یہ اس وقت تک ممکن نہیں ہے جب تک تم ان کا ( عبدالرحمٰن رضی اللہ عنہ کا ) مزا نہ چکھ لو اور وہ تمہارا مزہ نہ چکھ لیں ۔",
                "urduNarrator": "ہم سے حبان بن موسیٰ نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں عروہ نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا حِبَّانُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رِفَاعَةَ، الْقُرَظِيَّ طَلَّقَ امْرَأَتَهُ فَبَتَّ طَلاَقَهَا، فَتَزَوَّجَهَا بَعْدَهُ عَبْدُ الرَّحْمَنِ بْنُ الزَّبِيرِ، فَجَاءَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّهَا كَانَتْ عِنْدَ رِفَاعَةَ فَطَلَّقَهَا آخِرَ ثَلاَثِ تَطْلِيقَاتٍ، فَتَزَوَّجَهَا بَعْدَهُ عَبْدُ الرَّحْمَنِ بْنُ الزَّبِيرِ، وَإِنَّهُ وَاللَّهِ مَا مَعَهُ يَا رَسُولَ اللَّهِ إِلاَّ مِثْلُ هَذِهِ الْهُدْبَةِ، لِهُدْبَةٍ أَخَذَتْهَا مِنْ جِلْبَابِهَا‏.‏ قَالَ وَأَبُو بَكْرٍ جَالِسٌ عِنْدَ النَّبِيِّ صلى الله عليه وسلم وَابْنُ سَعِيدِ بْنِ الْعَاصِ جَالِسٌ بِبَابِ الْحُجْرَةِ لِيُؤْذَنَ لَهُ، فَطَفِقَ خَالِدٌ يُنَادِي أَبَا بَكْرٍ، يَا أَبَا بَكْرٍ أَلاَ تَزْجُرُ هَذِهِ عَمَّا تَجْهَرُ بِهِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَمَا يَزِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى التَّبَسُّمِ ثُمَّ قَالَ ‏ \"‏ لَعَلَّكِ تُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ، لاَ، حَتَّى تَذُوقِي عُسَيْلَتَهُ، وَيَذُوقَ عُسَيْلَتَكِ ‏\"‏‏.‏",
                "headingArabic": "التَّبَسُّمِ وَالضَّحِكِ",
                "headingUrdu": "مسکرانا اور ہنسنا",
                "headingEnglish": "Smiling and laughing",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5830,
                "hadithNumber": "6085",
                "englishNarrator": "Narrated Sa`d:",
                "hadithEnglish": "`Umar bin Al-Khattab رضی اللہ عنہ asked permission of Allah's Messenger (ﷺ) to see him while some Quraishi women were sitting with him and they were asking him to give them more financial support while raising their voices over the voice of the Prophet. When `Umar asked permission to enter, all of them hurried to screen themselves the Prophet (ﷺ) admitted `Umar رضی اللہ عنہ and he entered, while the Prophet (ﷺ) was smiling. `Umar رضی اللہ عنہ said, \"May Allah always keep you smiling, O Allah's Messenger (ﷺ)! Let my father and mother be sacrificed for you !\" The Prophet (ﷺ) said, \"I am astonished at these women who were with me. As soon as they heard your voice, they hastened to screen themselves.\" `Umar رضی اللہ عنہ said, \"You have more right, that they should be afraid of you, O Allah's Messenger (ﷺ)!\" And then he (`Umar رضی اللہ عنہ) turned towards them and said, \"O enemies of your souls! You are afraid of me and not of Allah's Messenger (ﷺ)?\" The women replied, \"Yes, for you are sterner and harsher than Allah's Messenger (ﷺ).\" Allah's Messenger (ﷺ) said, \"O Ibn Al-Khattab! By Him in Whose Hands my life is, whenever Satan sees you taking a way, he follows a way other than yours!\"",
                "hadithUrdu": "حضرت عمر بن خطاب رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہونے کی اجازت چاہی ۔ اس وقت آنحضرت صلی اللہ علیہ وسلم کے پاس آپ کی کئی بیویاں جو قریش سے تعلق رکھتی تھیں آپ سے خرچ دینے کے لیے تقاضا کر رہی تھیں اور اونچی آواز میں باتیں کر رہی تھیں ۔ جب حضرت عمر رضی اللہ عنہ نے اجازت چاہی تو وہ جلدی سے بھاگ کر پردے کے پیچھے چلی گئیں ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے ان کو اجازت دی اور وہ داخل ہوئے ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت ہنس رہے تھے ۔ حضرت عمر رضی اللہ عنہ نے عرض کیا اللہ آپ کو خوش رکھے ، یا رسول اللہ ! میرے ماں باپ آپ پر قربان ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ان پر مجھے حیرت ہوئی ، جو ابھی میرے پاس تقاضا کر رہی تھیں ، جب انہوں نے تمہاری آواز سنی تو فوراً بھاگ کر پردے کے پیچھے چلی گئیں ۔ حضرت عمر رضی اللہ عنہ نے اس پر عرض کیا ، یا رسول اللہ ! آپ اس کے زیادہ مستحق ہیں کہ آپ سے ڈرا جائے ، پھر عورتوں کو مخاطب کر کے انہوں نے کہا ، اپنی جانوں کی دشمن ! مجھ سے تو تم ڈرتی ہو او اللہ کے رسول صلی اللہ علیہ وسلم سے نہیں ڈرتیں ۔ انہوں نے عرض کیا آپ رضی اللہ عنہ آنحضرت صلی اللہ علیہ وسلم سے زیادہ سخت ہیں ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا ہاں اے ابن خطاب ! اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ، اگر شیطان بھی تمہیں راستے پر آتا ہوا دیکھے گا تو تمہارا راستہ چھوڑ کر دوسرے راستے پر چلا جائے گا ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، کہا ہم سے ابراہیم نے بیان کیا ، ان سے صالح بن کیسان نے ، ان سے ابن شہاب نے ، ان سے عبدالحمید بن عبدالرحمٰن بن زید بن خطاب نے ، ان سے محمد بن سعد نے اور ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا إِبْرَاهِيمُ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ، عَنْ مُحَمَّدِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ اسْتَأْذَنَ عُمَرُ بْنُ الْخَطَّابِ ـ رضى الله عنه ـ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَعِنْدَهُ نِسْوَةٌ مِنْ قُرَيْشٍ يَسْأَلْنَهُ وَيَسْتَكْثِرْنَهُ، عَالِيَةً أَصْوَاتُهُنَّ عَلَى صَوْتِهِ، فَلَمَّا اسْتَأْذَنَ عُمَرُ تَبَادَرْنَ الْحِجَابَ، فَأَذِنَ لَهُ النَّبِيُّ صلى الله عليه وسلم فَدَخَلَ وَالنَّبِيُّ صلى الله عليه وسلم يَضْحَكُ فَقَالَ أَضْحَكَ اللَّهُ سِنَّكَ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي فَقَالَ ‏\"‏ عَجِبْتُ مِنْ هَؤُلاَءِ اللاَّتِي كُنَّ عِنْدِي، لَمَّا سَمِعْنَ صَوْتَكَ تَبَادَرْنَ الْحِجَابَ ‏\"‏‏.‏ فَقَالَ أَنْتَ أَحَقُّ أَنْ يَهَبْنَ يَا رَسُولَ اللَّهِ‏.‏ ثُمَّ أَقْبَلَ عَلَيْهِنَّ فَقَالَ يَا عَدُوَّاتِ أَنْفُسِهِنَّ أَتَهَبْنَنِي وَلَمْ تَهَبْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْنَ إِنَّكَ أَفَظُّ وَأَغْلَظُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِيهٍ يَا ابْنَ الْخَطَّابِ، وَالَّذِي نَفْسِي بِيَدِهِ مَا لَقِيَكَ الشَّيْطَانُ سَالِكًا فَجًّا إِلاَّ سَلَكَ فَجًّا غَيْرَ فَجِّكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5831,
                "hadithNumber": "6086",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When Allah Apostle was in Ta'if (trying to conquer it), he said to his companions, \"Tomorrow we will return (to Medina), if Allah wills.\" Some of the companions of Allah's Messenger (ﷺ) said, \"We will not leave till we conquer it.\" The Prophet (ﷺ) said, \"Therefore, be ready to fight tomorrow.\" On the following day, they (Muslims) fought fiercely (with the people of Ta'if) and suffered many wounds. Then Allah's Messenger (ﷺ) said, \"Tomorrow we will return (to Medina), if Allah wills.\" His companions kept quiet this time. Allah's Messenger (ﷺ) then smiled. Humaidi states that Sufyan bin Oyainah narrated us this complete Hadith.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم طائف میں تھے ( فتح مکہ کے بعد ) تو آپ نے فرمایا کہ اگر اللہ نے چاہا تو ہم یہاں سے کل واپس ہوں گے ۔ آپ کے بعض صحابہ نے کہا کہ ہم اس وقت تک نہیں جائیں گے جب تک اسے فتح نہ کر لیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اگر یہی بات ہے تو کل صبح لڑائی کرو ۔ بیان کیا کہ دوسرے دن صبح کو صحابہ نے گھمسان کی لڑائی لڑی اور بکثرت صحابہ زخمی ہوئے ۔ آنحضرت صلی اللہ علیہ سلم نے فرمایا کہ انشاءاللہ ہم کل واپس ہوں گے ، بیان کیا کہ اب سب لوگ خاموش رہے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم ہنس پڑے ۔ حمیدی نے بیان کیا کہ ہم سے سفیان نے پوری سند خبر کے لفظ کے ساتھ بیان کی ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے ابو العباس سائب نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ أَبِي الْعَبَّاسِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ لَمَّا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالطَّائِفِ قَالَ ‏\"‏ إِنَّا قَافِلُونَ غَدًا إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ فَقَالَ نَاسٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ نَبْرَحُ أَوْ نَفْتَحَهَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَاغْدُوا عَلَى الْقِتَالِ ‏\"‏‏.‏ قَالَ فَغَدَوْا فَقَاتَلُوهُمْ قِتَالاً شَدِيدًا وَكَثُرَ فِيهِمُ الْجِرَاحَاتُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّا قَافِلُونَ غَدًا إِنْ شَاءَ اللَّهُ ‏\"‏‏.‏ قَالَ فَسَكَتُوا فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ الْحُمَيْدِيُّ حَدَّثَنَا سُفْيَانُ بِالْخَبَرِ‏ كُلَّهُ.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5832,
                "hadithNumber": "6087",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "A man came to the Prophet (ﷺ) and said, \"I have been ruined for I have had sexual relation with my wife in Ramadan (while I was fasting)\" The Prophet (ﷺ) said (to him), \"Manumit a slave.\" The man said, \" I cannot afford that.\" The Prophet (ﷺ) said, \"(Then) fast for two successive months continuously\". The man said, \"I cannot do that.\" The Prophet (ﷺ) said, \"(Then) feed sixty poor persons.\" The man said, \"I have nothing (to feed them with).\" Then a big basket full of dates was brought to the Prophet. The Prophet (ﷺ) said, \"Where is the questioner? Go and give this in charity.\" The man said, \"(Shall I give this in charity) to a poorer person than l? By Allah, there is no family in between these two mountains (of Medina) who are poorer than we.\" The Prophet (ﷺ) then smiled till his premolar teeth became visible, and said, \"Then (feed) your (family with it).",
                "hadithUrdu": "ایک صاحب رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا میں تو تباہ ہو گیا اپنی بیوی کے ساتھ رمضان میں ( روزہ کی حالت میں ) ہمبستری کر لی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر ایک غلام آزاد کر ۔ انہوں نے عرض کیا میرے پاس کوئی غلام نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر دو مہینے کے روزے رکھ ۔ انہوں نے عرض کیا اس کی مجھ میں طاقت نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر ساٹھ مسکینوں کو کھانا کھلا ۔ انہوں نے عرض کیا کہ اتنا بھی میرے پاس نہیں ہے ۔ بیان کیا کہ پھر کھجور کا ایک ٹوکرا لایا گیا ۔ ابراہیم نے بیان کیا کہ ” عرق “ ایک طرح کا ( نو کلوگرام کا ) ایک پیمانہ تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، پوچھنے والا کہاں ہے ؟ لو اسے صدقہ کر دینا ۔ انہوں نے عرض کی مجھ سے جو زیادہ محتاج ہو اسے دوں ؟ اللہ کی قسم مدینہ کے دونوں میدانوں کے درمیان کوئی گھرانہ بھی ہم سے زیادہ محتاج نہیں ہے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم ہنس دیئے اور آپ کے سامنے کے دندان مبارک کھل گئے ، اس کے بعد فرمایا ، اچھا پھر تو تم میاں بیوی ہی اسے کھا لو ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، کہا ہم کو ابن شہاب نے خبر دی ، انہیں حمید بن عبدالرحمٰن نے ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا إِبْرَاهِيمُ، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ أَتَى رَجُلٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَ هَلَكْتُ وَقَعْتُ عَلَى أَهْلِي فِي رَمَضَانَ‏.‏ قَالَ ‏\"‏ أَعْتِقْ رَقَبَةً ‏\"‏‏.‏ قَالَ لَيْسَ لِي‏.‏ قَالَ ‏\"‏ فَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ ‏\"‏‏.‏ قَالَ لاَ أَسْتَطِيعُ‏.‏ قَالَ ‏\"‏ فَأَطْعِمْ سِتِّينَ مِسْكِينًا ‏\"‏‏.‏ قَالَ لاَ أَجِدُ‏.‏ فَأُتِيَ بِعَرَقٍ فِيهِ تَمْرٌ ـ قَالَ إِبْرَاهِيمُ الْعَرَقُ الْمِكْتَلُ فَقَالَ ‏\"‏ أَيْنَ السَّائِلُ تَصَدَّقْ بِهَا ‏\"‏‏.‏ قَالَ عَلَى أَفْقَرَ مِنِّي وَاللَّهِ مَا بَيْنَ لاَبَتَيْهَا أَهْلُ بَيْتٍ أَفْقَرُ مِنَّا‏.‏ فَضَحِكَ النَّبِيُّ صلى الله عليه وسلم حَتَّى بَدَتْ نَوَاجِذُهُ‏.‏ قَالَ ‏\"‏ فَأَنْتُمْ إِذًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5833,
                "hadithNumber": "6088",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "While I was going along with Allah's Messenger (ﷺ) who was wearing a Najrani Burd (sheet) with a thick border, a bedouin overtook the Prophet (ﷺ) and pulled his Rida' (sheet) forcibly. I looked at the side of the shoulder of the Prophet (ﷺ) and noticed that the edge of the Rida' had left a mark on it because of the violence of his pull. The bedouin said, \"O Muhammad! Order for me some of Allah's property which you have.\" The Prophet (ﷺ) turned towards him, (smiled) and ordered that he be given something.",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چل رہا تھا ۔ آپ کے جسم پر ایک نجرانی چادر تھی ، جس کا حاشیہ موٹاتھا ۔ اتنے میں ایک دیہاتی آپ کے پاس آیا اور اس نے آپ کی چادر بڑے زور سے کھینچی ۔ حضرت انس رضی اللہ عنہ نے بیان کیا کہ میں نے آنحضرت صلی اللہ علیہ وسلم کے شانے کو دیکھا کہ زور سے کھینچنے کی وجہ سے ، اس پر نشان پڑ گئے ۔ پھر اس نے کہا اے محمد ! اللہ کا جو مال آپ کے پاس ہے اس میں سے مجھے دیئے جانے کا حکم فرما یئے ۔ اس وقت میں نے آنحضرت صلی اللہ علیہ وسلم کو مڑ کر دیکھا تو آپ مسکرادیئے پھر آپ نے اسے دیئے جانے کا حکم فرمایا ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، کہا ہم سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے اسحاق بن عبداللہ ابن ابی طلحہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الأُوَيْسِيُّ، حَدَّثَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنْتُ أَمْشِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَعَلَيْهِ بُرْدٌ نَجْرَانِيٌّ غَلِيظُ الْحَاشِيَةِ، فَأَدْرَكَهُ أَعْرَابِيٌّ فَجَبَذَ بِرِدَائِهِ جَبْذَةً شَدِيدَةً ـ قَالَ أَنَسٌ فَنَظَرْتُ إِلَى صَفْحَةِ عَاتِقِ النَّبِيِّ صلى الله عليه وسلم وَقَدْ أَثَّرَتْ بِهَا حَاشِيَةُ الرِّدَاءِ مِنْ شِدَّةِ جَبْذَتِهِ ـ ثُمَّ قَالَ يَا مُحَمَّدُ مُرْ لِي مِنْ مَالِ اللَّهِ الَّذِي عِنْدَكَ‏.‏ فَالْتَفَتَ إِلَيْهِ فَضَحِكَ، ثُمَّ أَمَرَ لَهُ بِعَطَاءٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5834,
                "hadithNumber": "6089, 6090",
                "englishNarrator": "Narrated Jarir رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) did not screen himself from me (had never prevented me from entering upon him) since I embraced Islam, and whenever he saw me, he would receive me with a smile. Once I told him that I could not sit firm on horses. He stroked me on the chest with his hand, and said, \"O Allah! Make him firm and make him a guiding and a rightly guided man.",
                "hadithUrdu": "جب سے میں نے اسلام قبول کیا آنحضرت صلی اللہ علیہ وسلم نے ( اپنے پاس آنے سے ) کبھی نہیں روکا اور جب بھی آپ نے مجھے دیکھا تو مسکرائے ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے شکایت کی کہ میں گھوڑے پر جم کر نہیں بیٹھ پاتا تو آنحضرت صلی اللہ علیہ وسلم نے اپنا ہاتھ میرے سینے پر مارا اور دعا کی کہ اے اللہ ! اسے ثبات فرمایا اسے ہدایت کرنے والا اور خود ہدایت پایا ہوا بنا ۔",
                "urduNarrator": "ہم سے ابن نمیر نے بیان کیا ، کہا ہم سے ابن ادریس نے بیان کیا ، ان سے اسماعیل نے ، ان سے قیس نے اور ان سے حضرت جریر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ، قَالَ مَا حَجَبَنِي النَّبِيُّ صلى الله عليه وسلم مُنْذُ أَسْلَمْتُ، وَلاَ رَآنِي إِلاَّ تَبَسَّمَ فِي وَجْهِي‏.\r\nوَلَقَدْ شَكَوْتُ إِلَيْهِ أَنِّي لاَ أَثْبُتُ عَلَى الْخَيْلِ، فَضَرَبَ بِيَدِهِ فِي صَدْرِي وَقَالَ ‏ \"‏ اللَّهُمَّ ثَبِّتْهُ وَاجْعَلْهُ هَادِيًا مَهْدِيًّا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5835,
                "hadithNumber": "6091",
                "englishNarrator": "Narrated Um Salama رضی اللہ عنہا :",
                "hadithEnglish": "Um Sulaim رضی اللہ عنہا said, \"O Allah's Messenger (ﷺ)! Verily Allah is not shy of (telling you) the truth. Is it essential for a woman to take a bath after she had a wet dream (nocturnal sexual discharge)?\" He said, \"Yes, if she notices discharge. On that Um Salama رضی اللہ عنہا laughed and said, \"Does a woman get a (nocturnal sexual) discharge?\" He said, \"How then does (her) son resemble her (his mother)?\"",
                "hadithUrdu": "ام سلیم رضی اللہ عنہا نے عرض کیا یا رسول اللہ ! اللہ حق سے نہیں شرماتا ، کیا عورت کو جب احتلام ہو تو اس پر غسل واجب ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں جب عورت پانی دیکھے ( تو اس پر غسل واجب ہے ) اس پر ام سلمہ رضی اللہ عنہا ہنسیں اور عرض کیا ، کیا عورت کو بھی احتلام ہوتا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر بچہ کی صورت ماں سے کیوں ملتی ہے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، انہیں ان کے والد نے خبر دی ، انہیں زینب بنت ام سلمہ رضی اللہ عنہما نے ، انہیں ام سلمہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّ أُمَّ سُلَيْمٍ، قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ لاَ يَسْتَحِي مِنَ الْحَقِّ، هَلْ عَلَى الْمَرْأَةِ غُسْلٌ إِذَا احْتَلَمَتْ قَالَ ‏\"‏ نَعَمْ إِذَا رَأَتِ الْمَاءَ ‏\"‏‏.‏ فَضَحِكَتْ أُمُّ سَلَمَةَ فَقَالَتْ أَتَحْتَلِمُ الْمَرْأَةُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَبِمَ شَبَهُ الْوَلَدِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5836,
                "hadithNumber": "6092",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I never saw the Prophet (ﷺ) laughing to an extent that one could see his palate, but he always used to smile only.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ کو اس طرح کھل کر کبھی ہنستے نہیں دیکھا کہ آپ کے حلق کاکوا نظر آنے لگتا ہو ، آپ صرف مسکراتے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابن وہب نے بیان کیا ، انہوں نے کہا ہم کو عمرو نے خبر دی ، ان سے ابوالنضر نے بیان کیا ، ان سے سلیمان بن یسار نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، أَخْبَرَنَا عَمْرٌو، أَنَّ أَبَا النَّضْرِ، حَدَّثَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ مَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم مُسْتَجْمِعًا قَطُّ ضَاحِكًا حَتَّى أَرَى مِنْهُ لَهَوَاتِهِ، إِنَّمَا كَانَ يَتَبَسَّمُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5837,
                "hadithNumber": "6093",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "A man came to the Prophet (ﷺ) on a Friday while he (the Prophet) was delivering a sermon at Medina, and said, \"There is lack of rain, so please invoke your Lord to bless us with the rain.\" The Prophet (ﷺ) looked at the sky when no cloud could be detected. Then he invoked Allah for rain. Clouds started gathering together and it rained till the Medina valleys started flowing with water. It continued raining till the next Friday. Then that man (or some other man) stood up while the Prophet (ﷺ) was delivering the Friday sermon, and said, \"We are drowned; Please invoke your Lord to withhold it (rain) from us\" The Prophet smiled and said twice or thrice, \"O Allah! Please let it rain round about us and not upon us.\" The clouds started dispersing over Medina to the right and to the left, and it rained round about Medina and not upon Medina. Allah showed them (the people) the miracle of His Prophet and His response to his invocation.",
                "hadithUrdu": "ایک صاحب جمعہ کے دن نبی کریم صلی اللہ علیہ وسلم کے پاس آئے آنحضرت صلی اللہ علیہ وسلم اس وقت مدینہ میں جمعہ کا خطبہ دے رہے تھے ، انہوں نے عرض کیا بارش کا قحط پڑ گیا ہے ، آپ اپنے رب سے بارش کی دعا کیجئے ۔ آنحضرت صلی اللہ علیہ وسلم نے آسمان کی طرف دیکھا کہیں ہمیں بادل نظر نہیں آ رہا تھا ۔ پھر آپ نے بارش کی دعا کی ، اتنے میں بادل اٹھا اور بعض ٹکڑے بعض کی طرف بڑھے اور بارش ہونے لگی ، یہاں تک کہ مدینہ کے نالے بہنے لگے ۔ اگلے جمعہ تک اسی طرح بارش ہوتی رہی سلسلہ ٹوٹتا ہی نہ تھا چنانچہ وہی صاحب یا کوئی دوسرے ( اگلے جمعہ کو ) کھڑے ہوئے ، آنحضرت صلی اللہ علیہ وسلم خطبہ دے رہے تھے اور انہوں نے عرض کیا ہم ڈوب گئے ، اپنے رب سے دعا کریں کہ اب بارش بند کر دے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اے اللہ ! ہمارے چاروں طرف بارش ہو ، ہم پر نہ ہو ۔ دو یا تین مرتبہ آپ نے یہ فرمایا ، چنانچہ مدینہ منورہ سے بادل چھٹنے لگے ، بائیں اور دائیں ، ہمارے چاروں طرف دوسرے مقامات پر بارش ہونے لگی اور ہمارے یہاں بارش یکدم بند ہو گئی ۔ یہ اللہ نے لوگوں کو آنحضرت صلی اللہ علیہ وسلم کا معجزہ اور اپنے پیغمبر صلی اللہ علیہ وسلم کی کرامت اور دعا کی قبولیت بتلائی ۔",
                "urduNarrator": "ہم سے محمد بن محبوب نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے ( دوسری سند ) اور مجھ سے خلیفہ نے بیان کیا ، کہا ہم کو یزید بن زریع نے بیان کیا ، ان سے سعید نے بیان کیا ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ،‏.‏ وَقَالَ لِي خَلِيفَةُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه أَنَّ رَجُلاً، جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم يَوْمَ الْجُمُعَةِ وَهْوَ يَخْطُبُ بِالْمَدِينَةِ فَقَالَ قَحَطَ الْمَطَرُ فَاسْتَسْقِ رَبَّكَ، فَنَظَرَ إِلَى السَّمَاءِ وَمَا نَرَى مِنْ سَحَابٍ، فَاسْتَسْقَى فَنَشَأَ السَّحَابُ بَعْضُهُ إِلَى بَعْضٍ، ثُمَّ مُطِرُوا حَتَّى سَالَتْ مَثَاعِبُ الْمَدِينَةِ، فَمَا زَالَتْ إِلَى الْجُمُعَةِ الْمُقْبِلَةِ مَا تُقْلِعُ، ثُمَّ قَامَ ذَلِكَ الرَّجُلُ أَوْ غَيْرُهُ وَالنَّبِيُّ صلى الله عليه وسلم يَخْطُبُ فَقَالَ غَرِقْنَا فَادْعُ رَبَّكَ يَحْبِسْهَا عَنَّا‏.‏ فَضَحِكَ ثُمَّ قَالَ ‏ \"‏ اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا ‏\"‏‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا‏.‏ فَجَعَلَ السَّحَابُ يَتَصَدَّعُ عَنِ الْمَدِينَةِ يَمِينًا وَشِمَالاً، يُمْطَرُ مَا حَوَالَيْنَا، وَلاَ يُمْطِرُ مِنْهَا شَىْءٌ، يُرِيهِمُ اللَّهُ كَرَامَةَ نَبِيِّهِ صلى الله عليه وسلم وَإِجَابَةَ دَعْوَتِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5838,
                "hadithNumber": "6094",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Truthfulness leads to righteousness, and righteousness leads to Paradise. And a man keeps on telling the truth until he becomes a truthful person. Falsehood leads to Al-Fajur (i.e. wickedness, evil-doing), and Al-Fajur (wickedness) leads to the (Hell) Fire, and a man may keep on telling lies till he is written before Allah, a liar.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، بلاشبہ سچ آدمی کو نیکی کی طرف بلاتا ہے اور نیکی جنت کی طرف لے جاتی ہے اور ایک شخص سچ بولتا رہتا ہے یہاں تک کہ وہ صدیق کالقب اور مرتبہ حاصل کر لیتا ہے اور بلاشبہ جھوٹ برائی کی طرف لے جاتا ہے اور برائی جہنم کی طرف اور ایک شخص جھوٹ بولتا رہتا ہے ، یہان تک کہ وہ اللہ کے یہاں بہت جھوٹا لکھ دیا جاتا ہے ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، انہوں نے کہا ہم سے جریر نے بیان کیا ، ان سے منصور نے بیان کیا ، ان سے ابووائل نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الصِّدْقَ يَهْدِي إِلَى الْبِرِّ، وَإِنَّ الْبِرَّ يَهْدِي إِلَى الْجَنَّةِ، وَإِنَّ الرَّجُلَ لَيَصْدُقُ حَتَّى يَكُونَ صِدِّيقًا، وَإِنَّ الْكَذِبَ يَهْدِي إِلَى الْفُجُورِ، وَإِنَّ الْفُجُورَ يَهْدِي إِلَى النَّارِ، وَإِنَّ الرَّجُلَ لَيَكْذِبُ، حَتَّى يُكْتَبَ عِنْدَ اللَّهِ كَذَّابًا ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ} وَمَا يُنْهَى عَنِ الْكَذِبِ",
                "headingUrdu": "\"اے ایمان والو اللہ سے ڈرو اور سچوں کے ساتھ رہو\"",
                "headingEnglish": "\"O you who believe! Be afraid of Allah, and be with those who are true\"",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5839,
                "hadithNumber": "6095",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The signs of a hypocrite are three: Whenever he speaks, he tells a lie; and whenever he promises, he breaks his promise; and whenever he is entrusted, he betrays (proves to be dishonest)\".",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا منافق کی تین نشانیاں ہیں ، جب بولتا ہے جھوٹ بولتا ہے ، جب وعدہ کرتا ہے  تو وعدہ خلافی کرتا ہے اور جب اسے امین بنایا جاتا ہے تو خیانت کرتا ہے ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے ابی سہیل نافع بن مالک بن ابی عامر نے ، ان سے ان کے والد مالک بن ابی عامر نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ سَلاَمٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ أَبِي سُهَيْلٍ، نَافِعِ بْنِ مَالِكِ بْنِ أَبِي عَامِرٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ آيَةُ الْمُنَافِقِ ثَلاَثٌ إِذَا حَدَّثَ كَذَبَ، وَإِذَا وَعَدَ أَخْلَفَ، وَإِذَا اؤْتُمِنَ خَانَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5840,
                "hadithNumber": "6096",
                "englishNarrator": "Narrated Samura bin Jundub رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I saw (in a dream), two men came to me.\" Then the Prophet (ﷺ) narrated the story (saying), \"They said, 'The person, the one whose cheek you saw being torn away (from the mouth to the ear) was a liar and used to tell lies and the people would report those lies on his authority till they spread all over the world. So he will be punished like that till the Day of Resurrection.\"'",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میرے پاس گذشتہ رات خواب میں دو آدمی آئے انہوں نے کہا کہ جسے آپ نے دیکھا کہ اس کا جبڑا چیرا جا رہا تھا وہ بڑا ہی جھوٹا تھا ، جو ایک بات کو لیتا اور ساری دنیا میں پھیلا دیتا تھا ، قیامت تک اس کو یہی سزا ملتی رہے گی ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے جریر نے بیان کیا ، انہوں نے کہا ہم سے ابو رجاء نے بیان کیا ، ان سے سمرہ بن جندب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جَرِيرٌ، حَدَّثَنَا أَبُو رَجَاءٍ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ رَأَيْتُ رَجُلَيْنِ أَتَيَانِي قَالاَ الَّذِي رَأَيْتَهُ يُشَقُّ شِدْقُهُ فَكَذَّابٌ يَكْذِبُ بِالْكَذْبَةِ تُحْمَلُ عَنْهُ حَتَّى تَبْلُغَ الآفَاقَ فَيُصْنَعُ بِهِ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5841,
                "hadithNumber": "6097",
                "englishNarrator": "Narrated Hudhaifa رضی اللہ عنہ :",
                "hadithEnglish": "From among the people, Ibn Um `Abd greatly resembled Allah's Messenger (ﷺ)s in solemn gate and good appearance of piety and in calmness and sobriety from the time he goes out of his house till he returns to it. But we do not know how he behaves with his family when he is alone with them.",
                "hadithUrdu": "بلا شبہ سب لوگوں سے اپنی چال ڈھال اور وضع اور سیرت میں رسول اللہ صلی اللہ علیہ وسلم سے سب سے زیادہ مشابہ حضرت عبداللہ بن مسعود رضی اللہ عنہما ہیں ۔ جب وہ اپنے گھر سے باہر نکلتے اور اس کے بعد دوبارہ اپنے گھر واپس آنے تک ان کا یہی حال رہتا ہے لیکن جب وہ اکیلے گھر میں رہتے تو معلوم نہیں کیا کرتے رہتے ہیں ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم راہویہ نے بیان کیا ، کہا کہ میں نے ابواسامہ سے پوچھا کیا تم سے اعمش نے یہ بیان کیا کہ میں نے شقیق سے سنا ، کہا میں نے حضرت حذیفہ رضی اللہ عنہ سے سنا ، وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ قُلْتُ لأَبِي أُسَامَةَ حَدَّثَكُمُ الأَعْمَشُ، سَمِعْتُ شَقِيقًا، قَالَ سَمِعْتُ حُذَيْفَةَ، يَقُولُ إِنَّ أَشْبَهَ النَّاسِ دَلاًّ وَسَمْتًا وَهَدْيًا بِرَسُولِ اللَّهِ صلى الله عليه وسلم لاَبْنُ أُمِّ عَبْدٍ، مِنْ حِينَ يَخْرُجُ مِنْ بَيْتِهِ إِلَى أَنْ يَرْجِعَ إِلَيْهِ، لاَ نَدْرِي مَا يَصْنَعُ فِي أَهْلِهِ إِذَا خَلاَ‏.‏",
                "headingArabic": "فِي الْهَدْىِ الصَّالِحِ",
                "headingUrdu": "صحیح راستہ یا ہدایت",
                "headingEnglish": "The righteous way or guidance",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5842,
                "hadithNumber": "6098",
                "englishNarrator": "Narrated Tariq:",
                "hadithEnglish": "`Abdullah رضی اللہ عنہما said, \"The best talk is Allah's Book (Qur'an), and the best guidance is the guidance of Muhammad.\"",
                "hadithUrdu": "عبداللہ بن مسعود رضی اللہ عنہما نے کہا بلاشبہ سب سے اچھا کلام اللہ کی کتاب ہے اور سب سے اچھا طریقہ چال چلن حضرت محمد صلی اللہ علیہ وسلم کا طریقہ ہے ۔",
                "urduNarrator": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے مخارق نے ، انہوں نے کہا میں نے طارق سے سنا ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ مُخَارِقٍ، سَمِعْتُ طَارِقًا، قَالَ قَالَ عَبْدُ اللَّهِ إِنَّ أَحْسَنَ الْحَدِيثِ كِتَابُ اللَّهِ، وَأَحْسَنَ الْهَدْىِ هَدْىُ مُحَمَّدٍ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5843,
                "hadithNumber": "6099",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said: None is more patient than Allah against the harmful saying. He hears from the people they ascribe children to Him, yet He gives them health and (supplies them with) provision.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کوئی شخص بھی یا کوئی چیز بھی تکلیف برداشت کرنے والی ، جو اسے کسی چیز کو سن کر ہوئی ہو ، اللہ سے زیادہ ( صبر کرنے والا ) نہیں ہے ۔ لوگ اس کے لئے اولاد ٹھہرا تے ہیں اور وہ انہیں تندرستی دیتا ہے بلکہ انہیں روزی بھی دیتا ہے ۔",
                "urduNarrator": "ہم سے مسددبن مسرہدنے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے سفیان ثوری نے بیان کیا ، کہا مجھ سے اعمش نے بیان کیا ، ان سے سعید بن جبیر نے ، ان سے ابوعبدالرحمن سلمی نے ، ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي الأَعْمَشُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَيْسَ أَحَدٌ ـ أَوْ لَيْسَ شَىْءٌ ـ أَصْبَرَ عَلَى أَذًى سَمِعَهُ مِنَ اللَّهِ، إِنَّهُمْ لَيَدْعُونَ لَهُ وَلَدًا، وَإِنَّهُ لَيُعَافِيهِمْ وَيَرْزُقُهُمْ ‏\"‏‏.‏",
                "headingArabic": "الصَّبْرِ عَلَى الأَذَى",
                "headingUrdu": "کسی کو تکلیف پہنچنے پر صبر کرنا",
                "headingEnglish": "To be patient when one is harmed",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5844,
                "hadithNumber": "6100",
                "englishNarrator": "Narrated `Abdullah:",
                "hadithEnglish": "The Prophet (ﷺ) divided and distributed something as he used to do for some of his distributions. A man from the Ansar said, \"By Allah, in this division the pleasure of Allah has not been intended.\" I said, \"I will definitely tell this to the Prophet (ﷺ) .\" So I went to him while he was sitting with his companions and told him of it secretly. That was hard upon the Prophet (ﷺ) and the color of his face changed, and he became so angry that I wished I had not told him. The Prophet (ﷺ) then said, \"Moses was harmed with more than this, yet he remained patient.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ( جنگ حنین ) میں کچھ مال تقسیم کیا جیسا کہ آپ ہمیشہ تقسیم کیا کرتے تھے ۔ اس پر قبیلہ انصار کے ایک شخص نے کہا کہ اللہ کی قسم اس تقسیم سے اللہ کی رضامندی حاصل کرنا مقصود نہیں تھا ۔ میں نے کہا کہ یہ بات میں ضرور رسول اللہ صلی اللہ علیہ وسلم سے کہوں گا ۔ چنانچہ میں آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا آنحضرت صلی اللہ علیہ وسلم اپنے صحابہ کے ساتھ تشریف رکھتے تھے ، میں نے چپکے سے یہ بات آپ سے کہی ۔ آنحضرت صلی اللہ علیہ وسلم کو اس کی یہ بات بڑی ناگوار گزری اور آپ کے چہرہ کا رنگ بدل گیا اور آپ غصہ ہو گئے یہاں تک کہ میرے دل میں یہ خواہش پیدا ہوئی کہ کاش میں نے آنحضرت صلی اللہ علیہ وسلم کو اس بات کی خبر نہ دی ہوتی پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایاموسیٰ علیہ السلام کو اس سے بھی زیادہ تکلیف پہنچائی گئی تھی لیکن انہوں نے صبر کیا ۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا کہ میں نے ان سے سنا وہ بیان کرتے تھے کہ عبداللہ بن مسعود نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ سَمِعْتُ شَقِيقًا، يَقُولُ قَالَ عَبْدُ اللَّهِ قَسَمَ النَّبِيُّ صلى الله عليه وسلم قِسْمَةً كَبَعْضِ مَا كَانَ يَقْسِمُ، فَقَالَ رَجُلٌ مِنَ الأَنْصَارِ وَاللَّهِ إِنَّهَا لَقِسْمَةٌ مَا أُرِيدَ بِهَا وَجْهُ اللَّهِ‏.‏ قُلْتُ أَمَّا أَنَا لأَقُولَنَّ لِلنَّبِيِّ صلى الله عليه وسلم فَأَتَيْتُهُ وَهْوَ فِي أَصْحَابِهِ فَسَارَرْتُهُ فَشَقَّ ذَلِكَ عَلَى النَّبِيِّ صلى الله عليه وسلم وَتَغَيَّرَ وَجْهُهُ وَغَضِبَ، حَتَّى وَدِدْتُ أَنِّي لَمْ أَكُنْ أَخْبَرْتُهُ ثُمَّ قَالَ ‏ \"‏ قَدْ أُوذِيَ مُوسَى بِأَكْثَرَ مِنْ ذَلِكَ فَصَبَرَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5845,
                "hadithNumber": "6101",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) did something and allowed his people to do it, but some people refrained from doing it. When the Prophet (ﷺ) learned of that, he delivered a sermon, and after having sent Praises to Allah, he said, \"What is wrong with such people as refrain from doing a thing that I do? By Allah, I know Allah better than they, and I am more afraid of Him than they.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک کام کیا اور لوگوں کو بھی اس کی اجازت دے دی لیکن کچھ لوگوں نے اس کا نہ کرنا اچھا جانا ۔ جب آنحضرت صلی اللہ علیہ وسلم کو اس کی اطلاع ہوئی تو آپ نے خطبہ دیا اور اللہ کی حمد کے بعد فرمایا ان لوگوں کو کیا ہو گیا ہے جو اس کام سے پرہیز کرتے ہیں ، جو میں کرتا ہوں ، اللہ کی قسم میں اللہ کو ان سب سے زیادہ جانتا ہوں اور ان سب سے زیادہ اللہ سے ڈرنے والا ہوں ۔",
                "urduNarrator": "ہم سے عمرو بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا ہم سے مسلم نے بیان کیا ، ان سے مسروق نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا مُسْلِمٌ، عَنْ مَسْرُوقٍ، قَالَتْ عَائِشَةُ صَنَعَ النَّبِيُّ صلى الله عليه وسلم شَيْئًا فَرَخَّصَ فِيهِ فَتَنَزَّهَ عَنْهُ قَوْمٌ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَخَطَبَ فَحَمِدَ اللَّهَ ثُمَّ قَالَ ‏ \"‏ مَا بَالُ أَقْوَامٍ يَتَنَزَّهُونَ عَنِ الشَّىْءِ أَصْنَعُهُ، فَوَاللَّهِ إِنِّي لأَعْلَمُهُمْ بِاللَّهِ وَأَشَدُّهُمْ لَهُ خَشْيَةً ‏\"‏‏.‏",
                "headingArabic": "مَنْ لَمْ يُوَاجِهِ النَّاسَ بِالْعِتَابِ",
                "headingUrdu": "جس نے لوگوں کو منہ پر نصیحت نہیں کی۔",
                "headingEnglish": "Whoever did not admonish people in their faces",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5846,
                "hadithNumber": "6102",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) was more shy than a virgin in her separate room. And if he saw a thing which he disliked, we would recognize that (feeling) in his face.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کنواری لڑکیوں سے بھی زیادہ شرمیلے تھے ، جب آپ کوئی ایسی چیز دیکھتے جو آپ کو ناگوار ہوتی تو ہم آپ کے چہرے مبارک سے سمجھ جاتے تھے ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، کہا ہم سے عبداللہ بن مبارک نے ، کہا ہم کو شعبہ نے خبر دی ، انہیں قتادہ نے ، کہا میں نے عبداللہ بن عتبہ سے سنا ، جو حضرت انس رضی اللہ عنہ کے غلام ہیں کہ حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، سَمِعْتُ عَبْدَ اللَّهِ ـ هُوَ ابْنُ أَبِي عُتْبَةَ مَوْلَى أَنَسٍ ـ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم أَشَدَّ حَيَاءً مِنَ الْعَذْرَاءِ فِي خِدْرِهَا، فَإِذَا رَأَى شَيْئًا يَكْرَهُهُ عَرَفْنَاهُ فِي وَجْهِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5847,
                "hadithNumber": "6103",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If a man says to his brother, O Kafir (disbeliever)!' Then surely one of them is such (i.e., a Kafir). \" Ikrimah, Ibn-e-Ammar, Yahya, Abdullah bin Zubair, Abu Salamah, Hadrat Abu Hurairah رضی اللہ عنہ reported the same of the prophet ﷺ.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جب کوئی شخص اپنے کسی بھائی کو کہتا ہے کہ اے کافر ! تو ان دونوں میں سے ایک کافر ہو گیا ۔ اور عکرمہ بن عمار نے یحییٰ سے بیان کیا کہ ان سے عبداللہ بن یزید نے کہا ، انہوں نے ابوسلمہ سے سنا اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ۔",
                "urduNarrator": "ہم سے محمد بن یحییٰ ذہلی ( یا محمد بن بشار ) اور احمد بن سعید دارمی نے بیان کیا ، انہوں نے کہا کہ ہم سے عثمان بن عمر نے بیان کیا ، کہا ہم کو علی بن مبارک نے خبر دی ، انہیں یحییٰ بن ابی کثیر نے ، انہیں ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، وَأَحْمَدُ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا قَالَ الرَّجُلُ لأَخِيهِ يَا كَافِرُ فَقَدْ بَاءَ بِهِ أَحَدُهُمَا ‏\"‏‏.‏ وَقَالَ عِكْرِمَةُ بْنُ عَمَّارٍ عَنْ يَحْيَى، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، سَمِعَ أَبَا سَلَمَةَ، سَمِعَ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "مَنْ كَفَّرَ أَخَاهُ بِغَيْرِ تَأْوِيلٍ فَهْوَ كَمَا قَالَ",
                "headingUrdu": "جو اپنے بھائی کو بغیر کسی دلیل کے کافر کہے۔",
                "headingEnglish": "Whoever calls his brother a Kafir without any grounds",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5848,
                "hadithNumber": "6104",
                "englishNarrator": "Narrated 'Abdullah bin 'Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, 'If anyone says to his brother, 'O misbeliever! Then surely, one of them such.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس شخص نے بھی اپنے کسی بھائی کو کہا کہ اے کافر ! تو ان دونوں میں سے ایک کافر ہو گیا ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے عبداللہ بن دینار نے ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أَيُّمَا رَجُلٍ قَالَ لأَخِيهِ يَا كَافِرُ‏.‏ فَقَدْ بَاءَ بِهَا أَحَدُهُمَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5849,
                "hadithNumber": "6105",
                "englishNarrator": "Narrated Thabit bin Ad-Dahhak رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever swears by a religion other than Islam (i.e. if he swears by saying that he is a non-Muslim in case he is telling a lie), then he is as he says if his oath is false and whoever commits suicide with something, will be punished with the same thing in the (Hell) fire, and cursing a believer is like murdering him, and whoever accuses a believer of disbelief, then it is as if he had killed him.\"",
                "hadithUrdu": "جس نے اسلام کے سوا کسی اورمذہب کی جھوٹ موٹ قسم کھائی تو وہ ویسا ہی ہو جاتا ہے ، جس کی اس نے قسم کھائی ہے اور جس نے کسی چیز سے خودکشی کر لی تو اسے جہنم میں اسی سے عذاب دیا جائے گا اور مومن پر لعنت بھیجنا اسے قتل کرنے کے برابر ہے اور جس نے کسی مومن پر کفر کی تہمت لگائی تو یہ اس کے قتل کے برابر ہے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، کہا ہم سے ایوب سختیانی نے بیان کیا ، ان سے ابوقلابہ نے ، ان سے ثابت بن ضحاک رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ ثَابِتِ بْنِ الضَّحَّاكِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ حَلَفَ بِمِلَّةٍ غَيْرِ الإِسْلاَمِ كَاذِبًا فَهْوَ كَمَا قَالَ، وَمَنْ قَتَلَ نَفْسَهُ بِشَىْءٍ عُذِّبَ بِهِ فِي نَارِ جَهَنَّمَ، وَلَعْنُ الْمُؤْمِنِ كَقَتْلِهِ، وَمَنْ رَمَى مُؤْمِنًا بِكُفْرٍ فَهْوَ كَقَتْلِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5850,
                "hadithNumber": "6106",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Mu`adh bin Jabal رضی اللہ عنہ used to pray with the Prophet (ﷺ) and then go to lead his people in prayer. Once he led the people in prayer and recited Surat-al-Baqara. A man left (the row of the praying people) and offered (light) prayer (separately) and went away. When Mu`adh came to know about it, he said. \"He (that man) is a hypocrite.\" Later that man heard what Mu`adh said about him, so he came to the Prophet and said, \"O Allah's Messenger (ﷺ)! We are people who work with our own hands and irrigate (our farms) with our camels. Last night Mu`adh led us in the (night) prayer and he recited Sura-al-Baqara, so I offered my prayer separately, and because of that, he accused me of being a hypocrite.\" The Prophet called Mu`adh and said thrice, \"O Mu`adh! You are putting the people to trials? Recite 'Washshamsi wad-uhaha' (91) or'Sabbih isma Rabbi ka-l-A'la' (87) or the like.\"",
                "hadithUrdu": "معاذ بن جبل رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے ، پھر اپنی قوم میں آتے اور انہیں نماز پڑھاتے ۔ انہوں نے ( ایک مرتبہ ) نماز میں سورۃ البقرہ پڑھی ۔ اس پر ایک صاحب جماعت سے الگ ہو گئے اور ہلکی نماز پڑھی ۔ جب اس کے متعلق معاذ کو معلوم ہوا تو کہا وہ منافق ہے ۔ معاذ کی یہ بات جب ان کو معلوم ہوئی تو وہ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا یا رسول اللہ ! ہم لوگ محنت کا کام کرتے ہیں اور اپنی اونٹنیوں کو خود پانی پلاتے ہیں حضرت معاذ نے کل رات ہمیں نماز پڑھائی اور سورۃ البقرہ پڑھنی شروع کر دی ۔ اس لئے میں نماز توڑ کر الگ ہو گیا ، اس پر وہ کہتے ہیں کہ میں منافق ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایااے معاذ ! تم لوگوں کو فتنہ میں مبتلا کرتے ہو ، تین مرتبہ آپ نے یہ فرمایا ( جب امام ہو تو ) سورۃ اقراء ، والشمس وضحھا اور سبح اسم ربک الاعلیٰ جیسی سورتیں پڑھا کرو ۔",
                "urduNarrator": "ہم سے محمد بن عبادہ نے بیان کیا ، کہا ہم کو یزید نے خبر دی ، کہا ہم کو سلیم نے خبر دی ، کہا ہم سے عمرو بن دینار نے بیان کیا ، ان سے حضرت جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَادَةَ، أَخْبَرَنَا يَزِيدُ، أَخْبَرَنَا سَلِيمٌ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، حَدَّثَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ، أَنَّ مُعَاذَ بْنَ جَبَلٍ ـ رضى الله عنه ـ كَانَ يُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ يَأْتِي قَوْمَهُ فَيُصَلِّي بِهِمُ الصَّلاَةَ، فَقَرَأَ بِهِمُ الْبَقَرَةَ ـ قَالَ ـ فَتَجَوَّزَ رَجُلٌ فَصَلَّى صَلاَةً خَفِيفَةً، فَبَلَغَ ذَلِكَ مُعَاذًا فَقَالَ إِنَّهُ مُنَافِقٌ‏.‏ فَبَلَغَ ذَلِكَ الرَّجُلَ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا قَوْمٌ نَعْمَلُ بِأَيْدِينَا، وَنَسْقِي بِنَوَاضِحِنَا، وَإِنَّ مُعَاذًا صَلَّى بِنَا الْبَارِحَةَ، فَقَرَأَ الْبَقَرَةَ فَتَجَوَّزْتُ، فَزَعَمَ أَنِّي مُنَافِقٌ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَا مُعَاذُ أَفَتَّانٌ أَنْتَ ـ ثَلاَثًا ـ اقْرَأْ ‏{‏وَالشَّمْسِ وَضُحَاهَا‏}‏ وَ‏{‏سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى‏}‏ وَنَحْوَهَا ‏\"‏‏.‏",
                "headingArabic": "مَنْ لَمْ يَرَ إِكْفَارَ مَنْ قَالَ ذَلِكَ مُتَأَوِّلاً أَوْ جَاهِلاً",
                "headingUrdu": "جو کہتا ہے اسے کافر نہیں سمجھتا...",
                "headingEnglish": "Whoever does not consider as Kafir the person who says that...",
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5851,
                "hadithNumber": "6107",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said: \"Whoever amongst you swears, (saying by error) in his oath 'By Al-Lat and Al- Uzza', then he should say, 'None has the right to be worshipped but Allah.' And whoever says to his companions, 'Come let me gamble' with you, then he must give something in charity (as an expiation for such a sin).\" (See Hadith No. 645)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تم میں سے جس نے لات عزیٰ کی ( یا دوسرے بتوں کی ) قسم کھائی تو اسے لا الہٰ الا اللہ پڑھنا چاہیئے اور جس نے اپنے ساتھی سے کہا کہ آؤ جوا کھیلیں تو اسے بطور کفارہ صدقہ دینا چاہیئے ۔",
                "urduNarrator": "مجھ سے اسحاق بن راہویہ نے بیان کیا ، کہا ہم کو ابو المغیرہ نے خبر دی ، کہا ہم سے امام اوزاعی نے بیان کیا انہوں نے کہا ہم سے زہری نے بیان کیا ، انہوں نے کہا ہم سے حمید بن عبدالرحمٰن بن عوف نے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا أَبُو الْمُغِيرَةِ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ حُمَيْدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ حَلَفَ مِنْكُمْ فَقَالَ فِي حَلِفِهِ بِاللاَّتِ وَالْعُزَّى‏.‏ فَلْيَقُلْ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ وَمَنْ قَالَ لِصَاحِبِهِ تَعَالَ أُقَامِرْكَ، فَلْيَتَصَدَّقْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5852,
                "hadithNumber": "6108",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "He found `Umar bin Al-Khattab رضی اللہ عنہ in a group of people and he was swearing by his father. So Allah's Messenger (ﷺ) called them, saying, \"Verily! Allah forbids you to swear by your fathers. If one has to take an oath, he should swear by Allah or otherwise keep quiet.\"",
                "hadithUrdu": "وہ حضرت عمر بن خطاب رضی اللہ عنہ کے پاس پہنچے جو چند سواروں کے ساتھ تھے ، اس وقت حضرت عمر رضی اللہ عنہ اپنے والد کی قسم کھا رہے تھے ۔ اس پر رسول کریم صلی اللہ علیہ وسلم نے انہیں پکار کر کہا ، خبردار ! یقیناً اللہ پاک تمہیں منع کرتا ہے کہ تم اپنے باپ دادوں کی قسم کھاؤ ، پس اگر کسی کو قسم ہی کھا نی ہے تو اللہ کی قسم کھائے ، ورنہ چپ رہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعیدنے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما أَنَّهُ أَدْرَكَ عُمَرَ بْنَ الْخَطَّابِ فِي رَكْبٍ وَهْوَ يَحْلِفُ بِأَبِيهِ، فَنَادَاهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَلاَ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ، فَمَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللَّهِ، وَإِلاَّ فَلْيَصْمُتْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "79",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 79,
                    "chapterNumber": "79",
                    "chapterEnglish": "Good Manners and Form (Al-Adab)",
                    "chapterUrdu": "اخلاق کے بیان میں",
                    "chapterArabic": "كتاب الأدب",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5826,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=233",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=231",
                "label": "231",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=232",
                "label": "232",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=233",
                "label": "233",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=234",
                "label": "234",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=235",
                "label": "235",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=236",
                "label": "236",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=237",
                "label": "237",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=235",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=235",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=233",
        "to": 5850,
        "total": 40465
    }
}