{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 87,
        "data": [
            {
                "id": 2152,
                "hadithNumber": "2244",
                "englishNarrator": "Narrated Muhammad bin Al-Mujalid:",
                "hadithEnglish": "`Abdullah bin Shaddad and Abu Burda sent me to `Abdullah bin Abi `Aufa رضی اللہ عنہما and told me to ask `Abdullah whether the people in the lifetime of the Prophet (ﷺ) used to pay in advance for wheat (to be delivered later). `Abdullah رضی اللہ عنہ replied, \"We used to pay in advance to the peasants of Sham for wheat, barley and olive oil of a known specified measure to be delivered in a specified period.\" I asked (him), \"Was the price paid (in advance) to those who had the things to be delivered later?\" `Abdullah bin `Aufa replied, \"We did not use to ask them about that.\" Then they sent me to `Abdur Rahman bin Abza رضی اللہ عنہ and I asked him. He replied, \"The companions of the Prophet (ﷺ) used to practice Salam in the lifetime of the Prophet; and we did not use to ask them whether they had standing crops or not.\"",
                "hadithUrdu": "مجھے عبداللہ بن شداد اور ابوبردہ نے عبداللہ بن ابی اوفی رضی اللہ عنہما کے یہاں بھیجا اور ہدایت کی کہ ان سے پوچھو کہ کیا نبی کریم صلی اللہ علیہ وسلم کے اصحاب آپ کے زمانے میں گیہوں کی بیع سلم کرتے تھے ؟ عبداللہ رضی اللہ عنہ نے جواب دیا کہ ہم شام کے انباط ( ایک کاشتکار قوم ) کے ساتھ گیہوں ، جوار ، زیتون کی مقررہ وزن اور مقررہ مدت کے لیے سودا کیا کرتے تھے ۔ میں نے پوچھا کیا صرف اسی شخص سے آپ لوگ یہ بیع کیا کرتے تھے جس کے پاس اصل مال موجود ہوتا تھا ؟ انہوں نے فرمایا کہ ہم اس کے متعلق پوچھتے ہی نہیں تھے ۔ اس کے بعد ان دونوں حضرات نے مجھے عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ کے خدمت میں بھیجا ۔ میں نے ان سے بھی پوچھا ۔ انہوں نے بھی یہی کہا کہ نبی کریم صلی اللہ علیہ وسلم کے اصحاب آپ کے عہد مبارک میں بیع سلم کیا کرتے تھے اور ہم یہ بھی نہیں پوچھتے تھے کہ ان کے کھیتی بھی ہے یا نہیں ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالواحد نے بیان کیا ، ان سے شیبانی نے بیان کیا ، ان سے محمد بن ابی مجالد نے بیان کیا ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الشَّيْبَانِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الْمُجَالِدِ، قَالَ بَعَثَنِي عَبْدُ اللَّهِ بْنُ شَدَّادٍ وَأَبُو بُرْدَةَ إِلَى عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى ـ رضى الله عنهما ـ فَقَالاَ سَلْهُ هَلْ كَانَ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم فِي عَهْدِ النَّبِيِّ صلى الله عليه وسلم يُسْلِفُونَ فِي الْحِنْطَةِ قَالَ عَبْدُ اللَّهِ كُنَّا نُسْلِفُ نَبِيطَ أَهْلِ الشَّأْمِ فِي الْحِنْطَةِ، وَالشَّعِيرِ، وَالزَّيْتِ، فِي كَيْلٍ مَعْلُومٍ، إِلَى أَجَلٍ مَعْلُومٍ‏.‏ قُلْتُ إِلَى مَنْ كَانَ أَصْلُهُ عِنْدَهُ قَالَ مَا كُنَّا نَسْأَلُهُمْ عَنْ ذَلِكَ‏.‏ ثُمَّ بَعَثَانِي إِلَى عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى فَسَأَلْتُهُ فَقَالَ كَانَ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم يُسْلِفُونَ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم وَلَمْ نَسْأَلْهُمْ أَلَهُمْ حَرْثٌ أَمْ لاَ",
                "headingArabic": "السَّلَمِ إِلَى مَنْ لَيْسَ عِنْدَهُ أَصْلٌ",
                "headingUrdu": "سلام اس شخص کو جس کے پاس کچھ نہیں ہے۔",
                "headingEnglish": "As-Salam to a person who has got nothing",
                "chapterId": "36",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 36,
                    "chapterNumber": "36",
                    "chapterEnglish": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam)",
                    "chapterUrdu": "بیع سلم کے بیان میں",
                    "chapterArabic": "كتاب السلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2153,
                "hadithNumber": "2245",
                "englishNarrator": "Narrated Muhammad bin Abi Al-Mujalid:",
                "hadithEnglish": "\"We used to pay them in advance for wheat and barley (to be delivered later). Narrated Ash-Shaibani--\"And also for olive oil.\" Narrated Ash-Shaibani: who said \"We used to pay in advance for wheat barley and dried grapes.\"",
                "hadithUrdu": "ہم ان سے گیہوں اور جَو میں بیع سلم کیا کرتے تھے ۔ اور عبداللہ بن ولید نے بیان کیا ، ان سے سفیان نے ، ان سے شیبانی نے بیان کیا ، اس میں انہوں نے زیتون کا بھی نام لیا ہے ۔ ہم سے قتیبہ نے بیان کیا ، ان سے جریر نے بیان کیا ، ان سے شیبانی نے ، اور اس میں بیان کیا کہ گیہوں ، جَو اور منقی میں ( بیع سلم کیا کرتے تھے ) ۔",
                "urduNarrator": "ہم سے اسحاق بن شاہین نے بیان کیا ، کہا کہ ہم سے خالد بن عبداللہ نے بیان کیا ، ان سے شیبانی نے ، ان سے محمد بن ابی مجالد نے یہی حدیث ۔ اس روایت میں یہ بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنِ الشَّيْبَانِيِّ، عَنْ مُحَمَّدِ بْنِ أَبِي مُجَالِدٍ، بِهَذَا وَقَالَ فَنُسْلِفُهُمْ فِي الْحِنْطَةِ وَالشَّعِيرِ‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ الْوَلِيدِ عَنْ سُفْيَانَ حَدَّثَنَا الشَّيْبَانِيُّ وَقَالَ وَالزَّيْتِ‏.‏ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا جَرِيرٌ عَنِ الشَّيْبَانِيِّ وَقَالَ فِي الْحِنْطَةِ وَالشَّعِيرِ وَالزَّبِيبِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 36,
                    "chapterNumber": "36",
                    "chapterEnglish": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam)",
                    "chapterUrdu": "بیع سلم کے بیان میں",
                    "chapterArabic": "كتاب السلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2154,
                "hadithNumber": "2246",
                "englishNarrator": "Narrated Abu Bakhtari at-Tai:",
                "hadithEnglish": "I asked Ibn `Abbas رضی اللہ عنہما about Salam for (the fruits of) date-palms. He replied \"The Prophet (ﷺ) forbade the sale a dates on the trees till they became fit for eating and could be weighed.\" A man asked what to be weighed (as the dates were still on the trees). Another man sitting beside Ibn `Abbas رضی اللہ عنہما replied, \"Till they are cut and stored.\" Narrated Abu Al-Bakhtari: I heard Ibn `Abbas رضی اللہ عنہما (saying) that the Prophet (ﷺ) forbade ... etc. as above.",
                "hadithUrdu": "میں نے ابن عباس رضی اللہ عنہما سے کھجور کے درخت میں بیع سلم کے متعلق پوچھا تو آپ نے فرمایا کہ درخت پر پھل کو بیچنے سے آنحضرت صلی اللہ علیہ وسلم نے اس وقت تک کے لیے منع فرمایا تھا جب تک وہ کھانے کے قابل نہ ہو جائے یا اس کا وزن نہ کیا جا سکے ۔ ایک شخص نے پوچھا کہ کیا چیز وزن کی جائے گی ۔ اس پر ابن عباس رضی اللہ عنہما کے قریب ہی بیٹھے ہوئے ایک شخص نے کہا کہ مطلب یہ ہے کہ اندازہ کرنے کے قابل ہو جائے اور معاذ نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے عمرو نے کہ ابوالبختری نے کہا کہ میں نے ابن عباس رضی اللہ عنہما سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے منع کیا تھا ۔ پھر یہی حدیث بیان کی ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، انہیں عمرو نے خبر دی ، انہوں نے کہا کہ میں نے ابوالبختری طائی سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا عَمْرٌو، قَالَ سَمِعْتُ أَبَا الْبَخْتَرِيِّ الطَّائِيَّ، قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ السَّلَمِ، فِي النَّخْلِ‏.‏ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ النَّخْلِ، حَتَّى يُؤْكَلَ مِنْهُ وَحَتَّى يُوزَنَ‏.‏ فَقَالَ الرَّجُلُ وَأَىُّ شَىْءٍ يُوزَنُ قَالَ رَجُلٌ إِلَى جَانِبِهِ حَتَّى يُحْرَزَ‏.‏ وَقَالَ مُعَاذٌ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، قَالَ أَبُو الْبَخْتَرِيِّ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ نَهَى النَّبِيُّ صلى الله عليه وسلم مِثْلَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 36,
                    "chapterNumber": "36",
                    "chapterEnglish": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam)",
                    "chapterUrdu": "بیع سلم کے بیان میں",
                    "chapterArabic": "كتاب السلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2155,
                "hadithNumber": "2247, 2248",
                "englishNarrator": "Narrated Abu Al-Bakhtari:",
                "hadithEnglish": "I asked Ibn `Umar رضی اللہ عنہما about Salam (the fruits of) date-palms. He replied, \"The Prophet (ﷺ) forbade the sale of dates till their benefit becomes evident and fit for eating and also the sale of silver (for gold) on credit.\" I asked Ibn `Abbas رضی اللہ عنہما about Salam for dates and he replied, \"The Prophet (ﷺ) forbade the sale of dates till they were fit for eating and could be estimated.\"",
                "hadithUrdu": "میں نے ابن عمر رضی اللہ عنہما سے کھجور میں جب کہ وہ درخت پر لگی ہوئی ہو بیع سلم کے متعلق پوچھا ، تو انہوں نے کہا کہ جب تک وہ کسی قابل نہ ہو جائے اس کی بیع سے آنحضرت صلی اللہ علیہ وسلم نے منع فرمایا ہے ۔ اسی طرح چاندی کو ادھار ، نقد کے بدلے بیچنے سے منع فرمایا ۔ پھر میں نے ابن عباس رضی اللہ عنہما سے کھجور کی درخت پر بیع سلم کے متعلق پوچھا تو آپ نے بھی یہی کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے اس وقت تک کھجور کی بیع سے منع فرمایا تھا جب تک وہ کھائی نہ جا سکے یا ( یہ فرمایا کہ ) جب تک وہ اس قابل نہ ہو جائے کہ اسے کوئی کھا سکے اور جب تک وہ تولنے کے قابل نہ ہو جائے ۔",
                "urduNarrator": "ہم سے ابوالولید نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے عمرو نے ، ان سے ابوالبختری نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنْ أَبِي الْبَخْتَرِيِّ، قَالَ سَأَلْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنِ السَّلَمِ، فِي النَّخْلِ فَقَالَ نُهِيَ عَنْ بَيْعِ النَّخْلِ، حَتَّى يَصْلُحَ، وَعَنْ بَيْعِ الْوَرِقِ، نَسَاءً بِنَاجِزٍ‏.‏ وَسَأَلْتُ ابْنَ عَبَّاسٍ عَنِ السَّلَمِ، فِي النَّخْلِ، فَقَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ النَّخْلِ حَتَّى يُؤْكَلَ مِنْهُ، أَوْ يَأْكُلَ مِنْهُ، وَحَتَّى يُوزَنَ‏.‏",
                "headingArabic": "السَّلَمِ فِي النَّخْلِ",
                "headingUrdu": "کھجور کے پھلوں پر سلام",
                "headingEnglish": "As-Salam for (the fruits of) dat-palms",
                "chapterId": "36",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 36,
                    "chapterNumber": "36",
                    "chapterEnglish": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam)",
                    "chapterUrdu": "بیع سلم کے بیان میں",
                    "chapterArabic": "كتاب السلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2156,
                "hadithNumber": "2249, 2250",
                "englishNarrator": "Narrated Abu Al-Bakhtari:",
                "hadithEnglish": "I asked Ibn `Umar رضی اللہ عنہما about Salam for dates. Ibn `Umar replied, \"The Prophet (ﷺ) forbade the sale (the fruits) of date-palms until they were fit for eating and also forbade the sale of silver for gold on credit.\" I also asked Ibn `Abbas رضی اللہ عنہما about it. Ibn `Abbas رضی اللہ عنہما replied, \"The Prophet (ﷺ) forbade the sale of dates till they were fit for eating, and could be weighed.\" I asked him, \"What is to be weighed (as the dates are on the trees)?\" A man sitting by Ibn `Abbas رضی اللہ عنہما said, \"It means till they are cut and stored.\"",
                "hadithUrdu": "میں نے ابن عمر رضی اللہ عنہما سے کھجور کی درخت پر بیع سلم کے متعلق پوچھا تو انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے پھل کو اس وقت تک بیچنے سے منع فرمایا ہے جب تک وہ نفع اٹھانے کے قابل نہ ہو جائے ، اسی طرح چاندی کو سونے کے بدلے بیچنے سے جب کہ ایک ادھار اور دوسرا نقد ہو منع فرمایا ہے ۔ پھر میں نے ابن عباس رضی اللہ عنہما سے پوچھا تو انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے کھجور کو درخت پر بیچنے سے جب تک وہ کھانے کے قابل نہ ہو جائے ، اسی طرح جب تک وہ وزن کرنے کے قابل نہ ہو جائے منع فرمایا ہے ۔ میں نے پوچھا کہ وزن کئے جانے کا کیا مطلب ہے ؟ تو ایک صاحب نے جو ان کے پاس بیٹھے ہوئے تھے کہا کہ مطلب یہ ہے کہ جب تک وہ اس قابل نہ ہو جائے کہ وہ اندازہ کی جا سکے ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، کہا کہ ہم سے غندر نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے عمرو نے ، ان سے ابوالبختری نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنْ أَبِي الْبَخْتَرِيِّ، سَأَلْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ عَنِ السَّلَمِ، فِي النَّخْلِ فَقَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ الثَّمَرِ حَتَّى يَصْلُحَ، وَنَهَى عَنِ الْوَرِقِ بِالذَّهَبِ نَسَاءً بِنَاجِزٍ‏.‏ وَسَأَلْتُ ابْنَ عَبَّاسٍ فَقَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ بَيْعِ النَّخْلِ حَتَّى يَأْكُلَ أَوْ يُؤْكَلَ، وَحَتَّى يُوزَنَ‏.‏ قُلْتُ وَمَا يُوزَنُ قَالَ رَجُلٌ عِنْدَهُ حَتَّى يُحْرَزَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 36,
                    "chapterNumber": "36",
                    "chapterEnglish": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam)",
                    "chapterUrdu": "بیع سلم کے بیان میں",
                    "chapterArabic": "كتاب السلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2157,
                "hadithNumber": "2251",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) bought some foodstuff (barley) from a Jew on credit and mortgaged his iron armor to him (the armor stands for a guarantor).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ایک یہودی سے ادھار غلہ خریدا اور اپنی ایک لوہے کی زرہ اس کے پاس گروی رکھی ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا کہ ہم سے یعلیٰ بن عبیداللہ نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، ان سے ابراہیم نے ، ان سے اسود نے بیان کیا ان سے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا يَعْلَى، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اشْتَرَى رَسُولُ اللَّهِ صلى الله عليه وسلم طَعَامًا مِنْ يَهُودِيٍّ بِنَسِيئَةٍ، وَرَهَنَهُ دِرْعًا لَهُ مِنْ حَدِيدٍ‏.‏",
                "headingArabic": "الْكَفِيلِ فِي السَّلَمِ",
                "headingUrdu": "سلام میں ضامن",
                "headingEnglish": "The guarantor in As-Salam",
                "chapterId": "36",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 36,
                    "chapterNumber": "36",
                    "chapterEnglish": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam)",
                    "chapterUrdu": "بیع سلم کے بیان میں",
                    "chapterArabic": "كتاب السلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2158,
                "hadithNumber": "2252",
                "englishNarrator": "Narrated Al-A`mash:",
                "hadithEnglish": "We argued at Ibrahim's dwelling place about mortgaging in Salam. He said, \"Aisha رضی اللہ عنہا said, 'The Prophet (ﷺ) bought some foodstuff from a Jew on credit and the payment was to be made by a definite period, and he mortgaged his iron armor to him.\"",
                "hadithUrdu": "ہم نے ابراہیم نخعی کے سامنے بیع سلم میں گروی رکھنے کا ذکر کیا تو انہوں نے کہا ہم سے اسود نے بیان کیا ، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک یہودی سے ایک مقررہ مدت کے لیے غلہ خریدا اور اس کے پاس اپنی لوہے کی زرہ گروی رکھ دی تھی ۔",
                "urduNarrator": "ہم سے محمد بن محبوب نے بیان کیا ، کہا ہم سے عبدالواحد بن زیاد نے بیان کیا ، ان سے اعمش نے بیان کیا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ مَحْبُوبٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ تَذَاكَرْنَا عِنْدَ إِبْرَاهِيمَ الرَّهْنَ فِي السَّلَفِ فَقَالَ حَدَّثَنِي الأَسْوَدُ عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم اشْتَرَى مِنْ يَهُودِيٍّ طَعَامًا إِلَى أَجَلٍ مَعْلُومٍ، وَارْتَهَنَ مِنْهُ دِرْعًا مِنْ حَدِيدٍ‏.‏",
                "headingArabic": "الرَّهْنِ فِي السَّلَمِ",
                "headingUrdu": "بیع سلم میں گروی رکھنا",
                "headingEnglish": "Mortgaging in As-Salam",
                "chapterId": "36",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 36,
                    "chapterNumber": "36",
                    "chapterEnglish": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam)",
                    "chapterUrdu": "بیع سلم کے بیان میں",
                    "chapterArabic": "كتاب السلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2159,
                "hadithNumber": "2253",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) came to Medina and the people used to pay in advance the prices of fruits to be delivered within two to three years. The Prophet (ﷺ) said (to them), \"Buy fruits by paying their prices in advance on condition that the fruits are to be delivered to you according to a fixed specified measure within a fixed specified period.\" Ibn Najih said, \" ... by specified measure and specified weight.\"",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو لوگ پھلوں میں دو اور تین سال تک کے لیے بیع سلم کیا کرتے تھے ۔ آپ صلی اللہ علیہ وسلم نے انہیں ہدایت کی کہ پھلوں میں بیع سلم مقررہ پیمانے اور مقررہ مدت کے لیے کیا کرو ۔ اور عبداللہ بن ولید نے کہا ہم سے سفیان بن عیینہ نے کہا ، ان سے ابن ابی نجیح نے بیان کیا ، اس روایت میں یوں ہے کہ ” پیمانے اور وزن کی تعیین کے ساتھ “ ( بیع سلم ہونی چاہئیے ) ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابن ابی نجیح نے ، ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ، عَنْ أَبِي الْمِنْهَالِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَهُمْ يُسْلِفُونَ فِي الثِّمَارِ السَّنَتَيْنِ وَالثَّلاَثَ، فَقَالَ ‏\"‏ أَسْلِفُوا فِي الثِّمَارِ فِي كَيْلٍ مَعْلُومٍ إِلَى أَجَلٍ مَعْلُومٍ ‏\"‏‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ الْوَلِيدِ حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ أَبِي نَجِيحٍ، وَقَالَ، ‏\"‏ فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ ‏\"‏‏.‏",
                "headingArabic": "السَّلَمِ إِلَى أَجَلٍ مَعْلُومٍ",
                "headingUrdu": "ایک مقررہ مدت کے لیےبیع سلم کرنا",
                "headingEnglish": "As-Salam for a fixed specified period",
                "chapterId": "36",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 36,
                    "chapterNumber": "36",
                    "chapterEnglish": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam)",
                    "chapterUrdu": "بیع سلم کے بیان میں",
                    "chapterArabic": "كتاب السلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2160,
                "hadithNumber": "2254, 2255",
                "englishNarrator": "Narrated Muhammad bin Abi Al-Mujalid:",
                "hadithEnglish": "Abu Burda and `Abdullah bin Shaddad sent me to `Abdur Rahman bin Abza and `Abdullah bin Abi `Aufa to ask them about the Salaf (Salam). They said, \"We used to get war booty while we were with Allah's Messenger (ﷺ) and when the peasants of Sham came to us we used to pay them in advance for wheat, barley, and oil to be delivered within a fixed period.\" I asked them, \"Did the peasants own standing crops or not?\" They replied, \"We never asked them about it.\"",
                "hadithUrdu": "مجھے ابوبردہ اور عبداللہ بن شداد نے عبدالرحمٰن بن ابزیٰ اور عبداللہ بن ابی اوفی رضی اللہ عنہما کی خدمت میں بھیجا ۔ میں نے ان دونوں حضرات سے بیع سلم کے متعلق پوچھا تو انہوں نے کہا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں غنیمت کا مال پاتے ، پھر شام کے انباط ( ایک کاشتکار قوم ) ہمارے یہاں آتے تو ہم ان سے گیہوں ، جَو اور منقی کی بیع سلم ایک مدت مقرر کر کے کر لیا کرتے تھے ۔ انہوں نے کہا کہ پھر میں نے پوچھا کہ ان کے پاس اس وقت یہ چیزیں موجود بھی ہوتی تھیں یا نہیں ؟ اس پر انہوں نے کہا کہ ہم اس کے متعلق ان سے کچھ پوچھتے ہی نہیں تھے ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا ، انہوں نے کہا کہ ہم کو عبداللہ نے خبر دی ، انہوں نے کہا کہ ہم کو سفیان نے خبر دی ، انہیں سلیمان شیبانی نے ، انہیں محمد بن ابی مجالد نے ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، عَنْ سُلَيْمَانَ الشَّيْبَانِيِّ، عَنْ مُحَمَّدِ بْنِ أَبِي مُجَالِدٍ، قَالَ أَرْسَلَنِي أَبُو بُرْدَةَ وَعَبْدُ اللَّهِ بْنُ شَدَّادٍ إِلَى عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى وَعَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى فَسَأَلْتُهُمَا عَنِ السَّلَفِ،‏.‏ فَقَالاَ كُنَّا نُصِيبُ الْمَغَانِمَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَكَانَ يَأْتِينَا أَنْبَاطٌ مِنْ أَنْبَاطِ الشَّأْمِ فَنُسْلِفُهُمْ فِي الْحِنْطَةِ وَالشَّعِيرِ وَالزَّبِيبِ إِلَى أَجَلٍ مُسَمًّى‏.‏ قَالَ قُلْتُ أَكَانَ لَهُمْ زَرْعٌ، أَوْ لَمْ يَكُنْ لَهُمْ زَرْعٌ قَالاَ مَا كُنَّا نَسْأَلُهُمْ عَنْ ذَلِكَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "36",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 36,
                    "chapterNumber": "36",
                    "chapterEnglish": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam)",
                    "chapterUrdu": "بیع سلم کے بیان میں",
                    "chapterArabic": "كتاب السلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2161,
                "hadithNumber": "2256",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The people used to sell camels on the basis of Habal-al-Habala. The Prophet (ﷺ) forbade such sale. Nafi` explained Habal-al-Habala by saying. \"The camel is to be delivered to the buyer after the she-camel gives birth.\"",
                "hadithUrdu": "لوگ اونٹ وغیرہ حمل کے حمل ہونے کی مدت تک کے لیے بیچتے تھے ۔ نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا ۔ نافع نے «حبل الحبلة» کی تفسیر یہ کی ” یہاں تک کہ اونٹی کے پیٹ میں جو کچھ ہے وہ اسے جن لے ۔ “",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہیں جویریہ نے خبر دی ، انہیں نافع نے اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، أَخْبَرَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ كَانُوا يَتَبَايَعُونَ الْجَزُورَ إِلَى حَبَلِ الْحَبَلَةِ، فَنَهَى النَّبِيُّ صلى الله عليه وسلم عَنْهُ‏.‏ فَسَّرَهُ نَافِعٌ أَنْ تُنْتَجَ النَّاقَةُ مَا فِي بَطْنِهَا‏.‏",
                "headingArabic": "السَّلَمِ إِلَى أَنْ تُنْتَجَ النَّاقَةُ",
                "headingUrdu": "اونٹنی کے بچہ جننے کی مدت کے لیےبیع سلم کرنا",
                "headingEnglish": "As-Salam in buying a she-camel to be delivered after it has given birth",
                "chapterId": "36",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 36,
                    "chapterNumber": "36",
                    "chapterEnglish": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam)",
                    "chapterUrdu": "بیع سلم کے بیان میں",
                    "chapterArabic": "كتاب السلم",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2162,
                "hadithNumber": "2257",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) gave a verdict regarding Shuf'a in every undivided joint thing (property). But if the limits are defined (or demarcated) or the ways and streets are fixed, then there is no pre-emption.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہر اس چیز میں شفعہ کا حق دیا تھا جو ابھی تقسیم نہ ہوئی ہو ۔ لیکن جب حدود مقرر ہو گئیں اور راستے بدل دیئے گئے تو پھر حق شفعہ باقی نہیں رہتا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا کہ ہم سے عبدالواحد نے بیان کیا ، ان سے معمر نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالشُّفْعَةِ فِي كُلِّ مَا لَمْ يُقْسَمْ، فَإِذَا وَقَعَتِ الْحُدُودُ وَصُرِّفَتِ الطُّرُقُ فَلاَ شُفْعَةَ‏.‏",
                "headingArabic": "الشُّفْعَةُ مَا لَمْ يُقْسَمْ، فَإِذَا وَقَعَتِ الْحُدُودُ فَلاَ شُفْعَةَ",
                "headingUrdu": "اگر جائیداد غیر منقسم ہو تو شوف صحیح ہے۔",
                "headingEnglish": "Shuf'a is valid if the property is undivided",
                "chapterId": "37",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 37,
                    "chapterNumber": "37",
                    "chapterEnglish": "Shuf'a",
                    "chapterUrdu": "شفعہ کے بیان میں",
                    "chapterArabic": "كتاب الشفعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2163,
                "hadithNumber": "2258",
                "englishNarrator": "Narrated `Amr bin Ash-Sharid:",
                "hadithEnglish": "While I was standing with Sa`d bin Abi Waqqas رضی اللہ عنہ , Al-Miswar bin Makhrama رضی اللہ عنہ came and put his hand on my shoulder. Meanwhile Abu Rafi رضی اللہ عنہ`, the freed slave of the Prophet (ﷺ) came and asked Sa`d to buy from him the (two) dwellings which were in his house. Sa`d رضی اللہ عنہ said, \"By Allah I will not buy them.\" Al- Miswar رضی اللہ عنہ said, \"By Allah, you shall buy them.\" Sa`d replied, \"By Allah, I will not pay more than four thousand (Dirhams) by installments.\" Abu Rafi` said, \"I have been offered five hundred Dinars (for it) and had I not heard the Prophet (ﷺ) saying, 'The neighbor has more right than anyone else because of his nearness, I would not give them to you for four-thousand (Dirhams) while I am offered five-hundred Dinars (one Dinar equals ten Dirhams) for them.\" So, he sold it to Sa`d رضی اللہ عنہ .",
                "hadithUrdu": "میں سعد بن ابی وقاص رضی اللہ عنہ کے پاس کھڑا تھا کہ مسور بن مخرمہ رضی اللہ عنہ تشریف لائے اور اپنا ہاتھ میرے شانے پر رکھا ۔ اتنے میں نبی کریم صلی اللہ علیہ وسلم کے غلام ابورافع رضی اللہ عنہ بھی آ گئے اور فرمایا کہ اے سعد ! تمہارے قبیلہ میں جو میرے دو گھر ہیں ، انہیں تم خرید لو ۔ سعد رضی اللہ عنہ بولے کہ بخدا میں تو انہیں نہیں خریدوں گا ۔ اس پر مسور رضی اللہ عنہ نے فرمایا کہ نہیں جی تمہیں خریدنا ہو گا ۔ سعد رضی اللہ عنہ نے فرمایا کہ پھر میں چار ہزار سے زیادہ نہیں دے سکتا ۔ اور وہ بھی قسط وار ۔ ابورافع رضی اللہ عنہ نے فرمایا کہ مجھے پانچ سو دینار ان کے مل رہے ہیں ۔ اگر میں نے رسول اللہ صلی اللہ علیہ وسلم کی زبان سے یہ نہ سنا ہوتا کہ پڑوسی اپنے پڑوس کا زیادہ حقدار ہے ۔ تو میں ان گھروں کو چار ہزار پر تمہیں ہرگز نہ دیتا ۔ جب کہ مجھے پانچ سو دینار ان کے مل رہے ہیں ۔ چنانچہ وہ دونوں گھر ابورافع رضی اللہ عنہ نے سعد رضی اللہ عنہ کو دے دئیے ۔",
                "urduNarrator": "ہم سے مکی بن ابراہیم نے بیان کیا ، انہوں نے کہا کہ ہم کو ابن جریج نے خبر دی ، انہوں نے کہا مجھ کو ابراہیم بن میسرہ نے خبر دی ، انہیں عمرو بن شرید نے ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، قَالَ وَقَفْتُ عَلَى سَعْدِ بْنِ أَبِي وَقَّاصٍ، فَجَاءَ الْمِسْوَرُ بْنُ مَخْرَمَةَ فَوَضَعَ يَدَهُ عَلَى إِحْدَى مَنْكِبَىَّ إِذْ جَاءَ أَبُو رَافِعٍ مَوْلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا سَعْدُ ابْتَعْ مِنِّي بَيْتَىَّ فِي دَارِكَ‏.‏ فَقَالَ سَعْدٌ وَاللَّهِ مَا أَبْتَاعُهُمَا‏.‏ فَقَالَ الْمِسْوَرُ وَاللَّهِ لَتَبْتَاعَنَّهُمَا‏.‏ فَقَالَ سَعْدٌ وَاللَّهِ لاَ أَزِيدُكَ عَلَى أَرْبَعَةِ آلاَفٍ، مُنَجَّمَةٍ أَوْ مُقَطَّعَةٍ‏.‏ قَالَ أَبُو رَافِعٍ لَقَدْ أُعْطِيتُ بِهَا خَمْسَمِائَةِ دِينَارٍ، وَلَوْلاَ أَنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْجَارُ أَحَقُّ بِسَقَبِهِ ‏\"‏‏.‏ مَا أَعْطَيْتُكَهَا بِأَرْبَعَةِ آلاَفٍ، وَأَنَا أُعْطَى بِهَا خَمْسَمِائَةِ دِينَارٍ‏.‏ فَأَعْطَاهَا إِيَّاهُ‏.‏",
                "headingArabic": "عَرْضِ الشُّفْعَةِ عَلَى صَاحِبِهَا قَبْلَ الْبَيْعِ",
                "headingUrdu": "شراکت دار کو بیچنے سے پہلے اپنے ساتھی کو مطلع کرنا چاہیے۔",
                "headingEnglish": "The partner should inform his partner before selling",
                "chapterId": "37",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 37,
                    "chapterNumber": "37",
                    "chapterEnglish": "Shuf'a",
                    "chapterUrdu": "شفعہ کے بیان میں",
                    "chapterArabic": "كتاب الشفعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2164,
                "hadithNumber": "2259",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I said, \"O Allah's Messenger (ﷺ)! I have two neighbors and would like to know to which of them I should give presents.\" He replied, \"To the one whose door is nearer to you.\"",
                "hadithUrdu": "میں نے پوچھا یا رسول اللہ ! میرے دو پڑوسی ہیں ، میں ان دونوں میں سے کس کے پاس ہدیہ بھیجوں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس کا دروازہ تجھ سے زیادہ قریب ہو ۔",
                "urduNarrator": "ہم سے حجاج بن منہال نے بیان کیا ، کہا کہ ہم سے شعبہ نے بیان کیا ( دوسری سند ) اور مجھ سے علی بن عبداللہ نے بیان کیا ، ان سے شبابہ نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے ابوعمران نے بیان کیا ، کہا کہ میں نے طلحہ بن عبداللہ سے سنا ، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنِي عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو عِمْرَانَ، قَالَ سَمِعْتُ طَلْحَةَ بْنَ عَبْدِ اللَّهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ لِي جَارَيْنِ، فَإِلَى أَيِّهِمَا أُهْدِي قَالَ ‏ \"‏ إِلَى أَقْرَبِهِمَا مِنْكِ بَابًا ‏\"‏‏.‏",
                "headingArabic": "أَىُّ الْجِوَارِ أَقْرَبُ",
                "headingUrdu": "قریب ترین پڑوسی کس کو سمجھا جاتا ہے؟",
                "headingEnglish": "Who is considered the nearer neighbour?",
                "chapterId": "37",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 37,
                    "chapterNumber": "37",
                    "chapterEnglish": "Shuf'a",
                    "chapterUrdu": "شفعہ کے بیان میں",
                    "chapterArabic": "كتاب الشفعة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2165,
                "hadithNumber": "2260",
                "englishNarrator": "Narrated Abu Musa Al-Ash`ari رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The honest treasurer who gives willingly what he is ordered to give, is one of the two charitable persons, (the second being the owner).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، امانت دار خزانچی جو اس کو حکم دیا جائے ، اس کے مطابق دل کی فراخی کے ساتھ ( صدقہ ادا کر دے ) وہ بھی ایک صدقہ کرنے والوں ہی میں سے ہے ۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے بیان کیا ، ان سے ابوبردہ یزید بن عبداللہ نے کہا کہ میرے دادا ، ابوبردہ عامر نے مجھے خبر دی اور انہیں ان کے باپ ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي بُرْدَةَ، قَالَ أَخْبَرَنِي جَدِّي أَبُو بُرْدَةَ، عَنْ أَبِيهِ أَبِي مُوسَى الأَشْعَرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيَّ صلى الله عليه وسلم ‏ \"‏ الْخَازِنُ الأَمِينُ الَّذِي يُؤَدِّي مَا أُمِرَ بِهِ طَيِّبَةً نَفْسُهُ أَحَدُ الْمُتَصَدِّقَيْنِ ‏\"‏‏.‏",
                "headingArabic": "اسْتِئْجَارِ الرَّجُلِ الصَّالِحِ",
                "headingUrdu": "کسی متقی آدمی کی خدمات حاصل کرنا",
                "headingEnglish": "To hire a pious man",
                "chapterId": "38",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 38,
                    "chapterNumber": "38",
                    "chapterEnglish": "Hiring",
                    "chapterUrdu": "اجرت کے مسائل کا بیان",
                    "chapterArabic": "كتاب الإجارة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2166,
                "hadithNumber": "2261",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "I went to the Prophet (ﷺ) with two men from Ash`ari tribe. I said (to the Prophet), \"I do not know that they want employment.\" The Prophet (ﷺ) said, \"No, we do not appoint for our jobs anybody who demands it earnestly.\"",
                "hadithUrdu": "میں رسول کریم صلی اللہ علیہ وسلم کی خدمت میں آیا ۔ میرے ساتھ ( میرے قبیلہ ) اشعر کے دو مرد اور بھی تھے ۔ میں نے کہا کہ مجھے نہیں معلوم کہ یہ دونوں صاحبان حاکم بننے کے طلب گار ہیں ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص حاکم بننے کا خود خواہشمند ہو ، اسے ہم ہرگز حاکم نہیں بنائیں گے ۔ ( یہاں راوی کو شک ہے کہ ) آنحضرت صلی اللہ علیہ وسلم نے لفظ «لن» یا لفظ «لا» استعمال فرمایا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا کہا کہ ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے قرۃ بن خالد نے کہا کہ مجھ سے حمید بن ہلال نے بیان کیا ، ان سے ابوبردہ نے بیان کیا اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ قُرَّةَ بْنِ خَالِدٍ، قَالَ حَدَّثَنِي حُمَيْدُ بْنُ هِلاَلٍ، حَدَّثَنَا أَبُو بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ أَقْبَلْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَمَعِي رَجُلاَنِ مِنَ الأَشْعَرِيِّينَ، فَقُلْتُ مَا عَلِمْتُ أَنَّهُمَا يَطْلُبَانِ الْعَمَلَ‏.‏ فَقَالَ ‏ \"‏ لَنْ أَوْ لاَ نَسْتَعْمِلُ عَلَى عَمَلِنَا مَنْ أَرَادَهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "38",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 38,
                    "chapterNumber": "38",
                    "chapterEnglish": "Hiring",
                    "chapterUrdu": "اجرت کے مسائل کا بیان",
                    "chapterArabic": "كتاب الإجارة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2167,
                "hadithNumber": "2262",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah did not send any prophet but shepherded sheep.\" His companions asked him, \"Did you do the same?\" The Prophet (ﷺ) replied, \"Yes, I used to shepherd the sheep of the people of Mecca for some Qirats.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے کوئی ایسا نبی نہیں بھیجا جس نے بکریاں نہ چرائی ہوں ۔ اس پر آپ صلی اللہ علیہ وسلم کے صحابہ رضوان اللہ علیہم نے پوچھا کیا آپ نے بھی بکریاں چرائی ہیں ؟ فرمایا کہ ہاں ! کبھی میں بھی مکہ والوں کی بکریاں چند قیراط کی تنخواہ پر چرایا کرتا تھا ۔",
                "urduNarrator": "ہم سے احمد بن محمد مکی نے بیان کیا ، کہا کہ ہم سے عمرو بن یحییٰ نے بیان کیا ، ان سے ان کے دادا سعید بن عمرو نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَكِّيُّ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، عَنْ جَدِّهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَا بَعَثَ اللَّهُ نَبِيًّا إِلاَّ رَعَى الْغَنَمَ ‏\"‏‏.‏ فَقَالَ أَصْحَابُهُ وَأَنْتَ فَقَالَ ‏\"‏ نَعَمْ كُنْتُ أَرْعَاهَا عَلَى قَرَارِيطَ لأَهْلِ مَكَّةَ ‏\"‏‏.‏",
                "headingArabic": "رَعْىِ الْغَنَمِ عَلَى قَرَارِيطَ",
                "headingUrdu": "قیراط کے لیے بھیڑیں چرانا",
                "headingEnglish": "To shepherd sheep for Qirat",
                "chapterId": "38",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 38,
                    "chapterNumber": "38",
                    "chapterEnglish": "Hiring",
                    "chapterUrdu": "اجرت کے مسائل کا بیان",
                    "chapterArabic": "كتاب الإجارة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2168,
                "hadithNumber": "2263",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) and Abu Bakr رضی اللہ عنہ employed a (pagan) man from the tribe of Bani Ad-Dail and the tribe of Bani 'Abu bin `Adi as a guide. He was an expert guide and he broke the oath contract which he had to abide by with the tribe of Al-`Asi bin Wail and he was on the religion of Quraish pagans. The Prophet (ﷺ) and Abu Bakr رضی اللہ عنہ had confidence in him and gave him their riding camels and told him to bring them to the Cave of Thaur after three days. So, he brought them their two riding camels after three days and both of them (The Prophet (ﷺ) and Abu Bakr) set out accompanied by 'Amir bin Fuhaira and the Dili guide who guided them below Mecca along the road leading to the sea-shore.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ نے ( ہجرت کرتے وقت ) بنودیل کے ایک مرد کو نوکر رکھا جو بنو عبد بن عدی کے خاندان سے تھا ۔ اور اسے بطور ماہر راہبر مزدوری پر رکھا تھا ( حدیث کے لفظ ) «خريت» کے معنی راہبری میں ماہر کے ہیں ۔ اس نے اپنا ہاتھ پانی وغیرہ میں ڈبو کر عاص بن وائل کے خاندان سے عہد کیا تھا اور وہ کفار قریش ہی کے دین پر تھا ۔ لیکن آنحضرت صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کو اس پر بھروسہ تھا ۔ اسی لیے اپنی سواریاں انہوں نے اسے دے دیں اور غار ثور پر تین رات کے بعد اس سے ملنے کی تاکید کی تھی ۔ وہ شخص تین راتوں کے گزرتے ہی صبح کو دونوں حضرات کی سواریاں لے کر وہاں حاضر ہو گیا ۔ اس کے بعد یہ حضرات وہاں سے عامر بن فہیرہ اور اس دیلی راہبر کو ساتھ لے کر چلے ۔ یہ شخص ساحل کے کنارے سے آپ کو لے کر چلا تھا ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہم کو ہشام بن عروہ نے خبر دی ، انہیں معمر نے ، انہیں زہری نے ، انہیں عروہ بن زبیر نے اور انہیں عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ وَاسْتَأْجَرَ النَّبِيُّ صلى الله عليه وسلم وَأَبُو بَكْرٍ رَجُلاً مِنْ بَنِي الدِّيلِ ثُمَّ مِنْ بَنِي عَبْدِ بْنِ عَدِيٍّ هَادِيًا خِرِّيتًا ـ الْخِرِّيتُ الْمَاهِرُ بِالْهِدَايَةِ ـ قَدْ غَمَسَ يَمِينَ حِلْفٍ فِي آلِ الْعَاصِ بْنِ وَائِلٍ، وَهْوَ عَلَى دِينِ كُفَّارِ قُرَيْشٍ، فَأَمِنَاهُ فَدَفَعَا إِلَيْهِ رَاحِلَتَيْهِمَا، وَوَعَدَاهُ غَارَ ثَوْرٍ بَعْدَ ثَلاَثِ لَيَالٍ، فَأَتَاهُمَا بِرَاحِلَتَيْهِمَا، صَبِيحَةَ لَيَالٍ ثَلاَثٍ، فَارْتَحَلاَ، وَانْطَلَقَ مَعَهُمَا عَامِرُ بْنُ فُهَيْرَةَ، وَالدَّلِيلُ الدِّيلِيُّ فَأَخَذَ بِهِمْ أَسْفَلَ مَكَّةَ وَهْوَ طَرِيقُ السَّاحِلِ‏.‏",
                "headingArabic": "اسْتِئْجَارِ الْمُشْرِكِينَ عِنْدَ الضَّرُورَةِ أَوْ إِذَا لَمْ يُوجَدْ أَهْلُ الإِسْلاَمِ",
                "headingUrdu": "مشرکین کی ملازمت (مسلمانوں کی طرف سے)",
                "headingEnglish": "The employment of Mushrikun (by Muslims)",
                "chapterId": "38",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 38,
                    "chapterNumber": "38",
                    "chapterEnglish": "Hiring",
                    "chapterUrdu": "اجرت کے مسائل کا بیان",
                    "chapterArabic": "كتاب الإجارة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2169,
                "hadithNumber": "2264",
                "englishNarrator": "Narrated Urwa bin Zubair:",
                "hadithEnglish": "Aisha (the wife of the Prophet) Allah's Messenger (ﷺ) and Abu Bakr hired a man from the tribe of Bani-Ad-Dil as an expert guide who was a pagan (follower of the religion of the pagans of Quraish). The Prophet (ﷺ) and Abu Bakr gave him their two riding camels and took a promise from him to bring their riding camels in the morning of the third day to the Cave of Thaur.",
                "hadithUrdu": "اور ان سے نبی کریم صلی اللہ علیہ وسلم کی بیوی حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول کریم صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ نے بنو دیل کے ایک ماہر راہبر سے مزدوری طے کر لی تھی ۔ وہ شخص کفار قریش کے دین پر تھا ۔ ان دونوں حضرات نے اپنی دونوں اونٹنیاں اس کے حوالے کر دی تھیں اور کہہ دیا تھا کہ تین راتوں کے بعد صبح سویرے ہی سواروں کے ساتھ غار ثور پر آ جائے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ ہم سے لیث نے بیان کیا ، انہوں نے کہا کہ ہم سے عقیل نے کہ ابن شہاب نے بیان کیا کہ مجھے عروہ بن زبیر نے خبر دی",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ وَاسْتَأْجَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ رَجُلاً مِنْ بَنِي الدِّيلِ، هَادِيًا خِرِّيتًا وَهْوَ عَلَى دِينِ كُفَّارِ قُرَيْشٍ، فَدَفَعَا إِلَيْهِ رَاحِلَتَيْهِمَا، وَوَاعَدَاهُ غَارَ ثَوْرٍ بَعْدَ ثَلاَثِ لَيَالٍ بِرَاحِلَتَيْهِمَا صُبْحَ ثَلاَثٍ‏.‏",
                "headingArabic": "إِذَا اسْتَأْجَرَ أَجِيرًا لِيَعْمَلَ لَهُ بَعْدَ ثَلاَثَةِ أَيَّامٍ أَوْ بَعْدَ شَهْرٍ أَوْ بَعْدَ سَنَةٍ جَازَ، وَهُمَا عَلَى شَرْطِهِمَا الَّذِي اشْتَرَطَاهُ إِذَا جَاءَ الأَجَلُ",
                "headingUrdu": "اگر کوئی شخص کسی کو اپنے لیے کام پر رکھے تو یہ قانونی ہے۔",
                "headingEnglish": "It is legal if somebody hires someone to work for him",
                "chapterId": "38",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 38,
                    "chapterNumber": "38",
                    "chapterEnglish": "Hiring",
                    "chapterUrdu": "اجرت کے مسائل کا بیان",
                    "chapterArabic": "كتاب الإجارة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2170,
                "hadithNumber": "2265, 2266",
                "englishNarrator": "Narrated Ya`la bin Umaiya  رضی اللہ عنہ :",
                "hadithEnglish": "I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet (ﷺ) and in my opinion that was the best of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and cut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a complaint) but the Prophet (ﷺ) canceled the suit and said to the complainant, \"Did you expect him to let his finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" Narrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit the hand of another man and caused his own tooth to fall out, but Abu Bakr رضی اللہ عنہ judged that he had no right for compensation (for the broken tooth).",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ جیش عسرۃ ( غزوۃ تبوک ) میں گیا تھا یہ میرے نزدیک میرا سب سے زیادہ قابل اعتماد نیک عمل تھا ۔ میرے ساتھ ایک مزدور بھی تھا وہ ایک شخص سے جھگڑا اور ان میں سے ایک نے دوسرے مقابل والے کی انگلی چبا ڈالی ۔ دوسرے نے جو اپنا ہاتھ زور سے کھینچا تو اس کے آگے کے دانت بھی ساتھ ہی کھینچے چلے آئے اور گر گئے ۔ اس پر وہ شخص اپنا مقدمہ لے کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر پہنچا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس کے دانت ( ٹوٹنے کا ) کوئی قصاص نہیں دلوایا ۔ بلکہ فرمایا کہ کیا وہ انگلی تمہارے منہ میں چبانے کے لیے چھوڑ دیتا ۔ راوی نے کہا کہ میں خیال کرتا ہوں کہ آپ صلی اللہ علیہ وسلم نے یوں بھی فرمایا ۔ جس طرح اونٹ چبا لیا کرتا ہے ۔ ابن جریج نے کہا اور مجھ سے عبداللہ بن ابی ملیکہ نے بیان کیا اور ان سے ان کے دادا نے بالکل اسی طرح کا واقعہ بیان کیا کہ ایک شخص نے ایک دوسرے شخص کا ہاتھ کاٹ کھایا ۔ ( دوسرے نے اپنا ہاتھ کھینچا تو ) اس کاٹنے والے کا دانت ٹوٹ گیا اور ابوبکر رضی اللہ عنہ نے اس کا کوئی قصاص نہیں دلوایا ۔",
                "urduNarrator": "ہم سے یعقوب بن ابراہیم نے بیان کیا ، کہا کہ ہم سے اسماعیل بن علیہ نے بیان کیا ، کہا کہ ہمیں ابن جریج نے خبر دی ، کہا کہ مجھے عطا بن ابی رباح نے خبر دی ، انہیں صفوان بن یعلیٰ نے ، ان کو یعلیٰ بن امیہ رضی اللہ عنہ نے ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ صَفْوَانَ بْنِ يَعْلَى، عَنْ يَعْلَى بْنِ أُمَيَّةَ ـ رضى الله عنه ـ قَالَ غَزَوْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم جَيْشَ الْعُسْرَةِ فَكَانَ مِنْ أَوْثَقِ أَعْمَالِي فِي نَفْسِي، فَكَانَ لِي أَجِيرٌ، فَقَاتَلَ إِنْسَانًا، فَعَضَّ أَحَدُهُمَا إِصْبَعَ صَاحِبِهِ، فَانْتَزَعَ إِصْبَعَهُ، فَأَنْدَرَ ثَنِيَّتَهُ فَسَقَطَتْ، فَانْطَلَقَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَهْدَرَ ثَنِيَّتَهُ وَقَالَ ‏ \"‏ أَفَيَدَعُ إِصْبَعَهُ فِي فِيكَ تَقْضَمُهَا ـ قَالَ أَحْسِبُهُ قَالَ ـ كَمَا يَقْضَمُ الْفَحْلُ ‏\"‏‏. قَالَ ابْنُ جُرَيْجٍ وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، عَنْ جَدِّهِ، بِمِثْلِ هَذِهِ الصِّفَةِ أَنَّ رَجُلاً، عَضَّ يَدَ رَجُلٍ، فَأَنْدَرَ ثَنِيَّتَهُ، فَأَهْدَرَهَا أَبُو بَكْرٍ رضى الله عنه‏.‏",
                "headingArabic": "الأَجِيرِ فِي الْغَزْوِ",
                "headingUrdu": "مقدس لڑائیوں میں خدمات کے لیے مزدوروں کو ملازمت دینا",
                "headingEnglish": "Employing labourers for services in holy battles",
                "chapterId": "38",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 38,
                    "chapterNumber": "38",
                    "chapterEnglish": "Hiring",
                    "chapterUrdu": "اجرت کے مسائل کا بیان",
                    "chapterArabic": "كتاب الإجارة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2171,
                "hadithNumber": "2267",
                "englishNarrator": "Narrated Ubai bin Ka`b رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Both of them (Moses and Al-Khadir) proceeded on till they reached a wall which was about to fall.\" Sa`d said [?? or Sa`id], \"(Al-Khadir pointed) with his hands (towards the wall) and then raised his hands and the wall became straightened up.\" Ya`la said, \"I think Sa`id [?? or Sa`d] said, 'He (Khadir) passed his hand over it and it was straightened up.\" (Moses said to him), \"if you had wanted, you could have taken wages for it.\" Sa`id [?? or Sa`d] said, \"Wages with which to buy food . \"",
                "hadithUrdu": "مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ پھر وہ دونوں ( موسیٰ اور خضر علیہما السلام ) چلے ۔ تو انہیں ایک گاؤں میں ایک دیوار ملی جو گرنے ہی والی تھی ۔ سعید نے کہا خضر علیہ السلام نے اپنے ہاتھ سے اس طرح اشارہ کیا اور ہاتھ اٹھایا ، وہ دیوار سیدھی ہو گئی ۔ یعلیٰ نے کہا میرا خیال ہے کہ سعید نے کہا ، خضر علیہ السلام نے دیوار کو اپنے ہاتھ سے چھوا ، اور وہ سیدھی ہو گئی ، تب موسیٰ علیہ السلام بولے کہ اگر آپ چاہتے تو اس کام کی مزدوری لے سکتے تھے ۔ سعید نے کہا کہ ( حضرت موسیٰ علیہ السلام کی مراد یہ تھی کہ ) کوئی ایسی چیز مزدوری میں ( آپ کو لینی چاہئیے تھی ) جسے ہم کھا سکتے ( کیونکہ بستی والوں نے ان کو کھانا نہیں کھلایا تھا ) ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہم کو ہشام بن یوسف نے خبر دی ، کہا کہ مجھے یعلیٰ بن مسلم اور عمرو بن دینار نے سعید سے خبر دی ۔ یہ دونوں حضرات ( سعید بن جبیر سے اپنی روایتوں میں ) ایک دوسرے سے کچھ زیادہ روایت کرتے ہیں ۔ ابن جریج نے کہا میں نے یہ حدیث اوروں سے بھی سنی ہے ۔ وہ بھی سعید بن جبیر سے نقل کرتے تھے کہ مجھ سے ابن عباس رضی اللہ عنہما نے کہا ، اور ان سے ابی بن کعب رضی اللہ عنہ نے کہا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي يَعْلَى بْنُ مُسْلِمٍ، وَعَمْرُو بْنُ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِ، وَغَيْرُهُمَا قَالَ قَدْ سَمِعْتُهُ يُحَدِّثُهُ عَنْ سَعِيدٍ قَالَ قَالَ لِي ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ حَدَّثَنِي أُبَىُّ بْنُ كَعْبٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَانْطَلَقَا فَوَجَدَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ ‏\"‏‏.‏ قَالَ سَعِيدٌ بِيَدِهِ هَكَذَا، وَرَفَعَ يَدَيْهِ فَاسْتَقَامَ، قَالَ يَعْلَى حَسِبْتُ أَنَّ سَعِيدًا قَالَ‏.‏ فَمَسَحَهُ بِيَدِهِ فَاسْتَقَامَ ‏{‏قَالَ‏}‏ ‏\"‏لَوْ شِئْتَ لاَتَّخَذْتَ عَلَيْهِ أَجْرًا ‏\"‏‏.‏ قَالَ سَعِيدٌ أَجْرًا نَأْكُلُهُ‏.‏",
                "headingArabic": "إِذَا اسْتَأْجَرَ أَجِيرًا عَلَى أَنْ يُقِيمَ حَائِطًا يُرِيدُ أَنْ يَنْقَضَّ جَازَ",
                "headingUrdu": "کسی دیوار کی مرمت کے لیے کسی کو ملازم رکھنا جو گرنے والی ہو۔",
                "headingEnglish": "To employ someone to repair a wall which is about to collapse",
                "chapterId": "38",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 38,
                    "chapterNumber": "38",
                    "chapterEnglish": "Hiring",
                    "chapterUrdu": "اجرت کے مسائل کا بیان",
                    "chapterArabic": "كتاب الإجارة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2172,
                "hadithNumber": "2268",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Your example and the example of the people of the two Scriptures (i.e. Jews and Christians) is like the example of a man who employed some laborers and asked them, 'Who will work for me from morning till midday for one Qirat?' The Jews accepted and carried out the work. He then asked, Who will work for me from midday up to the `Asr prayer for one Qirat?' The Christians accepted and fulfilled the work. He then said, 'Who will work for me from the `Asr till sunset for two Qirats?' You, Muslims have accepted the offer. The Jews and the Christians got angry and said, 'Why should we work more and get lesser wages?' (Allah) said, 'Have I withheld part of your right?' They replied in the negative. He said, 'It is My Blessing, I bestow upon whomever I wish .'",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، تمہاری اور یہود و نصاریٰ کی مثال ایسی ہے کہ کسی شخص نے کئی مزدور کام پر لگائے اور کہا کہ میرا کام ایک قیراط پر صبح سے دوپہر تک کون کرے گا ؟ اس پر یہودیوں نے ( صبح سے دوپہر تک ) اس کا کام کیا ۔ پھر اس نے کہا کہ آدھے دن سے عصر تک ایک قیراط پر میرا کام کون کرے گا ؟ چنانچہ یہ کام پھر نصاری نے کیا ، پھر اس شخص نے کہا کہ عصر کے وقت سے سورج ڈوبنے تک میرا کام دو قیراط پر کون کرے گا ؟ اور تم ( امت محمدیہ ) ہی وہ لوگ ہو ( جن کو یہ درجہ حاصل ہوا ) اس پر یہود و نصاری نے برا مانا ، وہ کہنے لگے کہ کام تو ہم زیادہ کریں اور مزدوری ہمیں کم ملے ، پھر اس شخص نے کہا کہ اچھا یہ بتاؤ کیا تمہارا حق تمہیں پورا نہیں ملا ؟ سب نے کہا کہ ہمیں تو ہمارا پورا حق مل گیا ۔ اس شخص نے کہا کہ پھر یہ میرا فضل ہے میں جسے چاہوں زیادہ دوں ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، ان سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَثَلُكُمْ وَمَثَلُ أَهْلِ الْكِتَابَيْنِ كَمَثَلِ رَجُلٍ اسْتَأْجَرَ أُجَرَاءَ فَقَالَ مَنْ يَعْمَلُ لِي مِنْ غُدْوَةَ إِلَى نِصْفِ النَّهَارِ عَلَى قِيرَاطٍ فَعَمِلَتِ الْيَهُودُ، ثُمَّ قَالَ مَنْ يَعْمَلُ لِي مِنْ نِصْفِ النَّهَارِ إِلَى صَلاَةِ الْعَصْرِ عَلَى قِيرَاطٍ فَعَمِلَتِ النَّصَارَى ثُمَّ، قَالَ مَنْ يَعْمَلُ لِي مِنَ الْعَصْرِ إِلَى أَنْ تَغِيبَ الشَّمْسُ عَلَى قِيرَاطَيْنِ فَأَنْتُمْ هُمْ، فَغَضِبَتِ الْيَهُودُ وَالنَّصَارَى، فَقَالُوا مَا لَنَا أَكْثَرَ عَمَلاً، وَأَقَلَّ عَطَاءً قَالَ هَلْ نَقَصْتُكُمْ مِنْ حَقِّكُمْ قَالُوا لاَ‏.‏ قَالَ فَذَلِكَ فَضْلِي أُوتِيهِ مَنْ أَشَاءُ ‏\"‏‏.‏",
                "headingArabic": "الإِجَارَةِ إِلَى نِصْفِ النَّهَارِ",
                "headingUrdu": "دوپہر تک ملازمت",
                "headingEnglish": "Employment up to midday",
                "chapterId": "38",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 38,
                    "chapterNumber": "38",
                    "chapterEnglish": "Hiring",
                    "chapterUrdu": "اجرت کے مسائل کا بیان",
                    "chapterArabic": "كتاب الإجارة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2173,
                "hadithNumber": "2269",
                "englishNarrator": "Narrated `Abdullah bin `Umar bin Al-Khattab رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Your example and the example of Jews and Christians is like the example of a man who employed some laborers to whom he said, 'Who will work for me up to midday for one Qirat each?' The Jews carried out the work for one Qirat each; and then the Christians carried out the work up to the `Asr prayer for one Qirat each; and now you Muslims are working from the `Asr prayer up to sunset for two Qirats each. The Jews and Christians got angry and said, 'We work more and are paid less.' The employer (Allah) asked them, 'Have I usurped some of your right?' They replied in the negative. He said, 'That is My Blessing, I bestow upon whomever I wish.' \"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ تمہاری اور یہود و نصاریٰ کی مثال ایسی ہے کہ ایک شخص نے چند مزدور کام پر لگائے اور کہا کہ ایک ایک قیراط پر آدھے دن تک میری مزدوری کون کرے گا ؟ پس یہود نے ایک قیراط پر یہ مزدوری کی ۔ پھر نصاریٰ نے بھی ایک قیراط پر کام کیا ۔ پھر تم لوگوں نے عصر سے مغرب تک دو دو قیراط پر کام کیا ۔ اس پر یہود و نصاریٰ غصہ ہو گئے کہ ہم نے تو زیادہ کام کیا اور مزدوری ہم کو کم ملی ۔ اس پر اس شخص نے کہا کہ کیا میں نے تمہارا حق ذرہ برابر بھی مارا ہے ؟ تو انہوں نے کہا کہ نہیں ۔ پھر اس شخص نے کہا کہ یہ میرا فضل ہے جسے چاہوں زیادہ دیتا ہوں ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے عبداللہ بن عمر رضی اللہ عنہما کے غلام عبداللہ بن دینار نے بیان کیا ، اور ان سے عبداللہ بن عمر بن خطاب رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا مَثَلُكُمْ وَالْيَهُودُ وَالنَّصَارَى كَرَجُلٍ اسْتَعْمَلَ عُمَّالاً فَقَالَ مَنْ يَعْمَلُ لِي إِلَى نِصْفِ النَّهَارِ عَلَى قِيرَاطٍ قِيرَاطٍ فَعَمِلَتِ الْيَهُودُ عَلَى قِيرَاطٍ قِيرَاطٍ، ثُمَّ عَمِلَتِ النَّصَارَى عَلَى قِيرَاطٍ قِيرَاطٍ، ثُمَّ أَنْتُمُ الَّذِينَ تَعْمَلُونَ مِنْ صَلاَةِ الْعَصْرِ إِلَى مَغَارِبِ الشَّمْسِ عَلَى قِيرَاطَيْنِ قِيرَاطَيْنِ، فَغَضِبَتِ الْيَهُودُ وَالنَّصَارَى وَقَالُوا نَحْنُ أَكْثَرُ عَمَلاً وَأَقَلُّ عَطَاءً، قَالَ هَلْ ظَلَمْتُكُمْ مِنْ حَقِّكُمْ شَيْئًا قَالُوا لاَ‏.‏ فَقَالَ فَذَلِكَ فَضْلِي أُوتِيهِ مَنْ أَشَاءُ ‏\"‏‏.‏",
                "headingArabic": "الإِجَارَةِ إِلَى صَلاَةِ الْعَصْرِ",
                "headingUrdu": "عصر تک ملازمت",
                "headingEnglish": "Employment up to the Asr",
                "chapterId": "38",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 38,
                    "chapterNumber": "38",
                    "chapterEnglish": "Hiring",
                    "chapterUrdu": "اجرت کے مسائل کا بیان",
                    "chapterArabic": "كتاب الإجارة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2174,
                "hadithNumber": "2270",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah said, 'I will be an opponent to three types of people on the Day of Resurrection: -1. One who makes a covenant in My Name, but proves treacherous; -2. One who sells a free person and eats his price; and -3. One who employs a laborer and takes full work from him but does not pay him for his lab our.' \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے بتلایا کہ اللہ تعالیٰ کا فرمان ہے کہ تین قسم کے لوگ ایسے ہیں کہ جن کا قیامت میں میں خود مدعی بنوں گا ۔ ایک تو وہ شخص جس نے میرے نام پہ عہد کیا ، اور پھر وعدہ خلافی کی ۔ دوسرا وہ جس نے کسی آزاد آدمی کو بیچ کر اس کی قیمت کھائی اور تیسرا وہ شخص جس نے کسی کو مزدور کیا ، پھر کام تو اس سے پورا لیا ، لیکن اس کی مزدوری نہ دی ۔",
                "urduNarrator": "ہم سے یوسف بن محمد نے بیان کیا ، کہا کہ مجھ سے یحییٰ بن سلیم نے بیان کیا ، ان سے اسماعیل بن امیہ نے ، ان سے سعید بن ابی سعید نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا يُوسُفُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي يَحْيَى بْنُ سُلَيْمٍ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ قَالَ اللَّهُ تَعَالَى ثَلاَثَةٌ أَنَا خَصْمُهُمْ يَوْمَ الْقِيَامَةِ رَجُلٌ أَعْطَى بِي ثُمَّ غَدَرَ، وَرَجُلٌ بَاعَ حُرًّا فَأَكَلَ ثَمَنَهُ، وَرَجُلٌ اسْتَأْجَرَ أَجِيرًا فَاسْتَوْفَى مِنْهُ وَلَمْ يُعْطِهِ أَجْرَهُ ‏\"‏‏.‏",
                "headingArabic": "إِثْمِ مَنْ مَنَعَ أَجْرَ الأَجِيرِ",
                "headingUrdu": "جس نے ملازم کی اجرت روک لی اس کا گناہ",
                "headingEnglish": "The sin of him who withholds the wages of employee",
                "chapterId": "38",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 38,
                    "chapterNumber": "38",
                    "chapterEnglish": "Hiring",
                    "chapterUrdu": "اجرت کے مسائل کا بیان",
                    "chapterArabic": "كتاب الإجارة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2175,
                "hadithNumber": "2271",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The example of Muslims, Jews and Christians is like the example of a man who employed laborers to work for him from morning till night for specific wages. They worked till midday and then said, 'We do not need your money which you have fixed for us and let whatever we have done be annulled.' The man said to them, 'Don't quit the work, but complete the rest of it and take your full wages.' But they refused and went away. The man employed another batch after them and said to them, 'Complete the rest of the day and yours will be the wages I had fixed for the first batch.' So, they worked till the time of `Asr prayer. Then they said, \"Let what we have done be annulled and keep the wages you have promised us for yourself.' The man said to them, 'Complete the rest of the work, as only a little of the day remains,' but they refused. Thereafter he employed another batch to work for the rest of the day and they worked for the rest of the day till the sunset, and they received the wages of the two former batches. So, that was the example of those people (Muslims) and the example of this light (guidance) which they have accepted willingly.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، مسلمانوں کی اور یہود و نصاریٰ کی مثال ایسی ہے کہ ایک شخص نے چند آدمیوں کو مزدور کیا کہ یہ سب اس کا ایک کام صبح سے رات تک مقررہ اجرت پر کریں ۔ چنانچہ کچھ لوگوں نے یہ کام دوپہر تک کیا ۔ پھر کہنے لگے کہ ہمیں تمہاری اس مزدوری کی ضرورت نہیں ہے جو تم نے ہم سے طے کی ہے بلکہ جو کام ہم نے کر دیا وہ بھی غلط رہا ۔ اس پر اس شخص نے کہا کہ ایسا نہ کرو ۔ اپنا کام پورا کر لو اور اپنی پوری مزدوری لے جاؤ ، لیکن انہوں نے انکار کر دیا اور کام چھوڑ کر چلے گئے ۔ آخر اس نے دوسرے مزدور لگائے اور ان سے کہا کہ باقی دن پورا کر لو تو میں تمہیں وہی مزدوری دوں گا جو پہلے مزدوروں سے طے کی تھی ۔ چنانچہ انہوں نے کام شروع کیا ، لیکن عصر کی نماز کا وقت آیا تو انہوں نے بھی یہی کیا کہ ہم نے جو تمہارا کام کر دیا ہے وہ بالکل بیکار رہا ۔ وہ مزدوری بھی تم اپنے ہی پاس رکھو جو تم نے ہم سے طے کی تھی ۔ اس شخص نے ان کو سمجھایا کہ اپنا باقی کام پورا کر لو ۔ دن بھی اب تھوڑا ہی باقی رہ گیا ہے ، لیکن وہ نہ مانے ، آخر اس شخص نے دوسرے مزدور لگائے کہ یہ دن کا جو حصہ باقی رہ گیا ہے اس میں یہ کام کر دیں ۔ چنانچہ ان لوگوں نے سورج غروب ہونے تک دن کے بقیہ حصہ میں کام پورا کیا اور پہلے اور دوسرے مزدوروں کی مزدوری بھی سب ان ہی کو ملی ۔ تو مسلمانوں کی اور اس نور کی جس کو انہوں نے قبول کیا ، یہی مثال ہے ۔",
                "urduNarrator": "ہم سے محمد بن علاء نے بیان کیا ، کہا کہ ہم سے ابواسامہ نے بیان کیا ، ان سے یزید بن عبداللہ نے ، ان سے ابوبردہ نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَثَلُ الْمُسْلِمِينَ وَالْيَهُودِ وَالنَّصَارَى كَمَثَلِ رَجُلٍ اسْتَأْجَرَ قَوْمًا يَعْمَلُونَ لَهُ عَمَلاً يَوْمًا إِلَى اللَّيْلِ عَلَى أَجْرٍ مَعْلُومٍ، فَعَمِلُوا لَهُ إِلَى نِصْفِ النَّهَارِ فَقَالُوا لاَ حَاجَةَ لَنَا إِلَى أَجْرِكَ الَّذِي شَرَطْتَ لَنَا، وَمَا عَمِلْنَا بَاطِلٌ، فَقَالَ لَهُمْ لاَ تَفْعَلُوا أَكْمِلُوا بَقِيَّةَ عَمَلِكُمْ، وَخُذُوا أَجْرَكُمْ كَامِلاً، فَأَبَوْا وَتَرَكُوا، وَاسْتَأْجَرَ أَجِيرَيْنِ بَعْدَهُمْ فَقَالَ لَهُمَا أَكْمِلاَ بَقِيَّةَ يَوْمِكُمَا هَذَا، وَلَكُمَا الَّذِي شَرَطْتُ لَهُمْ مِنَ الأَجْرِ‏.‏ فَعَمِلُوا حَتَّى إِذَا كَانَ حِينُ صَلاَةِ الْعَصْرِ قَالاَ لَكَ مَا عَمِلْنَا بَاطِلٌ، وَلَكَ الأَجْرُ الَّذِي جَعَلْتَ لَنَا فِيهِ‏.‏ فَقَالَ لَهُمَا أَكْمِلاَ بَقِيَّةَ عَمَلِكُمَا، فَإِنَّ مَا بَقِيَ مِنَ النَّهَارِ شَىْءٌ يَسِيرٌ‏.‏ فَأَبَيَا، وَاسْتَأْجَرَ قَوْمًا أَنْ يَعْمَلُوا لَهُ بَقِيَّةَ يَوْمِهِمْ، فَعَمِلُوا بَقِيَّةَ يَوْمِهِمْ حَتَّى غَابَتِ الشَّمْسُ، وَاسْتَكْمَلُوا أَجْرَ الْفَرِيقَيْنِ كِلَيْهِمَا، فَذَلِكَ مَثَلُهُمْ وَمَثَلُ مَا قَبِلُوا مِنْ هَذَا النُّورِ ‏\"‏‏.‏",
                "headingArabic": "الإِجَارَةِ مِنَ الْعَصْرِ إِلَى اللَّيْلِ",
                "headingUrdu": "عصر سے رات تک ملازمت",
                "headingEnglish": "Employment from Asr till night",
                "chapterId": "38",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 38,
                    "chapterNumber": "38",
                    "chapterEnglish": "Hiring",
                    "chapterUrdu": "اجرت کے مسائل کا بیان",
                    "chapterArabic": "كتاب الإجارة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2176,
                "hadithNumber": "2272",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"Three men from among those who were before you, set out together till they reached a cave at night and entered it. A big rock rolled down the mountain and closed the mouth of the cave. They said (to each other), Nothing could save you from this rock but to invoke Allah by giving reference to the righteous deed which you have done (for Allah's sake only).' So, one of them said, 'O Allah! I had old parents and I never provided my family (wife, children etc.) with milk before them. One day, by chance I was delayed, and I came late (at night) while they had slept. I milked the sheep for them and took the milk to them, but I found them sleeping. I disliked to provide my family with the milk before them. I waited for them and the bowl of milk was in my hand and I kept on waiting for them to get up till the day dawned. Then they got up and drank the milk. O Allah! If I did that for Your Sake only, please relieve us from our critical situation caused by this rock.' So, the rock shifted a little but they could not get out.\" The Prophet (ﷺ) added, \"The second man said, 'O Allah! I had a cousin who was the dearest of all people to me and I wanted to have sexual relations with her but she refused. Later she had a hard time in a famine year and she came to me and I gave her one-hundred-and-twenty Dinars on the condition that she would not resist my desire, and she agreed. When I was about to fulfill my desire, she said: It is illegal for you to outrage my chastity except by legitimate marriage. So, I thought it a sin to have sexual intercourse with her and left her though she was the dearest of all the people to me, and also I left the gold I had given her. O Allah! If I did that for Your Sake only, please relieve us from the present calamity.' So, the rock shifted a little more but still they could not get out from there.\" The Prophet (ﷺ) added, \"Then the third man said, 'O Allah! I employed few laborers and I paid them their wages with the exception of one man who did not take his wages and went away. I invested his wages and I got much property thereby. (Then after some time) he came and said to me: O Allah's slave! Pay me my wages. I said to him: All the camels, cows, sheep and slaves you see, are yours. He said: O Allah's slave! Don't mock at me. I said: I am not mocking at you. So, he took all the herd and drove them away and left nothing. O Allah! If I did that for Your Sake only, please relieve us from the present suffering.' So, that rock shifted completely and they got out walking.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ پہلی امت کے تین آدمی کہیں سفر میں جا رہے تھے ۔ رات ہونے پر رات گزارنے کے لیے انہوں نے ایک پہاڑ کے غار میں پناہ لی ، اور اس میں اندر داخل ہو گئے ۔ اتنے میں پہاڑ سے ایک چٹان لڑھکی اور اس نے غار کا منہ بند کر دیا ۔ سب نے کہا کہ اب اس غار سے تمہیں کوئی چیز نکالنے والی نہیں ، سوا اس کے کہ تم سب ، اپنے سب سے زیادہ اچھے عمل کو یاد کر کے اللہ تعالیٰ سے دعا کرو ۔ اس پر ان میں سے ایک شخص نے اپنی دعا شروع کی کہ اے اللہ ! میرے ماں باپ بہت بوڑھے تھے اور میں روزانہ ان سے پہلے گھر میں کسی کو بھی دودھ نہیں پلاتا تھا ، نہ اپنے بال بچوں کو ، اور نہ اپنے غلام وغیرہ کو ۔ ایک دن مجھے ایک چیز کی تلاش میں رات ہو گئی اور جب میں گھر واپس ہوا تو وہ ( میرے ماں باپ ) سو چکے تھے ۔ پھر میں نے ان کے لیے شام کا دودھ نکالا ۔ جب ان کے پاس لایا تو وہ سوئے ہوئے تھے ۔ مجھے یہ بات ہرگز اچھی معلوم نہیں ہوئی کہ ان سے پہلے اپنے بال بچوں یا اپنے کسی غلام کو دودھ پلاؤں ، اس لیے میں ان کے سرہانے کھڑا رہا ۔ دودھ کا پیالہ میرے ہاتھ میں تھا اور میں ان کے جاگنے کا انتظار کر رہا تھا ۔ یہاں تک کہ صبح ہو گئی ۔ اب میرے ماں باپ جاگے اور انہوں نے اپنا شام کا دودھ اس وقت پیا ، اے اللہ ! اگر میں نے یہ کام محض تیری رضا حاصل کرنے کے لیے کیا تھا تو اس چٹان کی آفت کو ہم سے ہٹا دے ۔ اس دعا کے نتیجہ میں وہ غار تھوڑا سا کھل گیا ۔ مگر نکلنا اب بھی ممکن نہ تھا ۔ رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر دوسرے نے دعا کی ، اے اللہ ! میرے چچا کی ایک لڑکی تھی ۔ جو سب سے زیادہ مجھے محبوب تھی ، میں نے اس کے ساتھ برا کام کرنا چاہا ، لیکن اس نے نہ مانا ۔ اسی زمانہ میں ایک سال قحط پڑا ۔ تو وہ میرے پاس آئی میں نے اسے ایک سو بیس دینار اس شرط پر دیئے کہ وہ خلوت میں مجھے سے برا کام کرائے ۔ چنانچہ وہ راضی ہو گئی ۔ اب میں اس پر قابو پا چکا تھا ۔ لیکن اس نے کہا کہ تمہارے لیے میں جائز نہیں کرتی کہ اس مہر کو تم حق کے بغیر توڑو ۔ یہ سن کر میں اپنے برے ارادے سے باز آ گیا اور وہاں سے چلا آیا ۔ حالانکہ وہ مجھے سب سے بڑھ کر محبوب تھی اور میں نے اپنا دیا ہوا سونا بھی واپس نہیں لیا ۔ اے اللہ ! اگر یہ کام میں نے صرف تیری رضا کے لیے کیا تھا تو ہماری اس مصیبت کو دور کر دے ۔ چنانچہ چٹان ذرا سی اور کھسکی ، لیکن اب بھی اس سے باہر نہیں نکلا جا سکتا تھا ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اور تیسرے شخص نے دعا کی ۔ اے اللہ ! میں نے چند مزدور کئے تھے ۔ پھر سب کو ان کی مزدوری پوری دے دی ، مگر ایک مزدور ایسا نکلا کہ وہ اپنی مزدوری ہی چھوڑ گیا ۔ میں نے اس کی مزدوری کو کاروبار میں لگا دیا اور بہت کچھ نفع حاصل ہو گیا پھر کچھ دنوں کے بعد وہی مزدور میرے پاس آیا اور کہنے لگا اللہ کے بندے ! مجھے میری مزدوری دیدے ، میں نے کہا یہ جو کچھ تو دیکھ رہا ہے ۔ اونٹ ، گائے ، بکری اور غلام یہ سب تمہاری مزدوری ہی ہے ۔ وہ کہنے لگا اللہ کے بندے ! مجھ سے مذاق نہ کر ۔ میں نے کہا میں مذاق نہیں کرتا ، چنانچہ اس شخص نے سب کچھ لیا اور اپنے ساتھ لے گیا ۔ ایک چیز بھی اس میں سے باقی نہیں چھوڑی ۔ تو اے اللہ ! اگر میں نے یہ سب کچھ تیری رضا مندی حاصل کرنے کے لیے کیا تھا تو تو ہماری اس مصیبت کو دور کر دے ۔ چنانچہ وہ چٹان ہٹ گئی اور وہ سب باہر نکل کر چلے گئے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا کہ ہم کو شعیب نے خبر دی ، انہیں زہری نے خبر دی ، ان سے سالم بن عبداللہ نے بیان کیا ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ انْطَلَقَ ثَلاَثَةُ رَهْطٍ مِمَّنْ كَانَ قَبْلَكُمْ حَتَّى أَوَوُا الْمَبِيتَ إِلَى غَارٍ فَدَخَلُوهُ، فَانْحَدَرَتْ صَخْرَةٌ مِنَ الْجَبَلِ فَسَدَّتْ عَلَيْهِمُ الْغَارَ فَقَالُوا إِنَّهُ لاَ يُنْجِيكُمْ مِنْ هَذِهِ الصَّخْرَةِ إِلاَّ أَنْ تَدْعُوا اللَّهَ بِصَالِحِ أَعْمَالِكُمْ‏.‏ فَقَالَ رَجُلٌ مِنْهُمُ اللَّهُمَّ كَانَ لِي أَبَوَانِ شَيْخَانِ كَبِيرَانِ، وَكُنْتُ لاَ أَغْبِقُ قَبْلَهُمَا أَهْلاً وَلاَ مَالاً، فَنَأَى بِي فِي طَلَبِ شَىْءٍ يَوْمًا، فَلَمْ أُرِحْ عَلَيْهِمَا حَتَّى نَامَا، فَحَلَبْتُ لَهُمَا غَبُوقَهُمَا فَوَجَدْتُهُمَا نَائِمَيْنِ وَكَرِهْتُ أَنْ أَغْبِقَ قَبْلَهُمَا أَهْلاً أَوْ مَالاً، فَلَبِثْتُ وَالْقَدَحُ عَلَى يَدَىَّ أَنْتَظِرُ اسْتِيقَاظَهُمَا حَتَّى بَرَقَ الْفَجْرُ، فَاسْتَيْقَظَا فَشَرِبَا غَبُوقَهُمَا، اللَّهُمَّ إِنْ كُنْتُ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَفَرِّجْ عَنَّا مَا نَحْنُ فِيهِ مِنْ هَذِهِ الصَّخْرَةِ، فَانْفَرَجَتْ شَيْئًا لاَ يَسْتَطِيعُونَ الْخُرُوجَ ‏\"‏‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَقَالَ الآخَرُ اللَّهُمَّ كَانَتْ لِي بِنْتُ عَمٍّ كَانَتْ أَحَبَّ النَّاسِ إِلَىَّ، فَأَرَدْتُهَا عَنْ نَفْسِهَا، فَامْتَنَعَتْ مِنِّي حَتَّى أَلَمَّتْ بِهَا سَنَةٌ مِنَ السِّنِينَ، فَجَاءَتْنِي فَأَعْطَيْتُهَا عِشْرِينَ وَمِائَةَ دِينَارٍ عَلَى أَنْ تُخَلِّيَ بَيْنِي وَبَيْنَ نَفْسِهَا، فَفَعَلَتْ حَتَّى إِذَا قَدَرْتُ عَلَيْهَا قَالَتْ لاَ أُحِلُّ لَكَ أَنْ تَفُضَّ الْخَاتَمَ إِلاَّ بِحَقِّهِ‏.‏ فَتَحَرَّجْتُ مِنَ الْوُقُوعِ عَلَيْهَا، فَانْصَرَفْتُ عَنْهَا وَهْىَ أَحَبُّ النَّاسِ إِلَىَّ وَتَرَكْتُ الذَّهَبَ الَّذِي أَعْطَيْتُهَا، اللَّهُمَّ إِنْ كُنْتُ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ عَنَّا مَا نَحْنُ فِيهِ‏.‏ فَانْفَرَجَتِ الصَّخْرَةُ، غَيْرَ أَنَّهُمْ لاَ يَسْتَطِيعُونَ الْخُرُوجَ مِنْهَا‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم وَقَالَ الثَّالِثُ اللَّهُمَّ إِنِّي اسْتَأْجَرْتُ أُجَرَاءَ فَأَعْطَيْتُهُمْ أَجْرَهُمْ، غَيْرَ رَجُلٍ وَاحِدٍ تَرَكَ الَّذِي لَهُ وَذَهَبَ فَثَمَّرْتُ أَجْرَهُ حَتَّى كَثُرَتْ مِنْهُ الأَمْوَالُ، فَجَاءَنِي بَعْدَ حِينٍ فَقَالَ يَا عَبْدَ اللَّهِ أَدِّ إِلَىَّ أَجْرِي‏.‏ فَقُلْتُ لَهُ كُلُّ مَا تَرَى مِنْ أَجْرِكَ مِنَ الإِبِلِ وَالْبَقَرِ وَالْغَنَمِ وَالرَّقِيقِ‏.‏ فَقَالَ يَا عَبْدَ اللَّهِ لاَ تَسْتَهْزِئْ بِي‏.‏ فَقُلْتُ إِنِّي لاَ أَسْتَهْزِئُ بِكَ‏.‏ فَأَخَذَهُ كُلَّهُ فَاسْتَاقَهُ فَلَمْ يَتْرُكْ مِنْهُ شَيْئًا، اللَّهُمَّ فَإِنْ كُنْتُ فَعَلْتُ ذَلِكَ ابْتِغَاءَ وَجْهِكَ فَافْرُجْ عَنَّا مَا نَحْنُ فِيهِ‏.‏ فَانْفَرَجَتِ الصَّخْرَةُ فَخَرَجُوا يَمْشُونَ ‏\"‏‏.‏",
                "headingArabic": "مَنِ اسْتَأْجَرَ أَجِيرًا فَتَرَكَ أَجْرَهُ، فَعَمِلَ فِيهِ الْمُسْتَأْجِرُ فَزَادَ، أَوْ مَنْ عَمِلَ فِي مَالِ غَيْرِهِ فَاسْتَفْضَلَ",
                "headingUrdu": "مزدور مزدوری چھوڑ کر چلا گیا۔",
                "headingEnglish": "The labourer left the wages and went away",
                "chapterId": "38",
                "bookSlug": "sahih-bukhari",
                "volume": "3",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 38,
                    "chapterNumber": "38",
                    "chapterEnglish": "Hiring",
                    "chapterUrdu": "اجرت کے مسائل کا بیان",
                    "chapterArabic": "كتاب الإجارة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 2151,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=86",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=84",
                "label": "84",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=85",
                "label": "85",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=86",
                "label": "86",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=87",
                "label": "87",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=88",
                "label": "88",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=89",
                "label": "89",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=90",
                "label": "90",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=88",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=88",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=86",
        "to": 2175,
        "total": 40465
    }
}