{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 136,
        "data": [
            {
                "id": 3378,
                "hadithNumber": "3539",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Abu-l-Qasim صلی اللہ علیہ وسلم said, \"Name yourselves after me, but do not call yourselves by my Kuniya.\"",
                "hadithUrdu": "ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا ، میرے نام پر نام رکھو لیکن میری کنیت نہ رکھاکرو ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے ایوب نے ، ان سے ابن سیرین نے بیان کیا اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، آپ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم ‏ \"‏ سَمُّوا بِاسْمِي، وَلاَ تَكْتَنُوا بِكُنْيَتِي ‏\"‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3379,
                "hadithNumber": "3540",
                "englishNarrator": "Narrated Al-Ju'aid bin `Abdur Rahman:",
                "hadithEnglish": "I saw As-Sa'ib bin Yazid رضی اللہ عنہ when he was ninety-four years old, quite strong and of straight figure. He said, \"I know that I enjoyed my hearing and seeing powers only because of the invocation of Allah's Apostle . My aunt took me to him and said, 'O Allah's Messenger (ﷺ)! My nephew is sick; will you invoke Allah for him?' So he invoked (Allah) for me.\"",
                "hadithUrdu": "میں نے سائب بن یزید رضی اللہ عنہ کو چورانوے سال کی عمر میں دیکھا کہ خاصے قوی و توانا تھے ۔ انہوں نے کہا کہ مجھے یقین ہے کہ میرے کانوں اور آنکھوں سے جو میں نفع حاصل کر رہا ہوں وہ صرف رسول اللہ صلی اللہ علیہ وسلم کی دعا کی برکت ہے ۔ میری خالہ مجھے ایک مرتبہ آپ کی خدمت میں لے گئیں ۔ اور عرض کیا : یا رسول اللہ ! یہ میرا بھانجا بیمار ہے ، آپ اس کے لیے دعا فرما دیں ۔ انہوں نے بیان کیا کہ پھر آپ نے میرے لیے دعا فرمائی ۔",
                "urduNarrator": "مجھ سے اسحٰق بن راہویہ نے بیان کیا ، کہا ہم کو فضل بن موسیٰ نے خبر دی ، انہیں جعد بن عبدالرحمٰن نے کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى، عَنِ الْجُعَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، رَأَيْتُ السَّائِبَ بْنَ يَزِيدَ ابْنَ أَرْبَعٍ وَتِسْعِينَ جَلْدًا مُعْتَدِلاً فَقَالَ قَدْ عَلِمْتُ مَا مُتِّعْتُ بِهِ سَمْعِي وَبَصَرِي إِلاَّ بِدُعَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم، إِنَّ خَالَتِي ذَهَبَتْ بِي إِلَيْهِ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَ أُخْتِي شَاكٍ فَادْعُ اللَّهَ‏.‏ قَالَ فَدَعَا لِي‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3380,
                "hadithNumber": "3541",
                "englishNarrator": "Narrated As- Scab bin Yazid رضی اللہ عنہ :",
                "hadithEnglish": "My aunt took me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! My nephew is sick\"' The Prophet (ﷺ) passed his hands over my head and blessed me. Then he performed ablution and I drank the remaining water, and standing behind him. A saw the seal in between his shoulders.\" Ibn-e-Obaidullah says: \"الْحُجْلَةُ\" means the whiteness that is between the two eyes of horse. Ibrahim bin Hamza says: The exact word is زِرِّ الْحَجَلَةِ .",
                "hadithUrdu": "میری خالہ مجھے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے کر حاضر ہوئیں اور انہوں نے عرض کیا : یا رسول اللہ ! میرا بھانجا بیمار ہو گیا ہے ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے میرے سر پر دست مبارک پھیرا اور میرے لیے برکت کی دعا فرمائی ۔ اس کے بعد آپ نے وضو کیا تو میں نے آپ کے وضو کا پانی پیا ، پھر آپ کی پیٹھ کی طرف جاکے کھڑا ہو گیا اور میں نے مہر نبوت کو آپ کے دونوں مونڈھوں کے درمیان دیکھا ۔ محمد بن عبیداللہ نے کہا کہحجلہ ، حجل الفرس سے مشتق ہے جو گھوڑے کی اس سفیدی کو کہتے ہیں جو اس کی دونوں آنکھوں کے بیچ میں ہوتی ہے ۔ ابراہیم بن حمزہ نے کہا : مثل رزالحجلۃ یعنی رائے مہملہپہلے پھر زائے معجمہ ۔ امام بخاری رحمہ اللہ نے کہا کہ صحیح یہ ہے کہ رائے مہملہ پہلے ہے ۔",
                "urduNarrator": "ہم سے محمدبن عبیداللہ نے بیان کیا ، کہا ہم سے حاتم بن اسماعیل نے بیان کیا ، ان سے جعید بن عبدالرحمٰن نے بیان کیا اور انہوں نے سائب بن یزید رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ، حَدَّثَنَا حَاتِمٌ، عَنِ الْجُعَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، قَالَ ذَهَبَتْ بِي خَالَتِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَ أُخْتِي‏.‏ وَقَعَ فَمَسَحَ رَأْسِي وَدَعَا لِي بِالْبَرَكَةِ، وَتَوَضَّأَ فَشَرِبْتُ مِنْ وَضُوئِهِ، ثُمَّ قُمْتُ خَلْفَ ظَهْرِهِ فَنَظَرْتُ إِلَى خَاتَمٍ بَيْنَ كَتِفَيْهِ‏.‏ قَالَ ابْنُ عُبَيْدِ اللَّهِ الْحُجْلَةُ مِنْ حُجَلِ الْفَرَسِ الَّذِي بَيْنَ عَيْنَيْهِ‏.‏ قَالَ إِبْرَاهِيمُ بْنُ حَمْزَةَ مِثْلَ زِرِّ الْحَجَلَةِ",
                "headingArabic": "خَاتِمِ النُّبُوَّةِ",
                "headingUrdu": "مہر نبوت",
                "headingEnglish": "The seal of Prophethood",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3381,
                "hadithNumber": "3542",
                "englishNarrator": "Narrated `Uqba bin Al-Harith:",
                "hadithEnglish": "(Once) Abu Bakr رضی اللہ عنہ offered the `Asr prayer and then went out walking and saw Al-Hasan playing with the boys. He lifted him on to his shoulders and said, \" Let my parents be sacrificed for your sake! (You) resemble the Prophet (ﷺ) and not `Ali,\" while `Ali was smiling.",
                "hadithUrdu": "حضرت ابوبکر رضی اللہ عنہ عصر کی نماز سے فارغ ہو کر مسجد سے باہر نکلے تو دیکھا کہ حضرت حسن بچوں کے ساتھ کھیل رہے ہیں ۔ حضرت صدیق رضی اللہ عنہ نے ان کو اپنے کندھے پر بٹھا لیا اور فرمایا : میرے باپ تم پر قربان ہوں تم میں نبی کریم صلی اللہ علیہ وسلم کی شباہت ہے ۔ علی کی نہیں ۔ یہ سن کر حضرت علی ہنس رہے تھے ( خوش ہو رہے تھے ) ۔",
                "urduNarrator": "ہم سے ابوعاصم نے بیان کیا ، ان سے عمر بن سعید بن ابی حسین نے بیان کیا ، ان سے ابن ابی ملیکہ نے اور ان سے عقبہ بن حارث نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ عُمَرَ بْنِ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، قَالَ صَلَّى أَبُو بَكْرٍ ـ رضى الله عنه ـ الْعَصْرَ، ثُمَّ خَرَجَ يَمْشِي فَرَأَى الْحَسَنَ يَلْعَبُ مَعَ الصِّبْيَانِ، فَحَمَلَهُ عَلَى عَاتِقِهِ وَقَالَ بِأَبِي شَبِيهٌ بِالنَّبِيِّ لاَ شَبِيهٌ بِعَلِيٍّ‏.‏ وَعَلِيٌّ يَضْحَكُ‏.‏",
                "headingArabic": "صِفَةِ النَّبِيِّ صلى الله عليه وسلم",
                "headingUrdu": "نبی صلی اللہ علیہ وسلم کا بیان",
                "headingEnglish": "The description of the Prophet (saws)",
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3382,
                "hadithNumber": "3543",
                "englishNarrator": "Narrated Abu Juhaifa رضی اللہ عنہ :",
                "hadithEnglish": "I saw the Prophet, and Al-Hasan رضی اللہ عنہ resembled him.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کو میں نے دیکھا تھا ۔ حضرت حسن رضی اللہ عنہ میں آپ کی پوری شباہت موجود تھی ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے زبیر نے بیان کیا ، کہا ہم سے اسماعیل بن ابی خالد نے بیان کیا اور ان سے ابوحجیفہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَبِي جُحَيْفَةَ ـ رضى الله عنه ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَكَانَ الْحَسَنُ يُشْبِهُهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3383,
                "hadithNumber": "3544",
                "englishNarrator": "Narrated Abii Juhaifa رضی اللہ عنہ :",
                "hadithEnglish": "I heard saying, \"I saw the Prophet, and Al-Hasan bin `Ali رضی اللہ عنہ resembled him.\" I said to Abu- Juhaifa\r\n رضی اللہ عنہ , \"Describe him for me.\" He said, \"He was white and his beard was black with some white hair. He promised to give us 13 young she-camels, but he expired before we could get them.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا ہے ، حسن بن علی رضی اللہ عنہ میں آپ کی شباہت پوری طرح موجود تھی ۔ اسماعیل بن ابی خالد نے کہا ، میں نے ابوجحیفہ رضی اللہ عنہ سے عرض کیا کہ آپ آنحضرت صلی اللہ علیہ وسلم کی صفت بیان کریں ۔ انہوں نے کہا آپ سفید رنگ کے تھے ، کچھ بال سفید ہو گئے تھے اور آپ نے ہمیں تیرہ اونٹنیوں کے دیئے جانے کا حکم کیا تھا ۔ لیکن ابھی ہم نے ان اونٹنیوں کو اپنے قبضہ میں بھی نہیں لیا تھا کہ آپ کی وفات ہو گئی ۔",
                "urduNarrator": "مجھ سے عمرو بن علی فلاس نے بیان کیا ، کہا ہم سے ابن فضیل نے بیان کیا ، کہا ہم سے اسماعیل بن ابی خالد نے بیان کیا ، کہا کہ میں نے ابوجحیفہ رضی اللہ عنہ سے سنا ۔ وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ ـ رضى الله عنه ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَكَانَ الْحَسَنُ بْنُ عَلِيٍّ ـ عَلَيْهِمَا السَّلاَمُ ـ يُشْبِهُهُ قُلْتُ لأَبِي جُحَيْفَةَ صِفْهُ لِي‏.‏ قَالَ كَانَ أَبْيَضَ قَدْ شَمِطَ‏.‏ وَأَمَرَ لَنَا النَّبِيُّ صلى الله عليه وسلم بِثَلاَثَ عَشْرَةَ قَلُوصًا قَالَ فَقُبِضَ النَّبِيُّ صلى الله عليه وسلم قَبْلَ أَنْ نَقْبِضَهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3384,
                "hadithNumber": "3545",
                "englishNarrator": "Narrated Wahb Abu Juhaifa As-Sawwai رضی اللہ عنہ :",
                "hadithEnglish": "I saw the Prophet (ﷺ) and saw some white hair below his lower lip above the chin.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا ۔ آپ کے نچلے ہونٹ مبارک کے نیچے ٹھوڑی کے کچھ بال سفید تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن رجاء نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے ابواسحٰق نے ، ان سے وہب نے ، ان سے ابوجحیفہ سوائی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنْ وَهْبٍ أَبِي جُحَيْفَةَ السُّوَائِيِّ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَرَأَيْتُ بَيَاضًا مِنْ تَحْتِ شَفَتِهِ السُّفْلَى الْعَنْفَقَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3385,
                "hadithNumber": "3546",
                "englishNarrator": "Narrated Hariz bin `Uthman:",
                "hadithEnglish": "That he asked `Abdullah bin Busr رضی اللہ عنہ (i.e. the companion of the Prophet), \"Did you see the Prophet (ﷺ) when he was old?\" He said, \"He had a few white hairs between the lower lip and the chin.\"",
                "hadithUrdu": "اور انہوں نے نبی کریم صلی اللہ علیہ وسلم کے صحابی عبداللہ بن بسر رضی اللہ عنہ سے پوچھا ، کیا رسول اللہ صلی اللہ علیہ وسلم بوڑھے ہو گئے تھے ؟ انہوں نے کہا کہ آپ کی ٹھوڑی کے چند بال سفید ہو گئے تھے ۔",
                "urduNarrator": "ہم سے عصام بن خالد نے بیان کیا ، انہوں نے کہا ہم سے حریز بن عثمان نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا عِصَامُ بْنُ خَالِدٍ، حَدَّثَنَا حَرِيزُ بْنُ عُثْمَانَ، أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ بُسْرٍ صَاحِبَ النَّبِيِّ صلى الله عليه وسلم قَالَ أَرَأَيْتَ النَّبِيَّ صلى الله عليه وسلم كَانَ شَيْخًا قَالَ كَانَ فِي عَنْفَقَتِهِ شَعَرَاتٌ بِيضٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3386,
                "hadithNumber": "3547",
                "englishNarrator": "Narrated Rabi`a bin Abi `Abdur-Rahman:",
                "hadithEnglish": "I heard Anas bin Malik رضی اللہ عنہ describing the Prophet (ﷺ) saying, \"He was of medium height amongst the people, neither tall nor short; he had a rosy color, neither absolutely white nor deep brown; his hair was neither completely curly nor quite lank. Divine Inspiration was revealed to him when he was forty years old. He stayed ten years in Mecca receiving the Divine Inspiration, and stayed in Medina for ten more years. When he expired, he had scarcely twenty white hairs in his head and beard.\" Rabi`a said, \"I saw some of his hairs and it was red. When I asked about that, I was told that it turned red because of scent. \"",
                "hadithUrdu": "میں نے انس بن مالک رضی اللہ عنہ سے سنا ، آپ نے نبی کریم صلی اللہ علیہ وسلم کے اوصاف مبارکہ بیان کرتے ہوئے بتلایا کہ آپ درمیانہ قد کے تھے ۔ نہ بہت لمبے اور نہ چھوٹے قد والے ۔ رنگ کھلتا ہوا تھا ( سرخ و سفید ) نہ خالی سفید تھے اور نہ بالکل گندم گوں ۔ آپ کے بال نہ بالکل مڑے ہوئے سخت قسم کے تھے اور نہ سیدھے لٹکے ہوئے ہی تھے ۔ نزول وحی کے وقت آپ کی عمر چالیس سال تھی ۔ مکہ میں آپ نے دس سال تک قیام فرمایا اور اس پورے عرصہ میں آپ پر وحی نازل ہوتی رہی اور مدینہ میں بھی آپ کا قیام دس سال تک رہا ۔ آپ کے سر اور داڑھی میں بیس بال بھی سفید نہیں ہوئے تھے ۔ ربیعہ ( راوی حدیث ) نے بیان کیا کہ پھر میں نے آپ صلی اللہ علیہ وسلم کا ایک بال دیکھا تو وہ لال تھا میں نے اس کے متعلق پوچھا تو مجھے بتایا گیا کہ خوشبو لگاتے لگاتے لال ہو گیا ہے ۔",
                "urduNarrator": "مجھ سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ مجھ سے لیث نے بیان کیا ، ان سے خالد نے ، ان سے سعید بن ابی ہلال نے ، ان سے ربیعہ بن ابی عبدالرحمٰن نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي ابْنُ بُكَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ خَالِدٍ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَصِفُ النَّبِيَّ صلى الله عليه وسلم قَالَ كَانَ رَبْعَةً مِنَ الْقَوْمِ، لَيْسَ بِالطَّوِيلِ وَلاَ بِالْقَصِيرِ، أَزْهَرَ اللَّوْنِ لَيْسَ بِأَبْيَضَ أَمْهَقَ وَلاَ آدَمَ، لَيْسَ بِجَعْدٍ قَطَطٍ وَلاَ سَبْطٍ رَجِلٍ، أُنْزِلَ عَلَيْهِ وَهْوَ ابْنُ أَرْبَعِينَ، فَلَبِثَ بِمَكَّةَ عَشْرَ سِنِينَ يُنْزَلُ عَلَيْهِ وَبِالْمَدِينَةِ عَشْرَ سِنِينَ، وَلَيْسَ فِي رَأْسِهِ وَلِحْيَتِهِ عِشْرُونَ شَعَرَةً بَيْضَاءَ‏.‏ قَالَ رَبِيعَةُ فَرَأَيْتُ شَعَرًا مِنْ شَعَرِهِ، فَإِذَا هُوَ أَحْمَرُ فَسَأَلْتُ فَقِيلَ احْمَرَّ مِنَ الطِّيبِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3387,
                "hadithNumber": "3548",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) was neither very tall nor short, neither absolutely white nor deep brown. His hair was neither curly nor lank. Allah sent him (as an Apostle) when he was forty years old. Afterwards he resided in Mecca for ten years and in Medina for ten more years. When Allah took him unto Him, there was scarcely twenty white hairs in his head and beard.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نہ بہت لمبے تھے اور نہ چھوٹے قد کے ، نہ بالکل سفید تھے اور نہ گندمی رنگ کے ۔ نہ آپ کے بال بہت زیادہ گھونگھریالے تھے اور نہ بالکل سیدھے لٹکے ہوئے ، اللہ تعالیٰ نے آپ کو چالیس سال کی عمر میں نبوت دی اور آپ نے مکہ میں دس سال تک قیام کیا اور مدینہ میں دس سال تک قیام کیا ۔ جب اللہ تعالیٰ نے آپ کو وفات دی تو آپ کے سر اور داڑھی کے بیس بال بھی سفید نہیں تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو مالک بن انس نے خبر دی ، انہیں ربیعہ بن ابی عبدالرحمٰن نے اور انہوں نے انس بن مالک رضی اللہ عنہ سے سنا ، آپ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ سَمِعَهُ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْسَ بِالطَّوِيلِ الْبَائِنِ وَلاَ بِالْقَصِيرِ، وَلاَ بِالأَبْيَضِ الأَمْهَقِ، وَلَيْسَ بِالآدَمِ وَلَيْسَ بِالْجَعْدِ الْقَطَطِ وَلاَ بِالسَّبْطِ، بَعَثَهُ اللَّهُ عَلَى رَأْسِ أَرْبَعِينَ سَنَةً، فَأَقَامَ بِمَكَّةَ عَشْرَ سِنِينَ، وَبِالْمَدِينَةِ عَشْرَ سِنِينَ، فَتَوَفَّاهُ اللَّهُ، وَلَيْسَ فِي رَأْسِهِ وَلِحْيَتِهِ عِشْرُونَ شَعْرَةً بَيْضَاءَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3388,
                "hadithNumber": "3549",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) was the handsomest of all the people, and had the best appearance. He was neither very tall nor short.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم حسن و جمال میں بھی سب سے بڑھ کر تھے اور جسمانی ساخت میں بھی سب سے بہتر تھے ۔ آپ کا قد نہ بہت لمبا تھا اور نہ چھوٹا ( بلکہ درمیانہ قد تھا ) ۔",
                "urduNarrator": "ہم سے ابوعبداللہ احمد بن سعید نے بیان کیا ، کہا ہم سے اسحٰق بن منصور نے بیان کیا ، کہا ہم سے ابراہیم بن یوسف نے بیان کیا ، ان سے ان کے والد نے ، ان سے ابواسحٰق نے بیان کیا کہ میں نے براء بن عازب رضی اللہ عنہما سے سنا ، آپ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ أَبُو عَبْدِ اللَّهِ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحْسَنَ النَّاسِ وَجْهًا وَأَحْسَنَهُ خَلْقًا، لَيْسَ بِالطَّوِيلِ الْبَائِنِ وَلاَ بِالْقَصِيرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3389,
                "hadithNumber": "3550",
                "englishNarrator": "Narrated Qatada:",
                "hadithEnglish": "I asked Anas رضی اللہ عنہ , \"Did the Prophet (ﷺ) use to dye (his) hair?\" He said, \"No, for there were only a few white hairs on his temples.\"",
                "hadithUrdu": "میں نے انس رضی اللہ عنہ سے پوچھا کیا رسول اللہ صلی اللہ علیہ وسلم نے کبھی خضاب بھی استعمال فرمایا تھا ؟ انہوں نے کہا کہ آپ نے کبھی خضاب نہیں لگایا ۔ صرف آپ کی دو نوں کنپٹیوں پر ( سر میں ) چند بال سفید تھے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، قَالَ سَأَلْتُ أَنَسًا هَلْ خَضَبَ النَّبِيُّ صلى الله عليه وسلم قَالَ لاَ، إِنَّمَا كَانَ شَىْءٌ فِي صُدْغَيْهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3390,
                "hadithNumber": "3551",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) was of moderate height having broad shoulders (long) hair reaching his ear-lobes. Once I saw him in a red cloak and I had never seen a more handsome than him.\" Yousuf bin Abu Ishaq reports from his father: His hair reached his shoulders.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم درمیانہ قد کے تھے ۔ آپ کا سینہ بہت کشادہ اور کھلا ہوا تھا ۔ آپ کے ( سر کے ) بال کانوں کی لو تک لٹکتے رہتے تھے ۔ میں نے آنحضرت صلی اللہ علیہ وسلم کو ایک مرتبہ ایک سرخ جوڑے میں دیکھا ۔ میں نے آپ سے بڑھ کر حسین کسی کو نہیں دیکھا تھا ۔ یوسف بن ابی اسحٰق نے اپنے والد کے واسطہ سے ” الی منکبیہ “ بیان کیا ( بجائے لفظ ” شحمۃ اذنیہ ) یعنی آپ کے بال مونڈھوں تک پہنچتے تھے ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ، ہم سے شعبہ نے بیان کیا ، ان سے ابواسحٰق نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم مَرْبُوعًا، بَعِيدَ مَا بَيْنَ الْمَنْكِبَيْنِ، لَهُ شَعَرٌ يَبْلُغُ شَحْمَةَ أُذُنِهِ، رَأَيْتُهُ فِي حُلَّةٍ حَمْرَاءَ، لَمْ أَرَ شَيْئًا قَطُّ أَحْسَنَ مِنْهُ‏.‏ قَالَ يُوسُفُ بْنُ أَبِي إِسْحَاقَ عَنْ أَبِيهِ إِلَى مَنْكِبَيْهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3391,
                "hadithNumber": "3552",
                "englishNarrator": "Narrated Abu 'Is-haq:",
                "hadithEnglish": "Al-Bara' رضی اللہ عنہ was asked, \"Was the face of the Prophet (as bright) as a sword?\" He said, \"No, but (as bright) as a moon.\"",
                "hadithUrdu": "کسی نے براء رضی اللہ عنہ سے پوچھا ، کیا رسول اللہ صلی اللہ علیہ وسلم کا چہرہ تلوار کی طرح ( لمبا پتلا ) تھا ؟ انہوں نے کہا نہیں ، چہرہ مبارک چاند کی طرح ( گول اور خوبصورت ) تھا ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، ان سے ابواسحٰق نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، قَالَ سُئِلَ الْبَرَاءُ أَكَانَ وَجْهُ النَّبِيِّ صلى الله عليه وسلم مِثْلَ السَّيْفِ قَالَ لاَ بَلْ مِثْلَ الْقَمَرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3392,
                "hadithNumber": "3553",
                "englishNarrator": "Narrated Abu Juhaifa رضی اللہ عنہ :",
                "hadithEnglish": "Once Allah's Messenger (ﷺ) went to Al-Batha' at noon, performed the ablution and offered' a two rak`at Zuhr prayer and a two-rak`at `Asr prayer while a spearheaded stick was planted before him and the passersby were passing in front of it. (After the prayer), the people got up and held the hands of the Prophet and passed them on their faces. I also took his hand and kept it on my face and noticed that it was colder than ice, and its smell was nicer than musk.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم دوپہر کے وقت سفر کے ارادہ سے نکلے ۔ بطحاء نامی جگہ پر پہنچ کر آپ نے وضو کیا اور ظہر کی نماز دو رکعت ( قصر ) پڑھی پھر عصر کی بھی دو رکعت ( قصر ) پڑھی ۔ آپ کے سامنے ایک چھوٹا سا نیزہ ( بطور سترہ ) گڑا ہوا تھا ۔ عون نے اپنے والد سے اس روایت میں یہ زیادہ کیا ہے کہ ابوجحیفہ رضی اللہ عنہ نے کہا کہ اس نیزہ کے آگے سے آنے جانے والے آ جا رہے تھے ۔ پھر صحابہ آپ کے پاس آ گئے اور آپ کے مبارک ہاتھوں کو تھام کر اپنے چہروں پر پھیرنے لگے ۔ ابوجحیفہ رضی اللہ عنہ نے بیان کیا کہ میں نے بھی آپ کے دست مبارک کو اپنے چہرے پر رکھا ۔ اس وقت وہ برف سے بھی زیادہ ٹھنڈا اور مشک سے بھی زیادہ خوشبودار تھا ۔",
                "urduNarrator": "ہم سے ابوعلی حسن بن منصور نے بیان کیا ، کہا ہم سے حجاج بن محمد الاعور نے مصیصہ ( شہر میں ) بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حکم نے بیان کیا کہ میں نے ابوجحیفہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ مَنْصُورٍ أَبُو عَلِيٍّ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ الأَعْوَرُ، بِالْمَصِّيصَةِ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْهَاجِرَةِ إِلَى الْبَطْحَاءِ فَتَوَضَّأَ ثُمَّ صَلَّى الظُّهْرَ رَكْعَتَيْنِ، وَالْعَصْرَ رَكْعَتَيْنِ، وَبَيْنَ يَدَيْهِ عَنَزَةٌ‏.‏ ‏{‏قَالَ شُعْبَةُ‏}‏ وَزَادَ فِيهِ عَوْنٌ عَنْ أَبِيهِ أَبِي جُحَيْفَةَ قَالَ كَانَ يَمُرُّ مِنْ وَرَائِهَا الْمَرْأَةُ، وَقَامَ النَّاسُ فَجَعَلُوا يَأْخُذُونَ يَدَيْهِ، فَيَمْسَحُونَ بِهَا وُجُوهَهُمْ، قَالَ فَأَخَذْتُ بِيَدِهِ، فَوَضَعْتُهَا عَلَى وَجْهِي، فَإِذَا هِيَ أَبْرَدُ مِنَ الثَّلْجِ، وَأَطْيَبُ رَائِحَةً مِنَ الْمِسْكِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3393,
                "hadithNumber": "3554",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) was the most generous of all the people, and he used to become more generous in Ramadan when Gabriel met him. Gabriel used to meet him every night during Ramadan to revise the Qur'an with him. Allah's Messenger (ﷺ) then used to be more generous than the fast wind.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سب سے زیادہ سخی تھے اور رمضان میں جب آپ سے جبرائیل علیہ السلام کی ملاقات ہوتی تو آپ کی سخاوت اور بھی بڑھ جایا کرتی تھی ۔ جبرائیل علیہ السلام رمضان کی ہر رات میں آپ سے ملاقات کے لیے تشریف لاتے اور آپ کے ساتھ قرآن مجید کا دور کرتے ۔ اس وقت رسول اللہ صلی اللہ علیہ وسلم خیر و بھلائی کے معاملے میں تیز چلنے والی ہوا سے بھی زیادہ سخی ہو جاتے تھے ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، کہا ہم سے عبداللہ نے بیان کیا ، کہا ہم کو یونس نے خبر دی ، ان سے زہری نے بیان کیا ، کہا مجھ سے عبیداللہ بن عبداللہ نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، حَدَّثَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم أَجْوَدَ النَّاسِ، وَأَجْوَدُ مَا يَكُونُ فِي رَمَضَانَ، حِينَ يَلْقَاهُ جِبْرِيلُ، وَكَانَ جِبْرِيلُ ـ عَلَيْهِ السَّلاَمُ ـ يَلْقَاهُ فِي كُلِّ لَيْلَةٍ مِنْ رَمَضَانَ، فَيُدَارِسُهُ الْقُرْآنَ فَلَرَسُولُ اللَّهِ صلى الله عليه وسلم أَجْوَدُ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3394,
                "hadithNumber": "3555",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) came to her in a happy mood with his features glittering with joy, and said, \"Have you not heard what the Qaif has said about Zaid and Us-ama? He saw their feet and remarked. These belong to each other.\" (i.e. They are father and son.)",
                "hadithUrdu": "ایک مرتبہ رسول اللہ صلی اللہ علیہ وسلم ان کے یہاں بہت ہی خوش خوش داخل ہوئے ، خوشی اور مسرت سے پیشانی کی لکیریں چمک رہی تھیں ۔ پھر آپ نے فرمایا : عائشہ ! تم نے سنا نہیں مجزز مدلجی نے زید و اسامہ کے صرف قدم دیکھ کر کیا بات کہی ؟ اس نے کہا کہ ایک کے پاؤں دوسرے کے پاؤں سے ملتے ہوئے نظر آتے ہیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم سے ابن جریج نے بیان کیا ، کہا کہ مجھے ابن شہاب نے خبر دی ، انہیں عروہ نے اور انہیں عائشہ رضی اللہ عنہا نے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَيْهَا مَسْرُورًا تَبْرُقُ أَسَارِيرُ وَجْهِهِ، فَقَالَ ‏ \"‏ أَلَمْ تَسْمَعِي مَا قَالَ الْمُدْلِجِيُّ لِزَيْدٍ وَأُسَامَةَ ـ وَرَأَى أَقْدَامَهُمَا ـ إِنَّ بَعْضَ هَذِهِ الأَقْدَامِ مِنْ بَعْضٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3395,
                "hadithNumber": "3556",
                "englishNarrator": "Narrated `Abdullah bin Ka`b رضی اللہ عنہ :",
                "hadithEnglish": "I heard Ka`b bin Malik talking after his failure to join (the Ghazwa of) Tabuk. He said, \"When I greeted Allah's Messenger (ﷺ) whose face was glittering with happiness, for whenever Allah's Messenger (ﷺ) was happy, his face used to glitter, as if it was a piece of the moon, and we used to recognize it (i.e. his happiness) from his face.\"",
                "hadithUrdu": "آپ غزوہ تبوک میں اپنے پیچھے رہ جانے کا واقعہ بیان کر رہے تھے ۔ انہوں نے بیان کیا کہ پھر میں نے ( توبہ قبول ہونے کے بعد ) حاضر ہو کر رسول اللہ صلی اللہ علیہ وسلم کو سلام کیا تو چہرہ مبارک مسرت و خوشی سے چمک رہا تھا ۔ جب بھی حضور صلی اللہ علیہ وسلم کسی بات پر مسرور ہوتے تو چہرہ مبارک چمک اٹھتا ، ایسا معلوم ہوتا جیسے چاند کا ٹکڑا ہو اور آپ کی خوشی کو ہم اسی سے پہچان جاتے تھے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عبدالرحمٰن بن عبداللہ بن کعب نے اور ان سے عبداللہ بن کعب نے بیان کیا کہ میں نے کعب بن مالک رضی اللہ عنہ سے سنا ،",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، يُحَدِّثُ حِينَ تَخَلَّفَ عَنْ تَبُوكَ، قَالَ فَلَمَّا سَلَّمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْوَ يَبْرُقُ وَجْهُهُ مِنَ السُّرُورِ، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا سُرَّ اسْتَنَارَ وَجْهُهُ، حَتَّى كَأَنَّهُ قِطْعَةُ قَمَرٍ، وَكُنَّا نَعْرِفُ ذَلِكَ مِنْهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3396,
                "hadithNumber": "3557",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"I have been sent (as an Apostle) in the best of all the generations of Adam's offspring since their Creation.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میں ( حضرت آدم سے لے کر ) برابر آدمیوں کے بہتر قرنوں میں ہوتا آیا ہوں ( یعنی شریف اور پاکیزہ نسلوں میں ) یہاں تک کہ وہ قرن آیا جس میں میں پیدا ہوا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے عمرو بن ابی عمرو نے ، ان سے سعید مقبری نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرٍو، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بُعِثْتُ مِنْ خَيْرِ قُرُونِ بَنِي آدَمَ قَرْنًا فَقَرْنًا، حَتَّى كُنْتُ مِنَ الْقَرْنِ الَّذِي كُنْتُ فِيهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3397,
                "hadithNumber": "3558",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to let his hair hang down while the infidels used to part their hair. The people of the Scriptures were used to letting their hair hang down and Allah's Messenger (ﷺ) liked to follow the people of the Scriptures in the matters about which he was not instructed otherwise. Then Allah's Messenger (ﷺ) parted his hair.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ( سر کے آگے کے بالوں کو پیشانی پر ) پڑا رہنے دیتے تھے اور مشرکین کی یہ عادت تھی کہ وہ آگے کے سر کے بال دو حصوں میں تقسیم کر لیتے تھے ( پیشانی پر پڑا نہیں رہنے دیتے تھے ) اور اہل کتاب ( یہود و نصاریٰ ) سرکے آگے کے بال پیشانی پر پڑا رہنے دیتے تھے ۔ آنحضرت صلی اللہ علیہ وسلم ان معاملات میں جن کے متعلق اللہ تعالیٰ کا کوئی حکم آپ کو نہ ملا ہوتا ۔ اہل کتاب کی موافقت پسند فرماتے ( اور حکم نازل ہونے کے بعد وحی پر عمل کرتے تھے ) پھر حضور صلی اللہ علیہ وسلم بھی سر میں مانگ نکالنے لگے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے بیان کیا ، کہا مجھ کو عبیداللہ بن عبداللہ نے خبر دی اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَسْدِلُ شَعَرَهُ، وَكَانَ الْمُشْرِكُونَ يَفْرُقُونَ رُءُوسَهُمْ فَكَانَ أَهْلُ الْكِتَابِ يَسْدِلُونَ رُءُوسَهُمْ، وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحِبُّ مُوَافَقَةَ أَهْلِ الْكِتَابِ فِيمَا لَمْ يُؤْمَرْ فِيهِ بِشَىْءٍ، ثُمَّ فَرَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَأْسَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3398,
                "hadithNumber": "3559",
                "englishNarrator": "Narrated `Abdullah bin `Amr رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) never used bad language neither a \"Fahish nor a Mutafahish. He used to say \"The best amongst you are those who have the best manners and character.\" (See Hadith No. 56 (B) Vol. 8)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم بدزبان اور لڑنے جھگڑنے والے نہیں تھے ۔ آپ فرمایا کرتے تھے کہ تم میں سب سے بہتر وہ شخص ہے جس کے اخلاق سب سے اچھے ہوں ( جو لوگوں سے کشادہ پیشانی سے پیش آئے )",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، ان سے ابوحمزہ نے ، ان سے اعمش نے ، ان سے ابووائل نے ، ان سے مسروق نے اور ان سے عبداللہ بن عمرو رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ قَالَ لَمْ يَكُنِ النَّبِيُّ صلى الله عليه وسلم فَاحِشًا وَلاَ مُتَفَحِّشًا وَكَانَ يَقُولُ ‏ \"‏ إِنَّ مِنْ خِيَارِكُمْ أَحْسَنَكُمْ أَخْلاَقًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3399,
                "hadithNumber": "3560",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Whenever Allah's Messenger (ﷺ) was given the choice of one of two matters, he would choose the easier of the two, as long as it was not sinful to do so, but if it was sinful to do so, he would not approach it. Allah's Messenger (ﷺ) never took revenge (over anybody) for his own sake but (he did) only when Allah's Legal Bindings were outraged in which case he would take revenge for Allah's Sake.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے جب بھی دو چیزوں میں سے کسی ایک کے اختیار کرنے کے لیے کہا گیا تو آپ نے ہمیشہ اسی کو اختیار فرمایا جس میں آپ کو زیادہ آسانی معلوم ہوئی بشرطیکہ اس میں کوئی گناہ نہ ہو ۔ کیونکہ اگر اس میں گناہ کا کوئی شائبہ بھی ہوتا تو آپ اس سے سب سے زیادہ دور رہتے اور آنحضرت صلی اللہ علیہ وسلم نے اپنی ذات کے لیے کبھی کسی سے بد لہ نہیں لیا ۔ لیکن اگر اللہ کی حرمت کو کوئی توڑ تا تو آپ اس سے ضرور بدلہ لیتے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ مَا خُيِّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَمْرَيْنِ إِلاَّ أَخَذَ أَيْسَرَهُمَا، مَا لَمْ يَكُنْ إِثْمًا، فَإِنْ كَانَ إِثْمًا كَانَ أَبْعَدَ النَّاسِ مِنْهُ، وَمَا انْتَقَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِنَفْسِهِ، إِلاَّ أَنْ تُنْتَهَكَ حُرْمَةُ اللَّهِ فَيَنْتَقِمَ لِلَّهِ بِهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3400,
                "hadithNumber": "3561",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "I have never touched silk or Dibaj (i.e. thick silk) softer than the palm of the Prophet (ﷺ) nor have I smelt a perfume nicer than the sweat of the Prophet.",
                "hadithUrdu": "نہ تو نبی کریم صلی اللہ علیہ وسلم کی ہتھیلی سے زیادہ نرم و نازک کوئی حریر و دیباج میرے ہاتھوں نے کبھی چھوا اور نہ میں نے رسول اللہ صلی اللہ علیہ وسلم کی خوشبو سے زیادہ بہتر اور پاکیزہ کوئی خوشبو یا عطر سونگھا ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد نے بیان کیا ، ان سے ثابت نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ مَا مَسِسْتُ حَرِيرًا وَلاَ دِيبَاجًا أَلْيَنَ مِنْ كَفِّ النَّبِيِّ صلى الله عليه وسلم، وَلاَ شَمِمْتُ رِيحًا قَطُّ أَوْ عَرْفًا قَطُّ أَطْيَبَ مِنْ رِيحِ أَوْ عَرْفِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3401,
                "hadithNumber": "3562",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) was shier than a veiled virgin girl. A similar Hadith (i e. No. 762) with this addition: And if he (i.e. the Prophet) disliked something, the sign of aversion would appear on his face.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم پردہ نشیں کنواری لڑکیوں سے بھی زیادہ شرمیلے تھے ۔اسی طرح کی حدیث (نمبر 762) اس اضافے کے ساتھ: اور اگر آپ صلی اللہ علیہ وسلم کسی چیز کو ناپسند کرتے تو آپ صلی اللہ علیہ وسلم کے چہرے پر نفرت کے آثار ظاہر ہوتے۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ نے بیان کیا ، ان سے شعبہ نے ، ان سے قتادہ نے ، ان سے عبداللہ ابن ابی عتبہ نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ ، حَدَّثَنَا يَحْيَى ، عَنْ شُعْبَةَ ، عَنْ قَتَادَةَ ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي عُتْبَةَ ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ ، قَالَ : كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشَدَّ حَيَاءً مِنَ الْعَذْرَاءِ فِي خِدْرِهَا.حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، وَابْنُ، مَهْدِيٍّ قَالاَ حَدَّثَنَا شُعْبَةُ، مِثْلَهُ وَإِذَا كَرِهَ شَيْئًا عُرِفَ فِي وَجْهِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3402,
                "hadithNumber": "3563",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) never criticized any food (presented him), but he would eat it if he liked it; otherwise, he would leave it (without expressing his dislike).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے کبھی کسی کھانے میں عیب نہیں نکالا ، اگر آپ کو مرغوب ہوتا تو کھاتے ورنہ چھوڑ دیتے ۔",
                "urduNarrator": "مجھ علی بن جعد نے بیان کیا ، انہوں نے کہا کہ ہم کو شعبہ نے خبر دی ، انہیں اعمش نے ، انہیں ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ مَا عَابَ النَّبِيُّ صلى الله عليه وسلم طَعَامًا قَطُّ، إِنِ اشْتَهَاهُ أَكَلَهُ، وَإِلاَّ تَرَكَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 3376,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=135",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=133",
                "label": "133",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=134",
                "label": "134",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=135",
                "label": "135",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=136",
                "label": "136",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=137",
                "label": "137",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=138",
                "label": "138",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=139",
                "label": "139",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=137",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=137",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=135",
        "to": 3400,
        "total": 40465
    }
}