{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 178,
        "data": [
            {
                "id": 4428,
                "hadithNumber": "4649",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Abu Jahl said, \"O Allah! If this (Qur'an) is indeed the Truth from You), then rain down on us a shower of stones from the sky or bring on us a painful punishment.\" So there was revealed:-- 'But Allah would not punish them while you (Muhammad) were amongst them, nor will He punish them while they seek (Allah's) Forgiveness. And why Allah should not punish them while they stop (men) from Al-Masjid-al-Haram ..' (8.33-34)",
                "hadithUrdu": "ابوجہل نے کہا تھا کہ اے اللہ! اگر یہ کلام تیری طرف سے واقعی حق ہے تو ہم پر آسمان سے پتھر برسا دے یا پھر کوئی اور ہی عذاب لے آ۔ اس پر یہ آیت نازل ہوئی «وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون * وما لهم أن لا يعذبهم الله وهم يصدون عن المسجد الحرام‏» ”حالانکہ اللہ ایسا نہیں کرے گا کہ انہیں عذاب دے اس حال میں کہ آپ ان میں موجود ہوں اور نہ اللہ ان پر عذاب لائے گا۔ اس حال میں کہ وہ استغفار کر رہے ہوں۔ ان لوگوں کو اللہ کیوں نہ عذاب کرے جن کا حال یہ ہے کہ وہ مسجد الحرام سے روکتے ہیں۔“ آخر آیت تک۔",
                "urduNarrator": "ہم سے محمد بن نضر نے بیان کیا، کہا ہم سے عبیداللہ بن معاذ نے بیان کیا، کہا ہم سے ہمارے والد نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے صاحب الزیادی عبدالحمید نے اور انہوں نے انس بن مالک رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ النَّضْرِ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْحَمِيدِ، صَاحِبِ الزِّيَادِيِّ سَمِعَ أَنَسَ بْنَ مَالِكٍ، قَالَ قَالَ أَبُو جَهْلٍ ‏{‏اللَّهُمَّ إِنْ كَانَ هَذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِنَ السَّمَاءِ أَوِ ائْتِنَا بِعَذَابٍ أَلِيمٍ‏}‏ فَنَزَلَتْ ‏{‏وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ * وَمَا لَهُمْ أَنْ لاَ يُعَذِّبَهُمُ اللَّهُ وَهُمْ يَصُدُّونَ عَنِ الْمَسْجِدِ الْحَرَامِ‏}‏ الآيَةَ‏.‏",
                "headingArabic": "{‏وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور اللہ ان کو عذاب نہیں دے گا جب تک کہ آپ (صلی اللہ علیہ وآلہ وسلم) ان میں ہوں گے اور نہ وہ ان کو عذاب دے گا جب تک وہ (اللہ سے) استغفار کرتے ہوں گے۔‘‘ (V.8:33)",
                "headingEnglish": "The Statement of Allah: \"And Allah would not punish them while you (Muhammad ﷺ) are amongst them, nor will He punish them while they seek (Allah's) forgiveness.\" (V.8:33)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4429,
                "hadithNumber": "4650",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "A man came to him (while two groups of Muslims were fighting) and said, \"O Abu `Abdur Rahman! Don't you hear what Allah has mentioned in His Book: 'And if two groups of believers fight against each other...' (49.9) So what prevents you from fighting as Allah has mentioned in His Book?\"' Ibn `Umar رضی اللہ عنہما said, \"O son of my brother! I would rather be blamed for not fighting because of this Verse than to be blamed because of another Verse where Allah says: 'And whoever kills a believer intentionally...\" (4.93) Then that man said, \"Allah says:-- 'And fight them until there is no more afflictions (worshipping other besides Allah) and the religion (i.e. worship) will be all for Allah (Alone)\" (8.39) Ibn `Umar رضی اللہ عنہما said, \"We did this during the lifetime of Allah's Messenger (ﷺ) when the number of Muslims was small, and a man was put to trial because of his religion, the pagans would either kill or chain him; but when the Muslims increased (and Islam spread), there was no persecution.\" When that man saw that Ibn `Umar رضی اللہ عنہما did not agree to his proposal, he said, \"What is your opinion regarding `Ali  رضی اللہ عنہ and `Uthman?\" Ibn `Umar رضی اللہ عنہما said, \"What is my opinion regarding `Ali رضی اللہ عنہ and `Uthman رضی اللہ عنہ? As for `Uthman رضی اللہ عنہ , Allah forgave him and you disliked to forgive him, and `Ali رضی اللہ عنہ is the cousin and son-in-law of Allah's Messenger (ﷺ) .\" Then he pointed out with his hand and said, \"And that is his daughter's (house) which you can see.\"",
                "hadithUrdu": "ایک شخص ( حبان یا علاء بن عرار نامی ) نے پوچھا: ابوعبدالرحمٰن! آپ نے قرآن کی یہ آیت نہیں سنی «وإن طائفتان من المؤمنين اقتتلوا‏» کہ ”جب مسلمانوں کی دو جماعتیں لڑنے لگیں“ الخ، اس آیت کے بموجب تم ( علی اور معاویہ رضی اللہ عنہما دونوں سے ) کیوں نہیں لڑتے جیسے اللہ نے فرمایا «فقاتلوا التي تبغيإ» ۔ انہوں نے کہا میرے بھتیجے! اگر میں اس آیت کی تاویل کر کے مسلمانوں سے نہ لڑوں تو یہ مجھ کو اچھا معلوم ہوتا ہے بہ نسبت اس کے کہ میں اس آیت «ومن يقتل مؤمنا متعمدا‏» کی تاویل کروں۔ وہ شخص کہنے لگا اچھا اس آیت کو کیا کرو گے جس میں مذکور ہے «وقاتلوهم حتى لا تكون فتنة‏» کہ ”ان سے لڑو تاکہ فتنہ باقی نہ رہے اور سارا دین اللہ کا ہو جائے۔“ عبداللہ بن عمر رضی اللہ عنہما نے کہا ( واہ، واہ ) یہ لڑائی تو ہم نبی کریم صلی اللہ علیہ وسلم کے عہد میں کر چکے، اس وقت مسلمان بہت تھوڑے تھے اور مسلمان کو اسلام اختیار کرنے پر تکلیف دی جاتی۔ قتل کرتے، قید کرتے یہاں تک کہ اسلام پھیل گیا۔ مسلمان بہت ہو گئے اب فتنہ جو اس آیت میں مذکور ہے وہ کہاں رہا۔ جب اس شخص نے دیکھا کہ عبداللہ بن عمر رضی اللہ عنہما کسی طرح لڑائی پر اس کے موافق نہیں ہوتے تو کہنے لگا اچھا بتلاؤ علی رضی اللہ عنہ اور عثمان رضی اللہ عنہ کے بارے میں تمہارا کیا اعتقاد ہے؟ انہوں نے کہا ہاں یہ کہو تو سنو، علی اور عثمان رضی اللہ عنہما کے بارے میں اپنا اعتقاد بیان کرتا ہوں۔ عثمان رضی اللہ عنہ کا جو قصور تم بیان کرتے ہو ( کہ وہ جنگ احد میں بھاگ نکلے ) تو اللہ نے ان کا یہ قصور معاف کر دیا مگر تم کو یہ معافی پسند نہیں ( جب تو اب تک ان پر قصور لگاتے جاتے ہو ) اور علی رضی اللہ عنہ تو ( سبحان اللہ ) نبی کریم صلی اللہ علیہ وسلم کے چچا زاد بھائی اور آپ داماد بھی تھے اور ہاتھ سے اشارہ کر کے بتلایا یہ ان کا گھر ہے جہاں تم دیکھ رہے ہو۔",
                "urduNarrator": "ہم سے حسن بن عبدالعزیز نے بیان کیا، کہا ہم سے عبداللہ بن یحییٰ نے، کہا ہم سے حیوہ بن شریح نے، انہوں نے بکر بن عمرو سے، انہوں نے بکیر سے، انہوں نے نافع سے، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَبْدِ الْعَزِيزِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَحْيَى، حَدَّثَنَا حَيْوَةُ، عَنْ بَكْرِ بْنِ عَمْرٍو، عَنْ بُكَيْرٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَجُلاً، جَاءَهُ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ، أَلاَ تَسْمَعُ مَا ذَكَرَ اللَّهُ فِي كِتَابِهِ ‏{‏وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا‏}‏ إِلَى آخِرِ الآيَةِ، فَمَا يَمْنَعُكَ أَنْ لاَ تُقَاتِلَ كَمَا ذَكَرَ اللَّهُ فِي كِتَابِهِ‏.‏ فَقَالَ يَا ابْنَ أَخِي أَغْتَرُّ بِهَذِهِ الآيَةِ وَلاَ أُقَاتِلُ أَحَبُّ إِلَىَّ مِنْ أَنْ أَغْتَرَّ بِهَذِهِ الآيَةِ الَّتِي يَقُولُ اللَّهُ تَعَالَى ‏{‏وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا‏}‏ إِلَى آخِرِهَا‏.‏ قَالَ فَإِنَّ اللَّهَ يَقُولُ ‏{‏وَقَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ‏}‏‏.‏ قَالَ ابْنُ عُمَرَ قَدْ فَعَلْنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ كَانَ الإِسْلاَمُ قَلِيلاً، فَكَانَ الرَّجُلُ يُفْتَنُ فِي دِينِهِ، إِمَّا يَقْتُلُوهُ وَإِمَّا يُوثِقُوهُ، حَتَّى كَثُرَ الإِسْلاَمُ، فَلَمْ تَكُنْ فِتْنَةٌ، فَلَمَّا رَأَى أَنَّهُ لاَ يُوَافِقُهُ فِيمَا يُرِيدُ قَالَ فَمَا قَوْلُكَ فِي عَلِيٍّ وَعُثْمَانَ‏.‏ قَالَ ابْنُ عُمَرَ مَا قَوْلِي فِي عَلِيٍّ وَعُثْمَانَ أَمَّا عُثْمَانُ فَكَانَ اللَّهُ قَدْ عَفَا عَنْهُ، فَكَرِهْتُمْ أَنْ يَعْفُوَ عَنْهُ، وَأَمَّا عَلِيٌّ فَابْنُ عَمِّ رَسُولِ اللَّهِ صلى الله عليه وسلم وَخَتَنُهُ‏.‏ وَأَشَارَ بِيَدِهِ وَهَذِهِ ابْنَتُهُ أَوْ بِنْتُهُ حَيْثُ تَرَوْنَ‏.‏",
                "headingArabic": "‏{‏وَقَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ‏}‏",
                "headingUrdu": "’’اور ان سے اس وقت تک لڑتے رہو جب تک کہ فتنہ باقی نہ رہے اور دین (عبادت) سب اللہ کے لیے ہو جائے (پوری دنیا میں)۔‘‘ .8:39)",
                "headingEnglish": "\"And fight them until there is no more Fitnah (disbelief and polytheism, i.e., worshipping others besides Allah) and the religion (worship) will be all for Allah (Alone) (in the whole of the world)...\" (V.8:39)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4430,
                "hadithNumber": "4651",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"What do you think about 'Qit-alal-Fitnah' (fighting caused by afflictions).\" Ibn `Umar رضی اللہ عنہما said (to him), \"And do you understand what an affliction is? Muhammad used to fight against the pagans, and his fighting with them was an affliction, (and his fighting was) not like your fighting which is carried on for the sake of ruling.\"",
                "hadithUrdu": "( مسلمانوں کے باہمی ) فتنہ اور جنگ کے بارے میں آپ کی کیا رائے ہے؟ ابن عمر رضی اللہ عنہما نے ان سے پوچھا تمہیں معلوم بھی ہے ”فتنہ“ کیا چیز ہے۔ محمد صلی اللہ علیہ وسلم مشرکین سے جنگ کرتے تھے اور ان میں ٹھہر جانا ہی فتنہ تھا۔ نبی کریم صلی اللہ علیہ وسلم کی جنگ تمہاری ملک و سلطنت کی خاطر جنگ کی طرح نہیں تھی۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا، کہا ہم سے زہیر نے بیان کیا، کہا ہم سے بیان نے بیان کیا، ان سے وبرہ نے بیان کیا، کہا کہ مجھ سے سعید بن جبیر نے بیان کیا، کہا کہ ابن عمر رضی اللہ عنہما ہمارے پاس تشریف لائے، تو ایک صاحب نے ان سے پوچھا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا بَيَانٌ، أَنَّ وَبَرَةَ، حَدَّثَهُ قَالَ حَدَّثَنِي سَعِيدُ بْنُ جُبَيْرٍ، قَالَ خَرَجَ عَلَيْنَا أَوْ إِلَيْنَا ابْنُ عُمَرَ، فَقَالَ رَجُلٌ كَيْفَ تَرَى فِي قِتَالِ الْفِتْنَةِ‏.‏ فَقَالَ وَهَلْ تَدْرِي مَا الْفِتْنَةُ كَانَ مُحَمَّدٌ صلى الله عليه وسلم يُقَاتِلُ الْمُشْرِكِينَ، وَكَانَ الدُّخُولُ عَلَيْهِمْ فِتْنَةً، وَلَيْسَ كَقِتَالِكُمْ عَلَى الْمُلْكِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4431,
                "hadithNumber": "4652",
                "englishNarrator": "Narrated Ibn `Abbas:",
                "hadithEnglish": "When the Verse:-- \"If there are twenty steadfast amongst you, they will overcome two hundred.\" (8.65) was revealed, then it became obligatory for the Muslims that one (Muslim) should not flee from ten (non-Muslims). Sufyan (the sub-narrator) once said, \"Twenty (Muslims) should not flee before two hundred (non Muslims).\" Then there was revealed: 'But now Allah has lightened your (task)..' (8.66) So it became obligatory that one-hundred (Muslims) should not flee before two hundred (nonmuslims). (Once Sufyan said extra, \"The Verse: 'Urge the believers to the fight. If there are twenty steadfast amongst you (Muslims) ..' was revealed.) Sufyan said, \"Ibn Shabrama said, \"I see that this order is applicable to the obligation of enjoining good and forbidding evil.\"",
                "hadithUrdu": "جب یہ آیت نازل ہوئی «إن يكن منكم عشرون صابرون يغلبوا مائتين‏» کہ ”اگر تم میں سے بیس آدمی بھی صبر کرنے والے ہوں تو وہ دو سو پر غالب آ جائیں گے۔“ تو مسلمانوں کے لیے فرض قرار دے دیا گیا کہ ایک مسلمان دس کافروں کے مقابلے سے نہ بھاگے اور کئی مرتبہ سفیان ثوری نے یہ بھی کہا کہ بیس دو سو کے مقابلے سے نہ بھاگیں۔ پھر اللہ تعالیٰ نے یہ آیت اتاری «الآن خفف الله عنكم‏» ”اب اللہ نے تم پر تخفیف کر دی۔“ اس کے بعد یہ فرض قرار دیا کہ ایک سو، دو سو کے مقابلے سے نہ بھاگیں۔ سفیان ثوری نے ایک مرتبہ اس زیادتی کے ساتھ روایت بیان کی کہ آیت نازل ہوئی «حرض المؤمنين على القتال إن يكن منكم عشرون صابرون‏» کہ ”اے نبی مومنوں کو قتال پر آمادہ کرو۔ اگر تم میں سے بیس آدمی صبر کرنے والے ہوں گے۔“ سفیان ثوری نے بیان کیا اور ان سے عبداللہ بن شبرمہ ( کوفہ کے قاضی ) نے بیان کیا کہ میرا خیال ہے امر بالمعروف اور نہی عن المنکر میں بھی یہی حکم ہے۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، کہا ہم سے سفیان ثوری نے بیان کیا، ان سے عمرو بن دینار نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ لَمَّا نَزَلَتْ ‏{‏إِنْ يَكُنْ مِنْكُمْ عِشْرُونَ صَابِرُونَ يَغْلِبُوا مِائَتَيْنِ‏}‏ فَكُتِبَ عَلَيْهِمْ أَنْ لاَ يَفِرَّ وَاحِدٌ مِنْ عَشَرَةٍ ـ فَقَالَ سُفْيَانُ غَيْرَ مَرَّةٍ أَنْ لاَ يَفِرَّ عِشْرُونَ مِنْ مِائَتَيْنِ ـ ثُمَّ نَزَلَتِ ‏{‏الآنَ خَفَّفَ اللَّهُ عَنْكُمُ‏}‏ الآيَةَ، فَكَتَبَ أَنْ لاَ يَفِرَّ مِائَةٌ مِنْ مِائَتَيْنِ ـ زَادَ سُفْيَانُ مَرَّةً ـ نَزَلَتْ ‏{‏حَرِّضِ الْمُؤْمِنِينَ عَلَى الْقِتَالِ إِنْ يَكُنْ مِنْكُمْ عِشْرُونَ صَابِرُونَ‏}‏‏.‏ قَالَ سُفْيَانُ وَقَالَ ابْنُ شُبْرُمَةَ وَأُرَى الأَمْرَ بِالْمَعْرُوفِ وَالنَّهْىَ عَنِ الْمُنْكَرِ مِثْلَ هَذَا‏.‏",
                "headingArabic": "باب ‏{‏يَا أَيُّهَا النَّبِيُّ حَرِّضِ الْمُؤْمِنِينَ عَلَى الْقِتَالِ إِنْ يَكُنْ مِنْكُمْ عِشْرُونَ صَابِرُونَ يَغْلِبُوا مِائَتَيْنِ وَإِنْ يَكُنْ مِنْكُمْ مِائَةٌ يَغْلِبُوا أَلْفًا مِنَ الَّذِينَ كَفَرُوا بِأَنَّهُمْ قَوْمٌ لاَ يَفْقَهُونَ‏}‏",
                "headingUrdu": "’’اے مخفی خبروں کے پہنچانے والے! مسلمانوں کو مقدس جنگ کرنے کی تلقین کریں۔ اگر تم میں سے بیس صبر کرنے والے ہوں گے تو وہ دو سو پر غالب آئیں گے اور تم میں سے سو ہوں گے تو وہ ہزار کافروں پر غالب آئیں گے کیونکہ وہ سمجھتے نہیں ہیں۔‘‘",
                "headingEnglish": "''O Communicatior of the hidden news! Urge the Muslims to wage a holy war. If there will be twenty of you patient, they will overcome two hundred, and there be hundred of you, they will overcome a  thousand infidels, because they do not understand.''",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4432,
                "hadithNumber": "4653",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When the Verse:--'If there are twenty steadfast amongst you (Muslims), they will overcome twohundred (non-Muslims).' was revealed, it became hard on the Muslims when it became compulsory that one Muslim ought not to flee (in war) before ten (non-Muslims). So (Allah) lightened the order by revealing: '(But) now Allah has lightened your (task) for He knows that there is weakness in you. So if there are of you one-hundred steadfast, they will overcome (two-hundred (non-Muslims).' (8.66) So when Allah reduced the number of enemies which Muslims should withstand, their patience and perseverance against the enemy decreased as much as their task was lightened for them.",
                "hadithUrdu": "جب یہ آیت اتری «إن يكن منكم عشرون صابرون يغلبوا مائتين‏» کہ ”اگر تم میں سے بیس آدمی بھی صبر کرنے والے ہوں گے تو وہ دو سو پر غالب آ جائیں گے۔“ تو مسلمانوں پر سخت گزرا کیونکہ اس آیت میں ان پر یہ فرض قرار دیا گیا تھا کہ ایک مسلمان دس کافروں کے مقابلے سے نہ بھاگے۔ اس لیے اس کے بعد تخفیف کی گئی۔ اور اللہ تعالیٰ نے فرمایا «الآن خفف الله عنكم وعلم أن فيكم ضعفا فإن يكن منكم مائة صابرة يغلبوا مائتين‏» کہ ”اب اللہ نے تم سے تخفیف کر دی اور معلوم کر لیا کہ تم میں جوش کی کمی ہے۔ سو اب اگر تم میں صبر کرنے والے ہوں گے تو وہ دو سو پر غالب آ جائیں گے۔“ ابن عباس رضی اللہ عنہما نے کہا کہ تعداد کی اس کمی سے اتنی ہی مسلمانوں کے صبر میں کمی ہو گئی۔",
                "urduNarrator": "ہم سے یحییٰ بن عبداللہ سلمی نے بیان کیا، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی، انہوں نے کہا ہم کو جریر بن حازم نے خبر دی، انہوں نے کہا کہ مجھے زبیر ابن خریت نے خبر دی، انہیں عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ عَبْدِ اللَّهِ السُّلَمِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا جَرِيرُ بْنُ حَازِمٍ، قَالَ أَخْبَرَنِي الزُّبَيْرُ بْنُ خِرِّيتٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا نَزَلَتْ ‏{‏إِنْ يَكُنْ مِنْكُمْ عِشْرُونَ صَابِرُونَ يَغْلِبُوا مِائَتَيْنِ‏}‏ شَقَّ ذَلِكَ عَلَى الْمُسْلِمِينَ حِينَ فُرِضَ عَلَيْهِمْ أَنْ لاَ يَفِرَّ وَاحِدٌ مِنْ عَشَرَةٍ، فَجَاءَ التَّخْفِيفُ فَقَالَ رالآنَ خَفَّفَ اللَّهُ عَنْكُمْ وَعَلِمَ أَنَّ فِيكُمْ ضُعْفًا فَإِنْ يَكُنْ مِنْكُمْ مِائَةٌ صَابِرَةٌ يَغْلِبُوا مِائَتَيْنِ‏}‏‏.‏ قَالَ فَلَمَّا خَفَّفَ اللَّهُ عَنْهُمْ مِنَ الْعِدَّةِ نَقَصَ مِنَ الصَّبْرِ بِقَدْرِ مَا خُفِّفَ عَنْهُمْ‏.‏",
                "headingArabic": "‏{‏الآنَ خَفَّفَ اللَّهُ عَنْكُمْ وَعَلِمَ أَنَّ فِيكُمْ ضُعْفًا‏}‏ الآيَةَ إِلَى قَوْلِهِ ‏{‏وَاللَّهُ مَعَ الصَّابِرِينَ‏}‏",
                "headingUrdu": "\"اب جب کہ اللہ نے تمہارے کام کو ہلکا کر دیا ہے، کیونکہ وہ جانتا ہے کہ تم میں کمزوری ہے...\" (V. 8:66)",
                "headingEnglish": "\"Now that Allah has lightened your (task), for He knows that there is weakness in you...\" (V.8:66)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4433,
                "hadithNumber": "4654",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "The last Verse that was revealed was: 'They ask you for a legal verdict: Say: Allah directs (thus) about Al-Kalalah (those who leave no descendants or ascendants as heirs).' And the last Sura which was revealed was Baraatun (9) .",
                "hadithUrdu": "سب سے آخر میں یہ آیت نازل ہوئی تھی «يستفتونك قل الله يفتيكم في الكلالة‏» اور سب سے آخر میں سورۃ برات نازل ہوئی۔",
                "urduNarrator": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے ابواسحاق نے کہ میں نے براء بن عازب رضی اللہ عنہ سے سنا۔ انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ ـ رضى الله عنه ـ يَقُولُ آخِرُ آيَةٍ نَزَلَتْ ‏{‏يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلاَلَةِ‏}‏ وَآخِرُ سُورَةٍ نَزَلَتْ بَرَاءَةٌ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏بَرَاءَةٌ مِنَ اللَّهِ وَرَسُولِهِ إِلَى الَّذِينَ عَاهَدْتُمْ مِنَ الْمُشْرِكِينَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی طرف سے ان مشرکین کے لیے (تمام ذمہ داریوں سے آزادی کا اعلان کیا گیا ہے) جن کے ساتھ تم نے مشرکوں، مشرکوں، مشرکوں، اللہ کی وحدانیت اور اس کے رسول صلی اللہ علیہ وسلم کے ساتھ کفر کیا۔ معاہدہ۔\" (V.9:1)",
                "headingEnglish": "Allah's Statement: \"Freedom from (all) obligations (is declared) from Allah and His Messenger ﷺ to those of the Mushrikin [polytheists, pagans, idolaters, disbelievers in the Oneness of Allah and in His Messenger Muhammad ﷺ] with whom you made a treaty.\" (V.9:1)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4434,
                "hadithNumber": "4655",
                "englishNarrator": "Narrated Humaid bin `Abdur-Rahman:",
                "hadithEnglish": "Abu Huraira رضی اللہ عنہ said, \"During that Hajj (in which Abu Bakr رضی اللہ عنہ was the chief of the pilgrims) Abu Bakr sent me along with announcers on the Day of Nahr ( 10th of Dhul-Hijja) in Mina to announce: \"No pagans shall perform, Hajj after this year, and none shall perform the Tawaf around the Ka`ba in a naked state.\" Humaid bin `Abdur Rahman added: Then Allah's Messenger (ﷺ) sent `Ali bin Abi Talib رضی اللہ عنہ (after Abu Bakr) and ordered him to recite aloud in public Surat Bara'a. Abu Huraira رضی اللہ عنہ added, \"So `Ali رضی اللہ عنہ , along with us, recited Bara'a (loudly) before the people at Mina on the Day of Nahr and announced; \"No pagan shall perform Hajj after this year and none shall perform the Tawaf around the Ka`ba in a naked state.\"",
                "hadithUrdu": "ابوہریرہ رضی اللہ عنہ نے کہا: ابوبکر صدیق رضی اللہ عنہ نے اس حج کے موقع پر ( جس کا نبی کریم صلی اللہ علیہ وسلم نے انہیں امیر بنایا تھا ) مجھے بھی اعلان کرنے والوں میں رکھا تھا، جنہیں نبی کریم صلی اللہ علیہ وسلم نے یوم نحر میں اس لیے بھیجا تھا کہ اعلان کر دیں کہ آئندہ سال سے کوئی مشرک حج کرنے نہ آئے اور کوئی شخص بیت اللہ کا طواف ننگے ہو کر نہ کرے۔ حمید بن عبدالرحمٰن نے کہا کہ پھر اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ کو پیچھے سے بھیجا اور انہیں سورۃ برات کے احکام کے اعلان کرنے کا حکم دیا۔ ابوہریرہ رضی اللہ عنہ نے کہا، چنانچہ ہمارے ساتھ علی رضی اللہ عنہ نے بھی یوم نحر ہی میں سورۃ برات کا اعلان کیا اور اس کا کہ آئندہ سال سے کوئی مشرک حج نہ کرے اور نہ کوئی ننگے ہو کر طواف کرے۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا، کہا مجھ سے لیث بن سعد نے بیان کیا، کہا کہ مجھ سے عقیل نے بیان کیا، ان سے ابن شہاب نے (کہا) اور مجھے حمید بن عبدالرحمٰن بن عوف نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، وَأَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَعَثَنِي أَبُو بَكْرٍ فِي تِلْكَ الْحَجَّةِ فِي مُؤَذِّنِينَ، بَعَثَهُمْ يَوْمَ النَّحْرِ يُؤَذِّنُونَ بِمِنًى أَنْ لاَ يَحُجَّ بَعْدَ الْعَامِ مُشْرِكٌ، وَلاَ يَطُوفَ بِالْبَيْتِ عُرْيَانٌ‏.‏ قَالَ حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ ثُمَّ أَرْدَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِعَلِيِّ بْنِ أَبِي طَالِبٍ، وَأَمَرَهُ أَنْ يُؤَذِّنَ بِبَرَاءَةَ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَأَذَّنَ مَعَنَا عَلِيٌّ يَوْمَ النَّحْرِ فِي أَهْلِ مِنًى بِبَرَاءَةَ، وَأَنْ لاَ يَحُجَّ بَعْدَ الْعَامِ مُشْرِكٌ، وَلاَ يَطُوفَ بِالْبَيْتِ عُرْيَانٌ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏فَسِيحُوا فِي الأَرْضِ أَرْبَعَةَ أَشْهُرٍ وَاعْلَمُوا أَنَّكُمْ غَيْرُ مُعْجِزِي اللَّهِ وَأَنَّ اللَّهَ مُخْزِي الْكَافِرِينَ‏}‏",
                "headingUrdu": "ارشادِ باری تعالیٰ ہے: ’’پس (اے مشرکین) چار مہینے (جیسا چاہو) پورے ملک میں سفر کرو، لیکن جان لو کہ تم اللہ کے عذاب سے نہیں بچ سکتے اور اللہ کافروں کو رسوا کرے گا۔ (V.9:2)",
                "headingEnglish": "The Statement of Allah: \"So travel freely (O Mushrikün) for four months (as you will) throughout the land, but know that you cannot escape (from the punishment of) Allah, and Allah will disgrace the disbelievers.\" (V.9:2)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4435,
                "hadithNumber": "4656",
                "englishNarrator": "Narrated Humaid bin `Abdur Rahman:",
                "hadithEnglish": "Abu Huraira رضی اللہ عنہ said, \"Abu Bakr رضی اللہ عنہ sent me in that Hajj in which he was the chief of the pilgrims along with the announcers whom he sent on the Day of Nahr to announce at Mina: \"No pagan shall perform Hajj after this year, and none shall perform the Tawaf around the Ka`ba in a naked state.\" Humaid added: That the Prophet (ﷺ) sent `Ali bin Abi Talib رضی اللہ عنہ (after Abu Bakr) and ordered him to recite aloud in public Surat-Baraa. Abu Huraira رضی اللہ عنہ added, \"So `Ali رضی اللہ عنہ, along with us, recited Bara'a (loudly) before the people at Mina on the Day of Nahr and announced \"No pagan shall perform Hajj after this year and none shall perform the Tawaf around the Ka`ba in a naked state.\"",
                "hadithUrdu": "ابوہریرہ رضی اللہ عنہ نے کہا: ابوبکر صدیق رضی اللہ عنہ نے حج کے موقع پر ( جس کا نبی کریم صلی اللہ علیہ وسلم نے انہیں امیر بنایا تھا ) مجھ کو ان اعلان کرنے والوں میں رکھا تھا جنہیں آپ نے یوم نحر میں بھیجا تھا۔ منیٰ میں یہ اعلان کرنے کے لیے کہ اس سال کے بعد کوئی مشرک حج کرنے نہ آئے اور نہ کوئی شخص بیت اللہ کا طواف ننگا ہو کر کرے۔ حمید نے کہا کہ پھر پیچھے سے نبی کریم صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ کو بھیجا اور انہیں حکم دیا کہ سورۃ برات کا اعلان کر دیں۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ علی رضی اللہ عنہ نے ہمارے ساتھ منیٰ کے میدان میں دسویں تاریخ میں سورۃ برات کا اعلان کیا اور یہ کہ کوئی مشرک آئندہ سال سے حج کرنے نہ آئے اور نہ کوئی بیت اللہ کا طواف ننگا ہو کر کرے۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، کہا مجھ سے عقیل نے بیان کیا، ان سے ابن شہاب نے بیان کیا، کہا مجھ کو حمید بن عبدالرحمٰن نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ بَعَثَنِي أَبُو بَكْرٍ ـ رضى الله عنه ـ فِي تِلْكَ الْحَجَّةِ فِي الْمُؤَذِّنِينَ، بَعَثَهُمْ يَوْمَ النَّحْرِ يُؤَذِّنُونَ بِمِنًى أَنْ لاَ يَحُجَّ بَعْدَ الْعَامِ مُشْرِكٌ، وَلاَ يَطُوفَ بِالْبَيْتِ عُرْيَانٌ‏.‏ قَالَ حُمَيْدٌ ثُمَّ أَرْدَفَ النَّبِيُّ صلى الله عليه وسلم بِعَلِيِّ بْنِ أَبِي طَالِبٍ، فَأَمَرَهُ أَنْ يُؤَذِّنَ بِبَرَاءَةَ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَأَذَّنَ مَعَنَا عَلِيٌّ فِي أَهْلِ مِنًى يَوْمَ النَّحْرِ بِبَرَاءَةَ، وَأَنْ لاَ يَحُجَّ بَعْدَ الْعَامِ مُشْرِكٌ، وَلاَ يَطُوفَ بِالْبَيْتِ عُرْيَانٌ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَأَذَانٌ مِنَ اللَّهِ وَرَسُولِهِ إِلَى النَّاسِ يَوْمَ الْحَجِّ الأَكْبَرِ أَنَّ اللَّهَ بَرِيءٌ مِنَ الْمُشْرِكِينَ وَرَسُولُهُ فَإِنْ تُبْتُمْ فَهُوَ خَيْرٌ لَكُمْ وَإِنْ تَوَلَّيْتُمْ فَاعْلَمُوا أَنَّكُمْ غَيْرُ مُعْجِزِي اللَّهِ وَبَشِّرِ الَّذِينَ كَفَرُوا بِعَذَابٍ أَلِيمٍ‏}‏",
                "headingUrdu": "اللہ کا فرمان: \"اور اللہ اور اس کے رسول کی طرف سے اعلان... (تک)... مشرکین۔\" (V.9:3)",
                "headingEnglish": "Allah's Statement: \"And a declaration from Allah and His Messenger... (up to)... Mushrikün .\" (V.9:3)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4436,
                "hadithNumber": "4657",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Abu Bakr رضی اللہ عنہ sent him during the Hajj in which Abu Bakr رضی اللہ عنہ was made the chief of the pilgrims by Allah's Messenger (ﷺ) before (the year of) Hajjat al-Wada` in a group (of announcers) to announce before the people; 'No pagan shall perform the Hajj after this year, and none shall perform the Tawaf around the Ka`ba in a naked state. Humaid used to say The Day of Nahr is the day of Al- Hajj Al-Akbar (the Greatest Day) because of the narration of Abu Huraira رضی اللہ عنہ .",
                "hadithUrdu": "ابوبکر رضی اللہ عنہ نے اس حج کے موقع پر جس کا انہیں رسول اللہ صلی اللہ علیہ وسلم نے امیر بنایا تھا۔ حجۃ الوداع سے ( ایک سال ) پہلے 9 ھ میں انہیں بھی ان اعلان کرنے والوں میں رکھا تھا جنہیں لوگوں میں آپ نے یہ اعلان کرنے کے لیے بھیجا تھا کہ آئندہ سال سے کوئی مشرک حج کرنے نہ آئے اور نہ کوئی بیت اللہ کا طواف ننگا ہو کر کرے۔ حمید نے کہا کہ ابوہریرہ رضی اللہ عنہ کی اس حدیث سے معلوم ہوتا ہے کہ یوم نحر بڑے حج کا دن ہے۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا، کہا ہم سے یعقوب بن ابراہیم نے بیان کیا، کہا ہم سے ہمارے والد (ابراہیم بن سعد) نے بیان کیا، ان سے صالح نے، ان سے ابن شہاب نے، انہیں حمید بن عبدالرحمٰن نے خبر دی اور انہیں ابوہریرہ رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ بَعَثَهُ فِي الْحَجَّةِ الَّتِي أَمَّرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَيْهَا قَبْلَ حَجَّةِ الْوَدَاعِ فِي رَهْطٍ يُؤَذِّنُ فِي النَّاسِ أَنْ لاَ يَحُجَّنَّ بَعْدَ الْعَامِ مُشْرِكٌ وَلاَ يَطُوفَ بِالْبَيْتِ عُرْيَانٌ‏.‏ فَكَانَ حُمَيْدٌ يَقُولُ يَوْمُ النَّحْرِ يَوْمُ الْحَجِّ الأَكْبَرِ‏.‏ مِنْ أَجْلِ حَدِيثِ أَبِي هُرَيْرَةَ‏.‏",
                "headingArabic": "{‏إِلاَّ الَّذِينَ عَاهَدْتُمْ مِنَ الْمُشْرِكِينَ‏}‏",
                "headingUrdu": "\"سوائے ان مشرکوں کے [مشرک، مشرک، مشرک اور اللہ کی وحدانیت اور اس کے رسول محمد صلی اللہ علیہ وسلم میں] جن سے تمہارا (مسلمانوں) کا معاہدہ ہے...\" (آیت 9:4)",
                "headingEnglish": "\"Except those of the Mushrikün [polytheists, pagans, idolaters, and disbelievers in the Oneness of Allah and in His Messenger Muhammad ﷺ] with whom you (Muslims) have a treaty...\" (V.9:4)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4437,
                "hadithNumber": "4658",
                "englishNarrator": "Narrated Zaid bin Wahb:",
                "hadithEnglish": "We were with Hudhaifa and he said, \"None remains of the people described by this Verse (9.12), \"Except three, and of the hypocrites except four.\" A bedouin said, \"You the companions of Muhammad! Tell us (things) and we do not know that about those who break open our houses and steal our precious things? ' He (Hudhaifa) replied, \"Those are Al Fussaq (rebellious wrongdoers) (not disbelievers or hypocrites). Really, none remains of them (hypocrite) but four, one of whom is a very old man who, if he drinks water, does not feel its coldness.\"",
                "hadithUrdu": "ہم حذیفہ بن یمان کی خدمت میں حاضر تھے۔ انہوں نے کہا یہ آیت جن لوگوں کے بارے میں اتری ان میں سے اب صرف تین شخص باقی ہیں، اسی طرح منافقوں میں سے بھی اب چار شخص باقی ہیں۔ اتنے میں ایک دیہاتی کہنے لگا آپ تو نبی کریم صلی اللہ علیہ وسلم کے صحابی ہیں، ہمیں ان لوگوں کے متعلق بتائیے کہ ان کا کیا حشر ہو گا جو ہمارے گھروں میں چھید کر کے اچھی چیزیں چرا کر لے جاتے ہیں؟ انہوں نے کہا کہ یہ لوگ فاسق بدکار ہیں۔ ہاں ان منافقوں میں چار کے سوا اور کوئی باقی نہیں رہا ہے اور ایک تو اتنا بوڑھا ہو چکا ہے کہ اگر ٹھنڈا پانی پیتا ہے تو اس کی ٹھنڈ کا بھی اسے پتہ نہیں چلتا۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا، کہا ہم سے اسماعیل بن ابی خالد نے بیان کیا، کہا ہم سے زید بن وہب نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا زَيْدُ بْنُ وَهْبٍ، قَالَ كُنَّا عِنْدَ حُذَيْفَةَ فَقَالَ مَا بَقِيَ مِنْ أَصْحَابِ هَذِهِ الآيَةِ إِلاَّ ثَلاَثَةٌ، وَلاَ مِنَ الْمُنَافِقِينَ إِلاَّ أَرْبَعَةٌ‏.‏ فَقَالَ أَعْرَابِيٌّ إِنَّكُمْ أَصْحَابَ مُحَمَّدٍ صلى الله عليه وسلم تُخْبِرُونَا فَلاَ نَدْرِي فَمَا بَالُ هَؤُلاَءِ الَّذِينَ يَبْقُرُونَ بُيُوتَنَا وَيَسْرِقُونَ أَعْلاَقَنَا‏.‏ قَالَ أُولَئِكَ الْفُسَّاقُ، أَجَلْ لَمْ يَبْقَ مِنْهُمْ إِلاَّ أَرْبَعَةٌ‏.‏ أَحَدُهُمْ شَيْخٌ كَبِيرٌ لَوْ شَرِبَ الْمَاءَ الْبَارِدَ لَمَا وَجَدَ بَرْدَهُ‏.‏",
                "headingArabic": "‏{‏فَقَاتِلُوا أَئِمَّةَ الْكُفْرِ إِنَّهُمْ لاَ أَيْمَانَ لَهُمْ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’تم کفر کے سرداروں (سردارانِ قریش مکہ کے مشرکین) سے لڑو، یقیناً ان کی قسمیں ان کے لیے کچھ نہیں ہیں۔‘‘ (آیت 9:12)",
                "headingEnglish": "The Statement of Allah: \"Fight you the leaders of disbelief (chiefs of Quraish - Mushrikün of Makkah) for surely their oaths are nothing to them...\" (V.9:12)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4438,
                "hadithNumber": "4659",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The Kanz (money, the Zakat of which is not paid) of anyone of you will appear in the form of bald-headed poisonous male snake on the Day of Resurrection.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ تمہارا خزانہ جس میں زکوٰۃ نہ دی گئی ہو قیامت کے دن گنجے ناگ کی شکل اختیار کرے گا۔",
                "urduNarrator": "ہم سے حکم بن نافع نے بیان کیا، انہوں نے کہا ہم کو شعیب نے خبر دی، ان سے ابوالزناد نے بیان کیا، ان سے عبدالرحمٰن اعرج نے بیان کیا اور انہوں نے کہا کہ مجھ سے ابوہریرہ رضی اللہ عنہ نے بیان کیا اور انہوں نےرسول اللہ صلی اللہ علیہ وسلم سے سنا،",
                "hadithArabic": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، أَنَّ عَبْدَ الرَّحْمَنِ الأَعْرَجَ، حَدَّثَهُ أَنَّهُ، قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ يَكُونُ كَنْزُ أَحَدِكُمْ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَالَّذِينَ يَكْنِزُونَ الذَّهَبَ وَالْفِضَّةَ وَلاَ يُنْفِقُونَهَا فِي سَبِيلِ اللَّهِ فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور جو لوگ سونا اور چاندی جمع کرتے ہیں (وہ رقم جس کی زکوٰۃ ادا نہیں کی گئی) اور اسے اللہ کی راہ میں خرچ نہیں کرتے، انہیں دردناک عذاب کی خبر سنا دو۔ \" (V.9:34)",
                "headingEnglish": "The Statement of Allah: \"...And those who hoard up gold and silver (AI-Kanz—the money, the Zakãt of which has not been paid) and spend it not in the Way of Allah—announce to them a painful torment.\" (V.9:34)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4439,
                "hadithNumber": "4660",
                "englishNarrator": "Narrated Abu Dhar Gaffari رضی اللہ عنہ:",
                "hadithEnglish": "\"What has brought you to this land?\" He said, \"We were at Sham and I recited the Verse: \"They who hoard up gold and silver and spend them not in the way of Allah; announce to them a painful torment, \" (9.34) where upon Muawiya رضی اللہ عنہ said, 'This Verse is not for us, but for the people of the Scripture.' Then I said, 'But it is both for us (Muslim) and for them.' \"",
                "hadithUrdu": "اس جنگل میں آپ نے کیوں قیام کو پسند کیا؟ فرمایا کہ ہم شام میں تھے۔ ( مجھ میں اور وہاں کے حاکم معاویہ رضی اللہ عنہ میں اختلاف ہو گیا ) میں نے یہ آیت پڑھی «والذين يكنزون الذهب والفضة ولا ينفقونها في سبيل الله فبشرهم بعذاب أليم‏» کہ ”اور جو لوگ سونا اور چاندی جمع کر کے رکھتے ہیں اور اس کو خرچ نہیں کرتے اللہ کی راہ میں، آپ انہیں ایک درد ناک عذاب کی خبر سنا دیں۔“ تو معاویہ رضی اللہ عنہ کہنے لگے کہ یہ آیت ہم مسلمانوں کے بارے میں نہیں ہے ( جب وہ زکوٰۃ دیتے رہیں ) بلکہ اہل کتاب کے بارے میں ہے۔ فرمایا کہ میں نے اس پر کہا کہ یہ ہمارے بارے میں بھی ہے اور اہل کتاب کے بارے میں بھی ہے۔",
                "urduNarrator": "ہم سے قتیبہ بن سعد نے بیان کیا، کہا ہم سے جریر نے بیان کیا، ان سے حصین نے، ان سے زید بن وہب نے بیان کیا کہ میں مقام ربذہ میں ابوذر غفاری رضی اللہ عنہ کی خدمت میں حاضر ہوا اور عرض کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ حُصَيْنٍ، عَنْ زَيْدِ بْنِ وَهْبٍ، قَالَ مَرَرْتُ عَلَى أَبِي ذَرٍّ بِالرَّبَذَةِ فَقُلْتُ مَا أَنْزَلَكَ بِهَذِهِ الأَرْضِ قَالَ كُنَّا بِالشَّأْمِ فَقَرَأْتُ ‏{‏وَالَّذِينَ يَكْنِزُونَ الذَّهَبَ وَالْفِضَّةَ وَلاَ يُنْفِقُونَهَا فِي سَبِيلِ اللَّهِ فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ‏}‏ قَالَ مُعَاوِيَةُ مَا هَذِهِ فِينَا، مَا هَذِهِ إِلاَّ فِي أَهْلِ الْكِتَابِ‏.‏ قَالَ قُلْتُ إِنَّهَا لَفِينَا وَفِيهِمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4440,
                "hadithNumber": "4661",
                "englishNarrator": "Narrated Khãlid bin Aslam:",
                "hadithEnglish": "We went out with 'Abdullãh bin 'Umar رضی اللہ عنہما and he said, \"This (Verse) was revealed before the prescription of Zakat, and when Zakãt was prescribed, Allah made it a means of purifying one's wealth.\"",
                "hadithUrdu": "ہم عبداللہ بن عمر رضی اللہ عنہما کے ساتھ   نکلے تو انہوں نے کہا کہ یہ ( مذکورہ بالا آیت ) زکوٰۃ کے حکم سے پہلے نازل ہوئی تھی۔ پھر جب زکوٰۃ کا حکم ہو گیا تو اللہ تعالیٰ نے زکوٰۃ سے مالوں کو پاک کر دیا۔",
                "urduNarrator": "احمد بن شبیب بن سعید نے کہا کہ ہم سے میرے والد (شبیب بن سعید) نے بیان کیا، ان سے یونس نے، ان سے ابن شہاب نے اور ان سے خالد بن اسلم نے کہ",
                "hadithArabic": "وَقَالَ أَحْمَدُ بْنُ شَبِيبِ بْنِ سَعِيدٍ حَدَّثَنَا أَبِي، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ خَالِدِ بْنِ أَسْلَمَ، قَالَ خَرَجْنَا مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ فَقَالَ هَذَا قَبْلَ أَنْ تُنْزَلَ، الزَّكَاةُ، فَلَمَّا أُنْزِلَتْ جَعَلَهَا اللَّهُ طُهْرًا لِلأَمْوَالِ‏.‏",
                "headingArabic": "قَوْلِهِ عَزَّ وَجَلَّ ‏{‏يَوْمَ يُحْمَى عَلَيْهَا فِي نَارِ جَهَنَّمَ فَتُكْوَى بِهَا جِبَاهُهُمْ وَجُنُوبُهُمْ وَظُهُورُهُمْ هَذَا مَا كَنَزْتُمْ لأَنْفُسِكُمْ فَذُوقُوا مَا كُنْتُمْ تَكْنِزُونَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے کہ جس دن وہ (الکنز یعنی سونا چاندی وغیرہ جن کی زکوٰۃ ادا نہیں کی گئی) کو جہنم کی آگ میں گرم کیا جائے گا اور اس سے ان کی پیشانیوں پر داغ لگائے جائیں گے۔ \"(V.9:35)",
                "headingEnglish": "The Statement of Allah \"On the Day when that (Al-Kanz—money gold and silver, etc., the Zakät of which has not been paid) will be heated in the fire of Hell, and with it will be branded their foreheads…\" (V.9:35)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4441,
                "hadithNumber": "4662",
                "englishNarrator": "Narrated Abu Bakr رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Time has come back to its original state which it had when Allah created the Heavens and the Earth; the year is twelve months, four of which are sacred. Three of them are in succession; Dhul-Qa'da, Dhul-Hijja and Al-Muharram, and (the fourth being) Rajab Mudar (named after the tribe of Mudar as they used to respect this month) which stands between Jumad (ath-thani) and Sha'ban.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ( حجۃ الوداع کے خطبے میں ) فرمایا کہ دیکھو زمانہ پھر اپنی پہلی اسی ہیئت پر آ گیا ہے جس پر اللہ تعالیٰ نے آسمان و زمین کو پیدا کیا تھا۔ سال بارہ مہینے کا ہوتا ہے، ان میں سے چار حرمت والے مہینے ہیں۔ تین تو لگاتار یعنی ذی قعدہ، ذی الحجۃ اور محرم اور چوتھا رجب مضر جو جمادی الاخریٰ اور شعبان کے درمیان میں پڑتا ہے۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا، کہا ہم سے حماد بن زید نے بیان کیا، ان سے ایوب سختیانی نے، ان سے محمد بن سیرین نے، ان سے عبدالرحمٰن بن ابی بکرہ نے، ان سے ان کے والد ابوبکرہ نفیع بن حارث رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنِ ابْنِ أَبِي بَكْرَةَ، عَنْ أَبِي بَكْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الزَّمَانَ قَدِ اسْتَدَارَ كَهَيْئَتِهِ يَوْمَ خَلَقَ اللَّهُ السَّمَوَاتِ وَالأَرْضَ، السَّنَةُ اثْنَا عَشَرَ شَهْرًا مِنْهَا، أَرْبَعَةٌ حُرُمٌ، ثَلاَثٌ مُتَوَالِيَاتٌ، ذُو الْقَعْدَةِ وَذُو الْحِجَّةِ وَالْمُحَرَّمُ وَرَجَبُ مُضَرَ الَّذِي بَيْنَ جُمَادَى وَشَعْبَانَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏إِنَّ عِدَّةَ الشُّهُورِ عِنْدَ اللَّهِ اثْنَا عَشَرَ شَهْرًا فِي كِتَابِ اللَّهِ يَوْمَ خَلَقَ السَّمَوَاتِ وَالأَرْضَ مِنْهَا أَرْبَعَةٌ حُرُمٌ‏}‏ ‏{‏الْقَيِّمُ‏}‏ هُوَ الْقَائِمُ‏.‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’بے شک مہینوں کی تعداد اللہ کے نزدیک بارہ مہینے ہے (ایک سال میں) اسی طرح اللہ تعالیٰ نے اس دن مقرر کیا تھا جب اس نے آسمانوں اور زمین کو پیدا کیا تھا، ان میں سے چار حرمت والے ہیں۔ اسلامی کیلنڈر کا پہلا، 7واں، 11واں اور 12واں مہینہ) یہی صحیح مذہب ہے، لہذا اس میں اپنے آپ کو غلط نہ سمجھو...\" (V.9:36)",
                "headingEnglish": "The Statement of Allah: \"Verily, the number of months with Allah is twelve months (in a year) so was it ordained by Allah on the Day when He created the heavens and the earth; of them four are sacred, (i.e., the 1st, the 7th, the 11th, and the 12th months of the Islamic calendar). That is the right religion; so wrong not yourself therein.. .\" (V.9:36)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4442,
                "hadithNumber": "4663",
                "englishNarrator": "Narrated Abu Bakr رضی اللہ عنہ :",
                "hadithEnglish": "I was in the company of the Prophet (ﷺ) in the cave, and on seeing the traces of the pagans, I said, \"O Allah's Messenger (ﷺ) If one of them (pagans) should lift up his foot, he will see us.\" He said, \"What do you think of two, the third of whom is Allah?\"",
                "hadithUrdu": "میں غار ثور میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھا۔ میں نے کافروں کے پاؤں دیکھے ( جو ہمارے سر پر کھڑے ہوئے تھے ) ابوبکر صدیق رضی اللہ عنہ گھبرا گئے اور بولے: یا رسول اللہ! اگر ان میں سے کسی نے ذرا بھی قدم اٹھائے تو وہ ہم کو دیکھ لے گا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تو کیا سمجھتا ہے ان دو آدمیوں کو ( کوئی نقصان پہنچا سکے گا ) جن کے ساتھ تیسرا اللہ تعالیٰ ہو۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد جعفی نے بیان کیا، کہا ہم سے حبان بن ہلال باہلی نے بیان کیا، کہا ہم سے ہمام بن یحییٰ نے بیان کیا، کہا ہم سے ثابت نے بیان کیا، کہا ہم سے انس بن مالک رضی اللہ عنہ نے بیان کیا، کہا کہ مجھ سے ابوبکر صدیق رضی اللہ عنہ نے بیان کیا: انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا حَبَّانُ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا ثَابِتٌ، حَدَّثَنَا أَنَسٌ، قَالَ حَدَّثَنِي أَبُو بَكْرٍ ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي الْغَارِ، فَرَأَيْتُ آثَارَ الْمُشْرِكِينَ قُلْتُ يَا رَسُولَ اللَّهِ، لَوْ أَنَّ أَحَدَهُمْ رَفَعَ قَدَمَهُ رَآنَا‏.‏ قَالَ ‏ \"‏ مَا ظَنُّكَ بِاثْنَيْنِ اللَّهُ ثَالِثُهُمَا ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"...دو میں سے دوسرا، جب وہ (محمد صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ غار میں تھے، اور آپ صلی اللہ علیہ وسلم نے اپنے ساتھی (ابوبکر رضی اللہ عنہ) سے فرمایا کہ تم غمگین نہ ہو، بے شک اللہ تعالیٰ غار میں ہے۔ ہمارے ساتھ۔'' (V.9:40)",
                "headingEnglish": "The Statement of Allah: “...The second of two, when they (Muhammad ﷺ and Abü Bakr were in the cave, and he ﷺ said to his companion (Abu Bakr ) ‘Be not sad (or afraid), surely Allah is with us.'\" (V.9:40)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4443,
                "hadithNumber": "4664",
                "englishNarrator": "Narrated Ibn Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When there occurred a tiff between him and Abdullah bin Zubair رضی اللہ عنہما (in cinnected with Caliphat), I said: His father is Hadrat Zubair رضی اللہ عنہ , his mother is Hadrat Asma رضی اللہ عنہا , his maternal aunt is Hadrat Aishah رضی اللہ عنہا , his maternal grandfather is Hadrat Abu Bakr رضی اللہ عنہ and his maternal grandmother is Hadrat Safiyyah رضی اللہ عنہا . I asked Sufyan to narrate its authority. He said: Narrated me this Hadith; then a man engaged him in conversation and he did not say that Ibn-e-Juraij narrated it.",
                "hadithUrdu": "جب میرا عبداللہ بن زبیر رضی اللہ عنہما سے اختلاف ہو گیا تھا تو میں نے کہا کہ ان کے والد زبیر بن عوام رضی اللہ عنہ تھے، ان کی والدہ اسماء بنت ابوبکر رضی اللہ عنہا تھیں، ان کی خالہ عائشہ رضی اللہ عنہا تھیں۔ ان کے نانا ابوبکر رضی اللہ عنہ تھے اور ان کی دادی ( نبی کریم صلی اللہ علیہ وسلم کی پھوپھی ) صفیہ رضی اللہ عنہا تھیں۔ ( عبداللہ بن محمد نے بیان کیا کہ ) میں نے سفیان ( ابن عیینہ ) سے پوچھا کہ اس روایت کی سند کیا ہے؟ تو انہوں نے کہنا شروع کیا «حدثنا» ہم سے حدیث بیان کی لیکن ابھی اتنا ہی کہنے پائے تھے کہ انہیں ایک دوسرے شخص نے دوسری باتوں میں لگا دیا اور ( راوی کا نام ) ابن جریج وہ نہ بیان کر سکے۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد بن جعفی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے ابن جریج نے، ان سے ابن ابی ملیکہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ قَالَ حِينَ وَقَعَ بَيْنَهُ وَبَيْنَ ابْنِ الزُّبَيْرِ قُلْتُ أَبُوهُ الزُّبَيْرُ، وَأُمُّهُ أَسْمَاءُ، وَخَالَتُهُ عَائِشَةُ، وَجَدُّهُ أَبُو بَكْرٍ، وَجَدَّتُهُ صَفِيَّةُ‏.‏ فَقُلْتُ لِسُفْيَانَ إِسْنَادُهُ‏.‏ فَقَالَ حَدَّثَنَا، فَشَغَلَهُ إِنْسَانٌ وَلَمْ يَقُلِ ابْنُ جُرَيْجٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4444,
                "hadithNumber": "4665",
                "englishNarrator": "Narrated Ibn Abi Mulaika:",
                "hadithEnglish": "There was a disagreement between them (i.e. Ibn `Abbas رضی اللہ عنہما and Ibn Az-Zubair رضی اللہ عنہم) so I went to Ibn `Abbas رضی اللہ عنہما in the morning and said (to him), \"Do you want to fight against Ibn Zubair and thus make lawful what Allah has made unlawful (i.e. fighting in Meccas?\" Ibn `Abbas رضی اللہ عنہما said, \"Allah forbid! Allah ordained that Ibn Zubair and Bani Umaiya would permit (fighting in Mecca), but by Allah, I will never regard it as permissible.\" Ibn `Abbas رضی اللہ عنہما added. \"The people asked me to take the oath of allegiance to Ibn Az-Zubair. I said, 'He is really entitled to assume authority for his father, Az-Zubair was the helper of the Prophet, his (maternal) grandfather, Abu Bakr رضی اللہ عنہ was (the Prophet's) companion in the cave, his mother, Asma' رضی اللہ عنہا was 'Dhatun-Nitaq', his aunt, `Aisha رضی اللہ عنہا was the mother of the Believers, his paternal aunt, Khadija رضی اللہ عنہا was the wife of the Prophet (ﷺ) , and the paternal aunt of the Prophet (ﷺ) was his grandmother. He himself is pious and chaste in Islam, well versed in the Knowledge of the Qur'an. By Allah! (Really, I left my relatives, Bani Umaiya for his sake though) they are my close relatives, and if they should be my rulers, they are equally apt to be so and are descended from a noble family. But he (Hadrat Abdullah bin Zubair رضی اللہ عنہما ) preferred Tuwaitat, Osamat and Homaidat to us, by which he meant the branches of Bani Asad namely: Bani Tuwait, bani Osamah and Bani Asad as well. Isn't it a thing worth-considering that Ibn-e-Abi Aas i.e. Abdul Malik bin Merwan is challenging and resolutely advancing but Hadrat Abdullah bin Zubair رضی اللہ عنہما is not reacting to his aggression?",
                "hadithUrdu": "ابن عباس اور ابن زبیر رضی اللہ عنہم کے درمیان بیعت کا جھگڑا پیدا ہو گیا تھا۔ میں صبح کو ابن عباس رضی اللہ عنہما کی خدمت میں حاضر ہوا اور عرض کیا آپ عبداللہ بن زبیر رضی اللہ عنہما سے جنگ کرنا چاہتے ہیں، اس کے باوجود کہ اللہ کے حرم کی بےحرمتی ہو گی؟ ابن عباس رضی اللہ عنہما نے فرمایا: معاذاللہ! یہ تو اللہ تعالیٰ نے ابن زبیر اور بنو امیہ ہی کے مقدر میں لکھ دیا ہے کہ وہ حرم کی بےحرمتی کریں۔ اللہ کی قسم! میں کسی صورت میں بھی اس بےحرمتی کے لیے تیار نہیں ہوں۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ لوگوں نے مجھ سے کہا تھا کہ ابن زبیر سے بیعت کر لو۔ میں نے ان سے کہا کہ مجھے ان کی خلافت کو تسلیم کرنے میں کیا تامل ہو سکتا ہے، ان کے والد نبی کریم صلی اللہ علیہ وسلم کے حواری تھے، آپ کی مراد زبیر بن عوام سے تھی۔ ان کے نانا صاحب غار تھے، اشارہ ابوبکر صدیق رضی اللہ عنہ کی طرف تھا۔ ان کی والدہ صاحب نطاقین تھیں یعنی اسماء رضی اللہ عنہا۔ ان کی خالہ ام المؤمنین تھیں، مراد عائشہ رضی اللہ عنہا سے تھی۔ ان کی پھوپھی نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ تھیں، مراد خدیجہ رضی اللہ عنہا سے تھی۔ ابن عباس کی مراد ان باتوں سے یہ تھی کہ وہ بہت سی خوبیوں کے مالک ہیں اور نبی کریم صلی اللہ علیہ وسلم کی پھوپھی ان کی دادی ہیں، اشارہ صفیہ رضی اللہ عنہا کی طرف تھا۔ اس کے علاوہ وہ خود اسلام میں ہمیشہ صاف کردار اور پاک دامن رہے اور قرآن کے عالم ہیں اور اللہ کی قسم! اگر وہ مجھ سے اچھا برتاؤ کریں تو ان کو کرنا ہی چاہئے وہ میرے بہت قریب کے رشتہ دار ہیں اور اگر وہ مجھ پر حکومت کریں تو خیر حکومت کریں وہ ہمارے برابر کے عزت والے ہیں۔ لیکن عبداللہ بن زبیر رضی اللہ عنہما نے تو تویت، اسامہ اور حمید کے لوگوں کو ہم پر ترجیح دی ہے۔ ان کی مراد مختلف قبائل یعنی بنو اسد، بنو تویت، بنو اسامہ اور بنو اسد سے تھی۔ ادھر ابن ابی العاص بڑی عمدگی سے چل رہا ہے یعنی عبدالملک بن مروان مسلسل پیش قدمی کر رہا ہے اور عبداللہ بن زبیر رضی اللہ عنہما نے اس کے سامنے دم دبا لی ہے۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد جعفی نے بیان کیا، کہا کہ مجھ سے یحییٰ ابن معین نے بیان کیا، کہا ہم سے حجاج بن محمد نے بیان کیا، ان سے ابن جریج نے بیان کیا، ان سے ابن ابی ملیکہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي يَحْيَى بْنُ مَعِينٍ، حَدَّثَنَا حَجَّاجٌ، قَالَ ابْنُ جُرَيْجٍ قَالَ ابْنُ أَبِي مُلَيْكَةَ وَكَانَ بَيْنَهُمَا شَىْءٌ فَغَدَوْتُ عَلَى ابْنِ عَبَّاسٍ فَقُلْتُ أَتُرِيدُ أَنْ تُقَاتِلَ ابْنَ الزُّبَيْرِ، فَتُحِلُّ حَرَمَ اللَّهِ‏.‏ فَقَالَ مَعَاذَ اللَّهِ، إِنَّ اللَّهَ كَتَبَ ابْنَ الزُّبَيْرِ وَبَنِي أُمَيَّةَ مُحِلِّينَ، وَإِنِّي وَاللَّهِ لاَ أُحِلُّهُ أَبَدًا‏.‏ قَالَ قَالَ النَّاسُ بَايِعْ لاِبْنِ الزُّبَيْرِ‏.‏ فَقُلْتُ وَأَيْنَ بِهَذَا الأَمْرِ عَنْهُ أَمَّا أَبُوهُ فَحَوَارِيُّ النَّبِيِّ صلى الله عليه وسلم، يُرِيدُ الزُّبَيْرَ، وَأَمَّا جَدُّهُ فَصَاحِبُ الْغَارِ، يُرِيدُ أَبَا بَكْرٍ، وَأُمُّهُ فَذَاتُ النِّطَاقِ، يُرِيدُ أَسْمَاءَ، وَأَمَّا خَالَتُهُ فَأُمُّ الْمُؤْمِنِينَ، يُرِيدُ عَائِشَةَ، وَأَمَّا عَمَّتُهُ فَزَوْجُ النَّبِيِّ صلى الله عليه وسلم، يُرِيدُ خَدِيجَةَ، وَأَمَّا عَمَّةُ النَّبِيِّ صلى الله عليه وسلم فَجَدَّتُهُ، يُرِيدُ صَفِيَّةَ، ثُمَّ عَفِيفٌ فِي الإِسْلاَمِ، قَارِئٌ لِلْقُرْآنِ‏.‏ وَاللَّهِ إِنْ وَصَلُونِي وَصَلُونِي مِنْ قَرِيبٍ، وَإِنْ رَبُّونِي رَبَّنِي أَكْفَاءٌ كِرَامٌ، فَآثَرَ التُّوَيْتَاتِ وَالأُسَامَاتِ وَالْحُمَيْدَاتِ، يُرِيدُ أَبْطُنًا مِنْ بَنِي أَسَدٍ بَنِي تُوَيْتٍ وَبَنِي أُسَامَةَ وَبَنِي أَسَدٍ، إِنَّ ابْنَ أَبِي الْعَاصِ بَرَزَ يَمْشِي الْقُدَمِيَّةَ، يَعْنِي عَبْدَ الْمَلِكِ بْنَ مَرْوَانَ، وَإِنَّهُ لَوَّى ذَنَبَهُ، يَعْنِي ابْنَ الزُّبَيْرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4445,
                "hadithNumber": "4666",
                "englishNarrator": "Narrated Ibn Abi Mulaika:",
                "hadithEnglish": "We entered upon Ibn `Abbas رضی اللہ عنہما and he said \"Are you not astonished at Ibn Az-Zubair's assuming the caliphate?\" I said (to myself), \"I will support him and speak of his good traits as I did not do even for Abu Bakr رضی اللہ عنہ and `Umar رضی اللہ عنہما though they were more entitled to receive al I good than he was.\" I said \"He (i.e Ibn Az-Zubair) is the son of the aunt of the Prophet (ﷺ) and the son of Az-Zubair, and the grandson of Abu Bakr رضی اللہ عنہ and the son of Khadija's brother, and the son of `Aisha's sister.\" Nevertheless, he considers himself to be superior to me and does not want me to be one of his friends. So I said, \"I never expected that he would refuse my offer to support him, and I don't think he intends to do me any good, therefore, if my cousins should inevitably be my rulers, it will be better for me to be ruled by them than by some others.\"",
                "hadithUrdu": "ہم ابن عباس رضی اللہ عنہما کی خدمت میں حاضر ہوئے تو انہوں نے کہا کہ ابن زبیر پر تمہیں حیرت نہیں ہوتی۔ وہ اب خلافت کے لیے کھڑے ہو گئے ہیں تو میں نے ارادہ کر لیا کہ ان کے لیے محنت مشقت کروں گا کہ ایسی محنت اور مشقت میں نے ابوبکر اور عمر رضی اللہ عنہما کے لیے بھی نہیں کی۔ حالانکہ وہ دونوں ان سے ہر حیثیت سے بہتر تھے۔ میں نے لوگوں سے کہا کہ وہ رسول اللہ صلی اللہ علیہ وسلم کی پھوپھی کی اولاد میں سے ہیں۔ زبیر رضی اللہ عنہ کے بیٹے اور ابوبکر رضی اللہ عنہ کے نواسے، خدیجہ رضی اللہ عنہا کے بھائی کے بیٹے، عائشہ رضی اللہ عنہا کی بہن کے بیٹے۔ لیکن عبداللہ بن زبیر نے کیا کیا وہ مجھ سے غرور کرنے لگے۔ انہوں نے نہیں چاہا کہ میں ان کے خاص مصاحبوں میں رہوں ( اپنے دل میں کہا ) مجھ کو ہرگز یہ گمان نہ تھا کہ میں تو ان سے ایسی عاجزی کروں گا اور وہ اس پر بھی مجھ سے راضی نہ ہوں گے۔ خیر اب مجھے امید نہیں کہ وہ میرے ساتھ بھلائی کریں گے جو ہونا تھا وہ ہوا اب بنی امیہ جو میرے چچا زاد بھائی ہیں اگر مجھ پر حکومت کریں تو یہ مجھ کو اوروں کے حکومت کرنے سے زیادہ پسند ہے۔",
                "urduNarrator": "ہم سے محمد بن عبید بن میمون نے بیان کیا، کہا ہم سے عیسیٰ بن یونس نے، ان سے عمر بن سعید نے، انہیں ابن ابی ملیکہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُمَرَ بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، دَخَلْنَا عَلَى ابْنِ عَبَّاسٍ فَقَالَ أَلاَ تَعْجَبُونَ لاِبْنِ الزُّبَيْرِ قَامَ فِي أَمْرِهِ هَذَا فَقُلْتُ لأُحَاسِبَنَّ نَفْسِي لَهُ مَا حَاسَبْتُهَا لأَبِي بَكْرٍ وَلاَ لِعُمَرَ، وَلَهُمَا كَانَا أَوْلَى بِكُلِّ خَيْرٍ مِنْهُ، وَقُلْتُ ابْنُ عَمَّةِ النَّبِيِّ صلى الله عليه وسلم، وَابْنُ الزُّبَيْرِ، وَابْنُ أَبِي بَكْرٍ، وَابْنُ أَخِي خَدِيجَةَ، وَابْنُ أُخْتِ عَائِشَةَ فَإِذَا هُوَ يَتَعَلَّى عَنِّي وَلاَ يُرِيدُ ذَلِكَ فَقُلْتُ مَا كُنْتُ أَظُنُّ أَنِّي أَعْرِضُ هَذَا مِنْ نَفْسِي، فَيَدَعُهُ، وَمَا أُرَاهُ يُرِيدُ خَيْرًا، وَإِنْ كَانَ لاَ بُدَّ لأَنْ يَرُبَّنِي بَنُو عَمِّي أَحَبُّ إِلَىَّ مِنْ أَنْ يَرُبَّنِي غَيْرُهُمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4446,
                "hadithNumber": "4667",
                "englishNarrator": "Narrated Abu Sa`id:",
                "hadithEnglish": "Something was sent to the Prophet (ﷺ) and he distributed it amongst four (men) and said, \"I want to attract their hearts,(to Islam thereby),\" A man said (to the Prophet (ﷺ) ), \"You have not done justice.\" Thereupon the Prophet (ﷺ) said, \"There will emerge from the offspring of this (man) some people who will renounce the religion.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے پاس کچھ مال آیا تو آپ نے چار آدمیوں میں اسے تقسیم کر دیا۔ ( جو نو مسلم تھے ) اور فرمایا کہ میں یہ مال دے کر ان کی دلجوئی کرنا چاہتا ہوں اس پر ( بنو تمیم کا ) ایک شخص بولا کہ آپ نے انصاف نہیں کیا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اس شخص کی نسل سے ایسے لوگ پیدا ہوں گے جو دین سے باہر ہو جائیں گے۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم کو سفیان ثوری نے خبر دی، انہیں ان کے والد سعید بن مسروق نے، انہیں ابن ابی نعم نے اور ان سے ابو سعید خدری نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِيهِ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي سَعِيد ٍ ـ رضى الله عنه ـ قَالَ بُعِثَ إِلَى النَّبِيِّ صلى الله عليه وسلم بِشَىْءٍ، فَقَسَمَهُ بَيْنَ أَرْبَعَةٍ وَقَالَ ‏\"‏ أَتَأَلَّفُهُمْ ‏\"‏‏.‏ فَقَالَ رَجُلٌ مَا عَدَلْتَ‏.‏ فَقَالَ ‏\"‏ يَخْرُجُ مِنْ ضِئْضِئِ هَذَا قَوْمٌ يَمْرُقُونَ مِنَ الدِّينِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَالْمُؤَلَّفَةِ قُلُوبُهُمْ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے \"...اور ان لوگوں کے دلوں کو متوجہ کرنے کے لیے جو (اسلام کی طرف) مائل ہیں؛ اور قیدیوں کو آزاد کرنے کے لیے...\" (V.9:60)",
                "headingEnglish": "The Statement of Allah \"...And (for) to attract the hearts of those who have been inclined (towards Islam) ; and to free the captives...\" (V.9:60)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4447,
                "hadithNumber": "4668",
                "englishNarrator": "Narrated Abu Mas`ud رضی اللہ عنہ :",
                "hadithEnglish": "When we were ordered to give alms, we began to work as porters (to earn something we could give in charity). Abu `Aqil came with one half of a Sa` (special measure for food grains) and another person brought more than he did. So the hypocrites said, \"Allah is not in need of the alms of this (i.e. Abu `Aqil); and this other person did not give alms but for showing off.\" Then Allah revealed:-- 'Those who criticize such of the Believers who give charity voluntarily and those who could not find to give in charity except what is available to them.' (9.79)",
                "hadithUrdu": "جب ہمیں خیرات کرنے کا حکم ہوا تو ہم مزدوری پر بوجھ اٹھاتے ( اور اس کی مزدوری صدقہ میں دے دیتے ) چنانچہ ابوعقیل اسی مزدوری سے آدھا صاع خیرات لے کر آئے اور ایک دوسرے صحابی عبدالرحمٰن بن عوف اس سے زیادہ لائے۔ اس پر منافقوں نے کہا کہ اللہ کو اس ( یعنی عقیل ) کے صدقہ کی کوئی ضرورت نہیں تھی اور اس دوسرے ( عبدالرحمٰن بن عوف ) نے تو محض دکھاوے کے لیے اتنا بہت سا صدقہ دیا ہے۔ چنانچہ یہ آیت نازل ہوئی «الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم‏» کہ ”یہ ایسے لوگ ہیں جو صدقات کے بارے میں نفل صدقہ دینے والے مسلمانوں پر طعن کرتے ہیں اور خصوصاً ان لوگوں پر جنہیں بجز ان کی محنت مزدوری کے کچھ نہیں ملتا۔“ آخر آیت تک۔",
                "urduNarrator": "مجھ سے ابو محمد بشر بن خالد نے بیان کیا، کہا ہم کو محمد بن جعفر نے خبر دی، انہیں شعبہ نے، انہیں سلیمان اعمش نے، انہیں ابووائل نے اور ان سے ابومسعود انصاری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي بِشْرُ بْنُ خَالِدٍ أَبُو مُحَمَّدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ لَمَّا أُمِرْنَا بِالصَّدَقَةِ كُنَّا نَتَحَامَلُ فَجَاءَ أَبُو عَقِيلٍ بِنِصْفِ صَاعٍ، وَجَاءَ إِنْسَانٌ بِأَكْثَرَ مِنْهُ، فَقَالَ الْمُنَافِقُونَ إِنَّ اللَّهَ لَغَنِيٌّ عَنْ صَدَقَةِ هَذَا، وَمَا فَعَلَ هَذَا الآخَرُ إِلاَّ رِئَاءً‏.‏ فَنَزَلَتْ ‏{‏الَّذِينَ يَلْمِزُونَ الْمُطَّوِّعِينَ مِنَ الْمُؤْمِنِينَ فِي الصَّدَقَاتِ وَالَّذِينَ لاَ يَجِدُونَ إِلاَّ جُهْدَهُمْ‏}‏ الآيَةَ‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏الَّذِينَ يَلْمِزُونَ الْمُطَّوِّعِينَ مِنَ الْمُؤْمِنِينَ‏}‏",
                "headingUrdu": "اللہ کا فرمان \"جو لوگ ایسے مومنین کو بدنام کرتے ہیں جو (اللہ کی راہ میں) اپنی مرضی سے صدقہ دیتے ہیں...\" (V.9:79)",
                "headingEnglish": "The Statement of Allah \"Those who defame such of the believers who give charity (in Allah's Cause) voluntarily...\" (V.9:79)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4448,
                "hadithNumber": "4669",
                "englishNarrator": "Narrated Abu Mas`ud Al-Ansari:",
                "hadithEnglish": "\"Allah's Messenger (ﷺ), used to order us to give alms. So one of us would exert himself to earn one Mud (special measure of wheat or dates, etc.,) to give in charity; while today one of us may have one hundred thousand.\" Shaqiq said: As if Abu Masud referred to himself.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم صدقہ کی ترغیب دیتے تھے تو آپ صلی اللہ علیہ وسلم کے بعض صحابہ مزدوری کر کے لاتے اور ( بڑی مشکل سے ) ایک مد کا صدقہ کر سکتے لیکن آج انہیں میں بعض ایسے ہیں جن کے پاس لاکھوں درہم ہیں۔ غالباً ان کا اشارہ خود اپنی طرف تھا ( حماد نے کہا ہاں سچ ہے ) ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا، کہا کہ میں نے ابواسامہ (حماد بن اسامہ) سے پوچھا، آپ حضرات سے زائدہ بن قدامہ نے بیان کیا تھا کہ ان سے سلیمان نے، ان سے شقیق نے اور ان سے ابومسعود انصاری نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ قُلْتُ لأَبِي أُسَامَةَ أَحَدَّثَكُمْ زَائِدَةُ عَنْ سُلَيْمَانَ عَنْ شَقِيقٍ عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُ بِالصَّدَقَةِ، فَيَحْتَالُ أَحَدُنَا حَتَّى يَجِيءَ بِالْمُدِّ، وَإِنَّ لأَحَدِهِمِ الْيَوْمَ مِائَةَ أَلْفٍ‏.‏ كَأَنَّهُ يُعَرِّضُ بِنَفْسِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4449,
                "hadithNumber": "4670",
                "englishNarrator": "Narrated Ibn Umar رضی اللہ عنہما :",
                "hadithEnglish": "When `Abdullah bin 'Ubai died, his son `Abdullah bin `Abdullah came to Allah's Messenger (ﷺ) and asked him to give him his shirt in order to shroud his father in it. He gave it to him and then `Abdullah asked the Prophet (ﷺ) to offer the funeral prayer for him (his father). Allah's Messenger (ﷺ) got up to offer the funeral prayer for him, but `Umar رضی اللہ عنہ got up too and got hold of the garment of Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ) Will you offer the funeral prayer for him though your Lord has forbidden you to offer the prayer for him\" Allah's Messenger (ﷺ) said, \"But Allah has given me the choice by saying: '(Whether you) ask forgiveness for them, or do not ask forgiveness for them; even if you ask forgiveness for them seventy times..' (9.80) so I will ask more than seventy times.\" `Umar رضی اللہ عنہ said, \"But he (`Abdullah bin 'Ubai) is a hypocrite!\" However, Allah's Messenger (ﷺ) did offer the funeral prayer for him whereupon Allah revealed: 'And never (O Muhammad) pray for anyone of them that dies, nor stand at his grave.' (9.84)",
                "hadithUrdu": "جب عبداللہ بن ابی ( منافق ) کا انتقال ہوا تو اس کے لڑکے عبداللہ بن عبداللہ ( جو پختہ مسلمان تھے ) رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ آپ اپنی قمیص ان کے والد کے کفن کے لیے عنایت فرما دیں۔ نبی کریم صلی اللہ علیہ وسلم نے قمیص عنایت فرمائی۔ پھر انہوں نے عرض کی کہ آپ نماز جنازہ بھی پڑھا دیں۔ نبی کریم صلی اللہ علیہ وسلم نماز جنازہ پڑھانے کے لیے بھی آگے بڑھ گئے۔ اتنے میں عمر رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کا دامن پکڑ لیا اور عرض کیا: یا رسول اللہ! اس کی نماز جنازہ پڑھانے جا رہے ہیں، جبکہ اللہ تعالیٰ نے آپ کو اس سے منع بھی فرما دیا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے مجھے اختیار دیا ہے فرمایا ہے «استغفر لهم أو لا تستغفر لهم إن تستغفر لهم سبعين مرة‏» کہ ”آپ ان کے لیے استغفار کریں خواہ نہ کریں۔ اگر آپ ان کے لیے ستر بار بھی استغفار کریں گے ( تب بھی اللہ انہیں نہیں بخشے گا ) ۔“ اس لیے میں ستر مرتبہ سے بھی زیادہ استغفار کروں گا۔ ( ممکن ہے کہ اللہ تعالیٰ زیادہ استغفار کرنے سے معاف کر دے ) عمر رضی اللہ عنہ بولے لیکن یہ شخص تو منافق ہے۔ ابن عمر رضی اللہ عنہما نے بیان کیا کہ آخر نبی کریم صلی اللہ علیہ وسلم نے اس کی نماز جنازہ پڑھائی۔ اس کے بعد اللہ تعالیٰ نے یہ حکم نازل فرمایا «ولا تصل على أحد منهم مات أبدا ولا تقم على قبره‏» کہ ”اور ان میں سے جو کوئی مر جائے اس پر کبھی بھی نماز نہ پڑھئے اور نہ اس کی قبر پر کھڑا ہوئیے۔“",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا، ان سے ابواسامہ نے، ان سے عبیداللہ بن عمری نے، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، عَنْ أَبِي أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ لَمَّا تُوُفِّيَ عَبْدُ اللَّهِ جَاءَ ابْنُهُ عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ أَنْ يُعْطِيَهُ قَمِيصَهُ يُكَفِّنُ فِيهِ أَبَاهُ فَأَعْطَاهُ، ثُمَّ سَأَلَهُ أَنْ يُصَلِّيَ عَلَيْهِ، فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيُصَلِّيَ فَقَامَ عُمَرُ فَأَخَذَ بِثَوْبِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ تُصَلِّي عَلَيْهِ وَقَدْ نَهَاكَ رَبُّكَ أَنْ تُصَلِّيَ عَلَيْهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا خَيَّرَنِي اللَّهُ فَقَالَ ‏{‏اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً‏}‏ وَسَأَزِيدُهُ عَلَى السَّبْعِينَ ‏\"‏‏.‏ قَالَ إِنَّهُ مُنَافِقٌ‏.‏ قَالَ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ ‏{‏وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلاَ تَقُمْ عَلَى قَبْرِهِ‏}‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے کہ ’’آپ (اے محمد صلی اللہ علیہ وسلم) ان (منافقوں) کے لیے استغفار کریں یا ان کے لیے استغفار نہ کریں - (اور اگر آپ ان کے لیے ستر مرتبہ بھی استغفار کریں گے تو بھی اللہ تعالیٰ ان کو معاف نہیں کرے گا)۔ 9:80)",
                "headingEnglish": "The Statement of Allah 'Whether you (O Muhammad ﷺ ask forgiveness for them (hypocrites) or ask not forgiveness for them - (and even) if you ask seventy times for their forgiveness – Allah will not forgive them...\" (V.9:80)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4450,
                "hadithNumber": "4671",
                "englishNarrator": "Narrated `Umar bin Al-Khattab رضی اللہ عنہ :",
                "hadithEnglish": "When `Abdullah bin Ubai bin Salul died, Allah's Messenger (ﷺ) was called in order to offer the funeral prayer for him. When Allah's Messenger (ﷺ) got up (to offer the prayer) I jumped towards him and said, \"O Allah's Messenger (ﷺ)! Do you offer the prayer for Ibn Ubai although he said so-and-so on such-and-such-a day?\" I went on mentioning his sayings. Allah's Messenger (ﷺ) smiled and said, \"Keep away from me, O `Umar!\" But when I spoke too much to him, he said, \"I have been given the choice, and I have chosen (this) ; and if I knew that if I asked forgiveness for him more than seventy times, he would be for given, I would ask it for more times than that.\" So Allah's Messenger (ﷺ) offered the funeral prayer for him and then left, but he did not stay long before the two Verses of Surat-Bara'a were revealed, i.e.:-- 'And never (O Muhammad) pray for anyone of them that dies.... and died in a state of rebellion.' (9.84) Later I was astonished at my daring to speak like that to Allah's Messenger (ﷺ) and Allah and His Apostle know best.",
                "hadithUrdu": "جب عبداللہ بن ابی ابن سلول کی موت ہوئی تو رسول اللہ صلی اللہ علیہ وسلم سے اس کی نماز جنازہ پڑھانے کے لیے کہا گیا۔ جب آپ صلی اللہ علیہ وسلم نماز پڑھانے کے لیے کھڑے ہوئے تو میں جلدی سے خدمت نبوی میں پہنچا اور عرض کیا کہ یا رسول اللہ! آپ ابن ابی ( منافق ) کی نماز جنازہ پڑھانے لگے حالانکہ اس نے فلاں فلاں دن اس اس طرح کی باتیں ( اسلام کے خلاف ) کی تھیں؟ عمر رضی اللہ عنہ نے بیان کیا کہ میں اس کی کہی ہوئی باتیں ایک ایک کر کے پیش کرنے لگا۔ لیکن نبی کریم صلی اللہ علیہ وسلم نے تبسم کر کے فرمایا کہ عمر! میرے پاس سے ہٹ جاؤ ( اور صف میں جا کے کھڑے ہو جاؤ ) ۔ میں نے اصرار کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے اختیار دیا گیا ہے۔ اس لیے میں نے ( اس کے لیے استغفار کرنے اور اس کی نماز جنازہ پڑھانے ہی کو ) پسند کیا، اگر مجھے یہ معلوم ہو جائے کہ ستر مرتبہ سے زیادہ استغفار کرنے سے اس کی مغفرت ہو جائے گی تو میں ستر مرتبہ سے زیادہ استغفار کروں گا۔ بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے نماز پڑھائی اور واپس تشریف لائے، تھوڑی دیر ابھی ہوئی تھی کہ سورۃ برات کی دو آیتیں نازل ہوئیں «ولا تصل على أحد منهم مات أبدا‏» کہ ”ان میں سے جو کوئی مر جائے اس پر کبھی بھی نماز نہ پڑھئے۔“ آخر آیت «وهم فاسقون‏» تک۔ عمر رضی اللہ عنہ نے بیان کیا کہ بعد میں مجھے نبی کریم صلی اللہ علیہ وسلم کے سامنے اپنی اس درجہ جرات پر خود بھی حیرت ہوئی اور اللہ اور اس کے رسول بہتر جاننے والے ہیں۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے اور ان کے علاوہ (ابوصالح عبداللہ بن صالح) نے بیان کیا، کہ مجھ سے لیث بن سعد نے بیان کیا، ان سے عقیل نے بیان کیا، ان سے ابن شہاب نے بیان کیا، انہیں عبیداللہ بن عبداللہ نے خبر دی اور ان سے ابن عباس رضی اللہ عنہما نے، ان سے عمر رضی اللہ عنہ نے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ،‏.‏ وَقَالَ غَيْرُهُ حَدَّثَنِي اللَّيْثُ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ أَنَّهُ قَالَ لَمَّا مَاتَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ دُعِيَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيُصَلِّيَ عَلَيْهِ فَلَمَّا قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَثَبْتُ إِلَيْهِ، فَقُلْتُ يَا رَسُولَ اللَّهِ، أَتُصَلِّي عَلَى ابْنِ أُبَىٍّ وَقَدْ قَالَ يَوْمَ كَذَا كَذَا وَكَذَا قَالَ أُعَدِّدُ عَلَيْهِ قَوْلَهُ، فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ أَخِّرْ عَنِّي يَا عُمَرُ ‏\"‏‏.‏ فَلَمَّا أَكْثَرْتُ عَلَيْهِ قَالَ ‏\"‏ إِنِّي خُيِّرْتُ فَاخْتَرْتُ، لَوْ أَعْلَمُ أَنِّي إِنْ زِدْتُ عَلَى السَّبْعِينَ يُغْفَرْ لَهُ لَزِدْتُ عَلَيْهَا ‏\"‏‏.‏ قَالَ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ انْصَرَفَ فَلَمْ يَمْكُثْ إِلاَّ يَسِيرًا حَتَّى نَزَلَتِ الآيَتَانِ مِنْ بَرَاءَةَ ‏{‏وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا‏}‏ إِلَى قَوْلِهِ ‏{‏وَهُمْ فَاسِقُونَ‏}‏ قَالَ فَعَجِبْتُ بَعْدُ مِنْ جُرْأَتِي عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَاللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4451,
                "hadithNumber": "4672",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When `Abdullah bin Ubai died, his son `Abdullah bin `Abdullah came to Allah's Messenger (ﷺ) who gave his shirt to him and ordered him to shroud his father in it. Then he stood up to offer the funeral prayer for the deceased, but `Umar bin Al-Khattab رضی اللہ عنہ took hold of his garment and said, \"Do you offer the funeral prayer for him though he was a hypocrite and Allah has forbidden you to ask forgiveness for hypocrites?\" The Prophet (ﷺ) said, \"Allah has given me the choice (or Allah has informed me) saying: \"Whether you, O Muhammad, ask forgiveness for them, or do not ask forgiveness for them, even if you ask forgiveness for them seventy times, Allah will not forgive them,\" (9.80) The he added, \"I will (appeal to Allah for his sake) more than seventy times.\" So Allah's Messenger (ﷺ) offered the funeral prayer for him and we too, offered the prayer along with him. Then Allah revealed: \"And never, O Muhammad, pray (funeral prayer) for anyone of them that dies, nor stand at his grave. Certainly they disbelieved in Allah and His Apostle and died in a state of rebellion.\" (9.84)",
                "hadithUrdu": "جب عبداللہ بن ابی کا انتقال ہوا تو اس کے بیٹے عبداللہ بن عبداللہ بن ابی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئے۔ نبی کریم صلی اللہ علیہ وسلم نے انہیں اپنا کرتہ عنایت فرمایا اور فرمایا کہ اس کرتے سے اسے کفن دیا جائے پھر آپ اس پر نماز پڑھانے کے لیے کھڑے ہوئے تو عمر رضی اللہ عنہ نے آپ کا دامن پکڑ لیا اور عرض کیا آپ اس پر نماز پڑھانے کے لیے تیار ہو گئے حالانکہ یہ منافق ہے، اللہ تعالیٰ بھی آپ کو ان کے لیے استغفار سے منع کر چکا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے مجھے اختیار دیا ہے۔ یا راوی نے «خيرني» کی جگہ لفظ «أخبرني» نقل کیا ہے۔ اللہ تعالیٰ کا ارشاد ہے «استغفر لهم أو لا تستغفر لهم إن تستغفر لهم سبعين مرة فلن يغفر الله لهم‏» کہ ”آپ ان کے لیے استغفار کریں خواہ نہ کریں۔ اگر آپ ان کے لیے ستر بار بھی استغفار کریں گے جب بھی اللہ انہیں نہیں بخشے گا۔“ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میں ستر مرتبہ سے بھی زیادہ استغفار کروں گا۔ عمر رضی اللہ عنہ نے بیان کیا کہ پھر آپ صلی اللہ علیہ وسلم نے اس پر نماز پڑھی اور ہم نے بھی ان کے ساتھ پڑھی۔ اس کے بعد اللہ تعالیٰ نے یہ آیت اتاری «ولا تصل على أحد منهم مات أبدا ولا تقم على قبره إنهم كفروا بالله ورسوله وماتوا وهم فاسقون‏» کہ ”اور ان میں سے جو کوئی مر جائے، آپ اس پر کبھی بھی جنازہ نہ پڑھیں اور نہ اس کی قبر پر کھڑے ہوں۔ بیشک انہوں نے اللہ اور اس کے رسول کے ساتھ کفر کیا ہے اور وہ اس حال میں مرے ہیں کہ وہ نافرمان تھے۔“",
                "urduNarrator": "مجھ سے ابراہیم بن المنذر نے بیان کیا، کہا کہ ہم سے انس بن عیاض نے، ان سے عبیداللہ نے اور ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ قَالَ لَمَّا تُوُفِّيَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ جَاءَ ابْنُهُ عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَعْطَاهُ قَمِيصَهُ وَأَمَرَهُ أَنْ يُكَفِّنَهُ فِيهِ ثُمَّ قَامَ يُصَلِّي عَلَيْهِ، فَأَخَذَ عُمَرُ بْنُ الْخَطَّابِ بِثَوْبِهِ فَقَالَ تُصَلِّي عَلَيْهِ وَهْوَ مُنَافِقٌ وَقَدْ نَهَاكَ اللَّهُ أَنْ تَسْتَغْفِرَ لَهُمْ‏.‏ قَالَ ‏\"‏ إِنَّمَا خَيَّرَنِي اللَّهُ أَوْ أَخْبَرَنِي فَقَالَ ‏{‏اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ‏}‏ فَقَالَ سَأَزِيدُهُ عَلَى سَبْعِينَ ‏\"‏‏.‏ قَالَ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَصَلَّيْنَا مَعَهُ ثُمَّ أَنْزَلَ اللَّهُ عَلَيْهِ ‏{‏وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلاَ تَقُمْ عَلَى قَبْرِهِ إِنَّهُمْ كَفَرُوا بِاللَّهِ وَرَسُولِهِ وَمَاتُوا وَهُمْ فَاسِقُونَ‏}‏",
                "headingArabic": "قَوْلِهِ ‏{‏وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلاَ تَقُمْ عَلَى قَبْرِهِ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور ان میں سے جو (منافق) مر جائے اس کی نماز جنازہ نہ پڑھو اور نہ اس کی قبر پر کھڑا ہو‘‘ (آیت 9:84)",
                "headingEnglish": "The Statement of Allah: 'And never (O Muhammad ﷺ ) pray (funeral prayer) for any of them (hypocrites) who dies, nor stand at his grave.\" (V.9:84)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4452,
                "hadithNumber": "4673",
                "englishNarrator": "Narrated `Abdullah bin Ka`b:",
                "hadithEnglish": "I heard Ka`b bin Malik رضی اللہ عنہ at the time he remained behind and did not join (the battle of) Tabuk, saying, \"By Allah, no blessing has Allah bestowed upon me, besides my guidance to Islam, better than that of helping me speak the truth to Allah's Messenger (ﷺ) otherwise I would have told the Prophet (ﷺ) a lie and would have been ruined like those who had told a lie when the Divine Inspiration was revealed:-- \"They will swear by Allah to you (Muslims) when you return to them.. the rebellious people.\" (9.95-96)",
                "hadithUrdu": "انہوں نے کعب بن مالک رضی اللہ عنہ سے ان کے غزوہ تبوک میں شریک نہ ہو سکنے کا واقعہ سنا۔ انہوں نے بتلایا، اللہ کی قسم! ہدایت کے بعد اللہ نے مجھ پر اتنا بڑا اور کوئی انعام نہیں کیا جتنا رسول اللہ صلی اللہ علیہ وسلم کے سامنے سچ بولنے کے بعد ظاہر ہوا تھا کہ اس نے مجھے جھوٹ بولنے سے بچایا، ورنہ میں بھی اسی طرح ہلاک ہو جاتا جس طرح دوسرے لوگ جھوٹی معذرتیں بیان کرنے والے ہلاک ہوئے تھے اور اللہ تعالیٰ نے ان کے بارے میں وحی نازل کی تھی «سيحلفون بالله لكم إذا انقلبتم إليهم‏» کہ ”عنقریب یہ لوگ تمہارے سامنے، جب تم ان کے پاس واپس جاؤ گے۔ اللہ کی قسم کھا جائیں گے۔“ آخر آیت «الفاسقين‏» تک۔",
                "urduNarrator": "ہم سے یحییٰ بن سعید نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، ان سے عبدالرحمٰن بن عبداللہ نے اور ان سے عبداللہ بن کعب بن مالک نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، حِينَ تَخَلَّفَ عَنْ تَبُوكَ، وَاللَّهِ، مَا أَنْعَمَ اللَّهُ عَلَىَّ مِنْ نِعْمَةٍ بَعْدَ إِذْ هَدَانِي أَعْظَمَ مِنْ صِدْقِي رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ لاَ أَكُونَ كَذَبْتُهُ فَأَهْلِكَ كَمَا هَلَكَ الَّذِينَ كَذَبُوا حِينَ أُنْزِلَ الْوَحْىُ ‏{‏سَيَحْلِفُونَ بِاللَّهِ لَكُمْ إِذَا انْقَلَبْتُمْ إِلَيْهِمْ‏}‏ إِلَى ‏{‏الْفَاسِقِينَ‏}‏‏.‏",
                "headingArabic": "قَوْلِهِ ‏{‏سَيَحْلِفُونَ بِاللَّهِ لَكُمْ إِذَا انْقَلَبْتُمْ إِلَيْهِمْ لِتُعْرِضُوا عَنْهُمْ فَأَعْرِضُوا عَنْهُمْ إِنَّهُمْ رِجْسٌ وَمَأْوَاهُمْ جَهَنَّمُ جَزَاءً بِمَا كَانُوا يَكْسِبُونَ‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’جب تم ان کے پاس واپس جاؤ گے تو وہ تمہارے سامنے اللہ کی قسم کھائیں گے تاکہ تم ان سے منہ پھیر لو‘‘ (آیت 9:95)",
                "headingEnglish": "The Statement of Allah: \"They will swear by Allah to you (Muslims) when you return to them, that you may turn away from them...\" (V.9:95)",
                "chapterId": "66",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 66,
                    "chapterNumber": "66",
                    "chapterEnglish": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (PBUH))",
                    "chapterUrdu": "قرآن پاک کی تفسیر کے بیان میں",
                    "chapterArabic": "كتاب التفسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4426,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=177",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=175",
                "label": "175",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=176",
                "label": "176",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=177",
                "label": "177",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=178",
                "label": "178",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=179",
                "label": "179",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=180",
                "label": "180",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=181",
                "label": "181",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=179",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=179",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=177",
        "to": 4450,
        "total": 40465
    }
}