{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 282,
        "data": [
            {
                "id": 7031,
                "hadithNumber": "7335",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Between my house and my pulpit there is a garden from one of the gardens of Paradise, and my pulpit is over my Lake-Tank. (Kauthar);",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ میرے حجرہ اور میرے منبر کے درمیان کی زمین جنت کے باغوں میں سے ایک باغ ہے اور میرا یہ منبر میرے حوض پر ہو گا ۔",
                "urduNarrator": "ہم سے عمر بن علی نے بیان کیا ‘ انہوں نے کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ‘ انہوں نے کہا ہم سے مالک نے بیان کیا ‘ ان سے خبیب بن عبدالرحمٰن نے بیان کیا ‘ ان سے حفص بن عاصم نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا مَالِكٌ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ، وَمِنْبَرِي عَلَى حَوْضِي ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7032,
                "hadithNumber": "7336",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "\"The Prophet (ﷺ) arranged for a horse race, and the prepared horses were given less food for a few days before the race to win the race, and were allowed to run from Al-Hafya to Thaniyat-al- Wada`, and the unprepared horses were allowed to run between Thaniyat-al-Wada` and the mosque of Bani Zuraiq,\" `Abdullah رضی اللہ عنہ was one of those who participated in the race.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے گھوڑوں کی دوڑ کرائی اور وہ گھوڑے چھوڑے گئے جو گھوڑ دوڑ کیلئے تیار کئے گئے تھے تو ان کے دوڑ نے کا میدان مقام حفیاء سے ثنیۃ الوداع سے مسجد بنی زریق تک تھا اور عبداللہ رضی اللہ عنہ بھی ان لوگوں میں تھے جنہوں نے مقابلے میں حصہ لیا تھا ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے جویریہ نے بیان کیا ‘ ان سے نافع نے اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ سَابَقَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ الْخَيْلِ، فَأُرْسِلَتِ الَّتِي ضُمِّرَتْ مِنْهَا وَأَمَدُهَا إِلَى الْحَفْيَاءِ إِلَى ثَنِيَّةِ الْوَدَاعِ، وَالَّتِي لَمْ تُضَمَّرْ أَمَدُهَا ثَنِيَّةُ الْوَدَاعِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ، وَأَنَّ عَبْدَ اللَّهِ كَانَ فِيمَنْ سَابَقَ‏.‏ حَدَّثَنَا قُتَيْبَةُ عَنْ لَيْثٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7033,
                "hadithNumber": "7337",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I heard `Umar رضی اللہ عنہ (delivering a sermon) on the pulpit of the Prophet.",
                "hadithUrdu": "میں نے عمر رضی اللہ عنہ کو نبی کریم صلی اللہ علیہ وسلم کے منبر پر ( خطبہ دیتے ) سنا ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ‘ ان سے لیث نے ‘ ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے ( دوسری سند ) اور مجھ سے اسحاق نے بیان کیا ‘ انہوں نے کہا ہم کو عیسیٰ اور ابن ادریس نے خبر دی اور ابن ابی غنیہ نے خبر دی ‘ انہیں ابو حیان نے ‘ انہیں شعبی نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ عَنْ لَيْثٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ‏‏ ح. وَحَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا عِيسَى، وَابْنُ، إِدْرِيسَ وَابْنُ أَبِي غَنِيَّةَ عَنْ أَبِي حَيَّانَ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ عُمَرَ، عَلَى مِنْبَرِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7034,
                "hadithNumber": "7338",
                "englishNarrator": "Narrated As-Sa'ib bin Yazid:",
                "hadithEnglish": "He heard `Uthman bin `Affan رضی اللہ عنہ delivering a sermon on the pulpit of the Prophet ﷺ.",
                "hadithUrdu": "انہوں نے عثمان بن عفان رضی اللہ عنہ سے سنا ‘ جو نبی کریم صلی اللہ علیہ وسلم کے منبر سے ہمیں خطاب کر رہے تھے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ‘ انہیں زہری نے ‘ انہیں سائب بن یزید نے خبر دی ‘",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ، سَمِعَ عُثْمَانَ بْنَ عَفَّانَ، خَطَبَنَا عَلَى مِنْبَرِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7035,
                "hadithNumber": "7339",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "This big copper vessel used to be put for me and Allah's Messenger (ﷺ) and we would take water from it together (on taking a bath) .",
                "hadithUrdu": "میرے اور رسول اللہ صلی اللہ علیہ وسلم کے لیے یہ لگن رکھی جاتی تھی اور ہم دونوں اس سے ایک ساتھ نہاتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ‘ کہا ہم سے عبد الاعلیٰ نے بیان کیا ‘ کہا ہم سے ہشام بن حسان نے بیان کیا ‘ان سے ہشام بن عروہ نے بیان کیا ‘ ان سے ان کے والد نے کہ عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، أَنَّ هِشَامَ بْنَ عُرْوَةَ، حَدَّثَهُ عَنْ أَبِيهِ، أَنَّ عَائِشَةَ، قَالَتْ كَانَ يُوضَعُ لِي وَلِرَسُولِ اللَّهِ صلى الله عليه وسلم هَذَا الْمِرْكَنُ فَنَشْرَعُ فِيهِ جَمِيعًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7036,
                "hadithNumber": "7340, 7341",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) brought the Ansar and the Quraish people into alliance in my house at Medina, and he invoked Allah for one month against the tribe of Bani Sulaim in (the last rak`a of each compulsory) prayer.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے انصار اور قریش کے درمیان میرے اس گھر میں بھائی چارہ کرایا جو مدینہ منورہ میں ہے ۔ اور آپ نے قبائل بنی سلیم کے لیے ایک مہینہ تک دعائے قنوت پڑھی جس میں ان کے لیے بددعا کی ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے عباد بن عباد نے بیان کیا ‘ کہا ہم سے عاصم الاحوال نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ، حَدَّثَنَا عَاصِمٌ الأَحْوَلُ، عَنْ أَنَسٍ، قَالَ حَالَفَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ الأَنْصَارِ وَقُرَيْشٍ فِي دَارِي الَّتِي بِالْمَدِينَةِ‏.‏ وَقَنَتَ شَهْرًا يَدْعُو عَلَى أَحْيَاءٍ مِنْ بَنِي سُلَيْمٍ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7037,
                "hadithNumber": "7342",
                "englishNarrator": "Narrated Abu Burda رضی اللہ عنہ :",
                "hadithEnglish": "When I arrived at Medina, `Abdullah bin Salam رضی اللہ عنہ met me and said to me, \"Accompany me to my house so that I may make you drink from a bowl from which Allah's Messenger (ﷺ) used to drink, and that you may offer prayer in the mosque in which the Prophet (ﷺ) used to pray.\" I accompanied him, and he made me drink Sawiq and gave me dates to eat, and then I prayed in his mosque.",
                "hadithUrdu": "میں مدینہ منورہ آیا اور عبداللہ بن سلام رضی اللہ عنہ سے میری ملاقات ہوئی تو انہوں نے کہا کہ میرے ساتھ گھر چلو تو میں تمہیں اس پیالہ میں پلاؤں گا جس میں رسول اللہ صلی اللہ علیہ وسلم نے پیا تھا اور پھر ہم اس نماز پڑھنے کی جگہ نماز پڑھیں گے جہاں آنحضرت صلی اللہ علیہ وسلم نے نماز پڑھی تھی ۔ چنانچہ میں ان کے ساتھ گیا اور انہوں نے مجھے ستو پلا یا اور کھجور کھلائی اور میں نے ان کے نماز پڑھنے کی جگہ نماز پڑھی ۔",
                "urduNarrator": "ہم سے ابو کریب نے بیان کیا ’کہا ہم سے ابواسامہ نے بیان کیا ‘ کہا ہم سے برید نے بیان کیا ‘ابو بردہ رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنِي أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا بُرَيْدٌ، عَنْ أَبِي بُرْدَةَ، قَالَ قَدِمْتُ الْمَدِينَةَ فَلَقِيَنِي عَبْدُ اللَّهِ بْنُ سَلاَمٍ فَقَالَ لِي انْطَلِقْ إِلَى الْمَنْزِلِ فَأَسْقِيَكَ فِي قَدَحٍ شَرِبَ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم، وَتُصَلِّي فِي مَسْجِدٍ صَلَّى فِيهِ النَّبِيُّ صلى الله عليه وسلم‏.‏ فَانْطَلَقْتُ مَعَهُ، فَسَقَانِي سَوِيقًا، وَأَطْعَمَنِي تَمْرًا، وَصَلَّيْتُ فِي مَسْجِدِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7038,
                "hadithNumber": "7343",
                "englishNarrator": "Narrated `Umar رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said to me, \"Someone came to me tonight from my Lord while I was in the 'Aqiq (valley), and said to me, \"Offer prayer in this blessed valley and say: 'Labbaik' for the (performance of) `Umra and Hajj.\" Haroon bin Ismail states that Ali bin Mubarak has narrated to us the phrase: ''عُمْرَةٌ فِي حَجَّةٍ'' Umrah in Hajj.",
                "hadithUrdu": "مجھ سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میرے پاس رات ایک میرے رب کی طرف سے آنے والا آیا ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت وادی عقیق میں تھے اور کہا کہ اس مبارک وادی میں نماز پڑھئے اور کہئے کہ عمرہ اور حج ( کی نیت کرتا ہوں ) اور ہارون بن اسماعیل نے بیان کیا کہ ہم سے علی نے بیان کیا ( ان الفاظ کے ساتھ ) ” عمرۃ فی حجۃ “ ۔",
                "urduNarrator": "ہم سے سعید بن ربیع نے بیان کیا ‘ کہا ہم سے علی بن مبارک نے بیان کیا ‘ ان سے یحییٰ بن کثیر نے ‘ ان سے عکرمہ نے بیان کیا ‘ ان سے ابن عباس رضی اللہ عنہما نے اور ان سے عمر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنِي عِكْرِمَةُ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ عُمَرَ ـ رضى الله عنه ـ حَدَّثَهُ قَالَ حَدَّثَنِي النَّبِيُّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَتَانِي اللَّيْلَةَ آتٍ مِنْ رَبِّي وَهْوَ بِالْعَقِيقِ أَنْ صَلِّ فِي هَذَا الْوَادِي الْمُبَارَكِ وَقُلْ عُمْرَةٌ وَحَجَّةٌ ‏\"‏‏.‏ وَقَالَ هَارُونُ بْنُ إِسْمَاعِيلَ حَدَّثَنَا عَلِيٌّ عُمْرَةٌ فِي حَجَّةٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7039,
                "hadithNumber": "7344",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"The Prophet (ﷺ) fixed Qarn as the Miqat (for assuming the Ihram) for the people of Najd, and Al-Juhfa for the people of Sham, and Dhul-Hulaifa for the people of Medina.\" Ibn `Umar added, \"I heard this from the Prophet, and I have been informed that the Prophet (ﷺ) said, 'The Miqat for the Yemenites is Yalamlam.' \"When Iraq was mentioned, he said, \"At that time it was not a Muslim country.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اہل نجد کے لیے مقام قرن ‘ حجفہ کو اہل شام کے لیے اور ذوالحلیفہ کو اہل مدینہ کے لیے میقات مقرر کیا ۔ بیان کیا کہ میں نے یہ نبی کریم صلی اللہ علیہ وسلم سے سنا اور مجھے معلوم ہوا ہے کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اہل یمن کے لیے یلملم ( میقات ) ہے اور عراق کا ذکر ہوا تو انہوں نے کہا کہ آنحضرت صلی اللہ علیہ وسلم کے زمانے میں عراق نہیں تھا ۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا ‘ کہا ہم سے سفیان ثوری نے بیان کیا ‘ ان سے عبداللہ بن دینار نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، وَقَّتَ النَّبِيُّ صلى الله عليه وسلم قَرْنًا لأَهْلِ نَجْدٍ، وَالْجُحْفَةَ لأَهْلِ الشَّأْمِ، وَذَا الْحُلَيْفَةِ لأَهْلِ الْمَدِينَةِ‏.‏ قَالَ سَمِعْتُ هَذَا مِنَ النَّبِيِّ صلى الله عليه وسلم وَبَلَغَنِي أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ وَلأَهْلِ الْيَمَنِ يَلَمْلَمُ ‏\"‏‏.‏ وَذُكِرَ الْعِرَاقُ فَقَالَ لَمْ يَكُنْ عِرَاقٌ يَوْمَئِذٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7040,
                "hadithNumber": "7345",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) had a dream in the last portion of the night when he was sleeping at Dhul-Hulaifa. (I n the dream) it was said to him, \"You are in a blessed Batha' (i.e., valley).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کو جب کہ آپ مقام ذوالحلیفہ میں پڑاؤ کئے ہوئے تھے ‘ خواب دکھایا گیا اور کہا گیا کہ آپ ایک مبارک وادی میں ہیں ۔",
                "urduNarrator": "ہم سے عبدالرحمٰن بن مبارک نے بیان کیا ‘ کہا ہم سے فضیل نے بیان کیا ‘ انہوں نے کہا ہم سے موسیٰ بن عقبہ نے بیان کیا ‘ ان سے سالم بن عبداللہ نے ‘ ان سے ان کے والد عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ، حَدَّثَنَا الْفُضَيْلُ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ أُرِيَ وَهْوَ فِي مُعَرَّسِهِ بِذِي الْحُلَيْفَةِ فَقِيلَ لَهُ إِنَّكَ بِبَطْحَاءَ مُبَارَكَةٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7041,
                "hadithNumber": "7346",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "He heard the Prophet, after raising his head from the bowing in morning prayer, saying, \"O Allah, our Lord! All the praises are for you.\" And in the last (rak`a) he said, \"O Allah! Curse so-and-so and so--and-so.\" And then Allah revealed:-- 'Not for you (O Muhammad) is the decision, (but for Allah), whether He turns in mercy to them or punish them, for they are indeed wrongdoers.' (3.128)",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ‘ آپ صلی اللہ علیہ وسلم فجر کی نماز میں یہ دعا رکوع سے سر اٹھانے کے بعد پڑھتے تھے کہ ” اے اللہ ! ہمارے رب تیرے ہی لیے تمام تعریفیں ہیں ‘ پھر آپ صلی اللہ علیہ وسلم نے کہا ‘ اے اللہ ! فلاں اور فلاں کو اپنی رحمت سے دور کر دے “ اس پر اللہ عزوجل نے یہ آیت نازل کی کہ آپ کو اس معاملہ میں کوئی اختیار نہیں ہے یا اللہ ! ان کی توبہ قبول کر لے یا انہیں عذاب دے کہ بلاشبہ وہ حد سے تجاوز کرنے والے ہیں ۔",
                "urduNarrator": "ہم سے احمد بن محمد نے بیان کیا ‘ کہا ہم کو عبداللہ بن مبارک نے خبر دی ‘ کہا ہم کو معمر نے ‘ انہیں زہری نے ‘ انہیں سالم نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے ‘",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ فِي صَلاَةِ الْفَجْرِ رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ قَالَ ‏\"‏ اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ فِي الأَخِيرَةِ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ الْعَنْ فُلاَنًا وَفُلاَنًا ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏لَيْسَ لَكَ مِنَ الأَمْرِ شَىْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَالِمُونَ‏}‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {لَيْسَ لَكَ مِنَ الأَمْرِ شَيْءٌ}",
                "headingUrdu": "’’فیصلہ تمہارے لیے نہیں ہے…‘‘",
                "headingEnglish": "“Not for you is the decision…”",
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7042,
                "hadithNumber": "7347",
                "englishNarrator": "Narrated `Ali bin Abi Talib رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) came to him and Fatima the daughter of Allah's Messenger (ﷺ) at their house at night and said, \"Won't you pray?\" `Ali رضی اللہ عنہ replied, \"O Allah's Messenger (ﷺ)! Our souls are in the Hands of Allah and when he wants us to get up, He makes us get up.\" When `Ali رضی اللہ عنہ said that to him, Allah's Messenger (ﷺ) left without saying anything to him. While the Prophet (ﷺ) was leaving, `Ali heard him striking his thigh (with his hand) and saying, \"But man is quarrelsome more than anything else.\" (18.54) He (Imam Bukhari said) Who so comes to you at night is Tariq. Tariq is also a star. ''وَالثَّاقِبُ '' means: Luminous. It is said to the fire-maker ''أَثْقِبْ نَارَكَ'' i.e. make your fire.",
                "hadithUrdu": "ان کے اور فاطمہ بنت رسول اللہ علیم السلام والصلٰوۃ کے گھر ایک رات آنحضرت صلی اللہ علیہ وسلم تشریف لائے اور فرمایا کہ تم لوگ تہجد کی نماز نہیں پڑھتے ۔ علی رضی اللہ عنہ نے بیان کیا کہ میں نے عرض کیا ‘ یا رسول اللہ ! ہماری جانیں اللہ کے ہاتھ میں ہیں پس جب وہ ہمیں اٹھانا چاہے تو ہم کو اٹھا دے گا ۔ جوں ہی میں نے آنحضرت صلی اللہ علیہ وسلم سے یہ کہا تو آپ پیٹھ موڑ کر واپس جانے لگے اور کوئی جواب نہیں دیا لیکن واپس جاتے ہوئے آپ اپنی ران پر ہاتھ مار رہے تھے اور کہہ رہے تھے کہ ” اور انسان بڑا ہی جھگڑالو ہے “ اگر کوئی تمہارے پاس رات میں آئے تو ” طارق “ کہلائے گا اور قرآن میں جو ” والطارق “ کا لفظ آیا ہے اس سے مراد ستارہ ہے اور ” ثاقب “ بمعنی چمکتا ہوا ۔ عرب لوگ آگ جلانے والے سے کہتے ہیں ۔ اثقب نارک یعنی آگ روشن کر ۔ اس سے لفظ ثاقب ہے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ( دوسری سند ) امام بخاری نے کہا کہ اور مجھ سے محمد بن سلام بیکندی نے بیان کیا ‘ کہا ہم کو عتاب بن بشیر نے خبر دی ‘ انہیں اسحاق ابن ابی راشد نے ‘ انہیں زہری نے ‘ انہیں زین العابدین علی بن حسین رضی اللہ عنہ نے خبر دی اور انہیں ان کے والد حسین بن علی رضی اللہ عنہ نے خبر دی کہ علی بن ابی طالب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، ح حَدَّثَنِي مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا عَتَّابُ بْنُ بَشِيرٍ، عَنْ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ حُسَيْنَ بْنَ عَلِيٍّ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَرَقَهُ وَفَاطِمَةَ ـ عَلَيْهَا السَّلاَمُ ـ بِنْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُمْ ‏\"‏ أَلاَ تُصَلُّونَ ‏\"‏‏.‏ فَقَالَ عَلِيٌّ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا أَنْفُسُنَا بِيَدِ اللَّهِ، فَإِذَا شَاءَ أَنْ يَبْعَثَنَا بَعَثَنَا، فَانْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ قَالَ لَهُ ذَلِكَ وَلَمْ يَرْجِعْ إِلَيْهِ شَيْئًا، ثُمَّ سَمِعَهُ وَهْوَ مُدْبِرٌ يَضْرِبُ فَخِذَهُ وَهْوَ يَقُولُ ‏{‏وَكَانَ الإِنْسَانُ أَكْثَرَ شَىْءٍ جَدَلاً‏}‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ يُقَالُ مَا أَتَاكَ لَيْلاً فَهْوَ طَارِقٌ‏.‏ وَيُقَالُ الطَّارِقُ النَّجْمُ، وَالثَّاقِبُ الْمُضِيءُ، يُقَالُ أَثْقِبْ نَارَكَ لِلْمُوقِدِ‏.‏",
                "headingArabic": "قَوْلِهِ تَعَالَى: {وَكَانَ الإِنْسَانُ أَكْثَرَ شَيْءٍ جَدَلاً}",
                "headingUrdu": "’’لیکن انسان ہر چیز سے زیادہ جھگڑالو ہوتا ہے۔‘‘",
                "headingEnglish": "“…But, man is ever more quarrelsome than anything.”",
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7043,
                "hadithNumber": "7348",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "While we were in the mosque, Allah's Messenger (ﷺ) came out and said, \"Let us proceed to the Jews.\" So we went out with him till we came to Bait-al-Midras. The Prophet (ﷺ) stood up there and called them, saying, \"O assembly of Jews! Surrender to Allah (embrace Islam) and you will be safe!\" They said, \"You have conveyed Allah's message, O Aba-al-Qasim\" Allah's Messenger (ﷺ) then said to them, \"That is what I want; embrace Islam and you will be safe.\" They said, \"You have conveyed the message, O Aba-al- Qasim.\" Allah's Messenger (ﷺ) then said to them, \"That is what I want,\" and repeated his words for the third time and added, \"Know that the earth is for Allah and I want to exile you from this land, so whoever among you has property he should sell it, otherwise, know that the land is for Allah and His Apostle.\"",
                "hadithUrdu": "ہم مسجدنبوی میں تھے کہ رسول اللہ صلی اللہ علیہ وسلم باہر تشریف لائے اور فرمایا یہودیوں کے پاس چلو ۔ چنانچہ ہم آنحضرت صلی اللہ علیہ وسلم کے ساتھ روانہ ہوئے ۔ جب ہم ان کے مدرسہ تک پہنچے تو آنحضرت صلی اللہ علیہ وسلم نے کھڑے ہو کر انہیں آوازدی اور فرمایا اے یہودیو ! اسلام لاؤ تو تم سلامت رہو گے ۔ اس پر یہودیوں نے کہا کہ ابوالقاسم ! آپ صلی اللہ علیہ وسلم نے اللہ کا حکم پہنچا دیا ۔ راوی نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے دوبارہ ان سے فرمایا کہ یہی میرا مقصد ہے ‘ اسلام لاؤ تو تم سلامت رہو گے ۔ انہوں نے کہا ابوالقاسم ! آپ نے پیغام خدا پہنچا دیا ۔ پھر آپ نے یہی بات تیسری بار کہی اور فرمایا ‘ جان لو کہ ساری زمین اللہ اور اس کے رسول کی ہے اور میں چاہتا ہوں کہ تمہیں اس جگہ سے باہر کر دوں ۔ پس تم میں سے جو کوئی اپنی جائیداد کے بدلے میں کوئی قیمت پاتا ہو تو اسے بیچ لے ورنہ جان لو کہ زمین اللہ اور اس کے رسول کی ہے ۔ ( تم کو یہ شہر چھوڑ نا ہو گا ) ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ ان سے لیث بن سعد نے بیان کیا ‘ ان سے سعید مقبری نے ‘ ان سے ان کے والد ابوسعید کیسان نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ بَيْنَا نَحْنُ فِي الْمَسْجِدِ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ انْطَلِقُوا إِلَى يَهُودَ ‏\"‏‏.‏ فَخَرَجْنَا مَعَهُ حَتَّى جِئْنَا بَيْتَ الْمِدْرَاسِ فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَنَادَاهُمْ فَقَالَ ‏\"‏ يَا مَعْشَرَ يَهُودَ أَسْلِمُوا تَسْلَمُوا ‏\"‏‏.‏ فَقَالُوا بَلَّغْتَ يَا أَبَا الْقَاسِمِ‏.‏ قَالَ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ذَلِكَ أُرِيدُ أَسْلِمُوا تَسْلَمُوا ‏\"‏‏.‏ فَقَالُوا قَدْ بَلَّغْتَ يَا أَبَا الْقَاسِمِ‏.‏ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ذَلِكَ أُرِيدُ ‏\"‏‏.‏ ثُمَّ قَالَهَا الثَّالِثَةَ فَقَالَ ‏\"‏ اعْلَمُوا أَنَّمَا الأَرْضُ لِلَّهِ وَرَسُولِهِ وَإِنِّي أُرِيدُ أَنْ أُجْلِيَكُمْ مِنْ هَذِهِ الأَرْضِ، فَمَنْ وَجَدَ مِنْكُمْ بِمَالِهِ شَيْئًا فَلْيَبِعْهُ، وَإِلاَّ فَاعْلَمُوا أَنَّمَا الأَرْضُ لِلَّهِ وَرَسُولِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7044,
                "hadithNumber": "7349",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Noah will be brought (before Allah) on the Day of Resurrection, and will be asked, 'Did you convey the message of Allah?\" He will reply, 'Yes, O Lord.' And then Noah's nation will be asked, 'Did he (Noah) convey Allah's message to you?' They will reply, 'No warner came to us.' Then Noah will be asked, 'Who are your witnesses?' He will reply. '(My witnesses are) Muhammad and his followers.' Thereupon you (Muslims) will be brought and you will bear witness.\" Then the Prophet (ﷺ) recited: 'And thus We have made of you (Muslims) a just and the best nation, that you might be witness over the nations, and the Apostle a witness over you.' (2.143). Hadrat Abu Saeed رضی اللہ عنہ  has reported similarly from the prophet ﷺ.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا قیامت کے دن نوح علیہ السلام کو لایا جائے گا اور ان سے پوچھا جائے گا ‘ کیا تم نے اللہ کا پیغام پہنچا دیا تھا ؟ وہ عرض کریں گے کہ ہاں اے رب ! پھر ان کی امت سے پوچھا جائے گا کہ کیا انہوں نے تمہیں اللہ کا پیغام پہنچا دیا تھا ؟ وہ کہیں گے کہ ہمارے پاس کوئی ڈرانے والا نہیں آیا ۔ اللہ تعالیٰ حضرت نوح علیہ السلام سے پوچھے گا ‘ تمہارے گواہ کون ہیں ؟ نوح علیہ السلام عرض کریں گے کہ محمد صلی اللہ علیہ وسلم اور ان کی امت پھر تمہیں لایا جائے گا اور تم لوگ ان کے حق میں شہادت دو گے ‘ پھر رسول اللہ صلی اللہ علیہ وسلم نے یہ آیت پڑھی ” اور اسی طرح ہم نے تمہیں درمیانی امت بنایا “ کہا کہ وسط بمعنی عدل ( میانہ رو ) ہے ‘ تاکہ تم لوگوں کے لیے گواہ بنو اور رسول تم پر گواہ بنے ۔ اسحاق بن منصور سے جعفر بن عون نے روایت کیا ‘ کہا ہم سے اعمش نے بیان کیا ‘ ان سے ابوصالح نے ‘ ان سے ابو سعید خدری رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے یہی حدیث بیان فرمائی ۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ کہا ہم سے اعمش نے بیان کیا ‘ کہا ہم سے ابوصالح ( ذکوان ) نے بیان کیا ‘ ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُجَاءُ بِنُوحٍ يَوْمَ الْقِيَامَةِ فَيُقَالُ لَهُ هَلْ بَلَّغْتَ فَيَقُولُ نَعَمْ يَا رَبِّ‏.‏ فَتُسْأَلُ أُمَّتُهُ هَلْ بَلَّغَكُمْ فَيَقُولُونَ مَا جَاءَنَا مِنْ نَذِيرٍ‏.‏ فَيَقُولُ مَنْ شُهُودُكَ فَيَقُولُ مُحَمَّدٌ وَأُمَّتُهُ‏.‏ فَيُجَاءُ بِكُمْ فَتَشْهَدُونَ ‏\"‏‏.‏ ثُمَّ قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏{‏وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا‏}‏ قَالَ عَدْلاً ‏{‏لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا‏}‏ وَعَنْ جَعْفَرِ بْنِ عَوْنٍ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا‏.‏",
                "headingArabic": "قَوْلِهِ تَعَالَى: {وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا}",
                "headingUrdu": "’’اس طرح ہم نے تم کو ایک عادل امت بنایا ہے‘‘۔",
                "headingEnglish": "“Thus We have made you a just nation…”",
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7045,
                "hadithNumber": "7350, 7351",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri and Abu Huraira رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent the brother of the tribe of Bani Adi Al-Ansari as governor of Khaibar. Then the man returned, bringing Janib (a good kind of date). Allah's Messenger (ﷺ) asked him, \"Are all the dates of Khaibar like that?\" He replied, \"No, by Allah, O Allah's Messenger (ﷺ)! We take one Sa' of these (good) dates for two Sas of mixed dates.\" Allah's Messenger (ﷺ) then said, \"Do not do so. You should either take one Sa of this (kind) for one Sa' of the other; or sell one kind and then buy with its price the other kind (of dates), and you should do the same in weighing.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بنی عدی الانصاری کے ایک صاحب سودابن عزیہ کو خیبر کا عامل بنا کر بھیجا تو وہ عمدہ قسم کی کھجور وصول کر کے لائے ۔ آنحضور صلی اللہ علیہ وسلم نے پوچھا کیا خیبر کی تمام کھجوریں ایسی ہی ہیں ؟ انہوں نے کہا کہ نہیں یا رسول اللہ ! اللہ کی قسم ! ہم ایسی ایک صاع کھجور دو صاع ( خراب ) کھجور کے بدلے خرید لیتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ایسا نہ کیاکرو بلکہ ( جنس کو جنس کے بدلے ) برابر برابر میں خریدو ‘ یا یوں کروں کہ ردی کھجور نقدی بیچ ڈالو پھر یہ کھجور اس کے بدلے خرید لو ‘ اسی طرح ہر چیز کو جو تول کر بکتی ہے اس کا حکم ان ہی چیزوں کا ہے جو ناپ کر بکتی ہیں ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ ان سے ان کے بھائی ابوبکرنے بیان کیا ‘ ان سے سلیمان بن بلال نے بیان کیا ‘ ان سے عبد المجید بن سہیل بن عبدالرحمٰن بن عوف نے بیان کیا ‘ انہوں نے سعید بن مسیب سے سنا ‘ وہ ابو سعید خدری اور ابوہریرہ رضی اللہ عنہما سے بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَخِيهِ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يُحَدِّثُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، وَأَبَا، هُرَيْرَةَ حَدَّثَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ أَخَا بَنِي عَدِيٍّ الأَنْصَارِيَّ وَاسْتَعْمَلَهُ عَلَى خَيْبَرَ، فَقَدِمَ بِتَمْرٍ جَنِيبٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا ‏\"‏‏.‏ قَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ إِنَّا لَنَشْتَرِي الصَّاعَ بِالصَّاعَيْنِ مِنَ الْجَمْعِ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَفْعَلُوا، وَلَكِنْ مِثْلاً بِمِثْلٍ، أَوْ بِيعُوا هَذَا وَاشْتَرُوا بِثَمَنِهِ مِنْ هَذَا وَكَذَلِكَ الْمِيزَانُ ‏\"‏‏.",
                "headingArabic": "إِذَا اجْتَهَدَ الْعَامِلُ أَوِ الْحَاكِمُ فَأَخْطَأَ خِلاَفَ الرَّسُولِ مِنْ غَيْرِ عِلْمٍ، فَحُكْمُهُ مَرْدُودٌ",
                "headingUrdu": "رائے کی بنیاد پر فیصلہ غلط ثابت ہوا تو فیصلہ مسترد کر دیا جائے گا۔",
                "headingEnglish": "A verdict based on opinion proves to be wrong then the verdict will be rejected",
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7046,
                "hadithNumber": "7352",
                "englishNarrator": "Narrated `Amr bin Al-`As رضی اللہ عنہ :",
                "hadithEnglish": "He heard Allah's Messenger (ﷺ) saying, \"If a judge gives a verdict according to the best of his knowledge and his verdict is correct (i.e. agrees with Allah and His Apostle's verdict) he will receive a double reward, and if he gives a verdict according to the best of his knowledge and his verdict is wrong, (i.e. against that of Allah and His Apostle) even then he will get a reward .\" Then I (Yazeed bin Abdullah) narrated this Hadith to Abu Bakr bin Hazim, so he said: Abu Salamah has reported it from Hadrat Abu Hurairah رضی اللہ عنہ likewise. Hadrat Abu Salamah رضی اللہ عنہ has reported from the prophet ﷺ like it.",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم نے سنا ‘ آپ نے فرمایا کہ جب حاکم کوئی فیصلہ اپنے اجتہاد سے کرے اور فیصلہ صحیح ہو تو اسے دہرا ثواب ملتا ہے اور جب کسی فیصلہ میں اجتہاد کرے اور غلطی کر جائے تو اسے اکہرا ثواب ملتا ہے ( اجتہاد کا ) بیان کیا کہ پھر میں نے یہ حدیث ابوبکر بن عمر وبن حزم سے بیان کی تو انہوں نے بیان کیا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے اسی طرح بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا ۔ اور عبد العزیز بن المطلب نے بیان کیا ‘ ان سے عبداللہ بن ابی ابکرنے بیان کیا ‘ ان سے ابوسلمہ رضی اللہ عنہ نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم نے اسی طرح بیان فرمایا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یزید مقری مکی نے بیان کیا ‘ انہوں نے کہا ہم سے حیوہ بن شریح نے بیان کیا ‘ انہوں نے مجھ سے یزید بن عبداللہ بن الہاد نے بیان کیا ‘ ان سے محمد بن ابراہیم بن الحارث نے ‘ ان سے بسر بن سعید نے ‘ ان سے عمرو بن العاص کے مولیٰ ابو قیس نے ‘ ان سے عمر بن العاص رضی اللہ عنہ نے",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنَا حَيْوَةُ، حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي قَيْسٍ، مَوْلَى عَمْرِو بْنِ الْعَاصِ عَنْ عَمْرِو بْنِ الْعَاصِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ ثُمَّ أَصَابَ فَلَهُ أَجْرَانِ، وَإِذَا حَكَمَ فَاجْتَهَدَ ثُمَّ أَخْطَأَ فَلَهُ أَجْرٌ ‏\"‏‏.‏ قَالَ فَحَدَّثْتُ بِهَذَا الْحَدِيثِ أَبَا بَكْرِ بْنَ عَمْرِو بْنِ حَزْمٍ فَقَالَ هَكَذَا حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ‏.‏ وَقَالَ عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِي سَلَمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ‏.‏",
                "headingArabic": "أَجْرِ الْحَاكِمِ إِذَا اجْتَهَدَ فَأَصَابَ أَوْ أَخْطَأَ",
                "headingUrdu": "بہترین علم کے مطابق فیصلہ دینے کا ثواب",
                "headingEnglish": "The reward for giving a verdict according to the best of knowledge",
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7047,
                "hadithNumber": "7353",
                "englishNarrator": "Narrated 'Ubaid bin `Umar:",
                "hadithEnglish": "Abu Musa رضی اللہ عنہ asked permission to enter upon `Umar رضی اللہ عنہ , but seeing that he was busy, he went away. `Umar رضی اللہ عنہ then said, \"Didn't I hear the voice of `Abdullah bin Qais? Allow him to come in.\" He was called in and `Umar رضی اللہ عنہ said to him, \"What made you do what you did.\" He replied, \"We have been instructed thus by the Prophet\" `Umar رضی اللہ عنہ said, \"Bring proof (witness) for this, other wise I will do so-and-so to you.\" Then `Abdullah bin Qais went to a gathering of the Ansar who then said, \"None but the youngest of us will give the witness for it.\" So Abu Sa`id Al-Khudri  رضی اللہ عنہ got up and said, \"We used to be instructed thus (by the Prophet).\" `Umar رضی اللہ عنہ said, \"This tradition of the Prophet (ﷺ) remained hidden from me. Business in the market kept me busy.\"",
                "hadithUrdu": "ابوموسیٰ اشعری رضی اللہ عنہ نے عمر رضی اللہ عنہ سے ( ملنے کی ) اجازت چاہی اور یہ دیکھ کر کہ حضرت عمر رضی اللہ عنہ مشغول ہیں آپ جلدی سے واپس چلے گئے ۔ پھر عمر رضی اللہ عنہ نے کہا کہ کیا میں ابھی عبداللہ بن قیس ( ابوموسیٰ رضی اللہ عنہ ) کی آواز نہیں سنی تھی ؟ انہیں بلا لو ۔ چنانچہ انہیں بلا یاگیا تو عمر رضی اللہ عنہ نے پوچھا کہ ایسا کیوں کیا ؟ ( جلدی واپس ہو گئے ) انہوں نے کہا کہ ہمیں حدیث میں اس کا حکم دیا گیا ہے ۔ حضرت عمر رضی اللہ عنہ نے کہا کہ اس حدیث پر کوئی گواہ لاؤ ‘ ورنہ میں تمہارے ساتھ یہ ( سختی ) کروں گا ۔ چنانچہ حضرت ابوموسیٰ رضی اللہ عنہ نے انصار کی ایک مجلس میں گئے انہوں نے کہا کہ اس کی گواہی ہم میں سب سے چھوٹا دے سکتا ہے ۔ چنانچہ ابو سیعد خدری رضی اللہ عنہ کھڑے ہوئے اور کہا کہ ہمیں دربار نبوی سے اس کا حکم دیا جاتا تھا ۔ اس پر عمر رضی اللہ عنہ نے کہا کہ آنحضرت صلی اللہ علیہ وسلم کا یہ حکم مجھے معلوم نہیں تھا ‘ مجھے بازار کے کاموں خریدوفروخت نے اس حدیث سے غافل رکھا ۔",
                "urduNarrator": "ہم سے مسدد بن مسر ہد نے بیان کیا ‘ کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ‘ ان سے ابن جریج نے ‘ ان سے عطاء بن ابی رباح نے ‘ ان سے عبید بن عمیر نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنِي عَطَاءٌ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، قَالَ اسْتَأْذَنَ أَبُو مُوسَى عَلَى عُمَرَ فَكَأَنَّهُ وَجَدَهُ مَشْغُولاً فَرَجَعَ، فَقَالَ عُمَرُ أَلَمْ أَسْمَعْ صَوْتَ عَبْدِ اللَّهِ بْنِ قَيْسٍ، ائْذَنُوا لَهُ‏.‏ فَدُعِيَ لَهُ فَقَالَ مَا حَمَلَكَ عَلَى مَا صَنَعْتَ فَقَالَ إِنَّا كُنَّا نُؤْمَرُ بِهَذَا‏.‏ قَالَ فَأْتِنِي عَلَى هَذَا بِبَيِّنَةٍ أَوْ لأَفْعَلَنَّ بِكَ‏.‏ فَانْطَلَقَ إِلَى مَجْلِسٍ مِنَ الأَنْصَارِ فَقَالُوا لاَ يَشْهَدُ إِلاَّ أَصَاغِرُنَا‏.‏ فَقَامَ أَبُو سَعِيدٍ الْخُدْرِيُّ فَقَالَ قَدْ كُنَّا نُؤْمَرُ بِهَذَا‏.‏ فَقَالَ عُمَرُ خَفِيَ عَلَىَّ هَذَا مِنْ أَمْرِ النَّبِيِّ صلى الله عليه وسلم، أَلْهَانِي الصَّفْقُ بِالأَسْوَاقِ‏.‏",
                "headingArabic": "الْحُجَّةِ عَلَى مَنْ قَالَ إِنَّ أَحْكَامَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَتْ ظَاهِرَةً",
                "headingUrdu": "بعض صحابہ نے بعض اعمال کا مشاہدہ نہیں کیا یا رسول اللہ صلی اللہ علیہ وسلم کے بعض ارشادات کو سنا۔",
                "headingEnglish": "Some Companions did not witness certain deeds or did hear certain saying of the Prophet (saws)",
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7048,
                "hadithNumber": "7354",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "\"You people claim that Abu Huraira رضی اللہ عنہ narrates many narrations of Allah's Messenger (ﷺ). (Anyhow) with Allah will be our appointment. I was a poor man, and used to stick to Allah's Messenger (ﷺ) contented with what will fill my stomach, and the Muhajirin (emigrants) used to be busy trading in the markets, and the Ansar used to be busy looking after their properties. One-day I heard Allah's Messenger (ﷺ) saying, 'Who will spread his Rida' (a garment covering the upper part of the body) till I finished my speech and then fold it, (i.e. wrap it over your body), in which case he will never forget anything he had heard from me.\" So I spread my garment which I was wearing; and by Him Who sent Muhammad with the Truth, ever since, I have never forgotten whatever I heard from him (the Prophet)\" (See, Hadith No. 119, Vol. 1)",
                "hadithUrdu": "تم سمجھتے ہو کہ ابوہریرہ رسول اللہ صلی اللہ علیہ وسلم کی بات زیادہ حدیث بیان کرتے ہیں ‘اللہ کے حضور میں سب کو جانا ہے ۔ بات یہ تھی کہ میں ایک مسکین شخص تھا اور پیٹ بھرنے کے بعد ہر وقت آنحضرت صلی اللہ علیہ وسلم کے ساتھ رہتا تھا لیکن مہاجر ین کو بازار کے کارو بار مشغول رکھتے تھے اور انصار کو اپنے مالوں کی دیکھ بھال مصروف رکھتی تھی ۔ میں ایک دن آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا اور آپ نے فرمایا کہ کون اپنی چادر پھیلائے گا ‘ یہاں تک کہ میں اپنی بات پوری کر لوں اور پھر وہ اپنی چادر سمیٹ لے اور اس کے بعد کبھی مجھ سے سنی ہوئی کوئی بات نہ بھولے ۔ چنانچہ میں نے اپنی چادر جو میرے جسم پر تھی ‘ پھیلادی اور اس ذات کی قسم جس نے آنحضرت صلی اللہ علیہ وسلم کو حق کے ساتھ بھیجا تھا پھر کبھی میں آپ کی کوئی حدیث جو آپ سے سنی تھی ‘ نہیں بھولا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے کہا ‘ مجھ سے زہری نے ‘ انہوں نے اعرج سے سنا ‘ انہوں نے بیان کیا کہ مجھے ابوہریرہ رضی اللہ عنہ نے خبر دی ‘ انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي الزُّهْرِيُّ، أَنَّهُ سَمِعَهُ مِنَ الأَعْرَجِ، يَقُولُ أَخْبَرَنِي أَبُو هُرَيْرَةَ، قَالَ إِنَّكُمْ تَزْعُمُونَ أَنَّ أَبَا هُرَيْرَةَ، يُكْثِرُ الْحَدِيثَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَاللَّهُ الْمَوْعِدُ، إِنِّي كُنْتُ امْرَأً مِسْكِينًا أَلْزَمُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى مِلْءِ بَطْنِي، وَكَانَ الْمُهَاجِرُونَ يَشْغَلُهُمُ الصَّفْقُ بِالأَسْوَاقِ، وَكَانَتِ الأَنْصَارُ يَشْغَلُهُمُ الْقِيَامُ عَلَى أَمْوَالِهِمْ، فَشَهِدْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ وَقَالَ ‏ \"‏ مَنْ يَبْسُطْ رِدَاءَهُ حَتَّى أَقْضِيَ مَقَالَتِي ثُمَّ يَقْبِضْهُ، فَلَنْ يَنْسَى شَيْئًا سَمِعَهُ مِنِّي ‏\"‏‏.‏ فَبَسَطْتُ بُرْدَةً كَانَتْ عَلَىَّ، فَوَالَّذِي بَعَثَهُ بِالْحَقِّ مَا نَسِيتُ شَيْئًا سَمِعْتُهُ مِنْهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7049,
                "hadithNumber": "7355",
                "englishNarrator": "Narrated Muhammad bin Al-Munkadir:",
                "hadithEnglish": "I saw Jabir bin `Abdullah رضی اللہ عنہ swearing by Allah that Ibn Sayyad was the Dajjal. I said to Jabir, \"How can you swear by Allah?\" Jabir said, \"I have heard `Umar رضی اللہ عنہ swearing by Allah regarding this matter in the presence of the Prophet (ﷺ) and the Prophet (ﷺ) did not disapprove of it.\"",
                "hadithUrdu": "میں نے جابر بن عبداللہ رضی اللہ عنہ کو دیکھا کہ وہ ابن الصیاد کے واقعہ پر اللہ کی قسم کھا تے تھے ۔ میں نے ان سے کہا کہ آپ اللہ کی قسم کھا تے ہیں ؟ انہوں نے کہا کہ میں نے عمر رضی اللہ عنہ کو نبی کریم صلی اللہ علیہ وسلم کے سامنے اللہ کی قسم کھا تے دیکھا اور آنحضرت صلی اللہ علیہ وسلم نے اس پر کوئی انکار نہیں فرمایا ۔",
                "urduNarrator": "ہم سے حماد بن حمید نے بیان کیا ‘ کہا ہم سے عبیداللہ بن معاذ نے ‘ کہا ہم سے ہمارے والد حضرت معاذ بن حسان نے بیان کیا ‘ ان سے شعبہ بن حجاج نے بیان کیا ‘ ان سے سعد بن ابراہیم نے ‘ ان سے محمد بن المنکدر نے بیان کیا ‘",
                "hadithArabic": "حَدَّثَنَا حَمَّادُ بْنُ حُمَيْدٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ رَأَيْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَحْلِفُ بِاللَّهِ أَنَّ ابْنَ الصَّائِدِ الدَّجَّالُ، قُلْتُ تَحْلِفُ بِاللَّهِ‏.‏ قَالَ إِنِّي سَمِعْتُ عُمَرَ يَحْلِفُ عَلَى ذَلِكَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَلَمْ يُنْكِرْهُ النَّبِيُّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "مَنْ رَأَى تَرْكَ النَّكِيرِ مِنَ النَّبِيِّ صلى الله عليه وسلم حُجَّةً لاَ مِنْ غَيْرِ الرَّسُولِ",
                "headingUrdu": "اگر رسول اللہ صلی اللہ علیہ وسلم کسی چیز کو ناپسند نہ کرتے",
                "headingEnglish": "If the Prophet (saws) did not disapprove of something",
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7050,
                "hadithNumber": "7356",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Horses may be used for three purposes: For a man they may be a source of reward (in the Hereafter); for another, a means of protection; and for another, a source of sin. The man for whom they are a source of reward, is the one who keeps them for Allah's Cause and ties them with long ropes and lets them graze in a pasture or garden. Whatever those long ropes allow them to eat of that pasture or garden, will be written as good deeds for him and if they break their ropes and run one or two rounds, then all their footsteps and dung will be written as good deeds for him, and if they pass a river and drink from it though he has had no intention of watering them, even then, that will be written as good deeds for him. So such horses are a source of reward for that man. For the man who keeps horses for his livelihood in order not to ask others for help or beg his bread, and at the same time he does not forget Allah's right of what he earns through them and of their backs (that he presents it to be used in Allah's Cause), such horses are a shelter for him (from poverty). For the man who keeps them just out of pride and for showing off, they are a source of sin.\" Then Allah's Messenger (ﷺ) was asked about donkeys. He said, \"Allah has not revealed anything to me regarding them except this comprehensive Verse: \"Then anyone who has done good, equal to the weight of an atom (or a small ant) shall see it, and any one who has done evil, equal to the weight of an atom (or a small ant) shall see it.\" (99.7-8)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا گھوڑے تین طرح کے لوگوں کے لیے ہیں ۔ ایک شخص کے لیے ان کا ر کھنا کا ر ثواب ہے ‘ دوسرے کے لیے برابر برابر نہ عذاب نہ ثواب اور تیسرے کے لیے وبال جان ہیں ۔ جس کے لیے وہ اجبر ہیں یہ وہ شخص ہے جس نے اسے اللہ کے راستے کے لیے باندھ کر رکھا اور اس کی رسی چراہ گاہ میں دراز کر دی تو وہ گھوڑا جتنی دور تک چراہ گاہ میں گھوم کر چرے گا وہ مالک کی نیکیوں میں ترقی کا ذریعہ ہو گا اور اگر گھوڑے نے اس دراز رسی کو بھی تڑوا لیا اور ایک یا دو دوڑ اس نے لگائی تو اس کے نشانات قدم اور اس کی لید بھی مالک کے لیے باعث اجر و ثواب ہو گی اور اگر گھوڑا کسی نہر سے گزر ا اور اس نے نہر کا پانی پی لیا ‘ مالک نے اسے پلانے کا کوئی ارادہ نہیں کیا تھا تب بھی مالک کے لیے یہ اجر کا باعث ہو گا اور ایسا گھوڑا اپنے مالک کے لیے ثواب ہوتا ہے اوردوسرا شخص برابر برابر والا ہوتا ہے جو گھوڑے کو اظہار بے نیازی یا اپنے بچاؤ کی غرض سے باندھتا ہے اور اس کی پشت اور گردن پر اللہ کے حق کو بھی نہیں بھولتا تو یہ گھوڑا اس کے لیے نہ عذاب ہے نہ ثواب اور تیسرا وہ شخص ہے جو گھوڑے کو فخر اور ریا کے لیے باندھتا ہے تو یہ اس کے لیے وبال جان ہے اور رسول اللہ صلی اللہ علیہ وسلم سے گدھوں کے متعلق پوچھا گیا تو آپ نے فرمایا کہ اللہ تعالیٰ نے اس سلسلہ میں مجھ پر اس جامع اور نادر آیت کے سوا اور کچھ نہیں نازل فرمایا ہے ۔ ” پس جو کوئی ایک ذرہ برابر بھی بھلائی کرے گا وہ اسے دیکھے گا اور جو کوئی ایک ذرہ برابر بھی برائی کرے گا وہ اسے دیکھے گا “ ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا مجھ سے امام مالک نے بیان کیا ‘ ان سے زید بن اسلم نے ‘ ان سے ابی صالح السمان نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْخَيْلُ لِثَلاَثَةٍ لِرَجُلٍ أَجْرٌ، وَلِرَجُلٍ سِتْرٌ، وَعَلَى رَجُلٍ وِزْرٌ، فَأَمَّا الَّذِي لَهُ أَجْرٌ فَرَجُلٌ رَبَطَهَا فِي سَبِيلِ اللَّهِ فَأَطَالَ فِي مَرْجٍ أَوْ رَوْضَةٍ، فَمَا أَصَابَتْ فِي طِيَلِهَا ذَلِكَ الْمَرْجِ وَالرَّوْضَةِ كَانَ لَهُ حَسَنَاتٍ، وَلَوْ أَنَّهَا قَطَعَتْ طِيَلَهَا فَاسْتَنَّتْ شَرَفًا أَوْ شَرَفَيْنِ كَانَتْ آثَارُهَا وَأَرْوَاثُهَا حَسَنَاتٍ لَهُ، وَلَوْ أَنَّهَا مَرَّتْ بِنَهَرٍ فَشَرِبَتْ مِنْهُ وَلَمْ يُرِدْ أَنْ يَسْقِيَ بِهِ كَانَ ذَلِكَ حَسَنَاتٍ لَهُ، وَهِيَ لِذَلِكَ الرَّجُلِ أَجْرٌ، وَرَجُلٌ رَبَطَهَا تَغَنِّيًا وَتَعَفُّفًا وَلَمْ يَنْسَ حَقَّ اللَّهِ فِي رِقَابِهَا وَلاَ ظُهُورِهَا، فَهْىَ لَهُ سِتْرٌ، وَرَجُلٌ رَبَطَهَا فَخْرًا وَرِيَاءً، فَهِيَ عَلَى ذَلِكَ وِزْرٌ ‏\"‏‏.‏ وَسُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحُمُرِ قَالَ ‏\"‏ مَا أَنْزَلَ اللَّهُ عَلَىَّ فِيهَا إِلاَّ هَذِهِ الآيَةَ الْفَاذَّةَ الْجَامِعَةَ ‏{‏فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ * وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ‏}‏‏\"‏",
                "headingArabic": "الأَحْكَامِ الَّتِي تُعْرَفُ بِالدَّلاَئِلِ، وَكَيْفَ مَعْنَى الدِّلاَلَةِ وَتَفْسِيرِهَا",
                "headingUrdu": "بعض شواہد سے اخذ کردہ قوانین؛ اور ثبوت کے معنی",
                "headingEnglish": "The laws inferred from certain evidences; and the meaning of an evidence",
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7051,
                "hadithNumber": "7357",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "A woman asked the Prophet ﷺ. Hadrat Mansur bin Abdur Rehaman bin Shibah has reported from Hadrat `Aisha رضی اللہ عنہا : A woman asked the Prophet (ﷺ) about the periods: How to take a bath after the periods. He said, \"Take a perfumed piece of cloth and clean yourself with it.\" She said,' \"How shall I clean myself with it, O Allah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \"Clean yourself\" She said again, \"How shall I clean myself, O Allah's Messenger (ﷺ)?\" The Prophet (ﷺ) said, \"Clean yourself with it.\" Then I knew what Allah's Messenger (ﷺ) meant. So I pulled her aside and explained it to her.",
                "hadithUrdu": "ایک خاتون نے رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا ( دوسری سند ) امام بخاری نے کہا اور ہم سے محمد نے بیان کیا یعنی ابن عقبہ نے ‘ کہا ہم سے فضیل بن سلیمان النمیری نے بیان کیا ‘ کہا ہم سے منصور بن عبدالرحمٰن بن شیبہ نے بیان کیا ‘ ان سے ان کی والدہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ ایک عورت نے رسول کریم صلی اللہ علیہ وسلم سے حیض کے متعلق پوچھا کہ اس سے غسل کس طرح کیا جائے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مشک لگا ہوا ایک کپڑا لے کر اس سے پاکی حاصل کر ۔ اس عورت نے پوچھا ‘ یا رسول اللہ ! میں اس سے پاکی کس طرح حاصل کروں گی ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس سے پاکی حاصل کرو ۔ انہوں نے پھر پوچھا کہ کس طرح پاکی حاصل کروں ؟ آنحضرت صلی اللہ علیہ وسلم نے پھر وہی جواب دیا کہ پاکی حاصل کرو ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ میں آنحضرت صلی اللہ علیہ وسلم کا منشا سمجھ گئی اور اس عورت کو میں نے اپنی طرف کھینچ لیا اور انہیں طریقہ بتایا کہ پاکی سے آپ کا مطلب یہ ہے کہ اس کپڑے کو خون کے مقاموں پر پھیرتاکہ خون کی بدبو رفع ہو جائے ۔",
                "urduNarrator": "ہم سے یحییٰ بن جعفر بیکندی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے منصور بن صفیہ نے ‘ ان سے کی والدہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ مَنْصُورِ بْنِ صَفِيَّةَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، أَنَّ امْرَأَةً، سَأَلَتِ النَّبِيَّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا مُحَمَّدٌ ـ هُوَ ابْنُ عُقْبَةَ ـ حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ النُّمَيْرِيُّ الْبَصْرِيُّ حَدَّثَنَا مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ ابْنُ شَيْبَةَ حَدَّثَتْنِي أُمِّي عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ امْرَأَةً سَأَلَتِ النَّبِيَّ صلى الله عليه وسلم عَنِ الْحَيْضِ كَيْفَ تَغْتَسِلُ مِنْهُ قَالَ ‏\"‏ تَأْخُذِينَ فِرْصَةً مُمَسَّكَةً فَتَوَضَّئِينَ بِهَا ‏\"‏‏.‏ قَالَتْ كَيْفَ أَتَوَضَّأُ بِهَا يَا رَسُولَ اللَّهِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَوَضَّئِي ‏\"‏‏.‏ قَالَتْ كَيْفَ أَتَوَضَّأُ بِهَا يَا رَسُولَ اللَّهِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَوَضَّئِينَ بِهَا ‏\"‏‏.‏ قَالَتْ عَائِشَةُ فَعَرَفْتُ الَّذِي يُرِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَذَبْتُهَا إِلَىَّ فَعَلَّمْتُهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7052,
                "hadithNumber": "7358",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Um Hufaid bint Al-Harith bin Hazn presented the Prophet (ﷺ) with some butter, dried yoghurt (curd milk) and mastigures as a gift. The Prophet (ﷺ) then asked for a meal (mastigures etc. to be put) and it was eaten over his table cloth, but the Prophet (ﷺ) did not eat of it, as he had aversion to it. But if it had been illegal to eat, it would not have been eaten over his table cloth nor would he have ordered that (mastigures meat) to be eaten.",
                "hadithUrdu": "ام حفید بنت حارث بن حزن نے رسول اللہ صلی اللہ علیہ وسلم کو گھی اور پنیر اور بھنا ہوا سانڈا ہدیہ میں بھیجاآنحضرت صلی اللہ علیہ وسلم نے یہ چیزیں قبول فرما لیں اور آپ کے دسترخوان پر انہیں کھایا گیا لیکن آنحضرت صلی اللہ علیہ وسلم نے اس ( سانڈے کو ) ہاتھ نہیں لگا یا ‘ جیسے آپ کو پسند نہ ہو اور اگر وہ حرام ہوتا تو آپ کے دسترخوان پر نہ کھایا جاتا اور نہ آپ کھانے کے لیے کہتے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابو عوانہ نے بیان کیا ‘ ان سے ابو بشر نے ‘ ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ أُمَّ حُفَيْدٍ بِنْتَ الْحَارِثِ بْنِ حَزْنٍ، أَهْدَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم سَمْنًا وَأَقِطًا وَأَضُبًّا، فَدَعَا بِهِنَّ النَّبِيُّ صلى الله عليه وسلم فَأُكِلْنَ عَلَى مَائِدَتِهِ، فَتَرَكَهُنَّ النَّبِيُّ صلى الله عليه وسلم كَالْمُتَقَذِّرِ لَهُ، وَلَوْ كُنَّ حَرَامًا مَا أُكِلْنَ عَلَى مَائِدَتِهِ، وَلاَ أَمَرَ بِأَكْلِهِنَّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7053,
                "hadithNumber": "7359",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever has eaten garlic or onion, should keep away from us, or should keep away from our mosque and should stay at home.\" Ibn Wahb said, \"Once a plate full of cooked vegetables was brought to the Prophet (ﷺ) at Badr. Detecting a bad smell from it, he asked about the dish and was informed of the kinds of vegetables in contained. He then said, \"Bring it near,\" and so it was brought near to one of his companions who was with him. When the Prophet (ﷺ) saw it, he disliked eating it and said (to his companion), \"Eat, for I talk in secret to ones whom you do not talk to.\" Ibn-e-Ofair has reported from Ibn-e-Wahab: A  casserole containing vegetables. But Laith and Abu Sufyan did not mention casserole from Younus, so I don't know whether it is Zuhri's saying or a part of the Hadith.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو شخص کچی لہسن یا پیاز کھائے وہ ہم سے دور رہے یا ( یہ فرمایا کہ ) ہماری مسجد سے دور رہے اور اپنے گھر میں بیٹھا رہے ( یہاں تک کہ وہ بو رفع ہو جائے ) اور آپ کے پاس ایک طباق لایا گیا جس میں سبزیاں تھیں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس میں بو محسوس کی ‘ پھر آپ کو اس میں رکھی ہوئی سبزیوں کے متلعق بتایا گیا تو آپ نے اپنے بعض صحابی کی طرف جو آپ کے ساتھ تھے اشارہ کر کے فرمایا کہ ان کے پاس لے جاؤ لیکن جب ان صحابی نے اسے دیکھا تو انہوں نے بھی اسے کھانا پسند نہیں کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر ان سے فرمایا کہ تم کھا لو کیونکہ میں جس سے سرگوشی کرتا ہوں تم اس سے نہیں کرتے ۔ ( آپ کی مراد فرشتوں سے تھی ) سعید بن کثیر بن عفیر نے جو حضرت امام بخاری رحمہ اللہ کے شیخ ہیں ‘ عبداللہ بن وہب سے اس حدیث میں یوں روایت کیا کہ آنحضرت صلی اللہ علیہ وسلم کے پاس ہانڈی لائی گئی جس میں ترکاریاں تھیں اور لیث وابوصفوان عبداللہ بن سعید اموی نے بھی اس حدیث کو یو نس سے روایت کیا لیکن انہوں نے ہانڈی کا قصہ نہیں بیان کیا ‘ اب میں نہیں جانتا کہ ہانڈی کا قصہ حدیث میں داخل ہے یا زہری نے بڑھا دیا ہے ۔",
                "urduNarrator": "ہم سے احمد بن صالح نے بیان کیا ‘ کہا ہم سے عبداللہ بن وہب نے بیان کیا ‘ کہا مجھے یونس نے خبر دی ‘ انہیں ابن شہاب نے کہا کہ مجھ کو عطاء بن ابی رباح نے خبر دی ‘ انہیں جابر بن عبداللہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ أَكَلَ ثُومًا أَوْ بَصَلاً، فَلْيَعْتَزِلْنَا أَوْ لِيَعْتَزِلْ مَسْجِدَنَا، وَلْيَقْعُدْ فِي بَيْتِهِ ‏\"‏‏.‏ وَإِنَّهُ أُتِيَ بِبَدْرٍ ـ قَالَ ابْنُ وَهْبٍ يَعْنِي طَبَقًا ـ فِيهِ خَضِرَاتٌ مِنْ بُقُولٍ، فَوَجَدَ لَهَا رِيحًا فَسَأَلَ عَنْهَا ـ أُخْبِرَ بِمَا فِيهَا مِنَ الْبُقُولِ ـ فَقَالَ قَرِّبُوهَا فَقَرَّبُوهَا إِلَى بَعْضِ أَصْحَابِهِ كَانَ مَعَهُ، فَلَمَّا رَآهُ كَرِهَ أَكْلَهَا قَالَ ‏\"‏ كُلْ، فَإِنِّي أُنَاجِي مَنْ لاَ تُنَاجِي ‏\"‏‏.‏ وَقَالَ ابْنُ عُفَيْرٍ عَنِ ابْنِ وَهْبٍ بِقِدْرٍ فِيهِ خَضِرَاتٌ‏.‏ وَلَمْ يَذْكُرِ اللَّيْثُ وَأَبُو صَفْوَانَ عَنْ يُونُسَ قِصَّةَ الْقِدْرِ، فَلاَ أَدْرِي هُوَ مِنْ قَوْلِ الزُّهْرِيِّ أَوْ فِي الْحَدِيثِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7054,
                "hadithNumber": "7360",
                "englishNarrator": "Narrated Jubair bin Mut`im رضی اللہ عنہ :",
                "hadithEnglish": "A lady came to Allah's Messenger (ﷺ) and she talked to him about something, and he gave her some order. She said, \"O Allah's Messenger (ﷺ)! If I should not find you?\" He said, \"If you should not find me, then go to Abu Bakr.\" Ibrahim bin Sa`d said, \"As if she meant the death (of the Prophet).",
                "hadithUrdu": "ایک خاتون رسول کریم صلی اللہ علیہ وسلم کے پاس آئیں تو آنحضرت صلی اللہ علیہ وسلم نے انہیں ایک حکم دیا ۔ انہوں نے عرض کیا ‘ یا رسول اللہ ! اگر میں آپ کو نہ پاؤں تو پھر کیا کروں گی ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جب مجھے نہ پا نا تو ابوبکر رضی اللہ عنہ کے پاس جانا ۔ حمیدی نے ابراہیم بن سعد سے یہ اضافہ کیا کہ غالباً خاتون کی مراد وفات تھی ۔ امام بخاری نے کہا کہ حمیدی نے اس روایت میں ابراہیم بن سعد سے اتنا بڑھایا ہے کہ آپ کو نہ پاؤں ‘ اس سے مراد یہ ہے کہ آپ کی وفات ہو جائے ۔",
                "urduNarrator": "مجھ سے عبیداللہ بن سعد بن ابراہیم نے بیان کیا ‘ کہا مجھ سے میرے والد اور چچا نے بیان کیا ‘ کہا کہ مجھ سے میرے والد نے بیان کیا اور ان سے ان کے والد نے ‘ انہیں محمد بن جبیر نے خبر دی اور انہیں ان کے والد جبیر بن مطعم رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي وَعَمِّي، قَالاَ حَدَّثَنَا أَبِي، عَنْ أَبِيهِ، أَخْبَرَنِي مُحَمَّدُ بْنُ جُبَيْرٍ، أَنَّ أَبَاهُ، جُبَيْرَ بْنَ مُطْعِمٍ أَخْبَرَهُ أَنَّ امْرَأَةً أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَكَلَّمَتْهُ فِي شَىْءٍ، فَأَمَرَهَا بِأَمْرٍ فَقَالَتْ أَرَأَيْتَ يَا رَسُولَ اللَّهِ إِنْ لَمْ أَجِدْكَ قَالَ ‏ \"‏ إِنْ لَمْ تَجِدِينِي فَأْتِي أَبَا بَكْرٍ ‏\"‏‏.‏ زَادَ الْحُمَيْدِيُّ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ كَأَنَّهَا تَعْنِي الْمَوْتَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 7055,
                "hadithNumber": "7361",
                "englishNarrator": "Narrated Humaid bin 'Abdur-Rahman:",
                "hadithEnglish": "He heard Mu'awiya رضی اللہ عنہ talking to a group of people from Quraish at Al-Madina, and on mentioning Ka'b Al-Ashbar, he said, \"He was one of the most truthful of those who used to talk about the people of the Scripture, yet we used to detect certain faults in his information.\"",
                "hadithUrdu": "انہوں نے معاویہ رضی اللہ عنہ سے سنا وہ مدینے میں قریش کی ایک جماعت سے حدیث بیان کر رہے تھے ۔ معاویہ رضی اللہ عنہ نے کعب احبار کا ذکر کیا اور فرمایا جتنے لوگ اہل کتاب سے احادیث نقل کرتے ہیں ان سب میں کعب احبار بہت سچے تھے اور باوجود اس کے کبھی کبھی ان کی بات جھوٹ نکلتی تھی ۔ یہ مطلب نہیں ہے کہ کعب احبار جھوٹ بولتے تھے ۔",
                "urduNarrator": "ابو الیمان امام بخاری کے شیخ نے بیان کیا کہ ہم کو شعیب نے خبر دی ‘ انہیں زہری نے ‘ انہیں حمید بن عبدالرحمٰن نے خبر دی ‘",
                "hadithArabic": "وَقَالَ أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، سَمِعَ مُعَاوِيَةَ، يُحَدِّثُ رَهْطًا مِنْ قُرَيْشٍ بِالْمَدِينَةِ، وَذَكَرَ كَعْبَ الأَحْبَارِ فَقَالَ إِنْ كَانَ مِنْ أَصْدَقِ هَؤُلاَءِ الْمُحَدِّثِينَ الَّذِينَ يُحَدِّثُونَ عَنْ أَهْلِ الْكِتَابِ، وَإِنْ كُنَّا مَعَ ذَلِكَ لَنَبْلُو عَلَيْهِ الْكَذِبَ‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ لاَ تَسْأَلُوا أَهْلَ الْكِتَابِ عَنْ شَىْءٍ ‏\"‏",
                "headingUrdu": "’’اہل کتاب سے کسی چیز کے بارے میں مت پوچھو۔‘‘",
                "headingEnglish": "“Do not ask the people of the Scripture about anything.”",
                "chapterId": "98",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 98,
                    "chapterNumber": "98",
                    "chapterEnglish": "Holding Fast to the Qur'an and Sunnah",
                    "chapterUrdu": "اللہ اور سنت رسول اللہ صلی اللہ علیہ وسلم کو مضبوطی سے تھامے رہنا",
                    "chapterArabic": "كتاب الاعتصام بال والسنة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 7026,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=281",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=279",
                "label": "279",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=280",
                "label": "280",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=281",
                "label": "281",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=282",
                "label": "282",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=283",
                "label": "283",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=284",
                "label": "284",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=285",
                "label": "285",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=283",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=283",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=281",
        "to": 7050,
        "total": 40465
    }
}