{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 64,
        "data": [
            {
                "id": 1577,
                "hadithNumber": "1643",
                "englishNarrator": "Narrated  `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"How do you interpret the statement of Allah,. : Verily! (the mountains) As-Safa and Al-Marwa are among the symbols of Allah, and whoever performs the Hajj to the Ka`ba or performs `Umra, it is not harmful for him to perform Tawaf between them (Safa and Marwa.) (2.158). By Allah! (it is evident from this revelation) there is no harm if one does not perform Tawaf between Safa and Marwa.\" `Aisha رضی اللہ عنہا  said, \"O, my nephew! Your interpretation is not true. Had this interpretation of yours been correct, the statement of Allah should have been, 'It is not harmful for him if he does not perform Tawaf between them.' But in fact, this divine inspiration was revealed concerning the Ansar who used to assume lhram for worship ping an idol called \"Manat\" which they used to worship at a place called Al-Mushallal before they embraced Islam, and whoever assumed Ihram (for the idol), would consider it not right to perform Tawaf between Safa and Marwa. When they embraced Islam, they asked Allah's Messenger (ﷺ) regarding it, saying, \"O Allah's Apostle! We used to refrain from Tawaf between Safa and Marwa.\" So Allah revealed: 'Verily; (the mountains) As-Safa and Al-Marwa are among the symbols of Allah.' \" Aisha added, \"Surely, Allah's Apostle set the tradition of Tawaf between Safa and Marwa, so nobody is allowed to omit the Tawaf between them.\" Later on I (`Urwa) told Abu Bakr bin `Abdur-Rahman (of `Aisha's narration) and he said, 'I have not heard of such information, but I heard learned men saying that all the people, except those whom `Aisha mentioned and who used to assume lhram for the sake of Manat, used to perform Tawaf between Safa and Marwa. When Allah referred to the Tawaf of the Ka`ba and did not mention Safa and Marwa in the Qur'an, the people asked, 'O Allah's Messenger (ﷺ)! We used to perform Tawaf between Safa and Marwa and Allah has revealed (the verses concerning) Tawaf of the Ka`ba and has not mentioned Safa and Marwa. Is there any harm if we perform Tawaf between Safa and Marwa?' So Allah revealed: \"Verily As-Safa and Al- Marwa are among the symbols of Allah.\" Abu Bakr said, \"It seems that this verse was revealed concerning the two groups, those who used to refrain from Tawaf between Safa and Marwa in the Pre- Islamic Period of ignorance and those who used to perform the Tawaf then, and after embracing Islam they refrained from the Tawaf between them as Allah had enjoined Tawaf of the Ka`ba and did not mention Tawaf (of Safa and Marwa) till later after mentioning the Tawaf of the Ka`ba.'",
                "hadithUrdu": "اللہ تعالیٰ کے اس فرمان کے بارے میں آپ کا کیا خیال ہے ( جو سورۃ البقرہ میں ہے کہ ) ” صفا اور مروہ اللہ تعالیٰ کی نشانیوں میں سے ہیں ۔ اس لے جو بیت اللہ کا حج یا عمرہ کرے اس کے لیے ان کا طواف کرنے میں کوئی گناہ نہیں “ ۔ قسم اللہ کی پھر تو کوئی حرج نہ ہونا چاہئیے اگر کوئی صفا اور مروہ کی سعی نہ کرنی چاہے ۔ حضرت عائشہ رضی اللہ عنہا نے فرمایا بھتیجے ! تم نے یہ بری بات کہی ۔ اللہ کا مطلب یہ ہوتا تو قرآن میں یوں اترتا “ ان کے طواف نہ کرنے میں کوئی گناہ نہیں “ بات یہ ہے کہ یہ آیت تو انصار کے لیے اتری تھی جو اسلام سے پہلے منات بت کے نام پر جو مشلل میں رکھا ہوا تھا اور جس کی یہ پوجا کیا کرتے تھے ۔ ، احرام باندھتے تھے ۔ یہ لوگ جب ( زمانہ جاہلیت میں ) احرام باندھتے تو صفا مروہ کی سعی کو اچھا نہیں خیال کرتے تھے ۔ اب جب اسلام لائے تو رسول اللہ صلی اللہ علیہ وسلم سے اس کے متعلق پوچھا اور کہا کہ یا رسول اللہ ! ہم صفا اور مروہ کی سعی اچھی نہیں سمجھتے تھے ۔ اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی کہ صفا اور مروہ دونوں اللہ کی نشانیاں ہیں آخر آیت تک ۔ حضرت عائشہ صدیقہ رضی اللہ عنہا نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان دو پہاڑوں کے درمیان سعی کی سنت جاری کی ہے ۔ اس لیے کسی کے لیے مناسب نہیں ہے کہ اسے ترک کر دے ۔ انہوں نے کہا کہ پھر میں نے اس کا ذکر ابوبکر بن عبدالرحمٰن سے کیا تو انھوں نے فرمایا کہ میں نے تو یہ علمی بات اب تک نہیں سنی تھی ، بلکہ میں نے بہت سے اصحاب علم سے تو یہ سنا ہے کہ وہ یوں کہتے تھے کہ عرب کے لوگ ان لوگوں کے سوا جن کا حضرت عائشہ صدیقہ رضی اللہ عنہا نے ذکر کیا جو مناۃ کے لیے احرام باندھتے تھے سب صفا مروہ کا پھیرا کیا کرتے تھے ۔ اور جب اللہ نے قرآن شریف میں بیت اللہ کے طواف کا ذکر فرمایا اور صفا مروہ کا ذکر نہیں کیا تو وہ لوگ کہنے لگے یا رسول اللہ ! ہم تو جاہلیت کے زمانہ میں صفا اور مروہ کا پھیرا کیا کرتے تھے اور اب اللہ نے بیت اللہ کے طواف کا ذکر تو فرمایا لیکن صفا مروہ کا ذکر نہیں کیا تو کیا صفا مروہ کی سعی کرنے میں ہم پر کچھ گناہ ہو گا ؟ تب اللہ نے یہ آیت اتاری ۔ ” صفا مروہ اللہ کی نشانیاں ہیں آخر آیت تک ۔ “ ابوبکر رضی اللہ عنہ نے کہا میں سنتا ہوں کہ یہ آیت دونوں فرقوں کے باب میں اتری ہے یعنی اس فرقے کے باب میں جو جاہلیت کے زمانے میں صفا مروہ کا طواف برا جانتا تھا اور اس کے باب میں جو جاہلیت کے زمانے میں صفا مروہ کا طواف کیا کرتے تھے ۔ پھر مسلمان ہونے کے بعد اس کا کرنا اس وجہ سے کہ اللہ نے بیت اللہ کے طواف کا ذکر کیا اور صفا و مروہ کا نہیں کیا ، برا سمجھے ۔ یہاں تک کہ اللہ نے بیت اللہ کے طواف کے بعد ان کے طواف کا بھی ذکر فرما دیا ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا کہ ہمیں شعیب نے زہری سے خبر دی کہ عروہ نے بیان کیا کہ میں نے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا سے پوچھا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ عُرْوَةُ سَأَلْتُ عَائِشَةَ ـ رضى الله عنها ـ فَقُلْتُ لَهَا أَرَأَيْتِ قَوْلَ اللَّهِ تَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}‏ فَوَاللَّهِ مَا عَلَى أَحَدٍ جُنَاحٌ أَنْ لاَ يَطُوفَ بِالصَّفَا وَالْمَرْوَةِ‏.‏ قَالَتْ بِئْسَ مَا قُلْتَ يَا ابْنَ أُخْتِي إِنَّ هَذِهِ لَوْ كَانَتْ كَمَا أَوَّلْتَهَا عَلَيْهِ كَانَتْ لاَ جُنَاحَ عَلَيْهِ أَنْ لاَ يَتَطَوَّفَ بِهِمَا، وَلَكِنَّهَا أُنْزِلَتْ فِي الأَنْصَارِ، كَانُوا قَبْلَ أَنْ يُسْلِمُوا يُهِلُّونَ لِمَنَاةَ الطَّاغِيَةِ الَّتِي كَانُوا يَعْبُدُونَهَا عِنْدَ الْمُشَلَّلِ، فَكَانَ مَنْ أَهَلَّ يَتَحَرَّجُ أَنْ يَطُوفَ بِالصَّفَا وَالْمَرْوَةِ، فَلَمَّا أَسْلَمُوا سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ قَالُوا يَا رَسُولَ اللَّهِ، إِنَّا كُنَّا نَتَحَرَّجُ أَنْ نَطُوفَ بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ‏}‏ الآيَةَ‏.‏ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ وَقَدْ سَنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم الطَّوَافَ بَيْنَهُمَا، فَلَيْسَ لأَحَدٍ أَنْ يَتْرُكَ الطَّوَافَ بَيْنَهُمَا‏.‏ ثُمَّ أَخْبَرْتُ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ، فَقَالَ إِنَّ هَذَا لَعِلْمٌ مَا كُنْتُ سَمِعْتُهُ، وَلَقَدْ سَمِعْتُ رِجَالاً مِنْ أَهْلِ الْعِلْمِ، يَذْكُرُونَ أَنَّ النَّاسَ إِلاَّ مَنْ ذَكَرَتْ عَائِشَةُ مِمَّنْ كَانَ يُهِلُّ بِمَنَاةَ، كَانُوا يَطُوفُونَ كُلُّهُمْ بِالصَّفَا وَالْمَرْوَةِ، فَلَمَّا ذَكَرَ اللَّهُ تَعَالَى الطَّوَافَ بِالْبَيْتِ، وَلَمْ يَذْكُرِ الصَّفَا وَالْمَرْوَةَ فِي الْقُرْآنِ قَالُوا يَا رَسُولَ اللَّهِ كُنَّا نَطُوفُ بِالصَّفَا وَالْمَرْوَةِ، وَإِنَّ اللَّهَ أَنْزَلَ الطَّوَافَ بِالْبَيْتِ، فَلَمْ يَذْكُرِ الصَّفَا فَهَلْ عَلَيْنَا مِنْ حَرَجٍ أَنْ نَطَّوَّفَ بِالصَّفَا وَالْمَرْوَةِ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ‏}‏ الآيَةَ‏.‏ قَالَ أَبُو بَكْرٍ فَأَسْمَعُ هَذِهِ الآيَةَ نَزَلَتْ فِي الْفَرِيقَيْنِ كِلَيْهِمَا فِي الَّذِينَ كَانُوا يَتَحَرَّجُونَ أَنْ يَطُوفُوا بِالْجَاهِلِيَّةِ بِالصَّفَا وَالْمَرْوَةِ، وَالَّذِينَ يَطُوفُونَ ثُمَّ تَحَرَّجُوا أَنْ يَطُوفُوا بِهِمَا فِي الإِسْلاَمِ مِنْ أَجْلِ أَنَّ اللَّهَ تَعَالَى أَمَرَ بِالطَّوَافِ بِالْبَيْتِ، وَلَمْ يَذْكُرِ الصَّفَا حَتَّى ذَكَرَ ذَلِكَ بَعْدَ مَا ذَكَرَ الطَّوَافَ بِالْبَيْتِ‏.‏",
                "headingArabic": "وُجُوبِ الصَّفَا وَالْمَرْوَةِ وَجُعِلَ مِنْ شَعَائِرِ اللَّهِ",
                "headingUrdu": "صفا اور مروہ کے درمیان طواف (سعی)",
                "headingEnglish": "The Tawaf (Sa'i) between As-Safa and Al-Marwa",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1578,
                "hadithNumber": "1644",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"When Allah's Messenger (ﷺ) performed the first Tawaf he did Ramal in the first three rounds and then walked in the remaining four rounds (of Tawaf of the Ka`ba), where as in performing Tawaf between Safa and Marwa he used to run in the midst of the rainwater passage,\" I asked Nafi`, \"Did `Abdullah (bin `Umar) رضی اللہ عنہما use to walk steadily on reaching the Yemenite Corner?\" He replied, \"No, unless people were crowded at the Corner; otherwise he would not leave it without touching it.\"",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم پہلا طواف کرتے تو اس کے تین چکروں میں رمل کرتے اور بقیہ چار میں معمول کے مطابق چلتے اور جب صفا اور مروہ کی سعی کرتے تو آپ نالے کے نشیب میں دوڑا کرتے تھے ۔ عبیداللہ نے کہا میں نے نافع سے پوچھا ، ابن عمر رضی اللہ عنہما جب رکن یمانی کے پاس پہنچتے تو کیا حسب معمول چلنے لگتے تھے ؟ انہوں نے فرمایا کہ نہیں ۔ البتہ اگر رکن یمانی پر ہجوم ہوتا تو حجراسود کے پاس آ کر آپ آہستہ چلنے لگتے کیونکہ وہ بغیر چومے اس کو نہیں چھوڑتے تھے ۔",
                "urduNarrator": "ہم نے محمدبن عبید نے بیان کیا ، انہوں نے کہا کہ ہم سے عیسیٰ بن یونس نے بیان کیا ، ان سے عبیداللہ بن عمر نے ، ان سے نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا طَافَ الطَّوَافَ الأَوَّلَ خَبَّ ثَلاَثًا وَمَشَى أَرْبَعًا، وَكَانَ يَسْعَى بَطْنَ الْمَسِيلِ إِذَا طَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏.‏ فَقُلْتُ لِنَافِعٍ أَكَانَ عَبْدُ اللَّهِ يَمْشِي إِذَا بَلَغَ الرُّكْنَ الْيَمَانِيَ قَالَ لاَ‏.‏ إِلاَّ أَنْ يُزَاحَمَ عَلَى الرُّكْنِ فَإِنَّهُ كَانَ لاَ يَدَعُهُ حَتَّى يَسْتَلِمَهُ‏.‏",
                "headingArabic": "مَا جَاءَ فِي السَّعْىِ بَيْنَ الصَّفَا وَالْمَرْوَةِ",
                "headingUrdu": "صفا اور مروہ کے درمیان سعی",
                "headingEnglish": "Sa'i between As-Safa and Al-Marwa",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1579,
                "hadithNumber": "1645, 1646",
                "englishNarrator": "Narrated `Amr bin Dinar:",
                "hadithEnglish": "We asked Ibn `Umar رضی اللہ عنہما  whether a man who, while performing `Umra, had performed Tawaf of the Ka`ba; and had not yet performed Tawaf between Safa and Marwa, could have sexual relation with his wife, Ibn `Umar replied \"The Prophet (ﷺ) reached Mecca and performed the seven rounds (of Tawaf) of the Ka`ba and then offered a two-rak`at prayer behind Maqam Ibrahim and then performed the seven rounds (of Tawaf) between Safa and Marwa.\" He added, \"Verily! In Allah's Messenger (ﷺ) you have a good example.\" \" We asked Jabir bin `Abdullah رضی اللہ عنہما (the same question) and he said, \"He (that man) should not come near (his wife) till he has completed Tawaf between Safa and Marwa.\"",
                "hadithUrdu": "ہم نے ابن عمر رضی اللہ عنہما سے ایک ایسے شخص کے متعلق پوچھا جو عمرہ میں بیت اللہ کا طواف تو کر لے لیکن صفا اور مروہ کی سعی نہیں کرتا ، کیا وہ اپنی بیوی سے صحبت کر سکتا ہے ۔ انہوں نے جواب دیانبی کریم صلی اللہ علیہ وسلم ( مکہ ) تشریف لائے تو آپ نے بیت اللہ کا سات چکروں کے ساتھ طواف کیا اور مقام ابراہیم کے پیچھے دو رکعت نماز پڑھی ۔ پھرصفا اور مروہ کی سات مرتبہ سعی کی اور تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے ۔ ہم نے اس کے متعلق جابر بن عبداللہ رضی اللہ عنہما سے بھی پوچھا تو آپ نے فرمایا کہ صفا اور مروہ کی سعی سے پہلے بیوی کے قریب بھی نہ جائے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے عمرو بن دینار سے بیان کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَأَلْنَا ابْنَ عُمَرَ ـ رضى الله عنه ـ عَنْ رَجُلٍ، طَافَ بِالْبَيْتِ فِي عُمْرَةٍ، وَلَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ أَيَأْتِي امْرَأَتَهُ فَقَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ سَبْعًا، وَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ، فَطَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ سَبْعًا ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏}‏‏. وَسَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ فَقَالَ لاَ يَقْرَبَنَّهَا حَتَّى يَطُوفَ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1580,
                "hadithNumber": "1647",
                "englishNarrator": "Narrated `Amr bin Dinar:",
                "hadithEnglish": "I heard Ibn `Umar رضی اللہ عنہما saying, \"The Prophet (ﷺ) arrived at Mecca and performed Tawaf of the Ka`ba and then offered a two-rak`at prayer and then performed Tawaf between Safa and Marwa.\" Ibn `Umar رضی اللہ عنہما  then recited (the verse): \"Verily! In Allah's Messenger (ﷺ) you have a good example. \"",
                "hadithUrdu": "میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ، آپ نے کہا کہ نبی کریم صلی اللہ علیہ وسلم جب مکہ تشریف لائے تو آپ نے بیت اللہ کا طواف کیا اور دو رکعت نماز پڑھی پھر صفا اور مروہ کی سعی کی ۔ اس کے بعد عبداللہ رضی اللہ عنہ نے یہ آیت تلاوت کی «لقد كان لكم في رسول الله أسوة حسنة‏» ” تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے۔ “",
                "urduNarrator": "ہم سے مکی بن ابراہیم نے بیان کیا ، ان سے ابن جریج نے بیان کیا کہ مجھے عمرو بن دینار نے خبر دی ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ، فَطَافَ بِالْبَيْتِ، ثُمَّ صَلَّى رَكْعَتَيْنِ، ثُمَّ سَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ، ثُمَّ تَلاَ ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏}‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1581,
                "hadithNumber": "1648",
                "englishNarrator": "Narrated `Asim:",
                "hadithEnglish": "I asked Anas bin Malik: \"Did you use to dislike to perform Tawaf between Safa and Marwa?\" He said, \"Yes, as it was of the ceremonies of the days of the Pre-Islamic period of ignorance, till Allah revealed: 'Verily! (The two mountains) As-Safa and Al-Marwa are among the symbols of Allah. It is therefore no sin for him who performs the pilgrimage to the Ka`ba, or performs `Umra, to perform Tawaf between them.' \" (2.158)",
                "hadithUrdu": "میں نے انس بن مالک رضی اللہ عنہ سے پوچھا کہ آپ لوگ صفا اور مروہ کی سعی کو برا سمجھتے تھے ؟ انہوں نے فرمایا ، ہاں ! کیونکہ یہ عہد جاہلیت کا شعار تھا ۔ یہاں تک کہ اللہ تعالیٰ نے یہ آیت نازل فرما دی ” صفا اور مروہ اللہ تعالیٰ کی نشانیاں ہیں ۔ پس جو کوئی بیت اللہ کا حج یا عمرہ کرے اس پر ان کی سعی کرنے میں کوئی گناہ نہیں ہے۔ “",
                "urduNarrator": "ہم سے احمد بن محمد مروزی نے بیان کیا ، انہوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا کہ ہمیں عاصم احول نے خبر دی ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عَاصِمٌ، قَالَ قُلْتُ لأَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَكُنْتُمْ تَكْرَهُونَ السَّعْىَ بَيْنَ الصَّفَا وَالْمَرْوَةِ قَالَ نَعَمْ‏.‏ لأَنَّهَا كَانَتْ مِنْ شَعَائِرِ الْجَاهِلِيَّةِ، حَتَّى أَنْزَلَ اللَّهُ ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1582,
                "hadithNumber": "1649",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) performed Tawaf of the Ka`ba and the Sa`i of Safa and Marwa so as to show his strength to the pagans.  Humaidi has added a little bit more and Sufyan, Amr, Ataa reported from Hadrat Ibn-e-Abbas رضی اللہ عنہما according to that (Hadith).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بیت اللہ کا طواف اور صفا مروہ کی سعی اس طرح کی کہ مشرکین کو آپ اپنی قوت دکھلا سکیں ۔ حمیدی نے یہ اضافہ کیا ہے کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے بیان کیا ، کہا کہ میں نے عطاء سے سنا اور انہوں نے ابن عباس رضی اللہ عنہما سے یہی حدیث سنی ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، ان سے عطاء بن ابی رباح نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ إِنَّمَا سَعَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ لِيُرِيَ الْمُشْرِكِينَ قُوَّتَهُ‏.‏ زَادَ الْحُمَيْدِيُّ حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرٌو، سَمِعْتُ عَطَاءً، عَنِ ابْنِ عَبَّاسٍ، مِثْلَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1583,
                "hadithNumber": "1650",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I was menstruating when I reached Mecca. So, I neither performed Tawaf of the Ka`ba, nor the Tawaf between Safa and Marwa. Then I informed Allah's Messenger (ﷺ) about it. He replied, \"Perform all the ceremonies of Hajj like the other pilgrims, but do not perform Tawaf of the Ka`ba till you get clean (from your menses).\"",
                "hadithUrdu": "میں مکہ آئی تو اس وقت میں حائضہ تھی ۔ اس لیے بیت اللہ کا طواف نہ کر سکی اور نہ صفا مروہ کی سعی ۔ انہوں نے بیان کیا کہ میں نے اس کی شکایت رسول اللہ صلی اللہ علیہ وسلم سے کی تو آپ نے فرمایا کہ جس طرح دوسرے حاجی کرتے ہیں تم بھی اسی طرح ( ارکان حج ) ادا کرلوہاں بیت اللہ کا طواف پاک ہونے سے پہلے نہ کرنا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے خبر دی ، انہیں عبدالرحمٰن بن قاسم نے ، انہیں ان کے باپ نے اور انہیں ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے انہوں نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ قَدِمْتُ مَكَّةَ وَأَنَا حَائِضٌ، وَلَمْ أَطُفْ بِالْبَيْتِ، وَلاَ بَيْنَ الصَّفَا وَالْمَرْوَةِ، قَالَتْ فَشَكَوْتُ ذَلِكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ افْعَلِي كَمَا يَفْعَلُ الْحَاجُّ غَيْرَ أَنْ لاَ تَطُوفِي بِالْبَيْتِ حَتَّى تَطْهُرِي ‏\"‏‏.‏",
                "headingArabic": "تَقْضِي الْحَائِضُ الْمَنَاسِكَ كُلَّهَا إِلاَّ الطَّوَافَ بِالْبَيْتِ ، وَإِذَا سَعَى عَلَى غَيْرِ وُضُوءٍ بَيْنَ الصَّفَا وَالْمَرْوَةِ",
                "headingUrdu": "حیض والی عورت طواف کے علاوہ حج کی تمام مناسک ادا کر سکتی ہے۔",
                "headingEnglish": "A menstruating woman can perform all the ceremonies of Hajj except Tawaf",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1584,
                "hadithNumber": "1651",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) and his companions assumed Ihram for Hajj and none except the Prophet (ﷺ) and Talha had the Hadi (sacrifice) with them. `Ali رضی اللہ عنہ arrived from Yemen and had a Hadi with him. `Ali said, \"I have assumed Ihram for what the Prophet (ﷺ) has done.\" The Prophet (ﷺ) ordered his companions to perform the `Umra with the lhram which they had assumed, and after finishing Tawaf (of Ka`ba, Safa and Marwa) to cut short their hair, and to finish their lhram except those who had Hadi with them. They (the people) said, \"How can we proceed to Mina (for Hajj) after having sexual relations with our wives?\" When that news reached the Prophet (ﷺ) he said, \"If I had formerly known what I came to know lately, I would not have brought the Hadi with me. Had there been no Hadi with me, I would have finished the state of lhram.\" `Aisha got her menses, so she performed all the ceremonies of Hajj except Tawaf of the Ka`ba, and when she got clean (from her menses), she performed Tawaf of the Ka`ba. She said, \"O Allah's Messenger (ﷺ)! (All of you) are returning with the Hajj and `Umra, but I am returning after performing Hajj only.\" So the Prophet (ﷺ) ordered `Abdur-Rahman bin Abu Bakr to accompany her to Tan`im and thus she performed the `Umra after the Hajj.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم اور آپ کے اصحاب نے حج کا احرام باندھا ۔ آنحضور صلی اللہ علیہ وسلم اور طلحہ کے سوا اور کسی کے ساتھ قربانی نہیں تھی ، حضرت علی رضی اللہ عنہ یمن سے آئے تھے اور ان کے ساتھ بھی قربانی تھی ۔ اس لیے نبی کریم صلی اللہ علیہ وسلم نے حکم دیا کہ ( سب لوگ اپنے حج کے احرام کو ) عمرہ کا کر لیں ۔ پھر طواف اور سعی کے بعد بال ترشوا لیں اور احرام کھول ڈالیں لیکن وہ لوگ اس حکم سے مستثنیٰ ہیں جن کے ساتھ قربانی ہو ۔ اس پر صحابہ نے کہا کہ ہم منیٰ میں اس طرح جائیں گے کہ ہمارے ذکر سے منی ٹپک رہی ہو ۔ یہ بات جب رسول اللہ صلی اللہ علیہ وسلم کو معلوم ہوئی تو آپ نے فرمایا ، اگر مجھے پہلے معلوم ہوتا تو میں قربانی کا جانور ساتھ نہ لاتا اور جب قربانی کا جانور ساتھ نہ ہوتا تو میں بھی ( عمرہ اور حج کے درمیان ) احرام کھول ڈالتا اور عائشہ رضی اللہ عنہا ( اس حج میں ) حائضہ ہو گئی تھیں ۔ اس لیے انہوں نے بیت اللہ کہ طواف کے سوا اور دوسرے ارکان حج ادا کئے ۔ پھر پاک ہو لیں تو طواف بھی کیا ۔ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے شکایت کی کہ آپ سب لوگ تو حج اور عمرہ دونوں کر کے جا رہے ہیں لیکن میں نے صرف حج ہی کیا ہے ۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے عبدالرحمٰن بن ابی بکر کو حکم دیا کہ انہیں تنعیم لیے جائیں ( اور وہاں سے عمرہ کا احرام باندھیں ) اس طرح عائشہ رضی اللہ عنہا نے حج کے بعد عمرہ کیا ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا کہ ہم سے عبدالوہاب ثقفی نے بیان کیا ۔ ( دوسری سند ) اور مجھ سے خلیفہ بن خیاط نے بیان کیا کہ ہم سے عبدالوہاب ثقفی نے بیان کیا ، کہا کہ ہم سے حبیب معلم نے بیان کیا ، ان سے عطاء بن ابی رباح نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ،‏.‏ قَالَ وَقَالَ لِي خَلِيفَةُ حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا حَبِيبٌ الْمُعَلِّمُ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ أَهَلَّ النَّبِيُّ صلى الله عليه وسلم هُوَ وَأَصْحَابُهُ بِالْحَجِّ، وَلَيْسَ مَعَ أَحَدٍ مِنْهُمْ هَدْىٌ، غَيْرَ النَّبِيِّ صلى الله عليه وسلم وَطَلْحَةَ، وَقَدِمَ عَلِيٌّ مِنَ الْيَمَنِ، وَمَعَهُ هَدْىٌ فَقَالَ أَهْلَلْتُ بِمَا أَهَلَّ بِهِ النَّبِيُّ صلى الله عليه وسلم‏.‏ فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم أَصْحَابَهُ أَنْ يَجْعَلُوهَا عُمْرَةً، وَيَطُوفُوا، ثُمَّ يُقَصِّرُوا وَيَحِلُّوا، إِلاَّ مَنْ كَانَ مَعَهُ الْهَدْىُ، فَقَالُوا نَنْطَلِقُ إِلَى مِنًى، وَذَكَرُ أَحَدِنَا يَقْطُرُ، فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لَوِ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ مَا أَهْدَيْتُ، وَلَوْلاَ أَنَّ مَعِي الْهَدْىَ لأَحْلَلْتُ ‏\"‏‏.‏ وَحَاضَتْ عَائِشَةُ ـ رضى الله عنها ـ فَنَسَكَتِ الْمَنَاسِكَ كُلَّهَا، غَيْرَ أَنَّهَا لَمْ تَطُفْ بِالْبَيْتِ، فَلَمَّا طَهُرَتْ طَافَتْ بِالْبَيْتِ‏.‏ قَالَتْ يَا رَسُولَ اللَّهِ تَنْطَلِقُونَ بِحَجَّةٍ وَعُمْرَةٍ، وَأَنْطَلِقُ بِحَجٍّ فَأَمَرَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ أَنْ يَخْرُجَ مَعَهَا إِلَى التَّنْعِيمِ، فَاعْتَمَرَتْ بَعْدَ الْحَجِّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1585,
                "hadithNumber": "1652",
                "englishNarrator": "Narrated Hafsa:",
                "hadithEnglish": "(On `Id) We used to forbid our virgins to go out (for `Id prayer). A lady came and stayed at the Palace of Bani Khalaf. She mentioned that her sister was married to one of the companions of Allah's Messenger (ﷺ) who participated in twelve Ghazawats along with Allah's Messenger (ﷺ) and her sister was with him in six of them. She said, \"We used to dress the wounded and look after the patients.\" She (her sister) asked Allah's Messenger (ﷺ) , \"Is there any harm for a woman to stay at home if she doesn't have a veil?\" He said, \"She should cover herself with the veil of her companion and she should take part in the good deeds and in the religious gatherings of the believers.\" When Um 'Atiyya رضی اللہ عنہا came, I asked her. \"Did you hear anything about that?\" Um 'Atiyya رضی اللہ عنہا said, \"Bi Abi\" and she never mentioned the name of Allah's Messenger (ﷺ) without saying \"Bi Abi\" (i.e. 'Let my father be sacrificed for you'). We asked her, \"Have you heard Allah's Messenger (ﷺ) saying so and so (about women)?\" She replied in the affirmative and said, \"Let my father be sacrificed for him. He told us that unmarried mature virgins who stay often screened or unmarried young virgins and mature girls who stay often screened should come out and take part in the good deeds and in the religious gatherings of the believers. But the menstruating women should keep away from the Musalla (praying place).\" I asked her, \"The menstruating women?\" She replied, \"Don't they present themselves at `Arafat and at such and such places?\"",
                "hadithUrdu": "ہم اپنی کنواری لڑکیوں کو باہر نکلنے سے روکتے تھے ۔ پھر ایک خاتون آئیں اور بنی خلف کے محل میں ( جو بصرے میں تھا ) ٹھہریں ۔ انہوں نے بیان کیا کہ ان کی بہن ( ام عطیہ رضی اللہ عنہا ) نبی کریم صلی اللہ علیہ وسلم کے ایک صحابی کے گھر میں تھیں ۔ ان کے شوہر نے آنحضور صلی اللہ علیہ وسلم کے ساتھ بارہ جہاد کئے تھے اور میری بہن چھ جہادوں میں ان کے ساتھ رہی تھیں ۔ وہ بیان کرتی تھیں کہ ہم ( میدان جنگ میں ) زخمیوں کی مرہم پٹی کرتی تھیں اور مریضوں کی تیمارداری کرتی تھی ۔ میری بہن نے رسول صلی اللہ علیہ وسلم سے پوچھا کہ اگر ہمارے پاس چادر نہ ہو تو کیا کوئی حرج ہے اگر ہم عیدگاہ جانے کے لیے باہر نہ نکلیں ؟ آنحضور صلی اللہ علیہ وسلم نے فرمایا ، اس کی سہیلی کو اپنی چادر اسے اڑھا دینی چاہئے اور پھر مسلمانوں کی دعا اور نیک کاموں میں شرکت کرنا چاہئے ۔ پھر جب امام عطیہ رضی اللہ عنہا خود بصرہ آئیں تو میں نے ان سے بھی یہی پوچھا یا یہ کہا کہ ہم نے ان سے پوچھا انہوں نے بیان کیا ام عطیہ رضی اللہ عنہا جب بھی رسول اللہ صلی اللہ علیہ وسلم کا ذکر کرتیں تو کہتیں میرے باپ آپ پر فدا ہوں ۔ ہاں تو میں نے ان سے پوچھا ، کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے اس طرح سنا ہے ؟ انہوں نے فرمایا کہ ہاں میرے باپ آپ پر فدا ہوں ۔ انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ کنواری لڑکیاں اور پردہ والیاں بھی باہر نکلیں یا یہ فرمایا کہ پردہ والی دوشیزائیں اور حائضہ عورتیں سب باہر نکلیں اور مسلمانوں کی دعا اور خیر کے کاموں میں شرکت کریں ۔ لیکن حائضہ عورتیں نماز کی جگہ سے الگ رہیں ۔ میں نے کہا اور حائضہ بھی نکلیں ؟ انہوں نے فرمایا کہ کیا حائضہ عورت عرفات اور فلاں فلاں جگہ نہیں جاتی ہیں ؟ ( پھر عیدگاہ ہی جانے میں کیا حرج ہے ) ۔",
                "urduNarrator": "ہم سے مومل بن ہشام نے بیان کیا ، کہا کہ ہم سے اسماعیل بن علیہ نے بیان کیا ، ان سے ایوب سختیانی نے اور ان سے حفصہ بنت سیرین نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ حَفْصَةَ، قَالَتْ كُنَّا نَمْنَعُ عَوَاتِقَنَا أَنْ يَخْرُجْنَ، فَقَدِمَتِ امْرَأَةٌ فَنَزَلَتْ قَصْرَ بَنِي خَلَفٍ، فَحَدَّثَتْ أَنْ أُخْتَهَا كَانَتْ تَحْتَ رَجُلٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَدْ غَزَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ثِنْتَىْ عَشْرَةَ غَزْوَةً، وَكَانَتْ أُخْتِي مَعَهُ فِي سِتِّ غَزَوَاتٍ، قَالَتْ كُنَّا نُدَاوِي الْكَلْمَى وَنَقُومُ عَلَى الْمَرْضَى‏.‏ فَسَأَلَتْ أُخْتِي رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ هَلْ عَلَى إِحْدَانَا بَأْسٌ إِنْ لَمْ يَكُنْ لَهَا جِلْبَابٌ أَنْ لاَ تَخْرُجَ قَالَ ‏\"‏ لِتُلْبِسْهَا صَاحِبَتُهَا مِنْ جِلْبَابِهَا، وَلْتَشْهَدِ الْخَيْرَ، وَدَعْوَةَ الْمُؤْمِنِينَ ‏\"‏‏.‏ فَلَمَّا قَدِمَتْ أُمُّ عَطِيَّةَ ـ رضى الله عنها ـ سَأَلْنَهَا ـ أَوْ قَالَتْ سَأَلْنَاهَا ـ فَقَالَتْ وَكَانَتْ لاَ تَذْكُرُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِلاَّ قَالَتْ بِأَبِي‏.‏ فَقُلْنَا أَسَمِعْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ كَذَا وَكَذَا قَالَتْ نَعَمْ بِأَبِي‏.‏ فَقَالَ ‏\"‏ لِتَخْرُجِ الْعَوَاتِقُ ذَوَاتُ الْخُدُورِ ـ أَوِ الْعَوَاتِقُ وَذَوَاتُ الْخُدُورِ ـ وَالْحُيَّضُ، فَيَشْهَدْنَ الْخَيْرَ، وَدَعْوَةَ الْمُسْلِمِينَ، وَيَعْتَزِلُ الْحُيَّضُ الْمُصَلَّى ‏\"‏‏.‏ فَقُلْتُ الْحَائِضُ‏.‏ فَقَالَتْ أَوَ لَيْسَ تَشْهَدُ عَرَفَةَ، وَتَشْهَدُ كَذَا وَتَشْهَدُ كَذَا",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1586,
                "hadithNumber": "1653",
                "englishNarrator": "Narrated  Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "\"Tell me what you remember from Allah's Messenger (ﷺ) (regarding these questions): Where did he offer the Zuhr and `Asr prayers on the day of Tarwiya (8th day of Dhul- Hijja)?\" He relied, \"(He offered these prayers) at Mina.\" I asked, \"Where did he offer the `Asr prayer on the day of Nafr (i.e. departure from Mina on the 12th or 13th of Dhul-Hijja)?\" He replied, \"At Al- Abtah,\" and then added, \"You should do as your chiefs do.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ظہر اور عصر کی نماز آٹھویں ذی الحجہ میں کہاں پڑھی تھی ؟ اگر آپ کو آنحضرت صلی اللہ علیہ وسلم سے یاد ہے تو مجھے بتائیے ۔ انھوں نے جواب دیا کہ منیٰ میں ۔ میں نے پوچھا کہ بارہویں تاریخ کو عصر کہاں پڑھی تھی ؟ فرمایا کہ محصب میں ۔ پھر انھوں نے فرمایا کہ جس طرح تمہارے حکام کرتے ہیں اسی طرح تم بھی کرو ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمدنے بیان کیا ، کہا کہ ہم سے اسحاق ازرق نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے عبدالعزیز بن رفیع کے واسطے سے بیان کیا ، کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے پوچھا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا إِسْحَاقُ الأَزْرَقُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ قُلْتُ أَخْبِرْنِي بِشَىْءٍ، عَقَلْتَهُ عَنِ النَّبِيِّ صلى الله عليه وسلم أَيْنَ صَلَّى الظُّهْرَ وَالْعَصْرَ يَوْمَ التَّرْوِيَةِ قَالَ بِمِنًى‏.‏ قُلْتُ فَأَيْنَ صَلَّى الْعَصْرَ يَوْمَ النَّفْرِ قَالَ بِالأَبْطَحِ‏.‏ ثُمَّ قَالَ افْعَلْ كَمَا يَفْعَلُ أُمَرَاؤُكَ‏.‏",
                "headingArabic": "أَيْنَ يُصَلِّي الظُّهْرَ يَوْمَ التَّرْوِيَةِ",
                "headingUrdu": "ترویہ کے دن ظہر کی نماز کہاں پڑھی جائے؟",
                "headingEnglish": "Where to offer the Zuhr prayer on the day of Tarwiya",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1587,
                "hadithNumber": "1654",
                "englishNarrator": "Narrated `Abdul `Aziz:",
                "hadithEnglish": "I went out to Mina on the day of Tarwiya and met Anas رضی اللہ عنہ going on a donkey. I asked him, \"Where did the Prophet (ﷺ) offer the Zuhr prayer on this day?\" Anas replied, \"See where your chiefs pray and pray similarly.\"",
                "hadithUrdu": "میں آٹھویں تاریخ کو منیٰ گیا تو وہاں انس رضی اللہ عنہ سے ملا ۔ وہ گدھی پر سوار ہو کر جا رہے تھے ۔ میں نے پوچھا نبی کریم صلی اللہ علیہ وسلم نے اس دن ظہر کی نماز کہاں پڑھی تھی ؟ انھوں نے فرمایا دیکھو جہاں تمہارے حاکم لوگ نماز پڑھیں وہیں تم بھی پڑھو ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انھوں نے ابوبکر بن عیاش سے سنا کہ ہم سے عبدالعزیز بن رفیع نے بیان کیا ، کہا کہ میں انس رضی اللہ عنہ سے ملا ( دوسری سند ) امام بخاری رحمہ اللہ نے کہا اورمجھ سے اسماعیل بن ابان نے بیان کیا ، کہا کہ ہم سے ابوبکر بن عیاش نے بیان کیا ، ان سے عبدالعزیز نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، سَمِعَ أَبَا بَكْرِ بْنَ عَيَّاشٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، لَقِيتُ أَنَسًا‏.‏ وَحَدَّثَنِي إِسْمَاعِيلُ بْنُ أَبَانَ، حَدَّثَنَا أَبُو بَكْرٍ، عَنْ عَبْدِ الْعَزِيزِ، قَالَ خَرَجْتُ إِلَى مِنًى يَوْمَ التَّرْوِيَةِ فَلَقِيتُ أَنَسًا ـ رضى الله عنه ـ ذَاهِبًا عَلَى حِمَارٍ فَقُلْتُ أَيْنَ صَلَّى النَّبِيُّ صلى الله عليه وسلم هَذَا الْيَوْمَ الظُّهْرَ فَقَالَ انْظُرْ حَيْثُ يُصَلِّي أُمَرَاؤُكَ فَصَلِّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1588,
                "hadithNumber": "1655",
                "englishNarrator": "Narrated `Abdullah bin `Umar ر ضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) offered a two-rak`at prayer at Mina. Abu Bakr, `Umar and `Uthman ر ضی اللہ عنہما , (during the early years of his caliphate) followed the same practice.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے منیٰ میں دو رکعات پڑھیں اور ابوبکر اور عمر ر ضی اللہ عنہما بھی ایسا کرتے رہے اور عثمان رضی اللہ عنہ بھی خلافت کے شروع ایام میں ( دو ) ہی رکعت پڑھتے تھے ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، کہا کہ مجھے یونس نے ابن شہاب سے خبر دی ، کہا کہ مجھے عبیداللہ بن عبداللہ بن عمرر ضی اللہ عنہما نے اپنے باپ سے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِنًى رَكْعَتَيْنِ، وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ صَدْرًا مِنْ خِلاَفَتِهِ‏.‏",
                "headingArabic": "الصَّلاَةِ بِمِنًى",
                "headingUrdu": "منیٰ میں نماز",
                "headingEnglish": "As-Salat at Mina",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1589,
                "hadithNumber": "1656",
                "englishNarrator": "Narrated Haritha bin Wahab Al-Khuza`i ر ضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) led us in a two-rak`at prayer at Mina although our number was more than ever and we were in better security than ever.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے منیٰ میں ہمیں دو رکعات پڑھائیں ، ہمارا شمار اس وقت سب سے زیادہ تھا اور ہم اتنے بے ڈر کسی وقت میں نہ تھے ۔ ( اس کے باوجود ہم کو نماز قصر پڑھائی ) ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا کہ ہم سے شعبہ نے ابواسحاق ہمدانی سے بیان کیا اور ان سے حارثہ بن وہب خزاعی ر ضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ الْهَمْدَانِيِّ، عَنْ حَارِثَةَ بْنِ وَهْبٍ الْخُزَاعِيِّ ـ رضى الله عنه ـ قَالَ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم وَنَحْنُ أَكْثَرُ مَا كُنَّا قَطُّ وَآمَنُهُ بِمِنًى رَكْعَتَيْنِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1590,
                "hadithNumber": "1657",
                "englishNarrator": "Narrated `Abdullah bin Mas`ud ر ضی اللہ عنہ :",
                "hadithEnglish": "I offered (only a) two rak`at prayer with the Prophet (at Mina), and similarly with Abu Bakr ر ضی اللہ عنہ and with `Umar ر ضی اللہ عنہ , and then you d offered in opinions. Wish that I would be lucky enough to have two of the four rak`at accepted (by Allah).",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ منیٰ میں دو رکعت نماز پڑھی اور ابوبکر ر ضی اللہ عنہ کے ساتھ بھی دو ہی رکعت پڑھی اور عمر ر ضی اللہ عنہ کے ساتھ بھی دو ہی رکعت ، لیکن پھر ان کے بعد تم میں اختلاف ہو گیا تو کاش ان چار رکعتوں کے بدلے مجھ کو دو رکعات ہی نصیب ہوتیں جو ( اللہ کے ہاں ) قبول ہو جائیں ۔",
                "urduNarrator": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا کہ ہم سے سفیان ثوری نے ، ان سے اعمش نے ، ان سے ابراہیم نخعی نے ، ان سے عبدالرحمٰن بن یزید نے اور ان سے عبداللہ بن مسعود ر ضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم رَكْعَتَيْنِ، وَمَعَ أَبِي بَكْرٍ ـ رضى الله عنه ـ رَكْعَتَيْنِ وَمَعَ عُمَرَ ـ رضى الله عنه ـ رَكْعَتَيْنِ، ثُمَّ تَفَرَّقَتْ بِكُمُ الطُّرُقُ، فَيَا لَيْتَ حَظِّي مِنْ أَرْبَعٍ رَكْعَتَانِ مُتَقَبَّلَتَانِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1591,
                "hadithNumber": "1658",
                "englishNarrator": "Narrated Um Al-Fadl ر ضی اللہ عنہا :",
                "hadithEnglish": "The people doubted whether the Prophet (ﷺ) was observing the fast on the Day of `Arafat, so I sent something for him to drink and he drank it.",
                "hadithUrdu": "عرفہ کے دن لوگوں کو رسول اللہ صلی اللہ علیہ وسلم کے روزے کے متعلق شک ہوا ، اس لیے میں نے آپ کو پینے کے لیے کچھ بھیجا جسے آپ نے پی لیا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے زہری سے بیان کیا اور ان سے سالم ابوالنصر نے بیان کیا ، کہا کہ میں نے ام فضل کے غلام عمیر سے سنا ، انہوں نے ام فضل ر ضی اللہ عنہا سے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، حَدَّثَنَا سَالِمٌ، قَالَ سَمِعْتُ عُمَيْرًا، مَوْلَى أُمِّ الْفَضْلِ عَنْ أُمِّ الْفَضْلِ، شَكَّ النَّاسُ يَوْمَ عَرَفَةَ فِي صَوْمِ النَّبِيِّ صلى الله عليه وسلم فَبَعَثْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم بِشَرَابٍ فَشَرِبَهُ‏.‏",
                "headingArabic": "صَوْمِ يَوْمِ عَرَفَةَ",
                "headingUrdu": "یوم عرفہ کا روزہ (عرفات میں)",
                "headingEnglish": "Fasting on the Day of 'Arafa (at 'Arafat)",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1592,
                "hadithNumber": "1659",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "while we were proceeding from Mina to `Arafat, \"What do you use to do on this day when you were with Allah's Messenger (ﷺ) ?\" Anas رضی اللہ عنہ said, \"Some of us used to recite Talbiya and nobody objected to that, and others used to recite Takbir and nobody objected to that.\"",
                "hadithUrdu": "وہ دونوں صبح کو منیٰ سے عرفات جا رہے تھے ۔ کہ رسول کریم صلی اللہ علیہ وسلم کے ساتھ آپ لوگ آج کے دن کس طرح کرتے تھے ؟ انس رضی اللہ عنہ نے بتلایا : کوئی ہم میں سے لبیک پکارتا ہوتا ، اس پر کوئی اعتراض نہ کرتا اور کوئی تکبیر کہتا ، اس پر کوئی انکار نہ کرتا ( اس حدیث سے معلوم ہوا کہ حاجی کو اختیار ہے لبیک پکارتا رہے یا تکبیر کہتا رہے ) ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے محمد بن ابی بکر ثقفی سے خبر دی کہ انہوں نے انس بن مالک رضی اللہ عنہ سے پوچھا ۔ جب کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرٍ الثَّقَفِيِّ، أَنَّهُ سَأَلَ أَنَسَ بْنَ مَالِكٍ وَهُمَا غَادِيَانِ مِنْ مِنًى إِلَى عَرَفَةَ كَيْفَ كُنْتُمْ تَصْنَعُونَ فِي هَذَا الْيَوْمِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ كَانَ يُهِلُّ مِنَّا الْمُهِلُّ فَلاَ يُنْكِرُ عَلَيْهِ، وَيُكَبِّرُ مِنَّا الْمُكَبِّرُ فَلاَ يُنْكِرُ عَلَيْهِ‏.‏",
                "headingArabic": "التَّلْبِيَةِ وَالتَّكْبِيرِ إِذَا غَدَا مِنْ مِنًى إِلَى عَرَفَةَ",
                "headingUrdu": "منیٰ سے عرفات جاتے ہوئے تلبیہ اور تکبیر",
                "headingEnglish": "Talbiya and Takbir while proceeding from Mina to 'Arafat",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1593,
                "hadithNumber": "1660",
                "englishNarrator": "Narrated S`Abdul Malik wrote to Al-Hajjaj:",
                "hadithEnglish": "He should not differ from Ibn `Umar رضی اللہ عنہما during Hajj. On the Day of `Arafat, when the sun declined at midday, Ibn `Umar       رضی اللہ عنہما came along with me and shouted near Al- Hajjaj's cotton (cloth) tent. Al-Hajjaj came Out, wrapping himself with a waist-sheet dyed with safflower, and said, \"O Abu `Abdur-Rahman! What is the matter?\" He said, If you want to follow the Sunna (the tradition of the Prophet (p.b.u.h) ) then proceed (to `Arafat).\" Al-Hajjaj asked, \"At this very hour?\" Ibn `Umar رضی اللہ عنہما said, \"Yes.\" He replied, \"Please wait for me till I pour some water over my head (i.e. take a bath) and come out.\" Then Ibn `Umar dismounted and waited till Al-Hajjaj came out. So, he (Al-Hajjaj) walked in between me and my father (Ibn `Umar). I said to him, \"If you want to follow the Sunna then deliver a brief sermon and hurry up for the stay at `Arafat.\" He started looking at `Abdullah (Ibn `Umar رضی اللہ عنہما) (inquiringly), and when `Abdullah رضی اللہ عنہما noticed that, he said that he had told the truth.",
                "hadithUrdu": "حج کے احکام میں عبداللہ بن عمر رضی اللہ عنہما کے خلاف نہ کرے ۔ سالم نے کہا کہ عبداللہ بن عمر رضی اللہ عنہما عرفہ کے دن سورج ڈھلتے ہی تشریف لائے میں بھی ان کے ساتھ تھا ۔ آپ نے حجاج کے خیمہ کے پاس بلند آواز سے پکارا ۔ حجاج باہر نکلا اس کے بدن میں ایک کسم میں رنگی ہوئی چادر تھی ۔ اس نے پوچھا ابوعبدالرحمٰن ! کیا بات ہے ؟ آپ نے فرمایا اگر سنت کے مطابق عمل چاہتے ہو تو جلدی اٹھ کر چل کھڑے ہو جاؤ ۔ اس نے کہا کیا اسی وقت ؟ عبداللہ نے فرمایا کہ ہاں اسی وقت ۔ حجاج نے کہا کہ پھر تھوڑی سی مہلت دیجئیے کہ میں اپنے سر پر پانی ڈال لوں یعنی غسل کر لوں پھر نکلتا ہوں ۔ اس کے بعد عبداللہ بن عمر رضی اللہ عنہما ( سواری سے ) اتر گئے اور جب حجاج باہر آیا تو میرے اور والد ( ابن عمر ) کے درمیان چلنے لگا تو میں نے کہا کہ اگر سنت پر عمل کا ارادہ ہے تو خطبہ میں اختصار اور وقوف ( عرفات ) میں جلدی کرنا ۔ اس بات پر وہ عبداللہ بن عمر رضی اللہ عنہما کی طرف دیکھنے لگا حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ یہ سچ کہتا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے اور ان سے سالم نے بیان کیا کہ عبدالملک بن مروان نے حجاج بن یوسف کو لکھا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، قَالَ كَتَبَ عَبْدُ الْمَلِكِ إِلَى الْحَجَّاجِ أَنْ لاَ يُخَالِفَ ابْنَ عُمَرَ فِي الْحَجِّ، فَجَاءَ ابْنُ عُمَرَ ـ رضى الله عنه ـ وَأَنَا مَعَهُ يَوْمَ عَرَفَةَ حِينَ زَالَتِ الشَّمْسُ، فَصَاحَ عِنْدَ سُرَادِقِ الْحَجَّاجِ، فَخَرَجَ وَعَلَيْهِ مِلْحَفَةٌ مُعَصْفَرَةٌ فَقَالَ مَا لَكَ يَا أَبَا عَبْدِ الرَّحْمَنِ فَقَالَ الرَّوَاحَ إِنْ كُنْتَ تُرِيدُ السُّنَّةَ‏.‏ قَالَ هَذِهِ السَّاعَةَ قَالَ نَعَمْ‏.‏ قَالَ فَأَنْظِرْنِي حَتَّى أُفِيضَ عَلَى رَأْسِي ثُمَّ أَخْرُجَ‏.‏ فَنَزَلَ حَتَّى خَرَجَ الْحَجَّاجُ، فَسَارَ بَيْنِي وَبَيْنَ أَبِي، فَقُلْتُ إِنْ كُنْتَ تُرِيدُ السُّنَّةَ فَاقْصُرِ الْخُطْبَةَ وَعَجِّلِ الْوُقُوفَ‏.‏ فَجَعَلَ يَنْظُرُ إِلَى عَبْدِ اللَّهِ، فَلَمَّا رَأَى ذَلِكَ عَبْدُ اللَّهِ قَالَ صَدَقَ‏.‏",
                "headingArabic": "التَّهْجِيرِ بِالرَّوَاحِ يَوْمَ عَرَفَةَ",
                "headingUrdu": "عرفہ کے دن دوپہر کو آگے بڑھنا",
                "headingEnglish": "To proceed at noon on the Day of 'Arafa",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1594,
                "hadithNumber": "1661",
                "englishNarrator": "Narrated Um Al-Fadl bint Al Harith رضی اللہ عنہا :",
                "hadithEnglish": "On the day of `Arafat, some people who were with me, differed about the fasting of the Prophet (ﷺ) some said that he was fasting while others said that he was not fasting. So I sent a bowl full of milk to him while he was riding his camel, and he drank that milk.",
                "hadithUrdu": "ان کے یہاں لوگوں کا عرفات کے دن رسول اللہ صلی اللہ علیہ وسلم کے روزے سے متعلق کچھ اختلاف ہو گیا ، بعض نے کہا کہ آپ صلی اللہ علیہ وسلم ( عرفہ کے دن ) روزے سے ہیں اور بعض کہتے ہیں کہ نہیں ، اس لیے انہوں نے آپ کے پاس دودھ کا ایک پیالہ بھیجا ، آنحضرت صلی اللہ علیہ وسلم اس وقت اونٹ پر سوا ہو کر عرفات میں وقوف فرما رہے تھے ، آپ نے وہ دودھ پی لیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک رحمہ اللہ نے ، ان سے ابوالنضر نے ، ان سے عبداللہ بن عباس رضی اللہ عنہما کے غلام عمیر نے ، ان سے ام فضل بنت حارث رضی اللہ عنہا نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، عَنْ عُمَيْرٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ الْعَبَّاسِ عَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ، أَنَّ نَاسًا، اخْتَلَفُوا عِنْدَهَا يَوْمَ عَرَفَةَ فِي صَوْمِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ بَعْضُهُمْ هُوَ صَائِمٌ‏.‏ وَقَالَ بَعْضُهُمْ لَيْسَ بِصَائِمٍ‏.‏ فَأَرْسَلَتْ إِلَيْهِ بِقَدَحِ لَبَنٍ وَهْوَ وَاقِفٌ عَلَى بَعِيرِهِ فَشَرِبَهُ‏.‏",
                "headingArabic": "الْوُقُوفِ عَلَى الدَّابَّةِ بِعَرَفَةَ",
                "headingUrdu": "عرفات میں سواری کے جانور پر ٹھہرنا",
                "headingEnglish": "Staying on oneâ€™s riding animal at 'Arafat",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1595,
                "hadithNumber": "1662",
                "englishNarrator": "Narrator Salim:",
                "hadithEnglish": "\"In the year when Al-Hajjaj bin Yusuf رضی اللہ عنہما attacked Ibn Az-Zubair, the former asked 'Abdullah (Ibn 'Umar رضی اللہ عنہما) what to do during the stay on the Day of 'Arafa (9th of Dhul-Hajjah). I said to him, \"If you want to follow the Sunna (the legal way of the Prophet (ﷺ)) you should offer the Salat just after midday on the Day of the 'Arafa. 'Abdullah bin 'Umar said, 'He (Salim) has spoken the truth.' \" They (the Companions of the Prophet (ﷺ)) used to offer the Zuhr and Asr prayer together according to the Sunna, I asked Salim, \"Did Allah's Messenger (ﷺ) do that ?\" Salim said, \"And in doing that do you (people) follow anything else except his (ﷺ) Sunna?\"",
                "hadithUrdu": "حجاج بن یوسف جس سال عبداللہ بن زبیر رضی اللہ عنہما سے لڑنے کے لیے مکہ میں اترا تو اس موقع پر اس نے عبداللہ بن عمر رضی اللہ عنہما سے پوچھا کہ عرفہ کے دن وقوف میں آپ کیا کرتے تھے ؟ اس پر سالم رحمہ اللہ بولے کہ اگر تو سنت پر چلنا چاہتا ہے تو عرفہ کے دن نماز دوپہر ڈھلتے ہی پڑھ لینا ۔ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ سالم نے سچ کہا ، صحابہ رضی اللہ عنہم آنحضرت صلی اللہ علیہ وسلم کی سنت کے مطابق ظہر اور عصر ایک ہی ساتھ پڑھتے تھے ۔ میں نے سالم سے پوچھا کہ کیا رسول اللہ صلی اللہ علیہ وسلم نے بھی اسی طرح کیا تھا ؟ سالم نے فرمایا اور کس کی سنت پر اس مسئلہ میں چلتے ہو ۔",
                "urduNarrator": "لیث نے بیان کیا کہ مجھ سے عقیل نے ابن شہاب سے بیان کیا ، انہوں نے کہا کہ مجھے سالم نے خبر دی کہ",
                "hadithArabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَالِمٌ، أَنَّ الْحَجَّاجَ بْنَ يُوسُفَ، عَامَ نَزَلَ بِابْنِ الزُّبَيْرِ ـ رضى الله عنهما ـ سَأَلَ عَبْدَ اللَّهِ ـ رضى الله عنه ـ كَيْفَ تَصْنَعُ فِي الْمَوْقِفِ يَوْمَ عَرَفَةَ فَقَالَ سَالِمٌ إِنْ كُنْتَ تُرِيدُ السُّنَّةَ فَهَجِّرْ بِالصَّلاَةِ يَوْمَ عَرَفَةَ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ صَدَقَ‏.‏ إِنَّهُمْ كَانُوا يَجْمَعُونَ بَيْنَ الظُّهْرِ وَالْعَصْرِ فِي السُّنَّةِ‏.‏ فَقُلْتُ لِسَالِمٍ أَفَعَلَ ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ سَالِمٌ وَهَلْ تَتَّبِعُونَ فِي ذَلِكَ إِلاَّ سُنَّتَهُ",
                "headingArabic": "الْجَمْعِ بَيْنَ الصَّلاَتَيْنِ بِعَرَفَةَ",
                "headingUrdu": "عرفات میں دو نمازیں ایک ساتھ ادا کرنا",
                "headingEnglish": "To offer the two Salat together at 'Arafat",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1596,
                "hadithNumber": "1663",
                "englishNarrator": "Narrated `Abdul-Malik bin Marwan wrote to Al-Hajjaj:",
                "hadithEnglish": "He should follow `Abdullah bin `Umar in all the ceremonies of Hajj. So when it was the Day of `Arafat (9th of Dhul-Hijja), and after the sun has deviated or has declined from the middle of the sky, I and Ibn `Umar came and he shouted near the cotton (cloth) tent of Al-Hajjaj, \"Where is he?\" Al-Hajjaj came out. Ibn `Umar رضی اللہ عنہما said, \"Let us proceed (to `Arafat).\" Al-Hajjaj asked, \"Just now?\" Ibn `Umarرضی اللہ عنہم ا replied, \"Yes.\" Al-Hajjaj said, \"Wait for me till I pour water on me (i.e. take a bath).\" So, Ibn `Umar  رضی اللہ عنہما dismounted (and waited) till Al-Hajjaj came out. He was walking between me and my father. I informed Al-Hajjaj, \"If you want to follow the Sunna today, then you should shorten the sermon and then hurry up for the stay (at `Arafat).\" Ibn `Umar said, \"He (Salim) has spoken the truth.\"",
                "hadithUrdu": "حج کے کاموں میں عبداللہ بن عمر رضی اللہ عنہما کی اقتداء کرے ۔ جب عرفہ کا دن آیا تو عبداللہ بن عمر رضی اللہ عنہما آئے میں بھی آپ کے ساتھ تھا ، سورج ڈھل چکا تھا ، آپ نے حجاج کے ڈیرے کے پاس آ کر بلند آواز سے کہا حجاج کہاں ہے ؟ حجاج باہر نکلا تو ابن عمر رضی اللہ عنہما نے فرمایا چل جلدی کر وقت ہو گیا ۔ حجاج نے کہا ابھی سے ؟ ابن عمر رضی اللہ عنہما نے فرمایا کہ ہاں ۔ حجاج بولا کہ پھر تھوڑی مہلت دے دیجئیے ، میں ابھی غسل کر کے آتا ہوں ۔ پھر حضرت عبداللہ بن عمر رضی اللہ عنہما ( اپنی سواری سے ) اتر گئے ۔ حجاج باہر نکلا اور میرے اور میرے والد ( ابن عمر ) کے بیچ میں چلنے لگا ، میں نے اس سے کہا کہ آج اگر سنت پر عمل کی خواہش ہے تو خطبہ مختصر پڑھ اور وقوف میں جلدی کر ۔ حضرت عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ سالم سچ کہتا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں سالم بن عبداللہ نے کہ عبدالملک بن مروان ( خلیفہ ) نے حجاج کو لکھا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ الْمَلِكِ بْنَ مَرْوَانَ، كَتَبَ إِلَى الْحَجَّاجِ أَنْ يَأْتَمَّ، بِعَبْدِ اللَّهِ بْنِ عُمَرَ فِي الْحَجِّ، فَلَمَّا كَانَ يَوْمُ عَرَفَةَ جَاءَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ وَأَنَا مَعَهُ حِينَ زَاغَتِ الشَّمْسُ أَوْ زَالَتْ، فَصَاحَ عِنْدَ فُسْطَاطِهِ أَيْنَ هَذَا فَخَرَحَ إِلَيْهِ فَقَالَ ابْنُ عُمَرَ الرَّوَاحَ‏.‏ فَقَالَ الآنَ قَالَ نَعَمْ‏.‏ قَالَ أَنْظِرْنِي أُفِيضُ عَلَىَّ مَاءً‏.‏ فَنَزَلَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ حَتَّى خَرَجَ، فَسَارَ بَيْنِي وَبَيْنَ أَبِي‏.‏ فَقُلْتُ إِنْ كُنْتَ تُرِيدُ أَنْ تُصِيبَ السُّنَّةَ الْيَوْمَ فَاقْصُرِ الْخُطْبَةَ وَعَجِّلِ الْوُقُوفَ‏.‏ فَقَالَ ابْنُ عُمَرَ صَدَقَ‏.‏",
                "headingArabic": "قَصْرِ الْخُطْبَةِ بِعَرَفَةَ",
                "headingUrdu": "عرفات کے دن خطبہ مختصر کرنا",
                "headingEnglish": "To shorten the Khutbah the Day of 'Arafat",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1597,
                "hadithNumber": "1664",
                "englishNarrator": "Narrated Muhammad bin Jubair bin Mut`im repotrt that his father:",
                "hadithEnglish": "\"(Before Islam) I was looking for my camel ..\" The same narration is told by a different sub-narrator. Jubair bin Mut`im said, \"My camel was lost and I went out in search of it on the day of `Arafat, and I saw the Prophet (ﷺ) standing in `Arafat. I said to myself: By Allah he is from the Hums (literally: strictly religious, Quraish were called so, as they used to say, 'We are the people of Allah we shall not go out of the sanctuary). What has brought him here?\"",
                "hadithUrdu": "میں اپنا ایک اونٹ تلاش کر رہا تھا ( دوسری سند ) اور ہم سے مسدد نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمر بن دینار نے ، انہوں نے محمد بن جبیر سے سنا کہ ان کے والد جبیر بن مطعم نے بیان کیا کہ میرا ایک اونٹ کھو گیا تھا تو میں عرفات میں اس کو تلاش کرنے گیا ، یہ دن عرفات کا تھا ، میں نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم عرفات کے میدان میں کھڑے ہیں ۔ میری زبان سے نکلا قسم اللہ کی ! یہ تو قریش ہیں پھر یہ یہاں کیوں ہیں ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے عمرو بن دینار نے بیان کیا ، کہا ہم سے محمد بن جبیر بن مطعم نے ، ان سے ان کے باپ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرٌو، حَدَّثَنَا مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ، كُنْتُ أَطْلُبُ بَعِيرًا لِي‏.‏ وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ مُحَمَّدَ بْنَ جُبَيْرٍ، عَنْ أَبِيهِ، جُبَيْرِ بْنِ مُطْعِمٍ قَالَ أَضْلَلْتُ بَعِيرًا لِي، فَذَهَبْتُ أَطْلُبُهُ يَوْمَ عَرَفَةَ، فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَاقِفًا بِعَرَفَةَ، فَقُلْتُ هَذَا وَاللَّهِ مِنَ الْحُمْسِ فَمَا شَأْنُهُ هَا هُنَا.",
                "headingArabic": "الْوُقُوفِ بِعَرَفَةَ",
                "headingUrdu": "عرفات میں قیام",
                "headingEnglish": "The staying at 'Arafat",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1598,
                "hadithNumber": "1665",
                "englishNarrator": "Narrated `Urwa رضی اللہ عنہ :",
                "hadithEnglish": "During the Pre-Islamic period of Ignorance, the people used to perform Tawaf of the Ka`ba naked except the Hums; and the Hums were Quraish and their offspring. The Hums used to give clothes to the men who would perform the Tawaf wearing them; and women (of the Hums) used to give clothes to the women who would perform the Tawaf wearing them. Those to whom the Hums did not give clothes would perform Tawaf round the Ka`ba naked. Most of the people used to go away (disperse) directly from `Arafat but they (Hums) used to depart after staying at Al-Muzdalifa. `Urwa added, \"My father narrated that `Aisha had said, 'The following verses were revealed about the Hums: Then depart from the place whence all the people depart--(2.199) `Urwa added, \"They (the Hums) used to stay at Al-Muzdalifa and used to depart from there (to Mina) and so they were sent to `Arafat (by Allah's order).\"",
                "hadithUrdu": "حمس کے سوا بقیہ سب لوگ جاہلیت میں ننگے ہو کر طواف کرتے تھے ، حمس قریش اور اس کی آل اولاد کو کہتے تھے ، ( اور بنی کنانہ وغیرہ ، جیسے خزاعہ ) لوگوں کو ( اللہ کے واسطے ) کپڑے دیا کرتے تھے ۔ ( قریش ) کے مرد دوسرے مردوں کو تاکہ انہیں پہن کر طواف کر سکیں اور ( قریش کی ) عورتیں دوسری عورتوں کو تاکہ وہ انہیں پہن کر طواف کر سکیں ، اور جن کو قریش کپڑا نہیں دیتے وہ بیت اللہ کا طواف ننگے ہو کر کرتے ۔ دوسرے سب لوگ تو عرفات سے واپس ہوتے لیکن قریش مزدلفہ ہی سے ( جو حرم میں تھا ) واپس ہو جاتے ۔ ہشام بن عروہ نے کہا کہ میرے باپ عروہ بن زبیر نے مجھے ام المؤمنین حضرت عائشہ رضی اللہ عنہا سے خبر دی کہ یہ آیت قریش کے بارے میں نازل ہوئی کہ ” پھر تم بھی ( قریش ) وہیں سے واپس آؤ جہاں سے اور لوگ واپس آتے ہیں “ ( یعنی عرفات سے ، سورۃ البقرہ ) انہوں نے بیان کیا کہ قریش مزدلفہ ہی سے لوٹ آتے تھے اس لیے انہیں بھی عرفات سے لوٹنے کا حکم ہوا ۔",
                "urduNarrator": "ہم سے فروہ بن ابی المغراء نے بیان کیا ، انہوں نے کہا کہ ہم سے علی بن مسہر نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے عروہ بن زبیر رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، قَالَ عُرْوَةُ كَانَ النَّاسُ يَطُوفُونَ فِي الْجَاهِلِيَّةِ عُرَاةً إِلاَّ الْحُمْسَ، وَالْحُمْسُ قُرَيْشٌ وَمَا وَلَدَتْ، وَكَانَتِ الْحُمْسُ يَحْتَسِبُونَ عَلَى النَّاسِ يُعْطِي الرَّجُلُ الرَّجُلَ الثِّيَابَ يَطُوفُ فِيهَا، وَتُعْطِي الْمَرْأَةُ الْمَرْأَةَ الثِّيَابَ تَطُوفُ فِيهَا، فَمَنْ لَمْ يُعْطِهِ الْحُمْسُ طَافَ بِالْبَيْتِ عُرْيَانًا، وَكَانَ يُفِيضُ جَمَاعَةُ النَّاسِ مِنْ عَرَفَاتٍ، وَيُفِيضُ الْحُمْسُ مِنْ جَمْعٍ‏.‏ قَالَ وَأَخْبَرَنِي أَبِي عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ هَذِهِ الآيَةَ نَزَلَتْ فِي الْحُمْسِ ‏{‏ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ‏}‏ قَالَ كَانُوا يُفِيضُونَ مِنْ جَمْعٍ فَدُفِعُوا إِلَى عَرَفَاتٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1599,
                "hadithNumber": "1666",
                "englishNarrator": "Narrated `Urwa:",
                "hadithEnglish": "Usama رضی اللہ عنہما was asked in my presence, \"How was the speed of (the camel of) Allah's Messenger (ﷺ) while departing from `Arafat during the Hajjatul Wada`?\" Usama replied, \"The Prophet (ﷺ) proceeded on with a modest pace, and when there was enough space he would (make his camel) go very fast.\"  Hisham said: \"Naas\" means quicker than \"Anaq\". Hadrat Abu Abdullah said: \"Fajwah\" means very fast ground. Its plural is \"Fajawaat\" and \"Fija\" as is \"Rekwah\" and Rika.  \"Manaas\" here does not mean to flee.",
                "hadithUrdu": "اسامہ بن زید رضی اللہ عنہما سے کسی نے پوچھا ( میں بھی وہیں موجود تھا ) کہ حجۃ الوداع کے موقع پر عرفات سے رسول اللہ صلی اللہ علیہ وسلم کے واپس ہونے کی چال کیا تھی ؟ انہوں نے جواب دیا کہ آپ صلی اللہ علیہ وسلم پاؤں اٹھا کر چلتے تھے ذرا تیز ، لیکن جب جگہ پاتے ( ہجوم نہ ہوتا ) تو تیز چلتے تھے ، ہشام نے کہا کہ «عنق‏» تیز چلنا اور «نص» «عنق‏» سے زیادہ تیز چلنے کو کہتے ہیں ۔ «فجوة» کے معنی کشادہ جگہ ، اس کی جمع «فجوات» اور «فجاء» ہے جیسے زکوٰۃ مفرد «زكاء‏» اس کی جمع اور سورۃ ص میں «مناص» کا جو لفظ آیا ہے اس کے معنی بھاگنا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، کہا ہم کو امام مالک نے ہشام بن عروہ سے خبر دی ، ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ سُئِلَ أُسَامَةُ وَأَنَا جَالِسٌ، كَيْفَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَسِيرُ فِي حَجَّةِ الْوَدَاعِ حِينَ دَفَعَ قَالَ كَانَ يَسِيرُ الْعَنَقَ، فَإِذَا وَجَدَ فَجْوَةً نَصَّ‏.‏ قَالَ هِشَامٌ وَالنَّصُّ فَوْقَ الْعَنَقِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ فَجْوَةٌ مُتَّسَعٌ، وَالْجَمِيعُ فَجَوَاتٌ وَفِجَاءٌ، وَكَذَلِكَ رَكْوَةٌ وَرِكَاءٌ‏.‏ مَنَاصٌ لَيْسَ حِينَ فِرَارٍ‏.‏",
                "headingArabic": "السَّيْرِ إِذَا دَفَعَ مِنْ عَرَفَةَ",
                "headingUrdu": "عرفات سے روانہ ہوتے وقت ایک کی رفتار",
                "headingEnglish": "Oneâ€™s speed while one is departing from 'Arafat",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1600,
                "hadithNumber": "1667",
                "englishNarrator": "Narrated Usama bin Zaid رضی اللہ عنہما :",
                "hadithEnglish": "When the prophet (ﷺ) returned from Arafat, he proceeded towards a pass and after relieving himself, he performed ablution. I said: O Allah's Apostle ! Will you perform the prayer? He said: Prayer is ahead of you (i.e. at asked, \"O Allah's Messenger (ﷺ)! Will you offer the prayer here?\" He replied, \"(The place of) the prayer is ahead of you (i.e. at Al-Muzdalifa).\"",
                "hadithUrdu": "جب رسول کریم صلی اللہ علیہ وسلم عرفات سے واپس ہوئے تھے تو آپ صلی اللہ علیہ وسلم ( راہ میں ) ایک گھاٹی کی طرف مڑے اور وہاں قضائے حاجت کی پھر آپ صلی اللہ علیہ وسلم نے وضو کیا تو میں نے پوچھا یا رسول اللہ ! کیا ( آپ صلی اللہ علیہ وسلم مغرب کی ) نماز پڑھیں گے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا نماز آگے چل کر پڑھی جائے گی ۔ ( یعنی عرفات سے مزدلفہ آتے ہوئے قضائے حاجت وغیرہ کے لیے راستہ میں رکنے میں کوئی حرج نہیں ہے ) ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے یحییٰ بن سعید نے ، ان سے موسیٰ بن عقبہ نے ان سے عبداللہ بن عباس رضی اللہ عنہما کے غلام کریب نے اور ان سے اسامہ بن زید رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم حَيْثُ أَفَاضَ مِنْ عَرَفَةَ مَالَ إِلَى الشِّعْبِ فَقَضَى حَاجَتَهُ فَتَوَضَّأَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَتُصَلِّي فَقَالَ ‏ \"‏ الصَّلاَةُ أَمَامَكَ ‏\"‏‏.‏",
                "headingArabic": "النُّزُولِ بَيْنَ عَرَفَةَ وَجَمْعٍ",
                "headingUrdu": "عرفات اور جام کے درمیان اترنا",
                "headingEnglish": "To dismount between 'Arafat and Jam'",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1601,
                "hadithNumber": "1668",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "`Abdullah bin `Umar رضی اللہ عنہما used to offer the Maghrib and `Isha' prayers together at Jam' (Al-Muzdalifa). But he used to pass by that mountain pass where Allah's Messenger (ﷺ) went, and he would enter it and answer the call of nature and perform ablution, and would not offer any prayer till he had prayed at Jam.'",
                "hadithUrdu": "عبداللہ بن عمر رضی اللہ عنہما مزدلفہ میں آ کر نماز مغرب اور عشاء ملا کر ایک ساتھ پڑھتے ، البتہ آپ اس گھاٹی میں بھی مڑتے جہاں رسول اللہ صلی اللہ علیہ وسلم مڑے تھے ۔ وہاں آپ قضائے حاجت کرتے پھر وضو کرتے لیکن نماز نہ پڑھتے ، نماز آپ مزدلفہ میں آ کر پڑھتے تھے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا کہ ہم سے جویریہ نے نافع سے بیان کیا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، قَالَ كَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ ـ رضى الله عنهما ـ يَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ بِجَمْعٍ، غَيْرَ أَنَّهُ يَمُرُّ بِالشِّعْبِ الَّذِي أَخَذَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَيَدْخُلُ فَيَنْتَفِضُ وَيَتَوَضَّأُ، وَلاَ يُصَلِّي حَتَّى يُصَلِّيَ بِجَمْعٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1576,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=63",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=61",
                "label": "61",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=62",
                "label": "62",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=63",
                "label": "63",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=64",
                "label": "64",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=65",
                "label": "65",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=66",
                "label": "66",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=67",
                "label": "67",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=65",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=65",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=63",
        "to": 1600,
        "total": 40465
    }
}