{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 262,
        "data": [
            {
                "id": 6530,
                "hadithNumber": "6800",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) cut off the hand of a lady, and that lady used to come to me, and I used to convey her message to the Prophet (ﷺ) and she repented, and her repentance was sincere.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک عورت کا ہاتھ کٹوایا ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ وہ عورت بعد میں بھی آتی تھی اور میں اس کی ضرورتیں حضور اکرم صلی اللہ علیہ وسلم کے سامنے رکھتی تھی ۔ اس عورت نے توبہ کر لی تھی اور حسن توبہ کا ثبوت دیا تھا ۔",
                "urduNarrator": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے ابن وہب نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَطَعَ يَدَ امْرَأَةٍ‏.‏ قَالَتْ عَائِشَةُ وَكَانَتْ تَأْتِي بَعْدَ ذَلِكَ، فَأَرْفَعُ حَاجَتَهَا إِلَى النَّبِيِّ صلى الله عليه وسلم فَتَابَتْ وَحَسُنَتْ تَوْبَتُهَا‏.‏",
                "headingArabic": "تَوْبَةِ السَّارِقِ",
                "headingUrdu": "چور کی توبہ",
                "headingEnglish": "The repentance of a thief",
                "chapterId": "87",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 87,
                    "chapterNumber": "87",
                    "chapterEnglish": "Limits and Punishments set by Allah (Hudood)",
                    "chapterUrdu": "حد اور سزاؤں کے بیان میں",
                    "chapterArabic": "كتاب الحدود",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6531,
                "hadithNumber": "6801",
                "englishNarrator": "Narrated Ubada bin As-Samit رضی اللہ عنہ :",
                "hadithEnglish": "I gave the pledge of allegiance to the Prophet (ﷺ) with a group of people, and he said, \"I take your pledge that you will not worship anything besides Allah, will not steal, will not commit infanticide, will not slander others by forging false statements and spreading it, and will not disobey me in anything good. And whoever among you fulfill all these (obligations of the pledge), his reward is with Allah. And whoever commits any of the above crimes and receives his legal punishment in this world, that will be his expiation and purification. But if Allah screens his sin, it will be up to Allah, Who will either punish or forgive him according to His wish.\" Abu `Abdullah said: \"If a thief repents after his hand has been cut off, the his witness well be accepted. Similarly, if any person upon whom any legal punishment has been inflicted, repents, his witness will be accepted.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے ایک جماعت کے ساتھ بیعت کی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ میں تم سے عہد لیتا ہوں کہ تم اللہ کا کسی کو شریک نہیں ٹھہراؤ گے ، تم چوری نہیں کرو گے ، اپنی اولاد کی جان نہیں لو گے ، اپنے دل سے گھڑکر کسی پر تہمت نہیں لگاؤ گے اور نیک کاموں میں میری نافرمانی نہ کرو گے ۔ پس تم میں سے جو کوئی وعدے پورا کرے گا اس کا ثواب اللہ کے اوپر لازم ہے اور جو کوئی ان میں سے کچھ غلطی کرگزرے گا اور دنیا میں ہی اسے اس کی سزا مل جائے گی تو یہ اس کا کفارہ ہو گی اور اسے پاک کرنے والی ہو گی اور جس کی غلطی کو اللہ چھپالے گا تو اس کا معاملہ اللہ کے ساتھ ہے ، چاہے تو اسے عذاب دے اور چاہے تو اس کی مغفرت کر دے ۔ ابوعبداللہ امام بخاری رحمہ اللہ نے کہا کہ ہاتھ کٹنے کے بعد اگر چور نے توبہ کر لی تو اس کی گواہی قبول ہو گی ۔ یہی حال ہر اس شخص کا ہے جس پر حد جاری کی گئی ہو کہ اگر وہ توبہ کر لے گا تو اس کی گواہی قبول کی جائے گی ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد الجعفی نے بیان کیا ، انہوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں ابوادریس نے اور ان سے عبادہ بن الصامت رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ ـ رضى الله عنه ـ قَالَ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي رَهْطٍ، فَقَالَ ‏ \"‏ أُبَايِعُكُمْ عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا، وَلاَ تَسْرِقُوا، وَلاَ تَقْتُلُوا أَوْلاَدَكُمْ، وَلاَ تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ، وَلاَ تَعْصُونِي فِي مَعْرُوفٍ، فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَأُخِذَ بِهِ فِي الدُّنْيَا فَهْوَ كَفَّارَةٌ لَهُ وَطَهُورٌ، وَمَنْ سَتَرَهُ اللَّهُ فَذَلِكَ إِلَى اللَّهِ، إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ غَفَرَ لَهُ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ إِذَا تَابَ السَّارِقُ بَعْدَ مَا قُطِعَ يَدُهُ، قُبِلَتْ شَهَادَتُهُ، وَكُلُّ مَحْدُودٍ كَذَلِكَ إِذَا تَابَ قُبِلَتْ شَهَادَتُهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "87",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 87,
                    "chapterNumber": "87",
                    "chapterEnglish": "Limits and Punishments set by Allah (Hudood)",
                    "chapterUrdu": "حد اور سزاؤں کے بیان میں",
                    "chapterArabic": "كتاب الحدود",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6532,
                "hadithNumber": "6802",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Some people from the tribe of `Ukl came to the Prophet (ﷺ) and embraced Islam. The climate of Medina did not suit them, so the Prophet (ﷺ) ordered them to go to the (herd of milch) camels of charity and to drink, their milk and urine (as a medicine). They did so, and after they had recovered from their ailment (became healthy) they turned renegades (reverted from Islam) and killed the shepherd of the camels and took the camels away. The Prophet (ﷺ) sent (some people) in their pursuit and so they were (caught and) brought, and the Prophets ordered that their hands and legs should be cut off and that their eyes should be branded with heated pieces of iron, and that their cut hands and legs should not be cauterized, till they die.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے پاس قبیلہ عکل کے چند لوگ آئے اور اسلام قبول کیا لیکن مدینہ کی آب و ہوا انہیں موافق نہیں آئی ( ان کے پیٹ پھول گئے ) تو آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ صدقہ کے اونٹوں کے ریوڑ میں جائیں اور ان کا پیشاب اور دودھ ملاکرپئیں ۔ انہوں نے اس کے مطابق عمل کیا اور تندرست ہو گئے لیکن اس کے بعد وہ مرتد ہو گئے اور ان اونٹوں کے چراہوں کو قتل کر کے اونٹ ہنکالے گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان کی تلاش میں سوار بھیجے اور انہیں پکڑ کے لایا گیا پھر ان کے ہاتھ پاؤں کاٹ دئیے گئے اور ان کی آنکھیں پھوڑ دی گئیں ( کیونکہ انہوں نے اسلامی چرواہے کے ساتھ ایسا ہی برتاؤ کیا تھا ) اور ان کے زخموں پر داغ نہیں لگوایا گیا یہاں تک کہ وہ مرگئے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے ولید بن مسلم نے بیان کیا ،الاوزاعی نے بیان کیا، مجھ سے یحییٰ بن ابی کثیر نے بیان کیا، کہا کہ مجھ سے ابوقلابہ جرمی نے بیان کیا ، ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو قِلاَبَةَ الْجَرْمِيُّ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَدِمَ عَلَى النَّبِيِّ صلى الله عليه وسلم نَفَرٌ مِنْ عُكْلٍ، فَأَسْلَمُوا فَاجْتَوَوُا الْمَدِينَةَ، فَأَمَرَهُمْ أَنْ يَأْتُوا إِبِلَ الصَّدَقَةِ، فَيَشْرَبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا، فَفَعَلُوا فَصَحُّوا، فَارْتَدُّوا وَقَتَلُوا رُعَاتَهَا وَاسْتَاقُوا، فَبَعَثَ فِي آثَارِهِمْ فَأُتِيَ بِهِمْ، فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْ، ثُمَّ لَمْ يَحْسِمْهُمْ حَتَّى مَاتُوا‏.‏",
                "headingArabic": "المحاربين من أهل الكفر والردة",
                "headingUrdu": "کافروں اور منکرین سے جنگ کرنے والوں کا باب",
                "headingEnglish": "The chapter of those who wage war from the people who are disbelievers and those turned renegades",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6533,
                "hadithNumber": "6803",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) cut off the hands and feet of the men belonging to the tribe of `Uraina and did not cauterise (their bleeding limbs) till they died.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے عرینیوں کے ( ہاتھ پاؤں ) کٹوا دئیے لیکن ان پر داغ نہیں لگوایا ۔ یہاں تک کہ وہ مرگئے ۔",
                "urduNarrator": "ہم سے ابویعلیٰ محمد بن صلت نے بیان کیا ، کہا ہم سے ولید نے بیان کیا ، کہا مجھ سے اوزاعی نے بیان کیا ، ان سے یحییٰ نے ، ان سے ابوقلابہ نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ أَبُو يَعْلَى، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنِي الأَوْزَاعِيُّ، عَنْ يَحْيَى، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَطَعَ الْعُرَنِيِّينَ وَلَمْ يَحْسِمْهُمْ حَتَّى مَاتُوا‏.‏",
                "headingArabic": "لَمْ يَحْسِمِ النَّبِيُّ صلى الله عليه وسلم الْمُحَارِبِينَ مِنْ أَهْلِ الرِّدَّةِ حَتَّى هَلَكُوا‏.‏",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے جنگ کرنے والوں اور نافرمانوں کو داغدار نہیں کیا۔",
                "headingEnglish": "The Prophet (saws) did not cauterize those who fought and of those who were renegades",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6534,
                "hadithNumber": "6804",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "A group of people from `Ukl (tribe) came to the Prophet (ﷺ) and they were living with the people of As- Suffa, but they became ill as the climate of Medina did not suit them, so they said, \"O Allah's Messenger (ﷺ)! Provide us with milk.\" The Prophet (ﷺ) said, I see no other way for you than to use the camels of Allah's Apostle.\" So they went and drank the milk and urine of the camels, (as medicine) and became healthy and fat. Then they killed the shepherd and took the camels away. When a help-seeker came to Allah's Apostle, he sent some men in their pursuit, and they were captured and brought before mid day. The Prophet ordered for some iron pieces to be made red hot, and their eyes were branded with them and their hands and feet were cut off and were not cauterized. Then they were put at a place called Al- Harra, and when they asked for water to drink they were not given till they died. (Abu Qilaba said, \"Those people committed theft and murder and fought against Allah and His Apostle.\")",
                "hadithUrdu": "قبیلہ عکل کے کچھ لوگ نبی کریم صلی اللہ علیہ وسلم کے پاس سنہ۶ھ میں آئے اور یہ لوگ مسجد کے سائبان میں ٹھہرے ۔ مدینہ منورہ کی آب و ہوا انہیں موافق نہیں آئی ۔ انہوں نے کہا یا رسول اللہ ! ہمارے لیے دودھ کہیں سے مہیا کرا دیں ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ تو میرے پاس نہیں ہے ۔ البتہ تم لوگ ہمارے اونٹوں میں چلے جاؤ ۔ چنانچہ وہ آئے اور ان کا دودھ اور پیشاب پیا اور صحت مند ہو کر موٹے تازے ہو گئے ۔ پھر انہوں نے چرواہے کو قتل کر دیا اور اونٹوں کو ہنکالے گئے ۔ اتنے میں آنحضرت صلی اللہ علیہ وسلم کے پاس فریادی پہنچا اور آنحضرت صلی اللہ علیہ وسلم نے ان کی تلاش میں سوار بھیجے ۔ ابھی دھوپ زیادہ پھیلی بھی نہیں تھی کہ انہیں پکڑ کر لایا گیا پھر آنحضرت صلی اللہ علیہ وسلم کے حکم سے سلائیاں گرم کی گئیں اور ان کی آنکھوں میں پھیر دی گئیں اور ان کے ہاتھ پاؤں کاٹ دئیے گئے اور ان کے ( زخم سے خون کو روکنے کے لیے ) انہیں داغا بھی نہیں گیا ۔ اس کے بعد وہ ” حرہ “ ( مدینہ کی پتھریلی زمین ) میں ڈال دئیے گئے ، وہ پانی مانگتے تھے لیکن انہیں پانی نہیں دیا گیا ۔ یہاں تک کہ وہ مر گئے ۔ ابوقلابہ نے کہا کہ یہ اس وجہ سے کیا گیا تھا کہ انہوں نے چوری کی تھی ، قتل کیا تھا اور اللہ اور اس کے رسول سے غدارانہ لڑائی لڑی تھی ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، ان سے وہیب بن خالد نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے ابوقلابہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، عَنْ وُهَيْبٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَدِمَ رَهْطٌ مِنْ عُكْلٍ عَلَى النَّبِيِّ صلى الله عليه وسلم كَانُوا فِي الصُّفَّةِ، فَاجْتَوَوُا الْمَدِينَةَ فَقَالُوا يَا رَسُولَ اللَّهِ أَبْغِنَا رِسْلاً‏.‏ فَقَالَ ‏ \"‏ مَا أَجِدُ لَكُمْ إِلاَّ أَنْ تَلْحَقُوا بِإِبِلِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏‏.‏ فَأَتَوْهَا فَشَرِبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا حَتَّى صَحُّوا وَسَمِنُوا، وَقَتَلُوا الرَّاعِيَ وَاسْتَاقُوا الذَّوْدَ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم الصَّرِيخُ، فَبَعَثَ الطَّلَبَ فِي آثَارِهِمْ، فَمَا تَرَجَّلَ النَّهَارُ حَتَّى أُتِيَ بِهِمْ، فَأَمَرَ بِمَسَامِيرَ فَأُحْمِيَتْ فَكَحَلَهُمْ وَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ، وَمَا حَسَمَهُمْ، ثُمَّ أُلْقُوا فِي الْحَرَّةِ يَسْتَسْقُونَ فَمَا سُقُوا حَتَّى مَاتُوا‏.‏ قَالَ أَبُو قِلاَبَةَ سَرَقُوا وَقَتَلُوا وَحَارَبُوا اللَّهَ وَرَسُولَهُ‏.‏",
                "headingArabic": "لَمْ يُسْقَ الْمُرْتَدُّونَ الْمُحَارِبُونَ حَتَّى مَاتُوا",
                "headingUrdu": "منحرف ہونے اور لڑنے والوں کو پانی نہیں دیا گیا، یہاں تک کہ وہ مر گئے۔",
                "headingEnglish": "No water was given to those turned renegades and fought, till they died",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6535,
                "hadithNumber": "6805",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "A group of people from `Ukl (or `Uraina) tribe ----but I think he said that they were from `Ukl came to Medina and (they became ill, so) the Prophet (ﷺ) ordered them to go to the herd of (Milch) she-camels and told them to go out and drink the camels' urine and milk (as a medicine). So they went and drank it, and when they became healthy, they killed the shepherd and drove away the camels. This news reached the Prophet (ﷺ) early in the morning, so he sent (some) men in their pursuit and they were captured and brought to the Prophet (ﷺ) before midday. He ordered to cut off their hands and legs and their eyes to be branded with heated iron pieces and they were thrown at Al-Harra, and when they asked for water to drink, they were not given water. (Abu Qilaba said, \"Those were the people who committed theft and murder and reverted to disbelief after being believers (Muslims), and fought against Allah and His Apostle\").",
                "hadithUrdu": "قبیلہ عکل یا عرینہ کے چند لوگ میں سمجھتا ہوں عکل کا لفظ کہا ، مدینہ آئے اور آنحضرت صلی اللہ علیہ وسلم نے ان کے لیے دودھ دینے والی اونٹنیوں کا انتظام کر دیا اور فرمایا کہ وہ اونٹوں کے گلہ میں جائیں اور ان کا پیشاب اور دودھ پئیں ۔ چنانچہ انہوں نے پیا اور جب وہ تندرست ہو گئے تو چرواہے کو قتل کر دیا اور اونٹوں کو ہنکالے گئے ۔ آنحضرت صلی اللہ علیہ وسلم کے پاس یہ خبر صبح کے وقت پہنچی تو آپ نے ان کے پیچھے سوار دوڑائے ۔ ابھی دھوپ زیادہ پھیلی بھی نہیں تھی کہ وہ پکڑ کر لائے گئے ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم کے حکم سے ان کے بھی ہاتھ پاؤں کاٹ دئیے گئے اور ان کی بھی آنکھوں میں سلائی پھیر دی گئی اور انہیں ” حرہ “ میں ڈال دیا گیا ۔ وہ پانی مانگتے تھے لیکن انہیں پانی نہیں دیا جاتا تھا ۔ ابوقلابہ نے کہا کہ یہ وہ لوگ تھے جنہوں نے چوری کی تھی ، قتل کیا تھا ، ایمان کے بعد کفر اختیار کیا تھا اور اللہ اور اس کے رسول سے غدارانہ لڑائی لڑی تھی ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے ابوقلابہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَهْطًا، مِنْ عُكْلٍ ـ أَوْ قَالَ عُرَيْنَةَ وَلاَ أَعْلَمُهُ إِلاَّ قَالَ مِنْ عُكْلٍ ـ قَدِمُوا الْمَدِينَةَ، فَأَمَرَ لَهُمُ النَّبِيُّ صلى الله عليه وسلم بِلِقَاحٍ، وَأَمَرَهُمْ أَنْ يَخْرُجُوا فَيَشْرَبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا، فَشَرِبُوا حَتَّى إِذَا بَرِئُوا قَتَلُوا الرَّاعِيَ وَاسْتَاقُوا النَّعَمَ، فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم غُدْوَةً فَبَعَثَ الطَّلَبَ فِي إِثْرِهِمْ، فَمَا ارْتَفَعَ النَّهَارُ حَتَّى جِيءَ بِهِمْ، فَأَمَرَ بِهِمْ فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَرَ أَعْيُنَهُمْ، فَأُلْقُوا بِالْحَرَّةِ يَسْتَسْقُونَ فَلاَ يُسْقَوْنَ‏.‏ قَالَ أَبُو قِلاَبَةَ هَؤُلاَءِ قَوْمٌ سَرَقُوا، وَقَتَلُوا، وَكَفَرُوا بَعْدَ إِيمَانِهِمْ، وَحَارَبُوا اللَّهَ وَرَسُولَهُ‏.‏",
                "headingArabic": "سَمْرِ النَّبِيِّ صلى الله عليه وسلم أَعْيُنَ الْمُحَارِبِينَ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے لڑنے والوں کی آنکھوں پر داغ دیا۔",
                "headingEnglish": "The Prophet (saws) branded the eyes of those who fought",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6536,
                "hadithNumber": "6806",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Seven (people) will be shaded by Allah by His Shade on the Day of Resurrection when there will be no shade except His Shade. (They will be), a just ruler, a young man who has been brought up in the worship of Allah, a man who remembers Allah in seclusion and his eyes are then flooded with tears, a man whose heart is attached to mosques (offers his compulsory congregational prayers in the mosque), two men who love each other for Allah's Sake, a man who is called by a charming lady of noble birth to commit illegal sexual intercourse with her, and he says, 'I am afraid of Allah,' and (finally), a man who gives in charity so secretly that his left hand does not know what his right hand has given.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا سات آدمی ایسے ہیں جنہیں اللہ تعالیٰ قیامت کے دن اپنے عرش کے نیچے سایہ دے گا جبکہ اس کے عرش کے سایہ کے سوا اور کوئی سایہ نہیں ہو گا ۔ عادل حاکم ، نوجوان جس نے اللہ کی عبادت میں جوانی پائی ، ایسا شخص جس نے اللہ کو تنہائی میں یاد کیا اور اس کی آنکھوں سے آنسو نکل پڑے ، وہ شخص جس کا دل مسجد میں لگارہتا ہے ۔ وہ آدمی جو اللہ کے لیے محبت کرتے ہیں ۔ وہ شخص جسے کسی بلند مرتبہ اور خوبصورت عورت نے اپنی طرف بلایا اور اس نے جواب دیا کہ میں اللہ سے ڈرتا ہوں اور وہ شخص جس نے اتنا پوشیدہ صدقہ کیا کہ اس کے بائیں ہاتھ کو بھی پتہ نہ چل سکا کہ دائیں نے کتنا اور کیا صدقہ کیا ہے ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں عبیداللہ بن عمر عمری نے ، انہیں خبیب بن عبدالرحمٰن نے ، انہیں حفص بن عاصم نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ سَبْعَةٌ يُظِلُّهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ فِي ظِلِّهِ، يَوْمَ لاَ ظِلَّ إِلاَّ ظِلُّهُ إِمَامٌ عَادِلٌ، وَشَابٌّ نَشَأَ فِي عِبَادَةِ اللَّهِ، وَرَجُلٌ ذَكَرَ اللَّهَ فِي خَلاَءٍ فَفَاضَتْ عَيْنَاهُ، وَرَجُلٌ قَلْبُهُ مُعَلَّقٌ فِي الْمَسْجِدِ، وَرَجُلاَنِ تَحَابَّا فِي اللَّهِ، وَرَجُلٌ دَعَتْهُ امْرَأَةٌ ذَاتُ مَنْصِبٍ وَجَمَالٍ إِلَى نَفْسِهَا قَالَ إِنِّي أَخَافُ اللَّهَ‏.‏ وَرَجُلٌ تَصَدَّقَ بِصَدَقَةٍ فَأَخْفَاهَا، حَتَّى لاَ تَعْلَمَ شِمَالُهُ مَا صَنَعَتْ يَمِينُهُ ‏\"‏‏.‏",
                "headingArabic": "فَضْلِ مَنْ تَرَكَ الْفَوَاحِشَ",
                "headingUrdu": "اس شخص کی فضیلت جو الفوایش کو چھوڑتا ہے۔",
                "headingEnglish": "The superiority of the person who leaves Al-Fawahish",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6537,
                "hadithNumber": "6807",
                "englishNarrator": "Narrated Sahl bin Sa`d:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever guarantees me (the chastity of) what is between his legs (i.e. his private parts), and what is between his jaws (i.e., his tongue), I guarantee him Paradise.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے مجھے اپنے دونوں پاؤں کے درمیان یعنی ( شرمگاہ ) کی اور اپنے دونوں جبڑوں کے درمیان ( یعنی زبان ) کی ضمانت دے دی تو میں اسے جنت میں جانے کا بھروسہ دلاتا ہوں ۔",
                "urduNarrator": "ہم سے محمد بن ابی بکر نے بیان کیا ، کہا ہم سے عمر بن علی نے بیان کیا ۔ ( دوسری سند امام بخاری نے کہا ) اور مجھ سے خلیفہ بن حیاط نے بیان کیا ، ان سے عمر بن علی نے ، ان سے ابوحازم سلمہ بن دینار نے بیان کیا ، ان سے سہل بن سعد ساعدی نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ‏.‏ وَحَدَّثَنِي خَلِيفَةُ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ تَوَكَّلَ لِي مَا بَيْنَ رِجْلَيْهِ وَمَا بَيْنَ لَحْيَيْهِ، تَوَكَّلْتُ لَهُ بِالْجَنَّةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6538,
                "hadithNumber": "6808",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "I will narrate to you a narration which nobody will narrate to you after me. I heard that from the Prophet. I heard the Prophet (ﷺ) saying, \"The Hour will not be established\" or said: \"From among the portents of the Hour is that the religious knowledge will betaken away (by the death of religious Scholars) and general ignorance (of religion) will appear; and the drinking of alcoholic drinks will be very common, and (open) illegal sexual intercourse will prevail, and men will decrease in number while women will increase so much so that, for fifty women there will only be one man to look after them.\"",
                "hadithUrdu": "میں تم سے ایک ایسی حدیث بیان کروں گا کہ میرے بعد کوئی اسے نہیں بیان کرے گا ۔ میں نے یہ حدیث نبی کریم صلی اللہ علیہ وسلم سے سنی ہے ۔ میں نے آنحضرت صلی اللہ علیہ وسلم کو یہ کہتے سنا کہ قیامت اس وقت تک قائم نہیں ہو گی یا یوں فرمایا کہ قیامت کی نشانیوں میں سے یہ ہے کہ علم دین دنیا سے اٹھ جائے گا اور جہالت پھیل جائے گی ، شراب بکثرت پی جانے لگے گی اور زنا پھیل جائے گا ۔ مرد کم ہو جائیں گے اور عورتوں کی کثرت ہو گی ۔ حالت یہاں تک پہنچ جائے گی کہ پچاس عورتوں پر ایک ہی خبر لینے والا مرد رہ جائے گا ۔",
                "urduNarrator": "ہمیں داؤد بن شبیب نے خبر دی ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے ، کہا ہم کو حضرت انس رضی اللہ عنہ نے خبر دی ہے کہ",
                "hadithArabic": "أَخْبَرَنَا دَاوُدُ بْنُ شَبِيبٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، أَخْبَرَنَا أَنَسٌ، قَالَ لأُحَدِّثَنَّكُمْ حَدِيثًا لاَ يُحَدِّثُكُمُوهُ أَحَدٌ بَعْدِي، سَمِعْتُهُ مِنَ النَّبِيِّ صلى الله عليه وسلم سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ تَقُومُ السَّاعَةُ ـ وَإِمَّا قَالَ مِنْ أَشْرَاطِ السَّاعَةِ ـ أَنْ يُرْفَعَ الْعِلْمُ وَيَظْهَرَ الْجَهْلُ، وَيُشْرَبَ الْخَمْرُ، وَيَظْهَرَ الزِّنَا، وَيَقِلَّ الرِّجَالُ، وَيَكْثُرَ النِّسَاءُ، حَتَّى يَكُونَ لِلْخَمْسِينَ امْرَأَةً الْقَيِّمُ الْوَاحِدُ ‏\"‏‏.‏",
                "headingArabic": "إِثْمِ الزُّنَاةِ",
                "headingUrdu": "ناجائز جنسی تعلقات کا گناہ",
                "headingEnglish": "The sin of illegal sexual intercourse",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6539,
                "hadithNumber": "6809",
                "englishNarrator": "Narrated 'Ikrima from Ibn 'Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ)s said, \"When a slave (of Allah) commits illegal sexual intercourse, he is not a believer at the time of committing it; and if he steals, he is not a believer at the time of stealing; and if he drinks an alcoholic drink, when he is not a believer at the time of drinking it; and he is not a believer when he commits a murder,\" 'Ikrima said: I asked Ibn Abbas رضی اللہ عنہما , \"How is faith taken away from him?\" He said, Like this,\" by clasping his hands and then separating them, and added, \"But if he repents, faith returns to him like this, by clasping his hands again.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا بندہ جب زنا کرتا ہے تو وہ مومن نہیں رہتا ۔ بندہ جب چوری کرتا ہے تو وہ مومن نہیں رہتا اور بندہ جب شراب پیتا ہے تو وہ مومن نہیں رہتا اور جب وہ قتل ناحق کرتا ہے تو وہ مومن نہیں رہتا ۔ عکرمہ نے کہا کہ میں نے حضرت ابن عباس رضی اللہ عنہما سے پوچھا کہ ایمان اس سے کس طرح نکال لیا جاتا ہے ؟ آپ نے فرمایا کہ وہ اس طرح اور اس وقت آپ ان نے اپنی انگلیوں کو دوسرے ہاتھ کی انگلیوں میں ڈال کر پھر الگ کر لیا پھر اگر وہ توبہ کر لیتا ہے تو ایمان اس کے پاس لوٹ آتا ہے ۔ اس طرح اور آپ نے اپنی انگلیوں کو دوسرے ہاتھ کی انگلیوں میں ڈالا ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہا ہم کو اسحاق بن یوسف نے خبر دی ، کہا ہم کو فضیل بن غزوان نے خبر دی ، انہیں عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، أَخْبَرَنَا إِسْحَاقُ بْنُ يُوسُفَ، أَخْبَرَنَا الْفُضَيْلُ بْنُ غَزْوَانَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَزْنِي الْعَبْدُ حِينَ يَزْنِي وَهْوَ مُؤْمِنٌ، وَلاَ يَسْرِقُ حِينَ يَسْرِقُ وَهْوَ مُؤْمِنٌ، وَلاَ يَشْرَبُ حِينَ يَشْرَبُ وَهْوَ مُؤْمِنٌ، وَلاَ يَقْتُلُ وَهْوَ مُؤْمِنٌ ‏\"‏‏.‏ قَالَ عِكْرِمَةُ قُلْتُ لاِبْنِ عَبَّاسٍ كَيْفَ يُنْزَعُ الإِيمَانُ مِنْهُ قَالَ هَكَذَا ـ وَشَبَّكَ بَيْنَ أَصَابِعِهِ ثُمَّ أَخْرَجَهَا ـ فَإِنْ تَابَ عَادَ إِلَيْهِ هَكَذَا وَشَبَّكَ بَيْنَ أَصَابِعِهِ",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6540,
                "hadithNumber": "6810",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The one who commits an illegal sexual intercourse is not a believer at the time of committing illegal sexual intercourse and a thief is not a believer at the time of committing theft and a drinker of alcoholic drink is not a believer at the time of drinking. Yet, (the gate of) repentance is open thereafter.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ زنا کرنے والا جب زنا کرتا ہے تو وہ مومن نہیں رہتا ۔ وہ چور جب چوری کرتا ہے تو وہ مومن نہیں رہتا شرابی جب شراب پیتا ہے تو وہ مومن نہیں رہتا ۔ پھر ان سب آدمیوں کے لیے توبہ کا دروازہ بہرحال کھلا ہوا ہے ۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے ذکوان نے بیان کیا ، اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ ذَكْوَانَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَزْنِي الزَّانِي حِينَ يَزْنِي وَهْوَ مُؤْمِنٌ، وَلاَ يَسْرِقُ حِينَ يَسْرِقُ وَهْوَ مُؤْمِنٌ، وَلاَ يَشْرَبُ حِينَ يَشْرَبُهَا وَهْوَ مُؤْمِنٌ، وَالتَّوْبَةُ مَعْرُوضَةٌ بَعْدُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6541,
                "hadithNumber": "6811",
                "englishNarrator": "Narrated `Abdullah bin Mas`ud رضی اللہ عنہ :",
                "hadithEnglish": "I said, \"O Allah's Messenger (ﷺ)! Which is the biggest sin?\" He said, \"To set up rivals to Allah by worshipping others though He alone has created you.\" I asked, \"What is next?\" He said, \"To kill your child lest it should share your food.\" I asked, \"What is next?\" He said, \"To commit illegal sexual intercourse with the wife of your neighbor.\" Hadrat (bin Masoud) رضی اللہ عنہ submitted: O Allah's Apostle ﷺ! Next part of mentioned to Abdur Rehman what Sufyan reports from Aamash, from Mansur and Wasil and from Abu Wail and from Abu Maisarah, he said: Leave it!  Leave it!",
                "hadithUrdu": "میں نے پوچھا یا رسول اللہ ! کون سا گناہ سب سے بڑا ہے ۔ فرمایا یہ کہ تم اللہ کا کسی کو شریک بناؤ ، حالانکہ اسی نے تمہیں پیدا کیا ہے ۔ میں نے پوچھا اس کے بعد ؟ فرمایا یہ کہ تم اپنی اولاد کو اس خطرے سے مار ڈالو کہ وہ تمہارے کھانے میں تمہارے ساتھ شریک ہو گی ۔ میں نے پوچھا اس کے بعد ؟ فرمایا یہ کہ تم اپنے پڑوسی کی بیوی سے زنا کرو ، یحییٰ نے بیان کیا ، ان سے سفیان نے بیان کیا ، ان سے واصل نے بیان کیا ، ان سے ابووائل نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے کہ میں نے عرض کیا یا رسول اللہ ! پھر اسی حدیث کی طرح بیان کیا ۔ عمرو نے کہا کہ پھر میں نے اس حدیث کا ذکر عبدالرحمٰن بن مہدی سے کیا اور انہوں نے ہم سے یہ حدیث سفیان ثوری سے بیان کی ۔ ان سے اعمش ، منصور اور واصل نے ، ان سے ابوائل نے اور ان سے ابومیسرہ نے ۔ عبدالرحمٰن بن مہدی نے کہا کہ تم اس سند کو جانے بھی دو ۔",
                "urduNarrator": "ہم سے عمرو بن علی نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا کہ مجھ سے منصور اور سلیمان نے بیان کیا ، ان سے ابوائل نے ، ان سے ابومیسرہ نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي مَنْصُورٌ، وَسُلَيْمَانُ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مَيْسَرَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَىُّ الذَّنْبِ أَعْظَمُ قَالَ ‏\"‏ أَنْ تَجْعَلَ لِلَّهِ نِدًّا وَهْوَ خَلَقَكَ ‏\"‏‏.‏ قُلْتُ ثُمَّ أَىٌّ قَالَ ‏\"‏ أَنْ تَقْتُلَ وَلَدَكَ مِنْ أَجْلِ أَنْ يَطْعَمَ مَعَكَ ‏\"‏‏.‏ قُلْتُ ثُمَّ أَىٌّ قَالَ ‏\"‏ أَنْ تُزَانِيَ حَلِيلَةَ جَارِكَ ‏\"‏‏.‏ قَالَ يَحْيَى وَحَدَّثَنَا سُفْيَانُ، حَدَّثَنِي وَاصِلٌ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قُلْتُ يَا رَسُولَ اللَّهِ، مِثْلَهُ، قَالَ عَمْرٌو فَذَكَرْتُهُ لِعَبْدِ الرَّحْمَنِ وَكَانَ حَدَّثَنَا عَنْ سُفْيَانَ عَنِ الأَعْمَشِ وَمَنْصُورٍ وَوَاصِلٍ عَنْ أَبِي وَائِلٍ عَنْ أَبِي مَيْسَرَةَ قَالَ دَعْهُ دَعْهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6542,
                "hadithNumber": "6812",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "When the latter stoned a lady to death on a Friday. `Ali said, \"I have stoned her according to the tradition of Allah's Messenger (ﷺ).\"",
                "hadithUrdu": "جب انہوں نے جمعہ کے دن عورت کو رجم کیا تو کہا کہ میں نے اس کا رجم رسول اللہ صلی اللہ علیہ وسلم کی سنت کے مطابق کیا ہے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے سلمہ بن کہیل نے بیان کیا ، کہا کہ میں نے شعبی سے سنا ، انہوں نے حضرت علی رضی اللہ عنہ سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سَلَمَةُ بْنُ كُهَيْلٍ، قَالَ سَمِعْتُ الشَّعْبِيَّ، يُحَدِّثُ عَنْ عَلِيٍّ، رضى الله عنه حِينَ رَجَمَ الْمَرْأَةَ يَوْمَ الْجُمُعَةِ وَقَالَ قَدْ رَجَمْتُهَا بِسُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": "رَجْمِ الْمُحْصَنِ",
                "headingUrdu": "شادی شدہ شخص کا راج",
                "headingEnglish": "The Rajm of a married person",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6543,
                "hadithNumber": "6813",
                "englishNarrator": "Narrated `Abdullah bin Abi `Aufa رضی اللہ عنہ :",
                "hadithEnglish": "'Did Allah's Messenger (ﷺ) carry out the Rajam penalty ( i.e., stoning to death)?' He said, \"Yes.\" I said, \"Before the revelation of Surat-an-Nur or after it?\" He replied, \"I don't Know.\"",
                "hadithUrdu": "کیا رسول اللہ صلی اللہ علیہ وسلم نے کسی کو رجم کیا تھا ۔ انہوں نے کہا کہ ہاں میں نے پوچھا سورۃ النور سے پہلے یا اس کے بعد کہا کہ یہ مجھے معلوم نہیں ۔ ( امرنامعلوم کے لیے اظہار لاعلمی کر دینا بھی امر محمود ہے ۔ )",
                "urduNarrator": "مجھ سے اسحاق واسطی نے بیان کیا ، کہا ہم سے خالد طحان نے بیان کیا ، ان سے شیبانی نے کہا میں نے حضرت عبداللہ بن ابی اوفی رضی اللہ عنہ سے پوچھا ۔",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا خَالِدٌ، عَنِ الشَّيْبَانِيِّ، سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى هَلْ رَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ‏.‏ قُلْتُ قَبْلَ سُورَةِ النُّورِ أَمْ بَعْدُ قَالَ لاَ أَدْرِي‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6544,
                "hadithNumber": "6814",
                "englishNarrator": "Narrated Jabir bin `Abdullah Al-Ansari رضی اللہ عنہما :",
                "hadithEnglish": "A man from the tribe of Bani Aslam came to Allah's Messenger (ﷺ) and Informed him that he had committed illegal sexual intercourse and bore witness four times against himself. Allah's Messenger (ﷺ) ordered him to be stoned to death as he was a married Person.",
                "hadithUrdu": "قبیلہ اسلم کے ایک صاحب ماعز نامی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئے اور کہا کہ میں نے زنا کیا ہے ۔ پھر انہوں نے اپنے زنا کا چار مرتبہ اقرار کیا تو آنحضرت صلی اللہ علیہ وسلم نے ان کے رجم کا حکم دیا اور انہیں رجم کیا گیا ۔ وہ شادی شدہ تھے ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس نے خبر دی ، ان سے ابن شہاب نے بیان کیا ، کہا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا ، ان سے حضرت جابر بن عبداللہ انصاری رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الأَنْصَارِيِّ، أَنَّ رَجُلاً، مِنْ أَسْلَمَ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَحَدَّثَهُ أَنَّهُ قَدْ زَنَى، فَشَهِدَ عَلَى نَفْسِهِ أَرْبَعَ شَهَادَاتٍ، فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُجِمَ، وَكَانَ قَدْ أُحْصِنَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6545,
                "hadithNumber": "6815, 6816",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "A man came to Allah's Messenger (ﷺ) while he was in the mosque, and he called him, saying, \"O Allah's Apostle! I have committed illegal sexual intercourse.\" The Prophet (ﷺ) turned his face to the other side, but that man repeated his statement four times, and after he bore witness against himself four times, the Prophet (ﷺ) called him, saying, \"Are you mad?\" The man said, \"No.\" The Prophet (ﷺ) said, \"Are you married?\" The man said, \"Yes.\" Then the Prophet (ﷺ) said, \"Take him away and stone him to death.\" Jabir bin `Abdullah رضی اللہ عنہما  said: I was among the ones who participated in stoning him and we stoned him at the Musalla. When the stones troubled him, he fled, but we over took him at Al-Harra and stoned him to death.",
                "hadithUrdu": "ایک صاحب ماعز بن مالک اسلمی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئے ، اس وقت آنحضرت صلی اللہ علیہ وسلم مسجد میں تھے ، انہوں نے آپ کو آواز دی اور کہا کہ یا رسول اللہ ! میں نے زنا کر لیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان کی طرف سے منہ پھیر لیا ۔ انہوں نے یہ بات چار دفعہ دوہرائی جب چار دفعہ انہوں نے اس گناہ کی اپنے اوپر شہادت دی تو آنحضرت صلی اللہ علیہ وسلم نے انہیں بلایا اور دریافت فرمایا کیا تم دیوانے ہو ؟ انہوں نے کہا کہ نہیں ۔ آپ نے دریافت فرمایا پھر کیا تم شادی شدہ ہو ؟ انہوں نے کہا ہاں ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہیں لے جاؤ اور رجم کر دو ۔ ابن شہاب نے بیان کیا کہ پھر مجھے انہوں نے خبر دی ، جنہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا تھا کہ انہوں نے کہا کہ رجم کرنے والوں میں میں بھی تھا ، ہم نے انہیں آبادی سے باہر عیدگاہ کے پاس رجم کیا تھا جب ان پر پتھر پڑے تو وہ بھاگ پڑے لیکن ہم نے انہیں حرہ کے پاس پکڑا اور رجم کر دیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے ابوسلمہ اور سعید بن المسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَسَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ أَتَى رَجُلٌ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهْوَ فِي الْمَسْجِدِ فَنَادَاهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ‏.‏ فَأَعْرَضَ عَنْهُ، حَتَّى رَدَّدَ عَلَيْهِ أَرْبَعَ مَرَّاتٍ، فَلَمَّا شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ شَهَادَاتٍ، دَعَاهُ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَبِكَ جُنُونٌ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَهَلْ أَحْصَنْتَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اذْهَبُوا بِهِ فَارْجُمُوهُ ‏\"‏‏.‏قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي مَنْ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ فَكُنْتُ فِيمَنْ رَجَمَهُ فَرَجَمْنَاهُ بِالْمُصَلَّى، فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ هَرَبَ، فَأَدْرَكْنَاهُ بِالْحَرَّةِ فَرَجَمْنَاهُ‏.‏",
                "headingArabic": "لاَ يُرْجَمُ الْمَجْنُونُ وَالْمَجْنُونَةُ",
                "headingUrdu": "پاگل کو سنگسار نہیں کرنا چاہیے۔",
                "headingEnglish": "An insane should not be stoned to death",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6546,
                "hadithNumber": "6817",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Sa`d bin Abi Waqqas and `Abd bin Zam`a رضی اللہ عنہما quarrelled with each other (regarding a child). The Prophet (ﷺ) said, \"The boy is for you, O `Abd bin Zam`a, for the boy is for (the owner) of the bed. O Sauda ! Screen yourself from the boy.\" The sub-narrator, Al-Laith added (that the Prophet (ﷺ) also said), \"And the stone is for the person who commits an illegal sexual intercourse.\"",
                "hadithUrdu": "سعد بن ابی وقاص اور عبد بن زمعہ رضی اللہ عنہما نے آپس میں ( ایک بچے عبدالرحمٰن نامی میں ) اختلاف کیا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا عبد بن زمعہ ! بچہ تو لے لے بچہ اسی کو ملے گا جس کی جورو یا لونڈی کے پیٹ سے وہ پیدا ہوا اور سودہ ! تم اس سے پردہ کیا کرو ۔ حضرت امام بخاری رحمہ اللہ نے کہا کہ قتیبہ نے لیث سے اس زیادہ کے ساتھ بیان کیا کہ زانی کے حصہ میں پتھر کی سزا ہے ۔",
                "urduNarrator": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اخْتَصَمَ سَعْدٌ وَابْنُ زَمْعَةَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ، الْوَلَدُ لِلْفِرَاشِ، وَاحْتَجِبِي مِنْهُ يَا سَوْدَةُ ‏\"‏‏.‏ زَادَ لَنَا قُتَيْبَةُ عَنِ اللَّيْثِ ‏\"‏ وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏",
                "headingArabic": "لِلْعَاهِرِ الْحَجَرُ",
                "headingUrdu": "پتھر غیر قانونی جنسی تعلقات کے لئے ہے",
                "headingEnglish": "The stone is for illegal sexual intercourse",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6547,
                "hadithNumber": "6818",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The boy is for (the owner of) the bed and the stone is for the person who commits illegal sexual intercourse.'",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا لڑکا اسی کو ملتا ہے جس کی جورو یا لونڈی کے پیٹ سے ہوا ہو اور حرام کار کے لیے صرف پتھر ہیں ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے محمد بن زیاد نے بیان کیا ، کہا کہ میں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ الْوَلَدُ لِلْفِرَاشِ، وَلِلْعَاهِرِ الْحَجَرُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6548,
                "hadithNumber": "6819",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "A Jew and a Jewess were brought to Allah's Messenger (ﷺ) on a charge of committing an illegal sexual intercourse. The Prophet (ﷺ) asked them. \"What is the legal punishment (for this sin) in your Book (Torah)?\" They replied, \"Our priests have innovated the punishment of blackening the faces with charcoal and Tajbiya.\" `Abdullah bin Salam رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ), tell them to bring the Torah.\" The Torah was brought, and then one of the Jews put his hand over the Divine Verse of the Rajam (stoning to death) and started reading what preceded and what followed it. On that, Ibn Salam رضی اللہ عنہ said to the Jew, \"Lift up your hand.\" Behold! The Divine Verse of the Rajam was under his hand. So Allah's Apostle ordered that the two (sinners) be stoned to death, and so they were stoned. Ibn `Umar رضی اللہ عنہما added: So both of them were stoned at the Balat and I saw the Jew sheltering the Jewess.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک یہودی مرد اور ایک یہودی عورت کو لایا گیا ، جنہوں نے زنا کیا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے پوچھا کہ تمہاری کتاب تورات میں اس کی سزا کیا ہے ؟ انہوں نے کہا کہ ہمارے علماء نے ( اس کی سزا ) چہرہ کو سیاہ کرنا اور گدھے پر الٹا سوار کرنا تجویز کی ہوئی ہے ۔ اس پر حضرت عبداللہ بن سلام رضی اللہ عنہ نے کہا یا رسول اللہ ! ان سے توریت منگوائیے ۔ جب توریت لائی گئی تو ان میں سے ایک نے رجم والی آیت پر اپنا ہاتھ رکھ لیا اور اس سے آگے اور پیچھے کی آیتیں پڑھنے لگا ۔ حضرت عبداللہ بن سلام رضی اللہ عنہ نے اس سے کہا کہ اپنا ہاتھ ہٹاؤ ( اور جب اس نے اپنا ہاتھ ہٹایا تو ) آیت رجم اس کے ہاتھ کے نیچے تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے ان دونوں کے متعلق حکم دیا اور انہیں رجم کر دیا گیا ۔ حضرت ابن عمر رضی اللہ عنہما نے بیان کیا کہ انہیں بلاط ( مسجدنبوی کے قریب ایک جگہ ) میں رجم کیا گیا ۔ میں نے دیکھا کہ یہودی عورت کو مرد بچانے کے لیے اس پر جھک جھک پڑتا تھا ۔",
                "urduNarrator": "ہم سے محمد بن عثمان نے بیان کیا ، کہا ہم سے خالد بن مخلد نے بیان کیا ، ان سے سلیمان بن بلال نے ، ان سے عبداللہ بن دینار نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ سُلَيْمَانَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَهُودِيٍّ وَيَهُودِيَّةٍ قَدْ أَحْدَثَا جَمِيعًا فَقَالَ لَهُمْ ‏ \"‏ مَا تَجِدُونَ فِي كِتَابِكُمْ ‏\"‏‏.‏ قَالُوا إِنَّ أَحْبَارَنَا أَحْدَثُوا تَحْمِيمَ الْوَجْهِ وَالتَّجْبِيَةَ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ ادْعُهُمْ يَا رَسُولَ اللَّهِ بِالتَّوْرَاةِ‏.‏ فَأُتِيَ بِهَا فَوَضَعَ أَحَدُهُمْ يَدَهُ عَلَى آيَةِ الرَّجْمِ، وَجَعَلَ يَقْرَأُ مَا قَبْلَهَا وَمَا بَعْدَهَا فَقَالَ لَهُ ابْنُ سَلاَمٍ ارْفَعْ يَدَكَ‏.‏ فَإِذَا آيَةُ الرَّجْمِ تَحْتَ يَدِهِ، فَأَمَرَ بِهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُجِمَا‏.‏ قَالَ ابْنُ عُمَرَ فَرُجِمَا عِنْدَ الْبَلاَطِ، فَرَأَيْتُ الْيَهُودِيَّ أَجْنَأَ عَلَيْهَا‏.‏",
                "headingArabic": "الرَّجْمِ فِي الْبَلاَطِ",
                "headingUrdu": "بلات میں راجم",
                "headingEnglish": "The Rajm at the Balat",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6549,
                "hadithNumber": "6820",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہما :",
                "hadithEnglish": "A man from the tribe of Aslam came to the Prophet (ﷺ) and confessed that he had committed an illegal sexual intercourse. The Prophet (ﷺ) turned his face away from him till the man bore witness against himself four times. The Prophet (ﷺ) said to him, \"Are you mad?\" He said \"No.\" He said, \"Are you married?\" He said, \"Yes.\" Then the Prophet (ﷺ) ordered that he be stoned to death, and he was stoned to death at the Musalla. When the stones troubled him, he fled, but he was caught and was stoned till he died. The Prophet (ﷺ) spoke well of him and offered his funeral prayer.",
                "hadithUrdu": "قبیلہ اسلم کے ایک صاحب ( ماعز بن مالک ) نبی کریم صلی اللہ علیہ وسلم کے پاس آئے اور زنا کا اقرار کیا ۔ لیکن آنحضرت صلی اللہ علیہ وسلم نے ان کی طرف سے اپنا منہ پھیر لیا ۔ پھر جب انہوں نے چار مرتبہ اپنے لیے گواہی دی تو آنحضرت صلی اللہ علیہ وسلم نے ان سے پوچھا کیا تم دیوانے ہو گئے ہو ؟ انہوں نے کہا کہ نہیں ۔ پھر آپ نے پوچھا کیا تمہارا نکاح ہو چکا ہے ؟ انہوں نے کہا کہ ہاں ۔ چنانچہ آپ کے حکم سے انہیں عیدگاہ میں رجم کیا گیا ۔ جب ان پر پتھر پڑے تو وہ بھاگ پڑے لیکن انہیں پکڑلیاگیا اور رجم کیا گیا یہاں تک کہ وہ مرگئے ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے ان کے حق میں کلمہ خیر فرمایا اور ان کا جنازہ ادا کیا اور ان کی تعریف کی جس کے وہ مستحق تھے ۔",
                "urduNarrator": "مجھ سے محمود نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں ابوسلمہ بن عبدالرحمٰن نے اور انہیں حضرت جابر بن عبداللہ رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرٍ، أَنَّ رَجُلاً، مِنْ أَسْلَمَ جَاءَ النَّبِيَّ صلى الله عليه وسلم فَاعْتَرَفَ بِالزِّنَا فَأَعْرَضَ عَنْهُ النَّبِيُّ صلى الله عليه وسلم حَتَّى شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ مَرَّاتٍ‏.‏ قَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَبِكَ جُنُونٌ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ آحْصَنْتَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ فَأَمَرَ بِهِ فَرُجِمَ بِالْمُصَلَّى، فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ فَرَّ، فَأُدْرِكَ فَرُجِمَ حَتَّى مَاتَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم خَيْرًا وَصَلَّى عَلَيْهِ‏.‏ لَمْ يَقُلْ يُونُسُ وَابْنُ جُرَيْجٍ عَنِ الزُّهْرِيِّ فَصَلَّى عَلَيْهِ‏.‏",
                "headingArabic": "الرَّجْمِ بِالْمُصَلَّى",
                "headingUrdu": "مصلے میں راجم",
                "headingEnglish": "The Rajm at the Musalla",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6550,
                "hadithNumber": "6821",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "A person had sexual relation with his wife in the month of Ramadan (while he was fasting), and he came to Allah's Messenger (ﷺ) seeking his verdict concerning that action. The Prophet (ﷺ) said (to him), \"Can you afford to manumit a slave?\" The man said, \"No.\" The Prophet (ﷺ) said, \"Can you fast for two successive months?\" He said, \"No.\" The Prophet (ﷺ) said, \"Then feed sixty poor persons.\"",
                "hadithUrdu": "ایک صاحب نے رمضان میں اپنی بیوی سے ہمبستری کر لی اور پھر رسول اللہ صلی اللہ علیہ وسلم سے اس کا حکم پوچھا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیا تمہارے پاس کوئی غلام ہے ؟ انہوں نے کہا کہ نہیں ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا دو مہینے روزے رکھنے کی تم میں طاقت نہیں ؟ انہوں نے کہا کہ نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر کہا کہ پھر ساٹھ محتاجوں کو کھانا کھلاؤ ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، ان سے لیث بن سعد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے حمید بن عبدالرحمٰن نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَجُلاً، وَقَعَ بِامْرَأَتِهِ فِي رَمَضَانَ، فَاسْتَفْتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ هَلْ تَجِدُ رَقَبَةً ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ هَلْ تَسْتَطِيعُ صِيَامَ شَهْرَيْنِ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ فَأَطْعِمْ سِتِّينَ مِسْكِينًا ‏\"‏‏.‏",
                "headingArabic": "مَنْ أَصَابَ ذَنْبًا دُونَ الْحَدِّ فَأَخْبَرَ الإِمَامَ فَلاَ عُقُوبَةَ عَلَيْهِ بَعْدَ التَّوْبَةِ إِذَا جَاءَ مُسْتَفْتِيًا",
                "headingUrdu": "اگر کوئی شرعی سزا سے کم گناہ کا ارتکاب کرے اور حاکم کو اطلاع دے تو اس کی توبہ کے بعد اس پر کوئی سزا نہیں دی جائے گی۔",
                "headingEnglish": "If somebody commits a sin less than the legal punishment and informs the ruler, no punishment is to be inflicted on him after his repentance",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6551,
                "hadithNumber": "6822",
                "englishNarrator": "Narrated 'Aisha رضی اللہ عنہا :",
                "hadithEnglish": "A man came to the Prophet (ﷺ) in the mosque and said, \"I am burnt (ruined)!\" The Prophet (ﷺ) asked him, \"With what (what have you done)?\" He said, \"I have had sexual relation with my wife in the month of Ramadan (while fasting).\" The Prophet (ﷺ) said to him, \"Give in charity.\" He said, \"I have nothing.\" The man sat down, and in the meantime there came a person driving a donkey carrying food to the Prophet (ﷺ) ..... (The sub-narrator, 'Abdur Rahman added: I do not know what kind of food it was). On that the Prophet (ﷺ) said, \"Where is the burnt person?\" The man said, \"Here I am.\" The Prophet (ﷺ) said to him, \"Take this (food) and give it in charity (to someone).\" The man said, \"To a poorer person than l? My family has nothing to eat.\" Then the Prophet (ﷺ) said to him, \"Then eat it yourselves.\" Imam Bukhari states that first Hadith is clearer than it which goes: Give it to family to consume.",
                "hadithUrdu": "ایک صاحب نبی کریم صلی اللہ علیہ وسلم کے پاس مسجد میں آئے اور عرض کیا میں تو دوزخ کا مستحق ہو گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا کیا بات ہوئی ؟ کہا کہ میں نے اپنی بیوی سے رمضان میں جماع کر لیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے کہا کہ پھر صدقہ کر ۔ انہوں نے کہا کہ میرے پاس کچھ بھی نہیں ۔ پھر وہ بیٹھ گیا اور اس کے بعد ایک صاحب گدھا ہانکتے لائے جس پر کھانے کی چیز رکھی تھی ۔ عبدالرحمٰن نے بیان کیا کہ مجھے معلوم نہیں کہ وہ کیا چیز تھی ۔ ( دوسری روایت میں یوں ہے کہ کھجور لدی ہوئی تھی ) اسے آنحضرت صلی اللہ علیہ وسلم کے پاس لایا جا رہا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا کہ آگ میں جلنے والے صاحب کہاں ہیں ؟ وہ صاحب بولے کہ میں حاضر ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے لے اور صدقہ کر دے ۔ انہوں نے پوچھا کیا اپنے سے زیادہ محتاج کو دوں ؟ میرے گھر والوں کے لیے تو خود کوئی کھانے کی چیز نہیں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر تم ہی کھا لو ۔ حضرت عبداللہ امام بخاری نے کہا کہ پہلی حدیث زیادہ واضح ہے جس میں اطعم اہلک کے الفاظ ہیں ۔",
                "urduNarrator": "اور لیث نے بیان کیا ، ان سے عمرو بن الحارث نے ، ان سے عبدالرحمٰن بن القاسم نے ، ان سے محمد بن جعفر بن زبیر نے ، ان سے عباد بن عبداللہ بن زبیر نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "وَقَالَ اللَّيْثُ عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَتَى رَجُلٌ النَّبِيَّ صلى الله عليه وسلم فِي الْمَسْجِدِ قَالَ احْتَرَقْتُ‏.‏ قَالَ ‏\"‏ مِمَّ ذَاكَ ‏\"‏‏.‏ قَالَ وَقَعْتُ بِامْرَأَتِي فِي رَمَضَانَ‏.‏ قَالَ لَهُ ‏\"‏ تَصَدَّقْ ‏\"‏‏.‏ قَالَ مَا عِنْدِي شَىْءٌ‏.‏ فَجَلَسَ وَأَتَاهُ إِنْسَانٌ يَسُوقُ حِمَارًا وَمَعَهُ طَعَامٌ ـ قَالَ عَبْدُ الرَّحْمَنِ مَا أَدْرِي مَا هُوَ ـ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَيْنَ الْمُحْتَرِقُ ‏\"‏‏.‏ فَقَالَ هَا أَنَا ذَا‏.‏ قَالَ ‏\"‏ خُذْ هَذَا فَتَصَدَّقْ بِهِ ‏\"‏‏.‏ قَالَ عَلَى أَحْوَجَ مِنِّي مَا لأَهْلِي طَعَامٌ قَالَ ‏\"‏ فَكُلُوهُ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ الْحَدِيثُ الأَوَّلُ أَبْيَنُ قَوْلُهُ ‏\"‏ أَطْعِمْ أَهْلَكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6552,
                "hadithNumber": "6823",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "While I was with the Prophet (ﷺ) a man came and said, \"O Allah's Messenger (ﷺ)! I have committed a legally punishable sin; please inflict the legal punishment on me'.' The Prophet (ﷺ) did not ask him what he had done. Then the time for the prayer became due and the man offered prayer along with the Prophet (ﷺ) , and when the Prophet (ﷺ) had finished his prayer, the man again got up and said, \"O Allah's Messenger (ﷺ)! I have committed a legally punishable sin; please inflict the punishment on me according to Allah's Laws.\" The Prophet (ﷺ) said, \"Haven't you prayed with us?' He said, \"Yes.\" The Prophet (ﷺ) said, \"Allah has forgiven your sin.\" or said, \"....your legally punishable sin.\"",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کے پاس تھا کہ ایک صاحب کعب بن عمرو آئے اور کہا یا رسول اللہ ! مجھ پر حد واجب ہو گئی ہے ۔ آپ مجھ پر حد جاری کیجئے ۔ انہوں نے آنحضرت صلی اللہ علیہ وسلم نے اس سے کچھ نہیں پوچھا ۔ بیان کیا کہ پھر نماز کا وقت ہو گیا اور ان صاحب نے بھی آنحضرت صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی ۔ جب آنحضور نماز پڑھ چکے تو وہ پھر آنحضرت صلی اللہ علیہ وسلم کے پاس آ کر کھڑے ہو گئے اور کہا یا رسول اللہ ! مجھ پر حد واجب ہو گئی ہے آپ کتاب اللہ کے حکم کے مطابق مجھ پر حد جاری کیجئے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا ۔ کیا تم نے ابھی ہمارے ساتھ نماز نہیں پڑھی ہے ۔ انہوں نے کہا کہ جی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر اللہ نے تیرا گناہ معاف کر دیا ۔ یا فرمایا کہ تیری غلطی یا حد ( معاف کر دی ) ۔",
                "urduNarrator": "مجھ سے عبدالقدوس بن محمد نے بیان کیا ، ان سے عمرو بن عاصم کلابی نے بیان کیا ، ان سے ہمام بن یحییٰ نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے بیان کیا ، ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ، حَدَّثَنِي عَمْرُو بْنُ عَاصِمٍ الْكِلاَبِيُّ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، حَدَّثَنَا إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَجَاءَهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَىَّ‏.‏ قَالَ وَلَمْ يَسْأَلْهُ عَنْهُ‏.‏ قَالَ وَحَضَرَتِ الصَّلاَةُ فَصَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم فَلَمَّا قَضَى النَّبِيُّ صلى الله عليه وسلم الصَّلاَةَ قَامَ إِلَيْهِ الرَّجُلُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا، فَأَقِمْ فِيَّ كِتَابَ اللَّهِ‏.‏ قَالَ ‏\"‏ أَلَيْسَ قَدْ صَلَّيْتَ مَعَنَا ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَإِنَّ اللَّهَ قَدْ غَفَرَ لَكَ ذَنْبَكَ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ حَدَّكَ ‏\"‏‏.‏",
                "headingArabic": "إِذَا أَقَرَّ بِالْحَدِّ وَلَمْ يُبَيِّنْ، هَلْ لِلإِمَامِ أَنْ يَسْتُرَ عَلَيْهِ",
                "headingUrdu": "اگر کوئی شخص اقرار کرتا ہے لیکن گناہ کی تصریح نہیں کرتا تو کیا حاکم اس پر پردہ ڈال سکتا ہے؟",
                "headingEnglish": "If a person confesses but does not specify the sin can the ruler screen it for him?",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6553,
                "hadithNumber": "6824",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When Ma'iz bin Malik came to the Prophet (in order to confess), the Prophet (ﷺ) said to him, \"Probably you have only kissed (the lady), or winked, or looked at her?\" He said, \"No, O Allah's Messenger (ﷺ)!\" The Prophet said, using no euphemism, \"Did you have sexual intercourse with her?\" The narrator added: At that, (i.e. after his confession) the Prophet (ﷺ) ordered that he be stoned (to death).",
                "hadithUrdu": "جب حضرت ماعز بن مالک نبی کریم صلی اللہ علیہ وسلم کے پاس آئے تو آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا غالباً تو نے بوسہ دیا ہو گا یا اشارہ کیا ہو گا یا دیکھا ہو گا ۔ انہوں نے کہا کہ نہیں یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کیا پھر تو نے ہمبستری ہی کر لی ہے ؟ اس مرتبہ آپ نے کنایہ سے کام نہیں لیا ۔ بیان کیا کہ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے انہیں رجم کا حکم دیا ۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد الجعفی نے بیان کیا ، کہا ہم سے وہب بن جریر نے بیان کیا ، کہا ہم سے ہمارے والد نے کہا کہ میں نے یعلیٰ بن حکیم سے سنا ، انہوں نے عکرمہ سے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ يَعْلَى بْنَ حَكِيمٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا أَتَى مَاعِزُ بْنُ مَالِكٍ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهُ ‏\"‏ لَعَلَّكَ قَبَّلْتَ أَوْ غَمَزْتَ أَوْ نَظَرْتَ ‏\"‏‏.‏ قَالَ لاَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ أَنِكْتَهَا ‏\"‏‏.‏ لاَ يَكْنِي‏.‏ قَالَ فَعِنْدَ ذَلِكَ أَمَرَ بِرَجْمِهِ‏.‏",
                "headingArabic": "هَلْ يَقُولُ الإِمَامُ لِلْمُقِرِّ لَعَلَّكَ لَمَسْتَ أَوْ غَمَزْتَ",
                "headingUrdu": "’’کیا یہ نہیں ہو سکتا کہ تم نے صرف عورت کو چھوا ہو یا اس کی طرف آنکھ ماری ہو؟‘‘",
                "headingEnglish": "‘Can’t be that you have only touched the lady or winked at her?”",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6554,
                "hadithNumber": "6825, 6826",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "A man from among the people, came to Allah's Messenger (ﷺ) while Allah's Messenger (ﷺ) was sitting in the mosque, and addressed him, saying, \"O Allah's Messenger (ﷺ)! I have committed an illegal sexual intercourse.\" The Prophet (ﷺ) turned his face away from him. The man came to that side to which the Prophet had turned his face, and said, \"O Allah's Messenger (ﷺ)! I have committed an illegal intercourse.\" The Prophet (ﷺ) turned his face to the other side, and the man came to that side, and when he confessed four times, the Prophet (ﷺ) called him and said, \"Are you mad?\" He said, \"No, O Allah's Messenger (ﷺ)!\" The Prophet said, \"Are you married?\" He said, \"Yes, O Allah's Messenger (ﷺ).\" The Prophet (ﷺ) said (to the people), \"Take him away and stone him to death.\" Ibn Shihab added, \"I was told by one who heard Jabir, that Jabir رضی اللہ عنہ said, 'I was among those who stoned the man, and we stoned him at the Musalla (`Id praying Place), and when the stones troubled him, he jumped quickly and ran away, but we overtook him at Al-Harra and stoned him to death (there).' \"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک صاحب آئے ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت مسجد میں بیٹھے ہوئے تھے ۔ انہوں نے آواز دی یا رسول اللہ ! میں نے زنا کیا ہے ۔ خود اپنے متعلق وہ کہہ رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے اپنا منہ پھیر لیا ۔ لیکن وہ صاحب بھی ہٹ کر اسی طرف کھڑے ہو گئے جدھر آپ صلی اللہ علیہ وسلم نے اپنا منہ پھیرا تھا اور عرض کیا یا رسول اللہ ! میں نے زنا کیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے پھر اپنا منہ پھیر لیا اور وہ بھی دوبارہ اس طرف آ گئے جدھر آنحضرت صلی اللہ علیہ وسلم نے اپنا منہ پھیرا تھا اور اس طرح جب اس نے چار مرتبہ اپنے گناہ کا اقرار کر لیا تو آنحضرت صلی اللہ علیہ وسلم نے اس کو بلایا اور پوچھا کیا تم پاگل ہو ؟ انہوں نے کہا کہ نہیں یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے پوچھا کیا تم شادی شدہ ہو ؟ انہوں نے کہا جی یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے صحابہ سے فرمایا کہ انہیں لے جاؤ اور رجم کر دو ۔\r\nابن شہاب نے مزید کہا کہ مجھے ایک شخص نے بتایا جس نے جابر رضی اللہ عنہ کو سنا، جابر رضی اللہ عنہ نے کہا: میں اس شخص کو سنگسار کرنے والوں میں سے تھا، اور ہم نے اسے نماز کی جگہ  میں سنگسار کیا، پھر جب پتھر اسے پریشان کر رہے تھے وہ تیزی سے چھلانگ لگا کر بھاگا، لیکن ہم نے اسے الحرہ میں پکڑ لیا اور (وہاں) اسے سنگسار کر دیا۔' \"",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، کہا مجھ سے عبدالرحمٰن بن خالد نے ، ان سے ابن شہاب نے ، ان سے ابن المسیب اور ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ أَنَّ أَبَا هُرَيْرَةَ، قَالَ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم رَجُلٌ مِنَ النَّاسِ وَهْوَ فِي الْمَسْجِدِ فَنَادَاهُ يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ‏.‏ يُرِيدُ نَفْسَهُ، فَأَعْرَضَ عَنْهُ النَّبِيُّ صلى الله عليه وسلم فَتَنَحَّى لِشِقِّ وَجْهِهِ الَّذِي أَعْرَضَ قِبَلَهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ‏.‏ فَأَعْرَضَ عَنْهُ، فَجَاءَ لِشِقِّ وَجْهِ النَّبِيِّ صلى الله عليه وسلم الَّذِي أَعْرَضَ عَنْهُ، فَلَمَّا شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ شَهَادَاتٍ دَعَاهُ النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَبِكَ جُنُونٌ ‏\"‏‏.‏ قَالَ لاَ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ أَحْصَنْتَ ‏\"‏‏.‏ قَالَ نَعَمْ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ اذْهَبُوا فَارْجُمُوهُ ‏\"‏‏.‏ \r\nقَالَ ابْنُ شِهَابٍ أَخْبَرَنِي مَنْ، سَمِعَ جَابِرًا، قَالَ فَكُنْتُ فِيمَنْ رَجَمَهُ، فَرَجَمْنَاهُ بِالْمُصَلَّى، فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ جَمَزَ حَتَّى أَدْرَكْنَاهُ بِالْحَرَّةِ فَرَجَمْنَاهُ‏.‏",
                "headingArabic": "سُؤَالِ الإِمَامِ الْمُقِرَّ هَلْ أَحْصَنْتَ",
                "headingUrdu": "حاکم کا اعتراف کرنے والے سے سوال، \"کیا تم شادی شدہ ہو؟\"",
                "headingEnglish": "The question of the ruler to the confessing person, “Are you married?”",
                "chapterId": "88",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 88,
                    "chapterNumber": "88",
                    "chapterEnglish": "Al-Maharbeen",
                    "chapterUrdu": "ان کفار و مرتدوں کے احکام میں جو مسلمانوں سے لڑتے ہیں",
                    "chapterArabic": "كتاب المحاربين",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 6526,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=261",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=259",
                "label": "259",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=260",
                "label": "260",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=261",
                "label": "261",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=262",
                "label": "262",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=263",
                "label": "263",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=264",
                "label": "264",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=265",
                "label": "265",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=263",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=263",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=261",
        "to": 6550,
        "total": 40465
    }
}