{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 169,
        "data": [
            {
                "id": 4203,
                "hadithNumber": "4412",
                "englishNarrator": "Narrated `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "He came riding a donkey when Allah 's Apostle was standing at Mina during Hajjat-ul-Wada`, leading the people in prayer. The donkey passed in front of a part of the row (of the people offering the prayer). Then he dismounted from it and took his position in the row with the people.",
                "hadithUrdu": "وہ ایک گدھے پر سوار ہو کر آئے تو رسول اللہ صلی اللہ علیہ وسلم منیٰ میں کھڑے لوگوں کو نماز پڑھا رہے تھے۔ یہ حجۃ الوداع کا موقع تھا۔ ان کا گدھا صف کے کچھ حصے سے گزرا، پھر وہ اتر کر لوگوں کے ساتھ صف میں کھڑے ہو گئے۔",
                "urduNarrator": "ہم سے یحییٰ بن قزعہ نے بیان کیا، انہوں نے کہا ہم سے امام مالک نے بیان کیا، ان سے شہاب نے بیان کیا (دوسری سند) اور لیث بن سعد نے بیان کیا کہ مجھ سے یونس نے بیان کیا، ان سے ابن شہاب نے بیان کیا، ان سے عبیداللہ بن عبداللہ نے بیان کیا اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّهُ، أَقْبَلَ يَسِيرُ عَلَى حِمَارٍ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ بِمِنًى فِي حَجَّةِ الْوَدَاعِ يُصَلِّي بِالنَّاسِ، فَسَارَ الْحِمَارُ بَيْنَ يَدَىْ بَعْضِ الصَّفِّ، ثُمَّ نَزَلَ عَنْهُ، فَصَفَّ مَعَ النَّاسِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4204,
                "hadithNumber": "4413",
                "englishNarrator": "Narrated Hisham's father:",
                "hadithEnglish": "In my presence, Usama رضی اللہ عنہ was asked about the speed of the Prophet (ﷺ) during his Hajj. He replied, \"It was Al-`Anaq (i.e. moderate easy speed) and if he encountered an open space, he used to increase his speed.\"",
                "hadithUrdu": "اسامہ رضی اللہ عنہ سے حجۃ الوداع کے موقع پر نبی کریم صلی اللہ علیہ وسلم کی ( سفر میں ) رفتار کے متعلق پوچھا گیا تو انہوں نے کہا کہ بیچ کی چال چلتے تھے اور جب کشادہ جگہ ملتی تو اس سے تیز چلتے تھے۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا، ان سے ہشام بن عروہ نے بیان کیا کہ مجھ سے میرے والد عروہ نے بیان کیا، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، سُئِلَ أُسَامَةُ وَأَنَا شَاهِدٌ، عَنْ سَيْرِ النَّبِيِّ، صلى الله عليه وسلم فِي حَجَّتِهِ‏.‏ فَقَالَ الْعَنَقَ، فَإِذَا وَجَدَ فَجْوَةً نَصَّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4205,
                "hadithNumber": "4414",
                "englishNarrator": "Narrated `Abu Aiyub رضی اللہ عنہ :",
                "hadithEnglish": "He informed him that he offered the Maghrib and `Isha' prayers together with the Prophet during Hajjat-ul-Wada`.",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ حجۃ الوداع کے موقع پر مغرب اور عشاء ملا کر ایک ساتھ پڑھی تھیں۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا، ان سے امام مالک نے بیان کیا، ان سے یحییٰ بن سعید نے، ان سے عدی بن ثابت نے اور ان سے عبداللہ بن یزید خطمی نے اور انہیں ابوایوب رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ، أَنَّ أَبَا أَيُّوبَ، أَخْبَرَهُ أَنَّهُ، صَلَّى مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ الْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4206,
                "hadithNumber": "4415",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "My Companions sent me to Allah's Messenger (ﷺ) to ask him for some animals to ride on as they were accompanying him in the army of Al-Usra, and that was the Ghazwa (Battle) of Tabuk, I said, \"O Allah's Prophet! My companions have sent me to you to provide them with means of transportation.\" He said, \"By Allah! I will not make you ride anything.\" It happened that when I reached him, he was in an angry mood, and I didn't notice it. So I returned in a sad mood because of the refusal the Prophet (ﷺ) and for the fear that the Prophet (ﷺ) might have become 'angry with me. So I returned to my companions and informed them of what the Prophet (ﷺ) had said. Only a short while had passed when I heard Bilal رضی اللہ عنہ calling, \"O `Abdullah bin Qais!\" I replied to his call. Bilal رضی اللہ عنہ said, \"Respond to Allah's Messenger (ﷺ) who is calling you.\" When I went to him (i.e. the Prophet), he said, \"Take these two camels tied together and also these two camels tied together,\"' referring to six camels he had brought them from Sa`d at that time. The Prophet (ﷺ) added, \"Take them to your companions and say, 'Allah (or Allah's Messenger (ﷺ) ) allows you to ride on these,' so ride on them.\" So I took those camels to them and said, \"The Prophet (ﷺ) allows you to ride on these (camels) but by Allah, I will not leave you till some of you proceed with me to somebody who heard the statement of Allah's Messenger (ﷺ). Do not think that I narrate to you a thing which Allah's Messenger (ﷺ) has not said.\" They said to me, \"We consider you truthful, and we will do what you like.\" The sub-narrator added: So Abu Musa proceeded along with some of them till they came to those who have heard the statement of Allah's Messenger (ﷺ) wherein he denied them (some animals to ride on) and (his statement) whereby he gave them the same. So these people told them the same information as Abu Musa رضی اللہ عنہ had told them.",
                "hadithUrdu": "مجھے میرے ساتھیوں نے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھیجا کہ میں آپ صلی اللہ علیہ وسلم سے ان کے لیے سواری کے جانوروں کی درخواست کروں۔ وہ لوگ آپ کے ساتھ جیش عسرت ( یعنی غزوہ تبوک ) میں شریک ہونا چاہتے تھے۔ میں نے عرض کیا: یا رسول اللہ! میرے ساتھیوں نے مجھے آپ کی خدمت میں بھیجا ہے تاکہ آپ ان کے لیے سواری کے جانوروں کا انتظام کرا دیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ کی قسم! میں تم کو سواری کے جانور نہیں دے سکتا۔ میں جب آپ کی خدمت میں حاضر ہوا تھا تو آپ غصہ میں تھے اور میں اسے معلوم نہ کر سکا تھا۔ آپ صلی اللہ علیہ وسلم کے انکار سے میں بہت غمگین واپس ہوا۔ یہ خوف بھی تھا کہ کہیں آپ سواری مانگنے کی وجہ سے خفا نہ ہو گئے ہوں۔ میں اپنے ساتھیوں کے پاس آیا اور انہیں نبی کریم صلی اللہ علیہ وسلم کے ارشاد کی خبر دی، لیکن ابھی کچھ زیادہ وقت نہیں گزرا تھا کہ میں نے بلال رضی اللہ عنہ کی آواز سنی، وہ پکار رہے تھے، اے عبداللہ بن قیس! میں نے جواب دیا تو انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم تمہیں بلا رہے ہیں۔ میں آپ کی خدمت میں حاضر ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ دو جوڑے اور یہ دو جوڑے اونٹ کے لے جاؤ۔ آپ نے چھ اونٹ عنایت فرمائے۔ ان اونٹوں کو آپ نے اسی وقت سعد رضی اللہ عنہ سے خریدا تھا اور فرمایا کہ انہیں اپنے ساتھیوں کو دے دو اور انہیں بتاؤ کہ اللہ تعالیٰ نے یا آپ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے تمہاری سواری کے لیے انہیں دیا ہے، ان پر سوار ہو جاؤ۔ میں ان اونٹوں کو لے کر اپنے ساتھیوں کے پاس گیا اور ان سے میں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے تمہاری سواری کے لیے یہ عنایت فرمائے ہیں لیکن اللہ کی قسم! کہ اب تمہیں ان صحابہ رضی اللہ عنہم کے پاس چلنا پڑے گا، جنہوں نے نبی کریم صلی اللہ علیہ وسلم کا انکار فرمانا سنا تھا، کہیں تم یہ خیال نہ کر بیٹھو کہ میں نے تم سے نبی کریم صلی اللہ علیہ وسلم کے ارشاد کے متعلق غلط بات کہہ دی تھی۔ انہوں نے کہا کہ تمہاری سچائی میں ہمیں کوئی شبہ نہیں ہے لیکن اگر آپ کا اصرار ہے تو ہم ایسا بھی کر لیں گے۔ ابوموسیٰ رضی اللہ عنہ ان میں سے چند لوگوں کو لے کر ان صحابہ رضی اللہ عنہم کے پاس آئے جنہوں نے نبی کریم صلی اللہ علیہ وسلم کا وہ ارشاد سنا تھا کہ نبی کریم صلی اللہ علیہ وسلم نے پہلے تو دینے سے انکار کیا تھا لیکن پھر عنایت فرمایا۔ ان صحابہ رضی اللہ عنہم نے بھی اسی طرح حدیث بیان کی جس طرح ابوموسیٰ رضی اللہ عنہ نے ان سے بیان کی تھی۔",
                "urduNarrator": "مجھ سے محمد بن علاء نے بیان کیا، کہا ہم سے ابواسامہ نے بیان کیا، ان سے برید بن عبداللہ بن ابی بردہ نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ أَرْسَلَنِي أَصْحَابِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَسْأَلُهُ الْحُمْلاَنَ لَهُمْ، إِذْ هُمْ مَعَهُ فِي جَيْشِ الْعُسْرَةِ وَهْىَ غَزْوَةُ تَبُوكَ فَقُلْتُ يَا نَبِيَّ اللَّهِ، إِنَّ أَصْحَابِي أَرْسَلُونِي إِلَيْكَ لِتَحْمِلَهُمْ‏.‏ فَقَالَ ‏\"‏ وَاللَّهِ لاَ أَحْمِلُكُمْ عَلَى شَىْءٍ ‏\"‏‏.‏ وَوَافَقْتُهُ، وَهْوَ غَضْبَانُ وَلاَ أَشْعُرُ، وَرَجَعْتُ حَزِينًا مِنْ مَنْعِ النَّبِيِّ صلى الله عليه وسلم، وَمِنْ مَخَافَةِ أَنْ يَكُونَ النَّبِيُّ صلى الله عليه وسلم وَجَدَ فِي نَفْسِهِ عَلَىَّ، فَرَجَعْتُ إِلَى أَصْحَابِي فَأَخْبَرْتُهُمُ الَّذِي قَالَ النَّبِيُّ صلى الله عليه وسلم، فَلَمْ أَلْبَثْ إِلاَّ سُوَيْعَةً إِذْ سَمِعْتُ بِلاَلاً يُنَادِي أَىْ عَبْدَ اللَّهِ بْنَ قَيْسٍ‏.‏ فَأَجَبْتُهُ، فَقَالَ أَجِبْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَدْعُوكَ، فَلَمَّا أَتَيْتُهُ، قَالَ ‏\"‏ خُذْ هَذَيْنِ الْقَرِينَيْنِ ـ وَهَذَيْنِ الْقَرِينَيْنِ لِسِتَّةِ أَبْعِرَةٍ ابْتَاعَهُنَّ حِينَئِذٍ مِنْ سَعْدٍ ـ فَانْطَلِقْ بِهِنَّ إِلَى أَصْحَابِكَ فَقُلْ إِنَّ اللَّهَ ـ أَوْ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ـ يَحْمِلُكُمْ عَلَى هَؤُلاَءِ فَارْكَبُوهُنَّ ‏\"‏‏.‏ فَانْطَلَقْتُ إِلَيْهِمْ بِهِنَّ، فَقُلْتُ إِنَّ النَّبِيَّ صلى الله عليه وسلم يَحْمِلُكُمْ عَلَى هَؤُلاَءِ وَلَكِنِّي وَاللَّهِ لاَ أَدَعُكُمْ حَتَّى يَنْطَلِقَ مَعِي بَعْضُكُمْ إِلَى مَنْ سَمِعَ مَقَالَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ تَظُنُّوا أَنِّي حَدَّثْتُكُمْ شَيْئًا لَمْ يَقُلْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالُوا لِي إِنَّكَ عِنْدَنَا لَمُصَدَّقٌ، وَلَنَفْعَلَنَّ مَا أَحْبَبْتَ‏.‏ فَانْطَلَقَ أَبُو مُوسَى بِنَفَرٍ مِنْهُمْ حَتَّى أَتَوُا الَّذِينَ سَمِعُوا قَوْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم مَنْعَهُ إِيَّاهُمْ، ثُمَّ إِعْطَاءَهُمْ بَعْدُ، فَحَدَّثُوهُمْ بِمِثْلِ مَا حَدَّثَهُمْ بِهِ أَبُو مُوسَى‏.‏",
                "headingArabic": "غَزْوَةُ تَبُوكَ، وَهْىَ غَزْوَةُ الْعُسْرَةِ",
                "headingUrdu": "غزوہ تبوک جسے غزوہ العسرہ بھی کہتے ہیں۔",
                "headingEnglish": "Ghazwa of Tabuk, also called Ghazwa Al-‘Usrah",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4207,
                "hadithNumber": "4416",
                "englishNarrator": "Narrated Sa`d:",
                "hadithEnglish": "Allah's Messenger (ﷺ) set out for Tabuk. appointing `Ali رضی اللہ عنہ as his deputy (in Medina). `Ali رضی اللہ عنہ said, \"Do you want to leave me with the children and women?\" The Prophet (ﷺ) said, \"Will you not be pleased that you will be to me like Haron to Moses? But there will be no prophet after me.\" Shobah has narrated us with reference to Hakam that he heard Musab say.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم غزوہ تبوک کے لیے تشریف لے گئے تو علی رضی اللہ عنہ کو مدینہ میں اپنا نائب بنایا۔ علی رضی اللہ عنہ نے عرض کیا کہ آپ مجھے بچوں اور عورتوں میں چھوڑے جا رہے ہیں؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کیا تم اس پر خوش نہیں ہو کہ میرے لیے تم ایسے ہو جیسے موسیٰ کے لیے ہارون تھے۔ لیکن فرق یہ ہے کہ میرے بعد کوئی نبی نہیں ہو گا۔ اور ابوداؤد طیالسی نے اس حدیث کو یوں بیان کیا کہ ہم سے شعبہ نے بیان کیا، ان سے حکم بن عتبہ نے اور انہوں نے کہا میں نے مصعب سے سنا۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا، کہا ہم سے یحییٰ بن سمیر قفان نے بیان کیا، ان سے شعبہ نے، ان سے حکم بن عتبہ نے، ان سے مصعب بن سعد نے اور ان سے ان کے والد نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ إِلَى تَبُوكَ، وَاسْتَخْلَفَ عَلِيًّا فَقَالَ أَتُخَلِّفُنِي فِي الصِّبْيَانِ وَالنِّسَاءِ قَالَ ‏ \"‏ أَلاَ تَرْضَى أَنْ تَكُونَ مِنِّي بِمَنْزِلَةِ هَارُونَ مِنْ مُوسَى إِلاَّ أَنَّهُ لَيْسَ نَبِيٌّ بَعْدِي ‏\"‏‏.‏ وَقَالَ أَبُو دَاوُدَ حَدَّثَنَا شُعْبَةُ عَنِ الْحَكَمِ سَمِعْتُ مُصْعَبًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4208,
                "hadithNumber": "4417",
                "englishNarrator": "Narrated Safwan bin Ya`la bin Umaiya that his father said:",
                "hadithEnglish": "\"I participated in Al-Usra (i.e. Tabuk) along with the Prophet.\" Ya`la رضی اللہ عنہ added, \"(My participation in) that Ghazwa was the best of my deeds to me.\" Ya`la رضی اللہ عنہ said, \"I had a laborer who quarrelled with somebody, and one of the two bit the hand of the other (`Ata', the sub-narrator, said, \"Safwan رضی اللہ عنہ told me who bit whom but I forgot it\"), and the one who was bitten, pulled his hand out of the mouth of the biter, so one of the incisors of the biter was broken. So we came to the Prophet (ﷺ) and he considered the biter's claim as invalid (i.e. the biter did not get a recompense for his broken incisor). The Prophet (ﷺ) said, \"Should he leave his hand in your mouth so that you might snap it as if it were in the mouth of a male camel to snap it?\"",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ غزوہ عسرت میں شریک تھا۔ بیان کیا کہ یعلٰی رضی اللہ عنہ کہا کرتے تھے کہ مجھے اپنے تمام عملوں میں اسی پر سب سے زیادہ بھروسہ ہے۔ عطاء نے بیان کیا، ان سے صفوان نے بیان کیا کہ یعلٰی رضی اللہ عنہ نے کہا، میں نے ایک مزدور بھی اپنے ساتھ لے لیا تھا۔ وہ ایک شخص سے لڑ پڑا اور ایک نے دوسرے کا ہاتھ دانت سے کاٹا۔ عطاء نے بیان کیا کہ مجھے صفوان رضی اللہ عنہ نے خبر دی کہ ان دونوں میں سے کس نے اپنے مقابل کا ہاتھ کاٹا تھا، یہ مجھے یاد نہیں ہے۔ بہرحال جس کا ہاتھ کاٹا گیا تھا اس نے اپنا ہاتھ کاٹنے والے کے منہ سے جو کھینچا تو کاٹنے والے کے آگے کا ایک دانت بھی ساتھ چلا آیا۔ وہ دونوں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو آپ صلی اللہ علیہ وسلم نے دانت کے ٹوٹنے پر کوئی قصاص نہیں دلوایا۔ عطاء نے بیان کیا میرا خیال ہے کہ انہوں نے یہ بھی بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا پھر کیا وہ تیرے منہ میں اپنا ہاتھ رہنے دیتا تاکہ تو اسے اونٹ کی طرح چبا جاتا۔",
                "urduNarrator": "ہم سے عبیداللہ بن سعید نے بیان کیا، کہا ہم سے محمد بن بکر نے بیان کیا، کہا ہم کو ابن جریج نے خبر دی، کہا کہ میں نے عطاء سے سنا، انہوں نے خبر دیتے ہوئے کہا کہ مجھے صفوان بن یعلٰی بن امیہ نے خبر دی اور ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ عَطَاءً، يُخْبِرُ قَالَ أَخْبَرَنِي صَفْوَانُ بْنُ يَعْلَى بْنِ أُمَيَّةَ، عَنْ أَبِيهِ، قَالَ غَزَوْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم الْعُسْرَةَ قَالَ كَانَ يَعْلَى يَقُولُ تِلْكَ الْغَزْوَةُ أَوْثَقُ أَعْمَالِي عِنْدِي‏.‏ قَالَ عَطَاءٌ فَقَالَ صَفْوَانُ قَالَ يَعْلَى فَكَانَ لِي أَجِيرٌ فَقَاتَلَ إِنْسَانًا فَعَضَّ أَحَدُهُمَا يَدَ الآخَرِ، قَالَ عَطَاءٌ فَلَقَدْ أَخْبَرَنِي صَفْوَانُ أَيُّهُمَا عَضَّ الآخَرَ فَنَسِيتُهُ، قَالَ فَانْتَزَعَ الْمَعْضُوضُ يَدَهُ مِنْ فِي الْعَاضِّ، فَانْتَزَعَ إِحْدَى ثَنِيَّتَيْهِ، فَأَتَيَا النَّبِيَّ صلى الله عليه وسلم فَأَهْدَرَ ثَنِيَّتَهُ‏.‏ قَالَ عَطَاءٌ وَحَسِبْتُ أَنَّهُ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَفَيَدَعُ يَدَهُ فِي فِيكَ تَقْضَمُهَا، كَأَنَّهَا فِي فِي فَحْلٍ يَقْضَمُهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4209,
                "hadithNumber": "4418",
                "englishNarrator": "Narrated `Abdullah bin Ka`b bin Malik:",
                "hadithEnglish": "Who, from among Ka`b's sons, was the guide of Ka`b رضی اللہ عنہ when he became blind: I heard Ka`b bin Malik رضی اللہ عنہ narrating the story of (the Ghazwa of) Tabuk in which he failed to take part. Ka`b رضی اللہ عنہ said, \"I did not remain behind Allah's Messenger (ﷺ) in any Ghazwa that he fought except the Ghazwa of Tabuk, and I failed to take part in the Ghazwa of Badr, but Allah did not admonish anyone who had not participated in it, for in fact, Allah's Messenger (ﷺ) had gone out in search of the caravan of Quraish till Allah made them (i.e. the Muslims) and their enemy meet without any appointment. I witnessed the night of Al-`Aqaba (pledge) with Allah's Messenger (ﷺ) when we pledged for Islam, and I would not exchange it for the Badr battle although the Badr battle is more popular amongst the people than it (i.e. Al-`Aqaba pledge). As for my news (in this battle of Tabuk), I had never been stronger or wealthier than I was when I remained behind the Prophet (ﷺ) in that Ghazwa. By Allah, never had I two she-camels before, but I had then at the time of this Ghazwa. Whenever Allah's Messenger (ﷺ) wanted to make a Ghazwa, he used to hide his intention by apparently referring to different Ghazwa till it was the time of that Ghazwa (of Tabuk) which Allah's Messenger (ﷺ) fought in severe heat, facing, a long journey, desert, and the great number of enemy. So the Prophet (ﷺ) announced to the Muslims clearly (their destination) so that they might get prepared for their Ghazwa. So he informed them clearly of the destination he was going to. Allah's Messenger (ﷺ) was accompanied by a large number of Muslims who could not be listed in a book namely, a register.\" Ka`b رضی اللہ عنہ added, \"Any man who intended to be absent would think that the matter would remain hidden unless Allah revealed it through Divine Revelation. So Allah's Messenger (ﷺ) fought that Ghazwa at the time when the fruits had ripened and the shade looked pleasant. Allah's Messenger (ﷺ) and his companions prepared for the battle and I started to go out in order to get myself ready along with them, but I returned without doing anything. I would say to myself, 'I can do that.' So I kept on delaying it every now and then till the people got ready and Allah's Messenger (ﷺ) and the Muslims along with him departed, and I had not prepared anything for my departure, and I said, I will prepare myself (for departure) one or two days after him, and then join them.' In the morning following their departure, I went out to get myself ready but returned having done nothing. Then again in the next morning, I went out to get ready but returned without doing anything. Such was the case with me till they hurried away and the battle was missed (by me). Even then I intended to depart to take them over. I wish I had done so! But it was not in my luck. So, after the departure of Allah's Messenger (ﷺ), whenever I went out and walked amongst the people (i.e, the remaining persons), it grieved me that I could see none around me, but one accused of hypocrisy or one of those weak men whom Allah had excused. Allah's Messenger (ﷺ) did not remember me till he reached Tabuk. So while he was sitting amongst the people in Tabuk, he said, 'What did Ka`b do?' A man from Banu Salama said, 'O Allah's Messenger (ﷺ)! He has been stopped by his two Burdas (i.e. garments) and his looking at his own flanks with pride.' Then Mu`adh bin Jabal said, 'What a bad thing you have said! By Allah! O Allahs Apostle! We know nothing about him but good.' Allah's Messenger (ﷺ) kept silent.\" Ka`b bin Malik رضی اللہ عنہ added, \"When I heard that he (i.e. the Prophet (ﷺ) ) was on his way back to Medina. I got dipped in my concern, and began to think of false excuses, saying to myself, 'How can I avoid his anger tomorrow?' And I took the advice of wise member of my family in this matter. When it was said that Allah's Messenger (ﷺ), had come near all the evil false excuses abandoned from my mind and I knew well that I could never come out of this problem by forging a false statement. Then I decided firmly to speak the truth. So Allah's Messenger (ﷺ) arrived in the morning, and whenever he returned from a journey., he used to visit the Mosque first of all and offer a two-rak`at prayer therein and then sit for the people. So when he had done all that (this time), those who had failed to join the battle (of Tabuk) came and started offering (false) excuses and taking oaths before him. They were something over eighty men; Allah's Messenger (ﷺ) accepted the excuses they had expressed, took their pledge of allegiance asked for Allah's Forgiveness for them, and left the secrets of their hearts for Allah to judge. Then I came to him, and when I greeted him, he smiled a smile of an angry person and then said, 'Come on.' So I came walking till I sat before him. He said to me, 'What stopped you from joining us. Had you not purchased an animal For carrying you?' I answered, \"Yes, O Allah's Messenger (ﷺ)! But by Allah, if I were sitting before any person from among the people of the world other than you, I would have avoided his anger with an excuse. By Allah, I have been bestowed with the power of speaking fluently and eloquently, but by Allah, I knew well that if today I tell you a lie to seek your favor, Allah would surely make you angry with me in the near future, but if I tell you the truth, though you will get angry because of it, I hope for Allah's Forgiveness. Really, by Allah, there was no excuse for me. By Allah, I had never been stronger or wealthier than I was when I remained behind you.' Then Allah's Messenger (ﷺ) said, 'As regards this man, he has surely told the truth. So get up till Allah decides your case.' I got up, and many men of Banu Salama followed me and said to me. 'By Allah, we never witnessed you doing any sin before this. Surely, you failed to offer excuse to Allah's Messenger (ﷺ) as the others who did not join him, have offered. The prayer of Allah's Messenger (ﷺ) to Allah to forgive you would have been sufficient for you.' By Allah, they continued blaming me so much that I intended to return (to the Prophet) and accuse myself of having told a lie, but I said to them, 'Is there anybody else who has met the same fate as I have?' They replied, 'Yes, there are two men who have said the same thing as you have, and to both of them was given the same order as given to you.' I said, 'Who are they?' They replied, Murara bin Ar-Rabi Al- Amri and Hilal bin Umaiya Al-Waqifi.' By that they mentioned to me two pious men who had attended the Ghazwa (Battle) of Badr, and in whom there was an example for me. So I did not change my mind when they mentioned them to me. Allah's Messenger (ﷺ) forbade all the Muslims to talk to us, the three aforesaid persons out of all those who had remained behind in that Ghazwa. So we kept away from the people and they changed their attitude towards us till the very land (where I lived) appeared strange to me as if I did not know it. We remained in that condition for fifty nights. As regards my two fellows, they remained in their houses and kept on weeping, but I was the youngest of them and the firmest of them, so I used to go out and witness the prayers along with the Muslims and roam about in the markets, but none would talk to me, and I would come to Allah's Messenger (ﷺ) and greet him while he was sitting In his gathering after the prayer, and I would wonder whether the Prophet (ﷺ) did move his lips in return to my greetings or not. Then I would offer my prayer near to him and look at him stealthily. When I was busy with my prayer, he would turn his face towards me, but when I turned my face to him, he would turn his face away from me. When this harsh attitude of the people lasted long, I walked till I scaled the wall of the garden of Abu Qatada who was my cousin and dearest person to me, and I offered my greetings to him. By Allah, he did not return my greetings. I said, 'O Abu Qatada! I beseech you by Allah! Do you know that I love Allah and His Apostle?' He kept quiet. I asked him again, beseeching him by Allah, but he remained silent. Then I asked him again in the Name of Allah. He said, \"Allah and His Apostle know it better.' Thereupon my eyes flowed with tears and I returned and jumped over the wall.\" Ka`b رضی اللہ عنہ added, \"While I was walking in the market of Medina, suddenly I saw a Nabati (i.e. a Christian farmer) from the Nabatis of Sham who came to sell his grains in Medina, saying, 'Who will lead me to Ka`b bin Malik رضی اللہ عنہ ?' The people began to point (me) out for him till he came to me and handed me a letter from the king of Ghassan in which the following was written: \"To proceed, I have been informed that your friend (i.e. the Prophet (ﷺ) ) has treated you harshly. Anyhow, Allah does not let you live at a place where you feel inferior and your right is lost. So join us, and we will console you.\" When I read it, I said to myself, 'This is also a sort of a test.' Then I took the letter to the oven and made a fire therein by burning it. When forty out of the fifty nights elapsed, behold ! There came to me the messenger of Allah's Messenger (ﷺ) and said, 'Allah's Messenger (ﷺ) orders you to keep away from your wife,' I said, 'Should I divorce her; or else! what should I do?' He said, 'No, only keep aloof from her and do not cohabit her.' The Prophet (ﷺ) sent the same message to my two fellows. Then I said to my wife. 'Go to your parents and remain with them till Allah gives His Verdict in this matter.\" Ka`b رضی اللہ عنہ added, \"The wife of Hilal bin Umaiya came to Apostle and said, 'O Allah's Messenger (ﷺ)! Hilal bin Umaiya is a helpless old man who has no servant to attend on him. Do you dislike that I should serve him? ' He said, 'No (you can serve him) but he should not come near you.' She said, 'By Allah, he has no desire for anything. By, Allah, he has never ceased weeping till his case began till this day of his.' (continued...) (continuing... 1): -5.702:... ... On that, some of my family members said to me, 'Will you also ask Allah's Messenger (ﷺ) to permit your wife (to serve you) as he has permitted the wife of Hilal bin Umaiya to serve him?' I said, 'By Allah, I will not ask the permission of Allah's Messenger (ﷺ) regarding her, for I do not know What Allah's Messenger (ﷺ) would say if I asked him to permit her (to serve me) while I am a young man.' Then I remained in that state for ten more nights after that till the period of fifty nights was completed starting from the time when Allah's Messenger (ﷺ) prohibited the people from talking to us. When I had offered the Fajr prayer on the 50th morning on the roof of one of our houses and while I was sitting in the condition which Allah described (in the Qur'an) i.e. my very soul seemed straitened to me and even the earth seemed narrow to me for all its spaciousness, there I heard the voice of one who had ascended the mountain of Sala' calling with his loudest voice, 'O Ka`b bin Malik! Be happy (by receiving good tidings).' I fell down in prostration before Allah, realizing that relief has come. Allah's Messenger (ﷺ) had announced the acceptance of our repentance by Allah when he had offered the Fajr prayer. The people then went out to congratulate us. Some bringers of good tidings went out to my two fellows, and a horseman came to me in haste, and a man of Banu Aslam came running and ascended the mountain and his voice was swifter than the horse. When he (i.e. the man) whose voice I had heard, came to me conveying the good tidings, I took off my garments and dressed him with them; and by Allah, I owned no other garments than them on that day. Then I borrowed two garments and wore them and went to Allah's Apostle. The people started receiving me in batches, congratulating me on Allah's Acceptance of my repentance, saying, 'We congratulate you on Allah's Acceptance of your repentance.\" Ka`b رضی اللہ عنہ further said, \"When I entered the Mosque. I saw Allah's Messenger (ﷺ) sitting with the people around him. Talha bin Ubaidullah swiftly came to me, shook hands with me and congratulated me. By Allah, none of the Muhajirin (i.e. Emigrants) got up for me except him (i.e. Talha), and I will never forget this for Talha.\" Ka`b رضی اللہ عنہ added, \"When I greeted Allah's Messenger (ﷺ) he, his face being bright with joy, said \"Be happy with the best day that you have got ever since your mother delivered you.\" Ka`b رضی اللہ عنہ added, \"I said to the Prophet (ﷺ) 'Is this forgiveness from you or from Allah?' He said, 'No, it is from Allah.' Whenever Allah's Messenger (ﷺ) became happy, his face would shine as if it were a piece of moon, and we all knew that characteristic of him. When I sat before him, I said, 'O Allah's Messenger (ﷺ)! Because of the acceptance of my repentance I will give up all my wealth as alms for the Sake of Allah and His Apostle. Allah's Apostle said, 'Keep some of your wealth, as it will be better for you.' I said, 'So I will keep my share from Khaibar with me,' and added, 'O Allah's Messenger (ﷺ)! Allah has saved me for telling the truth; so it is a part of my repentance not to tell but the truth as long as I am alive. By Allah, I do not know anyone of the Muslims whom Allah has helped fortelling the truth more than me. Since I have mentioned that truth to Allah's Messenger (ﷺ) till today, I have never intended to tell a lie. I hope that Allah will also save me (from telling lies) the rest of my life. So Allah revealed to His Apostle the Verse:-- \"Verily, Allah has forgiven the Prophet, the Muhajirin (i.e. Emigrants (up to His Saying) And be with those who are true (in word and deed).\" (9.117-119) By Allah, Allah has never bestowed upon me, apart from His guiding me to Islam, a Greater blessing than the fact that I did not tell a lie to Allah's Messenger (ﷺ) which would have caused me to perish as those who have told a lie perished, for Allah described those who told lies with the worst description He ever attributed to anybody else. Allah said:-- \"They (i.e. the hypocrites) will swear by Allah to you when you return to them (up to His Saying) Certainly Allah is not pleased with the rebellious people-- \" (9.95-96) Ka`b رضی اللہ عنہ added, \"We, the three persons, differed altogether from those whose excuses Allah's Apostle accepted when they swore to him. He took their pledge of allegiance and asked Allah to forgive them, but Allah's Messenger (ﷺ) left our case pending till Allah gave His Judgment about it. As for that Allah said):-- And to the three (He did for give also) who remained behind.\" (9.118) What Allah said (in this Verse) does not indicate our failure to take part in the Ghazwa, but it refers to the deferment of making a decision by the Prophet (ﷺ) about our case in contrast to the case of those who had taken an oath before him and he excused them by accepting their excuses.",
                "hadithUrdu": "( جب کعب رضی اللہ عنہ نابینا ہو گئے تو ان کے لڑکوں میں وہ ہی کعب رضی اللہ عنہ کو راستے میں پکڑ کر چلا کرتے تھے ) انہوں نے بیان کیا کہ میں نے کعب رضی اللہ عنہ سے ان کے غزوہ تبوک میں شریک نہ ہو سکنے کا واقعہ سنا۔ انہوں نے بتایا کہ غزوہ تبوک کے سوا اور کسی غزوہ میں ایسا نہیں ہوا تھا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ شریک نہ ہوا ہوں۔ البتہ غزوہ بدر میں بھی شریک نہیں ہوا تھا لیکن جو لوگ غزوہ بدر میں شریک نہیں ہو سکے تھے، ان کے متعلق نبی کریم صلی اللہ علیہ وسلم نے کسی قسم کی خفگی کا اظہار نہیں فرمایا تھا کیونکہ آپ صلی اللہ علیہ وسلم اس موقع پر صرف قریش کے قافلے کی تلاش میں نکلے تھے، لیکن اللہ تعالیٰ کے حکم سے کسی پہلی تیاری کے بغیر، آپ کی دشمنوں سے ٹکر ہو گئی اور میں لیلہ عقبہ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تھا۔ یہ وہی رات ہے جس میں ہم نے ( مکہ میں ) اسلام کے لیے عہد کیا تھا اور مجھے تو یہ غزوہ بدر سے بھی زیادہ عزیز ہے۔ اگرچہ بدر کا لوگوں کی زبانوں پر چرچہ زیادہ ہے۔ میرا واقعہ یہ ہے کہ میں اپنی زندگی میں کبھی اتنا قوی اور اتنا صاحب مال نہیں ہوا تھا جتنا اس موقع پر تھا۔ جبکہ میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ تبوک کے غزوے میں شریک نہیں ہو سکا تھا۔ اللہ کی قسم! اس سے پہلے کبھی میرے پاس دو اونٹ جمع نہیں ہوئے تھے لیکن اس موقع پر میرے پاس دو اونٹ موجود تھے۔ نبی کریم صلی اللہ علیہ وسلم جب کبھی کسی غزوے کے لیے تشریف لے جاتے تو آپ اس کے لیے ذومعنی الفاظ استعمال کیا کرتے تھے لیکن اس غزوہ کا جب موقع آیا تو گرمی بڑی سخت تھی، سفر بھی بہت لمبا تھا، بیابانی راستہ اور دشمن کی فوج کی کثرت تعداد! تمام مشکلات سامنے تھیں۔ اس لیے نبی کریم صلی اللہ علیہ وسلم نے مسلمانوں سے اس غزوہ کے متعلق بہت تفصیل کے ساتھ بتا دیا تھا تاکہ اس کے مطابق پوری طرح سے تیاری کر لیں۔ چنانچہ آپ صلی اللہ علیہ وسلم نے اس سمت کی بھی نشاندہی کر دی جدھر سے آپ کا جانے کا ارادہ تھا۔ مسلمان بھی آپ صلی اللہ علیہ وسلم کے ساتھ بہت تھے۔ اتنے کہ کسی رجسٹر میں سب کے ناموں کا لکھنا بھی مشکل تھا۔ کعب رضی اللہ عنہ نے بیان کیا کہ کوئی بھی شخص اگر اس غزوے میں شریک نہ ہونا چاہتا تو وہ یہ خیال کر سکتا تھا کہ اس کی غیر حاضری کا کسی کو پتہ نہیں چلے گا۔ سوا اس کے کہ اس کے متعلق وحی نازل ہو۔ نبی کریم صلی اللہ علیہ وسلم جب اس غزوہ کے لیے تشریف لے جا رہے تھے تو پھل پکنے کا زمانہ تھا اور سایہ میں بیٹھ کر لوگ آرام کرتے تھے۔ نبی کریم صلی اللہ علیہ وسلم بھی تیاریوں میں مصروف تھے اور آپ کے ساتھ مسلمان بھی۔ لیکن میں روزانہ سوچا کرتا تھا کہ کل سے میں بھی تیاری کروں گا اور اس طرح ہر روز اسے ٹالتا رہا۔ مجھے اس کا یقین تھا کہ میں تیاری کر لوں گا۔ مجھے آسانیاں میسر ہیں، یوں ہی وقت گزرتا رہا اور آخر لوگوں نے اپنی تیاریاں مکمل بھی کر لیں اور نبی کریم صلی اللہ علیہ وسلم مسلمانوں کو ساتھ لے کر روانہ بھی ہو گئے۔ اس وقت تک میں نے تیاری نہیں کی تھی۔ اس موقع پر بھی میں نے اپنے دل کو یہی کہہ کر سمجھا لیا کہ کل یا پرسوں تک تیاری کر لوں گا اور پھر لشکر سے جا ملوں گا۔ کوچ کے بعد دوسرے دن میں نے تیاری کے لیے سوچا لیکن اس دن بھی کوئی تیاری نہیں کی۔ پھر تیسرے دن کے لیے سوچا اور اس دن بھی کوئی تیاری نہیں کی۔ یوں ہی وقت گزر گیا اور اسلامی لشکر بہت آگے بڑھ گیا۔ غزوہ میں شرکت میرے لیے بہت دور کی بات ہو گئی اور میں یہی ارادہ کرتا رہا کہ یہاں سے چل کر انہیں پا لوں گا۔ کاش! میں نے ایسا کر لیا ہوتا لیکن یہ میرے نصیب میں نہیں تھا۔ نبی کریم صلی اللہ علیہ وسلم کے تشریف لے جانے کے بعد جب میں باہر نکلتا تو مجھے بڑا رنج ہوتا کیونکہ یا تو وہ لوگ نظر آتے جن کے چہروں سے نفاق ٹپکتا تھا یا پھر وہ لوگ جنہیں اللہ تعالیٰ نے معذور اور ضعیف قرار دے دیا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے میرے بارے میں کسی سے کچھ نہیں پوچھا تھا لیکن جب آپ تبوک پہنچ گئے تو وہیں ایک مجلس میں آپ نے دریافت فرمایا کہ کعب نے کیا کیا؟ بنو سلمہ کے ایک صاحب نے کہا کہ یا رسول اللہ! اس کے غرور نے اسے آنے نہیں دیا۔ ( وہ حسن و جمال یا لباس پر اترا کر رہ گیا ) اس پر معاذ بن جبل رضی اللہ عنہ بولے تم نے بری بات کہی۔ یا رسول اللہ! اللہ کی قسم! ہمیں ان کے متعلق خیر کے سوا اور کچھ معلوم نہیں۔ نبی کریم صلی اللہ علیہ وسلم نے کچھ نہیں فرمایا۔ کعب بن مالک رضی اللہ عنہ نے بیان کیا کہ جب مجھے معلوم ہوا کہ نبی کریم صلی اللہ علیہ وسلم واپس تشریف لا رہے ہیں تو اب مجھ پر فکر سوار ہوا اور میرا ذہن کوئی ایسا جھوٹا بہانہ تلاش کرنے لگا جس سے میں کل نبی کریم صلی اللہ علیہ وسلم کی خفگی سے بچ سکوں۔ اپنے گھر کے ہر عقلمند آدمی سے اس کے متعلق میں نے مشورہ لیا لیکن جب مجھے معلوم ہوا کہ نبی کریم صلی اللہ علیہ وسلم مدینہ سے بالکل قریب آ چکے ہیں تو غلط خیالات میرے ذہن سے نکل گئے اور مجھے یقین ہو گیا کہ اس معاملہ میں جھوٹ بول کر میں اپنے کو کسی طرح محفوظ نہیں کر سکتا۔ چنانچہ میں نے سچی بات کہنے کا پختہ ارادہ کر لیا۔ صبح کے وقت نبی کریم صلی اللہ علیہ وسلم تشریف لائے۔ جب آپ کسی سفر سے واپس تشریف لاتے تو یہ آپ کی عادت تھی کہ پہلے مسجد میں تشریف لے جاتے اور دو رکعت نماز پڑھتے، پھر لوگوں کے ساتھ مجلس میں بیٹھتے۔ جب آپ اس عمل سے فارغ ہو چکے تو آپ کی خدمت میں لوگ آنے لگے جو غزوہ میں شریک نہیں ہو سکے تھے اور قسم کھا کھا کر اپنے عذر بیان کرنے لگے۔ ایسے لوگوں کی تعداد اسی کے قریب تھی۔ نبی کریم صلی اللہ علیہ وسلم نے ان کے ظاہر کو قبول فرما لیا، ان سے عہد لیا۔ ان کے لیے مغفرت کی دعا فرمائی اور ان کے باطن کو اللہ کے سپرد کیا۔ اس کے بعد میں حاضر ہوا۔ میں نے سلام کیا تو آپ مسکرائے۔ آپ کی مسکراہٹ میں خفگی تھی۔ آپ صلی اللہ علیہ وسلم نے فرمایا: آؤ، میں چند قدم چل کر آپ صلی اللہ علیہ وسلم کے سامنے بیٹھ گیا۔ آپ صلی اللہ علیہ وسلم نے مجھ سے دریافت فرمایا کہ تم غزوہ میں کیوں شریک نہیں ہوئے۔ کیا تم نے کوئی سواری نہیں خریدی تھی؟ میں نے عرض کیا، میرے پاس سواری موجود تھی۔ اللہ کی قسم! اگر میں آپ صلی اللہ علیہ وسلم کے سوا کسی دنیادار شخص کے سامنے آج بیٹھا ہوتا تو کوئی نہ کوئی عذر گھڑ کر اس کی خفگی سے بچ سکتا تھا، مجھے خوبصورتی کے ساتھ گفتگو کا سلیقہ معلوم ہے۔ لیکن اللہ کی قسم! مجھے یقین ہے کہ اگر آج میں آپ کے سامنے کوئی جھوٹا عذر بیان کر کے آپ کو راضی کر لوں تو بہت جلد اللہ تعالیٰ آپ کو مجھ سے ناراض کر دے گا۔ اس کے بجائے اگر میں آپ صلی اللہ علیہ وسلم سے سچی بات بیان کر دوں تو یقیناً آپ کو میری طرف سے خفگی ہو گی لیکن اللہ سے مجھے معافی کی پوری امید ہے۔ نہیں، اللہ کی قسم! مجھے کوئی عذر نہیں تھا، اللہ کی قسم اس وقت سے پہلے کبھی میں اتنا فارغ البال نہیں تھا اور پھر بھی میں آپ کے ساتھ شریک نہیں ہو سکا۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہوں نے سچی بات بتا دی۔ اچھا اب جاؤ، یہاں تک کہ اللہ تعالیٰ تمہارے بارے میں خود کوئی فیصلہ کر دے۔ میں اٹھ گیا اور میرے پیچھے بنو سلمہ کے کچھ لوگ بھی دوڑے ہوئے آئے اور مجھ سے کہنے لگے کہ اللہ کی قسم! ہمیں تمہارے متعلق یہ معلوم نہیں تھا کہ اس سے پہلے تم نے کوئی گناہ کیا ہے اور تم نے بڑی کوتاہی کی۔ نبی کریم صلی اللہ علیہ وسلم کے سامنے ویسا ہی کوئی عذر نہیں بیان کیا جیسا دوسرے نہ شریک ہونے والوں نے بیان کر دیا تھا۔ تمہارے گناہ کے لیے نبی کریم صلی اللہ علیہ وسلم کا استغفار ہی کافی ہو جاتا۔ اللہ کی قسم! ان لوگوں نے مجھے اس پر اتنی ملامت کی کہ مجھے خیال آیا کہ واپس جا کر نبی کریم صلی اللہ علیہ وسلم سے کوئی جھوٹا عذر کر آؤں۔ پھر میں نے ان سے پوچھا کیا میرے علاوہ کسی اور نے بھی مجھ جیسا عذر بیان کیا ہے؟ انہوں نے بتایا کہ ہاں دو حضرات نے اسی طرح معذرت کی جس طرح تم نے کی ہے اور انہیں جواب بھی وہی ملا ہے جو تمہیں ملا۔ میں نے پوچھا کہ ان کے نام کیا ہیں؟ انہوں نے بتا کیا کہ مرارہ بن ربیع عمری اور ہلال بن امیہ واقفی رضی اللہ عنہما۔ ان دو ایسے صحابہ کا نام انہوں نے لے دیا تھا جو صالح تھے اور بدر کی جنگ میں شریک ہوئے تھے۔ ان کا طرز عمل میرے لیے نمونہ بن گیا۔ چنانچہ انہوں نے جب ان بزرگوں کا نام لیا تو میں اپنے گھر چلا آیا اور نبی کریم صلی اللہ علیہ وسلم نے لوگوں کو ہم سے بات چیت کرنے کی ممانعت کر دی، بہت سے لوگ جو غزوے میں شریک نہیں ہوئے تھے، ان میں سے صرف ہم تین تھے! لوگ ہم سے الگ رہنے لگے اور سب لوگ بدل گئے۔ ایسا نظر آتا تھا کہ ہم سے ساری دنیا بدل گئی ہے۔ ہمارا اس سے کوئی واسطہ ہی نہیں ہے۔ پچاس دن تک ہم اسی طرح رہے، میرے دو ساتھیوں نے تو اپنے گھروں سے نکلنا ہی چھوڑ دیا، بس روتے رہتے تھے لیکن میرے اندر ہمت تھی کہ میں باہر نکلتا تھا، مسلمانوں کے ساتھ نماز میں شریک ہوتا تھا اور بازاروں میں گھوما کرتا تھا لیکن مجھ سے بولتا کوئی نہ تھا۔ میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بھی حاضر ہوتا تھا، آپ کو سلام کرتا، جب آپ نماز کے بعد مجلس میں بیٹھتے، میں اس کی جستجو میں لگا رہتا تھا کہ دیکھوں سلام کے جواب میں نبی کریم صلی اللہ علیہ وسلم کے مبارک ہونٹ ہلے یا نہیں، پھر آپ کے قریب ہی نماز پڑھنے لگ جاتا اور آپ کو کنکھیوں سے دیکھتا رہتا جب میں اپنی نماز میں مشغول ہو جاتا تو نبی کریم صلی اللہ علیہ وسلم میری طرف دیکھتے لیکن جونہی میں آپ کی طرف دیکھتا آپ رخ مبارک پھیر لیتے۔ آخر جب اس طرح لوگوں کی بےرخی بڑھتی ہی گئی تو میں ( ایک دن ) ابوقتادہ رضی اللہ عنہ کے باغ کی دیوار پر چڑھ گیا، وہ میرے چچا زاد بھائی تھے اور مجھے ان سے بہت گہرا تعلق تھا، میں نے انہیں سلام کیا، لیکن اللہ کی قسم! انہوں نے بھی میرے سلام کا جواب نہیں دیا۔ میں نے کہا، ابوقتادہ! تمہیں اللہ کی قسم! کیا تم نہیں جانتے کہ اللہ اور اس کے رسول سے مجھے کتنی محبت ہے۔ انہوں نے کوئی جواب نہیں دیا۔ میں نے دوبارہ ان سے یہی سوال کیا اللہ کی قسم دے کر لیکن اب بھی وہ خاموش تھے، پھر میں نے اللہ کا واسطہ دے کر ان سے یہی سوال کیا۔ اس مرتبہ انہوں نے صرف اتنا کہا کہ اللہ اور اس کے رسول کو زیادہ علم ہے۔ اس پر میرے آنسو پھوٹ پڑے۔ میں واپس چلا آیا اور دیوار پر چڑھ کر ( نیچے، باہر اتر آیا ) انہوں نے بیان کیا کہ ایک دن میں مدینہ کے بازار میں جا رہا تھا کہ شام کا ایک کاشتکار جو غلہ بیچنے مدینہ آیا تھا، پوچھ رہا تھا کہ کعب بن مالک کہاں رہتے ہیں؟ لوگوں نے میری طرف اشارہ کیا تو وہ میرے پاس آیا اور ملک غسان کا ایک خط مجھے دیا، اس خط میں یہ تحریر تھا۔ ”امابعد! مجھے معلوم ہوا ہے کہ تمہار ے صاحب ( یعنی نبی کریم صلی اللہ علیہ وسلم ) تمہارے ساتھ زیادتی کرنے لگے ہیں۔ اللہ تعالیٰ نے تمہیں کوئی ذلیل نہیں پیدا کیا ہے کہ تمہارا حق ضائع کیا جائے، تم ہمارے پاس آ جاؤ، ہم تمہارے ساتھ بہتر سے بہتر سلوک کریں گے۔“ جب میں نے یہ خط پڑھا تو میں نے کہا کہ یہ ایک اور امتحان آ گیا۔ میں نے اس خط کو تنور میں جلا دیا۔ ان پچاس دنوں میں سے جب چالیس دن گزر چکے تو رسول اللہ صلی اللہ علیہ وسلم کے ایلچی میرے پاس آئے اور کہا کہ نبی کریم صلی اللہ علیہ وسلم نے تمہیں حکم دیا ہے کہ اپنی بیوی کے بھی قریب نہ جاؤ۔ میں نے پوچھا میں اسے طلاق دے دوں یا پھر مجھے کیا کرنا چاہئیے؟ انہوں نے بتایا کہ نہیں صرف ان سے جدا ہو، ان کے قریب نہ جاؤ میرے دونوں ساتھیوں کو ( جنہوں نے میری طرح معذرت کی تھی ) بھی یہی حکم آپ نے بھیجا تھا۔ میں نے اپنی بیوی سے کہا کہ اب اپنے میکے چلی جاؤ اور اس وقت تک وہیں رہو جب تک اللہ تعالیٰ اس معاملہ کا کوئی فیصلہ نہ کر دے۔ کعب رضی اللہ عنہ نے بیان کیا کہ ہلال بن امیہ ( جن کا مقاطعہ ہوا تھا ) کی بیوی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کی: یا رسول اللہ! ہلال بن امیہ بہت ہی بوڑھے اور کمزور ہیں، ان کے پاس کوئی خادم بھی نہیں ہے، کیا اگر میں ان کی خدمت کر دیا کروں تو آپ ناپسند فرمائیں گے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ صرف وہ تم سے صحبت نہ کریں۔ انہوں نے عرض کی۔ اللہ کی قسم! وہ تو کسی چیز کے لیے حرکت بھی نہیں کر سکتے۔ جب سے یہ خفگی ان پر ہوئی ہے وہ دن ہے اور آج کا دن ہے ان کے آنسو تھمنے میں نہیں آتے۔ میرے گھر کے بعض لوگوں نے کہا کہ جس طرح ہلال بن امیہ رضی اللہ عنہ کی بیوی کو ان کی خدمت کرتے رہنے کی اجازت نبی کریم صلی اللہ علیہ وسلم نے دے دی ہے، آپ بھی اسی طرح کی اجازت نبی کریم صلی اللہ علیہ وسلم سے لے لیجئے۔ میں نے کہا نہیں، اللہ کی قسم! میں اس کے لیے نبی کریم صلی اللہ علیہ وسلم سے اجازت نہیں لوں گا، میں جوان ہوں، معلوم نہیں جب سے اجازت لینے جاؤں تو نبی کریم صلی اللہ علیہ وسلم کیا فرمائیں۔ اس طرح دس دن اور گزر گئے اور جب سے نبی کریم صلی اللہ علیہ وسلم نے ہم سے بات چیت کرنے کی ممانعت فرمائی تھی اس کے پچاس دن پورے ہو گئے۔ پچاسویں رات کی صبح کو جب میں فجر کی نماز پڑھ چکا اور اپنے گھر کی چھت پر بیٹھا ہوا تھا، اس طرح جیسا کہ اللہ تعالیٰ نے ذکر کیا ہے، میرا دم گھٹا جا رہا تھا اور زمین اپنی تمام وسعتوں کے باوجود میرے لیے تنگ ہوتی جا رہی تھی کہ میں نے ایک پکارنے والے کی آواز سنی، جبل سلع پر چڑھ کر کوئی بلند آواز سے کہہ رہا تھا، اے کعب بن مالک! تمہیں بشارت ہو۔ انہوں نے بیان کیا کہ یہ سنتے ہی میں سجدے میں گر پڑا اور مجھے یقین ہو گیا کہ اب فراخی ہو جائے گی۔ فجر کی نماز کے بعد رسول اللہ صلی اللہ علیہ وسلم نے اللہ کی بارگاہ میں ہماری توبہ کی قبولیت کا اعلان کر دیا تھا۔ لوگ میرے یہاں بشارت دینے کے لیے آنے لگے اور میرے دو ساتھیوں کو بھی جا کر بشارت دی۔ ایک صاحب ( زبیر بن عوام رضی اللہ عنہ ) اپنا گھوڑا دوڑائے آ رہے تھے، ادھر قبیلہ اسلم کے ایک صحابی نے پہاڑی پر چڑھ کر ( آواز دی ) اور آواز گھوڑے سے زیادہ تیز تھی۔ جن صحابی نے ( سلع پہاڑی پر سے ) آواز دی تھی، جب وہ میرے پاس بشارت دینے آئے تو اپنے دونوں کپڑے اتار کر اس بشارت کی خوشی میں، میں نے انہیں دے دئیے۔ اللہ کی قسم کہ اس وقت ان دو کپڑوں کے سوا ( دینے کے لائق ) اور میرے پاس کوئی چیز نہیں تھی۔ پھر میں نے ( ابوقتادہ رضی اللہ عنہ سے ) دو کپڑے مانگ کر پہنے اور نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا، جوق در جوق لوگ مجھ سے ملاقات کرتے جاتے تھے اور مجھے توبہ کی قبولیت پر بشارت دیتے جاتے تھے، کہتے تھے اللہ کی بارگاہ میں توبہ کی قبولیت مبارک ہو۔ کعب رضی اللہ عنہ نے بیان کیا، آخر میں مسجد میں داخل ہوا نبی کریم صلی اللہ علیہ وسلم تشریف رکھتے تھے۔ چاروں طرف صحابہ کا مجمع تھا۔ طلحہ بن عبیداللہ رضی اللہ عنہ دوڑ کر میری طرف بڑھے اور مجھ سے مصافحہ کیا اور مبارکباد دی۔ اللہ کی قسم! ( وہاں موجود ) مہاجرین میں سے کوئی بھی ان کے سوا، میرے آنے پر کھڑا نہیں ہوا۔ طلحہ رضی اللہ عنہ کا یہ احسان میں کبھی نہیں بھولوں گا۔ کعب رضی اللہ عنہ نے بیان کیا کہ جب میں نبی کریم صلی اللہ علیہ وسلم کو سلام کیا تو آپ نے فرمایا: ( چہرہ مبارک خوشی اور مسرت دمک اٹھا تھا ) اس مبارک دن کے لیے تمہیں بشارت ہو جو تمہاری عمر کا سب سے مبارک دن ہے۔ انہوں نے بیان کیا کہ میں نے عرض کیا: یا رسول اللہ! یہ بشارت آپ کی طرف سے ہے یا اللہ تعالیٰ کی طرف سے؟ فرمایا نہیں، بلکہ اللہ کی طرف سے ہے۔ نبی کریم صلی اللہ علیہ وسلم جب کسی بات پر خوش ہوتے تو چہرہ مبارک روشن ہو جاتا تھا، ایسا جیسے چاند کا ٹکڑا ہو۔ آپ کی مسرت ہم تو چہرہ مبارک سے سمجھ جاتے تھے۔ پھر جب میں آپ کے سامنے بیٹھ گیا تو عرض کیا: یا رسول اللہ! اپنی توبہ کی قبولیت کی خوشی میں، میں اپنا مال اللہ اور اس کے رسول کی راہ میں صدقہ کر دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا لیکن کچھ مال اپنے پاس بھی رکھ لو، یہ زیادہ بہتر ہے۔ میں نے عرض کیا پھر میں خیبر کا حصہ اپنے پاس رکھ لوں گا۔ پھر میں نے عرض کیا: یا رسول اللہ! اللہ تعالیٰ نے مجھے سچ بولنے کی وجہ سے نجات دی۔ اب میں اپنی توبہ کی قبولیت کی خوشی میں یہ عہد کرتا ہوں کہ جب تک زندہ رہوں گا سچ کے سوا اور کوئی بات زبان پر نہ لاؤں گا۔ پس اللہ کی قسم! جب سے میں نے نبی کریم صلی اللہ علیہ وسلم کے سامنے یہ عہد کیا، میں کسی ایسے مسلمان کو نہیں جانتا جسے اللہ نے سچ بولنے کی وجہ سے اتنا نوازا ہو، جتنی نوازشات اس کی مجھ پر سچ بولنے کی وجہ سے ہیں۔ جب سے میں نے نبی کریم صلی اللہ علیہ وسلم کے سامنے یہ عہد کیا، پھر آج تک کبھی جھوٹ کا ارادہ بھی نہیں کیا اور مجھے امید ہے کہ اللہ تعالیٰ باقی زندگی میں بھی مجھے اس سے محفوظ رکھے گا اور اللہ تعالیٰ نے اپنے رسول پر آیت ( ہمارے بارے میں ) نازل کی تھی۔ ”یقیناً اللہ تعالیٰ نے نبی، مہاجرین اور انصار کی توبہ قبول کی“ اس کے ارشاد «وكونوا مع الصادقين‏» تک اللہ کی قسم! اللہ تعالیٰ کی طرف سے اسلام کے لیے ہدایت کے بعد، میری نظر میں نبی کریم صلی اللہ علیہ وسلم کے سامنے اس سچ بولنے سے بڑھ کر اللہ کا مجھ پر اور کوئی انعام نہیں ہوا کہ میں نے جھوٹ نہیں بولا اور اس طرح اپنے کو ہلاک نہیں کیا۔ جیسا کہ جھوٹ بولنے والے ہلاک ہو گئے تھے۔ نزول وحی کے زمانہ میں جھوٹ بولنے والوں پر اللہ تعالیٰ نے اتنی شدید وعید فرمائی جتنی شدید کسی دوسرے کے لیے نہیں فرمائی ہو گی۔ فرمایا ہے «سيحلفون بالله لكم إذا انقلبتم‏» ارشاد «فإن الله لا يرضى عن القوم الفاسقين‏» تک۔ کعب رضی اللہ عنہ نے بیان کیا۔ چنانچہ ہم تین، ان لوگوں کے معاملے سے جدا رہے جنہوں نے نبی کریم صلی اللہ علیہ وسلم کے سامنے قسم کھا لی تھی اور آپ نے ان کی بات مان بھی لی تھی، ان سے بیعت بھی لی تھی اور ان کے لیے طلب مغفرت بھی فرمائی تھی۔ ہمارا معاملہ نبی کریم صلی اللہ علیہ وسلم نے چھوڑ دیا تھا اور اللہ تعالیٰ نے خود اس کا فیصلہ فرمایا تھا۔ اللہ تعالیٰ کے ارشاد «وعلى الثلاثة الذين خلفوا‏» سے یہی مراد ہے کہ ہمار ا مقدمہ ملتوی رکھا گیا اور ہم ڈھیل میں ڈال دئیے گئے۔ یہ نہیں مراد ہے کہ جہاد سے پیچھے رہ گئے بلکہ مطلب یہ ہے کہ ان لوگوں کے پیچھے رہے جنہوں نے قسمیں کھا کر اپنے عذر بیان کئے اور نبی کریم صلی اللہ علیہ وسلم نے ان کے عذر قبول کر لیے۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، ان سے عبدالرحمٰن بن عبداللہ بن کعب بن مالک نے، ان سے عبداللہ بن کعب بن مالک نے،",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبِ بْنِ مَالِكٍ ـ وَكَانَ قَائِدَ كَعْبٍ مِنْ بَنِيهِ حِينَ عَمِيَ ـ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، يُحَدِّثُ حِينَ تَخَلَّفَ عَنْ قِصَّةِ، تَبُوكَ قَالَ كَعْبٌ لَمْ أَتَخَلَّفْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةٍ غَزَاهَا إِلاَّ فِي غَزْوَةِ تَبُوكَ، غَيْرَ أَنِّي كُنْتُ تَخَلَّفْتُ فِي غَزْوَةِ بَدْرٍ، وَلَمْ يُعَاتِبْ أَحَدًا تَخَلَّفَ، عَنْهَا إِنَّمَا خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُرِيدُ عِيرَ قُرَيْشٍ، حَتَّى جَمَعَ اللَّهُ بَيْنَهُمْ وَبَيْنَ عَدُوِّهِمْ عَلَى غَيْرِ مِيعَادٍ وَلَقَدْ شَهِدْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيْلَةَ الْعَقَبَةِ حِينَ تَوَاثَقْنَا عَلَى الإِسْلاَمِ، وَمَا أُحِبُّ أَنَّ لِي بِهَا مَشْهَدَ بَدْرٍ، وَإِنْ كَانَتْ بَدْرٌ أَذْكَرَ فِي النَّاسِ مِنْهَا، كَانَ مِنْ خَبَرِي أَنِّي لَمْ أَكُنْ قَطُّ أَقْوَى وَلاَ أَيْسَرَ حِينَ تَخَلَّفْتُ عَنْهُ فِي تِلْكَ الْغَزْوَةِ، وَاللَّهِ مَا اجْتَمَعَتْ عِنْدِي قَبْلَهُ رَاحِلَتَانِ قَطُّ حَتَّى جَمَعْتُهُمَا فِي تِلْكَ الْغَزْوَةِ، وَلَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم يُرِيدُ غَزْوَةً إِلاَّ وَرَّى بِغَيْرِهَا، حَتَّى كَانَتْ تِلْكَ الْغَزْوَةُ، غَزَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَرٍّ شَدِيدٍ، وَاسْتَقْبَلَ سَفَرًا بَعِيدًا وَمَفَازًا وَعَدُوًّا كَثِيرًا، فَجَلَّى لِلْمُسْلِمِينَ أَمْرَهُمْ لِيَتَأَهَّبُوا أُهْبَةَ غَزْوِهِمْ، فَأَخْبَرَهُمْ بِوَجْهِهِ الَّذِي يُرِيدُ، وَالْمُسْلِمُونَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم كَثِيرٌ، وَلاَ يَجْمَعُهُمْ كِتَابٌ حَافِظٌ ـ يُرِيدُ الدِّيوَانَ ـ قَالَ كَعْبٌ فَمَا رَجُلٌ يُرِيدُ أَنْ يَتَغَيَّبَ إِلاَّ ظَنَّ أَنْ سَيَخْفَى لَهُ مَا لَمْ يَنْزِلْ فِيهِ وَحْىُ اللَّهِ، وَغَزَا رَسُولُ اللَّهِ صلى الله عليه وسلم تِلْكَ الْغَزْوَةَ حِينَ طَابَتِ الثِّمَارُ وَالظِّلاَلُ، وَتَجَهَّزَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالْمُسْلِمُونَ مَعَهُ، فَطَفِقْتُ أَغْدُو لِكَىْ أَتَجَهَّزَ مَعَهُمْ فَأَرْجِعُ وَلَمْ أَقْضِ شَيْئًا، فَأَقُولُ فِي نَفْسِي أَنَا قَادِرٌ عَلَيْهِ‏.‏ فَلَمْ يَزَلْ يَتَمَادَى بِي حَتَّى اشْتَدَّ بِالنَّاسِ الْجِدُّ، فَأَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالْمُسْلِمُونَ مَعَهُ وَلَمْ أَقْضِ مِنْ جَهَازِي شَيْئًا، فَقُلْتُ أَتَجَهَّزُ بَعْدَهُ بِيَوْمٍ أَوْ يَوْمَيْنِ ثُمَّ أَلْحَقُهُمْ، فَغَدَوْتُ بَعْدَ أَنْ فَصَلُوا لأَتَجَهَّزَ، فَرَجَعْتُ وَلَمْ أَقْضِ شَيْئًا، ثُمَّ غَدَوْتُ ثُمَّ رَجَعْتُ وَلَمْ أَقْضِ شَيْئًا، فَلَمْ يَزَلْ بِي حَتَّى أَسْرَعُوا وَتَفَارَطَ الْغَزْوُ، وَهَمَمْتُ أَنْ أَرْتَحِلَ فَأُدْرِكَهُمْ، وَلَيْتَنِي فَعَلْتُ، فَلَمْ يُقَدَّرْ لِي ذَلِكَ، فَكُنْتُ إِذَا خَرَجْتُ فِي النَّاسِ بَعْدَ خُرُوجِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَطُفْتُ فِيهِمْ، أَحْزَنَنِي أَنِّي لاَ أَرَى إِلاَّ رَجُلاً مَغْمُوصًا عَلَيْهِ النِّفَاقُ أَوْ رَجُلاً مِمَّنْ عَذَرَ اللَّهُ مِنَ الضُّعَفَاءِ، وَلَمْ يَذْكُرْنِي رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى بَلَغَ تَبُوكَ، فَقَالَ وَهْوَ جَالِسٌ فِي الْقَوْمِ بِتَبُوكَ ‏\"‏ مَا فَعَلَ كَعْبٌ ‏\"‏‏.‏ فَقَالَ رَجُلٌ مِنْ بَنِي سَلِمَةَ يَا رَسُولَ اللَّهِ، حَبَسَهُ بُرْدَاهُ وَنَظَرُهُ فِي عِطْفِهِ‏.‏ فَقَالَ مُعَاذُ بْنُ جَبَلٍ بِئْسَ مَا قُلْتَ، وَاللَّهِ يَا رَسُولَ اللَّهِ، مَا عَلِمْنَا عَلَيْهِ إِلاَّ خَيْرًا‏.‏ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَ كَعْبُ بْنُ مَالِكٍ فَلَمَّا بَلَغَنِي أَنَّهُ تَوَجَّهَ قَافِلاً حَضَرَنِي هَمِّي، وَطَفِقْتُ أَتَذَكَّرُ الْكَذِبَ وَأَقُولُ بِمَاذَا أَخْرُجُ مِنْ سَخَطِهِ غَدًا وَاسْتَعَنْتُ عَلَى ذَلِكَ بِكُلِّ ذِي رَأْىٍ مِنْ أَهْلِي، فَلَمَّا قِيلَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أَظَلَّ قَادِمًا زَاحَ عَنِّي الْبَاطِلُ، وَعَرَفْتُ أَنِّي لَنْ أَخْرُجَ مِنْهُ أَبَدًا بِشَىْءٍ فِيهِ كَذِبٌ، فَأَجْمَعْتُ صِدْقَهُ، وَأَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَادِمًا، وَكَانَ إِذَا قَدِمَ مِنْ سَفَرٍ بَدَأَ بِالْمَسْجِدِ فَيَرْكَعُ فِيهِ رَكْعَتَيْنِ ثُمَّ جَلَسَ لِلنَّاسِ، فَلَمَّا فَعَلَ ذَلِكَ جَاءَهُ الْمُخَلَّفُونَ، فَطَفِقُوا يَعْتَذِرُونَ إِلَيْهِ، وَيَحْلِفُونَ لَهُ، وَكَانُوا بِضْعَةً وَثَمَانِينَ رَجُلاً فَقَبِلَ مِنْهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلاَنِيَتَهُمْ، وَبَايَعَهُمْ وَاسْتَغْفَرَ لَهُمْ، وَوَكَلَ سَرَائِرَهُمْ إِلَى اللَّهِ، فَجِئْتُهُ فَلَمَّا سَلَّمْتُ عَلَيْهِ تَبَسَّمَ تَبَسُّمَ الْمُغْضَبِ، ثُمَّ قَالَ ‏\"‏ تَعَالَ ‏\"‏‏.‏ فَجِئْتُ أَمْشِي حَتَّى جَلَسْتُ بَيْنَ يَدَيْهِ، فَقَالَ لِي ‏\"‏ مَا خَلَّفَكَ أَلَمْ تَكُنْ قَدِ ابْتَعْتَ ظَهْرَكَ ‏\"‏‏.‏ فَقُلْتُ بَلَى، إِنِّي وَاللَّهِ لَوْ جَلَسْتُ عِنْدَ غَيْرِكَ مِنْ أَهْلِ الدُّنْيَا، لَرَأَيْتُ أَنْ سَأَخْرُجُ مِنْ سَخَطِهِ بِعُذْرٍ، وَلَقَدْ أُعْطِيتُ جَدَلاً، وَلَكِنِّي وَاللَّهِ لَقَدْ عَلِمْتُ لَئِنْ حَدَّثْتُكَ الْيَوْمَ حَدِيثَ كَذِبٍ تَرْضَى بِهِ عَنِّي لَيُوشِكَنَّ اللَّهُ أَنْ يُسْخِطَكَ عَلَىَّ، وَلَئِنْ حَدَّثْتُكَ حَدِيثَ صِدْقٍ تَجِدُ عَلَىَّ فِيهِ إِنِّي لأَرْجُو فِيهِ عَفْوَ اللَّهِ، لاَ وَاللَّهِ مَا كَانَ لِي مِنْ عُذْرٍ، وَاللَّهِ مَا كُنْتُ قَطُّ أَقْوَى وَلاَ أَيْسَرَ مِنِّي حِينَ تَخَلَّفْتُ عَنْكَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَّا هَذَا فَقَدْ صَدَقَ، فَقُمْ حَتَّى يَقْضِيَ اللَّهُ فِيكَ ‏\"‏‏.‏ فَقُمْتُ وَثَارَ رِجَالٌ مِنْ بَنِي سَلِمَةَ فَاتَّبَعُونِي، فَقَالُوا لِي وَاللَّهِ مَا عَلِمْنَاكَ كُنْتَ أَذْنَبْتَ ذَنْبًا قَبْلَ هَذَا، وَلَقَدْ عَجَزْتَ أَنْ لاَ تَكُونَ اعْتَذَرْتَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِمَا اعْتَذَرَ إِلَيْهِ الْمُتَخَلِّفُونَ، قَدْ كَانَ كَافِيَكَ ذَنْبَكَ اسْتِغْفَارُ رَسُولِ اللَّهِ صلى الله عليه وسلم لَكَ، فَوَاللَّهِ مَا زَالُوا يُؤَنِّبُونِي حَتَّى أَرَدْتُ أَنْ أَرْجِعَ فَأُكَذِّبُ نَفْسِي، ثُمَّ قُلْتُ لَهُمْ هَلْ لَقِيَ هَذَا مَعِي أَحَدٌ قَالُوا نَعَمْ، رَجُلاَنِ قَالاَ مِثْلَ مَا قُلْتَ، فَقِيلَ لَهُمَا مِثْلُ مَا قِيلَ لَكَ‏.‏ فَقُلْتُ مَنْ هُمَا قَالُوا مُرَارَةُ بْنُ الرَّبِيعِ الْعَمْرِيُّ وَهِلاَلُ بْنُ أُمَيَّةَ الْوَاقِفِيُّ‏.‏ فَذَكَرُوا لِي رَجُلَيْنِ صَالِحَيْنِ قَدْ شَهِدَا بَدْرًا فِيهِمَا إِسْوَةٌ، فَمَضَيْتُ حِينَ ذَكَرُوهُمَا لِي، وَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُسْلِمِينَ عَنْ كَلاَمِنَا أَيُّهَا الثَّلاَثَةُ مِنْ بَيْنِ مَنْ تَخَلَّفَ عَنْهُ، فَاجْتَنَبَنَا النَّاسُ وَتَغَيَّرُوا لَنَا حَتَّى تَنَكَّرَتْ فِي نَفْسِي الأَرْضُ، فَمَا هِيَ الَّتِي أَعْرِفُ، فَلَبِثْنَا عَلَى ذَلِكَ خَمْسِينَ لَيْلَةً، فَأَمَّا صَاحِبَاىَ فَاسْتَكَانَا وَقَعَدَا فِي بُيُوتِهِمَا يَبْكِيَانِ، وَأَمَّا أَنَا فَكُنْتُ أَشَبَّ الْقَوْمِ وَأَجْلَدَهُمْ، فَكُنْتُ أَخْرُجُ فَأَشْهَدُ الصَّلاَةَ مَعَ الْمُسْلِمِينَ وَأَطُوفُ فِي الأَسْوَاقِ، وَلاَ يُكَلِّمُنِي أَحَدٌ، وَآتِي رَسُولَ اللَّهِ صلى الله عليه وسلم فَأُسَلِّمُ عَلَيْهِ وَهْوَ فِي مَجْلِسِهِ بَعْدَ الصَّلاَةِ، فَأَقُولُ فِي نَفْسِي هَلْ حَرَّكَ شَفَتَيْهِ بِرَدِّ السَّلاَمِ عَلَىَّ أَمْ لاَ ثُمَّ أُصَلِّي قَرِيبًا مِنْهُ فَأُسَارِقُهُ النَّظَرَ، فَإِذَا أَقْبَلْتُ عَلَى صَلاَتِي أَقْبَلَ إِلَىَّ، وَإِذَا الْتَفَتُّ نَحْوَهُ أَعْرَضَ عَنِّي، حَتَّى إِذَا طَالَ عَلَىَّ ذَلِكَ مِنْ جَفْوَةِ النَّاسِ مَشَيْتُ حَتَّى تَسَوَّرْتُ جِدَارَ حَائِطِ أَبِي قَتَادَةَ وَهْوَ ابْنُ عَمِّي وَأَحَبُّ النَّاسِ إِلَىَّ، فَسَلَّمْتُ عَلَيْهِ، فَوَاللَّهِ مَا رَدَّ عَلَىَّ السَّلاَمَ، فَقُلْتُ يَا أَبَا قَتَادَةَ، أَنْشُدُكَ بِاللَّهِ هَلْ تَعْلَمُنِي أُحِبُّ اللَّهَ وَرَسُولَهُ فَسَكَتَ، فَعُدْتُ لَهُ فَنَشَدْتُهُ فَسَكَتَ، فَعُدْتُ لَهُ فَنَشَدْتُهُ‏.‏ فَقَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ فَفَاضَتْ عَيْنَاىَ وَتَوَلَّيْتُ حَتَّى تَسَوَّرْتُ الْجِدَارَ، قَالَ فَبَيْنَا أَنَا أَمْشِي بِسُوقِ الْمَدِينَةِ إِذَا نَبَطِيٌّ مِنْ أَنْبَاطِ أَهْلِ الشَّأْمِ مِمَّنْ قَدِمَ بِالطَّعَامِ يَبِيعُهُ بِالْمَدِينَةِ يَقُولُ مَنْ يَدُلُّ عَلَى كَعْبِ بْنِ مَالِكٍ فَطَفِقَ النَّاسُ يُشِيرُونَ لَهُ، حَتَّى إِذَا جَاءَنِي دَفَعَ إِلَىَّ كِتَابًا مِنْ مَلِكِ غَسَّانَ، فَإِذَا فِيهِ أَمَّا بَعْدُ فَإِنَّهُ قَدْ بَلَغَنِي أَنَّ صَاحِبَكَ قَدْ جَفَاكَ، وَلَمْ يَجْعَلْكَ اللَّهُ بِدَارِ هَوَانٍ وَلاَ مَضْيَعَةٍ، فَالْحَقْ بِنَا نُوَاسِكَ‏.‏ فَقُلْتُ لَمَّا قَرَأْتُهَا وَهَذَا أَيْضًا مِنَ الْبَلاَءِ‏.‏ فَتَيَمَّمْتُ بِهَا التَّنُّورَ فَسَجَرْتُهُ بِهَا، حَتَّى إِذَا مَضَتْ أَرْبَعُونَ لَيْلَةً مِنَ الْخَمْسِينَ إِذَا رَسُولُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَأْتِينِي فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُكَ أَنْ تَعْتَزِلَ امْرَأَتَكَ فَقُلْتُ أُطَلِّقُهَا أَمْ مَاذَا أَفْعَلُ قَالَ لاَ بَلِ اعْتَزِلْهَا وَلاَ تَقْرَبْهَا‏.‏ وَأَرْسَلَ إِلَى صَاحِبَىَّ مِثْلَ ذَلِكَ، فَقُلْتُ لاِمْرَأَتِي الْحَقِي بِأَهْلِكِ فَتَكُونِي عِنْدَهُمْ حَتَّى يَقْضِيَ اللَّهُ فِي هَذَا الأَمْرِ‏.‏ قَالَ كَعْبٌ فَجَاءَتِ امْرَأَةُ هِلاَلِ بْنِ أُمَيَّةَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ، إِنَّ هِلاَلَ بْنَ أُمَيَّةَ شَيْخٌ ضَائِعٌ لَيْسَ لَهُ خَادِمٌ فَهَلْ تَكْرَهُ أَنْ أَخْدُمَهُ قَالَ ‏\"‏ لاَ وَلَكِنْ لاَ يَقْرَبْكِ ‏\"‏‏.‏ قَالَتْ إِنَّهُ وَاللَّهِ مَا بِهِ حَرَكَةٌ إِلَى شَىْءٍ، وَاللَّهِ مَا زَالَ يَبْكِي مُنْذُ كَانَ مِنْ أَمْرِهِ مَا كَانَ إِلَى يَوْمِهِ هَذَا‏.‏ فَقَالَ لِي بَعْضُ أَهْلِي لَوِ اسْتَأْذَنْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي امْرَأَتِكَ كَمَا أَذِنَ لاِمْرَأَةِ هِلاَلِ بْنِ أُمَيَّةَ أَنْ تَخْدُمَهُ فَقُلْتُ وَاللَّهِ لاَ أَسْتَأْذِنُ فِيهَا رَسُولَ اللَّهِ صلى الله عليه وسلم وَمَا يُدْرِينِي مَا يَقُولُ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اسْتَأْذَنْتُهُ فِيهَا وَأَنَا رَجُلٌ شَابٌّ فَلَبِثْتُ بَعْدَ ذَلِكَ عَشْرَ لَيَالٍ حَتَّى كَمَلَتْ لَنَا خَمْسُونَ لَيْلَةً مِنْ حِينِ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ كَلاَمِنَا، فَلَمَّا صَلَّيْتُ صَلاَةَ الْفَجْرِ صُبْحَ خَمْسِينَ لَيْلَةً، وَأَنَا عَلَى ظَهْرِ بَيْتٍ مِنْ بُيُوتِنَا، فَبَيْنَا أَنَا جَالِسٌ عَلَى الْحَالِ الَّتِي ذَكَرَ اللَّهُ، قَدْ ضَاقَتْ عَلَىَّ نَفْسِي، وَضَاقَتْ عَلَىَّ الأَرْضُ بِمَا رَحُبَتْ، سَمِعْتُ صَوْتَ صَارِخٍ أَوْفَى عَلَى جَبَلِ سَلْعٍ بِأَعْلَى صَوْتِهِ يَا كَعْبُ بْنَ مَالِكٍ، أَبْشِرْ‏.‏ قَالَ فَخَرَرْتُ سَاجِدًا، وَعَرَفْتُ أَنْ قَدْ جَاءَ فَرَجٌ، وَآذَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِتَوْبَةِ اللَّهِ عَلَيْنَا حِينَ صَلَّى صَلاَةَ الْفَجْرِ، فَذَهَبَ النَّاسُ يُبَشِّرُونَنَا، وَذَهَبَ قِبَلَ صَاحِبَىَّ مُبَشِّرُونَ، وَرَكَضَ إِلَىَّ رَجُلٌ فَرَسًا، وَسَعَى سَاعٍ مِنْ أَسْلَمَ فَأَوْفَى عَلَى الْجَبَلِ وَكَانَ الصَّوْتُ أَسْرَعَ مِنَ الْفَرَسِ، فَلَمَّا جَاءَنِي الَّذِي سَمِعْتُ صَوْتَهُ يُبَشِّرُنِي نَزَعْتُ لَهُ ثَوْبَىَّ، فَكَسَوْتُهُ إِيَّاهُمَا بِبُشْرَاهُ، وَاللَّهِ مَا أَمْلِكُ غَيْرَهُمَا يَوْمَئِذٍ، وَاسْتَعَرْتُ ثَوْبَيْنِ فَلَبِسْتُهُمَا، وَانْطَلَقْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَتَلَقَّانِي النَّاسُ فَوْجًا فَوْجًا يُهَنُّونِي بِالتَّوْبَةِ، يَقُولُونَ لِتَهْنِكَ تَوْبَةُ اللَّهِ عَلَيْكَ‏.‏ قَالَ كَعْبٌ حَتَّى دَخَلْتُ الْمَسْجِدَ، فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ حَوْلَهُ النَّاسُ فَقَامَ إِلَىَّ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ يُهَرْوِلُ حَتَّى صَافَحَنِي وَهَنَّانِي، وَاللَّهِ مَا قَامَ إِلَىَّ رَجُلٌ مِنَ الْمُهَاجِرِينَ غَيْرُهُ، وَلاَ أَنْسَاهَا لِطَلْحَةَ، قَالَ كَعْبٌ فَلَمَّا سَلَّمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ يَبْرُقُ وَجْهُهُ مِنَ السُّرُورِ ‏\"‏ أَبْشِرْ بِخَيْرِ يَوْمٍ مَرَّ عَلَيْكَ مُنْذُ وَلَدَتْكَ أُمُّكَ ‏\"‏‏.‏ قَالَ قُلْتُ أَمِنْ عِنْدِكَ يَا رَسُولَ اللَّهِ أَمْ مِنْ عِنْدِ اللَّهِ قَالَ ‏\"‏ لاَ، بَلْ مِنْ عِنْدِ اللَّهِ ‏\"‏‏.‏ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا سُرَّ اسْتَنَارَ وَجْهُهُ حَتَّى كَأَنَّهُ قِطْعَةُ قَمَرٍ، وَكُنَّا نَعْرِفُ ذَلِكَ مِنْهُ، فَلَمَّا جَلَسْتُ بَيْنَ يَدَيْهِ قُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِ اللَّهِ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَ ‏\"‏‏.‏ قُلْتُ فَإِنِّي أُمْسِكُ سَهْمِي الَّذِي بِخَيْبَرَ، فَقُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ اللَّهَ إِنَّمَا نَجَّانِي بِالصِّدْقِ، وَإِنَّ مِنْ تَوْبَتِي أَنْ لاَ أُحَدِّثَ إِلاَّ صِدْقًا مَا بَقِيتُ، فَوَاللَّهِ مَا أَعْلَمُ أَحَدًا مِنَ الْمُسْلِمِينَ أَبْلاَهُ اللَّهُ فِي صِدْقِ الْحَدِيثِ مُنْذُ ذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَحْسَنَ مِمَّا أَبْلاَنِي، مَا تَعَمَّدْتُ مُنْذُ ذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى يَوْمِي هَذَا كَذِبًا، وَإِنِّي لأَرْجُو أَنْ يَحْفَظَنِي اللَّهُ فِيمَا بَقِيتُ وَأَنْزَلَ اللَّهُ عَلَى رَسُولِهِ صلى الله عليه وسلم ‏{‏لَقَدْ تَابَ اللَّهُ عَلَى النَّبِيِّ وَالْمُهَاجِرِينَ‏}‏ إِلَى قَوْلِهِ ‏{‏وَكُونُوا مَعَ الصَّادِقِينَ‏}‏ فَوَاللَّهِ مَا أَنْعَمَ اللَّهُ عَلَىَّ مِنْ نِعْمَةٍ قَطُّ بَعْدَ أَنْ هَدَانِي لِلإِسْلاَمِ أَعْظَمَ فِي نَفْسِي مِنْ صِدْقِي لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنْ لاَ أَكُونَ كَذَبْتُهُ، فَأَهْلِكَ كَمَا هَلَكَ الَّذِينَ كَذَبُوا، فَإِنَّ اللَّهَ قَالَ لِلَّذِينَ كَذَبُوا حِينَ أَنْزَلَ الْوَحْىَ شَرَّ مَا قَالَ لأَحَدٍ، فَقَالَ تَبَارَكَ وَتَعَالَى ‏{‏سَيَحْلِفُونَ بِاللَّهِ لَكُمْ إِذَا انْقَلَبْتُمْ‏}‏ إِلَى قَوْلِهِ ‏{‏فَإِنَّ اللَّهَ لاَ يَرْضَى عَنِ الْقَوْمِ الْفَاسِقِينَ‏}‏‏.‏ قَالَ كَعْبٌ وَكُنَّا تَخَلَّفْنَا أَيُّهَا الثَّلاَثَةُ عَنْ أَمْرِ أُولَئِكَ الَّذِينَ قَبِلَ مِنْهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ حَلَفُوا لَهُ، فَبَايَعَهُمْ وَاسْتَغْفَرَ لَهُمْ وَأَرْجَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَمْرَنَا حَتَّى قَضَى اللَّهُ فِيهِ، فَبِذَلِكَ قَالَ اللَّهُ ‏{‏وَعَلَى الثَّلاَثَةِ الَّذِينَ خُلِّفُوا‏}‏ وَلَيْسَ الَّذِي ذَكَرَ اللَّهُ مِمَّا خُلِّفْنَا عَنِ الْغَزْوِ إِنَّمَا هُوَ تَخْلِيفُهُ إِيَّانَا وَإِرْجَاؤُهُ أَمْرَنَا عَمَّنْ حَلَفَ لَهُ وَاعْتَذَرَ إِلَيْهِ، فَقَبِلَ مِنْهُ‏.‏",
                "headingArabic": "حَدِيثُ كَعْبِ بْنِ مَالِكٍ",
                "headingUrdu": "کعب بن مالک کی روایت",
                "headingEnglish": "The narration of Ka'b bin Malik",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4210,
                "hadithNumber": "4419",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When the Prophet (ﷺ) passed by Al-Hijr, he said, \"Do not enter the dwelling places of those people who were unjust to themselves unless you enter in a weeping state lest the same calamity as of theirs should befall you.\" Then he covered his head and made his speed fast till he crossed the valley.",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم مقام حجر سے گزرے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان لوگوں کی بستیوں سے جنہوں نے اپنی جانوں پر ظلم کیا تھا، جب گزرنا ہو تو روتے ہوئے ہی گزرو، ایسا نہ ہو کہ تم پر بھی وہی عذاب آ جائے جو ان پر آیا تھا۔ پھر آپ صلی اللہ علیہ وسلم نے سر مبارک پر چادر ڈال لی اور بڑی تیزی کے ساتھ چلنے لگے، یہاں تک کہ اس وادی سے نکل آئے۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد جعفی نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا ہم کو معمر نے خبر دی، انہیں زہری نے، انہیں سالم بن عبداللہ نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ لَمَّا مَرَّ النَّبِيُّ صلى الله عليه وسلم بِالْحِجْرِ قَالَ ‏ \"‏ لاَ تَدْخُلُوا مَسَاكِنَ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ، أَنْ يُصِيبَكُمْ مَا أَصَابَهُمْ إِلاَّ أَنْ تَكُونُوا بَاكِينَ ‏\"‏‏.‏ ثُمَّ قَنَّعَ رَأْسَهُ وَأَسْرَعَ السَّيْرَ حَتَّى أَجَازَ الْوَادِيَ‏.‏",
                "headingArabic": "نُزُولُ النَّبِيِّ صلى الله عليه وسلم الْحِجْرَ",
                "headingUrdu": "الحجر میں رسول اللہ صلی اللہ علیہ وسلم کا اترنا",
                "headingEnglish": "The dismounting of the Prophet (saws) at Al-Hijr",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4211,
                "hadithNumber": "4420",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said to his companions who were at Al-Hijr, \"Do not enter upon these people who are being punished, except in a weeping state, lest the same calamity as of theirs should befall you...\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اصحاب حجر کے متعلق فرمایا کہ اس «معذب» قوم کی بستی سے جب تمہیں گزرنا ہی ہے تو تم روتے ہوئے گزرو، کہیں تم پر بھی وہ عذاب نہ آ جائے جو ان پر آیا تھا۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا ہم سے امام مالک نے بیان کیا، ان سے عبداللہ بن دینار نے بیان کیا اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَصْحَابِ الْحِجْرِ ‏ \"‏ لاَ تَدْخُلُوا عَلَى هَؤُلاَءِ الْمُعَذَّبِينَ إِلاَّ أَنْ تَكُونُوا بَاكِينَ، أَنْ يُصِيبَكُمْ مِثْلُ مَا أَصَابَهُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4212,
                "hadithNumber": "4421",
                "englishNarrator": "Narrated Mughira bin Shobah رضی اللہ عنہ :",
                "hadithEnglish": "\"The Prophet (ﷺ) went out to answer the call of nature and (when he had finished) I got up to pour water for him.\" I think that he said that the event had taken place during the Ghazwa of Tabuk. Al-Mughira added. \"The Prophet (ﷺ) washed his face, and when he wanted to wash his forearms, the sleeves of his cloak became tight over them, so he took them out from underneath the cloak and then he washed them (i.e. his forearms) and passed wet hands over his Khuffs (socks made from thick fabric or leather).\"",
                "hadithUrdu": "\"رسول اللہ صلی اللہ علیہ وسلم فطرت کی پکار پر لبیک کہنے کے لیے نکلے اور (جب آپ فارغ ہوئے تو) میں آپ کے لیے پانی ڈالنے کے لیے کھڑا ہوا۔\" میرا خیال ہے کہ انہوں نے کہا کہ یہ واقعہ غزوہ تبوک کے دوران ہوا تھا۔ المغیرہ نے مزید کہا۔ \"رسول اللہ صلی اللہ علیہ وسلم نے اپنا چہرہ دھویا، جب آپ نے اپنے بازوؤں کو دھونا چاہا تو آپ کی چادر کی آستینیں ان پر تنگ ہو گئیں، تو آپ صلی اللہ علیہ وسلم نے انہیں چادر کے نیچے سے نکال لیا، پھر آپ صلی اللہ علیہ وسلم نے انہیں دھویا اور گزر گئے۔ اس کے خفس (موٹے کپڑے یا چمڑے سے بنے موزے) پر گیلے ہاتھ۔\"",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے، ان سے عبدالعزیز بن ابی سلمہ نے، ان سے سعد بن ابراہیم نے، ان سے نافع بن جبیر نے، ان سے عروہ بن مغیرہ نے اور ان سے ان کے والد مغیرہ بن شعبہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، عَنِ اللَّيْثِ، عَنْ عَبْدِ الْعَزِيزِ بْنِ أَبِي سَلَمَةَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ ذَهَبَ النَّبِيُّ صلى الله عليه وسلم لِبَعْضِ حَاجَتِهِ، فَقُمْتُ أَسْكُبُ عَلَيْهِ الْمَاءَ ـ لاَ أَعْلَمُهُ إِلاَّ قَالَ فِي غَزْوَةِ تَبُوكَ ـ فَغَسَلَ وَجْهَهُ، وَذَهَبَ يَغْسِلُ ذِرَاعَيْهِ فَضَاقَ عَلَيْهِ كُمُّ الْجُبَّةِ، فَأَخْرَجَهُمَا مِنْ تَحْتِ جُبَّتِهِ فَغَسَلَهُمَا ثُمَّ مَسَحَ عَلَى خُفَّيْهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4213,
                "hadithNumber": "4422",
                "englishNarrator": "Narrated Abu Humaid رضی اللہ عنہ :",
                "hadithEnglish": "We returned in the company of the Prophet (ﷺ) from the Ghazwa of Tabuk, and when we looked upon Medina, the Prophet (ﷺ) said, \"This is Taba (i.e. Medina), and this is Uhud, a mountain that loves us and is loved by us.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے ساتھ ہم غزوہ تبوک سے واپس آ رہے تھے۔ جب آپ مدینہ کے قریب پہنچے تو ( مدینہ کی طرف اشارہ کر کے ) فرمایا کہ یہ «طابة» ہے اور یہ احد پہاڑ ہے، یہ ہم سے محبت رکھتا ہے اور ہم اس سے محبت رکھتے ہیں۔",
                "urduNarrator": "ہم سے خالد بن مخلد نے بیان کیا، کہا ہم سے سلیمان بن بلال نے بیان کیا، کہا کہ مجھ سے عمرو بن یحییٰ نے بیان کیا، ان سے عباس بن سہل بن سعد نے اور ان سے ابوحمید رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، قَالَ حَدَّثَنِي عَمْرُو بْنُ يَحْيَى، عَنْ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ، عَنْ أَبِي حُمَيْدٍ، قَالَ أَقْبَلْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مِنْ غَزْوَةِ تَبُوكَ حَتَّى إِذَا أَشْرَفْنَا عَلَى الْمَدِينَةِ قَالَ ‏ \"‏ هَذِهِ طَابَةُ، وَهَذَا أُحُدٌ، جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4214,
                "hadithNumber": "4423",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) returned from the Ghazwa of Tabuk, and when he approached Medina, he said, \"There are some people in Medina who were with you all the time, you did not travel any portion of the journey nor crossed any valley, but they were with you they (i.e. the people) said, \"O Allah's Messenger (ﷺ)! Even though they were at Medina?\" He said, \"Yes, because they were stopped by a genuine excuse.\"",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم غزوہ تبوک سے واپس ہوئے۔ اور مدینہ کے قریب پہنچے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ مدینہ میں بہت سے ایسے لوگ ہیں کہ جہاں بھی تم چلے اور جس وادی کو بھی تم نے قطع کیا وہ ( اپنے دل سے ) تمہارے ساتھ ساتھ تھے۔ صحابہ رضی اللہ عنہم نے عرض کیا: یا رسول اللہ! اگرچہ ان کا قیام اس وقت بھی مدینہ میں ہی رہا ہو؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں، وہ مدینہ میں رہتے ہوئے بھی ( اپنے دل سے تمہارے ساتھ تھے ) وہ کسی عذر کی وجہ سے رک گئے تھے۔",
                "urduNarrator": "ہم سے احمد بن محمد نے بیان کیا، کہا ہم کو عبداللہ بن مبارک نے خبر دی، کہا ہم کو حمید طویل نے خبر دی اور انہیں انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا حُمَيْدٌ الطَّوِيلُ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَجَعَ مِنْ غَزْوَةِ تَبُوكَ فَدَنَا مِنَ الْمَدِينَةِ فَقَالَ ‏\"‏ إِنَّ بِالْمَدِينَةِ أَقْوَامًا مَا سِرْتُمْ مَسِيرًا وَلاَ قَطَعْتُمْ وَادِيًا إِلاَّ كَانُوا مَعَكُمْ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَهُمْ بِالْمَدِينَةِ قَالَ ‏\"‏ وَهُمْ بِالْمَدِينَةِ، حَبَسَهُمُ الْعُذْرُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4215,
                "hadithNumber": "4424",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent a letter to Khosrau with `Abdullah bin Hudhafa As-Sahmi رضی اللہ عنہ and told him to hand it over to the governor of Al-Bahrain. The governor of Al-Bahrain handed it over to Khosrau, and when he read the latter, he tore it into pieces. (The sub-narrator added, \"I think that Ibn Al-Musaiyab said, 'Allah 's Apostle invoked (Allah) to tear them all totally Khosrau and his companions) into pieces.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ( شاہ فارس ) کسریٰ کے پاس اپنا خط عبداللہ بن حذافہ سہمی رضی اللہ عنہ کو دے کر بھیجا اور انہیں حکم دیا کہ یہ خط بحرین کے گورنر کو دے دیں ( جو کسریٰ کا عالم تھا ) کسریٰ نے جب آپ کا خط مبارک پڑھا تو اس کے ٹکڑے ٹکڑے کر دئیے۔ میرا خیال ہے کہ ابن مسیب نے بیان کیا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے ان کے لیے بددعا کی کہ وہ بھی ٹکڑے ٹکڑے ہو جائیں۔",
                "urduNarrator": "ہم سے اسحاق بن رباح نے بیان کیا، انہوں نے کہا ہم سے یعقوب بن ابراہیم نے بیان کیا، ان سے ان کے والد (ابراہیم بن سعد) نے بیان کیا، ان سے صالح بن کیسان نے، ان سے ابن شہاب نے بیان کیا، انہیں عبیداللہ بن عبداللہ نے خبر دی اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ بِكِتَابِهِ إِلَى كِسْرَى مَعَ عَبْدِ اللَّهِ بْنِ حُذَافَةَ السَّهْمِيِّ، فَأَمَرَهُ أَنْ يَدْفَعَهُ إِلَى عَظِيمِ الْبَحْرَيْنِ، فَدَفَعَهُ عَظِيمُ الْبَحْرَيْنِ إِلَى كِسْرَى، فَلَمَّا قَرَأَهُ مَزَّقَهُ ـ فَحَسِبْتُ أَنَّ ابْنَ الْمُسَيَّبِ قَالَ ـ فَدَعَا عَلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُمَزَّقُوا كُلَّ مُمَزَّقٍ‏.‏",
                "headingArabic": "كِتَابِ النَّبِيِّ صلى الله عليه وسلم إِلَى كِسْرَى وَقَيْصَرَ",
                "headingUrdu": "کسریٰ (خسرو) اور قیصر (قیصر) کو رسول اللہ صلی اللہ علیہ وسلم کا خط",
                "headingEnglish": "The letter of the Prophet (ﷺ) to Kisra (Khosrau) and Qaiser (Caesar)",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4216,
                "hadithNumber": "4425",
                "englishNarrator": "Narrated Abu Bakra رضی اللہ عنہ :",
                "hadithEnglish": "During the days (of the battle) of Al-Jamal, Allah benefited me with a word I had heard from Allah's Apostle after I had been about to join the Companions of Al-Jamal (i.e. the camel) and fight along with them. When Allah's Messenger (ﷺ) was informed that the Persians had crowned the daughter of Khosrau as their ruler, he said, \"Such people as ruled by a lady will never be successful.\"",
                "hadithUrdu": "جنگ جمل کے موقع پر وہ جملہ میرے کام آ گیا جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا۔ میں ارادہ کر چکا تھا کہ اصحاب جمل، عائشہ رضی اللہ عنہا اور آپ کے لشکر کے ساتھ شریک ہو کر ( علی رضی اللہ عنہ کی ) فوج سے لڑوں۔ انہوں نے بیان کیا کہ جب نبی کریم صلی اللہ علیہ وسلم کو معلوم ہوا کہ اہل فارس نے کسریٰ کی لڑکی کو وارث تخت و تاج بنایا ہے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ قوم کبھی فلاح نہیں پا سکتی جس نے اپنا حکمران کسی عورت کو بنایا ہو۔",
                "urduNarrator": "ہم سے عثمان بن ہیثم نے بیان کیا، کہا ہم سے عوف اعرابی نے بیان کیا، ان سے امام حسن بصری نے، ان سے ابوبکرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ، حَدَّثَنَا عَوْفٌ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، قَالَ لَقَدْ نَفَعَنِي اللَّهُ بِكَلِمَةٍ سَمِعْتُهَا مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم أَيَّامَ الْجَمَلِ، بَعْدَ مَا كِدْتُ أَنْ أَلْحَقَ بِأَصْحَابِ الْجَمَلِ فَأُقَاتِلَ مَعَهُمْ قَالَ لَمَّا بَلَغَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنَّ أَهْلَ فَارِسَ قَدْ مَلَّكُوا عَلَيْهِمْ بِنْتَ كِسْرَى قَالَ ‏ \"‏ لَنْ يُفْلِحَ قَوْمٌ وَلَّوْا أَمْرَهُمُ امْرَأَةً ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4217,
                "hadithNumber": "4426",
                "englishNarrator": "Narrated As-Sa'ib bin Yazid رضی اللہ عنہ :",
                "hadithEnglish": "I remember that I went out with the boys to (the place called) Thaniyat-ul-Wada` to receive Allah's Apostle . Sufyan says that once Zuhri used Sibyan instead of Ghilman.",
                "hadithUrdu": "مجھے یاد ہے جب میں بچوں کے ساتھ ثنیۃ الوداع کی طرف رسول اللہ صلی اللہ علیہ وسلم کا استقبال کرنے گیا تھا۔ سفیان نے ایک مرتبہ ( «مع الغلمان» کے بجائے ) «مع الصبيان‏.‏» بیان کیا۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا، کہا کہ میں نے زہری سے سنا، انہوں نے سائب بن یزید رضی اللہ عنہ سے سنا، وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، عَنِ السَّائِبِ بْنِ يَزِيدَ، يَقُولُ أَذْكُرُ أَنِّي خَرَجْتُ مَعَ الْغِلْمَانِ إِلَى ثَنِيَّةِ الْوَدَاعِ نَتَلَقَّى رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏ وَقَالَ سُفْيَانُ مَرَّةً مَعَ الصِّبْيَانِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4218,
                "hadithNumber": "4427",
                "englishNarrator": "Narrated As-Saib رضی اللہ عنہ :",
                "hadithEnglish": "I remember I went out with the boys to Thaniyat-ul-Wada` to receive the Prophet (ﷺ) when he returned from the Ghazwa of Tabuk.",
                "hadithUrdu": "مجھے یاد ہے، جب میں بچوں کے ساتھ نبی کریم صلی اللہ علیہ وسلم کا استقبال کرنے گیا تھا۔ آپ صلی اللہ علیہ وسلم غزوہ تبوک سے واپس تشریف لا رہے تھے۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے زہری نے اور ان سے سائب بن یزید رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنِ السَّائِبِ، أَذْكُرُ أَنِّي خَرَجْتُ مَعَ الصِّبْيَانِ نَتَلَقَّى النَّبِيَّ صلى الله عليه وسلم إِلَى ثَنِيَّةِ الْوَدَاعِ مَقْدَمَهُ مِنْ غَزْوَةِ تَبُوكَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4219,
                "hadithNumber": "4428",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) in his ailment in which he died, used to say, \"O `Aisha! I still feel the pain caused by the food I ate at Khaibar, and at this time, I feel as if my aorta is being cut from that poison.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنی بیماری میں جس میں آپ کا انتقال ہوا، فرمایا کرتے تھے کہ اے عائشہ! میں خیبر میں جو کھانا کھاتا تھا اس سے مجھے اب بھی درد محسوس ہوتا ہے اور اس وقت مجھے ایسا لگتا ہے جیسے میری شہ رگ کٹ رہی ہو۔ اس زہر سے۔\"",
                "urduNarrator": "اور یونس نے بیان کیا، ان سے زہری نے، ان سے عروہ نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ يُونُسُ عَنِ الزُّهْرِيِّ، قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ ‏ \"‏ يَا عَائِشَةُ مَا أَزَالُ أَجِدُ أَلَمَ الطَّعَامِ الَّذِي أَكَلْتُ بِخَيْبَرَ، فَهَذَا أَوَانُ وَجَدْتُ انْقِطَاعَ أَبْهَرِي مِنْ ذَلِكَ السَّمِّ ‏\"‏‏.‏",
                "headingArabic": "مَرَضِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَوَفَاتِهِ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی بیماری اور آپ کی وفات",
                "headingEnglish": "The sickness of the Prophet (saws) and his death",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4220,
                "hadithNumber": "4429",
                "englishNarrator": "Narrated Um Al-Fadl bint Al-Harith رضی اللہ عنہا :",
                "hadithEnglish": "I heard the Prophet (ﷺ) reciting Surat-al-Mursalat `Urfan (77) in the Maghrib prayer, and after that prayer he did not lead us in any prayer till he died.",
                "hadithUrdu": "میں نے سنا رسول اللہ صلی اللہ علیہ وسلم مغرب کی نماز میں «والمرسلات عرفا‏» کی قرآت کر رہے تھے، اس کے بعد پھر آپ نے ہمیں کبھی نماز نہیں پڑھائی، یہاں تک کہ اللہ تعالیٰ نے آپ کی روح قبض کر لی۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا، کہا ہم سے لیث بن سعد نے بیان کیا، ان سے عقیل نے، ان سے ابن شہاب نے، ان سے عبیداللہ بن عبداللہ نے، ان سے عبداللہ بن عباس رضی اللہ عنہما نے اور ان سے ام فضل بنت حارث رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ، قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ فِي الْمَغْرِبِ بِ ـ ‏{‏الْمُرْسَلاَتِ عُرْفًا‏}‏ ثُمَّ مَا صَلَّى لَنَا بَعْدَهَا حَتَّى قَبَضَهُ اللَّهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4221,
                "hadithNumber": "4430",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "`Umar bin Al-Khattab رضی اللہ عنہ used to let Ibn `Abbas رضی اللہ عنہما sit beside him, so `Abdur Rahman bin `Auf رضی اللہ عنہ said to `Umar رضی اللہ عنہ, \"We have sons similar to him.\" `Umar رضی اللہ عنہ replied, \"(I respect him) because of his status that you know.\" `Umar رضی اللہ عنہ  then asked Ibn `Abbas رضی اللہ عنہما about the meaning of this Holy Verse:-- \"When comes the help of Allah and the conquest of Mecca . . .\" (110.1) Ibn `Abbas رضی اللہ عنہما replied, \"That indicated the death of Allah's Messenger (ﷺ) which Allah informed him of.\" `Umar رضی اللہ عنہ said, \"I do not understand of it except what you understand.\"",
                "hadithUrdu": "عمر رضی اللہ عنہ آپ کو ( مجالس میں ) اپنے قریب بٹھاتے تھے۔ اس پر عبدالرحمٰن بن عوف رضی اللہ عنہ نے اعتراض کیا کہ اس جیسے تو ہمارے بچے ہیں۔ عمر رضی اللہ عنہ نے فرمایا کہ میں نے یہ طرز عمل جس وجہ سے اختیار کیا، وہ آپ کو معلوم بھی ہے؟ پھر عمر رضی اللہ عنہ نے ابن عباس رضی اللہ عنہما سے اس آیت ( یعنی ) «إذا جاء نصر الله والفتح‏» کے متعلق پوچھا۔ ابن عباس رضی اللہ عنہما نے جواب دیا کہ یہ رسول اللہ صلی اللہ علیہ وسلم کی وفات تھی، آپ کو اللہ تعالیٰ نے ( آیت میں ) اسی کی اطلاع دی ہے۔ عمر رضی اللہ عنہ نے فرمایا کہ جو تم نے بتایا وہی میں بھی اس آیت کے متعلق جانتا ہوں۔",
                "urduNarrator": "ہم سے محمد بن عرعرہ نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے ابوبشر نے، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ عُمَرُ بْنُ الْخَطَّابِ ـ رضى الله عنه ـ يُدْنِي ابْنَ عَبَّاسٍ فَقَالَ لَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ إِنَّ لَنَا أَبْنَاءً مِثْلَهُ‏.‏ فَقَالَ إِنَّهُ مِنْ حَيْثُ تَعْلَمُ‏.‏ فَسَأَلَ عُمَرُ ابْنَ عَبَّاسٍ عَنْ هَذِهِ الآيَةِ ‏{‏إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ‏}‏ فَقَالَ أَجَلُ رَسُولِ اللَّهِ صلى الله عليه وسلم أَعْلَمَهُ إِيَّاهُ، فَقَالَ مَا أَعْلَمُ مِنْهَا إِلاَّ مَا تَعْلَمُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4222,
                "hadithNumber": "4431",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما  :",
                "hadithEnglish": "Thursday! And how great that Thursday was! The ailment of Allah's Messenger (ﷺ) became worse (on Thursday) and he said, fetch me something so that I may write to you something after which you will never go astray.\" The people (present there) differed in this matter, and it was not right to differ before a prophet. Some said, \"What is wrong with him ? (Do you think ) he is delirious (seriously ill)? Ask him ( to understand his state ).\" So they went to the Prophet (ﷺ) and asked him again. The Prophet (ﷺ) said, \"Leave me, for my present state is better than what you call me for.\" Then he ordered them to do three things. He said, \"Turn the pagans out of the 'Arabian Peninsula; respect and give gifts to the foreign delegations as you have seen me dealing with them.\" (Sa`id bin Jubair, the sub-narrator said that Ibn `Abbas kept quiet as rewards the third order, or he said, \"I forgot it.\") (See Hadith No. 116 Vol. 1)",
                "hadithUrdu": "جمعرات کے دن کا ذکر کیا اور فرمایا معلوم بھی ہے جمعرات کے دن کیا ہوا تھا۔ رسول اللہ صلی اللہ علیہ وسلم کے مرض میں تیزی پیدا ہوئی تھی۔ اس وقت آپ نے فرمایا کہ لاؤ، میں تمہارے لیے وصیت نامہ لکھ دوں کہ تم اس پر چلو گے تو اس کے بعد پھر تم کبھی صحیح راستے کو نہ چھوڑو گے لیکن یہ سن کر وہاں اختلاف پیدا ہو گیا، حالانکہ نبی کریم صلی اللہ علیہ وسلم کے سامنے نزاع نہ ہونا چاہئیے۔ بعض لوگوں نے کہا کہ کیا آپ شدت مرض کی وجہ سے بے معنی کلام فرما رہے ہیں؟ ( جو آپ کی شان اقدس سے بعید ہے ) پھر آپ سے بات سمجھنے کی کوشش کرو۔ پس آپ سے صحابہ پوچھنے لگے۔ آپ صلی اللہ علیہ وسلم نے فرمایا جاؤ ( یہاں شور و غل نہ کرو ) میں جس کام میں مشغول ہوں، وہ اس سے بہتر ہے جس کے لیے تم کہہ رہے ہو۔ اس کے بعد آپ نے صحابہ کو تین چیزوں کی وصیت کی، فرمایا کہ مشرکین کو جزیرہ عرب سے نکال دو۔ ایلچی ( جو قبائل کے تمہارے پاس آئیں ) ان کی اس طرح خاطر کیا کرنا جس طرح میں کرتا آیا ہوں اور تیسری بات ابن عباس نے یا سعید نے بیان نہیں کی یا سعید بن جبیر نے یا سلیمان نے کہا میں تیسری بات بھول گیا۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، کہا ہم سے سفیان بن عیینہ نے بیان کیا، ان سے سلیمان احول نے، ان سے سعید بن جبیر نے بیان کیا کہ ابن عباس رضی اللہ عنہما نے",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ سُلَيْمَانَ الأَحْوَلِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قَالَ ابْنُ عَبَّاسٍ يَوْمُ الْخَمِيسِ وَمَا يَوْمُ الْخَمِيسِ اشْتَدَّ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَجَعُهُ فَقَالَ ‏\"‏ ائْتُونِي أَكْتُبْ لَكُمْ كِتَابًا لَنْ تَضِلُّوا بَعْدَهُ أَبَدًا ‏\"‏‏.‏ فَتَنَازَعُوا، وَلاَ يَنْبَغِي عِنْدَ نَبِيٍّ تَنَازُعٌ، فَقَالُوا مَا شَأْنُهُ أَهَجَرَ اسْتَفْهِمُوهُ فَذَهَبُوا يَرُدُّونَ عَلَيْهِ‏.‏ فَقَالَ ‏\"‏ دَعُونِي فَالَّذِي أَنَا فِيهِ خَيْرٌ مِمَّا تَدْعُونِي إِلَيْهِ ‏\"‏‏.‏ وَأَوْصَاهُمْ بِثَلاَثٍ قَالَ ‏\"‏ أَخْرِجُوا الْمُشْرِكِينَ مِنْ جَزِيرَةِ الْعَرَبِ، وَأَجِيزُوا الْوَفْدَ بِنَحْوِ مَا كُنْتُ أُجِيزُهُمْ ‏\"‏‏.‏ وَسَكَتَ عَنِ الثَّالِثَةِ، أَوْ قَالَ فَنَسِيتُهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4223,
                "hadithNumber": "4432",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"When Allah's Messenger (ﷺ) was on his deathbed and there were some men in the house, he said, 'Come near, I will write for you something after which you will not go astray.' Some of them ( i.e. his companions) said, 'Allah's Messenger (ﷺ) is seriously ill and you have the (Holy) Qur'an. Allah's Book is sufficient for us.' So the people in the house differed and started disputing. Some of them said, 'Give him writing material so that he may write for you something after which you will not go astray.' while the others said the other way round. So when their talk and differences increased, Allah's Apostle said, \"Get up.\" Ibn `Abbas رضی اللہ عنہما used to say, \"No doubt, it was very unfortunate (a great disaster) that Allah's Messenger (ﷺ) was prevented from writing for them that writing because of their differences and noise.\"",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم کی وفات کا وقت قریب ہوا تو گھر میں بہت سے صحابہ رضی اللہ عنہم موجود تھے۔ نبی کریم صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ لاؤ، میں تمہارے لیے ایک دستاویز لکھ دوں، اگر تم اس پر چلتے رہے تو پھر تم گمراہ نہ ہو سکو گے۔ اس پر ( عمر رضی اللہ عنہ ) نے کہا کہ نبی کریم صلی اللہ علیہ وسلم پر بیماری کی سختی ہو رہی ہے، تمہارے پاس قرآن موجود ہے۔ ہمارے لیے تو اللہ کی کتاب بس کافی ہے۔ پھر گھر والوں میں جھگڑا ہونے لگا، بعض نے تو یہ کہا کہ نبی کریم صلی اللہ علیہ وسلم کو کوئی چیز لکھنے کی دے دو کہ اس پر آپ ہدایت لکھوا دیں اور تم اس کے بعد گمراہ نہ ہو سکو۔ بعض لوگوں نے اس کے خلاف دوسری رائے پر اصرار کیا۔ جب شور و غل اور نزاع زیادہ ہوا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ یہاں سے جاؤ۔ عبیداللہ نے بیان کیا کہ ابن عباس رضی اللہ عنہما کہتے تھے کہ مصیبت سب سے بڑی یہ تھی کہ لوگوں نے اختلاف اور شور کر کے آپ صلی اللہ علیہ وسلم کو وہ ہدایت نہیں لکھنے دی۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا، انہوں نے کہا ہم سے عبدالرزاق بن ہمام نے بیان کیا، انہیں معمر نے خبر دی، انہیں زہری نے، انہیں عبیداللہ بن عبداللہ بن عتبہ نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا حُضِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَفِي الْبَيْتِ رِجَالٌ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلُمُّوا أَكْتُبْ لَكُمْ كِتَابًا لاَ تَضِلُّوا بَعْدَهُ ‏\"‏‏.‏ فَقَالَ بَعْضُهُمْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ غَلَبَهُ الْوَجَعُ وَعِنْدَكُمُ الْقُرْآنُ، حَسْبُنَا كِتَابُ اللَّهِ‏.‏ فَاخْتَلَفَ أَهْلُ الْبَيْتِ وَاخْتَصَمُوا، فَمِنْهُمْ مَنْ يَقُولُ قَرِّبُوا يَكْتُبُ لَكُمْ كِتَابًا لاَ تَضِلُّوا بَعْدَهُ‏.‏ وَمِنْهُمْ مَنْ يَقُولُ غَيْرَ ذَلِكَ، فَلَمَّا أَكْثَرُوا اللَّغْوَ وَالاِخْتِلاَفَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُومُوا ‏\"‏‏.‏ قَالَ عُبَيْدُ اللَّهِ فَكَانَ يَقُولُ ابْنُ عَبَّاسٍ إِنَّ الرَّزِيَّةَ كُلَّ الرَّزِيَّةِ مَا حَالَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ أَنْ يَكْتُبَ لَهُمْ ذَلِكَ الْكِتَابَ لاِخْتِلاَفِهِمْ وَلَغَطِهِمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4224,
                "hadithNumber": "4433, 4434",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) called Fatima رضی اللہ عنہا during his fatal illness and told her something secretly and she wept. Then he called her again and told her something secretly, and she started laughing. When we asked her about that, she said, \"The Prophet (ﷺ) first told me secretly that he would expire in that disease in which he died, so I wept; then he told me secretly that I would be the first of his family to follow him, so I laughed ( at that time).\"",
                "hadithUrdu": "مرض الموت میں رسول اللہ صلی اللہ علیہ وسلم نے فاطمہ رضی اللہ عنہا کو بلایا اور آہستہ سے کوئی بات ان سے کہی جس پر وہ رونے لگیں۔ پھر دوبارہ آہستہ سے کوئی بات کہی جس پر وہ ہنسنے لگیں۔ پھر ہم نے ان سے اس کے متعلق پوچھا تو انہوں نے بتلایا کہ نبی کریم صلی اللہ علیہ وسلم نے مجھ سے فرمایا تھا کہ آپ کی وفات اسی مرض میں ہو جائے گی، میں یہ سن کر رونے لگی۔ دوسری مرتبہ آپ صلی اللہ علیہ وسلم نے مجھ سے جب سرگوشی کی تو یہ فرمایا کہ آپ کے گھر کے آدمیوں میں سب سے پہلے میں آپ سے جا ملوں گی تو میں ہنسی تھی۔",
                "urduNarrator": "ہم سے یسرہ بن صفوان بن جمیل لخمی نے بیان کیا، کہا ہم سے ابرہیم بن سعد نے بیان کیا، ان سے ان کے والد نے، ان سے عروہ نے اور ان سے ام المؤمنین عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَسَرَةُ بْنُ صَفْوَانَ بْنِ جَمِيلٍ اللَّخْمِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَعَا النَّبِيُّ صلى الله عليه وسلم فَاطِمَةَ ـ عَلَيْهَا السَّلاَمُ ـ فِي شَكْوَاهُ الَّذِي قُبِضَ فِيهِ، فَسَارَّهَا بِشَىْءٍ، فَبَكَتْ، ثُمَّ دَعَاهَا فَسَارَّهَا بِشَىْءٍ فَضَحِكَتْ فَسَأَلْنَا عَنْ ذَلِكَ‏.‏ فَقَالَتْ سَارَّنِي النَّبِيُّ صلى الله عليه وسلم أَنَّهُ يُقْبَضُ فِي وَجَعِهِ الَّذِي تُوُفِّيَ فِيهِ فَبَكَيْتُ، ثُمَّ سَارَّنِي فَأَخْبَرَنِي أَنِّي أَوَّلُ أَهْلِهِ يَتْبَعُهُ فَضَحِكْتُ‏.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4225,
                "hadithNumber": "4435",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I Used to hear (from the Prophet) that no Prophet dies till he is given the option to select either the worldly life or the life of the Hereafter. I heard the Prophet (ﷺ) in his fatal disease, with his voice becoming hoarse, saying, \"In the company of those on whom is the grace of Allah ..( to the end of the Verse ).\" (4.69) Thereupon I thought that the Prophet (ﷺ) had been given the option.",
                "hadithUrdu": "میں سنتی آئی تھی کہ ہر نبی کو وفات سے پہلے دنیا اور آخرت کے رہنے میں اختیار دیا جاتا ہے، پھر میں نے رسول اللہ صلی اللہ علیہ وسلم سے بھی سنا، آپ اپنے مرض الموت میں فرما رہے تھے۔ آپ صلی اللہ علیہ وسلم کی آواز بھاری ہو چکی تھی۔ آپ آیت «مع الذين أنعم الله عليهم‏» کی تلاوت فرما رہے تھے ( یعنی ان لوگوں کے ساتھ جن پر اللہ نے انعام کیا ہے ) مجھے یقین ہو گیا کہ آپ کو بھی اختیار دے دیا گیا ہے۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا، کہا ہم سے غندر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے سعد نے، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَسْمَعُ أَنَّهُ لاَ يَمُوتُ نَبِيٌّ حَتَّى يُخَيَّرَ بَيْنَ الدُّنْيَا وَالآخِرَةِ، فَسَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ وَأَخَذَتْهُ بُحَّةٌ يَقُولُ ‏{‏مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ‏}‏ الآيَةَ، فَظَنَنْتُ أَنَّهُ خُيِّرَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4226,
                "hadithNumber": "4436",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "When the Prophet (ﷺ) fell ill in his fatal illness, he started saying, \"With the highest companion.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنے مرض الموت میں باربار فرماتے تھے۔ ” ( «اللهم» ) «الرفيق الأعلى» اے اللہ! مجھے میرے رفقاء ( انبیاء اور صدیقین ) میں پہنچا دے ( جو اعلیٰ علیین میں رہتے ہیں ) ۔“",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے شعبہ نے، ان سے سعد بن ابراہیم نے، ان سے عروہ بن زبیر نے اور ان سے عائشہ  رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا مَرِضَ النَّبِيُّ صلى الله عليه وسلم الْمَرَضَ الَّذِي مَاتَ فِيهِ جَعَلَ يَقُولُ ‏ \"‏ فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4227,
                "hadithNumber": "4437",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "When Allah 's Apostle was in good health, he used to say, \"Never does a prophet die unless he is shown his place in Paradise ( before his death ), and then he is made alive or given option.\" When the Prophet became ill and his last moments came while his head was on my thigh, he became unconscious, and when he came to his senses, he looked towards the roof of the house and then said, \"O Allah! (Please let me be) with the highest companion.\" Thereupon I said, \"Hence he is not going to stay with us? \" Then I came to know that his state was the confirmation of the narration he used to mention to us while he was in good health.",
                "hadithUrdu": "تندرستی کے زمانے میں رسول اللہ صلی اللہ علیہ وسلم فرمایا کرتے تھے کہ جب بھی کسی نبی کی روح قبض کی گئی تو پہلے جنت میں اس کی قیام گاہ اسے ضرور دکھا دی گئی، پھر اسے اختیار دیا گیا ( راوی کو شک تھا کہ لفظ «يحيا» ہے یا «يخير»،‏‏‏‏ دونوں کا مفہوم ایک ہی ہے ) پھر جب نبی کریم صلی اللہ علیہ وسلم بیمار پڑے اور وقت قریب آ گیا تو سر مبارک عائشہ رضی اللہ عنہا کی ران پر تھا اور آپ پر غشی طاری ہو گئی تھی، جب کچھ ہوش ہوا تو آپ کی آنکھیں گھر کی چھت کی طرف اٹھ گئیں اور آپ صلی اللہ علیہ وسلم نے فرمایا۔ «اللهم في الرفيق الأعلى» ۔ میں سمجھ گئی کہ اب نبی کریم صلی اللہ علیہ وسلم ہمیں ( یعنی دنیاوی زندگی کو ) پسند نہیں فرمائیں گے۔ مجھے وہ حدیث یاد آ گئی جو آپ صلی اللہ علیہ وسلم نے تندرستی کے زمانے میں فرمائی تھی۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا، کہا ہم کو شعیب نے خبر دی، انہیں زہری نے کہ عروہ بن زبیر نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ عُرْوَةُ بْنُ الزُّبَيْرِ إِنَّ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْوَ صَحِيحٌ يَقُولُ ‏\"‏ إِنَّهُ لَمْ يُقْبَضْ نَبِيٌّ قَطُّ حَتَّى يَرَى مَقْعَدَهُ مِنَ الْجَنَّةِ ثُمَّ يُحَيَّا أَوْ يُخَيَّرَ ‏\"‏‏.‏ فَلَمَّا اشْتَكَى وَحَضَرَهُ الْقَبْضُ وَرَأْسُهُ عَلَى فَخِذِ عَائِشَةَ غُشِيَ عَلَيْهِ، فَلَمَّا أَفَاقَ شَخَصَ بَصَرُهُ نَحْوَ سَقْفِ الْبَيْتِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏ فَقُلْتُ إِذًا لاَ يُجَاوِرُنَا‏.‏ فَعَرَفْتُ أَنَّهُ حَدِيثُهُ الَّذِي كَانَ يُحَدِّثُنَا وَهْوَ صَحِيحٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4201,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=168",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=166",
                "label": "166",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=167",
                "label": "167",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=168",
                "label": "168",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=169",
                "label": "169",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=170",
                "label": "170",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=171",
                "label": "171",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=172",
                "label": "172",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=170",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=170",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=168",
        "to": 4225,
        "total": 40465
    }
}