{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 164,
        "data": [
            {
                "id": 4078,
                "hadithNumber": "4275",
                "englishNarrator": "Narrated Ibn-e-Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) fought the Ghazwa (i.e. battles of Al-Fath during Ramadan.\" Narrated Az-Zuhri: Ibn Al-Musaiyab (also) said the same. Ibn `Abbas رضی اللہ عنہما added, \"The Prophet (ﷺ) fasted and when he reached Al-Kadid, a place where there is water between Kudaid and 'Usfan, he broke his fast and did not fast afterwards till the whole month had passed away.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے غزوہ فتح مکہ رمضان میں کیا تھا۔ زہری نے ابن سعد سے بیان کیا کہ میں نے سعید بن مسیب سے سنا کہ وہ بھی اسی طرح بیان کرتے تھے۔ زہری نے عبیداللہ سے روایت کیا ‘ ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ ( غزوہ فتح کے سفر میں جاتے ہوئے ) رسول اللہ صلی اللہ علیہ وسلم روزے سے تھے لیکن جب آپ مقام کدید پہنچے ‘ جو قدید اور عسفان کے درمیان ایک چشمہ ہے تو آپ صلی اللہ علیہ وسلم نے روزہ توڑ دیا۔ اس کے بعد نبی کریم صلی اللہ علیہ وسلم نے روزہ نہیں رکھا یہاں تک کہ رمضان کا مہینہ ختم ہو گیا۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ‘ کہا ہم سے لیث بن مسعود نے ‘ کہا کہ مجھ سے عقیل بن خالد نے بیان کیا ‘ ان سے ابن شہاب نے ‘ کہا کہ مجھے عبیداللہ بن عبداللہ بن عتبہ نے خبر دی اور انہیں ابن عباس رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم غَزَا غَزْوَةَ الْفَتْحِ فِي رَمَضَانَ‏.‏ قَالَ وَسَمِعْتُ ابْنَ الْمُسَيَّبِ يَقُولُ مِثْلَ ذَلِكَ‏.‏ وَعَنْ عُبَيْدِ اللَّهِ أَنَّ ابْنَ عَبَّاسِ ـ رضى الله عنهما ـ قَالَ صَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا بَلَغَ الْكَدِيدَ ـ الْمَاءَ الَّذِي بَيْنَ قُدَيْدٍ وَعُسْفَانَ ـ أَفْطَرَ، فَلَمْ يَزَلْ مُفْطِرًا حَتَّى انْسَلَخَ الشَّهْرُ‏.‏",
                "headingArabic": "غَزْوَةِ الْفَتْحِ فِي رَمَضَانَ",
                "headingUrdu": "رمضان المبارک میں غزوہ الفتح",
                "headingEnglish": "The Ghazwa of Al-Fath during Ramadan",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4079,
                "hadithNumber": "4276",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) left Medina (for Mecca) in the company of ten-thousand (Muslim warriors) in (the month of) Ramadan, and that was eight and a half years after his migration to Medina. He and the Muslims who were with him, proceeded on their way to Mecca. He was fasting and they were fasting, but when they reached a place called Al-Kadid which was a place of water between 'Usfan and Kudaid, he broke his fast and so did they. (Az-Zuhri said, \"One should take the last action of Allah's Messenger (ﷺ) and leave his early action (while taking a verdict.\")",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ( فتح کے لیے )رمضان کے مہینے میں مدینہ سے روانہ ہوئے۔ آپ کے ساتھ ( دس یا بارہ ہزار کا ) لشکر تھا۔ اس وقت آپ کو مدینہ میں تشریف لائے ساڑھے آٹھ سال پورے ہونے والے تھے۔ چنانچہ نبی کریم صلی اللہ علیہ وسلم اور آپ کے ساتھ جو مسلمان تھے مکہ کے لیے روانہ ہوئے۔ نبی کریم صلی اللہ علیہ وسلم بھی روزے سے تھے اور تمام مسلمان بھی ‘ لیکن جب آپ مقام کدید پر پہنچے جو قدید اور عسفان کے درمیان ایک چشمہ ہے تو آپ نے روزہ توڑ دیا اور آپ کے ساتھ مسلمانوں نے بھی روزہ توڑ دیا۔ زہری نے کہا کہ نبی کریم صلی اللہ علیہ وسلم کے سب سے آخری عمل پر ہی عمل کیا جائے گا۔",
                "urduNarrator": "مجھ سے محمود بن غیلان نے بیان کیا ‘ کہا ہم کو عبدالرزاق نے خبر دی ‘ کہا ہم کو معمر نے خبر دی ‘ کہا مجھے زہری نے خبر دی ‘ انہیں عبیداللہ بن عبداللہ اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنِي مَحْمُودٌ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنِي مَعْمَرٌ، قَالَ أَخْبَرَنِي الزُّهْرِيُّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ فِي رَمَضَانَ مِنَ الْمَدِينَةِ، وَمَعَهُ عَشَرَةُ آلاَفٍ، وَذَلِكَ عَلَى رَأْسِ ثَمَانِ سِنِينَ وَنِصْفٍ مِنْ مَقْدَمِهِ الْمَدِينَةَ، فَسَارَ هُوَ وَمَنْ مَعَهُ مِنَ الْمُسْلِمِينَ إِلَى مَكَّةَ، يَصُومُ وَيَصُومُونَ حَتَّى بَلَغَ الْكَدِيدَ ـ وَهْوَ مَاءٌ بَيْنَ عُسْفَانَ وَقُدَيْدٍ ـ أَفْطَرَ وَأَفْطَرُوا‏.‏ قَالَ الزُّهْرِيُّ وَإِنَّمَا يُؤْخَذُ مِنْ أَمْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم الآخِرُ فَالآخِرُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4080,
                "hadithNumber": "4277",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) set out towards Hunain in the month of Ramadan and some of the people were fasting while some others were not fasting, and when the Prophet (ﷺ) mounted his she-camel, he asked for a tumbler of milk or water and put it on the palm of his hand or on his she-camel and then the people looked at him; and those who were not fasting told those who were fasting, to break their fast (i.e. as the Prophet (ﷺ) had done so).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم رمضان میں حنین کی طرف تشریف لے گئے۔ مسلمانوں میں بعض حضرات تو روزے سے تھے اور بعض نے روزہ نہیں رکھا تھا لیکن جب نبی کریم صلی اللہ علیہ وسلم اپنی سواری پر پوری طرح بیٹھ گئے تو آپ نے برتن میں دودھ یا پانی طلب فرمایا اور اسے اپنی اونٹنی پر یا اپنی ہتھیلی پر رکھا ( اور پھر پی لیا ) پھر آپ نے لوگوں کو دیکھا تو جن لوگوں نے پہلے سے روزہ نہیں رکھا تھا ‘ انہوں نے روزہ داروں سے کہا کہ اب روزہ توڑ لو۔",
                "urduNarrator": "مجھ سے عیاش بن ولید نے بیان کیا ‘ کہا ہم سے عبدالاعلیٰ نے بیان کیا ‘ ان سے خالد نے بیان کیا ‘ ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنِي عَيَّاشُ بْنُ الْوَلِيدِ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم فِي رَمَضَانَ إِلَى حُنَيْنٍ، وَالنَّاسُ مُخْتَلِفُونَ فَصَائِمٌ وَمُفْطِرٌ، فَلَمَّا اسْتَوَى عَلَى رَاحِلَتِهِ دَعَا بِإِنَاءٍ مِنْ لَبَنٍ أَوْ مَاءٍ، فَوَضَعَهُ عَلَى رَاحَتِهِ أَوْ عَلَى رَاحِلَتِهِ، ثُمَّ نَظَرَ إِلَى النَّاسِ فَقَالَ الْمُفْطِرُونَ لِلصُّوَّامِ أَفْطِرُوا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4081,
                "hadithNumber": "4278",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"The Prophet (ﷺ) went (to Hunain) in the year of the Conquest (of Mecca). Moreover, Hadrat Ibn-e-Abbas رضی اللہ عنہما says that Allah's Apostle ﷺ set out  (conquering Makkah Muhammad).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سے نقل کیا۔ اور حماد نے ایوب سے روایت کیا ‘ انہوں نے عکرمہ سے ‘ انہوں نے عبداللہ بن عباس رضی اللہ عنہما سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے نقل کیا۔",
                "urduNarrator": "اور عبدالرزاق نے کہا ہم کو معمر نے خبر دی ‘ انہیں ایوب نے ‘ انہیں عکرمہ نے اور انہیں ابن عباس رضی اللہ عنہما نے",
                "hadithArabic": "وَقَالَ عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ خَرَجَ النَّبِيُّ صلى الله عليه وسلم عَامَ الْفَتْحِ‏.‏ وَقَالَ حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4082,
                "hadithNumber": "4279",
                "englishNarrator": "Narrated Ibn-e-Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) travelled in the month of Ramadan and he fasted till he reached (a place called) 'Usfan, then he asked for a tumbler of water and drank it by the daytime so that the people might see him. He broke his fast till he reached Mecca.\" Ibn `Abbas رضی اللہ عنہما used to say, \"Allah's Apostle fasted and sometimes did not fast while traveling, so one may fast or may not (on journeys)\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے رمضان میں ( فتح مکہ کا ) سفر شروع کیا۔ آپ صلی اللہ علیہ وسلم روزے سے تھے لیکن جب مقام عسفان پر پہنچے تو پانی طلب فرمایا۔ دن کا وقت تھا اور آپ نے وہ پانی پیا تاکہ لوگوں کو دکھلا سکیں پھر آپ صلی اللہ علیہ وسلم نے روزہ نہیں رکھا اور مکہ میں داخل ہوئے۔ بیان کیا کہ ابن عباس رضی اللہ عنہما کہا کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے سفر میں ( بعض اوقات ) روزہ بھی رکھا تھا اور بعض اوقات روزہ نہیں بھی رکھا۔ اس لیے ( سفر میں ) جس کا جی چاہے روزہ رکھے اور جس کا جی چاہے نہ رکھے۔ مسافر کے لیے روزہ نہ رکھنے کی اجازت ہے۔ ( روایت میں فتح مکہ کے لیے سفر کرنے کا ذکر ہے۔ یہی باب سے مطابقت ہے ) ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ کہا ہم سے جریر نے بیان کیا ‘ ان سے منصور نے ‘ ان سے مجاہد نے ‘ ان سے طاؤس نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سَافَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ، فَصَامَ حَتَّى بَلَغَ عُسْفَانَ، ثُمَّ دَعَا بِإِنَاءٍ مِنْ مَاءٍ فَشَرِبَ نَهَارًا، لِيُرِيَهُ النَّاسَ، فَأَفْطَرَ حَتَّى قَدِمَ مَكَّةَ‏.‏ قَالَ وَكَانَ ابْنُ عَبَّاسٍ يَقُولُ صَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي السَّفَرِ وَأَفْطَرَ، فَمَنْ شَاءَ صَامَ، وَمَنْ شَاءَ أَفْطَرَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4083,
                "hadithNumber": "4280",
                "englishNarrator": "Narrated Hisham's father:",
                "hadithEnglish": "When Allah's Messenger (ﷺ) set out (towards Mecca) during the year of the Conquest (of Mecca) and this news reached (the infidels of Quraish), Abu Sufyan رضی اللہ عنہ , Hakim bin Hizam and Budail bin Warqa came out to gather information about Allah's Messenger (ﷺ) , They proceeded on their way till they reached a place called Marr-az-Zahran (which is near Mecca). Behold! There they saw many fires as if they were the fires of `Arafat. Abu Sufyan رضی اللہ عنہ said, \"What is this? It looked like the fires of `Arafat.\" Budail bin Warqa' said, \"Banu `Amr are less in number than that.\" Some of the guards of Allah's Messenger (ﷺ) saw them and took them over, caught them and brought them to Allah's Messenger (ﷺ). Abu Sufyan رضی اللہ عنہ embraced Islam. When the Prophet (ﷺ) proceeded, he said to Al-Abbas رضی اللہ عنہ , \"Keep Abu Sufyan رضی اللہ عنہ standing at the top of the mountain so that he would look at the Muslims. So Al-`Abbas رضی اللہ عنہ kept him standing (at that place) and the tribes with the Prophet (ﷺ) started passing in front of Abu Sufyan رضی اللہ عنہ in military batches. A batch passed and Abu Sufyan رضی اللہ عنہ said, \"O `Abbas Who are these?\" `Abbas رضی اللہ عنہ said, \"They are (Banu) Ghifar.\" Abu Sufyan رضی اللہ عنہ said, I have got nothing to do with Ghifar.\" Then (a batch of the tribe of) Juhaina passed by and he said similarly as above. Then (a batch of the tribe of) Sa`d bin Huzaim passed by and he said similarly as above. then (Banu) Sulaim passed by and he said similarly as above. Then came a batch, the like of which Abu Sufyan رضی اللہ عنہ had not seen. He said, \"Who are these?\" `Abbas رضی اللہ عنہ said, \"They are the Ansar headed by Sa`d bin Ubada, the one holding the flag.\" Sa`d bin Ubada said, \"O Abu Sufyan! Today is the day of a great battle and today (what is prohibited in) the Ka`ba will be permissible.\" Abu Sufyan رضی اللہ عنہ said., \"O `Abbas! How excellent the day of destruction is! \"Then came another batch (of warriors) which was the smallest of all the batches, and in it there was Allah's Messenger (ﷺ) and his companions and the flag of the Prophet (ﷺ) was carried by Az-Zubair bin Al Awwam. When Allah's Messenger (ﷺ) passed by Abu Sufyan رضی اللہ عنہ , the latter said, (to the Prophet), \"Do you know what Sa`d bin 'Ubada رضی اللہ عنہ said?\" The Prophet (ﷺ) said, \"What did he say?\" Abu Sufyan رضی اللہ عنہ said, \"He said so-and-so.\" The Prophet (ﷺ) said, \"Sa`d told a lie, but today Allah will give superiority to the Ka`ba and today the Ka`ba will be covered with a (cloth) covering.\" Allah's Messenger (ﷺ) ordered that his flag be fixed at Al-Hajun. Narrated `Urwa: Nafi` bin Jubair bin Mut`im said, \"I heard Al-Abbas رضی اللہ عنہ saying to Az-Zubair bin Al- `Awwam رضی اللہ عنہ , 'O Abu `Abdullah ! Did Allah's Messenger (ﷺ) order you to fix the flag here?' \" Allah's Messenger (ﷺ) ordered Khalid bin Al-Walid رضی اللہ عنہ to enter Mecca from its upper part from Ka'da while the Prophet (ﷺ) himself entered from Kuda. Two men from the cavalry of Khalid bin Al-Wahd رضی اللہ عنہ named Hubaish bin Al-Ash'ar and Kurz bin Jabir Al-Fihri were martyred on that day.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم فتح مکہ کے لیے روانہ ہوئے تو قریش کو اس کی خبر مل گئی تھی۔، چنانچہ ابوسفیان بن حرب ‘ حکیم بن حزام اور بدیل بن ورقاء نبی کریم صلی اللہ علیہ وسلم کے بارے میں معلومات کے لیے مکہ سے نکلے۔ یہ لوگ چلتے چلتے مقام مر الظہران پر جب پہنچے تو انہیں جگہ جگہ آگ جلتی ہوئی دکھائی دی۔ ایسا معلوم ہوتا تھا کہ مقام عرفات کی آگ ہے۔ ابوسفیان نے کہا یہ آگ کیسی ہے؟ یہ عرفات کی آگ کی طرح دکھائی دیتی ہے۔ اس پر بدیل بن ورقاء نے کہا کہ یہ بنی عمرو ( یعنی قباء کے قبیلے ) کی آگ ہے۔ ابوسفیان نے کہا کہ بنی عمرو کی تعداد اس سے بہت کم ہے۔ اتنے میں نبی کریم صلی اللہ علیہ وسلم کے محافظ دستے نے انہیں دیکھ لیا اور ان کو پکڑ کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں لائے ‘ پھر ابوسفیان رضی اللہ عنہ نے اسلام قبول کیا۔ اس کے بعد جب نبی کریم صلی اللہ علیہ وسلم آگے ( مکہ کی طرف ) بڑھے تو عباس رضی اللہ عنہ سے فرمایا کہ ابوسفیان کو ایسی جگہ پر روکے رکھو جہاں گھوڑوں کا جاتے وقت ہجوم ہو تاکہ وہ مسلمانوں کی فوجی قوت کو دیکھ لیں۔ چنانچہ عباس رضی اللہ عنہ انہیں ایسے ہی مقام پر روک کر کھڑے ہو گئے اور نبی کریم صلی اللہ علیہ وسلم کے ساتھ قبائل کے دستے ایک ایک کر کے ابوسفیان کے سامنے سے گزرنے لگے۔ ایک دستہ گزرا تو انہوں نے پوچھا: عباس! یہ کون ہیں؟ انہوں نے بتایا کہ یہ قبیلہ غفار ہے۔ ابوسفیان نے کہا کہ مجھے غفار سے کیا سروکار ‘ پھر قبیلہ جہینہ گزرا تو ان کے متعلق بھی انہوں نے یہی کہا ‘ قبیلہ سلیم گزرا تو ان کے متعلق بھی یہی کہا۔ آخر ایک دستہ سامنے آیا۔ اس جیسا فوجی دستہ نہیں دیکھا گیا ہو گا۔ ابوسفیان رضی اللہ عنہ نے پوچھا یہ کون لوگ ہیں؟ عباس رضی اللہ عنہ نے کہا کہ یہ انصار کا دستہ ہے۔ سعد بن عبادہ رضی اللہ عنہ اس کے امیر ہیں اور انہیں کے ہاتھ میں ( انصار کا عَلم ہے ) سعد بن عبادہ رضی اللہ عنہ نے کہا: ابوسفیان! آج کا دن قتل عام کا دن ہے۔ آج کعبہ میں بھی لڑنا درست کر دیا گیا ہے۔ ابوسفیان رضی اللہ عنہ اس پر بولے: اے عباس! ( قریش کی ہلاکت و بربادی کا دن اچھا آ لگا ہے۔ پھر ایک اور دستہ آیا یہ سب سے چھوٹا دستہ تھا۔ اس میں رسول اللہ صلی اللہ علیہ وسلم اور آپ کے صحابہ رضی اللہ عنہم تھے۔ نبی کریم صلی اللہ علیہ وسلم کا عَلم زبیر بن العوام رضی اللہ عنہ اٹھائے ہوئے تھے۔ جب نبی کریم صلی اللہ علیہ وسلم ابوسفیان کے قریب سے گزرے تو انہوں نے کہا آپ کو معلوم نہیں ‘ سعد بن عبادہ رضی اللہ عنہ کیا کہہ گئے ہیں۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ انہوں نے کیا کہا ہے؟ تو ابوسفیان نے بتایا کہ یہ یہ کہہ گئے ہیں کہ آپ قریش کا کام تمام کر دیں گے۔ ( سب کو قتل کر ڈالیں گے ) ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ سعد نے غلط کہا ہے بلکہ آج کا دن وہ ہے جس میں اللہ کعبہ کی عظمت اور زیادہ کر دے گا۔ آج کعبہ کو غلاف پہنایا جائے گا۔ عروہ نے بیان کیا پھر آپ صلی اللہ علیہ وسلم نے حکم دیا کہ آپ کا عَلم مقام جحون میں گاڑ دیا جائے۔ عروہ نے بیان کیا اور مجھے نافع بن جبیر بن مطعم نے خبر دی ‘ کہا کہ میں نے عباس رضی اللہ عنہ سے سنا ‘ انہوں نے زبیر بن عوام رضی اللہ عنہ سے کہا ( فتح مکہ کے بعد ) کہ نبی کریم صلی اللہ علیہ وسلم نے ان کو یہیں جھنڈا گاڑنے کے لیے حکم فرمایا تھا۔ راوی نے بیان کیا کہ اس دن نبی کریم صلی اللہ علیہ وسلم نے خالد بن ولید رضی اللہ عنہ کو حکم دیا تھا کہ مکہ کے بالائی علاقہ کداء کی طرف سے داخل ہوں اور خود نبی کریم صلی اللہ علیہ وسلم کداء ( نشیبی علاقہ ) کی طرف سے داخل ہوئے۔ اس دن خالد رضی اللہ عنہ کے دستہ کے دو صحابی ‘ حبیش بن اشعر اور کرز بن جابر فہری شہید ہوئے تھے۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ ان سے ہشام بن عروہ نے ‘ ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، قَالَ لَمَّا سَارَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ فَبَلَغَ ذَلِكَ قُرَيْشًا، خَرَجَ أَبُو سُفْيَانَ بْنُ حَرْبٍ وَحَكِيمُ بْنُ حِزَامٍ وَبُدَيْلُ بْنُ وَرْقَاءَ يَلْتَمِسُونَ الْخَبَرَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَقْبَلُوا يَسِيرُونَ حَتَّى أَتَوْا مَرَّ الظَّهْرَانِ، فَإِذَا هُمْ بِنِيرَانٍ كَأَنَّهَا نِيرَانُ عَرَفَةَ، فَقَالَ أَبُو سُفْيَانَ مَا هَذِهِ لَكَأَنَّهَا نِيرَانُ عَرَفَةَ‏.‏ فَقَالَ بُدَيْلُ بْنُ وَرْقَاءَ نِيرَانُ بَنِي عَمْرٍو‏.‏ فَقَالَ أَبُو سُفْيَانَ عَمْرٌو أَقَلُّ مِنْ ذَلِكَ‏.‏ فَرَآهُمْ نَاسٌ مِنْ حَرَسِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَدْرَكُوهُمْ فَأَخَذُوهُمْ، فَأَتَوْا بِهِمْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَسْلَمَ أَبُو سُفْيَانَ، فَلَمَّا سَارَ قَالَ لِلْعَبَّاسِ ‏\"‏ احْبِسْ أَبَا سُفْيَانَ عِنْدَ حَطْمِ الْخَيْلِ حَتَّى يَنْظُرَ إِلَى الْمُسْلِمِينَ ‏\"‏‏.‏ فَحَبَسَهُ الْعَبَّاسُ، فَجَعَلَتِ الْقَبَائِلُ تَمُرُّ مَعَ النَّبِيِّ صلى الله عليه وسلم تَمُرُّ كَتِيبَةً كَتِيبَةً عَلَى أَبِي سُفْيَانَ، فَمَرَّتْ كَتِيبَةٌ قَالَ يَا عَبَّاسُ مَنْ هَذِهِ قَالَ هَذِهِ غِفَارُ‏.‏ قَالَ مَا لِي وَلِغِفَارَ ثُمَّ مَرَّتْ جُهَيْنَةُ، قَالَ مِثْلَ ذَلِكَ، ثُمَّ مَرَّتْ سَعْدُ بْنُ هُذَيْمٍ، فَقَالَ مِثْلَ ذَلِكَ، وَمَرَّتْ سُلَيْمُ، فَقَالَ مِثْلَ ذَلِكَ، حَتَّى أَقْبَلَتْ كَتِيبَةٌ لَمْ يَرَ مِثْلَهَا، قَالَ مَنْ هَذِهِ قَالَ هَؤُلاَءِ الأَنْصَارُ عَلَيْهِمْ سَعْدُ بْنُ عُبَادَةَ مَعَهُ الرَّايَةُ‏.‏ فَقَالَ سَعْدُ بْنُ عُبَادَةَ يَا أَبَا سُفْيَانَ الْيَوْمُ يَوْمُ الْمَلْحَمَةِ، الْيَوْمَ تُسْتَحَلُّ الْكَعْبَةُ‏.‏ فَقَالَ أَبُو سُفْيَانَ يَا عَبَّاسُ حَبَّذَا يَوْمُ الذِّمَارِ‏.‏ ثُمَّ جَاءَتْ كَتِيبَةٌ، وَهْىَ أَقَلُّ الْكَتَائِبِ، فِيهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَصْحَابُهُ، وَرَايَةُ النَّبِيِّ صلى الله عليه وسلم مَعَ الزُّبَيْرِ بْنِ الْعَوَّامِ، فَلَمَّا مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِأَبِي سُفْيَانَ قَالَ أَلَمْ تَعْلَمْ مَا قَالَ سَعْدُ بْنُ عُبَادَةَ قَالَ ‏\"‏ مَا قَالَ ‏\"‏‏.‏ قَالَ كَذَا وَكَذَا‏.‏ فَقَالَ ‏\"‏ كَذَبَ سَعْدٌ، وَلَكِنْ هَذَا يَوْمٌ يُعَظِّمُ اللَّهُ فِيهِ الْكَعْبَةَ، وَيَوْمٌ تُكْسَى فِيهِ الْكَعْبَةُ ‏\"‏‏.‏ قَالَ وَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُرْكَزَ رَايَتُهُ بِالْحَجُونِ‏.‏ قَالَ عُرْوَةُ وَأَخْبَرَنِي نَافِعُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ قَالَ سَمِعْتُ الْعَبَّاسَ يَقُولُ لِلزُّبَيْرِ بْنِ الْعَوَّامِ يَا أَبَا عَبْدِ اللَّهِ، هَا هُنَا أَمَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تَرْكُزَ الرَّايَةَ، قَالَ وَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ خَالِدَ بْنَ الْوَلِيدِ أَنْ يَدْخُلَ مِنْ أَعْلَى مَكَّةَ مِنْ كَدَاءٍ، وَدَخَلَ النَّبِيُّ صلى الله عليه وسلم مِنْ كُدَا، فَقُتِلَ مِنْ خَيْلِ خَالِدٍ يَوْمَئِذٍ رَجُلاَنِ حُبَيْشُ بْنُ الأَشْعَرِ وَكُرْزُ بْنُ جَابِرٍ الْفِهْرِيُّ‏.‏",
                "headingArabic": "أَيْنَ رَكَزَ النَّبِيُّ صلى الله عليه وسلم الرَّايَةَ يَوْمَ الْفَتْحِ",
                "headingUrdu": "فتح مکہ کے دن رسول اللہ صلی اللہ علیہ وسلم نے جھنڈا کہاں لگایا تھا؟",
                "headingEnglish": "Where did the Prophet (saws) fix the flag on the day of the conquest of Makkah?",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4084,
                "hadithNumber": "4281",
                "englishNarrator": "Narrated `Abdullah bin Mughaffal رضی اللہ عنہ :",
                "hadithEnglish": "I saw Allah's Messenger (ﷺ) on the day of the Conquest of Mecca over his she-camel, reciting Surat-al-Fath in a vibrant quivering tone. (The sub-narrator, Mu'awiya رضی اللہ عنہ added, \"Were I not afraid that the people may gather around me, I would recite in vibrant quivering tone as he (i.e. `Abdullah bin Mughaffal رضی اللہ عنہ) did, imitating Allah's Messenger (ﷺ).\")",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم فتح مکہ کے موقع پر اپنے اونٹ پر سوار ہیں اور خوش الحانی کے ساتھ سورۃ الفتح کی تلاوت فرما رہے ہیں۔ معاویہ بن قرہ رضی اللہ عنہ نے کہا کہ اگر اس کا خطرہ نہ ہوتا کہ لوگ مجھے گھیر لیں گے تو میں بھی اسی طرح تلاوت کر کے دکھاتا جیسے عبداللہ بن مغفل رضی اللہ عنہ نے پڑھ کر سنایا تھا۔",
                "urduNarrator": "ہم سے ابوالولید نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے معاویہ بن قرہ نے بیان کیا ‘ انہوں نے عبداللہ بن مغفل رضی اللہ عنہ سے سنا ‘ انہوں نے بیان کیا کہ میں نے دیکھا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُغَفَّلٍ، يَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَوْمَ فَتْحِ مَكَّةَ عَلَى نَاقَتِهِ، وَهْوَ يَقْرَأُ سُورَةَ الْفَتْحِ يُرَجِّعُ، وَقَالَ لَوْلاَ أَنْ يَجْتَمِعَ النَّاسُ حَوْلِي لَرَجَّعْتُ كَمَا رَجَّعَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4085,
                "hadithNumber": "4282, 4283",
                "englishNarrator": "Narrated Usama bin Zaid رضی اللہ عنہما :",
                "hadithEnglish": "During the Conquest (of Mecca), \"O Allah's Messenger (ﷺ)! Where will we encamp tomorrow?\" The Prophet (ﷺ) said, \"But has `Aqil left for us any house to lodge in?\" He then added, \"No believer will inherit an infidel's property, and no infidel will inherit the property of a believer.\" Az- Zuhri was asked, \"Who inherited Abu Talib?\" Az-Zuhri replied, \"Aqeel and Talib inherited him.\" Mamar has reported from Zuhri: It was the time of Hajj when it was asked: Where will we stay tomorrow? Whereas the report of Younus, mention neither Hajj nor the Conquest if Makkah.",
                "hadithUrdu": "فتح مکہ کے سفر میں انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا: یا رسول اللہ! کل ( مکہ میں ) آپ کہاں قیام فرمائیں گے؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ہمارے لیے عقیل نے کوئی گھر ہی کہاں چھوڑا ہے۔پھر مزید فرمایا کہ کوئی مومن کسی کافر کے مال کا وارث نہیں ہوگا اور کوئی کافر مومن کی جائیداد کا وارث نہیں ہوگا۔ یہ زہری سے کہا گیا اور جس نے ابو طالب کو میراث دیا اس نے کہا: عقیل اور طالب اس کے وارث ہوئے۔ الزہری کا اختیار، \"تم کل کہاں رہو گے؟\" اس کے ثبوت میں، اور یونس نے اس کی دلیل نہیں کہی اور نہ ہی فتح کا وقت۔\r\n\"",
                "urduNarrator": "ہم سے سلیمان بن عبدالرحمٰن نے بیان کیا ‘ کہا ہم سے سعدان بن یحییٰ نے بیان کیا ‘ کہا ہم سے محمد بن ابی حفصہ نے بیان کیا ‘ کہا ان سے زہری نے ‘ ان سے زین العابدین علی بن حسین نے ‘ ان سے عمرو بن عثمان نے اور ان سے اسامہ بن زید رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا سَعْدَانُ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي حَفْصَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ عَمْرِو بْنِ عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّهُ قَالَ زَمَنَ الْفَتْحِ يَا رَسُولَ اللَّهِ، أَيْنَ تَنْزِلُ غَدًا قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَهَلْ تَرَكَ لَنَا عَقِيلٌ مِنْ مَنْزِلٍ ‏\"‏‏. ثُمَّ قَالَ ‏\"‏ لاَ يَرِثُ الْمُؤْمِنُ الْكَافِرَ، وَلاَ يَرِثُ الْكَافِرُ الْمُؤْمِنَ ‏\"‏‏.‏ قِيلَ لِلزُّهْرِيِّ وَمَنْ وَرِثَ أَبَا طَالِبٍ قَالَ وَرِثَهُ عَقِيلٌ وَطَالِبٌ‏.‏ قَالَ مَعْمَرٌ عَنِ الزُّهْرِيِّ أَيْنَ تَنْزِلُ غَدًا‏.‏ فِي حَجَّتِهِ، وَلَمْ يَقُلْ يُونُسُ حَجَّتِهِ وَلاَ زَمَنَ الْفَتْحِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4086,
                "hadithNumber": "4284",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If Allah makes us victorious, our encamping place will be Al-Khaif, the place where the infidels took an oath to be loyal to Heathenism (by boycotting Banu Hashim, the Prophet's folk).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”ان شاءاللہ ہماری قیام گاہ اگر اللہ تعالیٰ نے فتح عنایت فرمائی تو خیف بنی کنانہ میں ہو گی۔ جہاں قریش نے کفر کی حمایت کے لیے قسم کھائی تھی۔“",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ‘ انہوں نے کہا ہم سے شعیب نے بیان کیا ‘ انہوں نے کہا ہم سے ابوالزناد نے بیان کیا ‘ ان سے عبدالرحمٰن نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْزِلُنَا ـ إِنْ شَاءَ اللَّهُ، إِذَا فَتَحَ اللَّهُ ـ الْخَيْفُ، حَيْثُ تَقَاسَمُوا عَلَى الْكُفْرِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4087,
                "hadithNumber": "4285",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) intended to carry on the Ghazwa of Hunain, he said, \"Tomorrow, if Allah wished, our encamping) plaice will be Khaif Bani Kinana where (the infidels) took an oath to be loyal to Heathenism.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے جب حنین کا ارادہ کیا تو فرمایا ”ان شاءاللہ کل ہمارا قیام خیف بنی کنانہ میں ہو گا جہاں قریش نے کفر کے لیے قسم کھائی تھی۔“",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ‘ انہوں نے کہا ہم کو ابن شہاب نے خبر دی ‘ انہیں ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ أَرَادَ حُنَيْنًا ‏ \"‏ مَنْزِلُنَا غَدًا إِنْ شَاءَ اللَّهُ بِخَيْفِ بَنِي كِنَانَةَ، حَيْثُ تَقَاسَمُوا عَلَى الْكُفْرِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4088,
                "hadithNumber": "4286",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "On the day of the Conquest, the Prophet (ﷺ) entered Mecca, wearing a helmet on his head. When he took it off, a man came and said, \"Ibn Khatal is clinging to the curtain of the Ka`ba.\" The Prophet (ﷺ) said, \"Kill him.\" (Malik a sub-narrator said, \"On that day the Prophet (ﷺ) was not in a state of Ihram as it appeared to us, and Allah knows better.\")",
                "hadithUrdu": "فتح مکہ کے موقع پر جب نبی کریم صلی اللہ علیہ وسلم مکہ میں داخل ہوئے تو سر مبارک پر خود تھی۔ آپ صلی اللہ علیہ وسلم نے اسے اتارا ہی تھا کہ ایک صحابی نے آ کر عرض کیا کہ ابن خطل کعبہ کے پردہ سے چمٹا ہوا ہے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اسے ( وہیں ) قتل کر دو۔ امام مالک رحمہ اللہ نے کہا جیسا کہ ہم سمجھتے ہیں آگے اللہ جانے ‘ نبی کریم صلی اللہ علیہ وسلم اس دن احرام باندھے ہوئے نہیں تھے۔",
                "urduNarrator": "ہم سے یحییٰ بن قزعہ نے بیان کیا ‘ کہا ہم سے مالک نے بیان کیا ‘ ان سے ابن شہاب نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ مَكَّةَ يَوْمَ الْفَتْحِ وَعَلَى رَأْسِهِ الْمِغْفَرُ، فَلَمَّا نَزَعَهُ جَاءَ رَجُلٌ فَقَالَ ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ‏.‏ فَقَالَ ‏ \"‏ اقْتُلْهُ ‏\"‏ قَالَ مَالِكٌ وَلَمْ يَكُنِ النَّبِيُّ صلى الله عليه وسلم فِيمَا نُرَى وَاللَّهُ أَعْلَمُ يَوْمَئِذٍ مُحْرِمًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4089,
                "hadithNumber": "4287",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "When the Prophet (ﷺ) entered Mecca on the day of the Conquest, there were 360 idols around the Ka`ba. The Prophet (ﷺ) started striking them with a stick he had in his hand and was saying, \"Truth has come and Falsehood will neither start nor will it reappear. And: ''the truth has come falsehood neither originates nor be restored.''",
                "hadithUrdu": "فتح مکہ کے دن جب نبی کریم صلی اللہ علیہ وسلم مکہ میں داخل ہوئے تو بیت اللہ کے چاروں طرف تین سو ساٹھ بت تھے۔ نبی کریم صلی اللہ علیہ وسلم ایک چھڑی سے جو دست مبارک میں تھی ‘ مارتے جاتے تھے اور اس آیت کی تلاوت کرتے جاتے «جاء الحق وزهق الباطل،‏‏‏‏ ‏‏‏‏ جاء الحق،‏‏‏‏ ‏‏‏‏ وما يبدئ الباطل وما يعيد» کہ ”حق قائم ہو گیا اور باطل مغلوب ہو گیا ‘ حق قائم ہو گیا اور باطل سے نہ شروع میں کچھ ہو سکا ہے نہ آئندہ کچھ ہو سکتا ہے۔“",
                "urduNarrator": "ہم سے صدقہ بن فضل نے بیان کیا ‘ کہا ہم کو سلیمان بن عیینہ نے خبر دی ‘ انہیں ابن ابی نجیح نے ‘ انہیں مجاہد نے ‘ انہیں ابومعمر نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ دَخَلَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ يَوْمَ الْفَتْحِ وَحَوْلَ الْبَيْتِ سِتُّونَ وَثَلاَثُمِائَةِ نُصُبٍ، فَجَعَلَ يَطْعُنُهَا بِعُودٍ فِي يَدِهِ وَيَقُولُ ‏ \"‏ جَاءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ، جَاءَ الْحَقُّ، وَمَا يُبْدِئُ الْبَاطِلُ وَمَا يُعِيدُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4090,
                "hadithNumber": "4288",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) arrived in Mecca, he refused to enter the Ka`ba while there were idols in it. So he ordered that they be taken out. The pictures of the (Prophets) Abraham and Ishmael, holding arrows of divination in their hands, were carried out. The Prophet (ﷺ) said, \"May Allah ruin them (i.e. the infidels) for they knew very well that they (i.e. Abraham and Ishmael) never drew lots by these (divination arrows). Then the Prophet (ﷺ) entered the Ka`ba and said. \"Allahu Akbar\" in all its directions and came out and not offer any prayer therein. Mamar has also reported the same from Ayyub. And Wohaib said: Ayyub has narrated it to us from Ikrimah and he from the prophet (ﷺ) .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب مکہ آئے تو بیت اللہ میں اس وقت تک داخل نہیں ہوئے جب تک اس میں بت موجود رہے بلکہ آپ نے حکم دیا تو بتوں کو باہر نکال دیا گیا۔ انہیں میں ایک تصویر ابراہیم اور اسماعیل علیہما السلام کی بھی تھی اور ان کے ہاتھوں میں ( پانسہ ) کے تیر تھے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ ان مشرکین کا ناس کرے ‘ انہیں خوب معلوم تھا کہ ان بزرگوں نے کبھی پانسہ نہیں پھینکا۔ پھر آپ صلی اللہ علیہ وسلم بیت اللہ میں داخل ہوئے اور اندر چاروں طرف تکبیر کہی پھر باہر تشریف لائے۔ آپ صلی اللہ علیہ وسلم نے اندر نماز نہیں پڑھی تھی۔ عبدالصمد کے ساتھ اس حدیث کو معمر نے بھی ایوب سے روایت کیا اور وہیب بن خالد نے یوں کہا ‘ ہم سے ایوب نے بیان کیا ‘ انہوں نے عکرمہ سے ‘ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے۔",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا ‘ کہا ہم سے عبدالصمد نے بیان کیا ‘ کہا کہ مجھ سے میرے والد عبدالوارث نے بیان کیا ‘ ان سے ایوب سختیانی نے بیان کیا ‘ ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنِي أَبِي، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا قَدِمَ مَكَّةَ أَبَى أَنْ يَدْخُلَ الْبَيْتَ وَفِيهِ الآلِهَةُ، فَأَمَرَ بِهَا فَأُخْرِجَتْ، فَأُخْرِجَ صُورَةُ إِبْرَاهِيمَ، وَإِسْمَاعِيلَ فِي أَيْدِيهِمَا مِنَ الأَزْلاَمِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ قَاتَلَهُمُ اللَّهُ لَقَدْ عَلِمُوا مَا اسْتَقْسَمَا بِهَا قَطُّ ‏\"‏‏.‏ ثُمَّ دَخَلَ الْبَيْتَ، فَكَبَّرَ فِي نَوَاحِي الْبَيْتِ، وَخَرَجَ وَلَمْ يُصَلِّ فِيهِ‏.‏ تَابَعَهُ مَعْمَرٌ عَنْ أَيُّوبَ‏.‏ وَقَالَ وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4091,
                "hadithNumber": "4289",
                "englishNarrator": "Narrated 'Abdullãh bin 'Umar (رضی اللہ عنہما):",
                "hadithEnglish": "Allah's Messenger (ﷺ) entered Makkah through its upper part and he was riding his she-camel. Usãma bin Zaid رضی اللہ عنہما was his Companion-rider behind him (on the same she-camel). In his company were Bilãl رضی اللہ عنہ and 'Uthmãn bin Talha رضی اللہ عنہ , who was one of the Al-Hajabah (who keep the key of the gate of the Ka'bah). When he made his she-camel kneel down in the Mosque (i.e., Al-Masjid al-Haram), he ordered him (i.e., 'Uthman) to bring the key of the Ka'bah. Then Allah's Messenger (ﷺ) entered the Ka'bah along with 'Usãma bin Zaid, Bilãl and 'Uthmãn bin Talha رضی اللہ عنہ , and he stayed in it for a long period and then came out. The people rushed (to get in) and `Abdullãh bin 'Umar رضی اللہ عنہما was the first to enter and he found Bilãl رضی اللہ عنہ standing behind the door. Ibn `Umar asked Bilãl, \"Where did Allah's Messenger (ﷺ) offer the Salat (prayer)?\" Bilãl showed him the place where he (ﷺ) had offered Salat (prayer). `Abdullah رضی اللہ عنہما later on said, \"I forgot to ask Bilãl how many prostrations (i.e., Rak'a) the Prophet offered.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنی سواری پر فتح مکہ کے دن مکہ کے بالائی علاقہ کی طرف سے شہر میں داخل ہوئے۔ اسامہ بن زید رضی اللہ عنہما آپ کی سواری پر آپ صلی اللہ علیہ وسلم کے پیچھے بیٹھے ہوئے تھے۔ آپ کے ساتھ بلال رضی اللہ عنہ اور کعبہ کے حاجب عثمان بن طلحہ رضی اللہ عنہ بھی تھے۔ آخر اپنے اونٹ کو آپ نے مسجد ( کے قریب باہر ) بٹھایا اور بیت اللہ کی کنجی لانے کا حکم دیا پھر آپ بیت اللہ کے اندر تشریف لے گئے۔ آپ کے ساتھ اسامہ بن زید ‘ بلال اور عثمان بن طلحہ رضی اللہ عنہم بھی تھے۔ آپ اندر کافی دیر تک ٹھہرے ‘ جب باہر تشریف لائے تو لوگ جلدی سے آگے بڑھے۔ عبداللہ بن عمر رضی اللہ عنہما سب سے پہلے اندر جانے والوں میں تھے۔ انہوں نے بیت اللہ کے دروازے کے پیچھے بلال رضی اللہ عنہ کو کھڑے ہوئے دیکھا اور ان سے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم نے کہاں نماز پڑھی تھی۔ انہوں نے وہ جگہ بتلائی جہاں آپ صلی اللہ علیہ وسلم نے نماز پڑھی تھی۔ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ میں یہ پوچھنا بھول گیا کہ نبی کریم صلی اللہ علیہ وسلم نے نماز میں کتنی رکعتیں پڑھی تھیں۔",
                "urduNarrator": "اور لیث نے بیان کیا کہ مجھ سے یونس نے بیان کیا ‘ کہا کہ مجھے نافع نے خبر دی اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَقْبَلَ يَوْمَ الْفَتْحِ مِنْ أَعْلَى مَكَّةَ عَلَى رَاحِلَتِهِ، مُرْدِفًا أُسَامَةَ بْنَ زَيْدٍ وَمَعَهُ بِلاَلٌ وَمَعَهُ عُثْمَانُ بْنُ طَلْحَةَ، مِنَ الْحَجَبَةِ حَتَّى أَنَاخَ فِي الْمَسْجِدِ، فَأَمَرَهُ أَنْ يَأْتِيَ بِمِفْتَاحِ الْبَيْتِ، فَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَعَهُ أُسَامَةُ بْنُ زَيْدٍ وَبِلاَلٌ وَعُثْمَانُ بْنُ طَلْحَةَ، فَمَكَثَ فِيهِ نَهَارًا طَوِيلاً ثُمَّ خَرَجَ، فَاسْتَبَقَ النَّاسُ، فَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ أَوَّلَ مَنْ دَخَلَ، فَوَجَدَ بِلاَلاً وَرَاءَ الْبَابِ قَائِمًا، فَسَأَلَهُ أَيْنَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَشَارَ لَهُ إِلَى الْمَكَانِ الَّذِي صَلَّى فِيهِ‏.‏ قَالَ عَبْدُ اللَّهِ فَنَسِيتُ أَنْ أَسْأَلَهُ كَمْ صَلَّى مِنْ سَجْدَةٍ",
                "headingArabic": "دُخُولُ النَّبِيِّ صلى الله عليه وسلم مِنْ أَعْلَى مَكَّةَ",
                "headingUrdu": "مکہ کے بالائی حصے سے رسول اللہ صلی اللہ علیہ وسلم کا داخلی دروازہ",
                "headingEnglish": "The entrance of the Prophet (saws) from the upper part of Makkah",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4092,
                "hadithNumber": "4290",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "During the year of the Conquest (of Mecca), the Prophet (ﷺ) entered Mecca through Kada which was at the upper part of Mecca. This tradition is followed by Abu Osama and Wahib with the mention of Kada.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم فتح مکہ کے دن مکہ کے بالائی علاقہ کداء سے شہر میں داخل ہوئے تھے۔ اس روایت کی متابعت ابواسامہ اور وہیب نے کداء کے ذکر کے ساتھ کی ہے۔",
                "urduNarrator": "ہم سے ہشیم بن خارجہ نے بیان کیا ‘ کہا ہم سے حفص بن میسرہ نے بیان کیا ‘ ان سے ہشام بن عروہ نے ‘ ان سے ان کے والد نے اور انہیں عائشہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا الْهَيْثَمُ بْنُ خَارِجَةَ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَامَ الْفَتْحِ مِنْ كَدَاءٍ الَّتِي بِأَعْلَى مَكَّةَ‏.‏ تَابَعَهُ أَبُو أُسَامَةَ وَوُهَيْبٌ فِي كَدَاءٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4093,
                "hadithNumber": "4291",
                "englishNarrator": "Narrated Hisham's father:",
                "hadithEnglish": "During the year of the Conquest (of Mecca), the Prophet (ﷺ) entered Mecca through its upper part through Kada.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم فتح مکہ کے دن مکہ کے بالائی علاقہ کداء کی طرف سے داخل ہوئے تھے۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ ان سے ہشام نے اور ان سے ان کے والد نے کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، دَخَلَ النَّبِيُّ صلى الله عليه وسلم عَامَ الْفَتْحِ مِنْ أَعْلَى مَكَّةَ مِنْ كَدَاءٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4094,
                "hadithNumber": "4292",
                "englishNarrator": "Narrated Um Hani رضی اللہ عنہا :",
                "hadithEnglish": "None informed us that he saw the Prophet (ﷺ) offering the Duha (i.e. forenoon) prayer, except Um Hani رضی اللہ عنہا who mentioned that the Prophet (ﷺ) took a bath in her house on the day of the Conquest (of Mecca) and then offered an eight rak`at prayer. She added, \"I never saw the Prophet (ﷺ) offering a lighter prayer than that prayer, but he was performing perfect bowing and prostrations.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے چاشت کی نماز پڑھی ‘ انہی نے کہا کہ جب مکہ فتح ہوا تو نبی کریم صلی اللہ علیہ وسلم نے ان کے گھر غسل کیا اور آٹھ رکعت نماز پڑھی۔ انہوں نے کہا کہ نبی کریم صلی اللہ علیہ وسلم کو میں نے اتنی ہلکی نماز پڑھتے کبھی نہیں دیکھا تھا۔ پھر بھی اس میں آپ صلی اللہ علیہ وسلم رکوع اور سجدہ پوری طرح کرتے تھے۔",
                "urduNarrator": "ہم سے ابوالولید نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے عمرو نے ‘ ان سے ابن ابی لیلیٰ نے کہ ام ہانی رضی اللہ عنہا کے سوا ہمیں کسی نے یہ خبر نہیں دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرٍو، عَنِ ابْنِ أَبِي لَيْلَى، مَا أَخْبَرَنَا أَحَدٌ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم يُصَلِّي الضُّحَى غَيْرَ أُمِّ هَانِئٍ، فَإِنَّهَا ذَكَرَتْ أَنَّهُ يَوْمَ فَتْحِ مَكَّةَ اغْتَسَلَ فِي بَيْتِهَا ثُمَّ صَلَّى ثَمَانِيَ رَكَعَاتٍ، قَالَتْ لَمْ أَرَهُ صَلَّى صَلاَةً أَخَفَّ مِنْهَا غَيْرَ أَنَّهُ يُتِمُّ الرُّكُوعَ وَالسُّجُودَ‏.‏",
                "headingArabic": "مَنْزِلُ النَّبِيِّ صلى الله عليه وسلم يَوْمَ الْفَتْحِ",
                "headingUrdu": "فتح مکہ کے دن رسول اللہ صلی اللہ علیہ وسلم کا پڑاؤ کرنے کی جگہ",
                "headingEnglish": "The encamping place of the Prophet (saws) on the day of the Conquest (of Makkah)",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4095,
                "hadithNumber": "4293",
                "englishNarrator": "Narrated 'Aishah (رضی اللہ عنہا):",
                "hadithEnglish": "The Prophet (ﷺ) used to say in his bowings and prostrations, \"Subhanaka Allahumma Rabbanã wa bihamdika, Allãhumma ighfirli\" (Glorified be You, O Allah, our Lord! All the praises are for You. O Allah, forgive me)!\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم اپنے رکوع اور سجدہ میں یہ پڑھتے تھے «سبحانك اللهم،‏‏‏‏ ربنا وبحمدك،‏‏‏‏ اللهم اغفر لي» ۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا ‘ کہا ہم سے غندر نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے منصور نے ‘ ان سے ابوالضحیٰ نے ‘ ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ فِي رُكُوعِهِ وَسُجُودِهِ ‏ \"‏ سُبْحَانَكَ اللَّهُمَّ، رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4096,
                "hadithNumber": "4294",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "`Umar رضی اللہ عنہ used to admit me (into his house) along with the old men who had fought in the Badr battle. Some of them said (to `Umar), \"Why do you allow this young man to enter with us, while we have sons of his own age? \" `Umar رضی اللہ عنہ said, \"You know what person he is.\" One day `Umar رضی اللہ عنہ called them and called me along with them, I had thought he called me on that day to show them something about me (i.e. my knowledge). `Umar رضی اللہ عنہ asked them, \"What do you say about (the Sura): \"When comes the help of Allah and the Conquest (of Mecca) And you see mankind entering the Religion of Allah (i.e. Islam) in crowds. 'So celebrate the Praises Of your Lord and ask for His forgiveness, Truly, He is the One Who accepts repentance and forgives.\" (110.1-3) Some of them replied, \"We are ordered to praise Allah and repent to Him if we are helped and granted victory.\" Some said, \"We do not know.\" Others kept quiet. `Umar رضی اللہ عنہ then said to me, \"Do you say similarly?\" I said, \"No.\" `Umar رضی اللہ عنہ said \"What do you say then?\" I said, \"This Verse indicates the approaching of the death of Allah's Messenger (ﷺ) of which Allah informed him. When comes the help of Allah and the Conquest, i.e. the Conquest of Mecca, that will be the sign of your Prophet's) approaching death, so testify the uniqueness of your Lord (i.e. Allah) and praise Him and repent to Him as He is ready to forgive.\" On that, `Umar رضی اللہ عنہ said, \"I do not know about it anything other than what you know.\"",
                "hadithUrdu": "عمر رضی اللہ عنہ مجھے اپنی مجلس میں اس وقت بھی بلا لیتے جب وہاں بدر کی جنگ میں شریک ہونے والے بزرگ صحابہ رضی اللہ عنہم بیٹھے ہوتے۔ اس پر بعض لوگ کہنے لگے اس جوان کو آپ ہماری مجلس میں کیوں بلاتے ہیں؟ اس کے جیسے تو ہمارے بچے بھی ہیں۔ اس پر عمر رضی اللہ عنہ نے کہا وہ تو ان لوگوں میں سے ہے جن کا علم و فضل تم جانتے ہو۔ انہوں نے بیان کیا کہ پھر ان بزرگ صحابیوں کو ایک دن عمر رضی اللہ عنہ نے بلایا اور مجھے بھی بلایا۔ بیان کیا کہ میں سمجھتا تھا کہ مجھے اس دن آپ نے اس لیے بلایا تھا تاکہ آپ میرا علم بتا سکیں۔ پھر آپ نے دریافت کیا «إذا جاء نصر الله والفتح * ورأيت الناس يدخلون‏» ‘ ختم سورت تک ‘ کے متعلق تم لوگوں کا کیا خیال ہے؟ کسی نے کہا کہ ہمیں اس آیت میں حکم دیا گیا ہے کہ ہم اللہ کی حمد بیان کریں اور اس سے استغفار کریں کہ اس نے ہماری مدد کی اور ہمیں فتح عنایت فرمائی۔ بعض نے کہا کہ ہمیں اس کے متعلق کچھ معلوم نہیں ہے اور بعض نے کوئی جواب نہیں دیا پھر انہوں نے مجھ سے دریافت کیا: ابن عباس! کیا تمہارا بھی یہی خیال ہے؟ میں نے جواب دیا کہ نہیں ‘ پوچھا ‘ پھر تم کیا کہتے ہو؟ میں نے کہا کہ اس میں رسول اللہ صلی اللہ علیہ وسلم کی وفات کی طرف اشارہ ہے کہ جب اللہ تعالیٰ کی مدد اور فتح حاصل ہو گئی۔ یعنی فتح مکہ تو یہ آپ صلی اللہ علیہ وسلم کی وفات کی نشانی ہے۔ اس لیے آپ اپنے رب کی حمد اور تسبیح اور اس کی مغفرت طلب کریں کہ وہ توبہ قبول کرنے والا ہے۔ عمر رضی اللہ عنہ نے کہا کہ جو کچھ تم نے کہا وہی میں بھی سمجھتا ہوں۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ‘ کہا ہم سے ابوعوانہ نے بیان کیا ‘ ان سے ابوبشر نے ‘ ان سے سعید بن جبیر نے ‘ ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ كَانَ عُمَرُ يُدْخِلُنِي مَعَ أَشْيَاخِ بَدْرٍ، فَقَالَ بَعْضُهُمْ لِمَ تُدْخِلُ هَذَا الْفَتَى مَعَنَا، وَلَنَا أَبْنَاءٌ مِثْلُهُ فَقَالَ إِنَّهُ مِمَّنْ قَدْ عَلِمْتُمْ‏.‏ قَالَ فَدَعَاهُمْ ذَاتَ يَوْمٍ، وَدَعَانِي مَعَهُمْ قَالَ وَمَا رُئِيتُهُ دَعَانِي يَوْمَئِذٍ إِلاَّ لِيُرِيَهُمْ مِنِّي فَقَالَ مَا تَقُولُونَ ‏{‏إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ * وَرَأَيْتَ النَّاسَ يَدْخُلُونَ‏}‏ حَتَّى خَتَمَ السُّورَةَ، فَقَالَ بَعْضُهُمْ أُمِرْنَا أَنْ نَحْمَدَ اللَّهَ وَنَسْتَغْفِرَهُ، إِذَا نُصِرْنَا وَفُتِحَ عَلَيْنَا‏.‏ وَقَالَ بَعْضُهُمْ لاَ نَدْرِي‏.‏ أَوْ لَمْ يَقُلْ بَعْضُهُمْ شَيْئًا‏.‏ فَقَالَ لِي يَا ابْنَ عَبَّاسٍ أَكَذَاكَ تَقُولُ قُلْتُ لاَ‏.‏ قَالَ فَمَا تَقُولُ قُلْتُ هُوَ أَجَلُ رَسُولِ اللَّهِ صلى الله عليه وسلم أَعْلَمَهُ اللَّهُ لَهُ ‏{‏إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ‏}‏ فَتْحُ مَكَّةَ، فَذَاكَ عَلاَمَةُ أَجَلِكَ ‏{‏فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا‏}‏ قَالَ عُمَرُ مَا أَعْلَمُ مِنْهَا إِلاَّ مَا تَعْلَمُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4097,
                "hadithNumber": "4295",
                "englishNarrator": "Narrated Abu Shuraih رضی اللہ عنہ :",
                "hadithEnglish": "`Amr bin Sa`id while the latter was sending troops in batches to Mecca, \"O chief! Allow me to tell you a statement which Allah's Messenger (ﷺ) said on the second day of the Conquest of Mecca. My two ears heard it and my heart remembered it and my two eyes saw him when he said it. He (i.e. the Prophet) praised Allah and then said, 'Mecca has been made a sanctuary by Allah and not by the people, so it is not lawful for a person, who believes in Allah and the Last Day to shed blood in it, or to cut its trees and if someone asks the permission to fight in Mecca because Allah's Apostle was allowed to fight in it, say to him; Allah permitted His Apostle and did not allow you, and even he (i.e. the Apostle) was allowed for a short period of the day, and today its (Mecca's sanctity has become the same as it was before (of old) so those who are present should inform those who are absent (this Hadith).\" Then Abu Shuraih, was asked, \"What did `Amr say to you? Abu Shuraih said, \"He said, \"I knew that better than you, O Abu Shuraih! The Haram (i.e. Mecca) does not give refuge to a sinner or a fleeing murderer or a person running away after causing destruction.\"",
                "hadithUrdu": "( مدینہ کے امیر ) عمرو بن سعید سے کہا جب کہ عمرو بن سعید ( عبداللہ بن زبیر رضی اللہ عنہما کے خلاف ) مکہ کی طرف لشکر بھیج رہے تھے کہ اے امیر! مجھے اجازت دیجئیے کہ میں آپ سے ایک حدیث بیان کروں جو رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے دوسرے دن ارشاد فرمائی تھی۔ اس حدیث کو نبی کریم صلی اللہ علیہ وسلم ارشاد فرما رہے تھے تو میں اپنی آنکھوں سے آپ کو دیکھ رہا تھا۔ نبی کریم صلی اللہ علیہ وسلم نے پہلے اللہ کی حمد و ثنا بیان کی اور پھر فرمایا ‘ بلاشبہ مکہ کو اللہ تعالیٰ نے حرمت والا شہر قرار دیا ہے کسی انسان نے اسے اپنے طرف سے حرمت والا قرار نہیں دیا۔ اس لیے کسی شخص کے لیے بھی جو اللہ اور یوم آخرت پر ایمان رکھتا ہو ‘ جائز نہیں کہ اس میں کسی کا خون بہائے اور کوئی اس سر زمیں کا کوئی درخت کاٹے اور اگر کوئی شخص رسول اللہ صلی اللہ علیہ وسلم کے ( فتح مکہ کے موقع پر ) جنگ سے اپنے لیے بھی رخصت نکالے تو تم اس سے کہہ دینا کہ اللہ تعالیٰ نے صرف اپنے رسول کو ( تھوڑی دیر کے لیے ) اس کی اجازت دی تھی۔ ہمارے لیے بالکل اجازت نہیں ہے اور مجھے بھی اس کی اجازت دن کے تھوڑے سے حصے کے لیے ملی تھی اور آج پھر اس کی حرمت اسی طرح لوٹ آئی ہے جس طرح کل یہ شہر حرمت والا تھا۔ پس جو لوگ یہاں موجود ہیں وہ ( ان کو میرا کلام ) پہنچا دیں جو موجود نہیں۔ ابوشریح سے پوچھا گیا کہ عمرو بن سعید نے آپ کو پھر جواب کیا دیا تھا؟ تو انہوں نے بتایا کہ اس نے کہا کہ میں یہ مسائل تم سے زیادہ جانتا ہوں ‘ حرم کسی گنہگار کو پناہ نہیں دیتا ‘ نہ کسی کا خون کر کے بھاگنے والے کو پناہ دیتا ہے ‘ مفسد کو بھی پناہ نہیں دیتا۔",
                "urduNarrator": "ہم سے سعید بن شرحبیل نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے بیان کیا ‘ ان سے مقبری نے کہ ابوشریح عدوی رضی اللہ عنہ نے",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ شُرَحْبِيلَ، حَدَّثَنَا اللَّيْثُ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي شُرَيْحٍ الْعَدَوِيِّ، أَنَّهُ قَالَ لِعَمْرِو بْنِ سَعِيدٍ وَهْوَ يَبْعَثُ الْبُعُوثَ إِلَى مَكَّةَ ائْذَنْ لِي أَيُّهَا الأَمِيرُ أُحَدِّثْكَ قَوْلاً قَامَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم الْغَدَ يَوْمَ الْفَتْحِ، سَمِعَتْهُ أُذُنَاىَ وَوَعَاهُ قَلْبِي، وَأَبْصَرَتْهُ عَيْنَاىَ، حِينَ تَكَلَّمَ بِهِ حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ ‏ \"‏ إِنَّ مَكَّةَ حَرَّمَهَا اللَّهُ وَلَمْ يُحَرِّمْهَا النَّاسُ، لاَ يَحِلُّ لاِمْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ يَسْفِكَ بِهَا دَمًا، وَلاَ يَعْضِدَ بِهَا شَجَرًا، فَإِنْ أَحَدٌ تَرَخَّصَ لِقِتَالِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِيهَا فَقُولُوا لَهُ إِنَّ اللَّهَ أَذِنَ لِرَسُولِهِ، وَلَمْ يَأْذَنْ لَكُمْ‏.‏ وَإِنَّمَا أَذِنَ لِي فِيهَا سَاعَةً مِنْ نَهَارٍ، وَقَدْ عَادَتْ حُرْمَتُهَا الْيَوْمَ كَحُرْمَتِهَا بِالأَمْسِ، وَلْيُبَلِّغِ الشَّاهِدُ الْغَائِبَ ‏\"‏‏.‏ فَقِيلَ لأَبِي شُرَيْحٍ مَاذَا قَالَ لَكَ عَمْرٌو قَالَ قَالَ أَنَا أَعْلَمُ بِذَلِكَ مِنْكَ يَا أَبَا شُرَيْحٍ، إِنَّ الْحَرَمَ لاَ يُعِيذُ عَاصِيًا، وَلاَ فَارًّا بِدَمٍ، وَلاَ فَارًّا بِخَرْبَةٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4098,
                "hadithNumber": "4296",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "He heard Allah's Messenger (ﷺ) saying in the year of the Conquest (of Mecca) while he was in Mecca, \"Allah and His Apostle have made the selling of wine (i.e. alcoholic drinks) unlawful.\"",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آپ نے فتح مکہ کے موقع پر مکہ مکرمہ میں فرمایا تھا کہ اللہ اور اس کے رسول نے شراب کی خرید و فروخت مطلق حرام قرار دے دی ہے۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ‘ کہا ہم سے لیث نے بیان کیا ‘ ان سے یزید بن ابی حبیب نے ‘ ان سے عطاء بن ابی رباح نے اور ان سے جابر بن عبداللہ رضی اللہ عنہما نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ عَامَ الْفَتْحِ وَهْوَ بِمَكَّةَ ‏ \"‏ إِنَّ اللَّهَ وَرَسُولَهُ حَرَّمَ بَيْعَ الْخَمْرِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4099,
                "hadithNumber": "4297",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "We stayed (in Mecca) for ten days along with the Prophet (ﷺ) and used to offer shortened prayers (i.e. journey prayers).",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ( مکہ میں ) دس دن ٹھہرے تھے اور اس مدت میں ہم نماز قصر کرتے تھے۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ‘ کہا ہم سے سفیان ثوری نے بیان کیا (دوسری سند) اور ہم سے قبیصہ بن عقبہ نے بیان کیا ‘ کہا ہم سے سفیان ثوری نے بیان کیا ‘ ان سے یحییٰ بن ابی اسحاق نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ،‏.‏ حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أَقَمْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم عَشْرًا نَقْصُرُ الصَّلاَةَ‏.‏",
                "headingArabic": "مَقَامُ النَّبِيِّ صلى الله عليه وسلم بِمَكَّةَ زَمَنَ الْفَتْحِ",
                "headingUrdu": "مکہ مکرمہ میں رسول اللہ صلی اللہ علیہ وسلم کا قیام",
                "headingEnglish": "The stay of the Prophet (saws) in Makkah",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4100,
                "hadithNumber": "4298",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) stayed in Mecca for 19 days during which he prayed 2 rak`at in each prayer.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے مکہ میں انیس دن قیام فرمایا تھا اور اس مدت میں نماز دو رکعتیں ( قصر ) پڑھتے تھے۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ‘ کہا ہم کو عبداللہ بن مبارک نے خبر دی ‘ کہا ہم کو عاصم نے خبر دی ‘ انہیں عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عَاصِمٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، رضى الله عنهما قَالَ أَقَامَ النَّبِيُّ صلى الله عليه وسلم بِمَكَّةَ تِسْعَةَ عَشَرَ يَوْمًا يُصَلِّي رَكْعَتَيْنِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4101,
                "hadithNumber": "4299",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"We stayed for 19 days with Prophet on a journey during which we used to offer shortened prayers.\" Ibn `Abbas رضی اللہ عنہما added, \"We offer the Qasr prayer (i.e. shortened prayer) If we stay up to 19 days as travelers, But if we stay longer, we offer complete prayers.",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ سفر میں ( فتح مکہ کے بعد ) انیس دن تک تو نماز قصر پڑھتے تھے ‘ لیکن جب اس سے زیادہ مدت گزر جاتی تو پھر پوری نماز پڑھتے تھے۔ ابن عباس رضی اللہ عنہما نے مزید کہا کہ اگر ہم 19 دن تک مسافر ٹھہریں تو قصر کی نماز پڑھتے ہیں لیکن اگر زیادہ ٹھہریں تو پوری نماز پڑھتے ہیں۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ‘ کہا ہم سے ابوشہاب نے بیان کیا ‘ ان سے عاصم نے ‘ ان سے عکرمہ نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا أَبُو شِهَابٍ، عَنْ عَاصِمٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَقَمْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ تِسْعَ عَشْرَةَ نَقْصُرُ الصَّلاَةَ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ وَنَحْنُ نَقْصُرُ مَا بَيْنَنَا وَبَيْنَ تِسْعَ عَشْرَةَ، فَإِذَا زِدْنَا أَتْمَمْنَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4102,
                "hadithNumber": "4300",
                "englishNarrator": "Narrated `Abdullah bin Tha`laba bin Su`air رضی اللہ عنہ :",
                "hadithEnglish": "whose face was rubbed by the Prophet during the year of the Conquest (of Makkah).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم فتح مکہ کے دن ان کے چہرے پر ( شفقت کی راہ سے ) ہاتھ پھیرا تھا۔",
                "urduNarrator": "اور لیث بن سعد نے بیان کیا ‘ کہا کہ مجھ سے یونس نے بیان کیا ‘ ان سے ابن شہاب نے ‘ کہا مجھ کو عبداللہ بن ثعلبی بن صعیر رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ ثَعْلَبَةَ بْنِ صُعَيْرٍ، وَكَانَ النَّبِيُّ، صلى الله عليه وسلم قَدْ مَسَحَ وَجْهَهُ عَامَ الْفَتْحِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4076,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=163",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=161",
                "label": "161",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=162",
                "label": "162",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=163",
                "label": "163",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=164",
                "label": "164",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=165",
                "label": "165",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=166",
                "label": "166",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=167",
                "label": "167",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=165",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=165",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=163",
        "to": 4100,
        "total": 40465
    }
}