{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 113,
        "data": [
            {
                "id": 2803,
                "hadithNumber": "2932",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) used to recite the following invocations during Qunut: \"O Allah! Save Salama bin Hisham. O Allah! Save Al-Walid bin Al-Walid. O Allah! Save `Aiyash bin Rabi`a O Allah ! Save the weak Muslims. O Allah! Be very hard on Mudar tribe. O Allah! Afflict them with years (of famine) similar to the (famine) years of the time of Prophet Joseph.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ( صبح کی ) دعائے قنوت میں ( دوسری رکعت کے رکوع کے بعد ) یہ دعا پڑھتے تھے ( ترجمہ ) اے اللہ سلمہ بن ہشام کو نجات دے ، ولید بن ولید کو نجات دے ، اے اللہ ! عیاش بن ابی ربیعہ کو نجات دے ، اے اللہ ! تمام کمزور مسلمانوں کو نجات دے ۔ ( جو مکہ میں مشرکین کی سختیاں جھیل رہے ہیں ) اے اللہ ! مضر پر اپنا سخت عذاب نازل کر ۔ اے اللہ ایسا قحط نازل کر جیسا یوسف علیہ السلام کے زمانہ میں پڑا تھا ۔",
                "urduNarrator": "ہم سے قبیصہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ابن ذکوان نے ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ ذَكْوَانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدْعُو فِي الْقُنُوتِ ‏ \"‏ اللَّهُمَّ أَنْجِ سَلَمَةَ بْنَ هِشَامٍ، اللَّهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ، اللَّهُمَّ أَنْجِ عَيَّاشَ بْنَ أَبِي رَبِيعَةَ، اللَّهُمَّ أَنْجِ الْمُسْتَضْعَفِينَ مِنَ الْمُؤْمِنِينَ، اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ، اللَّهُمَّ سِنِينَ كَسِنِي يُوسُفَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2804,
                "hadithNumber": "2933",
                "englishNarrator": "Narrated `Abdullah bin Abi `Aufa رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) invoked evil upon the pagans on the ay (of the battle) of Al-Ahzab, saying, \"O Allah! The Revealer of the Holy Book, the Swift-Taker of Accounts, O Allah, defeat Al-Ahzab (i.e. the clans), O Allah, defeat them and shake them.\"",
                "hadithUrdu": "غزوہ احزاب کے موقع پر رسول اللہ صلی اللہ علیہ وسلم نے یہ دعا کی تھی اے اللہ کتاب کے نازل کرنے والے ( قیامت کے دن ) حساب بڑی سرعت سے لینے والے اے اللہ ! مشرکوں اور کفار کی جماعتوں کو ( جو مسلمانوں کا استیصال کرنے آئی ہیں ) شکست دے ۔ اے اللہ ! انہیں شکست دے اور انہیں جھنجھوڑ کر رکھ دے ۔",
                "urduNarrator": "ہم سے احمد بن محمد نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں اسماعیل بن ابی خالد نے خبر دی اور انہوں نے عبداللہ بن ابی اوفی رضی اللہ عنہ سے سنا ، آپ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى ـ رضى الله عنهما ـ يَقُولُ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ الأَحْزَابِ عَلَى الْمُشْرِكِينَ فَقَالَ ‏ \"‏ اللَّهُمَّ مُنْزِلَ الْكِتَابِ سَرِيعَ الْحِسَابِ، اللَّهُمَّ اهْزِمِ الأَحْزَابَ، اللَّهُمَّ اهْزِمْهُمْ وَزَلْزِلْهُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2805,
                "hadithNumber": "2934",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Once the Prophet (ﷺ) was offering the prayer in the shade of the Ka`ba. Abu Jahl and some Quraishi men sent somebody to bring the Abdominal contents of a shecamel which had been slaughtered somewhere in Mecca, and when he brought them, they put them over the Prophet (ﷺ) Then Fatima رضی اللہ عنہا (i.e. the Prophet's daughter) came and threw them away from him, and he said, \"O Allah! Destroy (the pagans of) Quraish; O Allah! Destroy Quraish; O Allah Destroy Quraish,\" naming especially Abu Jahl bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al Walid bin `Utba, Ubai bin Khalaf and `Uqba bin Abi Mitt. (The narrator, `Abdullah added, \"I saw them all killed and thrown in the Badr well).Abu Ishaq says: I have forgotten the name of the seventh one. Imam Bukhari said: Yousuf bin Ishaq reports frpm Abu Ishaq that he is Omayyah bin Khalaf. Shoabah says: Either Omayyah or Obayy but the exact one is Omayyah.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کعبہ کے سائے میں نماز پڑھ رہے تھے ، ابوجہل اور قریش کے بعض دوسرے لوگوں نے کہا کہ اونٹ کی اوجھڑی لا کر کون ان پر ڈالے گا ؟ مکہ کے کنارے ایک اونٹ ذبح ہوا تھا ( اور اسی کی اوجھڑی لانے کے واسطے ) ان سبھوں نے اپنے آدمی بھیجے اور وہ اس اونٹ کی اوجھڑی اٹھا لائے اور اسے نبی کریم صلی اللہ علیہ وسلم کے اوپر ( نماز پڑھتے ہوئے ) ڈال دیا ۔ اس کے بعد فاطمہ رضی اللہ عنہا آئیں اور انہوں نے آپ صلی اللہ علیہ وسلم کے اوپر سے اس گندگی کو ہٹایا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس وقت یہ بددعا کی کہ اے اللہ ! قریش کو پکڑ ، اے اللہ ! قریش کو پکڑ ، ابوجہل بن ہشام ، عتبہ بن ربیعہ ، شیبہ بن ربیعہ ، ولید بن عتبہ ، ابی بن خلف اور عقبہ بن ابی معیط سب کو پکڑ لے ۔ عبداللہ بن مسعود رضی اللہ عنہما نے کہا چنانچہ میں نے ان سب کو جنگ بدر میں بدر کے کنوئیں میں دیکھا کہ سبھوں کو قتل کر کے اس میں ڈال دیا گیا تھا ۔ ابواسحاق نے کہا کہ میں ساتویں شخص کا ( جس کے حق میں آپ صلی اللہ علیہ وسلم نے بددعا کی تھی نام ) بھول گیا اور یوسف بن ابی اسحاق نے کہا کہ ان سے ابواسحاق نے ( سفیان کی روایت میں ابی بن خلف کی بجائے ) امیہ بن خلف بیان کیا اور شعبہ نے کہا کہ امیہ یا ابی ( شک کے ساتھ ہے ) لیکن صحیح امیہ ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن ابی شیبہ نے بیان کیا ، کہا ہم سے جعفر بن عون نے بیان کیا ، ہم سے سفیان ثوری نے ، ان سے ابواسحاق نے ، ان سے عمرو بن میمون نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي فِي ظِلِّ الْكَعْبَةِ، فَقَالَ أَبُو جَهْلٍ وَنَاسٌ مِنْ قُرَيْشٍ، وَنُحِرَتْ جَزُورٌ بِنَاحِيَةِ مَكَّةَ، فَأَرْسَلُوا فَجَاءُوا مِنْ سَلاَهَا، وَطَرَحُوهُ عَلَيْهِ، فَجَاءَتْ فَاطِمَةُ فَأَلْقَتْهُ عَنْهُ، فَقَالَ ‏ \"‏ اللَّهُمَّ عَلَيْكَ بِقُرَيْشٍ، اللَّهُمَّ عَلَيْكَ بِقُرَيْشٍ، اللَّهُمَّ عَلَيْكَ بِقُرَيْشٍ ‏\"‏‏.‏ لأَبِي جَهْلِ بْنِ هِشَامٍ، وَعُتْبَةَ بْنِ رَبِيعَةَ، وَشَيْبَةَ بْنِ رَبِيعَةَ، وَالْوَلِيدِ بْنِ عُتْبَةَ، وَأُبَىِّ بْنِ خَلَفٍ، وَعُقْبَةَ بْنِ أَبِي مُعَيْطٍ‏.‏ قَالَ عَبْدُ اللَّهِ فَلَقَدْ رَأَيْتُهُمْ فِي قَلِيبِ بَدْرٍ قَتْلَى‏.‏ قَالَ أَبُو إِسْحَاقَ وَنَسِيتُ السَّابِعَ‏.‏ وَقَالَ يُوسُفُ بْنُ إِسْحَاقَ عَنْ أَبِي إِسْحَاقَ أُمَيَّةُ بْنُ خَلَفٍ‏.‏ وَقَالَ شُعْبَةُ أُمَيَّةُ أَوْ أُبَىٌّ‏.‏ وَالصَّحِيحُ أُمَيَّةُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2806,
                "hadithNumber": "2935",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Once the Jews came to the Prophet (ﷺ) and said, \"Death be upon you.\" So I cursed them. The Prophet (ﷺ) said, \"What is the matter?\" I said, \"Have you not heard what they said?\" The Prophet (ﷺ) said, \"Have you not heard what I replied (to them)? (I said), ('The same is upon you.')\"",
                "hadithUrdu": "بعض یہودی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آئے اور کہا السام علیکم ( تم پر موت آئے ) میں نے ان پر لعنت بھیجی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کیا بات ہوئی ؟ میں نے کہا کیا انہوں نے ابھی جو کہا تھا آپ صلی اللہ علیہ وسلم نے نہیں سنا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، کیا اور تم نے نہیں سنا کہ میں نے اس کا کیا جواب دیا وعلیکم یعنی تم پر بھی وہی آئے ( یعنی میں نے کوئی برا لفظ زبان سے نہیں نکالا صرف ان کی بات ان ہی پر لوٹا دی ) ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے ابن ابی ملیکہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ الْيَهُودَ، دَخَلُوا عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالُوا السَّامُ عَلَيْكَ‏.‏ فَلَعَنْتُهُمْ‏.‏ فَقَالَ ‏\"‏ مَا لَكِ ‏\"‏‏.‏ قُلْتُ أَوَلَمْ تَسْمَعْ مَا قَالُوا قَالَ ‏\"‏ فَلَمْ تَسْمَعِي مَا قُلْتُ وَعَلَيْكُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2807,
                "hadithNumber": "2936",
                "englishNarrator": "Narrated `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) wrote a letter to Caesar saying, \"If you reject Islam, you will be responsible for the sins of the peasants (i.e. your people).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ( روم کے بادشاہ ) قیصر کو ( خط ) لکھا جس میں آپ صلی اللہ علیہ وسلم نے یہ بھی لکھا تھا کہ اگر تم نے ( اسلام کی دعوت سے ) منہ موڑا تو ( اپنے گناہ کے ساتھ ) ان کاشتکاروں کا بھی گناہ تم پر پڑے گا ۔ ( جن پر تم حکمرانی کر رہے ہو ) ۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا ، کہا ہم کو یعقوب بن ابراہیم نے خبر دی ، کہا مجھے میرے بھتیجے ابن شہاب نے خبر دی ، ان سے ان کے چچا نے بیان کیا ، انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَتَبَ إِلَى قَيْصَرَ، وَقَالَ ‏ \"‏ فَإِنْ تَوَلَّيْتَ فَإِنَّ عَلَيْكَ إِثْمَ الأَرِيسِيِّينَ ‏\"‏‏.‏",
                "headingArabic": "هَلْ يُرْشِدُ الْمُسْلِمُ أَهْلَ الْكِتَابِ أَوْ يُعَلِّمُهُمُ الْكِتَابَ",
                "headingUrdu": "اہل کتاب کو تبلیغ کرنا، یا انہیں مقدس کتاب سکھانا؟",
                "headingEnglish": "To preach to the people of the Scriptures, or teach them the Holy Book?",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2808,
                "hadithNumber": "2937",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Tufail bin `Amr Ad-Dausi رضی اللہ عنہ and his companions came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! The people of the tribe of Daus disobeyed and refused to follow you; so invoke Allah against them.\" The people said, \"The tribe of Daus is ruined.\" The Prophet (ﷺ) said, \"O Allah! Give guidance to the people of Daus, and let them embrace Islam.\"",
                "hadithUrdu": "طفیل بن عمرو دوسی رضی اللہ عنہ اپنے ساتھیوں کے ساتھ حضور اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ یا رسول اللہ صلی اللہ علیہ وسلم قبیلہ دوس کے لوگ سرکشی پر اتر آئے ہیں اور اللہ کا کلام سننے سے انکار کرتے ہیں ۔ آپ صلی اللہ علیہ وسلم ان پر بددعا کیجئے ! بعض صحابہ رضی اللہ عنہم نے کہا کہ اب دوس کے لوگ برباد ہو جائیں گے ۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا اے اللہ ! دوس کے لوگوں کو ہدایت دے اور انہیں ( دائرہ اسلام میں ) کھینچ لا ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے عبدالرحمٰن نے بیان کیا کہ ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، أَنَّ عَبْدَ الرَّحْمَنِ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه قَدِمَ طُفَيْلُ بْنُ عَمْرٍو الدَّوْسِيُّ وَأَصْحَابُهُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالُوا يَا رَسُولَ اللَّهِ، إِنَّ دَوْسًا عَصَتْ وَأَبَتْ، فَادْعُ اللَّهَ عَلَيْهَا‏.‏ فَقِيلَ هَلَكَتْ دَوْسٌ‏.‏ قَالَ ‏ \"‏ اللَّهُمَّ اهْدِ دَوْسًا وَائْتِ بِهِمْ ‏\"‏‏.‏",
                "headingArabic": "الدُّعَاءِ لِلْمُشْرِكِينَ بِالْهُدَى لِيَتَأَلَّفَهُمْ",
                "headingUrdu": "مشرکین کو ہدایت دینے کے لیے اللہ سے دعا کرنا",
                "headingEnglish": "To invoke Allah to bestow guidance upon Al-Mushrikun",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2809,
                "hadithNumber": "2938",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When the Prophet (ﷺ) intended to write a letter to the ruler of the Byzantines, he was told that those people did not read any letter unless it was stamped with a seal. So, the Prophet (ﷺ) got a silver ring-- as if I were just looking at its white glitter on his hand ---- and stamped on it the expression \"Muhammad, Apostle of Allah\".",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم نے شاہ روم کو خط لکھنے کا ارادہ کیا تو آپ سے کہا گیا کہ وہ لوگ کوئی خط اس وقت تک قبول نہیں کرتے جب تک وہ سربمہر نہ ہو ، چنانچہ آنحضرت صلی اللہ علیہ وسلم نے ایک چاندی کی انگوٹھی بنوائی ۔ گویا دست مبارک پر اس کی سفیدی میری نظروں کے سامنے ہے ۔ اس انگوٹھی پر ” محمد رسول اللہ “ کھدا ہوا تھا ۔",
                "urduNarrator": "ہم سے علی بن جعد نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی قتادہ سے ، انہوں نے کہا کہ میں نے انس رضی اللہ عنہ سے سنا کہ آپ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ يَقُولُ لَمَّا أَرَادَ النَّبِيُّ صلى الله عليه وسلم أَنْ يَكْتُبَ إِلَى الرُّومِ، قِيلَ لَهُ إِنَّهُمْ لاَ يَقْرَءُونَ كِتَابًا إِلاَّ أَنْ يَكُونَ مَخْتُومًا‏.‏ فَاتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ، فَكَأَنِّي أَنْظُرُ إِلَى بَيَاضِهِ فِي يَدِهِ، وَنَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ‏.‏",
                "headingArabic": "دَعْوَةِ الْيَهُودِيِّ وَالنَّصْرَانِيِّ، وَعَلَى مَا يُقَاتَلُونَ عَلَيْهِ",
                "headingUrdu": "اعلان جنگ سے پہلے اسلام کی دعوت ضروری ہے۔",
                "headingEnglish": "The invitation to Islam is essential before declaring war",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2810,
                "hadithNumber": "2939",
                "englishNarrator": "Narrated `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent his letter to Khusrau and ordered his messenger to hand it over to the Governor of Bahrain who was to hand it over to Khusrau. So, when Khusrau read the letter he tore it. Sa`id bin Al- Musaiyab said, \"The Prophet (ﷺ) then invoked Allah to disperse them with full dispersion, (destroy them (i.e. Khusrau and his followers) severely)\".",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنا خط کسریٰ کے پاس بھیجا ۔ آپ صلی اللہ علیہ وسلم نے ( ایلچی سے ) یہ فرمایا تھا کہ وہ آپ صلی اللہ علیہ وسلم کے خط کو بحرین کے گورنر کو دے دیں ، بحرین کا گورنر اسے کسریٰ کے دربار میں پہنچا دے گا ۔ جب کسریٰ نے مکتوب مبارک پڑھا تو اسے اس نے پھاڑ ڈالا ۔ مجھے یاد ہے کہ سعید بن مسیب نے بیان کیا تھا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے اس پر بددعا کی تھی کہ وہ بھی پارہ پارہ ہو جائے ۔ ( چنانچہ ایسا ہی ہوا ) ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، کہا مجھ سے عقیل نے بیان کیا ، ان سے ابن شہاب نے کہا کہ مجھے عبیداللہ بن عبداللہ بن عتبہ نے خبر دی اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ بِكِتَابِهِ إِلَى كِسْرَى، فَأَمَرَهُ أَنْ يَدْفَعَهُ إِلَى عَظِيمِ الْبَحْرَيْنِ، يَدْفَعُهُ عَظِيمُ الْبَحْرَيْنِ إِلَى كِسْرَى، فَلَمَّا قَرَأَهُ كِسْرَى خَرَّقَهُ، فَحَسِبْتُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ قَالَ فَدَعَا عَلَيْهِمُ النَّبِيُّ صلى الله عليه وسلم أَنْ يُمَزَّقُوا كُلَّ مُمَزَّقٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2811,
                "hadithNumber": "2940, 2941",
                "englishNarrator": "Narrated `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) wrote to Caesar and invited him to Islam and sent him his letter with Dihya Al-Kalbi رضی اللہ عنہ whom Allah's Messenger (ﷺ) ordered to hand it over to the Governor of Busra who would forward it to Caesar. Caesar as a sign of gratitude to Allah, had walked from Hims to Ilya (i.e. Jerusalem) when Allah had granted Him victory over the Persian forces. So, when the letter of Allah's Messenger (ﷺ) reached Caesar, he said after reading it, 'Seek for me any one of his people! (Arabs of Quraish tribe) if present here, in order to ask him about Allah's Messenger (ﷺ). At that time Abu Sufyan bin Harb was in Sham with some men from Quraish who had come (to Sham) as merchants during the truce that had been concluded between Allah's Messenger (ﷺ); and the infidels of Quraish. Abu Sufyan said, Caesar's messenger found us somewhere in Sham so he took me and my companions to Ilya and we were admitted into Ceasar's court to find him sitting in his royal court wearing a crown and surrounded by the senior dignitaries of the Byzantine. He said to his translator. 'Ask them who amongst them is a close relation to the man who claims to be a prophet.\" Abu Sufyan added, \"I replied, 'I am the nearest relative to him.' He asked, 'What degree of relationship do you have with him?' I replied, 'He is my cousin,' and there was none of Bani Abu Manaf in the caravan except myself. Caesar said, 'Let him come nearer.' He then ordered that my companions stand behind me near my shoulder and said to his translator, 'Tell his companions that I am going to ask this man about the man who claims to be a prophet. If he tells a lie, they should contradict him immediately.\" Abu Sufyan added, \"By Allah! Had it not been shameful that my companions label me a liar, I would not have spoken the truth about him when he asked me. But I considered it shameful to be called a liar by my companions. So I told the truth. He then said to his translator, 'Ask him what kind of family does he belong to.' I replied, 'He belongs to a noble family amongst us.' He said, 'Have anybody else amongst you ever claimed the same before him? 'I replied, 'No.' He said, 'Had you ever blamed him for telling lies before he claimed what he claimed? ' I replied, 'No.' He said, 'Was anybody amongst his ancestors a king?' I replied, 'No.' He said, \"Do the noble or the poor follow him?' I replied, 'It is the poor who follow him.' He said, 'Are they increasing or decreasing (day by day)?' I replied,' They are increasing.' He said, 'Does anybody amongst those who embrace his (the Prophet's) Religion become displeased and then discard his Religion?'. I replied, 'No. ' He said, 'Does he break his promises? I replied, 'No, but we are now at truce with him and we are afraid that he may betray us.\" Abu Sufyan added, \"Other than the last sentence, I could not say anything against him. Caesar then asked, 'Have you ever had a war with him?' I replied, 'Yes.' He said, 'What was the outcome of your battles with him?' I replied, 'The result was unstable; sometimes he was victorious and sometimes we.' He said, 'What does he order you to do?' I said, 'He tells us to worship Allah alone, and not to worship others along with Him, and to leave all that our fore-fathers used to worship. He orders us to pray, give in charity, be chaste, keep promises and return what is entrusted to us.' When I had said that, Caesar said to his translator, 'Say to him: I ask you about his lineage and your reply was that he belonged to a noble family. In fact, all the apostles came from the noblest lineage of their nations. Then I questioned you whether anybody else amongst you had claimed such a thing, and your reply was in the negative. If the answer had been in the affirmative, I would have thought that this man was following a claim that had been said before him. When I asked you whether he was ever blamed for telling lies, your reply was in the negative, so I took it for granted that a person who did not tell a lie about (others) the people could never tell a lie about Allah. Then I asked you whether any of his ancestors was a king. Your reply was in the negative, and if it had been in the affirmative, I would have thought that this man wanted to take back his ancestral kingdom. When I asked you whether the rich or the poor people followed him, you replied that it was the poor who followed him. In fact, such are the followers of the apostles. Then I asked you whether his followers were increasing or decreasing. You replied that they were increasing. In fact, this is the result of true faith till it is complete (in all respects). I asked you whether there was anybody who, after embracing his religion, became displeased and discarded his religion; your reply was in the negative. In fact, this is the sign of true faith, for when its cheerfulness enters and mixes in the hearts completely, nobody will be displeased with it. I asked you whether he had ever broken his promise. You replied in the negative. And such are the apostles; they never break their promises. When I asked you whether you fought with him and he fought with you, you replied that he did, and that sometimes he was victorious and sometimes you. Indeed, such are the apostles; they are put to trials and the final victory is always theirs. Then I asked you what he ordered you. You replied that he ordered you to worship Allah alone and not to worship others along with Him, to leave all that your fore-fathers used to worship, to offer prayers, to speak the truth, to be chaste, to keep promises, and to return what is entrusted to you. These are really the qualities of a prophet who, I knew (from the previous Scriptures) would appear, but I did not know that he would be from amongst you. If what you say should be true, he will very soon occupy the earth under my feet, and if I knew that I would reach him definitely, I would go immediately to meet Him; and were I with him, then I would certainly wash his feet.' \" Abu Sufyan added, \"Caesar then asked for the letter of Allah's Messenger (ﷺ) and it was read. Its contents were: \"In the name of Allah, the most Beneficent, the most Merciful (This letter is) from Muhammad, the slave of Allah, and His Apostle, to Heraculius, the Ruler of the Byzantine. Peace be upon the followers of guidance. Now then, I invite you to Islam (i.e. surrender to Allah), embrace Islam and you will be safe; embrace Islam and Allah will bestow on you a double reward. But if you reject this invitation of Islam, you shall be responsible for misguiding the tillers (i.e. your nation). O people of the Scriptures! Come to a word common to you and us and you, that we worship. None but Allah, and that we associate nothing in worship with Him; and that none of us shall take others as Lords besides Allah. Then if they turn away, say: Bear witness that we are (they who have surrendered (unto Him)..(3.64) Abu Sufyan added, \"When Heraclius had finished his speech, there was a great hue and cry caused by the Byzantine Royalties surrounding him, and there was so much noise that I did not understand what they said. So, we were turned out of the court. When I went out with my companions and we were alone, I said to them, 'Verily, Ibn Abi Kabsha's (i.e. the Prophet's) affair has gained power. This is the King of Bani Al-Asfar fearing him.\" Abu Sufyan added, \"By Allah, I remained low and was sure that his religion would be victorious till Allah converted me to Islam, though I disliked it.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے قیصر کو ایک خط لکھا جس میں آپ صلی اللہ علیہ وسلم نے اسے اسلام کی دعوت دی تھی ۔ دحیہ کلبی رضی اللہ عنہ کو آپ صلی اللہ علیہ وسلم نے مکتوب دے کر بھیجا اور انہیں حکم دیا کہ مکتوب بصریٰ کے گورنر کے حوالہ کر دیں وہ اسے قیصر تک پہنچا دے گا ۔ جب فارس کی فوج ( اس کے مقابلے میں ) شکست کھا کر پیچھے ہٹ گئی تھی ( اور اس کے ملک کے مقبوضہ علاقے واپس مل گئے تھے ) تو اس انعام کے شکرانہ کے طور پر جو اللہ تعالیٰ نے ( اس کا ملک اسے واپس دے کر ) اس پر کیا تھا ابھی قیصر حمص سے ایلیاء ( بیت المقدس ) تک پیدل چل کر آیا تھا ۔ جب اس کے پاس رسول اللہ صلی اللہ علیہ وسلم کا نامہ مبارک پہنچا اور اس کے سامنے پڑھا گیا تو اس نے کہا کہ اگر ان کی ( آنحضرت صلی اللہ علیہ وسلم کی ) قوم کا کوئی شخص یہاں ہو تو اسے تلاش کر کے لاؤ تاکہ میں اس رسول صلی اللہ علیہ وسلم کے متعلق اس سے کچھ سوالات کروں ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ مجھے ابوسفیان رضی اللہ عنہ نے خبر دی کہ قریش کے ایک قافلے کے ساتھ وہ ان دنوں شام میں مقیم تھے ۔ یہ قافلہ اس دور میں یہاں تجارت کی غرض سے آیا تھا جس میں آنحضرت اور کفار قریش میں باہم صلح ہو چکی تھی ۔ ( صلح حدیبیہ ) ابوسفیان نے کہا کہ قیصر کے آدمی کی ہم سے شام کے ایک مقام پر ملاقات ہوئی اور وہ مجھے اور میرے ساتھیوں کو اپنے ( قیصر کے دربار میں بیت المقدس ) لے کر چلا پھر جب ہم ایلیاء ( بیت المقدس ) پہنچے تو قیصر کے دربار میں ہماری بازیابی ہوئی ۔ اس وقت قیصر دربار میں بیٹھا ہوا تھا ۔ اس کے سر پر تاج تھا اور روم کے امراء اس کے اردگرد تھے ، اس نے اپنے ترجمان سے کہا کہ ان سے پوچھو کہ جنہوں نے ان کے یہاں نبوت کا دعویٰ کیا ہے نسب کے اعتبار سے ان سے قریب ان میں سے کون شخص ہے ؟ ابوسفیان نے بیان کیا کہ میں نے کہا میں نسب کے اعتبار سے ان کے زیادہ قریب ہوں ۔ قیصر نے پوچھا تمہاری اور ان کی قرابت کیا ہے ؟ میں نے کہا ( رشتے میں ) وہ میرے چچازاد بھائی ہوتے ہیں ، اتفاق تھا کہ اس مرتبہ قافلے میں میرے سوا بنی عبد مناف کا اور آدمی موجود نہیں تھا ۔ قیصر نے کہا کہ اس شخص ( ابوسفیان رضی اللہ عنہ ) کو مجھ سے قریب کر دو اور جو لوگ میرے ساتھ تھے اس کے حکم سے میرے پیچھے قریب میں کھڑے کر دئیے گئے ۔ اس کے بعد اس نے اپنے ترجمان سے کہا کہ اس شخص ( ابوسفیان ) کے ساتھیوں سے کہہ دو کہ اس سے میں ان صاحب کے بارے میں پوچھوں گا جو نبی ہونے کے مدعی ہیں ، اگر یہ ان کے بارے میں کوئی جھوٹ بات کہے تو تم فوراً اس کی تکذیب کر دو ۔ ابوسفیان نے بیان کیا کہ خدا کی قسم ! اگر اس دن اس بات کی شرم نہ ہوتی کہ کہیں میرے ساتھی میری تکذیب نہ کر بیٹھیں تو میں ان سوالات کے جوابات میں ضرور جھوٹ بول جاتا جو اس نے آنحضرت صلی اللہ علیہ وسلم کے بارے میں کئے تھے ، لیکن مجھے تو اس کا خطرہ لگا رہا کہ کہیں میرے ساتھی میری تکذیب نہ کر دیں ۔ اس لیے میں نے سچائی سے کام لیا ۔ اس کے بعد اس نے اپنے ترجمان سے کہا اس سے پوچھو کہ تم لوگوں میں ان صاحب صلی اللہ علیہ وسلم کا نسب کیسا سمجھا جاتا ہے ؟ میں نے بتایا کہ ہم میں ان کا نسب بہت عمدہ سمجھا جاتا ہے ۔ اس نے پوچھا اچھا یہ نبوت کا دعویٰ اس سے پہلے بھی تمہارے یہاں کسی نے کیا تھا ؟ میں نے کہا کہ نہیں ۔ اس نے پوچھا کیا اس دعویٰ سے پہلے ان پر کوئی جھوٹ کا الزام تھا ؟ میں نے کہا کہ نہیں ، اس نے پوچھا ان کے باپ دادوں میں کوئی بادشاہ گزرا ہے ؟ میں نے کہا نہیں ۔ اس نے پوچھا تو اب بڑے امیر لوگ ان کی اتباع کرتے ہیں یا کمزور اور کم حیثیت کے لوگ ؟ میں نے کہا کہ کمزور اور معمولی حیثیت کے لوگ ہی ان کے ( زیادہ تر ماننے والے ہیں ) اس نے پوچھا کہ اس کے ماننے والوں کی تعداد بڑھتی رہتی ہے یا گھٹتی جا رہی ہے ؟ میں نے کہا جی نہیں تعداد برابر بڑھتی جا رہی ہے ۔ اس نے پوچھا کوئی ان کے دین سے بیزار ہو کر اسلام لانے کے بعد پھر بھی گیا ہے کیا ؟ میں نے کہا کہ نہیں ، اس نے پوچھا انہوں نے کبھی وعدہ خلافی بھی کی ہے ؟ میں نے کہا کہ نہیں لیکن آج کل ہمارا ان سے ایک معاہدہ ہو رہا ہے اور ہمیں ان کی طرف سے معاہدہ کی خلاف ورزی کا خطرہ ہے ۔ ابوسفیان نے کہا کہ پوری گفتگو میں سوا اس کے اور کوئی ایسا موقع نہیں ملا جس میں میں کوئی ایسی بات ( جھوٹی ) ملا سکوں جس سے آنحضرت صلی اللہ علیہ وسلم کی توہین ہو ۔ اور اپنے ساتھیوں کی طرف سے بھی جھٹلانے کا ڈر نہ ہو ۔ اس نے پھر پوچھا کیا تم نے کبھی ان سے لڑائی کی ہے یا انہوں نے تم سے جنگ کی ہے ؟ میں نے کہا کہ ہاں ، اس نے پوچھا تمہاری لڑائی کا کیا نتیجہ نکلتا ہے ؟ میں نے کہا لڑائی میں ہمیشہ کسی ایک گروہ نے فتح نہیں حاصل کی ۔ کبھی وہ ہمیں مغلوب کر لیتے ہیں اور کبھی ہم انہیں ، اس نے پوچھا وہ تمہیں کن کاموں کا حکم دیتے ہیں ؟ کہا ہمیں وہ اس کا حکم دیتے ہیں کہ ہم صرف اللہ کی عبادت کریں اور اس کا کسی کو بھی شریک نہ ٹھہرائیں ، ہمیں ان بتوں کی عبادت سے منع کرتے ہیں جن کی ہمارے باپ دادا عبادت کیا کرتے تھے ، نماز ، صدقہ ، پاک بازی و مروت ، وفاء عہد اور امانت کے ادا کرنے کا حکم دیتے ہیں ۔ جب میں اسے یہ تمام باتیں بتا چکا تو اس نے اپنے ترجمان سے کہا ، ان سے کہو کہ میں نے تم سے ان صلی اللہ علیہ وسلم کے نسب کے متعلق دریافت کیا تو تم نے بتایا کہ وہ تمہارے یہاں صاحب نسب اور شریف سمجھے جاتے ہیں اور انبیاء بھی یوں ہی اپنی قوم کے اعلیٰ نسب میں پیدا کئے جاتے ہیں ۔ میں نے تم سے یہ پوچھا تھا کہ کیا نبوت کا دعویٰ تمہارے یہاں اس سے پہلے بھی کسی نے کیا تھا تم نے بتایا کہ ہمارے یہاں ایسا دعویٰ پہلے کسی نے نہیں کیا تھا ، اس سے میں یہ سمجھا کہ اگر اس سے پہلے تمہارے یہاں کسی نے نبوت کا دعویٰ کیا ہوتا تو میں یہ بھی کہہ سکتا تھا کہ یہ صاحب بھی اسی دعویٰ کی نقل کر رہے ہیں جو اس سے پہلے کیا جا چکا ہے ۔ میں نے تم سے دریافت کیا کہ کیا تم نے دعویٰ نبوت سے پہلے کبھی ان کی طرف جھوٹ منسوب کیا تھا ، تم نے بتایا کہ ایسا کبھی نہیں ہوا ۔ اس سے میں اس نتیجے پر پہنچا کہ یہ ممکن نہیں کہ ایک شخص جو لوگوں کے متعلق کبھی جھوٹ نہ بول سکا ہو وہ خدا کے متعلق جھوٹ بول دے ۔ میں نے تم سے دریافت کیا کہ ان کے باپ دادوں میں کوئی بادشاہ تھا ، تم نے بتایا کہ نہیں ۔ میں نے اس سے یہ فیصلہ کیا کہ اگر ان کے باپ دادوں میں کوئی بادشاہ گزرا ہوتا تو میں یہ بھی کہہ سکتا تھا کہ ( نبوت کا دعویٰ کر کے ) وہ اپنے باپ دادا کی سلطنت حاصل کرنا چاہتے ہیں ، میں نے تم سے دریافت کیا کہ ان کی اتباع قوم کے بڑے لوگ کرتے ہیں یا کمزور اور بے حیثیت لوگ ، تم نے بتایا کہ کمزور غریب قسم کے لوگ ان کی تابعداری کرتے ہیں اور یہی گروہ انبیاء کی ( ہر دور میں ) اطاعت کرنے والا رہا ہے ۔ میں نے تم سے پوچھا کہ ان تابعداروں کی تعداد بڑھتی رہتی ہے یا گھٹتی بھی ہے ؟ تم نے بتایا کہ وہ لوگ برابر بڑھ ہی رہے ہیں ، ایمان کا بھی یہی حال ہے ، یہاں تک کہ وہ مکمل ہو جائے ، میں نے تم سے دریافت کیا کہ کیا کوئی شخص ان کے دین میں داخل ہونے کے بعد کبھی اس سے پھر بھی گیا ہے ؟ تم نے کہا کہ ایسا کبھی نہیں ہوا ، ایمان کا بھی یہی حال ہے جب وہ دل کی گہرائیوں میں اتر جائے تو پھر کوئی چیز اس سے مومن کو ہٹا نہیں سکتی ۔ میں نے تم سے دریافت کیا کہ کیا انہوں نے وعدہ خلافی بھی کی ہے ؟ تم نے اس کا بھی جواب دیا کہ نہیں ، انبیاء کی یہی شان ہے کہ وہ وعدہ خلافی کبھی نہیں کرتے ۔ میں نے تم سے دریافت کیا کہ کیا تم نے کبھی ان سے یا انہوں نے تم سے جنگ بھی کی ہے ؟ تم نے بتایا کہ ایسا ہوا ہے اور تمہاری لڑائیوں کا نتیجہ ہمیشہ کسی ایک ہی کے حق میں نہیں گیا ۔ بلکہ کبھی تم مغلوب ہوئے ہو اور کبھی وہ ۔ انبیاء کے ساتھ بھی ایسا ہی ہوتا ہے وہ امتحان میں ڈالے جاتے ہیں لیکن انجام انہیں کا بہتر ہوتا ہے ۔ میں نے تم سے دریافت کیا کہ وہ تم کو کن کاموں کا حکم دیتے ہیں ؟ تم نے بتایا کہ وہ ہمیں اس کا حکم دیتے ہیں کہ اللہ کی عبادت کرو اور اس کے ساتھ کسی کو شریک نہ ٹھہراؤ اور تمہیں تمہارے ان معبودوں کی عبادت سے منع کرتے ہیں جن کی تمہارے باپ دادا عبادت کیا کرتے تھے ۔ تمہیں وہ نماز ، صدقہ ، پاک بازی ، وعدہ وفائی اور اداء امانت کا حکم دیتے ہیں ، اس نے کہا کہ ایک نبی کی یہی صفت ہے میرے بھی علم میں یہ بات تھی کہ وہ نبی مبعوث ہونے والے ہیں ۔ لیکن یہ خیال نہ تھا کہ تم میں سے وہ مبعوث ہوں گے ، جو باتیں تم نے بتائیں اگر وہ صحیح ہیں تو وہ دن بہت قریب ہے جب وہ اس جگہ پر حکمراں ہوں گے جہاں اس وقت میرے دونوں قدم موجود ہیں ، اگر مجھے ان تک پہنچ سکنے کی توقع ہوتی تو میں ان کی خدمت میں حاضر ہونے کی پوری کوشش کرتا اور اگر میں ان کی خدمت میں موجود ہوتا تو ان کے پاؤں دھوتا ۔ ابوسفیان نے بیان کیا کہ اس کے بعد قیصر نے رسول اللہ صلی اللہ علیہ وسلم کا نامہ مبارک طلب کیا اور وہ اس کے سامنے پڑھا گیا اس میں لکھا ہوا تھا ( ترجمہ ) شروع کرتا ہوں اللہ کے نام سے جو بڑا ہی مہربان نہایت رحم کرنے والا ہے ۔ یہ خط ہے محمد اللہ کے بندے اور اس کے رسول کی طرف سے روم کے بادشاہ ہرقل کی طرف ، اس شخص پر سلامتی ہو جو ہدایت قبول کر لے ۔ امابعد میں تمہیں اسلام کی دعوت دیتا ہوں ۔ اسلام قبول کرو ، تمہیں بھی سلامتی و امن حاصل ہو گی اور اسلام قبول کرو اللہ تمہیں دہرا اجر دے گا ( ایک تمہارے اپنے اسلام کا اور دوسرا تمہاری قوم کے اسلام کا جو تمہاری وجہ سے اسلام میں داخل ہو گی ) لیکن اگر تم نے اس دعوت سے منہ موڑ لیا تو تمہاری رعایا کا گناہ بھی تم پر ہو گا ۔ اور اے اہل کتاب ! ایک ایسے کلمہ پر آ کر ہم سے مل جاؤ جو ہمارے اور تمہارے درمیان ایک ہی ہے یہ کہ ہم اللہ کے سوا اور کسی کی عبادت نہ کریں نہ اس کے ساتھ کسی کو شریک ٹھہرائیں اور نہ ہم میں سے کوئی اللہ کو چھوڑ کر آپس میں ایک دوسرے کو پروردگار بنائے اب بھی اگر تم منہ موڑتے ہو تو اس کا اقرار کر لو کہ ( اللہ تعالیٰ کا واقعی ) فرمان بردار ہم ہی ہیں ۔ ابوسفیان نے بیان کیا کہ جب ہرقل اپنی بات پوری کر چکا تو روم کے سردار اس کے اردگرد جمع تھے ، سب ایک ساتھ چیخنے لگے اور شور و غل بہت بڑھ گیا ۔ مجھے کچھ پتہ نہیں چلا کہ یہ لوگ کیا کہہ رہے تھے ۔ پھر ہمیں حکم دیا گیا اور ہم وہاں سے نکال دئیے گئے ۔ جب میں اپنے ساتھیوں کے ساتھ وہاں سے چلا آیا اور ان کے ساتھ تنہائی ہوئی تو میں نے کہا کہ ابن ابی کبشہ ( مراد حضور اکرم صلی اللہ علیہ وسلم سے ہے ) کا معاملہ بہت آگے بڑھ چکا ہے ، ” بنوالا صفر ‘‘ ( رومیوں ) کا بادشاہ بھی اس سے ڈرتا ہے ، ابوسفیان نے بیان کیا کہ اللہ کی قسم ! مجھے اسی دن سے اپنی ذلت کا یقین ہو گیا تھا اور برابر اس بات کا بھی یقین رہا کہ آنحضرت صلی اللہ علیہ وسلم ضرور غالب ہوں گے ، یہاں تک کہ اللہ تعالیٰ نے میرے دل میں بھی اسلام داخل کر دیا ۔ حالانکہ ( پہلے ) میں اسلام کو برا جانتا تھا ۔",
                "urduNarrator": "ہم سے ابراہیم بن حمزہ نے بیان کیا ، کہا کہ ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے صالح بن کیسان نے ، ان سے ابن شہاب نے ، ان سے عبیداللہ بن عبداللہ بن عتبہ نے اور انہیں عبداللہ بن عباس رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَتَبَ إِلَى قَيْصَرَ يَدْعُوهُ إِلَى الإِسْلاَمِ، وَبَعَثَ بِكِتَابِهِ إِلَيْهِ مَعَ دِحْيَةَ الْكَلْبِيِّ، وَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَدْفَعَهُ إِلَى عَظِيمِ بُصْرَى لِيَدْفَعَهُ إِلَى قَيْصَرَ، وَكَانَ قَيْصَرُ لَمَّا كَشَفَ اللَّهُ عَنْهُ جُنُودَ فَارِسَ مَشَى مِنْ حِمْصَ إِلَى إِيلِيَاءَ، شُكْرًا لِمَا أَبْلاَهُ اللَّهُ، فَلَمَّا جَاءَ قَيْصَرَ كِتَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ حِينَ قَرَأَهُ الْتَمِسُوا لِي هَا هُنَا أَحَدًا مِنْ قَوْمِهِ لأَسْأَلَهُمْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.قَالَ ابْنُ عَبَّاسٍ فَأَخْبَرَنِي أَبُو سُفْيَانَ، أَنَّهُ كَانَ بِالشَّأْمِ فِي رِجَالٍ مِنْ قُرَيْشٍ، قَدِمُوا تِجَارًا فِي الْمُدَّةِ الَّتِي كَانَتْ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ كُفَّارِ قُرَيْشٍ، قَالَ أَبُو سُفْيَانَ فَوَجَدَنَا رَسُولُ قَيْصَرَ بِبَعْضِ الشَّأْمِ فَانْطَلَقَ بِي وَبِأَصْحَابِي حَتَّى قَدِمْنَا إِيلِيَاءَ، فَأُدْخِلْنَا عَلَيْهِ، فَإِذَا هُوَ جَالِسٌ فِي مَجْلِسِ مُلْكِهِ وَعَلَيْهِ التَّاجُ، وَإِذَا حَوْلَهُ عُظَمَاءُ الرُّومِ فَقَالَ لِتُرْجُمَانِهِ سَلْهُمْ أَيُّهُمْ أَقْرَبُ نَسَبًا إِلَى هَذَا الرَّجُلِ الَّذِي يَزْعُمُ أَنَّهُ نَبِيٌّ قَالَ أَبُو سُفْيَانَ فَقُلْتُ أَنَا أَقْرَبُهُمْ نَسَبًا‏.‏ قَالَ مَا قَرَابَةُ مَا بَيْنَكَ وَبَيْنَهُ فَقُلْتُ هُوَ ابْنُ عَمِّي، وَلَيْسَ فِي الرَّكْبِ يَوْمَئِذٍ أَحَدٌ مِنْ بَنِي عَبْدِ مَنَافٍ غَيْرِي‏.‏ فَقَالَ قَيْصَرُ أَدْنُوهُ‏.‏ وَأَمَرَ بِأَصْحَابِي فَجُعِلُوا خَلْفَ ظَهْرِي عِنْدَ كَتِفِي، ثُمَّ قَالَ لِتُرْجُمَانِهِ قُلْ لأَصْحَابِهِ إِنِّي سَائِلٌ هَذَا الرَّجُلَ عَنِ الَّذِي يَزْعُمُ أَنَّهُ نَبِيٌّ، فَإِنْ كَذَبَ فَكَذِّبُوهُ‏.‏ قَالَ أَبُو سُفْيَانَ وَاللَّهِ لَوْلاَ الْحَيَاءُ يَوْمَئِذٍ مِنْ أَنْ يَأْثُرَ أَصْحَابِي عَنِّي الْكَذِبَ لَكَذَبْتُهُ حِينَ سَأَلَنِي عَنْهُ، وَلَكِنِّي اسْتَحْيَيْتُ أَنْ يَأْثُرُوا الْكَذِبَ عَنِّي فَصَدَقْتُهُ، ثُمَّ قَالَ لِتُرْجُمَانِهِ قُلْ لَهُ كَيْفَ نَسَبُ هَذَا الرَّجُلِ فِيكُمْ قُلْتُ هُوَ فِينَا ذُو نَسَبٍ‏.‏ قَالَ فَهَلْ قَالَ هَذَا الْقَوْلَ أَحَدٌ مِنْكُمْ قَبْلَهُ قُلْتُ لاَ‏.‏ فَقَالَ كُنْتُمْ تَتَّهِمُونَهُ عَلَى الْكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ قُلْتُ لاَ‏.‏ قَالَ فَهَلْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ قُلْتُ لاَ‏.‏ قَالَ فَأَشْرَافُ النَّاسِ يَتَّبِعُونَهُ أَمْ ضُعَفَاؤُهُمْ قُلْتُ بَلْ ضُعَفَاؤُهُمْ‏.‏ قَالَ فَيَزِيدُونَ أَوْ يَنْقُصُونَ قُلْتُ بَلْ يَزِيدُونَ‏.‏ قَالَ فَهَلْ يَرْتَدُّ أَحَدٌ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ قُلْتُ لاَ‏.‏ قَالَ فَهَلْ يَغْدِرُ قُلْتُ لاَ، وَنَحْنُ الآنَ مِنْهُ فِي مُدَّةٍ، نَحْنُ نَخَافُ أَنْ يَغْدِرَ‏.‏ قَالَ أَبُو سُفْيَانَ وَلَمْ يُمْكِنِّي كَلِمَةٌ أُدْخِلُ فِيهَا شَيْئًا أَنْتَقِصُهُ بِهِ لاَ أَخَافُ أَنْ تُؤْثَرَ عَنِّي غَيْرُهَا‏.‏ قَالَ فَهَلْ قَاتَلْتُمُوهُ أَوْ قَاتَلَكُمْ قُلْتُ نَعَمْ‏.‏ قَالَ فَكَيْفَ كَانَتْ حَرْبُهُ وَحَرْبُكُمْ قُلْتُ كَانَتْ دُوَلاً وَسِجَالاً، يُدَالُ عَلَيْنَا الْمَرَّةَ وَنُدَالُ عَلَيْهِ الأُخْرَى‏.‏ قَالَ فَمَاذَا يَأْمُرُكُمْ قَالَ يَأْمُرُنَا أَنْ نَعْبُدَ اللَّهَ وَحْدَهُ لاَ نُشْرِكُ بِهِ شَيْئًا، وَيَنْهَانَا عَمَّا كَانَ يَعْبُدُ آبَاؤُنَا، وَيَأْمُرُنَا بِالصَّلاَةِ وَالصَّدَقَةِ وَالْعَفَافِ وَالْوَفَاءِ بِالْعَهْدِ وَأَدَاءِ الأَمَانَةِ‏.‏ فَقَالَ لِتُرْجُمَانِهِ حِينَ قُلْتُ ذَلِكَ لَهُ قُلْ لَهُ إِنِّي سَأَلْتُكَ عَنْ نَسَبِهِ فِيكُمْ، فَزَعَمْتَ أَنَّهُ ذُو نَسَبٍ، وَكَذَلِكَ الرُّسُلُ تُبْعَثُ فِي نَسَبِ قَوْمِهَا، وَسَأَلْتُكَ هَلْ قَالَ أَحَدٌ مِنْكُمْ هَذَا الْقَوْلَ قَبْلَهُ فَزَعَمْتَ أَنْ لاَ، فَقُلْتُ لَوْ كَانَ أَحَدٌ مِنْكُمْ قَالَ هَذَا الْقَوْلَ قَبْلَهُ قُلْتُ رَجُلٌ يَأْتَمُّ بِقَوْلٍ قَدْ قِيلَ قَبْلَهُ‏.‏ وَسَأَلْتُكَ هَلْ كُنْتُمْ تَتَّهِمُونَهُ بِالْكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ فَزَعَمْتَ أَنْ لاَ، فَعَرَفْتُ أَنَّهُ لَمْ يَكُنْ لِيَدَعَ الْكَذِبَ عَلَى النَّاسِ وَيَكْذِبَ عَلَى اللَّهِ، وَسَأَلْتُكَ هَلْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ فَزَعَمْتَ أَنْ لاَ، فَقُلْتُ لَوْ كَانَ مِنْ آبَائِهِ مَلِكٌ قُلْتُ يَطْلُبُ مُلْكَ آبَائِهِ‏.‏ وَسَأَلْتُكَ أَشْرَافُ النَّاسِ يَتَّبِعُونَهُ أَمْ ضُعَفَاؤُهُمْ فَزَعَمْتَ أَنَّ ضُعَفَاءَهُمُ اتَّبَعُوهُ، وَهُمْ أَتْبَاعُ الرُّسُلِ، وَسَأَلْتُكَ هَلْ يَزِيدُونَ أَوْ يَنْقُصُونَ فَزَعَمْتَ أَنَّهُمْ يَزِيدُونَ، وَكَذَلِكَ الإِيمَانُ حَتَّى يَتِمَّ، وَسَأَلْتُكَ هَلْ يَرْتَدُّ أَحَدٌ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ فَزَعَمْتَ أَنْ لاَ، فَكَذَلِكَ الإِيمَانُ حِينَ تَخْلِطُ بَشَاشَتُهُ الْقُلُوبَ لاَ يَسْخَطُهُ أَحَدٌ، وَسَأَلْتُكَ هَلْ يَغْدِرُ فَزَعَمْتَ أَنْ لاَ، وَكَذَلِكَ الرُّسُلُ لاَ يَغْدِرُونَ‏.‏ وَسَأَلْتُكَ هَلْ قَاتَلْتُمُوهُ وَقَاتَلَكُمْ فَزَعَمْتَ أَنْ قَدْ فَعَلَ، وَأَنَّ حَرْبَكُمْ وَحَرْبَهُ تَكُونُ دُوَلاً، وَيُدَالُ عَلَيْكُمُ الْمَرَّةَ وَتُدَالُونَ عَلَيْهِ الأُخْرَى، وَكَذَلِكَ الرُّسُلُ تُبْتَلَى، وَتَكُونُ لَهَا الْعَاقِبَةُ، وَسَأَلْتُكَ بِمَاذَا يَأْمُرُكُمْ فَزَعَمْتَ أَنَّهُ يَأْمُرُكُمْ أَنْ تَعْبُدُوا اللَّهَ وَلاَ تُشْرِكُوا بِهِ شَيْئًا، وَيَنْهَاكُمْ عَمَّا كَانَ يَعْبُدُ آبَاؤُكُمْ، وَيَأْمُرُكُمْ بِالصَّلاَةِ وَالصِّدْقِ وَالْعَفَافِ وَالْوَفَاءِ بِالْعَهْدِ، وَأَدَاءِ الأَمَانَةِ، قَالَ وَهَذِهِ صِفَةُ النَّبِيِّ، قَدْ كُنْتُ أَعْلَمُ أَنَّهُ خَارِجٌ، وَلَكِنْ لَمْ أَظُنَّ أَنَّهُ مِنْكُمْ، وَإِنْ يَكُ مَا قُلْتَ حَقًّا، فَيُوشِكُ أَنْ يَمْلِكَ مَوْضِعَ قَدَمَىَّ هَاتَيْنِ، وَلَوْ أَرْجُو أَنْ أَخْلُصَ إِلَيْهِ لَتَجَشَّمْتُ لُقِيَّهُ، وَلَوْ كُنْتُ عِنْدَهُ لَغَسَلْتُ قَدَمَيْهِ‏.‏ قَالَ أَبُو سُفْيَانَ ثُمَّ دَعَا بِكِتَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُرِئَ فَإِذَا فِيهِ ‏\"‏ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ مِنْ مُحَمَّدٍ عَبْدِ اللَّهِ وَرَسُولِهِ، إِلَى هِرَقْلَ عَظِيمِ الرُّومِ، سَلاَمٌ عَلَى مَنِ اتَّبَعَ الْهُدَى، أَمَّا بَعْدُ فَإِنِّي أَدْعُوكَ بِدِعَايَةِ الإِسْلاَمِ، أَسْلِمْ تَسْلَمْ، وَأَسْلِمْ يُؤْتِكَ اللَّهُ أَجْرَكَ مَرَّتَيْنِ، فَإِنْ تَوَلَّيْتَ فَعَلَيْكَ إِثْمُ الأَرِيسِيِّينَ وَ‏{‏يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَنْ لاَ نَعْبُدَ إِلاَّ اللَّهَ وَلاَ نُشْرِكَ بِهِ شَيْئًا وَلاَ يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ فَإِنْ تَوَلَّوْا فَقُولُوا اشْهَدُوا بِأَنَّا مُسْلِمُونَ‏}‏‏\"‏‏.‏ قَالَ أَبُو سُفْيَانَ فَلَمَّا أَنْ قَضَى مَقَالَتَهُ، عَلَتْ أَصْوَاتُ الَّذِينَ حَوْلَهُ مِنْ عُظَمَاءِ الرُّومِ، وَكَثُرَ لَغَطُهُمْ، فَلاَ أَدْرِي مَاذَا قَالُوا، وَأُمِرَ بِنَا فَأُخْرِجْنَا، فَلَمَّا أَنْ خَرَجْتُ مَعَ أَصْحَابِي وَخَلَوْتُ بِهِمْ قُلْتُ لَهُمْ لَقَدْ أَمِرَ أَمْرُ ابْنِ أَبِي كَبْشَةَ، هَذَا مَلِكُ بَنِي الأَصْفَرِ يَخَافُهُ، قَالَ أَبُو سُفْيَانَ وَاللَّهِ مَا زِلْتُ ذَلِيلاً مُسْتَيْقِنًا بِأَنَّ أَمْرَهُ سَيَظْهَرُ، حَتَّى أَدْخَلَ اللَّهُ قَلْبِي الإِسْلاَمَ وَأَنَا كَارِهٌ‏.‏",
                "headingArabic": "دُعَاءِ النَّبِيِّ صلى الله عليه وسلم إِلَى الإِسْلاَمِ وَالنُّبُوَّةِ، وَأَنْ لاَ يَتَّخِذَ بَعْضُهُمْ بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو اسلام قبول کرنے کی دعوت",
                "headingEnglish": "The invitation of the Prophet saws to embrace Islam",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2812,
                "hadithNumber": "2942",
                "englishNarrator": "Narrated Sahl bin Sa`di رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) on the day (of the battle) of Khaibar saying, \"I will give the flag to a person at whose hands Allah will grant victory.\" So, the companions of the Prophet (ﷺ) got up, wishing eagerly to see to whom the flag will be given, and everyone of them wished to be given the flag. But the Prophet asked for `Ali. Someone informed him that he was suffering from eye-trouble. So, he ordered them to bring `Ali in front of him. Then the Prophet (ﷺ) spat in his eyes and his eyes were cured immediately as if he had never any eye-trouble. `Ali said, \"We will fight with them (i.e. infidels) till they become like us (i.e. Muslims).\" The Prophet (ﷺ) said, \"Be patient, till you face them and invite them to Islam and inform them of what Allah has enjoined upon them. By Allah! If a single person embraces Islam at your hands (i.e. through you), that will be better for you than the red camels.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے خیبر کی لڑائی کے دن فرمایا تھا کہ اسلامی جھنڈا میں ایک ایسے شخص کے ہاتھ میں دوں گا جس کے ذریعہ اللہ تعالیٰ فتح عنایت فرمائے گا ۔ اب سب اس انتظار میں تھے کہ دیکھئیے جھنڈا کسے ملتا ہے ، جب صبح ہوئی تو سب سرکردہ لوگ اسی امید میں رہے کہ کاش ! انہیں کو مل جائے لیکن آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا علی کہاں ہیں ؟ عرض کیا گیا کہ وہ آنکھوں کے درد میں مبتلا ہیں ، آخر آپ صلی اللہ علیہ وسلم کے حکم سے انہیں بلایا گیا ۔ آپ صلی اللہ علیہ وسلم نے اپنا لعاب دہن مبارک ان کی آنکھوں میں لگا دیا اور فوراً ہی وہ اچھے ہو گئے ۔ جیسے پہلے کوئی تکلیف ہی نہ رہی ہو ۔ حضرت علی رضی اللہ عنہ نے کہا ہم ان ( یہودیوں سے ) اس وقت تک جنگ کریں گے جب تک یہ ہمارے جیسے ( مسلمان ) نہ ہو جائیں ۔ لیکن آنحضرت صلی اللہ علیہ وسلم نے فرمایا ابھی ٹھہرو پہلے ان کے میدان میں اتر کر انہیں تم اسلام کی دعوت دے لو اور ان کے لیے جو چیز ضروری ہیں ان کی خبر کر دو ( پھر وہ نہ مانیں تو لڑنا ) اللہ کی قسم ! اگر تمہارے ذریعہ ایک شخص کو بھی ہدایت مل جائے تو یہ تمہارے حق میں سرخ اونٹوں سے بہتر ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، کہا ہم سے عبدالعزیز بن ابی حازم نے بیان کیا ، ان سے ان کے والد نے ، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ،",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْد ٍ ـ رضى الله عنه ـ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ يَوْمَ خَيْبَرَ ‏\"‏ لأُعْطِيَنَّ الرَّايَةَ رَجُلاً يَفْتَحُ اللَّهُ عَلَى يَدَيْهِ ‏\"‏‏.‏ فَقَامُوا يَرْجُونَ لِذَلِكَ أَيُّهُمْ يُعْطَى، فَغَدَوْا وَكُلُّهُمْ يَرْجُو أَنْ يُعْطَى فَقَالَ ‏\"‏ أَيْنَ عَلِيٌّ ‏\"‏‏.‏ فَقِيلَ يَشْتَكِي عَيْنَيْهِ، فَأَمَرَ فَدُعِيَ لَهُ، فَبَصَقَ فِي عَيْنَيْهِ، فَبَرَأَ مَكَانَهُ حَتَّى كَأَنَّهُ لَمْ يَكُنْ بِهِ شَىْءٌ فَقَالَ نُقَاتِلُهُمْ حَتَّى يَكُونُوا مِثْلَنَا‏.‏ فَقَالَ ‏\"‏ عَلَى رِسْلِكَ حَتَّى تَنْزِلَ بِسَاحَتِهِمْ، ثُمَّ ادْعُهُمْ إِلَى الإِسْلاَمِ، وَأَخْبِرْهُمْ بِمَا يَجِبُ عَلَيْهِمْ، فَوَاللَّهِ لأَنْ يُهْدَى بِكَ رَجُلٌ وَاحِدٌ خَيْرٌ لَكَ مِنْ حُمْرِ النَّعَمِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2813,
                "hadithNumber": "2943",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Whenever Allah's Messenger (ﷺ) attacked some people, he would never attack them till it was dawn. If he heard the Adhan (i.e. call for prayer) he would delay the fight, and if he did not hear the Adhan, he would attack them immediately after dawn. We reached Khaibar at night.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب کسی قوم پر چڑھائی کرتے تو اس وقت تک کوئی اقدام نہ فرماتے جب تک صبح نہ ہو جاتی ، جب صبح ہو جاتی اور اذان کی آواز سن لیتے تو رک جاتے اور اگر اذان کی آواز سنائی نہ دیتی تو صبح ہونے کے بعد حملہ کرتے ۔ چنانچہ خیبر میں بھی ہم رات میں پہنچے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے معاویہ بن عمرو نے بیان کیا ، کہا ہم سے ابواسحاق نے بیان کیا ، ان سے حمید نے کہا کہ میں نے انس رضی اللہ عنہ سے سنا ، آپ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ حُمَيْدٍ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا غَزَا قَوْمًا لَمْ يُغِرْ حَتَّى يُصْبِحَ، فَإِنْ سَمِعَ أَذَانًا أَمْسَكَ، وَإِنْ لَمْ يَسْمَعْ أَذَانًا أَغَارَ بَعْدَ مَا يُصْبِحُ، فَنَزَلْنَا خَيْبَرَ لَيْلاً‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2814,
                "hadithNumber": "2944",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The prophet (ﷺ) fought a battle along with us.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب ہمارے ساتھ مل کر غزوہ کرتے تھے ۔",
                "urduNarrator": "سے قتیبہ نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا غَزَا بِنَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2815,
                "hadithNumber": "2945",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) set out for Khaibar and reached it at night. He used not to attack if he reached the people at night, till the day broke. So, when the day dawned, the Jews came out with their bags and spades. When they saw the Prophet; they said, \"Muhammad and his army!\" The Prophet (ﷺ) said, Allahu--Akbar! (Allah is Greater) and Khaibar is ruined, for whenever we approach a nation (i.e. enemy to fight) then it will be a miserable morning for those who have been warned.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم رات میں خیبر تشریف لے گئے اور آپ صلی اللہ علیہ وسلم کی عادت تھی کہ جب کسی قوم تک رات کے وقت پہنچتے تو صبح سے پہلے ان پر حملہ نہیں کرتے تھے ۔ جب صبح ہوئی تو یہودی اپنے پھاوڑے اور ٹوکرے لے کر باہر ( کھیتوں میں کام کرنے کے لیے ) نکلے ۔ جب انہوں نے اسلامی لشکر کو دیکھا تو چیخ پڑے محمد واللہ محمد لشکر سمیت آ گئے ۔ پر نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اللہ کی ذات سب سے بڑی ہے ۔ اب خیبر تو خراب ہو گیا کہ جب ہم کسی قوم کے میدان میں مجاہدانہ اتر آتے ہیں تو ( کفر سے ) ڈرائے ہوئے لوگوں کی صبح منحوس ہو جاتی ہے ۔",
                "urduNarrator": "( دوسری سند ) ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے ، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ إِلَى خَيْبَرَ فَجَاءَهَا لَيْلاً، وَكَانَ إِذَا جَاءَ قَوْمًا بِلَيْلٍ لاَ يُغِيرُ عَلَيْهِمْ حَتَّى يُصْبِحَ، فَلَمَّا أَصْبَحَ، خَرَجَتْ يَهُودُ بِمَسَاحِيهِمْ وَمَكَاتِلِهِمْ، فَلَمَّا رَأَوْهُ قَالُوا مُحَمَّدٌ وَاللَّهِ، مُحَمَّدٌ وَالْخَمِيسُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اللَّهُ أَكْبَرُ، خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2816,
                "hadithNumber": "2946",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Apostle ﷺ said, \" I have been ordered to fight with the people till they say, 'None has the right to be worshipped but Allah,' and whoever says, 'None has the right to be worshipped but Allah,' his life and property will be saved by me except for Islamic law, and his accounts will be with Allah, (either to punish him or to forgive him.)\" Hadrat Umer and Ibn-e-Umer رضی اللہ عنہما  have also reported it from the prophet ﷺ .",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ مجھے حکم دیا گیا ہے کہ میں لوگوں سے اس وقت تک جنگ کرتا رہوں یہاں تک کہ وہ اس کا اقرار کر لیں کہ اللہ کے سوا اور کوئی معبود نہیں ، پس جس نے اقرار کر لیا کہ اللہ کے سوا اور کوئی معبود نہیں تو اس کی جان اور مال ہم سے محفوظ ہے سوا اس حق کے جس کی بناء پر قانوناً اس کی جان و مال زد میں آئے اور اس کا حساب اللہ کے ذمہ ہے ۔ اس کی روایت عمر اور ابن عمر رضی اللہ عنہما نے بھی نبی کریم صلی اللہ علیہ وسلم سے کی ہے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، کہا ہم سے سعید بن مسیب نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنَا سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ فَمَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ، فَقَدْ عَصَمَ مِنِّي نَفْسَهُ وَمَالَهُ، إِلاَّ بِحَقِّهِ، وَحِسَابُهُ عَلَى اللَّهِ ‏\"‏‏.‏ رَوَاهُ عُمَرُ وَابْنُ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2817,
                "hadithNumber": "2947",
                "englishNarrator": "Narrated Abdullah bin Ka,b رضی اللہ عنہ :",
                "hadithEnglish": "Whenever Allah's Messenger (ﷺ) intended to lead a Ghazwa, he would use an equivocation from which one would understand that he was going to a different destination .",
                "hadithUrdu": "جب آپ صلی اللہ علیہ وسلم کسی غزوہ کا ارادہ کرتے تو ( مصلحت کے لیے ) دوسرا مقام بیان کرتے ۔ ( تاکہ دشمن کو خبر نہ ہو ) ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے بیان کیا ، کہا کہ مجھے عبدالرحمٰن بن عبداللہ بن کعب بن مالک نے خبر دی اور انہیں عبداللہ بن کعب رضی اللہ عنہ نے ،کعب رضی اللہ عنہ ( جب نابینا ہو گئے تھے ) کے ساتھ ان کے دوسرے صاحبزادوں میں یہی عبداللہ انہیں لے کر راستے میں ان کے آگے آگے چلتے تھے ۔ رسول اللہ صلی اللہ علیہ وسلم کا اصول یہ تھا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ ـ رضى الله عنه ـ وَكَانَ قَائِدَ كَعْبٍ مِنْ بَنِيهِ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَلَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم يُرِيدُ غَزْوَةً إِلاَّ وَرَّى بِغَيْرِهَا‏.‏",
                "headingArabic": "مَنْ أَرَادَ غَزْوَةً فَوَرَّى بِغَيْرِهَا، وَمَنْ أَحَبَّ الْخُرُوجَ يَوْمَ الْخَمِيسِ",
                "headingUrdu": "غزوے کی اصل منزل کو چھپانا۔",
                "headingEnglish": "Concealing the true destination of a Ghazwa",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2818,
                "hadithNumber": "2948",
                "englishNarrator": "Narrated Ka`b bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Whenever Allah's Messenger (ﷺ) intended to carry out a Ghazwa, he would use an equivocation to conceal his real destination till it was the Ghazwa of Tabuk which Allah's Messenger (ﷺ) carried out in very hot weather. As he was going to face a very long journey through a wasteland and was to meet and attack a large number of enemies. So, he made the situation clear to the Muslims so that they might prepare themselves accordingly and get ready to conquer their enemy. The Prophet (ﷺ) informed them of the destination he was heading for.",
                "hadithUrdu": "آنحضرت کسی جہاد کا قصد کریں اور وہی مقام بیان فرما کر اس کو نہ چھپائیں ۔ جب آپ صلی اللہ علیہ وسلم غزوہ تبوک کو جانے لگے تو چونکہ یہ غزوہ بڑی سخت گرمی میں ہونا تھا ، لمبا سفر تھا اور جنگلوں کو طے کرنا تھا اور مقابلہ بھی بہت بڑی فوج سے تھا ، اس لیے آپ صلی اللہ علیہ وسلم نے مسلمانوں سے صاف صاف فرما دیا تھا تاکہ دشمن کے مقابلہ کے لیے پوری تیاری کر لیں چنانچہ ( غزوہ کے لیے ) جہاں آپ صلی اللہ علیہ وسلم کو جانا تھا ( یعنی تبوک ) اس کا آپ نے صاف اعلان کر دیا تھا ۔",
                "urduNarrator": "اور مجھ سے احمد بن محمد نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں یونس نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں عبدالرحمٰن بن عبداللہ بن کعب بن مالک نے خبر دی ، انہوں نے کہا کہ میں نے کعب بن مالک رضی اللہ عنہ سے سنا آپ بیان کرتے تھے کہ",
                "hadithArabic": "وَحَدَّثَنِي أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَلَّمَا يُرِيدُ غَزْوَةً يَغْزُوهَا إِلاَّ وَرَّى بِغَيْرِهَا، حَتَّى كَانَتْ غَزْوَةُ تَبُوكَ، فَغَزَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَرٍّ شَدِيدٍ، وَاسْتَقْبَلَ سَفَرًا بَعِيدًا وَمَفَازًا، وَاسْتَقْبَلَ غَزْوَ عَدُوٍّ كَثِيرٍ، فَجَلَّى لِلْمُسْلِمِينَ أَمْرَهُمْ، لِيَتَأَهَّبُوا أُهْبَةَ عَدُوِّهِمْ، وَأَخْبَرَهُمْ بِوَجْهِهِ الَّذِي يُرِيدُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2819,
                "hadithNumber": "2949",
                "englishNarrator": "Narrator Ka`b bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "\"Scarcely did Allah's Messenger (ﷺ) set out for a journey on a day other than Thursday.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کسی سفر میں جمعرات کے سوا اور کسی دن نکلیں ۔",
                "urduNarrator": "یونس سے روایت ہے ، ان سے زہری نے بیان کیا ، انہوں نے کہا کہ مجھے عبدالرحمٰن بن کعب بن مالک نے خبر دی کہ حضرت کعب بن مالک رضی اللہ عنہ کہا کرتے تھے کہ کم ایسا ہوتا کہ",
                "hadithArabic": "وَعَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ كَعْبِ بْنِ مَالِكٍ، أَنَّ كَعْبَ بْنَ مَالِكٍ ـ رضى الله عنه ـ كَانَ يَقُولُ لَقَلَّمَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَخْرُجُ إِذَا خَرَجَ فِي سَفَرٍ إِلاَّ يَوْمَ الْخَمِيسِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2820,
                "hadithNumber": "2950",
                "englishNarrator": "Narrated Ka`b bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) set out on Thursday for the Ghazwa of Tabuk and he used to prefer to set out (i.e. travel) on Thursdays.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم غزوہ تبوک کے لیے جمعرات کے دن نکلے تھے ۔ آپ صلی اللہ علیہ وسلم جمعرات کے دن سفر کرنا پسند فرماتے تھے ۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا ہم سے ہشام نے بیان کیا ، انہیں معمر نے خبر دی ، انہیں زہری نے ، انہیں عبدالرحمٰن بن کعب بن مالک نے اور انہیں ان کے والد حضرت کعب بن مالک رضی اللہ عنہ نے",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمَ الْخَمِيسِ فِي غَزْوَةِ تَبُوكَ، وَكَانَ يُحِبُّ أَنْ يَخْرُجَ يَوْمَ الْخَمِيسِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2821,
                "hadithNumber": "2951",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) offered a four-rak`at Zuhr prayer at Medina and then offered a two rak`at `Asr prayer at Dhul-Hulaifa and I heard the companions of the Prophet (ﷺ) reciting Talbiya aloud (for Hajj and `Umra) altogether.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے مدینہ میں ظہر چار رکعت پڑھی پھر عصر کی نماز ذوالحلیفہ میں دو رکعت پڑھی اور میں نے سنا کہ صحابہ حج اور عمرہ دونوں کا لبیک ایک ساتھ پکار رہے تھے ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے ابوقلابہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ رضى الله عنه أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى بِالْمَدِينَةِ الظُّهْرَ أَرْبَعًا، وَالْعَصْرَ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ، وَسَمِعْتُهُمْ يَصْرُخُونَ بِهِمَا جَمِيعًا‏.‏",
                "headingArabic": "الْخُرُوجِ بَعْدَ الظُّهْرِ",
                "headingUrdu": "دوپہر کے بعد نکلنا",
                "headingEnglish": "Setting out after midday",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2822,
                "hadithNumber": "2952",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "We set out in the company of Allah's Messenger (ﷺ) five days before the end of Dhul Qa'da intending to perform Hajj only. When we approached Mecca Allah's Messenger (ﷺ) ordered those who did not have the Hadi (i.e. an animal for sacrifice) with them, to perform the Tawaf around the Ka`ba, and between Safa and Marwa and then finish their Ihram. Beef was brought to us on the day of (i.e. the days of slaughtering) and I asked, \"What is this?\" Somebody said, Allah's Messenger (ﷺ) has slaughtered (a cow) on behalf of his wives.\" Yahya says: When I narrated this Hadith to Hadrat Qasim bin Muhammad, he said: By Allah She has narrated this Hadith to you in a right way.",
                "hadithUrdu": "مدینہ سے ( حجۃ الوداع کے لیے ) رسول کریم صلی اللہ علیہ وسلم کے ساتھ ہم اس وقت نکلے جب ذی قعدہ کے پانچ دن باقی تھے ۔ ہفتہ کے دن ہمارا مقصد حج کے سوا اور کچھ بھی نہ تھا ۔ جب ہم مکہ سے قریب ہوئے تو رسول کریم صلی اللہ علیہ وسلم نے حکم فرمایا کہ جس کے ساتھ قربانی کا جانور نہ ہو جب وہ بیت اللہ کے طواف اور صفا اور مروہ کی سعی سے فارغ ہو جائے تو احرام کھول دے ۔ ( پھر حج کے لیے بعد میں احرام باندھے ) حضرت عائشہ رضی اللہ عنہا نے کہا کہ دسویں ذی الحجہ کو ہمارے یہاں گائے کا گوشت آیا ، میں نے پوچھا کہ گوشت کیسا ہے ؟ تو بتایا گیا کہ رسول کریم صلی اللہ علیہ وسلم نے اپنی بیویوں کی طرف سے جو گائے قربانی کی ہے یہ اسی کا گوشت ہے ۔ یحییٰ نے بیان کیا کہ میں نے اس کے بعد اس حدیث کا ذکر قاسم بن محمد سے کیا تو انہوں نے بتایا کہ قسم اللہ کی ! عمرہ بنت عبدالرحمٰن نے تم سے یہ حدیث ٹھیک ٹھیک بیان کی ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا امام مالک سے ، ان سے یحییٰ بن سعید نے ، ان سے عمرہ بنت عبدالرحمٰن نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّهَا سَمِعَتْ عَائِشَةَ ـ رضى الله عنها ـ تَقُولُ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لِخَمْسِ لَيَالٍ بَقِينَ مِنْ ذِي الْقَعْدَةِ، وَلاَ نُرَى إِلاَّ الْحَجَّ، فَلَمَّا دَنَوْنَا مِنْ مَكَّةَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ إِذَا طَافَ بِالْبَيْتِ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ أَنْ يَحِلَّ‏.‏ قَالَتْ عَائِشَةُ فَدُخِلَ عَلَيْنَا يَوْمَ النَّحْرِ بِلَحْمِ بَقَرٍ فَقُلْتُ مَا هَذَا فَقَالَ نَحَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَزْوَاجِهِ‏.‏ قَالَ يَحْيَى فَذَكَرْتُ هَذَا الْحَدِيثَ لِلْقَاسِمِ بْنِ مُحَمَّدٍ فَقَالَ أَتَتْكَ وَاللَّهِ بِالْحَدِيثِ عَلَى وَجْهِهِ‏.‏",
                "headingArabic": "الْخُرُوجِ آخِرَ الشَّهْرِ",
                "headingUrdu": "مہینے کے آخری حصے میں نکلنا",
                "headingEnglish": "Setting out in the last part of the month",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2823,
                "hadithNumber": "2953",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Once the Prophet (ﷺ) set out in the month of Ramadan. He observed fasting till he reached a place called Kadid where he broke his fast. Sufyan, Zuhri, Obadullah reports this complete Hadith from Hadrat Ibn-e-Abbas رضی اللہ عنہما .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ( فتح مکہ کے لیے مدینہ سے ) رمضان میں نکلے اور روزے سے تھے ۔ جب آپ صلی اللہ علیہ وسلم مقام کدید پر پہنچے تو آپ صلی اللہ علیہ وسلم نے افطار کیا ۔  سفیان نے کہا کہ زہری نے بیان کیا ، انہیں عبداللہ نے خبر دی اور انہیں ابن عباس رضی اللہ عنہما نے پھر یہی حدیث بیان کی ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا مجھ سے زہری نے بیان کیا ، ان سے عبداللہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، عَنْ عُبَيْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم فِي رَمَضَانَ، فَصَامَ حَتَّى بَلَغَ الْكَدِيدَ أَفْطَرَ‏.‏ قَالَ سُفْيَانُ قَالَ الزُّهْرِيُّ أَخْبَرَنِي عُبَيْدُ اللَّهِ عَنِ ابْنِ عَبَّاسٍ‏.‏ وَسَاقَ الْحَدِيثَ‏.‏",
                "headingArabic": "الْخُرُوجِ فِي رَمَضَانَ",
                "headingUrdu": "رمضان میں سفر کرنا",
                "headingEnglish": "Travelling in Ramadan",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2824,
                "hadithNumber": "2954",
                "englishNarrator": "Narrated Abu Hurairah (رضی اللہ عنہ):",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent us on military expedition telling us, \"If you find such and such persons (he named two men from Quraish), burn them fire.\" Then we came to bid him farewell, when we wanted to set out, he said: \"Previously I ordered you to burn so-and-so and so-and-so with fire, but as punishment with fire is done by none except Allah, if you capture them, kill them, (instead).\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ایک فوج میں بھیجا اور ہدایت فرمائی کہ اگر فلاں فلاں دو قریشی ( ہبابن اسود اور نافع بن عبد عمر ) جن کا آپ نے نام لیا تم کو مل جائیں تو انہیں آگ میں جلا دینا ۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ جب ہم آپ صلی اللہ علیہ وسلم کی خدمت میں آپ صلی اللہ علیہ وسلم سے رخصت ہونے کی اجازت کے لیے حاضر ہوئے ، اس وقت آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں نے تمہیں پہلے ہدایت کی تھی کہ فلاں فلاں قریشی اگر تمہیں مل جائیں تو انہیں آگ میں جلا دینا ۔ لیکن یہ حقیقت ہے کہ آگ کی سزا دینا اللہ تعالیٰ کے سوا کسی کے لیے سزاوار نہیں ہے ۔ اس لیے اگر وہ تمہیں مل جائیں تو انہیں قتل کر دینا ۔ ( آگ میں نہ جلانا ) ۔",
                "urduNarrator": "اور عبداللہ بن وہب نے کہا کہ مجھ کو عمرو بن حارث نے خبر دی ، انہیں بکیر نے ، انہیں سلیمان بن یسار نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو، عَنْ بُكَيْرٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ قَالَ بَعَثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَعْثٍ، وَقَالَ لَنَا ‏\"‏ إِنْ لَقِيتُمْ فُلاَنًا وَفُلاَنًا ‏\"‏‏.‏ ـ لِرَجُلَيْنِ مِنْ قُرَيْشٍ سَمَّاهُمَا ـ فَحَرِّقُوهُمَا بِالنَّارِ‏.‏ قَالَ ثُمَّ أَتَيْنَاهُ نُوَدِّعُهُ حِينَ أَرَدْنَا الْخُرُوجَ فَقَالَ ‏\"‏ إِنِّي كُنْتُ أَمَرْتُكُمْ أَنْ تُحَرِّقُوا فُلاَنًا وَفُلاَنًا بِالنَّارِ، وَإِنَّ النَّارَ لاَ يُعَذِّبُ بِهَا إِلاَّ اللَّهُ، فَإِنْ أَخَذْتُمُوهُمَا فَاقْتُلُوهُمَا ‏\"‏‏.‏",
                "headingArabic": "التَّوْدِيعِ",
                "headingUrdu": "الوداعی بولی۔",
                "headingEnglish": "Bidding farewell",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2825,
                "hadithNumber": "2955",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The 'Prophet said, \"It is obligatory for one to listen to and obey (the ruler's orders) unless these orders involve one disobedience (to Allah); but if an act of disobedience (to Allah) is imposed, he should not listen to or obey it.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( خلیفہ وقت کے احکام ) سننا اور انہیں بجا لانا ( ہر مسلمان کے لیے ) واجب ہے ، جب تک کہ گناہ کا حکم نہ دیا جائے ۔ اگر گناہ کا حکم دیا جائے تو پھر نہ اسے سننا چاہئے اور نہ اس پر عمل کرنا چاہئے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے عبیداللہ عمری نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے ۔ ( دوسری سند ) اور مجھ سے محمد بن صباح نے بیان کیا ، کہا ہم سے اسماعیل بن زکریا نے بیان کیا ، ان سے عبیداللہ نے ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَحَدَّثَنِي مُحَمَّدُ بْنُ صَبَّاحٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ السَّمْعُ وَالطَّاعَةُ حَقٌّ، مَا لَمْ يُؤْمَرْ بِالْمَعْصِيَةِ، فَإِذَا أُمِرَ بِمَعْصِيَةٍ فَلاَ سَمْعَ وَلاَ طَاعَةَ ‏\"‏‏.‏",
                "headingArabic": "السَّمْعِ وَالطَّاعَةِ لِلإِمَامِ",
                "headingUrdu": "امام کا سننا اور اطاعت کرنا",
                "headingEnglish": "Listening to and obeying the Imam",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2826,
                "hadithNumber": "2956, 2957",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) saying, \"We are the last but will be the foremost to enter Paradise).\" The Prophet added, \"He who obeys me, obeys Allah, and he who disobeys me, disobeys Allah. He who obeys the chief, obeys me, and he who disobeys the chief, disobeys me. The Imam is like a shelter for whose safety the Muslims should fight and where they should seek protection. If the Imam orders people with righteousness and rules justly, then he will be rewarded for that, and if he does the opposite, he will be responsible for that.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم فرماتے تھے کہ ہم لوگ دنیا میں سب سے پیچھے آئے لیکن ( آخرت میں جنت میں سب سے آگے ہوں گے ) ۔ اور اسی سند کے ساتھ روایت ہے کہ جس نے میری اطاعت کی اس نے اللہ کی اطاعت کی اور جس نے میری نافرمانی کی اس نے اللہ کی نافرمانی کی اور جس نے امیر کی اطاعت کی اس نے میری اطاعت کی اور جس نے امیر کی نافرمانی کی ، اس نے میری نافرمانی کی ۔ امام کی مثال ڈھال جیسی ہے کہ اس کے پیچھے رہ کر اس کی آڑ میں ( یعنی اس کے ساتھ ہو کر ) جنگ کی جاتی ہے ۔ اور اسی کے ذریعہ ( دشمن کے حملہ سے ) بچا جاتا ہے ، پس اگر امام تمہیں اللہ سے ڈرتے رہنے کا حکم دے اور انصاف کرے اس کا ثواب اسے ملے گا ، لیکن اگر بیانصافی کرے گا تو اس کا وبال اس پر ہو گا ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے بیان کیا اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، أَنَّ الأَعْرَجَ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ نَحْنُ الآخِرُونَ السَّابِقُونَ ‏\"‏‏. وَبِهَذَا الإِسْنَادِ ‏\"‏ مَنْ أَطَاعَنِي فَقَدْ أَطَاعَ اللَّهَ، وَمَنْ عَصَانِي فَقَدْ عَصَى اللَّهَ، وَمَنْ يُطِعِ الأَمِيرَ فَقَدْ أَطَاعَنِي، وَمَنْ يَعْصِ الأَمِيرَ فَقَدْ عَصَانِي، وَإِنَّمَا الإِمَامُ جُنَّةٌ يُقَاتَلُ مِنْ وَرَائِهِ وَيُتَّقَى بِهِ، فَإِنْ أَمَرَ بِتَقْوَى اللَّهِ وَعَدَلَ، فَإِنَّ لَهُ بِذَلِكَ أَجْرًا، وَإِنْ قَالَ بِغَيْرِهِ، فَإِنَّ عَلَيْهِ مِنْهُ ‏\"‏‏.‏",
                "headingArabic": "يُقَاتَلُ مِنْ وَرَاءِ الإِمَامِ وَيُتَّقَى بِهِ",
                "headingUrdu": "امام کا دفاع کیا جائے۔",
                "headingEnglish": "The Imam should be defended",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2827,
                "hadithNumber": "2958",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When we reached (Hudaibiya) in the next year (of the treaty of Hudaibiya), not even two men amongst us agreed unanimously as to which was the tree under which we had given the pledge of allegiance, and that was out of Allah's Mercy. (The sub narrator asked Naf'i, \"For what did the Prophet (ﷺ) take their pledge of allegiance, was it for death?\" Naf'i replied \"No, but he took their pledge of allegiance for patience.\")",
                "hadithUrdu": "( صلح حدیبیہ کے بعد ) جب ہم دوسرے سال پھر آئے ، تو ہم میں سے ( جنہوں نے صلح حدیبیہ کے موقع پر آنحضرت صلی اللہ علیہ وسلم سے بیعت کی تھی ) دو شخص بھی اس درخت کی نشان دہی پر متفق نہیں ہو سکے ۔ جس کے نیچے ہم نے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی تھی اور یہ صرف اللہ کی رحمت تھی ۔ جویریہ نے کہا ، میں نے نافع سے پوچھا ، آنحضرت صلی اللہ علیہ وسلم نے صحابہ سے کس بات پر بیعت کی تھی ، کیا موت پر لی تھی ؟ فرمایا کہ نہیں ، بلکہ صبر و استقامت پر بیعت لی تھی ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے جویریہ نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، قَالَ قَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ رَجَعْنَا مِنَ الْعَامِ الْمُقْبِلِ فَمَا اجْتَمَعَ مِنَّا اثْنَانِ عَلَى الشَّجَرَةِ الَّتِي بَايَعْنَا تَحْتَهَا، كَانَتْ رَحْمَةً مِنَ اللَّهِ‏.‏ فَسَأَلْتُ نَافِعًا عَلَى أَىِّ شَىْءٍ بَايَعَهُمْ عَلَى الْمَوْتِ قَالَ لاَ، بَايَعَهُمْ عَلَى الصَّبْرِ‏.‏",
                "headingArabic": "الْبَيْعَةِ فِي الْحَرْبِ أَنْ لاَ يَفِرُّوا",
                "headingUrdu": "جنگ کے دوران نہ بھاگنے کے لیے بیع دینا",
                "headingEnglish": "To give a Bai'a for not to flee during a battle",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 2801,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=112",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=110",
                "label": "110",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=111",
                "label": "111",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=112",
                "label": "112",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=113",
                "label": "113",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=114",
                "label": "114",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=115",
                "label": "115",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=116",
                "label": "116",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=114",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=114",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=112",
        "to": 2825,
        "total": 40465
    }
}