{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 12,
        "data": [
            {
                "id": 276,
                "hadithNumber": "277",
                "englishNarrator": "Narrated Aisha:",
                "hadithEnglish": "Whenever any one of us was Junub, she poured water over her head thrice with both her hands and then rubbed the right side of her head with one hand and rubbed the left side of the head with the other hand.",
                "hadithUrdu": "ہم ازواج ( مطہرات ) میں سے کسی کو اگر جنابت لاحق ہوتی تو وہ ہاتھوں میں پانی لے کر سر پر تین مرتبہ ڈالتیں ۔ پھر ہاتھ میں پانی لے کر سر کے داہنے حصے کا غسل کرتیں اور دوسرے ہاتھ سے بائیں حصے کا غسل کرتیں ۔",
                "urduNarrator": "ہم سے خلاد بن یحییٰ نے بیان کیا ، انھوں نے کہا کہ ہم سے ابراہیم بن نافع نے بیان کیا ، انھوں نے حسن بن مسلم سے روایت کی ، وہ صفیہ بنت شیبہ سے ، وہ حضرت عائشہ رضی اللہ عنہا سے ، آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ، عَنِ الْحَسَنِ بْنِ مُسْلِمٍ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ عَائِشَةَ، قَالَتْ كُنَّا إِذَا أَصَابَتْ إِحْدَانَا جَنَابَةٌ، أَخَذَتْ بِيَدَيْهَا ثَلاَثًا فَوْقَ رَأْسِهَا، ثُمَّ تَأْخُذُ بِيَدِهَا عَلَى شِقِّهَا الأَيْمَنِ، وَبِيَدِهَا الأُخْرَى عَلَى شِقِّهَا الأَيْسَرِ‏.‏",
                "headingArabic": "مَنْ بَدَأَ بِشِقِّ رَأْسِهِ الأَيْمَنِ فِي الْغُسْلِ",
                "headingUrdu": "غسل کرتے وقت سر کے دائیں طرف سے شروع کرنا",
                "headingEnglish": "Starting from the right side of one's head while taking a bath",
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 277,
                "hadithNumber": "278",
                "englishNarrator": "Narrated Abu Huraira:",
                "hadithEnglish": "The Prophet (ﷺ) said, 'The (people of) Bani Israel used to take bath naked (all together) looking at each other. The Prophet (ﷺ) Moses used to take a bath alone. They said, 'By Allah! Nothing prevents Moses from taking a bath with us except that he has a scrotal hernia.' So once Moses went out to take a bath and put his clothes over a stone and then that stone ran away with his clothes. Moses followed that stone saying, \"My clothes, O stone! My clothes, O stone! till the people of Bani Israel saw him and said, 'By Allah, Moses has got no defect in his body. Moses took his clothes and began to beat the stone.\" Abu Huraira added, \"By Allah! There are still six or seven marks present on the stone from that excessive beating.\"",
                "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا بنی اسرائیل ننگے ہو کر اس طرح نہاتے تھے کہ ایک شخص دوسرے کو دیکھتا لیکن حضرت موسیٰ علیہ السلام تنہا پردہ سے غسل فرماتے ۔ اس پر انھوں نے کہا کہ بخدا موسیٰ کو ہمارے ساتھ غسل کرنے میں صرف یہ چیز مانع ہے کہ آپ کے خصیے بڑھے ہوئے ہیں ۔ ایک مرتبہ موسیٰ علیہ السلام غسل کرنے لگے اور آپ نے کپڑوں کو ایک پتھر پر رکھ دیا ۔ اتنے میں پتھر کپڑوں کو لے کر بھاگا اور موسیٰ علیہ السلام بھی اس کے پیچھے بڑی تیزی سے دوڑے ۔ آپ کہتے جاتے تھے ۔ اے پتھر ! میرا کپڑا دے ۔ اے پتھر ! میرا کپڑا دے ۔ اس عرصہ میں بنی اسرائیل نے موسیٰ علیہ السلام کو ننگا دیکھ لیا اور کہنے لگے کہ بخدا موسیٰ کو کوئی بیماری نہیں اور موسیٰ علیہ السلام نے کپڑا لیا اور پتھر کو مارنے لگے ۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ بخدا اس پتھر پر چھ یا سات مار کے نشان باقی ہیں ۔",
                "urduNarrator": "ہم سے اسحاق بن نصر نے بیان کیا ، انھوں نے کہا ہم سے عبدالرزاق نے بیان کیا ، انھوں نے معمر سے ، انھوں نے ہمام بن منبہ سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كَانَتْ بَنُو إِسْرَائِيلَ يَغْتَسِلُونَ عُرَاةً، يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ، وَكَانَ مُوسَى يَغْتَسِلُ وَحْدَهُ، فَقَالُوا وَاللَّهِ مَا يَمْنَعُ مُوسَى أَنْ يَغْتَسِلَ مَعَنَا إِلاَّ أَنَّهُ آدَرُ، فَذَهَبَ مَرَّةً يَغْتَسِلُ، فَوَضَعَ ثَوْبَهُ عَلَى حَجَرٍ، فَفَرَّ الْحَجَرُ بِثَوْبِهِ، فَخَرَجَ مُوسَى فِي إِثْرِهِ يَقُولُ ثَوْبِي يَا حَجَرُ‏.‏ حَتَّى نَظَرَتْ بَنُو إِسْرَائِيلَ إِلَى مُوسَى، فَقَالُوا وَاللَّهِ مَا بِمُوسَى مِنْ بَأْسٍ‏.‏ وَأَخَذَ ثَوْبَهُ، فَطَفِقَ بِالْحَجَرِ ضَرْبًا ‏\"‏‏.‏ فَقَالَ أَبُو هُرَيْرَةَ وَاللَّهِ إِنَّهُ لَنَدَبٌ بِالْحَجَرِ سِتَّةٌ أَوْ سَبْعَةٌ ضَرْبًا بِالْحَجَرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": "جس نے اکیلے (تنہائی میں) بالکل ننگا نہایا",
                "headingEnglish": "Whosoever took a bath alone (in seclusion) completely naked",
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 278,
                "hadithNumber": "279",
                "englishNarrator": "Narrated Abu Huraira:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"When the Prophet (ﷺ) Job (Aiyub) was taking a bath naked, golden locusts began to fall on him. Job started collecting them in his clothes. His Lord addressed him, 'O Job! Haven't I given you enough so that you are not in need of them.' Job replied, 'Yes!' By Your Honor (power)! But I cannot dispense with Your Blessings.' \"",
                "hadithUrdu": "( ایک بار ) ایوب علیہ السلام ننگے غسل فرما رہے تھے کہ سونے کی ٹڈیاں آپ پر گرنے لگیں ۔ حضرت ایوب علیہ السلام انہیں اپنے کپڑے میں سمیٹنے لگے ۔ اتنے میں ان کے رب نے انہیں پکارا ۔ کہ اے ایوب ! کیا میں نے تمہیں اس چیز سے بےنیاز نہیں کر دیا ، جسے تم دیکھ رہے ہو ۔ ایوب علیہ السلام نے جواب دیا ہاں تیری بزرگی کی قسم ۔ لیکن تیری برکت سے میرے لیے بے نیازی کیونکر ممکن ہے ۔ اور اس حدیث کو ابراہیم نے موسیٰ بن عقبہ سے ، وہ صفوان سے ، وہ عطاء بن یسار سے ، وہ ابوہریرہ سے ، وہ نبی کریم صلی اللہ علیہ وسلم سے ، اس طرح نقل کرتے ہیں ’’ جب کہ حضرت ایوب علیہ السلام ننگے ہو کر غسل کر رہے تھے ‘‘ ( آخر تک ) ۔",
                "urduNarrator": "اور اسی سند کے ساتھ ابوہریرہ سے روایت ہے کہ وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ آپ نے فرمایا کہ",
                "hadithArabic": "وَعَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَيُّوبُ يَغْتَسِلُ عُرْيَانًا فَخَرَّ عَلَيْهِ جَرَادٌ مِنْ ذَهَبٍ، فَجَعَلَ أَيُّوبُ يَحْتَثِي فِي ثَوْبِهِ، فَنَادَاهُ رَبُّهُ يَا أَيُّوبُ، أَلَمْ أَكُنْ أَغْنَيْتُكَ عَمَّا تَرَى قَالَ بَلَى وَعِزَّتِكَ وَلَكِنْ لاَ غِنَى بِي عَنْ بَرَكَتِكَ ‏\"‏‏.‏ وَرَوَاهُ إِبْرَاهِيمُ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ صَفْوَانَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَيُّوبُ يَغْتَسِلُ عُرْيَانًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 279,
                "hadithNumber": "280",
                "englishNarrator": "Narrated Um Hani bint Abi Talib:",
                "hadithEnglish": "I went to Allah's Messenger (ﷺ) in the year of the conquest of Mecca and found him taking a bath while Fatima was screening him. The Prophet (ﷺ) asked, \"Who is it?\" I replied, \"I am Um-Hani.\"",
                "hadithUrdu": "میں فتح مکہ کے دن رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی تو میں نے دیکھا کہ آپ غسل فرما رہے ہیں اور فاطمہ رضی اللہ عنہا نے پردہ کر رکھا ہے ۔ نبی اکرم صلی اللہ علیہ وسلم نے پوچھا یہ کون ہیں ۔ میں نے عرض کی کہ میں ام ہانی ہوں ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے روایت کی ۔ انھوں نے امام مالک سے ، انھوں نے عمر بن عبیداللہ کے مولیٰ ابونضر سے کہ ام ہانی بنت ابی طالب کے مولیٰ ابومرہ نے انہیں بتایا کہ انھوں نے ام ہانی بنت ابی طالب کو یہ کہتے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ أَنَّ أَبَا مُرَّةَ، مَوْلَى أُمِّ هَانِئٍ بِنْتِ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّهُ، سَمِعَ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ، تَقُولُ ذَهَبْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ، فَوَجَدْتُهُ يَغْتَسِلُ وَفَاطِمَةُ تَسْتُرُهُ فَقَالَ ‏ \"‏ مَنْ هَذِهِ ‏\"‏‏.‏ فَقُلْتُ أَنَا أُمُّ هَانِئٍ‏.‏",
                "headingArabic": "التَّسَتُّرِ فِي الْغُسْلِ عِنْدَ النَّاسِ",
                "headingUrdu": "نہاتے وقت لوگوں سے پردہ کرنا",
                "headingEnglish": "To screen oneself from the people while taking a bath",
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 280,
                "hadithNumber": "281",
                "englishNarrator": "Narrated Maimuna:",
                "hadithEnglish": "I screened the Prophet (ﷺ) while he was taking a bath of Janaba. He washed his hands, poured water from his right hand over his left and washed his private parts. Then he rubbed his hand over a wall or the earth, and performed ablution similar to that for the prayer but did not wash his feet. Then he poured water over his body, shifted from that place, and washed his feet.",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم غسل جنابت فرما رہے تھے میں نے آپ صلی اللہ علیہ وسلم کا پردہ کیا تھا ۔ تو آپ صلی اللہ علیہ وسلم نے پہلے اپنے ہاتھ دھوئے ، پھر داہنے ہاتھ سے بائیں پر پانی بہایا اور شرمگاہ دھوئی اور جو کچھ اس میں لگ گیا تھا اسے دھویا پھر ہاتھ کو زمین یا دیوار پر رگڑ کر ( دھویا ) پھر نماز کی طرح وضو کیا ۔ پاؤں کے علاوہ ۔ پھر پانی اپنے سارے بدن پر بہایا اور اس جگہ سے ہٹ کر دونوں قدموں کو دھویا ۔ اس حدیث میں ابوعوانہ اور محمد بن فضیل نے بھی پردے کا ذکر کیا ہے ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، انھوں نے کہا ہم سے عبداللہ بن مبارک نے بیان کیا ، انھوں نے کہا ہم سے سفیان نے بیان کیا ، انھوں نے اعمش سے ، وہ سالم بن ابی الجعد سے ، وہ کریب سے ، وہ ابن عباس رضی اللہ عنہما سے ، وہ میمونہ رضی اللہ عنہ سے ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، قَالَتْ سَتَرْتُ النَّبِيَّ صلى الله عليه وسلم وَهُوَ يَغْتَسِلُ مِنَ الْجَنَابَةِ، فَغَسَلَ يَدَيْهِ ثُمَّ صَبَّ بِيَمِينِهِ عَلَى شِمَالِهِ، فَغَسَلَ فَرْجَهُ، وَمَا أَصَابَهُ، ثُمَّ مَسَحَ بِيَدِهِ عَلَى الْحَائِطِ أَوِ الأَرْضِ، ثُمَّ تَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ، غَيْرَ رِجْلَيْهِ، ثُمَّ أَفَاضَ عَلَى جَسَدِهِ الْمَاءَ، ثُمَّ تَنَحَّى فَغَسَلَ قَدَمَيْهِ‏.‏ تَابَعَهُ أَبُو عَوَانَةَ وَابْنُ فُضَيْلٍ فِي السَّتْرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 281,
                "hadithNumber": "282",
                "englishNarrator": "Narrated Um-Salama(the mother of the believers):",
                "hadithEnglish": "Um Sulaim, the wife of Abu Talha, came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Verily Allah is not shy of (telling you) the truth. Is it necessary for a woman to take a bath after she has a wet dream (nocturnal sexual discharge)?\" Allah's Messenger (ﷺ) replied, \"Yes, if she notices a discharge.\"",
                "hadithUrdu": "ام سلیم ابوطلحہ رضی اللہ عنہ کی عورت رسول کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور کہا کہ اللہ تعالیٰ حق سے حیاء نہیں کرتا ۔ کیا عورت پر بھی جب کہ اسے احتلام ہو غسل واجب ہو جاتا ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، ہاں اگر ( اپنی منی کا ) پانی دیکھے ( تو اسے بھی غسل کرنا ہو گا ) ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا کہ ہم سے امام مالک نے بیان کیا ، انھوں نے ہشام بن عروہ کے واسطے سے ، انھوں نے اپنے والد عروہ بن زبیر سے ، وہ زینب بنت ابی سلمہ سے ، انھوں نے ام المؤمنین ام سلمہ رضی اللہ عنہ سے ، آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ جَاءَتْ أُمُّ سُلَيْمٍ امْرَأَةُ أَبِي طَلْحَةَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ، إِنَّ اللَّهَ لاَ يَسْتَحْيِي مِنَ الْحَقِّ، هَلْ عَلَى الْمَرْأَةِ مِنْ غُسْلٍ إِذَا هِيَ احْتَلَمَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نَعَمْ إِذَا رَأَتِ الْمَاءَ ‏\"‏‏.‏",
                "headingArabic": "إِذَا احْتَلَمَتِ الْمَرْأَةُ",
                "headingUrdu": "اگر کسی عورت کو گیلے خواب آتے ہیں (رات کا جنسی خارج ہونا)",
                "headingEnglish": "If a woman has a wet dream (nocturnal sexual discharge)",
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 282,
                "hadithNumber": "283",
                "englishNarrator": "Narrated Abu Huraira:",
                "hadithEnglish": "The Prophet (ﷺ) came across me in one of the streets of Medina and at that time I was Junub. So I slipped away from him and went to take a bath. On my return the Prophet (ﷺ) said, \"O Abu Huraira! Where have you been?\" I replied, \"I was Junub, so I disliked to sit in your company.\" The Prophet (ﷺ) said, \"Subhan Allah! A believer never becomes impure.\"",
                "hadithUrdu": "مدینہ کے کسی راستے پر نبی کریم صلی اللہ علیہ وسلم سے ان کی ملاقات ہوئی ۔ اس وقت ابوہریرہ رضی اللہ عنہ جنابت کی حالت میں تھے ۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ میں پیچھے رہ کر لوٹ گیا اور غسل کر کے واپس آیا ۔ تو رسول کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ اے ابوہریرہ ! کہاں چلے گئے تھے ۔ انھوں نے جواب دیا کہ میں جنابت کی حالت میں تھا ۔ اس لیے میں نے آپ صلی اللہ علیہ وسلم کے ساتھ بغیر غسل کے بیٹھنا برا جانا ۔ آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا ۔ سبحان اللہ ! مومن ہرگز نجس نہیں ہو سکتا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے ، کہا ہم سے حمید طویل نے ، کہا ہم سے بکر بن عبداللہ نے ابورافع کے واسطہ سے ، انھوں نے ابوہریرہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا حُمَيْدٌ، قَالَ حَدَّثَنَا بَكْرٌ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم لَقِيَهُ فِي بَعْضِ طَرِيقِ الْمَدِينَةِ وَهْوَ جُنُبٌ، فَانْخَنَسْتُ مِنْهُ، فَذَهَبَ فَاغْتَسَلَ، ثُمَّ جَاءَ فَقَالَ ‏\"‏ أَيْنَ كُنْتَ يَا أَبَا هُرَيْرَةَ ‏\"‏‏.‏ قَالَ كُنْتُ جُنُبًا، فَكَرِهْتُ أَنْ أُجَالِسَكَ وَأَنَا عَلَى غَيْرِ طَهَارَةٍ‏.‏ فَقَالَ ‏\"‏ سُبْحَانَ اللَّهِ، إِنَّ الْمُؤْمِنَ لاَ يَنْجُسُ ‏\"‏‏.‏",
                "headingArabic": "جنب کے پسینہ کے بارے میں کیا کہا جاتا ہے۔ اور مسلمان کبھی ناپاک نہیں ہوتا",
                "headingUrdu": "جنب کے پسینہ کے بارے میں کیا کہا جاتا ہے۔ اور مسلمان کبھی ناپاک نہیں ہوتا",
                "headingEnglish": "(What is said regarding) the sweat of a Junub. And a Muslim never becomes impure",
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 283,
                "hadithNumber": "284",
                "englishNarrator": "Narrated Anas bin Malik:",
                "hadithEnglish": "The Prophet (ﷺ) used to visit all his wives in one night and he had nine wives at that time.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم اپنی تمام ازواج کے پاس ایک ہی رات میں تشریف لے گئے ۔ اس وقت آپ صلی اللہ علیہ وسلم کے ازواج میں نو بیویاں تھیں ۔",
                "urduNarrator": "ہم سے عبدالاعلیٰ بن حماد نے بیان کیا ، انھوں نے کہا ہم سے یزید بن زریع نے بیان کیا ، انھوں نے کہا ہم سے سعید بن ابی عروبہ نے بیان کیا ، انھوں نے قتادہ سے ، کہ انس بن مالک رضی اللہ عنہ نے ان سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُمْ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَطُوفُ عَلَى نِسَائِهِ فِي اللَّيْلَةِ الْوَاحِدَةِ، وَلَهُ يَوْمَئِذٍ تِسْعُ نِسْوَةٍ‏.‏",
                "headingArabic": "الْجُنُبُ يَخْرُجُ وَيَمْشِي فِي السُّوقِ وَغَيْرِهِ",
                "headingUrdu": "ایک جنب(شخص) باہر جا سکتا ہے اور بازار میں یا کہیں بھی چل سکتا ہے۔",
                "headingEnglish": "A Junub (person) can go out and walk in the market or anywhere else",
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 284,
                "hadithNumber": "285",
                "englishNarrator": "Narrated Abu Huraira:",
                "hadithEnglish": "Allah's Messenger (ﷺ) came across me and I was Junub. He took my hand and I went along with him till he sat down I slipped away, went home and took a bath. When I came back, he was still sitting there. He then said to me, \"O Abu Huraira! Where have you been?' I told him about it. The Prophet (ﷺ) said, \"Subhan Allah! O Abu Huraira! A believer never becomes impure.\"",
                "hadithUrdu": "میری ملاقات رسول اللہ صلی اللہ علیہ وسلم سے ہوئی ۔ اس وقت میں جنبی تھا ۔ آپ صلی اللہ علیہ وسلم نے میرا ہاتھ پکڑ لیا اور میں آپ صلی اللہ علیہ وسلم کے ساتھ چلنے لگا ۔ آخر آپ صلی اللہ علیہ وسلم ایک جگہ بیٹھ گئے اور میں آہستہ سے اپنے گھر آیا اور غسل کر کے حاضر خدمت ہوا ۔ آپ صلی اللہ علیہ وسلم ابھی بیٹھے ہوئے تھے ، آپ صلی اللہ علیہ وسلم نے دریافت فرمایا اے ابوہریرہ ! کہاں چلے گئے تھے ، میں نے واقعہ بیان کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا سبحان اللہ ! مومن تو نجس نہیں ہوتا ۔",
                "urduNarrator": "ہم سے عیاش نے بیان کیا ، انھوں نے کہا ہم سے عبدالاعلیٰ نے بیان کیا ، انھوں نے کہا ہم سے حمید نے بکر کے واسطہ سے بیان کیا ، انھوں نے ابورافع سے ، وہ ابوہریرہ رضی اللہ عنہ سے ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَيَّاشٌ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا حُمَيْدٌ، عَنْ بَكْرٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لَقِيَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا جُنُبٌ، فَأَخَذَ بِيَدِي، فَمَشَيْتُ مَعَهُ حَتَّى قَعَدَ فَانْسَلَلْتُ، فَأَتَيْتُ الرَّحْلَ، فَاغْتَسَلْتُ ثُمَّ جِئْتُ وَهْوَ قَاعِدٌ فَقَالَ ‏\"‏ أَيْنَ كُنْتَ يَا أَبَا هِرٍّ ‏\"‏ فَقُلْتُ لَهُ‏.‏ فَقَالَ ‏\"‏ سُبْحَانَ اللَّهِ يَا أَبَا هِرٍّ إِنَّ الْمُؤْمِنَ لاَ يَنْجُسُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 285,
                "hadithNumber": "286",
                "englishNarrator": "Narrated Abu Salama:",
                "hadithEnglish": "I asked `Aisha \"Did the Prophet (ﷺ) use to sleep while he was Junub?\" She replied, \"Yes, but he used to perform ablution (before going to bed).",
                "hadithUrdu": "کہا میں نے عائشہ رضی اللہ عنہا سے پوچھا کہ کیا نبی کریم صلی اللہ علیہ وسلم جنابت کی حالت میں گھر میں سوتے تھے ؟ کہا ہاں لیکن وضو کر لیتے تھے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے ہشام اور شیبان نے ، وہ یحیٰی سے ، وہ ابوسلمہ سے",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا هِشَامٌ، وَشَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ سَأَلْتُ عَائِشَةَ أَكَانَ النَّبِيُّ صلى الله عليه وسلم يَرْقُدُ وَهْوَ جُنُبٌ قَالَتْ نَعَمْ وَيَتَوَضَّأُ‏.‏",
                "headingArabic": "كَيْنُونَةِ الْجُنُبِ فِي الْبَيْتِ إِذَا تَوَضَّأَ قَبْلَ أَنْ يَغْتَسِلَ",
                "headingUrdu": "جنب گھر میں بغیر غسل کے بلکہ وضو کے ساتھ رہ سکتا ہے۔",
                "headingEnglish": "A Junub can stay at home without taking a bath but with ablution",
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 286,
                "hadithNumber": "287",
                "englishNarrator": "Narrated `Umar bin Al-Khattab:",
                "hadithEnglish": "I asked Allah's Messenger (ﷺ) \"Can any one of us sleep while he is Junub?\" He replied, \"Yes, if he performs ablution, he can sleep while he is Junub.\"",
                "hadithUrdu": "عمر بن خطاب رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ کیا ہم میں سے کوئی جنابت کی حالت میں سو سکتا ہے ؟ فرمایا \"ہاں ، وضو کر کے جنابت کی حالت میں بھی سو سکتے ہو ۔\"",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، انہوں نے نافع سے ، وہ ابن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَيَرْقُدُ أَحَدُنَا وَهْوَ جُنُبٌ قَالَ ‏ \"‏ نَعَمْ إِذَا تَوَضَّأَ أَحَدُكُمْ فَلْيَرْقُدْ وَهُوَ جُنُبٌ ‏\"‏‏.‏",
                "headingArabic": "نَوْمِ الْجُنُبِ",
                "headingUrdu": "جنب شخص کا سونا",
                "headingEnglish": "Sleeping of a Junub person",
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 287,
                "hadithNumber": "288",
                "englishNarrator": "Narrated `Aisha:",
                "hadithEnglish": "Whenever the Prophet (ﷺ) intended to sleep while he was Junub, he used to wash his private parts and perform ablution like that for the prayer.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب جنابت کی حالت میں ہوتے اور سونے کا ارادہ کرتے تو شرمگاہ کو دھو لیتے اور نماز کی طرح وضو کرتے ۔",
                "urduNarrator": "ہم سے یحیٰی بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، انہوں نے عبیداللہ بن ابی الجعد کے واسطے سے ، انہوں نے محمد بن عبدالرحمٰن سے ، انہوں نے عروہ سے ، وہ حضرت عائشہ رضی اللہ عنہا سے ، آپ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَنَامَ وَهْوَ جُنُبٌ، غَسَلَ فَرْجَهُ، وَتَوَضَّأَ لِلصَّلاَةِ‏.‏",
                "headingArabic": "الْجُنُبِ يَتَوَضَّأُ ثُمَّ يَنَامُ",
                "headingUrdu": "جنبی کو سونے سے پہلے وضو کرنا چاہیے۔",
                "headingEnglish": "A Junub person should perform ablution before sleeping",
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 288,
                "hadithNumber": "289",
                "englishNarrator": "Narrated `Abdullah:",
                "hadithEnglish": "`Umar asked the Prophet (ﷺ) \"Can anyone of us sleep while he is Junub?\" He replied, \"Yes, if he performs ablution.\"",
                "hadithUrdu": "کیا ہم جنابت کی حالت میں سو سکتے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا \"ہاں, لیکن وضو کر کے ۔\"",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے جویریہ نے نافع سے ، وہ عبداللہ بن عمر سے ، کہا عمر رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے دریافت کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ اسْتَفْتَى عُمَرُ النَّبِيَّ صلى الله عليه وسلم أَيَنَامُ أَحَدُنَا وَهْوَ جُنُبٌ قَالَ ‏ \"‏ نَعَمْ، إِذَا تَوَضَّأَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 289,
                "hadithNumber": "290",
                "englishNarrator": "Narrated `Abdullah bin `Umar:",
                "hadithEnglish": "`Umar bin Al-Khattab told Allah's Messenger (ﷺ), \"I became Junub at night.\" Allah's Messenger (ﷺ) replied, \"Perform ablution after washing your private parts and then sleep.\"",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کی کہ رات میں انہیں غسل کی ضرورت ہو جایا کرتی ہے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ وضو کر لیا کر اور شرمگاہ کو دھو کر سو جا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہمیں امام مالک نے خبر دی انہوں نے عبداللہ بن دینار سے ، انہوں نے عبداللہ بن عمر رضی اللہ عنہا سے ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ ذَكَرَ عُمَرُ بْنُ الْخَطَّابِ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ تُصِيبُهُ الْجَنَابَةُ مِنَ اللَّيْلِ، فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ تَوَضَّأْ وَاغْسِلْ ذَكَرَكَ ثُمَّ نَمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 290,
                "hadithNumber": "291",
                "englishNarrator": "Narrated Abu Huraira:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"When a man sits in between the four parts of a woman and did the sexual intercourse with her, bath becomes compulsory.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب مرد عورت کے چہار زانو میں بیٹھ گیا اور اس کے ساتھ جماع کے لئے کوشش کی تو غسل واجب ہو گیا ، اس حدیث کی متابعت عمرو نے شعبہ کے واسطہ سے کی ہے اور موسیٰ نے کہا کہ ہم سے ابان نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، کہا ہم سے حسن بصری نے بیان کیا ۔ اسی حدیث کی طرح ۔ ابوعبداللہ ( امام بخاری ) نے کہا یہ حدیث اس باب کی تمام احادیث میں عمدہ اور بہتر ہے اور ہم نے دوسری حدیث ( عثمان اور ابن ابی کعب کی ) صحابہ کے اختلاف کے پیش نظر بیان کی اور غسل میں اختیاط زیادہ ہے ۔",
                "urduNarrator": "( دوسری سند سے ) امام بخاری نے فرمایا کہ ہم سے ابونعیم نے بیان کیا ، وہ ہشام سے ، وہ قتادہ سے ، وہ امام حسن بصری سے ، وہ ابورافع سے ، وہ ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ حَدَّثَنَا هِشَامٌ، ح وَحَدَّثَنَا أَبُو نُعَيْمٍ، عَنْ هِشَامٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا جَلَسَ بَيْنَ شُعَبِهَا الأَرْبَعِ ثُمَّ جَهَدَهَا، فَقَدْ وَجَبَ الْغَسْلُ ‏\"‏‏.‏ تَابَعَهُ عَمْرُو بْنُ مَرْزُوقٍ عَنْ شُعْبَةَ مِثْلَهُ‏.‏ وَقَالَ مُوسَى حَدَّثَنَا أَبَانُ قَالَ حَدَّثَنَا قَتَادَةُ أَخْبَرَنَا الْحَسَنُ مِثْلَهُ‏.‏",
                "headingArabic": "إِذَا الْتَقَى الْخِتَانَانِ",
                "headingUrdu": "جب مرد اور عورت کے اعضاء آپس میں مل جائیں (غسل لازم ہو جائے)",
                "headingEnglish": "When male and female organs come in close contact (bath becomes compulsory)",
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 291,
                "hadithNumber": "292",
                "englishNarrator": "Narrated Zaid bin Khalid Al-Juhani:",
                "hadithEnglish": "I asked `Uthman bin `Affan about a man who engaged in the sexual intercourse with his wife but did not discharge. `Uthman replied, \"He should perform ablution like that for the prayer after washing his private parts.\" `Uthman added, \"I heard that from Allah's Messenger (ﷺ).\" I asked `Ali bin Abi Talib, Az- Zubair bin Al-`Awwam, Talha bin 'Ubaidullah and Ubai bin Ka`b and they gave the same reply.\r\n (Abu Aiyub said that he had heard that from Allah's Messenger (ﷺ) ) (This order was canceled later on so one \r\n  has to take a bath. See, Hadith No. 180).",
                "hadithUrdu": "انھوں نے حضرت عثمان بن عفان رضی اللہ عنہ سے پوچھا کہ مرد اپنی بیوی سے ہمبستر ہوا لیکن انزال نہیں ہوا تو وہ کیا کرے ؟ حضرت عثمان رضی اللہ عنہ نے فرمایا کہ نماز کی طرح وضو کر لے اور ذکر کو دھو لے اور حضرت عثمان رضی اللہ عنہ نے فرمایا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے یہ بات سنی ہے ۔ میں نے اس کے متعلق علی بن ابی طالب ، زبیر بن العوام ، طلحہ بن عبیداللہ ، ابی بن کعب رضی اللہ عنہم سے پوچھا تو انھوں نے بھی یہی فرمایا یحییٰ نے کہا اور ابوسلمہ نے مجھے بتایا کہ انہیں عروہ بن زبیر نے خبر دی ، انہیں ابوایوب رضی اللہ عنہ نے کہ یہ بات انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی تھی ۔",
                "urduNarrator": "ہم سے ابو معمر عبداللہ بن عمرو نے بیان کیا ، انہوں نے کہا ہم سے عبدالوارث بن سعید نے بیان کیا ، انہوں نے حسین بن ذکوان معلم کے واسطہ سے ، ان کو یحیٰی نے کہا مجھ کو ابوسلمہ بن عبدالرحمٰن بن عوف نے خبر دی ، ان کو عطابن یسار نے خبر دی ، انہیں زید بن خالد جہنی نے بتایا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْحُسَيْنِ، قَالَ يَحْيَى وَأَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أَخْبَرَهُ أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ أَخْبَرَهُ أَنَّهُ، سَأَلَ عُثْمَانَ بْنَ عَفَّانَ فَقَالَ أَرَأَيْتَ إِذَا جَامَعَ الرَّجُلُ امْرَأَتَهُ فَلَمْ يُمْنِ‏.‏ قَالَ عُثْمَانُ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلاَةِ، وَيَغْسِلُ ذَكَرَهُ‏.‏ قَالَ عُثْمَانُ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَسَأَلْتُ عَنْ ذَلِكَ عَلِيَّ بْنَ أَبِي طَالِبٍ وَالزُّبَيْرَ بْنَ الْعَوَّامِ وَطَلْحَةَ بْنَ عُبَيْدِ اللَّهِ وَأُبَىَّ بْنَ كَعْبٍ ـ رضى الله عنهم ـ فَأَمَرُوهُ بِذَلِكَ‏.‏ قَالَ يَحْيَى وَأَخْبَرَنِي أَبُو سَلَمَةَ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ أَخْبَرَهُ أَنَّ أَبَا أَيُّوبَ أَخْبَرَهُ أَنَّهُ سَمِعَ ذَلِكَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": "غَسْلِ مَا يُصِيبُ مِنْ فَرْجِ الْمَرْأَةِ",
                "headingUrdu": "عورت کی شرمگاہ سے جو چیز نکلتی ہے اسے دھونا (عورت کا اخراج) اگر اس سے گندگی ہو جائے",
                "headingEnglish": "Washing away what comes out from the private parts of a woman (woman's discharge) if one gets soiled with that",
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 292,
                "hadithNumber": "293",
                "englishNarrator": "Narrated Ubai bin Ka`b:",
                "hadithEnglish": "I asked Allah's Messenger (ﷺ) about a man who engages in sexual intercourse with his wife but does not discharge. He replied, \"He should wash the parts which comes in contact with the private parts of the woman, perform ablution and then pray.\" (Abu `Abdullah said, \"Taking a bath is safer and is the last order.\")",
                "hadithUrdu": "انھوں نے پوچھا یا رسول اللہ ! جب مرد عورت سے جماع کرے اور انزال نہ ہو تو کیا کرے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا عورت سے جو کچھ اسے لگ گیا اسے دھو لے پھر وضو کرے اور نماز پڑھے ۔ ابوعبداللہ ( امام بخاری رحمہ اللہ ) نے کہا غسل میں زیادہ احتیاط ہے اور یہ آخری احادیث ہم نے اس لئے بیان کر دیں ( تاکہ معلوم ہو جائے کہ ) اس مسئلہ میں اختلاف ہے اور پانی ( سے غسل کر لینا ہی ) زیادہ پاک کرنے والا ہے ۔ ( نوٹ : یہ اجازت ابتداء اسلام میں تھی بعد میں یہ حکم منسوخ ہو گیا ) ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحیٰی نے ہشام بن عروہ سے ، کہا مجھے خبر دی میرے والد نے ، کہا مجھے خبر دی ابوایوب نے ، کہا مجھے خبر دی ابی بن کعب نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامِ بْنِ عُرْوَةَ، قَالَ أَخْبَرَنِي أَبِي قَالَ، أَخْبَرَنِي أَبُو أَيُّوبَ، قَالَ أَخْبَرَنِي أُبَىُّ بْنُ كَعْبٍ، أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِذَا جَامَعَ الرَّجُلُ الْمَرْأَةَ فَلَمْ يُنْزِلْ قَالَ ‏ \"‏ يَغْسِلُ مَا مَسَّ الْمَرْأَةَ مِنْهُ، ثُمَّ يَتَوَضَّأُ وَيُصَلِّي ‏\"‏‏.‏ \r\n\r\nقَالَ أَبُو عَبْدِ اللَّهِ الْغَسْلُ أَحْوَطُ، وَذَاكَ الآخِرُ، وَإِنَّمَا بَيَّنَّا لاِخْتِلاَفِهِمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "5",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 5,
                    "chapterNumber": "5",
                    "chapterEnglish": "Bathing (Ghusl)",
                    "chapterUrdu": "غسل کے احکام و مسائل",
                    "chapterArabic": "كتاب الغسل",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 293,
                "hadithNumber": "294",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"We set out with the sole intention of performing Hajj and when we reached Sarif, (a place six miles from Mecca) I got my menses. Allah's Messenger (ﷺ) came to me while I was weeping. He said 'What is the matter with you? Have you got your menses?' I replied, 'Yes.' He said, 'This is a thing which Allah has ordained for the daughters of Adam. So do what all the pilgrims do with the exception of the Tawaf (Circumambulation) round the Ka`ba.\" `Aisha رضی اللہ عنہا added, \"Allah's Messenger (ﷺ) sacrificed cows on behalf of his wives.\"",
                "hadithUrdu": "ہم حج کے ارادہ سے نکلے ۔ جب ہم مقام سرف میں پہنچے تو میں حائضہ ہو گئی اور اس رنج میں رونے لگی کہ رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ، آپ صلی اللہ علیہ وسلم نے پوچھا تمہیں کیا ہو گیا ۔ کیا حائضہ ہو گئی ہو ۔ میں نے کہا ، ہاں ! آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ ایک ایسی چیز ہے جس کو اللہ تعالیٰ نے آدم کی بیٹیوں کے لیے لکھ دیا ہے ۔ اس لیے تم بھی حج کے افعال پورے کر لو ۔ البتہ بیت اللہ کا طواف نہ کرنا ۔ حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ رسول کریم صلی اللہ علیہ وسلم نے اپنی بیویوں کی طرف سے گائے کی قربانی کی ۔ ( سرف ایک مقام مکہ سے چھ سات میل کے فاصلہ پر ہے ) ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے ، کہا میں نے عبدالرحمٰن بن قاسم سے سنا ، کہا میں نے قاسم سے سنا ۔ وہ کہتے تھے میں نے حضرت عائشہ رضی اللہ عنہا سے سنا ۔ آپ فرماتی تھیں کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، قَالَ سَمِعْتُ الْقَاسِمَ، يَقُولُ سَمِعْتُ عَائِشَةَ، تَقُولُ خَرَجْنَا لاَ نَرَى إِلاَّ الْحَجَّ، فَلَمَّا كُنَّا بِسَرِفَ حِضْتُ، فَدَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا أَبْكِي قَالَ ‏\"‏ مَا لَكِ أَنُفِسْتِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ إِنَّ هَذَا أَمْرٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ، فَاقْضِي مَا يَقْضِي الْحَاجُّ، غَيْرَ أَنْ لاَ تَطُوفِي بِالْبَيْتِ ‏\"‏‏.‏ قَالَتْ وَضَحَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ نِسَائِهِ بِالْبَقَرِ‏.‏",
                "headingArabic": "الأَمْرِ بِالنُّفَسَاءِ إِذَا نُفِسْنَ",
                "headingUrdu": "حیض (ایک چیز) جو عورتوں کے لیے (اللہ کی طرف سے اور ہدایات) مقرر کی گئی ہے جب انہیں حیض آتا ہے۔",
                "headingEnglish": "Menses (a thing) ordained (by Allah and instructions) for women when they get their menses",
                "chapterId": "6",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 6,
                    "chapterNumber": "6",
                    "chapterEnglish": "Menstrual Periods",
                    "chapterUrdu": "حیض کے احکام و مسائل",
                    "chapterArabic": "كتاب الحيض",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 294,
                "hadithNumber": "295",
                "englishNarrator": "Narrated `Aisha:",
                "hadithEnglish": "While in menses, I used to comb the hair of Allah's Messenger (ﷺ) .",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے سر مبارک کو حائضہ ہونے کی حالت میں بھی کنگھا کیا کرتی تھی ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہمیں خبر دی مالک نے ہشام بن عروہ سے ، وہ اپنے والد سے ، وہ عائشہ رضی اللہ عنہا سے نقل کرتے ہیں کہ آپ نے فرمایا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا حَائِضٌ‏.‏",
                "headingArabic": "غَسْلِ الْحَائِضِ رَأْسَ زَوْجِهَا وَتَرْجِيلِهِ",
                "headingUrdu": "حائضہ بیوی کا شوہر کا سر دھونا اور بالوں میں کنگھی کرنا",
                "headingEnglish": "The washing of the husband's head and the combing of his hair by a menstruating wife",
                "chapterId": "6",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 6,
                    "chapterNumber": "6",
                    "chapterEnglish": "Menstrual Periods",
                    "chapterUrdu": "حیض کے احکام و مسائل",
                    "chapterArabic": "كتاب الحيض",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 295,
                "hadithNumber": "296",
                "englishNarrator": "Narrated `Urwa:",
                "hadithEnglish": "A person asked me, \"Can a woman in menses serve me? And can a Junub woman come close to me?\" I replied, \"All this is easy for me. All of them can serve me, and there is no harm for any other person to do the same. `Aisha told me that she used to comb the hair of Allah's Messenger (ﷺ) while she was in her menses, and he was in I`tikaf (in the mosque). He would bring his head near her in her room and she would comb his hair, while she used to be in her menses.\"",
                "hadithUrdu": "ان سے سوال کیا گیا ، کیا حائضہ بیوی میری خدمت کر سکتی ہے ، یا ناپاکی کی حالت میں عورت مجھ سے نزدیک ہو سکتی ہے ؟ عروہ نے فرمایا میرے نزدیک تو اس میں کوئی حرج نہیں ہے ۔ اس طرح کہ عورتیں میری بھی خدمت کرتی ہیں اور اس میں کسی کے لیے بھی کوئی حرج نہیں ۔ اس لیے کہ مجھے حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ وہ رسول کریم صلی اللہ علیہ وسلم کو حائضہ ہونے کی حالت میں کنگھا کیا کرتی تھیں اور رسول اللہ صلی اللہ علیہ وسلم اس وقت مسجد میں معتکف ہوتے ۔ آپ اپنا سر مبارک قریب کر دیتے اور حضرت عائشہ رضی اللہ عنہا اپنے حجرہ ہی سے کنگھا کر دیتیں ، حالانکہ وہ حائضہ ہوتیں ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، انھوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا ، انھوں نے کہا ابن جریج نے انہیں خبر دی ، انھوں نے کہا مجھے ہشام بن عروہ نے عروہ کے واسطے سے بتایا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي هِشَامٌ، عَنْ عُرْوَةَ، أَنَّهُ سُئِلَ أَتَخْدُمُنِي الْحَائِضُ أَوْ تَدْنُو مِنِّي الْمَرْأَةُ وَهْىَ جُنُبٌ فَقَالَ عُرْوَةُ كُلُّ ذَلِكَ عَلَىَّ هَيِّنٌ، وَكُلُّ ذَلِكَ تَخْدُمُنِي، وَلَيْسَ عَلَى أَحَدٍ فِي ذَلِكَ بَأْسٌ، أَخْبَرَتْنِي عَائِشَةُ أَنَّهَا كَانَتْ تُرَجِّلُ ـ تَعْنِي ـ رَأْسَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهِيَ حَائِضٌ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم حِينَئِذٍ مُجَاوِرٌ فِي الْمَسْجِدِ، يُدْنِي لَهَا رَأْسَهُ وَهْىَ فِي حُجْرَتِهَا، فَتُرَجِّلُهُ وَهْىَ حَائِضٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 6,
                    "chapterNumber": "6",
                    "chapterEnglish": "Menstrual Periods",
                    "chapterUrdu": "حیض کے احکام و مسائل",
                    "chapterArabic": "كتاب الحيض",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 296,
                "hadithNumber": "297",
                "englishNarrator": "Narrated `Aisha:",
                "hadithEnglish": "The Prophet (ﷺ) used to lean on my lap and recite Qur'an while I was in menses.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم میری گود میں سر رکھ کر قرآن مجید پڑھتے ، حالانکہ میں اس وقت حیض والی ہوتی تھی ۔",
                "urduNarrator": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، انھوں نے زہیر سے سنا ، انھوں نے منصور بن صفیہ سے کہ ان کی ماں نے ان سے بیان کیا کہ عائشہ رضی اللہ عنہا نے ان سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ الْفَضْلُ بْنُ دُكَيْنٍ، سَمِعَ زُهَيْرًا، عَنْ مَنْصُورٍ ابْنِ صَفِيَّةَ، أَنَّ أُمَّهُ، حَدَّثَتْهُ أَنَّ عَائِشَةَ حَدَّثَتْهَا أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَّكِئُ فِي حَجْرِي وَأَنَا حَائِضٌ، ثُمَّ يَقْرَأُ الْقُرْآنَ‏.‏",
                "headingArabic": "قِرَاءَةِ الرَّجُلِ فِي حَجْرِ امْرَأَتِهِ وَهْىَ حَائِضٌ",
                "headingUrdu": "پنی حائضہ بیوی کی گود میں لیٹ کر قرآن پڑھنا",
                "headingEnglish": "To recite the Qur'an while lying in the lap of one's own menstruating wife",
                "chapterId": "6",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 6,
                    "chapterNumber": "6",
                    "chapterEnglish": "Menstrual Periods",
                    "chapterUrdu": "حیض کے احکام و مسائل",
                    "chapterArabic": "كتاب الحيض",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 297,
                "hadithNumber": "298",
                "englishNarrator": "Narrated Um Salama:",
                "hadithEnglish": "While I was laying with the Prophet (ﷺ) under a single woolen sheet, I got the menses. I slipped away and put on the clothes for menses. He said, \"Have you got \"Nifas\" (menses)?\" I replied, \"Yes.\" He then called me and made me lie with him under the same sheet.",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک چادر میں لیٹی ہوئی تھی ، اتنے میں مجھے حیض آ گیا ۔ اس لیے میں آہستہ سے باہر نکل آئی اور اپنے حیض کے کپڑے پہن لیے ۔ نبی کریم صلی اللہ علیہ وسلم نے پوچھا کیا تمہیں نفاس آ گیا ہے ؟ میں نے عرض کیا ہاں ۔ پھر مجھے آپ صلی اللہ علیہ وسلم نے بلا لیا ، اور میں چادر میں آپ صلی اللہ علیہ وسلم کے ساتھ لیٹ گئی ۔",
                "urduNarrator": "ہم سے مکی بن ابراہیم نے بیان کیا ، انھوں نے کہا ہم سے ہشام نے یحییٰ بن کثیر کے واسطہ سے بیان کیا ، انھوں نے ابوسلمہ سے کہ زینب بنت ام سلمہ نے ان سے بیان کیا اور ان سے ام سلمہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، أَنَّ زَيْنَبَ ابْنَةَ أُمِّ سَلَمَةَ، حَدَّثَتْهُ أَنَّ أُمَّ سَلَمَةَ حَدَّثَتْهَا قَالَتْ، بَيْنَا أَنَا مَعَ النَّبِيِّ، صلى الله عليه وسلم مُضْطَجِعَةً فِي خَمِيصَةٍ إِذْ حِضْتُ، فَانْسَلَلْتُ فَأَخَذْتُ ثِيَابَ حِيضَتِي قَالَ ‏ \"‏ أَنُفِسْتِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَدَعَانِي فَاضْطَجَعْتُ مَعَهُ فِي الْخَمِيلَةِ‏.‏",
                "headingArabic": "مَنْ سَمَّى النِّفَاسَ حَيْضًا",
                "headingUrdu": "حیض کے لیے لفظ نفاس کا استعمال",
                "headingEnglish": "Using the word Nifas for menses",
                "chapterId": "6",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 6,
                    "chapterNumber": "6",
                    "chapterEnglish": "Menstrual Periods",
                    "chapterUrdu": "حیض کے احکام و مسائل",
                    "chapterArabic": "كتاب الحيض",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 298,
                "hadithNumber": "299, 300, 301",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) and I used to take a bath from a single pot while we were Junub. During the menses, he used to order me to put on an Izar (dress worn below the waist) and used to fondle me. While in I`tikaf, he used to bring his head near me and I would wash it while I used to be in my periods (menses).",
                "hadithUrdu": "انھوں نے فرمایا میں اور نبی کریم صلی اللہ علیہ وسلم ایک ہی برتن میں غسل کرتے تھے، حالانکہ دونوں جنبی ہوتے۔اور آپ صلی اللہ علیہ وسلم مجھے حکم فرماتے ، پس میں ازار باندھ لیتی ، پھر آپ صلی اللہ علیہ وسلم میرے ساتھ مباشرت کرتے ، اس وقت میں حائضہ ہوتی ۔ اور آپ صلی اللہ علیہ وسلم اپنا سرمبارک میری طرف کر دیتے ۔ اس وقت آپ صلی اللہ علیہ وسلم اعتکاف میں بیٹھے ہوئے ہوتے اور میں حیض کی حالت میں ہونے کے باوجود آپ صلی اللہ علیہ وسلم کا سر مبارک دھو دیتی ۔",
                "urduNarrator": "ہم سے قبیصہ بن عقبہ نے بیان کیا، انہوں نے کہا ہم سے سفیان ثوری نے منصور بن معمر کے واسطے سے، وہ ابراہیم نخعی سے، وہ اسود سے، وہ عائشہ رضی اللہ عنہا سے نقل کرتے ہیں کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ ، قَالَ : حَدَّثَنَا سُفْيَانُ ، عَنْ مَنْصُورٍ ، عَنْ إِبْرَاهِيمَ ، عَنِ الْأَسْوَدِ ، عَنْ عَائِشَةَ ، قَالَتْ : كُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ كِلَانَا جُنُبٌ.وَكَانَ يَأْمُرُنِي فَأَتَّزِرُ، فَيُبَاشِرُنِي وَأَنَا حَائِضٌ‏.‏ وَكَانَ يُخْرِجُ رَأْسَهُ إِلَىَّ وَهُوَ مُعْتَكِفٌ، فَأَغْسِلُهُ وَأَنَا حَائِضٌ‏.‏",
                "headingArabic": "مُبَاشَرَةِ الْحَائِضِ",
                "headingUrdu": "حیض والی بیوی کو پسند کرنا",
                "headingEnglish": "Fondling a menstruating wife",
                "chapterId": "6",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 6,
                    "chapterNumber": "6",
                    "chapterEnglish": "Menstrual Periods",
                    "chapterUrdu": "حیض کے احکام و مسائل",
                    "chapterArabic": "كتاب الحيض",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 299,
                "hadithNumber": "302",
                "englishNarrator": "Narrated `Abdur-Rahman bin Al-Aswad(on the authority of his father): `Aisha said:",
                "hadithEnglish": "\"Whenever Allah's Messenger (ﷺ) wanted to fondle anyone of us during her periods (menses), he used to order her to put on an Izar and start fondling her.\" `Aisha added, \"None of you could control his sexual desires as the Prophet (ﷺ) could.\"",
                "hadithUrdu": "آپ نے فرمایا ہم ازواج میں سے کوئی جب حائضہ ہوتی ، اس حالت میں رسول اللہ صلی اللہ علیہ وسلم اگر مباشرت کا ارادہ کرتے تو آپ صلی اللہ علیہ وسلم ازار باندھنے کا حکم دے دیتے باوجود حیض کی زیادتی کے ۔ پھر بدن سے بدن ملاتے ، آپ نے کہا تم میں ایسا کون ہے جو نبی کریم صلی اللہ علیہ وسلم کی طرح اپنی شہوت پر قابو رکھتا ہو ۔ اس حدیث کی متابعت خالد اور جریر نے شیبانی کی روایت سے کی ہے ۔ ( یہاں بھی مباشرت سے ساتھ لیٹنا بیٹھنا مراد ہے ) ۔",
                "urduNarrator": "ہم سے اسماعیل بن خلیل نے بیان کیا ، کہا ہم سے علی بن مسہر نے ، ہم سے ابواسحاق سلیمان بن فیروز شیبانی نے عبدالرحمٰن بن اسود کے واسطہ سے ، وہ اپنے والد اسود بن یزید سے ، وہ حضرت عائشہ رضی اللہ عنہا سے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ خَلِيلٍ، قَالَ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، قَالَ أَخْبَرَنَا أَبُو إِسْحَاقَ ـ هُوَ الشَّيْبَانِيُّ ـ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَتْ إِحْدَانَا إِذَا كَانَتْ حَائِضًا، فَأَرَادَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُبَاشِرَهَا، أَمَرَهَا أَنْ تَتَّزِرَ فِي فَوْرِ حَيْضَتِهَا ثُمَّ يُبَاشِرُهَا‏.‏ قَالَتْ وَأَيُّكُمْ يَمْلِكُ إِرْبَهُ كَمَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَمْلِكُ إِرْبَهُ‏.‏ تَابَعَهُ خَالِدٌ وَجَرِيرٌ عَنِ الشَّيْبَانِيِّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 6,
                    "chapterNumber": "6",
                    "chapterEnglish": "Menstrual Periods",
                    "chapterUrdu": "حیض کے احکام و مسائل",
                    "chapterArabic": "كتاب الحيض",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 300,
                "hadithNumber": "303",
                "englishNarrator": "Narrated Maimuna:",
                "hadithEnglish": "When ever Allah's Messenger (ﷺ) wanted to fondle any of his wives during the periods (menses), he used to ask her to wear an Izar.",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم اپنی بیویوں میں سے کسی سے مباشرت کرنا چاہتے اور وہ حائضہ ہوتی ، تو آپ صلی اللہ علیہ وسلم کے حکم سے ، وہ پہلے ازار باندھ لیتیں ۔ اور سفیان نے شیبانی سے اس کو روایت کیا ہے ۔",
                "urduNarrator": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا ، انھوں نے کہا ہم سے عبدالواحد بن زیاد نے بیان کیا ، انھوں نے کہا ہم سے ابواسحاق شیبانی نے بیان کیا ، انھوں نے کہا ہم سے عبداللہ بن شداد نے بیان کیا ، انھوں نے کہا میں نے میمونہ سے سنا ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا الشَّيْبَانِيُّ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ شَدَّادٍ، قَالَ سَمِعْتُ مَيْمُونَةَ، كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يُبَاشِرَ امْرَأَةً مِنْ نِسَائِهِ أَمَرَهَا فَاتَّزَرَتْ وَهْىَ حَائِضٌ‏.‏ وَرَوَاهُ سُفْيَانُ عَنِ الشَّيْبَانِيِّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "6",
                "bookSlug": "sahih-bukhari",
                "volume": "1",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 6,
                    "chapterNumber": "6",
                    "chapterEnglish": "Menstrual Periods",
                    "chapterUrdu": "حیض کے احکام و مسائل",
                    "chapterArabic": "كتاب الحيض",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 276,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=11",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=9",
                "label": "9",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=10",
                "label": "10",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=11",
                "label": "11",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=12",
                "label": "12",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=13",
                "label": "13",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=14",
                "label": "14",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=15",
                "label": "15",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=13",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=13",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=11",
        "to": 300,
        "total": 40465
    }
}