{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 240,
        "data": [
            {
                "id": 5978,
                "hadithNumber": "6237",
                "englishNarrator": "Narrated Abu Aiyub رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"It is not lawful for a Muslim to desert (not to speak to) his brother Muslim for more than three days while meeting, one turns his face to one side and the other turns his face to the other side. Lo! The better of the two is the one who starts greeting the other.\" Sufyan says that he heard it thrice from Zuhri.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کسی مسلمان کے لئے جائز نہیں کہ وہ اپنے کسی ( مسلمان ) بھائی سے تین دن سے زیادہ تعلق کاٹے کہ جب وہ ملیں تو یہ ایک طرف منہ پھیرلے اور دوسرا دوسری طرف اور دونوں میں اچھا وہ ہے جو سلام پہلے کرے ۔ اور سفیان نے کہا کہ انہوں نے یہ حدیث زہری سے تین مرتبہ سنی ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے عطاء بن یزید لیثی نے اور ان سے ابوایوب رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي أَيُّوبَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثٍ، يَلْتَقِيَانِ فَيَصُدُّ هَذَا، وَيَصُدُّ هَذَا، وَخَيْرُهُمَا الَّذِي يَبْدَأُ بِالسَّلاَمِ ‏\"‏‏.‏ وَذَكَرَ سُفْيَانُ أَنَّهُ سَمِعَهُ مِنْهُ ثَلاَثَ مَرَّاتٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5979,
                "hadithNumber": "6238",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "that he was a boy of ten at the time when the Prophet (ﷺ) emigrated to Medina. He added: I served Allah's Apostle for ten years (the last part of his life time) and I know more than the people about the occasion whereupon the order of Al-Hijab was revealed (to the Prophet). Ubai b n Ka`b رضی اللہ عنہ used to ask me about it. It was revealed (for the first time) during the marriage of Allah's Messenger (ﷺ) with Zainab bint Jahsh ر ضی اللہ عنہا . In the morning, the Prophet (ﷺ) was a bride-groom of her and he Invited the people, who took their meals and went away, but a group of them remained with Allah's Messenger (ﷺ) and they prolonged their stay. Allah's Messenger (ﷺ) got up and went out, and I too, went out along with him till he came to the lintel of `Aisha's dwelling place. Allah's Messenger (ﷺ) thought that those people had left by then, so he returned, and I too, returned with him till he entered upon Zainab ر ضی اللہ عنہا and found that they were still sitting there and had not yet gone. The Prophet (ﷺ) went out again, and so did I with him till he reached the lintel of `Aisha's dwelling place, and then he thought that those people must have left by then, so he returned, and so did I with him, and found those people had gone. At that time the Divine Verse of Al-Hijab was revealed, and the Prophet (ﷺ) set a screen between me and him (his family).",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم مدینہ منورہ ( ہجرت کر کے ) تشریف لائے تو ان کی عمر دس سال تھی ۔ پھر میں نے آنحضرت صلی اللہ علیہ وسلم کی زندگی کے باقی دس سالوںمیں آپ کی خدمت کی اور میں پردہ کے حکم کے متعلق سب سے زیادہ جانتا ہوں کہ کب نازل ہوا تھا ۔ ابی بن کعب رضی اللہ عنہ مجھ سے اس کے بارے میں پوچھا کرتے تھے ۔ پردہ کے حکم کانزول سب سے پہلے اس رات ہوا جس میں رسول اللہ صلی اللہ علیہ وسلم نے زینب بنت جحش ر ضی اللہ عنہا سے نکاح کے بعد ان کے ساتھ پہلی خلوت کی تھی ۔ آنحضرت صلی اللہ علیہ وسلم ان کے دولہا تھے اور آپ نے صحابہ کو دعوت ولیمہ پر بلایا تھا ۔ کھانے سے فارغ ہو کر سب لوگ چلے گئے لیکن چند آدمی آپ کے پاس بیٹھے رہ گئے اور بہت دیر تک وہیں ٹھہرے رہے ۔ آنحضرت صلی اللہ علیہ وسلم اٹھ کر باہر تشریف لے گئے اور میں بھی آنحضرت صلی اللہ علیہ وسلم کے ساتھ چلا گیا تاکہ وہ لوگ بھی چلے جائیں ۔ آنحضرت چلتے رہے اور میں بھی آنحضرت صلی اللہ علیہ وسلم کے ساتھ چلتا رہا اور سمجھا کہ وہ لوگ اب چلے گئے ہیں ۔ اس لئے واپس تشریف لائے اور میں بھی آنحضرت صلی اللہ علیہ وسلم کے ساتھ واپس آیا لیکن آپ جب زینب رضی اللہ عنہا کے حجرے میں داخل ہوئے تو وہ لوگ ابھی بیٹھے ہوئے تھے اور ابھی تک واپس نہیں گئے تھے ۔ آنحضرت صلی اللہ علیہ وسلم دوبارہ وہاں سے لوٹ گئے اور میں بھی آپ کے ساتھ لوٹ گیا ۔ جب آپ عائشہ رضی اللہ عنہا کے حجرہ کی چوکھٹ تک پہنچے تو آپ نے سمجھا کہ وہ لوگ نکل چکے ہوں گے ۔ پھر آپ لوٹ کر آئے اور میں بھی آپ کے ساتھ لوٹ آیا تو واقعی وہ لوگ جا چکے تھے ۔ پھر پردہ کی آیت نازل ہوئی اور آنحضرت صلی اللہ علیہ وسلم نے میرے اور اپنے درمیان پردہ لٹکا لیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا ہم سے ابن وہب نے بیان کیا ، کہا مجھ کو یونس نے خبر دی ، انہیں ابن شہاب نے کہا کہ مجھے انس بن مالک رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّهُ كَانَ ابْنَ عَشْرِ سِنِينَ مَقْدَمَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ، فَخَدَمْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَشْرًا حَيَاتَهُ، وَكُنْتُ أَعْلَمَ النَّاسِ بِشَأْنِ الْحِجَابِ حِينَ أُنْزِلَ، وَقَدْ كَانَ أُبَىُّ بْنُ كَعْبٍ يَسْأَلُنِي عَنْهُ، وَكَانَ أَوَّلَ مَا نَزَلَ فِي مُبْتَنَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِزَيْنَبَ ابْنَةِ جَحْشٍ، أَصْبَحَ النَّبِيُّ صلى الله عليه وسلم بِهَا عَرُوسًا فَدَعَا الْقَوْمَ، فَأَصَابُوا مِنَ الطَّعَامِ ثُمَّ خَرَجُوا، وَبَقِيَ مِنْهُمْ رَهْطٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَطَالُوا الْمُكْثَ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَخَرَجَ وَخَرَجْتُ مَعَهُ كَىْ يَخْرُجُوا، فَمَشَى رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَشَيْتُ مَعَهُ حَتَّى جَاءَ عَتَبَةَ حُجْرَةِ عَائِشَةَ، ثُمَّ ظَنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّهُمْ خَرَجُوا فَرَجَعَ وَرَجَعْتُ مَعَهُ، حَتَّى دَخَلَ عَلَى زَيْنَبَ فَإِذَا هُمْ جُلُوسٌ لَمْ يَتَفَرَّقُوا، فَرَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَرَجَعْتُ مَعَهُ، حَتَّى بَلَغَ عَتَبَةَ حُجْرَةِ عَائِشَةَ، فَظَنَّ أَنْ قَدْ خَرَجُوا، فَرَجَعَ وَرَجَعْتُ مَعَهُ، فَإِذَا هُمْ قَدْ خَرَجُوا، فَأُنْزِلَ آيَةُ الْحِجَابِ، فَضَرَبَ بَيْنِي وَبَيْنَهُ سِتْرًا‏.‏",
                "headingArabic": "آيَةِ الْحِجَابِ",
                "headingUrdu": "الحجاب کی الہی آیت",
                "headingEnglish": "The Divine Verse of Al-Hijab",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5980,
                "hadithNumber": "6239",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When the Prophet (ﷺ) married Zainab, the people came and were offered a meal, and then they sat down (after finishing their meals) and started chatting. The Prophet (ﷺ) showed as if he wanted to get up, but they did not get up. When he noticed that, he got up, and some of the people also got up and went away, while some others kept on sitting. When the Prophet (ﷺ) returned to enter, he found the people still sitting, but then they got up and left. So I told the Prophet (ﷺ) of their departure and he came and went in. I intended to go in but the Prophet (ﷺ) put a screen between me and him, for Allah revealed:-- 'O you who believe! Enter not the Prophet's houses..' (33.53)",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم نے زینب رضی اللہ عنہا سے نکاح کیا تو لوگ اندر آئے اور کھانا کھایا پھر بیٹھ کے باتیں کرتے رہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس طرح اظہار کیا گویا آپ کھڑے ہونا چاہتے ہیں ۔ لیکن وہ کھڑے نہیں ہوئے جب آنحضرت صلی اللہ علیہ وسلم نے یہ دیکھا تو کھڑے ہو گئے ۔ آپ کے کھڑے ہونے پر قوم کے جن لوگوں کوکھڑا ہونا تھا وہ بھی کھڑے ہو گئے لیکن بعض لوگ اب بھی بیٹھے رہے اور جب آنحضرت صلی اللہ علیہ وسلم اندر داخل ہونے کے لئے تشریف لائے توکچھ لوگ بیٹھے ہوئے تھے ( آپ واپس ہو گئے ) اور پھر جب وہ لوگ بھی کھڑے ہوئے اور چلے گئے تو میں نے آنحضرت صلی اللہ علیہ وسلم کو اس کی اطلاع دی ۔ آنحضرت صلی اللہ علیہ وسلم تشریف لائے اور اندر داخل ہو گئے ۔ میں نے بھی اندر جانا چاہا لیکن آنحضرت صلی اللہ علیہ وسلم نے میرے اور اپنے درمیان پردہ ڈال لیا ۔ اور اللہ تعالیٰ نے یہ آیت نازل کی ۔ ” اے ایمان والو ! نبی کے گھر میں نہ داخل ہو “ آخر تک ۔",
                "urduNarrator": "ہم سے ابو النعمان نے بیان کیا ، کہا ہم سے معتمر نے بیان کیا ، کہامجھ سے میرے والد نے بیان کیا کہ ان سے ابو مجلز نے بیان کیا اور ان سے انس رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ أَبِي حَدَّثَنَا أَبُو مِجْلَزٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمَّا تَزَوَّجَ النَّبِيُّ صلى الله عليه وسلم زَيْنَبَ دَخَلَ الْقَوْمُ فَطَعِمُوا، ثُمَّ جَلَسُوا يَتَحَدَّثُونَ فَأَخَذَ كَأَنَّهُ يَتَهَيَّأُ لِلْقِيَامِ فَلَمْ يَقُومُوا، فَلَمَّا رَأَى ذَلِكَ قَامَ، فَلَمَّا قَامَ قَامَ مَنْ قَامَ مِنَ الْقَوْمِ وَقَعَدَ بَقِيَّةُ الْقَوْمِ، وَإِنَّ النَّبِيَّ صلى الله عليه وسلم جَاءَ لِيَدْخُلَ، فَإِذَا الْقَوْمُ جُلُوسٌ، ثُمَّ إِنَّهُمْ قَامُوا فَانْطَلَقُوا فَأَخْبَرْتُ النَّبِيَّ صلى الله عليه وسلم فَجَاءَ حَتَّى دَخَلَ، فَذَهَبْتُ أَدْخُلُ فَأَلْقَى الْحِجَابَ بَيْنِي وَبَيْنَهُ، وَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَدْخُلُوا بُيُوتَ النَّبِيِّ‏}‏ الآيَةَ‏.‏ قَالَ أَبُو عَبْد اللَّهِ فِيهِ مِنْ الْفِقْهِ أَنَّهُ لَمْ يَسْتَأْذِنْهُمْ حِينَ قَامَ وَخَرَجَ وَفِيهِ أَنَّهُ تَهَيَّأَ لِلْقِيَامِ وَهُوَ يُرِيدُ أَنْ يَقُومُوا",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5981,
                "hadithNumber": "6240",
                "englishNarrator": "Narrated `Aisha (the wife of the Prophet) رضی اللہ عنہا:",
                "hadithEnglish": "`Umar bin Al-Khattab رضی اللہ عنہ used to say to Allah's Messenger (ﷺ) \"Let your wives be veiled\" But he did not do so. The wives of the Prophet (ﷺ) used to go out to answer the call of nature at night only at Al-Manasi.' Once Sauda, the daughter of Zam`a رضی اللہ عنہا went out and she was a tall woman. `Umar bin Al-Khattab saw her while he was in a gathering, and said, \"I have recognized you, O Sauda!\" He (`Umar رضی اللہ عنہ) said so as he was anxious for some Divine orders regarding the veil (the veiling of women.) So Allah revealed the Verse of veiling. (Al-Hijab; a complete body cover excluding the eyes). (See Hadith No. 148, Vol. 1)",
                "hadithUrdu": "عمر بن خطاب رضی اللہ عنہ آنحضرت صلی اللہ علیہ وسلم سے کہا کرتے تھے کہ آنحضور صلی اللہ علیہ وسلم ازواج مطہرا ت کا پردہ کرائیں ۔ بیان کیا کہ آنحضور صلی اللہ علیہ وسلم نے ایسا نہیں کیا اور ازواج مطہرات رفع حاجت کے لئے صرف رات ہی کے وقت نکلتی تھیں ( اس وقت گھروں میں بیت الخلاء نہیں تھے ) ایک مرتبہ سودہ بنت زمعہ رضی اللہ عنہاباہر گئی ہوئی تھیں ۔ ان کا قد لمبا تھا ۔ حضرت عمر بن خطاب رضی اللہ عنہ نے انہیں دیکھا ۔ اس وقت وہ مجلس میں بیٹھے ہوئے تھے ۔ انہوں نے کہا سودہ میں نے آپ کوپہچان لیا یہ انہوں نے اس لئے کہا کیونکہ وہ پردہ کے حکم نازل ہونے کے بڑے متمنی تھے ۔ بیان کیا کہ پھر اللہ تعالیٰ نے پردہ کی آیت نازل کی ۔",
                "urduNarrator": "ہم سے اسحاق نے بیان کیا ، کہا ہم کو یعقوب نے خبر دی ، مجھ سے میرے والد نے بیان کیا ، ا ن سے صالح نے ، ان سے ابن شہاب نے بیان کیا ، کہا کہ مجھے عروہ بن زبیر نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا يَعْقُوبُ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ عُمَرُ بْنُ الْخَطَّابِ يَقُولُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم احْجُبْ نِسَاءَكَ‏.‏ قَالَتْ فَلَمْ يَفْعَلْ، وَكَانَ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم يَخْرُجْنَ لَيْلاً إِلَى لَيْلٍ قِبَلَ الْمَنَاصِعِ، خَرَجَتْ سَوْدَةُ بِنْتُ زَمْعَةَ، وَكَانَتِ امْرَأَةً طَوِيلَةً فَرَآهَا عُمَرُ بْنُ الْخَطَّابِ وَهْوَ فِي الْمَجْلِسِ فَقَالَ عَرَفْتُكِ يَا سَوْدَةُ‏.‏ حِرْصًا عَلَى أَنْ يُنْزَلَ الْحِجَابُ‏.‏ قَالَتْ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ آيَةَ الْحِجَابِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5982,
                "hadithNumber": "6241",
                "englishNarrator": "Narrated Sahl bin Sa`d:",
                "hadithEnglish": "A man peeped through a round hole into the dwelling place of the Prophet, while the Prophet (ﷺ) had a Midray (an iron comb) with which he was scratching his head. the Prophet (ﷺ) said, \" Had known you were looking (through the hole), I would have pierced your eye with it (i.e., the comb).\" Verily! The order of taking permission to enter has been enjoined because of that sight, (that one should not look unlawfully at the state of others). (See Hadith No. 807, Vol. 7)",
                "hadithUrdu": "ایک شخص نے نبی کریم صلی اللہ علیہ وسلم کے کسی حجرہ میں سوراخ سے دیکھا ، آنحضرت صلی اللہ علیہ وسلم کے پاس اس وقت ایک کنگھاتھاجس سے آپ سرمبارک کھجا رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس سے فرمایا کہ اگر مجھے معلوم ہوتا کہ تم جھانک رہے ہو تو یہ کنگھا تمہاری آنکھ میں چبھو دیتا ( اندر داخل ہونے سے پہلے ) اجازت مانگنا توہے ہی اسلئے کہ ( اندر کی کوئی ذاتی چیز ) نہ دیکھی جائے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے ، ان سے زہری نے بیان کیا ( سفیان نے کہا کہ ) میں نے یہ حدیث زہری سے سن کراس طرح یاد کی ہے کہ جیسے تو اس وقت یہاں موجود ہو اور ان سے سہل بن سعد نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ الزُّهْرِيُّ حَفِظْتُهُ كَمَا أَنَّكَ هَا هُنَا عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ اطَّلَعَ رَجُلٌ مِنْ جُحْرٍ فِي حُجَرِ النَّبِيِّ صلى الله عليه وسلم وَمَعَ النَّبِيِّ صلى الله عليه وسلم مِدْرًى يَحُكُّ بِهِ رَأْسَهُ فَقَالَ ‏ \"‏ لَوْ أَعْلَمُ أَنَّكَ تَنْظُرُ لَطَعَنْتُ بِهِ فِي عَيْنِكَ، إِنَّمَا جُعِلَ الاِسْتِئْذَانُ مِنْ أَجْلِ الْبَصَرِ ‏\"‏‏.‏",
                "headingArabic": "الاِسْتِئْذَانُ مِنْ أَجْلِ الْبَصَرِ",
                "headingUrdu": "دیکھنے کی وجہ سے اجازت مانگ رہا ہے۔",
                "headingEnglish": "Asking permission because of looking",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5983,
                "hadithNumber": "6242",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "A man peeped into a room of the Prophet. The Prophet (ﷺ) stood up, holding an arrow head. It is as if I am just looking at him, trying to stab the man.",
                "hadithUrdu": "ایک صاحب نبی کریم صلی اللہ علیہ وسلم کے کسی حجرہ میں جھانک کر دیکھنے لگے تو آنحضرت صلی اللہ علیہ وسلم ان کی طرف تیر کا پھل یا بہت سے پھل لے کر بڑھے ، گویا میں آنحضرت صلی اللہ علیہ وسلم کو دیکھ رہا ہوں ان صاحب کی طرف اس طرح چپکے چپکے تشریف لائے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے حما د بن زید نے بیان کیا ، ان سے عبیداللہ بن ابی بکر نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلاً، اطَّلَعَ مِنْ بَعْضِ حُجَرِ النَّبِيِّ صلى الله عليه وسلم فَقَامَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم بِمِشْقَصٍ ـ أَوْ بِمَشَاقِصَ ـ فَكَأَنِّي أَنْظُرُ إِلَيْهِ يَخْتِلُ الرَّجُلَ لِيَطْعُنَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5984,
                "hadithNumber": "6243",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "I have not found any closer description of the word ''Lamam'' than the report of Hadrat Abu Hurairah رضی اللہ عنہ. The other reports also say: Taus has reported from Hadrat Ibn-e-Abbas رضی اللہ عنہما: I have not found any closer description of the word ''Lamam'' than the report of Hadrat Abu Hurairah رضی اللہ عنہ from the Prophet ﷺ : Man inevitably gets his share of fornication what Allah has preordained  for him, so the adultery of the eyes is gazing; the adulery of the tongue is talking. And inner-self craves and aspires whereas the private parts testify or reject it.",
                "hadithUrdu": "ابوہریرہ رضی اللہ عنہ کی حدیث سے زیادہ صغیرہ گناہوں سے مشابہ میں نے اور کوئی چیز نہیں دیکھی ۔ ( حضرت ابوہریرہ رضی اللہ عنہ نے جو باتیں بیان کی ہیں وہ مراد ہیں ) مجھ سے محمود نے بیان کیا ، کہا ہم سے عبدالرزاق نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں ابن طاؤس نے ، انہیں ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہمانے کہ میں نے کوئی چیز صغیرہ گناہوں سے مشابہ اس حدیث کے مقابلہ میں نہیں دیکھی جسے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے نقل کیا ہے کہ اللہ تعالیٰ نے انسانوں کے معاملہ میں زنا میں سے اس کا حصہ لکھ دیا ہے جس سے وہ لامحالہ دوچار ہو گا پس آنکھ کا زنا دیکھنا ہے ، زبان کا زنا بولنا ہے ، دل کا زنا یہ ہے کہ وہ خواہش اور آرزو کرتا ہے پھر شرمگاہ اس خواہش کو سچا کرتی ہے یا جھٹلا دیتی ہے ۔",
                "urduNarrator": "ہم سے حمیدی نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ابن طاؤس نے ، ان سے ان کے والد نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمْ أَرَ شَيْئًا أَشْبَهَ بِاللَّمَمِ مِنْ قَوْلِ أَبِي هُرَيْرَةَ‏.‏ حَدَّثَنِي مَحْمُودٌ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنِ ابْنِ عَبَّاسٍ قَالَ مَا رَأَيْتُ شَيْئًا أَشْبَهَ بِاللَّمَمِ مِمَّا قَالَ أَبُو هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ إِنَّ اللَّهَ كَتَبَ عَلَى ابْنِ آدَمَ حَظَّهُ مِنَ الزِّنَا، أَدْرَكَ ذَلِكَ لاَ مَحَالَةَ، فَزِنَا الْعَيْنِ النَّظَرُ، وَزِنَا اللِّسَانِ الْمَنْطِقُ، وَالنَّفْسُ تَمَنَّى وَتَشْتَهِي، وَالْفَرْجُ يُصَدِّقُ ذَلِكَ كُلَّهُ وَيُكَذِّبُهُ ‏\"‏‏.‏",
                "headingArabic": "زِنَا الْجَوَارِحِ دُونَ الْفَرْجِ",
                "headingUrdu": "جسم کے اعضاء کا زنا",
                "headingEnglish": "The adultery of the body parts",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5985,
                "hadithNumber": "6244",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Whenever Allah's Messenger (ﷺ) greeted somebody, he used to greet him three times, and if he spoke a sentence, he used to repeat it thrice.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب کسی کو سلام کرتے ( اور جواب نہ ملتا ) تو تین مرتبہ سلام کرتے تھے اور جب آپ کوئی بات فرماتے تو ( زیادہ سے زیادہ ) تین مرتبہ اسے دہراتے ۔",
                "urduNarrator": "ہم سے اسحٰق نے بیان کیا کہا ہم کو عبدالصمد نے خبر دی ، انہیں عبداللہ بن مثنی نے خبر دی ان سے ثمامہ بن عبداللہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى، حَدَّثَنَا ثُمَامَةُ بْنُ عَبْدِ اللَّهِ، عَنْ أَنَسٍ ـ رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا سَلَّمَ سَلَّمَ ثَلاَثًا، وَإِذَا تَكَلَّمَ بِكَلِمَةٍ أَعَادَهَا ثَلاَثًا‏.‏",
                "headingArabic": "التَّسْلِيمِ وَالاِسْتِئْذَانِ ثَلاَثًا",
                "headingUrdu": "تین بار سلام کرنا اور اجازت طلب کرنا",
                "headingEnglish": "To greet and ask permission thrice",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5986,
                "hadithNumber": "6245",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "While I was present in one of the gatherings of the Ansar, Abu Musa رضی اللہ عنہ came as if he was scared, and said, \"I asked permission to enter upon `Umar رضی اللہ عنہ three times, but I was not given the permission, so I returned.\" (When `Umar رضی اللہ عنہ came to know about it) he said to Abu Musa رضی اللہ عنہ , \"Why did you not enter?'. Abu Musa رضی اللہ عنہ replied, \"I asked permission three times, and I was not given it, so I returned, for Allah's Messenger (ﷺ) said, \"If anyone of you asks the permission to enter thrice, and the permission is not given, then he should return.' \" `Umar رضی اللہ عنہ said, \"By Allah! We will ask Abu Musa رضی اللہ عنہ to bring witnesses for it.\" (Abu Musa رضی اللہ عنہ went to a gathering of the Ansar and said). \"Did anyone of you hear this from the Prophet (ﷺ) ?\" Ubai bin Ka`b said, \"By Allah, none will go with you but the youngest of the people (as a witness).\" (Abu Sa`id) was the youngest of them, so I went with Abu Musa رضی اللہ عنہ and informed `Umar رضی اللہ عنہ that the Prophet (ﷺ) had said so. Yazeed bin Busr has also heard the same from Hadrat Abu Saeed (Khudri) رضی اللہ عنہ .",
                "hadithUrdu": "میں انصار کی ایک مجلس میں تھا کہ ابوموسیٰ رضی اللہ عنہ تشریف لائے جیسے گھبرائے ہوئے ہوں ۔ انہوں نے کہا کہ میں عمر رضی اللہ عنہ کے یہاں تین مرتبہ اندر آنے کی اجازت چاہی لیکن مجھے کوئی جواب نہیں ملا ، اس لئے واپس چلا آیا ( حضرت عمر رضی اللہ عنہ کو معلوم ہوا ) تو انہوں نے دریافت کیا کہ ( اندر آنے میں ) کیا بات مانع تھی ؟ میں نے کہا کہ میں نے تین مرتبہ اندر آنے کی اجازت مانگی اور جب مجھے کوئی جواب نہیں ملا تو واپس چلا گیا اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ : جب تم میں سے کوئی کسی سے تین مرتبہ اجازت چاہے اور اجا زت نہ ملے تو واپس چلاجانا چاہئے حضرت عمر رضی اللہ عنہ نے کہا واللہ ! تمہیں اس حدیث کی صحت کے لئے کوئی گوا ہ لاناہو گا ۔ ( ابوموسیٰ رضی اللہ عنہ نے مجلس والوں سے پوچھا ) کیا تم میں کوئی ایسا ہے جس نے آنحضرت صلی اللہ علیہ وسلم سے یہ حدیث سنی ہو ؟ ابی بن کعب رضی اللہ عنہ نے کہا کہ اللہ کی قسم ! تمہارے ساتھ ( اس کی گواہی دینے کے سوا ) جماعت میں سب سے کم عمر شخص کے کوئی اور نہیں کھڑا ہو گا ۔ ابوسعید نے کہا اور میں ہی جماعت کا وہ سب سے کم عمر آدمی تھا میں ان کے ساتھ اٹھ کھڑا ہو گیا اور عمر رضی اللہ عنہ سے کہا کہ واقعی نبی کریم صلی اللہ علیہ وسلم نے ایسا فرمایا ہے ۔ اور ابن مبارک نے بیان کیا کہ مجھ کو سفیان بن عیینہ نے خبر دی ، کہا مجھ سے یزید بن خصیفہ نے بیان کیا ، انہوں نے بسر بن سعید سے ، کہا میں نے ابوسعید رضی اللہ عنہ سے سنا پھر یہی حدیث نقل کی ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا ہم سے یزید بن خصیفہ نے بیان کیا ان سے بسر بن سعید اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا يَزِيدُ بْنُ خُصَيْفَةَ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ كُنْتُ فِي مَجْلِسٍ مِنْ مَجَالِسِ الأَنْصَارِ إِذْ جَاءَ أَبُو مُوسَى كَأَنَّهُ مَذْعُورٌ فَقَالَ اسْتَأْذَنْتُ عَلَى عُمَرَ ثَلاَثًا، فَلَمْ يُؤْذَنْ لِي فَرَجَعْتُ فَقَالَ مَا مَنَعَكَ قُلْتُ اسْتَأْذَنْتُ ثَلاَثًا، فَلَمْ يُؤْذَنْ لِي فَرَجَعْتُ، وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا اسْتَأْذَنَ أَحَدُكُمْ ثَلاَثًا فَلَمْ يُؤْذَنْ لَهُ، فَلْيَرْجِعْ ‏\"‏‏.‏ فَقَالَ وَاللَّهِ لَتُقِيمَنَّ عَلَيْهِ بِبَيِّنَةٍ‏.‏ أَمِنْكُمْ أَحَدٌ سَمِعَهُ مِنَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ أُبَىُّ بْنُ كَعْبٍ وَاللَّهِ لاَ يَقُومُ مَعَكَ إِلاَّ أَصْغَرُ الْقَوْمِ، فَكُنْتُ أَصْغَرَ الْقَوْمِ، فَقُمْتُ مَعَهُ فَأَخْبَرْتُ عُمَرَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ذَلِكَ‏.‏ وَقَالَ ابْنُ الْمُبَارَكِ أَخْبَرَنِي ابْنُ عُيَيْنَةَ حَدَّثَنِي يَزِيدُ عَنْ بُسْرٍ سَمِعْتُ أَبَا سَعِيدٍ بِهَذَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5987,
                "hadithNumber": "6246",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I entered (the house) along with Allah's Messenger (ﷺ) . There he found milk in a basin. He said, \"O Abu Hirr! Go and call the people of Suffa to me.\" I went to them and invited them. They came and asked permission to enter, and when it was given, they entered. (See Hadith No. 459 for details)",
                "hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( آپ کے گھر میں ) داخل ہوا آنحضرت صلی اللہ علیہ وسلم نے ایک بڑے پیا لے میں دودھ پایا تو فرمایا ، ابوہریرہ ! اہل صفہ کے پاس جا اور انہیں میرے پاس بلا لا ۔ میں ان کے پاس آیا اور انہیں بلا لایا ۔ وہ آئے اور ( اندر آنے کی ) اجازت چاہی پھر جب ا جازت دی گئی تو داخل ہوئے ۔ باب اور حدیث میں مطابقت ظاہر ہے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے عمر بن ذر نے بیان کیا ( دوسری سند ) اور ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو مجاہد نے خبر دی ، اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عُمَرُ بْنُ ذَرٍّ،‏.‏ وَحَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عُمَرُ بْنُ ذَرٍّ، أَخْبَرَنَا مُجَاهِدٌ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ دَخَلْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَوَجَدَ لَبَنًا فِي قَدَحٍ فَقَالَ ‏ \"‏ أَبَا هِرٍّ الْحَقْ أَهْلَ الصُّفَّةِ فَادْعُهُمْ إِلَىَّ ‏\"‏‏.‏ قَالَ فَأَتَيْتُهُمْ فَدَعَوْتُهُمْ، فَأَقْبَلُوا فَاسْتَأْذَنُوا فَأُذِنَ لَهُمْ، فَدَخَلُوا‏.‏",
                "headingArabic": "إِذَا دُعِيَ الرَّجُلُ فَجَاءَ هَلْ يَسْتَأْذِنُ",
                "headingUrdu": "اگر کسی آدمی کو مدعو کیا جائے تو کیا وہ داخل ہونے کی اجازت طلب کرے؟",
                "headingEnglish": "If a man is invited, should he ask permission to enter",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5988,
                "hadithNumber": "6247",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "He passed by a group of boys and greeted them and said, \"The Prophet (ﷺ) used to do so.\"",
                "hadithUrdu": "آپ بچوں کے پاس سے گزرے تو انہیں سلام کیا اور فرمایا کہ نبی کریم صلی اللہ علیہ وسلم بھی ایسا ہی کرتے تھے ۔",
                "urduNarrator": "ہم سے علی بن الجعد نے بیان کیا ، انہوں نے کہا ہم کوشعبہ نے خبر دی ، انہیں سیار نے انہوں نے ثابت بنانی سے روایت کی ، انہیں انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنْ سَيَّارٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه أَنَّهُ مَرَّ عَلَى صِبْيَانٍ فَسَلَّمَ عَلَيْهِمْ وَقَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَفْعَلُهُ‏.‏",
                "headingArabic": "التَّسْلِيمِ عَلَى الصِّبْيَانِ",
                "headingUrdu": "لڑکوں کو سلام کرنا",
                "headingEnglish": "To greet the boys",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5989,
                "hadithNumber": "6248",
                "englishNarrator": "Narrated Sahl رضی اللہ عنہ :",
                "hadithEnglish": "\"We used to feel happy on Fridays.\" I asked Sahl, \"Why?\" He said, \"There was an old woman of our acquaintance who used to send somebody to Buda'a (Ibn Maslama said, \"Buda'a was a garden of date-palms at Medina). She used to pull out the silq (a kind of vegetable) from its roots and put it in a cooking pot, adding some powdered barley over it (and cook it). After finishing the Jumua (Friday) prayer we used to (pass by her and) greet her, whereupon she would present us with that meal, so we used to feel happy because of that. We used to have neither a midday nap, nor meals, except after the Friday prayer.\" (See Hadith No. 60, Vol.2)",
                "hadithUrdu": "ہم جمعہ کے دن خوش ہوا کرتے تھے ۔ میں نے عرض کی کس لئے ؟ فرمایا کہ ہماری ایک بڑھیا تھیں جو مقام بضاعہ جایا کرتی تھیں ۔ ابن سلمہ نے کہا کہ بضاعہ مدینہ منورہ کا کھجور کا ایک باغ تھا ۔ پھر وہ وہاں سے چقندر لایا کرتی تھیں اور اسے ہانڈی میں ڈالتی تھیں اور جو کے کچھ دانے پیس کر ( اس میں ملاتی تھیں ) جب ہم جمعہ کی نماز پڑھ کر واپس ہوتے تو انہیں سلام کرنے آتے اور وہ یہ چقندر کی جڑ میں آٹا ملی ہوئی دعوت ہمارے سامنے رکھتی تھیں ہم اس وجہ سے جمعہ کے دن خوش ہوا کرتے تھے اور قیلولہ یا دوپہر کا کھانا ہم جمعہ کے بعد کرتے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، کہا ہم سے ابن ابی حازم نے ان سے ان کے والد نے اور ان سے سہل رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، قَالَ كُنَّا نَفْرَحُ يَوْمَ الْجُمُعَةِ‏.‏ قُلْتُ وَلِمَ قَالَ كَانَتْ لَنَا عَجُوزٌ تُرْسِلُ إِلَى بُضَاعَةَ ـ قَالَ ابْنُ مَسْلَمَةَ نَخْلٍ بِالْمَدِينَةِ ـ فَتَأْخُذُ مِنْ أُصُولِ السِّلْقِ فَتَطْرَحُهُ فِي قِدْرٍ، وَتُكَرْكِرُ حَبَّاتٍ مِنْ شَعِيرٍ، فَإِذَا صَلَّيْنَا الْجُمُعَةَ انْصَرَفْنَا وَنُسَلِّمُ عَلَيْهَا فَتُقَدِّمُهُ إِلَيْنَا، فَنَفْرَحُ مِنْ أَجْلِهِ، وَمَا كُنَّا نَقِيلُ وَلاَ نَتَغَدَّى إِلاَّ بَعْدَ الْجُمُعَةِ‏.‏",
                "headingArabic": "تَسْلِيمِ الرِّجَالِ عَلَى النِّسَاءِ وَالنِّسَاءِ عَلَى الرِّجَالِ",
                "headingUrdu": "مردوں کا عورتوں کو اور عورتوں کا مردوں کو سلام",
                "headingEnglish": "Greeting of men to women, and women to men",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5990,
                "hadithNumber": "6249",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"O `Aisha! This is Gabriel sending his greetings to you.\" I said, \"Peace, and Allah's Mercy be on him (Gabriel). You see what we do not see.\" (She was addressing Allah's Apostle). Shoaib has reported likewise Younus and Nouman said:  Zuhri's report add ''وَبَرَكَاتُهُ‏''",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اے عائشہ ! یہ جبرائیل ہیں تمہیں سلام کہتے ہیں بیان کیا کہ میں نے عرض کیا وعلیہ السلا م و رحمت اللہ ، آپ دیکھتے ہیں جو ہم نہیں دیکھ سکتے ام المؤمنین کا اشارہ آنحضرت صلی اللہ علیہ وسلم کی طرف تھا ۔ معمر کے ساتھ اس حدیث کو شعیب اور یونس اور نعمان نے بھی زہری سے روایت کیا ہے یونس اور نعمان کی روایتوں میں و برکاتہ کا لفظ زیادہ ہے",
                "urduNarrator": "ہم سے ابن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو معمر نے خبر دی انہیں زہری نے انہیں ابوسلمہ بن عبدالرحمٰن نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَا عَائِشَةُ هَذَا جِبْرِيلُ يَقْرَأُ عَلَيْكِ السَّلاَمَ ‏\"‏‏.‏ قَالَتْ قُلْتُ وَعَلَيْهِ السَّلاَمُ وَرَحْمَةُ اللَّهِ، تَرَى مَا لاَ نَرَى‏.‏ تُرِيدُ رَسُولَ اللَّهِ صلى الله عليه وسلم‏.‏ تَابَعَهُ شُعَيْبٌ‏.‏ وَقَالَ يُونُسُ وَالنُّعْمَانُ عَنِ الزُّهْرِيِّ وَبَرَكَاتُهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5991,
                "hadithNumber": "6250",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "I came to the Prophet (ﷺ) in order to consult him regarding my father's debt. When I knocked on the door, he asked, \"Who is that?\" I replied, \"I\" He said, \"I, I?\" He repeated it as if he disliked it.",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں اس قرض کے بارے میں حاضر ہوا جو میرے والد پر تھا ۔ میں دروازہ کھٹکھٹایا ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، کون ہیں ؟ میں نے کہا ” میں “ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ” میں “ ” میں “ جیسے آپ نے اس جواب کو ناپسند فرمایا ۔",
                "urduNarrator": "ہم سے ابو الولید ہشام بن عبدالملک نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے محمد بن منکدر نے کہا کہ میں نے حضرت جابر رضی اللہ عنہ سے سنا ، وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرًا ـ رضى الله عنه ـ يَقُولُ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي دَيْنٍ كَانَ عَلَى أَبِي فَدَقَقْتُ الْبَابَ فَقَالَ ‏\"‏ مَنْ ذَا ‏\"‏‏.‏ فَقُلْتُ أَنَا‏.‏ فَقَالَ ‏\"‏ أَنَا أَنَا ‏\"‏‏.‏ كَأَنَّهُ كَرِهَهَا‏.‏",
                "headingArabic": "إِذَا قَالَ مَنْ ذَا فَقَالَ أَنَا",
                "headingUrdu": "پوچھا کون ہے؟",
                "headingEnglish": "Asking, \"Who is that?\"",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5992,
                "hadithNumber": "6251",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "A man entered the mosque while Allah's Messenger (ﷺ) was sitting in one side of the mosque. The man prayed, came, and greeted the Prophet. Allah's Messenger (ﷺ) said to him, \"Wa 'Alaikas Salam (returned his greeting). Go back and pray as you have not prayed (properly).\" The man returned, repeated his prayer, came back and greeted the Prophet. The Prophet (ﷺ) said, \"Wa alaika-s-Salam (returned his greeting). Go back and pray again as you have not prayed (properly).\" The man said at the second or third time, \"O Allah's Messenger (ﷺ)! Kindly teach me how to pray\". The Prophet (ﷺ) said, \"When you stand for prayer, perform ablution properly and then face the Qibla and say Takbir (Allahu-Akbar), and then recite what you know from the Qur'an, and then bow with calmness till you feel at ease then rise from bowing, till you stand straight, and then prostrate calmly (and remain in prostration) till you feel at ease, and then raise (your head) and sit with calmness till you feel at ease and then prostrate with calmness (and remain in prostration) till you feel at ease, and then raise (your head) and sit with calmness till you feel at ease in the sitting position, and do likewise in whole of your prayer.\" And Abu Usama added, \"Till you stand straight.\" (See Hadith No. 759, Vol.1)",
                "hadithUrdu": "ایک شخص مسجد میں داخل ہوا ، رسول اللہ صلی اللہ علیہ وسلم مسجد کے کنارے بیٹھے ہوئے تھے ۔ اس نے نماز پڑھی اور پھر حاضر ہو کر آنحضرت صلی اللہ علیہ وسلم کو سلام کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ” علیک السلام “ واپس جا اور دوبارہ نماز پڑھ ، کیو نکہ تم نے نماز نہیں پڑھی ۔ وہ واپس گئے اور نماز پڑھی ۔ پھر ( نبی کریم صلی اللہ علیہ وسلم ) کے پاس آئے اور سلام کیا آپ نے فرمایا وعلیک السلام ۔ واپس جاؤ پھر نماز پڑھو ۔ کیو نکہ تم نے نماز نہیں پڑھی ۔ وہ واپس گیا اور اس نے پھر نماز پڑھی ۔ پھر واپس آیا اور نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں سلام عرض کیا ۔ آپ صلی اللہ علیہ وسلم نے جواب میں فر مایا وعلیکم السلام ۔ واپس جاؤ اور دو بارہ نمازپڑھو ۔ کیو نکہ تم نے نماز نہیں پڑھی ۔ ان صاحب نے دوسر ی مرتبہ ، یا اس کے بعد ، عرض کیا یا رسول اللہ ! مجھے نماز پڑھنی سکھا دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فر مایا جب نماز کے لیے کھڑے ہواکرو تو پہلے پو ری طرح وضو کیا کرو ، پھر قبلہ رو ہو کر تکبیر ( تحریمہ ) کہو ، اس کے بعد قر آن مجید میں سے جو تمہارے لئے آسان ہو وہ پڑھو ، پھر رکوع کرو اور جب رکوع کی حالت میں برابر ہو جاؤ تو سر اٹھاؤ ۔ جب سیدھے کھڑے ہو جاؤ تو پھر سجدہ میں جاؤ ، جب سجدہ پو ری طرح کر لو تو سر اٹھاؤ اور اچھی طرح سے بیٹھ جاؤ ۔ یہی عمل اپنی ہر رکعت میں کرو ۔ اور ابواسامہ راوی نے دوسرے سجدہ کے بعد یوں کہا پھر سر اٹھا یہاں تک کہ سید ھا کھڑا ہو جا ۔",
                "urduNarrator": "ہم سے اسحٰق بن منصور نے بیان کیا انہوں نے کہا ہم کو عبداللہ بن نمیر نے خبر دی ، ان سے عبیداللہ نے بیان کیا ، ان سے سعید بن ابی سعید مقبری نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه أَنَّ رَجُلاً، دَخَلَ الْمَسْجِدَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ فِي نَاحِيَةِ الْمَسْجِدِ فَصَلَّى، ثُمَّ جَاءَ فَسَلَّمَ عَلَيْهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَعَلَيْكَ السَّلاَمُ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏‏.‏ فَرَجَعَ فَصَلَّى، ثُمَّ جَاءَ فَسَلَّمَ‏.‏ فَقَالَ ‏\"‏ وَعَلَيْكَ السَّلاَمُ فَارْجِعْ فَصَلِّ، فَإِنَّكَ لَمْ تُصَلِّ ‏\"‏‏.‏ فَقَالَ فِي الثَّانِيَةِ أَوْ فِي الَّتِي بَعْدَهَا عَلِّمْنِي يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ إِذَا قُمْتَ إِلَى الصَّلاَةِ فَأَسْبِغِ الْوُضُوءَ، ثُمَّ اسْتَقْبِلِ الْقِبْلَةَ فَكَبِّرْ، ثُمَّ اقْرَأْ بِمَا تَيَسَّرَ مَعَكَ مِنَ الْقُرْآنِ، ثُمَّ ارْكَعْ حَتَّى تَطْمَئِنَّ رَاكِعًا، ثُمَّ ارْفَعْ حَتَّى تَسْتَوِيَ قَائِمًا، ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا، ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ جَالِسًا، ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا، ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ جَالِسًا، ثُمَّ افْعَلْ ذَلِكَ فِي صَلاَتِكَ كُلِّهَا ‏\"‏‏.‏ وَقَالَ أَبُو أُسَامَةَ فِي الأَخِيرِ ‏\"‏ حَتَّى تَسْتَوِيَ قَائِمًا ‏\"‏‏.‏",
                "headingArabic": "مَنْ رَدَّ فَقَالَ عَلَيْكَ السَّلاَمُ",
                "headingUrdu": "سلام کا جواب دینے کے لیے \"السلام علیکم\"",
                "headingEnglish": "To reply a greeting saying, \"Alaikas-Salam\"",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5993,
                "hadithNumber": "6252",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"And then raise your head till you feel at ease while sitting. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فر مایا ، پھر سر سجدہ سے اٹھا اور اچھی طرح بیٹھ جا ۔",
                "urduNarrator": "ہم سے ابن بشار نے بیان کیا ، کہا کہ مجھ سے یحییٰ نے بیان کیا ، ان سے عبیداللہ نے ، ان سے سعید نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضر ت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ بَشَّارٍ، قَالَ حَدَّثَنِي يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، حَدَّثَنِي سَعِيدٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ جَالِسًا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5994,
                "hadithNumber": "6253",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) said to her, \"Gabriel sends Salam (greetings) to you.\" She replied, \"Wa 'alaihi-s- Salam Wa Rahmatu-l-lah.\" (Peace and Allah's Mercy be on him).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اس سے فرمایا کہ جبرائیل علیہ السلام تمہیں سلام کہتے ہیں ۔ عائشہ رضی اللہ عنہا نے کہا کہ ” وعلیہ السلام ورحمۃ اللہ ۔ ان پر بھی اللہ کی طرف سے سلامتی اور اس کی رحمت نازل ہو ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے زکریا نے بیان کیا ، کہا کہ میں نے عامر سے سنا ، انہوں نے بیان کیا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، قَالَ سَمِعْتُ عَامِرًا، يَقُولُ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ حَدَّثَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهَا ‏ \"‏ إِنَّ جِبْرِيلَ يُقْرِئُكِ السَّلاَمَ ‏\"‏‏.‏ قَالَتْ وَعَلَيْهِ السَّلاَمُ وَرَحْمَةُ اللَّهِ‏.‏",
                "headingArabic": "إِذَا قَالَ فُلاَنٌ يُقْرِئُكَ السَّلاَمَ",
                "headingUrdu": "اگر کوئی کہے کہ \"فلاں تم پر سلام بھیجتا ہے\"",
                "headingEnglish": "If one says, \"So-and-so sends Salam to you\"",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5995,
                "hadithNumber": "6254",
                "englishNarrator": "Narrated Usama bin Zaid رضی اللہ عنہ :",
                "hadithEnglish": "\"The Prophet (ﷺ) rode over a donkey with a saddle underneath which there was a thick soft Fadakiya velvet sheet. Usama bin Zaid  رضی اللہ عنہ was his companion rider, and he was going to pay a visit to Sa`d bin Ubada رضی اللہ عنہ (who was sick) at the dwelling place of Bani Al-Harith bin Al-Khazraj, and this incident happened before the battle of Badr. The Prophet (ﷺ) passed by a gathering in which there were Muslims and pagan idolators and Jews, and among them there was `Abdullah bin Ubai bin Salul, and there was `Abdullah bin Rawaha too. When a cloud of dust raised by the animal covered that gathering, `Abdullah bin Ubai covered his nose with his Rida (sheet) and said (to the Prophet), \"Don't cover us with dust.\" The Prophet (ﷺ) greeted them and then stopped, dismounted and invited them to Allah (i.e., to embrace Islam) and also recited to them the Holy Qur'an. `Abdullah bin Ubai' bin Salul said, \"O man! There is nothing better than what you say, if what you say is the truth. So do not trouble us in our gatherings. Go back to your mount (or house,) and if anyone of us comes to you, tell (your tales) to him.\" On that `Abdullah bin Rawaha said, \"(O Allah's Messenger (ﷺ)!) Come to us and bring it(what you want to say) in our gatherings, for we love that.\" So the Muslims, the pagans and the Jews started quarreling till they were about to fight and clash with one another. The Prophet (ﷺ) kept on quietening them (till they all became quiet). He then rode his animal, and proceeded till he entered upon Sa`d bin 'Ubada رضی اللہ عنہ , he said, \"O Sa`d, didn't you hear what Abu Habbab said? (He meant `Abdullah bin Ubai). He said so-and-so.\" Sa`d bin 'Ubada said, \"O Allah's Messenger (ﷺ)! Excuse and forgive him, for by Allah, Allah has given you what He has given you. The people of this town decided to crown him (as their chief) and make him their king. But when Allah prevented that with the Truth which He had given you, it choked him, and that was what made him behave in the way you saw him behaving.\" So the Prophet excused him.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک گدھے پر سوار ہوئے جس پر پالان بندھا ہوا تھا اور نیچے فد ک کی بنی ہوئی ایک مخملی چادر بچھی ہوئی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے سواری پر اپنے پیچھے اسامہ بن زید رضی اللہ عنہ کو بٹھایا تھا ۔ آپ بنی حارث بن خزرج میں حضرت سعد بن عبادہ رضی اللہ عنہ کی عیادت کے لئے تشریف لے جا رہے تھے ۔ یہ جنگ بدر سے پہلے کا واقعہ ہے ۔ آنحضرت صلی اللہ علیہ وسلم ایک مجلس پر سے گزرے جس میں مسلمان بت پرست مشرک اور یہودی سب ہی شریک تھے ۔ عبداللہ بن ابی ابن سلول بھی ان میں تھا ۔ مجلس میں عبداللہ بن رواحہ بھی موجود تھے ۔ جب مجلس پر سواری کا گرد پڑا تو عبداللہ نے اپنی چادر سے اپنی ناک چھپا لی اور کہا کہ ہمارے اوپر غبار نہ اڑاؤ ۔ پھر حضور اکرم صلی اللہ علیہ وسلم نے سلام کیا اور وہاں رک گئے اور اتر کر انہیں اللہ کی طرف بلایا اور ان کے لئے قرآن مجید کی تلاو ت کی ۔ عبداللہ بن ابی ابن سلول بولا ، میاں میں ان باتوں کے سمجھنے سے قاصر ہوں اگر وہ چیز حق ہے جو تم کہتے ہو تو ہماری مجلسوں میں آ کر ہمیں تکلیف نہ دیا کرو ۔ اس پر ابن رواحہ نے کہا آنحضرت صلی اللہ علیہ وسلم ہماری مجلسوں میں تشریف لایا کریں کیونکہ ہم اسے پسند کرتے ہیں ۔ پھر مسلمانوں مشرکوں اور یہودیوں میں اس بات پر تو تو میں میں ہونے لگی اور قریب تھا کہ وہ کوئی ارادہ کربیٹھیں اور ایک دوسرے پر حملہ کر دیں ۔ لیکن آنحضرت صلی اللہ علیہ وسلم انہیں برابر خاموش کراتے رہے اور جب وہ خاموش ہو گئے تو آنحضرت صلی اللہ علیہ وسلم اپنی سواری پر بیٹھ کر سعد بن عبادہ رضی اللہ عنہ کے یہاں گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا ، سعد تم نے نہیں سنا کہ ابو حباب نے آج کیا بات کہی ہے ۔ آپ کا اشارہ عبداللہ بن ابی کی طرف تھا کہ اس نے یہ یہ باتیں کہی ہیں ۔ حضرت سعد نے عرض کیا کہ یا رسول اللہ ! اسے معاف کر دیجئیے اور درگزر فرمائیے ۔ اللہ تعالیٰ نے وہ حق آپ کو عطا فرمایا ہے جو عطا فرمانا تھا ۔ اس بستی ( مدینہ منورہ ) کے لوگ ( آپ کی تشریف آوری سے پہلے ) اس پر متفق ہو گئے تھے کہ اسے تاج پہنا دیں اور شاہی عمامہ اس کے سر پر باندھ دیں لیکن جب اللہ تعالیٰ نے اس منصوبہ کو اس حق کی وجہ سے ختم کر دیا جو اس نے آپ کو عطا فرمایا ہے تو اسے حق سے حسد ہو گیا اور اسی وجہ سے اس نے یہ معاملہ کیا ہے جو آپ نے دیکھا ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے اسے معاف کر دیا ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں معمر نے ، انہیں زہری نے ، ان سے عروہ بن زبیر نے بیان کیا کہ مجھے اسامہ بن زید رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، قَالَ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَكِبَ حِمَارًا عَلَيْهِ إِكَافٌ، تَحْتَهُ قَطِيفَةٌ فَدَكِيَّةٌ، وَأَرْدَفَ وَرَاءَهُ أُسَامَةَ بْنَ زَيْدٍ وَهْوَ يَعُودُ سَعْدَ بْنَ عُبَادَةَ فِي بَنِي الْحَارِثِ بْنِ الْخَزْرَجِ، وَذَلِكَ قَبْلَ وَقْعَةِ بَدْرٍ حَتَّى مَرَّ فِي مَجْلِسٍ فِيهِ أَخْلاَطٌ مِنَ الْمُسْلِمِينَ وَالْمُشْرِكِينَ عَبَدَةِ الأَوْثَانِ وَالْيَهُودِ، وَفِيهِمْ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ، وَفِي الْمَجْلِسِ عَبْدُ اللَّهِ بْنُ رَوَاحَةَ، فَلَمَّا غَشِيَتِ الْمَجْلِسَ عَجَاجَةُ الدَّابَّةِ خَمَّرَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ أَنْفَهُ بِرِدَائِهِ ثُمَّ قَالَ لاَ تُغَبِّرُوا عَلَيْنَا‏.‏ فَسَلَّمَ عَلَيْهِمُ النَّبِيُّ صلى الله عليه وسلم ثُمَّ وَقَفَ فَنَزَلَ، فَدَعَاهُمْ إِلَى اللَّهِ وَقَرَأَ عَلَيْهِمُ الْقُرْآنَ فَقَالَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ أَيُّهَا الْمَرْءُ لاَ أَحْسَنَ مِنْ هَذَا، إِنْ كَانَ مَا تَقُولُ حَقًّا، فَلاَ تُؤْذِنَا فِي مَجَالِسِنَا، وَارْجِعْ إِلَى رَحْلِكَ، فَمَنْ جَاءَكَ مِنَّا فَاقْصُصْ عَلَيْهِ‏.‏ قَالَ ابْنُ رَوَاحَةَ اغْشَنَا فِي مَجَالِسِنَا، فَإِنَّا نُحِبُّ ذَلِكَ‏.‏ فَاسْتَبَّ الْمُسْلِمُونَ وَالْمُشْرِكُونَ وَالْيَهُودُ حَتَّى هَمُّوا أَنْ يَتَوَاثَبُوا، فَلَمْ يَزَلِ النَّبِيُّ صلى الله عليه وسلم يُخَفِّضُهُمْ، ثُمَّ رَكِبَ دَابَّتَهُ حَتَّى دَخَلَ عَلَى سَعْدِ بْنِ عُبَادَةَ فَقَالَ ‏ \"‏ أَىْ سَعْدُ أَلَمْ تَسْمَعْ مَا قَالَ أَبُو حُبَابٍ ‏\"‏‏.‏ يُرِيدُ عَبْدَ اللَّهِ بْنَ أُبَىٍّ قَالَ كَذَا وَكَذَا قَالَ اعْفُ عَنْهُ يَا رَسُولَ اللَّهِ وَاصْفَحْ فَوَاللَّهِ لَقَدْ أَعْطَاكَ اللَّهُ الَّذِي أَعْطَاكَ، وَلَقَدِ اصْطَلَحَ أَهْلُ هَذِهِ الْبَحْرَةِ عَلَى أَنْ يُتَوِّجُوهُ فَيُعَصِّبُونَهُ بِالْعِصَابَةِ، فَلَمَّا رَدَّ اللَّهُ ذَلِكَ بِالْحَقِّ الَّذِي أَعْطَاكَ شَرِقَ بِذَلِكَ، فَذَلِكَ فَعَلَ بِهِ مَا رَأَيْتَ، فَعَفَا عَنْهُ النَّبِيُّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "التَّسْلِيمِ فِي مَجْلِسٍ فِيهِ أَخْلاَطٌ مِنَ الْمُسْلِمِينَ وَالْمُشْرِكِينَ",
                "headingUrdu": "اختلاط کی محفل کو سلام",
                "headingEnglish": "Greeting a mix-up gathering",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5996,
                "hadithNumber": "6255",
                "englishNarrator": "Narrated Ka`b bin Malik:",
                "hadithEnglish": "Allah's Messenger (ﷺ) forbade all the Muslims to speak to us. I would come to Allah's Messenger (ﷺ) and greet him, and I would wonder whether the Prophet (ﷺ) did move his lips to return to my greetings or not till fifty nights passed away. The Prophet (ﷺ) then announced (to the people) Allah's forgiveness for us (acceptance of our repentance) at the time when he had offered the Fajr (morning) prayer.",
                "hadithUrdu": "جب وہ غزوہ تبوک میں شریک نہیں ہو سکے تھے اور نبی کریم صلی اللہ علیہ وسلم نے ہم سے بات چیت کرنے کی ممانعت کر دی تھی اور میں آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر سلام کرتا تھا اور یہ اندازہ لگاتاتھا کہ آنحضرت صلی اللہ علیہ وسلم نے جواب سلام میں ہونٹ مبارک ہلائے یا نہیں ، آخر پچاس دن گزرگئے اور آنحضرت صلی اللہ علیہ وسلم نے اللہ کی بارگاہ میں ہماری توبہ کے قبول کئے جانے کا نماز فجر کے بعد اعلان کیا ۔",
                "urduNarrator": "ہم سے ابن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے عبدالرحمٰن بن عبداللہ نے اور ان سے عبداللہ بن کعب نے بیان کیا کہ میں نے کعب بن مالک سے سنا ، وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، يُحَدِّثُ حِينَ تَخَلَّفَ عَنْ تَبُوكَ، وَنَهَى، رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ كَلاَمِنَا، وَآتِي رَسُولَ اللَّهِ صلى الله عليه وسلم فَأُسَلِّمُ عَلَيْهِ، فَأَقُولُ فِي نَفْسِي هَلْ حَرَّكَ شَفَتَيْهِ بِرَدِّ السَّلاَمِ أَمْ لاَ حَتَّى كَمَلَتْ خَمْسُونَ لَيْلَةً، وَآذَنَ النَّبِيُّ صلى الله عليه وسلم بِتَوْبَةِ اللَّهِ عَلَيْنَا حِينَ صَلَّى الْفَجْرَ‏.‏",
                "headingArabic": "مَنْ لَمْ يُسَلِّمْ عَلَى مَنِ اقْتَرَفَ ذَنْبًا وَلَمْ يَرُدَّ سَلاَمَهُ حَتَّى تَتَبَيَّنَ تَوْبَتُه، وَإِلَى مَتَى تَتَبَيَّنُ تَوْبَةُ الْعَاصِي",
                "headingUrdu": "وہ شخص جو کسی گناہ کے مرتکب کو سلام نہیں کرتا",
                "headingEnglish": "He who does not greet a person who has committed a sin",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5997,
                "hadithNumber": "6256",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "A group of Jews came to Allah's Messenger (ﷺ) and said, \"As-samu 'Alaika \" (Death be on you), and I understood it and said to them, \"Alaikum AsSamu wa-l-la'na (Death and curse be on you).\" Allah's Apostle said, \"Be calm! O `Aisha, for Allah loves that one should be kind and lenient in all matters.\" I said. \"O Allah's Messenger (ﷺ)! Haven't you heard what they have said?\" Allah's Messenger (ﷺ) said, \"I have (already) said (to them), 'Alaikum (upon you).' \"",
                "hadithUrdu": "کچھ یہودی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہا کہ ” السام علیک “ ( تمہیں موت آئے ) میں ان کی بات سمجھ گئی اور میں نے جواب دیا ” علیکم السام واللعنۃ “ آنحضرت صلی اللہ علیہ وسلم نے فرمایا عائشہ صبر سے کام لے کیونکہ اللہ تعالیٰ تمام معاملات میں نرمی کو پسند کرتا ہے ، میں نے عرض کیا یا رسول اللہ ! کیا آپ نے نہیں سنا کہ انہوں نے کیا کہا تھا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں نے ان کو جواب دے دیا تھا کہ ” وعلیکم “ ( اور تمہیں بھی )",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، انہوں نے کہا کہ مجھے عروہ نے خبر دی ، اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَ رَهْطٌ مِنَ الْيَهُودِ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا السَّامُ عَلَيْكَ‏.‏ فَفَهِمْتُهَا فَقُلْتُ عَلَيْكُمُ السَّامُ وَاللَّعْنَةُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَهْلاً يَا عَائِشَةُ، فَإِنَّ اللَّهَ يُحِبُّ الرِّفْقَ فِي الأَمْرِ كُلِّهِ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَوَلَمْ تَسْمَعْ مَا قَالُوا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَقَدْ قُلْتُ وَعَلَيْكُمْ ‏\"‏‏.‏",
                "headingArabic": "كَيْفَ يُرَدُّ عَلَى أَهْلِ الذِّمَّةِ السَّلاَمُ",
                "headingUrdu": "ذمی کا سلام واپس کرنے کا طریقہ",
                "headingEnglish": "How to return the greeting of Dhimmi",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5998,
                "hadithNumber": "6257",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما:",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"When the Jews greet you, they usually say, 'As-Samu 'alaikum (Death be on you),' so you should say (in reply to them), 'Wa'alaikum (And on you).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تمہیں یہودی سلام کریں اور اگر ان میں سے کوئی ” السام علیک “ کہے تو تم اس کے جواب میں صرف ” وعلیک “ ( اور تمہیں بھی ) کہہ دیا کرو ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں عبداللہ بن دینار نے اور ان سے عبداللہ بن عمر رضی اللہ عنہمانے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا سَلَّمَ عَلَيْكُمُ الْيَهُودُ فَإِنَّمَا يَقُولُ أَحَدُهُمُ السَّامُ عَلَيْكَ‏.‏ فَقُلْ وَعَلَيْكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5999,
                "hadithNumber": "6258",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If the people of the Scripture greet you, then you should say (in reply), 'Wa'alaikum (And on you).' \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب اہل کتاب تمہیں سلام کریں تو تم اس کے جواب میں صرف ” وعلیکم “ کہو ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، انہوں نے کہا ہم سے ہشم نے بیان کیا ، انہیں عبداللہ بن ابی بکر بن انس نے خبر دی ، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ أَنَسٍ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِذَا سَلَّمَ عَلَيْكُمْ أَهْلُ الْكِتَابِ فَقُولُوا وَعَلَيْكُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6000,
                "hadithNumber": "6259",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent me, Az-Zubair bin Al-Awwam and Abu Marthad Al-Ghanawi, and all of us were horsemen, and he said, \"Proceed till you reach Rawdat Khakh, where there is a woman from the pagans carrying a letter sent by Hatib bin Abi Balta'a to the pagans (of Mecca).\" So we overtook her while she was proceeding on her camel at the same place as Allah's Messenger (ﷺ) told us. We said (to her) \"Where is the letter which is with you?\" She said, \"I have no letter with me.\" So we made her camel kneel down and searched her mount (baggage etc) but could not find anything. My two companions said, \"We do not see any letter.\" I said, \"I know that Allah's Messenger (ﷺ) did not tell a lie. By Allah, if you (the lady) do not bring out the letter, I will strip you of your clothes' When she noticed that I was serious, she put her hand into the knot of her waist sheet, for she was tying a sheet round herself, and brought out the letter. So we proceeded to Allah's Messenger (ﷺ) with the letter. The Prophet (ﷺ) said (to Habib), \"What made you o what you have done, O Hatib?\" Hatib replied, \"I have done nothing except that I believe in Allah and His Apostle, and I have not changed or altered (my religion). But I wanted to do the favor to the people (pagans of Mecca) through which Allah might protect my family and my property, as there is none among your companions but has someone in Mecca through whom Allah protects his property (against harm). The Prophet (ﷺ) said, \"Habib has told you the truth, so do not say to him (anything) but good.\" `Umar bin Al-Khattab رضی اللہ عنہ said, \"Verily he has betrayed Allah, His Apostle, and the believers! Allow me to chop his neck off!\" The Prophet (ﷺ) said, \"O `Umar! What do you know; perhaps Allah looked upon the Badr warriors and said, 'Do whatever you like, for I have ordained that you will be in Paradise.'\" On that `Umar رضی اللہ عنہ wept and said, \"Allah and His Apostle know best.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے مجھے زبیر بن عوام اور ابو مرثد غنوی کو بھیجا ۔ ہم سب گھوڑ سوار تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ اور جب ” روضہ خاخ “ ( مکہ اور مدینہ کے درمیان ایک مقام ) پر پہنچو تو وہاں تمہیں مشرکین کی ایک عورت ملے گی اس کے پاس حاطب بن ابی بلتعہ کا ایک خط ہے جو مشرکین کے پاس بھیجا گیا ہے ( اسے لے آؤ ) بیان کیا کہ ہم نے اس عورت کو پا لیا وہ اپنے اونٹ پر جا رہی تھی اور وہیں پر ملی ( جہاں ) آنحضرت صلی اللہ علیہ وسلم نے بتایا تھا ۔ بیان کیا کہ ہم نے اس سے کہا کہ خط جو تم ساتھ لے جا رہی ہو وہ کہاں ہے ؟ اس نے کہا کہ میرے پاس کوئی خط نہیں ہے ۔ ہم نے اس کے اونٹ کو بٹھایا اور اس کے کجاوہ میں تلاشی لی لیکن ہمیں کوئی چیز نہیں ملی ۔ میرے دونوں ساتھیوں نے کہا کہ ہمیں کوئی خط تو نظر آتا نہیں ۔ بیان کیا کہ میں نے کہا ، مجھے یقین ہے کہ حضور اکرم صلی اللہ علیہ وسلم نے غلط بات نہیں کہی ہے ۔ قسم ہے اس کی جس کی قسم کھائی جاتی ہے ، تم خط نکالوورنہ میں تمہیں ننگا کر دوں گا ۔ بیان کیا کہ جب اس عورت نے دیکھا کہ میں واقعی اس معاملہ میں سنجیدہ ہوں تو اس نے ازارباندھنے کی جگہ کی طرف ہاتھ بڑھایا ، وہ ایک چادر ازار کے طور پر باندھے ہوئے تھی اور خط نکالا ۔ بیان کیا کہ ہم اسے لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، حاطب تم نے ایسا کیوں کیا ؟ انہوں نے کہا کہ میں اب بھی اللہ اور اس کے رسول پرایمان رکھتاہوں ۔ میرے اندر کوئی تغیر وتبدیلی نہیں آئی ہے ، میرا مقصد ( خط بھیجنے سے ) صرف یہ تھا کہ ( قریش پر آپ کی فوج کشی کی اطلاع دوں اور اس طرح ) میرا ان لوگوں پر احسان ہو جائے اور اس کی وجہ سے اللہ میرے اہل اور مال کی طرف سے ( ان سے ) مدافعت کرائے ۔ آپ کے جتنے مہاجر صحابہ ہیں ان کے مکہ مکرمہ میں ایسے افرادہیں جن کے ذریعہ اللہ ان کے مال اور ان کے گھر والوں کی حفاظت کرائے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا انہوں نے سچ کہ دیا ہے اب تم لوگ ان کے بارے میں سوا بھلائی کے اور کچھ نہ کہو بیان کیا کہ اس پر عمر بن خطاب رضی اللہ عنہ نے فرمایا کہ اس شخص نے اللہ اور اس کے رسول اور مومنوں کے ساتھ خیانت کی مجھے اجازت دیجئیے کہ میں اس کی گردن مار دوں بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا عمر ! تمہیں کیا معلوم ، اللہ تعالیٰ بدر کی لڑائی میں شریک صحابہ کی زندگی پر مطلع تھا اور اس کے با وجود کہا کہ تم جو چاہو کرو ، تمہارے لئے جنت لکھ دی گئی ہے ؛؛ بیان کیا کہ اس پر عمر رضی اللہ عنہ کی آنکھیں اشک آلود ہو گئیں اور عرض کیا اللہ اور اس کے رسول ہی زیادہ جاننے والے ہیں",
                "urduNarrator": "ہم سے یوسف بن بہلول نے بیان کیا ، کہا ہم سے ابن ادریس نے بیان کیا ، کہا کہ مجھ سے حصین بن عبدالرحمٰن نے بیان کیا ، ان سے سعد بن عبیدہ نے ، ان سے ابوعبدالرحمن سلمی نے اور ان سے حضرت علی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يُوسُفُ بْنُ بُهْلُولٍ، حَدَّثَنَا ابْنُ إِدْرِيسَ، قَالَ حَدَّثَنِي حُصَيْنُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَالزُّبَيْرَ بْنَ الْعَوَّامِ وَأَبَا مَرْثَدٍ الْغَنَوِيَّ وَكُلُّنَا فَارِسٌ فَقَالَ ‏\"‏ انْطَلِقُوا حَتَّى تَأْتُوا رَوْضَةَ خَاخٍ، فَإِنَّ بِهَا امْرَأَةً مِنَ الْمُشْرِكِينَ مَعَهَا صَحِيفَةٌ مِنْ حَاطِبِ بْنِ أَبِي بَلْتَعَةَ إِلَى الْمُشْرِكِينَ ‏\"‏‏.‏ قَالَ فَأَدْرَكْنَاهَا تَسِيرُ عَلَى جَمَلٍ لَهَا حَيْثُ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ قُلْنَا أَيْنَ الْكِتَابُ الَّذِي مَعَكِ قَالَتْ مَا مَعِي كِتَابٌ‏.‏ فَأَنَخْنَا بِهَا، فَابْتَغَيْنَا فِي رَحْلِهَا فَمَا وَجَدْنَا شَيْئًا، قَالَ صَاحِبَاىَ مَا نَرَى كِتَابًا‏.‏ قَالَ قُلْتُ لَقَدْ عَلِمْتُ مَا كَذَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالَّذِي يُحْلَفُ بِهِ لَتُخْرِجِنَّ الْكِتَابَ أَوْ لأُجَرِّدَنَّكِ‏.‏ قَالَ فَلَمَّا رَأَتِ الْجِدَّ مِنِّي أَهْوَتْ بِيَدِهَا إِلَى حُجْزَتِهَا وَهْىَ مُحْتَجِزَةٌ بِكِسَاءٍ فَأَخْرَجَتِ الْكِتَابَ ـ قَالَ ـ فَانْطَلَقْنَا بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا حَمَلَكَ يَا حَاطِبُ عَلَى مَا صَنَعْتَ ‏\"‏‏.‏ قَالَ مَا بِي إِلاَّ أَنْ أَكُونَ مُؤْمِنًا بِاللَّهِ وَرَسُولِهِ، وَمَا غَيَّرْتُ وَلاَ بَدَّلْتُ، أَرَدْتُ أَنْ تَكُونَ لِي عِنْدَ الْقَوْمِ يَدٌ يَدْفَعُ اللَّهُ بِهَا عَنْ أَهْلِي وَمَالِي، وَلَيْسَ مِنْ أَصْحَابِكَ هُنَاكَ إِلاَّ وَلَهُ مَنْ يَدْفَعُ اللَّهُ بِهِ عَنْ أَهْلِهِ وَمَالِهِ‏.‏ قَالَ ‏\"‏ صَدَقَ فَلاَ تَقُولُوا لَهُ إِلاَّ خَيْرًا ‏\"‏‏.‏ قَالَ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ إِنَّهُ قَدْ خَانَ اللَّهَ وَرَسُولَهُ وَالْمُؤْمِنِينَ، فَدَعْنِي فَأَضْرِبَ عُنُقَهُ‏.‏ قَالَ فَقَالَ ‏\"‏ يَا عُمَرُ وَمَا يُدْرِيكَ لَعَلَّ اللَّهَ قَدِ اطَّلَعَ عَلَى أَهْلِ بَدْرٍ فَقَالَ اعْمَلُوا مَا شِئْتُمْ فَقَدْ وَجَبَتْ لَكُمُ الْجَنَّةُ ‏\"‏‏.‏ قَالَ فَدَمَعَتْ عَيْنَا عُمَرَ وَقَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏",
                "headingArabic": "مَنْ نَظَرَ فِي كِتَابِ مَنْ يُحْذَرُ عَلَى الْمُسْلِمِينَ لِيَسْتَبِينَ أَمْرُهُ",
                "headingUrdu": "وہ جو کسی خط کو اس کے تحریری مواد کو جاننے کے لیے دیکھتا ہے۔",
                "headingEnglish": "The one who looks at a letter in order to know its written contents",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6001,
                "hadithNumber": "6260",
                "englishNarrator": "Narrated Abu Sufyan bin Harb رضی اللہ عنہ :",
                "hadithEnglish": "Heraclius had sent for him to come along with a group of the Quraish who were trading in Sha'm, and they came to him. Then Abu Sufyan mentioned the whole narration and said, \"Heraclius asked for the letter of Allah's Messenger (ﷺ) . When the letter was read, its contents were as follows: 'In the name of Allah, the Beneficent, the Merciful. From Muhammad, Allah's slave and His Apostle to Heraclius, the Chief of Byzantines: Peace be upon him who follows the right path (guidance)! Amma ba'du (to proceed )...' (See Hadith No 6, Vol 1 for details)",
                "hadithUrdu": "ہرقل نے قریش کے چند افراد کے ساتھ انہیں بھی بلا بھیجا یہ لوگ شام تجارت کی غرض سے گئے تھے سب لوگ ہرقل کے پاس آئے پھر انہوں نے واقعہ بیان کیا کہ پھر ہرقل نے رسول اللہ صلی اللہ علیہ وسلم کا خط منگوایا اور وہ پڑھا گیا خط میں یہ لکھا ہوا تھا ۔ بسم اللہ الرحمن الرحیم محمد کی طرف سے جو اللہ کا بندہ اور اس کا رسول ہے ( صلی اللہ علیہ وسلم ) ہرقل عظیم روم کی طرف ، سلام ہو ان پر جنہوں نے ہدایت کی اتباع کی ۔ امابعد !",
                "urduNarrator": "ہم سے محمد بن مقاتل ابوالحسن نے بیان کیا انہوں نے کہا ہم کو عبداللہ نے خبر دی انہوں نے کہا ہم کو یونس نے خبر دی اور ان سے زہری نے بیان کیا انہیں عبیداللہ بن عبداللہ بن عتبہ نے خبر دی انہیں حضرت عبداللہ بن عباس رضی اللہ عنہما نے خبر دی اور انہیں ابوسفیان بن حرب رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ أَبَا سُفْيَانَ بْنَ حَرْبٍ أَخْبَرَهُ أَنَّ هِرَقْلَ أَرْسَلَ إِلَيْهِ فِي نَفَرٍ مِنْ قُرَيْشٍ وَكَانُوا تِجَارًا بِالشَّأْمِ، فَأَتَوْهُ فَذَكَرَ الْحَدِيثَ قَالَ ثُمَّ دَعَا بِكِتَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُرِئَ فَإِذَا فِيهِ ‏ \"‏ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ، مِنْ مُحَمَّدٍ عَبْدِ اللَّهِ وَرَسُولِهِ إِلَى هِرَقْلَ عَظِيمِ الرُّومِ، السَّلاَمُ عَلَى مَنِ اتَّبَعَ الْهُدَى، أَمَّا بَعْدُ ‏\"‏‏.‏",
                "headingArabic": "كَيْفَ يُكْتَبُ الْكِتَابُ إِلَى أَهْلِ الْكِتَابِ",
                "headingUrdu": "اہل کتاب کو خط کیسے لکھیں؟",
                "headingEnglish": "How to write a letter to the people of the Scripture",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6002,
                "hadithNumber": "6261",
                "englishNarrator": "Narrated Abu Hurairah (رضی اللہ عنہ ):",
                "hadithEnglish": "Allah's Messenger (ﷺ) mentioned a person from Bani Israel who took a piece of wood, made a hole in it, and put therein one thousand Dinar and letter from him to his friend. Abu Salamah has reported from Hadrat Abu Hurairah رضی اللہ عنہ . The Prophet (ﷺ) said, \"(That man) cut a piece of wood and put the money inside it and wrote a letter from such and such a person to such and such a person.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے بنی اسرائیل کے ایک شخص کا ذکر کیا کہ انہوں نے لکڑ ی کا ایک لٹھا لیا اور اس میں سوراخ کر کے ایک ہزار دینار اور خط رکھ دیا وہ ان کی طرف سے ان کے ساتھی ( قرض خواہ کی طرف تھا اور عمر بن ابی سلمہ نے بیان کیا کہ ان سے ان کے والد نے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ انہوں نے لکڑی کے ایک لٹھے میں سوراخ کیا اور مال اس کے اندر رکھ دیااوار ان کے پاس ایک خط لکھا ، فلاں کی طرف سے فلاں کو ملے ۔",
                "urduNarrator": "لیث نے بیان کیا کہ مجھ سے جعفر بن ربیع نے بیان کیا ان سے عبدالرحمٰن بن ہرمز نے اور ان سے ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے کہ",
                "hadithArabic": "وَقَالَ اللَّيْثُ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ ذَكَرَ رَجُلاً مِنْ بَنِي إِسْرَائِيلَ أَخَذَ خَشَبَةً فَنَقَرَهَا، فَأَدْخَلَ فِيهَا أَلْفَ دِينَارٍ وَصَحِيفَةً مِنْهُ إِلَى صَاحِبِهِ‏.‏ وَقَالَ عُمَرُ بْنُ أَبِي سَلَمَةَ عَنْ أَبِيهِ سَمِعَ أَبَا هُرَيْرَةَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ نَجَرَ خَشَبَةً، فَجَعَلَ الْمَالَ فِي جَوْفِهَا، وَكَتَبَ إِلَيْهِ صَحِيفَةً مِنْ فُلاَنٍ إِلَى فُلاَنٍ ‏\"‏‏.‏",
                "headingArabic": "بِمَنْ يُبْدَأُ فِي الْكِتَابِ",
                "headingUrdu": "جس کا نام خط میں پہلے لکھا جائے۔",
                "headingEnglish": "Whose name is to be written first in a letter",
                "chapterId": "80",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 80,
                    "chapterNumber": "80",
                    "chapterEnglish": "Asking Permission",
                    "chapterUrdu": "اجازت لینے کے بیان میں",
                    "chapterArabic": "كتاب الاستئذان",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5976,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=239",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=237",
                "label": "237",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=238",
                "label": "238",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=239",
                "label": "239",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=240",
                "label": "240",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=241",
                "label": "241",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=242",
                "label": "242",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=243",
                "label": "243",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=241",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=241",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=239",
        "to": 6000,
        "total": 40465
    }
}