{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 65,
        "data": [
            {
                "id": 1602,
                "hadithNumber": "1669, 1670",
                "englishNarrator": "Narrated Usama bin Zaid رضی اللہ عنہما :",
                "hadithEnglish": "I rode behind Allah's Messenger (ﷺ) from `Arafat and when Allah's Messenger (ﷺ) reached the mountain pass on the left side which is before Al-Muzdalifa he made his camel kneel and then urinated, and then I poured water for his ablution. He performed light ablution and then I said to him: (Is it the time for) the prayer, O Allah's Messenger (ﷺ)!\" He replied, \"The (place of) prayer is ahead of you (i.e. at Al-Muzdalifa).\" So Allah's Messenger (ﷺ) rode till he reached Al-Muzdalifa and then he offered the prayer (there) . Then in the morning (10th Dhul-Hijja) Al-Faql (bin `Abbas رضی اللہ عنہما ) rode behind Allah's Messenger (ﷺ).\r\nKuraib, (a sub-narrator) said that `Abdullah bin `Abbas رضی اللہ عنہما narrated from Al-Fadl رضی اللہ عنہ , \"Allah's Messenger (ﷺ) kept on reciting Talbiya (during the journey) till he reached the Jamra.\" (Jamrat-Al-`Aqaba)",
                "hadithUrdu": "میں عرفات سے رسول اللہ صلی اللہ علیہ وسلم کی سواری پر آپ صلی اللہ علیہ وسلم کے پیچھے بیٹھا ہوا تھا ۔ مزدلفہ کے قریب بائیں طرف جو گھاٹی پڑتی ہے جب آنحضرت صلی اللہ علیہ وسلم وہاں پہنچے تو آپ صلی اللہ علیہ وسلم نے اونٹ کو بٹھایا پھر پیشاب کیا اور تشریف لائے تو میں نے آپ صلی اللہ علیہ وسلم پر وضو کا پانی ڈالا ۔ آپ صلی اللہ علیہ وسلم نے ہلکا سا وضو کیا ۔ میں نے کہا یا رسول اللہ ! اور نماز ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ” نماز تمہارے آگے ہے ۔ “ ( یعنی مزدلفہ میں پڑھی جائے گی ) پھر آپ صلی اللہ علیہ وسلم سوار ہو گئے جب مزدلفہ میں آئے تو ( مغرب اور عشاء کی ) نماز ( ملا کر ) پڑھی ۔ پھر مزدلفہ کی صبح ( یعنی دسویں تاریخ ) کو رسول اللہ صلی اللہ علیہ وسلم کی سواری کے پیچھے فضل بن عباس رضی اللہ عنہما سوار ہوئے ۔\r\nکریب نے کہا کہ مجھے عبداللہ بن عباس رضی اللہ عنہما نے فضل رضی اللہ عنہ کے ذریعہ سے خبر دی کہ آنحضرت صلی اللہ علیہ وسلم برابر لبیک کہتے رہے تاآنکہ جمرہ عقبہ پر پہنچ گئے ( اور وہاں آپ صلی اللہ علیہ وسلم نے کنکریاں ماریں ) ۔",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، انہوں نے کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے محمد بن حرملہ نے ، ان سے ابن عباس رضی اللہ عنہما کے غلام کریب نے اور ان سے اسامہ بن زید رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ أَبِي حَرْمَلَةَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّهُ قَالَ رَدِفْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْ عَرَفَاتٍ فَلَمَّا بَلَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم الشِّعْبَ الأَيْسَرَ الَّذِي دُونَ الْمُزْدَلِفَةِ أَنَاخَ، فَبَالَ ثُمَّ جَاءَ فَصَبَبْتُ عَلَيْهِ الْوَضُوءَ، فَتَوَضَّأَ وُضُوءًا خَفِيفًا‏.‏ فَقُلْتُ الصَّلاَةَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏ \"‏ الصَّلاَةُ أَمَامَكَ ‏\"‏‏.‏ فَرَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى أَتَى الْمُزْدَلِفَةَ، فَصَلَّى ثُمَّ رَدِفَ الْفَضْلُ رَسُولَ اللَّهِ صلى الله عليه وسلم غَدَاةَ جَمْعٍ‏. قَالَ كُرَيْبٌ فَأَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ الْفَضْلِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَزَلْ يُلَبِّي حَتَّى بَلَغَ الْجَمْرَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1603,
                "hadithNumber": "1671",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنما :",
                "hadithEnglish": "I proceeded along with the Prophet (ﷺ) on the day of `Arafat (9th Dhul-Hijja). The Prophet (ﷺ) heard a great hue and cry and the beating of camels behind him. So he beckoned to the people with his lash, \"O people! Be quiet. Hastening is not a sign of righteousness.\"  أَوْضَعُوا  means run briskly,  خِلاَلَكُمْ  is from  التَّخَلُّلِ بَيْنَكُمْ   i.e. among you.  وَفَجَّرْنَا خِلاَلَهُمَا‏  means  بَيْنَهُمَا‏  i.e.,we caused to flow between both of them.",
                "hadithUrdu": "عرفہ کے دن ( میدان عرفات سے ) وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ آ رہے تھے آنحضرت صلی اللہ علیہ وسلم نے پیچھے سخت شور ( اونٹ ہانکنے کا ) اور اونٹوں کی مار دھاڑ کی آواز سنی تو آپ نے ان کی طرف اپنے کوڑے سے اشارہ کیا اور فرمایا کہ لوگو ! آہستگی و وقار اپنے اوپر لازم کر لو ، ( اونٹوں کو ) تیز دوڑانا کوئی نیکی نہیں ہے ۔ امام بخاری فرماتے ہیں کہ ( سورۃ البقرہ میں ) «أوضعوا» کے معنی ریشہ دوانیاں کریں ، «خلالكم» کا معنی تمہارے بیچ میں ، اسی سے ( سورۃ الکہف ) میں آیا ہے «وفجرنا خلالهما‏» یعنی ان کے بیچ میں ۔",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم بن سوید نے بیان کیا ، کہا مجھ سے مطلب کے غلام عمرو بن ابی عمرو نے بیان کیا ، انہیں والیہ کوفی کے غلام سعید بن جبیر نے خبر دی ، ان سے حضرت عبداللہ بن عباس رضی اللہ عنما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سُوَيْدٍ، حَدَّثَنِي عَمْرُو بْنُ أَبِي عَمْرٍو، مَوْلَى الْمُطَّلِبِ أَخْبَرَنِي سَعِيدُ بْنُ جُبَيْرٍ، مَوْلَى وَالِبَةَ الْكُوفِيُّ حَدَّثَنِي ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّهُ دَفَعَ مَعَ النَّبِيِّ صلى الله عليه وسلم يَوْمَ عَرَفَةَ فَسَمِعَ النَّبِيُّ صلى الله عليه وسلم وَرَاءَهُ زَجْرًا شَدِيدًا وَضَرْبًا وَصَوْتًا لِلإِبِلِ فَأَشَارَ بِسَوْطِهِ إِلَيْهِمْ وَقَالَ ‏ \"‏ أَيُّهَا النَّاسُ عَلَيْكُمْ بِالسَّكِينَةِ، فَإِنَّ الْبِرَّ لَيْسَ بِالإِيضَاعِ ‏\"‏‏.‏ أَوْضَعُوا أَسْرَعُوا‏.‏ خِلاَلَكُمْ مِنَ التَّخَلُّلِ بَيْنَكُمْ، وَفَجَّرْنَا خِلاَلَهُمَا‏.‏ بَيْنَهُمَا‏.‏",
                "headingArabic": "أَمْرِ النَّبِيِّ صلى الله عليه وسلم بِالسَّكِينَةِ عِنْدَ الإِفَاضَةِ، وَإِشَارَتِهِ إِلَيْهِمْ بِالسَّوْطِ",
                "headingUrdu": "لوگ آگے بڑھتے وقت پرسکون اور صبر کریں (عرفات سے)",
                "headingEnglish": "People should be calm and patient on proceeding (from 'Arafat)",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1604,
                "hadithNumber": "1672",
                "englishNarrator": "Narrated Usama bin Zaid رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) proceeded from `Arafat and dismounted at the mountainous pass and then urinated and performed a light ablution. I said to him, \"(Shall we offer) the prayer?\" He replied, \"The prayer is ahead of you (i.e. at Al-Muzdalifa).\" When he came to Al-Muzdalifa, he performed a perfect ablution. Then Iqama for the prayer was pronounced and he offered the Maghrib prayer and then every person made his camel kneel at his place; and then Iqama for the prayer was pronounced and he offered the (`Isha') prayer and he did not offer any prayer in between them (i.e. Maghrib and `Isha' prayers).",
                "hadithUrdu": "میدان عرفات سے رسول اللہ صلی اللہ علیہ وسلم روانہ ہو کر گھاٹی میں اترے ( جو مزدلفہ کے قریب ہے ) وہاں پیشاب کیا ، پھر وضو کیا اور پورا وضو نہیں کیا ( خوب پانی نہیں بہایا ہلکا وضو کیا ) میں نے نماز کے متعلق عرض کی تو فرمایا کہ نماز آگے ہے ۔ اب آپ صلی اللہ علیہ وسلم مزدلفہ تشریف لائے وہاں پھر وضو کیا اور پوری طرح کیا پھر نماز کی تکبیر کہی گئی اور آپ صلی اللہ علیہ وسلم نے مغرب کی نماز پڑھی پھر ہر شخص نے اپنے اونٹ ڈیروں پر بٹھا دیئے پھر دوبارہ نماز عشاء کے لیے تکبیر کہی گئی اور آپ صلی اللہ علیہ وسلم نے نماز پڑھی ، آپ صلی اللہ علیہ وسلم نے ان دونوں نمازوں کے درمیان کوئی ( سنت یا نفل ) نماز نہیں پڑھی تھی ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم سے امام مالک نے کہا ، انہیں موسیٰ بن عقبہ نے خبر دی ، انہیں کریب نے ، انہوں نے اسامہ بن زید رضی اللہ عنہما کو یہ کہتے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ كُرَيْبٍ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ أَنَّهُ سَمِعَهُ يَقُولُ دَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عَرَفَةَ، فَنَزَلَ الشِّعْبَ، فَبَالَ ثُمَّ تَوَضَّأَ، وَلَمْ يُسْبِغِ الْوُضُوءَ‏.‏ فَقُلْتُ لَهُ الصَّلاَةُ‏.‏ فَقَالَ ‏ \"‏ الصَّلاَةُ أَمَامَكَ ‏\"‏‏.‏ فَجَاءَ الْمُزْدَلِفَةَ، فَتَوَضَّأَ، فَأَسْبَغَ، ثُمَّ أُقِيمَتِ الصَّلاَةُ، فَصَلَّى الْمَغْرِبَ، ثُمَّ أَنَاخَ كُلُّ إِنْسَانٍ بَعِيرَهُ فِي مَنْزِلِهِ، ثُمَّ أُقِيمَتِ الصَّلاَةُ فَصَلَّى، وَلَمْ يُصَلِّ بَيْنَهُمَا‏.‏",
                "headingArabic": "الْجَمْعِ بَيْنَ الصَّلاَتَيْنِ بِالْمُزْدَلِفَةِ",
                "headingUrdu": "مزدلفہ میں دو نمازیں ایک ساتھ پڑھنا",
                "headingEnglish": "The offering of two Salat together at Al-Muzdalifa",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1605,
                "hadithNumber": "1673",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) offered the Maghrib and `Isha' prayers together at Jam' (i.e. Al-Muzdalifa) with a separate Iqama for each of them and did not offer any optional prayer in between them or after each of them.",
                "hadithUrdu": "مزدلفہ میں نبی کریم صلی اللہ علیہ وسلم نے مغرب اور عشاء ایک ساتھ ملا کر پڑھیں تھیں ہر نماز الگ الگ تکبیر کے ساتھ نہ ان دونوں کے درمیان کوئی نفل و سنت پڑھی تھی اور نہ ان کے بعد ۔",
                "urduNarrator": "ہم سے آدم بن ابی العلاء نے بیان کیا ، کہا ہم سے ابن ابی ذئب نے بیان کیا ، ان سے زہری نے ان سے سالم بن عبداللہ بن عمر رضی اللہ عنہما نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ جَمَعَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ بِجَمْعٍ، كُلُّ وَاحِدَةٍ مِنْهُمَا بِإِقَامَةٍ، وَلَمْ يُسَبِّحْ بَيْنَهُمَا وَلاَ عَلَى إِثْرِ كُلِّ وَاحِدَةٍ مِنْهُمَا‏.‏",
                "headingArabic": "مَنْ جَمَعَ بَيْنَهُمَا وَلَمْ يَتَطَوَّعْ",
                "headingUrdu": "جس نے دو نمازیں ایک وقت میں جمع کیں۔مَنْ جَمَعَ بَيْنَهُمَا وَلَمْ يَتَطَوَّعْ",
                "headingEnglish": "Whoever combined the two prayer at one time",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1606,
                "hadithNumber": "1674",
                "englishNarrator": "Narrated Abu Aiyub Al-Ansari رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) offered the Maghrib and `Isha' prayers together at Al-Muzdalifa.",
                "hadithUrdu": "حجۃ الوداع کے موقع پر رسول اللہ صلی اللہ علیہ وسلم نے مزدلفہ میں آ کر مغرب اور عشاء کو ایک ساتھ ملا کر پڑھا تھا ۔",
                "urduNarrator": "ہم سے خالد بن مخلد نے بیان کیا ، انہوں نے کہا کہ ہم سے سلیمان بن بلال نے بیان کیا ، انہوں نے کہا کہ ہم سے یحییٰ بن ابی سعید نے بیان کیا ، انہوں نے کہا کہ مجھے عدی بن ثابت نے خبر دی ، کہا کہ مجھ سے عبداللہ بن یزید خطمی نے بیان کیا ، کہا کہ مجھ سے ابوایوب انصاری رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ أَخْبَرَنِي عَدِيُّ بْنُ ثَابِتٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يَزِيدَ الْخَطْمِيُّ، قَالَ حَدَّثَنِي أَبُو أَيُّوبَ الأَنْصَارِيُّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَمَعَ فِي حَجَّةِ الْوَدَاعِ الْمَغْرِبَ وَالْعِشَاءَ بِالْمُزْدَلِفَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1607,
                "hadithNumber": "1675",
                "englishNarrator": "Narrated `Abdur-Rahman bin Yazid:",
                "hadithEnglish": "`Abdullah رضی اللہ عنہ performed the Hajj and we reached Al-Muzdalifa at or about the time of the `Isha' prayer. He ordered a man to pronounce the Adhan and Iqama and then he offered the Maghrib prayer and offered two rak`at after it. Then he asked for his supper and took it, and then, I think, he ordered a man to pronounce the Adhan and Iqama (for the `Isha' prayer). (`Amr, a sub-narrator said: The intervening statement 'I think', was said by the sub-narrator Zuhair) (i.e. not by `Abdur-Rahman). Then `Abdullah offered two rak`at of `Isha' prayer. When the day dawned, `Abdullah said, \"The Prophet never offered any prayer at this hour except this prayer at this time and at this place and on this day.\" `Abdullah added, \"These two prayers are shifted from their actual times -- the Maghrib prayer (is offered) when the people reached Al-Muzdalifa and the Fajr (morning) prayer at the early dawn.\" `Abdullah added, \"I saw the Prophet (ﷺ) doing that.\"",
                "hadithUrdu": "عبداللہ بن مسعود رضی اللہ عنہ نے حج کیا ، آپ کے ساتھ تقریباً عشاء کی اذان کے وقت ہم مزدلفہ میں بھی آئے ، آپ نے ایک شخص کو حکم دیا اس نے اذان اورتکبیر کہی اور آپ نے مغرب کی نماز پڑھی ، پھر دو رکعت ( سنت ) اور پڑھی اور شام کا کھانا منگوا کر کھایا ۔ میرا خیال ہے ( راوی حدیث زہیر کا ) کہ پھر آپ نے حکم دیا اور اس شخص نے اذان دی اور تکبیر کہی عمرو ( راوی حدیث ) نے کہا میں یہی سمجھتا ہوں کہ شک زہیر ( عمرو کے شیخ ) کو تھا ، اس کے بعد عشاء کی نماز دو رکعت پڑھی ۔ جب صبح صادق ہوئی تو آپ نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم اس نماز ( فجر ) کو اس مقام اور اس دن کے سوا اور کبھی اس وقت ( طلوع فجر ہوتے ہی ) نہیں پڑھتے تھے ، عبداللہ بن مسعود رضی اللہ عنہ نے یہ بھی فرمایا کہ یہ صرف دو نمازیں ( آج کے دن ) اپنے معمولی وقت سے ہٹا دی جاتی ہیں ۔ جب لوگ مزدلفہ آتے ہیں تو مغرب کی نماز ( عشاء کے ساتھ ملا کر ) پڑھی جاتی ہے اور فجر کی نماز طلوع فجر کے ساتھ ہی ۔ انہوں نے فرمایا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو اسی طرح کرتے دیکھا تھا ۔",
                "urduNarrator": "ہم سے عمرو بن خالد نے بیان کیا ، کہا کہ ہم سے زہیر نے بیان کیا ، کہا کہ ہم سے ابواسحٰق عمرو بن عبداللہ نے بیان کیا ، کہا کہ میں نے عبدالرحمٰن بن یزید سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ، يَقُولُ حَجَّ عَبْدُ اللَّهِ ـ رضى الله عنه ـ فَأَتَيْنَا الْمُزْدَلِفَةَ حِينَ الأَذَانِ بِالْعَتَمَةِ، أَوْ قَرِيبًا مِنْ ذَلِكَ، فَأَمَرَ رَجُلاً فَأَذَّنَ وَأَقَامَ، ثُمَّ صَلَّى الْمَغْرِبَ، وَصَلَّى بَعْدَهَا رَكْعَتَيْنِ، ثُمَّ دَعَا بِعَشَائِهِ فَتَعَشَّى، ثُمَّ أَمَرَ ـ أُرَى رَجُلاً ـ فَأَذَّنَ وَأَقَامَ ـ قَالَ عَمْرٌو لاَ أَعْلَمُ الشَّكَّ إِلاَّ مِنْ زُهَيْرٍ ـ ثُمَّ صَلَّى الْعِشَاءَ رَكْعَتَيْنِ، فَلَمَّا طَلَعَ الْفَجْرُ قَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لاَ يُصَلِّي هَذِهِ السَّاعَةَ إِلاَّ هَذِهِ الصَّلاَةَ، فِي هَذَا الْمَكَانِ، مِنْ هَذَا الْيَوْمِ‏.‏ قَالَ عَبْدُ اللَّهِ هُمَا صَلاَتَانِ تُحَوَّلاَنِ عَنْ وَقْتِهِمَا صَلاَةُ الْمَغْرِبِ بَعْدَ مَا يَأْتِي النَّاسُ الْمُزْدَلِفَةَ، وَالْفَجْرُ حِينَ يَبْزُغُ الْفَجْرُ‏.‏ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَفْعَلُهُ‏.‏",
                "headingArabic": "مَنْ أَذَّنَ وَأَقَامَ لِكُلِّ وَاحِدَةٍ مِنْهُمَا",
                "headingUrdu": "ان میں سے ہر ایک کے لیے اذان اور اقامت",
                "headingEnglish": "Adhan and Iqama for each of them",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1608,
                "hadithNumber": "1676",
                "englishNarrator": "Narrated Salim:",
                "hadithEnglish": "`Abdullah bin `Umar  رضی اللہ عنہما used to send the weak among his family early to Mina. So they used to depart from Al-Mash'ar Al-Haram (that is Al-Muzdalifa) at night (when the moon had set) and invoke Allah as much as they could, and then they would return (to Mina) before the Imam had started from Al- Muzdalifa to Mina. So some of them would reach Mina at the time of the Fajr prayer and some of them would come later. When they reached Mina they would throw pebbles on the Jamra (Jamrat-Al- `Aqaba) Ibn `Umar used to say, \"Allah's Messenger (ﷺ) gave the permission to them (weak people) to do so.\"",
                "hadithUrdu": "حضرت عبداللہ بن عمر رضی اللہ عنہما اپنے گھر کے کمزوروں کو پہلے ہی بھیج دیا کرتے تھے اور وہ رات ہی میں مزدلفہ میں مشعر حرام کے پاس آ کر ٹھہرتے اور اپنی طاقت کے مطابق اللہ کا ذکر کرتے تھے ، پھر امام کے ٹھہرنے اور لوٹنے سے پہلے ہی ( منیٰ ) آ جاتے تھے ، بعض تو منیٰ فجر کی نماز کے وقت پہنچتے اور بعض اس کے بعد ، جب منیٰ پہنچتے تو کنکریاں مارتے اور حضرت عبداللہ بن عمر رضی اللہ عنہما فرمایا کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے ان سب لوگوں کے لیے یہ اجازدت دی ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن یونس نے بیان کیا ، اور ان سے ابن شہاب نے بیان کیا کہ سالم نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، قَالَ سَالِمٌ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ ـ رضى الله عنهما ـ يُقَدِّمُ ضَعَفَةَ أَهْلِهِ، فَيَقِفُونَ عِنْدَ الْمَشْعَرِ الْحَرَامِ بِالْمُزْدَلِفَةِ بِلَيْلٍ، فَيَذْكُرُونَ اللَّهَ مَا بَدَا لَهُمْ، ثُمَّ يَرْجِعُونَ قَبْلَ أَنْ يَقِفَ الإِمَامُ، وَقَبْلَ أَنْ يَدْفَعَ، فَمِنْهُمْ مَنْ يَقْدَمُ مِنًى لِصَلاَةِ الْفَجْرِ، وَمِنْهُمْ مَنْ يَقْدَمُ بَعْدَ ذَلِكَ، فَإِذَا قَدِمُوا رَمَوُا الْجَمْرَةَ، وَكَانَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ أَرْخَصَ فِي أُولَئِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": "مَنْ قَدَّمَ ضَعَفَةَ أَهْلِهِ بِلَيْلٍ، فَيَقِفُونَ بِالْمُزْدَلِفَةِ وَيَدْعُونَ وَيُقَدِّمُ إِذَا غَابَ الْقَمَرُ",
                "headingUrdu": "جس نے کمزوروں کو جلدی بھیجا (مزدلفہ سے منیٰ)",
                "headingEnglish": "Whosoever sent the weak early (from Al-Muzdalifa to Mina)",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1609,
                "hadithNumber": "1677",
                "englishNarrator": "Narrated Ibn `Abbas:",
                "hadithEnglish": "Allah's Messenger (ﷺ) had sent me from Jam' (i.e. Al-Muzdalifa) at night.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے مجھے مزدلفہ سے رات ہی میں منیٰ روانہ کر دیا تھا ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا کہ ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے عکرمہ نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ جَمْعٍ بِلَيْلٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1610,
                "hadithNumber": "1678",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "I as among those whom the Prophet (ﷺ) sent on the night of Al-Muzdalifa early being among the weak members of his family.",
                "hadithUrdu": "میں ان لوگوں میں تھاجنہیں نبی کریم صلی اللہ علیہ وسلم نے اپنے گھر کے کمزور لوگوں کے ساتھ مزدلفہ کی رات ہی میں منیٰ بھیج دیا تھا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، کہا کہ مجھے عبیداللہ بن ابی یزید نے خبر دی ، انہوں نے ابن عباس رضی اللہ عنہما کو یہ کہتے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ، سَمِعَ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ أَنَا مِمَّنْ، قَدَّمَ النَّبِيُّ صلى الله عليه وسلم لَيْلَةَ الْمُزْدَلِفَةِ فِي ضَعَفَةِ أَهْلِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1611,
                "hadithNumber": "1679",
                "englishNarrator": "Narrated `Abdullah, the slave of Asma' reported from Hadrat Asma رضی اللہ عنہما :",
                "hadithEnglish": "During the night of Jam', Asma' got down at Al-Muzdalifa and stood up for (offering) the prayer and offered the prayer for some time and then asked, \"O my son! Has the moon set?\" I replied in the negative and she again prayed for another period and then asked, \"Has the moon set?\" I replied, \"Yes.\" So she said that we should set out (for Mina), and we departed and went on till she threw pebbles at the Jamra (Jamrat-Al-`Aqaba) and then she returned to her dwelling place and offered the morning prayer. I asked her, \"O you! I think we have come (to Mina) early in the night.\" She replied, \"O my son! Allah's Messenger (ﷺ) gave permission to the women to do so.\"",
                "hadithUrdu": "وہ رات ہی میں مزدلفہ پہنچ گئیں اور کھڑی ہو کر نماز پڑھنے لگیں ، کچھ دیر تک نماز پڑھنے کے بعد پوچھا بیٹے ! کیا چاند ڈوب گیا ؟ میں نے کہا کہ نہیں ، اس لیے وہ دوبارہ نماز پڑھنے لگیں کچھ دیر بعد پھر پوچھا کیا چاند ڈوب گیا ؟ میں نے کہا ہاں ، انہوں نے کہا کہ اب آگے چلو ( منی کو ) چنانچہ ہم ان کے ساتھ آگے چلے ، وہ ( منی میں ) رمی جمرہ کرنے کے بعد پھر واپس آ گئیں اور صبح کی نماز اپنے ڈیرے پر پڑھی میں نے کہا جناب ! یہ کیا بات ہوئی کہ ہم نے اندھیرے ہی میں نماز پرھ لی ۔ انہوں نے کہا بیٹے ! رسول اللہ صلی اللہ علیہ وسلم نے عورتوں کو اس کی اجازت دی ہے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، ان سے یحییٰ بن سعید بن قطان نے ، ان سے ابن جریج نے بیان کیا کہ ان سے اسماء کے غلام عبداللہ نے بیان کیا کہ ان سے اسماء بنت ابوبکر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ، مَوْلَى أَسْمَاءَ عَنْ أَسْمَاءَ، أَنَّهَا نَزَلَتْ لَيْلَةَ جَمْعٍ عِنْدَ الْمُزْدَلِفَةِ، فَقَامَتْ تُصَلِّي، فَصَلَّتْ سَاعَةً، ثُمَّ قَالَتْ يَا بُنَىَّ هَلْ غَابَ الْقَمَرُ قُلْتُ لاَ‏.‏ فَصَلَّتْ سَاعَةً، ثُمَّ قَالَتْ هَلْ غَابَ الْقَمَرُ قُلْتُ نَعَمْ‏.‏ قَالَتْ فَارْتَحِلُوا‏.‏ فَارْتَحَلْنَا، وَمَضَيْنَا حَتَّى رَمَتِ الْجَمْرَةَ، ثُمَّ رَجَعَتْ فَصَلَّتِ الصُّبْحَ فِي مَنْزِلِهَا‏.‏ فَقُلْتُ لَهَا يَا هَنْتَاهْ مَا أُرَانَا إِلاَّ قَدْ غَلَّسْنَا‏.‏ قَالَتْ يَا بُنَىَّ، إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَذِنَ لِلظُّعُنِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1612,
                "hadithNumber": "1680",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Sauda asked the permission of the Prophet (ﷺ) to leave earlier at the night of Jam', and she was a fat and very slow woman. The Prophet (ﷺ) gave her permission.",
                "hadithUrdu": "ام المؤمنین حضرت سودہ رضی اللہ عنہا نے نبی کریم صلی اللہ علیہ وسلم سے مزدلفہ کی رات عام لوگوں سے پہلے روانہ ہونے کی اجازت چاہی آپ رضی اللہ عنہا بھاری بھر کم بدن کی عورت تھیں تو حضور صلی اللہ علیہ وسلم نے انہیں اس کی اجازت دے دی ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، کہا کہ ہم کو سفیان ثوری نے خبر دی ، کہا کہ ہم سے عبدالرحمٰن بن قاسم نے بیان کیا ، ان سے قاسم نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ ـ هُوَ ابْنُ الْقَاسِمِ ـ عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اسْتَأْذَنَتْ سَوْدَةُ النَّبِيَّ صلى الله عليه وسلم لَيْلَةَ جَمْعٍ وَكَانَتْ ثَقِيلَةً ثَبْطَةً فَأَذِنَ لَهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1613,
                "hadithNumber": "1681",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "We got down at Al-Muzdalifa and Sauda رضی اللہ عنہا asked the permission of the Prophet (ﷺ) to leave (early) before the rush of the people. She was a slow woman and he gave her permission, so she departed (from Al- Muzdalifa) before the rush of the people. We kept on staying at Al-Muzdalifa till dawn, and set out with the Prophet (ﷺ) but (I suffered so much that) I wished I had taken the permission of Allah's Messenger (ﷺ) as Sauda رضی اللہ عنہا had done, and that would have been dearer to me than any other happiness.",
                "hadithUrdu": "جب ہم نے مزدلفہ میں قیام کیا تو نبی کریم صلی اللہ علیہ وسلم نے حضرت سودہ رضی اللہ عنہا کو لوگوں کے اژدہام سے پہلے روانہ ہونے کی اجازت دے دی تھیں ، وہ بھاری بھر کم بدن کی خاتون تھیں ، اس لیے آپ نے اجازت دے دی چنانچہ وہ اژدہام سے پہلے روانہ ہو گئیں ۔ لیکن ہم وہیں ٹھہرے رہے اور صبح کو آپ صلی اللہ علیہ وسلم کے ساتھ گئے اگر میں بھی حضرت سودہ رضی اللہ عنہا کی طرح آپ صلی اللہ علیہ وسلم سے اجازت لیتی تو مجھ کو تمام خوشی کی چیزوں میں یہ بہت ہی پسند ہوتا ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا کہ ہم سے افلح بن حمید نے ، ان سے قاسم بن محمد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا أَفْلَحُ بْنُ حُمَيْدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ نَزَلْنَا الْمُزْدَلِفَةَ فَاسْتَأْذَنَتِ النَّبِيَّ صلى الله عليه وسلم سَوْدَةُ أَنْ تَدْفَعَ قَبْلَ حَطْمَةِ النَّاسِ، وَكَانَتِ امْرَأَةً بَطِيئَةً، فَأَذِنَ لَهَا، فَدَفَعَتْ قَبْلَ حَطْمَةِ النَّاسِ، وَأَقَمْنَا حَتَّى أَصْبَحْنَا نَحْنُ، ثُمَّ دَفَعْنَا بِدَفْعِهِ، فَلأَنْ أَكُونَ اسْتَأْذَنْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم كَمَا اسْتَأْذَنَتْ سَوْدَةُ أَحَبُّ إِلَىَّ مِنْ مَفْرُوحٍ بِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1614,
                "hadithNumber": "1682",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "I never saw the Prophet (ﷺ) offering any prayer not at its stated time except two; he prayed the Maghrib and the `Isha' together and he offered the morning prayer before its usual time.",
                "hadithUrdu": "دو نمازوں کے سوا میں نے نبی کریم صلی اللہ علیہ وسلم کو اور کوئی نماز بغیر وقت نہیں پڑھتے دیکھا ، آپ صلی اللہ علیہ وسلم نے مغرب اور عشاء ایک ساتھ پڑھیں اور فجر کی نماز بھی اس دن ( مزدلفہ میں ) معمول کے وقت سے پہلے ادا کی ۔",
                "urduNarrator": "ہم سے عمرو بن حفص بن غیاث نے بیان کیا ، کہا کہ مجھ سے میرے باپ نے بیان کیا ، کہا کہ ہم سے اعمش نے بیان کیا ، کہا کہ مجھ سے عمارہ نے عبدالرحمٰن بن یزید سے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي عُمَارَةُ، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ مَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم صَلَّى صَلاَةً بِغَيْرِ مِيقَاتِهَا إِلاَّ صَلاَتَيْنِ جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ، وَصَلَّى الْفَجْرَ قَبْلَ مِيقَاتِهَا‏.‏",
                "headingArabic": "مَنْ يُصَلِّي الْفَجْرَ بِجَمْعٍ",
                "headingUrdu": "جام میں فجر کی نماز کس وقت پڑھنی ہے؟",
                "headingEnglish": "At what time is the Fajr prayer to be offered at Jam'",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1615,
                "hadithNumber": "1683",
                "englishNarrator": "Narrated `Abdur-Rahman bin Yazid:",
                "hadithEnglish": "I went out with `Abdullah رضی اللہ عنہ , to Mecca and when we proceeded to am' he offered the two prayers (the Maghrib and the `Isha') together, making the Adhan and Iqama separately for each prayer. He took his supper in between the two prayers. He offered the Fajr prayer as soon as the day dawned. Some people said, \"The day had dawned (at the time of the prayer),\" and others said, \"The day had not dawned.\" `Abdullah then said, \"Allah's Messenger (ﷺ) said, 'These two prayers have been shifted from their stated times at this place only (at Al-Muzdalifa); first: The Maghrib and the `Isha'. So the people should not arrive at Al-Muzdalifa till the time of the `Isha' prayer has become due. The second prayer is the morning prayer which is offered at this hour.' \" Then `Abdullah stayed there till it became a bit brighter. He then said, \"If the chief of the believers hastened onwards to Mina just now, then he had indeed followed the Sunna.\" I do not know which proceeded the other, his (`Abdullah's) statement or the departure of `Uthman رضی اللہ عنہ . `Abdullah رضی اللہ عنہ was reciting Talbiya till he threw pebbles at the Jamrat-Al- `Aqaba on the Day of Nahr (slaughtering) (that is the 10th of Dhul-Hijja).",
                "hadithUrdu": "ہم عبداللہ بن مسعود رضی اللہ عنہ کے ساتھ مکہ کی طرف نکلے ( حج شروع کیا ) پھر جب ہم مزدلفہ آئے تو آپ نے دو نمازیں ( اس طرح ایک ساتھ ) پڑھیں کہ ہر نماز ایک الگ اذان اور ایک الگ اقامت کے ساتھ تھی اور رات کا کھانا دونوں کے درمیان میں کھایا ، پھر طلوع صبح کے ساتھ ہی آپ نے نماز فجر پڑھی ، کوئی کہتا تھا کہ ابھی صبح صادق نہیں ہوئی اور کچھ لوگ کہہ رہے تھے کہ ہو گئی ۔ اس کے بعد عبداللہ بن مسعود رضی اللہ عنہ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا یہ دونوں نمازیں اس مقام سے ہٹا دی گئیں ہیں ، یعنی مغرب اور عشاء ، مزدلفہ میں اس وقت داخل ہوں کہ اندھیرا ہو جائے اور فجر کی نماز اس وقت ۔ پھر عبداللہ اجالے تک وہیں مزدلفہ میں ٹھہرے رہے اور کہا کہ اگر امیرالمؤمنین حضرت عثمان رضی اللہ عنہ اس وقت چلیں تو یہ سنت کے مطابق ہو گا ۔ ( حدیث کے راوی عبدالرحمٰن بن یزید نے کہا ) میں نہیں کہہ سکتا کہ یہ الفاظ ان کی زبان سے پہلے نکلے یا حضرت عثمان رضی اللہ عنہ کی روانگی پہلے شروع ہوئی ، آپ دسویں تاریخ تک جمرہ عقبہ کی رمی تک برابر لبیک پکارتے رہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن رجاء نے بیان کیا ، کہا کہ ہم سے اسرائیل نے بیان کیا ، ان سے ابواسحٰق نے ، ان سے عبدالرحمٰن بن یزید نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ خَرَجْنَا مَعَ عَبْدِ اللَّهِ ـ رضى الله عنه ـ إِلَى مَكَّةَ، ثُمَّ قَدِمْنَا جَمْعًا، فَصَلَّى الصَّلاَتَيْنِ، كُلَّ صَلاَةٍ وَحْدَهَا بِأَذَانٍ وَإِقَامَةٍ، وَالْعَشَاءُ بَيْنَهُمَا، ثُمَّ صَلَّى الْفَجْرَ حِينَ طَلَعَ الْفَجْرُ، قَائِلٌ يَقُولُ طَلَعَ الْفَجْرُ‏.‏ وَقَائِلٌ يَقُولُ لَمْ يَطْلُعِ الْفَجْرُ‏.‏ ثُمَّ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ هَاتَيْنِ الصَّلاَتَيْنِ حُوِّلَتَا عَنْ وَقْتِهِمَا فِي هَذَا الْمَكَانِ الْمَغْرِبَ وَالْعِشَاءَ، فَلاَ يَقْدَمُ النَّاسُ جَمْعًا حَتَّى يُعْتِمُوا، وَصَلاَةَ الْفَجْرِ هَذِهِ السَّاعَةَ ‏\"‏‏.‏ ثُمَّ وَقَفَ حَتَّى أَسْفَرَ، ثُمَّ قَالَ لَوْ أَنَّ أَمِيرَ الْمُؤْمِنِينَ أَفَاضَ الآنَ أَصَابَ السُّنَّةَ‏.‏ فَمَا أَدْرِي أَقَوْلُهُ كَانَ أَسْرَعَ أَمْ دَفْعُ عُثْمَانَ ـ رضى الله عنه ـ فَلَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ يَوْمَ النَّحْرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1616,
                "hadithNumber": "1684",
                "englishNarrator": "Narrated `Amr bin Maimun:",
                "hadithEnglish": "I saw `Umar رضی اللہ عنہ , offering the Fajr (morning) prayer at Jam'; then he got up and said, \"The pagans did not use to depart (from Jam') till the sun had risen, and they used to say, 'Let the sun shine on Thabir (a mountain).' But the Prophet (ﷺ) contradicted them and departed from Jam' before sunrise.\"",
                "hadithUrdu": "جب عمر بن خطاب رضی اللہ عنہ نے مزدلفہ میں فجر کی نماز پڑھی تو میں بھی موجود تھا ، نماز کے بعد آپ ٹھہرے اور فرمایا کہ مشرکین ( جاہلیت میں یہاں سے ) سورج نکلنے سے پہلے نہیں جاتے تھے کہتے تھے اے ثبیر ! تو چمک جا ۔ نبی کریم صلی اللہ علیہ وسلم نے مشرکوں کی مخالفت کی اور سورج نکلنے سے پہلے وہاں سے روانہ ہو گئے ۔",
                "urduNarrator": "ہم سے حجاج بن منہال نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا ، ان سے ابواسحٰق نے ، انہوں نے عمرو بن میمون کو یہ کہتے سنا کہ",
                "hadithArabic": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، سَمِعْتُ عَمْرَو بْنَ مَيْمُونٍ، يَقُولُ شَهِدْتُ عُمَرَ ـ رضى الله عنه ـ صَلَّى بِجَمْعٍ الصُّبْحَ، ثُمَّ وَقَفَ فَقَالَ إِنَّ الْمُشْرِكِينَ كَانُوا لاَ يُفِيضُونَ حَتَّى تَطْلُعَ الشَّمْسُ، وَيَقُولُونَ أَشْرِقْ ثَبِيرُ‏.‏ وَأَنَّ النَّبِيَّ صلى الله عليه وسلم خَالَفَهُمْ، ثُمَّ أَفَاضَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ‏.‏",
                "headingArabic": "مَتَى يُدْفَعُ مِنْ جَمْعٍ",
                "headingUrdu": "جام (یعنی مزدلفہ) سے کب روانہ ہو؟",
                "headingEnglish": "When to depart from Jam' (i.e., Al-Muzdalifa)",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1617,
                "hadithNumber": "1685",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) made Al-Fadl ride behind him, and Al-Fadl informed that he (the Prophet (ﷺ) ) kept on reciting Talbiya till he did the Rami of the Jamra. (Jamrat-Al-`Aqaba.)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ( مزدلفہ سے لوٹتے وقت ) فضل ( بن عباس رضی اللہ عنہما ) کو اپنے پیچھے سوار کرایا تھا ۔ فضل رضی اللہ عنہ نے خبر دی کہ آنحضرت صلی اللہ علیہ وسلم رمی جمرہ تک برابر لبیک پکارتے رہے ۔",
                "urduNarrator": "ہم سے ابوعاصم ضحاک بن مخلد نے بیان کیا ، انہیں ابن جریج نے خبر دی ، انہیں عطاء نے ، انہیں ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ الضَّحَّاكُ بْنُ مَخْلَدٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَرْدَفَ الْفَضْلَ، فَأَخْبَرَ الْفَضْلُ أَنَّهُ لَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى الْجَمْرَةَ‏.‏",
                "headingArabic": "التَّلْبِيَةِ وَالتَّكْبِيرِ غَدَاةَ النَّحْرِ ، حِينَ يَرْمِي الْجَمْرَةَ، وَالاِرْتِدَافِ فِي السَّيْرِ",
                "headingUrdu": "تلبیہ اور تکبیر یوم نحر کی صبح تک جمرات عقبہ کی رمی تک",
                "headingEnglish": "Talbiya and Takbir in the morning of the day of Nahr till the Ramy of Jamarat-al-'Aqaba",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1618,
                "hadithNumber": "1686, 1687",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"Usama bin Zaid rode behind the Prophet (ﷺ) from `Arafat to Al-Muzdalifa; and then from Al-Muzdalifa to Mina, Al-Fadl rode behind him.\" He added, \"Both of them (Usama and Al-Fadl) said, 'The Prophet (ﷺ) was constantly reciting Talbiya till he did Rami of the Jamarat-Al-`Aqaba.\"",
                "hadithUrdu": "اسامہ بن زید رضی اللہ عنہما عرفات سے مزدلفہ تک نبی کریم صلی اللہ علیہ وسلم کی سواری پر آپ کے پیچھے بیٹھے ہوئے تھے ، پھر آپ صلی اللہ علیہ وسلم نے مزدلفہ سے منی جاتے وقت فضل بن عباس رضی اللہ عنہما کو اپنے پیچھے بٹھا لیا تھا ۔ انہوں نے کہا کہ ان دونوں حضرات نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم جمرہ عقبہ کی رمی تک مسلسل لبیک کہتے رہے ۔",
                "urduNarrator": "ہم سے زہیر بن حرب نے بیان کیا ، ان سے وہب بن جریر نے بیان کیا ، ان سے ان کے باپ نے بیان کیا ، ان سے یونس ایلی نے ، ان سے زہری نے ، ان سے عبیداللہ بن عبداللہ نے اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، عَنْ يُونُسَ الأَيْلِيِّ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ أُسَامَةَ بْنَ زَيْدٍ ـ رضى الله عنهما ـ كَانَ رِدْفَ النَّبِيِّ صلى الله عليه وسلم مِنْ عَرَفَةَ إِلَى الْمُزْدَلِفَةِ، ثُمَّ أَرْدَفَ الْفَضْلَ مِنَ الْمُزْدَلِفَةِ إِلَى مِنًى ـ قَالَ ـ فَكِلاَهُمَا قَالاَ لَمْ يَزَلِ النَّبِيُّ صلى الله عليه وسلم يُلَبِّي حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1619,
                "hadithNumber": "1688",
                "englishNarrator": "Narrated Abu Jamra:",
                "hadithEnglish": "I asked Ibn `Abbas رضی اللہ عنہما about Hajj-at-Tamattu`. He ordered me to perform it. I asked him about the Hadi (sacrifice). He said, \"You have to slaughter a camel, a cow or a sheep, or you may share the Hadi with the others.\" It seemed that some people disliked it (Hajj-at-Tamattu`). I slept and dreamt as if a person was announcing: \"Hajj Mabrur and accepted Mut'ah (Hajj-at-Tamattu`)\" I went to Ibn `Abbas رضی اللہ عنہما and narrated it to him. He said, \"Allah is Greater. (That was) the tradition of Abu Al-Qasim (i.e. Prophet). Narrated Shu`ba that the call in the dream was. \"An accepted `Umra and Hajj-Mabrur. \"",
                "hadithUrdu": "میں نے ابن عباس رضی اللہ عنہما سے تمتع کے بارے میں پوچھا تو آپ نے مجھے اس کے کرنے کا حکم دیا ، پھر میں نے قربانی کے متعلق پوچھا تو آپ نے فرمایا کہ تمتع میں ایک اونٹ ، یا ایک گائے یا ایک بکری ( کی قربانی واجب ہے ) یا کسی قربانی ( اونٹ ، یا گائے بھینس کی ) میں شریک ہو جائے ، ابوجمرہ نے کہا کہ بعض لوگ تمتع کو ناپسندیدہ قرار دیتے تھے ۔ پھر میں سویا تو میں نے خواب میں دیکھا کہ ایک شخص پکار رہا ہے یہ حج مبرور ہے اور یہ مقبول تمتع ہے ۔ اب میں ابن عباس رضی اللہ عنہما کی خدمت میں حاضر ہوا اور ان سے خواب کا ذکر کیا تو انہوں نے فرمایا : اللہ اکبر ! یہ تو ابوالقاسم صلی اللہ علیہ وسلم کی سنت ہے ۔ کہا کہ وہب بن جریر اور غندر نے شعبہ کے حوالہ سے یوں نقل کیا ہے «عمرة متقبلة ،‏‏‏‏ وحج مبرور‏» ( اس میں عمرہ کا ذکر پہلے ہے یعنی یہ عمرہ مقبول اور حج مبرور ہے ) ۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا ، انہیں نضر بن شمیل نے خبر دی ، انہیں شعبہ نے خبر دی ، ان سے ابوجمرہ نے بیان کیا ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا النَّضْرُ، أَخْبَرَنَا شُعْبَةُ، حَدَّثَنَا أَبُو جَمْرَةَ، قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ الْمُتْعَةِ، فَأَمَرَنِي بِهَا، وَسَأَلْتُهُ عَنِ الْهَدْىِ، فَقَالَ فِيهَا جَزُورٌ أَوْ بَقَرَةٌ أَوْ شَاةٌ أَوْ شِرْكٌ فِي دَمٍ قَالَ وَكَأَنَّ نَاسًا كَرِهُوهَا، فَنِمْتُ فَرَأَيْتُ فِي الْمَنَامِ كَأَنَّ إِنْسَانًا يُنَادِي حَجٌّ مَبْرُورٌ، وَمُتْعَةٌ مُتَقَبَّلَةٌ‏.‏ فَأَتَيْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ فَحَدَّثْتُهُ فَقَالَ اللَّهُ أَكْبَرُ سُنَّةُ أَبِي الْقَاسِمِ صلى الله عليه وسلم قَالَ وَقَالَ آدَمُ وَوَهْبُ بْنُ جَرِيرٍ وَغُنْدَرٌ عَنْ شُعْبَةَ عُمْرَةٌ مُتَقَبَّلَةٌ، وَحَجٌّ مَبْرُورٌ‏.‏",
                "headingArabic": "{فَمَنْ تَمَتَّعَ بِالْعُمْرَةِ إِلَى الْحَجِّ فَمَا اسْتَيْسَرَ مِنَ الْهَدْيِ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلاَثَةِ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ إِذَا رَجَعْتُمْ تِلْكَ عَشَرَةٌ كَامِلَةٌ ذَلِكَ لِمَنْ لَمْ يَكُنْ أَهْلُهُ حَاضِرِي الْمَسْجِدِ الْحَرَامِ}",
                "headingUrdu": "\"... اور جس نے حج کے مہینوں میں حج سے پہلے عمرہ کیا...\"",
                "headingEnglish": "\"... And whosoever perfoms the 'Umra in the months of Hajj before the Hajj ...\"",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1620,
                "hadithNumber": "1689",
                "englishNarrator": "Narrated Abu Huraira' رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) saw a man driving his Badana (sacrificial camel). He said, \"Ride on it.\" The man said, \"It is a Badana.\" The Prophet (ﷺ) said, \"Ride on it.\" He (the man) said, \"It is a Badana.\" The Prophet said, \"Ride on it.\" And on the second or the third time he (the Prophet (ﷺ) ) added, \"Woe to you.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے ایک شخص کو قربانی کاجانور لے جاتے دیکھا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس پر سوار ہو جا ۔ اس شخص نے کہا کہ یہ تو قربانی کا جانور ہے ، آپ صلی اللہ عیلیہ وسلم نے فرمایا کہ اس پر سوار ہو جانا ۔ اس نے کہا کہ یہ تو قربانی کا جانور ہے تو آپ صلی اللہ علیہ وسلم نے پھر فرمایا افسوس ! سوار بھی ہو جاؤ ( «ويلك» آپ صلی اللہ علیہ وسلم نے ) دوسری یا تیسری مرتبہ فرمایا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہم سے امام مالک نے خبر دی ، انہیں ابوالزناد نے ، انہیں اعرج اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى رَجُلاً يَسُوقُ بَدَنَةً فَقَالَ ‏\"‏ ارْكَبْهَا ‏\"‏‏.‏ فَقَالَ إِنَّهَا بَدَنَةٌ‏.‏ فَقَالَ ‏\"‏ ارْكَبْهَا ‏\"‏‏.‏ قَالَ إِنَّهَا بَدَنَةٌ‏.‏ قَالَ ‏\"‏ ارْكَبْهَا، وَيْلَكَ ‏\"‏‏.‏ فِي الثَّالِثَةِ أَوْ فِي الثَّانِيَةِ‏.‏",
                "headingArabic": "رُكُوبِ الْبُدْنِ",
                "headingUrdu": "بڈن پر سواری۔",
                "headingEnglish": "The riding over the Budn",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1621,
                "hadithNumber": "1690",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) saw a man driving a Badana. He said, \"Ride on it.\" The man replied, \"It is a Badana.\" The Prophet (ﷺ) said (again), \"Ride on it.\" He (the man) said, \"It is a Badana.\" The Prophet (ﷺ) said thrice, \"Ride on it.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک شخص کو دیکھا کہ قربانی کا جانور لیے جا رہا ہے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس پر سوار ہو جا اس نے کہا کہ یہ تو قربانی کا جانور ہے آپ صلی اللہ علیہ وسلم نے فرمایا کہ سوا ر ہو جا اس نے پھر عرض کیا کہ یہ تو قربانی کا جانور ہے ، لیکن آپ صلی اللہ علیہ وسلم نے تیسری مرتبہ پھر فرمایا کہ سوار ہو جا ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا کہ ہم سے ہشام اور شعبہ نے بیان کیا ، کہا کہ ہم سے قتادہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، وَشُعْبَةُ، قَالاَ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى رَجُلاً يَسُوقُ بَدَنَةً، فَقَالَ ‏\"‏ ارْكَبْهَا ‏\"‏‏.‏ قَالَ إِنَّهَا بَدَنَةٌ‏.‏ قَالَ ‏\"‏ ارْكَبْهَا ‏\"‏‏.‏ قَالَ إِنَّهَا بَدَنَةٌ‏.‏ قَالَ ‏\"‏ ارْكَبْهَا ‏\"‏‏.‏ ثَلاَثًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1622,
                "hadithNumber": "1691",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "During the last Hajj (Hajj-al-Wada`) of Allah's Messenger (ﷺ) he performed `Umra and Hajj. He drove a Hadi along with him from Dhul-Hulaifa. Allah's Messenger (ﷺ) started by assuming Ihram for `Umra and Hajj. And the people, too, performed the `Umra and Hajj along with the Prophet. Some of them brought the Hadi and drove it along with them, while the others did not. So, when the Prophet (ﷺ) arrived at Mecca. he said to the people, \"Whoever among you has driven the Hadi, should not finish his Ihram till he completes his Hajj. And whoever among you has not (driven) the Hadi with him, should perform Tawaf of the Ka`ba and the Tawaf between Safa and Marwa, then cut short his hair and finish his Ihram, and should later assume Ihram for Hajj; but he must offer a Hadi (sacrifice); and if anyone cannot afford a Hadi, he should fast for three days during the Hajj and seven days when he returns home. The Prophet (ﷺ) performed Tawaf of the Ka`ba on his arrival (at Mecca); he touched the (Black Stone) corner first of all and then did Ramal (fast walking with moving of the shoulders) during the first three rounds round the Ka`ba, and during the last four rounds he walked. After finishing Tawaf of the Ka`ba, he offered a two rak`at prayer at Maqam Ibrahim, and after finishing the prayer he went to Safa and Marwa and performed seven rounds of Tawaf between them and did not do any deed forbidden because of Ihram, till he finished all the ceremonies of his Hajj and sacrificed his Hadi on the day of Nahr (10th day of Dhul-Hijja). He then hastened onwards (to Mecca) and performed Tawaf of the Ka`ba and then everything that was forbidden because of Ihram became permissible. Those who took and drove the Hadi with them did the same as Allah's Messenger (ﷺ) did.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے حجۃ الوداع میں تمتع کیا یعنی عمرہ کر کے پھر حج کیا اور آپ صلی اللہ علیہ وسلم ذی الحلیفہ سے اپنے ساتھ قربانی لے گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے پہلے عمرہ کے لیے احرام باندھا ، پھر حج کے لیے لبیک پکارا ۔ لوگوں نے بھی نبی کریم صلی اللہ علیہ وسلم کے ساتھ تمتع کیا یعنی عمرہ کر کے حج کیا ، لیکن بہت سے لوگ اپنے ساتھ قربانی کا جانور لے گئے تھے اور بہت سے نہیں لے گئے تھے ۔ جب آنحضرت صلی اللہ علیہ وسلم مکہ تشریف لائے تو لوگوں سے کہا کہ جو شخص قربانی ساتھ لایا ہو اس کے لیے حج پورا ہونے تک کوئی بھی ایسی چیز حلال نہیں ہو سکتی جسے اس نے اپنے اوپر ( احرام کی وجہ سے ) حرام کر لیا ہے لیکن جن کے ساتھ قربانی نہیں ہے تو وہ بیت اللہ کا طوف کر لیں اور صفا اور مروہ کی سعی کر کے بال ترشوا لیں اور حلال ہو جائیں ، پھر حج کے لیے ( از سر نو آٹھویں ذی الحجہ کو احرام باندھیں ) ایسا شخص اگر قربانی نہ پائے تو تین دن کے روزے حج ہی کے دنوں میں اور سات دن کے روزے گھر واپس آ کر رکھے ۔ جب آنحضرت صلی اللہ علیہ وسلم مکہ پہنچے تو سب سے پہلے آپ صلی اللہ علیہ وسلم نے طواف کیا پھر حجراسود کو بوسہ دیا ، تین چکروں میں آپ صلی اللہ علیہ وسلم نے رمل کیا اور باقی چار میں معمولی رفتار سے چلے ، پھر بیت اللہ کا طواف پورا کر کے مقام ابراہیم کے پاس دو رکعت نماز پڑھی سلام پھیر کر آپ صلی اللہ علیہ وسلم صفا پہاڑی کی طرف آئے اور صفا اور مروہ کی سعی بھی سات چکروں میں پوری کی ۔ جن چیزوں کو ( احرام کی وجہ سے اپنے پر ) حرام کر لیا تھا ان سے اس وقت تک آپ صلی اللہ علیہ وسلم حلال نہیں ہوئے جب تک حج بھی پورا نہ کر لیا اور یوم النحر ( دسویں ذی الحجہ ) میں قربانی کا جانور بھی ذبح نہ کر لیا ۔ پھر آپ صلی اللہ علیہ وسلم ( مکہ واپس ) آئے اور بیت اللہ کا جب طواف افاضہ کر لیا تو ہر وہ چیز آپ کے لیے حلال ہو گئی جو احرام کی وجہ سے حرام تھی جو لوگ اپنے ساتھ ہدی لے کر گئے تھے انہوں نے بھی اسی طرح کیا جیسے رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے سالم بن عبداللہ نے کہ عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ قَالَ تَمَتَّعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ بِالْعُمْرَةِ إِلَى الْحَجِّ، وَأَهْدَى فَسَاقَ مَعَهُ الْهَدْىَ مِنْ ذِي الْحُلَيْفَةِ، وَبَدَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَهَلَّ بِالْعُمْرَةِ، ثُمَّ أَهَلَّ بِالْحَجِّ، فَتَمَتَّعَ النَّاسُ مَعَ النَّبِيِّ صلى الله عليه وسلم بِالْعُمْرَةِ إِلَى الْحَجِّ، فَكَانَ مِنَ النَّاسِ مَنْ أَهْدَى فَسَاقَ الْهَدْىَ، وَمِنْهُمْ مَنْ لَمْ يُهْدِ، فَلَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ، قَالَ لِلنَّاسِ ‏ \"‏ مَنْ كَانَ مِنْكُمْ أَهْدَى فَإِنَّهُ لاَ يَحِلُّ لِشَىْءٍ حَرُمَ مِنْهُ حَتَّى يَقْضِيَ حَجَّهُ، وَمَنْ لَمْ يَكُنْ مِنْكُمْ أَهْدَى فَلْيَطُفْ بِالْبَيْتِ، وَبِالصَّفَا وَالْمَرْوَةِ، وَلْيُقَصِّرْ، وَلْيَحْلِلْ، ثُمَّ لِيُهِلَّ بِالْحَجِّ، فَمَنْ لَمْ يَجِدْ هَدْيًا فَلْيَصُمْ ثَلاَثَةَ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةً إِذَا رَجَعَ إِلَى أَهْلِهِ ‏\"‏‏.‏ فَطَافَ حِينَ قَدِمَ مَكَّةَ، وَاسْتَلَمَ الرُّكْنَ أَوَّلَ شَىْءٍ، ثُمَّ خَبَّ ثَلاَثَةَ أَطْوَافٍ، وَمَشَى أَرْبَعًا، فَرَكَعَ حِينَ قَضَى طَوَافَهُ بِالْبَيْتِ عِنْدَ الْمَقَامِ رَكْعَتَيْنِ، ثُمَّ سَلَّمَ، فَانْصَرَفَ فَأَتَى الصَّفَا فَطَافَ بِالصَّفَا وَالْمَرْوَةِ سَبْعَةَ أَطْوَافٍ، ثُمَّ لَمْ يَحْلِلْ مِنْ شَىْءٍ حَرُمَ مِنْهُ حَتَّى قَضَى حَجَّهُ وَنَحَرَ هَدْيَهُ يَوْمَ النَّحْرِ، وَأَفَاضَ فَطَافَ بِالْبَيْتِ، ثُمَّ حَلَّ مِنْ كُلِّ شَىْءٍ حَرُمَ مِنْهُ، وَفَعَلَ مِثْلَ مَا فَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَنْ أَهْدَى وَسَاقَ الْهَدْىَ مِنَ النَّاسِ‏.‏",
                "headingArabic": "مَنْ سَاقَ الْبُدْنَ مَعَهُ",
                "headingUrdu": "جس نے بڈن کو اپنے ساتھ ہانکا۔",
                "headingEnglish": "Whoever drove the Budn alongwith him",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1623,
                "hadithNumber": "1692",
                "englishNarrator": "Narrated 'Urwa:",
                "hadithEnglish": "\" 'Aishah رضی اللہ عنہا informed me about the Hajj and 'Umra (together) of the Prophet (ﷺ) and so did the people who were with him (during the Hajj and 'Umra) and narration similar to the narration of the Ibn 'Umar\r\nرضی اللہ عنہما (previous hadith)",
                "hadithUrdu": "عائشہ رضی اللہ عنہا نے انہیں آنحضرت صلی اللہ علیہ وسلم کے حج اور عمرہ ایک ساتھ کرنے کی خبر دی کہ اور لوگوں نے بھی آپ کے ساتھ حج اور عمرہ ایک ساتھ کیا تھا ، بالکل اسی طرح جیسے مجھے سالم نے ابن عمر رضی اللہ عنہما سے اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے خبر دی تھی ۔",
                "urduNarrator": "عروہ سے روایت ہے کہ",
                "hadithArabic": "وَعَنْ عُرْوَةَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي تَمَتُّعِهِ بِالْعُمْرَةِ إِلَى الْحَجِّ فَتَمَتَّعَ النَّاسُ مَعَهُ بِمِثْلِ الَّذِي أَخْبَرَنِي سَالِمٌ عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1624,
                "hadithNumber": "1693",
                "englishNarrator": "Narrated `Abdullah (bin `Abdullah) bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"Stay here, for I am afraid that it (affliction between Ibn Zubair and Al-Hajjaj) might prevent you from reaching the Ka`ba.\" Ibn `Umar said, \"(In this case) I would do the same as Allah's Messenger (ﷺ) did, and Allah has said, 'Verily, in Allah's Messenger (ﷺ), you have a good example (to follow).' So, I make you, people, witness that I have made `Umra compulsory for me.\" So he assumed lhram for `Umra. Then he went out and when he reached Al- Baida', he assumed Ihram for Hajj and `Umra (together) and said, \"The conditions (requisites) of Hajj and `Umra are the same.\" He, then brought a Hadi from Qudaid. Then he arrived (at Mecca) and performed Tawaf (between Safa and Marwa) once for both Hajj and `Umra and did not finish the lhram till he had finished both Hajj and `Umra.",
                "hadithUrdu": "میرا خیال ہے کہ ( بدامنی کی وجہ سے ) آپ کو بیت اللہ تک پہنچنے سے روک دیا جائے گا ۔ انہوں نے فرمایا کہ پھر میں بھی وہی کام کروں گا جو ( ایسے موقعہ پر ) رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا اللہ تعالیٰ نے فرمایا ہے کہ ” تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے “ میں اب تمہیں گواہ بناتا ہوں کہ میں نے اپنے اوپر عمرہ واجب کر لیا ہے ، چنانچہ آپ نے عمرہ کا احرام باندھا ، انہوں نے بیان کیا کہ پھر آپ نکلے اور جب بیداء پہنچے تو حج اور عمرہ دونوں کا احرام باندھ لیا اور فرمایا کہ حج اور عمرہ دونوں تو ایک ہی ہیں اس کے بعد قدید پہنچ کر ہدی خریدی پھر مکہ آ کر دونوں کے لیے طواف کیا اور درمیان میں نہیں بلکہ دونوں سے ایک ہی ساتھ حلال ہوئے ۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے حمادنے بیان کیا ، ان سے ایوب نے ، ان سے نافع نے بیان کیا کہ عبیداللہ بن عبداللہ بن عمر رضی اللہ عنہما نے اپنے والد سے کہا ( جب وہ حج کے لیے نکل رہے تھے ) کہ آپ نہ جائیے کیوں کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهم ـ لأَبِيهِ أَقِمْ، فَإِنِّي لاَ آمَنُهَا أَنْ سَتُصَدُّ عَنِ الْبَيْتِ‏.‏ قَالَ إِذًا أَفْعَلَ كَمَا فَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ قَالَ اللَّهُ ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏}‏ فَأَنَا أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ عَلَى نَفْسِي الْعُمْرَةَ‏.‏ فَأَهَلَّ بِالْعُمْرَةِ، قَالَ ثُمَّ خَرَجَ حَتَّى إِذَا كَانَ بِالْبَيْدَاءِ أَهَلَّ بِالْحَجِّ وَالْعُمْرَةِ، وَقَالَ مَا شَأْنُ الْحَجِّ وَالْعُمْرَةِ إِلاَّ وَاحِدٌ‏.‏ ثُمَّ اشْتَرَى الْهَدْىَ مِنْ قُدَيْدٍ، ثُمَّ قَدِمَ فَطَافَ لَهُمَا طَوَافًا وَاحِدًا، فَلَمْ يَحِلَّ حَتَّى حَلَّ مِنْهُمَا جَمِيعًا‏.‏",
                "headingArabic": "مَنِ اشْتَرَى الْهَدْىَ مِنَ الطَّرِيقِ",
                "headingUrdu": "راستے میں ہادی خریدنا",
                "headingEnglish": "Buying the Hadi on the way",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1625,
                "hadithNumber": "1694, 1695",
                "englishNarrator": "Narrated Al-Miswar bin Makhrama رضی اللہ عنہما and Marwan:",
                "hadithEnglish": "The Prophet (ﷺ) set out from Medina with over one thousand of his companions (at the time of the Treaty of Hudaibiya) and when they reached Dhul-Hulaifa, the Prophet (ﷺ) garlanded his Hadi and marked it and assumed Ihram for `Umra.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم مدینہ سے تقریباً اپنے ایک ہزار ساتھیوں کے ساتھ ( حج کے لیے نکلے ) جب ذی الحلیفہ پہنچے تو نبی کریم صلی اللہ علیہ وسلم نے ہدی کو ہار پہنایا اور اشعار کیا پھر عمرہ کا احرام باندھا ۔",
                "urduNarrator": "ہم سے احمد بن محمد نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا کہ ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں عروہ بن زبیر نے ، اور ان سے مسور بن مخرمہ رضی اللہ عنہما اور مروان نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، وَمَرْوَانَ، قَالاَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم مِنَ الْمَدِينَةِ زَمَنَ الْحُدَيْبِيَةِ فِي بِضْعَ عَشْرَةَ مِائَةً مِنْ أَصْحَابِهِ، حَتَّى إِذَا كَانُوا بِذِي الْحُلَيْفَةِ قَلَّدَ النَّبِيُّ صلى الله عليه وسلم الْهَدْىَ وَأَشْعَرَ وَأَحْرَمَ بِالْعُمْرَةِ‏.‏",
                "headingArabic": "مَنْ أَشْعَرَ وَقَلَّدَ بِذِي الْحُلَيْفَةِ ثُمَّ أَحْرَمَ",
                "headingUrdu": "ذوالحلیفہ میں نشان لگانا اور ہار پہنانا اور پھر احرام باندھنا",
                "headingEnglish": "Marking and garlanding (the Hadi) at Dhul-Hulaifa and then assuming Ihram",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1626,
                "hadithNumber": "1696",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I twisted with my own hands the garlands for the Budn of the Prophet (ﷺ) who garlanded and marked them, and then made them proceed to Mecca; Yet no permissible thing was regarded as illegal for him then.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے قربانی کے جانوروں کے ہار میں نے اپنے ہاتھ سے خود بٹے تھے ، پھر آپ صلی اللہ علیہ وسلم نے انہیں ہار پہنایا ، اشعار کیا ، ان کو مکہ کی طرف روانہ کیا پھر بھی آپ کے لیے جو چیزیں حلال تھیں وہ ( احرام سے پہلے صرف ہدی سے ) حرام نہیں ہوئیں ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا کہ ہم سے افلح نے بیان کیا ، ان سے قاسم نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا أَفْلَحُ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ فَتَلْتُ قَلاَئِدَ بُدْنِ النَّبِيِّ صلى الله عليه وسلم بِيَدَىَّ، ثُمَّ قَلَّدَهَا وَأَشْعَرَهَا وَأَهْدَاهَا، فَمَا حَرُمَ عَلَيْهِ شَىْءٌ كَانَ أُحِلَّ لَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1601,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=64",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=62",
                "label": "62",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=63",
                "label": "63",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=64",
                "label": "64",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=65",
                "label": "65",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=66",
                "label": "66",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=67",
                "label": "67",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=68",
                "label": "68",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=66",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=66",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=64",
        "to": 1625,
        "total": 40465
    }
}