{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 194,
        "data": [
            {
                "id": 4828,
                "hadithNumber": "5052",
                "englishNarrator": "Narrated `Abdullah bin `Amr bin Al `As رضی اللہ عنہ :",
                "hadithEnglish": "My father got me married to a lady of a noble family, and often used to ask my wife about me, and she used to reply, \"What a wonderful man he is! He never comes to my bed, nor has he approached me since he married me.\" When this state continued for a long period, my father told the story to the Prophet who said to my father, \"Let me meet him.\" Then I met him and he asked me, \"How do you fast?\" I replied, \"I fast daily,\" He asked, \"How long does it take you to finish the recitation of the whole Qur'an?\" I replied, \"I finish it every night.\" On that he said, \"Fast for three days every month and recite the Qur'an (and finish it) in one month.\" I said, \"But I have power to do more than that.\" He said, \"Then fast for three days per week.\" I said, \"i have the power to do more than that.\" He said, \"Therefore, fast the most superior type of fasting, (that is, the fasting of (prophet) David who used to fast every alternate day; and finish the recitation of the whole Qur'an In seven days.\" I wish I had accepted the permission of Allah's Messenger (ﷺ) as I have become a weak old man. It is said that `Abdullah رضی اللہ عنہما used to recite one-seventh of the Qur'an during the day-time to some of his family members, for he used to check his memorization of what he would recite at night during the daytime so that it would be easier for him to read at night. And whenever he wanted to gain some strength, he used to give up fasting for some days and count those days to fast for a similar period, for he disliked to leave those things which he used to do during the lifetime of the Prophet. Imam Bukhari says: Some people said to finish the Quran within three days, some said within five day and most of them said within seven days.",
                "hadithUrdu": "میرے والد عمرو بن العاص رضی اللہ عنہ نے میرا نکاح ایک شریف خاندان کی عورت ( ام محمد بنت محمیہ ) سے کر دیا تھا اور ہمیشہ اس کی خبرگیری کرتے رہتے تھے اور ان سے باربار اس کے شوہر ( یعنی خود ان ) کے متعلق پوچھتے رہتے تھے ۔ میری بیوی کہتی کہ بہت اچھا مرد ہے ۔ البتہ جب سے میں ان کے نکاح میں آئی ہوں انہوں نے اب تک ہمارے بستر پر قدم بھی نہیں رکھا نہ میرے کپڑے میں کبھی ہاتھ ڈالا ۔ جب بہت دن اسی طرح ہو گئے تو والد صاحب نے مجبور ہو کر اس کا تذکرہ نبی کریم صلی اللہ علیہ وسلم سے کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا مجھ سے اس کی ملاقات کراؤ ۔ چنانچہ میں اس کے بعد آنحضرت صلی اللہ علیہ وسلم سے ملا ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ روزہ کس طرح رکھتے ہو ۔ میں نے عرض کیا کہ روزانہ پھر دریافت فرمایا قرآن مجید کس طرح ختم کرتے ہو ؟ میں نے عرض کیا ہر رات ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہر مہینے میں تین دن روزے رکھو اور قرآن ایک مہینے میں ختم کرو ۔ بیان کیا کہ میں نے عرض کیا یا رسول اللہ ! مجھے اس سے زیادہ کی طاقت ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر بلا روزے کے رہو اور ایک دن روزے سے ۔ میں نے عرض کیا مجھے اس سے بھی زیادہ کی طاقت ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر وہ روزہ رکھو جو سب سے افضل ہے ، یعنی داؤد علیہ السلام کا روزہ ، ایک دن روزہ رکھو اور ایک دن افطار کرو اور قرآن مجید سات دن میں ختم کرو ۔ عبداللہ بن عمرو رضی اللہ عنہما کہا کرتے تھے کاش میں نے آنحضرت صلی اللہ علیہ وسلم کی رخصت قبول کر لی ہوتی کیونکہ اب میں بوڑھا اور کمزور ہو گیا ہوں ۔ حجاج نے کہا کہ آپ اپنے گھر کے کسی آدمی کو قرآن مجید کا ساتواں حصہ یعنی ایک منزل دن میں سنا دیتے تھے ۔ جتنا قرآن مجید آپ رات کے وقت پڑھتے اسے پہلے دن میں سنا رکھتے تاکہ رات کے وقت آسانی سے پڑھ سکیں اور جب ( قوت ختم ہو جاتی اور نڈھال ہو جاتے اور ) قوت حاصل کرنی چاہتے تو کئی کئی دن روزہ نہ رکھتے کیونکہ آپ کو یہ پسند نہیں تھا کہ جس چیز کا رسول اللہ صلی اللہ علیہ وسلم کے آگے وعدہ کر لیا ہے ( ایک دن روزہ رکھنا ایک دن افطار کرنا ) اس میں سے کچھ بھی چھوڑ یں ۔ امام بخاری کہتے ہیں کہ بعض راویوں نے تین دن میں اور بعض نے پانچ دن میں ۔ لیکن اکثر نے سات راتوں میں ختم کی حدیث روایت کی ہے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابو عوانہ نے ، ان سے مغیر ہ بن مقسم نے ، ان سے مجاہد بن جبیر نے اور ان سے عبداللہ بن عمر و رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مُغِيرَةَ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ أَنْكَحَنِي أَبِي امْرَأَةً ذَاتَ حَسَبٍ فَكَانَ يَتَعَاهَدُ كَنَّتَهُ فَيَسْأَلُهَا عَنْ بَعْلِهَا فَتَقُولُ نِعْمَ الرَّجُلُ مِنْ رَجُلٍ لَمْ يَطَأْ لَنَا فِرَاشًا وَلَمْ يُفَتِّشْ لَنَا كَنَفًا مُذْ أَتَيْنَاهُ فَلَمَّا طَالَ ذَلِكَ عَلَيْهِ ذَكَرَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ الْقَنِي بِهِ ‏\"‏‏.‏ فَلَقِيتُهُ بَعْدُ فَقَالَ ‏\"‏ كَيْفَ تَصُومُ ‏\"‏‏.‏ قَالَ كُلَّ يَوْمٍ‏.‏ قَالَ ‏\"‏ وَكَيْفَ تَخْتِمُ ‏\"‏‏.‏ قَالَ كُلَّ لَيْلَةً‏.‏ قَالَ ‏\"‏ صُمْ فِي كُلِّ شَهْرٍ ثَلاَثَةً وَاقْرَإِ الْقُرْآنَ فِي كُلِّ شَهْرٍ ‏\"‏‏.‏ قَالَ قُلْتُ أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ‏.‏ قَالَ ‏\"‏ صُمْ ثَلاَثَةَ أَيَّامٍ فِي الْجُمُعَةِ ‏\"‏‏.‏ قُلْتُ أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ‏.‏ قَالَ ‏\"‏ أَفْطِرْ يَوْمَيْنِ وَصُمْ يَوْمًا ‏\"‏‏.‏ قَالَ قُلْتُ أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ‏.‏ قَالَ ‏\"‏ صُمْ أَفْضَلَ الصَّوْمِ صَوْمِ دَاوُدَ صِيَامَ يَوْمٍ وَإِفْطَارَ يَوْمٍ وَاقْرَأْ فِي كُلِّ سَبْعِ لَيَالٍ مَرَّةً ‏\"‏‏.‏ فَلَيْتَنِي قَبِلْتُ رُخْصَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَذَاكَ أَنِّي كَبِرْتُ وَضَعُفْتُ فَكَانَ يَقْرَأُ عَلَى بَعْضِ أَهْلِهِ السُّبْعَ مِنَ الْقُرْآنِ بِالنَّهَارِ وَالَّذِي يَقْرَؤُهُ يَعْرِضُهُ مِنَ النَّهَارِ لِيَكُونَ أَخَفَّ عَلَيْهِ بِاللَّيْلِ وَإِذَا أَرَادَ أَنْ يَتَقَوَّى أَفْطَرَ أَيَّامًا وَأَحْصَى وَصَامَ مِثْلَهُنَّ كَرَاهِيةَ أَنْ يَتْرُكَ شَيْئًا فَارَقَ النَّبِيَّ صلى الله عليه وسلم عَلَيْهِ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ بَعْضُهُمْ فِي ثَلاَثٍ وَفِي خَمْسٍ وَأَكْثَرُهُمْ عَلَى سَبْعٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4829,
                "hadithNumber": "5053",
                "englishNarrator": "Narrated `Abdullah bin `Amr رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) asked me, \"How long does it take you to finish the recitation of the whole Qur'an?\"",
                "hadithUrdu": "مجھ سے رسول کریم صلی اللہ علیہ وسلم نے دریافت فرمایا ۔ قرآن مجید تم کتنے دن میں ختم کر لیتے ہو ؟",
                "urduNarrator": "ہم سے سعد بن حفص نے بیان کیا ، کہا ہم سے شیبان نے بیان کیا ، ان سے یحییٰ بن ابی کثیر نے ، ان سے محمد بن عبدالرحمٰن نے ، ان سے ابوسلمہ بن عبدالرحمٰن بن عوف نے اور ان سے حضرت عبداللہ بن عمر وبن عاص رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ فِي كَمْ تَقْرَأُ الْقُرْآنَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4830,
                "hadithNumber": "5054",
                "englishNarrator": "Narrated `Abdullah bin `Amr رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said to me, \"Recite the whole Qur'an in one month's time.\" I said, \"But I have power (to do more than that).\" Allah's Messenger (ﷺ) said, \"Then finish the recitation of the Qur'an in seven days, and do not finish it in less than this period.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے مجھ سے فرمایا ہر مہینے میں قرآن کا ایک ختم کیا کرو میں نے عرض کیا مجھ کو تو زیادہ پڑھنے کی طاقت ہے ۔ آپ نے فرمایا اچھا سات راتوں میں ختم کیا کر اس سے زیادہ مت پڑھ ۔",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا ، کہا ہم کو عبیداللہ بن موسیٰ نے خبر دی ، انہیں شیبان نے ، انہیں یحییٰ بن ابی کثیر نے ، انہیں بنی زہرہ کے مولیٰ محمد بن عبدالرحمٰن نے ، انہیں ابوسلمہ بن عبدالرحمٰن نے ، یحییٰ نے کہا اور میں خیال کرتا ہوں شاید میں نے یہ حدیث خود ابوسلمہ سے سنی ہے ۔ بلاواسطہ ( محمد بن عبدالرحمٰن کے ) خیر ابوسلمہ نے عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے روایت کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، عَنْ شَيْبَانَ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، مَوْلَى بَنِي زُهْرَةَ عَنْ أَبِي سَلَمَةَ ـ قَالَ وَأَحْسِبُنِي قَالَ ـ سَمِعْتُ أَنَا مِنْ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْرَإِ الْقُرْآنَ فِي شَهْرٍ ‏\"‏‏.‏ قُلْتُ إِنِّي أَجِدُ قُوَّةً حَتَّى قَالَ ‏\"‏ فَاقْرَأْهُ فِي سَبْعٍ وَلاَ تَزِدْ عَلَى ذَلِكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4831,
                "hadithNumber": "5055",
                "englishNarrator": "Narrated `Abdullah (bin Mas`ud) رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said (to me), \"Recite the Qur'an to me.\" I said, \"Shall I recite (it) to you while it has been revealed to you?\" He said, \"I like to hear it from another person.\" So I recited Surat An-Nisa (The Women) till I reached the Verse: 'How (will it be) then when We bring from each nation a witness, and We bring you (O Muhammad) as a witness against these people.' (4.41) Then he said to me, \"Stop!\" Thereupon I saw his eyes overflowing with tears.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میرے سامنے قرآن مجید کی تلاوت کرو ۔ میں نے عرض کیا آنحضرت صلی اللہ علیہ وسلم کے سامنے میں کیا تلاوت کروں آپ پر تو قرآن مجید نازل ہی ہوتا ہے ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ میں چاہتا ہوں کہ کسی اور سے سنوں ۔ راوی نے بیان کیا کہ پھر میں نے سورۃ نساء پڑھی اور جب میں آیت فکیف اذا جئنا من کل امۃ بشھید وجئنا بک علیٰ ھٰولاء شھیدا پر پہنچا تو آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ ٹھہر جاؤ ( آنحضرت صلی اللہ علیہ وسلم نے ) کف فرمایا یا امسک راوی کو شک ہے ۔ میں نے دیکھا کہ آنحضرت صلی اللہ علیہ وسلم کی آنکھوں سے آنسو بہہ رہے تھے ۔",
                "urduNarrator": "دوسری سند ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے ، ان سے سفیان ثوری نے ، ان سے اعمش نے ، ان سے ابراہیم نے ، ان سے عبیدہ سلمانی نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے ۔ اعمش نے بیان کیا کہ میں نے اس حدیث کا ایک ٹکڑا تو خود ابراہیم سے سنا اور ایک ٹکڑا اس حدیث کا مجھ سے عمرو بن مرہ نے نقل کیا ، ان سے ابراہیم نے ، ان سے ان کے والد نے ، ان سے ابوالضحیٰ نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا يَحْيَى، عَنْ سُفْيَانَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ يَحْيَى بَعْضُ الْحَدِيثِ عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ لِي النَّبِيُّ صلى الله عليه وسلم‏.‏ ـ حَدَّثَنَا مُسَدَّدٌ عَنْ يَحْيَى عَنْ سُفْيَانَ عَنِ الأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبِيدَةَ عَنْ عَبْدِ اللَّهِ قَالَ الأَعْمَشُ وَبَعْضُ الْحَدِيثِ حَدَّثَنِي عَمْرُو بْنُ مُرَّةَ عَنْ إِبْرَاهِيمَ وَعَنْ أَبِيهِ عَنْ أَبِي الضُّحَى عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْرَأْ عَلَىَّ ‏\"‏‏.‏ قَالَ قُلْتُ أَقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ قَالَ ‏\"‏ إِنِّي أَشْتَهِي أَنْ أَسْمَعَهُ مِنْ غَيْرِي ‏\"‏‏.‏ قَالَ فَقَرَأْتُ النِّسَاءَ حَتَّى إِذَا بَلَغْتُ ‏{‏فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلاَءِ شَهِيدًا‏}‏‏.‏ قَالَ لِي ‏\"‏ كُفَّ ـ أَوْ أَمْسِكْ ـ ‏\"‏‏.‏ فَرَأَيْتُ عَيْنَيْهِ تَذْرِفَانِ‏.‏",
                "headingArabic": "الْبُكَاءِ عِنْدَ قِرَاءَةِ الْقُرْآنِ",
                "headingUrdu": "قرآن کی تلاوت کرتے وقت رونا",
                "headingEnglish": "To weep while reciting the Qur'an",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4832,
                "hadithNumber": "5056",
                "englishNarrator": "Narrated `Abdullah bin Masud رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said to me, \"Recite Qur'an to me.\" I said to him. \"Shall I recite (it) to you while it has been revealed to you?\" He said, \"I like to hear it from another person.\"",
                "hadithUrdu": "مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فر مایا مجھے قرآن مجید پڑھ کر سناو ۔ میں نے عرض کیا کیا میں سناؤں آپ صلی اللہ علیہ وسلم پر تو قر آن مجید نازل ہوتا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں کسی سے سننا محبوب رکھتا ہوں ۔",
                "urduNarrator": "ہم سے قیس بن حفص نے بیان کیا ، کہا ہم سے عبدالواحد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، ان سے ابراہیم نے بیان کیا ، ان سے عبیدہ سلمانی نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ السَّلْمَانِيِّ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ لِي النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اقْرَأْ عَلَىَّ ‏\"‏‏.‏ قُلْتُ أَقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ قَالَ ‏\"‏ إِنِّي أُحِبُّ أَنْ أَسْمَعَهُ مِنْ غَيْرِي ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4833,
                "hadithNumber": "5057",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"In the last days (of the world) there will appear young people with foolish thoughts and ideas. They will give good talks, but they will go out of Islam as an arrow goes out of its game, their faith will not exceed their throats. So, wherever you find them, kill them, for there will be a reward for their killers on the Day of Resurrection.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ آخری زمانہ میں ایک قوم پیدا ہو گی نوجوانوں اور کم عقلوں کی ۔ یہ لوگ ایسا بہترین کلام پڑھیں گے جو بہترین خلق کا ( پیغمبر کا ) ہے یا ایسا کلام پڑھیں گے جو سارے خلق کے کلاموں سے افضل ہے ۔ ( یعنی حدیث یا آیت پڑھیں گے اس سے سند لائیں گے ) لیکن اسلام سے وہ اس طرح نکل جائیں گے جیسے تیر شکار کو پار کر کے نکل جاتا ہے ان کا ایمان ان کے حلق سے نیچے نہیں اترے گا تم انہیں جہاں بھی پاؤ قتل کر دو ۔ کیونکہ ان کا قتل قیامت میں اس شخص کے لئے باعث اجر ہو گا جو انہیں قتل کر دے گا ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان ثوری نے خبر دی ، کہا ہم سے اعمش نے بیان کیا ، ان سے خیثمہ بن عبدالرحمٰن کوفی نے ، ان سے سوید بن غفلہ نے اور ان سے حضرت علی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا الأَعْمَشُ، عَنْ خَيْثَمَةَ، عَنْ سُوَيْدِ بْنِ غَفَلَةَ، قَالَ عَلِيٌّ رضى الله عنه سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ يَأْتِي فِي آخِرِ الزَّمَانِ قَوْمٌ حُدَثَاءُ الأَسْنَانِ، سُفَهَاءُ الأَحْلاَمِ، يَقُولُونَ مِنْ خَيْرِ قَوْلِ الْبَرِيَّةِ، يَمْرُقُونَ مِنَ الإِسْلاَمِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ، لاَ يُجَاوِزُ إِيمَانُهُمْ حَنَاجِرَهُمْ، فَأَيْنَمَا لَقِيتُمُوهُمْ فَاقْتُلُوهُمْ، فَإِنَّ قَتْلَهُمْ أَجْرٌ لِمَنْ قَتَلَهُمْ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏",
                "headingArabic": "مَنْ رَايَا بِقِرَاءَةِ الْقُرْآنِ أَوْ تَأَكَّلَ بِهِ أَوْ فَخَرَ بِهِ",
                "headingUrdu": "اس شخص کا گناہ جو قرآن کی تلاوت دکھاوے یا دنیاوی فائدے کے لیے کرتا ہے یا فخر محسوس کرتا ہے وغیرہ۔",
                "headingEnglish": "The sin of the person who recites the Qur'an to show off or to gain some worldly benefit, or to feel proud etc.",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4834,
                "hadithNumber": "5058",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"There will appear some people among you whose prayer will make you look down upon yours, and whose fasting will make you look down upon yours, but they will recite the Qur'an which will not exceed their throats (they will not act on it) and they will go out of Islam as an arrow goes out through the game whereupon the archer would examine the arrowhead but see nothing, and look at the unfeathered arrow but see nothing, and look at the arrow feathers but see nothing, and finally he suspects to find something in the lower part of the arrow.\"",
                "hadithUrdu": "میں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم میں ایک قوم ایسی پیداہو گی کہ تم اپنی نماز کو ان کی نماز کے مقابلہ میں حقیر سمجھو گے ، ان کے روزوں کے مقابلہ میں تمہیں اپنے روزے اور ان کے عمل کے مقابلہ میں تمہیں اپنا عمل حقیر نظر آئے گا اور وہ قرآن مجید کی تلاوت بھی کریں گے لیکن قرآن مجید ان کے حلق سے نیچے نہیں اترے گا ۔ دین سے وہ اس طرح نکل جائیں گے جیسے تیر شکار کو پار کرتے ہوئے نکل جاتا ہے اور وہ بھی اتنی صفائی کے ساتھ ( کہ تیر چلانے والا ) تیر کے پھل میں دیکھتا ہے تو اس میں بھی ( شکار کے خون وغیر ہ کا ) کوئی اثر نظر نہیں آتا ۔ اس سے اوپر دیکھتا ہے وہاں بھی کچھ نظر نہیں آتا ۔ تیر کے پر پر دیکھتا ہے اور وہاں بھی کچھ نظر نہیں آتا ۔ بس سوفار میں کچھ شبہ گزرتا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں یحییٰ بن سعید انصاری نے ، انہیں محمد بن ابراہیم بن حارث تیمی نے ، انہیں ابوسلمہ بن عبدالرحمٰن نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ أَنَّهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ يَخْرُجُ فِيكُمْ قَوْمٌ تَحْقِرُونَ صَلاَتَكُمْ مَعَ صَلاَتِهِمْ، وَصِيَامَكُمْ مَعَ صِيَامِهِمْ، وَعَمَلَكُمْ مَعَ عَمَلِهِمْ، وَيَقْرَءُونَ الْقُرْآنَ لاَ يُجَاوِزُ حَنَاجِرَهُمْ، يَمْرُقُونَ مِنَ الدِّينَ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ، يَنْظُرُ فِي النَّصْلِ فَلاَ يَرَى شَيْئًا، وَيَنْظُرُ فِي الْقِدْحِ فَلاَ يَرَى شَيْئًا، وَيَنْظُرُ فِي الرِّيشِ فَلاَ يَرَى شَيْئًا، وَيَتَمَارَى فِي الْفُوقِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4835,
                "hadithNumber": "5059",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The example of a believer who recites the Qur'an and acts on it, like a citron which tastes nice and smells nice. And the example of a believer who does not recite the Qur'an but acts on it, is like a date which tastes good but has no smell. And the example of a hypocrite who recites the Qur'an is like a Raihana (sweet basil) which smells good but tastes bitter And the example of a hypocrite who does not recite the Qur'an is like a colocynth which tastes bitter and has a bad smell.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اس مومن کی مثال جو قرآن مجید پڑھتا ہے اور اس پر عمل بھی کرتا ہے میٹھے لیموں کی سی ہے جس کا مزا بھی لذت دار اور خوشبو بھی اچھی اور وہ مومن جو قرآن پڑھتا تو نہیں لیکن اس پر عمل کرتا ہے اس کی مثال کھجور کی ہے جس کا مزہ تو عمدہ ہے لیکن خوشبو کے بغیر اور اس منافق کی مثال جو قرآن پڑھتا ہے ریحان کی سی ہے جس کی خوشبو تو اچھی ہوتی ہے لیکن مزا کڑوا ہوتا ہے اور اس منافق کی مثال جو قرآن بھی نہیں پڑھتا اندرائن کے پھل کی سی ہے جس کا مزہ بھی کڑوا ہوتا ہے ( راوی کو شک ہے ) کہ لفظ ” مر “ ہے یا ” خبیث “ اور اس کی بو بھی خراب ہوتی ہے ۔",
                "urduNarrator": "ہم سے مسدد بن مسر ہد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے قتادہ نے ، ان سے حضرت انس بن مالک نے اور ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمُؤْمِنُ الَّذِي يَقْرَأُ الْقُرْآنَ وَيَعْمَلُ بِهِ كَالأُتْرُجَّةِ، طَعْمُهَا طَيِّبٌ وَرِيحُهَا طَيِّبٌ، وَالْمُؤْمِنُ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ وَيَعْمَلُ بِهِ كَالتَّمْرَةِ، طَعْمُهَا طَيِّبٌ وَلاَ رِيحَ لَهَا، وَمَثَلُ الْمُنَافِقِ الَّذِي يَقْرَأُ الْقُرْآنَ كَالرَّيْحَانَةِ، رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ، وَمَثَلُ الْمُنَافِقِ الَّذِي لاَ يَقْرَأُ الْقُرْآنَ كَالْحَنْظَلَةِ، طَعْمُهَا مُرٌّ ـ أَوْ خَبِيثٌ ـ وَرِيحُهَا مُرٌّ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4836,
                "hadithNumber": "5060",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Recite (and study) the Qur'an as long as you agree about its interpretation, but if you have any difference of opinion (as regards to its interpretation and meaning) then you should stop reciting it (for the time being).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، قرآن مجید اس وقت تک پڑھو جب تک اس میں دل لگے ، جب جی اچا ٹ ہونے لگے تو پڑھنا بند کر دو ۔",
                "urduNarrator": "ہم سے ابو النعمان نے بیان کیا ، کہا ہم سے حماد نے بیان کیا ، ان سے ابو عمران جونی نے اور ان سے حضرت جندب بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ جُنْدَبِ بْنِ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ اقْرَءُوا الْقُرْآنَ مَا ائْتَلَفَتْ قُلُوبُكُمْ، فَإِذَا اخْتَلَفْتُمْ فَقُومُوا عَنْهُ ‏\"‏‏.‏",
                "headingArabic": "اقْرَءُوا الْقُرْآنَ مَا ائْتَلَفَتْ قُلُوبُكُمْ",
                "headingUrdu": "جب تک تم اس کی تفسیر پر متفق ہو قرآن کو ایک ساتھ پڑھو",
                "headingEnglish": "Recite the Qur'an together as long as you agree about its interpretation",
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4837,
                "hadithNumber": "5061",
                "englishNarrator": "Narrated Jundub رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Recite (and study) the Qur'an as long as you agree about its interpretation, but when you have any difference of opinion (as regards its interpretation and meaning) then you should stop reciting it (for the time being). Harith bin Obaid and Saeed bin Zaid have reported similarly from Abu Imran. Hamad bin Salamah and Aban did not report it tracing it to the prophet ﷺ. Ghunder, Shobah, Abu Imran has reported Hadrat Jundab's saying. Ibn-e-Aun, Abu Imran has reported Hadrat Judab's saying. Ibn-e-Aun, Abu Imran, Abdullah bin Samit report Hadrat Umer's saying but the narration of Hadrat Jundab is more authentic and more famous.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اس قرآن کو جب ہی تک پڑھو جب تک تمہارے دل ملے جلے یا لگے رہیں ، جب اختلاف اور جھگڑا کرنے لگوتو اٹھ کھڑے ہو ۔ ( قرآن مجید پڑھنا موقوف کر دو ) سلام کے ساتھ اس حدیث کو حارث بن عبید اور سعید بن زید نے بھی ابو عمران جونی سے روایت کیا اور حماد بن سلمہ اور ابان نے اس کو مرفوع نہیں بلکہ موقوفاً روایت کیا ہے اور غندر محمد بن جعفر نے بھی شعبہ سے ، انہوں نے ابو عمران سے یوں روایت کیا کہ میں نے جندب سے سنا ، وہ کہتے تھے ۔ ( لیکن موقوفاً روایت کیا ) اور عبداللہ بن عون نے اس کو ابو عمران سے ، انہوں نے عبداللہ بن صامت سے ، انہوں نے حضرت عمر رضی اللہ عنہ سے ان کا قول روایت کیا ( مرفوعا نہیں کیا ) اور جندب کی روایت زیادہ صحیح ہے ۔",
                "urduNarrator": "ہم سے عمرو بن علی فلاس نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ، ان سے سلام بن ابی مطیع نے بیان کیا ، ان سے ابو عمران جونی نے اور ان سے حضرت جندب ابن عبداللہ رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سَلاَّمُ بْنُ أَبِي مُطِيعٍ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ جُنْدَبٍ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اقْرَءُوا الْقُرْآنَ مَا ائْتَلَفَتْ عَلَيْهِ قُلُوبُكُمْ فَإِذَا اخْتَلَفْتُمْ فَقُومُوا عَنْهُ ‏\"‏‏.‏ تَابَعَهُ الْحَارِثُ بْنُ عُبَيْدٍ وَسَعِيدُ بْنُ زَيْدٍ عَنْ أَبِي عِمْرَانَ وَلَمْ يَرْفَعْهُ حَمَّادُ بْنُ سَلَمَةَ وَأَبَانُ‏.‏ وَقَالَ غُنْدَرٌ عَنْ شُعْبَةَ عَنْ أَبِي عِمْرَانَ سَمِعْتُ جُنْدَبًا قَوْلَهُ‏.‏ وَقَالَ ابْنُ عَوْنٍ عَنْ أَبِي عِمْرَانَ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ عُمَرَ قَوْلَهُ، وَجُنْدَبٌ أَصَحُّ وَأَكْثَرُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4838,
                "hadithNumber": "5062",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "He heard a man reciting a Quranic Verse which he had heard the Prophet (ﷺ) reciting in a different way. So he took that man to the Prophet (and told him the story). The Prophet (ﷺ) said, \"Both of you are reciting in a correct way, so carry on reciting.\" The Prophet (ﷺ) further added, \"The nations which were before you were destroyed (by Allah) because they differed.\"",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے خلاف سنی تھی ۔ ( ابن مسعود رضی اللہ عنہما نے بیان کیا کہ ) پھر میں نے ان کا ہاتھ پکڑا اور انہیں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں لایا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم دونوں صحیح ہو ( اس لئے اپنے اپنے طور پر پڑھو ۔ ) ( شعبہ کہتے ہیں کہ ) میرا غالب گمان یہ ہے کہ آنحضرت صلی اللہ علیہ وسلم نے یہ بھی فرمایا ( اختلاف و نزاع نہ کیا کرو ) کیونکہ تم سے پہلے کی امتوں نے اختلاف کیا اور اسی وجہ سے اللہ تعالیٰ نے انہیں ہلاک کر دیا ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے ، ان سے عبدالملک بن میسرہ نے ، ان سے نزال بن سبرہ نے کہ عبداللہ بن مسعود رضی اللہ عنہما نے ایک صاحب ( ابی بن کعب رضی اللہ عنہ ) کو ایک آیت پڑھتے سنا ، وہی آیت",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ، عَنِ النَّزَّالِ بْنِ سَبْرَةَ، عَنْ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ رَجُلاً، يَقْرَأُ آيَةً، سَمِعَ النَّبِيَّ صلى الله عليه وسلم خِلاَفَهَا، فَأَخَذْتُ بِيَدِهِ فَانْطَلَقْتُ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ كِلاَكُمَا مُحْسِنٌ فَاقْرَآ ـ أَكْبَرُ عِلْمِي قَالَ ـ فَإِنَّ مَنْ كَانَ قَبْلَكُمُ اخْتَلَفُوا فَأَهْلَكَهُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "67",
                "bookSlug": "sahih-bukhari",
                "volume": "6",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 67,
                    "chapterNumber": "67",
                    "chapterEnglish": "Virtues of the Qur'an",
                    "chapterUrdu": "قرآن کے فضائل کا بیان",
                    "chapterArabic": "كتاب فضائل القرآن",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4839,
                "hadithNumber": "5063",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "A group of three men came to the houses of the wives of the Prophet (ﷺ) asking how the Prophet (ﷺ) worshipped (Allah), and when they were informed about that, they considered their worship insufficient and said, \"Where are we from the Prophet (ﷺ) as his past and future sins have been forgiven.\" Then one of them said, \"I will offer the prayer throughout the night forever.\" The other said, \"I will fast throughout the year and will not break my fast.\" The third said, \"I will keep away from the women and will not marry forever.\" Allah's Messenger (ﷺ) came to them and said, \"Are you the same people who said so-and-so? By Allah, I am more submissive to Allah and more afraid of Him than you; yet I fast and break my fast, I do sleep and I also marry women. So he who does not follow my tradition in religion, is not from me (not one of my followers).",
                "hadithUrdu": "تین حضرات ( علی بن ابی طالب ، عبداللہ بن عمرو بن العاص اور عثمان بن مظعون رضی اللہ عنہم ) نبی کریم صلی اللہ علیہ وسلم کی ازواج مطہرات کے گھروں کی طرف آپ کی عبادت کے متعلق پوچھنے آئے ، جب انہیں حضور اکرم صلی اللہ علیہ وسلم کا عمل بتایا گیاتو جیسے انہوں نے اسے کم سمجھا اور کہا کہ ہمارا آنحضرت صلی اللہ علیہ وسلم سے کیا مقابلہ ! آپ کی تو تمام اگلی پچھلی لغزشیں معاف کر دی گئی ہیں ۔ ان میں سے ایک نے کہا کہ آج سے میں ہمیشہ رات پھر نماز پڑھا کروں گا ۔ دوسرے نے کہا کہ میں ہمیشہ روزے سے رہوں گا اور کبھی ناغہ نہیں ہونے دوں گا ۔ تیسرے نے کہا کہ میں عورتوں سے جدائی اختیار کر لوں گا اور کبھی نکاح نہیں کروں گا ۔ پھر آنحضرت صلی اللہ علیہ وسلم تشریف لائے اور ان سے پوچھا کیا تم نے ہی یہ باتیں کہی ہیں ؟ سن لو ! اللہ تعالیٰ کی قسم ! اللہ رب العالمین سے میں تم سب سے زیادہ ڈرنے والا ہوں ۔ میں تم میں سب سے زیادہ پرہیزگار ہوں لیکن میں اگر روزے رکھتا ہوں تو افطار بھی کرتا ہوں ۔ نماز پڑھتا ہوں ( رات میں ) اور سوتا بھی ہوں اور میں عورتوں سے نکاح کرتا ہوں ۔ میرے طریقے سے جس نے بے رغبتی کی وہ مجھ میں سے نہیں ہے ۔",
                "urduNarrator": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم کو محمد بن جعفر نے خبر دی ، کہا ہم کو حمید بن ابی حمید طویل نے خبر دی ، انہوں نے حضرت انس بن مالک  رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنَا حُمَيْدُ بْنُ أَبِي حُمَيْدٍ الطَّوِيلُ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ جَاءَ ثَلاَثَةُ رَهْطٍ إِلَى بُيُوتِ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم يَسْأَلُونَ عَنْ عِبَادَةِ النَّبِيِّ صلى الله عليه وسلم فَلَمَّا أُخْبِرُوا كَأَنَّهُمْ تَقَالُّوهَا فَقَالُوا وَأَيْنَ نَحْنُ مِنَ النَّبِيِّ صلى الله عليه وسلم قَدْ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ‏.‏ قَالَ أَحَدُهُمْ أَمَّا أَنَا فَإِنِّي أُصَلِّي اللَّيْلَ أَبَدًا‏.‏ وَقَالَ آخَرُ أَنَا أَصُومُ الدَّهْرَ وَلاَ أُفْطِرُ‏.‏ وَقَالَ آخَرُ أَنَا أَعْتَزِلُ النِّسَاءَ فَلاَ أَتَزَوَّجُ أَبَدًا‏.‏ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ أَنْتُمُ الَّذِينَ قُلْتُمْ كَذَا وَكَذَا أَمَا وَاللَّهِ إِنِّي لأَخْشَاكُمْ لِلَّهِ وَأَتْقَاكُمْ لَهُ، لَكِنِّي أَصُومُ وَأُفْطِرُ، وَأُصَلِّي وَأَرْقُدُ وَأَتَزَوَّجُ النِّسَاءَ، فَمَنْ رَغِبَ عَنْ سُنَّتِي فَلَيْسَ مِنِّي ‏\"‏‏.‏",
                "headingArabic": "التَّرْغِيبُ فِي النِّكَاحِ",
                "headingUrdu": "شادی کی خواہش کو بیدار کرنا",
                "headingEnglish": "Awakening the desire for marriage",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4840,
                "hadithNumber": "5064",
                "englishNarrator": "Narrated 'Urwa:",
                "hadithEnglish": "He asked `Aisha رضی اللہ عنہا about the Statement of Allah: 'If you fear that you shall not be able to deal justly with the orphan girls, then marry (other) women of your choice, two or three or four; but if you fear that you shall not be able to deal justly (with them), then only one, or (the captives) that your right hands possess. That will be nearer to prevent you from doing injustice.' (4.3) `Aisha رضی اللہ عنہا said, \"O my nephew! (This Verse has been revealed in connection with) an orphan girl under the guardianship of her guardian who is attracted by her wealth and beauty and intends to marry her with a Mahr less than what other women of her standard deserve. So they (such guardians) have been forbidden to marry them unless they do justice to them and give them their full Mahr, and they are ordered to marry other women instead of them.\"",
                "hadithUrdu": "اور انہوں نے عائشہ رضی اللہ عنہا سے اللہ تعالیٰ کے اس ارشاد وإن خفتم أن لا تقسطوا في اليتامى فانكحواء ما طاب لكم من النساء کے متعلق پوچھا ” اور اگر تمہیں اندیشہ ہو کہ تم یتیموں سے انصاف نہ کرسکوگے تو جو عورتیں تمہیں پسند ہوں ان سے نکاح کر لو ۔ دودو سے ، خواہ تین تین سے ، خواہ چار چار سے ، لیکن اگر تمہیں اندیشہ ہو کہ تم انصاف نہیں کر سکوگے تو پھر ایک ہی پر بس کرو یا جو لونڈی تمہاری ملک میں ہو ، اس صورت میں قوی امید ہے کہ تم ظلم وزیادتی نہ کر سکوگے ۔ عائشہ رضی اللہ عنہا نے کہا بھانجے ! آیت میں ایسی یتیم مالدار لڑکی کا ذکر ہے جو اپنے ولی کی پرورش میں ہو ۔ وہ لڑکی کے مال اور اس کے حسن کی وجہ سے اس کی طرف مائل ہو اور اس سے معمولی مہر پر شادی کر نا چاہتا ہو تو ایسے شخص کو اس آیت میں ایسی لڑکی سے نکاح کرنے سے منع کیا گیا ہے ۔ ہا ں اگر اس کے ساتھ انصاف کر سکتا ہو اور پورا مہر ادا کرنے کا ارادہ رکھتا ہو تو اجازت ہے ، ورنہ ایسے لوگوں سے کہا گیا ہے کہ اپنی پرورش میں یتیم لڑکیوں کے سوا اور دوسری لڑکیوں سے شادی کر لیں ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انہوں نے حسان بن ابراہیم سے سنا ، انہوں نے یونس بن یزید ایلی سے ، ان سے زہری نے ، کہا مجھ کو عروہ بن زبیر نے خبر دی",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، سَمِعَ حَسَّانَ بْنَ إِبْرَاهِيمَ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّهُ سَأَلَ عَائِشَةَ عَنْ قَوْلِهِ تَعَالَى ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ مَثْنَى وَثُلاَثَ وَرُبَاعَ فَإِنْ خِفْتُمْ أَنْ لاَ تَعْدِلُوا فَوَاحِدَةً أَوْ مَا مَلَكَتْ أَيْمَانُكُمْ ذَلِكَ أَدْنَى أَنْ لاَ تَعُولُوا‏}‏‏.‏ قَالَتْ يَا ابْنَ أُخْتِي، الْيَتِيمَةُ تَكُونُ فِي حَجْرِ وَلِيِّهَا، فَيَرْغَبُ فِي مَالِهَا وَجَمَالِهَا، يُرِيدُ أَنْ يَتَزَوَّجَهَا بِأَدْنَى مِنْ سُنَّةِ صَدَاقِهَا، فَنُهُوا أَنْ يَنْكِحُوهُنَّ إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ فَيُكْمِلُوا الصَّدَاقَ، وَأُمِرُوا بِنِكَاحِ مَنْ سِوَاهُنَّ مِنَ النِّسَاءِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4841,
                "hadithNumber": "5065",
                "englishNarrator": "Narrated 'Alqama:",
                "hadithEnglish": "While I was with `Abdullah رضی اللہ عنہما , `Uthman رضی اللہ عنہ met him at Mina and said, \"O Abu `Abdur-Rahman ! I have something to say to you.\" So both of them went aside and `Uthman رضی اللہ عنہ said, \"O Abu `Abdur-Rahman! Shall we marry you to a virgin who will make you remember your past days?\" When `Abdullah رضی اللہ عنہ felt that he was not in need of that, he beckoned me (to join him) saying, \"O 'Alqama!\" Then I heard him saying (in reply to `Uthman رضی اللہ عنہ), \"As you have said that, (I tell you that) the Prophet (ﷺ) once said to us, 'O young people! Whoever among you is able to marry, should marry, and whoever is not able to marry, is recommended to fast, as fasting diminishes his sexual power.",
                "hadithUrdu": "میں حضرت عبداللہ بن مسعود رضی اللہ عنہما کے ساتھ تھا ، ان سے حضرت عثمان رضی اللہ عنہ نے منیٰ میں ملاقات کی اور کہا اے ابوعبدالرحمن ! مجھے آپ سے ایک کام ہے پھر وہ دونوں تنہائی میں چلے گئے ۔ حضرت عثمان رضی اللہ عنہ نے ان سے کہا اے ابوعبدالرحمن ! کیا آپ منظور کریں گے کہ ہم آپ کا نکاح کسی کنواری لڑکی سے کر دیں جو آپ کو گزرے ہوئے ایام یاد دلا دے ۔ چونکہ حضرت عبداللہ رضی اللہ عنہ اس کی ضرورت محسوس نہیں کرتے تھے اس لئے انہوں نے مجھے اشارہ کیا اور کہا علقمہ ! میں جب ان کی خدمت میں پہنچا تو وہ کہہ رہے تھے کہ اگر آپ کا یہ مشورہ ہے تو رسول کریم صلی اللہ علیہ وسلم نے ہم سے فرمایا تھا اے نوجوانو ! تم میں جو بھی شادی کی طاقت رکھتا ہو اسے نکاح کر لینا چاہئے کیونکہ یہ خواہش نفسانی کو توڑ دے گا ۔",
                "urduNarrator": "ہم سے عمر بن حفص نے بیان کیا ، مجھ سے ابراہیم نے بیان کیا ، ان سے اعمش نے بیان کیا ، کہا کہ مجھ سے ابراہیم نے بیان کیا ، ان سے علقمہ بن قیس نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ، عَنْ عَلْقَمَةَ، قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ فَلَقِيَهُ عُثْمَانُ بِمِنًى فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّ لِي إِلَيْكَ حَاجَةً‏.‏ فَخَلَيَا فَقَالَ عُثْمَانُ هَلْ لَكَ يَا أَبَا عَبْدِ الرَّحْمَنِ فِي أَنْ نُزَوِّجَكَ بِكْرًا، تُذَكِّرُكَ مَا كُنْتَ تَعْهَدُ، فَلَمَّا رَأَى عَبْدُ اللَّهِ أَنْ لَيْسَ لَهُ حَاجَةٌ إِلَى هَذَا أَشَارَ إِلَىَّ فَقَالَ يَا عَلْقَمَةُ، فَانْتَهَيْتُ إِلَيْهِ وَهْوَ يَقُولُ أَمَا لَئِنْ قُلْتَ ذَلِكَ لَقَدْ قَالَ لَنَا النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَا مَعْشَرَ الشَّبَابِ مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ، وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ، لأَنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ»، وَهَلْ يَتَزَوَّجُ مَنْ لاَ أَرَبَ لَهُ فِي النِّكَاحِ",
                "headingUrdu": "\"جو شادی کرنے کی استطاعت رکھتا ہو وہ شادی کر لے...\"",
                "headingEnglish": "\"Whoever is able to marry, should marry...\"",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4842,
                "hadithNumber": "5066",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "We were with the Prophet (ﷺ) while we were young and had no wealth whatever. So Allah's Messenger (ﷺ) said, \"O young people! Whoever among you can marry, should marry, because it helps him lower his gaze and guard his modesty (i.e. his private parts from committing illegal sexual intercourse etc.), and whoever is not able to marry, should fast, as fasting diminishes his sexual power.\"",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں نوجوان تھے اور ہمیں کوئی چیز میسر نہیں تھی ۔ حضور اکرم صلی اللہ علیہ وسلم نے ہم سے فرمایا ، نوجوانوں کی جماعت ! تم میں جسے بھی نکاح کرنے کے لئے مالی طاقت ہو اسے نکاح کر لینا چاہئے کیونکہ یہ نظر کو نیچی رکھنے والا اور شرمگاہ کی حفاظت کرنے والا عمل ہے اور جو کوئی نکاح کی بوجہ غربت طاقت نہ رکھتا ہو اسے چاہیے کہ روزہ رکھے کیونکہ روزہ اس کی خواہشات نفسانی کو توڑ دے گا ۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا مجھ سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا کہ مجھ سے عمارہ نے بیان کیا ، ان سے عبدالرحمٰن بن یزید نے بیان کیا ، کہا کہ میں نے علقمہ اور اسود ( رحمہم اللہ ) کے ساتھ حضرت عبداللہ بن مسعود رضی اللہ عنہما کی خدمت میں حاضر ہوا ، انہوں نے ہم سے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي عُمَارَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ دَخَلْتُ مَعَ عَلْقَمَةَ وَالأَسْوَدِ عَلَى عَبْدِ اللَّهِ فَقَالَ عَبْدُ اللَّهِ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم شَبَابًا لاَ نَجِدُ شَيْئًا فَقَالَ لَنَا رَسُولُ اللَّهُ صلى الله عليه وسلم ‏ \"‏ يَا مَعْشَرَ الشَّبَابِ مَنِ اسْتَطَاعَ الْبَاءَةَ فَلْيَتَزَوَّجْ، فَإِنَّهُ أَغَضُّ لِلْبَصَرِ، وَأَحْصَنُ لِلْفَرْجِ، وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ، فَإِنَّهُ لَهُ وِجَاءٌ ‏\"‏‏.‏",
                "headingArabic": "مَنْ لَمْ يَسْتَطِعِ الْبَاءَةَ فَلْيَصُمْ",
                "headingUrdu": "جو شادی کرنے کی استطاعت نہ رکھتا ہو اسے روزہ رکھنا مستحب ہے۔",
                "headingEnglish": "Whoever is not able to marry, is recommended to fast",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4843,
                "hadithNumber": "5067",
                "englishNarrator": "Narrated 'Ata:",
                "hadithEnglish": "We presented ourselves along with Ibn `Abbas رضی اللہ عنہما at the funeral procession of Maimuna رضی اللہ عنہا at a place called Sarif. Ibn `Abbas رضی اللہ عنہما said, \"This is the wife of the Prophet (ﷺ) so when you lift her bier, do not Jerk it or shake it much, but walk smoothly because the Prophet (ﷺ) had nine wives and he used to observe the night turns with eight of them, and for one of them there was no night turn.\"",
                "hadithUrdu": "ہم ابن عباس رضی اللہ عنہما کے ساتھ ام المؤمنین حضرت میمونہ رضی اللہ عنہا کے جنازہ میں شریک تھے ۔ حضرت ابن عباس رضی اللہ عنہما نے کہا کہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ہیں جب تم ان کا جنازہ اٹھاؤ تو زور زور سے حرکت نہ دینا بلکہ آہستہ آہستہ نرمی کے ساتھ جنازہ کو لے کر چلنا ۔ نبی کریم صلی اللہ علیہ وسلم کے پاس آپ صلی اللہ علیہ وسلم کی وفات کے وقت آپ صلی اللہ علیہ وسلم کے نکاح میں نو بیویاں تھیں آٹھ کے لئے تو آپ صلی اللہ علیہ وسلم نے باری مقرر کر رکھی تھی لیکن ایک کی باری نہیں تھی ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا کہ ہم کو ہشام بن یوسف نے خبر دی ، انہیں ابن جریج نے خبر دی ، کہا کہ مجھے عطابن ابی رباح نے خبر دی کہا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي عَطَاءٌ، قَالَ حَضَرْنَا مَعَ ابْنِ عَبَّاسٍ جَنَازَةَ مَيْمُونَةَ بِسَرِفَ، فَقَالَ ابْنُ عَبَّاسٍ هَذِهِ زَوْجَةُ النَّبِيِّ صلى الله عليه وسلم فَإِذَا رَفَعْتُمْ نَعْشَهَا فَلاَ تُزَعْزِعُوهَا وَلاَ تُزَلْزِلُوهَا وَارْفُقُوا، فَإِنَّهُ كَانَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم تِسْعٌ، كَانَ يَقْسِمُ لِثَمَانٍ وَلاَ يَقْسِمُ لِوَاحِدَةٍ‏.‏",
                "headingArabic": "كَثْرَةِ النِّسَاءِ",
                "headingUrdu": "کئی عورتوں کے بارے میں (شادی کرنا)",
                "headingEnglish": "About (marrying) several women",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4844,
                "hadithNumber": "5068",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) used to go round (have sexual relations with) all his wives in one night, and he had nine wives. Khaleefah  Yazeed bin Zuhrai, Saeed, Qatadah, Hadrat Anas رضی اللہ عنہ reported from the prophet ﷺ similarly.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ایک مرتبہ ایک ہی رات میں اپنی تمام بیویوں کے پاس گئے آنحضرت صلی اللہ علیہ وسلم کے پاس نو بیویاں تھیں ۔ حضرت امام بخاری نے کہا کہ مجھ سے خلیفہ ابن خیاط نے بیان کیا ، کہا ہم سے سعید نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے پھر یہی حدیث بیان کی ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ۔ کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے سعید نے بیان کیا ، ان سے قتادہ نے ، ا ن سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَطُوفُ عَلَى نِسَائِهِ فِي لَيْلَةٍ وَاحِدَةٍ، وَلَهُ تِسْعُ نِسْوَةٍ‏.‏ وَقَالَ لِي خَلِيفَةُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، أَنَّ أَنَسًا، حَدَّثَهُمْ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4845,
                "hadithNumber": "5069",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "\"Are you married?\" I replied, \"No.\" He said, \"Marry, for the best person of this (Muslim) nation (i.e., Muhammad) of all other Muslims, had the largest number of wives.\"",
                "hadithUrdu": "تم نے شادی کر لی ہے ؟ میں نے عرض کیا کہ نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا شادی کر لو کیونکہ اس امت کے بہترین شخص جو تھے ( یعنی آنحضرت صلی اللہ علیہ وسلم ) ان کی بہت سی بیویاں تھیں ۔ بعضوں نے یوں ترجمہ کیا ہے کہ اس امت میں اچھے وہی لوگ ہیں جن کی بہت عورتیں ہوں ۔",
                "urduNarrator": "ہم سے علی بن حکم انصاری نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے رقبہ نے ، ان سے طلحہ الیامی نے ، ان سے سعید بن جبیر نے بیان کیا کہ مجھ سے ابن عباس رضی اللہ عنہما نے دریافت فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ الْحَكَمِ الأَنْصَارِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ رَقَبَةَ، عَنْ طَلْحَةَ الْيَامِيِّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قَالَ لِي ابْنُ عَبَّاسٍ هَلْ تَزَوَّجْتَ قُلْتُ لاَ‏.‏ قَالَ فَتَزَوَّجْ فَإِنَّ خَيْرَ هَذِهِ الأُمَّةِ أَكْثَرُهَا نِسَاءً‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4846,
                "hadithNumber": "5070",
                "englishNarrator": "Narrated `Umar bin Al-Khattab رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The rewards (of deeds) are according to the intention, and everybody will get the reward for what he has intended. So whoever emigrated for Allah's and His Apostle's sake, his emigration was for Allah and His Apostle; and whoever emigrated for worldly benefits, or to marry a woman, then his emigration was for the thing for what he emigrated for.\" (1)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا عمل کا دار ومدار نیت پر ہے اور ہر شخص کو وہی ملتا ہے جس کی وہ نیت کرے اس لئے جس کی ہجرت اللہ اور اس کے رسول کی رضا حاصل کرنے کے لیے ہو ، اسے اللہ اور اس کے رسول کی رضا حاصل ہو گی لیکن جس کی ہجرت دنیا حاصل کرنے کی نیت سے یا کسی عورت سے شادی کرنے کے اردہ سے ہو ، اس کی ہجرت اسی کے لئے ہے جس کے لئے اس نے ہجرت کی ۔",
                "urduNarrator": "ہم سے یحی بن قزعہ نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے یحی بن سعید نے ، ان سے محمدبن ابراہیم بن حارث نے ، ان سے علقمہ بن وقاص نے اور ان سے عمر بن الخطاب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ، عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ الْعَمَلُ بِالنِّيَّةِ، وَإِنَّمَا لاِمْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ صلى الله عليه وسلم وَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَنْكِحُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ ‏\"‏‏.‏",
                "headingArabic": "مَنْ هَاجَرَ أَوْ عَمِلَ خَيْرًا لِتَزْوِيجِ امْرَأَةٍ فَلَهُ مَا نَوَى",
                "headingUrdu": "جس نے کسی عورت سے شادی کی نیت سے ہجرت کی۔",
                "headingEnglish": "Whoever emigrated with the intention of marrying a woman",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4847,
                "hadithNumber": "5071",
                "englishNarrator": "Narrated Ibn Masud رضی اللہ عنہما :",
                "hadithEnglish": "We used to fight in the holy battles in the company of the Prophet (ﷺ) and we had no wives with us. So we said, \"O Allah's Messenger (ﷺ)! Shall we get castrated?\" The Prophet (ﷺ) forbade us to do so.",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ جہاد کیا کرتے تھے اور ہمار ے ساتھ بیویاں نہیں تھیں ۔ اس لئے ہم نے کہا کہ یا رسول اللہ ! ہم اپنے آپ کو خصی کیوں نہ کر لیں ؟ آپ نے ہمیں اس سے منع فرمایا ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، کہا ہم سے اسماعیل نے بیان کیا ، ان سے قیس نے بیان کیا اور ان سے حضرت ابن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي قَيْسٌ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ كُنَّا نَغْزُو مَعَ النَّبِيِّ صلى الله عليه وسلم وَلَيْسَ لَنَا نِسَاءٌ فَقُلْنَا يَا رَسُولَ اللَّهِ أَلاَ نَسْتَخْصِي فَنَهَانَا عَنْ ذَلِكَ‏.‏",
                "headingArabic": "تَزْوِيجِ الْمُعْسِرِ الَّذِي مَعَهُ الْقُرْآنُ وَالإِسْلاَمُ",
                "headingUrdu": "غریب آدمی کی شادی",
                "headingEnglish": "The marrying of a poor man",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4848,
                "hadithNumber": "5072",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "`Abdur-Rahman bin `Auf رضی اللہ عنہ came (from Mecca to Medina) and the Prophet (ﷺ) made a bond of brotherhood between him and Sa`d bin Ar-Rabi` Al-Ansari رضی اللہ عنہ . Al-Ansari had two wives, so he suggested that `Abdur- Rahman رضی اللہ عنہ  take half, his wives and property. `Abdur-Rahman رضی اللہ عنہ replied, \"May Allah bless you with your wives and property. Kindly show me the market.\" So `Abdur-Rahman رضی اللہ عنہ went to the market and gained (in bargains) some dried yoghurt and some butter. After a few days the Prophet (ﷺ) saw `Abdur-Rahman رضی اللہ عنہ with some yellow stains on his clothes and asked him, \"What is that, O `Abdur-Rahman رضی اللہ عنہ ?\" He replied, \"I had married an Ansari woman.\" The Prophet (ﷺ) asked, \"How much Mahr did you give her?\" He replied, \"The weight of one (date) stone of gold.\" The Prophet (ﷺ) said, \"Offer a banquet, even with one sheep.\"",
                "hadithUrdu": "عبدالرحمن بن عوف رضی اللہ عنہ ( ہجرت کر کے مدینہ ) آئے تو نبی کریم صلی اللہ علیہ وسلم نے ان کے اور سعد بن ربیع انصاری رضی اللہ عنہ کے درمیان بھائی چارہ کرایا ۔ سعد انصاری رضی اللہ عنہ کے نکاح میں دو بیو یاں تھیں ۔ انہوں نے عبدالرحمٰن رضی اللہ عنہ سے کہا کہ وہ ان کے اہل ( بیوی ) اور مال میں سے آدھے لیں ۔ اس پر عبد الر حمن نے کہا کہ اللہ تعا لیٰ آپ کے اہل اور آپ کے مال میں برکت دے ، مجھے تو بازار کا راستہ بتا دو ۔ چنانچہ آپ بازار آئے اور یہاں آپ نے کچھ پنیر اور کچھ گھی کی تجارت کی اور نفع کمایا ۔ چند دنوں کے بعد ان پر زعفران کی زردی لگی ہوئی تھی ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ عبدالرحمٰن یہ کیا ہے ؟ انہوں نے عرض کیا کہ میں نے ایک انصار ی خاتون سے شادی کر لی ہے ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ انہیں مہر میں کیا دیا عرض کیا کہ ایک گٹھلی برابر سونا دیا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا پھر ولیمہ کر اگرچہ ایک بکری ہی کا ہو ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، ان سے حمید طویل نے بیان کیا کہ میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، عَنْ سُفْيَانَ، عَنْ حُمَيْدٍ الطَّوِيلِ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، قَالَ قَدِمَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ فَآخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُ وَبَيْنَ سَعْدِ بْنِ الرَّبِيعِ الأَنْصَارِيِّ وَعِنْدَ الأَنْصَارِيِّ امْرَأَتَانِ، فَعَرَضَ عَلَيْهِ أَنْ يُنَاصِفَهُ أَهْلَهُ وَمَالَهُ فَقَالَ بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ دُلُّونِي عَلَى السُّوقِ، فَأَتَى السُّوقَ فَرَبِحَ شَيْئًا مِنْ أَقِطٍ وَشَيْئًا مِنْ سَمْنٍ فَرَآهُ النَّبِيُّ صلى الله عليه وسلم بَعْدَ أَيَّامٍ وَعَلَيْهِ وَضَرٌ مِنْ صُفْرَةٍ فَقَالَ ‏\"‏ مَهْيَمْ يَا عَبْدَ الرَّحْمَنِ ‏\"‏‏.‏ فَقَالَ تَزَوَّجْتُ أَنْصَارِيَّةً‏.‏ قَالَ ‏\"‏ فَمَا سُقْتَ ‏\"‏‏.‏ قَالَ وَزْنَ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ قَالَ ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ الرَّجُلِ لأَخِيهِ انْظُرْ أَىَّ زَوْجَتَىَّ شِئْتَ حَتَّى أَنْزِلَ لَكَ عَنْهَا",
                "headingUrdu": "ایک آدمی کا اپنے بھائی سے کہنا (اسلام میں)",
                "headingEnglish": "The saying of a man to his brother (in Islam)",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4849,
                "hadithNumber": "5073",
                "englishNarrator": "Narrated Sa`d bin Abi Waqqas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) forbade `Uthman bin Maz'un to abstain from marrying (and other pleasures) and if he had allowed him, we would have gotten ourselves castrated.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نےعثمان بن مظعون رضی اللہ عنہ کو نکاح تبتل یعنی عورتوں سے الگ رہنے کی زندگی سے منع فرمایا تھا ۔ اگر آنحضرت صلی اللہ علیہ وسلم انہیں اجازت دے دیتے تو ہم تو خصی ہی ہو جاتے ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، کہا ہم کو ابن شہاب نے خبر دی ، انہوں نے سعید بن مسیب سے سنا ، وہ کہتے ہیں کہ میں نے حضرت سعد بن ابی وقاص رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، أَخْبَرَنَا ابْنُ شِهَابٍ، سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ سَمِعْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ رَدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى عُثْمَانَ بْنِ مَظْعُونٍ التَّبَتُّلَ، وَلَوْ أَذِنَ لَهُ لاَخْتَصَيْنَا‏.‏",
                "headingArabic": "مَا يُكْرَهُ مِنَ التَّبَتُّلِ وَالْخِصَاءِ",
                "headingUrdu": "شادی نہ کرنا اور خنثی ہونا کیا ناپسند ہے؟",
                "headingEnglish": "What is disliked of not marrying and of getting castrated",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4850,
                "hadithNumber": "5074",
                "englishNarrator": "Narrated Sa`d bin Abi Waqqas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) prevented `Uthman bin Mazun رضی اللہ عنہ from that (not marrying), and had he allowed him, we would have got ourselves castrated.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے حضرت عثمان بن مظعون رضی اللہ عنہ کو عورت سے الگ رہنے کی اجازت نہیں دی تھی ۔ اگر آنحضرت صلی اللہ علیہ وسلم انہیں اس کی اجازت دے دیتے تو ہم بھی اپنے کو خصی بنا لیتے ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا مجھے سعید بن مسیب نے خبر دی اور انہوں نے حضرت سعد بن ابی وقاص رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّهُ سَمِعَ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ لَقَدْ رَدَّ ذَلِكَ ـ يَعْنِي النَّبِيَّ صلى الله عليه وسلم ـ عَلَى عُثْمَانَ، وَلَوْ أَجَازَ لَهُ التَّبَتُّلَ لاَخْتَصَيْنَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4851,
                "hadithNumber": "5075",
                "englishNarrator": "Narrated 'Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "We used to participate in the holy battles led by Allah's Messenger (ﷺ) and we had nothing (no wives) with us. So we said, \"Shall we get ourselves castrated?\" He forbade us that and then allowed us to marry women with a temporary contract (2) and recited to us: -- 'O you who believe ! Make not unlawful the good things which Allah has made lawful for you and cross not limit. Undoubtedly, Allah  likes not those who cross the limit'. (5.87)",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جہاد کو جایا کرتے تھے اور ہمارے پاس روپیہ نہ تھا ( کہ ہم شادی کر لیتے ) اس لئے ہم نے عرض کیا ہم اپنے کو خصی کیوں نہ کرالیں لیکن آنحضرت صلی اللہ علیہ وسلم نے ہمیں اس سے منع فرمایا ۔ پھر ہمیں اس کی اجازت دے دی کہ ہم کسی عورت سے ایک کپڑے پر ( ایک مدت تک کے لئے ) نکاح کر لیں ۔ آپ نے ہمیں قرآن مجید کی یہ آیت پڑھ کر سنا ئی کہ ” ایمان لانے والو ! وہ پاکیزہ چیزیں مت حرام کرو جو تمہارے لئے اللہ تعالیٰ نے حلال کی ہیں اور حد سے آگے نہ بڑھو ، بیشک اللہ حد سے آگے بڑھنے والوں کو پسند نہیں کرتا “ ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر نے ، ان سے اسمٰعیل بن ابی خالد بجلی نے ، ان سے قیس بن ابی حازم نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، قَالَ قَالَ عَبْدُ اللَّهِ كُنَّا نَغْزُو مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَيْسَ لَنَا شَىْءٌ فَقُلْنَا أَلاَ نَسْتَخْصِي فَنَهَانَا عَنْ ذَلِكَ ثُمَّ رَخَّصَ لَنَا أَنْ نَنْكِحَ الْمَرْأَةَ بِالثَّوْبِ، ثُمَّ قَرَأَ عَلَيْنَا ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تُحَرِّمُوا طَيِّبَاتِ مَا أَحَلَّ اللَّهُ لَكُمْ وَلاَ تَعْتَدُوا إِنَّ اللَّهَ لاَ يُحِبُّ الْمُعْتَدِينَ‏}‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4852,
                "hadithNumber": "5076",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I said, \"O Allah's Messenger (ﷺ)! I am a young man and I am afraid that I may commit illegal sexual intercourse and I cannot afford to marry.\" He kept silent, and then repeated my question once again, but he kept silent. I said the same (for the third time) and he remained silent. Then repeated my question (for the fourth time), and only then the Prophet said, \"O Abu Huraira! The pen has dried after writing what you are going to confront. So (it does not matter whether you) get yourself castrated or not.\"",
                "hadithUrdu": "میں نے رسول کریم صلی اللہ علیہ وسلم سے عرض کیا کہ یا رسول اللہ ! میں نوجوان ہوں اور مجھے اپنے پر زنا کا خوف رہتا ہے ۔ میرے پاس کوئی ایسی چیز نہیں جس پر میں کسی عورت سے شادی کر لوں ۔ آپ میری یہ بات سن کر خاموش رہے ۔ دوبارہ میں نے اپنی یہی بات دہرائی لیکن آپ اس مر تبہ بھی خاموش رہے ۔ سہ بارہ میں نے عرض کیا آپ پھر بھی خاموش رہے ۔ میں نے چو تھی مرتبہ عرض کیا آپ نے فرمایا اے ابوہریرہ ! جو کچھ تم کرو گے اسے ( لوح محفوظ میں ) لکھ کر قلم خشک ہوچکاہے ۔ خواہ اب تم خصی ہو جاؤ یا باز رہو ۔ یعنی خصی ہونا بیکار محض ہے ۔",
                "urduNarrator": "اور اصبغ نے کہا کہ مجھے ابن وہب نے خبر دی ، انہیں یونس بن یزید نے ، انہیں ابن شہاب نے ، انہیں ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ أَصْبَغُ أَخْبَرَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ شَابٌّ وَأَنَا أَخَافُ عَلَى نَفْسِي الْعَنَتَ وَلاَ أَجِدُ مَا أَتَزَوَّجُ بِهِ النِّسَاءَ، فَسَكَتَ عَنِّي، ثُمَّ قُلْتُ مِثْلَ ذَلِكَ، فَسَكَتَ عَنِّي ثُمَّ قُلْتُ مِثْلَ ذَلِكَ، فَسَكَتَ عَنِّي ثُمَّ قُلْتُ مِثْلَ ذَلِكَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَا أَبَا هُرَيْرَةَ جَفَّ الْقَلَمُ بِمَا أَنْتَ لاَقٍ، فَاخْتَصِ عَلَى ذَلِكَ أَوْ ذَرْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4826,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=193",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=191",
                "label": "191",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=192",
                "label": "192",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=193",
                "label": "193",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=194",
                "label": "194",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=195",
                "label": "195",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=196",
                "label": "196",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=197",
                "label": "197",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=195",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=195",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=193",
        "to": 4850,
        "total": 40465
    }
}