{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 224,
        "data": [
            {
                "id": 5578,
                "hadithNumber": "5828",
                "englishNarrator": "Narrated Aba `Uthman An-Nahdi:",
                "hadithEnglish": "While we were with `Utba bin Farqad at Adharbijan رضی اللہ عنہ , there came `Umar's letter indicating that Allah's Apostle had forbidden the use of silk except this much, then he pointed with his index and middle fingers. To our knowledge, by that he meant embroidery.",
                "hadithUrdu": "ہمارے پاس عمر رضی اللہ عنہ کا مکتوب آیا ہم اس وقت عتبہ بن فرقد رضی اللہ عنہ کے ساتھ آذر بائیجان میں تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے ریشم کے استعمال سے ( مردوں کو ) منع کیا ہے سوا اتنے کے اور آنحضرت صلی اللہ علیہ وسلم نے انگوٹھے کے قریب کی اپنی دونوں انگلیوں کے اشارے سے اس کی مقدار بتائی ۔ ابوعثمان نہدی نے بیان کیا کہ ہماری سمجھ میں آنحضور صلی اللہ علیہ وسلم کی مراد اس سے ( کپڑے وغیرہ ریشم کے ) پھول بوٹے بنانے سے تھی ۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے ، کہا ہم سے قتادہ نے ، کہا کہ میں نے ابوعثمان نہدی سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا قَتَادَةُ، قَالَ سَمِعْتُ أَبَا عُثْمَانَ النَّهْدِيَّ، أَتَانَا كِتَابُ عُمَرَ وَنَحْنُ مَعَ عُتْبَةَ بْنِ فَرْقَدٍ بِأَذْرَبِيجَانَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْحَرِيرِ، إِلاَّ هَكَذَا، وَأَشَارَ بِإِصْبَعَيْهِ اللَّتَيْنِ تَلِيَانِ الإِبْهَامَ قَالَ فِيمَا عَلِمْنَا أَنَّهُ يَعْنِي الأَعْلاَمَ‏.‏",
                "headingArabic": "لُبْسِ الْحَرِيرِ، وَافْتِرَاشِهِ لِلرِّجَالِ، وَقَدْرِ مَا يَجُوزُ مِنْهُ",
                "headingUrdu": "مردوں کا ریشمی لباس پہننا",
                "headingEnglish": "The wearing of silk clothes by men",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5579,
                "hadithNumber": "5829",
                "englishNarrator": "Narrated Abu `Uthman:",
                "hadithEnglish": "While we were at Adharbijan, `Umar رضی اللہ عنہ wrote to us: 'Allah's Messenger (ﷺ) forbade wearing silk except this much. Then the Prophet (ﷺ) approximated his two fingers (index and middle fingers) (to illustrate that) to us.' Zuhair (the sub-narrator) raised up his middle and index fingers.",
                "hadithUrdu": "ہمیں حضرت عمر رضی اللہ عنہ نے لکھا اس وقت ہم آذر بائیجان میں تھے کہ نبی کریم صلی اللہ علیہ وسلم نے ریشم پہننے سے منع فرمایا تھا سوا اتنے کے اور اس کی وضاحت نبی کریم صلی اللہ علیہ وسلم نے دو انگلیوں کے اشارے سے کی تھی ۔ زہیر ( راوی حدیث ) نے بیچ کی اورشہادت کی انگلیاں اٹھا کر بتایا ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، ان سے عاصم نے بیان ، ان سے ابوعثمان نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا عَاصِمٌ، عَنْ أَبِي عُثْمَانَ، قَالَ كَتَبَ إِلَيْنَا عُمَرُ وَنَحْنُ بِأَذْرَبِيجَانَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ لُبْسِ الْحَرِيرِ إِلاَّ هَكَذَا، وَصَفَّ لَنَا النَّبِيُّ صلى الله عليه وسلم إِصْبَعَيْهِ‏.‏ وَرَفَعَ زُهَيْرٌ الْوُسْطَى وَالسَّبَّابَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5580,
                "hadithNumber": "5830",
                "englishNarrator": "Narrated Abu `Uthman:",
                "hadithEnglish": "While we were with `Utba رضی اللہ عنہ . `Umar رضی اللہ عنہ wrote to us: The Prophet (ﷺ) said, \"There is none who wears silk in this world except that he will wear nothing of it in the Hereafter.\" ' Abu `Uthman pointed out with his middle and index fingers. This hadith has also been narrated by Abu `Uthman.",
                "hadithUrdu": "ہم حضرت عتبہ رضی اللہ عنہ کے ساتھ تھے ۔ حضرت عمر رضی اللہ عنہ نے انہیں لکھا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا دنیا میں ریشم جو شخص بھی پہنے گا اسے آخر ت میں نہیں پہنایا جائے گا ۔ ابو عثمان نے اپنی درمیانی اور شہادت کی انگلیوں سے اشارہ کیا۔ اس حدیث کو ابو عثمان نے بھی روایت کیا ہے۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ نے بیان کیا ، انہوں نے کہا ہم سے تیمی نے بیان کیا اور ان سے ابوعثمان نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنِ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ، قَالَ كُنَّا مَعَ عُتْبَةَ فَكَتَبَ إِلَيْهِ عُمَرُ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يُلْبَسُ الْحَرِيرُ فِي الدُّنْيَا، إِلاَّ لَمْ يُلْبَسْ فِي الآخِرَةِ مِنْهُ ‏\"‏‏.‏ حَدَّثَنَا الْحَسَنُ بْنُ عُمَرَ، حَدَّثَنَا مُعْتَمِرٌ، حَدَّثَنَا أَبِي، حَدَّثَنَا أَبُو عُثْمَانَ،، وَأَشَارَ أَبُو عُثْمَانَ، بِإِصْبَعَيْهِ الْمُسَبِّحَةِ وَالْوُسْطَى‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5581,
                "hadithNumber": "5831",
                "englishNarrator": "Narrated Ibn Abi Laila:",
                "hadithEnglish": "While Hudhaifa رضی اللہ عنہ was at Al-Madain, he asked for water whereupon the chief of the village brought him water in a silver cup. Hudhaifa threw it at him and said, \"I have thrown it only because I have forbidden him to use it, but he does not stop using it. Allah's Messenger (ﷺ) said, 'Gold, silver, silk and Dibaj (a kind of silk) are for them (unbelievers) in this world and for you (Muslims) in the hereafter.'",
                "hadithUrdu": "حضرت حذیفہ رضی اللہ عنہ مدائن میں تھے ۔ انہوں نے پانی مانگا ۔ ایک دیہاتی چاندی کے برتن میں پانی لایا ۔ انہوں نے اسے پھینک دیا اور کہا کہ میں نے صرف اسے اس لیے پھینکا ہے کہ میں اس شخص کو منع کر چکا ہوں ( کہ چاندی کے برتن میں مجھے کھانا اور پانی نہ دیا کرو ) لیکن وہ نہیں مانا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ سونا ، چاندی ، ریشم اور دیبا ان ( کفار ) کے لیے دنیا میں ہے اور تمہارے ( مسلمانوں ) کے لیے آخرت میں ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حکم نے ، ان سے ابن ابی لیلیٰ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنِ ابْنِ أَبِي لَيْلَى، قَالَ كَانَ حُذَيْفَةُ بِالْمَدَايِنِ فَاسْتَسْقَى، فَأَتَاهُ دِهْقَانٌ بِمَاءٍ فِي إِنَاءٍ مِنْ فِضَّةٍ فَرَمَاهُ بِهِ وَقَالَ إِنِّي لَمْ أَرْمِهِ إِلاَّ أَنِّي نَهَيْتُهُ فَلَمْ يَنْتَهِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الذَّهَبُ وَالْفِضَّةُ وَالْحَرِيرُ وَالدِّيبَاجُ هِيَ لَهُمْ فِي الدُّنْيَا، وَلَكُمْ فِي الآخِرَةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5582,
                "hadithNumber": "5832",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, Whoever wears silk in this world shall not wear it in the Hereafter.\"",
                "hadithUrdu": "اس پر میں نے پوچھا کیا یہ روایت نبی کریم صلی اللہ علیہ وسلم سے ہے ؟ عبدالعزیز نے بیان کیا کہ قطعاً نبی کریم صلی اللہ علیہ وسلم سے مروی ہے ۔ آپ نے فرمایا کہ جومرد ریشمی لباس دنیا میں پہنے گا وہ آخرت میں اسے ہرگز نہیں پہن سکے گا ۔",
                "urduNarrator": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے عبدالعزیز بن صہیب نے بیان کیا ، کہا کہ میں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، شعبہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ قَالَ شُعْبَةُ فَقُلْتُ أَعَنِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ شَدِيدًا عَنِ النَّبِيِّ صلى الله عليه وسلم ـ فَقَالَ ‏ \"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا فَلَنْ يَلْبَسَهُ فِي الآخِرَةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5583,
                "hadithNumber": "5833",
                "englishNarrator": "Narrated Ibn Az-Zubair رضی اللہ عنہ :",
                "hadithEnglish": "\"Muhammad said, 'Whoever wears silk in this world, shall not wear it in the Hereafter.\"",
                "hadithUrdu": "حضرت محمد صلی اللہ علیہ وسلم نے فرمایا ہے کہ جس مرد نے دنیا میں ریشم پہنا وہ آخرت میں اسے نہیں پہن سکے گا ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت نے بیان کیا کہ میں نے ابن زبیر رضی اللہ عنہ سے سنا ، انہوں نے خطبہ دیتے ہوئے کہا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، قَالَ سَمِعْتُ ابْنَ الزُّبَيْرِ، يَخْطُبُ يَقُولُ قَالَ مُحَمَّدٌ صلى الله عليه وسلم ‏ \"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الآخِرَةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5584,
                "hadithNumber": "5834",
                "englishNarrator": "Narrated `Umar رضی اللہ عنہ :",
                "hadithEnglish": "\"The Prophet (ﷺ) said, 'Whoever wears silk in this world, shall not wear it in the Hereafter.\" Abu Mamar, Abdul Warith, Yazeed, Muadhah, Umm-e-Amr, the daughter of Abdullah, Abdullah bin Zubair رضی اللہ عنہما , Hadrat Umer has reported it from the prophet ﷺ.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس مردنے دنیا میں ریشم پہنا وہ اسے آخرت میں نہیں پہن سکے گا ۔ اور ہم سے ابو معمر نے بیان کیا ، ان سے عبدالوارث نے بیان کیا ، ان سے یزید نے کہ معاذ نے بیان کیا کہ مجھے ام عمرو بنت عبداللہ نے خبر دی ، انہوں نے حضرت عبداللہ بن زبیر رضی اللہ عنہما سے سنا ، انہوں نے حضرت عمر رضی اللہ عنہ سے سنا اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ۔",
                "urduNarrator": "ہم سے علی بن جعد نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں ابو ذہبان خلیفہ بن کعب نے ، کہا کہ میں نے حضرت عبداللہ بن زبیر رضی اللہ عنہما سے سنا ، کہا کہ میں نے حضرت عمر رضی اللہ عنہما   سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي ذُبْيَانَ، خَلِيفَةَ بْنِ كَعْبٍ قَالَ سَمِعْتُ ابْنَ الزُّبَيْرِ، يَقُولُ سَمِعْتُ عُمَرَ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الآخِرَةِ ‏\"‏‏.‏ وَقَالَ لَنَا أَبُو مَعْمَرٍ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ يَزِيدَ، قَالَتْ مُعَاذَةُ أَخْبَرَتْنِي أُمُّ عَمْرٍو بِنْتُ عَبْدِ اللَّهِ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، سَمِعَ عُمَرَ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم‏ نَحْوَهُ.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5585,
                "hadithNumber": "5835",
                "englishNarrator": "Narrated 'Umar bin Al-Khattab رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"None wears silk in this world, but he who will have no share in the Hereafter.\" I said: He has spoken the truth and Abu Hafs has not ascribed a lie to Allah's Apostle ﷺ. Imran has reported this Hadith in the same way from Abdullah bin Raja, Jareer and Yahya.",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا دنیا میں ریشم تو وہی مرد پہنے گا جس کا آخرت میں کوئی حصہ نہ ہو ۔ میں نے اس پر کہا کہ سچ کہا اور ابو حفص رسول کریم صلی اللہ علیہ وسلم کی طرف کوئی جھوٹی بات نسبت نہیں کر سکتے اور عبداللہ بن رجاء نے بیان کیا کہ ہم سے جریر نے بیان کیا ، ان سے یحییٰ نے اور ان سے عمران نے اورپوری حدیث بیان کی ۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم سے عثمان بن عمر نے بیان کیا ، انہوں نے کہا ہم سے علی مبارک نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے عمران بن حطان نے بیان کیا کہ میں نے حضرت عائشہ رضی اللہ عنہا سے ریشم کے متعلق پوچھا تو انہوں نے بتلایا کہ حضرت عبداللہ بن عباس رضی اللہ عنہما کے پاس جاؤ اور ان سے پوچھو ۔ بیان کی کہ میں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے پوچھا تو انہوں نے بیان کیا کہ مجھے ابو حفص یعنی حضرت عمر بن خطاب رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِمْرَانَ بْنِ حِطَّانَ، قَالَ سَأَلْتُ عَائِشَةَ عَنِ الْحَرِيرِ، فَقَالَتِ ائْتِ ابْنَ عَبَّاسٍ فَسَلْهُ‏.‏ قَالَ فَسَأَلْتُهُ فَقَالَ سَلِ ابْنَ عُمَرَ‏.‏ قَالَ فَسَأَلْتُ ابْنَ عُمَرَ فَقَالَ أَخْبَرَنِي أَبُو حَفْصٍ ـ يَعْنِي عُمَرَ بْنَ الْخَطَّابِ ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا يَلْبَسُ الْحَرِيرَ فِي الدُّنْيَا مَنْ لاَ خَلاَقَ لَهُ فِي الآخِرَةِ ‏\"‏‏.‏ فَقُلْتُ صَدَقَ وَمَا كَذَبَ أَبُو حَفْصٍ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ رَجَاءٍ حَدَّثَنَا حَرْبٌ عَنْ يَحْيَى حَدَّثَنِي عِمْرَانُ‏.‏ وَقَصَّ الْحَدِيثَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5586,
                "hadithNumber": "5836",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) was given a silk garment as a gift and we started touching it with our hands and admiring it. On that the Prophet (ﷺ) said, \"Do you wonder at this?\" We said, \"Yes.\" He said, \"The handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کو ریشم کا ایک کپڑا ہدیہ میں پیش ہوا تو ہم اسے چھونے لگے اور اس کی ( نرمی و ملائمت پر ) حیرت زدہ ہو گئے تو آپ نے فرمایا کہ کیا تمہیں اس پر حیرت ہے ۔ ہم نے عرض کیا جی ہاں فرمایا جنت میں سعد بن معاذ کے رومال اس سے بھی اچھے ہیں ۔",
                "urduNarrator": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا ، ان سے اسرائیل نے بیان کیا ، ان سے ابواسحاق نے بیان کیا اور ان سے حضرت براء رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ أُهْدِيَ لِلنَّبِيِّ صلى الله عليه وسلم ثَوْبُ حَرِيرٍ، فَجَعَلْنَا نَلْمُسُهُ، وَنَتَعَجَّبُ مِنْهُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَتَعْجَبُونَ مِنْ هَذَا ‏\"‏‏.‏ قُلْنَا نَعَمْ‏.‏ قَالَ ‏\"‏ مَنَادِيلُ سَعْدِ بْنِ مُعَاذٍ فِي الْجَنَّةِ خَيْرٌ مِنْ هَذَا ‏\"‏‏.‏",
                "headingArabic": "مَسِّ الْحَرِيرِ مِنْ غَيْرِ لُبْسٍ",
                "headingUrdu": "جو صرف ریشم کو چھوتا ہے لیکن اسے نہیں پہنتا",
                "headingEnglish": "Whoever just touches silk but does not wear it",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5587,
                "hadithNumber": "5837",
                "englishNarrator": "Narrated Hudhaifa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) forbade us to drink out of gold and silver vessels, or eat in it, Ann also forbade the wearing of silk and Dibaj or sitting on it.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ہمیں سونے اور چاندی کے برتن میں پینے اور کھانے سے منع فرمایا تھا اور ریشم اور دیبا ج پہننے اور اس پر بیٹھنے سے منع فرمایا تھا ۔",
                "urduNarrator": "ہم سے علی نے بیان کیا ، انہوں نے کہا ہم سے وہب بن جریر نے بیان کیا ، انہوں نے کہا کہ ہم سے ان کے والد نے بیان کیا ، انہوں نے کہا کہ میں نے ابن ابی نجیح سے سنا ، انہوں نے مجاہد سے ، انہوں نے ابن ابی لیلیٰ سے اور ان سے حضرت حذیفہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ ابْنَ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ حُذَيْفَةَ ـ رضى الله عنه ـ قَالَ نَهَانَا النَّبِيُّ صلى الله عليه وسلم أَنْ نَشْرَبَ فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ، وَأَنْ نَأْكُلَ فِيهَا، وَعَنْ لُبْسِ الْحَرِيرِ وَالدِّيبَاجِ، وَأَنْ نَجْلِسَ عَلَيْهِ‏.‏",
                "headingArabic": "افْتِرَاشِ الْحَرِيرِ",
                "headingUrdu": "بستر میں ریشم کا استعمال",
                "headingEnglish": "The use of silk in bedding",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5588,
                "hadithNumber": "5838",
                "englishNarrator": "Narrated Ibn Azib رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) forbade us to use the red Mayathir and to use Al-Qassiy.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ہمیں سرخ ” میثرہ “ اور ” قسی “ کے پہننے سے منع فرمایا ہے ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کوسفیان نے خبر دی ، انہیں اشعث بن ابی شعثاء نے ، ان سے معاویہ بن سوید بن مقرن نے بیان کیا اور ان سے حضرت ابن عازب رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، حَدَّثَنَا مُعَاوِيَةُ بْنُ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ ابْنِ عَازِبٍ، قَالَ نَهَانَا النَّبِيُّ صلى الله عليه وسلم عَنِ الْمَيَاثِرِ الْحُمْرِ وَالْقَسِّيِّ‏.‏",
                "headingArabic": "لُبْسِ الْقَسِّيِّ",
                "headingUrdu": "قصیٰ پہننا",
                "headingEnglish": "The wearing of Qassiiy",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5589,
                "hadithNumber": "5839",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) allowed Az-Zubair and `Abdur-Rahman رضی اللہ عنہما to wear silk because they were suffering from an itch.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے حضرت زبیر اور حضرت عبدالرحمٰن رضی اللہ عنہما کو ، کیونکہ انہیں خارش ہو گئی تھی ، ریشم پہننے کی اجازت دی تھی ۔",
                "urduNarrator": "ہم سے محمد نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا وَكِيعٌ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ رَخَّصَ النَّبِيُّ صلى الله عليه وسلم لِلزُّبَيْرِ وَعَبْدِ الرَّحْمَنِ فِي لُبْسِ الْحَرِيرِ لِحِكَّةٍ بِهِمَا‏.‏",
                "headingArabic": "مَا يُرَخَّصُ لِلرِّجَالِ مِنَ الْحَرِيرِ لِلْحِكَّةِ",
                "headingUrdu": "خارش میں مبتلا مردوں کے لیے ریشم کی اجازت ہے۔",
                "headingEnglish": "Silk is allowed for men suffering from an itch",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5590,
                "hadithNumber": "5840",
                "englishNarrator": "Narrated `Ali bin Abi Talib رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) gave me a silk suit. I went out wearing it, but seeing the signs of anger on his face, I tore it and distributed it among my wives.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے مجھے ریشمی دھاریوں والا ایک جوڑا حلہ عنایت فرمایا ۔ میں اسے پہن کر نکلا تو میں نے آنحضرت صلی اللہ علیہ وسلم کے چہرہ مبارک پر غصہ کے آثار دیکھے ۔ چنانچہ میں نے اس کے ٹکڑے کر کے اپنی عزیزعورتوں میں بانٹ دیئے ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ( دوسری سند ) اور حضرت امام بخاری نے کہا کہ مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عبدالملک بن میسرہ نے اور ان سے زید بن وہب نے کہ حضرت علی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ كَسَانِي النَّبِيُّ صلى الله عليه وسلم حُلَّةً سِيَرَاءَ، فَخَرَجْتُ فِيهَا، فَرَأَيْتُ الْغَضَبَ فِي وَجْهِهِ، فَشَقَّقْتُهَا بَيْنَ نِسَائِي‏.‏",
                "headingArabic": "الْحَرِيرِ لِلنِّسَاءِ",
                "headingUrdu": "خواتین کے لیے ریشم",
                "headingEnglish": "Silk for women",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5591,
                "hadithNumber": "5841",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "`Umar رضی اللہ عنہ saw a silk suit being sold, so he said, \"O Allah's Messenger (ﷺ)! Why don't you buy it so that you may wear it when delegates come to you, and also on Fridays?\" The Prophet (ﷺ) said, \"This is worn only by him who has no share in the Hereafter.\" Afterwards the Prophet (ﷺ) sent to `Umar رضی اللہ عنہ a silk suit suitable for wearing. `Umar رضی اللہ عنہ said to the Prophet, \"You have given it to me to wear, yet I have heard you saying about it what you said?\" The Prophet (ﷺ) said, \"I sent it to you so that you might either sell it or give it to somebody else to wear.\"",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ نے ریشمی دھاریوں والا ایک جوڑا فروخت ہوتے دیکھا تو عرض کیا کہ یا رسول اللہ ! بہتر ہے کہ آپ اسے خرید لیں اور وفود سے ملاقت کے وقت اور جمعہ کے دن اسے زیب تن کیا کریں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے وہ پہنتا ہے جس کا ( آخرت میں ) کوئی حصہ نہیں ہوتا ۔ اس کے بعد حضور اکرم صلی اللہ علیہ وسلم نے خود حضرت عمر رضی اللہ عنہ کے پاس ریشم کی دھاریوں والا ایک جوڑا حلہ بھیجا ، ہدیہ کے طور پر ۔ حضرت عمر رضی اللہ عنہ نے عرض کیا آپ نے مجھے یہ جوڑا حلہ عنایت فرمایا ہے حالانکہ میں خود آپ سے اس کے بارے میں وہ بات سن چکا ہوں جو آپ نے فرمائی تھی ۔ آپ نے فرمایا کہ میں نے تمہیں یہ کپڑا اس لیے دیا ہے کہ اسے بیچ دو یا ( عورتوں وغیرہ میں سے ) کسی کو پہنا دو ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا کہ مجھ سے جویریہ نے بیان کیا ، ان سے نافع نے ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي جُوَيْرِيَةُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، أَنَّ عُمَرَ ـ رضى الله عنه ـ رَأَى حُلَّةً سِيَرَاءَ تُبَاعُ فَقَالَ يَا رَسُولَ اللَّهِ لَوِ ابْتَعْتَهَا، تَلْبَسُهَا لِلْوَفْدِ إِذَا أَتَوْكَ وَالْجُمُعَةِ‏.‏ قَالَ ‏\"‏ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لاَ خَلاَقَ لَهُ ‏\"‏‏.‏ وَأَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ بَعْدَ ذَلِكَ إِلَى عُمَرَ حُلَّةَ سِيَرَاءَ حَرِيرٍ، كَسَاهَا إِيَّاهُ فَقَالَ عُمَرُ كَسَوْتَنِيهَا وَقَدْ سَمِعْتُكَ تَقُولُ فِيهَا مَا قُلْتَ فَقَالَ ‏\"‏ إِنَّمَا بَعَثْتُ إِلَيْكَ لِتَبِيعَهَا أَوْ تَكْسُوَهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5592,
                "hadithNumber": "5842",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "He had seen Um Kulthum رضی اللہ عنہا , the daughter of Allah's Messenger (ﷺ) , wearing a red silk garment.",
                "hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی ام کلثوم رضی اللہ عنہا کو سرخ  دھاری دار ریشمی جوڑا پہنے دیکھا ۔",
                "urduNarrator": "ہم سے ابوا لیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں حضرت انس بن مالک رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّهُ رَأَى عَلَى أُمِّ كُلْثُومٍ ـ عَلَيْهَا السَّلاَمُ ـ بِنْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم بُرْدَ حَرِيرٍ سِيَرَاءَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5593,
                "hadithNumber": "5843",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "For one year I wanted to ask `Umar رضی اللہ عنہ about the two women who helped each other against the Prophet (ﷺ) but I was afraid of him. One day he dismounted his riding animal and went among the trees of Arak to answer the call of nature, and when he returned, I asked him and he said, \"(They were) `Aisha and Hafsa رضی اللہ عنہما .\" Then he added, \"We never used to give significance to ladies in the days of the Pre-lslamic period of ignorance, but when Islam came and Allah mentioned their rights, we used to give them their rights but did not allow them to interfere in our affairs. Once there was some dispute between me and my wife and she answered me back in a loud voice. I said to her, 'Strange! You can retort in this way?' She said, 'Yes. Do you say this to me while your daughter troubles Allah's Messenger (ﷺ)?' So I went to Hafsa and said to her, 'I warn you not to disobey Allah and His Apostle.' I first went to Hafsa and then to Um Salama and told her the same. She said to me, 'O `Umar! It surprises me that you interfere in our affairs so much that you would poke your nose even into the affairs of Allah's Messenger (ﷺ) and his wives.' So she rejected my advice. There was an Ansari man; whenever he was absent from Allah's Messenger (ﷺ) and I was present there, I used to convey to him what had happened (on that day), and when I was absent and he was present there, he used to convey to me what had happened as regards news from Allah's Messenger (ﷺ) . During that time all the rulers of the nearby lands had surrendered to Allah's Messenger (ﷺ) except the king of Ghassan in Sham, and we were afraid that he might attack us. All of a sudden the Ansari came and said, 'A great event has happened!' I asked him, 'What is it? Has the Ghassani (king) come?' He said, 'Greater than that! Allah's Messenger (ﷺ) has divorced his wives! I went to them and found all of them weeping in their dwellings, and the Prophet (ﷺ) had ascended to an upper room of his. At the door of the room there was a slave to whom I went and said, \"Ask the permission for me to enter.\" He admitted me and I entered to see the Prophet (ﷺ) lying on a mat that had left its imprint on his side. Under his head there was a leather pillow stuffed with palm fires. Behold! There were some hides hanging there and some grass for tanning. Then I mentioned what I had said to Hafsa and Um Salama and what reply Um Salama had given me. Allah's Messenger (ﷺ) smiled and stayed there for twenty nine days and then came down.\" (See Hadith No. 648, Vol. 3 for details)",
                "hadithUrdu": "میں عمر رضی اللہ عنہ سے ان عورتوں کے بارے میں جنہوں نے نبی کریم صلی اللہ علیہ وسلم کے معاملہ میں اتفاق کر لیا تھا ، پوچھنے کاارادہ کرتا رہا لیکن ان کا رعب سامنے آ جاتا تھا ۔ ایک دن ( مکہ کے راستہ میں ) ایک منزل پرقیام کیا اور پیلو کے درختوں میں ( وہ قضائے حاجت کے لیے ) تشریف لے گئے ۔ جب قضائے حاجت سے فارغ ہو کر واپس تشریف لائے تو میں نے پوچھا انہوں نے بتلایا کہ عائشہ اور حفصہ رضی اللہ عنہما ہیں پھر کہا کہ جاہلیت میں ہم عورتوں کو کوئی حیثیت نہیں دیتے تھے ۔ جب اسلام آیا اور اللہ تعالیٰ نے ان کا ذکر کیا ( اور ان کے حقوق ) مردوں پر بتائے تب ہم نے جانا کہ ان کے بھی ہم پر کچھ حقوق ہیں لیکن اب بھی ہم اپنے معاملات میں ان کا دخیل بننا پسند نہیں کرتے تھے ۔ میرے اور میری بیوی میں کچھ گفتگو ہو گئی اور اس نے تیز وتند جواب مجھے دیاتو میں نے اس سے کہا اچھا اب نوبت یہاں تک پہنچ گئی ۔ اس نے کہا تم مجھے یہ کہتے ہو اورتمہاری بیٹی نبی کریم صلی اللہ علیہ وسلم کوبھی تکلیف پہنچاتی ہے ۔ میں ( اپنی بیٹی ام المؤمنین ) حفصہ کے پاس آیا اور اس سے کہا میں تجھے تنبیہ کرتا ہوں کہ اللہ اور اس کے رسول کی نافرمانی کرے ۔ حضور اکرم صلی اللہ علیہ وسلم کو تکلیف پہنچانے کے معاملہ میں سب سے پہلے میں ہی حفصہ کے یہاں گیا پھر میں حضرت ام سلمہ کے پاس آیا اور ان سے بھی یہی بات کہی لیکن انہوں نے کہا کہ حیرت ہے تم پر عمر ! تم ہمارے معاملات میں دخیل ہو گئے ہو ۔ صرف رسول اللہ صلی اللہ علیہ وسلم اور آپ کی ازواج کے معاملات میں دخل دینا باقی تھا ۔ ( سو اب وہ بھی شروع کر دیا ) انہوں نے میری بات رد کر دی ۔ قبیلہ انصار کے ایک صحابی تھے جب وہ حضور اکرم صلی اللہ علیہ وسلم کی صحبت میں موجود نہ ہوتے اور میں حاضر ہوتا تو تمام خبریں ان سے آ کر بیان کرتا تھا اور جب میں آنحضرت صلی اللہ علیہ وسلم کی صحبت سے غیرحاضر ہوتا اور وہ موجود ہوتے تو وہ آنحضرت صلی اللہ علیہ وسلم کے متعلق تمام خبریں مجھے آ کر سناتے تھے ۔ آپ کے چاروں طرف جتنے ( بادشاہ وغیرہ ) تھے ان سب سے آپ کے تعلقات ٹھیک تھے ۔ صرف شام کے ملک غسان کا ہمیں خوف رہتا تھا کہ وہ کہیں ہم پر حملہ نہ کر دے ۔ میں نے جو ہوش وحواس درست کئے تو وہی انصاری صحابی تھے اور کہہ رہے تھے کہ ایک حادثہ ہو گیا ۔ میں نے کہا کیا بات ہوئی ۔ کیا غسان چڑھ آیا ہے ۔ انہوں نے کہا کہ اس سے بھی بڑا حادثہ کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی ازواج کو طلاق دے دی ۔ میں جب ( مدینہ ) حاضر ہوا تو تمام ازواج کے حجروں سے رونے کی آواز آ رہی تھی ۔ حضور اکرم صلی اللہ علیہ وسلم اپنے بالا خانہ پر چلے گئے تھے اور بالا خانہ کے دروازہ پر ایک نو جوان پہرے دار موجود تھا میں نے اس کے پاس پہنچ کر اس سے کہا کہ میرے لیے حضور اکرم صلی اللہ علیہ وسلم سے اندر حاضر ہونے کی اجازت مانگ لو پھر میں اندر گیا تو آپ ایک چٹائی پر تشریف رکھتے تھے جس کے نشانات آپ کے پہلو پر پڑے ہوئے تھے اور آپ کے سرکے نیچے ایک چھوٹا سا چمڑے کاتکیہ تھا ۔ جس میں کھجور کی چھال بھری ہوئی تھی ۔ چند کچی کھالیں لٹک رہی تھیں اور ببول کے پتے تھے ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے اپنی ان باتوں کا ذکر کیا جو میں نے حفصہ اور ام سلمہ سے کہی تھیں اور وہ بھی جو ام سلمہ نے میری بات رد کرتے ہوئے کہا تھا ۔ حضور اکرم صلی اللہ علیہ وسلم اس پر مسکرادیئے ۔ آپ نے اس بالا خانہ میں انتیس دن تک قیام کیا پھر آپ وہاں سے نیچے اتر آئے ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے ، ان سے یحییٰ بن سعید نے ، ان سے عبید بن حنین نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَبِثْتُ سَنَةً وَأَنَا أُرِيدُ أَنْ أَسْأَلَ عُمَرَ عَنِ الْمَرْأَتَيْنِ اللَّتَيْنِ تَظَاهَرَتَا عَلَى النَّبِيِّ صلى الله عليه وسلم فَجَعَلْتُ أَهَابُهُ، فَنَزَلَ يَوْمًا مَنْزِلاً فَدَخَلَ الأَرَاكَ، فَلَمَّا خَرَجَ سَأَلْتُهُ فَقَالَ عَائِشَةُ وَحَفْصَةُ ـ ثُمَّ قَالَ ـ كُنَّا فِي الْجَاهِلِيَّةِ لاَ نَعُدُّ النِّسَاءَ شَيْئًا، فَلَمَّا جَاءَ الإِسْلاَمُ وَذَكَرَهُنَّ اللَّهُ، رَأَيْنَا لَهُنَّ بِذَلِكَ عَلَيْنَا حَقًّا، مِنْ غَيْرِ أَنْ نُدْخِلَهُنَّ فِي شَىْءٍ مِنْ أُمُورِنَا، وَكَانَ بَيْنِي وَبَيْنَ امْرَأَتِي كَلاَمٌ فَأَغْلَظَتْ لِي فَقُلْتُ لَهَا وَإِنَّكِ لَهُنَاكِ‏.‏ قَالَتْ تَقُولُ هَذَا لِي وَابْنَتُكَ تُؤْذِي النَّبِيَّ صلى الله عليه وسلم فَأَتَيْتُ حَفْصَةَ فَقُلْتُ لَهَا إِنِّي أُحَذِّرُكِ أَنْ تَعْصِي اللَّهَ وَرَسُولَهُ‏.‏ وَتَقَدَّمْتُ إِلَيْهَا فِي أَذَاهُ، فَأَتَيْتُ أُمَّ سَلَمَةَ فَقُلْتُ لَهَا‏.‏ فَقَالَتْ أَعْجَبُ مِنْكَ يَا عُمَرُ قَدْ دَخَلْتَ فِي أُمُورِنَا، فَلَمْ يَبْقَ إِلاَّ أَنْ تَدْخُلَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَزْوَاجِهِ، فَرَدَّدَتْ، وَكَانَ رَجُلٌ مِنَ الأَنْصَارِ إِذَا غَابَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَشَهِدْتُهُ أَتَيْتُهُ بِمَا يَكُونُ، وَإِذَا غِبْتُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَشَهِدَ أَتَانِي بِمَا يَكُونُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ مَنْ حَوْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَدِ اسْتَقَامَ لَهُ، فَلَمْ يَبْقَ إِلاَّ مَلِكُ غَسَّانَ بِالشَّأْمِ، كُنَّا نَخَافُ أَنْ يَأْتِيَنَا، فَمَا شَعَرْتُ إِلاَّ بِالأَنْصَارِيِّ وَهْوَ يَقُولُ إِنَّهُ قَدْ حَدَثَ أَمْرٌ‏.‏ قُلْتُ لَهُ وَمَا هُوَ أَجَاءَ الْغَسَّانِيُّ قَالَ أَعْظَمُ مِنْ ذَاكَ، طَلَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم نِسَاءَهُ‏.‏ فَجِئْتُ فَإِذَا الْبُكَاءُ مِنْ حُجَرِهَا كُلِّهَا، وَإِذَا النَّبِيُّ صلى الله عليه وسلم قَدْ صَعِدَ فِي مَشْرُبَةٍ لَهُ، وَعَلَى باب الْمَشْرُبَةِ وَصِيفٌ فَأَتَيْتُهُ فَقُلْتُ اسْتَأْذِنْ لِي‏.‏ فَدَخَلْتُ فَإِذَا النَّبِيُّ صلى الله عليه وسلم عَلَى حَصِيرٍ قَدْ أَثَّرَ فِي جَنْبِهِ، وَتَحْتَ رَأْسِهِ مِرْفَقَةٌ مِنْ أَدَمٍ، حَشْوُهَا لِيفٌ، وَإِذَا أُهُبٌ مُعَلَّقَةٌ وَقَرَظٌ، فَذَكَرْتُ الَّذِي قُلْتُ لِحَفْصَةَ وَأُمِّ سَلَمَةَ، وَالَّذِي رَدَّتْ عَلَىَّ أُمُّ سَلَمَةَ، فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَبِثَ تِسْعًا وَعِشْرِينَ لَيْلَةً، ثُمَّ نَزَلَ‏.‏",
                "headingArabic": "مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَجَوَّزُ مِنَ اللِّبَاسِ وَالْبُسْطِ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم جو کپڑے یا چٹائی میسر ہوتے اس پر راضی رہتے تھے۔",
                "headingEnglish": "The Prophet (saws) used to be contented with whatever clothes or mats were available",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5594,
                "hadithNumber": "5844",
                "englishNarrator": "Narrated Um Salama رضی اللہ عنہا :",
                "hadithEnglish": "One night the Prophet (ﷺ) woke up, saying, \"None has the right to be worshipped but Allah! How many afflictions have been sent down tonight, and how many treasures have been sent down (disclosed)! Who will go and wake up (for prayers) the lady dwellers of these rooms? Many well dressed soul (people) in this world, will be naked on the Day of Resurrection.\" Zuhri says: There were buttons among the fingers on the sleeves of Hinds.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم رات کے وقت بیدار ہوئے اور کہا اللہ کے سوا کوئی معبود نہیں کیسی کیسی بلائیں اس رات میں نازل ہو رہی ہیں اور کیا کیا رحمتیں اس کے خزانوں سے اتر رہی ہیں ۔ کوئی ہے جو ان حجرہ والیوں کو بیدار کر دے ۔ دیکھو بہت سی دنیا میں پہننے اوڑھنے والیاں آخرت میں ننگی ہوں گی ۔ زہری نے بیان کیا کہ ہندہ اپنی آستینوں میں انگلیوں کے درمیان گھنڈیاں لگا تی تھیں ۔ تاکہ صرف انگلیاں کھلیں اس سے آگے نہ کھلے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا ہم سے ہشام بن یوسف صنعانی نے بیان کیا ، انہوں نے کہا ہم کو معمر بن راشد نے خبر دی ، انہیں زہری نے خبر دی ، انہیں ہندہ بنت حارث نے خبر دی اور ان سے حضرت ام سلمہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَتْنِي هِنْدُ بِنْتُ الْحَارِثِ، عَنْ أُمِّ سَلَمَةَ، قَالَتِ اسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم مِنَ اللَّيْلِ وَهْوَ يَقُولُ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، مَاذَا أُنْزِلَ اللَّيْلَةَ مِنَ الْفِتْنَةِ، مَاذَا أُنْزِلَ مِنَ الْخَزَائِنِ، مَنْ يُوقِظُ صَوَاحِبَ الْحُجُرَاتِ، كَمْ مِنْ كَاسِيَةٍ فِي الدُّنْيَا عَارِيَةٍ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ قَالَ الزُّهْرِيُّ وَكَانَتْ هِنْدٌ لَهَا أَزْرَارٌ فِي كُمَّيْهَا بَيْنَ أَصَابِعِهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5595,
                "hadithNumber": "5845",
                "englishNarrator": "Narrated Um Khalid bint Khalid رضی اللہ عنہا :",
                "hadithEnglish": "Some clothes were presented to Allah's Messenger (ﷺ) as a gift and there was a black Khamisa with it. The Prophet asked (his companions), \"To whom do you suggest we give this Khamisa?\" The people kept quiet. Then he said, \"Bring me Um Khalid,\" So I was brought to him and he dressed me with it with his own hands and said twice, \"May you live so long that you will wear out many garments.\" He then started looking at the embroidery of that Khamisa and said, \"O Um Khalid! This is Sana!\" (Sana in Ethiopian language means beautiful.) 'Is-haq, a sub-narrator, said: A woman of my family had told me that she had seen the Khamisa worn by Um Khalid رضی اللہ عنہا .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے پاس کچھ کپڑے آئے جن میں ایک کالی چادر بھی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تمہاراکیا خیال ہے ، کسے یہ چادر دی جائے صحابہ کرام رضی اللہ عنہم خاموش رہے پھر آپ نے فرمایا ام خالد رضی اللہ عنہ کو بلا لاؤ ۔ چنانچہ مجھے آنحضرت صلی اللہ علیہ وسلم کی خدمت میں لایا گیا اور مجھے وہ چادر آنحضرت صلی اللہ علیہ وسلم نے اپنے ہاتھ سے عنایت فرمائی اور فرمایا دیر تک جیتی رہو ۔ دو مرتبہ آپ نے فرمایا پھر آپ اس چادر کے نقش ونگار کو دیکھنے لگے اور اپنے ہاتھ سے میری طرف اشارہ کر کے فرمایا ام خالد ! ” سناہ ، سناہ “ یہ حبشی زبان کا لفظ ہے یعنی واہ کیا زیب دیتی ہے ۔ اسحاق بن سعید نے بیان کیا کہ مجھ سے میرے گھر کی ایک عورت نے بیان کیا کہا کہ انہوں نے وہ چادر حضرت ام خالد رضی اللہ عنہا کے پاس دیکھی تھی ۔",
                "urduNarrator": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے اسحاق بن سعید بن عمرو بن سعید بن عاص نے بیان کیا ، کہا کہ مجھ سے میرے والد نے بیان کیا ، کہا کہ مجھ سے ام خالد بنت خالد رضی اللہ عنہا نے بیان کیا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا إِسْحَاقُ بْنُ سَعِيدِ بْنِ عَمْرِو بْنِ سَعِيدِ بْنِ الْعَاصِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَتْنِي أُمُّ خَالِدٍ بِنْتُ خَالِدٍ، قَالَتْ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِثِيَابٍ فِيهَا خَمِيصَةٌ سَوْدَاءُ قَالَ ‏\"‏ مَنْ تَرَوْنَ نَكْسُوهَا هَذِهِ الْخَمِيصَةَ ‏\"‏‏.‏ فَأُسْكِتَ الْقَوْمُ‏.‏ قَالَ ‏\"‏ ائْتُونِي بِأُمِّ خَالِدٍ ‏\"‏‏.‏ فَأُتِيَ بِي النَّبِيُّ صلى الله عليه وسلم فَأَلْبَسَهَا بِيَدِهِ وَقَالَ ‏\"‏ أَبْلِي وَأَخْلِقِي ‏\"‏‏.‏ مَرَّتَيْنِ فَجَعَلَ يَنْظُرُ إِلَى عَلَمِ الْخَمِيصَةِ، وَيُشِيرُ بِيَدِهِ إِلَىَّ وَيَقُولُ ‏\"‏ يَا أُمَّ خَالِدٍ هَذَا سَنَا ‏\"‏‏.‏ وَالسَّنَا بِلِسَانِ الْحَبَشِيَّةِ الْحَسَنُ‏.‏ قَالَ إِسْحَاقُ حَدَّثَتْنِي امْرَأَةٌ مِنْ أَهْلِي أَنَّهَا رَأَتْهُ عَلَى أُمِّ خَالِدٍ‏.‏",
                "headingArabic": "مَا يُدْعَى لِمَنْ لَبِسَ ثَوْبًا جَدِيدًا",
                "headingUrdu": "نیا لباس پہننے والے کو پکارنا",
                "headingEnglish": "To invoke for the one wearing a new garment",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5596,
                "hadithNumber": "5846",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) forbade men to use saffron.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے اس سے منع فرمایا کہ کوئی مرد زعفران کے رنگ کا استعمال کرے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے عبدالوارث بن سعید نے بیان کیا ، ان سے عبدالعزیز نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَتَزَعْفَرَ الرَّجُلُ‏.‏",
                "headingArabic": "التَّزَعْفُرِ لِلرِّجَالِ",
                "headingUrdu": "مردوں کے لیے زعفران کا استعمال منع ہے۔",
                "headingEnglish": "Men are forbidden to use saffron",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5597,
                "hadithNumber": "5847",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) forbade Muhrims to wear clothes dyed with Wars or saffron.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے منع کیا تھا کہ کوئی محرم ورس یا زعفران سے رنگا ہوا کپڑاپہنے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عبداللہ بن دینار نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَلْبَسَ الْمُحْرِمُ ثَوْبًا مَصْبُوغًا بِوَرْسٍ أَوْ بِزَعْفَرَانٍ‏.‏",
                "headingArabic": "الثَّوْبِ الْمُزَعْفَرِ",
                "headingUrdu": "زعفران سے رنگا ہوا لباس",
                "headingEnglish": "The garment dyed with saffron",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5598,
                "hadithNumber": "5848",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) was of a modest height. I saw him wearing a red suit, and I did not see anything better than him.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم میانہ قد تھے اور میں نے حضور اکرم کو سرخ جوڑے میں دیکھا آپ سے زیادہ خوبصورت کوئی چیز میں نے نہیں دیکھی ۔",
                "urduNarrator": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابواسحاق نے اور انہوں نے حضرت براء رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، سَمِعَ الْبَرَاءَ ـ رضى الله عنه ـ يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم مَرْبُوعًا، وَقَدْ رَأَيْتُهُ فِي حُلَّةٍ حَمْرَاءَ مَا رَأَيْتُ شَيْئًا أَحْسَنَ مِنْهُ‏.‏",
                "headingArabic": "الثَّوْبِ الأَحْمَرِ",
                "headingUrdu": "سرخ لباس",
                "headingEnglish": "The red garment",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5599,
                "hadithNumber": "5849",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) ordered us to observe seven things: To visit the sick; follow funeral processions; say 'May Allah bestow His Mercy on you', to the sneezer if he says, 'Praise be to Allah!; He forbade us to wear silk, Dibaj, Qassiy and Istibarq (various kinds of silken clothes); or to use red Mayathir (silkcushions). (See Hadith No. 253 A, Vol. 8).",
                "hadithUrdu": "ہمیں رسول اللہ صلی اللہ علیہ وسلم نے سات چیزوں کا حکم دیا تھا ۔ بیمار کی عیادت کا ، جنازہ کے پیچھے چلنے کا ، چھینکنے والے کا جواب ( یرحمک اللہ سے ) دینے کا اور آنحضرت صلی اللہ علیہ وسلم نے ہمیں ریشم ، دیبا ، قسی ، استبرق اور سرخ زین پوشوں کے استعمال سے بھی منع فرمایا تھا ۔",
                "urduNarrator": "ہم سے قبیصہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے اشعث نے ، ان سے معاویہ بن سوید بن مقرن نے اور ان سے حضرت براء رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ أَشْعَثَ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم بِسَبْعٍ عِيَادَةِ الْمَرِيضِ، وَاتِّبَاعِ الْجَنَائِزِ، وَتَشْمِيتِ الْعَاطِسِ، وَنَهَانَا عَنْ لُبْسِ الْحَرِيرِ، وَالدِّيبَاجِ، وَالْقَسِّيِّ، وَالإِسْتَبْرَقِ، وَمَيَاثِرِ الْحُمْرِ‏.‏",
                "headingArabic": "الْمِيثَرَةِ الْحَمْرَاءِ",
                "headingUrdu": "سرخ زین پوش کابیان",
                "headingEnglish": "The red Mithara",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5600,
                "hadithNumber": "5850",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "\"Did the Prophet (ﷺ) use to offer the prayers with his shoes on?\" He said, \"Yes.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جوتے پہنے ہوئے نماز پڑھتے تھے تو انہوں نے کہا کہ ہاں ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد نے بیان کیا ، ان سے سعید بن ابی مسلمہ نے ، انہوں نے کہا میں نے حضرت انس رضی اللہ عنہ سے پوچھا کیا",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ سَعِيدٍ أَبِي مَسْلَمَةَ، قَالَ سَأَلْتُ أَنَسًا أَكَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي فِي نَعْلَيْهِ قَالَ نَعَمْ‏.‏",
                "headingArabic": "النِّعَالِ السِّبْتِيَّةِ وَغَيْرِهَا",
                "headingUrdu": "سبطیہ اور دوسرے جوتے",
                "headingEnglish": "Sibtiya and other shoes",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5601,
                "hadithNumber": "5851",
                "englishNarrator": "Narrated `Abdullah Ibn-e-Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"I see you doing four things which are not done by your friends.\" Ibn `Umar رضی اللہ عنہما said, \"What are they, O Ibn Juraij?\" He said, \"I see that you do not touch except the two Yemenite corners of the Ka`ba (while performing the Tawaf): and I see you wearing the Sabtiyya shoes; and I see you dyeing (your hair) with Sufra; and I see that when you are in Mecca, the people assume the state of Ihram on seeing the crescent (on the first day of Dhul-Hijja) while you do not assume the state of Ihram till the Day of Tarwiya (8th Dhul Hijja).\" `Abdullah bin `Umar رضی اللہ عنہما said to him, \"As for the corners of the Ka`ba, I have not seen Allah's Messenger (ﷺ) touching except the two Yemenite corners, As for the Sabtiyya shoes, I saw Allah's Messenger (ﷺ) wearing leather shoes that had no hair, and he used to perform the ablution while wearing them. Therefore, I like to wear such shoes. As regards dyeing with Sufra, I saw Allah's Messenger (ﷺ) dyeing his hair with it, so I like to dye (my hair) with it. As regards the crescent (of Dhul-Hijja), I have not seen Allah's Messenger (ﷺ) assuming the state of Ihram till his she-camel set out (on the 8th of Dhul-Hijja).",
                "hadithUrdu": "میں آپ کو چار ایسی چیزیں کرتے دیکھتا ہوں جو میں نے آپ کے کسی ساتھی کو کرتے نہیں دیکھا ۔ حضرت ابن عمر رضی اللہ عنہما نے کہا ابن جریج ! وہ کیا چیزیں ہیں ؟ انہوں نے کہا کہ میں نے آپ کو دیکھا ہے کہ آپ ( خانہ کعبہ کے ) کسی کو نے کو طواف میں ہاتھ نہیں لگاتے صرف دو ارکان یمانی ( یعنی صرف رکن یمانی اور حجراسود ) کو چھوتے ہیں اور میں نے آپ کو دیکھا ہے کہ آپ صاف زین کے چمڑے کا جوتا پہنتے ہیں اور میں نے آپ کود یکھا کہ آپ اپنا کپڑا زرد رنگ سے رنگتے ہیں یا زرد خضاب لگاتے ہیں اور میں نے آپ کو دیکھا کہ جب مکہ میں ہوتے ہیں تو سب لوگ تو ذی الحجہ کا چاند دیکھ کر احرام باندھ لیتے ہیں لیکن آپ احرام نہیں باندھتے بلکہ ترویہ کے دن ( 8 ذی الحجہ کو ) کو احرام باندھتے ہیں ۔ ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ خانہ کعبہ کے ارکان کے متعلق جو تم نے کہا تو میں نے رسول اللہ صلی اللہ علیہ وسلم کو ہمیشہ صرف حجراسود اور رکن یمانی کو چھوتے دیکھا ، صاف تری کے چمڑے کے جوتوں کے متعلق جو تم نے پوچھا تو میں نے دیکھا ہے کہ حضور اکرم صلی اللہ علیہ وسلم اسی چمڑے کا جوتا پہنتے تھے جس میں بال نہیں ہوتے تھے اور آپ اس کو پہنے ہوئے وضو کرتے تھے اس لیے میں بھی پسند کرتا ہوں کہ ایسا ہی جوتا استعمال کروں ۔ زرد رنگ کے متعلق تم نے جو کہا ہے تو میں نے حضور اکرم صلی اللہ علیہ وسلم کو اس سے خضاب کرتے یا کپڑے رنگتے دیکھا ہے اس لیے میں بھی اس زرد رنگ کو پسند کرتا ہوں اور رہا احرام باندھنے کا مسئلہ تو میں نے آنحضرت صلی اللہ علیہ وسلم کو دیکھا کہ آپ اسی وقت احرام باندھتے جب اونٹ پر سوار ہو کر جانے لگتے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، ان سے امام مالک نے ، ان سے مقبری نے ، ان سے عبید بن جریج نے کہ انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے عرض کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عُبَيْدِ بْنِ جُرَيْجٍ، أَنَّهُ قَالَ لِعَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ رَأَيْتُكَ تَصْنَعُ أَرْبَعًا لَمْ أَرَ أَحَدًا مِنْ أَصْحَابِكَ يَصْنَعُهَا‏.‏ قَالَ مَا هِيَ يَا ابْنَ جُرَيْجٍ قَالَ رَأَيْتُكَ لاَ تَمَسُّ مِنَ الأَرْكَانِ إِلاَّ الْيَمَانِيَيْنِ، وَرَأَيْتُكَ تَلْبَسُ النِّعَالَ السِّبْتِيَّةَ، وَرَأَيْتُكَ تَصْبُغُ بِالصُّفْرَةِ، وَرَأَيْتُكَ إِذَا كُنْتَ بِمَكَّةَ أَهَلَّ النَّاسُ إِذَا رَأَوُا الْهِلاَلَ، وَلَمْ تُهِلَّ أَنْتَ حَتَّى كَانَ يَوْمَ التَّرْوِيَةِ‏.‏ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ أَمَّا الأَرْكَانُ فَإِنِّي لَمْ أَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَمَسُّ إِلاَّ الْيَمَانِيَيْنِ، وَأَمَّا النِّعَالُ السِّبْتِيَّةُ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَلْبَسُ النِّعَالَ الَّتِي لَيْسَ فِيهَا شَعَرٌ وَيَتَوَضَّأُ فِيهَا فَأَنَا أُحِبُّ أَنْ أَلْبَسَهَا، وَأَمَّا الصُّفْرَةُ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَصْبُغُ بِهَا، فَأَنَا أُحِبُّ أَنْ أَصْبُغَ بِهَا وَأَمَّا الإِهْلاَلُ فَإِنِّي لَمْ أَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يُهِلُّ حَتَّى تَنْبَعِثَ بِهِ رَاحِلَتُهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5602,
                "hadithNumber": "5852",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) forbade that a Muhrim should wear clothes dyed with Saffron or Wars, and said, \"Whoever has no shoes can put on Khuffs (socks made from thick fabric or leather) after cutting it below the ankles.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے محرم کو زعفران یا ورس سے رنگا ہوا کپڑا پہننے سے منع فرمایا تھا اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جسے جوتے نہ ملیں وہ موزے ہی پہن لیں لیکن ان کو ٹخنے کے نیچے تک کاٹ دیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تینسی نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہوں نے کہا ہمیں عبداللہ بن دینار نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَلْبَسَ الْمُحْرِمُ ثَوْبًا مَصْبُوغًا بِزَعْفَرَانٍ أَوْ وَرْسٍ، وَقَالَ ‏ \"‏ مَنْ لَمْ يَجِدْ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ، وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5576,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=223",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=221",
                "label": "221",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=222",
                "label": "222",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=223",
                "label": "223",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=224",
                "label": "224",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=225",
                "label": "225",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=226",
                "label": "226",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=227",
                "label": "227",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=225",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=225",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=223",
        "to": 5600,
        "total": 40465
    }
}