{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 151,
        "data": [
            {
                "id": 3753,
                "hadithNumber": "3930",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The day of Bu'ath was a day (i.e. battle) which Allah caused to take place just before the mission of His Apostle so that when Allah's Messenger (ﷺ) came to Medina, they (the tribes) had divided (into hostile groups) and their nobles had been killed; and all that facilitated their conversion to Islam.",
                "hadithUrdu": "بعاث کی لڑائی کو ( انصار کے قبائل اوس و خزرج کے درمیان ) اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کے مدینہ میں آنے سے پہلے ہی برپا کرا دیا تھا چنانچہ جب آپ مدینہ تشریف لائے تو انصار میں پھوٹ پڑی ہوئی تھی اور ان کے سردار قتل ہو چکے تھے ۔ اس میں اللہ کی یہ حکمت معلوم ہوتی ہے کہ انصار اسلام قبول کر لیں ۔",
                "urduNarrator": "ہم سے عبیداللہ بن سعید نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ يَوْمُ بُعَاثٍ يَوْمًا قَدَّمَهُ اللَّهُ عَزَّ وَجَلَّ لِرَسُولِهِ صلى الله عليه وسلم، فَقَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وَقَدِ افْتَرَقَ مَلَؤُهُمْ، وَقُتِلَتْ سَرَاتُهُمْ فِي دُخُولِهِمْ فِي الإِسْلاَمِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3754,
                "hadithNumber": "3931",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "That once Abu Bakr رضی اللہ عنہ came to her on the day of `Id-ul-Fitr or `Id ul Adha while the Prophet (ﷺ) was with her and there were two girl singers with her, singing songs of the Ansar about the day of Buath. Abu Bakr رضی اللہ عنہ said twice. \"Musical instrument of Satan!\" But the Prophet (ﷺ) said, \"Leave them Abu Bakr, for every nation has an `Id (i.e. festival) and this day is our `Id.\"",
                "hadithUrdu": "حضرت ابوبکر صدیق رضی اللہ عنہ ا نکے یہاں آئے تو نبی کریم صلی اللہ علیہ وسلم بھی وہیں تشریف رکھتے تھے عیدالفطر یا عیدالاضحی کا دن تھا ، دو لڑکیاں یوم بعاث کے بارے میں وہ اشعار پڑھ رہی تھیں جو انصار کے شعراء نے اپنے فخر میں کہے تھے ۔ حضرت ابوبکر رضی اللہ عنہ نے کہا یہ شیطانی گانے باجے ! ( آنحضرت صلی اللہ علیہ وسلم کے گھر میں ) دو مرتبہ انہوں نے یہ جملہ دہرایا ، لیکن آپ نے فرمایا ابوبکر ! انہیں چھوڑ دو ۔ ہر قوم کی عید ہوتی ہے اور ہماری عید آج کا یہ دن ہے ۔",
                "urduNarrator": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ أَبَا بَكْرٍ، دَخَلَ عَلَيْهَا وَالنَّبِيُّ صلى الله عليه وسلم عِنْدَهَا يَوْمَ فِطْرٍ أَوْ أَضْحًى، وَعِنْدَهَا قَيْنَتَانِ ‏{‏تُغَنِّيَانِ‏}‏ بِمَا تَقَاذَفَتِ الأَنْصَارُ يَوْمَ بُعَاثَ‏.‏ فَقَالَ أَبُو بَكْرٍ مِزْمَارُ الشَّيْطَانِ مَرَّتَيْنِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ دَعْهُمَا يَا أَبَا بَكْرٍ، إِنَّ لِكُلِّ قَوْمٍ عِيدًا، وَإِنَّ عِيدَنَا هَذَا الْيَوْمُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3755,
                "hadithNumber": "3932",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) arrived at Medina, he alighted at the upper part of Medina among the people called Bani `Amr bin `Auf and he stayed with them for fourteen nights. Then he sent for the chiefs of Bani An-Najjar, and they came, carrying their swords. As if I am just now looking at Allah's Messenger (ﷺ) on his she-camel with Abu Bakr رضی اللہ عنہ riding behind him (on the same camel) and the chiefs of Bani An- Najjar around him till he dismounted in the courtyard of Abu Aiyub's home. The Prophet (ﷺ) used to offer the prayer wherever the prayer was due, and he would pray even in sheepfolds. Then he ordered that the mosque be built. He sent for the chiefs of Banu An-Najjar, and when they came, he said, \"O Banu An-Najjar! Suggest to me the price of this garden of yours.\" They replied \"No! By Allah, we do not demand its price except from Allah.\"In that garden there were the (following) things that I will tell you: Graves of pagans, unleveled land with holes and pits etc., and date-palm trees. Allah's Messenger (ﷺ) ordered that the graves of the pagans be dug up and, the unleveled land be leveled and the date-palm trees be cut down. The trunks of the trees were arranged so as to form the wall facing the Qibla. The Stone pillars were built at the sides of its gate. The companions of the Prophet (ﷺ) were carrying the stones and reciting some  lyrics, and Allah's Messenger (ﷺ) . . was with them and they were saying, \"O Allah! There is no good Excel the good of the Hereafter, so bestow victory on the Ansar and the Emigrants. \"",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو مدینہ کے بلند جانب قباء کے ایک محلہ میں آپ نے ( سب سے پہلے ) قیام کیا جسے بنی عمرو بن عوف کا محلہ کہا جاتا تھا ۔ راوی نے بیان کیا کہ حضور صلی اللہ علیہ وسلم نے وہاں چودہ رات قیام کیا پھر آپ نے قبیلہ بنی النجار کے لوگوں کو بلا بھیجا ۔ انہوں نے بیان کیا کہ انصاربنی النجار آپ کی خدمت میں تلواریں لٹکا ئے ہوئے حاضر ہوئے ۔ راوی نے بیان کیا گویا اس وقت بھی وہ منظر میری نظروں کے سامنے ہے کہ آنحضرت صلی اللہ علیہ وسلم اپنی سواری پر سوار ہیں ۔ حضرت ابوبکر صدیق رضی اللہ عنہ اسی سواری پر آپ کے پیچھے سوار ہیں اور بنی النجار کے انصار آپ کے چاروں طرف حلقہ بنائے ہوئے مسلح پیدل چلے جا رہے ہیں ۔ آخر آپ حضرت ابوایوب انصاری کے گھر کے قریب اتر گئے ۔ راوی نے بیان کیا کہ ابھی تک جہاں بھی نماز کا وقت ہو جاتا وہیں آپ نماز پڑھ لیتے تھے ۔ بکریوں کے ریوڑ جہاں رات کو باندھے جاتے وہاں بھی نماز پڑھ لی جاتی تھی ۔ بیان کیا کہ پھر حضور صلی اللہ علیہ وسلم نے مسجد کی تعمیر کا حکم فرمایا ۔ آپ نے اس کے لئے قبیلہ بنی النجار کے لوگوں کو بلا بھیجا ۔ وہ حاضر ہوئے تو آپ نے فرمایا اے بنو النجار ! اپنے اس باغ کی قیمت طے کر لو ۔ انہوں نے عرض کیا نہیں اللہ کی قسم ہم اس کی قیمت اللہ کے سوا اور کسی سے نہیں لے سکتے ۔ راوی نے بیان کیا کہ اس باغ میں وہ چیزیں تھیں جو میں تم سے بیان کروں گا ۔ اس میں مشرکین کی قبریں تھیں ، کچھ اس میں کھنڈر تھا اور کھجور وں کے درخت بھی تھے ۔ آنحضرت صلی اللہ علیہ وسلم کے حکم سے مشرکین کی قبریں اکھاڑ دی گئیں ، جہاں کھنڈر تھا اسے برا بر کیا گیا اور کھجوروں کے درخت کاٹ دیئے گئے ۔ راوی نے بیان کیا کہ کھجور کے تنے مسجد کی طرف ایک قطار میں بطور دیوار رکھ دیئے گئے اور دروازہ میں ( چوکھٹ کی جگہ ) پتھر رکھ دیئے ، حضرت انس رضی اللہ عنہ نے بیان کیا کہ صحابہ جب پتھر لا رہے تھے تو شعر پڑھتے جاتے تھے آنحضرت صلی اللہ علیہ وسلم بھی ان کے ساتھ خود پتھر لاتے اور شعر پڑھتے ۔ صحابہ یہ شعر پڑھتے کہ اے اللہ ! آخرت ہی کی خیر ، خیر ہے ، پس تو انصار اور مہاجرین کی مدد فرما ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ( دوسری سند ) اور ہم سے اسحاق بن منصور نے بیان کیا ، کہا ہم کو عبدالصمدنے خبر دی ، کہا کہ میں نے اپنے والد عبدالوارث سے سنا ، انہوں نے بیان کیا کہ ہم سے ا بو التیاح یزید بن حمید ضبعی نے بیان کیا ، کہا کہ مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ،‏.‏ وَحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الصَّمَدِ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، حَدَّثَنَا أَبُو التَّيَّاحِ، يَزِيدُ بْنُ حُمَيْدٍ الضُّبَعِيُّ قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ قَالَ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ، نَزَلَ فِي عُلْوِ الْمَدِينَةِ فِي حَىٍّ يُقَالُ لَهُمْ بَنُو عَمْرِو بْنِ عَوْفٍ ـ قَالَ ـ فَأَقَامَ فِيهِمْ أَرْبَعَ عَشْرَةَ لَيْلَةً، ثُمَّ أَرْسَلَ إِلَى مَلإِ بَنِي النَّجَّارِ ـ قَالَ ـ فَجَاءُوا مُتَقَلِّدِي سُيُوفِهِمْ، قَالَ وَكَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى رَاحِلَتِهِ، وَأَبُو بَكْرٍ رِدْفَهُ، وَمَلأُ بَنِي النَّجَّارِ حَوْلَهُ حَتَّى أَلْقَى بِفِنَاءِ أَبِي أَيُّوبَ، قَالَ فَكَانَ يُصَلِّي حَيْثُ أَدْرَكَتْهُ الصَّلاَةُ، وَيُصَلِّي فِي مَرَابِضِ الْغَنَمِ، قَالَ ثُمَّ إِنَّهُ أَمَرَ بِبِنَاءِ الْمَسْجِدِ، فَأَرْسَلَ إِلَى مَلإِ بَنِي النَّجَّارِ، فَجَاءُوا فَقَالَ ‏ \"‏ يَا بَنِي النَّجَّارِ، ثَامِنُونِي حَائِطَكُمْ هَذَا ‏\"‏‏.‏ فَقَالُوا لاَ، وَاللَّهِ لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ‏.‏ قَالَ فَكَانَ فِيهِ مَا أَقُولُ لَكُمْ كَانَتْ فِيهِ قُبُورُ الْمُشْرِكِينَ، وَكَانَتْ فِيهِ خِرَبٌ، وَكَانَ فِيهِ نَخْلٌ، فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِقُبُورِ الْمُشْرِكِينَ فَنُبِشَتْ، وَبِالْخِرَبِ فَسُوِّيَتْ، وَبِالنَّخْلِ فَقُطِعَ، قَالَ فَصَفُّوا النَّخْلَ قِبْلَةَ الْمَسْجِدِ ـ قَالَ ـ وَجَعَلُوا عِضَادَتَيْهِ حِجَارَةً‏.‏ قَالَ قَالَ جَعَلُوا يَنْقُلُونَ ذَاكَ الصَّخْرَ وَهُمْ يَرْتَجِزُونَ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم مَعَهُمْ يَقُولُونَ اللَّهُمَّ إِنَّهُ لاَ خَيْرَ إِلاَّ خَيْرُ الآخِرَهْ فَانْصُرِ الأَنْصَارَ وَالْمُهَاجِرَهْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3756,
                "hadithNumber": "3933",
                "englishNarrator": "Narrated `Abdur-Rahman bin Humaid Az-Zuhri:",
                "hadithEnglish": "I heard `Umar bin `Abdul-Aziz asking As-Sa'ib, the nephew of An-Nimr. \"What have you heard about residing in Mecca?\" The other said, \"I heard Al-Ala bin Al-Hadrami saying, Allah's Messenger (ﷺ) said: An Emigrant is allowed to stay in Mecca for three days after departing from Mina (i.e. after performing all the ceremonies of Hajj)\"",
                "hadithUrdu": "انہوں نے خلیفہ عمر بن عبد العزیز سے سنا ،  وہ نمر کندی کے بھانجے سائب بن یزید سے دریافت کر رہے تھے کہ تم نے مکہ میں ( مہاجر کے ) ٹھہر نے کے مسئلہ میں کیا سنا ہے ؟ انہوں نے بیان کیا کہ میں نے حضرت علاء بن حضرمی رضی اللہ عنہ سے سنا ۔ وہ بیان کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مہاجر کو ( حج میں ) طواف وداع کے بعد تین دن ٹھہر نے کی اجازت ہے ۔",
                "urduNarrator": "مجھ سے ابراہیم بن حمزہ نے بیان کیا ، کہا ہم سے حاتم بن اسماعیل نے بیان کیا ، ان سے عبدالرحمٰن بن حمید زہری نے بیان کیا ،",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا حَاتِمٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ الزُّهْرِيِّ، قَالَ سَمِعْتُ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، يَسْأَلُ السَّائِبَ ابْنَ أُخْتِ النَّمِرِ مَا سَمِعْتَ فِي، سُكْنَى مَكَّةَ قَالَ سَمِعْتُ الْعَلاَءَ بْنَ الْحَضْرَمِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ ثَلاَثٌ لِلْمُهَاجِرِ بَعْدَ الصَّدَرِ ‏\"‏‏.‏",
                "headingArabic": "إِقَامَةِ الْمُهَاجِرِ بِمَكَّةَ بَعْدَ قَضَاءِ نُسُكِهِ",
                "headingUrdu": "حج کے بعد ہجرت کرنے والوں کا مکہ مکرمہ میں قیام",
                "headingEnglish": "The stay of the emigrants in Makkah after Hajj",
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3757,
                "hadithNumber": "3934",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet's companions did not take as a starting date for the Muslim calendar, the day, the Prophet (ﷺ) had been sent as an Apostle or the day of his death, but the day of his arrival at Medina.",
                "hadithUrdu": "تاریخ کا شمار نبی کریم صلی اللہ علیہ وسلم کی نبوت کے سال سے ہوا اور نہ آپ کی وفات کے سال سے بلکہ اس کا شمار مدینہ کی ہجرت کے سال سے ہوا ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، کہا ہم سے عبدالعزیز بن ابوحازم نے بیان کیا ، ان سے ان کے والد سلمہ بن دینار نے ، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ مَا عَدُّوا مِنْ مَبْعَثِ النَّبِيِّ صلى الله عليه وسلم وَلاَ مِنْ وَفَاتِهِ، مَا عَدُّوا إِلاَّ مِنْ مَقْدَمِهِ الْمَدِينَةَ‏.‏",
                "headingArabic": "التَّارِيخِ مِنْ أَيْنَ أَرَّخُوا التَّارِيخَ",
                "headingUrdu": "مسلم کیلنڈر کب شروع ہوا؟",
                "headingEnglish": "When did the Muslim calendar start?",
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3758,
                "hadithNumber": "3935",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Originally, two rak`at were prescribed in every prayer. When the Prophet (ﷺ) migrated (to Medina) four rak`at were enjoined, while the journey prayer remained unchanged(i.e. two rak`at). Abdur Razzaq has reported the same from Mamar.",
                "hadithUrdu": "( پہلے ) نماز صرف دو رکعت فرض ہوئی تھی پھر نبی کریم صلی اللہ علیہ وسلم نے ہجرت کی تو وہ فرض رکعات چار رکعات ہو گئیں ۔ البتہ سفر کی حالت میں نماز اپنی حالت میں باقی رکھی گئی ۔ اس روایت کی متابعت عبدالرزاق نے معمر سے کی ہے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے معمر نے بیان کیا ، ان سے زہری نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ فُرِضَتِ الصَّلاَةُ رَكْعَتَيْنِ، ثُمَّ هَاجَرَ النَّبِيُّ صلى الله عليه وسلم فَفُرِضَتْ أَرْبَعًا، وَتُرِكَتْ صَلاَةُ السَّفَرِ عَلَى الأُولَى‏.‏ تَابَعَهُ عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3759,
                "hadithNumber": "3936",
                "englishNarrator": "Narrated Sa`d bin Malik reports from his father Hadrat Sa'd bin Abi Waqas رضی اللہ عنہ :",
                "hadithEnglish": "In the year of Hajjat-ul-Wada` the Prophet (ﷺ) visited me when I fell ill and was about to die because of that illness. I said, \"O Allah's Messenger (ﷺ)! I am very ill as you see, and I am a rich man and have no heir except my only daughter. Shall I give 2/3 of my property in charity?\" He said, \"No.\" I said, \"Shall I then give one half of it in charity?\" He said, \"O Sa`d! Give 1/3 (in charity) and even 1/3 is too much. No doubt, it is better to leave your children rich than to leave them poor, reduced to begging from others. And Allah will reward you for whatever you spend with the intention of gaining Allah's Pleasure even if it were a mouthful of food you put into your wives mouth.\" I said, \"O Allah's Apostle! Am I to be left behind (in Mecca) after my companions have gone?\" He said, \"If you should be left behind, you will be upgraded and elevated for every deed you will do with a desire to achieve Allah's Pleasure. I hope that you will live long so that some people will benefit by you while others will be harmed. O Allah! Please fulfill the migration of my companions and do not make them turn back on their heels. But (we feel sorry for) the unlucky Sa`d bin Khaulah.\" Allah's Messenger (ﷺ) lamented his death in Mecca. Ahmad bin Younus and Musa's report from Ibrahim says: \"‏ أَنْ تَذَرَ وَرَثَتَك''",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم حجۃ الوداع 10 ھ کے موقع پر میری مزاج پرسی کے لئے تشریف لائے ۔ اس مرض میں میرے بچنے کی کوئی امید نہیں رہی تھی ۔ میں نے عرض کیا یا رسول اللہ ! مرض کی شدت آپ خود ملاحظہ فرما رہے ہیں ، میرے پاس مال بہت ہے اور صرف میری ایک لڑکی وارث ہے تو کیا میں اپنے دو تہائی مال کا صدقہ کر دوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ۔ میں نے عرض کیا پھر آدھے کا کر دوں ؟ فرمایا کہ سعد ! بس ایک تہائی کا کر دو ، یہ بھی بہت ہے ۔ تو اگر اپنی اولاد کو مالدار چھوڑ کر جائے تو یہ اس سے بہتر ہے کہ انہیں محتاج چھوڑے اور وہ لوگوں کے سامنے ہاتھ پھیلاتے پھریں ۔ احمد بن یونس نے بیان کیا ، ان سے ابراہیم بن سعد نے کہ ” تم اپنی اولاد کو چھوڑ کر جو کچھ بھی خرچ کرو گے اور اس سے اللہ تعالیٰ کی رضامندی مقصود ہو گی تو اللہ تعالیٰ تمہیں اس کا ثواب دے گا ، اللہ تمہیں اس لقمہ پر بھی ثواب دے گا جو تم اپنی بیوی کے منہ میں ڈالو گے ۔ میں نے پوچھا یا رسول اللہ ! کیا میں اپنے ساتھیوں سے پیچھے مکہ میں رہ جاؤں گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم پیچھے نہیں رہو گے اور تم جو بھی عمل کرو گے اور اس سے مقصود اللہ تعالیٰ کی رضامندی ہو گی تو تمہارا مرتبہ اس کی وجہ سے بلند ہوتا رہے گا اور شاید تم ابھی بہت دنوں تک زندہ رہو گے تم سے بہت سے لوگوں ( مسلمانوں ) کو نفع پہنچے گا اور بہتوں کو ( غیرمسلموں ) نقصان ہو گا اے اللہ ! میرے صحابہ کی ہجرت پوری کر دے اور انہیں الٹے پاؤں واپس نہ کر ( کہ وہ ہجرت کو چھوڑ کر اپنے گھروں کو واپس آ جائیں ) البتہ سعد بن خولہ نقصان میں پڑ گئے رسول اللہ صلی اللہ علیہ وسلم نے مکہ میں ان کی وفات پر افسوس کا اظہار کیا۔اور احمد بن یونس اور موسیٰ بن اسماعیل نے اس حدیث کو ابراہیم بن سعد سے روایت کیا اس میں ( اپنی اولاد ذریت کو چھوڑو ، کے بجائے ) تم اپنے وارثوں کو چھوڑو یہ الفاظ مروی ہیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے زہری نے ، ان سے عامر بن سعد بن مالک نے اور ان سے ان کے والد حضرت سعد بن ابی وقاص رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا إِبْرَاهِيمُ، عَنِ الزُّهْرِيِّ، عَنْ عَامِرِ بْنِ سَعْدِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، قَالَ عَادَنِي النَّبِيُّ صلى الله عليه وسلم عَامَ حَجَّةِ الْوَدَاعِ مِنْ مَرَضٍ أَشْفَيْتُ مِنْهُ عَلَى الْمَوْتِ، فَقُلْتُ يَا رَسُولَ اللَّهِ، بَلَغَ بِي مِنَ الْوَجَعِ مَا تَرَى، وَأَنَا ذُو مَالٍ وَلاَ يَرِثُنِي إِلاَّ ابْنَةٌ لِي وَاحِدَةٌ، أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قَالَ فَأَتَصَدَّقُ بِشَطْرِهِ قَالَ ‏\"‏ الثُّلُثُ يَا سَعْدُ، وَالثُّلُثُ كَثِيرٌ، إِنَّكَ أَنْ تَذَرَ ذُرِّيَّتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ ‏\"‏‏.‏ قَالَ أَحْمَدُ بْنُ يُونُسَ عَنْ إِبْرَاهِيمَ ‏\"‏ أَنْ تَذَرَ ذُرِّيَّتَكَ، وَلَسْتَ بِنَافِقٍ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلاَّ آجَرَكَ اللَّهُ بِهَا، حَتَّى اللُّقْمَةَ تَجْعَلُهَا فِي فِي امْرَأَتِكَ ‏\"‏‏.‏ قُلْتَ يَا رَسُولَ اللَّهِ، أُخَلَّفُ بَعْدَ أَصْحَابِي قَالَ ‏\"‏ إِنَّكَ لَنْ تُخَلَّفَ فَتَعْمَلَ عَمَلاً تَبْتَغِي بِهِ وَجْهَ اللَّهِ إِلاَّ ازْدَدْتَ بِهِ دَرَجَةً وَرِفْعَةً، وَلَعَلَّكَ تُخَلَّفُ حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ، وَيُضَرَّ بِكَ آخَرُونَ، اللَّهُمَّ أَمْضِ لأَصْحَابِي هِجْرَتَهُمْ، وَلاَ تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ، لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ يَرْثِي لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُوُفِّيَ بِمَكَّةَ ‏\"‏‏.‏ وَقَالَ أَحْمَدُ بْنُ يُونُسَ وَمُوسَى عَنْ إِبْرَاهِيمَ ‏\"‏ أَنْ تَذَرَ وَرَثَتَكَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ أَمْضِ لأَصْحَابِي هِجْرَتَهُمْ». وَمَرْثِيَتِهِ لِمَنْ مَاتَ بِمَكَّةَ",
                "headingUrdu": "\"اے اللہ! میرے صحابہ کی ہجرت پوری کر۔‘‘",
                "headingEnglish": "“O Allah! Complete the emigration of my Companions”",
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3760,
                "hadithNumber": "3937",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When `Abdur-Rahman bin `Auf رضی اللہ عنہ came to Medina and the Prophet (ﷺ) established the bond of brotherhood between him and Sa`d bin Ar-Rabi-al-Ansari رضی اللہ عنہ , Saud suggested that `Abdur-Rahman should accept half of his property and family. `Abdur Rahman رضی اللہ عنہ said, \"May Allah bless you in your family and property; guide me to the market.\" So `Abdur-Rahman (while doing business in the market) made some profit of some condensed dry yoghurt and butter. After a few days the Prophet (ﷺ) saw him wearing clothes stained with yellow perfume. The Prophet (ﷺ) asked, \"What is this, O `Abdur-Rahman?\" He said, \"O Allah's Messenger (ﷺ)! I have married an Ansar' woman.\" The Prophet (ﷺ) asked, \"What have you given her as Mahr?\" He (i.e. `Abdur-Rahman) said, \"A piece of gold, about the weight of a date stone.\" Then the Prophet said, Give a banquet, even though of a sheep.\"",
                "hadithUrdu": "جب عبدالرحمٰن بن عوف رضی اللہ عنہ ہجرت کر کے آئے تو آنحضرت صلی اللہ علیہ وسلم ان کا بھائی چارہ سعد بن ربیع انصاری رضی اللہ عنہ کے ساتھ کرایا تھا ۔ سعد رضی اللہ عنہ نے ان سے کہا کہ ان کے اہل و مال میں سے آدھا وہ قبول کر لیں لیکن عبدالرحمٰن رضی اللہ عنہ نے کہا کہ اللہ تعالیٰ آپ کے اہل و مال میں برکت دے ۔ آپ تو مجھے بازار کا راستہ بتا دیں ۔ چنانچہ انہوں نے تجارت شروع کر دی اور پہلے دن انہیں کچھ پنیر اور گھی میں نفع ملا ۔ چند دنوں کے بعد انہیں نبی کریم صلی اللہ علیہ وسلم نے دیکھا کہ ان کے کپڑوں پر ( خوشبو کی ) زردی کا نشان ہے تو آپ نے فرمایا عبدالرحمٰن یہ کیا ہے ؟ انہوں نے عرض کیا یا رسول اللہ میں نے ایک انصاری عورت سے شادی کر لی ہے ۔ حضور صلی اللہ علیہ وسلم نے فرمایا کہ انہیں مہر میں تم نے کیا دیا ؟ انہوں نے بتایا کہ ایک گھٹلی برابر سونا ۔ حضور صلی اللہ علیہ وسلم نے فرمایا اب ولیمہ کرو خواہ ایک ہی بکری کاہو ۔",
                "urduNarrator": "ہم سے محمدبن یوسف بیکندی نے بیان کیا ، ان سے سفیان بن عیینہ نے بیان کیا ، ان سے حمید طویل نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَدِمَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ، فَآخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُ وَبَيْنَ سَعْدِ بْنِ الرَّبِيعِ الأَنْصَارِيِّ، فَعَرَضَ عَلَيْهِ أَنْ يُنَاصِفَهُ أَهْلَهُ وَمَالَهُ، فَقَالَ عَبْدُ الرَّحْمَنِ بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ، دُلَّنِي عَلَى السُّوقِ‏.‏ فَرَبِحَ شَيْئًا مِنْ أَقِطٍ وَسَمْنٍ، فَرَآهُ النَّبِيُّ صلى الله عليه وسلم بَعْدَ أَيَّامٍ وَعَلَيْهِ وَضَرٌ مِنْ صُفْرَةٍ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَهْيَمْ يَا عَبْدَ الرَّحْمَنِ ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ، تَزَوَّجْتُ امْرَأَةً مِنَ الأَنْصَارِ‏.‏ قَالَ ‏\"‏ فَمَا سُقْتَ فِيهَا ‏\"‏‏.‏ فَقَالَ وَزْنَ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏",
                "headingArabic": "كَيْفَ آخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَ أَصْحَابِهِ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے اپنے درمیان اخوت کا رشتہ کیسے قائم کیا۔",
                "headingEnglish": "How the Prophet (saws) established the bond of brotherhood between his",
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3761,
                "hadithNumber": "3938",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When the news of the arrival of the Prophet (ﷺ) at Medina reached `Abdullah bin Salam رضی اللہ عنہ , he went to him to ask him about certain things, He said, \"I am going to ask you about three things which only a Prophet can answer: What is the first sign of The Hour? What is the first food which the people of Paradise will eat? Why does a child attract the similarity to his father or to his mother?\" The Prophet (ﷺ) replied, \"Gabriel has just now informed me of that.\" Ibn Salam said, \"He (i.e. Gabriel) is the enemy of the Jews amongst the angels. The Prophet (ﷺ) said, \"As for the first sign of The Hour, it will be a fire that will collect the people from the East to the West. As for the first meal which the people of Paradise will eat, it will be the caudate (extra) lobe of the fish-liver. As for the child, if the man's discharge proceeds the woman's discharge, the child attracts the similarity to the man, and if the woman's discharge proceeds the man's, then the child attracts the similarity to the woman.\" On this, `Abdullah bin Salam رضی اللہ عنہ said, \"I testify that None has the right to be worshipped except Allah, and that you are the Messenger of Allah.\" and added, \"O Allah's Messenger (ﷺ)! Jews invent such lies as make one astonished, so please ask them about me before they know about my conversion to I slam . \" The Jews came, and the Prophet (ﷺ) said, \"What kind of man is `Abdullah bin Salam رضی اللہ عنہ among you?\" They replied, \"The best of us and the son of the best of us and the most superior among us, and the son of the most superior among us. \"The Prophet (ﷺ) said, \"What would you think if `Abdullah bin Salam رضی اللہ عنہ should embrace Islam?\" They said, \"May Allah protect him from that.\" The Prophet (ﷺ) repeated his question and they gave the same answer. Then `Abdullah came out to them and said, \"I testify that None has the right to be worshipped except Allah and that Muhammad is the Messenger of Allah!\" On this, the Jews said, \"He is the most wicked among us and the son of the most wicked among us.\" So they degraded him. On this, he (i.e. `Abdullah bin Salam رضی اللہ عنہ) said, \"It is this that I was afraid of, O Allah's Messenger (ﷺ).",
                "hadithUrdu": "جب عبداللہ بن سلام رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم کے مدینہ آنے کی خبر ہوئی تو وہ آپ سے چند سوال کرنے کے لئے آئے ۔ انہوں نے کہا کہ میں آپ سے تین چیزوں کے متعلق پوچھوں گا جنہیں نبی کے سوا اور کوئی نہیں جانتا ۔ قیامت کی سب سے پہلی نشانی کیا ہو گی ؟ اہل جنت کی ضیافت سب سے پہلے کس کھانے سے کی جائے گی ؟ اور کیا بات ہے کہ بچہ کبھی باپ پر جاتا ہے اور کبھی ماں پر ؟ حضور صلی اللہ علیہ وسلم نے فرمایا کہ جواب ابھی مجھے حضرت جبرائیل نے آ کر بتایا ہے ۔ عبداللہ بن سلام نے کہا کہ یہ ملائکہ میں یہودیوں کے دشمن ہیں ۔ آپ نے فرمایا قیامت کی پہلی نشانی ایک آگ ہے جو انسانوں کو مشرق سے مغرب کی طرف لے جائے گی ۔ جس کھانے سے سب سے پہلے اہل جنت کی ضیافت ہو گی وہ مچھلی کی کلیجی کا بڑھا ہوا ٹکڑا ہو گا ( جو نہایت لذیذ اور زود ہضم ہوتا ہے ) اور بچہ باپ کی صورت پر اس وقت جاتا ہے جب عورت کے پانی پر مرد کا پانی غالب آ جائے اور جب مرد کے پانی پر عورت کا پانی غالب آ جائے تو بچہ ماں پر جاتا ہے ۔ عبداللہ بن سلام رضی اللہ عنہ نے کہا میں گواہی دیتا ہوں کہ اللہ کے سوا اور کوئی معبود نہیں اور گواہی دیتا ہوں کہ آپ اللہ کے رسول ہیں ۔ پھر انہوں نے عرض کیا یا رسول اللہ ! یہودی بڑے بہتان لگانے والے لوگ ہیں ، اس لئے آپ اس سے پہلے کہ میرے اسلام کے بارے میں انہیں کچھ معلوم ہو ، ان سے میرے متعلق دریافت فرمائیں ۔ چنانچہ چند یہودی آئے تو آپ نے ان سے فرمایا کہ تمہاری قوم میں عبداللہ بن سلام کون ہیں ؟ وہ کہنے لگے کہ ہم میں سب سے بہتر اور سب سے بہتر کے بیٹے ہیں ، ہم میں سب سے افضل اور سب سے افضل کے بیٹے ہیں ۔ آپ نے فرمایا تمہارا کیا خیال ہے اگر وہ اسلام لائیں ؟ وہ کہنے لگے اس سے اللہ تعالیٰ انہیں اپنی پناہ میں رکھے ۔ حضور نے دوبارہ ان سے یہی سوال کیا اور انہوں نے یہی جواب دیا ۔ اس کے بعد عبداللہ بن سلام رضی اللہ عنہ باہر آئے اور کہا میں گواہی دیتا ہوں کہ اللہ سوا کوئی معبود نہیں اور محمد ( صلی اللہ علیہ وسلم ) اللہ کے رسول ہیں ۔ اب وہ کہنے لگے یہ تو ہم میں سب سے بد تر آدمی ہیں اور سب سے بد تر باپ کے بیٹے ہیں ۔ فوراً ہی برائی شروع کر دی ، حضرت عبداللہ بن سلام رضی اللہ عنہ نے عرض کیا یا رسول اللہ ً ! اسی کا مجھے ڈر تھا ۔",
                "urduNarrator": "مجھ سے حامد بن عمر نے بیان کیا ، کہا ہم سے بشر بن مفضل نے ، ان سے حمید طویل نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي حَامِدُ بْنُ عُمَرَ، عَنْ بِشْرِ بْنِ الْمُفَضَّلِ، حَدَّثَنَا حُمَيْدٌ، حَدَّثَنَا أَنَسٌ، أَنَّ عَبْدَ اللَّهِ بْنَ سَلاَمٍ، بَلَغَهُ مَقْدَمُ النَّبِيِّ صلى الله عليه وسلم الْمَدِينَةَ، فَأَتَاهُ يَسْأَلُهُ عَنْ أَشْيَاءَ، فَقَالَ إِنِّي سَائِلُكَ عَنْ ثَلاَثٍ لاَ يَعْلَمُهُنَّ إِلاَّ نَبِيٌّ مَا أَوَّلُ أَشْرَاطِ السَّاعَةِ وَمَا أَوَّلُ طَعَامٍ يَأْكُلُهُ أَهْلُ الْجَنَّةِ وَمَا بَالُ الْوَلَدِ يَنْزِعُ إِلَى أَبِيهِ أَوْ إِلَى أُمِّهِ قَالَ ‏\"‏ أَخْبَرَنِي بِهِ جِبْرِيلُ آنِفًا ‏\"‏‏.‏ قَالَ ابْنُ سَلاَمٍ ذَاكَ عَدُوُّ الْيَهُودِ مِنَ الْمَلاَئِكَةِ‏.‏ قَالَ ‏\"‏ أَمَّا أَوَّلُ أَشْرَاطِ السَّاعَةِ فَنَارٌ تَحْشُرُهُمْ مِنَ الْمَشْرِقِ إِلَى الْمَغْرِبِ، وَأَمَّا أَوَّلُ طَعَامٍ يَأْكُلُهُ أَهْلُ الْجَنَّةِ، فَزِيَادَةُ كَبِدِ الْحُوتِ، وَأَمَّا الْوَلَدُ، فَإِذَا سَبَقَ مَاءُ الرَّجُلِ مَاءَ الْمَرْأَةِ نَزَعَ الْوَلَدَ، وَإِذَا سَبَقَ مَاءُ الْمَرْأَةِ مَاءَ الرَّجُلِ نَزَعَتِ الْوَلَدَ ‏\"‏‏.‏ قَالَ أَشْهَدُ أَنَّ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّكَ رَسُولُ اللَّهِ‏.‏ قَالَ يَا رَسُولَ اللَّهِ، إِنَّ الْيَهُودَ قَوْمٌ بُهُتٌ، فَاسْأَلْهُمْ عَنِّي قَبْلَ أَنْ يَعْلَمُوا بِإِسْلاَمِي، فَجَاءَتِ الْيَهُودُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَىُّ رَجُلٍ عَبْدُ اللَّهِ بْنُ سَلاَمٍ فِيكُمْ ‏\"‏‏.‏ قَالُوا خَيْرُنَا وَابْنُ خَيْرِنَا وَأَفْضَلُنَا وَابْنُ أَفْضَلِنَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَرَأَيْتُمْ إِنْ أَسْلَمَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ ‏\"‏‏.‏ قَالُوا أَعَاذَهُ اللَّهُ مِنْ ذَلِكَ‏.‏ فَأَعَادَ عَلَيْهِمْ، فَقَالُوا مِثْلَ ذَلِكَ، فَخَرَجَ إِلَيْهِمْ عَبْدُ اللَّهِ فَقَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ‏.‏ قَالُوا شَرُّنَا وَابْنُ شَرِّنَا‏.‏ وَتَنَقَّصُوهُ‏.‏ قَالَ هَذَا كُنْتُ أَخَافُ يَا رَسُولَ اللَّهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3762,
                "hadithNumber": "3939, 3940",
                "englishNarrator": "Narrated Abu Al-Minhal `Abdur-Rahman bin Mut`im:",
                "hadithEnglish": "A partner of mine sold some Dirhams on credit in the market. I said, \"Glorified be Allah! Is this legal?\" He replied, \"Glorified be Allah! By Allah, when I sold them in the market, nobody objected to it.\" Then I asked Al-Bara' bin `Azib رضی اللہ عنہ (about it) he said, \"We used to make such a transaction when the Prophet came to Medina. So he said, 'There is no harm in it if it is done from hand to hand, but it is not allowed on credit.' Go to Zaid bin Al- Arqam and ask him about it for he was the greatest trader of all of us.\" So I asked Zaid bin Al-Arqam., and he said the same (as Al-Bara) did.\" He said that Sufyan once narrated that when the Prophet (ﷺ) came to Madinah, we used to do (such) buying and selling. For up to",
                "hadithUrdu": "میرے ایک ساجھی نے بازار میں چند درہم ادھار فروخت کیے ، میں نے اس سے کہا سبحان اللہ ! کیا یہ جائز ہے ؟ انہوں نے کہا سبحان اللہ خدا کی قسم کہ میں نے بازار میں اسے بیچا تو کسی نے بھی قابل اعتراض نہیں سمجھا ۔ میں نے براء بن عازب رضی اللہ عنہ سے اس کے متعلق پوچھا تو انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم جب ( ہجرت کر کے ) تشریف لائے تو اس طرح خریدوفروخت کیا کرتے تھے ۔ حضور صلی اللہ علیہ وسلم نے فرمایا کہ خریدوفروخت کی اس صورت میں اگر معاملہ دست بدست ( نقد ) ہو تو کوئی مضائقہ نہیں لیکن اگر ادھار پر معاملہ کیا تو پھر یہ صورت جائز نہیں اورزید بن ارقم سے بھی مل کر اس کے متعلق پوچھ لو کیونکہ وہ ہم میں بڑے سوداگر تھے ۔ میں نے زید بن ارقم سے پوچھا تو انہوں نے بھی یہی کہا کہ سفیان نے ایک مرتبہ یوں بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم جب ہمارے یہاں مدینہ تشریف لائے تو ہم ( اس طرح کی ) خریدوفروخت کیا کرتے تھے اور بیان کیا کہ ادھار موسم تک کے لئے یا ( یوں بیان کیا کہ ) حج تک کے لیے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ المدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے ، انہوں نے ابومنہال ( عبدالرحمٰن بن مطعم ) سے سنا ، عبدالرحمٰن بن مطعم نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ أَبَا الْمِنْهَالِ عَبْدَ الرَّحْمَنِ بْنَ مُطْعِمٍ، قَالَ بَاعَ شَرِيكٌ لِي دَرَاهِمَ فِي السُّوقِ نَسِيئَةً فَقُلْتُ سُبْحَانَ اللَّهِ أَيَصْلُحُ هَذَا فَقَالَ سُبْحَانَ اللَّهِ، وَاللَّهِ لَقَدْ بِعْتُهَا فِي السُّوقِ فَمَا عَابَهُ أَحَدٌ، فَسَأَلْتُ الْبَرَاءَ بْنَ عَازِبٍ فَقَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم وَنَحْنُ نَتَبَايَعُ هَذَا الْبَيْعَ، فَقَالَ ‏ \"‏ مَا كَانَ يَدًا بِيَدٍ فَلَيْسَ بِهِ بَأْسٌ، وَمَا كَانَ نَسِيئَةً فَلاَ يَصْلُحُ ‏\"‏‏.‏ وَالْقَ زَيْدَ بْنَ أَرْقَمَ فَاسْأَلْهُ فَإِنَّهُ كَانَ أَعْظَمَنَا تِجَارَةً، فَسَأَلْتُ زَيْدَ بْنَ أَرْقَمَ فَقَالَ مِثْلَهُ‏.‏ وَقَالَ سُفْيَانُ مَرَّةً فَقَالَ قَدِمَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَنَحْنُ نَتَبَايَعُ، وَقَالَ نَسِيئَةً إِلَى الْمَوْسِمِ أَوِ الْحَجِّ‏.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3763,
                "hadithNumber": "3941",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Had only ten Jews (amongst their chiefs) believe me, all the Jews would definitely have believed me.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر دس یہودی ( احبار وعلماء ) مجھ پر ایمان لے آتے تو تمام یہود مسلمان ہو جاتے ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے قرہ بن خالد نے بیان کیا ، ان سے محمد بن سیرین نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا قُرَّةُ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَوْ آمَنَ بِي عَشَرَةٌ مِنَ الْيَهُودِ لآمَنَ بِي الْيَهُودُ ‏\"‏‏.‏",
                "headingArabic": "إِتْيَانِ الْيَهُودِ النَّبِيَّ صلى الله عليه وسلم حِينَ قَدِمَ الْمَدِينَةَ",
                "headingUrdu": "یہودیوں کا آنحضرت صلی اللہ علیہ وسلم کی مدینہ آمد پر آنا",
                "headingEnglish": "The coming of the Jews to the Prophet (saws) on his arrival at Al-Madina",
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3764,
                "hadithNumber": "3942",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "When the Prophet (ﷺ) arrived at Medina, he noticed that some people among the Jews used to respect Ashura' (i.e. 10th of Muharram) and fast on it. The Prophet (ﷺ) then said, \"We have more right to observe fast on this day.\" and ordered that fasting should be observed on it.",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو آپ نے دیکھا کہ یہودی عاشوراء کے دن کی تعظیم کرتے ہیں اور اس دن روزہ رکھتے ہیں آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہم اس دن روزہ رکھنے کے زیادہ حقدار ہیں ۔ چنانچہ آپ نے اس دن کے روزے کا حکم دیا ۔",
                "urduNarrator": "مجھ سے احمد یا محمد بن عبیداللہ غدانی نے بیان کیا ، کہا ہم سے حماد بن اسامہ نے بیان کیا کہ انہیں ابو عمیس نے خبر دی ، انہیں قیس بن مسلم نے ، انہیں طارق بن شہاب نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ ـ أَوْ مُحَمَّدُ ـ بْنُ عُبَيْدِ اللَّهِ الْغُدَانِيُّ حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ، أَخْبَرَنَا أَبُو عُمَيْسٍ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ دَخَلَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَإِذَا أُنَاسٌ مِنَ الْيَهُودِ يُعَظِّمُونَ عَاشُورَاءَ وَيَصُومُونَهُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ نَحْنُ أَحَقُّ بِصَوْمِهِ ‏\"‏‏.‏ فَأَمَرَ بِصَوْمِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3765,
                "hadithNumber": "3943",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When the Prophet (ﷺ) arrived at Medina he found that the Jews observed fast on the day of 'Ashura'. They were asked the reason for the fast. They replied, \"This is the day when Allah caused Moses and the children of Israel to have victory over Pharaoh, so we fast on this day as a sign of glorifying it.\" Allah's Messenger (ﷺ) said, \"We are closer to Moses than you.\" Then he ordered that fasting on this day should be observed.",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم مدینہ تشریف لائے تو آپ نے دیکھا کہ یہودی عاشوراء کے دن روزہ رکھتے ہیں ۔ اس کے متعلق ان سے پوچھا گیا تو انہوں نے بتایا کہ یہ وہ دن ہے جس میں اللہ تعالیٰ نے موسیٰ علیہ السلام اور بنی اسرائیل کو فرعوں پر فتح عنایت فرمائی تھی چنانچہ ہم اس دن کی تعظیم میں روزہ رکھتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہم موسیٰ علیہ السلام سے تمہاری بہ نسبت زیادہ قریب ہیں اور آپ نے اس دن روزہ رکھنے کا حکم دیا ۔",
                "urduNarrator": "ہم سے زیاد بن ایوب نے بیان کیا ، انہوں نے کہا ہم سے ہشیم نے بیان کیا ، انہوں نے کہا ہم سے ابو بشر جعفر نے بیان کیا ، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَجَدَ الْيَهُودَ يَصُومُونَ عَاشُورَاءَ، فَسُئِلُوا عَنْ ذَلِكَ، فَقَالُوا هَذَا الْيَوْمُ الَّذِي أَظْفَرَ اللَّهُ فِيهِ مُوسَى وَبَنِي إِسْرَائِيلَ عَلَى فِرْعَوْنَ، وَنَحْنُ نَصُومُهُ تَعْظِيمًا لَهُ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نَحْنُ أَوْلَى بِمُوسَى مِنْكُمْ ‏\"‏‏.‏ ثُمَّ أَمَرَ بِصَوْمِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3766,
                "hadithNumber": "3944",
                "englishNarrator": "Narrated `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) used to keep his hair falling loose while the pagans used to part their hair, and the People of the Scriptures used to keep their hair falling loose, and the Prophet (ﷺ) liked to follow the People of the Scriptures in matters about which he had not been instructed differently, but later on the Prophet (ﷺ) started parting his hair.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سر کے بال کو پیشانی پر لٹکا دیتے تھے اور مشرکین مانگ نکالتے تھے اور اہل کتاب بھی اپنے سروں کے بال پیشانی پر لٹکائے رہنے دیتے تھے ۔ جن امور میں نبی کریم صلی اللہ علیہ وسلم کو ( وحی کے ذریعہ ) کوئی حکم نہیں ہوتا تھا آپ ان میں اہل کتاب کی موافقت پسند کرتے تھے ۔ پھر بعدمیں آنحضرت صلی اللہ علیہ وسلم بھی مانگ نکالنے لگے تھے ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، انہوں نے کہا ہم سے عبداللہ بن مبارک نے بیان کیا ، انہوں نے کہا کہ ہم سے یونس نے ، ان سے زہری نے بیان کیا ، کہا مجھ کو عبیداللہ عبداللہ بن عتبہ نے خبر دی ، ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، حَدَّثَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَسْدِلُ شَعْرَهُ، وَكَانَ الْمُشْرِكُونَ يَفْرُقُونَ رُءُوسَهُمْ، وَكَانَ أَهْلُ الْكِتَابِ يَسْدِلُونَ رُءُوسَهُمْ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم يُحِبُّ مُوَافَقَةَ أَهْلِ الْكِتَابِ فِيمَا لَمْ يُؤْمَرْ فِيهِ بِشَىْءٍ، ثُمَّ فَرَقَ النَّبِيُّ صلى الله عليه وسلم رَأْسَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3767,
                "hadithNumber": "3945",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "They, the people of the Scriptures, divided this Scripture into parts, believing in some portions of it and disbelieving the others. (See 15:91)",
                "hadithUrdu": "وہ اہل کتاب ہی تو ہیں جنہوں نے آسمانی کتاب کو ٹکڑے ٹکڑے کر ڈالا ، بعض باتوں پر ایمان لائے اور بعض باتوں کا انکار کیا ۔",
                "urduNarrator": "مجھ سے زیاد بن ایوب نے بیان کیا کہا ہم سے ہشیم نے بیان کیا ، کہا ہم کو ابوبشر ( جابر بن ابی وحشیہ ) نے خبر دی ، انہیں سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے کہا کہ",
                "hadithArabic": "حَدَّثَنِي زِيَادُ بْنُ أَيُّوبَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ هُمْ أَهْلُ الْكِتَابِ، جَزَّءُوهُ أَجْزَاءً، فَآمَنُوا بِبَعْضِهِ وَكَفَرُوا بِبَعْضِهِ‏.‏ ‏{‏يَعْنِي قَوْلَ اللَّهِ تَعَالَى ‏{‏الَّذِينَ جَعَلُوا الْقُرْآنَ عِضِينَ ‏}‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3768,
                "hadithNumber": "3946",
                "englishNarrator": "Narrated Salman Al-Farisi رضی اللہ عنہ :",
                "hadithEnglish": "He was sold (as a slave) by one master to another for more than ten times (i.e between 13 and 19).",
                "hadithUrdu": "ان کو کچھ اوپر دس آدمیوں نے ایک مالک سے ان کو دس سے زائد آدمیوں نے لیا ، ایک مالک نے دوسرے مالک سے خریدا ۔",
                "urduNarrator": "مجھ سے حسن بن شقیق نے بیان کیا ، کہا ہم سے معتمر نے بیان کیا کہ میرے والد سلیمان بن طرخان نے بیان کیا ( دوسری سند ) اور ہم سے ابوعثمان نہدی نے بیان کیا کہا میں نے سنا سلمان فارسی رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنِي الْحَسَنُ بْنُ عُمَرَ بْنِ شَقِيقٍ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ أَبِي وَحَدَّثَنَا أَبُو عُثْمَانَ، عَنْ سَلْمَانَ الْفَارِسِيِّ، أَنَّهُ تَدَاوَلَهُ بِضْعَةَ عَشَرَ مِنْ رَبٍّ إِلَى رَبٍّ‏.‏",
                "headingArabic": "إِسْلاَمُ سَلْمَانَ الْفَارِسِيِّ رضى الله عنه",
                "headingUrdu": "سلمان فارسی رضی اللہ عنہ کا اسلام قبول کرنا",
                "headingEnglish": "The conversion of Salman Al-Farisi to Islam رضي الله عنه",
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3769,
                "hadithNumber": "3947",
                "englishNarrator": "Narrated Salman رضي الله عنه :",
                "hadithEnglish": "I am from Ram-Hurmuz (i.e. a Persian town).",
                "hadithUrdu": "میں رام ہرمز ( فارس میں ایک مقام ہے ) کا رہنے والا ہوں ۔",
                "urduNarrator": "ہم سے محمد بن یوسف بیکندی نے بیان کیا کہا ہم سے ابن عیینہ نے بیان کیا ، ان سے عوف اعرابی نے ، ان سے ابوعثمان نہدی نے بیان کیا ، کہا میں نے حضرت سلمان فارسی رضى الله عنه   سے سنا ، وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَوْفٍ، عَنْ أَبِي عُثْمَانَ، قَالَ سَمِعْتُ سَلْمَانَ ـ رضى الله عنه ـ يَقُولُ أَنَا مِنْ، رَامَ هُرْمُزَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3770,
                "hadithNumber": "3948",
                "englishNarrator": "Narrated Salman رضى الله عنه :",
                "hadithEnglish": "The interval between Jesus  علیہ السلام and Muhammad (ﷺ) was six hundred years.",
                "hadithUrdu": "عیسیٰ علیہ السلام اور محمد صلی اللہ علیہ وسلم کے درمیان میں فترت کا زمانہ ( یعنی جس میں کوئی پیغمبر نہیں آیا ) چھ سو برس کا وقفہ گزراہے ۔",
                "urduNarrator": "مجھ سے حسن بن مدرک نے بیان کیا ، کہا ہم سے یحییٰ بن حماد نے بیان کیا ، کہا ہم کو ابو عوانہ نے خبر دی ، انہیں عاصم احول نے ، انہیں ابوعثمان نہدی نے اور ان سے حضرت سلمان فارسی رضی اللہ عنہ نے بیان کیا کہ ،",
                "hadithArabic": "حَدَّثَنِي الْحَسَنُ بْنُ مُدْرِكٍ، حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ أَبِي عُثْمَانَ، عَنْ سَلْمَانَ، قَالَ فَتْرَةٌ بَيْنَ عِيسَى وَمُحَمَّدٍ صلى الله عليه وسلم سِتُّمِائَةِ سَنَةٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "64",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 64,
                    "chapterNumber": "64",
                    "chapterEnglish": "Merits of the Helpers in Madinah (Ansaar)",
                    "chapterUrdu": "انصار کے مناقب",
                    "chapterArabic": "كتاب مناقب الأنصار",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3771,
                "hadithNumber": "3949",
                "englishNarrator": "Narrated Abu 'Is-haq:",
                "hadithEnglish": "Once, while I was sitting beside Zaid bin Al-Arqam رضی اللہ عنہ , he was asked, \"How many Ghazwat did the Prophet undertake?\" Zaid replied, \"Nineteen.\" They said, \"In how many Ghazwat did you join him?\" He replied, \"Seventeen.\" I asked, \"Which of these was the first?\" He replied, \"Al-`Ashira or Al- `Ashiru.\" When I mentioned it to Qatadah, he replied: Oshair.",
                "hadithUrdu": "میں ایک وقت زید بن ارقم رضی اللہ عنہ کے پہلو میں بیٹھا ہوا تھا۔ ان سے پوچھا گیا تھا کہ نبی کریم صلی اللہ علیہ وسلم نے کتنے غزوے کئے؟ انہوں نے کہا انیس۔ میں نے پوچھا آپ نبی کریم صلی اللہ علیہ وسلم کے ساتھ کتنے غزوات میں شریک رہے؟ تو انہوں نے کہا کہ سترہ میں۔ میں نے پوچھا آپ صلی اللہ علیہ وسلم کا سب سے پہلا غزوہ کون سا تھا؟ کہا کہ عسیرہ یا عشیرہ۔ پھر میں نے اس کا ذکر قتادہ سے کیا تو انہوں نے کہا کہ ( صحیح لفظ ) عشیرہ ہے۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد نے بیان کیا، کہا ہم سے وہب نے بیان کیا، ان سے شعبہ نے، ان سے ابواسحاق نے کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، كُنْتُ إِلَى جَنْبِ زَيْدِ بْنِ أَرْقَمَ، فَقِيلَ لَهُ كَمْ غَزَا النَّبِيُّ صلى الله عليه وسلم مِنْ غَزْوَةٍ قَالَ تِسْعَ عَشْرَةَ‏.‏ قِيلَ كَمْ غَزَوْتَ أَنْتَ مَعَهُ قَالَ سَبْعَ عَشْرَةَ‏.‏ قُلْتُ فَأَيُّهُمْ كَانَتْ أَوَّلَ قَالَ الْعُسَيْرَةُ أَوِ الْعُشَيْرُ‏.‏ فَذَكَرْتُ لِقَتَادَةَ فَقَالَ الْعُشَيْرُ‏.‏",
                "headingArabic": "غَزْوَةِ الْعُشَيْرَةِ أَوِ الْعُسَيْرَةِ",
                "headingUrdu": "غزوہ العشیرہ یا العسیرہ",
                "headingEnglish": "The Ghazwa of Al-‘Ushaira or Al-usaira",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3772,
                "hadithNumber": "3950",
                "englishNarrator": "Narrated Sa`d bin Mu`adh رضی اللہ عنہ :",
                "hadithEnglish": "Sa`d bin Mu`adh was an intimate friend of Umaiya bin Khalaf and whenever Umaiya passed through Medina, he used to stay with Sa`d رضی اللہ عنہ , and whenever Sa`d رضی اللہ عنہ went to Mecca, he used to stay with Umaiya. When Allah's Messenger (ﷺ) arrived at Medina, Sa`d رضی اللہ عنہ went to perform `Umra and stayed at Umaiya's home in Mecca. He said to Umaiya, \"Tell me of a time when (the Mosque) is empty so that I may be able to perform Tawaf around the Ka`ba.\" So Umaiya went with him about midday. Abu Jahl met them and said, \"O Abu Safwan! Who is this man accompanying you?\" He said, \"He is Sa`d رضی اللہ عنہ .\" Abu Jahl addressed Sa`d رضی اللہ عنہ saying, \"I see you wandering about safely in Mecca inspite of the fact that you have given shelter to the people who have changed their religion (i.e. became Muslims) and have claimed that you will help them and support them. By Allah, if you were not in the company of Abu Safwan, you would not be able to go your family safely.\" Sa`d رضی اللہ عنہ , raising his voice, said to him, \"By Allah, if you should stop me from doing this (i.e. performing Tawaf) I would certainly prevent you from something which is more valuable for you, that is, your passage through Medina.\" On this, Umaiya said to him, \"O Sa`d رضی اللہ عنہ do not raise your voice before Abu-l-Hakam, the chief of the people of the Valley (of Mecca).\" Sa`d رضی اللہ عنہ said, \"O Umaiya, stop that! By Allah, I have heard Allah's Messenger (ﷺ) predicting that the Muslim will kill you.\" Umaiya asked, \"In Mecca?\" Sa`d رضی اللہ عنہ said, \"I do not know.\" Umaiya was greatly scared by that news. When Umaiya returned to his family, he said to his wife, \"O Um Safwan! Don't you know what Sa`d رضی اللہ عنہ told me? \"She said, \"What has he told you?\" He replied, \"He claims that Muhammad has informed them (i.e. companions that they will kill me. I asked him, 'In Mecca?' He replied, 'I do not know.\" Then Umaiya added, \"By Allah, I will never go out of Mecca.\" But when the day of (the Ghazwa of) Badr came, Abu Jahl called the people to war, saying, \"Go and protect your caravan.\" But Umaiya disliked to go out (of Mecca). Abu Jahl came to him and said, \"O Abu Safwan! If the people see you staying behind though you are the chief of the people of the Valley, then they will remain behind with you.\" Abu Jahl kept on urging him to go until he (i.e. Umaiya) said, \"As you have forced me to change my mind, by Allah, I will buy the best camel in Mecca. Then Umaiya said (to his wife). \"O Um Safwan, prepare what I need (for the journey).\" She said to him, \"O Abu Safwan! Have you forgotten what your Yathribi brother told you?\" He said, \"No, but I do not want to go with them but for a short distance.\" So when Umaiya went out, he used to tie his camel wherever he camped. He kept on doing that till Allah caused him to be killed at Badr.",
                "hadithUrdu": "وہ امیہ بن خلف کے ( جاہلیت کے زمانے سے ) دوست تھے اور جب بھی امیہ مدینہ سے گزرتا تو ان کے یہاں قیام کرتا تھا۔ اسی طرح سعد رضی اللہ عنہ جب مکہ سے گزرتے تو امیہ کے یہاں قیام کرتے۔ جب نبی کریم صلی اللہ علیہ وسلم مدینہ ہجرت کر کے تشریف لائے تو ایک مرتبہ سعد رضی اللہ عنہ مکہ عمرہ کے ارادے سے گئے اور امیہ کے پاس قیام کیا۔ انہوں نے امیہ سے کہا کہ میرے لیے کوئی تنہائی کا وقت بتاؤ تاکہ میں بیت اللہ کا طواف کروں۔ چنانچہ امیہ انہیں دوپہر کے وقت ساتھ لے کر نکلا۔ ان سے ابوجہل کی ملاقات ہو گئی۔ اس نے پوچھا، ابوصفوان! یہ تمہارے ساتھ کون ہیں؟ امیہ نے بتایا کہ یہ سعد بن معاذ رضی اللہ عنہ ہیں۔ ابوجہل نے کہا، میں تمہیں مکہ میں امن کے ساتھ طواف کرتا ہوا نہ دیکھوں۔ تم نے بے دینوں کو پناہ دے رکھی ہے اور اس خیال میں ہو کہ تم لوگ ان کی مدد کرو گے۔ خدا کی قسم! اگر اس وقت تم، ابوصفوان! امیہ کے ساتھ نہ ہوتے تو اپنے گھر سلامتی سے نہیں جا سکتے تھے۔ اس پر سعد رضی اللہ عنہ نے کہا، اس وقت ان کی آواز بلند ہو گئی تھی کہ اللہ کی قسم! اگر آج تم نے مجھے طواف سے روکا تو میں بھی مدینہ کی طرف سے تمہارا راستہ بند کر دوں گا اور یہ تمہارے لیے بہت سی مشکلات کا باعث بن جائے گا۔ امیہ کہنے لگا، سعد! ابوالحکم ( ابوجہل ) کے سامنے بلند آواز سے نہ بولو۔ یہ وادی کا سردار ہے۔ سعد رضی اللہ عنہ نے کہا، امیہ! اس طرح کی گفتگو نہ کرو۔ اللہ کی قسم! میں رسول اللہ صلی اللہ علیہ وسلم سے سن چکا ہوں کہ تو ان کے ہاتھوں سے مارا جائے گا۔ امیہ نے پوچھا۔ کیا مکہ میں مجھے قتل کریں گے؟ انہوں نے کہا کہ اس کا مجھے علم نہیں۔ امیہ یہ سن کر بہت گھبرا گیا اور جب اپنے گھر لوٹا تو ( اپنی بیوی سے ) کہا، ام صفوان! دیکھا نہیں سعد میرے متعلق کیا کہہ رہے ہیں۔ اس نے پوچھا، کیا کہہ رہے ہیں؟ امیہ نے کہا کہ وہ یہ بتا رہے تھے کہ محمد ( صلی اللہ علیہ وسلم ) نے انہیں خبر دی ہے کہ کسی نہ کسی دن وہ مجھے قتل کر دیں گے۔ میں نے پوچھا کیا مکہ میں مجھے قتل کریں گے؟ تو انہوں نے کہا کہ اس کی مجھے خبر نہیں۔ امیہ کہنے لگا: خدا کی قسم! اب مکہ سے باہر میں کبھی نہیں جاؤں گا۔ پھر بدر کی لڑائی کے موقع پر جب ابوجہل نے قریش سے لڑائی کی تیاری کے لیے کہا اور کہا کہ اپنے قافلہ کی مدد کو چلو تو امیہ نے لڑائی میں شرکت پسند نہیں کی، لیکن ابوجہل اس کے پاس آیا اور کہنے لگا، اے صفوان! تم وادی کے سردار ہو۔ جب لوگ دیکھیں گے کہ تم ہی لڑائی میں نہیں نکلتے ہو تو دوسرے لوگ بھی نہیں نکلیں گے۔ ابوجہل یوں ہی برابر اس کو سمجھاتا رہا۔ آخر مجبور ہو کر امیہ نے کہا جب نہیں مانتا تو خدا کی قسم ( اس لڑائی کے لیے ) میں ایسا تیز رفتار اونٹ خریدوں گا جس کا ثانی مکہ میں نہ ہو۔ پھر امیہ نے ( اپنی بیوی سے ) کہا، ام صفوان! میرا سامان تیار کر دے۔ اس نے کہا، ابوصفوان! اپنے یثربی بھائی کی بات بھول گئے؟ امیہ بولا، میں بھولا نہیں ہوں۔ ان کے ساتھ صرف تھوڑی دور تک جاؤں گا۔ جب امیہ نکلا تو راستہ میں جس منزل پر بھی ٹھہرنا ہوتا، یہ اپنا اونٹ ( اپنے پاس ہی ) باندھے رکھتا۔ وہ برابر ایسا ہی احتیاط کرتا رہا یہاں تک کہ اللہ تعالیٰ نے اسے قتل کرا دیا۔",
                "urduNarrator": "مجھ سے احمد بن عثمان نے بیان کیا، ہم سے شریح بن مسلمہ نے بیان کیا، ہم سے ابراہیم بن یوسف نے بیان کیا، ان سے ان کے والد نے، ان سے ابواسحاق نے بیان کیا کہ مجھ سے عمرو بن میمون نے بیان کیا، انہوں نے عبداللہ بن مسعود رضی اللہ عنہ سے سنا، وہ سعد بن معاذ رضی اللہ عنہ سے بیان کرتے تھے، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ عُثْمَانَ، حَدَّثَنَا شُرَيْحُ بْنُ مَسْلَمَةَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يُوسُفَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، قَالَ حَدَّثَنِي عَمْرُو بْنُ مَيْمُونٍ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ ـ رضى الله عنه ـ حَدَّثَ عَنْ سَعْدِ بْنِ مُعَاذٍ، أَنَّهُ قَالَ كَانَ صَدِيقًا لأُمَيَّةَ بْنِ خَلَفٍ، وَكَانَ أُمَيَّةُ إِذَا مَرَّ بِالْمَدِينَةِ نَزَلَ عَلَى سَعْدٍ، وَكَانَ سَعْدٌ إِذَا مَرَّ بِمَكَّةَ نَزَلَ عَلَى أُمَيَّةَ، فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ انْطَلَقَ سَعْدٌ مُعْتَمِرًا، فَنَزَلَ عَلَى أُمَيَّةَ بِمَكَّةَ، فَقَالَ لأُمَيَّةَ انْظُرْ لِي سَاعَةَ خَلْوَةٍ لَعَلِّي أَنْ أَطُوفَ بِالْبَيْتِ‏.‏ فَخَرَجَ بِهِ قَرِيبًا مِنْ نِصْفِ النَّهَارِ فَلَقِيَهُمَا أَبُو جَهْلٍ فَقَالَ يَا أَبَا صَفْوَانَ، مَنْ هَذَا مَعَكَ فَقَالَ هَذَا سَعْدٌ‏.‏ فَقَالَ لَهُ أَبُو جَهْلٍ أَلاَ أَرَاكَ تَطُوفُ بِمَكَّةَ آمِنًا، وَقَدْ أَوَيْتُمُ الصُّبَاةَ، وَزَعَمْتُمْ أَنَّكُمْ تَنْصُرُونَهُمْ وَتُعِينُونَهُمْ، أَمَا وَاللَّهِ لَوْلاَ أَنَّكَ مَعَ أَبِي صَفْوَانَ مَا رَجَعْتَ إِلَى أَهْلِكَ سَالِمًا‏.‏ فَقَالَ لَهُ سَعْدٌ وَرَفَعَ صَوْتَهُ عَلَيْهِ أَمَا وَاللَّهِ لَئِنْ مَنَعْتَنِي هَذَا لأَمْنَعَنَّكَ مَا هُوَ أَشَدُّ عَلَيْكَ مِنْهُ طَرِيقَكَ عَلَى الْمَدِينَةِ‏.‏ فَقَالَ لَهُ أُمَيَّةُ لاَ تَرْفَعْ صَوْتَكَ يَا سَعْدُ عَلَى أَبِي الْحَكَمِ سَيِّدِ أَهْلِ الْوَادِي‏.‏ فَقَالَ سَعْدٌ دَعْنَا عَنْكَ يَا أُمَيَّةُ، فَوَاللَّهِ لَقَدْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ إِنَّهُمْ قَاتِلُوكَ‏.‏ قَالَ بِمَكَّةَ قَالَ لاَ أَدْرِي‏.‏ فَفَزِعَ لِذَلِكَ أُمَيَّةُ فَزَعًا شَدِيدًا، فَلَمَّا رَجَعَ أُمَيَّةُ إِلَى أَهْلِهِ قَالَ يَا أُمَّ صَفْوَانَ، أَلَمْ تَرَىْ مَا قَالَ لِي سَعْدٌ قَالَتْ وَمَا قَالَ لَكَ قَالَ زَعَمَ أَنَّ مُحَمَّدًا أَخْبَرَهُمْ أَنَّهُمْ قَاتِلِيَّ، فَقُلْتُ لَهُ بِمَكَّةَ قَالَ لاَ أَدْرِي‏.‏ فَقَالَ أُمَيَّةُ وَاللَّهِ لاَ أَخْرُجُ مِنْ مَكَّةَ، فَلَمَّا كَانَ يَوْمَ بَدْرٍ اسْتَنْفَرَ أَبُو جَهْلٍ النَّاسَ قَالَ أَدْرِكُوا عِيرَكُمْ‏.‏ فَكَرِهَ أُمَيَّةُ أَنْ يَخْرُجَ، فَأَتَاهُ أَبُو جَهْلٍ فَقَالَ يَا أَبَا صَفْوَانَ، إِنَّكَ مَتَى مَا يَرَاكَ النَّاسُ قَدْ تَخَلَّفْتَ وَأَنْتَ سَيِّدُ أَهْلِ الْوَادِي تَخَلَّفُوا مَعَكَ، فَلَمْ يَزَلْ بِهِ أَبُو جَهْلٍ حَتَّى قَالَ أَمَّا إِذْ غَلَبْتَنِي، فَوَاللَّهِ لأَشْتَرِيَنَّ أَجْوَدَ بَعِيرٍ بِمَكَّةَ ثُمَّ قَالَ أُمَيَّةُ يَا أُمَّ صَفْوَانَ جَهِّزِينِي‏.‏ فَقَالَتْ لَهُ يَا أَبَا صَفْوَانَ وَقَدْ نَسِيتَ مَا قَالَ لَكَ أَخُوكَ الْيَثْرِبِيُّ قَالَ لاَ، مَا أُرِيدُ أَنْ أَجُوزَ مَعَهُمْ إِلاَّ قَرِيبًا‏.‏ فَلَمَّا خَرَجَ أُمَيَّةُ أَخَذَ لاَ يَنْزِلُ مَنْزِلاً إِلاَّ عَقَلَ بَعِيرَهُ، فَلَمْ يَزَلْ بِذَلِكَ حَتَّى قَتَلَهُ اللَّهُ عَزَّ وَجَلَّ بِبَدْرٍ‏.‏",
                "headingArabic": "ذِكْرُ النَّبِيِّ صلى الله عليه وسلم مَنْ يُقْتَلُ بِبَدْرٍ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کی پیشین گوئی جس کے بارے میں آپ کا خیال تھا کہ وہ بدر میں مارے جائیں گے۔",
                "headingEnglish": "The Prophet’s (saws) prediction about whom he thought would be killed at Badr",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3773,
                "hadithNumber": "3951",
                "englishNarrator": "Narrated Ka`b bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "I never failed to join Allah's Messenger (ﷺ) in any of his Ghazawat except in the Ghazwa of Tabuk. However, I did not take part in the Ghazwa of Badr, but none who failed to take part in it, was blamed, for Allah's Messenger (ﷺ) had gone out to meet the caravans of (Quraish, but Allah caused them (i.e. Muslims) to meet their enemy unexpectedly (with no previous intention) .",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے جتنے غزوے کئے، میں غزوہ تبوک کے سوا سب میں حاضر رہا۔ البتہ غزوہ بدر میں شریک نہ ہو سکا تھا لیکن جو لوگ اس غزوے میں شریک نہ ہو سکے تھے، ان میں سے کسی پر اللہ نے عتاب نہیں کیا۔ کیونکہ رسول اللہ صلی اللہ علیہ وسلم قریش کے قافلے کو تلاش کرنے کے لیے نکلے تھے۔ ( لڑنے کی نیت سے نہیں گئے تھے ) مگر اللہ تعالیٰ نے ناگہانی مسلمانوں کو ان کے دشمنوں سے بھڑا دیا۔",
                "urduNarrator": "مجھ سے یحییٰ بن بکیر نے بیان کیا، انہوں نے کہا ہم سے لیث نے بیان کیا، انہوں نے کہا کہ ہم سے عقیل نے بیان کیا، ان سے ابن شہاب نے بیان کیا، ان سے عبدالرحمٰن بن عبداللہ بن کعب نے، ان سے عبداللہ بن کعب نے بیان کیا، انہوں نے کہا کہ میں نے کعب بن مالک رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ لَمْ أَتَخَلَّفْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةٍ غَزَاهَا إِلاَّ فِي غَزْوَةِ تَبُوكَ، غَيْرَ أَنِّي تَخَلَّفْتُ عَنْ غَزْوَةِ بَدْرٍ، وَلَمْ يُعَاتَبْ أَحَدٌ تَخَلَّفَ عَنْهَا، إِنَّمَا خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُرِيدُ عِيرَ قُرَيْشٍ، حَتَّى جَمَعَ اللَّهُ بَيْنَهُمْ وَبَيْنَ عَدُوِّهِمْ عَلَى غَيْرِ مِيعَادٍ‏.‏",
                "headingArabic": "قِصَّةُ غَزْوَةِ بَدْرٍ",
                "headingUrdu": "غزوہ بدر کا واقعہ",
                "headingEnglish": "The story of the Ghazwa of Badr",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3774,
                "hadithNumber": "3952",
                "englishNarrator": "Narrated Ibn Masud رضی اللہ عنہ :",
                "hadithEnglish": "I witnessed Al-Miqdad bin Al-Aswad رضی اللہ عنہ in a scene which would have been dearer to me than anything had I been the hero of that scene. He (i.e. Al-Miqdad) came to the Prophet (ﷺ) while the Prophet (ﷺ) was urging the Muslims to fight with the pagans. Al-Miqdad said, \"We will not say as the People of Moses said: Go you and your Lord and fight you two. (5.27). But we shall fight on your right and on your left and in front of you and behind you.\" I saw the face of the Prophet (ﷺ) getting bright with happiness, for that saying delighted him.",
                "hadithUrdu": "میں نے مقداد بن اسود رضی اللہ عنہ سے ایک ایسی بات سنی کہ اگر وہ بات میری زبان سے ادا ہو جاتی تو میرے لیے کسی بھی چیز کے مقابلے میں زیادہ عزیز ہوتی۔ وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے۔ نبی کریم صلی اللہ علیہ وسلم اس وقت مشرکین پر بددعا کر رہے تھے۔ انہوں نے عرض کیا: یا رسول اللہ! ہم وہ نہیں کہیں گے جو موسیٰ علیہ السلام کی قوم نے کہا تھا کہ جاؤ، تم اور تمہارا رب ان سے جنگ کرو، بلکہ ہم آپ کے دائیں بائیں، آگے اور پیچھے جمع ہو کر لڑیں گے۔ میں نے دیکھا کہ نبی کریم صلی اللہ علیہ وسلم کا چہرہ مبارک چمکنے لگا اور آپ صلی اللہ علیہ وسلم خوش ہو گئے۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا، ہم سے اسرائیل بن یونس نے بیان کیا، ان سے مخارق بن عبداللہ بجلی نے، ان سے طارق بن شہاب نے، انہوں نے ابن مسعود رضی اللہ عنہ سے سنا، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ مُخَارِقٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، قَالَ سَمِعْتُ ابْنَ مَسْعُودٍ، يَقُولُ شَهِدْتُ مِنَ الْمِقْدَادِ بْنِ الأَسْوَدِ مَشْهَدًا، لأَنْ أَكُونَ صَاحِبَهُ أَحَبُّ إِلَىَّ مِمَّا عُدِلَ بِهِ، أَتَى النَّبِيَّ صلى الله عليه وسلم وَهْوَ يَدْعُو عَلَى الْمُشْرِكِينَ فَقَالَ لاَ نَقُولُ كَمَا قَالَ قَوْمُ مُوسَى ‏{‏اذْهَبْ أَنْتَ وَرَبُّكَ فَقَاتِلاَ‏}‏ وَلَكِنَّا نُقَاتِلُ عَنْ يَمِينِكَ وَعَنْ شِمَالِكَ وَبَيْنَ يَدَيْكَ وَخَلْفَكَ‏.‏ فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم أَشْرَقَ وَجْهُهُ وَسَرَّهُ‏.‏ يَعْنِي قَوْلَهُ‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى {إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ أَنِّي مُمِدُّكُمْ بِأَلْفٍ مِنْ الْمَلَائِكَةِ مُرْدِفِينَ وَمَا جَعَلَهُ اللَّهُ إِلاَّ بُشْرَى وَلِتَطْمَئِنَّ بِهِ قُلُوبُكُمْ وَمَا النَّصْرُ إِلاَّ مِنْ عِنْدِ اللَّهِ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ إِذْ يُغَشِّيكُمُ النُّعَاسَ أَمَنَةً مِنْهُ وَيُنَزِّلُ عَلَيْكُمْ مِنَ السَّمَاءِ مَاءً لِيُطَهِّرَكُمْ بِهِ وَيُذْهِبَ عَنْكُمْ رِجْزَ الشَّيْطَانِ وَلِيَرْبِطَ عَلَى قُلُوبِكُمْ وَيُثَبِّتَ بِهِ الأَقْدَامَ إِذْ يُوحِي رَبُّكَ إِلَى الْمَلاَئِكَةِ أَنِّي مَعَكُمْ فَثَبِّتُوا الَّذِينَ آمَنُوا سَأُلْقِي فِي قُلُوبِ الَّذِينَ كَفَرُوا الرُّعْبَ فَاضْرِبُوا فَوْقَ الأَعْنَاقِ وَاضْرِبُوا مِنْهُمْ كُلَّ بَنَانٍ ذَلِكَ بِأَنَّهُمْ شَاقُّوا اللَّهَ وَرَسُولَهُ وَمَنْ يُشَاقِقِ اللَّهَ وَرَسُولَهُ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ}",
                "headingUrdu": "(یاد کرو) جب تم نے اپنے رب سے مدد مانگی تو اس نے تمہاری دعا قبول فرمائی، بے شک اللہ سخت سزا دینے والا ہے۔",
                "headingEnglish": "“(Remember) when you sought help of your Lord and He answered you… verily, Allah is Severe in punishment.”",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3775,
                "hadithNumber": "3953",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "On the day of the battle of Badr, the Prophet (ﷺ) said, \"O Allah! I appeal to You (to fulfill) Your Covenant and Promise. O Allah! If Your Will is that none should worship You (then give victory to the pagans).\" Then Abu Bakr رضی اللہ عنہ took hold of him by the hand and said, \"This is sufficient for you.\" The Prophet came out saying, \"Their multitude will be put to flight and they will show their backs.\" (54.45)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے بدر کی لڑائی کے موقع پر فرمایا تھا کہ اے اللہ! میں تیرے عہد اور وعدہ کا واسطہ دیتا ہوں، اگر تو چاہے ( کہ یہ کافر غالب ہوں تو مسلمانوں کے ختم ہو جانے کے بعد ) تیری عبادت نہ ہو گی۔ اس پر ابوبکر رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کا ہاتھ تھام لیا اور عرض کیا بس کیجئے، یا رسول اللہ! اس کے بعد آپ صلی اللہ علیہ وسلم اپنے خیمے سے باہر تشریف لائے تو آپ صلی اللہ علیہ وسلم کی زبان پر یہ آیت تھی «سيهزم الجمع ويولون الدبر‏» ”جلد ہی کفار کی جماعت کو ہار ہو گی اور یہ پیٹھ پھیر کر بھاگ نکلیں گے۔“",
                "urduNarrator": "مجھ سے عبداللہ بن حوشب نے بیان کیا، ہم سے عبدالوہاب نے بیان کیا، ان سے خالد نے، ان سے عکرمہ نے، ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَوْشَبٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ بَدْرٍ ‏\"‏ اللَّهُمَّ أَنْشُدُكَ عَهْدَكَ وَوَعْدَكَ، اللَّهُمَّ إِنْ شِئْتَ لَمْ تُعْبَدْ ‏\"‏‏.‏ فَأَخَذَ أَبُو بَكْرٍ بِيَدِهِ فَقَالَ حَسْبُكَ‏.‏ فَخَرَجَ وَهْوَ يَقُولُ ‏{‏سَيُهْزَمُ الْجَمْعُ وَيُوَلُّونَ الدُّبُرَ‏}‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3776,
                "hadithNumber": "3954",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The believers who failed to join the Ghazwa of Badr and those who took part in it are not equal (in reward). means that those who did not participate in the Battle of Badr cannot be equal to those who participated in the Battle of Badr.",
                "hadithUrdu": "( سورۃ نساء کی اس آیت سے ) «لا يستوي القاعدون من المؤمنين‏» جہاد میں شرکت کرنے والے اور اس میں شریک نہ ہونے والے برابر نہیں ہو سکتے۔ وہ لوگ مراد ہیں جو بدر کی لڑائی میں شریک ہوئے اور جو اس میں شریک نہیں ہوئے۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، ہم کو ہشام نے خبر دی، انہیں ابن جریج نے خبر دی، کہا کہ مجھے عبدالکریم نے خبر دی، انہوں نے عبداللہ بن حارث کے مولیٰ مقسم سے سنا، وہ ابن عباس رضی اللہ عنہما سے بیان کرتے تھے، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي عَبْدُ الْكَرِيمِ، أَنَّهُ سَمِعَ مِقْسَمًا، مَوْلَى عَبْدِ اللَّهِ بْنِ الْحَارِثِ يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ سَمِعَهُ يَقُولُ ‏{‏لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ‏}‏ عَنْ بَدْرٍ، وَالْخَارِجُونَ، إِلَى بَدْرٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3777,
                "hadithNumber": "3955",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہما :",
                "hadithEnglish": "I and Ibn `Umar رضی اللہ عنہما were considered too young to take part in the battle of Badr.",
                "hadithUrdu": "( بدر کی لڑائی کے موقع پر ) مجھے اور ابن عمر رضی اللہ عنہما کو نابالغ قرار دے دیا گیا تھا۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، ان سے ابواسحاق نے اور ان سے براء بن عازب رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ اسْتُصْغِرْتُ أَنَا وَابْنُ، عُمَرَ‏.‏",
                "headingArabic": "عِدَّةِ أَصْحَابِ بَدْرٍ",
                "headingUrdu": "بدر کے جنگجوؤں کی تعداد",
                "headingEnglish": "The number of the warriors of Badr",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 3751,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=150",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=148",
                "label": "148",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=149",
                "label": "149",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=150",
                "label": "150",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=151",
                "label": "151",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=152",
                "label": "152",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=153",
                "label": "153",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=154",
                "label": "154",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=152",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=152",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=150",
        "to": 3775,
        "total": 40465
    }
}