{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 218,
        "data": [
            {
                "id": 5428,
                "hadithNumber": "5665",
                "englishNarrator": "Narrated Ka`b bin 'Ujara رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) passed by me while I was kindling a fire under a (cooking) pot. He said, \"Do the lice of your head trouble you?\" I said, \"Yes.\" So he called a barber to shave my head and ordered me to make expiation for that.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم میرے قریب سے گزر ے اور میں ہانڈی کے نیچے آگ سلگا رہا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیا تمہارے سر کی جوویں تمہیں تکلیف پہنچاتی ہیں ۔ میں نے عرض کیا جی ہاں پھر آپ نے حجام بلوایا اور اس نے میرا سر مونڈ دیا اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے مجھے فدیہ ادا کر دینے کا حکم فرمایا ۔",
                "urduNarrator": "ہم سے قبیصہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ابن ابی نجیح اور ایوب نے ، ان سے مجاہد نے ، ان سے عبدالرحمٰن بن ابی لیلیٰ نے اور ان سے کعب بن عجرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي نَجِيحٍ، وَأَيُّوبَ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ ـ رضى الله عنه‏.‏ مَرَّ بِيَ النَّبِيُّ صلى الله عليه وسلم وَأَنَا أُوقِدُ تَحْتَ الْقِدْرِ فَقَالَ ‏ \"‏ أَيُؤْذِيكَ هَوَامُّ رَأْسِكَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَدَعَا الْحَلاَّقَ فَحَلَقَهُ ثُمَّ أَمَرَنِي بِالْفِدَاءِ‏.‏",
                "headingArabic": "قَوْلِ الْمَرِيضِ إِنِّي وَجِعٌ أَوْ وَارَأْسَاهْ، أَوِ اشْتَدَّ بِي الْوَجَعُ",
                "headingUrdu": "یہ کہنا کہ \"میں بیمار ہوں\" یا \"اوہ، میرا سر!\" یا \"میری بیماری بڑھ گئی ہے\"",
                "headingEnglish": "To say \"I am sick,\" or \"Oh, my head!\" or \"My ailment has been aggravated\"",
                "chapterId": "76",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 76,
                    "chapterNumber": "76",
                    "chapterEnglish": "Patients",
                    "chapterUrdu": "امراض اور ان کے علاج کے بیان میں",
                    "chapterArabic": "كتاب المرضى",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5429,
                "hadithNumber": "5666",
                "englishNarrator": "Narrated Al-Qasim bin Muhammad:",
                "hadithEnglish": "`Aisha رضی اللہ عنہا , (complaining of headache) said, \"Oh, my head\"! Allah's Messenger (ﷺ) said, \"I wish that had happened while I was still living, for then I would ask Allah's Forgiveness for you and invoke Allah for you.\" Aisha رضی اللہ عنہا said, \"Wa thuklayah! By Allah, I think you want me to die; and If this should happen, you would spend the last part of the day sleeping with one of your wives!\" The Prophet (ﷺ) said, \"Nay, I should say, 'Oh my head!' I felt like sending for Abu Bakr رضی اللہ عنہ and his son, and appoint him as my successor lest some people claimed something or some others wished something, but then I said (to myself), 'Allah would not allow it to be otherwise, and the Muslims would prevent it to be otherwise\".",
                "hadithUrdu": "( سر کے شدید درد کی وجہ سے ) عائشہ رضی اللہ عنہا نے کہاہائے رے سر ! اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اگر ایسا میری زندگی میں ہو گیا ( یعنی تمہارا انتقال ہو گیا ) تو میں تمہارے لیے استغفار اور دعا کروں گا ۔ عائشہ رضی اللہ عنہا نے کہا افسوس ، اللہ کی قسم ! میرا خیال ہے کہ آپ میرا مرجانا ہی پسند کرتے ہیں اور اگر ایسا ہو گیا تو آپ تو اسی دن رات اپنی کسی بیوی کے یہاں گزاریں گے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا بلکہ میں خود درد سر میں مبتلاہوں ۔ میرا ارادہ ہوتا تھا کہ ابوبکر رضی اللہ عنہ اور ان کے بیٹے کو بلا بھیجوں اور انہیں ( خلافت کی ) وصیت کر دوں ۔ کہیں ایسا نہ ہو کہ میرے بعد کہنے والے کچھ اور کہیں ( کہ خلافت ہمارا حق ہے ) یا آرزو کرنے والے کسی اور بات کی آرزو کریں ( کہ ہم خلیفہ ہو جائیں ) پھر میں نے اپنے جی میں کہا ( اس کی ضرورت ہی کیا ہے ) خود اللہ تعالیٰ ابوبکر رضی اللہ عنہ کے سو اورکسی کو خلیفہ نہ ہونے دے گا نہ مسلمان اور کسی کی خلافت ہی قبول کریں گے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ ابو زکریا نے بیان کیا ، کہا ہم کو سلیمان بن بلال نے خبر دی ، ان سے یحییٰ بن سعید نے ، کہ میں نے قاسم بن محمد سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَبُو زَكَرِيَّاءَ، أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ، قَالَ قَالَتْ عَائِشَةُ وَارَأْسَاهْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ذَاكِ لَوْ كَانَ وَأَنَا حَىٌّ، فَأَسْتَغْفِرُ لَكِ وَأَدْعُو لَكِ ‏\"‏‏.‏ فَقَالَتْ عَائِشَةُ وَاثُكْلِيَاهْ، وَاللَّهِ إِنِّي لأَظُنُّكَ تُحِبُّ مَوْتِي، وَلَوْ كَانَ ذَاكَ لَظَلِلْتَ آخِرَ يَوْمِكَ مُعَرِّسًا بِبَعْضِ أَزْوَاجِكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بَلْ أَنَا وَارَأْسَاهْ لَقَدْ هَمَمْتُ أَوْ أَرَدْتُ أَنْ أُرْسِلَ إِلَى أَبِي بَكْرٍ وَابْنِهِ، وَأَعْهَدَ أَنْ يَقُولَ الْقَائِلُونَ أَوْ يَتَمَنَّى الْمُتَمَنُّونَ، ثُمَّ قُلْتُ يَأْبَى اللَّهُ وَيَدْفَعُ الْمُؤْمِنُونَ، أَوْ يَدْفَعُ اللَّهُ وَيَأْبَى الْمُؤْمِنُونَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "76",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 76,
                    "chapterNumber": "76",
                    "chapterEnglish": "Patients",
                    "chapterUrdu": "امراض اور ان کے علاج کے بیان میں",
                    "chapterArabic": "كتاب المرضى",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5430,
                "hadithNumber": "5667",
                "englishNarrator": "Narrated Ibn Mas`ud رضی اللہ عنہما :",
                "hadithEnglish": "I visited the Prophet (ﷺ) while he was having a high fever. I touched him an said, \"You have a very high fever\" He said, \"Yes, as much fever as two me of you may have.\" I said. \"you will have a double reward?\" He said, \"Yes No Muslim is afflicted with hurt caused by disease or some other inconvenience, but that Allah will remove his sins as a tree sheds its leaves.\"",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ کو بخار آیا ہوا تھا میں نے آپ کا جسم چھو کر عرض کیا کہ آنحضرت صلی اللہ علیہ وسلم کو بڑا تیز بخار ہے ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا کہ ہاں تم میں کے دو آدمیوں کے برابر ہے ۔ حضرت ابن مسعود رضی اللہ عنہما نے عرض کیا کہ آنحضرت صلی اللہ علیہ وسلم کا اجر بھی دو گنا ہے ۔ کہا ہاں پھر آپ نے فرمایا کہ کسی مسلمان کو بھی جب کسی مرض کی تکلیف یا اور کوئی تکلیف پہنچتی ہے تو اللہ اس کے گناہ کو اس طرح جھاڑ دیتا ہے جس طرح درخت اپنے پتوں کو جھاڑ تا ہے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالعزیز بن مسلم نے بیان کیا ، کہا ہم سے سلیمان اعمش نے بیان کیا ، ان سے ابراہیم تیمی نے ، ان سے حارث بن سوید نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، حَدَّثَنَا سُلَيْمَانُ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ دَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ يُوعَكُ فَمَسِسْتُهُ فَقُلْتُ إِنَّكَ لَتُوعَكُ وَعْكًا شَدِيدًا‏.‏ قَالَ ‏\"‏ أَجَلْ كَمَا يُوعَكُ رَجُلاَنِ مِنْكُمْ ‏\"‏‏.‏ قَالَ لَكَ أَجْرَانِ قَالَ ‏\"‏ نَعَمْ مَا مِنْ مُسْلِمٍ يُصِيبُهُ أَذًى مَرَضٌ فَمَا سِوَاهُ إِلاَّ حَطَّ اللَّهُ سَيِّئَاتِهِ كَمَا تَحُطُّ الشَّجَرَةُ وَرَقَهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "76",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 76,
                    "chapterNumber": "76",
                    "chapterEnglish": "Patients",
                    "chapterUrdu": "امراض اور ان کے علاج کے بیان میں",
                    "chapterArabic": "كتاب المرضى",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5431,
                "hadithNumber": "5668",
                "englishNarrator": "Narrated Sa`d:",
                "hadithEnglish": "Allah's Messenger (ﷺ) came to visit me during my ailment which had been aggravated during Hajjat-al- Wada`. I said to him, \"You see how sick I am. I have much property but have no heir except my only daughter May I give two thirds of my property in charity?\"! He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said \"One third?\" He said, \"One third is too much, for to leave your heirs rich is better than to leave them poor, begging of others. Nothing you spend seeking Allah's pleasure but you shall get a reward for it, even for what you put in the mouth of your wife.\"",
                "hadithUrdu": "ہمارے یہاں رسول اللہ صلی اللہ علیہ وسلم میری عیادت کے لیے تشریف لائے میں حجۃ الوداع کے زمانہ میں ایک سخت بیماری میں مبتلا ہو گیا تھا میں نے عرض کیا کہ میری بیماری جس حد کو پہنچ چکی ہے اسے آنحضرت صلی اللہ علیہ وسلم دیکھ رہے ہیں ، میں صاحب دولت ہوں اور میری وارث میری صرف ایک لڑکی کے سوا اور کوئی نہیں تو کیا میں اپنا دو تہائی مال صدقہ کروں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ۔ میں نے عرض کیا پھر آدھا کر دوں ، آپ نے فرمایا کہ نہیں ۔ میں نے عرض کیا ایک تہائی کر دوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تہائی بہت کافی ہے اگر تم اپنے وارثوں کو غنی چھوڑ کر جاؤ یہ اس سے بہتر ہے کہ انہیں محتاج چھوڑو اور وہ لوگوں کے سامنے ہاتھ پھیلاتے پھر یں اور تم جو بھی خرچ کرو گے اور اس سے اللہ کی خوشنودی حاصل کرنا مقصود ہو گا اس پر بھی تمہیں ثواب ملے گا ۔ یہاں تک کہ اس لقمہ پر بھی تمہیں ثواب ملے گا جو تم اپنی بیوی کے منہ میں ڈالتے ہو ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالعزیز بن عبداللہ بن ابی سلمہ نے بیان کیا ، کہا ہم کو زہری نے خبر دی ، انہیں عامر بن سعد  نے اور ان سے ان کے والد نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ، أَخْبَرَنَا الزُّهْرِيُّ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ جَاءَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُنِي مِنْ وَجَعٍ اشْتَدَّ بِي زَمَنَ حَجَّةِ الْوَدَاعِ فَقُلْتُ بَلَغَ بِي مَا تَرَى وَأَنَا ذُو مَالٍ وَلاَ يَرِثُنِي إِلاَّ ابْنَةٌ لِي أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ بِالشَّطْرِ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ الثُّلُثُ قَالَ ‏\"‏ الثُّلُثُ كَثِيرٌ، أَنْ تَدَعَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ وَلَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلاَّ أُجِرْتَ عَلَيْهَا حَتَّى مَا تَجْعَلُ فِي فِي امْرَأَتِكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "76",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 76,
                    "chapterNumber": "76",
                    "chapterEnglish": "Patients",
                    "chapterUrdu": "امراض اور ان کے علاج کے بیان میں",
                    "chapterArabic": "كتاب المرضى",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5432,
                "hadithNumber": "5669",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) was on his death-bed and in the house there were some people among whom was `Umar bin Al-Khattab رضی اللہ عنہ , the Prophet (ﷺ) said, \"Come, let me write for you a statement after which you will not go astray.\" `Umar رضی اللہ عنہ said, \"The Prophet (ﷺ) is seriously ill and you have the Qur'an; so the Book of Allah is enough for us.\" The people present in the house differed and quarrelled. Some said \"Go near so that the Prophet (ﷺ) may write for you a statement after which you will not go astray,\" while the others said as `Umar رضی اللہ عنہ said. When they caused a hue and cry before the Prophet, Allah's Messenger (ﷺ) said, \"Go away!\" Narrated 'Ubaidullah: Ibn `Abbas رضی اللہ عنہما used to say, \"It was very unfortunate that Allah's Messenger (ﷺ) was prevented from writing that statement for them because of their disagreement and noise.\"",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم کی وفات کا وقت قریب آیا تو گھر میں کئی صحابہ موجود تھے ۔ حضرت عمر بن خطاب رضی اللہ عنہ بھی وہیں موجود تھے ۔ حضور اکرم صلی اللہ علیہ وسلم نے فرمایا لاؤ میں تمہارے لیے ایک تحریر لکھ دوں تاکہ اس کے بعد تم غلط راہ پر نہ چلو ۔ حضرت عمر رضی اللہ عنہ نے اس پر کہا کہ آنحضرت صلی اللہ علیہ وسلم اس وقت سخت تکلیف میں ہیں اور تمہارے پاس قرآن مجید تو موجود ہے ہی ہمارے لیے اللہ کی کتاب کافی ہے ۔ اس مسئلہ پر گھر میں موجود صحابہ کا اختلاف ہو گیا اور بحث کرنے لگے ۔ بعض صحابہ کہتے تھے کہ آنحضرت صلی اللہ علیہ وسلم کو ( لکھنے کی چیزیں ) دے دو تاکہ آنحضور صلی اللہ علیہ وسلم ایسی تحریر لکھ دیں جس کے بعد تم گمراہ نہ ہو سکو اور بعض صحابہ وہ کہتے تھے جو حضرت عمر رضی اللہ عنہ نے کہا تھا ۔ جب آنحضرت صلی اللہ علیہ وسلم کے پاس اختلاف اور بحث بڑھ گئی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہاں سے چلے جاؤ ۔ حضرت عبیداللہ نے بیان کیا کہ حضرت ابن عباس رضی اللہ عنہما کہا کرتے تھے کہ سب سے زیادہ افسوس یہی ہے کہ ان کے اختلاف اور بحث کی وجہ سے آنحضرت صلی اللہ علیہ وسلم نے وہ تحریر نہیں لکھی جو آپ مسلمانوں کے لیے لکھنا چاہتے تھے ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے معمر نے ( دوسری سند ) اور مجھ سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں عبیداللہ بن عبداللہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، حَدَّثَنَا هِشَامٌ، عَنْ مَعْمَرٍ، وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمَّا حُضِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَفِي الْبَيْتِ رِجَالٌ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ هَلُمَّ أَكْتُبْ لَكُمْ كِتَابًا لاَ تَضِلُّوا بَعْدَهُ ‏\"‏‏.‏ فَقَالَ عُمَرُ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَدْ غَلَبَ عَلَيْهِ الْوَجَعُ وَعِنْدَكُمُ الْقُرْآنُ، حَسْبُنَا كِتَابُ اللَّهِ فَاخْتَلَفَ أَهْلُ الْبَيْتِ فَاخْتَصَمُوا، مِنْهُمْ مَنْ يَقُولُ قَرِّبُوا يَكْتُبْ لَكُمُ النَّبِيُّ صلى الله عليه وسلم كِتَابًا لَنْ تَضِلُّوا بَعْدَهُ، وَمِنْهُمْ مَنْ يَقُولُ مَا قَالَ عُمَرُ فَلَمَّا أَكْثَرُوا اللَّغْوَ وَالاِخْتِلاَفَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُومُوا ‏\"‏‏.‏ قَالَ عُبَيْدُ اللَّهِ فَكَانَ ابْنُ عَبَّاسٍ يَقُولُ إِنَّ الرَّزِيَّةَ كُلَّ الرَّزِيَّةِ مَا حَالَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ أَنْ يَكْتُبَ لَهُمْ ذَلِكَ الْكِتَابَ مِنِ اخْتِلاَفِهِمْ وَلَغَطِهِمْ‏.‏",
                "headingArabic": "قَوْلِ الْمَرِيضِ قُومُوا عَنِّي",
                "headingUrdu": "مریض کا کہنا: \"مجھ سے اٹھو!\"",
                "headingEnglish": "The saying of the patient: \"Get up from me!\"",
                "chapterId": "76",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 76,
                    "chapterNumber": "76",
                    "chapterEnglish": "Patients",
                    "chapterUrdu": "امراض اور ان کے علاج کے بیان میں",
                    "chapterArabic": "كتاب المرضى",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5433,
                "hadithNumber": "5670",
                "englishNarrator": "Narrated As-Sa'ib رضی اللہ عنہ :",
                "hadithEnglish": "My aunt took me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! My nephew is- ill.\" The Prophet (ﷺ) touched my head with his hand and invoked Allah to bless me. He then performed ablution and I drank of the remaining water of his ablution and then stood behind his back and saw \"Khatam An- Nubuwwa\" (The Seal of Prophethood) between his shoulders like a button of a tent.",
                "hadithUrdu": "مجھے میری خالہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بچپن میں لے گئیں اور عرض کیا یا رسول اللہ ! میرے بھانجے کو درد ہے ۔ حضور اکرم صلی اللہ علیہ وسلم نے میرے سر پر ہاتھ پھیرا اور میرے لیے برکت کی دعا کی پھر آپ نے وضو کیا اور میں نے آپ کے وضو کا پانی پیا اور میں نے آپ کی پیٹھ کے پیچھے کھڑے ہو کر نبوت کی مہر آپ کے دونوں شانوں کے درمیان دیکھی ۔ یہ مہر نبوت حجلہ عروس کی گھنڈی جیسی تھی ۔",
                "urduNarrator": "ہم سے ابراہیم بن حمزہ نے بیان کیا ، کہا ہم سے حاتم بن اسماعیل نے بیان کیا ، ان سے جعید بن عبدالرحمٰن نے بیان کیا کہ میں نے حضرت سائب بن یزید رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا حَاتِمٌ ـ هُوَ ابْنُ إِسْمَاعِيلَ ـ عَنِ الْجُعَيْدِ، قَالَ سَمِعْتُ السَّائِبَ، يَقُولُ ذَهَبَتْ بِي خَالَتِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَ أُخْتِي وَجِعٌ فَمَسَحَ رَأْسِي وَدَعَا لِي بِالْبَرَكَةِ، ثُمَّ تَوَضَّأَ فَشَرِبْتُ مِنْ وَضُوئِهِ وَقُمْتُ خَلْفَ ظَهْرِهِ فَنَظَرْتُ إِلَى خَاتَمِ النُّبُوَّةِ بَيْنَ كَتِفَيْهِ مِثْلَ زِرِّ الْحَجَلَةِ‏.‏",
                "headingArabic": "مَنْ ذَهَبَ بِالصَّبِيِّ الْمَرِيضِ لِيُدْعَى لَهُ",
                "headingUrdu": "جو شخص بیمار لڑکے کو (کسی کے پاس) لے گیا کہ اس کے لیے اللہ سے دعا کرے۔",
                "headingEnglish": "Whoever took the sick boy (to someone) to invoke Allah for him",
                "chapterId": "76",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 76,
                    "chapterNumber": "76",
                    "chapterEnglish": "Patients",
                    "chapterUrdu": "امراض اور ان کے علاج کے بیان میں",
                    "chapterArabic": "كتاب المرضى",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5434,
                "hadithNumber": "5671",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"None of you should wish for death because of a calamity befalling him; but if he has to wish for death, he should say: \"O Allah! Keep me alive as long as life is better for me, and let me die if death is better for me.' \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کسی تکلیف میں اگر کوئی شخص مبتلا ہو تو اسے موت کی تمنا نہیں کرنی چاہیئے اور اگر کوئی موت کی تمنا کرنے ہی لگے تو یہ کہنا چاہیئے ، اے اللہ ! جب تک زندگی میرے لیے بہتر ہے مجھے زندہ رکھ اور جب موت میرے لیے بہتر ہو تو مجھ کو اٹھالے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے ثابت بنانی نے بیان کیا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ مِنْ ضُرٍّ أَصَابَهُ، فَإِنْ كَانَ لاَ بُدَّ فَاعِلاً فَلْيَقُلِ اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي، وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي ‏\"‏‏.‏",
                "headingArabic": "تَمَنِّي الْمَرِيضِ الْمَوْتَ",
                "headingUrdu": "مریض کی موت کی خواہش",
                "headingEnglish": "The patient's wish for death",
                "chapterId": "76",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 76,
                    "chapterNumber": "76",
                    "chapterEnglish": "Patients",
                    "chapterUrdu": "امراض اور ان کے علاج کے بیان میں",
                    "chapterArabic": "كتاب المرضى",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5435,
                "hadithNumber": "5672",
                "englishNarrator": "Narrated Qais bin Abi Hazim:",
                "hadithEnglish": "We went to pay a visit to Khabbab رضی اللہ عنہ (who was sick) and he had been branded (cauterized) at seven places in his body. He said, \"Our companions who died (during the lifetime of the Prophet) left (this world) without having their rewards reduced through enjoying the pleasures of this life, but we have got (so much) wealth that we find no way to spend It except on the construction of buildings Had the Prophet not forbidden us to wish for death, I would have wished for it.' We visited him for the second time while he was building a wall. He said, A Muslim is rewarded (in the Hereafter) for whatever he spends except for something that he spends on building.\"",
                "hadithUrdu": "ہم خباب بن ارت رضی اللہ عنہ کے یہاں ان کی عیادت کو گئے انہوں نے اپنے پیٹ میں سات داغ لگوائے تھے پھر انہوں نے کہا کہ ہمارے ساتھی جو رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں وفات پا چکے وہ یہاں سے اس حال میں رخصت ہوئے کہ دنیا ان کا اجر و ثواب کچھ نہ گھٹا سکی اور ان کے عمل میں کوئی کمی نہیں ہوئی اور ہم نے ( مال و دولت ) اتنی پائی کہ جس کے خرچ کرنے کے لیے ہم نے مٹی کے سوا اور کوئی محل نہیں پایا ( لگے عمارتیں بنوانے ) اور اگر نبی کریم صلی اللہ علیہ وسلم نے ہمیں مو ت کی دعا کرنے سے منع نہ کیا ہوتا تو میں اس کی دعا کرتا پھر ہم ان کی خدمت میں دوبارہ حاضر ہوئے تو وہ اپنی دیوار بنا رہے تھے انہوں نے کہا مسلمان کوہر اس چیز پر ثواب ملتا ہے جسے وہ خرچ کرتا ہے مگر اس ( کم بخت ) عمارت میں خرچ کرنے کا ثواب نہیں ملتا ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے ، ان سے اسماعیل بن ابی خالد نے اور ان سے قیس بن ابی حازم نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، قَالَ دَخَلْنَا عَلَى خَبَّابٍ نَعُودُهُ وَقَدِ اكْتَوَى سَبْعَ كَيَّاتٍ فَقَالَ إِنَّ أَصْحَابَنَا الَّذِينَ سَلَفُوا مَضَوْا وَلَمْ تَنْقُصْهُمُ الدُّنْيَا وَإِنَّا أَصَبْنَا مَا لاَ نَجِدُ لَهُ مَوْضِعًا إِلاَّ التُّرَابَ وَلَوْلاَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَانَا أَنْ نَدْعُوَ بِالْمَوْتِ لَدَعَوْتُ بِهِ، ثُمَّ أَتَيْنَاهُ مَرَّةً أُخْرَى وَهْوَ يَبْنِي حَائِطًا لَهُ فَقَالَ إِنَّ الْمُسْلِمَ لَيُوجَرُ فِي كُلِّ شَىْءٍ يُنْفِقُهُ إِلاَّ فِي شَىْءٍ يَجْعَلُهُ فِي هَذَا التُّرَابِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "76",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 76,
                    "chapterNumber": "76",
                    "chapterEnglish": "Patients",
                    "chapterUrdu": "امراض اور ان کے علاج کے بیان میں",
                    "chapterArabic": "كتاب المرضى",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5436,
                "hadithNumber": "5673",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"The good deeds of any person will not make him enter Paradise.\" (i.e., None can enter Paradise through his good deeds.) They (the Prophet's companions) said, 'Not even you, O Allah's Messenger (ﷺ)?' He said, \"Not even myself, unless Allah bestows His favor and mercy on me.\" So be moderate in your religious deeds and do the deeds that are within your ability: and none of you should wish for death, for if he is a good doer, he may increase his good deeds, and if he is an evil doer, he may repent to Allah.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ نے فرمایا کسی شخص کا عمل اسے جنت میں داخل نہیں کر سکے گا ۔ صحابہ کرام رضی اللہ عنہم نے عرض کیا یا رسول اللہ ! آپ کا بھی نہیں ؟ آپ نے فرمایا نہیں ، میرا بھی نہیں ، سوا اس کے کہ اللہ اپنے فضل و رحمت سے مجھے نوازے اس لیے ( عمل میں ) میانہ روی اختیار کرو اورقریب قریب چلو اور تم میں کوئی شخص موت کی تمنا نہ کرے کیونکہ یا وہ نیک ہو گا تو امید ہے کہ اس کے اعمال میں اور اضافہ ہو جائے اور اگر وہ برا ہے تو ممکن ہے وہ توبہ ہی کرے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا ہمیں عبدالرحمٰن بن عوف رضی اللہ عنہ کے غلام ابوعبیدہ نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لَنْ يُدْخِلَ أَحَدًا عَمَلُهُ الْجَنَّةَ ‏\"‏‏.‏ قَالُوا وَلاَ أَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لاَ، وَلاَ أَنَا إِلاَّ أَنْ يَتَغَمَّدَنِي اللَّهُ بِفَضْلٍ وَرَحْمَةٍ فَسَدِّدُوا وَقَارِبُوا وَلاَ يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ إِمَّا مُحْسِنًا فَلَعَلَّهُ أَنْ يَزْدَادَ خَيْرًا، وَإِمَّا مُسِيئًا فَلَعَلَّهُ أَنْ يَسْتَعْتِبَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "76",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 76,
                    "chapterNumber": "76",
                    "chapterEnglish": "Patients",
                    "chapterUrdu": "امراض اور ان کے علاج کے بیان میں",
                    "chapterArabic": "كتاب المرضى",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5437,
                "hadithNumber": "5674",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "I heard the Prophet (ﷺ) , who was resting against me, saying, \"O Allah! Excuse me and bestow Your Mercy on me and let me join with the highest companions (in Paradise).\" See Qur'an (4.69)",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم میراسہارا لیے ہوئے تھے ( مرض الموت میں ) اور فرما رہے تھے اے اللہ تعالیٰ ! میری مغفرت فرما مجھ پر رحم کر اور مجھ کو اچھے رفیقوں ( فرشتوں اور پیغمبروں ) کے ساتھ ملادے ۔",
                "urduNarrator": "ہم سے عبداللہ بن ابی شیبہ نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے ہشام نے ، ان سے عباد بن عبداللہ بن زبیر نے بیان کیا کہ میں نے حضرت عائشہ رضی اللہ عنہا سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، قَالَ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم وَهْوَ مُسْتَنِدٌ إِلَىَّ يَقُولُ ‏ \"‏ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَأَلْحِقْنِي بِالرَّفِيقِ الأَعْلَى ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "76",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 76,
                    "chapterNumber": "76",
                    "chapterEnglish": "Patients",
                    "chapterUrdu": "امراض اور ان کے علاج کے بیان میں",
                    "chapterArabic": "كتاب المرضى",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5438,
                "hadithNumber": "5675",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Whenever Allah's Messenger (ﷺ) paid a visit to a patient, or a patient was brought to him, he used to invoke Allah, saying, \"Take away the disease, O the Lord of the people! Cure him as You are the One Who cures. There is no cure but Yours, a cure that leaves no disease.\" Amr bin Abi Qais and Ibrahim bin Tahman from Mansur that Ibrahim and Abu Duha said: When any paitient was brought to him ﷺ. Or Abu Duha said: When he ﷺ visited any diseased.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب کسی مریض کے پاس تشریف لے جاتے یاکوئی مریض آپ کے پاس لایا جاتا تو آپ یہ دعا فرماتے ، اے پروردگار لوگوں کے ! بیماری دور کر دے ، اے انسانوں کے پالنے والے ! شفاء عطا فرما ، تو ہی شفاء دینے والا ہے ۔ تیری شفاء کے سوا اور کوئی شفاء نہیں ، ایسی شفاء دے جس میں مرض بالکل باقی نہ رہے ۔ اور عمرو بن ابی قیس اور ابراہیم بن طہمان نے منصور سے بیان کیا ، انہوں نے ابراہیم اور ابو الضحیٰ سے کہ ” جب کوئی مریض آنحضرت صلی اللہ علیہ وسلم کے پاس لایا جاتا “",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے منصور نے ، ان سے ابراہیم نے ، ان سے مسروق نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَتَى مَرِيضًا ـ أَوْ أُتِيَ بِهِ ـ قَالَ ‏ \"‏ أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ، اشْفِ وَأَنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ، شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏‏.‏ قَالَ عَمْرُو بْنُ أَبِي قَيْسٍ وَإِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ وَأَبِي الضُّحَى إِذَا أُتِيَ بِالْمَرِيضِ، وَقَالَ جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى وَحْدَهُ، وَقَالَ إِذَا أَتَى مَرِيضًا‏.‏",
                "headingArabic": "دُعَاءِ الْعَائِدِ لِلْمَرِيضِ",
                "headingUrdu": "مریض کے لیے دعا",
                "headingEnglish": "The invocation for the patient",
                "chapterId": "76",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 76,
                    "chapterNumber": "76",
                    "chapterEnglish": "Patients",
                    "chapterUrdu": "امراض اور ان کے علاج کے بیان میں",
                    "chapterArabic": "كتاب المرضى",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5439,
                "hadithNumber": "5676",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) came to me while I was ill. He performed ablution and threw the remaining water on me (or said, \"Pour it on him) \" When I came to my senses I said, \"O Allah's Messenger (ﷺ)! I have no son or father to be my heir, so how will be my inheritance?\" Then the Verse of inheritance was revealed.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم میرے یہاں تشریف لائے میں بیمار تھا آنحضرت صلی اللہ علیہ وسلم نے وضو کیا اور وضو کا پانی مجھ پر ڈالا یا فرمایا کہ اس پر یہ پانی ڈال دواس سے مجھے ہوش آ گیا ۔ میں نے عرض کیا کہ میں تو کلالہ ہوں ( جس کے والد اور اولاد نہ ہو ) میرے ترکہ میں تقسیم کیسے ہو گی اس پر میراث کی آیت نازل ہوئی ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر ( محمد بن جعفر ) نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے محمد بن منکدر نے ، کہا کہ میں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ دَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَأَنَا مَرِيضٌ فَتَوَضَّأَ فَصَبَّ عَلَىَّ أَوْ قَالَ صُبُّوا عَلَيْهِ فَعَقَلْتُ فَقُلْتُ لاَ يَرِثُنِي إِلاَّ كَلاَلَةٌ، فَكَيْفَ الْمِيرَاثُ فَنَزَلَتْ آيَةُ الْفَرَائِضِ‏.‏",
                "headingArabic": "وُضُوءِ الْعَائِدِ لِلْمَرِيضِ",
                "headingUrdu": "مریض کی عیادت کرنے والے کا وضو",
                "headingEnglish": "Ablution by a person who pays a visit to a patient",
                "chapterId": "76",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 76,
                    "chapterNumber": "76",
                    "chapterEnglish": "Patients",
                    "chapterUrdu": "امراض اور ان کے علاج کے بیان میں",
                    "chapterArabic": "كتاب المرضى",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5440,
                "hadithNumber": "5677",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) emigrated to Medina, Abu Bakr رضی اللہ عنہ and Bilal رضی اللہ عنہ had a fever. I entered upon them and said, \"O my father! How are you? O Bilal! How are you?\" Whenever Abu Bakr رضی اللہ عنہ got the fever he used to say, \"Everybody is staying alive with his people, yet death is nearer to him than his shoe laces.\" And when fever deserted Bilal رضی اللہ عنہ , he would recite (two poetic verses): \"Would that I could stay overnight in a valley wherein I would be surrounded by Idhkhir and Jalil (two kinds of good smelling grass). Would that one day I could drink of the water of Majinna, and would that Shama and Tafil (two mountains at Mecca) would appear to me!\" I went to Allah's Messenger (ﷺ) and informed him about that. He said, \"O Allah! Make us love Medina as much or more than we love Mecca, and make it healthy, and bless its Sa and its Mudd, and take away its fever and put it in Al-Juhfa.\" (See Hadith No 558) .",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم ہجرت کر کے مدینہ تشریف لائے توحضرت ابوبکر اور حضرت بلال رضی اللہ عنہ کو بخار ہو گیا ۔ بیان کیا کہ پھر میں ان کے پاس ( بیمار پرسی کے لیے ) گئی اور پوچھا کہ محترم والد بزرگوار ! آپ کا کیا حال ہے اور اے بلال رضی اللہ عنہ ! آپ کا کیا حال ہے بیان کیا کہ جب حضرت ابوبکر رضی اللہ عنہ کو بخار ہوتا تو وہ یہ شعر پڑھا کرتے تھے ۔  ” ہر شخص اپنے گھر والوں میں صبح کرتا ہے  اور موت اس کے تسمے سے بھی زیادہ قریب ہے “  اور حضرت بلال رضی اللہ عنہ کا جب بخار اترتا تو بلند آواز سے وہ یہ اشعار پڑھتے ۔ ( ترجمہ ) کاش مجھے معلوم ہوتا کہ میں ایک رات وادی ( مکہ ) میں اس طرح گزار سکوں گا  کہ میرے چاروں طرف اذخر اور جلیل ( گھاس ) کے درخت ہوں گے اور کیا کبھی پھر میں مجنہ کے گھاٹ پر اتر سکوں گا اور کیا کبھی شامہ اور طفیل میں اپنے سامنے دیکھ سکوں گا ۔  راوی نے بیان کیا کہ عائشہ رضی اللہ عنہا نے کہا پھر میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور آنحضرت صلی اللہ علیہ وسلم سے اس کے متعلق کہا تو آپ نے یہ دعا فرمائی اے اللہ ! ہمارے دلوں میں مدینہ کی محبت پیدا کر جیسا کہ ہمیں ( اپنے وطن ) مکہ کی محبت تھی بلکہ اس سے بھی زیادہ مدینہ کی محبت عطا کر اور اس کی آب و ہوا کو صحت بخش بنا دے اور ہمارے لیے اس کے صاع اور مد میں برکت عطا فرما اور اس کے بخار کو کہیں اور جگہ منتقل کر دے اسے جحفہ نامی گاؤں میں بھیج دے ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، کہا مجھ سے امام مالک نے ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وُعِكَ أَبُو بَكْرٍ وَبِلاَلٌ قَالَتْ فَدَخَلْتُ عَلَيْهِمَا فَقُلْتُ يَا أَبَتِ كَيْفَ تَجِدُكَ وَيَا بِلاَلُ كَيْفَ تَجِدُكَ قَالَتْ وَكَانَ أَبُو بَكْرٍ إِذَا أَخَذَتْهُ الْحُمَّى يَقُولُ كُلُّ امْرِئٍ مُصَبَّحٌ فِي أَهْلِهِ وَالْمَوْتُ أَدْنَى مِنْ شِرَاكِ نَعْلِهِ وَكَانَ بِلاَلٌ إِذَا أُقْلِعَ عَنْهُ يَرْفَعُ عَقِيرَتَهُ فَيَقُولُ أَلاَ لَيْتَ شِعْرِي هَلْ أَبِيتَنَّ لَيْلَةً بِوَادٍ وَحَوْلِي إِذْخِرٌ وَجَلِيلُ وَهَلْ أَرِدَنْ يَوْمًا مِيَاهَ مِجَنَّةٍ وَهَلْ تَبْدُوَنْ لِي شَامَةٌ وَطَفِيلُ قَالَ قَالَتْ عَائِشَةُ فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ فَقَالَ ‏ \"‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَحُبِّنَا مَكَّةَ أَوْ أَشَدَّ وَصَحِّحْهَا وَبَارِكْ لَنَا فِي صَاعِهَا وَمُدِّهَا وَانْقُلْ حُمَّاهَا فَاجْعَلْهَا بِالْجُحْفَةِ ‏\"‏‏.‏",
                "headingArabic": "مَنْ دَعَا بِرَفْعِ الْوَبَاءِ وَالْحُمَّى",
                "headingUrdu": "وبائی امراض اور بخار کو دور کرنے کے لیے اللہ سے دعا کرنا",
                "headingEnglish": "To invoke Allah to remove epidemics and fever",
                "chapterId": "76",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 76,
                    "chapterNumber": "76",
                    "chapterEnglish": "Patients",
                    "chapterUrdu": "امراض اور ان کے علاج کے بیان میں",
                    "chapterArabic": "كتاب المرضى",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5441,
                "hadithNumber": "5678",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"There is no disease that Allah has created, except that He also has created its treatment.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے کوئی ایسی بیماری نہیں اتاری جس کی دوا بھی نازل نہ کی ہو ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہا ہم سے ابو احمد زبیری نے بیان کیا ، ان سے عمر بن سعید بن ابی حسین نے بیان کیا ، انہوں نے کہا کہ مجھ سے عطاء بن ابی رباح نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا أَنْزَلَ اللَّهُ دَاءً إِلاَّ أَنْزَلَ لَهُ شِفَاءً ‏\"‏‏.‏",
                "headingArabic": "مَا أَنْزَلَ اللَّهُ دَاءً إِلاَّ أَنْزَلَ لَهُ شِفَاءً",
                "headingUrdu": "اس کے علاج کے علاوہ کوئی بیماری نہیں۔",
                "headingEnglish": "There is no disease except its treatment",
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5442,
                "hadithNumber": "5679",
                "englishNarrator": "Narrated Rubai bint Mu`adh bin Afra:",
                "hadithEnglish": "We used to go for Military expeditions along with Allah's Messenger (ﷺ) and provide the people with water, serve them and bring the dead and the wounded back to Medina.",
                "hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ غزوات میں شریک ہوتی تھیں اور مسلمان مجاہد کو پانی پلاتی ، ان کی خدمت کرتی اور مقتولین اور مجروحین کو مدینہ منورہ لایا کرتی تھیں ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے بشر بن مفضل نے بیان کیا ، ان سے خالد بن ذکوان نے اور ان سے ربیع بنت معوذ بن عفراء رضی اللہ عنہم نے بیان کیا ، انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ خَالِدِ بْنِ ذَكْوَانَ، عَنْ رُبَيِّعَ بِنْتِ مُعَوِّذٍ ابْنِ عَفْرَاءَ، قَالَتْ كُنَّا نَغْزُو مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم نَسْقِي الْقَوْمَ، وَنَخْدُمُهُمْ، وَنَرُدُّ الْقَتْلَى وَالْجَرْحَى إِلَى الْمَدِينَةِ‏.‏",
                "headingArabic": "هَلْ يُدَاوِي الرَّجُلُ الْمَرْأَةَ أَوِ الْمَرْأَةُ الرَّجُلَ",
                "headingUrdu": "کیا مرد عورت ایک دوسرے کاعلاج کر سکتے ہیں؟",
                "headingEnglish": "May a man treat a woman or a woman treat a man?",
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5443,
                "hadithNumber": "5680",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "(The Prophet (ﷺ) said), \"Healing is in three things: A gulp of honey, cupping, and branding with fire (cauterizing).\" But I forbid my followers to use (cauterization) branding with fire.\" He traced this Hadith back to the prophet ﷺ. Hadrat Ibn-e-Abbas رضی اللہ عنہما has reported honey and cupping from the prophet ﷺ.",
                "hadithUrdu": "شفاء تین چیزوں میں ہے ۔ شہد کے شربت میں ، پچھنا لگوانے میں اور آگ سے داغنے میں لیکن میں امت کوآگ سے داغ کر علاج کرنے سے منع کرتا ہوں ۔ حضرت ابن عباس رضی اللہ عنہما نے اس حدیث کو مرفوعاً نقل کیا ہے اور القمی نے روایت کیا ، ان سے لیث نے ، ان سے مجاہد نے ، ان سے حضرت ابن عباس رضی اللہ عنہما نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے شہد اور پچھنا لگوانے کے بارے میں بیان کیا ۔",
                "urduNarrator": "ہم سے حسین نے بیان کیا ، کہا ہم سے احمد بن منیع نے بیان کیا ، کہا ہم سے مروان بن شجاع نے بیان کیا ، ان سے سالم افطس نے بیان کیا ، ان سے سعید بن جبیر نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنِي الْحُسَيْنُ، حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا مَرْوَانُ بْنُ شُجَاعٍ، حَدَّثَنَا سَالِمٌ الأَفْطَسُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ ‏ \"‏ الشِّفَاءُ فِي ثَلاَثَةٍ شَرْبَةِ عَسَلٍ، وَشَرْطَةِ مِحْجَمٍ، وَكَيَّةِ نَارٍ، وَأَنْهَى أُمَّتِي عَنِ الْكَىِّ ‏\"‏‏.‏ رَفَعَ الْحَدِيثَ وَرَوَاهُ الْقُمِّيُّ عَنْ لَيْثٍ عَنْ مُجَاهِدٍ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الْعَسَلِ وَالْحَجْمِ‏.‏",
                "headingArabic": "الشِّفَاءُ فِي ثَلاَثٍ",
                "headingUrdu": "تین چیزوں میں شفا ہے۔",
                "headingEnglish": "There is cure in three things",
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5444,
                "hadithNumber": "5681",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Healing is in three things: cupping, a gulp of honey or cauterization, (branding with fire) but I forbid my followers to use cauterization (branding with fire).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا شفاء تین چیزوں میں ہے پچھنا لگوانے میں ، شہد پینے میں اور آگ سے داغنے میں مگر میں اپنی امت کو آگ سے داغنے سے منع کرتا ہوں ۔",
                "urduNarrator": "ہم سے محمد بن عبدالرحیم نے بیان کیا ، انہوں نے کہا ہم کو سریج بن یونس ابو حارث نے خبر دی ، انہوں نے کہا ہم سے مروان بن شجاع نے بیان کیا ، ان سے سالم افطس نے بیان کیا ، ان سے سعید بن جبیر نے بیان کیا اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، أَخْبَرَنَا سُرَيْجُ بْنُ يُونُسَ أَبُو الْحَارِثِ، حَدَّثَنَا مَرْوَانُ بْنُ شُجَاعٍ، عَنْ سَالِمٍ الأَفْطَسِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ الشِّفَاءُ فِي ثَلاَثَةٍ شَرْطَةِ مِحْجَمٍ، أَوْ شَرْبَةِ عَسَلٍ، أَوْ كَيَّةٍ بِنَارٍ، وَأَنْهَى أُمَّتِي عَنِ الْكَىِّ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5445,
                "hadithNumber": "5682",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) used to like sweet edible things and honey.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کو شیرینی اور شہد پسند تھا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، کہا کہ مجھے ہشام نے خبر دی ، انہیں ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ أَخْبَرَنِي هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعْجِبُهُ الْحَلْوَاءُ وَالْعَسَلُ‏.‏",
                "headingArabic": "الدَّوَاءِ بِالْعَسَلِ",
                "headingUrdu": "شہد سے علاج",
                "headingEnglish": "Treatment with honey",
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5446,
                "hadithNumber": "5683",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"If there is any healing in your medicines, then it is in cupping, a gulp of honey or branding with fire (cauterization) that suits the ailment, but I don't like to be (cauterized) branded with fire.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا اگر تمہاری دواؤں میں کسی میں بھلائی ہے یا یہ کہا کہ تمہاری ( ان ) دواؤں میں بھلائی ہے ۔ تو پچھنا لگوانے یا شہد پینے اور آگ سے داغنے میں ہے اگر وہ مرض کے مطابق ہو اور میں آگ سے داغنے کو پسند نہیں کرتا ہوں ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا ہم سے عبدالرحمٰن بن غسیل نے بیان کیا ، ان سے عاصم بن عمیر بن قتادہ نے بیان کیا ، انہوں نے کہا کہ میں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْغَسِيلِ، عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنْ كَانَ فِي شَىْءٍ مِنْ أَدْوِيَتِكُمْ ـ أَوْ يَكُونُ فِي شَىْءٍ مِنْ أَدْوِيَتِكُمْ ـ خَيْرٌ فَفِي شَرْطَةِ مِحْجَمٍ، أَوْ شَرْبَةِ عَسَلٍ، أَوْ لَذْعَةٍ بِنَارٍ تُوَافِقُ الدَّاءَ، وَمَا أُحِبُّ أَنْ أَكْتَوِيَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5447,
                "hadithNumber": "5684",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "A man came to the Prophet (ﷺ) and said, \"My brother has some Abdominal trouble.\" The Prophet (ﷺ) said to him \"Let him drink honey.\" The man came for the second time and the Prophet (ﷺ) said to him, 'Let him drink honey.\" He came for the third time and the Prophet (ﷺ) said, \"Let him drink honey.\" He returned again and said, \"I have done that ' The Prophet (ﷺ) then said, \"Allah has said the truth, but your brother's `Abdomen has told a lie. Let him drink honey.\" So he made him drink honey and he was cured.",
                "hadithUrdu": "ایک صاحب نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ میرا بھائی پیٹ کی تکلیف میں مبتلا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہیں شہد پلا پھر دوسری مرتبہ وہی صحابی حاضر ہوئے ۔ آپ نے اسے اس مرتبہ بھی شہد پلانے کے لیے کہا وہ پھر تیسری مرتبہ آیا اور عرض کیا کہ ( حکم کے مطابق ) میں نے عمل کیا ( لیکن شفاء نہیں ہوئی ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ سچا ہے اور تمہارے بھائی کا پیٹ جھوٹا ہے ، انہیں پھر شہد پلا ۔ چنانچہ انہوں نے شہد پھر پلایا اور اسی سے وہ تندرست ہو گیا ۔",
                "urduNarrator": "ہم سے عیاش بن الولید نے بیان کیا ، کہا ہم سے عبدالاعلیٰ نے ، کہا ہم سے سعید نے ، ان سے قتادہ نے ، ان سے ابو المتوکل نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ أَخِي يَشْتَكِي بَطْنَهُ‏.‏ فَقَالَ ‏\"‏ اسْقِهِ عَسَلاً ‏\"‏‏.‏ ثُمَّ أَتَى الثَّانِيَةَ فَقَالَ ‏\"‏ اسْقِهِ عَسَلاً ‏\"‏‏.‏ ثُمَّ أَتَاهُ فَقَالَ فَعَلْتُ‏.‏ فَقَالَ ‏\"‏ صَدَقَ اللَّهُ، وَكَذَبَ بَطْنُ أَخِيكَ، اسْقِهِ عَسَلاً ‏\"‏‏.‏ فَسَقَاهُ فَبَرَأَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5448,
                "hadithNumber": "5685",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Some people were sick and they said, \"O Allah's Messenger (ﷺ)! Give us shelter and food. So when they became healthy they said, \"The weather of Medina is not suitable for us.\" So he sent them to Al-Harra with some she-camels of his and said, \"Drink of their milk.\" But when they became healthy, they killed the shepherd of the Prophet (ﷺ) and drove away his camels. The Prophet (ﷺ) sent some people in their pursuit. Then he got their hands and feet cut and their eyes were branded with heated pieces of iron. I saw one of them licking the earth with his tongue till he died. Salim said: I got this news that Hajjaj submitted to Hadrat Anas رضی اللہ عنہ: Tell me the severest punishment the prophet ﷺ meted out to someone; he, thereupon, narrated this Hadith. This Hadith reached Hadith Basri and he said: Would that this Hadith had not been narrated.",
                "hadithUrdu": "کچھ لوگوں کو بیماری تھی ، انہوں نے کہا یا رسول اللہ ! ہمیں قیام کی جگہ عنایت فرما دیں اور ہمارے کھانے کا انتظام کر دیں پھر جب وہ لوگ تندرست ہو گئے تو انہوں نے کہا کہ مدینہ کی آب و ہوا خراب ہے چنانچہ آنحضرت صلی اللہ علیہ وسلم نے مقام حرہ میں اونٹوں کے ساتھ ان کے قیام کا انتظام کر دیا اور فرمایا کہ ان کا دودھ پیو جب وہ تندرست ہو گئے تو انہوں نے آپ کے چرواہے کو قتل کر دیا اور اونٹوں کوہانک کر لے گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان کے پیچھے آدمی دوڑائے اور وہ پکڑ ے گئے ( جیسا کہ انہوں نے چرواہے کے ساتھ کیا تھا ) آپ نے بھی ویسا ہی کیا ان کے ہاتھ پاؤں کٹوادیئے اور ان کی آنکھوں میں سلائی پھر وادی ۔ میں نے ان میں سے ایک شخص کو دیکھا کہ زبان سے زمین چاٹتا تھا اور اسی حالت میں وہ مر گیا ۔ سلام نے بیان کیا کہ مجھے معلوم ہو اکہ حجاج نے حضرت انس رضی اللہ عنہ سے کہا تم مجھ سے وہ سب سے سخت سزا بیان کرو جو رسول اللہ صلی اللہ علیہ وسلم نے کسی کو دی ہو تو انہوں نے یہی واقعہ بیان کیا جب حضرت امام حسن بصری تک یہ بات پہنچی توانہون نے کہا کاش وہ یہ حدیث حجاج سے نہ بیان کرتے ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے سلام بن مسکین ابو الروح بصریٰ نے بیان کیا ، کہا کہ ہم سے ثابت نے بیان کیا ان سے حضرت انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا سَلاَّمُ بْنُ مِسْكِينٍ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ نَاسًا، كَانَ بِهِمْ سَقَمٌ قَالُوا يَا رَسُولَ اللَّهِ آوِنَا وَأَطْعِمْنَا فَلَمَّا صَحُّوا قَالُوا إِنَّ الْمَدِينَةَ وَخِمَةٌ‏.‏ فَأَنْزَلَهُمُ الْحَرَّةَ فِي ذَوْدٍ لَهُ فَقَالَ ‏ \"‏ اشْرَبُوا أَلْبَانَهَا ‏\"‏‏.‏ فَلَمَّا صَحُّوا قَتَلُوا رَاعِيَ النَّبِيِّ صلى الله عليه وسلم وَاسْتَاقُوا ذَوْدَهُ، فَبَعَثَ فِي آثَارِهِمْ، فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ، وَسَمَرَ أَعْيُنَهُمْ، فَرَأَيْتُ الرَّجُلَ مِنْهُمْ يَكْدُمُ الأَرْضَ بِلِسَانِهِ حَتَّى يَمُوتَ‏.‏ قَالَ سَلاَّمٌ فَبَلَغَنِي أَنَّ الْحَجَّاجَ قَالَ لأَنَسٍ حَدِّثْنِي بِأَشَدِّ عُقُوبَةٍ عَاقَبَهُ النَّبِيُّ صلى الله عليه وسلم فَحَدَّثَهُ بِهَذَا‏.‏ فَبَلَغَ الْحَسَنَ فَقَالَ وَدِدْتُ أَنَّهُ لَمْ يُحَدِّثْهُ‏ بِهَذَا",
                "headingArabic": "الدَّوَاءِ بِأَلْبَانِ الإِبِلِ",
                "headingUrdu": "اونٹنی کے دودھ سے علاج کرنا",
                "headingEnglish": "To treat with the milk of camels",
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5449,
                "hadithNumber": "5686",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The climate of Medina did not suit some people, so the Prophet (ﷺ) ordered them to follow his shepherd, i.e. his camels, and drink their milk and urine (as a medicine). So they followed the shepherd that is the camels and drank their milk and urine till their bodies became healthy. Then they killed the shepherd and drove away the camels. When the news reached the Prophet (ﷺ) he sent some people in their pursuit. When they were brought, he cut their hands and feet and their eyes were branded with heated pieces of iron. Qatadah says that Muhammad bin Sireen told him that it happend prior to the command of prescribed punishment.",
                "hadithUrdu": "( عرینہ کے ) کچھ لوگوں کو مدینہ منورہ کی آب و ہوا موافق نہیں آئی تھی تو نبی کریم صلی اللہ علیہ وسلم نے ان سے فرمایا کہ وہ آپ کے چرواہے کے یہاں چلے جائیں یعنی اونٹوں میں اور ان کا دودھ اورپیشاب پئیں ۔ چنانچہ وہ لوگ آنحضرت صلی اللہ علیہ وسلم کے چرواہے کے پاس چلے گئے اور اونٹوں کا دودھ اور پیشاب پیا جب وہ تندرست ہو گئے تو انہوں نے چرواہے کو قتل کر دیا اور اونٹوں کوہانک کر لے گئے ۔ آپ کو جب اس کا علم ہوا تو آپ نے انہیں تلاش کرنے کے لیے لوگوں کو بھیجا جب انہیں لایا گیا تو آنحضرت صلی اللہ علیہ وسلم کے حکم سے ان کے بھی ہاتھ اورپاؤں کاٹ دیئے گئے اور ان کی آنکھوں میں سلائی پھیر دی گئی ( جیسا کہ انہوں نے چرواہے کے ساتھ کیا تھا ) قتادہ نے بیان کیا کہ مجھ سے محمد بن سیرین نے بیان کیا کہ یہ حدود کے نازل ہونے سے پہلے کا واقعہ ہے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ نَاسًا، اجْتَوَوْا فِي الْمَدِينَةِ فَأَمَرَهُمُ النَّبِيُّ صلى الله عليه وسلم أَنْ يَلْحَقُوا بِرَاعِيهِ ـ يَعْنِي الإِبِلَ ـ فَيَشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا، فَلَحِقُوا بِرَاعِيهِ فَشَرِبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا، حَتَّى صَلَحَتْ أَبْدَانُهُمْ فَقَتَلُوا الرَّاعِيَ وَسَاقُوا الإِبِلَ، فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَبَعَثَ فِي طَلَبِهِمْ، فَجِيءَ بِهِمْ فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ، وَسَمَرَ أَعْيُنَهُمْ‏.‏ قَالَ قَتَادَةُ فَحَدَّثَنِي مُحَمَّدُ بْنُ سِيرِينَ أَنَّ ذَلِكَ كَانَ قَبْلَ أَنْ تَنْزِلَ الْحُدُودُ‏.‏",
                "headingArabic": "الدَّوَاءِ بِأَبْوَالِ الإِبِلِ",
                "headingUrdu": "اونٹوں کے پیشاب سے علاج کرنا",
                "headingEnglish": "To treat with the urine of camels",
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5450,
                "hadithNumber": "5687",
                "englishNarrator": "Narrated Khalid bin Sa`d:",
                "hadithEnglish": "We went out and Ghalib bin Abjar رضی اللہ عنہ was accompanying us. He fell ill on the way and when we arrived at Medina he was still sick. Ibn Abi 'Atiq came to visit him and said to us, \"Treat him with black cumin. Take five or seven seeds and crush them (mix the powder with oil) and drop the resulting mixture into both nostrils, for `Aisha  رضی اللہ عنہا has narrated to me that she heard the Prophet (ﷺ) saying, 'This black cumin is healing for all diseases except As-Sam.' Aisha  رضی اللہ عنہا said, 'What is As-Sam?' He said, 'Death.\"",
                "hadithUrdu": "ہم باہر گئے ہوئے تھے اورہمارے ساتھ حضرت غالب بن ابجر رضی اللہ عنہ بھی تھے ۔ وہ راستہ میں بیمار پڑ گئے پھر جب ہم مدینہ واپس آئے اس وقت بھی وہ بیمار ہی تھے ۔ حضرت ابن ابی عتیق ان کی عیادت کے لیے تشریف لائے اور ہم سے کہا کہ انہیں یہ کالے دانے ( کلونجی ) استعمال کراؤ ، اس کے پانچ یا سات دانے لے کرپیس لو اور پھر زیتون کے تیل میں ملا کر ( ناک کے ) اس طرف اور اس طرف اسے قطرہ قطرہ کر کے ٹپکاؤ کیونکہ حضرت عائشہ رضی اللہ عنہا نے مجھ سے بیان کیا کہ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ کلونجی ہر بیماری کی دواہے سوا سام کے ۔ میں نے عرض کیا سام کیا ہے ؟ فرمایا کہ موت ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن ابی شیبہ نے بیان کیا ، انہوں نے کہا ہم سے عبیداللہ نے بیان کیا ، انہوں نے کہا ہم سے اسرائیل نے بیان کیا ، انہوں نے کہا ان سے منصور نے بیان کیا ، ان سے خالد بن سعد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ مَنْصُورٍ، عَنْ خَالِدِ بْنِ سَعْدٍ، قَالَ خَرَجْنَا وَمَعَنَا غَالِبُ بْنُ أَبْجَرَ فَمَرِضَ فِي الطَّرِيقِ، فَقَدِمْنَا الْمَدِينَةَ وَهْوَ مَرِيضٌ، فَعَادَهُ ابْنُ أَبِي عَتِيقٍ فَقَالَ لَنَا عَلَيْكُمْ بِهَذِهِ الْحُبَيْبَةِ السَّوْدَاءِ، فَخُذُوا مِنْهَا خَمْسًا أَوْ سَبْعًا فَاسْحَقُوهَا، ثُمَّ اقْطُرُوهَا فِي أَنْفِهِ بِقَطَرَاتِ زَيْتٍ فِي هَذَا الْجَانِبِ وَفِي هَذَا الْجَانِبِ، فَإِنَّ عَائِشَةَ حَدَّثَتْنِي أَنَّهَا سَمِعَتِ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ هَذِهِ الْحَبَّةَ السَّوْدَاءَ شِفَاءٌ مِنْ كُلِّ دَاءٍ إِلاَّ مِنَ السَّامِ ‏\"‏‏.‏ قُلْتُ وَمَا السَّامُ قَالَ الْمَوْتُ‏.‏",
                "headingArabic": "الْحَبَّةِ السَّوْدَاءِ",
                "headingUrdu": "(علاج کے لیے) کالے دانے کلونجی",
                "headingEnglish": "(To treat with) black cumin (Nigella seeds)",
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5451,
                "hadithNumber": "5688",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"There is healing in black cumin for all diseases except death.\" Ibn-e-Shihab narrates: Saam means death, and black seed means Nigella seed.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا کہ سیاہ دانوں میں ہر بیماری سے شفاء ہے سوا سام کے ۔ ابن شہاب نے کہا کہ سام موت ہے اور ” سیاہ دانہ “ کلونجی کو کہتے ہیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، انہوں نے کہا کہ مجھے ابوسلمہ اور سعید بن مسیب نے خبر دی اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے خبر دی ،",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُمَا أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ فِي الْحَبَّةِ السَّوْدَاءِ شِفَاءٌ مِنْ كُلِّ دَاءٍ إِلاَّ السَّامَ ‏\"‏‏.‏ قَالَ ابْنُ شِهَابٍ وَالسَّامُ الْمَوْتُ، وَالْحَبَّةُ السَّوْدَاءُ الشُّونِيزُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5452,
                "hadithNumber": "5689",
                "englishNarrator": "Narrated 'Urwa:",
                "hadithEnglish": "Aisha رضی اللہ عنہا used to recommend at-Talbina for the sick and for such a person as grieved over a dead person. She used to say, \"I heard Allah's Messenger (ﷺ) saying, 'at-Talbina gives rest to the heart of the patient and makes it active and relieves some of his sorrow and grief.'\"",
                "hadithUrdu": "حضرت عائشہ رضی اللہ عنہا بیمار کے لیے اور میت کے سوگوار وں کے لیے تلبینہ ( روا ، دودھ اور شہد ملا کر دلیہ ) پکانے کا حکم دیتی تھیں اور فرماتی تھیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ نے فرمایا کہ تلبینہ مریض کے دل کو سکون پہنچاتا ہے اور غم کو دور کرتا ہے ( کیونکہ اسے پینے کے بعد عموماً نیند آجاتی ہے یہ زود ہضم بھی ہے ۔ )",
                "urduNarrator": "ہم سے حبان بن موسیٰ نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، انہیں یونس بن یزید نے خبر دی ، انہیں عقیل نے ، انہیں ابن شہاب نے ، انہیں عروہ نے کہ",
                "hadithArabic": "حَدَّثَنَا حِبَّانُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ بْنُ يَزِيدَ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا كَانَتْ تَأْمُرُ بِالتَّلْبِينِ لِلْمَرِيضِ وَلِلْمَحْزُونِ عَلَى الْهَالِكِ، وَكَانَتْ تَقُولُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ التَّلْبِينَةَ تُجِمُّ فُؤَادَ الْمَرِيضِ، وَتَذْهَبُ بِبَعْضِ الْحُزْنِ ‏\"‏‏.‏",
                "headingArabic": "التَّلْبِينَةِ لِلْمَرِيضِ",
                "headingUrdu": "مریض کے لیے تلبینہ تیار",
                "headingEnglish": "At-Talbina prepared for the patient",
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5426,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=217",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=215",
                "label": "215",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=216",
                "label": "216",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=217",
                "label": "217",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=218",
                "label": "218",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=219",
                "label": "219",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=220",
                "label": "220",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=221",
                "label": "221",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=219",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=219",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=217",
        "to": 5450,
        "total": 40465
    }
}