{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 199,
        "data": [
            {
                "id": 4953,
                "hadithNumber": "5180",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Once the Prophet (ﷺ) saw some women and children coming from a wedding party. He got up energetically and happily and said, \"By Allah! You (i.e., the Ansar) are the most beloved of all people to me.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے عورتوں اور بچوں کو کسی شادی سے آتے ہوئے دیکھا تو آپ صلی اللہ علیہ وسلم خوشی کے مارے جلدی سے کھڑے ہو گئے اور فرمایا یا اللہ ! ( تو گواہ رہ ) تم لوگ سب لوگوں سے زیادہ مجھ کو محبوب ہو ۔",
                "urduNarrator": "ہم سے عبدالرحمٰن بن المبارک نے بیان کیا ، کہا ہم سے عبدالوارث نے بیان کیا ، کہا ہم سے عبد العزیز بن صہیب نے بیان کیا ، ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ أَبْصَرَ النَّبِيُّ صلى الله عليه وسلم نِسَاءً وَصِبْيَانًا مُقْبِلِينَ مِنْ عُرْسٍ، فَقَامَ مُمْتَنًّا فَقَالَ ‏ \"‏ اللَّهُمَّ أَنْتُمْ مِنْ أَحَبِّ النَّاسِ إِلَىَّ ‏\"‏‏.‏",
                "headingArabic": "ذَهَابِ النِّسَاءِ وَالصِّبْيَانِ إِلَى الْعُرْسِ",
                "headingUrdu": "شادی کی تقریب میں خواتین اور بچوں کی شرکت",
                "headingEnglish": "The attendance of women and children at a wedding party",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4954,
                "hadithNumber": "5181",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا (the wife of the Prophet):",
                "hadithEnglish": "I bought a cushion having on it pictures (of animals). When Allah's Messenger (ﷺ) saw it, he stood at the door and did not enter. I noticed the sign of disapproval on his face and said, \"O Allah's Messenger (ﷺ)! I repent to Allah and His Apostle. What sin have I committed?' Allah's Messenger (ﷺ) said. \"What is this cushion?\" I said, \"I have bought it for you so that you may sit on it and recline on it.\" Allah's Messenger (ﷺ) said, \"The makers of these pictures will be punished on the Day of Resurrection, and it will be said to them, 'Give life to what you have created (i.e., these pictures).' \" The Prophet (ﷺ) added, \"The Angels of (Mercy) do not enter a house in which there are pictures (of animals).",
                "hadithUrdu": "انہوں نے ایک چھوٹا سا گدا خریدا جس میں تصویریں بنی ہوئی تھیں ۔ جب آنحضرت صلی اللہ علیہ وسلم نے اسے دیکھا تو دروازے پر کھڑے ہو گئے اور اندر نہیں آئے ۔ میں نے آنحضرت صلی اللہ علیہ وسلم کے چہرے پر خفگی کے آثار دیکھ لئے اور عرض کیا یا رسول اللہ ! میں اللہ اور اس کے رسول سے توبہ کرتی ہوں ، میں نے کیا غلطی کی ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ گدا یہاں کیسے آیا ؟ بیان کیا کہ میں نے عرض کیا میں نے ہی اسے خریدا ہے تاکہ آپ اس پر بیٹھیں اور اس پر ٹیک لگائیں آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ان تصویروں کے ( بنانے والوں کو ) قیامت کے دن عذاب دیا جائے گا اور ان سے کہا جائے گا کہ جو تم نے تصویر سازی کی ہے اسے زندہ بھی کرو ؟ اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جن گھروں میں تصویریں ہوتی ہیں ان میں ( رحمت کے ) فرشتے نہیں آتے ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے نافع نے ، ان سے قاسم بن محمد نے اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہر ہ حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا أَخْبَرَتْهُ أَنَّهَا اشْتَرَتْ نُمْرُقَةً فِيهَا تَصَاوِيرُ، فَلَمَّا رَآهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَامَ عَلَى الْبَابِ فَلَمْ يَدْخُلْ، فَعَرَفْتُ فِي وَجْهِهِ الْكَرَاهِيَةَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَتُوبُ إِلَى اللَّهِ وَإِلَى رَسُولِهِ، مَاذَا أَذْنَبْتُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا بَالُ هَذِهِ النِّمْرِقَةِ ‏\"‏‏.‏ قَالَتْ فَقُلْتُ اشْتَرَيْتُهَا لَكَ لِتَقْعُدَ عَلَيْهَا وَتَوَسَّدَهَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ، وَيُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ ‏\"‏‏.‏ وَقَالَ ‏\"‏ إِنَّ الْبَيْتَ الَّذِي فِيهِ الصُّوَرُ لاَ تَدْخُلُهُ الْمَلاَئِكَةُ ‏\"‏‏.‏",
                "headingArabic": "هَلْ يَرْجِعُ إِذَا رَأَى مُنْكَرًا فِي الدَّعْوَةِ‏",
                "headingUrdu": "اگر کوئی شخص جماعت میں کوئی قابل اعتراض چیز دیکھے تو کیا واپس آ جائے؟",
                "headingEnglish": "Should a person return if he sees something objectionable in the party?",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4955,
                "hadithNumber": "5182",
                "englishNarrator": "Narrated Sahl رضی اللہ عنہ :",
                "hadithEnglish": "When Abu Usaid As-Sa`idi رضی اللہ عنہ got married, he invited the Prophet (ﷺ) and his companions. None prepared the food for them and brought it to them but his wife. She soaked some dates in water in a stone pot overnight, and when the Prophet (ﷺ) had finished his food, she provided him with that drink (of soaked dates). She intended by it giving him a present.",
                "hadithUrdu": "جب حضرت ابواسید ساعدی رضی اللہ عنہ نے شادی کی تو انہوں نے نبی کریم صلی اللہ علیہ وسلم اور آپ کے صحابہ کو دعوت دی ، اس موقعہ پر کھانا ان کی دلہن ام اسید ہی نے تیار کیا تھا اور انہوں نے ہی مردوں کے سامنے کھانا رکھا ۔ انہوں نے پتھر کے ایک بڑے پیالے میں رات کے وقت کھجوریں بھگو دی تھی اور جب آنحضرت صلی اللہ علیہ وسلم کھانے سے فارغ ہوئے تو انہوں نے ہی اس کا شربت بنایا اور آنحضرت صلی اللہ علیہ وسلم کے سامنے ( تحفہ کے طور پر ) پینے کے لئے پیش کیا ۔",
                "urduNarrator": "ہم سے سعید بن ابی مر یم نے بیان کیا ، کہا ہم سے ابو غسان محمد بن مطرف نے بیان کیا ، کہا کہ مجھ سے ابوحازم ( سلمہ بن دینار ) نے بیان کیا ، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلٍ، قَالَ لَمَّا عَرَّسَ أَبُو أُسَيْدٍ السَّاعِدِيُّ دَعَا النَّبِيَّ صلى الله عليه وسلم وَأَصْحَابَهُ، فَمَا صَنَعَ لَهُمْ طَعَامًا وَلاَ قَرَّبَهُ إِلَيْهِمْ إِلاَّ امْرَأَتُهُ أُمُّ أُسَيْدٍ، بَلَّتْ تَمَرَاتٍ فِي تَوْرٍ مِنْ حِجَارَةٍ مِنَ اللَّيْلِ، فَلَمَّا فَرَغَ النَّبِيُّ صلى الله عليه وسلم مِنَ الطَّعَامِ أَمَاثَتْهُ لَهُ فَسَقَتْهُ، تُتْحِفُهُ بِذَلِكَ‏.‏",
                "headingArabic": "قِيَامِ الْمَرْأَةِ عَلَى الرِّجَالِ فِي الْعُرْسِ وَخِدْمَتِهِمْ بِالنَّفْسِ",
                "headingUrdu": "(اس کی) شادی کی تقریب میں مردوں کے لیے خود دلہن کی خدمت",
                "headingEnglish": "The serving of the bride herself for the men at (her) marriage party",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4956,
                "hadithNumber": "5183",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "Abu Usaid As-Sa`idi invited the Prophet (ﷺ) to his wedding party and his wife served him on that day, and she was the bride. She said (or Sahl said), \"Do you know what she soaked for Allah's Messenger (ﷺ)? She soaked some dates for him (in water) in a drinking bowl overnight.\"",
                "hadithUrdu": "حضرت ابواسید ساعدی نے اپنی شادی کے موقع پر رسول اللہ صلی اللہ علیہ وسلم کو دعوت دی ۔ اس دن ان کی بیوی ہی سب کی خدمت کر رہی تھیں ، حالانکہ وہ دلہن تھیں بیوی نے کہا یا سہل نے ( راوی کو شک تھا ) کہ تمہیں معلوم ہے کہ میں نے آنحضرت صلی اللہ علیہ وسلم کے لئے کیا تیار کیا تھا ؟ میں نے آپ کے لئے ایک بڑے پیالے میں رات کے وقت سے کھجور کا شربت تیار کیا تھا ۔",
                "urduNarrator": "ہم سے یحی بن بکیر نے بیان کیا ، کہا ہم سے یعقوب بن عبدالرحمٰن القاری نے بیان کیا ، ان سے ابو الحازم نے ، کہا کہ میں نے حضرت سہل بن سعد رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ، عَنْ أَبِي حَازِمٍ، قَالَ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ، أَنَّ أَبَا أُسَيْدٍ السَّاعِدِيَّ، دَعَا النَّبِيَّ صلى الله عليه وسلم لِعُرْسِهِ، فَكَانَتِ امْرَأَتُهُ خَادِمَهُمْ يَوْمَئِذٍ وَهْىَ الْعَرُوسُ، فَقَالَتْ أَوْ قَالَ أَتَدْرُونَ مَا أَنْقَعَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنْقَعَتْ لَهُ تَمَرَاتٍ مِنَ اللَّيْلِ فِي تَوْرٍ‏.‏",
                "headingArabic": "النَّقِيعِ وَالشَّرَابِ الَّذِي لاَ يُسْكِرُ فِي الْعُرْسِ",
                "headingUrdu": "شادی کی تقریب میں النقی اور دیگر غیر نشہ آور مشروبات",
                "headingEnglish": "An-Naqi and other non-toxicant drinks at a wedding party",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4957,
                "hadithNumber": "5184",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The woman is like a rib; if you try to straighten her, she will break. So if you want to get benefit from her, do so while she still has some crookedness.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا عورت مثل پسلی کے ہے ، اگر تم اسے سیدھا کرنا چاہو گے تو توڑ دوگے اور اگر اس سے فائدہ حاصل کرنا چاہو گے تو اس کی ٹیڑھ کے ساتھ ہی فائدہ حاصل کرو گے ۔",
                "urduNarrator": "ہم سے عبد العزیز بن عبداللہ نے بیان کیا ، کہ ہم سے حضرت امام مالک نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْمَرْأَةُ كَالضِّلَعِ، إِنْ أَقَمْتَهَا كَسَرْتَهَا، وَإِنِ اسْتَمْتَعْتَ بِهَا اسْتَمْتَعْتَ بِهَا وَفِيهَا عِوَجٌ ‏\"‏‏.‏",
                "headingArabic": "الْمُدَارَاةِ مَعَ النِّسَاءِ‏",
                "headingUrdu": "عورتوں کے ساتھ خوش اخلاقی اور حسن سلوک کرنا",
                "headingEnglish": "To be polite and kind to the women",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4958,
                "hadithNumber": "5185, 5186",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever believes in Allah and the Last Day should not hurt (trouble) his neighbor.\" And I advise you to take care of the women, for they are created from a rib and the most crooked portion of the rib is its upper part; if you try to straighten it, it will break, and if you leave it, it will remain crooked, so I urge you to take care of the women.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص اللہ اور قیامت کے دن پر ایمان رکھتا ہو وہ اپنے پڑوسی کو تکلیف نہ پہنچائے اور میں تمہیں ۔ عورتوں کے بارے میں بھلائی کی وصیت کرتا ہوں کیونکہ وہ پسلی سے پیدا کی گئی ہیں اور پسلی میں بھی سب سے زیادہ ٹیڑھا اس کے اوپر کا حصہ ہے ۔ اگر تم اسے سیدھا کرنا چاہو گے تو اسے توڑ ڈالو گے اور اگر اسے چھوڑ دوگے تو وہ ٹیڑھی ہی باقی رہ جائےگی اس لئے میں تمہیں عورتوں کے بارے میں اچھے سلوک کی وصیت کرتا ہوں ۔",
                "urduNarrator": "ہم سے اسحٰق بن نصر نے بیان کیا ، کہا ہم سے حسین جعفی نے بیان کیا ، ان سے زائدہ نے ، ان سے میسرہ نے ان سے ابو الحازم نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ، عَنْ زَائِدَةَ، عَنْ مَيْسَرَةَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يُؤْذِي جَارَهُ ‏\"‏‏.‏ وَاسْتَوْصُوا بِالنِّسَاءِ خَيْرًا فَإِنَّهُنَّ خُلِقْنَ مِنْ ضِلَعٍ وَإِنَّ أَعْوَجَ شَيْءٍ فِي الضِّلَعِ أَعْلَاهُ فَإِنْ ذَهَبْتَ تُقِيمُهُ كَسَرْتَهُ وَإِنْ تَرَكْتَهُ لَمْ يَزَلْ أَعْوَجَ فَاسْتَوْصُوا بِالنِّسَاءِ خَيْرًا",
                "headingArabic": "الْوَصَاةِ بِالنِّسَاءِ",
                "headingUrdu": "عورتوں کا خیال رکھنے کی تلقین",
                "headingEnglish": "The exhortation of taking care of the women",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4959,
                "hadithNumber": "5187",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "During the lifetime of the Prophet (ﷺ) we used to avoid chatting leisurely and freely with our wives lest some Divine inspiration might be revealed concerning us. But when the Prophet (ﷺ) had died, we started chatting leisurely and freely (with them).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے وقت میں ہم اپنی بیویوں کے ساتھ گفتگو اور بہت زیادہ بے تکلفی سے اس ڈر کی وجہ سے پرہیز کرتے تھے کہ کہیں کوئی بے اعتدالی ہو جائے اور ہماری برائی میں کوئی حکم نازل نہ ہو جائے پھر جب آنحضرت صلی اللہ علیہ وسلم کی وفات ہو گئی تو ہم نے ان سے خوب کھل کے گفتگو کی اور خوب بے تکلفی کرنے لگے ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے عبداللہ بن دینار نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كُنَّا نَتَّقِي الْكَلاَمَ وَالاِنْبِسَاطَ إِلَى نِسَائِنَا عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم هَيْبَةَ أَنْ يُنْزَلَ فِينَا شَىْءٌ فَلَمَّا تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم تَكَلَّمْنَا وَانْبَسَطْنَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4960,
                "hadithNumber": "5188",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Everyone of you is a guardian and everyone of you is responsible (for his wards). A ruler is a guardian and is responsible(for his subjects); a man is a guardian of his family and responsible (for them); a wife is a guardian of her husband's house and she is responsible (for it), a slave is a guardian of his master's property and is responsible (for that). Beware! All of you are guardians and are responsible (for your wards).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم میں سے ہر ایک حاکم ہے اور ہر ایک سے ( اس کی رعیت کے بارے میں ) سوال ہو گا ۔ پس امام حاکم ہے اس سے سوال ہو گا ۔ مرد اپنی بیوی بچوں کا حاکم ہے اور اس سے سوال ہو گا ۔ عورت اپنے شوہر کے مال کا حاکم ہے اور اس سے سوال ہو گا ۔ غلام اپنے سردار کے مال کا حاکم ہے اور اس سے سوال ہو گا ہاں پس تم میں سے ہر ایک حاکم ہے اور ہر ایک سے سوال ہو گا ۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب نے ، ان سے نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہمانے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ كُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ، فَالإِمَامُ رَاعٍ وَهْوَ مَسْئُولٌ وَالرَّجُلُ رَاعٍ عَلَى أَهْلِهِ وَهْوَ مَسْئُولٌ وَالْمَرْأَةُ رَاعِيَةٌ عَلَى بَيْتِ زَوْجِهَا وَهْىَ مَسْئُولَةٌ، وَالْعَبْدُ رَاعٍ عَلَى مَالِ سَيِّدِهِ وَهُوَ مَسْئُولٌ، أَلاَ فَكُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ ‏\"‏‏.‏",
                "headingArabic": "‏{‏قُوا أَنْفُسَكُمْ وَأَهْلِيكُمْ نَارًا‏}‏",
                "headingUrdu": "اپنے آپ کو اور اپنے اہل و عیال سے اس آگ سے بچو جس کا ایندھن انسان اور پتھر ہیں...",
                "headingEnglish": "\"Ward off from yourself and your families a Fire whose fuel is men and stones...\"",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4961,
                "hadithNumber": "5189",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Eleven women sat (at a place) and promised and contracted that they would not conceal anything of the news of their husbands. The first one said, \"My husband is like the meat of a slim weak camel which is kept on the top of a mountain which is neither easy to climb, nor is the meat fat, so that one might put up with the trouble of fetching it.\" The second one said, \"I shall not relate my husband's news, for I fear that I may not be able to finish his story, for if I describe him, I will mention all his defects and bad traits.\" The third one said, \"My husband, the \"too-tall\"! if I describe him (and he hears of that) he will divorce me, and if I keep quiet, he will keep me hanging (neither divorcing me nor treating me as a wife).\" The fourth one said, \"My husband is (moderate in temper) like the night of Tihama: neither hot nor cold; I am neither afraid of him, nor am I discontented with him.\" The fifth one said, \"My husband, when entering (the house) is a leopard (sleeps a lot), and when going out, is a lion (boasts a lot). He does not ask about whatever is in the house.\" The sixth one said, \"If my husband eats, he eats too much (leaving the dishes empty), and if he drinks he leaves nothing; if he sleeps he sleeps he rolls himself (alone in our blankets); and he does not insert his palm to inquire about my feelings.\" The seventh one said, \"My husband is a wrong-doer or weak and foolish. All the defects are present in him. He may injure your head or your body or may do both.\" The eighth one said, \"My husband is soft to touch like a rabbit and smells like a Zarnab (a kind of good smelling grass).\" The ninth one said, \"My husband is a tall generous man wearing a long strap for carrying his sword. His ashes are abundant (i.e. generous to his guests) and his house is near to the people (who would easily consult him).\" The tenth one said, \"My husband is Malik (possessor), and what is Malik? Malik is greater than whatever I say about him. (He is beyond and above all praises which can come to my mind). Most of his camels are kept at home (ready to be slaughtered for the guests) and only a few are taken to the pastures. When the camels hear the sound of the lute (or the tambourine) they realize that they are going to be slaughtered for the guests.\" The eleventh one said, \"My husband is Abu Zar` and what is Abu Zar` (i.e., what should I say about him)? He has given me many ornaments and my ears are heavily loaded with them and my arms have become fat (i.e., I have become fat). And he has pleased me, and I have become so happy that I feel proud of myself. He found me with my family who were mere owners of sheep and living in poverty, and brought me to a respected family having horses and camels and threshing and purifying grain. Whatever I say, he does not rebuke or insult me. When I sleep, I sleep till late in the morning, and when I drink water (or milk), I drink my fill. The mother of Abu Zar and what may one say in praise of the mother of Abu Zar? Her saddle bags were always full of provision and her house was spacious. As for the son of Abu Zar, what may one say of the son of Abu Zar? His bed is as narrow as an unsheathed sword and an arm of a kid (of four months) satisfies his hunger. As for the daughter of Abu Zar, she is obedient to her father and to her mother. She has a fat well-built body and that arouses the jealousy of her husband's other wife. As for the (maid) slave girl of Abu Zar, what may one say of the (maid) slavegirl of Abu Zar? She does not uncover our secrets but keeps them, and does not waste our provisions and does not leave the rubbish scattered everywhere in our house.\" The eleventh lady added, \"One day it so happened that Abu Zar went out at the time when the milk was being milked from the animals, and he saw a woman who had two sons like two leopards playing with her two breasts. (On seeing her) he divorced me and married her. Thereafter I married a noble man who used to ride a fast tireless horse and keep a spear in his hand. He gave me many things, and also a pair of every kind of livestock and said, Eat (of this), O Um Zar, and give provision to your relatives.\" She added, \"Yet, all those things which my second husband gave me could not fill the smallest utensil of Abu Zar's.\" `Aisha رضی اللہ عنہا then said: Allah's Messenger (ﷺ) said to me, \"I am to you as Abu Zar was to his wife Um Zar.\" Imam Bukhari رضی اللہ عنہ says the narration reported by Saeed bin Salamah from Hisham contains: '' وَلاَ تُعَشِّشُ بَيْتَنَا تَعْشِيشًا‏ '' Imam Bukhari رضی اللہ عنہ says: ''  فَأَتَقَمَّحُ‏.‏ بِالْمِيمِ '' and it is more valid.",
                "hadithUrdu": "انہوں نے کہا کہ گیارہ عورتوں کا ایک اجتماع ہوا جس میں انہوں نے آپس میں یہ طے کیا کہ مجلس میں وہ اپنے اپنے خاوند کا صحیح صحیح حال بیان کریں کوئی بات نہ چھپاویں ۔ چنانچہ پہلی عورت ( نام نامعلوم ) بولی میرے خاوند کی مثال ایسی ہے جیسے دبلے اونٹ کا گوشت جوپہاڑ کی چوٹی پر رکھا ہوا ہو نہ تو وہاں تک جانے کا راستہ صاف ہے کہ آسانی سے چڑھ کر اس کو کوئی لے آوے اور نہ وہ گوشت ہی ایسا موٹا تازہ ہے جسے لانے کے لئے اس پہاڑ پر چڑھنے کی تکلیف گوارا کرے ۔ دوسری عورت ( عمرہ بنت عمرو تمیمی نامی ) کہنے لگی میں اپنے خاوند کا حال بیان کروں تو کہاں تک بیان کروں ( اس میں اتنے عیب ہیں ) میں ڈرتی ہوں کہ سب بیان نہ کر سکوں گی اس پر بھی اگر بیان کروں تو اس کے کھلے اور چھپے سارے عیب بیان کر سکتی ہوں ۔ تیسری عورت ( حیی بنت کعب یمانی ) کہنے لگی ، میرا خاوند کیا ہے ایک تاڑ کا تاڑ ( لمبا تڑنگا ) ہے اگر اس کے عیب بیان کروں تو طلاق تیار ہے اگر خاموش رہوں تو ادھر لٹکی رہوں ۔ چوتھی عورت ( مہدوبنت ابی ہرومہ ) کہنے لگی کہ میراخاوند ملک تہامہ کی رات کی طرح معتدل نہ زیادہ گرم نہ بہت ٹھنڈا نہ اس سے مجھ کو خوف ہے نہ اکتاہٹ ہے ۔ پانچوں عورت ( کبشہ نامی ) کہنے لگی کہ میر ا خاوند ایساہے کہ گھر میں آتا ہے تو وہ ایک چیتا ہے اور جب باہر نکلتاہے تو شیر ( بہادر ) کی طرح ہے ۔ جو چیز گھر میں چھوڑ کر جاتا ہے اس کے بارے میں پوچھتا ہی نہیں ( کہ وہ کہاں گئی ؟ ) اتنا بےپرواہ ہے جو آج کمایا اسے کل کے لئے اٹھا کر رکھتا ہی نہیں اتنا سخی ہے ۔ چھٹی عورت ( ہند نامی ) کہنے لگی کہ میرا خاوند جب کھانے پر آتا ہے تو سب کچھ چٹ کر جاتا ہے اور جب پینے پر آتا ہے تو ایک بوند بھی باقی نہیں چھوڑتا اور جب لیٹتا ہے تو تنہا ہی اپنے اوپر کپڑا لپیٹ لیتا ہے اور الگ پڑکر سو جاتا ہے میرے کپڑے میں کبھی ہاتھ بھی نہیں ڈالتا کہ کبھی میرا دکھ درد کچھ تو معلوم کرے ۔ ساتویں عورت ( حیی بنت علقمہ ) میرا خاوند تو جاہل یا مست ہے ۔ صحبت کے وقت اپنا سینہ میرے سینے سے اوندھا پڑ جاتا ہے ۔ دنیا میں جتنے عیب لوگوں میں ایک ایک کر کے جمع ہیں وہ سب اس کی ذات میں جمع ہیں ( کم بخت سے بات کروں تو ) سر پھوڑ ڈالے یا ہاتھ توڑ ڈالے یا دونوں کام کر ڈالے ۔ آٹھویں عورت ( یاسر بنت اوس ) کہنے لگی میرا خاوند چھونے میں خرگوش کی طرح نرم ہے اور خوشبو میں سونگھو تو زعفران جیسا خوشبودار ہے ۔ نویں عورت ( نام نامعلوم ) کہنے لگی کہ میرے خاوند کا گھر بہت اونچا اور بلند ہے وہ قدآور بہادر ہے ، اس کے یہاں کھانا اس قدر پکتا ہے کہ راکھ کے ڈھیر کے ڈھیر جمع ہیں ۔ ( غریبوں کو خوب کھلاتا ہے ) لوگ جہاں صلاح و مشورہ کے لئے بیٹھتے ہیں ( یعنی پنچائت گھر ) وہاں سے اس کا گھر بہت نزدیک ہے ۔ دسویں عورت ( کبشہ بنت رافع ) کہنے لگی میرے خاوند کا کیا پوچھنا جائیداد والا ہے ، جائیداد بھی کیسی بڑی جائیداد ویسی کسی کے پاس نہیں ہو سکتی بہت سارے اونٹ جو جابجا اس کے گھر کے پاس جٹے رہتے ہیں اور جنگل میں چرنے کم جاتے ہیں ۔ جہاں ان اونٹوں نے باجے کی آوازسنی بس ان کو اپنے ذبح ہونے کا یقین ہو گیا گیارھویں عورت ( ام زرع بنت اکیمل بنت ساعدہ ) کہنے لگی میرا خاوند ابو زرع ہے اس کا کیا کہنا اس نے میرے کانوں کو زیوروں سے بوجھل کر دیا ہے اور میرے دونوں بازو چربی سے پھلا دئیے ہیں مجھے خوب کھلا کر موٹا کر دیا ہے کہ میں بھی اپنے تئیں خوب موٹی سمجھنے لگی ہوں ۔ شادی سے پہلے میں تھوڑی سے بھیڑ بکریوں میں تنگی سے گزر بسر کرتی تھی ۔ ابو زرعہ نے مجھ کو گھوڑوں ، اونٹوں ، کھیت کھلیان سب کا مالک بنا دیا ہے اتنی بہت جائیداد ملنے پر بھی اس کا مزاج اتنا عمدہ ہے کہ بات کہوں تو برا نہیں مانتا مجھ کو کبھی برا نہیں کہتا ۔ سوئی پڑی رہوں تو صبح تک مجھے کوئی نہیں جگاتا ۔ پانی پیوں تو خوب سیراب ہو کر پی لوں رہی ابوزرعہ کی ماں ( میری ساس ) تو میں اس کی کیا خوبیاں بیان کروں اس کا توشہ کھانا مال و اسباب سے بھراہوا ، اس کا گھر بہت ہی کشادہ ۔ ابوزرعہ کا بیٹا وہ بھی کیسا اچھا خوبصورت ( نازک بدن دبلا پتلا ) ہری چھالی یا ننگی تلوار کے برابر اس کے سونے کی جگہ ایسا کم خوراک کہ بکری کے چار ماہ کے بچے کا دست کا گوشت اس کا پیٹ بھردے ۔ ابو زرعہ کی بیٹی وہ بھی سبحان اللہ کیا کہنا اپنے باپ کی پیاری ، اپنی ماں کی پیاری ( تابع فرمان اطاعت گزار ) کپڑا بھرپور پہننے والی ( موٹی تازی ) سوکن کی جلن ابو زرعہ کی لونڈی اس کی بھی کیا پوچھتے ہو کبھی کوئی بات ہماری مشہور نہیں کرتی ( گھر کا بھید ہمیشہ پوشیدہ رکھتی ہے ) کھانے تک نہیں چراتی گھر میں کوڑا کچڑا نہیں چھوڑتی مگر ایک دن ایسا ہوا کہ لوگ مکھن نکالنے کو دودھ متھ رہے تھے ۔ ( صبح ہی صبح ) ابو زرعہ باہر گیا اچانک اس نے ایک عورت دیکھی جس کے دو بچے چیتوں کی طرح اس کی کمر کے تلے دو اناروں سے کھیل رہے تھے ( مراد اس کی دونوں چھاتیاں ہیں جو انار کی طرح تھیں ) ابو زرعہ نے مجھ کو طلاق دے کر اس عورت سے نکاح کر لیا ۔ اس کے بعد میں نے ایک اور شریف سردار سے نکاح کر لیا جو گھوڑے کا اچھا سوار ، عمدہ نیزہ باز ہے ، اس نے بھی مجھ کو بہت سے جانور دے دئیے ہیں اور ہر قسم کے اسباب میں سے ایک ایک جوڑ ا دیا ہوا ہے اور مجھ سے کہا کرتا ہے کہ ام زرع ! خوب کھا پی ، اپنے عزیز و اقرباء کو بھی خوب کھلا پلا تیرے لئے عام اجازت ہے مگر یہ سب کچھ بھی جو میں نے تجھ کو دیا ہوا ہے اگر اکٹھا کروں تو تیرے پہلے خاوند ابو زرعہ نے جوتجھ کو دیا تھا ، اس میں کا ایک چھوٹا برتن بھی نہ بھرے ۔پھر عائشہ رضی اللہ عنہا نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ میں تمہارے لیے ایسا ہی ہوں جیسا کہ ابوذر رضی اللہ عنہ اپنی بیوی ام زر کے لیے تھے۔امام بخاری رحمۃ اللہ علیہ کہتے ہیں کہ سعید بن سلمہ نے ہشام سے جو روایت نقل کی ہے اس میں ہے: ''وَلاَ تُعَشِّشُ بَيْتَنَا تَعْشِیشًا'' امام بخاری رحمۃ اللہ علیہ فرماتے ہیں: ''فَأَتَقَمَّحُ بِالْمِيمِ'' اور یہ زیادہ صحیح  ہے۔",
                "urduNarrator": "ہم سے سلیمان بن عبدالرحمٰن اور علی بن حجر نے بیان کیا ، ان دونوں نے کہا کہ ہم کو عیسیٰ بن یونس نے خبر دی ، اس نے کہا کہ ہم سے ہشام بن عروہ نے بیان کیا ، انہوں نے اپنے بھائی عبداللہ بن عروہ سے ، انہوں نے اپنے والد عروہ بن زبیر سے ، انہوں نے عائشہ رضی اللہ عنہا سے",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ جَلَسَ إِحْدَى عَشْرَةَ امْرَأَةً، فَتَعَاهَدْنَ وَتَعَاقَدْنَ أَنْ لاَ يَكْتُمْنَ مِنْ أَخْبَارِ أَزْوَاجِهِنَّ شَيْئًا‏.‏ قَالَتِ الأُولَى زَوْجِي لَحْمُ جَمَلٍ، غَثٌّ عَلَى رَأْسِ جَبَلٍ، لاَ سَهْلٍ فَيُرْتَقَى، وَلاَ سَمِينٍ فَيُنْتَقَلُ‏.‏ قَالَتِ الثَّانِيَةُ زَوْجِي لاَ أَبُثُّ خَبَرَهُ، إِنِّي أَخَافُ أَنْ لاَ أَذَرَهُ، إِنْ أَذْكُرْهُ أَذْكُرْ عُجَرَهُ وَبُجَرَهُ‏.‏ قَالَتِ الثَّالِثَةُ زَوْجِي الْعَشَنَّقُ، إِنْ أَنْطِقْ أُطَلَّقْ وَإِنْ أَسْكُتْ أُعَلَّقْ‏.‏ قَالَتِ الرَّابِعَةُ زَوْجِي كَلَيْلِ تِهَامَةَ، لاَ حَرٌّ، وَلاَ قُرٌّ، وَلاَ مَخَافَةَ، وَلاَ سَآمَةَ‏.‏ قَالَتِ الْخَامِسَةُ زَوْجِي إِنْ دَخَلَ فَهِدَ، وَإِنْ خَرَجَ أَسِدَ، وَلاَ يَسْأَلُ عَمَّا عَهِدَ‏.‏ قَالَتِ السَّادِسَةُ زَوْجِي إِنْ أَكَلَ لَفَّ، وَإِنْ شَرِبَ اشْتَفَّ، وَإِنِ اضْطَجَعَ الْتَفَّ، وَلاَ يُولِجُ الْكَفَّ لِيَعْلَمَ الْبَثَّ، قَالَتِ السَّابِعَةُ زَوْجِي غَيَايَاءُ أَوْ عَيَايَاءُ طَبَاقَاءُ، كُلُّ دَاءٍ لَهُ دَاءٌ، شَجَّكِ أَوْ فَلَّكِ أَوْ جَمَعَ كُلاًّ لَكِ‏.‏ قَالَتِ الثَّامِنَةُ زَوْجِي الْمَسُّ مَسُّ أَرْنَبٍ، وَالرِّيحُ رِيحُ زَرْنَبٍ‏.‏ قَالَتِ التَّاسِعَةُ زَوْجِي رَفِيعُ الْعِمَادِ، طَوِيلُ النِّجَادِ، عَظِيمُ الرَّمَادِ، قَرِيبُ الْبَيْتِ مِنَ النَّادِ‏.‏ قَالَتِ الْعَاشِرَةُ زَوْجِي مَالِكٌ وَمَا مَالِكٌ، مَالِكٌ خَيْرٌ مِنْ ذَلِكِ، لَهُ إِبِلٌ كَثِيرَاتُ الْمَبَارِكِ قَلِيلاَتُ الْمَسَارِحِ، وَإِذَا سَمِعْنَ صَوْتَ الْمِزْهَرِ أَيْقَنَّ أَنَّهُنَّ هَوَالِكُ‏.‏ قَالَتِ الْحَادِيَةَ عَشْرَةَ زَوْجِي أَبُو زَرْعٍ فَمَا أَبُو زَرْعٍ أَنَاسَ مِنْ حُلِيٍّ أُذُنَىَّ، وَمَلأَ مِنْ شَحْمٍ عَضُدَىَّ، وَبَجَّحَنِي فَبَجِحَتْ إِلَىَّ نَفْسِي، وَجَدَنِي فِي أَهْلِ غُنَيْمَةٍ بِشِقٍّ، فَجَعَلَنِي فِي أَهْلِ صَهِيلٍ وَأَطِيطٍ وَدَائِسٍ وَمُنَقٍّ، فَعِنْدَهُ أَقُولُ فَلاَ أُقَبَّحُ وَأَرْقُدُ فَأَتَصَبَّحُ، وَأَشْرَبُ فَأَتَقَنَّحُ، أُمُّ أَبِي زَرْعٍ فَمَا أُمُّ أَبِي زَرْعٍ عُكُومُهَا رَدَاحٌ، وَبَيْتُهَا فَسَاحٌ، ابْنُ أَبِي زَرْعٍ، فَمَا ابْنُ أَبِي زَرْعٍ مَضْجِعُهُ كَمَسَلِّ شَطْبَةٍ، وَيُشْبِعُهُ ذِرَاعُ الْجَفْرَةِ، بِنْتُ أَبِي زَرْعٍ فَمَا بِنْتُ أَبِي زَرْعٍ طَوْعُ أَبِيهَا، وَطَوْعُ أُمِّهَا، وَمِلْءُ كِسَائِهَا، وَغَيْظُ جَارَتِهَا، جَارِيَةُ أَبِي زَرْعٍ، فَمَا جَارِيَةُ أَبِي زَرْعٍ لاَ تَبُثُّ حَدِيثَنَا تَبْثِيثًا، وَلاَ تُنَقِّثُ مِيرَتَنَا تَنْقِيثًا، وَلاَ تَمْلأُ بَيْتَنَا تَعْشِيشًا، قَالَتْ خَرَجَ أَبُو زَرْعٍ وَالأَوْطَابُ تُمْخَضُ، فَلَقِيَ امْرَأَةً مَعَهَا وَلَدَانِ لَهَا كَالْفَهْدَيْنِ يَلْعَبَانِ مِنْ تَحْتِ خَصْرِهَا بِرُمَّانَتَيْنِ، فَطَلَّقَنِي وَنَكَحَهَا، فَنَكَحْتُ بَعْدَهُ رَجُلاً سَرِيًّا، رَكِبَ شَرِيًّا وَأَخَذَ خَطِّيًّا وَأَرَاحَ عَلَىَّ نَعَمًا ثَرِيًّا، وَأَعْطَانِي مِنْ كُلِّ رَائِحَةٍ زَوْجًا وَقَالَ كُلِي أُمَّ زَرْعٍ، وَمِيرِي أَهْلَكِ‏.‏ قَالَتْ فَلَوْ جَمَعْتُ كُلَّ شَىْءٍ أَعْطَانِيهِ مَا بَلَغَ أَصْغَرَ آنِيَةِ أَبِي زَرْعٍ‏.‏ قَالَتْ عَائِشَةُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كُنْتُ لَكِ كَأَبِي زَرْعٍ لأُمِّ زَرْعٍ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ سَعِيدُ بْنُ سَلَمَةَ عَنْ هِشَامٍ وَلاَ تُعَشِّشُ بَيْتَنَا تَعْشِيشًا‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ بَعْضُهُمْ فَأَتَقَمَّحُ‏.‏ بِالْمِيمِ، وَهَذَا أَصَحُّ‏.‏",
                "headingArabic": "حُسْنِ الْمُعَاشَرَةِ مَعَ الأَهْلِ",
                "headingUrdu": "خاندان کے ساتھ شائستہ اور مہربان سلوک کرنا",
                "headingEnglish": "To treat the family in a polite and kind manner",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4962,
                "hadithNumber": "5190",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"While the Ethiopians were playing with their small spears, Allah's Messenger (ﷺ) screened me behind him and I watched (that display) and kept on watching till I left on my own.\" So you may estimate of what age a little girl may listen to amusement.",
                "hadithUrdu": "کچھ فوجی کھیل کا نیزہ بازی سے مظاہرہ کر رہے تھے ، تو رسول اللہ صلی اللہ علیہ وسلم نے ( اپنے جسم مبارک سے ) میرے لئے پردہ کیا اور میں وہ کھیل دیکھتی رہی ۔ میں نے اسے دیر تک دیکھا اور خود ہی اکتا کر لوٹ آئی ۔ اب تم خود سمجھ لو کہ ایک کم عمر لڑکی کھیل کو کتنی دیر تک دیکھ سکتی ہے اور اس میں دلچسپی لے سکتی ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ الْحَبَشُ يَلْعَبُونَ بِحِرَابِهِمْ، فَسَتَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا أَنْظُرُ، فَمَا زِلْتُ أَنْظُرُ حَتَّى كُنْتُ أَنَا أَنْصَرِفُ فَاقْدُرُوا قَدْرَ الْجَارِيَةِ الْحَدِيثَةِ السِّنِّ تَسْمَعُ اللَّهْوَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4963,
                "hadithNumber": "5191",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "I had been eager to ask `Umar bin Al-Khattab رضی اللہ عنہ about the two ladies from among the wives of the Prophet regarding whom Allah said 'If you two (wives of the Prophet (ﷺ) namely Aisha رضی اللہ عنہا and Hafsa) turn in repentance to Allah, your hearts are indeed so inclined (to oppose what the Prophet (ﷺ) likes). (66.4) till `Umar رضی اللہ عنہ performed the Hajj and I too, performed the Hajj along with him. (On the way) `Umar رضی اللہ عنہ went aside to answer the call of nature, and I also went aside along with him carrying a tumbler full of water, and when `Umar رضی اللہ عنہ had finished answering the call of nature, I poured water over his hands and he performed the ablution. Then I said to him, \"O chief of the Believers! Who were the two ladies from among the wives of the Prophet (ﷺ) regarding whom Allah said: 'If you two (wives of the Prophet) turn in repentance to Allah your hearts are indeed so inclined (to oppose what the Prophet (ﷺ) likes)?\" (66.4) He said, \"I am astonished at your question, O Ibn `Abbas. They were `Aisha رضی اللہ عنہا and Hafsa.\" Then `Umar رضی اللہ عنہ went on narrating the Hadith and said, \"I and an Ansari neighbor of mine from Bani Umaiyya bin Zaid who used to live in `Awali-al-Medina, used to visit the Prophet (ﷺ) in turn. He used to go one day and I another day. When I went, I would bring him the news of what had happened that day regarding the Divine Inspiration and other things, and when he went, he used to do the same for me. We, the people of Quraish used to have the upper hand over our wives, but when we came to the Ansar, we found that their women had the upper hand over their men, so our women also started learning the ways of the Ansari women. I shouted at my wife and she retorted against me and I disliked that she should answer me back. She said to me, 'Why are you so surprised at my answering you back? By Allah, the wives of the Prophet answer him back and some of them may leave (does not speak to) him throughout the day till the night.' The (talk) scared me and I said to her, 'Whoever has done so will be ruined!' Then I proceeded after dressing myself, and entered upon Hafsa and said to her, 'Does anyone of you keep the Prophet (ﷺ) angry till night?' She said, 'Yes.' I said, 'You are a ruined losing person! Don't you fear that Allah may get angry for the anger of Allah's Messenger (ﷺ) and thus you will be ruined? So do not ask more from the Prophet (ﷺ) and do not answer him back and do not give up talking to him. Ask me whatever you need and do not be tempted to imitate your neighbor (i.e., `Aisha رضی اللہ عنہا ) in her manners for she is more charming than you and more beloved to the Prophet (ﷺ) .\" `Umar رضی اللہ عنہ added,\"At that time a talk was circulating among us that (the tribe of) Ghassan were preparing their horses to invade us. My Ansari companion, on the day of his turn, went (to the town) and returned to us at night and knocked at my door violently and asked if I was there. I became horrified and came out to him. He said, 'Today a great thing has happened.' I asked, 'What is it? Have (the people of) Ghassan come?' He said, 'No, but (What has happened) is greater and more horrifying than that: Allah's Messenger (ﷺ); has divorced his wives. `Umar رضی اللہ عنہ added, \"The Prophet (ﷺ) kept away from his wives and I said \"Hafsa is a ruined loser.' I had already thought that most probably this (divorce) would happen in the near future. So I dressed myself and offered the morning prayer with the Prophet (ﷺ) and then the Prophet; entered an upper room and stayed there in seclusion. I entered upon Hafsa and saw her weeping. I asked, 'What makes you weep? Did I not warn you about that? Did the Prophet (ﷺ) divorce you all?' She said, 'I do not know. There he is retired alone in the upper room.' I came out and sat near the pulpit and saw a group of people sitting around it and some of them were weeping. I sat with them for a while but could not endure the situation, so I went to the upper room where the Prophet; was and said to a black slave of his, 'Will you get the permission (of the Prophet (ﷺ) ) for `Umar رضی اللہ عنہ(to enter)?' The slave went in, talked to the Prophet (ﷺ) about it and then returned saying, 'I have spoken to the Prophet (ﷺ) and mentioned you but he kept quiet.' Then I returned and sat with the group of people sitting near the pulpit. but I could not bear the situation and once again I said to the slave, 'Will you get the permission for `Umar رضی اللہ عنہ ?' He went in and returned saying, 'I mentioned you to him but he kept quiet.' So I returned again and sat with the group of people sitting near the pulpit, but I could not bear the situation, and so I went to the slave and said, 'Will you get the permission for `Umar رضی اللہ عنہ ?' He went in and returned to me saying, 'I mentioned you to him but he kept quiet.' When I was leaving, behold! The slave called me, saying, 'The Prophet (ﷺ) has given you permission.' Then I entered upon Allah's Messenger (ﷺ) and saw him Lying on a bed made of stalks of date palm leaves and there was no bedding between it and him. The stalks left marks on his side and he was leaning on a leather pillow stuffed with date-palm fires. I greeted him and while still standing I said, 'O Allah's Apostle! Have you divorced your wives?' He looked at me and said, 'No.' I said, 'Allah Akbar!' And then, while still standing, I said chatting, 'Will you heed what I say, O Allah's Messenger (ﷺ)? We, the people of Quraish used to have power over our women, but when we arrived at Medina we found that the men (here) were overpowered by their women.' The Prophet (ﷺ) smiled and then I said to him, 'Will you heed what I say, O Allah's Messenger (ﷺ)? I entered upon Hafsa and said to her, \"Do not be tempted to imitate your companion (`Aisha رضی اللہ عنہا ), for she is more charming than you and more beloved to the Prophet.' \" The Prophet (ﷺ) smiled for a second time. When I saw him smiling, I sat down. Then I looked around his house, and by Allah, I could not see anything of importance in his house except three hides, so I said, 'O Allah's Messenger (ﷺ)! Invoke Allah to make your followers rich, for the Persians and the Romans have been made prosperous and they have been given (the pleasures of the world), although they do not worship Allah.' Thereupon the Prophet (ﷺ) sat up as he was reclining. and said, 'Are you of such an opinion, O the son of Al-Khattab? These are the people who have received the rewards for their good deeds in this world.' I said, 'O Allah's Messenger (ﷺ)! Ask Allah to forgive me.' Then the Prophet (ﷺ) kept away from his wives for twenty-nine days because of the story which Hafsa had disclosed to `Aisha رضی اللہ عنہا . The Prophet (ﷺ) had said, 'I will not enter upon them (my wives) for one month,' because of his anger towards them, when Allah had admonished him. So, when twenty nine days had passed, the Prophet (ﷺ) first entered upon `Aisha رضی اللہ عنہا . `Aisha رضی اللہ عنہا said to him, 'O Allah's Messenger (ﷺ)! You had sworn that you would not enter upon us for one month, but now only twenty-nine days have passed, for I have been counting them one by one.' The Prophet (ﷺ) said, 'The (present) month is of twenty nine days.' `Aisha رضی اللہ عنہا added, 'Then Allah revealed the Verses of the option. (2) And out of all his-wives he asked me first, and I chose him.' Then he gave option to his other wives and they said what `Aisha رضی اللہ عنہا had said . \" (1) The Prophet, ' had decided to abstain from eating a certain kind of food because of a certain event, so Allah blamed him for doing so. Some of his wives were the cause of him taking that decision, therefore he deserted them for one month. See Qur'an: (66.4)",
                "hadithUrdu": "بہت دنوں تک میرے دل میں خواہش رہی کہ میں عمر بن خطاب رضی اللہ عنہ سے نبی کریم صلی اللہ علیہ وسلم کی ان دو بیویوں کے متعلق پوچھوں جن کے بارے میں اللہ نے یہ آیت نازل کی تھی ۔ ” ان تتوبا الی اللہ فقد صغت قلوبکما “ الخ ۔ ایک مرتبہ انہوں نے حج کی اور ان کے ساتھ میں نے بھی حج کیا ۔ ایک جگہ جب وہ راستہ سے ہٹ کر ( قضائے حاجت کے لئے ) گئے تو میں بھی ایک برتن میں پانی لے کر ان کے ساتھ راستہ سے ہٹ گیا ۔ پھر انہوں نے قضائے حاجت کی اور واپس آئے تو میں نے ان کے ہاتھوں پر پانی ڈالا ۔ پھر انہوں نے وضو کیا تو میں نے اس وقت ان سے پوچھا کہ یا امیرالمؤمنین ! نبی کریم صلی اللہ علیہ وسلم کی بیویوں میں وہ کون ہیں جن کے متعلق اللہ نے یہ ارشاد فرمایا کہ ” ان تتوبا الی اللہ فقد صغت قلوبکما “ عمر بن خطاب رضی اللہ عنہ نے اس پر کہا اے ابن عباس ! تم پر حیرت ہے ۔ وہ عائشہ اور حفصہ ہیں پھر عمر رضی اللہ عنہ نے تفصیل کے ساتھ حدیث بیان کرنے شروع کی ۔ انہوں نے کہا کہ میں اور میرے ایک انصاری پڑوسی جو بنو امیہ بن زید سے تھے اور عوالی مدینہ میں رہتے تھے ۔ ہم نے ( عوالی سے ) رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہونے کے لئے باری مقرر کر رکھی تھی ۔ ایک دن وہ حاضری دیتے اور ایک دن میں حاضری دیتا ، جب میں حاضر ہوتا تو اس دن کی تمام خبریں جو وحی وغیرہ سے متعلق ہوتیں لاتا ( اور اپنے پڑوسی سے بیان کرتا ) اور جس دن وہ حاضر ہوتے تو وہ بھی ایسے کرتے ۔ ہم قریشی لوگ اپنی عورتوں پر غالب تھے لیکن جب ہم مدینہ تشریف آئے تو یہ لوگ ایسے تھے کہ عورتوں سے مغلوب تھے ، ہماری عورتوں نے بھی انصار کی عورتوں کا طریقہ سیکھنا شروع کر دیا ۔ ایک دن میں نے اپنی بیوی کو ڈانٹا تو اس نے بھی میرا ترکی بہ ترکی جواب دیا ۔ میں نے اس کے اس طرح جواب دینے پر ناگواری کا اظہار کیا تو اس نے کہا کہ میرا جواب دینا تمہیں برا کیوں لگتا ہے ، خدا کی قسم نبی کریم صلی اللہ علیہ وسلم کی ازواج بھی ان کو جوابات دے دیتی ہیں اور بعض تو آنحضرت صلی اللہ علیہ وسلم سے ایک دن رات تک الگ رہتی ہیں ۔ میں اس بات پر کانپ اٹھا اور کہا کہ ان میں سے جس نے بھی یہ معاملہ کیا یقیناً وہ نامراد ہو گئی ۔ پھر میں نے اپنے کپڑے پہنے اور ( مدینہ کے لئے ) روانہ ہوا پھر میں حفصہ کے گھر گیا اور میں نے اس سے کہا اے حفصہ ! کیا تم میں سے کوئی بھی نبی کریم صلی اللہ علیہ وسلم سے ایک ایک دن رات تک غصہ رہتی ہے ؟ انہوں نے کہا کہ جی ہاں کبھی ( ایسا ہو جاتا ہے ) میں نے اس پر کہا کہ پھر تم نے اپنے آپ کو خسارہ میں ڈال لیا اور نامراد ہوئی ۔ کیا تمہیں اس کا کوئی ڈر نہیں کہ نبی کریم صلی اللہ علیہ وسلم کے غصہ کی وجہ سے اللہ تم پر غصہ ہو جائے اور پھر تم تنہا ہی ہو جاؤ گی ۔ خبردار ! حضور اکرم صلی اللہ علیہ وسلم سے مطالبات نہ کیا کرو نہ کسی معاملہ میں آنحضرت صلی اللہ علیہ وسلم کو جواب دیا کرو اور نہ آنحضرت صلی اللہ علیہ وسلم کو چھوڑا کرو ۔ اگر تمہیں کوئی ضرورت ہو تو مجھ سے مانگ لیا کرو ۔ تمہاری سوکن جو تم سے زیادہ خوبصورت ہے اور حضور اکرم صلی اللہ علیہ وسلم کو تم سے زیادہ پیاری ہے ، ان کی وجہ سے تم کسی غلط فہمی میں نہ مبتلا ہو جانا ۔ ان کا اشارہ عائشہ رضی اللہ عنہا کی طرف تھا ۔ عمر رضی اللہ عنہ نے بیان کیا کہ ہمیں معلوم ہوا تھا کہ ملک غسان ہم پر حملہ کے لئے فوجی تیاریاں کر رہا ہے ۔ میرے انصاری ساتھی اپنی باری پر مدینہ منورہ گئے ہوئے تھے ۔ وہ رات گئے واپس آئے اور میرے دروازے پر بڑی زور زور سے دستک دی اور کہا کہ کیا عمر رضی اللہ عنہ گھر میں ہیں ۔ میں گھبرا کر باہر نکلا تو انہوں نے کہا کہ آج تو بڑا حادثہ ہو گیا ۔ میں نے کہا کیا بات ہوئی ، کیا غسانی چڑھ آئے ہیں ؟ انہوں نے کہا کہ نہیں ، حادثہ اس سے بھی بڑا اور اس سے بھی زیادہ خوفناک ہے ۔ حضور اکرم صلی اللہ علیہ وسلم نے ازواج مطہرات کو طلاق دے دی ہے ۔ میں نے کہا کہ حفصہ تو خاسر و نامراد ہوئی ۔ مجھے تو اس کا خطرہ لگا ہی رہتا تھا کہ اس طرح کا کوئی حادثہ جلد ہی ہو گا پھر میں نے اپنے تمام کپڑے پہنے ( اور مدینہ کے لئے روانہ ہو گیا ) میں نے فجر کی نماز حضور اکرم صلی اللہ علیہ وسلم کے ساتھ پڑھی ( نماز کے بعد ) حضور اکرم صلی اللہ علیہ وسلم اپنے ایک بالا خانہ میں چلے گئے اور وہاں تنہائی اختیار کر لی ۔ میں حفصہ کے پاس گیا تو وہ رو رہی تھی ۔ میں نے کہا اب روتی کیا ہو ۔ میں نے تمہیں پہلے ہی متنبہ کر دیا تھا ۔ کیا آنحضرت صلی اللہ علیہ وسلم نے تمہیں طلاق دے دی ہے ؟ انہوں نے کہا کہ مجھے معلوم نہیں ۔ حضور اکرم صلی اللہ علیہ وسلم اس وقت بالا خانہ میں تنہا تشریف رکھتے ہیں ۔ میں وہاں سے نکلا اور منبر کے پاس آیا ۔ اس کے گرد کچھ صحابہ کرام موجود تھے اور ان میں سے بعض رو رہے تھے ۔ تھوڑی دیر تک میں ان کے ساتھ بیٹھا رہا ۔ اس کے بعد میرا غم مجھ پر غالب آ گیا اور میں اس بالا خانہ کے پاس آیا ۔ جہاں حضور اکرم صلی اللہ علیہ وسلم تشریف رکھتے تھے ۔ میں نے آنحضرت کے ایک حبشی غلام سے کہا کہ عمر کے لئے اندر آنے کی اجازت لے لو ۔ غلام اندر گیا اور حضور اکرم صلی اللہ علیہ وسلم سے گفتگو کر کے واپس آ گیا ۔ اس نے مجھ سے کہا کہ میں نے آنحضرت صلی اللہ علیہ وسلم سے عرض کی اور آنحضرت صلی اللہ علیہ وسلم سے آپ کا ذکر کیا لیکن آپ خاموش رہے ۔ چنانچہ میں واپس چلا آیا اور پھر ان لوگوں کے ساتھ بیٹھ گیا جو منبر کے پاس موجود تھے ۔ میرا غم مجھ پر غالب آیا اور دوبارہ آ کر میں نے غلام سے کہا کہ عمر رضی اللہ عنہ کے لئے اجازت لے لو ۔ اس غلام نے واپس آ کر پھرکہا کہ میں نے آنحضرت صلی اللہ علیہ وسلم کے سامنے آپ کا ذکر کیا تو آنحضرت صلی اللہ علیہ وسلم خاموش رہے ۔ میں پھر واپس آ گیا اور منبر کے پاس جو لوگ موجود تھے ان کے ساتھ بیٹھ گیا ۔ لیکن میرا غم مجھ پرغالب آیا اور میں نے پھرآ کر غلام سے کہا کہ عمرکے لئے اجازت طلب کرو ۔ غلام اندر گیا اور واپس آ کر جواب دیا کہ میں نے آپ کا ذکرآنحضرت صلی اللہ علیہ وسلم سے کیا اور آنحضرت صلی اللہ علیہ وسلم خاموش رہے ۔ میں وہاں سے واپس آ رہا تھا کہ غلام نے مجھ کوپکار ا اور کہا حضور اکرم صلی اللہ علیہ وسلم نے تمہیں اجازت دے دی ہے ۔ میں آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آپ اس بان کی چارپائی پر جس سے چٹائی بنی جاتی ہے لیٹے ہوئے تھے ۔ اس پر کوئی بستر نہیں تھا ۔ بان کے نشانات آپ کے پہلو مبارک پر پڑے ہوئے تھے ۔ جس تکیہ پر آپ ٹیک لگائے ہوئے تھے اس میں چھال بھری ہوئی تھی ۔ میں نے حضور اکرم صلی اللہ علیہ وسلم کو سلام کیا اور کھڑے ہی کھڑے عرض کیا یا رسول اللہ ! کیا آپ نے اپنی ازواج کو طلاق دے دی ہے ؟ آنحضور صلی اللہ علیہ وسلم نے میری طرف نگاہ اٹھائی اور فرمایا نہیں ۔ میں ( خوشی کی وجہ سے ) کہہ اٹھا ۔ اللہ اکبر ۔ پھر میں نے کھڑے ہی کھڑے آنحضرت صلی اللہ علیہ وسلم کو خوش کرنے کے لئے کہا کہ یا رسول اللہ ! آپ کو معلوم ہے ہم قریش کے لوگ عورتوں پر غالب رہا کرتے تھے ۔ پھر جب ہم مدینہ آئے تو یہاں کے لوگوں پر ان کی عورتیں غالب تھیں ۔ آنحضرت صلی اللہ علیہ وسلم اس پر مسکرادیئے ۔ پھر میں نے عرض کیا یا رسول اللہ ! آپ کو معلوم ہے میں حفصہ کے پاس ایک مرتبہ گیا تھا اور اس سے کہہ آیا تھا کہ اپنی سوکن کی وجہ سے جو تم سے زیادہ خوبصورت اور تم سے زیادہ رسول اللہ صلی اللہ علیہ وسلم کو عزیز ہے ، دھوکا میں مت رہنا ۔ ان کا اشارہ عائشہ رضی اللہ عنہا کی طرف تھا ۔ اس پر حضور اکرم صلی اللہ علیہ وسلم دوبارہ مسکرا دیئے ۔ میں نے آنحضور صلی اللہ علیہ وسلم کو مسکراتے دیکھا تو بیٹھ گیا پھر نظر اٹھا کر میں آنحضور صلی اللہ علیہ وسلم کے گھر کا جائزہ لیا ۔ خدا کی قسم ، میں نے آنحضرت صلی اللہ علیہ وسلم کے گھر میں کوئی ایسی چیز نہیں دیکھی جس پر نظر رکتی ۔ سوا تین چمڑوں کے ( جو وہاں موجود تھے ) میں نے عرض کیا یا رسول اللہ ! اللہ سے دعا فرمائیں کہ وہ آپ کی امت کو فراخی عطا فرمائے ۔ فارس و روم کو فراخی اور وسعت حاصل ہے اور انہیں دنیا دی گئی ہے حالانکہ وہ اللہ کی عبادت نہیں کرتے ۔ آنحضرت صلی اللہ علیہ وسلم ابھی تک ٹیک لگائے ہوئے تھے لیکن اب سیدھے بیٹھ گئے اور فرمایا ابن خطاب ! تمہاری نظر میں بھی یہ چیزیں اہمیت رکھتی ہیں ، یہ تو وہ لوگ ہیں جنہیں جو کچھ بھلائی ملنے والی تھی سب اسی دنیا میں دے دی گئی ہے ۔ میں نے عرض کیا یا رسول اللہ ! میرے لئے اللہ سے مغفرت کی دعا کر دیجئیے ( کہ میں نے دنیاوی شان و شوکت کے متعلق یہ غلط خیال دل میں رکھا ) چنانچہ حضور اکرم صلی اللہ علیہ وسلم نے اپنی ازواج کو اسی وجہ سے انتیس دن تک الگ رکھا کہ حفصہ نے آنحضور صلی اللہ علیہ وسلم کا راز عائشہ سے کہہ دیا تھا ۔ آنحضور صلی اللہ علیہ وسلم نے فرمایا تھا کہ ایک مہینہ تک میں اپنی ازواج کے پاس نہیں جاؤں گا ۔ کیونکہ جب اللہ تعالیٰ نے آنحضرت صلی اللہ علیہ وسلم پر عتاب کیا تو آنحضرت صلی اللہ علیہ وسلم کو اس کا بہت رنج ہوا ( اور آپ نے ازواج سے الگ رہنے کا فیصلہ کیا ) پھر جب انتیسویں رات گزر گئی تو آنحضور عائشہ رضی اللہ عنہا کے گھر تشریف لے گئے اور آپ سے ابتداء کی ۔ عائشہ رضی اللہ عنہا نے عرض کیا کہ یا رسول اللہ ! آپ نے قسم کھائی تھی کہ ہمارے یہاں ایک مہینہ تک تشریف نہیں لائیں گے اور ابھی تو انتیس ہی دن گزرے ہیں میں تو ایک ایک دن گن رہی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ مہینہ انتیس کا ہے ۔ وہ مہینہ انتیس ہی کا تھا ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر اللہ تعالیٰ نے آیت تخییر نازل کی اور آنحضور صلی اللہ علیہ وسلم اپنی تمام ازواج میں سب سے پہلے میرے پاس تشریف لائے ( اور مجھ سے اللہ کی وحی کا ذکر کیا ) تو میں نے آنحضور صلی اللہ علیہ وسلم کو ہی پسند کیا ۔ اس کے بعد آنحضور صلی اللہ علیہ وسلم نے اپنی تمام دوسری ازواج کو اختیار دیا اور سب نے وہی کہا جو حضرت عائشہ رضی اللہ عنہا کہہ چکی تھیں ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، کہا کہ مجھے عبیداللہ بن عبداللہ بن ابی ثور نے خبر دی اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي ثَوْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمْ أَزَلْ حَرِيصًا أَنْ أَسْأَلَ عُمَرَ بْنَ الْخَطَّابِ عَنِ الْمَرْأَتَيْنِ مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم اللَّتَيْنِ قَالَ اللَّهُ تَعَالَى ‏{‏إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا‏}‏ حَتَّى حَجَّ وَحَجَجْتُ مَعَهُ، وَعَدَلَ وَعَدَلْتُ مَعَهُ بِإِدَاوَةٍ، فَتَبَرَّزَ، ثُمَّ جَاءَ فَسَكَبْتُ عَلَى يَدَيْهِ مِنْهَا فَتَوَضَّأَ فَقُلْتُ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ مَنِ الْمَرْأَتَانِ مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم اللَّتَانِ قَالَ اللَّهُ تَعَالَى ‏{‏إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا‏}‏ قَالَ وَاعَجَبًا لَكَ يَا ابْنَ عَبَّاسٍ، هُمَا عَائِشَةُ وَحَفْصَةُ‏.‏ ثُمَّ اسْتَقْبَلَ عُمَرُ الْحَدِيثَ يَسُوقُهُ قَالَ كُنْتُ أَنَا وَجَارٌ لِي مِنَ الأَنْصَارِ فِي بَنِي أُمَيَّةَ بْنِ زَيْدٍ، وَهُمْ مِنْ عَوَالِي الْمَدِينَةِ، وَكُنَّا نَتَنَاوَبُ النُّزُولَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَيَنْزِلُ يَوْمًا وَأَنْزِلُ يَوْمًا، فَإِذَا نَزَلْتُ جِئْتُهُ بِمَا حَدَثَ مِنْ خَبَرِ ذَلِكَ الْيَوْمِ مِنَ الْوَحْىِ أَوْ غَيْرِهِ، وَإِذَا نَزَلَ فَعَلَ مِثْلَ ذَلِكَ، وَكُنَّا مَعْشَرَ قُرَيْشٍ نَغْلِبُ النِّسَاءَ، فَلَمَّا قَدِمْنَا عَلَى الأَنْصَارِ إِذَا قَوْمٌ تَغْلِبُهُمْ نِسَاؤُهُمْ، فَطَفِقَ نِسَاؤُنَا يَأْخُذْنَ مِنْ أَدَبِ نِسَاءِ الأَنْصَارِ، فَصَخِبْتُ عَلَى امْرَأَتِي فَرَاجَعَتْنِي فَأَنْكَرْتُ أَنْ تُرَاجِعَنِي قَالَتْ وَلِمَ تُنْكِرُ أَنْ أُرَاجِعَكَ فَوَاللَّهِ إِنَّ أَزْوَاجَ النَّبِيِّ صلى الله عليه وسلم لَيُرَاجِعْنَهُ، وَإِنَّ إِحْدَاهُنَّ لَتَهْجُرُهُ الْيَوْمَ حَتَّى اللَّيْلِ‏.‏ فَأَفْزَعَنِي ذَلِكَ وَقُلْتُ لَهَا وَقَدْ خَابَ مَنْ فَعَلَ ذَلِكَ مِنْهُنَّ‏.‏ ثُمَّ جَمَعْتُ عَلَىَّ ثِيَابِي فَنَزَلْتُ فَدَخَلْتُ عَلَى حَفْصَةَ فَقُلْتُ لَهَا أَىْ حَفْصَةُ أَتُغَاضِبُ إِحْدَاكُنَّ النَّبِيَّ صلى الله عليه وسلم الْيَوْمَ حَتَّى اللَّيْلِ قَالَتْ نَعَمْ‏.‏ فَقُلْتُ قَدْ خِبْتِ وَخَسِرْتِ، أَفَتَأْمَنِينَ أَنْ يَغْضَبَ اللَّهُ لِغَضَبِ رَسُولِهِ صلى الله عليه وسلم فَتَهْلِكِي لاَ تَسْتَكْثِرِي النَّبِيَّ صلى الله عليه وسلم وَلاَ تُرَاجِعِيهِ فِي شَىْءٍ، وَلاَ تَهْجُرِيهِ، وَسَلِينِي مَا بَدَا لَكِ، وَلاَ يَغُرَّنَّكِ أَنْ كَانَتْ جَارَتُكِ أَوْضَأَ مِنْكِ، وَأَحَبَّ إِلَى النَّبِيِّ صلى الله عليه وسلم ـ يُرِيدُ عَائِشَةَ ـ قَالَ عُمَرُ وَكُنَّا قَدْ تَحَدَّثْنَا أَنَّ غَسَّانَ تُنْعِلُ الْخَيْلَ لِغَزْوِنَا، فَنَزَلَ صَاحِبِي الأَنْصَارِيُّ يَوْمَ نَوْبَتِهِ، فَرَجَعَ إِلَيْنَا عِشَاءً فَضَرَبَ بَابِي ضَرْبًا شَدِيدًا وَقَالَ أَثَمَّ هُوَ فَفَزِعْتُ فَخَرَجْتُ إِلَيْهِ، فَقَالَ قَدْ حَدَثَ الْيَوْمَ أَمْرٌ عَظِيمٌ‏.‏ قُلْتُ مَا هُوَ، أَجَاءَ غَسَّانُ قَالَ لاَ بَلْ أَعْظَمُ مِنْ ذَلِكَ وَأَهْوَلُ، طَلَّقَ النَّبِيُّ صلى الله عليه وسلم نِسَاءَهُ‏.‏ فَقُلْتُ خَابَتْ حَفْصَةُ وَخَسِرَتْ، قَدْ كُنْتُ أَظُنُّ هَذَا يُوشِكُ أَنْ يَكُونَ، فَجَمَعْتُ عَلَىَّ ثِيَابِي فَصَلَّيْتُ صَلاَةَ الْفَجْرِ مَعَ النَّبِيِّ صلى الله عليه وسلم فَدَخَلَ النَّبِيُّ صلى الله عليه وسلم مَشْرُبَةً لَهُ، فَاعْتَزَلَ فِيهَا، وَدَخَلْتُ عَلَى حَفْصَةَ فَإِذَا هِيَ تَبْكِي فَقُلْتُ مَا يُبْكِيكِ أَلَمْ أَكُنْ حَذَّرْتُكِ هَذَا أَطَلَّقَكُنَّ النَّبِيُّ صلى الله عليه وسلم قَالَتْ لاَ أَدْرِي هَا هُوَ ذَا مُعْتَزِلٌ فِي الْمَشْرُبَةِ‏.‏ فَخَرَجْتُ فَجِئْتُ إِلَى الْمِنْبَرِ فَإِذَا حَوْلَهُ رَهْطٌ يَبْكِي بَعْضُهُمْ، فَجَلَسْتُ مَعَهُمْ قَلِيلاً ثُمَّ غَلَبَنِي مَا أَجِدُ، فَجِئْتُ الْمَشْرُبَةَ الَّتِي فِيهَا النَّبِيُّ صلى الله عليه وسلم فَقُلْتُ لِغُلاَمٍ لَهُ أَسْوَدَ اسْتَأْذِنْ لِعُمَرَ‏.‏ فَدَخَلَ الْغُلاَمُ فَكَلَّمَ النَّبِيَّ صلى الله عليه وسلم ثُمَّ رَجَعَ فَقَالَ كَلَّمْتُ النَّبِيَّ صلى الله عليه وسلم وَذَكَرْتُكَ لَهُ، فَصَمَتَ‏.‏ فَانْصَرَفْتُ حَتَّى جَلَسْتُ مَعَ الرَّهْطِ الَّذِينَ عِنْدَ الْمِنْبَرِ، ثُمَّ غَلَبَنِي مَا أَجِدُ فَجِئْتُ فَقُلْتُ لِلْغُلاَمِ اسْتَأْذِنْ لِعُمَرَ‏.‏ فَدَخَلَ ثُمَّ رَجَعَ فَقَالَ قَدْ ذَكَرْتُكَ لَهُ فَصَمَتَ‏.‏ فَرَجَعْتُ فَجَلَسْتُ مَعَ الرَّهْطِ الَّذِينَ عِنْدَ الْمِنْبَرِ، ثُمَّ غَلَبَنِي مَا أَجِدُ فَجِئْتُ الْغُلاَمَ فَقُلْتُ اسْتَأْذِنْ لِعُمَرَ‏.‏ فَدَخَلَ ثُمَّ رَجَعَ إِلَىَّ فَقَالَ قَدْ ذَكَرْتُكَ لَهُ فَصَمَتَ‏.‏ فَلَمَّا وَلَّيْتُ مُنْصَرِفًا ـ قَالَ ـ إِذَا الْغُلاَمُ يَدْعُونِي فَقَالَ قَدْ أَذِنَ لَكَ النَّبِيُّ صلى الله عليه وسلم فَدَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِذَا هُوَ مُضْطَجِعٌ عَلَى رِمَالِ حَصِيرٍ، لَيْسَ بَيْنَهُ وَبَيْنَهُ فِرَاشٌ، قَدْ أَثَّرَ الرِّمَالُ بِجَنْبِهِ مُتَّكِئًا عَلَى وِسَادَةٍ مِنْ أَدَمٍ حَشْوُهَا لِيفٌ، فَسَلَّمْتُ عَلَيْهِ ثُمَّ قُلْتُ وَأَنَا قَائِمٌ يَا رَسُولَ اللَّهِ أَطَلَّقْتَ نِسَاءَكَ‏.‏ فَرَفَعَ إِلَىَّ بَصَرَهُ فَقَالَ ‏\"‏ لاَ ‏\"‏‏.‏ فَقُلْتُ اللَّهُ أَكْبَرُ‏.‏ ثُمَّ قُلْتُ وَأَنَا قَائِمٌ أَسْتَأْنِسُ يَا رَسُولَ اللَّهِ لَوْ رَأَيْتَنِي، وَكُنَّا مَعْشَرَ قُرَيْشٍ نَغْلِبُ النِّسَاءَ فَلَمَّا قَدِمْنَا الْمَدِينَةَ إِذَا قَوْمٌ تَغْلِبُهُمْ نِسَاؤُهُمْ، فَتَبَسَّمَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ قُلْتُ يَا رَسُولَ اللَّهِ لَوْ رَأَيْتَنِي وَدَخَلْتُ عَلَى حَفْصَةَ فَقُلْتُ لَهَا لاَ يَغُرَّنَّكِ أَنْ كَانَتْ جَارَتُكِ أَوْضَأَ مِنْكِ وَأَحَبَّ إِلَى النَّبِيِّ صلى الله عليه وسلم يُرِيدُ عَائِشَةَ فَتَبَسَّمَ النَّبِيُّ صلى الله عليه وسلم تَبَسُّمَةً أُخْرَى، فَجَلَسْتُ حِينَ رَأَيْتُهُ تَبَسَّمَ، فَرَفَعْتُ بَصَرِي فِي بَيْتِهِ، فَوَاللَّهِ مَا رَأَيْتُ فِي بَيْتِهِ شَيْئًا يَرُدُّ الْبَصَرَ غَيْرَ أَهَبَةٍ ثَلاَثَةٍ، فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ فَلْيُوَسِّعْ عَلَى أُمَّتِكَ، فَإِنَّ فَارِسًا وَالرُّومَ قَدْ وُسِّعَ عَلَيْهِمْ، وَأُعْطُوا الدُّنْيَا وَهُمْ لاَ يَعْبُدُونَ اللَّهَ‏.‏ فَجَلَسَ النَّبِيُّ صلى الله عليه وسلم وَكَانَ مُتَّكِئًا‏.‏ فَقَالَ ‏\"‏ أَوَفِي هَذَا أَنْتَ يَا ابْنَ الْخَطَّابِ، إِنَّ أُولَئِكَ قَوْمٌ عُجِّلُوا طَيِّبَاتِهِمْ فِي الْحَيَاةِ الدُّنْيَا ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ اسْتَغْفِرْ لِي‏.‏ فَاعْتَزَلَ النَّبِيُّ صلى الله عليه وسلم نِسَاءَهُ مِنْ أَجْلِ ذَلِكَ الْحَدِيثِ حِينَ أَفْشَتْهُ حَفْصَةُ إِلَى عَائِشَةَ تِسْعًا وَعِشْرِينَ لَيْلَةً وَكَانَ قَالَ ‏\"‏ مَا أَنَا بِدَاخِلٍ عَلَيْهِنَّ شَهْرًا ‏\"‏‏.‏ مِنْ شِدَّةِ مَوْجِدَتِهِ عَلَيْهِنَّ حِينَ عَاتَبَهُ اللَّهُ، فَلَمَّا مَضَتْ تِسْعٌ وَعِشْرُونَ لَيْلَةً دَخَلَ عَلَى عَائِشَةَ فَبَدَأَ بِهَا فَقَالَتْ لَهُ عَائِشَةُ يَا رَسُولَ اللَّهِ إِنَّكَ كُنْتَ قَدْ أَقْسَمْتَ أَنْ لاَ تَدْخُلَ عَلَيْنَا شَهْرًا، وَإِنَّمَا أَصْبَحْتَ مِنْ تِسْعٍ وَعِشْرِينَ لَيْلَةً أَعُدُّهَا عَدًّا‏.‏ فَقَالَ ‏\"‏ الشَّهْرُ تِسْعٌ وَعِشْرُونَ ‏\"‏‏.‏ فَكَانَ ذَلِكَ الشَّهْرُ تِسْعًا وَعِشْرِينَ لَيْلَةً‏.‏ قَالَتْ عَائِشَةُ ثُمَّ أَنْزَلَ اللَّهُ تَعَالَى آيَةَ التَّخَيُّرِ فَبَدَأَ بِي أَوَّلَ امْرَأَةٍ مِنْ نِسَائِهِ فَاخْتَرْتُهُ، ثُمَّ خَيَّرَ نِسَاءَهُ كُلَّهُنَّ فَقُلْنَ مِثْلَ مَا قَالَتْ عَائِشَةُ‏.‏",
                "headingArabic": "مَوْعِظَةِ الرَّجُلِ ابْنَتَهُ لِحَالِ زَوْجِهَا",
                "headingUrdu": "بیٹی کو شوہر کے بارے میں نصیحت",
                "headingEnglish": "Advice to a daughter regarding her husband",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4964,
                "hadithNumber": "5192",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A woman should not fast (optional fasts) except with her husband's permission if he is at home (staying with her).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اگر شوہر گھر پر موجود ہے تو کوئی عورت اس کی اجازت کے بغیر ( نفلی ) روزہ نہ رکھے ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو معمر نے خبر دی ، انہیں ہمام بن منبہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ لاَ تَصُومُ الْمَرْأَةُ وَبَعْلُهَا شَاهِدٌ إِلاَّ بِإِذْنِهِ ‏\"‏‏.‏",
                "headingArabic": "صَوْمِ الْمَرْأَةِ بِإِذْنِ زَوْجِهَا تَطَوُّعًا",
                "headingUrdu": "عورت کو شوہر کی رضامندی کے بغیر صوم نہیں دیکھنا چاہیے (کیا یہاں 'اس کے ساتھ' غائب ہے؟)",
                "headingEnglish": "A woman should not observe Saum except husband's consent (is 'with her' missing here?)",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4965,
                "hadithNumber": "5193",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If a man Invites his wife to sleep with him and she refuses to come to him, then the angels send their curses on her till morning.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب شوہر اپنی بیوی کو اپنے بستر پر بلائے اور وہ آنے سے ( ناراضگی کی وجہ سے ) انکار کر دے تو فرشتے صبح تک اس پر لعنت بھیجتے ہیں ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے شعبہ نے ، ان سے سلیمان نے ، ان سے ابوحازم نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا دَعَا الرَّجُلُ امْرَأَتَهُ إِلَى فِرَاشِهِ فَأَبَتْ أَنْ تَجِيءَ لَعَنَتْهَا الْمَلاَئِكَةُ حَتَّى تُصْبِحَ ‏\"‏‏.‏",
                "headingArabic": "إِذَا بَاتَتِ الْمَرْأَةُ مُهَاجِرَةً فِرَاشَ زَوْجِهَا",
                "headingUrdu": "اگر عورت اپنے شوہر کا بستر چھوڑ دے ۔",
                "headingEnglish": "If a woman deserts her husband's bed",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4966,
                "hadithNumber": "5194",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If a woman spends the night deserting her husband's bed (does not sleep with him), then the angels send their curses on her till she comes back (to her husband).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر عورت اپنے شوہر سے ناراضگی کی وجہ سے اس کے بستر سے الگ تھلگ رات گزارنے تو فرشتے اس پر اس وقت تک لعنت بھیجتے ہیں جب تک وہ اپنی اس حر کت سے باز نہ آ جائے ۔",
                "urduNarrator": "ہم سے محمد بن عرعرہ نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے بیان کیا ، ان سے زرارہ نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِذَا بَاتَتِ الْمَرْأَةُ مُهَاجِرَةً فِرَاشَ زَوْجِهَا لَعَنَتْهَا الْمَلاَئِكَةُ حَتَّى تَرْجِعَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4967,
                "hadithNumber": "5195",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"It is not lawful for a lady to fast (Nawafil) without the permission of her husband when he is at home; and she should not allow anyone to enter his house except with his permission; and if she spends of his wealth (on charitable purposes) without being ordered by him, he will get half of the reward.\" Musa's father has reported from Hadrat Abu Hurairah رضی اللہ عنہ same about fasting.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا عورت کے لئے جائز نہیں کہ اپنے شوہر کی موجودگی میں اس کی اجازت کے بغیر ( نفلی ) روزہ رکھے اور عورت کسی کو اس کے گھر میں اس کی مرضی کے بغیر آنے کی اجازت نہ دے اور عورت جو کچھ بھی اپنے شوہر کے مال میں سے اس کی صریح اجازت کے بغیر خرچ کر دے تو اسے بھی اس کا آدھا ثواب ملے گا ۔ اس حدیث کو ابوالزناد نے موسیٰ بن ابی عثمان سے بھی اور ان سے ان کے والد نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے روایت کیا ہے اور اس میں صرف روزہ کا ہی ذکر ہے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَحِلُّ لِلْمَرْأَةِ أَنْ تَصُومَ وَزَوْجُهَا شَاهِدٌ إِلاَّ بِإِذْنِهِ، وَلاَ تَأْذَنَ فِي بَيْتِهِ إِلاَّ بِإِذْنِهِ، وَمَا أَنْفَقَتْ مِنْ نَفَقَةٍ عَنْ غَيْرِ أَمْرِهِ فَإِنَّهُ يُؤَدَّى إِلَيْهِ شَطْرُهُ ‏\"‏‏.‏ وَرَوَاهُ أَبُو الزِّنَادِ أَيْضًا عَنْ مُوسَى عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ فِي الصَّوْمِ‏.‏",
                "headingArabic": null,
                "headingUrdu": "عورت شوہر کی رضامندی کے بغیر کسی کو گھر میں داخل نہ ہونے دے (یہاں بھی)",
                "headingEnglish": "A woman should not allow anyone to enter the house except husband's consent (here too)",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4968,
                "hadithNumber": "5196",
                "englishNarrator": "Narrated Usama رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I stood at the gate of Paradise and saw that the majority of the people who entered it were the poor, while the wealthy were stopped at the gate (for the accounts). But the companions of the Fire were ordered to be taken to the Fire. Then I stood at the gate of the Fire and saw that the majority of those who entered it were women.\"",
                "hadithUrdu": "میں جنت کے دروازہ پر کھڑا ہوا تو اس میں داخل ہونے والوں کی اکثریت غریبوں کی تھی ۔ مالدار ( جنت کے دروازے پر حساب کے لئے ) روک لئے گئے تھے البتہ جہنم والوں کو جہنم میں جانے کا حکم دے دیا گیا تھا اور میں جہنم کے دروازے پر کھڑا ہوا تو اس میں داخل ہونے والی زیادہ عورتیں تھیں ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے اسما عیل نے بیان کیا ، کہا کہ ہم کو تیمی نے خبر دی ، انہیں ابوعثمان نے ، انہیں حضرت اسامہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، أَخْبَرَنَا التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنْ أُسَامَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ قُمْتُ عَلَى باب الْجَنَّةِ فَكَانَ عَامَّةَ مَنْ دَخَلَهَا الْمَسَاكِينُ، وَأَصْحَابُ الْجَدِّ مَحْبُوسُونَ، غَيْرَ أَنَّ أَصْحَابَ النَّارِ قَدْ أُمِرَ بِهِمْ إِلَى النَّارِ، وَقُمْتُ عَلَى باب النَّارِ فَإِذَا عَامَّةُ مَنْ دَخَلَهَا النِّسَاءُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4969,
                "hadithNumber": "5197",
                "englishNarrator": "Narrated `Abdullah bin `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "During the lifetime of Allah's Messenger (ﷺ), the sun eclipsed. Allah's Messenger (ﷺ) offered the prayer of (the) eclipse) and so did the people along with him. He performed a long Qiyam (standing posture) during which Surat-al-Baqara could have been recited; then he performed a pro-longed bowing, then raised his head and stood for a long time which was slightly less than that of the first Qiyam (and recited Qur'an). Then he performed a prolonged bowing again but the period was shorter than the period of the first bowing, then he stood up and then prostrated. Again he stood up, but this time the period of standing was less than the first standing. Then he performed a prolonged bowing but of a lesser duration than the first, then he stood up again for a long time but for a lesser duration than the first. Then he performed a prolonged bowing but of lesser duration than the first, and then he again stood up, and then prostrated and then finished his prayer. By then the sun eclipse had cleared. The Prophet (ﷺ) then said, \"The sun and the moon are two signs among the signs of Allah, and they do not eclipse because of the death or birth of someone, so when you observe the eclipse, remember Allah (offer the eclipse prayer).\" They (the people) said, \"O Allah's Messenger (ﷺ)! We saw you stretching your hand to take something at this place of yours, then we saw you stepping backward.\" He said, \"I saw Paradise (or Paradise was shown to me), and I stretched my hand to pluck a bunch (of grapes), and had I plucked it, you would have eaten of it as long as this world exists. Then I saw the (Hell) Fire, and I have never before, seen such a horrible sight as that, and I saw that the majority of its dwellers were women.\" The people asked, \"O Allah's Messenger (ﷺ)! What is the reason for that?\" He replied, \"Because of their ungratefulness.\" It was said. \"Do they disbelieve in Allah (are they ungrateful to Allah)?\" He replied, \"They are not thankful to their husbands and are ungrateful for the favors done to them. Even if you do good to one of them all your life, when she seems some harshness from you, she will say, \"I have never seen any good from you.' \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں سورج گرہن ہوا تو آنحضرت صلی اللہ علیہ وسلم نے لوگوں کے ساتھ اس کی نماز پڑھی ۔ آپ نے بہت لمبا قیام کی اتنا طویل کہ سورۃ البقرہ پڑھی جا سکے پھر طویل رکوع کیا ۔ رکوع سے سر اٹھا کر بہت دیر تک قیام کیا ۔ یہ قیام پہلے قیام سے کچھ کم تھا ۔ پھر آپ نے دوسراطویل رکوع کیا ۔ یہ رکوع طوالت میں پہلے رکوع سے کچھ کم تھا ۔ پھر سر اٹھایا اور سجدہ کیا ۔ پھر دوبارہ قیام کیا اور بہت دیر تک حالت قیام میں رہے ۔ یہ قیام پہلی رکعت کے قیام سے کچھ کم تھا ۔ پھر طویل رکوع کیا ، یہ رکوع پہلے رکوع سے کچھ کم طویل تھا ۔ پھر سر اٹھایا اور طویل قیام کیا ۔ یہ قیام پہلے قیام سے کچھ کم تھا ۔ پھر رکوع کیا ، طویل رکوع ۔ اور یہ رکوع پہلے رکوع سے کچھ کم طویل تھا ۔ پھر سر اٹھایا اور سجدہ میں گئے ۔ جب آپ نماز سے فارغ ہوئے تو گرہن ختم ہو چکا تھا ۔ اس کے بعد آپ نے فرمایا کہ سورج اور چاند اللہ کی نشانیوں میں سے دو نشانیاں ہیں ، ان میں گرہن کسی کی موت یا کسی کی حیات کی وجہ سے نہیں ہوتا ۔ اس لئے جب تم گرہن دیکھو تو اللہ کو یاد کرو ۔ صحابہ نے عرض کیا یا رسول اللہ ! ہم نے آپ کو دیکھا کہ آپ نے اپنی جگہ سے کوئی چیز بڑھ کر لی ۔ پھر ہم نے دیکھا کہ آپ ہم سے ہٹ گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں نے جنت دیکھی تھی یا ( آنحضور صلی اللہ علیہ وسلم نے فرمایا راوی کو شک تھا ) مجھے جنت دکھائی گئی تھی ۔ میں نے اس کا خوشہ توڑنے کے لئے ہاتھ بڑھایا تھا اور اگر میں اسے توڑ لیتا تو تم رہتی دنیا تک اسے کھاتے اور میں نے دوزخ دیکھی آج کا اس سے زیادہ ہیبت ناک منظر میں نے کبھی نہیں دیکھا اور میں نے دیکھا کہ اس میں عورتوں کی تعداد زیادہ ہے ۔ صحابہ نے عرض کیا یا رسول اللہ ! ایسا کیوں ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا وہ شوہر کی ناشکری کرتی ہے اور ان کے احسان کا انکار کرتی ہیں ، اگر تم ان میں سے کسی ایک کے ساتھ زندگی بھر بھی حسن سلوک کا معاملہ کرو پھر بھی تمہاری طرف سے کوئی چیز اس کے لئے ناگواری خاطر ہوئی تو کہہ دے گی کہ میں نے تو تم سے کبھی بھلا ئی دیکھی ہی نہیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو امام مالک نے خبر دی ، انہیں زیدبن اسلم نے ، انہیں عطاء بن یسار نے اور انہیں حضرت عبداللہ بن عباس رضی اللہ عنہما نے ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ خَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم وَالنَّاسُ مَعَهُ، فَقَامَ قِيَامًا طَوِيلاً نَحْوًا مِنْ سُورَةِ الْبَقَرَةِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ سَجَدَ، ثُمَّ قَامَ فَقَامَ قِيَامًا طَوِيلاً وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ ثُمَّ سَجَدَ، ثُمَّ انْصَرَفَ، وَقَدْ تَجَلَّتِ الشَّمْسُ، فَقَالَ ‏\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمْ ذَلِكَ فَاذْكُرُوا اللَّهَ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ رَأَيْنَاكَ تَنَاوَلْتَ شَيْئًا فِي مَقَامِكَ هَذَا، ثُمَّ رَأَيْنَاكَ تَكَعْكَعْتَ‏.‏ فَقَالَ ‏\"‏ إِنِّي رَأَيْتُ الْجَنَّةَ ـ أَوْ أُرِيتُ الْجَنَّةَ ـ فَتَنَاوَلْتُ مِنْهَا عُنْقُودًا وَلَوْ أَخَذْتُهُ لأَكَلْتُمْ مِنْهُ مَا بَقِيَتِ الدُّنْيَا، وَرَأَيْتُ النَّارَ فَلَمْ أَرَ كَالْيَوْمِ مَنْظَرًا قَطُّ وَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏‏.‏ قَالُوا لِمَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ بِكُفْرِهِنَّ ‏\"‏‏.‏ قِيلَ يَكْفُرْنَ بِاللَّهِ قَالَ ‏\"‏ يَكْفُرْنَ الْعَشِيرَ، وَيَكْفُرْنَ الإِحْسَانَ، وَلَوْ أَحْسَنْتَ إِلَى إِحْدَاهُنَّ الدَّهْرَ، ثُمَّ رَأَتْ مِنْكَ شَيْئًا قَالَتْ مَا رَأَيْتُ مِنْكَ خَيْرًا قَطُّ ‏\"‏‏.‏",
                "headingArabic": "كُفْرَانِ الْعَشِيرِ",
                "headingUrdu": "شوہر کی  ناشکری کرنا",
                "headingEnglish": "To be unthankful to the husband",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4970,
                "hadithNumber": "5198",
                "englishNarrator": "Narrated `Imran:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"I looked at Paradise and saw that the majority of its residents were the poor; and I looked at the (Hell) Fire and saw that the majority of its residents were women.\" Abu Ayyub Salm bin Zareer corroborated him.",
                "hadithUrdu": "میں جنت میں جھانک کر دیکھا تو اس کے اکثر رہنے والے غریب لوگ تھے اور میں نے دوزخ میں جھانک کر دیکھا تو اس کے اندر رہنے والی اکثر عورتیں تھیں ۔ اس روایت کی متابعت ابوایوب اور سلم بن زریر نے کی ہے ۔",
                "urduNarrator": "ہم سے عثمان بن ہشیم نے بیان کیا ، کہا ہم سے عوف نے بیان کیا ، ان سے ابوحازم نے ، ان سے عمران نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ، حَدَّثَنَا عَوْفٌ، عَنْ أَبِي رَجَاءٍ، عَنْ عِمْرَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ اطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ، وَاطَّلَعْتُ فِي النَّارِ، فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏‏.‏ تَابَعَهُ أَيُّوبُ وَسَلْمُ بْنُ زَرِيرٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4971,
                "hadithNumber": "5199",
                "englishNarrator": "Narrated `Abdullah bin `Amr bin Al-`As رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"O `Abdullah! Have I not been formed that you fast all the day and stand in prayer all night?\" I said, \"Yes, O Allah's Messenger (ﷺ)!\" He said, \"Do not do that! Observe the fast sometimes and also leave them (the fast) at other times; stand up for the prayer at night and also sleep at night. Your body has a right over you, your eyes have a right over you and your wife has a right over you.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا عبداللہ ! کیا میری یہ اطلاع صحیح ہے کہ تم ( روزانہ ) دن میں روزے رکھتے ہو اور رات بھر عبادت کرتے ہو ؟ میں نے عرض کیا جی ہاں یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ایسا نہ کرو ، روزے بھی رکھو اور بلا روزے بھی رہو ۔ رات میں عبادت بھی کرو اور سوؤ بھی ۔ کیونکہ تمہارے بدن کا بھی تم پر حق ہے ، تمہاری آنکھ کا بھی تم پر حق ہے اور تمہاری بیوی کا بھی تم پر حق ہے ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو اوزاعی نے خبر دی ، کہا کہ مجھ سے یحییٰ ابن ابی کثیر نے بیان کیا ، کہا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا ، کہا کہ مجھ سے حضرت عبداللہ بن عمرو بن العاص رضی اللہ عنہما نے بیان کیا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا عَبْدَ اللَّهِ أَلَمْ أُخْبَرْ أَنَّكَ تَصُومُ النَّهَارَ وَتَقُومُ اللَّيْلَ ‏\"‏‏.‏ قُلْتُ بَلَى يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَلاَ تَفْعَلْ، صُمْ وَأَفْطِرْ، وَقُمْ وَنَمْ، فَإِنَّ لِجَسَدِكَ عَلَيْكَ حَقًّا، وَإِنَّ لِعَيْنِكَ عَلَيْكَ حَقًّا، وَإِنَّ لِزَوْجِكَ عَلَيْكَ حَقًّا ‏\"‏‏.‏",
                "headingArabic": "لِزَوْجِكَ عَلَيْكَ حَقٌّ",
                "headingUrdu": "آپ کی بیوی کا آپ پر حق ہے۔",
                "headingEnglish": "Your wife has a right over you",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4972,
                "hadithNumber": "5200",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"All of you are guardians and are responsible for your wards. The ruler is a guardian and the man is a guardian of his family; the lady is a guardian and is responsible for her husband's house and his offspring; and so all of you are guardians and are responsible for your wards.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم میں سے ہر ایک حاکم ہے اور ہر ایک سے اس کی رعیت کے بارے میں سوال ہو گا ۔ امیر ( حاکم ) ہے ، مراد اپنے گھر والوں پر حاکم ہے ۔ عورت اپنے شوہر کے گھر اور اس کے بچوں پر حاکم ہے ۔ تم میں سے ہر ایک حاکم ہے اور ہر ایک سے اس کی رعیت کے بارے میں سوال ہو گا ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا ہم کو موسیٰ بن عقبہ نے خبر دی ، انہیں نافع نے اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّكُمْ رَاعٍ، وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالأَمِيرُ رَاعٍ، وَالرَّجُلُ رَاعٍ عَلَى أَهْلِ بَيْتِهِ، وَالْمَرْأَةُ رَاعِيَةٌ عَلَى بَيْتِ زَوْجِهَا وَوَلَدِهِ، فَكُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4973,
                "hadithNumber": "5201",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) took an oath that he would not visit his wives for one month, and he sat in an upper room belonging to him. Then, on the twenty ninth day he came down. It was said, \"O Allah's Messenger (ﷺ)! You had taken an oath not to visit your wives for one month.\" He said, \"The (present) month is of twenty-nine days.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم اپنی ازواج مطہرات سے ایک مہینہ تک الگ رہے اور اپنے ایک بالاخانہ میں قیام کیا ۔ پھر آپ انتیس دن کے بعد گھر میں تشریف لائے تو کہا گیا کہ یا رسول اللہ ! آپ نے تو ایک مہینہ کے لئے عہد کیا تھا آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ مہینہ 29 کا ہے ۔",
                "urduNarrator": "ہم سے خالد نے مخلد نے بیان کیا ، انہوں نے کہا ہم سے سلیمان نے بیان کیا ، انہوں نے کہا کہ مجھ سے حمید نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، قَالَ حَدَّثَنِي حُمَيْدٌ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ آلَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ نِسَائِهِ شَهْرًا وَقَعَدَ فِي مَشْرُبَةٍ لَهُ فَنَزَلَ لِتِسْعٍ وَعِشْرِينَ فَقِيلَ يَا رَسُولَ اللَّهِ إِنَّكَ آلَيْتَ عَلَى شَهْرٍ‏.‏ قَالَ ‏ \"‏ إِنَّ الشَّهْرَ تِسْعٌ وَعِشْرُونَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {الرِّجَالُ قَوَّامُونَ عَلَى النِّسَاءِ بِمَا فَضَّلَ اللَّهُ بَعْضَهُمْ عَلَى بَعْضٍ} إِلَى قَوْلِهِ: {إِنَّ اللَّهَ كَانَ عَلِيًّا كَبِيرًا}",
                "headingUrdu": "\"مرد عورتوں کے محافظ اور محافظ ہیں۔\"",
                "headingEnglish": "\"Men are protectors and maintainers of women.\"",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4974,
                "hadithNumber": "5202",
                "englishNarrator": "Narrated Um Salama رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) took an oath that he would not enter upon some of his wives for one month. But when twenty nine days had elapsed, he went to them in the morning or evening. It was said to him, \"O Allah's Prophet! You had taken an oath that you would not enter upon them for one month.\" He replied, \"The month can be of twenty nine days.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ( ایک واقعہ کی وجہ سے ) قسم کھائی کہ اپنی بعض ازواج کے یہاں ایک مہینہ تک نہیں جائیں گے ۔ پھر جب انتیس دن گزر گئے تو آنحضرت صلی اللہ علیہ وسلم ان کے پاس صبح کے وقت گئے یا شام کے وقت آنحضرت صلی اللہ علیہ وسلم سے عرض کیا گیا کہ آپ نے تو قسم کھائی تھی کہ ایک مہینہ تک نہیں آئیں گے ؟ آپ نے فرمایا کہ مہینہ انتیس دن کا بھی ہوتا ہے ۔",
                "urduNarrator": "ہم سے ابو عاصم نے بیان کیا ، ان سے ابن جریج نے ( دوسری سند ) امام بخاری نے کہا اور مجھ سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو حضرت عبداللہ بن مبارک نے خبر دی ، انہیں ابن جریج نے خبر دی ، کہا کہ مجھے یحییٰ بن عبداللہ بن صیفی نے خبر دی ، انہیں عکرمہ بن عبدالرحمٰن بن حارث نے خبر دی اور انہیں حضرت ام سلمہ رضی اللہ عنہا نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ،‏.‏ وَحَدَّثَنِي مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي يَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ، أَنَّ عِكْرِمَةَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، أَخْبَرَهُ أَنَّ أُمَّ سَلَمَةَ أَخْبَرَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم حَلَفَ لاَ يَدْخُلُ عَلَى بَعْضِ أَهْلِهِ شَهْرًا، فَلَمَّا مَضَى تِسْعَةٌ وَعِشْرُونَ يَوْمًا غَدَا عَلَيْهِنَّ أَوْ رَاحَ فَقِيلَ لَهُ يَا نَبِيَّ اللَّهِ حَلَفْتَ أَنْ لاَ تَدْخُلَ عَلَيْهِنَّ شَهْرًا قَالَ ‏ \"‏ إِنَّ الشَّهْرَ يَكُونُ تِسْعَةً وَعِشْرِينَ يَوْمًا ‏\"‏‏.‏",
                "headingArabic": "هِجْرَةِ النَّبِيِّ صلى الله عليه وسلم نِسَاءَهُ فِي غَيْرِ بُيُوتِهِنَّ",
                "headingUrdu": "نبی صلی اللہ علیہ وسلم کا اپنی ازواج کے ساتھ بستر نہ بانٹنے اور دور رہنے کا فیصلہ",
                "headingEnglish": "The decision of the Prophet (saws) not to share the beds with his wives and to stay away",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4975,
                "hadithNumber": "5203",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "One morning we saw the wives of the Prophet (ﷺ) weeping, and everyone of them had her family with her, I went to the mosque and found that it was crowded with people. Then `Umar bin Al-Khattab came and went up to the Prophet (ﷺ) who was in his upper room. He greeted him but nobody answered. He greeted again, but nobody answered. Then the gatekeeper called him and he entered upon the Prophet, and asked, \"Have you divorced your wives?\" The Prophet, said, \"No, but I have taken an oath not to go to them for one month.\" So the Prophet (ﷺ) stayed away (from his wives) for twenty nine days and then entered upon them.",
                "hadithUrdu": "ایک دن صبح ہوئی تو نبی کریم صلی اللہ علیہ وسلم کی ازواج رو رہی تھیں ، پر زوجہ مطہرہ کے پاس ان کے گھر والے موجود تھے ۔ مسجد کی طرف گیا تو وہ بھی لوگوں سے بھری ہوئی تھی ۔ پھر عمر بن خطاب آئے اورنبی کریم صلی اللہ علیہ وسلم کی خدمت میں اوپر گئے تو آنحضرت صلی اللہ علیہ وسلم اس وقت ایک کمرہ میں تشریف رکھتے تھے ۔ انہوں نے سلام کیا لیکن کسی نے جواب نہیں دیا ۔ انہوں نے پھر سلام کیا لیکن کسی نے جواب نہیں دیا ۔ پھر سلام کیا اور اس مرتبہ بھی کسی نے جواب نہیں دیا تو آواز دی ( بعد میں اجازت ملنے پر ) آنحضرت صلی اللہ علیہ وسلم کی خدمت میں گئے اور عرض کیا کیا آنحضرت صلی اللہ علیہ وسلم نے اپنی ازواج کو طلاق دے دی ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں بلکہ ایک مہینہ تک ان سے الگ رہنے کی قسم کھائی ہے ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم انتیس دن تک الگ رہے اور پھر اپنے بیویوں کے پاس گئے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے مروان بن معاویہ نے ، کہا ہم سے ابو یعفور نے بیان کیا ، کہا کہ ہم سے ابو الضحیٰ کی مجلس میں ( مہینہ پر ) بحث کی تو انہوں نے بیان کیا کہ ہم سے ابن عباس رضی اللہ عنہما نے بیان کیا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا أَبُو يَعْفُورٍ، قَالَ تَذَاكَرْنَا عِنْدَ أَبِي الضُّحَى فَقَالَ حَدَّثَنَا ابْنُ عَبَّاسٍ، قَالَ أَصْبَحْنَا يَوْمًا وَنِسَاءُ النَّبِيِّ صلى الله عليه وسلم يَبْكِينَ، عِنْدَ كُلِّ امْرَأَةٍ مِنْهُنَّ أَهْلُهَا، فَخَرَجْتُ إِلَى الْمَسْجِدِ، فَإِذَا هُوَ مَلآنُ مِنَ النَّاسِ فَجَاءَ عُمَرُ بْنُ الْخَطَّابِ فَصَعِدَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ فِي غُرْفَةٍ لَهُ، فَسَلَّمَ فَلَمْ يُجِبْهُ أَحَدٌ، ثُمَّ سَلَّمَ فَلَمْ يُجِبْهُ أَحَدٌ، ثُمَّ سَلَّمَ فَلَمْ يُجِبْهُ أَحَدٌ، فَنَادَاهُ فَدَخَلَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ أَطَلَّقْتَ نِسَاءَكَ فَقَالَ ‏ \"‏ لاَ وَلَكِنْ آلَيْتُ مِنْهُنَّ شَهْرًا ‏\"‏‏.‏ فَمَكَثَ تِسْعًا وَعِشْرِينَ، ثُمَّ دَخَلَ عَلَى نِسَائِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4976,
                "hadithNumber": "5204",
                "englishNarrator": "Narrated `Abdullah bin Zam`a رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"None of you should flog his wife as he flogs a slave and then have sexual intercourse with her in the last part of the day.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم میں کوئی شخص اپنی بیوی کو غلاموں کی طرح نہ مارے کہ پھر دوسرے دن اس سے ہمبستر ہو گا ۔",
                "urduNarrator": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عبداللہ بن زمعہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَجْلِدُ أَحَدُكُمُ امْرَأَتَهُ جَلْدَ الْعَبْدِ، ثُمَّ يُجَامِعُهَا فِي آخِرِ الْيَوْمِ ‏\"‏‏.‏",
                "headingArabic": "مَا يُكْرَهُ مِنْ ضَرْبِ النِّسَاءِ وَقَوْلِهِ ‏{‏وَاضْرِبُوهُنَّ‏}‏ ضَرْبًا غَيْرَ مُبَرِّحٍ‏.‏",
                "headingUrdu": "خواتین کو مارنا نامنظور ہے۔",
                "headingEnglish": "The beating of women is disapproved",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4977,
                "hadithNumber": "5205",
                "englishNarrator": "Narrated `Aisha:",
                "hadithEnglish": "An Ansari woman gave her daughter in marriage and the hair of the latter started falling out. The Ansari women came to the Prophet (ﷺ) and mentioned that to him and said, \"Her (my daughter's) husband suggested that I should let her wear false hair.\" The Prophet (ﷺ) said, \"No, (don't do that) for Allah sends His curses upon such ladies who lengthen their hair artificially.\"",
                "hadithUrdu": "قبیلہ انصار کی ایک خاتون نے اپنی بیٹی کی شادی کی تھی ۔ اس کے بعد لڑکی کے سر کے بال بیماری کی وجہ سے اڑ گئے تو وہ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور آپ سے اس کا ذکر کیا اور کہا کہ اس کے شوہر نے اس سے کہا ہے کہ اپنے بالوں کے ساتھ ( دوسرے مصنوعی بال ) جوڑے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ ایسا تو ہرگز مت کرکیونکہ مصنوعی با ل سر پر رکھ کے جو جوڑے تو ایسے بال جوڑنے والیوں پر لعنت کی گئی ہے ۔",
                "urduNarrator": "ہم سے خلاد بن یحییٰ نے بیان کیا ، کہا ہم سے ابراہیم بن نافع نے ، ان سے حسن نے وہ مسلم کے صاحبزادے ہیں ، ان سے صفیہ رضی اللہ عنہا نے ، ان سے عائشہ نے کہ",
                "hadithArabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ، عَنِ الْحَسَنِ ـ هُوَ ابْنُ مُسْلِمٍ ـ عَنْ صَفِيَّةَ، عَنْ عَائِشَةَ، أَنَّ امْرَأَةً، مِنَ الأَنْصَارِ زَوَّجَتِ ابْنَتَهَا فَتَمَعَّطَ شَعَرُ رَأْسِهَا، فَجَاءَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم فَذَكَرَتْ ذَلِكَ لَهُ، فَقَالَتْ إِنَّ زَوْجَهَا أَمَرَنِي أَنْ أَصِلَ فِي شَعَرِهَا‏.‏ فَقَالَ ‏ \"‏ لاَ إِنَّهُ قَدْ لُعِنَ الْمُوصِلاَتُ ‏\"‏‏.‏",
                "headingArabic": "لاَ تُطِيعُ الْمَرْأَةُ زَوْجَهَا فِي مَعْصِيَةٍ",
                "headingUrdu": "اگر شوہر کسی گناہ کا حکم دے تو اس کی اطاعت نہ کرنا",
                "headingEnglish": "Not to obey the husband if he orders to do something sinful",
                "chapterId": "68",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 68,
                    "chapterNumber": "68",
                    "chapterEnglish": "Wedlock, Marriage (Nikaah)",
                    "chapterUrdu": "نکاح کے مسائل کا بیان",
                    "chapterArabic": "كتاب النكاح",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 4951,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=198",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=196",
                "label": "196",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=197",
                "label": "197",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=198",
                "label": "198",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=199",
                "label": "199",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=200",
                "label": "200",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=201",
                "label": "201",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=202",
                "label": "202",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=200",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=200",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=198",
        "to": 4975,
        "total": 40465
    }
}