{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 160,
        "data": [
            {
                "id": 3978,
                "hadithNumber": "4167",
                "englishNarrator": "Narrated `Abbad bin Tamim:",
                "hadithEnglish": "When it was the day (of the battle) of Al-Harra the people were giving Pledge of allegiance to `Abdullah bin Hanzala رضی اللہ عنہ . Ibn Zaid said, \"For what are the people giving Pledge of allegiance to `Abdullah bin Hanzala?\" It was said to him, \"For death.\" Ibn Zaid said, \"I will never give the Pledge of allegiance for that to anybody else after Allah's Messenger (ﷺ) .\" Ibn Zaid was one of those who had witnessed the day of Al-Hudaibiya with the Prophet.",
                "hadithUrdu": "حرہ کی لڑائی میں لوگ عبداللہ بن حنظلہ رضی اللہ عنہ کے ہاتھ پر بیعت کر رہے تھے۔ عبداللہ بن زید نے پوچھا کہ ابن حنظلہ سے کس بات پر بیعت کی جا رہی ہے؟ تو لوگوں نے بتایا کہ موت پر۔ ابن زید نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کے بعد اب میں کسی سے بھی موت پر بیعت نہیں کروں گا۔ وہ آپ صلی اللہ علیہ وسلم کے ساتھ غزوہ حدیبیہ میں شریک تھے۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ ان سے ان کے بھائی عبدالحمید نے ‘ ان سے سلیمان بن بلال نے ‘ ان سے عمرو بن یحییٰ نے اور ان سے عباد بن تمیم نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَخِيهِ، عَنْ سُلَيْمَانَ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ عَبَّادِ بْنِ تَمِيمٍ، قَالَ لَمَّا كَانَ يَوْمُ الْحَرَّةِ وَالنَّاسُ يُبَايِعُونَ لِعَبْدِ اللَّهِ بْنِ حَنْظَلَةَ فَقَالَ ابْنُ زَيْدٍ عَلَى مَا يُبَايِعُ ابْنُ حَنْظَلَةَ النَّاسَ قِيلَ لَهُ عَلَى الْمَوْتِ‏.‏ قَالَ لاَ أُبَايِعُ عَلَى ذَلِكَ أَحَدًا بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَكَانَ شَهِدَ مَعَهُ الْحُدَيْبِيَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3979,
                "hadithNumber": "4168",
                "englishNarrator": "Narrated Iyas bin Salama bin Al-Akwa`:",
                "hadithEnglish": "My father who was amongst those who had given the Pledge of allegiance to the Prophet (ﷺ) beneath the Tree, said to me, \"We used to offer the Jumua prayer with the Prophet (ﷺ) and then depart at a time when the walls had no shade for us to take shelter in.\"",
                "hadithUrdu": "میرے والد نے بیان کیا ‘ وہ اصحاب شجرہ میں سے تھے ‘ انہوں نے بیان کیا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جمعہ کی نماز پڑھ کر واپس ہوئے تو دیواروں کا سایہ ابھی اتنا نہیں ہوا تھا کہ ہم اس میں آرام کر سکیں۔",
                "urduNarrator": "ہم سے یحییٰ بن یعلیٰ محاربی نے بیان کیا ‘ کہا مجھ سے میرے والد نے بیان کیا ‘ ان سے ایاس بن سلمہ بن اکوع نے بیان کیا ‘ کہا کہ مجھ سے",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَعْلَى الْمُحَارِبِيُّ، قَالَ حَدَّثَنِي أَبِي، حَدَّثَنَا إِيَاسُ بْنُ سَلَمَةَ بْنِ الأَكْوَعِ، قَالَ حَدَّثَنِي ـ أَبِي وَكَانَ، مِنْ أَصْحَابِ الشَّجَرَةِ ـ قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صلى الله عليه وسلم الْجُمُعَةَ ثُمَّ نَنْصَرِفُ، وَلَيْسَ لِلْحِيطَانِ ظِلٌّ نَسْتَظِلُّ فِيهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3980,
                "hadithNumber": "4169",
                "englishNarrator": "Narrated Yazid bin Abi Ubaid:",
                "hadithEnglish": "I said to Salama bin Al-Akwa` رضی اللہ عنہ , \"For what did you give the Pledge of allegiance to Allah's Messenger (ﷺ) on the day of Al-Hudaibiya?\" He replied, \"For death (in the Cause of Islam.).",
                "hadithUrdu": "میں نے سلمہ بن اکوع رضی اللہ عنہ سے پوچھا کہ صلح حدیبیہ کے موقع پر آپ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے کس چیز پر بیعت کی تھی؟ انہوں نے بتلایا کہ موت پر۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا کہ ہم سے حاتم بن اسماعیل نے بیان کیا ‘ ان سے یزید بن ابی عبید نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، قَالَ قُلْتُ لِسَلَمَةَ بْنِ الأَكْوَعِ عَلَى أَىِّ شَىْءٍ بَايَعْتُمْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَوْمَ الْحُدَيْبِيَةِ‏.‏ قَالَ عَلَى الْمَوْتِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3981,
                "hadithNumber": "4170",
                "englishNarrator": "Narrated Al-Musaiyab:",
                "hadithEnglish": "I met Al-Bara bin `Azib رضی اللہ عنہ and said (to him). \"May you live prosperously! You enjoyed the company of the Prophet (ﷺ) and gave him the Pledge of allegiance (of Al-Hudaibiya) under the Tree.\" On that, Al- Bara' said, \"O my nephew! You do not know what we have done after him (i.e. his death).",
                "hadithUrdu": "میں براء بن عازب رضی اللہ عنہ کی خدمت میں حاضر ہوا اور عرض کیا ‘ مبارک ہو! آپ کو نبی کریم صلی اللہ علیہ وسلم کی خدمت نصیب ہوئی اور نبی کریم صلی اللہ علیہ وسلم سے آپ نے شجر ( درخت ) کے نیچے بیعت کی۔ انہوں نے کہا بیٹے! تمہیں معلوم نہیں کہ ہم نے نبی کریم صلی اللہ علیہ وسلم کے بعد کیا کیا کام کئے ہیں۔",
                "urduNarrator": "مجھ سے احمد بن اشکاب نے بیان کیا ‘ کہا ہم سے محمد بن فضیل نے بیان کیا ‘ ان سے علاء بن مسیب نے ‘ ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ إِشْكَابٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنِ الْعَلاَءِ بْنِ الْمُسَيَّبِ، عَنْ أَبِيهِ، قَالَ لَقِيتُ الْبَرَاءَ بْنَ عَازِبٍ ـ رضى الله عنهما ـ فَقُلْتُ طُوبَى لَكَ صَحِبْتَ النَّبِيَّ صلى الله عليه وسلم وَبَايَعْتَهُ تَحْتَ الشَّجَرَةِ‏.‏ فَقَالَ يَا ابْنَ أَخِي إِنَّكَ لاَ تَدْرِي مَا أَحْدَثْنَا بَعْدَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3982,
                "hadithNumber": "4171",
                "englishNarrator": "Narrated Thabit bin Ad-Dahhak رضی اللہ عنہ :",
                "hadithEnglish": "He was one of those who had given the Pledge of allegiance (of Al-Hudaibiya) beneath the Tree.",
                "hadithUrdu": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے درخت کے نیچے بیعت کی تھی۔",
                "urduNarrator": "ہم سے اسحاق نے بیان کیا ‘ کہا ہم سے یحییٰ بن صالح نے بیان کیا ‘ کہا ہم سے معاویہ نے بیان کیا ‘ وہ سلام کے بیٹے ہیں ‘ ان سے یحییٰ نے ‘ ان سے ابوقلابہ نے اور انہیں ثابت بن ضحاک رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، قَالَ حَدَّثَنَا مُعَاوِيَةُ ـ هُوَ ابْنُ سَلاَّمٍ ـ عَنْ يَحْيَى، عَنْ أَبِي قِلاَبَةَ، أَنَّ ثَابِتَ بْنَ الضَّحَّاكِ، أَخْبَرَهُ أَنَّهُ، بَايَعَ النَّبِيَّ صلى الله عليه وسلم تَحْتَ الشَّجَرَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3983,
                "hadithNumber": "4172",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "regarding Allah's Statement: \"Verily! We have granted you (O, Muhammad) Manifest victory.\" (48.1) It refers to the Al-Hudaibiya Pledge. And the companions of the Prophet (ﷺ) said (to the Prophet), \"Congratulations and happiness for you; but what reward shall we get?\" So Allah revealed:-- \"That He may admit the believing men and women to gardens beneath which rivers flow.\" (48.5) Shobah says: I went to Koufah and narrated the complete Hadith to Hadrat Qatadah. When I came back and mentioned it to him, he said: This interpretation of ''إنا فتحنا لك'' is reported from Hadrat Anas رضی اللہ عنہ nd as for ''هنيئا مريئا'' , it is reported from Ikrimah.",
                "hadithUrdu": "( آیت ) «إنا فتحنا لك فتحا مبينا‏» ”بیشک ہم نے تمہیں کھلی ہوئی فتح دی۔“ یہ فتح صلح حدیبیہ تھی۔ صحابہ رضی اللہ عنہم نے عرض کیا: نبی کریم صلی اللہ علیہ وسلم کے لیے تو مرحلہ آسان ہے ( کہ آپ کی تمام اگلی اور پچھلی لغزشیں معاف ہو چکی ہیں ) لیکن ہمارا کیا ہو گا؟ اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی «ليدخل المؤمنين والمؤمنات جنات‏» ”اس لیے کہ مومن مرد اور مومن عورتیں جنت میں داخل کی جائیں گی جس کے نیچے نہریں جاری ہوں گی۔“ شعبہ نے بیان کیا کہ پھر میں کوفہ آیا اور میں قتادہ سے پورا واقعہ بیان کیا ‘ پھر میں دوبارہ قتادہ کی خدمت میں حاضر ہوا اور ان کے سامنے اس کا ذکر کیا تو انہوں نے کہا کہ «إنا فتحنا لك‏» ”بیشک ہم نے تمہیں کھلی فتح دی ہے۔“ کی تفسیر تو انس رضی اللہ عنہ سے روایت ہے لیکن اس کے بعد «هنيئا مريئا» ( یعنی آپ صلی اللہ علیہ وسلم کے لیے تو ہر مرحلہ آسان ہے ) یہ تفسیر عکرمہ سے منقول ہے۔",
                "urduNarrator": "مجھ سے احمد بن اسحاق نے بیان کیا ‘ کہا ہم سے عثمان بن عمر نے بیان کیا ‘ کہا ہم کو شعبہ نے خبر دی ‘ انہیں قتادہ نے اور انہیں انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ إِسْحَاقَ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ‏{‏إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا‏}‏ قَالَ الْحُدَيْبِيَةُ‏.‏ قَالَ أَصْحَابُهُ هَنِيئًا مَرِيئًا فَمَا لَنَا فَأَنْزَلَ اللَّهُ ‏{‏لِيُدْخِلَ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ جَنَّاتٍ‏}‏ قَالَ شُعْبَةُ فَقَدِمْتُ الْكُوفَةَ فَحَدَّثْتُ بِهَذَا كُلِّهِ عَنْ قَتَادَةَ ثُمَّ رَجَعْتُ فَذَكَرْتُ لَهُ فَقَالَ أَمَّا ‏{‏إِنَّا فَتَحْنَا لَكَ‏}‏ فَعَنْ أَنَسٍ، وَأَمَّا هَنِيئًا مَرِيئًا فَعَنْ عِكْرِمَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3984,
                "hadithNumber": "4173",
                "englishNarrator": "Narrated Zahir Al-Aslami:",
                "hadithEnglish": "(who was one of those who had witnessed (the Pledge of allegiance beneath) the Tree) While I was making fire beneath the cooking pots containing donkey's meat, the announcer of Allah's Messenger (ﷺ) announced, \"Allah's Messenger (ﷺ) forbids you to eat donkey's meat.\"",
                "hadithUrdu": "وہ بیعت رضوان میں شریک تھے۔ انہوں نے بیان کیا کہ میں ہانڈی میں گدھے کا گوشت ابال رہا تھا کہ رسول اللہ صلی اللہ علیہ وسلم کے ایک منادی نے رسول اللہ صلی اللہ علیہ وسلم کی طرف سے اعلان کیا کہ رسول اللہ صلی اللہ علیہ وسلم تمہیں گدھے کے گوشت کے کھانے سے منع فرماتے ہیں۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ‘ کہا ہم سے ابوعامر عقدی نے بیان کیا ‘ کہا ہم سے اسرائیل بن یونس نے بیان کیا ‘ ان سے مجزاۃ بن زاہر اسلمی نے اور ان سے ان کے والد زاہر بن اسود رضی اللہ عنہ نے بیان کیا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ مَجْزَأَةَ بْنِ زَاهِرٍ الأَسْلَمِيِّ، عَنْ أَبِيهِ ـ وَكَانَ مِمَّنْ شَهِدَ الشَّجَرَةَ ـ قَالَ إِنِّي لأُوقِدُ تَحْتَ الْقِدْرِ بِلُحُومِ الْحُمُرِ إِذْ نَادَى مُنَادِي رَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَاكُمْ عَنْ لُحُومِ الْحُمُرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3985,
                "hadithNumber": "4174",
                "englishNarrator": "Hadrat Majzah reports that:",
                "hadithEnglish": "A holy elder who was amongst the people of the tree whose name was Uhban bin Aus رضی اللہ عنہ , had got a pain in knee, so when he would prostrate himself, he would place a pillow beneath his knee.",
                "hadithUrdu": "جو بیعت رضوان میں شریک تھے اور جن کا نام اہبان بن اوس رضی اللہ عنہ تھا ‘ نقل کیا کہ ان کے ایک گھٹنے میں تکلیف تھی ‘ اس لیے جب وہ سجدہ کرتے تو اس گھٹنے کے نیچے کوئی نرم تکیہ رکھ لیتے تھے۔",
                "urduNarrator": "اور مجزاۃ نے اپنے ہی قبیلہ کے ایک صحابی کے متعلق",
                "hadithArabic": "وَعَنْ مَجْزَأَةَ، عَنْ رَجُلٍ، مِنْهُمْ مِنْ أَصْحَابِ الشَّجَرَةِ اسْمُهُ أُهْبَانُ بْنُ أَوْسٍ وَكَانَ اشْتَكَى رُكْبَتَهُ، وَكَانَ إِذَا سَجَدَ جَعَلَ تَحْتَ رُكْبَتِهِ وِسَادَةً‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3986,
                "hadithNumber": "4175",
                "englishNarrator": "Narrated Suwaid bin An-Nu`man رضی اللہ عنہ :",
                "hadithEnglish": "who was one of those who witnessed (the Pledge of allegiance beneath) the Tree: Allah's Messenger (ﷺ) and his companions were given Sawiq and they chewed it. Moadh has also reported the same from Shobah.",
                "hadithUrdu": "گویا اب بھی وہ منظر میری آنکھوں کے سامنے ہے جب رسول اللہ صلی اللہ علیہ وسلم اور آپ کے صحابہ رضی اللہ عنہم کے سامنے ستو لایا گیا۔ جسے ان حضرات نے پیا۔ اس روایت کی متابعت معاذ نے شعبہ سے کی ہے۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ‘ کہا ہم سے ابن ابی عدی نے ‘ ان سے شعبہ نے ان سے یحییٰ بن سعید نے ‘ ان سے بشیر بن یسار نے اور ان سے سوید بن نعمان رضی اللہ عنہ نے بیان کیا ‘ وہ بیعت رضوان میں شریک تھے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، عَنْ سُوَيْدِ بْنِ النُّعْمَانِ ـ وَكَانَ مِنْ أَصْحَابِ الشَّجَرَةِ ـ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَصْحَابُهُ أُتُوا بِسَوِيقٍ فَلاَكُوهُ‏.‏ تَابَعَهُ مُعَاذٌ عَنْ شُعْبَةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3987,
                "hadithNumber": "4176",
                "englishNarrator": "Narrated Abu Jamra:",
                "hadithEnglish": "I asked Aidh bin `Amr رضی اللہ عنہ, who was one of the companions of the Prophet (ﷺ) one of those (who gave the allegiance to the Prophet (ﷺ) the Tree: \"Can the witr prayer be repeated (in one night)?\" He said, \"If you have offered it in the first part of the night, you should not repeat it in the last part 'of the night.\" (See Fath-ul-Bari page 458 Vol 8th).",
                "hadithUrdu": "انہوں نے عائذ بن عمرو رضی اللہ عنہ سے پوچھا: وہ نبی کریم صلی اللہ علیہ وسلم کے صحابی تھے اور بیعت رضوان میں شریک تھے کہ کیا وتر کی نماز ( ایک رکعت اور پڑھ کر ) توڑی جا سکتی ہے؟ انہوں نے کہا کہ اگر شروع رات میں تو نے وتر پڑھ لیا ہو تو آخر رات میں نہ پڑھو۔",
                "urduNarrator": "ہم سے محمد بن حاتم بن زریع نے بیان کیا ‘ کہا ہم سے شاذان (اسود بن عامر) نے ‘ ان سے شعبہ نے ‘ ان سے ابوجَمْرَہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ، حَدَّثَنَا شَاذَانُ، عَنْ شُعْبَةَ، عَنْ أَبِي جَمْرَةَ، قَالَ سَأَلْتُ عَائِذَ بْنَ عَمْرٍو ـ رضى الله عنه ـ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْ أَصْحَابِ الشَّجَرَةِ هَلْ يُنْقَضُ الْوِتْرُ قَالَ إِذَا أَوْتَرْتَ مِنْ أَوَّلِهِ، فَلاَ تُوتِرْ مِنْ آخِرِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3988,
                "hadithNumber": "4177",
                "englishNarrator": "Narrated Zaid bin Aslam reports from his father:",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) was proceeding at night on one of his journeys and `Umar bin Al- Khattab رضی اللہ عنہ was going along with him. `Umar bin Al-Khattab رضی اللہ عنہ asked him (about something) but Allah's Apostle did not answer him. `Umar رضی اللہ عنہ asked him again, but he did not answer him. He asked him again (for the third time) but he did not answer him. On that `Umar bin Al-Khattab رضی اللہ عنہ addressed himself saying, \"May your mother be bereaved of you, O `Umar, for you have asked Allah's Messenger (ﷺ) thrice, yet he has not answered you.\" `Umar رضی اللہ عنہ said, \"Then I made my camel run fast and took it in front of the other Muslims, and I was afraid that something might be revealed in my connection. I had hardly waited for a moment when I heard somebody calling me. I said, 'I was afraid that something might have been revealed about me.' Then I came to Allah's Messenger (ﷺ) and greeted him. He (i.e. the Prophet) said, 'Tonight there has been revealed to me, a Sura which is dearer to me than (all the world) on which the sun rises,' and then he recited: 'Verily! We have granted you (O Muhammad) A manifest victory.\" (48.1)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کسی سفر یعنی ( سفر حدیبیہ ) میں تھے، رات کا وقت تھا اور عمر بن خطاب رضی اللہ عنہ آپ کے ساتھ ساتھ تھے۔ عمر رضی اللہ عنہ نے آپ سے کچھ پوچھا لیکن ( اس وقت آپ وحی میں مشغول تھے ‘ عمر رضی اللہ عنہ کو خبر نہ تھی ) آپ نے کوئی جواب نہیں دیا۔ انہوں نے پھر پوچھا ‘ آپ نے پھر کوئی جواب نہیں دیا۔ انہوں نے پھر پوچھا ‘ آپ نے اس مرتبہ بھی کوئی جواب نہیں دیا۔ اس پر عمر رضی اللہ عنہ نے ( اپنے دل میں ) کہا: عمر! تیری ماں تجھ پر روئے ‘ رسول اللہ صلی اللہ علیہ وسلم سے تم نے تین مرتبہ سوال کیا ‘ آپ صلی اللہ علیہ وسلم نے تمہیں ایک مرتبہ بھی جواب نہیں دیا۔ عمر رضی اللہ عنہ نے بیان کیا کہ پھر میں نے اپنے اونٹ کو ایڑ لگائی اور مسلمانوں سے آگے نکل گیا۔ مجھے ڈر تھا کہ کہیں میرے بارے میں کوئی وحی نہ نازل ہو جائے۔ ابھی تھوڑی دیر ہوئی تھی کہ میں نے سنا ‘ ایک شخص مجھے آواز دے رہا تھا۔ انہوں نے بیان کیا کہ میں نے سوچا کہ میں تو پہلے ہی ڈر رہا تھا کہ میرے بارے میں کہیں کوئی وحی نازل نہ ہو جائے۔ پھر میں آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ کو سلام کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ رات مجھ پر ایک سورت نازل ہوئی ہے اور وہ مجھے اس تمام کائنات سے زیادہ عزیز ہے جس پر سورج طلوع ہوتا ہے۔ پھر آپ نے سورۃ «إنا فتحنا لك فتحا مبينا‏» ”بیشک ہم نے آپ کو کھلی ہوئی فتح دی ہے۔“ کی تلاوت فرمائی۔",
                "urduNarrator": "مجھ سے عبداللہ بن یوسف نے بیان کیا ‘ کہا ہم کو امام مالک نے خبر دی ‘ انہیں زید بن اسلم نے اور انہیں ان کے والد اسلم نے کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَسِيرُ فِي بَعْضِ أَسْفَارِهِ، وَعُمَرُ بْنُ الْخَطَّابِ يَسِيرُ مَعَهُ لَيْلاً، فَسَأَلَهُ عُمَرُ بْنُ الْخَطَّابِ عَنْ شَىْءٍ فَلَمْ يُجِبْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ سَأَلَهُ فَلَمْ يُجِبْهُ، ثُمَّ سَأَلَهُ فَلَمْ يُجِبْهُ وَقَالَ عُمَرُ بْنُ الْخَطَّابِ ثَكِلَتْكَ أُمُّكَ يَا عُمَرُ، نَزَرْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم ثَلاَثَ مَرَّاتٍ، كُلُّ ذَلِكَ لاَ يُجِيبُكَ‏.‏ قَالَ عُمَرُ فَحَرَّكْتُ بَعِيرِي ثُمَّ تَقَدَّمْتُ أَمَامَ الْمُسْلِمِينَ، وَخَشِيتُ أَنْ يَنْزِلَ فِيَّ قُرْآنٌ، فَمَا نَشِبْتُ أَنْ سَمِعْتُ صَارِخًا يَصْرُخُ بِي ـ قَالَ ـ فَقُلْتُ لَقَدْ خَشِيتُ أَنْ يَكُونَ نَزَلَ فِيَّ قُرْآنٌ‏.‏ وَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَلَّمْتُ عَلَيْهِ فَقَالَ ‏\"‏ لَقَدْ أُنْزِلَتْ عَلَىَّ اللَّيْلَةَ سُورَةٌ لَهِيَ أَحَبُّ إِلَىَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ، ثُمَّ قَرَأَ ‏{‏إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا‏}‏‏.‏‏\"‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3989,
                "hadithNumber": "4178, 4179",
                "englishNarrator": "Narrated Al-Miswar bin Makhrama رضی اللہ عنہ and Marwan bin Al-Hakam:",
                "hadithEnglish": "(one of them said more than his friend) The Prophet (ﷺ) set out in the company of more than one thousand of his companions in the year of Al-Hudaibiya, and when he reached Dhul-Hulaifa, he garlanded his Hadi (i.e. sacrificing animal), assumed the state of Ihram for `Umra from that place and sent a spy of his from Khuzi'a (tribe). The Prophet (ﷺ) proceeded on till he reached (a village called) Ghadir-al-Ashtat. There his spy came and said, \"The Quraish (infidels) have collected a great number of people against you, and they have collected against you the Ethiopians, and they will fight with you, and will stop you from entering the Ka`ba and prevent you.\" The Prophet (ﷺ) said, \"O people! Give me your opinion. Do you recommend that I should destroy the families and offspring of those who want to stop us from the Ka`ba? If they should come to us (for peace) then Allah will destroy a spy from the pagans, or otherwise we will leave them in a miserable state.\" On that Abu Bakr رضی اللہ عنہ said, \"O Allah Apostle! You have come with the intention of visiting this House (i.e. Ka`ba) and you do not want to kill or fight anybody. So proceed to it, and whoever should stop us from it, we will fight him.\" On that the Prophet (ﷺ) said, \"Proceed on, in the Name of Allah!\"",
                "hadithUrdu": "ان میں سے ہر ایک دوسرے سے کچھ بڑھاتا ہے۔ انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم صلح حدیبیہ کے موقع پر تقریباً ایک ہزار صحابہ کو ساتھ لے کر روانہ ہوئے۔ پھر جب آپ ذو الحلیفہ پہنچے تو آپ نے قربانی کے جانور کو قلادہ پہنایا اور اس پر نشان لگایا اور وہیں سے عمرہ کا احرام باندھا۔ پھر آپ نے قبیلہ خزاعہ کے ایک صحابی کو جاسوسی کے لیے بھیجا اور خود بھی سفر جاری رکھا۔ جب آپ غدیر الاشطاط پر پہنچے تو آپ کے جاسوس بھی خبریں لے کر آ گئے۔ جنہوں نے بتایا کہ قریش نے آپ کے مقابلے کے لیے بہت بڑا لشکر تیار کر رکھا ہے اور بہت سے قبائل کو بلایا ہے۔ وہ آپ سے جنگ کرنے پر تلے ہوئے ہیں اور آپ کو بیت اللہ سے روکیں گے۔ اس پر نبی کریم صلی اللہ علیہ وسلم نے صحابہ سے فرمایا کہ مجھے مشورہ دو کیا تمہارے خیال میں یہ مناسب ہو گا کہ میں ان کفار کی عورتوں اور بچوں پر حملہ کر دوں جو ہمارے بیت اللہ تک پہنچنے میں رکاوٹ بننا چاہتے ہیں؟ اگر انہوں نے ہمارا مقابلہ کیا تو اللہ عزوجل نے مشرکین سے ہمارے جاسوس کو محفوظ رکھا ہے اور اگر وہ ہمارے مقابلے پر نہیں آتے تو ہم انہیں ایک ہاری ہوئی قوم جان کر چھوڑ دیں گے۔ ابوبکر رضی اللہ عنہ نے کہا کہ یا رسول اللہ! آپ تو صرف بیت اللہ کے عمرہ کے لیے نکلے ہیں نہ آپ کا ارادہ کسی کو قتل کرنے کا ہے اور نہ کسی سے لڑائی کا۔ اس لیے آپ بیت اللہ تشریف لے چلیں۔ اگر ہمیں پھر بھی کوئی بیت اللہ تک جانے سے روکے گا تو ہم اس سے جنگ کریں گے۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ پھر اللہ کا نام لے کر سفر جاری رکھو۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ کہا کہ جب زہری نے یہ حدیث بیان کی ( جو آگے مذکور ہوئی ہے ) تو اس میں سے کچھ میں نے یاد رکھی اور معمر نے اس کو اچھی طرح یاد دلایا۔ ان سے عروہ بن زبیر نے ‘ ان سے مسور بن مخرمہ رضی اللہ عنہ اور مروان بن حکم نے بیان کیا ‘",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، حِينَ حَدَّثَ هَذَا الْحَدِيثَ،، حَفِظْتُ بَعْضَهُ، وَثَبَّتَنِي مَعْمَرٌ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، وَمَرْوَانَ بْنِ الْحَكَمِ، يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِ قَالاَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم عَامَ الْحُدَيْبِيَةِ فِي بِضْعَ عَشْرَةَ مِائَةً مِنْ أَصْحَابِهِ، فَلَمَّا أَتَى ذَا الْحُلَيْفَةِ قَلَّدَ الْهَدْىَ، وَأَشْعَرَهُ، وَأَحْرَمَ مِنْهَا بِعُمْرَةٍ، وَبَعَثَ عَيْنًا لَهُ مِنْ خُزَاعَةَ، وَسَارَ النَّبِيُّ صلى الله عليه وسلم حَتَّى كَانَ بِغَدِيرِ الأَشْطَاطِ، أَتَاهُ عَيْنُهُ قَالَ إِنَّ قُرَيْشًا جَمَعُوا لَكَ جُمُوعًا، وَقَدْ جَمَعُوا لَكَ الأَحَابِيشَ، وَهُمْ مُقَاتِلُوكَ وَصَادُّوكَ عَنِ الْبَيْتِ وَمَانِعُوكَ‏.‏ فَقَالَ ‏\"‏ أَشِيرُوا أَيُّهَا النَّاسُ عَلَىَّ، أَتَرَوْنَ أَنْ أَمِيلَ إِلَى عِيَالِهِمْ وَذَرَارِيِّ هَؤُلاَءِ الَّذِينَ يُرِيدُونَ أَنْ يَصُدُّونَا عَنِ الْبَيْتِ، فَإِنْ يَأْتُونَا كَانَ اللَّهُ عَزَّ وَجَلَّ قَدْ قَطَعَ عَيْنًا مِنَ الْمُشْرِكِينَ، وَإِلاَّ تَرَكْنَاهُمْ مَحْرُوبِينَ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ، خَرَجْتَ عَامِدًا لِهَذَا الْبَيْتِ، لاَ تُرِيدُ قَتْلَ أَحَدٍ وَلاَ حَرْبَ أَحَدٍ، فَتَوَجَّهْ لَهُ، فَمَنْ صَدَّنَا عَنْهُ قَاتَلْنَاهُ‏.‏ قَالَ ‏\"‏ امْضُوا عَلَى اسْمِ اللَّهِ ‏\"‏‏.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3990,
                "hadithNumber": "4180, 4181",
                "englishNarrator": "Narrated `Urwa bin Az-Zubair:",
                "hadithEnglish": "He heard Marwan bin Al-Hakam and Al-Miswar bin Makhrama رضی اللہ عنہما relating one of the events that happened to Allah's Messenger (ﷺ) in the `Umra of Al-Hudaibiya. They said, \"When Allah's Messenger (ﷺ) concluded the truce with Suhail bin `Amr on the day of Al-Hudaibiya, one of the conditions which Suhail bin `Amr stipulated, was his saying (to the Prophet), \"If anyone from us (i.e. infidels) ever comes to you, though he has embraced your religion, you should return him to us, and should not interfere between us and him.\" Suhail refused to conclude the truce with Allah's Messenger (ﷺ) except on this condition. The believers disliked this condition and got disgusted with it and argued about it. But when Suhail refused to conclude the truce with Allah's Messenger (ﷺ) except on that condition, Allah's Apostle concluded it. Accordingly, Allah's Messenger (ﷺ) then returned Abu Jandal bin Suhail to his father, Suhail bin `Amr, and returned every man coming to him from them during that period even if he was a Muslim. The believing women Emigrants came (to Medina) and Um Kulthum, the daughter of `Uqba bin Abi Mu'ait was one of those who came to Allah's Messenger (ﷺ) and she was an adult at that time. Her relatives came, asking Allah's Messenger (ﷺ) to return her to them, and in this connection, Allah revealed the Verses dealing with the believing (women).",
                "hadithUrdu": "انہوں نے مروان بن حکم اور مسور بن مخرمہ رضی اللہ عنہما سے سنا ‘ دونوں راویوں نے رسول اللہ صلی اللہ علیہ وسلم سے عمرہ حدیبیہ کے بارے میں بیان کیا تو عروہ نے مجھے اس میں جو کچھ خبر دی تھی ‘ اس میں یہ بھی تھا کہ جب نبی کریم صلی اللہ علیہ وسلم اور ( قریش کا نمائندہ ) سہیل بن عمرو حدیبیہ میں ایک مقررہ مدت تک کے لیے صلح کی دستاویز لکھ رہے تھے اور اس میں سہیل نے یہ شرط بھی رکھی تھی کہ ہمارا اگر کوئی آدمی آپ کے یہاں پناہ لے خواہ وہ آپ کے دین پر ہی کیوں نہ ہو جائے تو آپ کو اسے ہمارے حوالے کرنا ہی ہو گا تاکہ ہم اس کے ساتھ جو چاہیں کریں۔ سہیل اس شرط پر اڑ گیا اور کہنے لگا کہ نبی کریم صلی اللہ علیہ وسلم اس شرط کو قبول کر لیں اور مسلمان اس شرط پر کسی طرح راضی نہ تھے۔ مجبوراً انہوں نے اس پر گفتگو کی ( کہا یہ کیونکر ہو سکتا ہے کہ مسلمان کو کافر کے سپرد کر دیں ) سہیل نے کہا کہ یہ نہیں ہو سکتا تو صلح بھی نہیں ہو سکتی۔ نبی کریم صلی اللہ علیہ وسلم نے یہ شرط بھی تسلیم کر لی اور ابوجندل بن سہیل رضی اللہ عنہ کو ان کے والد سہیل بن عمرو کے سپرد کر دیا ( جو اسی وقت مکہ سے فرار ہو کر بیڑی کو گھسیٹتے ہوئے مسلمانوں کے پاس پہنچے تھے ) ( شرط کے مطابق مدت صلح میں مکہ سے فرار ہو کر ) جو بھی آتا نبی کریم صلی اللہ علیہ وسلم اسے واپس کر دیتے ‘ خواہ وہ مسلمان ہی کیوں نہ ہوتا۔ اس مدت میں بعض مومن عورتیں بھی ہجرت کر کے مکہ سے آئیں۔ ام کلثوم بنت عقبہ ابن ابی معیط بھی ان میں سے ہیں جو اس مدت میں نبی کریم صلی اللہ علیہ وسلم کے پاس آئی تھیں ‘ وہ اس وقت نوجوان تھیں ‘ ان کے گھر والے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ سے مطالبہ کیا کہ انہیں واپس کر دیں۔ اس پر اللہ تعالیٰ نے مومن عورتوں کے بارے میں وہ آیت نازل کی جو شرط کے مناسب تھی۔",
                "urduNarrator": "مجھ سے اسحاق بن راہویہ نے بیان کیا ‘ کہا ہم کو یعقوب بن ابراہیم نے خبر دی ‘ کہا کہ مجھ سے میرے بھتیجے ابن شہاب نے بیان کیا ‘ ان سے ان کے چچا محمد بن مسلم بن شہاب نے کہا کہ مجھ کو عروہ بن زبیر نے خبر دی اور",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا يَعْقُوبُ، حَدَّثَنِي ابْنُ أَخِي ابْنِ شِهَابٍ، عَنْ عَمِّهِ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّهُ سَمِعَ مَرْوَانَ بْنَ الْحَكَمِ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، يُخْبِرَانِ خَبَرًا مِنْ خَبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي عُمْرَةِ الْحُدَيْبِيَةِ فَكَانَ فِيمَا أَخْبَرَنِي عُرْوَةُ عَنْهُمَا أَنَّهُ لَمَّا كَاتَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم سُهَيْلَ بْنَ عَمْرٍو، يَوْمَ الْحُدَيْبِيَةِ عَلَى قَضِيَّةِ الْمُدَّةِ، وَكَانَ فِيمَا اشْتَرَطَ سُهَيْلُ بْنُ عَمْرٍو أَنَّهُ قَالَ لاَ يَأْتِيكَ مِنَّا أَحَدٌ وَإِنْ كَانَ عَلَى دِينِكَ إِلاَّ رَدَدْتَهُ إِلَيْنَا، وَخَلَّيْتَ بَيْنَنَا وَبَيْنَهُ‏.‏ وَأَبَى سُهَيْلٌ أَنْ يُقَاضِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم إِلاَّ عَلَى ذَلِكَ، فَكَرِهَ الْمُؤْمِنُونَ ذَلِكَ وَامَّعَضُوا، فَتَكَلَّمُوا فِيهِ، فَلَمَّا أَبَى سُهَيْلٌ أَنْ يُقَاضِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم إِلاَّ عَلَى ذَلِكَ، كَاتَبَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم، فَرَدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا جَنْدَلِ بْنَ سُهَيْلٍ يَوْمَئِذٍ إِلَى أَبِيهِ سُهَيْلِ بْنِ عَمْرٍو، وَلَمْ يَأْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم أَحَدٌ مِنَ الرِّجَالِ إِلاَّ رَدَّهُ فِي تِلْكَ الْمُدَّةِ، وَإِنْ كَانَ مُسْلِمًا، وَجَاءَتِ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ، فَكَانَتْ أُمُّ كُلْثُومٍ بِنْتُ عُقْبَةَ بْنِ مُعَيْطٍ مِمَّنْ خَرَجَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهْىَ عَاتِقٌ، فَجَاءَ أَهْلُهَا يَسْأَلُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يَرْجِعَهَا إِلَيْهِمْ، حَتَّى أَنْزَلَ اللَّهُ تَعَالَى فِي الْمُؤْمِنَاتِ مَا أَنْزَلَ‏.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3991,
                "hadithNumber": "4182",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) used to test all the believing women who migrated to him, with the following Verse:-- \"O Prophet! When the believing Women come to you, to give the pledge of allegiance to you.\" (60.12) `Urwa's uncle said, \"We were informed when Allah ordered His Apostle to return to the pagans what they had given to their wives who lately migrated (to Medina) and we were informed that Abu Basir...\" relating the whole narration.",
                "hadithUrdu": "آیت «يا أيها النبي إذا جاءك المؤمنات‏» کے نازل ہونے کے بعد نبی کریم صلی اللہ علیہ وسلم ہجرت کر کے آنے والی عورتوں کو پہلے آزماتے تھے اور ان کے چچا سے روایت ہے کہ ہمیں وہ حدیث بھی معلوم ہے جب نبی کریم صلی اللہ علیہ وسلم نے حکم دیا تھا کہ جو مسلمان عورتیں ہجرت کر کے چلی آتی ہیں ان کے شوہروں کو وہ سب کچھ واپس کر دیا جائے جو اپنی ان بیویوں کو وہ دے چکے ہیں اور ہمیں یہ بھی معلوم ہوا ہے کہ ابوبصیر ‘ پھر انہوں نے تفصیل کے ساتھ حدیث بیان کی۔",
                "urduNarrator": "ابن شہاب نے بیان کیا کہ مجھے عروہ بن زبیر رضی اللہ عنہ نے خبر دی اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَمْتَحِنُ مَنْ هَاجَرَ مِنَ الْمُؤْمِنَاتِ بِهَذِهِ الآيَةِ ‏{‏يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ‏}‏‏.‏ وَعَنْ عَمِّهِ قَالَ بَلَغَنَا حِينَ أَمَرَ اللَّهُ رَسُولَهُ صلى الله عليه وسلم أَنْ يَرُدَّ إِلَى الْمُشْرِكِينَ مَا أَنْفَقُوا عَلَى مَنْ هَاجَرَ مِنْ أَزْوَاجِهِمْ، وَبَلَغَنَا أَنَّ أَبَا بَصِيرٍ‏.‏ فَذَكَرَهُ بِطُولِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3992,
                "hadithNumber": "4183",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "`Abdullah bin `Umar رضی اللہ عنہما set out for Umra during the period of afflictions, and he said, \"If I should be stopped from visiting the Ka`ba, I will do what we did when we were with Allah's Messenger (ﷺ).\" He assumed Ihram for `Umra in the year of Al-Hudaibiya.",
                "hadithUrdu": "عبداللہ بن عمر رضی اللہ عنہما فتنہ کے زمانہ میں عمرہ کے ارادہ سے نکلے۔ پھر انہوں نے کہا کہ اگر بیت اللہ جانے سے مجھے روک دیا گیا تو میں وہی کام کروں گا جو رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا۔ چنانچہ آپ نے صرف عمرہ کا احرام باندھا کیونکہ نبی کریم صلی اللہ علیہ وسلم نے بھی صلح حدیبیہ کے موقع پر صرف عمرہ ہی کا احرام باندھا تھا۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے امام مالک رحمہ اللہ نے بیان کیا ‘ ان سے نافع نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ خَرَجَ مُعْتَمِرًا فِي الْفِتْنَةِ فَقَالَ إِنْ صُدِدْتُ عَنِ الْبَيْتِ، صَنَعْنَا كَمَا صَنَعْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَأَهَلَّ بِعُمْرَةٍ مِنْ أَجْلِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ أَهَلَّ بِعُمْرَةٍ عَامَ الْحُدَيْبِيَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3993,
                "hadithNumber": "4184",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "Ibn `Umar رضی اللہ عنہما assumed Ihram and said, \"If something should intervene between me and the Ka`ba, then I will do what the Prophet (ﷺ) did when the Quraish infidels intervened between him and (the Ka`ba). Then Ibn `Umar رضی اللہ عنہما recited: \"You have indeed in Allah's Messenger (ﷺ) A good example to follow.\" (33.21)",
                "hadithUrdu": "عبداللہ بن عمر رضی اللہ عنہما نے احرام باندھا اور کہا کہ اگر مجھے بیت اللہ جانے سے روکا گیا تو میں بھی وہی کام کروں گا جو رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا۔ جب آپ کو کفار قریش نے بیت اللہ جانے سے روکا تو اس آیت کی تلاوت کی کہ «لقد كان لكم في رسول الله أسوة حسنة‏» ”یقیناً تم لوگوں کے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے۔“",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ‘ کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ‘ ان سے عبیداللہ بن عبداللہ نے ‘ ان سے نافع نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ أَهَلَّ وَقَالَ إِنْ حِيلَ بَيْنِي وَبَيْنَهُ لَفَعَلْتُ كَمَا فَعَلَ النَّبِيُّ صلى الله عليه وسلم حِينَ حَالَتْ كُفَّارُ قُرَيْشٍ بَيْنَهُ‏.‏ وَتَلاَ ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏}‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3994,
                "hadithNumber": "4185",
                "englishNarrator": "Narrate Abdullah bin Umer رضی اللہ عنہما :",
                "hadithEnglish": "One of  \"I wish you would stay this year (and not perform Hajj) as I am afraid that you will not be able to reach the Ka`ba.\" On that he (i.e. `Abdullah bin `Umar رضی اللہ عنہما ) said, \"We went out with the Prophet (for `Umra), and when the Quraish infidel intervened between us and the Ka`ba, the Prophet (ﷺ) slaughtered his Hadi and shaved (his head), and his companions cut short their hair.\" Then `Abdullah bin `Umar said, \"I make you witness that I have intended to perform `Umra and if I am allowed to reach the Ka`ba, I will perform the Tawaf, and if something (i.e. obstacles) intervene between me and the Ka`ba, then I will do what Allah's Messenger (ﷺ) did.\" Then after going for a while, he said, \"I consider the ceremonies (of both `Umra and Hajj as one and the same, so I would like you to witness that I have intended to perform Hajj along with my `Umra.\" So he performed only one Tawaf and one Sai (between Safa and Marwa) and finished the Ihram of both Umra and Hajj).",
                "hadithUrdu": "اگر اس سال آپ ( عمرہ کرنے ) نہ جاتے تو بہتر تھا کیونکہ مجھے ڈر ہے کہ آپ بیت اللہ تک نہیں پہنچ سکیں گے۔ اس پر انہوں نے کہا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے تھے تو کفار قریش نے بیت اللہ پہنچنے سے روک دیا تھا۔ چنانچہ آپ صلی اللہ علیہ وسلم نے اپنی قربانی کے جانور وہیں ( حدیبیہ میں ) ذبح کر دیئے اور سر کے بال منڈوا دیئے۔ صحابہ رضی اللہ عنہم نے بھی بال چھوٹے کروا لیے۔ آپ صلی اللہ علیہ وسلم نے اس کے بعد فرمایا کہ میں تمہیں گواہ بناتا ہوں کہ میں نے اپنے اوپر ایک عمرہ واجب کر لیا ہے ( اور اسی طرح تمام صحابہ رضی اللہ عنہم پر بھی وہ واجب ہو گیا ) اگر آج مجھے بیت اللہ تک جانے دیا گیا تو میں طواف کر لوں گا اور اگر مجھے روک دیا گیا تو میں بھی وہی کروں گا جو نبی کریم صلی اللہ علیہ وسلم نے کیا تھا۔ پھر تھوڑی دور چلے اور کہا کہ میں تمہیں گواہ بناتا ہوں کہ میں نے اپنے اوپر عمرہ کے ساتھ حج کو بھی ضروری قرار دے لیا ہے اور کہا میری نظر میں تو حج اور عمرہ دونوں ایک ہی جیسے ہیں ‘ پھر انہوں نے ایک طواف کیا اور ایک سعی کی ( جس دن مکہ پہنچے ) اور دونوں ہی کو پورا کیا۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد بن اسماء نے بیان کیا ‘ کہا ہم سے جویریہ نے بیان کیا ‘ انہیں نافع نے ‘ ان کو عبیداللہ بن عبداللہ اور سالم بن عبداللہ نے خبر دی کہ ان دونوں نے عبداللہ بن عمر رضی اللہ عنہما سے گفتگو کی ( دوسری سند ) امام بخاری رحمہ اللہ نے کہا اور ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ ان سے جویریہ نے بیان کیا اور ان سے نافع نے کہ عبداللہ بن عمر رضی اللہ عنہما کے کسی لڑکے نے ان سے کہا ‘",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، وَسَالِمَ بْنَ عَبْدِ اللَّهِ، أَخْبَرَاهُ أَنَّهُمَا، كَلَّمَا عَبْدَ اللَّهِ بْنَ عُمَرَ‏.‏ وَحَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، أَنَّ بَعْضَ بَنِي عَبْدِ اللَّهِ، قَالَ لَهُ لَوْ أَقَمْتَ الْعَامَ، فَإِنِّي أَخَافُ أَنْ لاَ تَصِلَ إِلَى الْبَيْتِ‏.‏ قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم فَحَالَ كُفَّارُ قُرَيْشٍ دُونَ الْبَيْتِ، فَنَحَرَ النَّبِيُّ صلى الله عليه وسلم هَدَايَاهُ، وَحَلَقَ وَقَصَّرَ أَصْحَابُهُ، وَقَالَ ‏ \"‏ أُشْهِدُكُمْ أَنِّي أَوْجَبْتُ عُمْرَةً ‏\"‏‏.‏ فَإِنْ خُلِّيَ بَيْنِي وَبَيْنَ الْبَيْتِ طُفْتُ، وَإِنْ حِيلَ بَيْنِي وَبَيْنَ الْبَيْتِ صَنَعْتُ كَمَا صَنَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَارَ سَاعَةً ثُمَّ قَالَ مَا أُرَى شَأْنَهُمَا إِلاَّ وَاحِدًا، أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ حَجَّةً مَعَ عُمْرَتِي‏.‏ فَطَافَ طَوَافًا وَاحِدًا وَسَعْيًا وَاحِدًا، حَتَّى حَلَّ مِنْهُمَا جَمِيعًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3995,
                "hadithNumber": "4186",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "The people used to say that Abdullah bin `Umar رضی اللہ عنہ had embraced Islam before `Umar رضی اللہ عنہ . This is not true. What happened is that `Umar sent `Abdullah to bring his horse from an Ansari man so as to fight on it. At that time the people were giving the Pledge of allegiance to Allah's Messenger (ﷺ) near the Tree, and `Umar رضی اللہ عنہ was not aware of that. So `Abdullah (bin `Umar رضی اللہ عنہ) gave the Pledge of Allegiance (to the Prophet) and went to take the horse and brought it to `Umar رضی اللہ عنہ . While `Umar رضی اللہ عنہ was putting on the armor to get ready for fighting, `Abdullah informed him that the people were giving the Pledge of allegiance to Allah's Apostle beneath the Tree. So `Umar رضی اللہ عنہ set out and `Abdullah accompanied him till he gave the Pledge of allegiance to Allah's Messenger (ﷺ), and it was this event that made people say that Ibn `Umar رضی اللہ عنہ had embraced Islam before `Umar.",
                "hadithUrdu": "لوگ کہتے ہیں کہ عبداللہ، عمر رضی اللہ عنہ سے پہلے اسلام میں داخل ہوئے تھے، حالانکہ یہ غلط ہے۔ البتہ عمر رضی اللہ عنہ نے عبداللہ بن عمر رضی اللہ عنہما کو اپنا ایک گھوڑا لانے کے لیے بھیجا تھا ‘ جو ایک انصاری صحابی کے پاس تھا تاکہ اسی پر سوار ہو کر جنگ میں شریک ہوں۔ اسی دوران رسول اللہ صلی اللہ علیہ وسلم درخت کے نیچے بیٹھ کر بیعت لے رہے تھے۔ عمر رضی اللہ عنہ کو ابھی اس کی اطلاع نہیں ہوئی تھی۔ عبداللہ بن عمر رضی اللہ عنہما نے پہلے بیعت کی پھر گھوڑا لینے گئے۔ جس وقت وہ اسے لے کر عمر رضی اللہ عنہ کے پاس آئے تو وہ جنگ کے لیے اپنی زرہ پہن رہے تھے۔ انہوں نے اس وقت عمر رضی اللہ عنہ کو بتایا کہ نبی کریم صلی اللہ علیہ وسلم درخت کے نیچے بیعت لے رہے ہیں۔ بیان کیا کہ پھر آپ اپنے لڑکے کو ساتھ لے گئے اور بیعت کی۔ اتنی سی بات تھی جس پر لوگ اب کہتے ہیں کہ عمر رضی اللہ عنہ سے پہلے ابن عمر رضی اللہ عنہما اسلام لائے تھے۔",
                "urduNarrator": "مجھ سے شجاع بن ولید نے بیان کیا ‘ انہوں نے نضر بن محمد سے سنا ‘ کہا ہم سے صخر بن جویریہ نے بیان کیا اور ان سے نافع نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي شُجَاعُ بْنُ الْوَلِيدِ، سَمِعَ النَّضْرَ بْنَ مُحَمَّدٍ، حَدَّثَنَا صَخْرٌ، عَنْ نَافِعٍ، قَالَ إِنَّ النَّاسَ يَتَحَدَّثُونَ أَنَّ ابْنَ عُمَرَ، أَسْلَمَ قَبْلَ عُمَرَ، وَلَيْسَ كَذَلِكَ، وَلَكِنْ عُمَرُ يَوْمَ الْحُدَيْبِيَةِ أَرْسَلَ عَبْدَ اللَّهِ إِلَى فَرَسٍ لَهُ عِنْدَ رَجُلٍ مِنَ الأَنْصَارِ يَأْتِي بِهِ لِيُقَاتِلَ عَلَيْهِ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُبَايِعُ عِنْدَ الشَّجَرَةِ، وَعُمَرُ لاَ يَدْرِي بِذَلِكَ، فَبَايَعَهُ عَبْدُ اللَّهِ، ثُمَّ ذَهَبَ إِلَى الْفَرَسِ، فَجَاءَ بِهِ إِلَى عُمَرَ، وَعُمَرُ يَسْتَلْئِمُ لِلْقِتَالِ، فَأَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يُبَايِعُ تَحْتَ الشَّجَرَةِ ـ قَالَ ـ فَانْطَلَقَ فَذَهَبَ مَعَهُ حَتَّى بَايَعَ رَسُولَ اللَّهِ صلى الله عليه وسلم، فَهِيَ الَّتِي يَتَحَدَّثُ النَّاسُ أَنَّ ابْنَ عُمَرَ أَسْلَمَ قَبْلَ عُمَرَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3996,
                "hadithNumber": "4187",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"The people were along with the Prophet (ﷺ) on the day of Al-Hudaibiya spreading in the shade of the trees. Suddenly the people surrounded the Prophet (ﷺ) and started looking at him.\" `Umar رضی اللہ عنہ said, \"O `Abdullah! Go and see why the people are encircling Allah's Apostle and looking at him.\" `Abdullah bin `Umar then saw the people giving the Pledge o allegiance to the Prophet. So he also gave the Pledge of allegiance and returned to `Umar رضی اللہ عنہ who went out in his turn and gave the Pledge of allegiance to the Prophet.'",
                "hadithUrdu": "صلح حدیبیہ کے موقع پر صحابہ رضی اللہ عنہم جو نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے ‘ مختلف درختوں کے سائے میں پھیل گئے تھے۔ پھر اچانک بہت سے صحابہ آپ صلی اللہ علیہ وسلم کے چاروں طرف جمع ہو گئے۔ عمر رضی اللہ عنہ نے کہا: بیٹا عبداللہ! دیکھو تو سہی لوگ نبی کریم صلی اللہ علیہ وسلم کے پاس جمع کیوں ہو گئے ہیں؟ انہوں نے دیکھا تو صحابہ بیعت کر رہے تھے۔ چنانچہ پہلے انہوں نے خود بیعت کر لی۔ پھر عمر رضی اللہ عنہ کو آ کر خبر دی پھر وہ بھی گئے اور انہوں نے بھی بیعت کی۔",
                "urduNarrator": "اور ہشام بن عمار نے بیان کیا ‘ ان سے ولید بن مسلم نے بیان کیا ‘ ان سے عمر بن عمری نے بیان کیا ‘ انہیں نافع نے خبر دی اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "وَقَالَ هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا عُمَرُ بْنُ مُحَمَّدٍ الْعُمَرِيُّ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّاسَ، كَانُوا مَعَ النَّبِيِّ صلى الله عليه وسلم يَوْمَ الْحُدَيْبِيَةِ، تَفَرَّقُوا فِي ظِلاَلِ الشَّجَرِ، فَإِذَا النَّاسُ مُحْدِقُونَ بِالنَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا عَبْدَ اللَّهِ، انْظُرْ مَا شَأْنُ النَّاسِ قَدْ أَحْدَقُوا بِرَسُولِ اللَّهِ صلى الله عليه وسلم فَوَجَدَهُمْ يُبَايِعُونَ، فَبَايَعَ ثُمَّ رَجَعَ إِلَى عُمَرَ فَخَرَجَ فَبَايَعَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3997,
                "hadithNumber": "4188",
                "englishNarrator": "Narrated `Abdullah bin Abi `Aufa رضی اللہ عنہ :",
                "hadithEnglish": "We were in the company of the Prophet (ﷺ) when he performed the `Umra. He performed the Tawaf and we did the same; he offered the prayer and we also offered the prayer with him. Then he performed the Sai between Safa and Marwa and we were guarding him against the people of Mecca so that nobody should harm him.",
                "hadithUrdu": "جب نبی کریم صلی اللہ علیہ وسلم نے عمرہ ( قضاء ) کیا تو ہم بھی آپ کے ساتھ تھے۔ آپ صلی اللہ علیہ وسلم نے طواف کیا تو ہم نے بھی آپ کے ساتھ طواف کیا۔ آپ صلی اللہ علیہ وسلم نے نماز پڑھی تو ہم نے بھی آپ کے ساتھ نماز پڑھی اور آپ صلی اللہ علیہ وسلم نے صفا و مروہ کی سعی بھی کی۔ ہم آپ کی اہل مکہ سے حفاظت کرتے تھے تاکہ کوئی تکلیف کی بات آپ کو پیش نہ آ جائے۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا ‘ کہا ہم سے یعلیٰ بن عبید نے بیان کیا ‘ کہا ہم سے اسماعیل بن ابی خالد نے بیان کیا ‘ کہا کہ میں نے عبداللہ بن ابی اوفی رضی اللہ عنہ سے سنا ‘ آپ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا يَعْلَى، حَدَّثَنَا إِسْمَاعِيلُ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى ـ رضى الله عنهما ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم حِينَ اعْتَمَرَ فَطَافَ فَطُفْنَا مَعَهُ، وَصَلَّى وَصَلَّيْنَا مَعَهُ، وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ، فَكُنَّا نَسْتُرُهُ مِنْ أَهْلِ مَكَّةَ، لاَ يُصِيبُهُ أَحَدٌ بِشَىْءٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3998,
                "hadithNumber": "4189",
                "englishNarrator": "Narrated Abu Wail:",
                "hadithEnglish": "When Sahl bin Hunaif رضی اللہ عنہ returned from (the battle of) Siffin, we went to ask him (as to why he had come back). He replied, \"(You should not consider me a coward) but blame your opinions. I saw myself on the day of Abu Jandal (inclined to fight), and if I had the power of refusing the order of Allah's Apostle then, I would have refused it (and fought the infidels bravely). Allah and His Apostle know (what is convenient) better. Whenever we put our swords on our shoulders for any matter that terrified us, our swords led us to an easy agreeable solution before the present situation (of disagreement and dispute between the Muslims). When we mend the breach in one side, it opened in another, and we do not know what to do about it.\"",
                "hadithUrdu": "سہل بن حنیف رضی اللہ عنہ جب جنگ صفین ( جو علی رضی اللہ عنہ اور معاویہ رضی اللہ عنہ میں ہوئی تھی ) سے واپس آئے تو ہم ان کی خدمت میں حالات معلوم کرنے کے لیے حاضر ہوئے۔ انہوں نے کہا کہ اس جنگ کے بارے میں تم لوگ اپنی رائے اور فکر پر نازاں مت ہو۔ میں یوم ابوجندل ( صلح حدیبیہ ) میں بھی موجود تھا۔ اگر میرے لیے رسول اللہ صلی اللہ علیہ وسلم کے حکم کو ماننے سے انکار ممکن ہوتا تو میں اس دن ضرور حکم عدولی کرتا۔ اللہ اور اس کا رسول خوب جانتے ہیں کہ جب ہم نے کسی مشکل کام کے لیے اپنی تلواروں کو اپنے کاندھوں پر رکھا تو صورت حال آسان ہو گئی اور ہم نے مشکل حل کر لی۔ لیکن اس جنگ کا کچھ عجیب حال ہے ‘ اس میں ہم ( فتنے کے ) ایک کونے کو بند کرتے ہیں تو دوسرا کونا کھل جاتا ہے۔ ہم نہیں جانتے کہ ہم کو کیا تدبیر کرنی چاہئے۔",
                "urduNarrator": "ہم سے حسن بن اسحاق نے بیان کیا ‘ کہا ہم سے محمد بن سابق نے بیان کیا ‘ کہا ہم سے مالک بن مغول نے بیان کیا ‘ کہا کہ میں نے ابوحصین سے سنا ‘ ان سے ابووائل نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ إِسْحَاقَ، حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ، حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، قَالَ سَمِعْتُ أَبَا حَصِينٍ، قَالَ قَالَ أَبُو وَائِلٍ لَمَّا قَدِمَ سَهْلُ بْنُ حُنَيْفٍ مِنْ صِفِّينَ أَتَيْنَاهُ نَسْتَخْبِرُهُ فَقَالَ اتَّهِمُوا الرَّأْىَ، فَلَقَدْ رَأَيْتُنِي يَوْمَ أَبِي جَنْدَلٍ وَلَوْ أَسْتَطِيعُ أَنْ أَرُدَّ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَمْرَهُ لَرَدَدْتُ، وَاللَّهُ وَرَسُولُهُ أَعْلَمُ، وَمَا وَضَعْنَا أَسْيَافَنَا عَلَى عَوَاتِقِنَا لأَمْرٍ يُفْظِعُنَا إِلاَّ أَسْهَلْنَ بِنَا إِلَى أَمْرٍ نَعْرِفُهُ قَبْلَ هَذَا الأَمْرِ، مَا نَسُدُّ مِنْهَا خُصْمًا إِلاَّ انْفَجَرَ عَلَيْنَا خُصْمٌ مَا نَدْرِي كَيْفَ نَأْتِي لَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3999,
                "hadithNumber": "4190",
                "englishNarrator": "Narrated Ka`b bin Ujra رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) came to me at the time of Al-Hudaibiya Pledge while lice were falling on my face. He said, \"Are the lice of your head troubling you?\" I said, \"Yes.\" He said, \"Shave your head and fast for three days, or feed six poor persons, or slaughter a sheep as sacrifice.\" (The sub-narrator, Aiyub said, \"I do not know with which of these three options he started.\")",
                "hadithUrdu": "وہ عمرہ حدیبیہ کے موقع پر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو جوئیں ان کے چہرے پر گر رہی تھی۔ نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ یہ جوئیں جو تمہارے سر سے گر رہی ہیں ‘ تکلیف دے رہی ہیں؟ انہوں نے عرض کیا: جی ہاں! نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر سر منڈوا لو اور تین دن روزہ رکھ لو یا چھ مسکینوں کا کھانا کھلا دو یا پھر کوئی قربانی کر ڈالو۔ ( سر منڈوانے کا فدیہ ہو گا ) ایوب سختیانی نے بیان کیا کہ مجھے معلوم نہیں کہ ان تینوں امور میں سے پہلے نبی کریم صلی اللہ علیہ وسلم نے کون سی بات ارشاد فرمائی تھی۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ‘ کہا ہم سے حماد بن زید نے بیان کیا ‘ ان سے ایوب سختیانی نے ‘ ان سے مجاہد نے ‘ ان سے ابن ابی لیلیٰ نے ‘ ان سے کعب بن عجرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ ـ رضى الله عنه ـ قَالَ أَتَى عَلَىَّ النَّبِيُّ صلى الله عليه وسلم زَمَنَ الْحُدَيْبِيَةِ، وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي فَقَالَ ‏{‏أَيُؤْذِيكَ هَوَامُّ رَأْسِكَ‏}‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏ \"‏ فَاحْلِقْ، وَصُمْ ثَلاَثَةَ أَيَّامٍ، أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ، أَوِ انْسُكْ نَسِيكَةً ‏\"‏‏.‏ قَالَ أَيُّوبُ لاَ أَدْرِي بِأَىِّ هَذَا بَدَأَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4000,
                "hadithNumber": "4191",
                "englishNarrator": "Narrated Ka`b bin Ujra رضی اللہ عنہ :",
                "hadithEnglish": "We were in the company of Allah's Messenger (ﷺ) at Al-Hudaibiya in the state of Ihram and the pagans did not allow us to proceed (to the Ka`ba). I had thick hair and lice started falling on my face. The Prophet (ﷺ) passed by me and said, \"Are the lice of your head troubling you?\" I replied, Yes.\" (The sub-narrator added, \"Then the following Divine Verse was revealed:-- \"And if anyone of you is ill or has an ailment in his scalp, (necessitating shaving) must pay a ransom (Fida) of either fasting or feeding the poor, Or offering a sacrifice.\" (2.196)",
                "hadithUrdu": "صلح حدیبیہ کے موقع پر ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے اور احرام باندھے ہوئے تھے۔ ادھر مشرکین ہمیں بیت اللہ تک جانے نہیں دینا چاہتے تھے۔ انہوں نے بیان کیا کہ میرے سر پر بال بڑے بڑے تھے جن سے جوئیں میرے چہرے پر گرنے لگیں۔ نبی کریم صلی اللہ علیہ وسلم نے مجھے دیکھ کر دریافت فرمایا کہ کیا یہ جوئیں تکلیف دے رہی ہیں؟ میں نے کہا: جی ہاں۔ انہوں نے بیان کیا کہ پھر یہ آیت نازل ہوئی «فمن كان منكم مريضا أو به أذى من رأسه ففدية من صيام أو صدقة أو نسك‏» ”پس اگر تم میں کوئی مریض ہو یا اس کے سر میں کوئی تکلیف دینے والی چیز ہو تو اسے ( بال منڈوا لینے چاہئیں اور ) تین دن کے روزے یا صدقہ یا قربانی کا فدیہ دینا چاہیے۔“",
                "urduNarrator": "مجھ سے ابوعبداللہ محمد بن ہشام نے بیان کیا ‘ کہا ہم سے ہشیم نے بیان کیا ان سے ابوبشر نے ‘ ان سے مجاہد نے ‘ ان سے عبدالرحمٰن بن ابی لیلیٰ نے اور ان سے کعب بن عجرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ هِشَامٍ أَبُو عَبْدِ اللَّهِ، حَدَّثَنَا هُشَيْمٌ، عَنْ أَبِي بِشْرٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِالْحُدَيْبِيَةِ وَنَحْنُ مُحْرِمُونَ، وَقَدْ حَصَرَنَا الْمُشْرِكُونَ ـ قَالَ ـ وَكَانَتْ لِي وَفْرَةٌ فَجَعَلَتِ الْهَوَامُّ تَسَّاقَطُ عَلَى وَجْهِي، فَمَرَّ بِي النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَيُؤْذِيكَ هَوَامُّ رَأْسِكَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ وَأُنْزِلَتْ هَذِهِ الآيَةُ ‏{‏فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ‏}‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4001,
                "hadithNumber": "4192",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Some people of the tribe of `Ukl and `Uraina arrived at Medina to meet the Prophet (ﷺ) and embraced Islam and said, \"O Allah's Prophet! We are the owners of milch livestock (i.e. bedouins) and not farmers (i.e. countrymen).\" They found the climate of Medina unsuitable for them. So Allah's Messenger (ﷺ) ordered that they should be provided with some milch camels and a shepherd and ordered them to go out of Medina and to drink the camels' milk and urine (as medicine) So they set out and when they reached Al-Harra, they reverted to Heathenism after embracing Islam, and killed the shepherd of the Prophet and drove away the camels. When this news reached the Prophet, he sent some people in pursuit of them. (So they were caught and brought back to the Prophet (ﷺ) ). The Prophet (ﷺ) gave his orders in their concern. So their eyes were branded with pieces of iron and their hands and legs were cut off and they were left away in Harra till they died in that state of theirs. (See Hadith 234 Vol 1) Qatada says: It reached us that after that the prophet (ﷺ) would urge to give alms and forbid to mutilate anyone. Shubah, Aban and Hammad have reported from Qatadah that those people belonged to Orainah tribe. Yahyah bin Abu Katheer and Ayyub have reported from Hadrat Anas رضی اللہ عنہ with referene to Abu Qilabah: Some people of Ukl tribe visited the prophet (ﷺ).",
                "hadithUrdu": "قبائل عکل و عرینہ کے کچھ لوگ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں مدینہ آئے اور اسلام میں داخل ہو گئے۔ پھر انہوں نے کہا: اے اللہ کے نبی! ہم لوگ مویشی رکھتے تھے ‘ کھیت وغیرہ ہمارے پاس نہیں تھے ‘ ( اس لیے ہم صرف دودھ پر بسر اوقات کیا کرتے تھے ) اور انہیں مدینہ کی آب و ہوا ناموافق آئی تو نبی کریم صلی اللہ علیہ وسلم نے کچھ اونٹ اور چرواہا ان کے ساتھ کر دیا اور فرمایا کہ انہیں اونٹوں کا دودھ اور پیشاب پیو ( تو تمہیں صحت حاصل ہو جائے گی ) وہ لوگ ( چراگاہ کی طرف ) گئے۔ لیکن مقام حرہ کے کنارے پہنچتے ہی وہ اسلام سے پھر گئے اور نبی کریم صلی اللہ علیہ وسلم کے چرواہے کو قتل کر دیا اور اونٹوں کو لے کر بھاگنے لگے۔ اس کی خبر جب آپ صلی اللہ علیہ وسلم کو ملی تو آپ نے چند صحابہ کو ان کے پیچھے دوڑایا۔ ( وہ پکڑ کر مدینہ لائے گئے۔ ) تو آپ صلی اللہ علیہ وسلم کے حکم سے ان کی آنکھوں میں گرم سلائیاں پھیر دی گئیں اور ان کے ہاتھ اور پیر کاٹ دیئے گئے ( کیونکہ انہوں نے بھی ایسا ہی کیا تھا ) اور انہیں حرہ کے کنارے چھوڑ دیا گیا۔ آخر وہ اسی حالت میں مر گئے۔ قتادہ نے بیان کیا کہ ہمیں یہ روایت پہنچی ہے کہ آپ صلی اللہ علیہ وسلم نے اس کے بعد صحابہ کو صدقہ کا حکم دیا اور مثلہ ( مقتول کی لاش بگاڑنا یا ایذا دے کر اسے قتل کرنا ) سے منع فرمایا اور شعبہ ‘ ابان اور حماد نے قتادہ سے بیان کیا کہ ( یہ لوگ ) عرینہ کے قبیلے کے تھے ( عکل کا نام نہیں لیا ) اور یحییٰ بن ابی کثیر اور ایوب نے بیان کیا ‘ ان سے ابوقلابہ نے اور ان سے انس رضی اللہ عنہ نے کہ قبیلہ عکل کے کچھ لوگ آئے۔",
                "urduNarrator": "مجھ سے عبدالاعلی بن حماد نے بیان کیا ‘ کہا ہم سے یزید بن زریع نے بیان کیا ‘ کہا ہم سے سعید نے بیان کیا ‘ ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، أَنَّ أَنَسًا ـ رضى الله عنه ـ حَدَّثَهُمْ أَنَّ نَاسًا مِنْ عُكْلٍ وَعُرَيْنَةَ قَدِمُوا الْمَدِينَةَ عَلَى النَّبِيِّ صلى الله عليه وسلم وَتَكَلَّمُوا بِالإِسْلاَمِ فَقَالُوا يَا نَبِيَّ اللَّهِ إِنَّا كُنَّا أَهْلَ ضَرْعٍ، وَلَمْ نَكُنْ أَهْلَ رِيفٍ‏.‏ وَاسْتَوْخَمُوا الْمَدِينَةَ، فَأَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم بِذَوْدٍ وَرَاعٍ، وَأَمَرَهُمْ أَنْ يَخْرُجُوا فِيهِ، فَيَشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا، فَانْطَلَقُوا حَتَّى إِذَا كَانُوا نَاحِيَةَ الْحَرَّةِ كَفَرُوا بَعْدَ إِسْلاَمِهِمْ، وَقَتَلُوا رَاعِيَ النَّبِيِّ صلى الله عليه وسلم، وَاسْتَاقُوا الذَّوْدَ، فَبَلَغَ النَّبِيَّ صلى الله عليه وسلم فَبَعَثَ الطَّلَبَ فِي آثَارِهِمْ فَأَمَرَ بِهِمْ فَسَمَرُوا أَعْيُنَهُمْ، وَقَطَعُوا أَيْدِيَهُمْ، وَتُرِكُوا فِي نَاحِيَةِ الْحَرَّةِ حَتَّى مَاتُوا عَلَى حَالِهِمْ‏.‏ قَالَ قَتَادَةُ بَلَغَنَا أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعْدَ ذَلِكَ كَانَ يَحُثُّ عَلَى الصَّدَقَةِ، وَيَنْهَى عَنِ الْمُثْلَةِ‏.‏ وَقَالَ شُعْبَةُ وَأَبَانُ وَحَمَّادٌ عَنْ قَتَادَةَ مِنْ عُرَيْنَةَ‏.‏ وَقَالَ يَحْيَى بْنُ أَبِي كَثِيرٍ وَأَيُّوبُ عَنْ أَبِي قِلاَبَةَ عَنْ أَنَسٍ قَدِمَ نَفَرٌ مِنْ عُكْلٍ‏.‏",
                "headingArabic": "قِصَّةِ عُكْلٍ وَعُرَيْنَةَ",
                "headingUrdu": "(قبائل) عکل اور یورینہ کی کہانی",
                "headingEnglish": "The story of (the tribes of) ‘Ukl and ‘Uraina",
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 4002,
                "hadithNumber": "4193",
                "englishNarrator": "Narrated Abu Raja:",
                "hadithEnglish": "The freed slave of Abu Qilaba, who was with Abu Qilaba in Sham: `Umar bin `Abdul `Aziz consulted the people saying, \"What do you think of Qasama.\" They said, \"'It is a right (judgment) which Allah's Apostle and the Caliphs before you acted on.\" Abu Qilaba was behind `Umar's bed. 'Anbasa bin Sa`id said, But what about the narration concerning the people of `Uraina?\" Abu Qilaba said, \"Anas bin Malik رضی اللہ عنہ narrated it to me,\" and then narrated the whole story.",
                "hadithUrdu": "ابوقلابہ کے ساتھ شام میں تھے کہ خلیفہ عمر بن عبدالعزیز نے ایک دن لوگوں سے مشورہ کیا کہ اس ”قسامہ“ کے بارے میں تمہاری کیا رائے ہے؟ لوگوں نے کہا کہ یہ حق ہے۔ اس کا فیصلہ رسول اللہ صلی اللہ علیہ وسلم اور پھر خلفاء راشدین آپ سے پہلے کرتے رہے ہیں۔ ابورجاء نے بیان کیا کہ اس وقت ابوقلابہ ‘ عمر بن عبدالعزیز رحمہ اللہ کے تخت کے پیچھے تھے۔ اتنے میں عنبسہ بن سعید نے کہا کہ پھر قبیلہ عرینہ کے لوگوں کے بارے میں انس رضی اللہ عنہ کی حدیث کہاں گئی؟ اس پر ابوقلابہ نے کہا کہ انس رضی اللہ عنہ نے خود مجھ سے یہ بیان کیا۔ عبدالعزیز بن صہیب نے ( اپنی روایت میں ) انس رضی اللہ عنہ کے حوالہ سے صرف عرینہ کا نام لیا اور ابوقلابہ نے اپنی روایت میں انس رضی اللہ عنہ کے حوالے سے صرف عکل کا نام لیا پھر یہی قصہ بیان کیا۔",
                "urduNarrator": "مجھ سے محمد بن عبدالرحیم نے بیان کیا ‘ کہا ہم سے ابوعمر حفص بن عمر الحوضی نے بیان کیا ‘ کہا ہم سے حماد بن زید نے بیان کیا ‘ کہا ہم سے ایوب اور حجاج صواف نے بیان کیا ‘ کہا ہم سے ابوقلابہ کے مولیٰ ابورجاء نے بیان کیا ‘ وہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، حَدَّثَنَا حَفْصُ بْنُ عُمَرَ أَبُو عُمَرَ الْحَوْضِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، وَالْحَجَّاجُ الصَّوَّافُ، قَالَ حَدَّثَنِي أَبُو رَجَاءٍ، مَوْلَى أَبِي قِلاَبَةَ وَكَانَ مَعَهُ بِالشَّأْمِ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، اسْتَشَارَ النَّاسَ يَوْمًا قَالَ مَا تَقُولُونَ فِي هَذِهِ الْقَسَامَةِ فَقَالُوا حَقٌّ، قَضَى بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَضَتْ بِهَا الْخُلَفَاءُ، قَبْلَكَ‏.‏ قَالَ وَأَبُو قِلاَبَةَ خَلْفَ سَرِيرِهِ فَقَالَ عَنْبَسَةُ بْنُ سَعِيدٍ فَأَيْنَ حَدِيثُ أَنَسٍ فِي الْعُرَنِيِّينَ قَالَ أَبُو قِلاَبَةَ إِيَّاىَ حَدَّثَهُ أَنَسُ بْنُ مَالِكٍ‏.‏ قَالَ عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ عَنْ أَنَسٍ مِنْ عُرَيْنَةَ‏.‏ وَقَالَ أَبُو قِلاَبَةَ عَنْ أَنَسٍ مِنْ عُكْلٍ‏.‏ ذَكَرَ الْقِصَّةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "65",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 65,
                    "chapterNumber": "65",
                    "chapterEnglish": "Military Expeditions led by the Prophet (PBUH) (Al-Maghaazi)",
                    "chapterUrdu": "غزوات کے بیان میں",
                    "chapterArabic": "كتاب المغازي",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 3976,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=159",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=157",
                "label": "157",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=158",
                "label": "158",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=159",
                "label": "159",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=160",
                "label": "160",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=161",
                "label": "161",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=162",
                "label": "162",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=163",
                "label": "163",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=161",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=161",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=159",
        "to": 4000,
        "total": 40465
    }
}