{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 245,
        "data": [
            {
                "id": 6103,
                "hadithNumber": "6364",
                "englishNarrator": "Narrated Um Khalid bint Khalid رضی اللہ عنہما :",
                "hadithEnglish": "I heard the Prophet (ﷺ) seeking refuge with Allah from the punishment of the grave.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا کہ آپ قبر کے عذاب سے اللہ کی پناہ مانگتے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، کہا ہم سے موسیٰ بن عقبہ نے بیان کیا ، کہا کہ میں نے ام خالد بنت خالد بن سعید رضی اللہ عنہما سے سنا ( موسیٰ نے ) بیان کیا کہ میں نے کسی سے نہیں سنا کہ ان کی بیان کی ہوئی حدیث سے مختلف کسی نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہو ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، قَالَ سَمِعْتُ أُمَّ خَالِدٍ بِنْتَ خَالِدٍ ـ قَالَ وَلَمْ أَسْمَعْ أَحَدًا سَمِعَ مِنَ النَّبِيِّ، صلى الله عليه وسلم غَيْرَهَا ـ قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَتَعَوَّذُ مِنْ عَذَابِ الْقَبْرِ‏.‏",
                "headingArabic": "التَّعَوُّذِ مِنْ عَذَابِ الْقَبْرِ",
                "headingUrdu": "عذاب قبر سے پناہ مانگنا",
                "headingEnglish": "To seek refuge from punishment of the grave",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6104,
                "hadithNumber": "6365",
                "englishNarrator": "Narrated Mus`ab:",
                "hadithEnglish": "Sa`d رضی اللہ عنہ used to recommend five (statements) and mentioned that the Prophet (ﷺ) I used to recommend it. (It was) \"O Allah! I seek refuge with You from miserliness; and seek refuge with You from cowardice; and seek refuge with You from being sent back to geriatric old age; and I seek refuge with You from the affliction of this world (i.e., the affliction of Ad-Dajjal etc.); and seek refuge with You from the punishment of the grave.\"",
                "hadithUrdu": "سعد رضی اللہ عنہ پانچ باتوں کاحکم دیتے تھے او انہیں نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے ذکرکرتے تھے کہ آنحضرت صلی اللہ علیہ وسلم ان سے پناہ مانگنے کا حکم کرتے تھے کہ اللهم إني أعوذ بك من البخل ، ‏‏‏‏ وأعوذ بك من الجبن ، ‏‏‏‏ وأعوذ بك أن أرد إلى أرذل العمر ، ‏‏‏‏ وأعوذ بك من فتنۃ الدنيا يعني فتنۃ الدجال وأعوذ بك من عذاب القبر ‏ ” اے اللہ ! میں تیری پناہ مانگتا ہوں اس سے کہ بدترین بڑھاپا مجھ پر آ جائے اور تجھ سے پناہ مانگتا ہوں دنیا کے فتنہ سے ، اس سے مراد دجال کا فتنہ ہے اور تجھ سے پناہ مانگتا ہوں قبر کے عذاب سے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے عبدالملک بن عمیر نے بیان کیا ، ان سے مصعب بن سعد بن ابی وقاص نے کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ مُصْعَبٍ، كَانَ سَعْدٌ يَأْمُرُ بِخَمْسٍ وَيَذْكُرُهُنَّ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَأْمُرُ بِهِنَّ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا يَعْنِي فِتْنَةَ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6105,
                "hadithNumber": "6366",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Two old ladies from among the Jewish ladies entered upon me and said' \"The dead are punished in their graves,\" but I thought they were telling a lie and did not believe them in the beginning. When they went away and the Prophet (ﷺ) entered upon me, I said, \"O Allah's Messenger (ﷺ)! Two old ladies..\" and told him the whole story. He said, \"They told the truth; the dead are really punished, to the extent that all the animals hear (the sound resulting from) their punishment.\" Since then I always saw him seeking refuge with Allah from the punishment of the grave in his prayers.",
                "hadithUrdu": "مدینہ کے یہود یوں کی دو بوڑھی عورتیں میرے پاس آئیں اور انہوں نے مجھ سے کہا کہ قبر والوں کو ان کی قبر میں عذاب ہو گا ۔ لیکن میں نے انہیں جھٹلایا اور ان کی تصدیق نہیں کر سکی ۔ پھر وہ دونوں عورتیں چلی گئیں اور نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو میں نے عرض کیا یا رسول اللہ ! دو بوڑھی عورتیں تھیں ، پھر میں آپ سے واقعہ کا ذکر کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہوں نے صحیح کہا ، قبر والوں کو عذاب ہو گا اور ان کے عذاب کو تمام چوپائے سنیں گے ۔ پھر میں نے دیکھا کہ آنحضرت صلی اللہ علیہ وسلم ہر نماز میں قبر کے عذاب سے اللہ کی پناہ مانگنے لگے تھے ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریربن عبدالحمید نے بیان کیا ، ان سے ابووائل نے ، ان سے مسروق نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَتْ عَلَىَّ عَجُوزَانِ مِنْ عُجُزِ يَهُودِ الْمَدِينَةِ فَقَالَتَا لِي إِنَّ أَهْلَ الْقُبُورِ يُعَذَّبُونَ فِي قُبُورِهِمْ، فَكَذَّبْتُهُمَا، وَلَمْ أُنْعِمْ أَنْ أُصَدِّقَهُمَا، فَخَرَجَتَا وَدَخَلَ عَلَىَّ النَّبِيُّ صلى الله عليه وسلم فَقُلْتُ لَهُ يَا رَسُولَ اللَّهِ إِنَّ عَجُوزَيْنِ وَذَكَرْتُ لَهُ، فَقَالَ ‏ \"‏ صَدَقَتَا، إِنَّهُمْ يُعَذَّبُونَ عَذَابًا تَسْمَعُهُ الْبَهَائِمُ كُلُّهَا ‏\"‏‏.‏ فَمَا رَأَيْتُهُ بَعْدُ فِي صَلاَةٍ إِلاَّ تَعَوَّذَ مِنْ عَذَابِ الْقَبْرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6106,
                "hadithNumber": "6367",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Prophet used to say, \"O Allah! I seek refuge with You from incapacity and laziness, from cowardice and geriatric old age, and seek refuge with You from the punishment of the grave, and I seek refuge with You from the afflictions of life and death.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کہا کرتے تھے اللهم إني أعوذ بك من العجز والكسل ، ‏‏‏‏ والجبن والهرم ، ‏‏‏‏ وأعوذ بك من عذاب القبر ، ‏‏‏‏ وأعوذ بك من فتنۃ المحيا والممات ” اے اللہ ! میں تیری پنا ہ مانگتا ہوں عاجزی سے ، سستی سے ، بزدلی سے اور بہت زیادہ بڑھاپے سے اور میں تیری پناہ مانگتا ہوں زندگی اور موت کی آزمائشوں سے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے معتمر بن سلیمان نے بیان کیا ، کہا کہ میں نے اپنے والد سے سنا ، بیان کیا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ أَبِي قَالَ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ كَانَ نَبِيُّ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْهَرَمِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ‏\"‏‏.‏",
                "headingArabic": "التَّعَوُّذِ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ",
                "headingUrdu": "زندگی اور موت کے فتنے سے اللہ کی پناہ مانگنا",
                "headingEnglish": "To seek refuge with Allah from the Fitnah of life and death",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6107,
                "hadithNumber": "6368",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) used to say, \"O Allah! I seek refuge with You from laziness and geriatric old age, from all kinds of sins and from being in debt; from the trial and affliction of the grave and from the punishment in the grave; from the affliction of the Fire and from the punishment of the Fire; and from the evil of the affliction of wealth; and I seek refuge with You from the affliction of poverty, and I seek refuge with You from the affliction of Al-Mesiah Ad-Dajjal. O Allah! Wash away my sins with the water of snow and hail, and cleanse my heart from all the sins as a white garment is cleansed from the filth, and let there be a long distance between me and my sins, as You made East and West far from each other.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کہا کرتے تھے اللهم إني أعوذ بك من الكسل والهرم ، ‏‏‏‏ والمأثم والمغرم ، ‏‏‏‏ ومن فتنۃ القبر وعذاب القبر ، ‏‏‏‏ ومن فتنۃ النار وعذاب النار ، ‏‏‏‏ ومن شر فتنۃ الغنى ، ‏‏‏‏ وأعوذ بك من فتنۃ الفقر ، ‏‏‏‏ وأعوذ بك من فتنۃ المسيح الدجال ، ‏‏‏‏ اللهم اغسل عني خطاياى بماء الثلج والبرد ، ‏‏‏‏ ونق قلبي من الخطايا ، ‏‏‏‏ كما نقيت الثوب الأبيض من الدنس ، ‏‏‏‏ وباعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب ‏ ” اے اللہ ! میں تیری پناہ مانگتا ہوں سستی سے ، بہت زیادہ بڑھاپے سے ، گناہ سے ، قرض سے اور قبر کی آزمائش سے اور قبرکے عذاب سے اور دوزخ کی آزمائش سے اور دوزخ کے عذاب سے اور مالدا ری کی آزمائش سے اور تیری پناہ مانگتا ہوں محتاجی کی آزمائش سے اور تیری پناہ مانگتا ہوں مسیح دجال کی آزمائش سے ۔ اے اللہ ! مجھ سے میرے گناہوں کو برف اور اولے کے پانی سے دھودے اور میرے دل کو خطاؤں سے اس طرح پاک و صاف کر دے جس طرح تو نے سفید کپڑے کو میل سے پاک صاف کر دیا اور مجھ میں اور میرے گناہوں میں اتنی دوری کر دے جتنی مشرق اورمغرب میں دوری ہے ۔",
                "urduNarrator": "ہم سے معلی بن اسد نے بیان کیا ، انہوں نے کہا ہم سے وہیب نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد عروہ بن زبیر نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ، وَالْمَأْثَمِ وَالْمَغْرَمِ، وَمِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ، وَمِنْ شَرِّ فِتْنَةِ الْغِنَى، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْفَقْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ عَنِّي خَطَايَاىَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ، وَنَقِّ قَلْبِي مِنَ الْخَطَايَا، كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ ‏\"‏‏.‏",
                "headingArabic": "التَّعَوُّذِ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
                "headingUrdu": "ہر قسم کے گناہوں اور قرض دار ہونے سے اللہ کی پناہ مانگنا",
                "headingEnglish": "To seek refuge with Allah from all kinds of sins and from being in debt",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6108,
                "hadithNumber": "6369",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) used to say, \"O Allah! I seek refuge with You from worry and grief, from incapacity and laziness, from cowardice and miserliness, from being heavily in debt and from being overpowered by (other) men.\" (See Hadith No. 374)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کہتے تھے اللهم إني أعوذ بك من الهم والحزن ، ‏‏‏‏ والعجز والكسل ، ‏‏‏‏ والجبن والبخل ، ‏‏‏‏ وضلع الدين ، ‏‏‏‏ وغلبۃ الرجال ‏ ” اے اللہ ! میں تیری پناہ مانگتا ہوں غم والم سے ، عاجزی سے ، سستی سے ، بزدلی سے ، بخل ، قرض چڑھ جانے اور لوگوں کے غلبہ سے ۔ “",
                "urduNarrator": "ہم سے خالد بن مخلد نے بیان کیا ، انہوں نے کہا ہم سے سلیمان نے بیان کیا ، انہوں نے کہا کہ مجھ سے عمرو بن ابی عمرو نے بیان کیا ، انہوں نے کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، قَالَ حَدَّثَنِي عَمْرُو بْنُ أَبِي عَمْرٍو، قَالَ سَمِعْتُ أَنَسًا، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْبُخْلِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ ‏\"‏‏.‏",
                "headingArabic": "الاِسْتِعَاذَةِ مِنَ الْجُبْنِ وَالْكَسَلِ",
                "headingUrdu": "بزدلی اور سستی سے اللہ کی پناہ مانگنا",
                "headingEnglish": "To seek refuge with Allah from cowardice and laziness",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6109,
                "hadithNumber": "6370",
                "englishNarrator": "Narrated Sa`d bin Abi Waqqas رضی اللہ عنہ :",
                "hadithEnglish": "He used to recommend these five (statements) and say that the Prophet (ﷺ) said so (and they are): \"O Allah! I seek refuge with You from miserliness, and seek refuge with You from cowardice, and seek refuge with You from being brought back to geriatric old age, and seek refuge with You from the afflictions of the world, and seek refuge with You from the punishment of the grave.\"",
                "hadithUrdu": "وہ ان پانچ باتوں سے پناہ مانگنے کا حکم دیتے تھے اور انہیں نبی کریم صلی اللہ علیہ وسلم کے حوالہ سے بیان کرتے تھے کہ اللهم إني أعوذ بك من البخل ، ‏‏‏‏ وأعوذ بك من الجبن ، ‏‏‏‏ وأعوذ بك أن أرد إلى أرذل العمر ، ‏‏‏‏ وأعوذ بك من فتنۃ الدنيا ، ‏‏‏‏ وأعوذ بك من عذاب القبر ‏ ” اے اللہ ! میں تیری پناہ مانگتا ہوں بخل سے ، میں تیری پناہ مانگتا ہوں بزدلی سے ، میں تیری پناہ مانگتا ہوں اس سے کہ ناکارہ عمر میں پہنچا دیا جاؤں ، میں تیری پناہ مانگتا ہوں دنیا کی آزمائش سے اور میں تیری پناہ مانگتا ہوں قبر کے عذاب سے ۔ “",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہامجھ سے غندر نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے عبدالملک بن عمیر نے بیان کیا ، ان سے مصعب بن سعد نے بیان کیا اور ان سے سعد بن ابی وقاص رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ ـ رضى الله عنه ـ كَانَ يَأْمُرُ بِهَؤُلاَءِ الْخَمْسِ، وَيُحَدِّثُهُنَّ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ ‏\"‏‏.‏",
                "headingArabic": "التَّعَوُّذِ مِنَ الْبُخْلِ‏.‏ الْبُخْلُ وَالْبَخَلُ وَاحِدٌ، مِثْلُ الْحُزْنِ وَالْحَزَنِ",
                "headingUrdu": "بخل سے اللہ کی پناہ مانگنا",
                "headingEnglish": "To seek refuge with Allah from miserliness",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6110,
                "hadithNumber": "6371",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) used to seek refuge with Allah saying, \"O Allah! I seek refuge with You from laziness, and seek refuge with You from cowardice, and seek refuge with You from geriatric old age, and seek refuge with You from miserliness.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم پناہ مانگتے تھے اور کہتے تھے کہ اللهم إني أعوذ بك من الكسل ، ‏‏‏‏ وأعوذ بك من الجبن ، ‏‏‏‏ وأعوذ بك من الهرم ، ‏‏‏‏ وأعوذ بك من البخل ‏” اے اللہ ! میں تیری پناہ مانگتا ہوں سستی سے اور تیری پناہ مانگتا ہوں بزدلی سے اور تیری پناہ مانگتا ہوں ناکارہ بڑھاپے سے اور تیری پناہ مانگتا ہوں بخل سے ۔ “",
                "urduNarrator": "ہم سے اس حدیث کو ابو معمر نے بیان کیا ، انہوں نے کہا ہم سے عبدالوارث بن سعید نے بیان کیا ، ان سے عبد العزیز بن صہیب نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَعَوَّذُ يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ مِنَ الْهَرَمِ، وَأَعُوذُ بِكَ مِنَ الْبُخْلِ ‏\"‏‏.‏",
                "headingArabic": "التَّعَوُّذِ مِنْ أَرْذَلِ الْعُمُرِ‏.‏ ‏{‏أَرَاذِلُنَا‏}‏ أَسْقَاطُنَا",
                "headingUrdu": "بڑھاپے سے اللہ کی پناہ مانگنا",
                "headingEnglish": "To seek refuge with Allah from senile old age",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6111,
                "hadithNumber": "6372",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"O Allah! Make us love Medina as You made us love Mecca, or more, and transfer the fever that is in it, to Al-Juhfa. O Allah! Bless our Mudd and our Sam' (kinds of measures).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللهم حبب إلينا المدينۃ ، ‏‏‏‏ ‏‏‏‏ كما حببت إلينا مكۃ أو أشد ، ‏‏‏‏ ‏‏‏‏ وانقل حماها إلى الجحفۃ ، ‏‏‏‏ ‏‏‏‏ اللهم بارك لنا في مدنا وصاعنا ” اے اللہ ! ہمارے دل میں مدینہ کی ایسی ہی محبت پیداکر دے جیسی تو نے مکہ کی محبت ہمارے دل میں پیدا کی ہے بلکہ اس سے بھی زیادہ اور اس کے بخار کو جحفہ میں منتقل کر دے ۔ اے اللہ ! ہمارے لئے ہمارے مداور صاع میں برکت عطا فرما ۔ “",
                "urduNarrator": "ہم سے محمد بن یو سف فریابی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ، كَمَا حَبَّبْتَ إِلَيْنَا مَكَّةَ أَوْ أَشَدَّ، وَانْقُلْ حُمَّاهَا إِلَى الْجُحْفَةِ، اللَّهُمَّ بَارِكْ لَنَا فِي مُدِّنَا وَصَاعِنَا ‏\"‏‏.‏",
                "headingArabic": "الدُّعَاءِ بِرَفْعِ الْوَبَاءِ وَالْوَجَعِ",
                "headingUrdu": "وبا اور بیماریوں کو دور کرنے کے لیے اللہ سے دعا کرنا",
                "headingEnglish": "To invoke Allah to take away epidemic and diseases",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6112,
                "hadithNumber": "6373",
                "englishNarrator": "Narrated 'Amir bin Sa`d that his father said:",
                "hadithEnglish": "\"In the year of Hajjatal-Wada`, the Prophet (ﷺ) paid me a visit while I was suffering from an ailment that had brought me to the verge of death. I said, 'O Allah's Messenger (ﷺ)! My sickness has reduced me to the (bad) state as you see, and I am a rich man, but have no heirs except one daughter. Shall I give 2/3 of my property in charity?' He said, 'No.' I said, 'Then 1/2 of it?' He said, 'Even 1/3 is too much, for, to leave your inheritors wealthy is better than to leave them in poverty, begging from people. And (know that) whatever you spend in Allah's Cause, you will get reward for it, even for the morsel of food which you put in your wife's mouth.' I said, 'O Allah's Messenger (ﷺ)! Will I be left behind my companions (in Mecca)?' He said, 'If you remain behind, whatever good deed you will do for Allah's Sake, will raise and upgrade you to a higher position (in Allah's Sight). May be you will live longer so that some people may benefit by you, and some e others (pagans) may get harmed by you. O Allah! Complete the migration of my companions and do not turn them on their heels; But (we pity) the poor Sa`d bin Khaula (not the above mentioned Sa`d) (died in Mecca)\" Allah's Messenger (ﷺ) lamented (or pitied) for him as he died in Mecca. (See Hadith No. 693, Vol. 5)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم حجۃ الوداع کے موقع پر میری عیادت کے لئے تشریف لائے ۔ میر ی اس بیماری نے مجھے موت سے قریب کر دیا تھا ۔ میں نے عرض کیا یا رسول اللہ ! آپ خود مشاہدہ فر مارہے ہیں کہ بیماری نے مجھے کہاں پہنچا دیا ہے اور میرے پاس مال و دولت ہے اور سوا ایک لڑکی کے اس کا اور کوئی وارث نہیں ، کیا میں اپنی دولت کا دو تہائی صدقہ کر دوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ۔ میں نے عرض کیا پھر آدھی کا کر دوں ؟ فرمایا کہ ایک تہائی بہت ہے اگر تم اپنے وارثوں کو مالدار چھوڑو تو یہ اس سے بہتر ہے کہ انہیں محتاج چھوڑو اور وہ لوگوں کے سامنے ہاتھ پھیلاتے پھریں اور یقین رکھو کہ تم جو کچھ بھی خرچ کرو گے اور اس سے مقصود اللہ کی خوشنودی ہوئی تمہیں تو اس پر ثواب ملے گا ، یہاں تک کہ اگر تم اپنی بیوی کے منہ میں لقمہ رکھو ( تو اس پر بھی ثواب ملے گا ) میں نے عرض کیا میں اپنے ساتھیوں سے پیچھے چھوڑ دیا جاؤں گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر تم پیچھے چھوڑ دئیے جاؤ اور پھر کوئی عمل کرو جس سے مقصود اللہ کی رضا ہو تو تمہارا مرتبہ بلند ہو گا اور امید ہے کہ تم ابھی زندہ رہو گے اور کچھ قومیں تم سے فائدہ اٹھا ئیں گی اور کچھ نقصان اٹھائیں گی ۔ اے اللہ ! میرے صحابہ کی ہجرت کو کامیاب فرما اور انہیں الٹے پاؤں واپس نہ کر ، البتہ افسوس سعد بن خولہ کا ہے ۔ سعد نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان پر افسوس کا اظہار اس وجہ سے کیا تھا کہ ان کا انتقال مکہ معظمہ میں ہو گیا تھا ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے ، کہا ہم کو ابن شہاب نے خبر دی ، انہیں عامر بن سعد نے اور ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، أَنَّ أَبَاهُ، قَالَ عَادَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ مِنْ شَكْوَى، أَشْفَيْتُ مِنْهَا عَلَى الْمَوْتِ، فَقُلْتُ يَا رَسُولَ اللَّهِ بَلَغَ بِي مَا تَرَى مِنَ الْوَجَعِ، وَأَنَا ذُو مَالٍ، وَلاَ يَرِثُنِي إِلاَّ ابْنَةٌ لِي وَاحِدَةٌ، أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ قُلْتُ فَبِشَطْرِهِ قَالَ ‏\"‏ الثُّلُثُ كَثِيرٌ، إِنَّكَ أَنْ تَذَرَ وَرَثَتَكَ أَغْنِيَاءَ، خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ، وَإِنَّكَ لَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ، إِلاَّ أُجِرْتَ، حَتَّى مَا تَجْعَلُ فِي فِي امْرَأَتِكَ ‏\"‏‏.‏ قُلْتُ أَأُخَلَّفُ بَعْدَ أَصْحَابِي قَالَ ‏\"‏ إِنَّكَ لَنْ تُخَلَّفَ فَتَعْمَلَ عَمَلاً تَبْتَغِي بِهِ وَجْهَ اللَّهِ، إِلاَّ ازْدَدْتَ دَرَجَةً وَرِفْعَةً وَلَعَلَّكَ تُخَلَّفُ حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ، وَيُضَرَّ بِكَ آخَرُونَ، اللَّهُمَّ أَمْضِ لأَصْحَابِي هِجْرَتَهُمْ، وَلاَ تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ، لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ ‏\"‏‏.‏ قَالَ سَعْدٌ رَثَى لَهُ النَّبِيُّ صلى الله عليه وسلم مِنْ أَنْ تُوُفِّيَ بِمَكَّةَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6113,
                "hadithNumber": "6374",
                "englishNarrator": "Narrated Sa`d:",
                "hadithEnglish": "Seek refuge with Allah by saying the words which the Prophet (ﷺ) used to say while seeking refuge with Allah, \"0 Allah! I seek refuge with You from cowardice, and seek refuge with You from miserliness, and seek refuge with You from reaching a degraded geriatric old age, and seek refuge with You from the afflictions of the world and from the punishment in the grave.\"",
                "hadithUrdu": "ان کلمات کے ذریعہ اللہ کی پناہ مانگوجن کے ذریعہ نبی کریم صلی اللہ علیہ وسلم پناہ مانگتے تھے اللهم إني أعوذ بك من الجبن ، ‏‏‏‏ وأعوذ بك من البخل ، ‏‏‏‏ وأعوذ بك من أن أرد إلى أرذل العمر ، ‏‏‏‏ وأعوذ بك من فتنۃ الدنيا ، ‏‏‏‏ وعذاب القبر ” اے اللہ ! میں تیری پناہ مانگتا ہوں بزدلی سے ، تیری پناہ مانگتا ہوں بخل سے ، اس سے کہ ناکارہ عمر کو پہنچوں ، تیری پناہ مانگتا ہوں دنیا کی آزمائش سے اور قبر کے عذاب سے ۔ “",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، کہا ہم کو حسین بن علی جعفی نے خبر دی ، انہیں زائدہ بن قدامہ نے ، انہیں عبدالملک بن عمیر نے ، انہیں مصعب بن سعد نے اور ان سے ان کے والد نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْحُسَيْنُ، عَنْ زَائِدَةَ، عَنْ عَبْدِ الْمَلِكِ، عَنْ مُصْعَبٍ، عَنْ أَبِيهِ، قَالَ تَعَوَّذُوا بِكَلِمَاتٍ كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَعَوَّذُ بِهِنَّ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَعَذَابِ الْقَبْرِ ‏\"‏‏.‏",
                "headingArabic": "الاِسْتِعَاذَةِ مِنْ أَرْذَلِ الْعُمُرِ، وَمِنْ فِتْنَةِ الدُّنْيَا وَفِتْنَةِ النَّارِ",
                "headingUrdu": "بڑھاپے اور فتنہ سے پناہ مانگنا",
                "headingEnglish": "To seek refuge from senile old age and Fitnah",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6114,
                "hadithNumber": "6375",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) used to say, \"O Allah! I seek refuge with You from laziness from geriatric old age, from being in debt, and from committing sins. O Allah! I seek refuge with You from the punishment of the Fire, the afflictions of the grave, the punishment in the grave, and the evil of the affliction of poverty and from the evil of the affliction caused by Al-Masih Ad-Dajjal. O Allah! Wash away my sins with the water of snow and hail, and cleanse my heart from the sins as a white garment is cleansed of filth, and let there be a far away distance between me and my sins as You have set far away the East and the West from each other.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم دعا کیا کرتے تھے کہاللهم إني أعوذ بك من الكسل والهرم والمغرم والمأثم ، ‏‏‏‏ اللهم إني أعوذ بك من عذاب النار وفتنۃ النار وعذاب القبر ، ‏‏‏‏ وشر فتنۃ الغنى ، ‏‏‏‏ وشر فتنۃ الفقر ، ‏‏‏‏ ومن شر فتنۃ المسيح الدجال ، ‏‏‏‏ اللهم اغسل خطاياى بماء الثلج والبرد ، ‏‏‏‏ ونق قلبي من الخطايا ، ‏‏‏‏ كما ينقى الثوب الأبيض من الدنس ، ‏‏‏‏ وباعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب ‏ ” اے اللہ ! میں تیری پناہ مانگتا ہوں سستی سے ، ناکارہ عمر سے ، بڑھاپے سے ، قرض سے اور گناہ سے ۔ اے اللہ ! میں تیری پناہ مانگتا ہوں دوزخ کے عذاب سے ، دوزخ کی آزمائش سے ، قبر کے عذاب سے ، مالداری کی بری آزمائش سے ، محتاجی کی بری آزمائش سے اور مسیح دجال کی بری آزمائش سے ۔ اے اللہ ! میرے گناہوںکو برف اور اولے کے پانی سے دھودے اور میرے دل کو خطاؤں سے پاک کر دے ، جس طرح سفید کپڑا میل سے صاف کر دیا جاتا ہے اور میرے اور میرے گناہوں کے درمیان اتنا فاصلہ کر دے جتنا فاصلہ مشرق و مغرب میں ہے ۔ “",
                "urduNarrator": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم سے وکیع نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد عروہ بن زبیر نے بیان کیا اور ان سے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَالْمَغْرَمِ وَالْمَأْثَمِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ وَفِتْنَةِ النَّارِ وَعَذَابِ الْقَبْرِ، وَشَرِّ فِتْنَةِ الْغِنَى، وَشَرِّ فِتْنَةِ الْفَقْرِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ خَطَايَاىَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ، وَنَقِّ قَلْبِي مِنَ الْخَطَايَا، كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6115,
                "hadithNumber": "6376",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) used to seek refuge with Allah (by saying), \"O Allah! I seek refuge with You from the affliction of the Fire and from the punishment in the Fire, and seek refuge with You from the affliction of the grave, and I seek refuge with You from the affliction of wealth, and I seek refuge with You from the affliction of poverty, and seek refuge with You from the affliction of Al-Masih Ad-Dajjal.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم پناہ مانگا کرتے تھے کہاللهم إني أعوذ بك من فتنۃ النار ومن عذاب النار ، ‏‏‏‏ وأعوذ بك من فتنۃ القبر ، ‏‏‏‏ وأعوذ بك من عذاب القبر ، ‏‏‏‏ وأعوذ بك من فتنۃ الغنى ، ‏‏‏‏ وأعوذ بك من فتنۃ الفقر ، ‏‏‏‏ وأعوذ بك من فتنۃ المسيح الدجال ” اے اللہ ! میں تیری پناہ مانگتا ہوں دوزخ کی آزمائش سے ، دوزخ کے عذاب سے اور تیری پناہ مانگتا ہوں قبر کی آزمائش سے اور تیری پناہ مانگتا ہوں قبر کے عذاب سے اور تیری پناہ مانگتا ہوں مالداری کی آزمائش سے اور تیری پناہ مانگتا ہوں مسیح دجال کی آزمائش سے ۔ “",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے سلام بن ابی مطیع نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد عروہ بن زبیر نے اور ان سے ان کی خالہ ( ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا ) نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا سَلاَّمُ بْنُ أَبِي مُطِيعٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ خَالَتِهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَعَوَّذُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَمِنْ عَذَابِ النَّارِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْغِنَى، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْفَقْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ ‏\"‏‏.‏",
                "headingArabic": "الاِسْتِعَاذَةِ مِنْ فِتْنَةِ الْغِنَى",
                "headingUrdu": "مال کے فتنے سے پناہ مانگنا",
                "headingEnglish": "To seek refuge from the Fitnah of wealth",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6116,
                "hadithNumber": "6377",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) used to say, 'O Allah! I seek refuge with You from the affliction of the Fire, the punishment of the Fire, the affliction of the grave, the punishment of the grave, and the evil of the affliction of poverty. O Allah! I seek refuge with You from the evil of the affliction of Al-Masih Ad- Dajjal, O Allah! Cleanse my heart with the water of snow and hail, and cleanse my heart from all sins as a white garment is cleansed from filth, and let there be a far away distance between me and my sins as You made the East and West far away from each other. O Allah! I seek refuge with You from laziness, sins, and from being in debt.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلمیہ دعا کیا کرتے تھے ۔اللهم إني أعوذ بك من فتنۃ النار وعذاب النار ، ‏‏‏‏ وفتنۃ القبر وعذاب القبر ، ‏‏‏‏ وشر فتنۃ الغنى وشر فتنۃ الفقر ، ‏‏‏‏ اللهم إني أعوذ بك من شر فتنۃ المسيح الدجال ، ‏‏‏‏ اللهم اغسل قلبي بماء الثلج والبرد ، ‏‏‏‏ ونق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس ، ‏‏‏‏ وباعد بيني وبين خطاياي ، ‏‏‏‏ كما باعدت بين المشرق والمغرب ، ‏‏‏‏ اللهم إني أعوذ بك من الكسل ، ‏‏‏‏ والمأثم والمغرم ” اے اللہ ! میں تیری پناہ مانگتا ہوں دوزخ کے فتنہ سے اور دوزخ کے عذاب سے اور قبر کی آزمائش سے اور قبر کے عذاب سے اور مال داری کی بری آزمائش سے اور محتاجی کی بری آزمائش سے اور مسیح دجال کی بری آزمائش سے ۔ اے اللہ ! میرے دل کو برف اور اولے کے پانی سے دھو دے اور میرے دل کو خطاؤں سے صاف کر دے جیسا کہ سفید کپڑے کو میل سے صاف کرتا ہے اور میرے اور میری خطاؤں کے درمیان اتنی دوری کر دے جتنی دوری مشرق و مغرب میں ہے ۔ اے اللہ ! میں تیری پناہ مانگتا ہوں سستی سے ، گناہ سے اور قرض سے ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم کو ابومعاویہ نے خبر دی ، انہوں نے کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں ان کے والد عروہ بن زبیر نے اور ان سے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ، وَفِتْنَةِ الْقَبْرِ وَعَذَابِ الْقَبْرِ، وَشَرِّ فِتْنَةِ الْغِنَى، وَشَرِّ فِتْنَةِ الْفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ قَلْبِي بِمَاءِ الثَّلْجِ وَالْبَرَدِ، وَنَقِّ قَلْبِي مِنَ الْخَطَايَا، كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْمَأْثَمِ وَالْمَغْرَمِ ‏\"‏‏.‏",
                "headingArabic": "التَّعَوُّذِ مِنْ فِتْنَةِ الْفَقْرِ",
                "headingUrdu": "غربت کے فتنے سے پناہ مانگنا",
                "headingEnglish": "To seek refuge from the Fitnah of poverty",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6117,
                "hadithNumber": "6378, 6379",
                "englishNarrator": "Narrated Um Sulaim رضی اللہ عنہا :",
                "hadithEnglish": "She said, \"O Allah's Messenger (ﷺ)! Anas is your servant, so please invoke for Allah's blessing for him.\" The Prophet (ﷺ) said, \"O Allah! Increase his wealth and offspring and bless (for him) whatever You give him.\" Hisham bin Zad states that he heard from Anas bin Malik رضی اللہ عنہ likewise.",
                "hadithUrdu": "انہوں نے کہا یا رسول اللہ ! انس آپ صلی اللہ علیہ وسلم کا خادم ہے اس کے لئے اللہ سے دعا کیجئے ۔ آنحضرت صلی اللہ علیہ وسلم نے دعا فرمائی اللهم أكثر ماله ، ‏‏‏‏ وولده ، ‏‏‏‏ وبارك له فيما أعطيته اے اللہ ! اس کے مال واولاد میں زیادتی کر اور جو کچھ تو اسے دے اس میں برکت عطا فرما ۔ اور ہشام بن زید سے روایت ہے کہ انہوں نے انس بن مالک رضی اللہ عنہ سے اسی طرح سنا ۔",
                "urduNarrator": "مجھ سے محمد بن بشارنے بیان کیا ، کہا ہم سے غندر ( محمد بن جعفر ) نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ میں نے قتادہ سے سنا ، ان سے انس رضی اللہ عنہ نے بیان کیا اور ان سے ام سلیم رضی اللہ عنہا نے کہا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، عَنْ أَنَسٍ، عَنْ أُمِّ سُلَيْمٍ، أَنَّهَا قَالَتْ يَا رَسُولَ اللَّهِ أَنَسٌ خَادِمُكَ ادْعُ اللَّهَ لَهُ قَالَ ‏ \"‏ اللَّهُمَّ أَكْثِرْ مَالَهُ وَوَلَدَهُ، وَبَارِكْ لَهُ فِيمَا أَعْطَيْتَهُ ‏\"‏‏.‏ وَعَنْ هِشَامِ بْنِ زَيْدٍ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، مِثْلَهُ.",
                "headingArabic": "الدُّعَاءِ بِكَثْرَةِ الْمَالِ وَالوَلَدِ مَعَ الْبَرَكَةِ",
                "headingUrdu": "مال، اولاد اور برکت میں اضافے کی دعا",
                "headingEnglish": "The invocation for increase in wealth, offspring and blessing",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6118,
                "hadithNumber": "6380, 6381",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "Um Sulaim رضی اللہ عنہا said (to the Prophet), \"Anas رضی اللہ عنہ is your servant; so please invoke for Allah's blessings for him.\" He said \"O Allah! Increase his wealth and offspring, and Bless (for him) whatever You give him.\"",
                "hadithUrdu": "ام سلیم رضی اللہ عنہا نے عرض کیا کہ حضور ! انس رضی اللہ عنہ آپ کا خادم ہے اس کے لئے دعا فرمائیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایااللهم أكثر ماله وولده ، ‏‏‏‏ وبارك له فيما أعطيته ” اے اللہ ! اس کے مال واولاد میں زیادتی کر اور جو کچھ تودے اس میں برکت عطا فرما ۔",
                "urduNarrator": "ہم سے ابوزید سعید بن ربیع نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے ، انہوں نے کہامیں نے انس رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو زَيْدٍ، سَعِيدُ بْنُ الرَّبِيعِ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ قَالَ قَالَتْ أُمُّ سُلَيْمٍ أَنَسٌ خَادِمُكَ‏.‏ قَالَ ‏ \"‏ اللَّهُمَّ أَكْثِرْ مَالَهُ وَوَلَدَهُ، وَبَارِكْ لَهُ فِيمَا أَعْطَيْتَهُ ‏\"‏‏.",
                "headingArabic": "الدُّعَاءِ بِكَثْرَةِ الوَلَدِ مَعَ الْبَرَكَةِ",
                "headingUrdu": "اس کی برکتوں کے ساتھ اولاد میں اضافے کی دعا کرنا۔",
                "headingEnglish": "To invoke for increase of offspring, along with His Blessings.",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6119,
                "hadithNumber": "6382",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) used to teach us the Istikhara for each and every matter as he used to teach us the Suras from the Holy Qur'an. (He used to say), \"If anyone of you intends to do something, he should offer a two-rak`at prayer other than the obligatory prayer, and then say: 'O Allah I beseech You for the goodness through Your knowledge, and I request You for the power by Your Power, and ask You for Your great Bounty for You have Power whereas I don't, You know but I don't, and You know best the invisible things. O Allah! If according to Your knowledge, this matter is good for me regarding my religion, my economic condition and hereafter, or better regarding my worldly life or the Hereafter, decree it for me; and if this matter is unfavourable for me regarding my religion, worldly life and my hereafter, or he said: Unfavourable regarding worldly life and the life in the Hereafter, keep it away from me and keep me away from it, and destine that thing for me wherein lies my goodness wherever it may be, then make me pleased with it and then he mentioned his need.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ہمیں تمام معاملات میں استخارہ کی تعلیم دیتے تھے ، قرآن کی سورت کی طرح ( نبی اکرم صلی اللہ علیہ وسلم نے فرمایا ) جب تم میں سے کوئی شخص کسی ( مباح ) کام کا ارادہ کرے ( ابھی پکا عزم نہ ہوا ہو ) تو دو رکعات ( نفل ) پڑھے اس کے بعد یوں دعا کرے ” اے اللہ ! میں بھلائی مانگتا ہوں ( استخارہ ) تیری بھلائی سے ، تو علم والا ہے ، مجھے علم نہیں اور تو تمام پوشید ہ باتوں کو جاننے والا ہے ، اے اللہ ! اگر تو جانتا ہے کہ یہ کام میرے لئے بہتر ہے ، میرے دین کے اعتبار سے ، میری معاش اور میرے انجام کار کے اعتبار سے یا دعا میں یہ الفاظ کہے ” فی عاجل امری وآجلہ “ تو اسے میرے لئے مقدر کر دے اور اگر تو جانتا ہے کہ یہ کام میرے لئے برا ہے میرے دین کے لئے ، میری زندگی کے لئے اور میرے انجام کار کے لئے یا یہ الفاظ فرمائے ” فی عاجل امری وآجلہ “ تو اسے مجھ سے پھیر دے اور مجھے اس سے پھیر دے اور میرے لئے بھلائی مقدر کر دے جہاں کہیں بھی وہ ہو اور پھر مجھے اس سے مطمئن کر دے ( یہ دعا کرتے وقت ) اپنی ضرورت کا بیان کر دینا چاہئے ۔",
                "urduNarrator": "ہم سے ابو مصعب مطرف بن عبداللہ نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن ابی الموال نے بیان کیا ، ان سے محمد بن منکدر نے اور ان سے جابر رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا مُطَرِّفُ بْنُ عَبْدِ اللَّهِ أَبُو مُصْعَبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعَلِّمُنَا الاِسْتِخَارَةَ فِي الأُمُورِ كُلِّهَا كَالسُّورَةِ مِنَ الْقُرْآنِ ‏ \"‏ إِذَا هَمَّ بِالأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ، ثُمَّ يَقُولُ اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ، وَتَعْلَمُ وَلاَ أَعْلَمُ، وَأَنْتَ عَلاَّمُ الْغُيُوبِ، اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي ـ أَوْ قَالَ عَاجِلِ أَمْرِي وَآجِلِهِ ـ فَاقْدُرْهُ لِي، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي ـ أَوْ قَالَ فِي عَاجِلِ أَمْرِي وَآجِلِهِ ـ فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ رَضِّنِي بِهِ‏.‏ وَيُسَمِّي حَاجَتَهُ ‏\"‏‏.‏",
                "headingArabic": "الدُّعَاءِ عِنْدَ الاِسْتِخَارَةِ",
                "headingUrdu": "استخارہ کرنے کی دعا",
                "headingEnglish": "The invocation on making Istikharah",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6120,
                "hadithNumber": "6383",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) asked for some water and performed the ablution, and then raised his hands (towards the sky) and said, \"O Allah! Forgive `Ubaid Abi 'Amir.\" I saw the whiteness of his armpits (while he was raising his hands) and he added, \"O Allah! Upgrade him over many of Your human creatures on the Day of Resurrection.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے پانی مانگا ، پھر آپ صلی اللہ علیہ وسلم نے وضو کیا ، پھر ہاتھ اٹھا کر یہ دعا کی ۔ ” اے اللہ ! عبید ابوعامر کی مغفرت فرما ۔ “ میں نے اس وقت آنحضرت صلی اللہ علیہ وسلم کی بغل کی سفیدی دیکھی ۔ پھر آپ صلی اللہ علیہ وسلم نے دعا کی ۔ ” اے اللہ ! قیامت کے دن اسے اپنی بہت سی انسانی مخلوق سے بلند مرتبہ عطا فرمائیو ۔ “",
                "urduNarrator": "ہم سے محمد بن علاء نے بیان کیا ، کہا ہم سے اسامہ نے بیان کیا ، ان سے برید بن عبداللہ نے ، ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ دَعَا النَّبِيُّ صلى الله عليه وسلم بِمَاءٍ فَتَوَضَّأَ، ثُمَّ رَفَعَ يَدَيْهِ فَقَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لِعُبَيْدٍ أَبِي عَامِرٍ ‏\"‏‏.‏ وَرَأَيْتُ بَيَاضَ إِبْطَيْهِ فَقَالَ ‏\"‏ اللَّهُمَّ اجْعَلْهُ يَوْمَ الْقِيَامَةِ فَوْقَ كَثِيرٍ مِنْ خَلْقِكَ مِنَ النَّاسِ ‏\"‏‏.‏",
                "headingArabic": "الدُّعَاءِ عِنْدَ الْوُضُوءِ",
                "headingUrdu": "وضو کرتے وقت اللہ کو پکارنا",
                "headingEnglish": "Invoking Allah while performing ablution",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6121,
                "hadithNumber": "6384",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "We were in the company of the Prophet (ﷺ) on a journey, and whenever we ascended a high place, we used to say Takbir (in a loud voice). The Prophet (ﷺ) said, \"O people! Be kind to yourselves, for you are not calling upon a deaf or an absent one, but You are calling an All-Hearer, and an All-Seer.\" Then he came to me as I was reciting silently, \"La haul a wala quwwata illa bil-lah.\" He said, \"O `Abdullah bin Qais! Say: La haul a walaquwata illa bil-lah, for it is one of the treasures of Paradise.\" Or he said, \"Shall I tell you a word which is one of the treasures of Paradise? It is: La haul a wala quwwata illa bil-lah.\"",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے جب ہم کسی بلند جگہ پر چڑھتے تو تکبیر کہتے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا لوگو ! اپنے اوپر رحم کرو ، تم کسی بہرے غائب خدا کو نہیں پکارتے ہو تم تو اس ذات کو پکارتے ہو جو بہت زیادہ سننے والا ، بہت زیادہ دیکھنے والا ہے ۔ پھر آنحضرت صلی اللہ علیہ وسلم میرے پاس تشریف لائے ۔ میں اس وقت زیر لب کہہ رہا تھا ۔ ” لا حول ولا قوۃ إلا بالله “ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، عبداللہ بن قیس کہو ” لا حول ولا قوۃ إلا بالله “ کیونکہ یہ جنت کے خزانوں میں سے ایک خزانہ ہے ، یا آنحضرت صلی اللہ علیہ وسلم نے یہ فرمایا میں تمہیں ایک ایسا کلمہ نہ بتا دوں جو جنت کے خزانوں میں سے ایک خزانہ ہے ۔ لا حول ولا قوۃ إلا بالله ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ابوایوب سختیانی نے بیان کیا ، ان سے ابوعثمان نہدی نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ فَكُنَّا إِذَا عَلَوْنَا كَبَّرْنَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَيُّهَا النَّاسُ ارْبَعُوا عَلَى أَنْفُسِكُمْ، فَإِنَّكُمْ لاَ تَدْعُونَ أَصَمَّ وَلاَ غَائِبًا، وَلَكِنْ تَدْعُونَ سَمِيعًا بَصِيرًا ‏\"‏‏.‏ ثُمَّ أَتَى عَلَىَّ وَأَنَا أَقُولُ فِي نَفْسِي لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ‏.‏ فَقَالَ ‏\"‏ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ قُلْ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ فَإِنَّهَا‏.‏ كَنْزٌ مِنْ كُنُوزِ الْجَنَّةِ ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ أَلاَ أَدُلُّكَ عَلَى كَلِمَةٍ هِيَ كَنْزٌ مِنْ كُنُوزِ الْجَنَّةِ، لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏\"‏‏.‏",
                "headingArabic": "الدُّعَاءِ إِذَا عَلاَ عَقَبَةً",
                "headingUrdu": "اونچی جگہ پر چڑھتے ہوئے اللہ کو پکارنا",
                "headingEnglish": "Invoking Allah while ascending a high place",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6122,
                "hadithNumber": "6385",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Whenever Allah's Messenger (ﷺ) returned from a Ghazwa or Hajj or `Umra, he used to say, \"Allahu Akbar,\" three times; whenever he went up a high place, he used to say, There is no worthy of worship saves Allah, He is One and has no partnet, He is the kingdom, and all praiseis due to him, and He can do what He pleases, we are those who return, repent, worship,glorify our Lord.Allah has substantiated His bondsman and alone Vanquished the troops. Allah has promised to fight truthfully, help His servant and defeat all the armies. \"La ilaha illal-lahu wahdahu la sharika lahu, lahu-l-mulk wa lahu-l-hamd, wa huwa'ala kulli Shai 'in qadir. Ayibuna ta'ibuna 'abiduna lirabbina hamidun. Sadaqa-l-lahu wa'dahu, wa nasara`Abdahu wa hazama-l-ahzaba wahdahu.\"",
                "hadithUrdu": "رسول اللہ کریم صلی اللہ علیہ وسلم جب کسی غزوہ یا حج یا عمرہ سے واپس ہوتے تو زمین سے ہر بلند چیز پر چڑھتے وقت تین تکبیر یں کہا کرتے تھے ۔ پھر دعا کرتے ” اللہ کے سوا کوئی معبود نہیں ، تنہا ہے اس کا کوئی شریک نہیں ، اس کے لئے بادشاہی ہے اور اسی کے لئے تمام تعریفیں ہیں اور وہ ہر چیز پر قدرت رکھنے والا ہے ۔ لوٹتے ہیں ہم توبہ کرتے ہوئے اپنے رب کی عبادت کرتے ہوئے اور حمد بیان کرتے ہوئے ۔ اللہ نے اپنا وعدہ سچ کر دکھایا ، اپنے بندہ کی مدد کی اور تنہا تمام لشکر کو شکست دی ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، انہوں نے کہا ہم سے نافع نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا قَفَلَ مِنْ غَزْوٍ أَوْ حَجٍّ أَوْ عُمْرَةٍ يُكَبِّرُ عَلَى كُلِّ شَرَفٍ مِنَ الأَرْضِ ثَلاَثَ تَكْبِيرَاتٍ، ثُمَّ يَقُولُ ‏ \"‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهْوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ، آيِبُونَ تَائِبُونَ، عَابِدُونَ لِرَبِّنَا، حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الأَحْزَابَ وَحْدَهُ ‏\"‏‏.‏",
                "headingArabic": "الدُّعَاءِ إِذَا أَرَادَ سَفَرًا أَوْ رَجَعَ",
                "headingUrdu": "سفر پر جاتے ہوئے یا واپسی کے وقت دعا",
                "headingEnglish": "The invocation while going on a journey or returning",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6123,
                "hadithNumber": "6386",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) seeing a yellow mark (of perfume) on the clothes of `Abdur-Rahman bin `Auf رضی اللہ عنہ , said, \"What about you?\" `Abdur-Rahman replied, \"I have married a woman with a Mahr of gold equal to a date-stone.\" The Prophet (ﷺ) said, \"May Allah bestow His Blessing on you (in your marriage). Give a wedding banquet, (Walima) even with one sheep.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے عبدالرحمٰن بن عوف رضی اللہ عنہ پر زردی کا اثر دیکھا تو فرمایا یہ کیا ہے ؟ کہا کہ میں نے ایک عورت سے ایک گٹھلی کے برابرسونے پر شادی کی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تمہیں برکت عطا فرمائے ، ولیمہ کر ، چاہے ایک بکری کا ہی ہو ۔",
                "urduNarrator": "ہم سے مسددنے بیان کیا ، انہوں نے کہا ہم سے حماد بن زید رضی اللہ عنہ نے بیان کیا کہ، انہوں نے ثابت کی سند سے، وہ انس رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ رَأَى النَّبِيُّ صلى الله عليه وسلم عَلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَثَرَ صُفْرَةٍ فَقَالَ ‏\"‏ مَهْيَمْ ‏\"‏‏.‏ أَوْ ‏\"‏ مَهْ ‏\"‏‏.‏ قَالَ تَزَوَّجْتُ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ فَقَالَ ‏\"‏ بَارَكَ اللَّهُ لَكَ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏",
                "headingArabic": "الدُّعَاءِ لِلْمُتَزَوِّجِ",
                "headingUrdu": "دولہا کے لیے دعا",
                "headingEnglish": "Invocation for a bridegroom",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6124,
                "hadithNumber": "6387",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "My father died and left behind seven or nine daughters, and I married a woman. The Prophet (ﷺ) said, \"Did you get married, O Jabir?\" I replied, \"Yes.\" He asked, \"Is she a virgin or a matron?\" I replied, \"She is a matron.\" He said, \"Why didn't you marry a virgin girl so that you might play with her and she with you (or, you might make her laugh and she make you laugh)?\" I said, \"My father died, leaving seven or nine girls (orphans) and I did not like to bring a young girl like them, so I married a woman who can look after them.\" He said, \"May Allah bestow His Blessing on you.\" Ibn-e-Qyainah and Muhammad bin Muslim did not report '' بَارَكَ اللَّهُ عَلَيْكَ'' from Amr (bin Dinaar)",
                "hadithUrdu": "میرے والد شہید ہوئے تو انہوں نے سات یانو لڑکیاں چھوڑی تھیں ( راوی کو تعداد میں شبہ تھا ) پھر میں نے ایک عورت سے شادی کی تو رسول اللہ صلی اللہ علیہ وسلم نے دریافت فرمایا ، جابر کیا تم نے شادی کر لی ہے ؟ میں نے کہا جی ہاں ۔ فرمایا کنواری سے یا بیوہ سے ؟ میں نے کہا بیاہی سے ۔ فرمایا ، کسی لڑکی سے کیوں نہ کی ۔ تم اس کے ساتھ کھیلتے اور وہ تمہارے ساتھ کھیلتی یا ( انحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ) تم اسے ہنساتے اور وہ تمہیں ہنساتی ۔ میں نے عرض کی ، میرے والد ( حضرت عبداللہ ) شہید ہوئے اور سات یا نو لڑکیاں چھوڑی ہیں ۔ اس لئے میں نے پسند نہیں کیا کہ میں ان کے پاس انہی جیسی لڑکی لاؤں ۔ چنانچہ میں نے ایسی عورت سے شادی کی جو ان کی نگرانی کر سکے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، اللہ تمہیں برکت عطا فرمائے ۔ ابن عیینہ اور محمد بن مسلمہ نے عمروسے روایت میں ۔ ” اللہ تمہیں برکت عطا فرمائے “ کے الفاظ نہیں کہے ۔",
                "urduNarrator": "ہم سے ابو النعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے عمرو نے اور ان سے جابر رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ هَلَكَ أَبِي وَتَرَكَ سَبْعَ ـ أَوْ تِسْعَ ـ بَنَاتٍ، فَتَزَوَّجْتُ امْرَأَةً فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَزَوَّجْتَ يَا جَابِرُ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ بِكْرًا أَمْ ثَيِّبًا ‏\"‏‏.‏ قُلْتُ ثَيِّبًا‏.‏ قَالَ ‏\"‏ هَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ، أَوْ تُضَاحِكُهَا وَتُضَاحِكُكَ ‏\"‏‏.‏ قُلْتُ هَلَكَ أَبِي فَتَرَكَ سَبْعَ ـ أَوْ تِسْعَ ـ بَنَاتٍ، فَكَرِهْتُ أَنْ أَجِيئَهُنَّ بِمِثْلِهِنَّ، فَتَزَوَّجْتُ امْرَأَةً تَقُومُ عَلَيْهِنَّ‏.‏ قَالَ ‏\"‏ فَبَارَكَ اللَّهُ عَلَيْكَ ‏\"‏‏.‏ لَمْ يَقُلِ ابْنُ عُيَيْنَةَ وَمُحَمَّدُ بْنُ مُسْلِمٍ عَنْ عَمْرٍو ‏\"‏ بَارَكَ اللَّهُ عَلَيْكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6125,
                "hadithNumber": "6388",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If anyone of you, when intending to have a sexual intercourse with his wife, says: 'Bismillah, Allahumma jannibna-sh-shaitan, wa jannibi-sh-shaitan ma razaqtana,' and if the couple are destined to have a child (out of that very sexual relation), then Satan will never be able to harm that child.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اگر کوئی شخص اپنی بیوی کے پاس آنے کا ارادہ کرے تو یہ دعا پڑھے ۔ باسم الله ، ‏‏‏‏ اللهم جنبنا الشيطان ، ‏‏‏‏ وجنب الشيطان ما رزقتنا ” اللہ کے نام سے ، اے اللہ ! ہمیں شیطان سے دور رکھ اور جو کچھ تو ہمیں عطا فرمائے اسے بھی شیطان سے دور رکھ ۔ “ تو اگر اس صحبت سے کوئی اولاد مقدر میں ہو گی تو شیطان اسے کچھ بھی نقصان نہیں پہنچا سکے گا ۔",
                "urduNarrator": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے منصور نے ، ان سے سالم نے ، ان سے کریب نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَالِمٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لَوْ أَنَّ أَحَدَهُمْ إِذَا أَرَادَ أَنْ يَأْتِيَ أَهْلَهُ قَالَ بِاسْمِ اللَّهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا، فَإِنَّهُ إِنْ يُقَدَّرْ بَيْنَهُمَا وَلَدٌ فِي ذَلِكَ، لَمْ يَضُرَّهُ شَيْطَانٌ أَبَدًا ‏\"‏‏.‏",
                "headingArabic": "مَا يَقُولُ إِذَا أَتَى أَهْلَهُ",
                "headingUrdu": "بیوی سے ہمبستری کرنے سے پہلے کیا کہنا چاہیے؟",
                "headingEnglish": "What one should say before having sexual intercourse with his wife",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6126,
                "hadithNumber": "6389",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The most frequent invocation of The Prophet (ﷺ) was: \"O Allah! Give to us in the world that which is good and in the Hereafter that which is good, and save us from the torment of the Fire.\" (2.201)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی اکثر یہ دعا ہوا کرتی تھی اللهم ربنا آتنا في الدنيا حسنۃ ، ‏‏‏‏ وفي الآخرۃ حسنۃ ، ‏‏‏‏ وقنا عذاب النار ” اے اللہ ! ہمیں دنیا میں بھلائی ( حسنہ ) عطا کر اور آخرت میں بھلائی عطاکر اور ہمیں دوزخ سے بچا ۔ “",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، انہوں نے کہا ہم سے عبدالوارث نے بیان کیا ، ان سے عبد العزیز نے بیان کیا اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ كَانَ أَكْثَرُ دُعَاءِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ اللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً»",
                "headingUrdu": "\"اے ہمارے رب! ہمیں اس دنیا میں بھی بھلائی عطا فرما اور آخرت میں بھی جو اچھا ہے اور ہمیں آگ کے عذاب سے بچا\"۔",
                "headingEnglish": "\"Our Lord! Give us in this world that which is good and in the Hereafter that which is good and save us from the torment of the Fire!\"",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6127,
                "hadithNumber": "6390",
                "englishNarrator": "Narrated Sa`d bin Abi Waqqas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) used to teach us these words as he used to teach us the Book (Qur'an): \"O Allah! seek refuge with You from miserliness, and seek refuge with You from cowardice, and seek refuge with You from being brought back to (senile) geriatric old age, and seek refuge with You from the affliction of the world and from the punishment in the Hereafter.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ہمیں یہ کلمات اس طرح سکھاتے تھے جیسے لکھنا سکھاتے تھے ۔ اللهم إني أعوذ بك من البخل ، ‏‏‏‏ وأعوذ بك من الجبن ، ‏‏‏‏ وأعوذ بك أن نرد إلى أرذل العمر ، ‏‏‏‏ وأعوذ بك من فتنۃ الدنيا ، ‏‏‏‏ وعذاب القبر ”اے اللہ تجھ سے بخل سے پناہ مانگتا ہوں، بزدلی سے تیری پناہ مانگتا ہوں اور بزدلی سے تیری پناہ مانگتا ہوں۔ بڑھاپے کی طرف واپس لایا جا رہا ہے، اور دنیا کی مصیبت اور آخرت کے عذاب سے تیری پناہ مانگتا ہوں۔\"۔",
                "urduNarrator": "ہم سے فروہ بن ابی المغراء نے بیان کیا ، انہوں نے کہا ہم سے عبیدہ بن حمیدنے بیان کیا ، ان سے عبدالملک بن عمیر نے بیان کیا ، ان سے مصعب بن سعدبن ابی وقاص رضی اللہ عنہ نے بیان کیا اور ان سے ان کے والد حضرت سعد بن ابی وقاص رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ مُصْعَبِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعَلِّمُنَا هَؤُلاَءِ الْكَلِمَاتِ كَمَا تُعَلَّمُ الْكِتَابَةُ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ مِنْ أَنْ نُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَعَذَابِ الْقَبْرِ ‏\"‏‏.‏",
                "headingArabic": "التَّعَوُّذِ مِنْ فِتْنَةِ الدُّنْيَا",
                "headingUrdu": "دنیا کے فتنے سے پناہ مانگنا",
                "headingEnglish": "To seek refuge from the fitnah of the world",
                "chapterId": "81",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 81,
                    "chapterNumber": "81",
                    "chapterEnglish": "Invocations",
                    "chapterUrdu": "دعاؤں کے بیان میں",
                    "chapterArabic": "كتاب الدعوات",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 6101,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=244",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=242",
                "label": "242",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=243",
                "label": "243",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=244",
                "label": "244",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=245",
                "label": "245",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=246",
                "label": "246",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=247",
                "label": "247",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=248",
                "label": "248",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=246",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=246",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=244",
        "to": 6125,
        "total": 40465
    }
}