{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 63,
        "data": [
            {
                "id": 1552,
                "hadithNumber": "1614, 1615",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"The first thing the Prophet (ﷺ) did on reaching Mecca, was the ablution and then he performed Tawaf of the Ka`ba and that was not `Umra (alone), (but Hajj-al-Qiran). `Urwa added: Later Abu Bakr and `Umar رضی اللہ عنہما did the same in their Hajj.\" And I performed the Hajj with my father Az-Zubair رضی اللہ عنہ , and the first thing he did was Tawaf of the Ka`ba. Later I saw the Muhajirin (Emigrants) and the Ansar doing the same. My mother (Asma') told me that she, her sister (`Aisha), Az-Zubair and such and such persons assumed Ihram for `Umra, and after they passed their hands over the Black Stone Corner (of the Ka`ba) they finished the Ihram. (i.e. After doing Tawaf of the Ka`ba and Sa`i between Safa-Marwa.)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب ( مکہ ) تشریف لائے تو سب سے پہلا کام آپ صلی اللہ علیہ وسلم نے یہ کیا کہ وضو کیا پھر طواف کیا اور طواف کرنے سے عمرہ نہیں ہوا ۔ اس کے بعد ابوبکر اور عمر رضی اللہ عنہما نے بھی اسی طرح حج کیا ۔ پھر عروہ نے کہا کہ میں نے اپنے والد زبیر رضی اللہ عنہ کے ساتھ حج کیا ، انہوں نے بھی سب سے پہلے طواف کیا ۔ مہاجرین اور انصار کو بھی میں نے اسی طرح کرتے دیکھا تھا ۔ میری والدہ ( اسماء بنت ابی بکر رضی اللہ عنہا ) نے بھی مجھے بتایا کہ انہوں نے اپنی بہن ( عائشہ رضی اللہ عنہا ) اور زبیر اور فلاں فلاں کے ساتھ عمرہ کا احرام باندھا تھا ۔ جب ان لوگوں نے حجراسود کو بوسہ دے لیا تو احرام کھول ڈالا تھا ۔",
                "urduNarrator": "ہم سے اصبغ بن فرج نے بیان کیا ، ان سے عبداللہ بن وہب نے بیان کیا کہ مجھے عمرو بن حارث نے محمد بن عبدالرحمٰن ابوالاسود سے خبر دی ، انہوں نے کہا کہ میں نے عروہ سے ( حج کا مسئلہ ) پوچھا تو انہوں نے فرمایا کہ عائشہ رضی اللہ عنہا نے مجھے خبر دی تھی کہ",
                "hadithArabic": "حَدَّثَنَا أَصْبَغُ، عَنِ ابْنِ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ،، ذَكَرْتُ لِعُرْوَةَ، قَالَ فَأَخْبَرَتْنِي عَائِشَةُ ـ رضى الله عنها ـ أَنَّ أَوَّلَ، شَىْءٍ بَدَأَ بِهِ حِينَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم أَنَّهُ تَوَضَّأَ، ثُمَّ طَافَ، ثُمَّ لَمْ تَكُنْ عُمْرَةً، ثُمَّ حَجَّ أَبُو بَكْرٍ وَعُمَرُ ـ رضى الله عنهما ـ مِثْلَهُ، ثُمَّ حَجَجْتُ مَعَ أَبِي الزُّبَيْرِ ـ رضى الله عنه ـ فَأَوَّلُ شَىْءٍ بَدَأَ بِهِ الطَّوَافُ، ثُمَّ رَأَيْتُ الْمُهَاجِرِينَ وَالأَنْصَارَ يَفْعَلُونَهُ، وَقَدْ أَخْبَرَتْنِي أُمِّي أَنَّهَا أَهَلَّتْ هِيَ وَأُخْتُهَا وَالزُّبَيْرُ وَفُلاَنٌ وَفُلاَنٌ بِعُمْرَةٍ، فَلَمَّا مَسَحُوا الرُّكْنَ حَلُّوا‏.‏",
                "headingArabic": "مَنْ طَافَ بِالْبَيْتِ إِذَا قَدِمَ مَكَّةَ، قَبْلَ أَنْ يَرْجِعَ إِلَى بَيْتِهِ، ثُمَّ صَلَّى رَكْعَتَيْنِ، ثُمَّ خَرَجَ إِلَى الصَّفَا",
                "headingUrdu": "جو شخص مکہ پہنچے اسے چاہیے کہ گھر جانے سے پہلے اللہ کے گھر کا طواف کرے، پھر دو نمازیں پڑھے، اس کے بعد صفا کو جائے۔",
                "headingEnglish": "Whosoever reaches Makkah, should perform Tawaaf of Allah's House before going home, then perform two prayers, thereafter go to saffa.",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1553,
                "hadithNumber": "1616",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) performed Tawaf of the Ka`ba for Hajj or `Umra, he used to do Ramal during the first three rounds, and in the last four rounds he used to walk; then after the Tawaf he used to offer two rak`at and then performed Tawaf between Safa and Marwa.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ( مکہ ) آنے کے بعد سب سے پہلے حج اور عمرہ کا طواف کیا تھا ۔ اس کے تین چکروں میں آپ صلی اللہ علیہ وسلم نے سعی ( رمل ) کی اور باقی چار میں حسب معمول چلے ۔ پھر طواف کی دو رکعت نماز پڑھی اور صفا مروہ کی سعی کی ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، انہوں نے کہا کہ ہم سے ابو ضمرہ انس بن عیاض نے بیان کیا ، انہوں نے کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا ، انہوں نے نافع سے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، أَنَسٌ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا طَافَ فِي الْحَجِّ أَوِ الْعُمْرَةِ أَوَّلَ مَا يَقْدَمُ سَعَى ثَلاَثَةَ أَطْوَافٍ، وَمَشَى أَرْبَعَةً، ثُمَّ سَجَدَ سَجْدَتَيْنِ، ثُمَّ يَطُوفُ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1554,
                "hadithNumber": "1617",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When the Prophet (ﷺ) used to perform the circuit of the Ka'bah first time, he would run the first three circuits walkthe four he (ﷺ) would also also run  through the Batnul Maseel (a depression: Irfan) when he(ﷺ) would march between Safa and Merwah.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب بیت اللہ کا پہلا طواف ( یعنی طواف قدوم ) کرتے تو اس کے تین چکروں میں آپ صلی اللہ علیہ وسلم دوڑ کر چلتے اور چار میں معمول کے موافق چلتے پھر جب صفا اور مروہ کی سعی کرتے تو ”بطن مسیل“ ( وادی ) میں دوڑ کر چلتے ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، انہوں نے کہا کہ ہم سے انس بن عیاض نے بیان کیا ، ان سے عبیداللہ عمری نے ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا طَافَ بِالْبَيْتِ الطَّوَافَ الأَوَّلَ يَخُبُّ ثَلاَثَةَ أَطْوَافٍ، وَيَمْشِي أَرْبَعَةً، وَأَنَّهُ كَانَ يَسْعَى بَطْنَ الْمَسِيلِ إِذَا طَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1555,
                "hadithNumber": "1618",
                "englishNarrator": "Narrated Ataa:",
                "hadithEnglish": "When Ibn-e-Hisham prevented women from performing Tawaaf along with men, he said: How can you prevent them doing so when the prophet's wives made circuit along with men? I asked: Before or after the commandment related to veil? Ibn Juraij said, \" `Ata informed us that when Ibn Hisham forbade women to perform Tawaf with men he said to him, 'How do you forbid them while the wives of the Prophet (ﷺ) used to perform Tawaf with the men?' I said, 'Was this before decreeing of the use of the veil or after it? `Ata took an oath and said, 'I saw it after the order of veil.' I said, 'How did they mix with the men?' `Ata said, 'The women never mixed with the men, and `A'ishah used to perform Tawaf separately and never mixed with men. Once it happened that `A'ishah was performing the Tawaf and woman said to her, 'O Mother of believers! Let us touch the Black stone.' `A'ishah said to her, 'Go yourself,' and she herself refused to do so. The wives of the Prophet (ﷺ) used to come out in night, in disguise and used to perform Tawaf with men. But whenever they intended to enter the Ka`bah, they would stay outside till the men had gone out. I and `Ubaid bin `Umair used to visit `A'ishah while she was residing at Jauf Thabir.\" I asked, \"What was her veil?\" `Ata said, \"She was wearing an old Turkish veil, and that was the only thing (veil) which was screen between us and her. I saw a pink cover on her.\"",
                "hadithUrdu": "جب ابن ہشام ( جب وہ ہشام بن عبدالملک کی طرف سے مکہ کا حاکم تھا ) نے عورتوں کو مردوں کے ساتھ طواف کرنے سے منع کر دیا تو اس سے انہوں نے کہا کہ تم کس دلیل پر عورتوں کو اس سے منع کر رہے ہو ؟ جب کہ رسول اللہ صلی اللہ علیہ وسلم کی پاک بیویوں نے مردوں کے ساتھ طواف کیا تھا ۔ ابن جریج نے پوچھا یہ پردہ ( کی آیت نازل ہونے ) کے بعد کا واقعہ ہے یا اس سے پہلے کا ؟ انہوں نے کہا میری عمر کی قسم ! میں نے انہیں پردہ ( کی آیت نازل ہونے ) کے بعد دیکھا ۔ اس پر ابن جریج نے پوچھا کہ پھر مرد عورت مل جل جاتے تھے ۔ انہوں نے فرمایا کہ اختلاط نہیں ہوتا تھا ، عائشہ رضی اللہ عنہا مردوں سے الگ رہ کر ایک الگ کونے میں طواف کرتی تھیں ، ان کے ساتھ مل کر نہیں کرتی تھیں ۔ ایک عورت ( وقرہ نامی ) نے ان سے کہا ام المؤمنین ! چلئے ( حجراسود کو ) بوسہ دیں ۔ تو آپ نے انکار کر دیا اور کہا تو جا چوم ، میں نہیں چومتی اور ازواج مطہرات رات میں پردہ کر کے نکلتی تھیں کہ پہچانی نہ جاتیں اور مردوں کے ساتھ طواف کرتی تھیں ۔ البتہ عورتیں جب کعبہ کے اندر جانا چاہتیں تو اندر جانے سے پہلے باہر کھڑی ہو جاتیں اور مرد باہر آ جاتے ( تو وہ اندر جاتیں ) میں اور عبید بن عمیر عائشہ رضی اللہ عنہا کی خدمت میں اس وقت حاضر ہوئے جب آپ ثبیر ( پہاڑ ) پر ٹھہری ہوئی تھیں ، ( جو مزدلفہ میں ہے ) ابن جریج نے کہا کہ میں نے عطاء سے پوچھا کہ اس وقت پردہ کس چیز سے تھا ؟ عطاء نے بتایا کہ ایک ترکی قبہ میں ٹھہری ہوئی تھیں ۔ اس پر پردہ پڑا ہوا تھا ۔ ہمارے اور ان کے درمیان اس کے سوا اور کوئی چیز حائل نہ تھی ۔ اس وقت میں نے دیکھا کہ ان کے بدن پر ایک گلابی رنگ کا کرتہ تھا ۔",
                "urduNarrator": "امام بخاری رحمہ اللہ نے کہا کہ مجھ سے عمرو بن علی نے بیان کیا ، کہا کہ ہم سے ابوعاصم نے بیان کیا ، ان سے ابن جریج نے بیان کیا اور انہیں عطاء نے خبر دی کہ",
                "hadithArabic": "وَقَالَ لِي عَمْرُو بْنُ عَلِيٍّ حَدَّثَنَا أَبُو عَاصِمٍ، قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنَا قَالَ أَخْبَرَنِي عَطَاءٌ، إِذْ مَنَعَ ابْنُ هِشَامٍ النِّسَاءَ الطَّوَافَ مَعَ الرِّجَالِ قَالَ كَيْفَ يَمْنَعُهُنَّ، وَقَدْ طَافَ نِسَاءُ النَّبِيِّ صلى الله عليه وسلم مَعَ الرِّجَالِ قُلْتُ أَبَعْدَ الْحِجَابِ أَوْ قَبْلُ قَالَ إِي لَعَمْرِي لَقَدْ أَدْرَكْتُهُ بَعْدَ الْحِجَابِ‏.‏ قُلْتُ كَيْفَ يُخَالِطْنَ الرِّجَالَ قَالَ لَمْ يَكُنَّ يُخَالِطْنَ كَانَتْ عَائِشَةُ ـ رضى الله عنها ـ تَطُوفُ حَجْرَةً مِنَ الرِّجَالِ لاَ تُخَالِطُهُمْ، فَقَالَتِ امْرَأَةٌ انْطَلِقِي نَسْتَلِمْ يَا أُمَّ الْمُؤْمِنِينَ‏.‏ قَالَتْ ‏{‏انْطَلِقِي‏}‏ عَنْكِ‏.‏ وَأَبَتْ‏.‏ ‏{‏وَكُنَّ‏}‏ يَخْرُجْنَ مُتَنَكِّرَاتٍ بِاللَّيْلِ، فَيَطُفْنَ مَعَ الرِّجَالِ، وَلَكِنَّهُنَّ كُنَّ إِذَا دَخَلْنَ الْبَيْتَ قُمْنَ حَتَّى يَدْخُلْنَ وَأُخْرِجَ الرِّجَالُ، وَكُنْتُ آتِي عَائِشَةَ أَنَا وَعُبَيْدُ بْنُ عُمَيْرٍ وَهِيَ مُجَاوِرَةٌ فِي جَوْفِ ثَبِيرٍ‏.‏ قُلْتُ وَمَا حِجَابُهَا قَالَ هِيَ فِي قُبَّةٍ تُرْكِيَّةٍ لَهَا غِشَاءٌ، وَمَا بَيْنَنَا وَبَيْنَهَا غَيْرُ ذَلِكَ، وَرَأَيْتُ عَلَيْهَا دِرْعًا مُوَرَّدًا‏.‏",
                "headingArabic": "طَوَافِ النِّسَاءِ مَعَ الرِّجَالِ",
                "headingUrdu": "عورتوں اور مردوں کا طواف",
                "headingEnglish": "The Tawaf of women and men",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1556,
                "hadithNumber": "1619",
                "englishNarrator": "Narrated Um Salama (the wife of the Prophet) :",
                "hadithEnglish": "I informed Allah's Messenger (ﷺ) that I was ill. So he said, \"Perform the Tawaf while riding behind the people.\" I did so, and at that time the Prophet (ﷺ) was praying beside the Ka`ba and reciting Surat-at-Tur.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے اپنے بیمار ہونے کی شکایت کی ( کہ میں پیدل طواف نہیں کر سکتی ) تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ سواری پر چڑھ کر اور لوگوں سے علیحدہ رہ کر طواف کر لے ۔ چنانچہ میں نے عام لوگوں سے الگ رہ کر طواف کیا ۔ اس وقت رسول اللہ صلی اللہ علیہ وسلم کعبہ کے پہلو میں نماز پڑھ رہے تھے اور آپ صلی اللہ علیہ وسلم «والطور * وكتاب مسطور‏» قرآت کر رہے تھے ۔",
                "urduNarrator": "ہم سے اسمٰعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا کہ ہم سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے محمد بن عبدالرحمٰن بن نوفل نے بیان کیا ، ان سے عروہ بن زبیر نے بیان کیا ، ان سے زینب بنت ابی سلمہ نے ، ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا نے بیان کیا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ شَكَوْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنِّي أَشْتَكِي‏.‏ فَقَالَ ‏\"‏ طُوفِي مِنْ وَرَاءِ النَّاسِ، وَأَنْتِ رَاكِبَةٌ ‏\"‏‏.‏ فَطُفْتُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم حِينَئِذٍ يُصَلِّي إِلَى جَنْبِ الْبَيْتِ، وَهْوَ يَقْرَأُ ‏{‏وَالطُّورِ * وَكِتَابٍ مَسْطُورٍ‏}‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1557,
                "hadithNumber": "1620",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "While the Prophet (ﷺ) was performing Tawaf of the Ka`ba, he passed by a person who had tied his hands to another person with a rope or string or something like that. The Prophet (ﷺ) cut it with his own hands and said:  \"Lead him by the hand.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کعبہ کا طواف کرتے ہوئے ایک ایسے شخص کے پاس سے گزرے جس نے اپنا ہاتھ ایک دوسرے شخص کے ہاتھ سے تسمہ یا رسی یا کسی اور چیز سے باندھ رکھا تھا ۔ نبی کریم صلی اللہ علیہ وسلم نے اپنے ہاتھ سے اسے کاٹ دیا اور پھر فرمایا کہ ” اگر ساتھ ہی چلنا ہے تو ہاتھ پکڑ کے چلو ۔“",
                "urduNarrator": "ہم سے ابرہیم بن موسیٰ نے بیان کیا ، کہا کہ ہم سے ہشام نے بیان کیا کہ ابن جریج نے انہیں خبر دی ، کہا کہ مجھے سلیمان احول نے خبر دی ، انہیں طاؤس نے خبر دی اور انہیں ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، حَدَّثَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي سُلَيْمَانُ الأَحْوَلُ، أَنَّ طَاوُسًا، أَخْبَرَهُ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ وَهُوَ يَطُوفُ بِالْكَعْبَةِ بِإِنْسَانٍ رَبَطَ يَدَهُ إِلَى إِنْسَانٍ بِسَيْرٍ، أَوْ بِخَيْطٍ، أَوْ بِشَىْءٍ غَيْرِ ذَلِكَ، فَقَطَعَهُ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ، ثُمَّ قَالَ ‏ \"‏ قُدْهُ بِيَدِهِ ‏\"‏‏.‏",
                "headingArabic": "الْكَلاَمِ فِي الطَّوَافِ",
                "headingUrdu": "طواف کے دوران گفتگو کی اجازت؟",
                "headingEnglish": "The permissibility of talking during the Tawaf",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1558,
                "hadithNumber": "1621",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) saw a man performing Tawaf of the Ka`ba tied with a string or something else. So the Prophet cut that string.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے دیکھا کہ ایک شخص کعبہ کا طواف رسی یا کسی اور چیز کے ذریعہ کر رہا ہے تو آپ صلی اللہ علیہ وسلم نے اسے کاٹ دیا ۔",
                "urduNarrator": "ہم سے ابوعاصم نے بیان کیا ، ان سے ابن جریج نے بیان کیا ، ان سے سلیمان احول نے ، ان سے طاؤس نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ سُلَيْمَانَ الأَحْوَلِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى رَجُلاً يَطُوفُ بِالْكَعْبَةِ بِزِمَامٍ أَوْ غَيْرِهِ فَقَطَعَهُ‏.‏",
                "headingArabic": "إِذَا رَأَى سَيْرًا أَوْ شَيْئًا يُكْرَهُ فِي الطَّوَافِ قَطَعَهُ",
                "headingUrdu": "جس نے طواف کے دوران تار دیکھا اور اسے کاٹ دیا۔",
                "headingEnglish": "Whoever saw a string during the Tawaf and cut it",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1559,
                "hadithNumber": "1622",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "In the year prior to the last Hajj of the Prophet (ﷺ) when Allah's Messenger (ﷺ) made Abu Bakr رضی اللہ عنہ the leader of the pilgrims, the latter (Abu Bakr) sent me in the company of a group of people to make a public announcement: 'No pagan is allowed to perform Hajj after this year, and no naked person is allowed to perform Tawaf of the Ka`ba.' (See Hadith No. 365 Vol. 1)",
                "hadithUrdu": "ابوبکر صدیق رضی اللہ عنہ نے اس حج کے موقع پر جس کا امیر رسول اللہ صلی اللہ علیہ وسلم نے انہیں بنایا تھا ۔ انہیں دسویں تاریخ کو ایک مجمع کے سامنے یہ اعلان کرنے کے لیے بھیجا تھا کہ اس سال کے بعد کوئی مشرک حج بیت اللہ نہیں کر سکتا اور نہ کوئی شخص ننگا رہ کر طواف کر سکتا ہے ۔",
                "urduNarrator": "ہم سےیحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث نے بیان کیا ، انہوں نے کہا کہ ہم سے یونس نے بیان کیا ، انہوں نے کہا کہ ہم سے ابن شہاب نے بیان کیا کہ مجھ سے حمید بن عبدالرحمٰن نے بیان کیا اور انہیں ابوہریرہ رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، قَالَ يُونُسُ قَالَ ابْنُ شِهَابٍ حَدَّثَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُ أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ ـ رضى الله عنه ـ بَعَثَهُ فِي الْحَجَّةِ الَّتِي أَمَّرَهُ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم قَبْلَ حَجَّةِ الْوَدَاعِ يَوْمَ النَّحْرِ فِي رَهْطٍ يُؤَذِّنُ فِي النَّاسِ ‏ \"‏ أَلاَ لاَ يَحُجُّ بَعْدَ الْعَامِ مُشْرِكٌ، وَلاَ يَطُوفُ بِالْبَيْتِ عُرْيَانٌ ‏\"‏‏.‏",
                "headingArabic": "لاَ يَطُوفُ بِالْبَيْتِ عُرْيَانٌ وَلاَ يَحُجُّ مُشْرِكٌ",
                "headingUrdu": "ننگے آدمی کے لیے مشرک کے لیے نہ طواف جائز ہے اور نہ حج۔",
                "headingEnglish": "It is neither permissible for a naked person to perform Tawaf nor Hajj for a Mushrik",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1560,
                "hadithNumber": "1623, 1624",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "\"May a man have sexual relations with his wife during the `Umra before performing Tawaf between Safa and Marwa?\" He said, \"Allah's Messenger (ﷺ) arrived (in Mecca) and circumambulated the Ka`ba seven times, then offered two rak`at behind Maqam Ibrahim (the station of Abraham), then performed Tawaf between Safa and Marwa.\" Ibn `Umar رضی اللہ عنہما added, \"Verily! In Allah's Messenger (ﷺ) you have a good example.\"\r\nAnd I asked Jabir bin `Abdullah رضی اللہ عنہما (the same question), and he replied, \"You should not go near your wives (have sexual relations) till you have finished Tawaf between Safa and Marwa. \"",
                "hadithUrdu": "کیا کوئی عمرہ میں صفا مروہ کی سعی سے پہلے اپنی بیوی سے ہمبستر ہو سکتا ہے ؟ انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم تشریف لائے اور کعبہ کا طواف سات چکروں سے پورا کیا ۔ پھر مقام ابراہیم کے پیچھے دو رکعت نماز پڑھی اور صفا مروہ کی سعی کی ۔ پھر عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کے طریقے میں بہترین نمونہ ہے ۔\r\nعمرو نے کہا کہ پھر میں نے جابر بن عبداللہ رضی اللہ عنہما سے اس کے متعلق معلوم کیا تو انہوں نے بتایا کہ صفا مروہ کی سعی سے پہلے اپنی بیوی کے قریب بھی نہ جائے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا کہ ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو نے بیان کیا ، انہوں نے کہا کہ ہم نے عبداللہ بن عمر رضی اللہ عنہما سے پوچھا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَأَلْنَا ابْنَ عُمَرَ ـ رضى الله عنهما ـ أَيَقَعُ الرَّجُلُ عَلَى امْرَأَتِهِ فِي الْعُمْرَةِ قَبْلَ أَنْ يَطُوفَ بَيْنَ الصَّفَا وَالْمَرْوَةِ قَالَ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ سَبْعًا، ثُمَّ صَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ، وَطَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ، وَقَالَ ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏}‏‏. قَالَ وَسَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ فَقَالَ لاَ يَقْرَبِ امْرَأَتَهُ حَتَّى يَطُوفَ بَيْنَ الصَّفَا وَالْمَرْوَةِ‏.‏",
                "headingArabic": "صَلَّى النَّبِيُّ صلى الله عليه وسلم لِسُبُوعِهِ رَكْعَتَيْنِ",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے طواف کعبہ کے سات چکروں کے بعد دو رکعت نماز پڑھی۔",
                "headingEnglish": "The Prophet ﷺ offered a two rak'ã prayer after his seven rounds (of Tawaf of the Ka'bah)",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1561,
                "hadithNumber": "1625",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) arrived at Mecca and performed Tawaf of the Ka`ba and Sa`i between Safa and Marwa, but he did not go near the Ka`ba after his Tawaf till he returned from `Arafat.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم مکہ تشریف لائے اور سات ( چکروں کے ساتھ ) طواف کیا ۔ پھر صفا مروہ کی سعی کی ۔ اس سعی کے بعد آپ صلی اللہ علیہ وسلم کعبہ اس وقت تک نہیں گئے جب تک عرفات سے واپس نہ لوٹے ۔",
                "urduNarrator": "ہم سے محمد بن ابی بکر نے بیان کیا ، انہوں نے کہا کہ ہم سے فضیل نے بیان کیا ، انہوں نے کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا ، کہا کہ مجھے کریب نے عبداللہ بن عباس رضی اللہ عنہما سے خبر دی ، ا نہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا فُضَيْلٌ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، أَخْبَرَنِي كُرَيْبٌ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم مَكَّةَ، فَطَافَ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ، وَلَمْ يَقْرَبِ الْكَعْبَةَ بَعْدَ طَوَافِهِ بِهَا حَتَّى رَجَعَ مِنْ عَرَفَةَ‏.‏",
                "headingArabic": "مَنْ لَمْ يَقْرَبِ الْكَعْبَةَ، وَلَمْ يَطُفْ حَتَّى يَخْرُجَ إِلَى عَرَفَةَ، وَيَرْجِعَ بَعْدَ الطَّوَافِ الأَوَّلِ",
                "headingUrdu": "جو شخص خانہ کعبہ کے قریب نہ گیا اور مکہ میں داخل ہونے پر پہلا طواف کرنے کے بعد عرفات کی طرف روانہ ہو کر واپس لوٹنے تک خانہ کعبہ کا طواف نہ کیا۔",
                "headingEnglish": "Whoever did not go near the Ka'bah and did not perform Tawaf of the Ka'bah after the first Tawaf performed on entering Makkah till he proceeded to 'Arafat and returned",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1562,
                "hadithNumber": "1626",
                "englishNarrator": "Narrated Um Salama (the wife of the Prophet) رضی اللہ عنہا :",
                "hadithEnglish": "I informed Allah's Messenger (ﷺ) (about my illness). (Through other sub-narrators, Um Salama رضی اللہ عنہا narrated that when Allah's Messenger (ﷺ) was at Mecca and had just decided to leave (Mecca) while she had not yet done Tawaf of the Ka`ba (and after listening to her). The Prophet (ﷺ) said, \"When the morning prayer is established, perform the Tawaf on your camel while the people are in prayer.\" So she did the same and did not offer the two rak`at of Tawaf until she came out of the Mosque.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے(اپنی بیماری کی)  شکایت کی ۔ ( دوسری سند ) امام بخاری نے کہا کہ مجھ سے محمد بن حرب نے بیان کیا ، انہوں نے کہا کہ ہم سے ابومروان یحییٰ ابن ابی زکریا غسانی نے بیان کیا ، ان سے ہشام نے ، ان سے عروہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا نے کہ رسول اللہ صلی اللہ علیہ وسلم جب مکہ میں تھے اور وہاں سے چلنے کا ارادہ ہوا تو ام سلمہ رضی اللہ عنہا نے کعبہ کا طواف نہیں کیا اور وہ بھی روانگی کا ارادہ رکھتی تھیں آپ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ جب صبح کی نماز کھڑی ہو اور لوگ نماز پڑھنے میں مشغول ہو جائیں تو تم اپنی اونٹنی پر طواف کر لینا ۔ چنانچہ ام سلمہ رضی اللہ عنہا نے ایسا ہی کیا اور انہوں نے باہر نکلنے تک طواف کی نماز نہیں پڑھی ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا کہ ہمیں امام مالک رحمہ اللہ نے خبر دی ، انہیں محمد بن عبدالرحمٰن نے ، انہیں عروہ نے ، انہیں زینب نے اور انہیں ام المؤمنین حضرت ام سلمہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عُرْوَةَ، عَنْ زَيْنَبَ، عَنْ أُمِّ سَلَمَةَ ـ رضى الله عنها ـ شَكَوْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ وَحَدَّثَنِي مُحَمَّدُ بْنُ حَرْبٍ حَدَّثَنَا أَبُو مَرْوَانَ يَحْيَى بْنُ أَبِي زَكَرِيَّاءَ الْغَسَّانِيُّ عَنْ هِشَامٍ عَنْ عُرْوَةَ عَنْ أُمِّ سَلَمَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ وَهْوَ بِمَكَّةَ، وَأَرَادَ الْخُرُوجَ، وَلَمْ تَكُنْ أُمُّ سَلَمَةَ طَافَتْ بِالْبَيْتِ وَأَرَادَتِ الْخُرُوجَ، فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أُقِيمَتْ صَلاَةُ الصُّبْحِ فَطُوفِي عَلَى بَعِيرِكِ، وَالنَّاسُ يُصَلُّونَ ‏\"‏‏.‏ فَفَعَلَتْ ذَلِكَ، فَلَمْ تُصَلِّ حَتَّى خَرَجَتْ‏.‏",
                "headingArabic": "مَنْ صَلَّى رَكْعَتَىِ الطَّوَافِ خَارِجًا مِنَ الْمَسْجِدِ",
                "headingUrdu": "مسجد کے باہر طواف کی دو رکعت نماز",
                "headingEnglish": "Two Rak'a prayer of Tawaf outside the mosque",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1563,
                "hadithNumber": "1627",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) reached Mecca, circumambulated the Ka`ba seven times and then offered a two rak`at prayer behind Maqam Ibrahim. Then he went towards the Safa. Allah has said, \"Verily, in Allah's Apostle you have a good example.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ( مکہ میں ) تشریف لائے تو آپ صلی اللہ علیہ وسلم نے خانہ کعبہ کا سات چکروں سے طواف کیا اور مقام ابراہیم کے پیچھے دو رکعت نماز پڑھی پھر صفا کی طرف ( سعی کرنے ) گئے اور اللہ تعالیٰ نے فرمایا ہے کہ تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا کہ ہم سے شعبہ نے بیان کیا انہوں کہا کہ عم سے عمرو بن دینارنے بیان کیا ، انہوں نے کہا کہ میں نے ابن عمر رضی اللہ عنہما سے سنا ، انھوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ قَدِمَ النَّبِيُّ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ سَبْعًا وَصَلَّى خَلْفَ الْمَقَامِ رَكْعَتَيْنِ، ثُمَّ خَرَجَ إِلَى الصَّفَا، وَقَدْ قَالَ اللَّهُ تَعَالَى ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏}‏‏.‏",
                "headingArabic": "مَنْ صَلَّى رَكْعَتَىِ الطَّوَافِ خَلْفَ الْمَقَامِ",
                "headingUrdu": "مقام ابراہیم کے پیچھے طواف کی دو رکعت",
                "headingEnglish": "Two Rak'a (prayer) of Tawaf behind Maqam-Ibrahim",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1564,
                "hadithNumber": "1628",
                "englishNarrator": "Narrated Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Some people performed Tawaf (of the Ka`ba) after the morning prayer and then sat to listen to a preacher till sunrise, and then they stood up for the prayer. Then Aisha commented, \"Those people kept on sitting till it was the time in which the prayer is disliked and after that they stood up for the prayer.\"",
                "hadithUrdu": "کچھ لوگوں نے صبح کی نماز کے بعد کعبہ کا طواف کیا ۔ پھر ایک وعظ کرنے والے کے پاس بیٹھ گئے اور جب سورج نکلنے لگا تو وہ لوگ نماز ( طواف کی دو رکعت ) پڑھنے کے لیے کھڑے ہو گئے ۔ اس پر حضرت عائشہ رضی اللہ عنہا نے ( ناگواری کے ساتھ ) فرمایا جب سے تو یہ لوگ بیٹھے تھے اور جب وہ وقت آیا کہ جس میں نماز مکروہ ہے تو نماز کے لیے کھڑے ہو گئے ۔",
                "urduNarrator": "ہم سے حسن بن عمر بصریٰ رحمہ اللہ نے بیان کیا ، کہا کہ ہم سے یزید بن زریع نے بیان کیا ، ان سے حبیب نے ، ان سے عطاء نے ، ان سے عروہ نے ، ان سے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ عُمَرَ الْبَصْرِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ حَبِيبٍ، عَنْ عَطَاءٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ نَاسًا، طَافُوا بِالْبَيْتِ بَعْدَ صَلاَةِ الصُّبْحِ، ثُمَّ قَعَدُوا إِلَى الْمُذَكِّرِ، حَتَّى إِذَا طَلَعَتِ الشَّمْسُ قَامُوا يُصَلُّونَ فَقَالَتْ عَائِشَةُ ـ رضى الله عنها ـ قَعَدُوا حَتَّى إِذَا كَانَتِ السَّاعَةُ الَّتِي تُكْرَهُ فِيهَا الصَّلاَةُ قَامُوا يُصَلُّونَ‏.‏",
                "headingArabic": "الطَّوَافِ بَعْدَ الصُّبْحِ وَالْعَصْرِ",
                "headingUrdu": "صبح کے بعد طواف اور عصر کی نماز",
                "headingEnglish": "Tawaf after the morning and 'Asr prayer",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1565,
                "hadithNumber": "1629",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "I heard the Prophet (ﷺ) forbidding the offering of prayers at the time of sunrise and sunset.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے ۔ آپ صلی اللہ علیہ وسلم سورج طلوع ہوتے اور غروب ہوتے وقت نماز پڑھنے سے روکتے تھے ۔",
                "urduNarrator": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا کہ ہم سے ابو ضمرہ نے بیان کیا ، کہا کہ ہم سے موسیٰ بن عقبہ نے بیان کیا ، ان سے نافع نے کہ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا ،",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَنْهَى عَنِ الصَّلاَةِ عِنْدَ طُلُوعِ الشَّمْسِ وَعِنْدَ غُرُوبِهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1566,
                "hadithNumber": "1630, 1631",
                "englishNarrator": "Narrated `Abdul, `Aziz bin Rufa`i:",
                "hadithEnglish": "\"I saw `Abdullah bin Az-Zubair رضی اللہ عنہما performing Tawaf of the Ka`ba after the morning prayer then offering the two rak`at prayer.\"\r\n`Abdul `Aziz added, \"I saw `Abdullah bin Az-Zubair رضی اللہ عنہما offering a two rak`at prayer after the `Asr prayer.\" He informed me that Aisha رضی اللہ عنہا told him that the Prophet (ﷺ) used to offer those two rak`at whenever he entered her house.\"",
                "hadithUrdu": "میں نے عبداللہ بن زبیر رضی اللہ عنہما کو دیکھا کہ آپ فجر کی نماز کے بعد طواف کر رہے تھے اور پھر آپ نے دو رکعت ( طواف کی ) نماز پڑھی ۔\r\nعبدالعزیز نے بیان کیا کہ میں نے عبداللہ بن زبیر رضی اللہ عنہما کو عصر کے بعد بھی دو رکعت نماز پڑھتے دیکھا تھا ۔ وہ بتاتے تھے کہ عائشہ رضی اللہ عنہا نے ان سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم جب بھی ان کے گھر آتے ( عصر کے بعد ) تو یہ دو رکعت ضرور پڑھتے تھے ۔",
                "urduNarrator": "ہم سے حسن بن محمد زعفرانی نے بیان کیا ، کہا کہ ہم سے عبیدہ بن حمیدنے بیان کیا ، کہا کہ مجھ سے عبدالعزیز بن رفیع نے بیان کیا ، کہا کہ",
                "hadithArabic": "حَدَّثَنِي الْحَسَنُ بْنُ مُحَمَّدٍ ـ هُوَ الزَّعْفَرَانِيُّ ـ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ رُفَيْعٍ، قَالَ رَأَيْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ رضى الله عنهما يَطُوفُ بَعْدَ الْفَجْرِ، وَيُصَلِّي رَكْعَتَيْنِ‏.‏ قَالَ عَبْدُ الْعَزِيزِ وَرَأَيْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ يُصَلِّي رَكْعَتَيْنِ بَعْدَ الْعَصْرِ، وَيُخْبِرُ أَنَّ عَائِشَةَ ـ رضى الله عنها ـ حَدَّثَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمْ يَدْخُلْ بَيْتَهَا إِلاَّ صَلاَّهُمَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1567,
                "hadithNumber": "1632",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) performed Tawaf (of the Ka`ba) ending a camel (at that time the Prophet (ﷺ) had foot injury). Whenever he came to the Corner (having the Black Stone) he would point out towards it with a thing in his hand and say, \"Allahu-Akbar.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بیت اللہ کا طواف اونٹ پر سوار ہو کر کیا ۔ آپ صلی اللہ علیہ وسلم جب بھی ( طواف کرتے ہوئے ) حجراسود کے نزدیک آتے تو اپنے ہاتھ کو ایک چیز ( چھڑی ) سے اشارہ کرتے اور تکبیر کہتے ۔",
                "urduNarrator": "ہم سے اسحاق واسطی نے بیان کیا ، کہا کہ ہم سے خالد طحان نے خالد حذاء سے بیان کیا ، ان سے عکرمہ نے ، ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدٌ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَافَ بِالْبَيْتِ، وَهْوَ عَلَى بَعِيرٍ، كُلَّمَا أَتَى عَلَى الرُّكْنِ أَشَارَ إِلَيْهِ بِشَىْءٍ فِي يَدِهِ وَكَبَّرَ‏.‏",
                "headingArabic": "الْمَرِيضِ يَطُوفُ رَاكِبًا",
                "headingUrdu": "بیمار شخص سواری کی حالت میں طواف کرسکتا ہے۔",
                "headingEnglish": "A sick person may perform Tawaf while riding",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1568,
                "hadithNumber": "1633",
                "englishNarrator": "Narrated Um Salama رضی اللہ عنہا :",
                "hadithEnglish": "I informed Allah's Messenger (ﷺ) that I was sick. He said, \"Perform Tawaf (of the Ka`ba) while riding behind the people.\" So, I performed the Tawaf while Allah's Messenger (ﷺ) was offering the prayer beside the Ka`ba and was reciting Surat-at-Tur.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے شکایت کی کہ میں بیمار ہو گئی ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا پھر لوگوں کے پیچھے سے سوار ہو کر طواف کر لے ۔ چنانچہ میں نے جب طواف کیا تو اس وقت رسول اللہ صلی اللہ علیہ وسلم بیت اللہ کے پہلو میں ( نماز کے اندر ) «والطور وكتاب مسطور‏» کی قرآت کر رہے تھے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا انہوں نے کہا کہ ہم سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے محمد بن عبدالرحمٰن بن نوفل نے ، ان سے عروہ نے بیان کیا ، ان سے زینب بنت ام سلمہ نے ، ان سے ام سلمہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ، عَنْ عُرْوَةَ، عَنْ زَيْنَبَ ابْنَةِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ ـ رضى الله عنها ـ قَالَتْ شَكَوْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنِّي أَشْتَكِي‏.‏ فَقَالَ ‏ \"‏ طُوفِي مِنْ وَرَاءِ النَّاسِ وَأَنْتِ رَاكِبَةٌ ‏\"‏‏.‏ فَطُفْتُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي إِلَى جَنْبِ الْبَيْتِ، وَهْوَ يَقْرَأُ بِالطُّورِ وَكِتَابٍ مَسْطُورٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1569,
                "hadithNumber": "1634",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Al `Abbas bin `Abdul-Muttalib رضی اللہ عنہ asked the permission of Allah's Messenger (ﷺ) to let him stay in Mecca during the nights of Mina in order to provide the pilgrims with water to drink, so the Prophet (ﷺ) permitted him.",
                "hadithUrdu": "عباس بن عبدالمطلب رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اپنے پانی ( زمزم کا حاجیوں کو ) پلانے کے لیے منیٰ کے دنوں میں مکہ ٹھہرنے کی اجازت چاہی تو آپ صلی اللہ علیہ وسلم نے ان کو اجازت دے دی ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد بن ابی الاسود نے بیان کیا ، انہوں نے کہا کہ ہم سے ابوضمرہ نے بیان کیا ، انہوں نے کہا کہ ہم سے عبیداللہ عمری نے بیان کیا ، ان سے نافع نے ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي الأَسْوَدِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ اسْتَأْذَنَ الْعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ ـ رضى الله عنه ـ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يَبِيتَ بِمَكَّةَ لَيَالِيَ مِنًى مِنْ أَجْلِ سِقَايَتِهِ، فَأَذِنَ لَهُ‏.‏",
                "headingArabic": "سِقَايَةِ الْحَاجِّ",
                "headingUrdu": "حاجیوں کو پینے کے لیے پانی مہیا کرنا",
                "headingEnglish": "Providing the pilgrims with water to drink",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1570,
                "hadithNumber": "1635",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) came to the drinking place and asked for water. Al-Abbas رضی اللہ عنہ said, \"O Fadl! Go to your mother and bring water from her for Allah's Messenger (ﷺ) .\" Allah's Messenger (ﷺ) said, \"Give me water to drink.\" Al-Abbas رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! The people put their hands in it.\" Allah's Messenger (ﷺ) again said, 'Give me water to drink. So, he drank from that water and then went to the Zamzam (well) and there the people were offering water to the others and working at it (drawing water from the well). The Prophet (ﷺ) then said to them, \"Carry on! You are doing a good deed.\" Then he said, \"Were I not afraid that other people would compete with you (in drawing water from Zamzam), I would certainly take the rope and put it over this (i.e. his shoulder) (to draw water).\" On saying that the Prophet (ﷺ) pointed to his shoulder.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم پانی پلانے کی جگہ ( زمزم کے پاس ) تشریف لائے اور پانی مانگا ( حج کے موقع پر ) عباس رضی اللہ عنہ نے کہا کہ فضل ! اپنی ماں کے یہاں جا اور ان کے یہاں سے کھجور کا شربت لا ۔ لیکن رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے ( یہی ) پانی پلاو ۔ عباس رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! ہر شخص اپنا ہاتھ اس میں ڈال دیتا ہے ۔ اس کے باوجود رسول اللہ صلی اللہ علیہ وسلم یہی کہتے رہے کہ مجھے ( یہی ) پانی پلاؤ ۔ چنانچہ آپ صلی اللہ علیہ وسلم نے پانی پیا پھر زمزم کے قریب آئے ۔ لوگ کنویں سے پانی کھینچ رہے تھے اور کام کر رہے تھے ۔ آپ صلی اللہ علیہ وسلم نے ( انہیں دیکھ کر ) فرمایا کام کرتے جاؤ کہ ایک اچھے کام پر لگے ہوئے ہو ۔ پھر فرمایا ( اگر یہ خیال نہ ہوتا کہ آئندہ لوگ ) تمہیں پریشان کر دیں گے تو میں بھی اترتا اور رسی اپنے اس پر رکھ لیتا ۔ مراد آپ صلی اللہ علیہ وسلم کی شانہ سے تھی ۔ آپ صلی اللہ علیہ وسلم نے اس کی طرف اشارہ کر کے کہا تھا ۔",
                "urduNarrator": "ہم سے اسحاق بن شاہین نے بیان کیا ، کہا کہ ہم سے خالد طحان نے خالد حذاء سے بیان کیا ، ان سے عکرمہ نے ، ان سے ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا خَالِدٌ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَاءَ إِلَى السِّقَايَةِ، فَاسْتَسْقَى، فَقَالَ الْعَبَّاسُ يَا فَضْلُ اذْهَبْ إِلَى أُمِّكَ، فَأْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم بِشَرَابٍ مِنْ عِنْدِهَا‏.‏ فَقَالَ ‏\"‏ اسْقِنِي ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ إِنَّهُمْ يَجْعَلُونَ أَيْدِيَهُمْ فِيهِ‏.‏ قَالَ ‏\"‏ اسْقِنِي ‏\"‏‏.‏ فَشَرِبَ مِنْهُ، ثُمَّ أَتَى زَمْزَمَ، وَهُمْ يَسْقُونَ وَيَعْمَلُونَ فِيهَا، فَقَالَ ‏\"‏ اعْمَلُوا، فَإِنَّكُمْ عَلَى عَمَلٍ صَالِحٍ ـ ثُمَّ قَالَ ـ لَوْلاَ أَنْ تُغْلَبُوا لَنَزَلْتُ حَتَّى أَضَعَ الْحَبْلَ عَلَى هَذِهِ ‏\"‏‏.‏ ـ يَعْنِي عَاتِقَهُ ـ وَأَشَارَ إِلَى عَاتِقِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1571,
                "hadithNumber": "1636",
                "englishNarrator": "Narrated  Abu Dhar رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The roof of my house was made open while I was at Makkah (on the night of Mi'raj) and Jibril descended. He opened up my chest and washed it with the water of Zamzam. The he brought the golden tray full of Wisdom and Belief and poured it in my chest and then closed it. The he took hold of my hand and ascended to the nearest heaven. Jibril told the gatekeeper of the nearest heaven to open the gate. The gatekeeper asked, \"Who is it?\" Jibril replied, \"I am Jibril.\" (See Hadith No. 349 Vol.1)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب میں مکہ میں تھا تو میری ( گھر کی ) چھت کھلی اور جبرائیل علیہ السلام نازل ہوئے ۔ انہوں نے میرا سینہ چاک کیا اور اسے زمزم کے پانی سے دھویا ۔ اس کے بعد ایک سونے کا طشت لائے جو حکمت اور ایمان سے بھرا ہوا تھا ۔ اسے انہوں نے میرے سینے میں ڈال دیا اور پھر سینہ بند کر دیا ۔ اب وہ مجھے ہاتھ سے پکڑ کر آسمان دنیا کی طرف لے چلے ۔ آسمان دنیا کے داروغہ سے جبرائیل علیہ السلام نے کہا دروازہ کھولو ۔ انہوں نے دریافت کیا کون صاحب ہیں ؟ کہا جبرائیل ! ۔",
                "urduNarrator": "اور عبدان نے کہا کہ مجھ کو عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا کہ ہمیں یونس نے خبر دی ، انہیں زہری نے ، انہوں نے کہا کہ ہم سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ ابوذر رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ عَبْدَانُ أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَنَسُ بْنُ مَالِكٍ كَانَ أَبُو ذَرٍّ ـ رضى الله عنه ـ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ فُرِجَ سَقْفِي وَأَنَا بِمَكَّةَ، فَنَزَلَ جِبْرِيلُ ـ عَلَيْهِ السَّلاَمُ ـ فَفَرَجَ صَدْرِي، ثُمَّ غَسَلَهُ بِمَاءِ زَمْزَمَ، ثُمَّ جَاءَ بِطَسْتٍ مِنْ ذَهَبٍ مُمْتَلِئٍ حِكْمَةً وَإِيمَانًا، فَأَفْرَغَهَا فِي صَدْرِي، ثُمَّ أَطْبَقَهُ، ثُمَّ أَخَذَ بِيَدِي فَعَرَجَ إِلَى السَّمَاءِ الدُّنْيَا‏.‏ قَالَ جِبْرِيلُ لِخَازِنِ السَّمَاءِ الدُّنْيَا افْتَحْ‏.‏ قَالَ مَنْ هَذَا قَالَ جِبْرِيلُ ‏\"‏‏.‏",
                "headingArabic": "مَا جَاءَ فِي زَمْزَمَ",
                "headingUrdu": "زمزم کے بارے میں کیا کہا جاتا ہے",
                "headingEnglish": "What is said about Zamzam (water)",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1572,
                "hadithNumber": "1637",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "I gave Zamzam water to Allah's Messenger (ﷺ) and he drank it while standing. 'Asim (a sub-narrator) said that `Ikrima took the oath that on that day the Prophet (ﷺ) had not been standing but riding a camel.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو زمزم کا پانی پلایا تھا ۔ آپ صلی اللہ علیہ وسلم نے پانی کھڑے ہو کر پیا تھا ۔ عاصم نے بیان کیا کہ عکرمہ نے قسم کھا کر کہا کہ آنحضور صلی اللہ علیہ وسلم اس دن اونٹ پر سوار تھے ۔",
                "urduNarrator": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، انہوں نے کہا کہ ہمیں مروان بن معاویہ فزاری نے خبر دی ، انہیں عاصم نے اور انہیں شعبی نے کہ حضرت عبداللہ بن عباس رضی اللہ عنہما نے ان سے بیان کیا ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ ـ هُوَ ابْنُ سَلاَمٍ ـ أَخْبَرَنَا الْفَزَارِيُّ، عَنْ عَاصِمٍ، عَنِ الشَّعْبِيِّ، أَنَّ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ حَدَّثَهُ قَالَ سَقَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْ زَمْزَمَ فَشَرِبَ وَهُوَ قَائِمٌ‏.‏ قَالَ عَاصِمٌ فَحَلَفَ عِكْرِمَةُ مَا كَانَ يَوْمَئِذٍ إِلاَّ عَلَى بَعِيرٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1573,
                "hadithNumber": "1638",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "We set out with Allah's Messenger (ﷺ) in the year of his Last Hajj and we mended (the Ihram) for `Umra. Then the Prophet (ﷺ) said, \"Whoever has a Hadi with him should assume Ihram for both Hajj and `Umra, and should not finish it till he performs both of the them (Hajj and `Umra).\" When we reached Mecca, I had my menses. When we had performed our Hajj, the Prophet (ﷺ) sent me with `Abdur-Rahman to Tan`im and I performed the `Umra. The Prophet (ﷺ) said, \"This is in lieu of your missed `Umra.\" Those who had assumed Ihram for `Umra performed Tawaf (between Safa and Marwa) and then finished their Ihram. And then they performed another Tawaf (between Safa and Marwa) after returning from Mina. And those who had assumed lhram for Hajj and `Umra to get her ( Hajj-Qiran ) performed only one Tawaf (between Safa and Marwa).",
                "hadithUrdu": "حجتہ الوداع میں ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( مدینہ سے ) نکلے اور ہم نے عمرہ کا احرام باندھا ۔ پھر آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ جس کے ساتھ قربانی کا جانور ہو وہ حج اور عمرہ دونوں کا ایک ساتھ احرام باندھے ۔ ایسے لوگ دونوں کے احرام سے ایک ساتھ حلال ہوں گے ۔ میں بھی مکہ آئی تھی لیکن مجھے حیض آ گیا تھا ۔ اس لیے جب ہم نے حج کے کام پورے کر لیے تو آنحضور صلی اللہ علیہ وسلم نے مجھے عبدالرحمٰن کے ساتھ تنعیم کی طرف بھیجا ۔ میں نے وہاں سے عمرہ کا احرام باندھا ۔ آنحضور صلی اللہ علیہ وسلم نے فرمایا یہ تمہارے اس عمرہ کے بدلہ میں ہے ( جسے تم نے حیض کی وجہ سے چھوڑ دیا تھا ) جن لوگوں نے عمرہ کا احرام باندھا تھا انہوں نے سعی کے بعد احرام کھول دیا اور دوسرا طواف منٰی سے واپسی پر کیا لیکن جن لوگوں نے حج اور عمرہ کا احرام ایک ساتھ باندھا تھا انہوں نے صرف ایک طواف کیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا کہ ہمیں امام مالک رحمہ اللہ نے ابن شہاب سے خبر دی ، انہیں عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ، فَأَهْلَلْنَا بِعُمْرَةٍ، ثُمَّ قَالَ ‏\"‏ مَنْ كَانَ مَعَهُ هَدْىٌ فَلْيُهِلَّ بِالْحَجِّ وَالْعُمْرَةِ ثُمَّ لاَ يَحِلُّ حَتَّى يَحِلَّ مِنْهُمَا ‏\"‏‏.‏ فَقَدِمْتُ مَكَّةَ، وَأَنَا حَائِضٌ، فَلَمَّا قَضَيْنَا حَجَّنَا أَرْسَلَنِي مَعَ عَبْدِ الرَّحْمَنِ إِلَى التَّنْعِيمِ، فَاعْتَمَرْتُ، فَقَالَ صلى الله عليه وسلم ‏\"‏ هَذِهِ مَكَانَ عُمْرَتِكِ ‏\"‏‏.‏ فَطَافَ الَّذِينَ أَهَلُّوا بِالْعُمْرَةِ، ثُمَّ حَلُّوا، ثُمَّ طَافُوا طَوَافًا آخَرَ، بَعْدَ أَنْ رَجَعُوا مِنْ مِنًى، وَأَمَّا الَّذِينَ جَمَعُوا بَيْنَ الْحَجِّ وَالْعُمْرَةِ طَافُوا طَوَافًا وَاحِدًا‏.‏",
                "headingArabic": "طَوَافِ الْقَارِنِ",
                "headingUrdu": "طواف القرین",
                "headingEnglish": "Tawaf of Al-Qarin",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1574,
                "hadithNumber": "1639",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "`Abdullah bin `Abdullah bin `Umar رضی اللہ عنہما and his riding animal entered the house of Ibn `Umar رضی اللہ عنہما . He (the son of Ibn `Umar) said, \"I fear that this year a battle might take place between the people and you might be prevented from going to the Ka`ba. I suggest that you should stay here.\" Ibn `Umar said, \"Once Allah's Messenger (ﷺ) set out for the pilgrimage, and the pagans of Quraish intervened between him and the Ka`ba. So, if the people intervened between me and the Ka`ba, I would do the same as Allah's Messenger (ﷺ) had done . . . \"Verily, in Allah's Messenger (ﷺ) you have a good example.\" Then he added, \"I make you a witness that I have intended to perform Hajj along with `Umra.\" After arriving at Mecca, Ibn `Umar performed one Tawaf only (between Safa and Marwa).",
                "hadithUrdu": "ابن عمر رضی اللہ عنہما کے لڑکے عبداللہ بن عبداللہ ان کے یہاں گئے ۔ حج کے لیے سواری گھر میں کھڑی ہوئی تھی ۔ انہوں نے کہا کہ مجھے خطرہ ہے کہ اس سال مسلمانوں میں آپس میں لڑائی ہو جائے گی اور آپ کو وہ بیت اللہ سے روک دیں گے ۔ اس لیے اگر آپ نہ جاتے تو بہتر ہوتا ۔ ابن عمر رضی اللہ عنہما نے جواب دیا کہ رسول اللہ صلی اللہ علیہ وسلم بھی تشریف لے گئے تھے ( عمرہ کرنے صلح حدیبیہ کے موقع پر ) اور کفار قریش نے آپ کو بیت اللہ تک پہنچنے سے روک دیا تھا ۔ اس لیے اگر مجھے بھی روک دیا گیا تو میں بھی وہی کام کروں گا جو رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا اور تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے ۔ پھر آپ نے فرمایا کہ میں تمہیں گواہ بناتا ہوں کہ میں نے اپنے عمرہ کے ساتھ حج ( اپنے اوپر ) واجب کر لیا ہے ۔ انہوں نے بیان کیا کہ پھر آپ مکہ آئے اور دونوں عمرہ اور حج کے لیے ایک ہی طواف کیا ۔",
                "urduNarrator": "ہم سے یعقوب بن ابراہیم نے بیان کیا ، کہا کہ ہم سے اسماعیل بن علیہ نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے نافع نے کہ",
                "hadithArabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ دَخَلَ ابْنُهُ عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، وَظَهْرُهُ فِي الدَّارِ، فَقَالَ إِنِّي لاَ آمَنُ أَنْ يَكُونَ الْعَامَ بَيْنَ النَّاسِ قِتَالٌ، فَيَصُدُّوكَ عَنِ الْبَيْتِ، فَلَوْ أَقَمْتَ‏.‏ فَقَالَ قَدْ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَحَالَ كُفَّارُ قُرَيْشٍ بَيْنَهُ وَبَيْنَ الْبَيْتِ، فَإِنْ حِيلَ بَيْنِي وَبَيْنَهُ أَفْعَلُ كَمَا فَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏}‏ ثُمَّ قَالَ أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ مَعَ عُمْرَتِي حَجًّا‏.‏ قَالَ ثُمَّ قَدِمَ فَطَافَ لَهُمَا طَوَافًا وَاحِدًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1575,
                "hadithNumber": "1640",
                "englishNarrator": "Narrated Nafi`:",
                "hadithEnglish": "Ibn `Umar رضی اللہ عنہما intended to perform Hajj in the year when Al-Hajjaj attacked Ibn Az-Zubair. Somebody said to Ibn `Umar رضی اللہ عنہما , \"There is a danger of an impending war between them.\" Ibn `Umar said, \"Verily, in Allah's Messenger (ﷺ) you have a good example. (And if it happened as you say) then I would do the same as Allah's Messenger (ﷺ) had done. I make you witness that I have decided to perform `Umra.\" Then he set out and when he reached Al-Baida', he said, \"The ceremonies of both Hajj and `Umra are similar. I make you witness that I have made Hajj compulsory for me along with `Umra.\" He drove (to Mecca) a Hadi which he had bought from (a place called) Qudaid and did not do more than that. He did not slaughter the Hadi or finish his Ihram, or shave or cut short his hair till the day of slaughtering the sacrifices (10th Dhul-Hijja). Then he slaughtered his Hadi and shaved his head and considered the first Tawaf (of Safa and Marwa) as sufficient for Hajj and `Umra. Ibn `Umar رضی اللہ عنہما said, \"Allah's Messenger (ﷺ) did the same.\"",
                "hadithUrdu": "جس سال حجاج عبداللہ بن زبیر رضی اللہ عنہما کے مقابلے میں لڑنے آیا تھا ۔ عبداللہ بن عمر رضی اللہ عنہما نے جب اس سال حج کا ارادہ کیا تو آپ سے کہا گیا کہ مسلمانوں میں باہم جنگ ہونے والی ہے اور یہ بھی خطرہ ہے کہ آپ کو حج سے روک دیا جائے ۔ آپ نے فرمایا تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے ۔ ایسے وقت میں میں بھی وہی کام کروں گا جو رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا ۔ تمہیں گواہ بناتا ہوں کہ میں نے اپنے اوپر عمرہ واجب کرلیاہے ۔ پھر آپ چلے اور جب بیداء کے میدان میں پہنچے تو آپ نے فرمایا کہ حج اور عمرہ تو ایک ہی طرح کے ہیں ۔ میں تمہیں گواہ بناتا ہوں کہ میں نے اپنے عمرہ کے ساتھ حج بھی واجب کر لیا ہے ۔ آپ نے ایک قربانی بھی ساتھ لے لی جو مقام قدید سے خریدی تھی ۔ اس کے سوا اور کچھ نہیں کیا ۔ دسویں تاریخ سے پہلے نہ آپ نے قربانی کی نہ کسی ایسی چیز کو اپنے لیے جائز کیا جس سے ( احرام کی وجہ سے ) آپ رک گئے تھے ۔ نہ سر منڈوایا نہ بال ترشوائے دسویں تاریخ میں آپ نے قربانی کی اور بال منڈوائے ۔ آپ کا یہی خیال تھا کہ آپ نے ایک طواف سے حج اور عمرہ دونوں کا طواف ادا کر لیا ہے ۔ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے بھی اسی طرح کیا تھا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا کہ ہم سے لیث بن سعد نے نافع سے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ أَرَادَ الْحَجَّ عَامَ نَزَلَ الْحَجَّاجُ بِابْنِ الزُّبَيْرِ‏.‏ فَقِيلَ لَهُ إِنَّ النَّاسَ كَائِنٌ بَيْنَهُمْ قِتَالٌ، وَإِنَّا نَخَافُ أَنْ يَصُدُّوكَ‏.‏ فَقَالَ ‏{‏لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ‏}‏ إِذًا أَصْنَعَ كَمَا صَنَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم، إِنِّي أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ عُمْرَةً‏.‏ ثُمَّ خَرَجَ حَتَّى إِذَا كَانَ بِظَاهِرِ الْبَيْدَاءِ قَالَ مَا شَأْنُ الْحَجِّ وَالْعُمْرَةِ إِلاَّ وَاحِدٌ، أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ حَجًّا مَعَ عُمْرَتِي‏.‏ وَأَهْدَى هَدْيًا اشْتَرَاهُ بِقُدَيْدٍ وَلَمْ يَزِدْ عَلَى ذَلِكَ، فَلَمْ يَنْحَرْ، وَلَمْ يَحِلَّ مِنْ شَىْءٍ حَرُمَ مِنْهُ، وَلَمْ يَحْلِقْ وَلَمْ يُقَصِّرْ حَتَّى كَانَ يَوْمُ النَّحْرِ، فَنَحَرَ وَحَلَقَ، وَرَأَى أَنْ قَدْ قَضَى طَوَافَ الْحَجِّ، وَالْعُمْرَةِ بِطَوَافِهِ الأَوَّلِ‏.‏ وَقَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ كَذَلِكَ فَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 1576,
                "hadithNumber": "1641, 1642",
                "englishNarrator": "Narrated Muhammad bin `Abdur-Rahman bin Nawfal Al-Qurashi:",
                "hadithEnglish": "I asked `Urwa bin Az-Zubair (regarding the Hajj of the Prophet (ﷺ)). `Urwa replied, \"Aisha رضی اللہ عنہا narrated, 'When the Prophet (ﷺ) reached Mecca, the first thing he started with was the ablution, then he performed Tawaf of the Ka`ba and his intention was not `Umra alone (but Hajj and `Umra together).' \" Later Abu Bakr رضی اللہ عنہ I performed the Hajj and the first thing he started with was Tawaf of the Ka`ba and it was not `Umra alone (but Hajj and `Umra together). And then `Umar did the same. Then `Uthman رضی اللہ عنہ performed the Hajj and the first thing he started with was Tawaf of the Ka`ba and it was not `Umra alone. And then Muawiya and `Abdullah bin `Umar رضی اللہ عنہم did the same. I performed Hajj with Ibn Az-Zubair and the first thing he started with was Tawaf of the Ka`ba and it was not `Umra alone, (but Hajj and `Umra together). Then I saw the Muhajirin (Emigrants) and Ansar doing the same and it was not `Umra alone. And the last person I saw doing the same was Ibn `Umar رضی اللہ عنہما , and he did not do another `Umra after finishing the first. Now here is Ibn `Umar present amongst the people! They neither ask him nor anyone of the previous ones. And all these people, on entering Mecca, would not start with anything unless they had performed Tawaf of the Ka`ba, and would not finish their Ihram. And no doubt, I saw my mother and my aunt, on entering Mecca doing nothing before performing Tawaf of the Ka`ba, and they would not finish their lhram.\r\nAnd my mother informed me that she, her sister, Az-Zubair and such and such persons had assumed lhram for `Umra and after passing their hands over the Corner (the Black Stone) (i.e. finishing their Umra) they finished their Ihram.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے جیسا کہ معلوم ہے حج کیا تھا ۔ مجھے ام المؤمنین حضرت عائشہ صدیقہ رضی اللہ عنہا نے اس کے متعلق خبر دی کہ جب آپ مکہ معظمہ آئے تو سب سے پہلا کام یہ کیا کہ آپ نے وضو کیا ، پھر کعبہ کا طواف کیا ۔ یہ آپ کا عمرہ نہیں تھا ۔ اس کے بعد ابوبکر رضی اللہ عنہ نے حج کیا اور آپ نے بھی سب سے پہلے کعبہ کا طواف کیا جب کہ یہ آپ کا بھی عمرہ نہیں تھا ۔ عمر رضی اللہ عنہ نے بھی اسی طرح کیا ۔ پھر عثمان رضی اللہ عنہ نے حج کیا میں نے دیکھا کہ سب سے پہلے آپ نے بھی کعبہ کا طواف کیا ۔ آپ کا بھی یہ عمرہ نہیں تھا ۔ پھر معاویہ اور عبداللہ بن عمر رضی اللہ عنہم کا زمانہ آیا ۔ پھر میں نے اپنے والد زبیر بن عوام رضی اللہ عنہ کے ساتھ بھی حج کیا ۔ یہ ( سارے اکابر ) پہلے کعبہ ہی کے طواف سے شروع کرتے تھے جب کہ یہ عمرہ نہیں ہوتا تھا ۔ اس کے بعد مہاجرین و انصار کو بھی میں نے دیکھا کہ وہ بھی اسی طرح کرتے رہے اور ان کا بھی یہ عمرہ نہیں ہوتا تھا ۔ آخری ذات جسے میں نے اس طرح کرتے دیکھا ، وہ حضرت عبداللہ بن عمر رضی اللہ عنہما کی تھی ۔ انہوں نے بھی عمرہ نہیں کیا تھا ۔ ابن عمر رضی اللہ عنہما ابھی موجود ہیں لیکن ان سے لوگ اس کے متعلق پوچھتے نہیں ۔ اسی طرح جو حضرات گزر گئے ، ان کا بھی مکہ میں داخل ہوتے ہی سب سے پہلا قدم طواف کے لے اٹھتا تھا ۔ پھر یہ بھی احرام نہیں کھولتے تھے ۔ میں نے اپنی والدہ ( اسماء بنت ابی بکر رضی اللہ عنہما ) اور خالہ ( عائشہ صدیقہ رضی اللہ عنہا ) کو بھی دیکھا کہ جب وہ آتیں تو سب سے پہلے طواف کرتیں اور یہ اس کے بعد احرام نہیں کھولتی تھیں ۔\r\nاور مجھے میری والدہ نے خبر دی کہ انہوں نے اپنی بہن اور زبیر اور فلاں فلاں ( رضی اللہ عنہم ) کے ساتھ عمرہ کیا ہے یہ سب لوگ حجراسود کا بوسہ لے لیتے تو عمرہ کا احرام کھول دیتے ۔",
                "urduNarrator": "ہم سے احمد بن عیسیٰ نے بیان کیا ، انہوں نے کہا کہ ہم سے عبداللہ بن وہب نے بیان کیا ، انہوں نے کہا کہ مجھے عمرو بن حارث نے خبر دی ، انہیں محمد بن عبدالرحمٰن بن نوفل قرشی نے ، انہوں نے عروہ بن زبیر سے پوچھاتھا ، عروہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ الْقُرَشِيِّ، أَنَّهُ سَأَلَ عُرْوَةَ بْنَ الزُّبَيْرِ فَقَالَ قَدْ حَجَّ النَّبِيُّ صلى الله عليه وسلم فَأَخْبَرَتْنِي عَائِشَةُ ـ رضى الله عنها ـ أَنَّهُ أَوَّلُ شَىْءٍ بَدَأَ بِهِ حِينَ قَدِمَ أَنَّهُ تَوَضَّأَ ثُمَّ طَافَ بِالْبَيْتِ ثُمَّ لَمْ تَكُنْ عُمْرَةً، ثُمَّ حَجَّ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَكَانَ أَوَّلَ شَىْءٍ بَدَأَ بِهِ الطَّوَافُ بِالْبَيْتِ ثُمَّ لَمْ تَكُنْ عُمْرَةً‏.‏ ثُمَّ عُمَرُ ـ رضى الله عنه ـ مِثْلُ ذَلِكَ‏.‏ ثُمَّ حَجَّ عُثْمَانُ ـ رضى الله عنه ـ فَرَأَيْتُهُ أَوَّلُ شَىْءٍ بَدَأَ بِهِ الطَّوَافُ بِالْبَيْتِ ثُمَّ لَمْ تَكُنْ عُمْرَةٌ، ثُمَّ مُعَاوِيَةُ وَعَبْدُ اللَّهِ بْنُ عُمَرَ، ثُمَّ حَجَجْتُ مَعَ أَبِي الزُّبَيْرِ بْنِ الْعَوَّامِ، فَكَانَ أَوَّلَ شَىْءٍ بَدَأَ بِهِ الطَّوَافُ بِالْبَيْتِ، ثُمَّ لَمْ تَكُنْ عُمْرَةٌ، ثُمَّ رَأَيْتُ الْمُهَاجِرِينَ وَالأَنْصَارَ يَفْعَلُونَ ذَلِكَ، ثُمَّ لَمْ تَكُنْ عُمْرَةٌ، ثُمَّ آخِرُ مَنْ رَأَيْتُ فَعَلَ ذَلِكَ ابْنُ عُمَرَ ثُمَّ لَمْ يَنْقُضْهَا عُمْرَةً، وَهَذَا ابْنُ عُمَرَ عِنْدَهُمْ فَلاَ يَسْأَلُونَهُ، وَلاَ أَحَدٌ مِمَّنْ مَضَى، مَا كَانُوا يَبْدَءُونَ بِشَىْءٍ حَتَّى يَضَعُوا أَقْدَامَهُمْ مِنَ الطَّوَافِ بِالْبَيْتِ، ثُمَّ لاَ يَحِلُّونَ، وَقَدْ رَأَيْتُ أُمِّي وَخَالَتِي، حِينَ تَقْدَمَانِ لاَ تَبْتَدِئَانِ بِشَىْءٍ أَوَّلَ مِنَ الْبَيْتِ، تَطُوفَانِ بِهِ، ثُمَّ لاَ تَحِلاَّنِ‏. وَقَدْ أَخْبَرَتْنِي أُمِّي، أَنَّهَا أَهَلَّتْ هِيَ وَأُخْتُهَا وَالزُّبَيْرُ وَفُلاَنٌ وَفُلاَنٌ بِعُمْرَةٍ، فَلَمَّا مَسَحُوا الرُّكْنَ حَلُّوا‏.‏\r\n‏",
                "headingArabic": "الطَّوَافِ عَلَى وُضُوءٍ",
                "headingUrdu": "وضو کے ساتھ طواف کرنا",
                "headingEnglish": "Tawaf with ablution",
                "chapterId": "26",
                "bookSlug": "sahih-bukhari",
                "volume": "2",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 26,
                    "chapterNumber": "26",
                    "chapterEnglish": "Hajj (Pilgrimage)",
                    "chapterUrdu": "حج کے مسائل کا بیان",
                    "chapterArabic": "كتاب الحج",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 1551,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=62",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=60",
                "label": "60",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=61",
                "label": "61",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=62",
                "label": "62",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=63",
                "label": "63",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=64",
                "label": "64",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=65",
                "label": "65",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=66",
                "label": "66",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=64",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=64",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=62",
        "to": 1575,
        "total": 40465
    }
}