{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 277,
        "data": [
            {
                "id": 6906,
                "hadithNumber": "7204",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "I gave the Pledge of allegiance to the Prophet (ﷺ) that I would listen and obey, and he told me to add: 'As much as I can, and will give good advice to every Muslim.'",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سننے اور اطاعت کرنے کی بیعت کی تو آپ نے مجھے اس کی تلقین کی کہ جتنی مجھ میں طاقت ہو اور ہر مسلمان کے ساتھ خیرخواہی کرنے پر بھی بیعت کی ۔",
                "urduNarrator": "ہم سے یعقوب بن ابراہیم نے بیان کیا ‘ کہا ہم سے ہشیم نے بیان کیا ‘ کہا ہم کو سیار نے خبر دی ‘ انہیں شعبی نے ‘ ان سے جریر بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا سَيَّارٌ، عَنِ الشَّعْبِيِّ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، قَالَ بَايَعْتُ النَّبِيَّ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ، فَلَقَّنَنِي، فِيمَا اسْتَطَعْتُ، وَالنُّصْحِ لِكُلِّ مُسْلِمٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6907,
                "hadithNumber": "7205",
                "englishNarrator": "Narrated `Abdullah bin Dinar:",
                "hadithEnglish": "When the people took the oath of allegiance to `Abdul Malik, `Abdullah bin `Umar رضی اللہ عنہما wrote to him: \"To Allah's Slave, `Abdul Malik, Chief of the believers, I give the Pledge of allegiance that I will listen to and obey Allah's Slave, `Abdul Malik, Chief of the believers, according to Allah's Laws and the Traditions of His Apostle in whatever is within my ability; and my sons too, give the same pledge.\"",
                "hadithUrdu": "جب لوگوں نے عبدالملک کی بیعت کی تو عبداللہ بن عمر رضی اللہ عنہما نے اسے لکھا ” اللہ کے بندے عبدالملک امیر المؤ منین کے نام ‘میں اقرار کرتا ہوں سننے اور اطاعت کرنے کی ۔ اللہ کے بندے عبدالملک امیرالمؤمنین کے لیے اللہ کے دین اور اس کے رسول کی سنت کے مطابق ‘جتنی مجھ میں طاقت ہو گی اور میرے بیٹوں نے بھی اس کا اقرار کیا ۔ “",
                "urduNarrator": "ہم سے عمرو بن علی نے بیان کیا ‘ انہوں نے کہا ہم سے یحییٰ نے بیان کیا ‘ ان سے سفیان نے بیان کیا ‘ انہوں نے کہا مجھ سے عبداللہ بن دینار نے بیان کیا ‘ کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ، قَالَ لَمَّا بَايَعَ النَّاسُ عَبْدَ الْمَلِكِ كَتَبَ إِلَيْهِ عَبْدُ اللَّهِ بْنُ عُمَرَ إِلَى عَبْدِ اللَّهِ عَبْدِ الْمَلِكِ أَمِيرِ الْمُؤْمِنِينَ إِنِّي أُقِرُّ بِالسَّمْعِ وَالطَّاعَةِ لِعَبْدِ اللَّهِ عَبْدِ الْمَلِكِ أَمِيرِ الْمُؤْمِنِينَ، عَلَى سُنَّةِ اللَّهِ وَسُنَّةِ رَسُولِهِ، فِيمَا اسْتَطَعْتُ، وَإِنَّ بَنِيَّ قَدْ أَقَرُّوا بِذَلِكَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6908,
                "hadithNumber": "7206",
                "englishNarrator": "Narrated Yazid:",
                "hadithEnglish": "I said to Salama رضی اللہ عنہ , \"For what did you give the Pledge of allegiance to the Prophet (ﷺ) on the Day of Hudaibiya?\" He replied, \"For death.\"",
                "hadithUrdu": "میں نے سلمہ رضی اللہ عنہ سے پوچھا آپ لوگوں نے صلح حدیبیہ کے موقع پر رسول اللہ صلی اللہ علیہ وسلم سے کس بات پر بیعت کی تھی ؟ انہوں نے کہا کہ موت پر ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ‘ کہا ہم سے حاتم نے بیان کیا ‘ ان سے یزید نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا حَاتِمٌ، عَنْ يَزِيدَ، قَالَ قُلْتُ لِسَلَمَةَ عَلَى أَىِّ شَىْءٍ بَايَعْتُمُ النَّبِيَّ صلى الله عليه وسلم يَوْمَ الْحُدَيْبِيَةِ قَالَ عَلَى الْمَوْتِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6909,
                "hadithNumber": "7207",
                "englishNarrator": "Narrated Al-Miswar bin Makhrama:",
                "hadithEnglish": "The group of people whom `Umar رضی اللہ عنہ had selected as candidates for the Caliphate gathered and consulted each other. `Abdur-Rahman said to them, \"I am not going to compete with you in this matter, but if you wish, I would select for you a caliph from among you.\" So all of them agreed to let `Abdur-Rahman decide the case. So when the candidates placed the case in the hands of `Abdur-Rahman رضی اللہ عنہ , the people went towards him and nobody followed the rest of the group nor obeyed any after him. So the people followed `Abdur-Rahman and consulted him all those nights till there came the night we gave the oath of allegiance to `Uthman رضی اللہ عنہ . Al-Miswar (bin Makhrama) added: `Abdur-Rahman called on me after a portion of the night had passed and knocked on my door till I got up, and he said to me, \"I see you have been sleeping! By Allah, during the last three nights I have not slept enough. Go and call Az-Zubair and Sa`d.' So I called them for him and he consulted them and then called me saying, 'Call `Ali for me.\" I called `Ali رضی اللہ عنہ and he held a private talk with him till very late at night, and then 'Al, got up to leave having had much hope (to be chosen as a Caliph) but `Abdur-Rahman was afraid of something concerning `Ali. `Abdur-Rahman then said to me, \"Call `Uthman for me.\" I called him and he kept on speaking to him privately till the Mu'adh-dhin put an end to their talk by announcing the Adhan for the Fajr prayer. When the people finished their morning prayer and that (six men) group gathered near the pulpit, `Abdur-Rahman sent for all the Muhajirin (emigrants) and the Ansar present there and sent for the army chief who had performed the Hajj with `Umar رضی اللہ عنہ that year. When all of them had gathered, `Abdur- Rahman said, \"None has the right to be worshipped but Allah,\" and added, \"Now then, O `Ali, I have looked at the people's tendencies and noticed that they do not consider anybody equal to `Uthman رضی اللہ عنہ , so you should not incur blame (by disagreeing).\" Then `Abdur-Rahman said (to `Uthman رضی اللہ عنہ ), \"I gave the oath of allegiance to you on condition that you will follow Allah's Laws and the traditions of Allah's Apostle and the traditions of the two Caliphs after him.\" So `Abdur-Rahman رضی اللہ عنہ gave the oath of allegiance to him, and so did the people including the Muhajirin (emigrants) and the Ansar and the chiefs of the army staff and all the Muslims.",
                "hadithUrdu": "وہ  آدمی جن کو عمر رضی اللہ عنہ خلافت کے لیے نامزد کر گئے تھے ( یعنی علی ‘ عثمان ‘ زبیر ‘ طلحہ اور عبدالرحمٰن بن عوف رضی اللہ عنہم کہ ان میں سے کسی ایک کو اتفاق سے خلیفہ بنا لیا جائے ) یہ سب جمع ہوئے اور مشورہ کیا ۔ ان سے عبدالرحمٰن بن عوف نے کہا خلیفہ ہونے کے لیے میں آپ لوگوں سے کوئی مقابلہ نہیں کروں گا ۔ البتہ اگر آپ لوگ چاہیں تو آپ لوگوں کے لیے کوئی خلیفہ آپ ہی میں سے میں چن دوں ۔ چنانچہ سب نے مل کر اس کا اختیار عبدالرحمٰن بن عوف کو دے دیا ۔ جب ان لوگوں نے انتخاب کی ذمہ داری عبدالرحمٰن رضی اللہ عنہ کے سپرد کر دی تو سب لوگ ان کی طرف جھک گئے ۔ جتنے لوگ بھی اس جماعت کے پیچھے چل رہے تھے ، ان میں اب میں نے کسی کو بھی ایسا نہ دیکھا جو عبدالرحمٰن کے پیچھے نہ چل رہا ہو ۔ سب لوگ ان ہی کی طرف مائل ہو گئے اور ان دنوں میں ان سے مشورہ کرتے رہے جب وہ رات آئی جس کی صبح کو ہم نے عثمان رضی اللہ عنہ سے بیعت کی ۔ مسور رضی اللہ عنہ نے بیان کیا تو عبدالرحمٰن رضی اللہ عنہ رات گئے میرے یہاں آئے اور دروازہ کھٹکٹھایا یہاں تک کہ میں بیدار ہو گیا ۔ انہوں نے کہا میرا خیال ہے آپ سو رہے تھے ‘ خدا کی قسم میں ان راتوں میں بہت کم سوسکا ہوں ۔ جائیے ! زبیر اور سعد کو بلائیے ۔ میں ان دونوں بزرگوں کو بلا لایا اور انہوں نے ان سے مشورہ کیا ‘ پھر مجھے بلایا اور کہا کہ میرے لیے علی رضی اللہ عنہ کو بھی بلا دیجئیے ۔ میں نے انہیں بھی بلایا اور انہوں نے ان سے بھی سر گوشی کی ۔ یہاں تک کہ آدھی رات گزرگئی ۔ پھر علی رضی اللہ عنہ ان کے پاس کھڑے ہو گئے اور ان کو اپنے ہی لیے امید تھی ۔ عبدالرحمٰن کے دل میں بھی ان کی طرف سے یہی ڈر تھا ‘ پھر انہوں نے کہا کہ میرے لیے عثمان رضی اللہ عنہ کو بھی بلا لائیے ۔ میں نے انہیں بھی بلا لایا اور انہوں نے ان سے بھی سر گوشی کی ۔ آخر صبح کے مؤذن نے ان کے درمیان جدائی کی ۔ جب لوگوں نے صبح کی نماز پڑھ لی اور یہ سب لوگ منبر کے پاس جمع ہوئے تو انہوں نے موجود مہاجرین انصار اور لشکروں کے قائدین کو بلایا ۔ ان لوگوں نے اس سال حج عمر رضی اللہ عنہ کے ساتھ کیا تھا ۔ جب سب لوگ جمع ہو گئے تو عبدالرحمٰن رضی اللہ عنہ نے خطبہ پڑھا پھر کہا امابعد ! اے علی ! میں نے لوگوں کے خیالات معلوم کئے اور میں نے دیکھا کہ وہ عثمان کو مقدم سمجھتے ہیں اور ان کے برابر کسی کو نہیں سمجھتے ‘ اس لیے آپ اپنے دل میں کوئی میل پیدا نہ کریں ۔ پھر کہا میں آپ ( عثمان رضی اللہ عنہ ) سے اللہ کے دین اور اس کے رسول کی سنت اور آپ کے دوخلفاء کے طریق کے مطابق بیعت کرتا ہوں ۔ چنانچہ پہلے ان سے عبدالرحمٰن بن عوف رضی اللہ عنہ نے بیعت کی ‘ پھر سب لوگوں نے اور مہاجرین ‘ انصار اور فوجیوں کے سرداروں اور تمام مسلمانوں نے بیعت کی ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد بن اسماء نے بیان کیا ‘ کہا ہم سے جویریہ بن اسماء نے بیان کیا ‘ ان سے امام مالک نے ‘ ان سے زہری نے ‘ انہیں حمید بن عبدالرحمٰن نے خبر دی اور انہیں مسور بن مخرمہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، أَنَّ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ أَخْبَرَهُ‏.‏ أَنَّ الرَّهْطَ الَّذِينَ وَلاَّهُمْ عُمَرُ اجْتَمَعُوا فَتَشَاوَرُوا، قَالَ لَهُمْ عَبْدُ الرَّحْمَنِ لَسْتُ بِالَّذِي أُنَافِسُكُمْ عَلَى هَذَا الأَمْرِ، وَلَكِنَّكُمْ إِنْ شِئْتُمُ اخْتَرْتُ لَكُمْ مِنْكُمْ‏.‏ فَجَعَلُوا ذَلِكَ إِلَى عَبْدِ الرَّحْمَنِ، فَلَمَّا وَلَّوْا عَبْدَ الرَّحْمَنِ أَمْرَهُمْ فَمَالَ النَّاسُ عَلَى عَبْدِ الرَّحْمَنِ، حَتَّى مَا أَرَى أَحَدًا مِنَ النَّاسِ يَتْبَعُ أُولَئِكَ الرَّهْطَ وَلاَ يَطَأُ عَقِبَهُ، وَمَالَ النَّاسُ عَلَى عَبْدِ الرَّحْمَنِ يُشَاوِرُونَهُ تِلْكَ اللَّيَالِيَ حَتَّى إِذَا كَانَتِ اللَّيْلَةُ الَّتِي أَصْبَحْنَا مِنْهَا، فَبَايَعْنَا عُثْمَانَ قَالَ الْمِسْوَرُ طَرَقَنِي عَبْدُ الرَّحْمَنِ بَعْدَ هَجْعٍ مِنَ اللَّيْلِ فَضَرَبَ الْبَابَ حَتَّى اسْتَيْقَظْتُ فَقَالَ أَرَاكَ نَائِمًا، فَوَاللَّهِ مَا اكْتَحَلْتُ هَذِهِ اللَّيْلَةَ بِكَبِيرِ نَوْمٍ، انْطَلِقْ فَادْعُ الزُّبَيْرَ وَسَعْدًا، فَدَعَوْتُهُمَا لَهُ فَشَاوَرَهُمَا ثُمَّ دَعَانِي فَقَالَ ادْعُ لِي عَلِيًّا‏.‏ فَدَعَوْتُهُ فَنَاجَاهُ حَتَّى ابْهَارَّ اللَّيْلُ، ثُمَّ قَامَ عَلِيٌّ مِنْ عِنْدِهِ، وَهْوَ عَلَى طَمَعٍ، وَقَدْ كَانَ عَبْدُ الرَّحْمَنِ يَخْشَى مِنْ عَلِيٍّ شَيْئًا، ثُمَّ قَالَ ادْعُ لِي عُثْمَانَ، فَدَعَوْتُهُ فَنَاجَاهُ حَتَّى فَرَّقَ بَيْنَهُمَا الْمُؤَذِّنُ بِالصُّبْحِ، فَلَمَّا صَلَّى لِلنَّاسِ الصُّبْحَ وَاجْتَمَعَ أُولَئِكَ الرَّهْطُ عِنْدَ الْمِنْبَرِ، فَأَرْسَلَ إِلَى مَنْ كَانَ حَاضِرًا مِنَ الْمُهَاجِرِينَ وَالأَنْصَارِ، وَأَرْسَلَ إِلَى أُمَرَاءِ الأَجْنَادِ وَكَانُوا وَافَوْا تِلْكَ الْحَجَّةَ مَعَ عُمَرَ، فَلَمَّا اجْتَمَعُوا تَشَهَّدَ عَبْدُ الرَّحْمَنِ ثُمَّ قَالَ أَمَّا بَعْدُ يَا عَلِيُّ، إِنِّي قَدْ نَظَرْتُ فِي أَمْرِ النَّاسِ فَلَمْ أَرَهُمْ يَعْدِلُونَ بِعُثْمَانَ، فَلاَ تَجْعَلَنَّ عَلَى نَفْسِكَ سَبِيلاً‏.‏ فَقَالَ أُبَايِعُكَ عَلَى سُنَّةِ اللَّهِ وَرَسُولِهِ وَالْخَلِيفَتَيْنِ مِنْ بَعْدِهِ‏.‏ فَبَايَعَهُ عَبْدُ الرَّحْمَنِ، وَبَايَعَهُ النَّاسُ الْمُهَاجِرُونَ وَالأَنْصَارُ وَأُمَرَاءُ الأَجْنَادِ وَالْمُسْلِمُونَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6910,
                "hadithNumber": "7208",
                "englishNarrator": "Narrated Salama رضی اللہ عنہ :",
                "hadithEnglish": "We gave the oath of allegiance to the Prophet (ﷺ) under the tree. He said to me, \"O Salama! Will you not give the oath of allegiance?\" I replied, \"O Allah's Messenger (ﷺ)! I have already given the oath of allegiance for the first time.\" He said, (Give it again) for the second time.",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم سے درخت کے نیچے بیعت کی ۔ آنحضرت صلی اللہ علیہ وسلم نے مجھ سے فرمایا ‘ سلمہ ! کیا تم بیعت نہیں کرو گے ؟ میں نے عرض کیا یا رسول اللہ ! میں نے پہلی ہی مرتبہ میں بیعت کر لی ہے ۔ فرمایا کہ اور دوسری مرتبہ میں بھی کر لو ۔",
                "urduNarrator": "ہم سے ابو العاصم نے بیان کیا ‘ کہا ہم سے یزید بن ابی عبید نے ، ان سے سلمہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ، قَالَ بَايَعْنَا النَّبِيَّ صلى الله عليه وسلم تَحْتَ الشَّجَرَةِ فَقَالَ لِي ‏\"‏ يَا سَلَمَةُ أَلاَ تُبَايِعُ ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ قَدْ بَايَعْتُ فِي الأَوَّلِ‏.‏ قَالَ ‏\"‏ وَفِي الثَّانِي ‏\"‏‏.‏",
                "headingArabic": "مَنْ بَايَعَ مَرَّتَيْنِ",
                "headingUrdu": "جس نے بھی بیع کو دو مرتبہ دیا۔",
                "headingEnglish": "Whosoever gave the Bai'a twice",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6911,
                "hadithNumber": "7209",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "A bedouin gave the Pledge of allegiance to Allah's Messenger (ﷺ) for Islam and the bedouin got a fever where upon he said to the Prophet (ﷺ) \"Cancel my Pledge.\" But the Prophet (ﷺ) refused. He came to him (again) saying, \"Cancel my Pledge.' But the Prophet (ﷺ) refused. Then (the bedouin) left (Medina). Allah's Apostle said: \"Medina is like a pair of bellows (furnace): It expels its impurities and brightens and clears its good.\"",
                "hadithUrdu": "ایک دیہاتی نے نبی کریم صلی اللہ علیہ وسلم سے اسلام پر بیعت کی پھر اسے بخار ہو گیا تو اس نے کہا کہ میری بیعت فسخ کر دیجئیے آنحضرت صلی اللہ علیہ وسلم نے انکار کیا پھر وہ آنحضرت صلی اللہ علیہ وسلم کے پاس آیا اور کہنے لگا کہ میری بیعت فسخ کر دیجئیے آنحضرت صلی اللہ علیہ وسلم نے انکار کیا آخر وہ ( خود ہی مدینہ سے ) چلا گیا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مدینہ بھٹی کی طرح ہے اپنی میل کچیل دور کر دیتا ہے اور صاف مال کو رکھ لیتا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ‘ کہا ہم سے امام مالک نے بیان کیا ‘ ان سے محمد بن منکدر نے ‘ ان سے جابر بن عبداللہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ أَعْرَابِيًّا بَايَعَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الإِسْلاَمِ، فَأَصَابَهُ وَعْكٌ فَقَالَ أَقِلْنِي بَيْعَتِي‏.‏ فَأَبَى، ثُمَّ جَاءَهُ فَقَالَ أَقِلْنِي بَيْعَتِي‏.‏ فَأَبَى، فَخَرَجَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الْمَدِينَةُ كَالْكِيرِ، تَنْفِي خَبَثَهَا، وَيَنْصَعُ طِيبُهَا ‏\"‏‏.‏",
                "headingArabic": "بَيْعَةِ الأَعْرَابِ",
                "headingUrdu": "بدویوں کی طرف سے بیع دینا",
                "headingEnglish": "The giving of the Bai'a by the bedouins",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6912,
                "hadithNumber": "7210",
                "englishNarrator": "Narrated `Abdullah bin Hisham رضی اللہ عنہ :",
                "hadithEnglish": "who was born during the lifetime of the Prophet (ﷺ) that his mother, Zainab bint Humaid had taken him to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Take his Pledge of allegiance (for Islam).\" The Prophet (ﷺ) said, \"He (`Abdullah bin Hisham) is a little child,\" and passed his hand over his head and invoked Allah for him. `Abdullah bin Hisham used to slaughter one sheep as a sacrifice on behalf of all of his family.",
                "hadithUrdu": "انہوں نے آنحضرت صلی اللہ علیہ وسلم کا زمانہ پایا تھا اور ان کی والدہ زینب بنت حمید ان کو رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے کر حاضر ہوئی تھیں اور عرض کیا تھا یا رسول اللہ ! اس سے بیعت لے لیجئے ۔ رسول اللہ نے فرمایا کہ یہ ابھی کمسن ہے پھر آنحضرت صلی اللہ علیہ وسلم نے اس کے سر پر ہاتھ پھیرا اور ان کے لیے دعا فرمائی اور اپنے تمام گھر والوں کی طرف سے ایک ہی بکری قربانی کیا کرتے تھے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ‘ انہوں نے کہا ہم سے عبداللہ بن یزیدنے بیان کیا ‘ ان سے سعید ابن ابی ایوب نے بیان کیا ‘ ان سے ابو عقیل زہرہ بن معبد نے بیان کیا ‘ انہوں نے اپنے دادا عبداللہ بن ہشام رضی اللہ عنہ سے اور",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنَا سَعِيدٌ ـ هُوَ ابْنُ أَبِي أَيُّوبَ ـ قَالَ حَدَّثَنِي أَبُو عَقِيلٍ، زُهْرَةُ بْنُ مَعْبَدٍ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ هِشَامٍ، وَكَانَ، قَدْ أَدْرَكَ النَّبِيَّ صلى الله عليه وسلم وَذَهَبَتْ بِهِ أُمُّهُ زَيْنَبُ ابْنَةُ حُمَيْدٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ بَايِعْهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ هُوَ صَغِيرٌ ‏\"‏ فَمَسَحَ رَأْسَهُ وَدَعَا لَهُ، وَكَانَ يُضَحِّي بِالشَّاةِ الْوَاحِدَةِ عَنْ جَمِيعِ أَهْلِهِ‏.‏",
                "headingArabic": "بَيْعَةِ الصَّغِيرِ",
                "headingUrdu": "بچے کی بیع",
                "headingEnglish": "The Bai'a of a child",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6913,
                "hadithNumber": "7211",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "A bedouin gave the Pledge of allegiance to Allah's Messenger (ﷺ) for Islam. Then the bedouin got fever at Medina, came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Cancel my Pledge,\" But Allah's Apostle refused. Then he came to him (again) and said, \"O Allah's Messenger (ﷺ)! Cancel my Pledge.\" But the Prophet (ﷺ) refused Then he came to him (again) and said, \"O Allah's Messenger (ﷺ)! Cancel my Pledge.\" But the Prophet (ﷺ) refused. The bedouin finally went out (of Medina) whereupon Allah's Messenger (ﷺ) said, \"Medina is like a pair of bellows (furnace): It expels its impurities and brightens and clears its good.",
                "hadithUrdu": "ایک دیہاتی نے رسول کریم صلی اللہ علیہ وسلم سے اسلام پر بیعت کی پھر اسے مدینہ میں بخار ہو گیا تو وہ آنحضرت صلی اللہ علیہ وسلم کے پاس آیا اور کہا کہ یا رسول اللہ ! میری بیعت فسخ کر دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے انکار کیا پھر وہ دوبارہ آیا اور کہا کہ میری بیعت فسخ کر دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس مرتبہ بھی انکار کیا پھر وہ آیا اور بیعت فسخ کرنے کا مطالبہ کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس مرتبہ بھی انکار کیا ۔ اس کے بعد وہ خود ہی ( مدینہ سے ) چلا گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ مدینہ بھٹی کی طرح ہے اپنی میل کچیل کو دور کر دیتا ہے اور خالص مال رکھ لیتا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ‘ انہوں نے کہا ہم کو امام مالک نے خبر دی ‘ انہیں محمد بن منکدر نے اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ،‏.‏ أَنَّ أَعْرَابِيًّا، بَايَعَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الإِسْلاَمِ فَأَصَابَ الأَعْرَابِيَّ وَعْكٌ بِالْمَدِينَةِ، فَأَتَى الأَعْرَابِيُّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَقِلْنِي بَيْعَتِي، فَأَبَى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ جَاءَهُ فَقَالَ أَقِلْنِي بَيْعَتِي فَأَبَى، ثُمَّ جَاءَهُ فَقَالَ أَقِلْنِي بَيْعَتِي فَأَبَى فَخَرَجَ الأَعْرَابِيُّ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّمَا الْمَدِينَةُ كَالْكِيرِ تَنْفِي خَبَثَهَا وَيَنْصَعُ طِيبُهَا ‏\"‏‏.‏",
                "headingArabic": "مَنْ بَايَعَ ثُمَّ اسْتَقَالَ الْبَيْعَةَ",
                "headingUrdu": "جس نے بیعت دی اور پھر منسوخ کر دی۔",
                "headingEnglish": "Whoever gave the Bai'a and then cancelled it",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6914,
                "hadithNumber": "7212",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"There will be three types of people whom Allah will neither speak to them on the Day of Resurrection nor will purify them from sins, and they will have a painful punishment: They are, (1) a man possessed superfluous water (more than he needs) on a way and he withholds it from the travelers. (2) a man who gives a pledge of allegiance to an Imam (ruler) and gives it only for worldly benefits, if the Imam gives him what he wants, he abides by his pledge, otherwise he does not fulfill his pledge; (3) and a man who sells something to another man after the `Asr prayer and swears by Allah (a false oath) that he has been offered so much for it whereupon the buyer believes him and buys it although in fact, the seller has not been offered such a price.\" (See Hadith No. 838, Vol. 3)",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ، تین آدمی ایسے ہیں جن سے اللہ تعالیٰ قیامت کے دن بات نہیں کرے گا اور نہ انہیں پاک کرے گا اور ان کے لیے بہت سخت دکھ دینے والا عذاب ہو گا ۔ ایک وہ شخص جس کے پاس راستے میں زیادہ پانی ہو اور وہ مسافر کو اس میں سے نہ پلائے دوسرا وہ شخص جو امام سے بیعت کرے اور بیعت کی غرض صرف دنیا کمانا ہو اگر وہ امام اسے کچھ دیدے تو بیعت پوری کرے اور بیعت پوری کرے ورنہ توڑ دے ۔ تیسرا وہ شخص جو کسی دوسرے سے کچھ مال متاع عصر کے بعد بیچ رہا ہو اور قسم کھائے کہ اسے اس سا مان کی اتنی اتنی قیمت مل رہی تھی اور پھر خریدنے والا اسے سچا سمجھ کر اس مال کو لے لے حالانکہ اسے اس کی اتنی قیمت نہیں مل رہی تھی ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ‘ کہا ہم سے ابوحمزہ محمد بن سیرین نے بیان کیا ‘ ان سے اعمش نے ‘ ان سے ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ، وَلاَ يُزَكِّيهِمْ، وَلَهُمْ عَذَابٌ أَلِيمٌ رَجُلٌ عَلَى فَضْلِ مَاءٍ بِالطَّرِيقِ يَمْنَعُ مِنْهُ ابْنَ السَّبِيلِ، وَرَجُلٌ بَايَعَ إِمَامًا لاَ يُبَايِعُهُ إِلاَّ لِدُنْيَاهُ، إِنْ أَعْطَاهُ مَا يُرِيدُ وَفَى لَهُ، وَإِلاَّ لَمْ يَفِ لَهُ، وَرَجُلٌ يُبَايِعُ رَجُلاً بِسِلْعَةٍ بَعْدَ الْعَصْرِ فَحَلَفَ بِاللَّهِ لَقَدْ أُعْطِيَ بِهَا كَذَا وَكَذَا فَصَدَّقَهُ، فَأَخَذَهَا، وَلَمْ يُعْطَ بِهَا ‏\"‏‏.‏",
                "headingArabic": "مَنْ بَايَعَ رَجُلاً لاَ يُبَايِعُهُ إِلاَّ لِلدُّنْيَا",
                "headingUrdu": "وہ شخص جو بیع کو صرف دنیوی فائدے کے لیے دیتا ہے۔",
                "headingEnglish": "The person who gives Bai'a just for worldly benefits",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6915,
                "hadithNumber": "7213",
                "englishNarrator": "Narrated 'Ubada bin As-Samit رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said to us while we were in a gathering, \"Give me the oath (Pledge of allegiance for: (1) Not to join anything in worship along with Allah, (2) Not to steal, (3) Not to commit illegal sexual intercourse, (4) Not to kill your children, (5) Not to accuse an innocent person (to spread such an accusation among people), (6) Not to be disobedient (when ordered) to do good deeds. The Prophet (ﷺ) added: Whoever amongst you fulfill his pledge, his reward will be with Allah, and whoever commits any of those sins and receives the legal punishment in this world for that sin, then that punishment will be an expiation for that sin, and whoever commits any of those sins and Allah does not expose him, then it is up to Allah if He wishes He will punish him or if He wishes, He will forgive him.\" So we gave the Pledge for that. (See Hadith No. 17, Vol. 1)",
                "hadithUrdu": "ہم مجلس میں موجود تھے کہ رسول کریم صلی اللہ علیہ وسلم نے فرمایا مجھ سے بیعت کرو کہ اللہ کے ساتھ کسی کو شریک نہیں ٹھہراؤگے ‘ چوری نہیں کرو گے ‘ زنا نہیں کرو گے ‘ اپنی اولاد کو قتل نہیں کرو گے اور اپنی طرف سے گھڑ کر کسی پر بہتان نہیں لگاؤ گے اور نیک کام میں نافرمانی نہیں کرو گے ۔ پس جو کوئی تم میں سے اس وعدے کو پورا کرے اس کا ثواب اللہ کے یہاں اسے ملے گا اور جو کوئی ان کاموں میں سے کسی برے کام کو کرے گا ‘ اس کی سزا اسے دنیا میں ہی مل جائے گی تو یہ اس کے لیے کفارہ ہو گا اور جو کوئی ان میں سے کسی برائی کا کام کرے گا اور اللہ اسے چھپا لے گا تو اس کا معاملہ اللہ کے حوالہ ہے ۔ چاہے تو اس کی سزا دے اور چاہے اسے معاف کر دے ۔ چنانچہ ہم نے اس پر آنحضرت صلی اللہ علیہ وسلم سے بیعت کی ۔ بیعت اقرار کو کہتے ہیں جو خلیفہ اسلام کے ہاتھ پر ہاتھ رکھ کر کیا جائے یا پھر کسی نیک صالح انسان کے ہاتھ پر ہو ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی انہیں زہری نے ( دوسری سند ) اور لیث نے بیان کیا کہ مجھ سے یونس نے بیان کیا ‘ ان سے ابن شہاب نے ‘ کہا مجھ کو ابو ادریس خولانی نے خبر دی ‘انہوں نے عبادہ بن صامت رضی اللہ عنہ سے سنا ‘ انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، وَقَالَ اللَّيْثُ، حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو إِدْرِيسَ الْخَوْلاَنِيُّ، أَنَّهُ سَمِعَ عُبَادَةَ بْنَ الصَّامِتِ، يَقُولُ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ فِي مَجْلِسٍ ‏ \"‏ تُبَايِعُونِي عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا، وَلاَ تَسْرِقُوا، وَلاَ تَزْنُوا، وَلاَ تَقْتُلُوا أَوْلاَدَكُمْ، وَلاَ تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ وَلاَ تَعْصُوا فِي مَعْرُوفٍ، فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَعُوقِبَ فِي الدُّنْيَا فَهْوَ كَفَّارَةٌ لَهُ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَسَتَرَهُ اللَّهُ فَأَمْرُهُ إِلَى اللَّهِ إِنْ شَاءَ عَاقَبَهُ وَإِنْ شَاءَ عَفَا عَنْهُ ‏\"‏، فَبَايَعْنَاهُ عَلَى ذَلِكَ‏.‏",
                "headingArabic": "بَيْعَةِ النِّسَاءِ",
                "headingUrdu": "عورتوں کی طرف سے دی گئی بیعت",
                "headingEnglish": "The Bai'a given by women",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6916,
                "hadithNumber": "7214",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) used to take the Pledge of allegiance from the women by words only after reciting this Holy Verse:--(60.12) \"..that they will not associate anything in worship with Allah.\" (60.12) And the hand of Allah's Messenger (ﷺ) did not touch any woman's hand except the hand of that woman his right hand possessed. (i.e. his captives or his lady slaves).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم عورتوں سے زبانی اس آیت کے احکام کی بیعت لیتے کہ وہ اللہ کے ساتھ کسی کو شریک نہیں ٹھہرائیں گی آخر آیت تک ۔ بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم کے ہاتھ نے کبھی کسی عورت کا ہاتھ نہیں چھوا ‘ سوا اس عورت کے جو آپ کی لونڈی ہو ۔",
                "urduNarrator": "ہم سے محمود بن غیلان نے بیان کیا ‘ کہا ہم سے عبدالرزاق بن ہمام نے بیان کیا ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں زہری نے ‘ انہیں عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُبَايِعُ النِّسَاءَ بِالْكَلاَمِ بِهَذِهِ الآيَةِ ‏{‏لاَ يُشْرِكْنَ بِاللَّهِ شَيْئًا‏}‏ قَالَتْ وَمَا مَسَّتْ يَدُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَدَ امْرَأَةٍ، إِلاَّ امْرَأَةً يَمْلِكُهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6917,
                "hadithNumber": "7215",
                "englishNarrator": "Narrated Um Atiyya رضی اللہ عنہ :",
                "hadithEnglish": "We gave the Pledge of allegiance to the Prophet (ﷺ) and he recited to me the verse (60.12). That they will not associate anything in worship with Allah (60.12). And he also prevented us from wailing and lamenting over the dead. A woman from us held her hand out and said, \"Such-and-such a woman cried over a dead person belonging to my family and I want to compensate her for that crying\" The Prophet did not say anything in reply and she left and returned. None of those women abided by her pledge except Um Sulaim, Um Al-`Ala', and the daughter of Abi Sabra, the wife of Al-Mu`adh رضی اللہ عنہم or the daughter of Abi Sabra, and the wife of Mu`adh.",
                "hadithUrdu": "ہم نے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی تو آپ نے میرے سامنے سورۃ الممتحنہ کی یہ آیت پڑھی ” یہ کہ وہ اللہ کے ساتھ کسی کو شریک نہ ٹھہرائیں گی آخر تک اور ہمیں آپ نے نوحہ سے منع کیا پھر ہم میں سے ایک عورت نے اپنا ہاتھ کھینچ لیا اور کہا کہ فلاں عورت نے کسی نوحہ میں میری مدد کی تھی ( میرے ساتھ مل کر نوحہ کیا تھا ) اور میں اسے اس کا بدلہ دینا چاہتی ہوں ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے کچھ نہیں کہا ‘ پھر وہ گئیں اور واپس آئیں ( میرے ساتھ بیعت کرنیوالی عورتوں میں سے ) کسی عورت نے اس بیعت کو پورا نہیں کیا ‘ سوا ام سلیم اور ام العلاء اور معاذ رضی اللہ عنہم کی بیوی ابوسبرہ کی بیٹی کے یا ابوسبرہ کی بیٹی اور معاذ کی بیوی کے اور سب عورتوں نے احکام بیعت کو پورے طور پر ادا نہ کر کے بیعت کو نہیں نبھا یا ۔ غفر اللہ لھن اجمعین ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے عبدالوارث نے بیان کیا ‘ ان سے ایوب نے ‘ان سے حفصہ نے اور ان سے ام عطیہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَيُّوبَ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ بَايَعْنَا النَّبِيَّ صلى الله عليه وسلم فَقَرَأَ عَلَىَّ ‏{‏أَنْ لاَ يُشْرِكْنَ بِاللَّهِ شَيْئًا‏}‏ وَنَهَانَا عَنِ النِّيَاحَةِ، فَقَبَضَتِ امْرَأَةٌ مِنَّا يَدَهَا فَقَالَتْ فُلاَنَةُ أَسْعَدَتْنِي وَأَنَا أُرِيدُ أَنْ أَجْزِيَهَا، فَلَمْ يَقُلْ شَيْئًا، ثُمَّ رَجَعَتْ، فَمَا وَفَتِ امْرَأَةٌ إِلاَّ أُمُّ سُلَيْمٍ وَأُمُّ الْعَلاَءِ، وَابْنَةُ أَبِي سَبْرَةَ امْرَأَةُ مُعَاذٍ أَوِ ابْنَةُ أَبِي سَبْرَةَ وَامْرَأَةُ مُعَاذٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6918,
                "hadithNumber": "7216",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "A bedouin came to the Prophet (ﷺ) and said, \"Please take my Pledge of allegiance for Islam.\" So the Prophet took from him the Pledge of allegiance for Islam. He came the next day with a fever and said to the Prophet (ﷺ) \"Cancel my pledge.\" But the Prophet (ﷺ) refused and when the bedouin went away, the Prophet said, \"Medina is like a pair of bellows (furnace): It expels its impurities and brightens and clears its good.\"",
                "hadithUrdu": "ایک گنوار ( نام نامعلوم ) یا قیس بن ابی حازم آنحضرت صلی اللہ علیہ وسلم کے پاس آیا ‘ کہنے لگا یا رسول اللہ ! اسلام پر مجھ سے بیعت لیجئے ۔ آپ نے اس سے بیعت لے لی ‘ پھر دو سرے دن بخار میں ہلہلاتا آیا کہنے لگا میری بیعت فسخ کر دیجئیے ۔ آپ نے انکار کیا ( بیعت فسخ نہیں کی ) جب وہ پیٹھ موڑ کر چلتا ہوا تو  آپ صلی اللہ علیہ وسلم نے فرمایا: فرمایا مدینہ کیا ہے ( لوہار کی بھٹی ہے ) پلید اور نا پاک ( میل کچیل ) کو چھانٹ ڈالتا ہے اور کھرا ستھرا مال رکھ لیتا ہے ۔",
                "urduNarrator": "ہم سے ابونعیم ( فضل بن دکین ) نے بیان کیا ‘ کہا ہیم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے محمد بن منکدر نے ‘ انہوں نے کہا میں نے جابر بن عبداللہ انصاری رضی اللہ عنہ سے سنا ‘ وہ کہتے تھے",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، سَمِعْتُ جَابِرًا، قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ بَايِعْنِي عَلَى الإِسْلاَمِ‏.‏ فَبَايَعَهُ عَلَى الإِسْلاَمِ، ثُمَّ جَاءَ الْغَدَ مَحْمُومًا فَقَالَ أَقِلْنِي‏.‏ فَأَبَى، فَلَمَّا وَلَّى قَالَ ‏ \"‏ الْمَدِينَةُ كَالْكِيرِ، تَنْفِي خَبَثَهَا، وَيَنْصَعُ طِيبُهَا ‏\"‏‏.‏",
                "headingArabic": "مَنْ نَكَثَ بَيْعَةً",
                "headingUrdu": "جس نے بیعت کی خلاف ورزی کی۔",
                "headingEnglish": "Whoever violates a Bai'a",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6919,
                "hadithNumber": "7217",
                "englishNarrator": "Narrated Al-Qasim bin Muhammad:",
                "hadithEnglish": "`Aisha رضی اللہ عنہا said, \"O my head!\" Allah's Messenger (ﷺ) said, \"If that (i.e., your death) should happen while I am still alive, I would ask Allah to forgive you and would invoke Allah for you.\" `Aisha رضی اللہ عنہا said, \"O my life which is going to be lost! By Allah, I think that you wish for my death, and if that should happen then you would be busy enjoying the company of one of your wives in the last part of that day.\" The Prophet said, \"But I should say, 'O my head!' I feel like calling Abu Bakr and his son and appoint (the former as my successors lest people should say something or wish for something. Allah will insist (on Abu Bakr becoming a Caliph) and the believers will prevent (anyone else from claiming the Caliphate),\" or \"..Allah will prevent (anyone else from claiming the Caliphate) and the believers will insist (on Abu Bakr becoming the Caliph).",
                "hadithUrdu": "عائشہ رضی اللہ عنہا نے کہا ( اپنے سردرد پر ) ہائے سر پھٹا جاتا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ اگر تم مر جاؤ اور میں زندہ رہا تو میں تمہارے لیے مغفرت کروں گا اور تمہارے لیے دعا کروں گا ۔ عائشہ رضی اللہ عنہا نے اس پر کہا افسوس میرا خیال ہے کہ آپ میری موت چاہتے ہیں اور اگر ایسا ہو گیا تو آپ دن کے آخری وقت ضرور کسی دوسری عورت سے شادی کر لیں گے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تو نہیں بلکہ میں اپنا سر دکھنے کا اظہار کرتا ہوں ۔ میرا ارادہ ہوا تھا کہ ابوبکر اور ان کے بیٹے کو بلا بھیجوں اور انہیں ( ابوبکر کو ) خلیفہ بنا دوں تاکہ اس پر کسی دعویٰ کرنے والے یا اس کی خواہش رکھنے والے کے لئے کوئی گنجائش نہ رہے لیکن پھر میں نے سوچا کہ اللہ خود ( کسی دوسرے کو خلیفہ ) نہیں ہونے دے گا اور مسلمان بھی اسے دفع کریں گے ۔ یا ( آپ نے اس طرح فرمایا کہ ) اللہ دفع کرے گا اور مسلمان کسی اور کو خلیفہ نہ ہونے دیں گے ۔",
                "urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا ‘ کہا ہم کو سلیمان بن بلال نے خبر دی ‘ انہیں یحییٰ بن سعید نے ‘ کہامیں نے قاسم بن محمد سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ، قَالَ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ وَارَأْسَاهْ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ذَاكِ لَوْ كَانَ وَأَنَا حَىٌّ فَأَسْتَغْفِرُ لَكِ وَأَدْعُو لَكِ ‏\"‏‏.‏ فَقَالَتْ عَائِشَةُ وَاثُكْلِيَاهْ وَاللَّهِ إِنِّي لأَظُنُّكَ تُحِبُّ مَوْتِي وَلَوْ كَانَ ذَاكَ لَظَلِلْتَ آخِرَ يَوْمِكَ مُعَرِّسًا بِبَعْضِ أَزْوَاجِكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بَلْ أَنَا وَارَأْسَاهْ لَقَدْ هَمَمْتُ ـ أَوْ أَرَدْتُ ـ أَنْ أُرْسِلَ إِلَى أَبِي بَكْرٍ وَابْنِهِ فَأَعْهَدَ أَنْ يَقُولَ الْقَائِلُونَ أَوْ يَتَمَنَّى الْمُتَمَنُّونَ ‏\"‏‏.‏ ثُمَّ قُلْتُ يَأْبَى اللَّهُ وَيَدْفَعُ الْمُؤْمِنُونَ، أَوْ يَدْفَعُ اللَّهُ وَيَأْبَى الْمُؤْمِنُونَ‏.‏",
                "headingArabic": "الاِسْتِخْلاَفِ",
                "headingUrdu": "خلیفہ کا تقرر",
                "headingEnglish": "The appointment of a caliph",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6920,
                "hadithNumber": "7218",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "It was said to `Umar رضی اللہ عنہ , \"Will you appoint your successor?\" `Umar رضی اللہ عنہ said, \"If I appoint a Caliph (as my successor) it is true that somebody who was better than I (i.e., Abu Bakr رضی اللہ عنہ ) did so, and if I leave the matter undecided, it is true that somebody who was better than I (i.e., Allah's Messenger (ﷺ)) did so.\" On this, the people praised him. `Umar رضی اللہ عنہ said, \"People are of two kinds: Either one who is keen to take over the Caliphate or one who is afraid of assuming such a responsibility. I wish I could be free from its responsibility in that I would receive neither reward nor retribution I won't bear the burden of the caliphate in my death as I do in my life.\"",
                "hadithUrdu": "حضرت عمر رضی اللہ عنہ جب زخمی ہوئے تو ان سے کہا گیا کہ آپ اپنا خلیفہ منتخب کرتا ہوں ( تو اس کی بھی مثال ہے کہ ) اس شخص نے اپنا خلیفہ منتخب کیا تھا جو مجھ سے بہتر تھے یعنی ابوبکر رضی اللہ عنہ اور اگر میں اسے مسلمانوں کی رائے پر چھوڑ تا ہوں تو ( اس کی بھی مثال موجود ہے کہ ) اس بزرگ نے ( خلیفہ کا انتخاب مسلمانوں کے لیے ) چھوڑ دیا تھا جو مجھ سے بہتر تھے یعنی رسول کریم صلی اللہ علیہ وسلم ۔ پھر لوگوں نے آپ کی تعریف کی ‘پھر انہوں نے کہا کہ کوئی تو دل سے میری تعریف کرتا ہے کوئی ڈر کر ۔ اب میں تو یہی غنیمت سمجھتا ہوں کہ خلافت کی ذمہ داریوں میں اللہ کے ہاں برابر برابر ہی چھوٹ جاؤں ‘ نہ مجھے کچھ ثواب ملے اور نہ کوئی عذاب میں نے خلافت کا بوجھ اپنی زندگی بھر اٹھایا ۔ اب مرنے پر میں اس بار کو نہیں اٹھاؤں گا ۔",
                "urduNarrator": "ہم سے محمد بن یوسف فریابی نے بیان کیا ‘ کہا ہم کو سفیان ثوری نے خبر دی ‘ انہیں ہشام بن عروہ نے ‘ انہیں ان کے والد نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، أَخْبَرَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قِيلَ لِعُمَرَ أَلاَ تَسْتَخْلِفُ قَالَ إِنْ أَسْتَخْلِفْ فَقَدِ اسْتَخْلَفَ مَنْ هُوَ خَيْرٌ مِنِّي أَبُو بَكْرٍ، وَإِنْ أَتْرُكْ فَقَدْ تَرَكَ مَنْ هُوَ خَيْرٌ مِنِّي رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَثْنَوْا عَلَيْهِ فَقَالَ رَاغِبٌ رَاهِبٌ، وَدِدْتُ أَنِّي نَجَوْتُ مِنْهَا كَفَافًا لاَ لِي وَلاَ عَلَىَّ لاَ أَتَحَمَّلُهَا حَيًّا وَمَيِّتًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6921,
                "hadithNumber": "7219",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "He heard `Umar's second speech he delivered when he sat on the pulpit on the day following the death of the Prophet (ﷺ) `Umar رضی اللہ عنہ recited the Tashahhud while Abu Bakr رضی اللہ عنہ was silent. `Umar رضی اللہ عنہ said, \"I wish that Allah's Messenger (ﷺ) had outlived all of us, i.e., had been the last (to die). But if Muhammad is dead, Allah nevertheless has kept the light amongst you from which you can receive the same guidance as Allah guided Muhammad with that. And Abu Bakr رضی اللہ عنہ is the companion of Allah's Messenger (ﷺ) He is the second of the two in the cave. He is the most entitled person among the Muslims to manage your affairs. Therefore get up and swear allegiance to him.\" Some people had already taken the oath of allegiance to him in the shed of Bani Sa`ida but the oath of allegiance taken by the public was taken at the pulpit. I heard `Umar رضی اللہ عنہ saying to Abu Bakr رضی اللہ عنہ on that day. \"Please ascend the pulpit,\" and kept on urging him till he ascended the pulpit whereupon, all the people swore allegiance to him.",
                "hadithUrdu": "انہوں نے عمر رضی اللہ عنہ کا دوسرا خطبہ سنا جب آپ منبر پر بیٹھے ہوئے تھے ‘ یہ واقعہ رسول اللہ صلی اللہ علیہ وسلم کی وفات کے دوسرے دن کا ہے ۔ انہوں نے کلمہ شہادت پڑھا ‘ حضرت ابوبکر رضی اللہ عنہ خاموش تھے اور کچھ نہیں بول رہے تھے ‘ پھر کہا مجھے امید تھی کہ آنحضرت صلی اللہ علیہ وسلم زندہ رہیں گے اور ہمارے کاموں کی تدبیر وانتظام کرتے رہیں گے ۔ ان کا منشا یہ تھا کہ آنحضرت صلی اللہ علیہ وسلم ان سب لوگوں کے بعد تک زندہ رہیں گے تو اگر آج محمد صلی اللہ علیہ وسلم وفات پا گئے ہیں تو اللہ تعالیٰ نے تمہارے سامنے نور ( قرآن ) کو باقی رکھا ہے جس کے ذریعہ تم ہدایت حاصل کرتے رہو گے اور اللہ نے محمد صلی اللہ علیہ وسلم کو اس سے ہدایت کی اور حضرت ابوبکر رضی اللہ عنہ آنحضرت صلی اللہ علیہ وسلم کے ساتھی ( جو غار ثور میں ) دو میں کے دوسرے ہیں ‘ بلا شک وہ تمہارے امور خلافت کے لیے تمام مسلمانوں میں سب سے بہتر ہیں ۔ پس اٹھو اور ان سے بیعت کرو ۔ ایک جماعت ان سے پہلے ہی سقیفہ بنی ساعدہ میں بیعت کر چکی تھی ‘ پھر عام لوگوں نے منبر پر بیعت کی ۔ زہری نے بیان کیا ‘ ان سے انس بن مالک رضی اللہ عنہ نے ‘ انہوں نے عمر رضی اللہ عنہ سے سنا کہ وہ حضرت ابوبکر رضی اللہ عنہ سے ‘ اس دن کہہ رہے تھے ‘ منبر پر چڑھ آئیے ۔ چنانچہ وہ اس کا برابر اصرار کرتے رہے ‘ یہاں تک کہ ابوبکر رضی اللہ عنہ منبر پر چڑھ گئے اور سب لوگوں نے آپ سے بیعت کی ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ‘ کہا ہم کو ہشام نے خبر دی ‘ انہیں معمر نے ‘ انہیں زہری نے ‘ انہیں انس بن مالک رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامٌ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ خُطْبَةَ، عُمَرَ الآخِرَةَ حِينَ جَلَسَ عَلَى الْمِنْبَرِ، وَذَلِكَ الْغَدُ مِنْ يَوْمٍ تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم فَتَشَهَّدَ وَأَبُو بَكْرٍ صَامِتٌ لاَ يَتَكَلَّمُ قَالَ كُنْتُ أَرْجُو أَنْ يَعِيشَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى يَدْبُرَنَا ـ يُرِيدُ بِذَلِكَ أَنْ يَكُونَ آخِرَهُمْ ـ فَإِنْ يَكُ مُحَمَّدٌ صلى الله عليه وسلم قَدْ مَاتَ، فَإِنَّ اللَّهَ تَعَالَى قَدْ جَعَلَ بَيْنَ أَظْهُرِكُمْ نُورًا تَهْتَدُونَ بِهِ بِمَا هَدَى اللَّهُ مُحَمَّدًا صلى الله عليه وسلم وَإِنَّ أَبَا بَكْرٍ صَاحِبُ رَسُولِ اللَّهِ صلى الله عليه وسلم ثَانِي اثْنَيْنِ، فَإِنَّهُ أَوْلَى الْمُسْلِمِينَ بِأُمُورِكُمْ، فَقُومُوا فَبَايِعُوهُ‏.‏ وَكَانَتْ طَائِفَةٌ مِنْهُمْ قَدْ بَايَعُوهُ قَبْلَ ذَلِكَ فِي سَقِيفَةِ بَنِي سَاعِدَةَ، وَكَانَتْ بَيْعَةُ الْعَامَّةِ عَلَى الْمِنْبَرِ‏.‏ قَالَ الزُّهْرِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ سَمِعْتُ عُمَرَ يَقُولُ لأَبِي بَكْرٍ يَوْمَئِذٍ اصْعَدِ الْمِنْبَرَ‏.‏ فَلَمْ يَزَلْ بِهِ حَتَّى صَعِدَ الْمِنْبَرَ، فَبَايَعَهُ النَّاسُ عَامَّةً‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6922,
                "hadithNumber": "7220",
                "englishNarrator": "Narrated Jubair bin Mut`im:",
                "hadithEnglish": "A woman came to the Prophet (ﷺ) and spoke to him about something and he told her to return to him. She said, \"O Allah's Messenger (ﷺ)! If I come and do not find you?\" (As if she meant, \"...if you die?\") The Prophet said, \"If you should not find me, then go to Abu Bakr.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے پاس ایک خاتون آئیں اور کسی معاملہ میں آپ سے گفتگو کی ‘ پھر آنحضرت صلی اللہ علیہ وسلم نے ان سے کہا کہ وہ دوبارہ آپ کے پاس آئیں ۔ انہوں نے عرض کیا یا رسول اللہ ! اگر میں آؤں اور آپ کو نہ پاؤں تو پھر آپ کیا فرماتے ہیں ؟ جیسے ان کا اشارہ وفات کی طرف ہو ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر مجھے نہ پاؤ تو ابوبکر رضی اللہ عنہ کے پاس آئیو ۔",
                "urduNarrator": "ہم سے عبد العزیز بن عبداللہ نے بیان کیا ‘ کہا ہم سے ابراہیم بن سعد نے بیان کیا ‘ ان سے ان کے والد نے ‘ ان سے محمد جبیر بن مطعم نے ‘ ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ، قَالَ أَتَتِ النَّبِيَّ صلى الله عليه وسلم امْرَأَةٌ فَكَلَّمَتْهُ فِي شَىْءٍ فَأَمَرَهَا أَنْ تَرْجِعَ إِلَيْهِ، قَالَتْ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ جِئْتُ وَلَمْ أَجِدْكَ، كَأَنَّهَا تُرِيدُ الْمَوْتَ، قَالَ ‏ \"‏ إِنْ لَمْ تَجِدِينِي فَأْتِي أَبَا بَكْرٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6923,
                "hadithNumber": "7221",
                "englishNarrator": "Narrated Tariq bin Shihab:",
                "hadithEnglish": "Abu Bakr رضی اللہ عنہ said to the delegate of Buzakha. \"Follow the tails of the camels till Allah shows the Caliph (successor) of His Prophet and Al-Muhajirin (emigrants) something because of which you may excuse yourselves.\"",
                "hadithUrdu": "ابوبکر رضی اللہ عنہ نے قبائل بزاخہ کے وفد سے ( جو آنحضرت صلی اللہ علیہ وسلم کی وفات کے بعد مرتد ہو گیا تھا اور اب معافی کے لیے آیا تھا ) فرمایا کہ اونٹوں کی دموں کے پیچھے پیچھے جنگلوں میں گھومتے رہو ‘ یہاں تک کہ اللہ تعالیٰ اپنے نبی کریم صلی اللہ علیہ وسلم کے خلیفہ اور مہاجرین کو کوئی امر بتلا دے جس کی وجہ سے وہ تمہارا قصور معاف کر دیں ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے یحییٰ نے بیان کیا ‘ ان سے سفیان نے ‘ ان سے قیس بن مسلم نے ‘ ان سے طارق بن شہاب نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، حَدَّثَنِي قَيْسُ بْنُ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي بَكْرٍ ـ رضى الله عنه ـ قَالَ لِوَفْدِ بُزَاخَةَ تَتْبَعُونَ أَذْنَابَ الإِبِلِ حَتَّى يُرِيَ اللَّهُ خَلِيفَةَ نَبِيِّهِ صلى الله عليه وسلم وَالْمُهَاجِرِينَ أَمْرًا يَعْذِرُونَكُمْ بِهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6924,
                "hadithNumber": "7222, 7223",
                "englishNarrator": "Narrated Jabir bin Samura رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"There will be twelve Muslim rulers (who will rule all the Islamic world).\" He then said a sentence which I did not hear. My father said, \"All of them (those rulers) will be from Quraish.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ‘ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ( میری امت میں ) بارہ امیر ہوں گے ‘ پھر آپ صلی اللہ علیہ وسلم نے کوئی ایسی بات فرمائی جو میں نے نہیں سنی ۔ بعد میں میرے والد نے بتایا کہ آپ صلی اللہ علیہ وسلم نے یہ فرمایا کہ وہ سب کے سب قریش خاندان سے ہوں گے ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ‘ کہا ہم سے غندر محمد بن جعفر نے بیان کیا ‘ کہا ہم سے شعبہ بن حجاج نے بیان کیا ‘ ان سے عبدالملک بن عمیر نے ، انہوں نے جابر بن سمرہ رضی اللہ عنہ سے سنا ‘ کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ، سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ يَكُونُ اثْنَا عَشَرَ أَمِيرًا ـ فَقَالَ كَلِمَةً لَمْ أَسْمَعْهَا فَقَالَ أَبِي إِنَّهُ قَالَ ـ كُلُّهُمْ مِنْ قُرَيْشٍ ‏\"‏‏.",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6925,
                "hadithNumber": "7224",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"By Him in Whose Hands my life is, I was about to order for collecting fire wood and then order someone to pronounce the Adhan for the prayer and then order someone to lead the people in prayer and then I would go from behind and burn the houses of men who did not present themselves for the (compulsory congregational) prayer. By Him in Whose Hands my life is, if anyone of you had known that he would receive a bone covered with meat or two (small) pieces of meat present in between two ribs, he would come for `Isha' prayer.\" (See Hadith No. 617, Vol. 1)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ! میرا ارادہ ہوا کہ میں لکڑیوں کے جمع کرنے کا حکم دوں ‘ پھر نماز کے لیے اذان دینے کا ‘ پھر کسی سے کہوں کہ وہ لوگوں کو نماز پڑھائے اور میں اس کے بجائے ان لوگوں کے پاس جاؤں ( جو جماعت میں شریک نہیں ہوتے ) اور انہیں ان کے گھروں سمیت جلا دوں ۔ قسم ہے اس ذات کی جس ہاتھ میں میری جان ہے کہ تم سے کسی کو اگر یہ امید ہو کہ وہاں موٹی ہڈی یا دو مرماۃ حسنہ ( بکری کے گھر ) کے درمیان کا گوشت ملے گا تو وہ ضرور ( نماز ) عشاء میں شریک ہو ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا مجھ سے امام مالک نے بیان کیا ‘ ان سے ابوالزناد نے ‘ ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَقَدْ هَمَمْتُ أَنْ آمُرَ بِحَطَبٍ يُحْتَطَبُ، ثُمَّ آمُرَ بِالصَّلاَةِ فَيُؤَذَّنَ لَهَا، ثُمَّ آمُرَ رَجُلاً فَيَؤُمَّ النَّاسَ، ثُمَّ أُخَالِفَ إِلَى رِجَالٍ فَأُحَرِّقَ عَلَيْهِمْ بُيُوتَهُمْ، وَالَّذِي نَفْسِي بِيَدِهِ لَوْ يَعْلَمُ أَحَدُكُمْ أَنَّهُ يَجِدُ عَرْقًا سَمِينًا أَوْ مَرْمَاتَيْنِ حَسَنَتَيْنِ لَشَهِدَ الْعِشَاءَ ‏\"‏‏.‏ قَالَ مُحَمَّدُ بْنُ يُوسُفَ قَالَ يُونُسُ قَالَ مُحَمَّدُ بْنُ سُلَيْمَانَ قَالَ أَبُو عَبْدِ اللَّهِ مِرْمَاةٌ مَا بَيْنَ ظِلْفِ الشَّاةِ مِنَ اللَّحْمِ مِثْلُ مِنْسَاةٍ وَمِيضَاةٍ‏.‏ الْمِيمُ مَخْفُوضَةٌ‏.‏",
                "headingArabic": "إِخْرَاجِ الْخُصُومِ وَأَهْلِ الرِّيَبِ مِنَ الْبُيُوتِ بَعْدَ الْمَعْرِفَةِ",
                "headingUrdu": "جھگڑالو لوگوں کو گھروں سے نکالنا",
                "headingEnglish": "The expulsion of quarrelsome people from houses",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6926,
                "hadithNumber": "7225",
                "englishNarrator": "Narrated `Abdullah bin Ka`b bin Malik:",
                "hadithEnglish": "Who was Ka`b's guide from among his sons when Ka`b became blind: I heard Ka`b bin Malik رضی اللہ عنہ saying, \"When some people remained behind and did not join Allah's Messenger (ﷺ) in the battle of Tabuk..\" and then he described the whole narration and said, \"Allah's Messenger (ﷺ) forbade the Muslims to speak to us, and so we (I and my companions) stayed fifty nights in that state, and then Allah's Messenger (ﷺ) announced Allah's acceptance of our repentance.\"",
                "hadithUrdu": "عبداللہ بن کعب بن مالک ‘کعب بن مالک رضی اللہ عنہ کے نابینا ہو جانے کے زمانے میں ان کے سب لڑکوں میں یہی راستے میں ان کے ساتھ چلتے تھے ‘ نے بیان کیا کہ میں نے کعب بن مالک رضی اللہ عنہ سے سنا ‘ انہوں نے کہا کہ جب وہ غزوہ تبوک میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نہیں جا سکتے تھے ‘ پھر انہوں نے اپنا پورا واقعہ بیان کیا اور آنحضرت صلی اللہ علیہ وسلم نے مسلمانوں کو ہم سے گفتگو کرنے سے روک دیا تھا تو ہم پچاس دن اسی حالت میں رہے ‘ پھر آنحضرت صلی اللہ علیہ وسلم نے اعلان کیا کہ اللہ نے ہماری توبہ قبول کر لی ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث نے بیان کیا ‘ ان سے عقیل نے ‘ ان سے ابن شہاب نے ‘ ان سے عبدالرحمٰن بن عبداللہ بن کعب بن مالک نے کہ",
                "hadithArabic": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبِ بْنِ مَالِكٍ ـ وَكَانَ قَائِدَ كَعْبٍ مِنْ بَنِيهِ حِينَ عَمِيَ ـ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ، قَالَ لَمَّا تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ ـ فَذَكَرَ حَدِيثَهُ ـ وَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُسْلِمِينَ عَنْ كَلاَمِنَا، فَلَبِثْنَا عَلَى ذَلِكَ خَمْسِينَ لَيْلَةً، وَآذَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِتَوْبَةِ اللَّهِ عَلَيْنَا‏.‏",
                "headingArabic": "هَلْ لِلإِمَامِ أَنْ يَمْنَعَ الْمُجْرِمِينَ وَأَهْلَ الْمَعْصِيَةِ مِنَ الْكَلاَمِ مَعَهُ وَالزِّيَارَةِ وَنَحْوِهِ",
                "headingUrdu": "مجرموں اور گنہگاروں کو حاکم سے بات کرنے یا ملنے سے منع کرنا",
                "headingEnglish": "To forbid the criminals and sinners to talk to or visit the ruler",
                "chapterId": "95",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 95,
                    "chapterNumber": "95",
                    "chapterEnglish": "Judgments (Ahkaam)",
                    "chapterUrdu": "حکومت اور قضا کے بیان میں",
                    "chapterArabic": "كتاب الأحكام",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6927,
                "hadithNumber": "7226",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"By Him in Whose Hands my life is! Were it not for some men who dislike to be left behind and for whom I do not have means of conveyance, I would not stay away (from any Holy Battle). I would love to be martyred in Allah's Cause and come to life and then get, martyred and then come to life and then get martyred and then get resurrected and then get martyred.",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم نے سنا آپ صلی اللہ علیہ وسلم نے فرمایا ‘ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ۔ اگر ان لوگوں کا خیال نہ ہوتا جو میرے ساتھ غزوہ میں شریک نہ ہو سکنے کو برا جانتے ہیں مگر اسباب کی کمی کی وجہ سے وہ شریک نہیں ہو سکتے اور کوئی ایسی چیز میرے پاس نہیں ہے جس پر انہیں سوار کروں تو میں کبھی ( غزاوات میں شریک ہونے سے ) پیچھے نہ رہتا ۔ میری خواہش ہے کہ اللہ کے راستے میں قتل کیا جاؤں پھر زندہ کیا جاؤں ‘ پھر قتل کیا جاؤں ‘ پھر زندہ کیا جاؤں ‘ پھر قتل کیا جاؤں ‘ اور پھر زندہ کیا جاؤں اور پھر مارا جاؤں ۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ‘ کہا مجھ سے لیث بن سعد نے ‘ کہا مجھ سے عبدالرحمٰن بن خالد نے بیان کیا ‘ ان سے ابن شہاب نے ‘ ان سے ابوسلمہ اور سعید بن مسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنِي اللَّيْثُ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَسَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَوْلاَ أَنَّ رِجَالاً يَكْرَهُونَ أَنْ يَتَخَلَّفُوا بَعْدِي وَلاَ أَجِدُ مَا أَحْمِلُهُمْ مَا تَخَلَّفْتُ، لَوَدِدْتُ أَنِّي أُقْتَلُ فِي سَبِيلِ اللَّهِ، ثُمَّ أُحْيَا ثُمَّ أُقْتَلُ، ثُمَّ أُحْيَا ثُمَّ أُقْتَلُ، ثُمَّ أُحْيَا ثُمَّ أُقْتَلُ ‏\"‏‏.‏",
                "headingArabic": "مَا جَاءَ فِي التَّمَنِّي وَمَنْ تَمَنَّى الشَّهَادَةَ",
                "headingUrdu": "شہادت کے لیے نیک خواہشات",
                "headingEnglish": "Wishes for martyrdom",
                "chapterId": "96",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 96,
                    "chapterNumber": "96",
                    "chapterEnglish": "Wishes",
                    "chapterUrdu": "نیک ترین آرزؤں کے جائز ہونے کے بیان میں",
                    "chapterArabic": "كتاب التمني",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6928,
                "hadithNumber": "7227",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"By Him in Whose Hand my life is, I would love to fight in Allah's Cause and then get martyred and then resurrected (come to life) and then get martyred and then resurrected (come to life) and then get martyred, and then resurrected (come to life) and then get martyred and then resurrected (come to life).\" Abu Huraira رضی اللہ عنہ used to repeat those words three times and I testify to it with Allah's Oath.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ۔ میری آرزو ہے کہ میں اللہ کے راستے میں جنگ کروں اور قتل کیا جاؤں پھر زندہ کیا جاؤں ‘ پھر قتل کیا جاؤں ‘ پھر زندہ کیا جاؤں ‘ پھر قتل کیا جاؤں ‘ابوہریرہ رضی اللہ عنہ ان الفاظ کو تین مرتبہ دہراتے تھے کہ میں اللہ کو گواہ کر کے کہتا ہوں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ کہا ہم کو مالک نے خبر دی ‘ انہیں ابوالزناد نے ‘ انہیں اعرج نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ وَالَّذِي نَفْسِي بِيَدِهِ وَدِدْتُ أَنِّي لأُقَاتِلُ فِي سَبِيلِ اللَّهِ فَأُقْتَلُ ثُمَّ أُحْيَا ثُمَّ أُقْتَلُ، ثُمَّ أُحْيَا، ثُمَّ أُقْتَلُ، ثُمَّ أُحْيَا، ثُمَّ أُقْتَلُ، ثُمَّ أُحْيَا ‏\"‏‏.‏ فَكَانَ أَبُو هُرَيْرَةَ يَقُولُهُنَّ ثَلاَثًا أَشْهَدُ بِاللَّهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "96",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 96,
                    "chapterNumber": "96",
                    "chapterEnglish": "Wishes",
                    "chapterUrdu": "نیک ترین آرزؤں کے جائز ہونے کے بیان میں",
                    "chapterArabic": "كتاب التمني",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6929,
                "hadithNumber": "7228",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If I had gold equal to the mountain of Uhud, I would love that, before three days had passed, not a single Dinar thereof remained with me if I found somebody to accept it excluding some amount that I would keep for the payment of my debts.''",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اگر میرے پاس احد پہاڑ کے برابر سونا ہوتا تو میں پسند کرتاکہ اگر ان کے لینے والے مل جائیں تو تین دن گزرنے سے پہلے ہی میرے پاس اس میں سے ایک دینار بھی نہ بچے ‘ سوا اس کے جسے میں اپنے اوپر قرض کی ادائیگی کے لیے روک لوں ۔",
                "urduNarrator": "ہم سے اسحاق بن نصر نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ ان سے معمر نے ‘ ان سے ہمام بن منبہ نے ‘ انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، سَمِعَ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لَوْ كَانَ عِنْدِي أُحُدٌ ذَهَبًا، لأَحْبَبْتُ أَنْ لاَ يَأْتِيَ ثَلاَثٌ وَعِنْدِي مِنْهُ دِينَارٌ، لَيْسَ شَىْءٌ أُرْصِدُهُ فِي دَيْنٍ عَلَىَّ أَجِدُ مَنْ يَقْبَلُهُ ‏\"‏‏.‏",
                "headingArabic": "تَمَنِّي الْخَيْرِ",
                "headingUrdu": "خیر کی تمنا کرنا",
                "headingEnglish": "To wish for good",
                "chapterId": "96",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 96,
                    "chapterNumber": "96",
                    "chapterEnglish": "Wishes",
                    "chapterUrdu": "نیک ترین آرزؤں کے جائز ہونے کے بیان میں",
                    "chapterArabic": "كتاب التمني",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6930,
                "hadithNumber": "7229",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If I had formerly known what I came to know recently, I would not have driven the Hadi with me and would have finished the state of Ihram along with the people when they finished it.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ( حجتہ الوداع کے موقع پر ) فرمایا اگر مجھ کو اپنا حال پہلے سے معلوم ہوتا جو بعد کو معلوم ہوا تو میں اپنے ساتھ قربانی کا جانور نہ لاتا اور عمرہ کر کے دوسرے لوگوں کی طرح بھی احرام کھول ڈالتا ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے بیان کیا ‘ ان سے عقیل نے ‘ ان سے ابن شہاب نے ‘ ان سے عروہ رضی اللہ عنہ نے کہ عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُرْوَةُ، أَنَّ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوِ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ مَا سُقْتُ الْهَدْىَ، وَلَحَلَلْتُ مَعَ النَّاسِ حِينَ حَلُّوا ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ لَوِ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ ‏\"‏",
                "headingUrdu": "\"اگر میں پہلے جانتا تھا کہ مجھے حال ہی میں کیا معلوم ہوا ہے…\"",
                "headingEnglish": "“If I had formerly known what I came to know recently…”",
                "chapterId": "96",
                "bookSlug": "sahih-bukhari",
                "volume": "9",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 96,
                    "chapterNumber": "96",
                    "chapterEnglish": "Wishes",
                    "chapterUrdu": "نیک ترین آرزؤں کے جائز ہونے کے بیان میں",
                    "chapterArabic": "كتاب التمني",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 6901,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=276",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=274",
                "label": "274",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=275",
                "label": "275",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=276",
                "label": "276",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=277",
                "label": "277",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=278",
                "label": "278",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=279",
                "label": "279",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=280",
                "label": "280",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=278",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=278",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=276",
        "to": 6925,
        "total": 40465
    }
}