{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 116,
        "data": [
            {
                "id": 2878,
                "hadithNumber": "3011",
                "englishNarrator": "Narrated Abu Burda's father:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Three persons will get their reward twice. (One is) a person who has a slave girl and he educates her properly and teaches her good manners properly (without violence) and then manumits and marries her. Such a person will get a double reward. (Another is) a believer from the people of the scriptures who has been a true believer and then he believes in the Prophet (ﷺ) (Muhammad). Such a person will get a double reward. (The third is) a slave who observes Allah's Rights and Obligations and is sincere to his master.\" Slave who discharges his his duties to all Allah and is also a well-wisher of his master. Hadrat Shabi says: I have told you this Hadith with out any charge whereas people journeyed to Madina (Munawwarah) for a Hadith brriefer than it.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ تین طرح کے آدمی ایسے ہیں جنہیں دوگنا ثواب ملتا ہے ۔ اول وہ شخص جس کی لونڈی ہو ‘ وہ اسے تعلیم دے اور تعلیم دینے میں اچھا طریقہ اختیار کرے ‘ اسے ادب سکھائے اور اس میں اچھے طریقے سے کام لے ‘ پھر اسے آزاد کر کے اس سے شادی کر لے تو اسے دہرا اجر ملے گا ۔ دوسرا وہ مومن جو اہل کتاب میں سے ہو کہ پہلے ( اپنے نبی پر ایمان لایا تھا ‘ پھر نبی کریم صلی اللہ علیہ وسلم پر بھی ایمان لایا تو اسے بھی دہرا اجر ملے گا ‘ تیسرا وہ غلام جو اللہ تعالیٰ کے حقوق کی بھی ادائیگی کرتا ہے اور اپنے آقا کے ساتھ بھی بھلائی کرتا ہے ۔ اس کے بعد شعبی ( راوی حدیث ) نے کہا کہ میں نے تمہیں یہ حدیث بلا کسی محنت و مشقت کے دے دی ہے ۔ ایک زمانہ وہ بھی تھا جب اس سے بھی کم حدیث کے لئے مدینہ منورہ تک کا سفر کرنا پڑتا تھا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے صالح بن حی ابوحسن نے بیان کیا ‘ کہا کہ میں نے شعبی سے سنا ‘ وہ بیان کرتے تھے کہ مجھ سے ابوبردہ نے بیان کیا ‘ انہوں نے اپنے والد ( ابوموسیٰ اشعری رضی اللہ عنہ ) سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنَا صَالِحُ بْنُ حَىٍّ أَبُو حَسَنٍ، قَالَ سَمِعْتُ الشَّعْبِيَّ، يَقُولُ حَدَّثَنِي أَبُو بُرْدَةَ، أَنَّهُ سَمِعَ أَبَاهُ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ ثَلاَثَةٌ يُؤْتَوْنَ أَجْرَهُمْ مَرَّتَيْنِ الرَّجُلُ تَكُونُ لَهُ الأَمَةُ فَيُعَلِّمُهَا فَيُحْسِنُ تَعْلِيمَهَا، وَيُؤَدِّبُهَا فَيُحْسِنُ أَدَبَهَا، ثُمَّ يُعْتِقُهَا فَيَتَزَوَّجُهَا، فَلَهُ أَجْرَانِ، وَمُؤْمِنُ أَهْلِ الْكِتَابِ الَّذِي كَانَ مُؤْمِنًا، ثُمَّ آمَنَ بِالنَّبِيِّ صلى الله عليه وسلم فَلَهُ أَجْرَانِ، وَالْعَبْدُ الَّذِي يُؤَدِّي حَقَّ اللَّهِ وَيَنْصَحُ لِسَيِّدِهِ ‏\"‏‏.‏ ثُمَّ قَالَ الشَّعْبِيُّ وَأَعْطَيْتُكَهَا بِغَيْرِ شَىْءٍ وَقَدْ كَانَ الرَّجُلُ يَرْحَلُ فِي أَهْوَنَ مِنْهَا إِلَى الْمَدِينَةِ‏.‏",
                "headingArabic": "فَضْلِ مَنْ أَسْلَمَ مِنْ أَهْلِ الْكِتَابَيْنِ",
                "headingUrdu": "اہل کتاب (یہود و نصاریٰ) کی برتری جو اسلام قبول کرتے ہیں۔",
                "headingEnglish": "The superiority of the people of the Scriptures (Jews and Christians) who embrace Islam",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2879,
                "hadithNumber": "3012",
                "englishNarrator": "Narrated As-Sab bin Jaththama رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) passed by me at a place called Al-Abwa or Waddan, and was asked whether it was permissible to attack the pagan warriors at night with the probability of exposing their women and children to danger. The Prophet (ﷺ) replied, \"They (i.e. women and children) are from them (i.e. pagans).\" I also heard the Prophet (ﷺ) saying, \"The institution of Hima is invalid except for Allah and His Apostle.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم مقام ابواء یا ودان میں میرے پاس سے گزرے تو آپ صلی اللہ علیہ وسلم سے پوچھا گیا کہ مشرکین کے جس قبیلے پر شب خون مارا جائے گا کیا ان کی عورتوں اور بچوں کو بھی قتل کرنا درست ہو گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ بھی انہیں میں سے ہیں اور میں نے آپ صلی اللہ علیہ وسلم سے سنا کہ آپ فرما رہے تھے اللہ اور اس کے رسول صلی اللہ علیہ وسلم کے سوا اور کسی کی چراگاہ نہیں ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ کہا ہم سے زہری نے بیان کیا ‘ ان سے عبیداللہ بن عبداللہ بن عتبہ نے‘ان سے ابن عباس رضی اللہ عنہما نے اور ان سے صعب بن جثامہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ عُبَيْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنِ الصَّعْبِ بْنِ جَثَّامَةَ ـ رضى الله عنهم ـ قَالَ مَرَّ بِيَ النَّبِيُّ صلى الله عليه وسلم بِالأَبْوَاءِ ـ أَوْ بِوَدَّانَ ـ وَسُئِلَ عَنْ أَهْلِ الدَّارِ يُبَيَّتُونَ مِنَ الْمُشْرِكِينَ، فَيُصَابُ مِنْ نِسَائِهِمْ وَذَرَارِيِّهِمْ قَالَ ‏\"‏ هُمْ مِنْهُمْ ‏\"‏‏.‏ وَسَمِعْتُهُ يَقُولُ ‏\"‏ لاَ حِمَى إِلاَّ لِلَّهِ وَلِرَسُولِهِ صلى الله عليه وسلم ‏\"‏‏.‏",
                "headingArabic": "أَهْلِ الدَّارِ يُبَيَّتُونَ فَيُصَابُ الْوِلْدَانُ وَالذَّرَارِيُّ",
                "headingUrdu": "بچوں اور بچوں کے قتل کا امکان",
                "headingEnglish": "Probability of killing the babies and children",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2880,
                "hadithNumber": "3013",
                "englishNarrator": "Narrated Ibn-e-Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Amr, Ibn-e-Shihab report about the household of the idolaters with a Mursal chain. Zuhri, Obaidullah, and Hadrat Ibn-e-Abbas رضی اللہ عنہما , Hadrat Sa'b Jaththamah رضی اللہ عنہ says: They are include in them and did not say as Amr said: They are among their forefathers.",
                "hadithUrdu": "عمرو ہم سے حدیث بیان کرتے تھے ۔ ان سے ابن شہاب ‘ نبی اکرم صلی اللہ علیہ وسلم سے ، ( سفیان نے ) بیان کیا کہ پھر ہم نے حدیث خود زہری ( ابن شہاب ) سے سنی ۔ انہوں نے بیان کیا کہ مجھے عبیداللہ نے خبر دی ، انہیں ابن عباس رضی اللہ عنہما نے اور انہیں صعب رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، ( مشرکین کی عورتوں اور بچوں کے متعلق کہ ) وہ بھی انہیں میں سے ہیں ۔ ( زہری کے واسطہ سے ) جس طرح عمرو نے بیان کیا تھا کہ » ھم من اٰبائھم « وہ بھی انہیں کے باپ دادوں کی نسل ہیں ۔ زہری نے خود ہم سے ان الفاظ کے ساتھ بیان نہیں کیا » یعنی ھم من اٰبائھم نہیں کہا بلکہ ھم منھم کہا « ۔",
                "urduNarrator": "( سابقہ سند کے ساتھ ) زہری سے روایت ہے کہ انہوں نے عبیداللہ سے سنا بواسطہ ابن عباس رضی اللہ عنہما اور ان سے صعب رضی اللہ عنہ نے بیان کیا ‘ اور صرف ذراری ( بچوں ) کا ذکر کیا ‘ سفیان نے کہا کہ",
                "hadithArabic": "وَعَنِ الزُّهْرِيِّ، أَنَّهُ سَمِعَ عُبَيْدَ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، حَدَّثَنَا الصَّعْبُ، فِي الذَّرَارِيِّ كَانَ عَمْرٌو يُحَدِّثُنَا عَنِ ابْنِ شِهَابٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم فَسَمِعْنَاهُ مِنَ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنِ الصَّعْبِ، قَالَ ‏\"‏ هُمْ مِنْهُمْ ‏\"‏ وَلَمْ يَقُلْ كَمَا قَالَ عَمْرٌو ‏\"‏ هُمْ مِنْ آبَائِهِمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2881,
                "hadithNumber": "3014",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "During some of the Ghazawat of the Prophet (ﷺ) a woman was found killed. Allah's Messenger (ﷺ) disapproved the killing of women and children.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے ایک غزوہ ( غزوہ فتح ) میں ایک عورت مقتول پائی گئی تو آنحضرت صلی اللہ علیہ وسلم نے عورتوں اوربچوں کے قتل پر انکار کا اظہار فرمایا ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ‘ کہا ہم کو لیث نے خبر دی ‘ انہیں نافع نے اور انہیں عبداللہ رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ ـ رضى الله عنه ـ أَخْبَرَهُ أَنَّ امْرَأَةً وُجِدَتْ فِي بَعْضِ مَغَازِي النَّبِيِّ صلى الله عليه وسلم مَقْتُولَةً، فَأَنْكَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَتْلَ النِّسَاءِ وَالصِّبْيَانِ‏.‏",
                "headingArabic": "قَتْلِ الصِّبْيَانِ فِي الْحَرْبِ",
                "headingUrdu": "جنگ میں بچوں کو مارنا",
                "headingEnglish": "Killing the children in the war",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2882,
                "hadithNumber": "3015",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "During some of the Ghazawat of Allah's Messenger (ﷺ) a woman was found killed, so Allah's Messenger (ﷺ) forbade the killing of women and children.",
                "hadithUrdu": "ایک عورت رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں کسی غزوے میں مقتول پائی گئی تو نبی کریم صلی اللہ علیہ وسلم نے عورتوں اور بچوں کے قتل سے منع فرمایا ( تو انہوں نے اس کا اقرار کیا ) ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا ‘ کہا کہ میں نے ابواسامہ سے پوچھا ، کیا عبیداللہ نے آپ سے یہ حدیث بیان کی ہے کہ ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ قُلْتُ لأَبِي أُسَامَةَ حَدَّثَكُمْ عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ وُجِدَتِ امْرَأَةٌ مَقْتُولَةً فِي بَعْضِ مَغَازِي رَسُولِ اللَّهِ صلى الله عليه وسلم، فَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ قَتْلِ النِّسَاءِ وَالصِّبْيَانِ‏.‏",
                "headingArabic": "قَتْلِ النِّسَاءِ فِي الْحَرْبِ",
                "headingUrdu": "جنگ میں عورتوں کو قتل کرنا",
                "headingEnglish": "Killing the women in the war",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2883,
                "hadithNumber": "3016",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent us in a mission (i.e., an army-unit) and said, \"If you find so-and-so and so-and-so, burn both of them with fire.\" When we intended to depart, Allah's Messenger (ﷺ) said, \"I have ordered you to burn so-and-so and so-and-so, and it is none but Allah Who punishes with fire, so, if you find them, kill them (i.e., don't burn them).\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ایک مہم پر روانہ فرمایا اور یہ ہدایت فرمائی کہ اگر تمہیں فلاں اور فلاں مل جائیں تو انہیں آگ میں جلا دینا ‘ پھر جب ہم نے روانگی کا ارادہ کیا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں نے تمہیں حکم دیا تھا کہ فلاں اور فلاں کو جلا دینا ۔ لیکن آگ ایک ایسی چیز ہے جس کی سزا صرف اللہ تعالیٰ ہی دے سکتا ہے ۔ اس لئے اگر وہ تمہیں ملیں تو انہیں قتل کرنا ۔ ( آگ میں نہ جلانا ) ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے لیث نے بیان کیا ‘ ان سے بکیر نے ‘ ان سے سلیمان بن یسار نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ بُكَيْرٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ قَالَ بَعَثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَعْثٍ فَقَالَ ‏\"‏ إِنْ وَجَدْتُمْ فُلاَنًا وَفُلاَنًا فَأَحْرِقُوهُمَا بِالنَّارِ ‏\"‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ أَرَدْنَا الْخُرُوجَ ‏\"‏ إِنِّي أَمَرْتُكُمْ أَنْ تُحْرِقُوا فُلاَنًا وَفُلاَنًا، وَإِنَّ النَّارَ لاَ يُعَذِّبُ بِهَا إِلاَّ اللَّهُ، فَإِنْ وَجَدْتُمُوهُمَا فَاقْتُلُوهُمَا ‏\"‏‏.‏",
                "headingArabic": "لاَ يُعَذَّبُ بِعَذَابِ اللَّهِ",
                "headingUrdu": "اللہ کے عذاب سے عذاب نہ دینا",
                "headingEnglish": "Not to punish with Allah's punishment",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2884,
                "hadithNumber": "3017",
                "englishNarrator": "Narrated `Ikrima:",
                "hadithEnglish": "`Ali رضی اللہ عنہ burnt some people and this news reached Ibn `Abbas رضی اللہ عنہ , who said, \"Had I been in his place I would not have burnt them, as the Prophet (ﷺ) said, 'Don't punish (anybody) with Allah's Punishment.' No doubt, I would have killed them, for the Prophet (ﷺ) said, 'If somebody (a Muslim) discards his religion, kill him.' \"",
                "hadithUrdu": "علی رضی اللہ عنہ نے ایک قوم کو ( جو عبداللہ بن سبا کی متبع تھی اور حضرت علی رضی اللہ عنہ کو اپنا خدا کہتی تھی ) جلا دیا تھا ۔ جب یہ خبر حضرت عبداللہ بن عباس رضی اللہ عنہما کو ملی تو آپ نے کہا کہ اگر میں ہوتا تو کبھی انہیں نہ جلاتا کیونکہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہے کہ اللہ کے عذاب کی سزا کسی کو نہ دو ‘ البتہ میں انہیں قتل ضرور کرتا کیونکہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہے جو شخص اپنا دین تبدیل کر دے اسے قتل کر دو ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ‘ کہا ہم سے سفیان نے بیان کیا ‘ ان سے ایوب نے ‘ ان سے عکرمہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، أَنَّ عَلِيًّا ـ رضى الله عنه ـ حَرَّقَ قَوْمًا، فَبَلَغَ ابْنَ عَبَّاسٍ فَقَالَ لَوْ كُنْتُ أَنَا لَمْ أُحَرِّقْهُمْ، لأَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تُعَذِّبُوا بِعَذَابِ اللَّهِ ‏\"‏‏.‏ وَلَقَتَلْتُهُمْ كَمَا قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2885,
                "hadithNumber": "3018",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "A group of eight men from the tribe of 'Ukil came to the Prophet (ﷺ) and then they found the climate of Medina unsuitable for them. So, they said, \"O Allah's Messenger (ﷺ)! Provide us with some milk.\" Allah's Apostle said, \"I recommend that you should join the herd of camels.\" So they went and drank the urine and the milk of the camels (as a medicine) till they became healthy and fat. Then they killed the shepherd and drove away the camels, and they became unbelievers after whey were Muslims. When the Prophet (ﷺ) was informed by a shouter for help, he sent some men in their pursuit, and before the sun rose high, they were brought, and he had their hands and feet cut off. Then he ordered for nails which were heated and passed over their eyes, and whey were left in the Harra (i.e. rocky land in Medina). They asked for water, and nobody provided them with water till they died (Abu Qilaba, a sub-narrator said, \"They committed murder and theft and fought against Allah and His Apostle, and spread evil in the land.\")",
                "hadithUrdu": "قبیلہ عکل کے آٹھ آدمیوں کی جماعت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ( اسلام قبول کرنے کو ) حاضر ہوئی لیکن مدینہ کی آب و ہوا انہیں موافق نہیں آئی ‘ انہوں نے عرض کیا کہ یا رسول اللہ ! ہمارے لئے ( اونٹ کے ) دودھ کا انتظام کر دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہارے لئے دودھ نہیں دے سکتا ‘ تم ( صدقہ کے ) اونٹوں میں چلے جاؤ ۔ ان کا دودھ اور پیشاب پیو ‘ تاکہ تمہاری صحت ٹھیک ہو جائے ۔ وہ لوگ وہاں سے چلے گئے اور ان کا دودھ اور پیشاب پی کر تندرست ہو گئے تو چرواہے کو قتل کر دیا ‘ اور اونٹوں کو اپنے ساتھ لے کر بھاگ نکلے اور اسلام لانے کے بعد کفر کیا ‘ ایک شخص نے اس کی خبر آنحضرت صلی اللہ علیہ وسلم کو دی ‘ تو آپ صلی اللہ علیہ وسلم نے ان کی تلاش کے لئے سوار دوڑائے ‘ دوپہر سے پہلے ہی وہ پکڑ کر لائے گئے ۔ ان کے ہاتھ پاؤں کاٹ دیئے گئے ۔ پھر آپ کے حکم سے ان کی آنکھوں میں سلائی گرم کر کے پھیر دی گئی اور انہیں حرہ ( مدینہ کی پتھریلی زمین ) میں ڈال دیا گیا ۔ وہ پانی مانگتے تھے لیکن انہیں نہیں دیا گیا ۔ یہاں تک کہ وہ سب مر گئے ۔ ( ایسا ہی انہوں نے اونٹوں کے چرانے والوں کے ساتھ کیا تھا ‘ جس کا بدلہ انہیں دیا گیا ) ابوقلابہ نے کہا کہ انہوں نے قتل کیا تھا ‘ چوری کی تھی ‘ اللہ اور اس کے رسول صلی اللہ علیہ وسلم کے ساتھ جنگ کی تھی اور زمین میں فساد برپا کرنے کی کوشش کی تھی ۔",
                "urduNarrator": "ہم سے معلی بن اسد نے بیان کیا ‘ کہا ہم سے وہیب بن خالد نے بیان کیا ‘ ان سے ایوب سختیانی نے ‘ ان سے ابوقلابہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّ رَهْطًا، مِنْ عُكْلٍ ثَمَانِيَةً قَدِمُوا عَلَى النَّبِيِّ صلى الله عليه وسلم فَاجْتَوَوُا الْمَدِينَةَ فَقَالُوا يَا رَسُولَ اللَّهِ، ابْغِنَا رِسْلاً‏.‏ قَالَ ‏ \"‏ مَا أَجِدُ لَكُمْ إِلاَّ أَنْ تَلْحَقُوا بِالذَّوْدِ ‏\"‏‏.‏ فَانْطَلَقُوا فَشَرِبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا حَتَّى صَحُّوا وَسَمِنُوا، وَقَتَلُوا الرَّاعِيَ، وَاسْتَاقُوا الذَّوْدَ، وَكَفَرُوا بَعْدَ إِسْلاَمِهِمْ، فَأَتَى الصَّرِيخُ النَّبِيَّ صلى الله عليه وسلم، فَبَعَثَ الطَّلَبَ، فَمَا تَرَجَّلَ النَّهَارُ حَتَّى أُتِيَ بِهِمْ، فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ، ثُمَّ أَمَرَ بِمَسَامِيرَ فَأُحْمِيَتْ فَكَحَلَهُمْ بِهَا، وَطَرَحَهُمْ بِالْحَرَّةِ، يَسْتَسْقُونَ فَمَا يُسْقَوْنَ حَتَّى مَاتُوا‏.‏ قَالَ أَبُو قِلاَبَةَ قَتَلُوا وَسَرَقُوا وَحَارَبُوا اللَّهَ وَرَسُولَهُ صلى الله عليه وسلم وَسَعَوْا فِي الأَرْضِ فَسَادًا‏.‏",
                "headingArabic": "إِذَا حَرَّقَ الْمُشْرِكُ الْمُسْلِمَ هَلْ يُحَرَّقُ",
                "headingUrdu": "اگر کوئی مشرک کسی مسلمان کو جلا دے تو کیا اسے (جوابی طور پر) جلا دیا جائے؟",
                "headingEnglish": "If a Mushrik burns a Muslim, should he be burnt (in retaliation)?",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2886,
                "hadithNumber": "3019",
                "englishNarrator": "Narrated Abu Hurairah (رضی اللہ عنہ):",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"An ant bit a Prophet amongst the Prophets, and he ordered that the place of the ants be burnt. So, Allah inspired to him, 'It is because one ant bit you that you burnt a nation amongst the nations that glorify Allah?\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ‘ آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ ایک چیونٹی نے ایک نبی ( عزیر یا موسیٰ علیہ السلام ) کو کاٹ لیا تھا ۔ تو ان کے حکم سے چیونٹیوں سے سارے گھر جلا دئیے گئے ۔ اس پر اللہ تعالیٰ نے ان کے پاس وحی بھیجی کہ اگر تمہیں ایک چیونٹی نے کاٹ لیا تھا تو تم نے ایک ایسی خلقت کو جلا کر خاک کر دیا جو اللہ کی تسبیح بیان کرتی تھی ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث نے بیان کیا ‘ ان سے یونس نے ‘ ان سے ابن شہاب نے ‘ان سے سعید بن مسیب اور ابوسلمہ نے کہ ابوہریرہ رضی اللہ عنہ نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ قَرَصَتْ نَمْلَةٌ نَبِيًّا مِنَ الأَنْبِيَاءِ، فَأَمَرَ بِقَرْيَةِ النَّمْلِ فَأُحْرِقَتْ، فَأَوْحَى اللَّهُ إِلَيْهِ أَنْ قَرَصَتْكَ نَمْلَةٌ أَحْرَقْتَ أُمَّةً مِنَ الأُمَمِ تُسَبِّحُ اللَّهِ.‏\"‏‏‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2887,
                "hadithNumber": "3020",
                "englishNarrator": "Narrated Jarir رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ)s said to me, \"Will you relieve me from Dhul-Khalasa? Dhul-Khalasa was a house (of an idol) belonging to the tribe of Khath'am called Al-Ka`ba Al-Yama-niya. So, I proceeded with one hundred and fifty cavalry men from the tribe of Ahmas, who were excellent knights. It happened that I could not sit firm on horses, so the Prophet (ﷺ) , stroke me over my chest till I saw his finger-marks over my chest, he said, 'O Allah! Make him firm and make him a guiding and rightly guided man.' \" Jarir رضی اللہ عنہ proceeded towards that house, and dismantled and burnt it. Then he sent a messenger to Allah's Apostle informing him of that. Jarir's messenger said, \"By Him Who has sent you with the Truth, I did not come to you till I had left it like an emancipated or gabby camel (i.e. completely marred and spoilt).\" Jarir رضی اللہ عنہ added, \"The Prophet (ﷺ) asked for Allah's Blessings for the horses and the men of Ahmas five times.\"",
                "hadithUrdu": "مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ ذوالخلصہ کو ( برباد کر کے ) مجھے راحت کیوں نہیں دے دیتے ۔ یہ ذوالخلصہ قبیلہ خثعم کا ایک بت خانہ تھا اور اسے کعبۃ الیمانیہ کہتے تھے ۔ انہوں نے بیان کیا کہ پھر میں قبیلہ احمس کے ایک سو پچاس سواروں کو لے کر چلا ۔ یہ سب حضرات بڑے اچھے گھوڑ سوار تھے ۔ لیکن میں گھوڑے کی سواری اچھی طرح نہیں کر پاتا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے میرے سینے پر ( اپنے ہاتھ سے ) مارا ‘ میں نے انگشت ہائے مبارک کا نشان اپنے سینے پر دیکھا ۔ فرمایا اے اللہ ! گھوڑے کی پشت پر اسے ثبات عطا فرما ‘ اور اسے دوسروں کو ہدایت کی راہ دکھانے والا اور خود ہدایت یافتہ بنا ‘ اس کے بعد جریر رضی اللہ عنہ روانہ ہوئے ‘ اور ذوالخلصہ کی عمارت کو گرا کر اس میں آگ لگا دی ۔ پھر رسول اللہ صلی اللہ علیہ وسلم کو اس کی خبر بھجوائی ۔ جریر رضی اللہ عنہ کے قاصد ( ابو ارطاۃ حصین بن ربیعہ ) نے خدمت نبوی میں حاضر ہو کر عرض کیا اس ذات کی قسم ! جس نے آپ صلی اللہ علیہ وسلم کو حق کے ساتھ مبعوث کیا ہے ۔ میں اس وقت تک آپ کی خدمت میں حاضر نہیں ہوا ‘ جب تک ہم نے ذوالخلصہ کو ایک خالی پیٹ والے اونٹ کی طرح نہیں بنا دیا ‘ یا ( انہوں نے کہا ) خارش والے اونٹ کی طرح ( مراد ویرانی سے ہے ) جریر رضی اللہ عنہ نے بیان کیا کہ یہ سن کر آپ صلی اللہ علیہ وسلم نے قبیلہ احمس کے سواروں اور قبیلوں کے تمام لوگوں کے لئے پانچ مرتبہ برکتوں کی دعا فرمائی ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘کہا ہم سے یحییٰ قطان نے بیان کیا ‘ ان سے اسماعیل نے بیان کیا ‘ کہا مجھ سے قیس بن ابی حازم نے بیان کیا ‘ کہا کہ مجھ سے جریر بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي قَيْسُ بْنُ أَبِي حَازِمٍ، قَالَ قَالَ لِي جَرِيرٌ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلاَ تُرِيحُنِي مِنْ ذِي الْخَلَصَةِ ‏\"‏‏.‏ وَكَانَ بَيْتًا فِي خَثْعَمَ يُسَمَّى كَعْبَةَ الْيَمَانِيَةَ قَالَ فَانْطَلَقْتُ فِي خَمْسِينَ وَمِائَةِ فَارِسٍ مِنْ أَحْمَسَ، وَكَانُوا أَصْحَابَ خَيْلٍ ـ قَالَ ـ وَكُنْتُ لاَ أَثْبُتُ عَلَى الْخَيْلِ، فَضَرَبَ فِي صَدْرِي حَتَّى رَأَيْتُ أَثَرَ أَصَابِعِهِ فِي صَدْرِي وَقَالَ ‏\"‏ اللَّهُمَّ ثَبِّتْهُ وَاجْعَلْهُ هَادِيًا مَهْدِيًّا ‏\"‏‏.‏ فَانْطَلَقَ إِلَيْهَا فَكَسَرَهَا وَحَرَّقَهَا، ثُمَّ بَعَثَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يُخْبِرُهُ فَقَالَ رَسُولُ جَرِيرٍ وَالَّذِي بَعَثَكَ بِالْحَقِّ، مَا جِئْتُكَ حَتَّى تَرَكْتُهَا كَأَنَّهَا جَمَلٌ أَجْوَفُ أَوْ أَجْرَبُ‏.‏ قَالَ فَبَارَكَ فِي خَيْلِ أَحْمَسَ وَرِجَالِهَا خَمْسَ مَرَّاتٍ‏.‏",
                "headingArabic": "حَرْقِ الدُّورِ وَالنَّخِيلِ",
                "headingUrdu": "گھروں اور کھجوروں کو جلانا",
                "headingEnglish": "The burning of houses and date-palms",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2888,
                "hadithNumber": "3021",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) burnt the date-palms of Bani An-Nadir.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ( یہود ) بنو نضیر کے کھجور کے باغات جلوا دیئے تھے ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ‘ کہا ہم کو سفیان بن عیینہ نے خبر دی ‘ انہیں موسیٰ بن عقبہ نے ‘انہیں نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ حَرَّقَ النَّبِيُّ صلى الله عليه وسلم نَخْلَ بَنِي النَّضِيرِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2889,
                "hadithNumber": "3022",
                "englishNarrator": "Narrated Al-Bara bin Azib رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent a group of Ansari men to kill Abu-Rafi`. One of them set out and entered their (i.e. the enemies) fort. That man said, \"I hid myself in a stable for their animals. They closed the fort gate. Later they lost a donkey of theirs, so they went out in its search. I, too, went out along with them, pretending to look for it. They found the donkey and entered their fort. And I, too, entered along with them. They closed the gate of the fort at night, and kept its keys in a small window where I could see them. When those people slept, I took the keys and opened the gate of the fort and came upon Abu Rafi` and said, 'O Abu Rafi`. When he replied me, I proceeded towards the voice and hit him. He shouted and I came out to come back, pretending to be a helper. I said, 'O Abu Rafi`, changing the tone of my voice. He asked me, 'What do you want; woe to your mother?' I asked him, 'What has happened to you?' He said, 'I don't know who came to me and hit me.' Then I drove my sword into his belly and pushed it forcibly till it touched the bone. Then I came out, filled with puzzlement and went towards a ladder of theirs in order to get down but I fell down and sprained my foot. I came to my companions and said, 'I will not leave till I hear the wailing of the women.' So, I did not leave till I heard the women bewailing Abu Rafi`, the merchant pf Hijaz. Then I got up, feeling no ailment, (and we proceeded) till we came upon the Prophet (ﷺ) and informed him.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے انصار کے چند آدمیوں کو ابورافع ( یہودی ) کو قتل کرنے کے لئے بھیجا ‘ ان میں سے ایک صاحب ( عبداللہ بن عتیک رضی اللہ عنہ ) آگے چل کر اس قلعہ کے اندر داخل ہو گئے ۔ انہوں نے بیان کیا کہ اندر جانے کے بعد میں اس مکان میں گھس گیا ‘ جہاں ان کے جانور بندھا کرتے تھے ۔ بیان کیا کہ انہوں نے قلعہ کا دروازہ بند کر لیا ‘ لیکن اتفاق کہ ان کا ایک گدھا ان کے مویشیوں میں سے گم تھا ۔ اس لئے اسے تلاش کرنے کے لئے باہر نکلے ۔ ( اس خیال سے کہ کہیں پکڑا نہ جاؤں ) نکلنے والوں کے ساتھ میں بھی باہر آ گیا ‘ تاکہ ان پر یہ ظاہر کر دوں کہ میں بھی تلاش کرنے والوں میں سے ہوں ‘ آخر گدھا انہیں مل گیا ‘ اور وہ پھر اندر آ گئے ۔ میں بھی ان کے ساتھ اندر آ گیا اور انہوں نے قلعہ کا دروازہ بند کر لیا ‘ رات کا وقت تھا ‘ کنجیوں کا گچھا انہوں نے ایک ایسے طاق میں رکھا ‘ جسے میں نے دیکھ لیا تھا ۔ جب وہ سب سو گئے تو میں نے چابیوں کا گچھا اٹھایا اور دروازہ کھول کر ابورافع کے پاس پہنچا ۔ میں نے اسے آواز دی ‘ ابورافع ! اس نے جواب دیا اور میں فوراً اس کی آواز کی طرف بڑھا اور اس پر وار کر بیٹھا ۔ وہ چیخنے لگا تو میں باہر چلا آیا ۔ اس کے پاس سے واپس آ کر میں پھر اس کے کمرہ میں داخل ہوا ‘ گویا میں اس کی مدد کو پہنچا تھا ۔ میں نے پھر آواز دی ابورافع ! اس مرتبہ میں نے اپنی آواز بدل لی تھی ، اس نے کہا کہ کیا کر رہا ہے ، تیری ماں برباد ہو ۔ میں نے پوچھا ، کیا بات پیش آئی ؟ وہ کہنے لگا ‘ نہ معلوم کون شخص میرے کمرے میں آ گیا ‘ اور مجھ پر حملہ کر بیٹھا ہے ‘ انہوں نے کہا کہ اب کی بار میں نے اپنی تلوار اس کے پیٹ پر رکھ کر اتنی زور سے دبائی کہ اس کی ہڈیوں میں اتر گئی ‘ جب میں اس کے کمرہ سے نکلا تو بہت دہشت میں تھا ۔ پھر قلعہ کی ایک سیڑھی پر میں آیا تاکہ اس سے نیچے اتر جاؤں مگر میں اس پر سے گر گیا ‘ اور میرے پاؤں میں موچ آ گئی ‘ پھر جب میں اپنے ساتھیوں کے پاس آیا تو میں نے ان سے کہا کہ میں تو اس وقت تک یہاں سے نہیں جاؤں گا جب تک اس کی موت کا اعلان خود نہ سن لوں ۔ چنانچہ میں وہیں ٹھہر گیا ۔ اور میں نے رونے والی عورتوں سے ابورافع حجاز کے سوداگر کی موت کا اعلان بلند آواز سے سنا ۔ انہوں نے کہا کہ پھر میں وہاں سے اٹھا ‘ اور مجھے اس وقت کچھ بھی درد معلوم نہیں ہوا ‘ پھر ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ۔ اور آپ صلی اللہ علیہ وسلم کو اس کی بشارت دی ۔",
                "urduNarrator": "ہم سے علی بن مسلم نے بیان کیا ‘ کہا ہم سے یحییٰ بن زکریابن ابی زائدہ نے بیان کیا ‘ کہا مجھ سے میرے والد نے بیان کیا ‘ ان سے ابواسحاق نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ مُسْلِمٍ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ، قَالَ حَدَّثَنِي أَبِي، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ـ رضى الله عنهما ـ قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَهْطًا مِنَ الأَنْصَارِ إِلَى أَبِي رَافِعٍ لِيَقْتُلُوهُ، فَانْطَلَقَ رَجُلٌ مِنْهُمْ فَدَخَلَ حِصْنَهُمْ قَالَ فَدَخَلْتُ فِي مَرْبِطِ دَوَابَّ لَهُمْ، قَالَ وَأَغْلَقُوا باب الْحِصْنِ، ثُمَّ إِنَّهُمْ فَقَدُوا حِمَارًا لَهُمْ، فَخَرَجُوا يَطْلُبُونَهُ، فَخَرَجْتُ فِيمَنْ خَرَجَ أُرِيهِمْ أَنَّنِي أَطْلُبُهُ مَعَهُمْ، فَوَجَدُوا الْحِمَارَ، فَدَخَلُوا وَدَخَلْتُ، وَأَغْلَقُوا باب الْحِصْنِ لَيْلاً، فَوَضَعُوا الْمَفَاتِيحَ فِي كَوَّةٍ حَيْثُ أَرَاهَا، فَلَمَّا نَامُوا أَخَذْتُ الْمَفَاتِيحَ، فَفَتَحْتُ باب الْحِصْنِ ثُمَّ دَخَلْتُ عَلَيْهِ فَقُلْتُ يَا أَبَا رَافِعٍ‏.‏ فَأَجَابَنِي، فَتَعَمَّدْتُ الصَّوْتَ، فَضَرَبْتُهُ فَصَاحَ، فَخَرَجْتُ ثُمَّ جِئْتُ، ثُمَّ رَجَعْتُ كَأَنِّي مُغِيثٌ فَقُلْتُ يَا أَبَا رَافِعٍ، وَغَيَّرْتُ صَوْتِي، فَقَالَ مَا لَكَ لأُمِّكَ الْوَيْلُ قُلْتُ مَا شَأْنُكَ قَالَ لاَ أَدْرِي مَنْ دَخَلَ عَلَىَّ فَضَرَبَنِي‏.‏ قَالَ فَوَضَعْتُ سَيْفِي فِي بَطْنِهِ، ثُمَّ تَحَامَلْتُ عَلَيْهِ حَتَّى قَرَعَ الْعَظْمَ، ثُمَّ خَرَجْتُ وَأَنَا دَهِشٌ، فَأَتَيْتُ سُلَّمًا لَهُمْ لأَنْزِلَ مِنْهُ فَوَقَعْتُ فَوُثِئَتْ رِجْلِي، فَخَرَجْتُ إِلَى أَصْحَابِي فَقُلْتُ مَا أَنَا بِبَارِحٍ حَتَّى أَسْمَعَ النَّاعِيَةَ، فَمَا بَرِحْتُ حَتَّى سَمِعْتُ نَعَايَا أَبِي رَافِعٍ تَاجِرِ أَهْلِ الْحِجَازِ‏.‏ قَالَ فَقُمْتُ وَمَا بِي قَلَبَةٌ حَتَّى أَتَيْنَا النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرْنَاهُ‏.‏",
                "headingArabic": "قَتْلِ النَّائِمِ الْمُشْرِكِ",
                "headingUrdu": "سوئے ہوئے مشرک کو قتل کرنا",
                "headingEnglish": "Killing a sleeping Mushrik",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2890,
                "hadithNumber": "3023",
                "englishNarrator": "Narrated Al-Bara bin Azib رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) sent a group of the Ansar to Abu Rafi`. `Abdullah bin Atik رضی اللہ عنہ entered his house at night and killed him while he was sleeping.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے انصار کے چند آدمیوں کو ابورافع کے پاس ( اسے قتل کرنے کے لئے ) بھیجا تھا ۔ چنانچہ رات میں عبداللہ بن عتیک رضی اللہ عنہ اس کے قلعہ میں داخل ہوئے اور اسے سوتے ہوئے قتل کیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ‘ کہا ہم سے یحییٰ بن آدم نے بیان کیا ‘ کہا ہم سے یحییٰ بن ابی زائدہ نے بیان کیا ‘ ان سے اس کے والد نے ‘ ان سے ابواسحاق نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ـ رضى الله عنهما ـ قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَهْطًا مِنَ الأَنْصَارِ إِلَى أَبِي رَافِعٍ فَدَخَلَ عَلَيْهِ عَبْدُ اللَّهِ بْنُ عَتِيكٍ بَيْتَهُ لَيْلاً، فَقَتَلَهُ وَهْوَ نَائِمٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2891,
                "hadithNumber": "3024, 3025",
                "englishNarrator": "Narrated Salim Abu An-Nadr (the freed slave of 'Umar bin 'Ubaidullah) reports that he was his (Umer's: Irfan) scribe:",
                "hadithEnglish": "Once Abdullah bin Abi Aufa رضی اللہ عنہما wrote a letter to 'Umar when he proceeded to Al-Haruriya. I read in it that Allah's Messenger (ﷺ) in one of his military expeditions against the enemy, waited till the sun declined. and then he got up amongst the people saying, \"O people! Do not wish to meet the enemy, and ask Allah for safety, but when you face the enemy, be patient, and remember that Paradise is under the shades of swords.\" Then he said, \"O Allah, the Revealer of the Holy Book, and the Mover of the clouds and the Defeater of the clans, defeat them, and grant us victory over them.\" Saalim bin Abu Nadr was the scribe of Umer bin Obaidullah. He received the letter of Hadrat Abdullah binAbi Aufa رضی اللہ عنہما which read that the prophet (ﷺ)has said Do not aspireto confront the enemy.",
                "hadithUrdu": "جب وہ خوارج سے لڑنے کے لئے روانہ ہوئے تو انہیں عبداللہ بن ابی اوفی رضی اللہ عنہما کا خط ملا ۔ میں نے اسے پڑھا تو اس میں انہوں نے لکھا تھا کہ رسول کریم صلی اللہ علیہ وسلم نے ایک لڑائی کے موقع پر انتظار کیا ‘ پھر جب سورج ڈھل گیا ۔ تو آپ صلی اللہ علیہ وسلم نے لوگوں کو خطاب کرتے ہوئے فرمایا اے لوگو ! دشمن سے لڑائی بھڑائی کی تمنا نہ کرو ‘ بلکہ اللہ سے سلامتی مانگو ۔ ہاں ! جب جنگ چھڑ جائے تو پھر صبر کئے رہو اور ڈٹ کر مقابلہ کرو اور جان لو کہ جنت تلواروں کے سائے میں ہے ۔ پھر آپ نے یوں دعا کی ‘ اے اللہ ! کتاب ( قرآن ) کے نازل فرمانے والے ‘ اے بادلوں کے چلانے والے ! اے احزاب ( یعنی کافروں کی جماعتوں کو غزوہ خندق کے موقع پر ) شکست دینے والے ! ہمارے دشمن کو شکست دے اور ان کے مقابلے میں ہماری مدد کر ۔ اور موسیٰ بن عقبہ نے کہا کہ مجھ سے سالم ابو النضر نے بیان کیا کہ میں عمر بن عبیداللہ کا منشی تھا ۔ ان کے پاس حضرت عبداللہ بن ابی اوفی رضی اللہ عنہما کا خط آیا کہ رسول کریم صلی اللہ علیہ وسلم نے فرمایا تھا دشمن سے لڑائی لڑنے کی تمنا نہ کرو ۔",
                "urduNarrator": "ہم سے یوسف بن موسیٰ نے بیان کیا ‘ انہوں نے کہا ہم سے عاصم بن یوسف یربوعی نے بیان کیا ‘ انہوں نے کہا کہ ہم سے ابواسحاق فزاری نے بیان کیا ‘ ان سے موسیٰ بن عقبہ نے بیان کیا ‘ کہ مجھ سے عمر بن عبیداللہ کے غلام سالم ابوالنضر نے بیان کیا کہ میں عمر بن عبیداللہ کا منشی تھا ۔ سالم نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا عَاصِمُ بْنُ يُوسُفَ الْيَرْبُوعِيُّ، حَدَّثَنَا أَبُو إِسْحَاقَ الْفَزَارِيُّ، عَنْ مُوسَى بْنِ عُقْبَةَ، قَالَ حَدَّثَنِي سَالِمٌ أَبُو النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ كُنْتُ كَاتِبًا لَهُ قَالَ كَتَبَ إِلَيْهِ عَبْدُ اللَّهِ بْنُ أَبِي أَوْفَى حِينَ خَرَجَ إِلَى الْحَرُورِيَّةِ فَقَرَأْتُهُ فَإِذَا فِيهِ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَيَّامِهِ الَّتِي لَقِيَ فِيهَا الْعَدُوَّ انْتَظَرَ حَتَّى مَالَتِ الشَّمْسُ‏.‏ ثُمَّ قَامَ فِي النَّاسِ فَقَالَ ‏\"‏ أَيُّهَا النَّاسُ لاَ تَمَنَّوْا لِقَاءَ الْعَدُوِّ وَسَلُوا اللَّهَ الْعَافِيَةَ، فَإِذَا لَقِيتُمُوهُمْ فَاصْبِرُوا وَاعْلَمُوا أَنَّ الْجَنَّةَ تَحْتَ ظِلاَلِ السُّيُوفِ ـ ثُمَّ قَالَ ـ اللَّهُمَّ مُنْزِلَ الْكِتَابِ وَمُجْرِيَ السَّحَابِ وَهَازِمَ الأَحْزَابِ اهْزِمْهُمْ وَانْصُرْنَا عَلَيْهِمْ ‏\"‏‏.‏ وَقَالَ مُوسَى بْنُ عُقْبَةَ حَدَّثَنِي سَالِم أَبُو النَّضْرِ كُنْتُ كَاتِبًا لِعُمَرَ بْنِ عُبَيْدِ اللَّهِ فَأَتَاهُ كِتَابُ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى ـ رضى الله عنهما أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَمَنَّوْا لِقَاءَ الْعَدُو ‏\"‏‏.‏",
                "headingArabic": "لاَ تَمَنَّوْا لِقَاءَ الْعَدُوِّ",
                "headingUrdu": "دشمن سے ملنے کی تمنا نہ کرو",
                "headingEnglish": "Do not wish to meet the enemy",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2892,
                "hadithNumber": "3026",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said: \"Do not wish to meet the enemy, but when you meet face) the enemy, be patient.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا دشمن سے لڑنے بھڑنے کی تمنا نہ کرو ‘ ہاں ! اگر جنگ شروع ہو جائے تو پھر صبر سے کام لو ۔",
                "urduNarrator": "ابوعامر نے کہا ‘ ہم سے مغیرہ بن عبدالرحمٰن نے بیان کیا ‘ ان سے ابوالزناد نے ‘ ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "وَقَالَ أَبُو عَامِرٍ حَدَّثَنَا مُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَمَنَّوْا لِقَاءَ الْعَدُوِّ، فَإِذَا لَقِيتُمُوهُمْ فَاصْبِرُوا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2893,
                "hadithNumber": "3027, 3028",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Khosrau will be ruined, and there will be no Khosrau after him, and Caesar will surely be ruined and there will be no Caesar after him, and you will spend their treasures in Allah's Cause.\" He called, \"War is deceit'.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ کسریٰ ( ایران کا بادشاہ ) برباد و ہلاک ہو گیا ‘ اب اس کے بعد کوئی کسریٰ نہیں آئے گا ۔ اور قیصر ( روم کا بادشاہ ) بھی ہلاک و برباد ہو گیا ‘ اور اس کے بعد ( شام میں ) کوئی قیصر باقی نہیں رہ جائے گا ۔ اور ان کے خزانے اللہ کے راستے میں تقسیم ہوں گے.اور آپ صلی اللہ علیہ وسلم نے لڑائی کو مکر اور فریب فرمایا ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں ہمام نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ هَلَكَ كِسْرَى ثُمَّ لاَ يَكُونُ كِسْرَى بَعْدَهُ، وَقَيْصَرٌ لَيَهْلِكَنَّ ثُمَّ لاَ يَكُونُ قَيْصَرٌ بَعْدَهُ، وَلَتُقْسَمَنَّ كُنُوزُهَا فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏وَسَمَّى الْحَرْبَ خَدْعَةً",
                "headingArabic": "الْحَرْبُ خَدْعَةٌ",
                "headingUrdu": "جنگ فریب ہے۔",
                "headingEnglish": "War is deceit",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2894,
                "hadithNumber": "3029",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) called,: \"War is deceit\".",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا لڑائی کیا ہے ؟ ایک چال ہے ۔",
                "urduNarrator": "ہم سے ابوبکر بن اصرم نے بیان کیا ‘ انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی ‘ انہوں نے کہا ہم کو معمر نے خبر دی ‘ انہیں ہمام بن منبہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَصْرَمَ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمَّى النَّبِيُّ صلى الله عليه وسلم الْحَرْبَ خُدْعَةً‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2895,
                "hadithNumber": "3030",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"War is deceit.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا ‘ جنگ تو ایک چالبازی کا نام ہے ۔",
                "urduNarrator": "ہم سے صدقہ بن فضل نے بیان کیا ‘ کہا ہم کو ابن عیینہ نے خبر دی ‘ انہیں عمرو نے ‘ انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا ‘ آپ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ الْحَرْبُ خُدْعَةٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2896,
                "hadithNumber": "3031",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Who is ready to kill Ka`b bin Al-Ashraf who has really hurt Allah and His Apostle?\" Muhammad bin Maslama رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! Do you like me to kill him?\" He replied in the affirmative. So, Muhammad bin Maslama رضی اللہ عنہ went to him (i.e. Ka`b) and said, \"This person (i.e. the Prophet) has put us to task and asked us for charity.\" Ka`b replied, \"By Allah, you will get tired of him.\" Muhammad said to him, \"We have followed him, so we dislike to leave him till we see the end of his affair.\" Muhammad bin Maslama رضی اللہ عنہ went on talking to him in this way till he got the chance to kill him.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ کعب بن اشرف کا کام کون تمام کرے گا ؟ وہ اللہ اور اس کے رسول کو بہت اذیتیں پہنچا چکا ہے ۔ محمد بن مسلمہ رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! کیا آپ مجھے اجازت بخش دیں گے کہ میں اسے قتل کر آؤں ؟ آنحضور صلی اللہ علیہ وسلم نے فرمایا ہاں ۔ راوی نے بیان کیا کہ پھر محمد بن مسلمہ کعب یہودی کے پاس آئے اور اس سے کہنے لگے کہ نبی کریم صلی اللہ علیہ وسلم نے تو ہمیں تھکا دیا ‘ اور ہم سے آپ صلی اللہ علیہ وسلم زکوٰۃ مانگتے ہیں ۔ کعب نے کہا کہ قسم اللہ کی ! ابھی کیا ہے ابھی اور مصیبت میں پڑو گے ۔ محمد بن مسلمہ رضی اللہ عنہ اس پر کہنے لگے کہ بات یہ ہے کہ ہم نے ان کی پیروی کر لی ہے ۔ اس لئے اس وقت تک اس کا ساتھ چھوڑنا ہم مناسب بھی نہیں سمجھتے جب تک ان کی دعوت کا کوئی انجام ہمارے سامنے نہ آ جائے ۔ غرض محمد بن مسلمہ رضی اللہ عنہ اس سے اسی طرح باتیں کرتے رہے ۔ آخر موقع پا کر اسے قتل کر دیا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے ‘ ان سے عمرو بن دینار نے اور ان سے جابر بن عبداللہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ لِكَعْبِ بْنِ الأَشْرَفِ، فَإِنَّهُ قَدْ آذَى اللَّهَ وَرَسُولَهُ ‏\"‏‏.‏ قَالَ مُحَمَّدُ بْنُ مَسْلَمَةَ أَتُحِبُّ أَنْ أَقْتُلَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَأَتَاهُ فَقَالَ إِنَّ هَذَا ـ يَعْنِي النَّبِيَّ صلى الله عليه وسلم ـ قَدْ عَنَّانَا وَسَأَلَنَا الصَّدَقَةَ، قَالَ وَأَيْضًا وَاللَّهِ قَالَ فَإِنَّا قَدِ اتَّبَعْنَاهُ فَنَكْرَهُ أَنْ نَدَعَهُ حَتَّى نَنْظُرَ إِلَى مَا يَصِيرُ أَمْرُهُ قَالَ فَلَمْ يَزَلْ يُكَلِّمُهُ حَتَّى اسْتَمْكَنَ مِنْهُ فَقَتَلَهُ‏.‏",
                "headingArabic": "الْكَذِبِ فِي الْحَرْبِ",
                "headingUrdu": "جنگ میں جھوٹ بولنا",
                "headingEnglish": "Telling lies in war",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2897,
                "hadithNumber": "3032",
                "englishNarrator": "Narrated Jabir رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Who is ready to kill Ka`b bin Ashraf (i.e. a Jew).\" Muhammad bin Maslama  رضی اللہ عنہ replied, \"Do you like me to kill him?\" The Prophet (ﷺ) replied in the affirmative. Muhammad bin Maslama رضی اللہ عنہ said, \"Then allow me to say what I like.\" The Prophet (ﷺ) replied, \"I do (i.e. allow you).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ کعب بن اشرف کے لئے کون ہمت کرتا ہے ؟ محمد بن مسلمہ رضی اللہ عنہ نے کہا کیا میں اسے قتل کر دوں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ! انہوں نے عرض کیا کہ پھر آپ مجھے اجازت دیں ( کہ میں جو چاہوں جھوٹ سچ کہوں ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ میری طرف سے اس کی اجازت ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے عمرو بن دینار نے اور ان سے جابر بن عبداللہ انصاری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ لِكَعْبِ بْنِ الأَشْرَفِ ‏\"‏‏.‏ فَقَالَ مُحَمَّدُ بْنُ مَسْلَمَةَ أَتُحِبُّ أَنْ أَقْتُلَهُ قَالَ ‏\"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَأْذَنْ لِي فَأَقُولَ‏.‏ قَالَ ‏\"‏ قَدْ فَعَلْتُ ‏\"‏‏.‏",
                "headingArabic": "الْفَتْكِ بِأَهْلِ الْحَرْبِ",
                "headingUrdu": "غیر مسلم جنگجوؤں کو چھپ کر قتل کرنا",
                "headingEnglish": "Killing non-Muslim warriors secretly",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2898,
                "hadithNumber": "3033",
                "englishNarrator": "Narrated 'Abdullah bin Umar رضی اللہ عنہما :",
                "hadithEnglish": "Once, Allah's Messenger (ﷺ) accompanied by Ubai bin Ka'b رضی اللہ عنہ set out to Ibn Saiyyad. He was informed that Ibn Saiyyad was in a garden of date palms. When Allah's Messenger (ﷺ) entered the garden of date-palms, he started hiding himself behind the trunks of the palms while Ibn Saiyyad was covered with a velvet sheet with murmurs emanating from under it. Ibn Saiyyah's mother saw Allah's Messenger (ﷺ) and said, \"O Saf! This is Muhammad.\" So Ibn Saiyyad got up. Allah's Messenger (ﷺ) said, \"If she had left him (in his state), the truth would have been clear.\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم ابن صیاد ( یہودی بچے ) کی طرف جا رہے تھے ۔ آپ صلی اللہ علیہ وسلم کے ساتھ ابی بن کعب رضی اللہ عنہ بھی تھے ( ابن صیاد کے عجیب و غریب احوال کے متعلق آپ صلی اللہ علیہ وسلم خود تحقیق کرنا چاہتے تھے ) آپ صلی اللہ علیہ وسلم کو اطلاع دی گئی تھی کہ ابن صیاد اس وقت کھجوروں کی آڑ میں موجود ہے ۔ جب آپ صلی اللہ علیہ وسلم وہاں پہنچے تو شاخوں کی آڑ میں چلنے لگے ۔ ( تاکہ وہ آپ کو دیکھ نہ سکے ) ابن صیاد اس وقت ایک چادر اوڑھے ہوئے چپکے چپکے کچھ گنگنا رہا تھا ‘ اس کی ماں نے آنحضرت صلی اللہ علیہ وسلم کو دیکھ لیا اور پکار اٹھی کہ اے ابن صیاد ! یہ محمد صلی اللہ علیہ وسلم آ پہنچے ‘ وہ چونک اٹھا ‘ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر یہ اس کی خبر نہ کرتی تو وہ کھولتا ۔ ( یعنی اس کی باتوں سے اس کا حال کھل جاتا ) ۔",
                "urduNarrator": "لیث بن سعد نے بیان کیا ‘ ان سے عقیل نے بیان کیا ‘ ان سے ابن شہاب نے ‘ ان سے سالم بن عبداللہ اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "قَالَ اللَّيْثُ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّهُ قَالَ انْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَمَعَهُ أُبَىُّ بْنُ كَعْبٍ قِبَلَ ابْنِ صَيَّادٍ، فَحُدِّثَ بِهِ فِي نَخْلٍ، فَلَمَّا دَخَلَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّخْلَ، طَفِقَ يَتَّقِي بِجُذُوعِ النَّخْلِ، وَابْنُ صَيَّادٍ فِي قَطِيفَةٍ لَهُ فِيهَا رَمْرَمَةٌ، فَرَأَتْ أُمُّ ابْنِ صَيَّادٍ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا صَافِ، هَذَا مُحَمَّدٌ، فَوَثَبَ ابْنُ صَيَّادٍ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ تَرَكَتْهُ بَيَّنَ ‏\"‏‏.‏",
                "headingArabic": "مَا يَجُوزُ مِنَ الاِحْتِيَالِ وَالْحَذَرِ مَعَ مَنْ يَخْشَى مَعَرَّتَهُ",
                "headingUrdu": "حفاظت کے لیے کیا کیا حربے اور ذرائع اختیار کیے جا سکتے ہیں۔",
                "headingEnglish": "What tricks and means of security may be adopted",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2899,
                "hadithNumber": "3034",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "I saw Allah's Messenger (ﷺ) on the day (of the battle) of the Trench carrying earth till the hair of his chest were covered with dust and he was a hairy man. He was reciting the following verses of `Abdullah (bin Rawaha): \"O Allah, were it not for You, We would not have been guided, Nor would we have given in charity, nor prayed. So, bestow on us calmness, and when we meet the enemy. Then make our feet firm, for indeed, Yet if they want to put us in affliction, (i.e. want to fight against us) we would not (flee but withstand them).\" The Prophet (ﷺ) used to raise his voice while reciting these verses. (See Hadith No. 432, Vol. 5).",
                "hadithUrdu": "میں نے دیکھا کہ غزوہ احزاب میں ( خندق کھودتے ہوئے ) رسول اللہ صلی اللہ علیہ وسلم خود مٹی اٹھا رہے تھے ۔ یہاں تک کہ سینہ مبارک کے بال مٹی سے اٹ گئے تھے ۔ آپ صلی اللہ علیہ وسلم کے ( جسم مبارک پر ) بال بہت گھنے تھے ۔ اس وقت آپ صلی اللہ علیہ وسلم عبداللہ بن رواحہ رضی اللہ عنہ کا یہ شعر پڑھ رہے تھے ( ترجمہ ) ” اے اللہ ! اگر تیری ہدایت نہ ہوتی تو ہم کبھی سیدھا راستہ نہ پاتے ‘ نہ صدقہ کر سکتے اور نہ نماز پڑھتے ۔ اب تو یا اللہ ! ہمارے دلوں کو سکون اور اطمینان عطا فرما ‘ اور اگر ( دشمنوں سے مڈبھیڑ ہو جائے تو ہمیں ثابت قدم رکھ ‘ دشمنوں نے ہمارے اوپر زیادتی کی ہے ۔ جب بھی وہ ہم کو فتنہ فساد میں مبتلا کرنا چاہتے ہیں تو ہم انکار کرتے ہیں “ ۔ آپ یہ شعر بلند آواز سے پڑھ رہے تھے ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ‘ کہا ہم سے ابوالاحوص نے بیان کیا ‘ ان سے ابواسحاق نے اور ان سے براء بن عازب رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَوْمَ الْخَنْدَقِ وَهُوَ يَنْقُلُ التُّرَابَ حَتَّى وَارَى التُّرَابُ شَعَرَ صَدْرِهِ، وَكَانَ رَجُلاً كَثِيرَ الشَّعَرِ وَهْوَ يَرْتَجِزُ بِرَجَزِ عَبْدِ اللَّهِ اللَّهُمَّ لَوْلاَ أَنْتَ مَا اهْتَدَيْنَا وَلاَ تَصَدَّقْنَا وَلاَ صَلَّيْنَا فَأَنْزِلَنْ سَكِينَةً عَلَيْنَا وَثَبِّتِ الأَقْدَامَ إِنْ لاَقَيْنَا إِنَّ الأَعْدَاءَ قَدْ بَغَوْا عَلَيْنَا إِذَا أَرَادُوا فِتْنَةً أَبَيْنَا يَرْفَعُ بِهَا صَوْتَهُ‏.‏",
                "headingArabic": "الرَّجَزِ فِي الْحَرْبِ وَرَفْعِ الصَّوْتِ فِي حَفْرِ الْخَنْدَقِ",
                "headingUrdu": "جنگ میں شاعرانہ آیات کی تلاوت",
                "headingEnglish": "The recitation of poetic verses in the war",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2900,
                "hadithNumber": "3035, 3036",
                "englishNarrator": "Narrated Jarir رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) did not screen himself from me since my embracing Islam, and whenever he saw me he would receive me with a smile. Once I told him that I could not sit firm on horses. He stroke me on the chest with his hand and said, \"O Allah! Make him firm and make him a guiding and a rightly guided man.\"",
                "hadithUrdu": "جب سے میں اسلام لایا ‘ رسول کریم صلی اللہ علیہ وسلم نے ( پردہ کے ساتھ ) مجھے ( اپنے گھر میں داخل ہونے سے ) کبھی نہیں روکا اور جب بھی آپ مجھ کو دیکھتے ‘ خوشی سے آپ مسکرانے لگتے ۔ایک دفعہ میں نے آپ صلی اللہ علیہ وسلم کی خدمت میں شکایت کی کہ میں گھوڑے کی پیٹھ پر اچھی طرح نہیں جم پاتا ہوں ‘ تو آپ نے میرے سینے پر اپنا دست مبارک مارا ‘ اور دعا کی اے اللہ ! اسے گھوڑے پر جما دے اور دوسروں کو سیدھا راستہ بتانے والا بنا دے اور خود اسے بھی سیدھے راستے پر قائم رکھ ۔",
                "urduNarrator": "ہم سے محمد بن عبداللہ بن نمیر نے بیان کیا ‘ کہا ہم سے عبداللہ بن ادریس نے بیان کیا ‘ ان سے اسماعیل بن ابی خالد نے ‘ ان سے قیس بن ابی حازم نے اور ان سے جریر بن عبداللہ بجلی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ ـ رضى الله عنه ـ قَالَ مَا حَجَبَنِي النَّبِيُّ صلى الله عليه وسلم مُنْذُ أَسْلَمْتُ، وَلاَ رَآنِي إِلاَّ تَبَسَّمَ فِي وَجْهِي‏. وَلَقَدْ شَكَوْتُ إِلَيْهِ إِنِّي لاَ أَثْبُتُ عَلَى الْخَيْلِ‏.‏ فَضَرَبَ بِيَدِهِ فِي صَدْرِي وَقَالَ ‏ \"‏ اللَّهُمَّ ثَبِّتْهُ وَاجْعَلْهُ هَادِيًا مَهْدِيًّا ‏\"‏‏.‏",
                "headingArabic": "مَنْ لاَ يَثْبُتُ عَلَى الْخَيْلِ",
                "headingUrdu": "جو گھوڑے پر مضبوطی سے بیٹھنے سے عاجز ہو۔",
                "headingEnglish": "Whosoever is unable to sit firm on a horse",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2901,
                "hadithNumber": "3037",
                "englishNarrator": "Narrated Abu Hazim:",
                "hadithEnglish": "The people asked Sahl bin Sa`d As-Sa' idi رضی اللہ عنہ \"With what thing (medicine) was the wound of Allah's Apostle treated?\" He replied, \"There is none left (living) amongst the people who knows it better than. `Ali رضی اللہ عنہ used to bring water in his shield and Fatima رضی اللہ عنہا (i.e. the Prophet's daughter) used to wash the blood off his face. Then a mat (of palm leaves) was burnt and its ash was inserted in the wound of Allah's Apostle.\"",
                "hadithUrdu": "سہل بن سعد ساعدی رضی اللہ عنہ سے شاگردوں نے پوچھا کہ ( جنگ احد میں ) نبی کریم صلی اللہ علیہ وسلم کے زخموں کا علاج کس دوا سے کیا گیا تھا ؟ سہل نے اس پر کہا کہ اب صحابہ میں کوئی شخص بھی ایسا زندہ موجود نہیں ہے جو اس کے بارے میں مجھ سے زیادہ جانتا ہو ۔ حضرت علی رضی اللہ عنہ اپنی ڈھال میں پانی بھربھر کر لا رہے تھے اور سیدہ فاطمہ رضی اللہ عنہا آپ صلی اللہ علیہ وسلم کے چہرے سے خون کو دھو رہی تھیں ۔ اور ایک بوریا جلایا گیا تھا اور آپ کے زخموں میں اسی کی راکھ کو بھر دیا گیا تھا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ کہا ہم سے ابوحازم نے بیان کیا ‘ کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَبُو حَازِمٍ، قَالَ سَأَلُوا سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ ـ رضى الله عنه ـ بِأَىِّ شَىْءٍ دُووِيَ جُرْحُ النَّبِيِّ صلى الله عليه وسلم فَقَالَ مَا بَقِيَ مِنَ النَّاسِ أَحَدٌ أَعْلَمُ بِهِ مِنِّي، كَانَ عَلِيٌّ يَجِيءُ بِالْمَاءِ فِي تُرْسِهِ، وَكَانَتْ ـ يَعْنِي فَاطِمَةَ ـ تَغْسِلُ الدَّمَ عَنْ وَجْهِهِ، وَأُخِذَ حَصِيرٌ فَأُحْرِقَ، ثُمَّ حُشِيَ بِهِ جُرْحُ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
                "headingArabic": "دَوَاءِ الْجُرْحِ بِإِحْرَاقِ الْحَصِيرِ",
                "headingUrdu": "چٹائی کی راکھ سے زخم کا علاج",
                "headingEnglish": "The treatment of a wound with the ashes of a mat",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2902,
                "hadithNumber": "3038",
                "englishNarrator": "Narrated Abu Burda reports from his father and he from his grandfather:",
                "hadithEnglish": "\"The Prophet (ﷺ) sent Mu`adh رضی اللہ عنہ and Abu Musa to Yemen telling them. 'Treat the people with ease and don't be hard on them; give them glad tidings and don't fill them with aversion; and love each other, and don't differ.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے معاذ رضی اللہ عنہ اور ابوموسیٰ کو یمن بھیجا ‘ آپ صلی اللہ علیہ وسلم نے اس موقع پر یہ ہدایت فرمائی تھی کہ ( لوگوں کے لئے ) آسانی پیدا کرنا ‘ انہیں سختیوں میں مبتلا نہ کرنا ‘ ان کو خوش رکھنا ‘ نفرت نہ دلانا ‘ اور تم دونوں آپس میں اتفاق رکھنا ‘ اختلاف نہ پیدا کرنا ۔",
                "urduNarrator": "ہم سے یحییٰ بن جعفر نے بیان کیا ‘ کہا ہم سے وکیع نے بیان کیا ‘ ان سے شعبہ نے ‘ ان سے سعید بن ابی بردہ نے ‘ ان سے ان کے باپ نے اور ان سے ان کے دادا ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ مُعَاذًا وَأَبَا مُوسَى إِلَى الْيَمَنِ قَالَ ‏ \"‏ يَسِّرَا وَلاَ تُعَسِّرَا، وَبَشِّرَا وَلاَ تُنَفِّرَا، وَتَطَاوَعَا وَلاَ تَخْتَلِفَا ‏\"‏‏.‏",
                "headingArabic": "مَا يُكْرَهُ مِنَ التَّنَازُعِ وَالاِخْتِلاَفِ فِي الْحَرْبِ وَعُقُوبَةِ مَنْ عَصَى إِمَامَهُ",
                "headingUrdu": "جنگ میں کس جھگڑے اور اختلافات سے نفرت کی جاتی ہے۔",
                "headingEnglish": "What quarrels and differences are hated in the war",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 2876,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=115",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=113",
                "label": "113",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=114",
                "label": "114",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=115",
                "label": "115",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=116",
                "label": "116",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=117",
                "label": "117",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=118",
                "label": "118",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=119",
                "label": "119",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=117",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=117",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=115",
        "to": 2900,
        "total": 40465
    }
}