{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 251,
        "data": [
            {
                "id": 6253,
                "hadithNumber": "6516",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Do not abuse the dead, for they have reached the result of what they have done.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو لوگ مرگئے ان کو برا نہ کہو کیونکہ جو کچھ انہوں نے آگے بھیجا تھا اس کے پاس وہ خود پہنچ چکے ہیں ۔ انہوں نے برے بھلے جو بھی عمل کئے تھے ویسا بدلہ پا لیا ۔",
                "urduNarrator": "ہم سے علی بن جعد نے بیان کیا ، کہا ہم کو شعبہ بن حجاج نے خبر دی ، انہیں اعمش نے ، انہیں مجاہد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تَسُبُّوا الأَمْوَاتَ، فَإِنَّهُمْ قَدْ أَفْضَوْا إِلَى مَا قَدَّمُوا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6254,
                "hadithNumber": "6517",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Two men, a Muslim and a Jew, abused each other. The Muslim said, \"By Him Who gave superiority to Muhammad over all the people.\" On that, the Jew said, \"By Him Who gave superiority to Moses over all the people.\" The Muslim became furious at that and slapped the Jew in the face. The Jew went to Allah's Messenger (ﷺ) and informed him of what had happened between him and the Muslim. Allah's Apostle said, \"Don't give me superiority over Moses, for the people will fall unconscious on the Day of Resurrection and I will be the first to gain consciousness, and behold ! Moses will be there holding the side of Allah's Throne. I will not know whether Moses has been among those people who have become unconscious and then has regained consciousness before me, or has been among those exempted by Allah from falling unconscious.\"",
                "hadithUrdu": "دو آدمیوں نے آپس میں گالی گلوچ کی ۔ جن میں سے ایک مسلمان تھا اور دوسرا یہودی تھا ۔ مسلمان نے کہا کہ اس پروردگار کی قسم جس نے محمد صلی اللہ علیہ وسلم کو تمام جہان پر برگزیدہ کیا ۔ یہودی نے کہا کہ اس پروردگار کی قسم جس نے موسیٰ علیہ السلام کو تمام جہان پر برگزیدہ کیا ۔ راوی نے بیان کیا کہ مسلمان یہودی کی بات سن کر خفا ہو گیا اور اس کے منہ پر ایک طمانچہ رسید کیا ۔ یہودی رسول اللہ صلی اللہ علیہ وسلم کے پاس گیا اور آنحضرت صلی اللہ علیہ وسلم سے اپنا اور مسلمان کا سارا واقعہ بیان کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا دیکھو موسیٰ علیہ السلام پر مجھ کو فضیلت مت دو کیونکہ قیامت کے دن ایسا ہو گا کہ صور پھونکتے ہی تمام لوگ بیہوش ہو جائیں گے اور میں سب سے پہلا شخص ہوں گا جسے ہوش آئے گا ۔ میں کیا دیکھوں گا کہ موسیٰ علیہ السلام عرش الٰہی کا کونہ تھامے ہوئے ہیں ۔ مجھے نہیں معلوم کی موسیٰ علیہ السلام بھی ان لوگوں میں ہوں گے جو بیہوش ہوئے تھے اور پھر مجھ سے پہلے ہی ہوش میں آ گئے تھے یا ان میں سے ہوں گے جنہیں اللہ تعالیٰ نے اس سے مستثنیٰ کر دیا ۔",
                "urduNarrator": "مجھ سے عبدالعزیز بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابراہیم بن سعد نے بیان کیا ، ان سے ابوسلمہ بن عبدالرحمٰن نے اور عبدالرحمٰن الاعرج نے بیان کیا ، ان دونوں نے بیان کیا کہ حضرت ابوہریرہ رضی اللہ عنہ نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَالأَعْرَجِ، أَنَّهُمَا حَدَّثَاهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ اسْتَبَّ رَجُلاَنِ، رَجُلٌ مِنَ الْمُسْلِمِينَ وَرَجُلٌ مِنَ الْيَهُودِ فَقَالَ الْمُسْلِمُ وَالَّذِي اصْطَفَى مُحَمَّدًا عَلَى الْعَالَمِينَ‏.‏ فَقَالَ الْيَهُودِيُّ وَالَّذِي اصْطَفَى مُوسَى عَلَى الْعَالَمِينَ، قَالَ فَغَضِبَ الْمُسْلِمُ عِنْدَ ذَلِكَ، فَلَطَمَ وَجْهَ الْيَهُودِيِّ، فَذَهَبَ الْيَهُودِيُّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ بِمَا كَانَ مِنْ أَمْرِهِ وَأَمْرِ الْمُسْلِمِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تُخَيِّرُونِي عَلَى مُوسَى، فَإِنَّ النَّاسَ يَصْعَقُونَ يَوْمَ الْقِيَامَةِ، فَأَكُونُ فِي أَوَّلِ مَنْ يُفِيقُ، فَإِذَا مُوسَى بَاطِشٌ بِجَانِبِ الْعَرْشِ، فَلاَ أَدْرِي أَكَانَ مُوسَى فِيمَنْ صَعِقَ فَأَفَاقَ قَبْلِي، أَوْ كَانَ مِمَّنِ اسْتَثْنَى اللَّهُ ‏\"‏‏.‏",
                "headingArabic": "نَفْخِ الصُّورِ",
                "headingUrdu": "صور پھونکنا، قیامت کے دن",
                "headingEnglish": "The blowing of the Trumpet, on the Day of Resurrection",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6255,
                "hadithNumber": "6518",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The people will fall down unconscious at the time when they should fall down (i.e., on the Day of Resurrection), and then I will be the first man to get up, and behold, Moses will be there holding (Allah's) Throne. I will not know whether he has been amongst those who have fallen unconscious.\" Hadrat Abu Saeed  رضی اللہ عنہ (Khudri) has also reported it from the prophet ﷺ.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ بے ہوشی کے وقت تمام لوگ بیہوش ہو جائیں گے اور سب سے پہلے اٹھنے والا میں ہوں گا ۔ اس وقت موسیٰ عرش الٰہی کا کونہ تھامے ہوں گے ۔ اب میں نہیں جانتا کہ وہ بیہوش بھی ہوں گے یا نہیں ۔ اس حدیث کو ابو سعید خدری رضی اللہ عنہ نے بھی آنحضرت صلی اللہ علیہ وسلم سے روایت کیا ہے ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے ، ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَصْعَقُ النَّاسُ حِينَ يَصْعَقُونَ، فَأَكُونُ أَوَّلَ مَنْ قَامَ، فَإِذَا مُوسَى آخِذٌ بِالْعَرْشِ، فَمَا أَدْرِي أَكَانَ فِيمَنْ صَعِقَ ‏\"‏‏.‏ رَوَاهُ أَبُو سَعِيدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6256,
                "hadithNumber": "6519",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah will take the whole earth (in His Hand) and will roll up the Heaven in His right Hand, and then He will say, \"I am King! Where are the kings of the earth ? \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، ” اللہ تعالیٰ زمین کو اپنی مٹھی میں لے لے گا اور آسمانوں کو اپنے دائیں ہاتھ میں لپیٹ لے گا ۔ پھر فرمائے گا کہ اب میں ہوں بادشاہ ۔ آج زمین کے بادشاہ کہاں گئے ؟ “",
                "urduNarrator": "ہم سے مقاتل مروزی نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس بن یزید ایلی نے خبر دی ، انہیں زہری نے ، کہا مجھ سے سعید بن مسیب نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يَقْبِضُ اللَّهُ الأَرْضَ، وَيَطْوِي السَّمَاءَ بِيَمِينِهِ، ثُمَّ يَقُولُ أَنَا الْمَلِكُ أَيْنَ مُلُوكُ الأَرْضِ ‏\"‏‏.‏",
                "headingArabic": "يَقْبِضُ اللَّهُ الأَرْضَ",
                "headingUrdu": "قیامت کے دن اللہ ساری زمین کو اپنی گرفت میں لے گا۔",
                "headingEnglish": "On the Day of Resurrection, Allah will grasp the whole earth",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6257,
                "hadithNumber": "6520",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The (planet of) earth will be a bread on the Day of Resurrection, and The resistible (Allah) will topple turn it with His Hand like anyone of you topple turns a bread with his hands while (preparing the bread) for a journey, and that bread will be the entertainment for the people of Paradise.\" A man from the Jews came (to the Prophet) and said, \"May The Beneficent (Allah) bless you, O Abul Qasim! Shall I tell you of the entertainment of the people of Paradise on the Day of Resurrection?\" The Prophet (ﷺ) said, \"Yes.\" The Jew said, \"The earth will be a bread,\" as the Prophet (ﷺ) had said. Thereupon the Prophet (ﷺ) looked at us and smiled till his premolar tooth became visible. Then the Jew further said, \"Shall I tell you of the udm (additional food taken with bread) they will have with the bread?\" He added, \"That will be Balam and Nun.\" The people asked, \"What is that?\" He said, \"It is an ox and a fish, and seventy thousand people will eat of the caudate lobe (i.e. extra lobe) of their livers.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” قیامت کے دن ساری زمین ایک روٹی کی طرح ہو جائے گی جسے اللہ تعالیٰ اہل جنت کی میزبانی کے لیے اپنے ہاتھ سے الٹے پلٹے گا جس طرح تم دسترخوان پر روٹی لہراتے پھراتے ہو ۔ پھر ایک یہودی آیا اور بولا ابوالقاسم ! تم پر رحمن برکت نازل کرے کیا میں تمہیں قیامت کے دن اہل جنت کی سب سے پہلی ضیافت کے بارے میں خبر نہ دوں ؟ آپ نے فرمایا ، کیوں نہیں ۔ تو اس نے ( بھی یہی ) کہا کہ ساری زمین ایک روٹی کی طرح ہو جائے گی جیسا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے ہماری طرف دیکھا اور مسکرائے جس سے آپ کے آگے کے دانت دکھائی دینے لگے ۔ پھر ( اس نے ) خود ہی پوچھا کیا میں تمہیں اس کے سالن کے متعلق خبر نہ دوں ؟ ( پھر خود ہی ) بولا کہ ان کا سالن بالام و نون ہو گا ۔ صحابہ رضی اللہ عنہم نے کہا کہ یہ کیا چیز ہے ؟ اس نے کہا کہ بیل اور مچھلی جس کی کلیجی کے ساتھ زائد چربی کے حصے کو ستر ہزار آدمی کھائیں گے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے خالد بن یزید نے ، ان سے سعید بن ابی ہلال نے ، ان سے زید بن اسلم نے ، ان سے عطاء بن یسار نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ خَالِدٍ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ تَكُونُ الأَرْضُ يَوْمَ الْقِيَامَةِ خُبْزَةً وَاحِدَةً، يَتَكَفَّؤُهَا الْجَبَّارُ بِيَدِهِ، كَمَا يَكْفَأُ أَحَدُكُمْ خُبْزَتَهُ فِي السَّفَرِ، نُزُلاً لأَهْلِ الْجَنَّةِ ‏\"‏‏.‏ فَأَتَى رَجُلٌ مِنَ الْيَهُودِ فَقَالَ بَارَكَ الرَّحْمَنُ عَلَيْكَ يَا أَبَا الْقَاسِمِ، أَلاَ أُخْبِرُكَ بِنُزُلِ أَهْلِ الْجَنَّةِ يَوْمَ الْقِيَامَةِ قَالَ ‏\"‏ بَلَى ‏\"‏‏.‏ قَالَ تَكُونُ الأَرْضُ خُبْزَةً وَاحِدَةً كَمَا قَالَ النَّبِيُّ صلى الله عليه وسلم فَنَظَرَ النَّبِيُّ صلى الله عليه وسلم إِلَيْنَا، ثُمَّ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ ثُمَّ قَالَ أَلاَ أُخْبِرُكَ بِإِدَامِهِمْ قَالَ إِدَامُهُمْ بَالاَمٌ وَنُونٌ‏.‏ قَالُوا وَمَا هَذَا قَالَ ثَوْرٌ وَنُونٌ يَأْكُلُ مِنْ زَائِدَةِ كَبِدِهِمَا سَبْعُونَ أَلْفًا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6258,
                "hadithNumber": "6521",
                "englishNarrator": "Narrated Sahl bin Sa`d رضی اللہ عنہ :",
                "hadithEnglish": "I heard the Prophet (ﷺ) saying, \"The people will be gathered on the Day of Resurrection on reddish white land like a pure loaf of bread (made of pure fine flour).\" Sahl added: That land will have no landmarks for anybody (to make use of).",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ” قیامت کے دن لوگوں کا حشر سفید و سرخی آمیز زمین پر ہو گا جیسے میدہ کی روٹی صاف و سفید ہوتی ہے ۔ اس زمین پر کسی ( چیز ) کا کوئی نشان نہ ہو گا “ ۔",
                "urduNarrator": "ہم سے سعید بن ابومریم نے بیان کیا ، انہوں نے کہا ہم کو محمد بن جعفر نے خبر دی ، انہوں نے کہا کہ مجھ سے ابوحازم سلمہ بن دینار نے بیان کیا ، انہوں نے کہا کہ میں نے سہل بن سعد الساعدی رضی اللہ عنہ سے سنا کہا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، قَالَ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ عَلَى أَرْضٍ بَيْضَاءَ عَفْرَاءَ كَقُرْصَةِ نَقِيٍّ ‏\"‏‏.‏ قَالَ سَهْلٌ أَوْ غَيْرُهُ لَيْسَ فِيهَا مَعْلَمٌ لأَحَدٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6259,
                "hadithNumber": "6522",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The people will be gathered in three ways: (The first way will be of) those who will wish or have a hope (for Paradise) and will have a fear (of punishment), (The second batch will be those who will gather) riding two on a camel or three on a camel or ten on a camel. (The third batch) the rest of the people will be urged to gather by the Fire which will accompany them at the time of their afternoon nap and stay with them where they will spend the night, and will be with them in the morning wherever they may be then, and will be with them in the afternoon wherever they may be then.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” لوگوں کا حشرتین فرقوں میں ہو گا ( ایک فرقہ والے ) لوگ رغبت کرنے نیز ڈرنے والے ہوں گے ۔ ( دوسرا فرقہ ایسے لوگوں کا ہو گا کہ ) ایک اونٹ پر دو آدمی سوار ہوں گے کسی اونٹ پر تین ہوں گے ، کسی اونٹ پرچار ہوں گے اور کسی پر دس ہوں گے ۔ اور باقی لوگوں کو آگ جمع کرے گی ( اہل شرک کا یہ تیسرا فرقہ ہو گا ) جب وہ قیلولہ کریں گے تو آگ بھی ان کے ساتھ ٹھہری ہو گی جب وہ رات گزاریں گے تو آگ بھی ان کے ساتھ وہاں ٹھہری ہو گی جب وہ صبح کریں گے تو آگ بھی صبح کے وقت وہاں موجود ہو گی اور جب وہ شام کریں گے تو آگ بھی شام کے وقت ان کے ساتھ موجود ہو گی “ ۔",
                "urduNarrator": "ہم سے معلیٰ بن اسد نے بیان کیا ، کہا ہم سے وہیب بن خالد نے بیان کیا ، ان سے عبداللہ بن طاؤس نے ، ان سے ان کے اولد طاؤس نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يُحْشَرُ النَّاسُ عَلَى ثَلاَثِ طَرَائِقَ، رَاغِبِينَ رَاهِبِينَ وَاثْنَانِ عَلَى بَعِيرٍ، وَثَلاَثَةٌ عَلَى بَعِيرٍ، وَأَرْبَعَةٌ عَلَى بَعِيرٍ، وَعَشَرَةٌ عَلَى بَعِيرٍ وَيَحْشُرُ بَقِيَّتَهُمُ النَّارُ، تَقِيلُ مَعَهُمْ حَيْثُ قَالُوا، وَتَبِيتُ مَعَهُمْ حَيْثُ بَاتُوا، وَتُصْبِحُ مَعَهُمْ حَيْثُ أَصْبَحُوا، وَتُمْسِي مَعَهُمْ حَيْثُ أَمْسَوْا ‏\"‏‏.‏",
                "headingArabic": "كَيْفَ الْحَشْرُ",
                "headingUrdu": "اجتماع (قیامت کے دن)",
                "headingEnglish": "The gathering (on the Day of Resurrection)",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6260,
                "hadithNumber": "6523",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "A man said, \"O Allah's Prophet! Will a Kafir (disbeliever) be gathered (driven prone) on his face?\" The Prophet (ﷺ) said, \"Is not He Who made him walk with his legs in this world, able to make him walk on his face on the Day of Resurrection?\" (Qatada رضی اللہ عنہ , a sub-narrator said: Yes, (He can), by the Power of Our Lord!\")",
                "hadithUrdu": "ایک صحابی نے کہا ، اے اللہ کے نبی ! قیامت میں کافروں کو ان کے چہرے کے بل کس طرح حشر کیا جائے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ وہ ذات جس نے انہیں دنیا میں دو پاؤں پر چلایا اسے اس پر قدرت نہیں ہے کہ قیامت کے دن انہیں چہرے کے بل چلادے ۔ قتادہ رضی اللہ عنہ نے کہا کہ ضرور ہے ہمارے رب کی عزت کی قسم ۔ بیشک وہ منہ کے بل چلا سکتا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمدنے بیان کیا ، کہا ہم سے یونس بن محمد بغدادی نے بیان کیا ، کہا ہم سے شیبان نحوی نے بیان کیا ، کہا ان سے قتادہ نے ، کہا ہم سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ الْبَغْدَادِيُّ، حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه أَنَّ رَجُلاً، قَالَ يَا نَبِيَّ اللَّهِ كَيْفَ يُحْشَرُ الْكَافِرُ عَلَى وَجْهِهِ قَالَ ‏ \"‏ أَلَيْسَ الَّذِي أَمْشَاهُ عَلَى الرِّجْلَيْنِ فِي الدُّنْيَا قَادِرًا عَلَى أَنَّ يُمْشِيَهُ عَلَى وَجْهِهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ قَالَ قَتَادَةُ بَلَى وَعِزَّةِ رَبِّنَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6261,
                "hadithNumber": "6524",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"You will meet Allah barefooted, naked, walking on feet, and uncircumcised.\" Sufyan, the reporter, says: We consider it of those Ahadith of Hadrat Ibn-e-Abbas رضی اللہ عنہما which he heard from the prophet ﷺ.",
                "hadithUrdu": "آپ نے فرمایا کہ تم اللہ سے قیامت کے دن ننگے پاؤں ، ننگے بدن اور پیدل چل کر بن ختنہ ملو گے ۔ سفیان نے کہا کہ یہ حدیث ان ( نویاد دس حدیثوں ) میں سے ہے جن کے متعلق ہم سمجھتے ہیں کہ ابن عباس رضی اللہ عنہما نے خود ان کو نبی کریم صلی اللہ علیہ وسلم سے سنا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا کہ عمرو بن دینار نے کہا کہ میں نے سعید بن جبیر سے سنا ، انہوں نے ابن عباس رضی اللہ عنہما سے سنا اورانہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ،",
                "hadithArabic": "حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، سَمِعْتُ ابْنَ عَبَّاسٍ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّكُمْ مُلاَقُو اللَّهِ حُفَاةً عُرَاةً مُشَاةً غُرْلاً ‏\"‏‏.‏ قَالَ سُفْيَانُ هَذَا مِمَّا نَعُدُّ أَنَّ ابْنَ عَبَّاسٍ سَمِعَهُ مِنَ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6262,
                "hadithNumber": "6525",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) while he was delivering a sermon on a pulpit, saying, \"You will meet Allah barefooted, naked, and uncircumcised.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا کہ آپ منبر پر خطبہ میں فرما رہے تھے کہ تم اللہ تعالیٰ سے اس حال میں ملو گے کہ ننگے پاؤں ، ننگے جسم اور بغیر ختنہ ہو گے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے بیان کیا ، ان سے سعید بن جبیر نے ، ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَخْطُبُ عَلَى الْمِنْبَرِ يَقُولُ ‏ \"‏ إِنَّكُمْ مُلاَقُو اللَّهِ حُفَاةً عُرَاةً غُرْلاً ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6263,
                "hadithNumber": "6526",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) stood up among us and addressed (saying) \"You will be gathered, barefooted, naked, and uncircumcised (as Allah says): 'As We began the first creation, We shall repeat it..' (21.104) And the first human being to be dressed on the Day of Resurrection will be (the Prophet) Abraham Al-Khalil. Then will be brought some men of my followers who will be taken towards the left (i.e., to the Fire), and I will say: 'O Lord! My companions whereupon Allah will say: You do not know what they did after you left them. I will then say as the pious slave, Jesus said, And I was witness over them while I dwelt amongst them..........(up to) ...the All-Wise.' (5.117-118). The narrator added: Then it will be said that those people (relegated from Islam, that is) kept on turning on their heels (deserted Islam).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ہمیں خطبہ دینے کے لیے کھڑے ہوئے اور فرمایا ، تم لوگ قیامت کے دن اس حال میں جمع کئے جاؤ گے کہ ننگے پاؤں اور ننگے جسم ہو گے ۔ جیسا کہ اللہ تعالیٰ نے فرمایا کہ ” جس طرح ہم نے شروع میں پیدا کیا تھا اسی طرح لوٹادیں گے “ اور تمام مخلوقات میں سب سے پہلے جسے کپڑا پہنایا جائے گا وہ ابراہیم علیہ السلام ہوں گے اور میری امت کے بہت سے لوگ لائے جائیں گے جن کے اعمال نامے بائیں ہاتھ میں ہوں گے ۔ میں اس پر کہوں گا اے میرے رب ! یہ تو میرے ساتھی ہیں ۔ اللہ تعالیٰ فرمائے گا تمہیں معلوم نہیں کہ انہوں نے تمہارے بعد کیا کیا نئی نئی بدعات نکالی تھیں ۔ اس وقت میں بھی وہی کہوں گا جو نیک بندے ( عیسیٰ علیہ السلام ) نے کہا کہ یا اللہ ! میں جب تک ان میں موجود رہا اس وقت تک میں ان پر گواہ تھا ۔ ( المائدہ : 117 ، 118 ) رسول اللہ صلی اللہ علیہ وسلم نے بیان کیا کہ فرشتے ( مجھ سے ) کہیں گے کہ یہ لوگ ہمیشہ اپنی ایڑیوں کے بل پھرتے ہی رہے ۔ ( مرتد ہوتے رہے )",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے مغیرہ بن نعمان نے بیان کیا ، ان سے سعید بن جبیر نے ، ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَامَ فِينَا النَّبِيُّ صلى الله عليه وسلم يَخْطُبُ فَقَالَ ‏\"‏ إِنَّكُمْ مَحْشُورُونَ حُفَاةً عُرَاةً ‏{‏كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ‏}‏ الآيَةَ، وَإِنَّ أَوَّلَ الْخَلاَئِقِ يُكْسَى يَوْمَ الْقِيَامَةِ إِبْرَاهِيمُ، وَإِنَّهُ سَيُجَاءُ بِرِجَالٍ مِنْ أُمَّتِي، فَيُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ‏.‏ فَأَقُولُ يَا رَبِّ أُصَيْحَابِي‏.‏ فَيَقُولُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ‏.‏ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ ‏{‏وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ‏}‏ إِلَى قَوْلِهِ ‏{‏الْحَكِيمُ‏}‏ قَالَ فَيُقَالُ إِنَّهُمْ لَمْ يَزَالُوا مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6264,
                "hadithNumber": "6527",
                "englishNarrator": "Narrated `Aisha رضی اللہ عہنا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The people will be gathered barefooted, naked, and uncircumcised.\" I said, \"O Allah's Messenger (ﷺ)! Will the men and the women look at each other?\" He said, \"The situation will be too hard for them to pay attention to that.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، تم ننگے پاؤں ننگے جسم ، بلا ختنہ کے اٹھائے جاؤ گے ۔ حضرت عائشہ رضی اللہ عنہا فرماتی ہیں کہ اس پر میں نے پوچھا ، یا رسول اللہ ! تو کیا مرد عورتیں ایک دوسرے کو دیکھتے ہوں گے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس وقت معاملہ اس سے کہیں زیادہ سخت ہو گا ۔ اس خیال بھی کوئی نہیں کر سکے گا ۔",
                "urduNarrator": "ہم سے قیس بن حفص نے بیان کیا ، کہا ہم سے خالد بن حارث نے بیان کیا ، کہا ہم سے حاتم بن ابی صغیرہ نے بیان کیا ، ان سے عبداللہ بن ابی ملکیہ نے بیان کیا ، کہا کہ مجھ سے قاسم بن محمد بن ابی بکر نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عہنا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ حَدَّثَنِي الْقَاسِمُ بْنُ مُحَمَّدِ بْنِ أَبِي بَكْرٍ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تُحْشَرُونَ حُفَاةً عُرَاةً غُرْلاً ‏\"‏ قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ الرِّجَالُ وَالنِّسَاءُ يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ‏.‏ فَقَالَ ‏\"‏ الأَمْرُ أَشَدُّ مِنْ أَنْ يُهِمَّهُمْ ذَاكِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6265,
                "hadithNumber": "6528",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "While we were in the company of the Prophet (ﷺ) in a tent he said, ''Would it please you to be one fourth of the people of Paradise?\" We said, \"Yes.\" He said, \"Would It please you to be one-third of the people of Paradise?\" We said, \"Yes.\" He said, \"Would it please you to be half of the people of Paradise?\" We said, \"Yes.\" Thereupon he said, \"I hope that you will be one half of the people of Paradise, for none will enter Paradise but a Muslim soul, and you people, in comparison to the people who associate others in worship with Allah, are like a white hair on the skin of a black ox, or a black hair on the skin of a red ox.\"",
                "hadithUrdu": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک خیمہ میں تھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کیا تم اس پر راضی ہو کہ اہل جنت کا ایک چوتھائی رہو ؟ ہم نے کہا کہ جی ہاں ۔ آپ نے فرمایا کیا تم اس پر راضی ہو کہ اہل جنت کا تم ایک تہائی رہو ؟ ہم نے کہا جی ہاں ۔ آپ نے فرمایا کیا تم اس پر راضی ہو کہ اہل جنت کا تم نصف رہو ؟ ہم نے کہا جی ہاں ۔ پھر آپ نے فرمایا کہ اس ذات کی قسم جس کے ہاتھ میں محمد کی جان ہے ، مجھے امید ہے کہ تم لوگ ( امت مسلمہ ) اہل جنت کا حصہ ہو گے اور ایسا اس لیے ہو گا کہ جنت میں فرمانبردار نفس کے علاوہ اور کوئی داخل نہ ہو گا اور تم لوگ شرک کرنے والوں کے درمیان ( تعداد میں ) اس طرح ہو گے جیسے سیاہ بیل کے جسم پر سفید بال ہوتے ہیں یا جیسے سرخ کے جسم پر ایک سیاہ بال ہو ۔",
                "urduNarrator": "ہم سے مجمد بن بشار نے بیان کیا ، انہوں نے کہا ہم سے غندر نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے ابواسحاق نے بیان کیا ، ان سے عمرو بن میمون نے بیان کیا اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي قُبَّةٍ فَقَالَ ‏\"‏ أَتَرْضَوْنَ أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قُلْنَا نَعَمْ‏.‏ قَالَ ‏\"‏ تَرْضَوْنَ أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قُلْنَا نَعَمْ‏.‏ قَالَ ‏\"‏ أَتَرْضَوْنَ أَنْ تَكُونُوا شَطْرَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قُلْنَا نَعَمْ‏.‏ قَالَ ‏\"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ إِنِّي لأَرْجُو أَنْ تَكُونُوا نِصْفَ أَهْلِ الْجَنَّةِ، وَذَلِكَ أَنَّ الْجَنَّةَ لاَ يَدْخُلُهَا إِلاَّ نَفْسٌ مُسْلِمَةٌ، وَمَا أَنْتُمْ فِي أَهْلِ الشِّرْكِ إِلاَّ كَالشَّعْرَةِ الْبَيْضَاءِ فِي جِلْدِ الثَّوْرِ الأَسْوَدِ أَوْ كَالشَّعْرَةِ السَّوْدَاءِ فِي جِلْدِ الثَّوْرِ الأَحْمَرِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6266,
                "hadithNumber": "6529",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The first man to be called on the Day of Resurrection will be Adam who will be shown his offspring, and it will be said to them, 'This is your father, Adam.' Adam will say (responding to the call), 'Labbaik and Sa`daik' Then Allah will say (to Adam), 'Take out of your offspring, the people of Hell.' Adam will say, 'O Lord, how many should I take out?' Allah will say, 'Take out ninety-nine out of every hundred.\" They (the Prophet's companions) said, \"O Allah's Apostle! If ninety-nine out of every one hundred of us are taken away, what will remain out of us?\" He said, \"My followers in comparison to the other nations are like a white hair on a black ox.\"",
                "hadithUrdu": "قیامت کے دن سب سے پہلے حضرت آدم علیہ السلام کو پکارا جائے گا ۔ پھر ان کی نسل ان کو دیکھے گی تو کہا جائے گا کہ یہ تمہارے بزرگ دادا آدم ہیں ۔ ( پکارنے پر ) وہ کہیں گے کہ لبیک و سعدیک ۔ اللہ تعالیٰ فرمائے گا کہ اپنی نسل میں سے دوزخ کا حصہ نکال لو ۔ آدم علیہ السلام عرض کریں گے اے پروردگار ! کتنوں کو نکالوں ؟ اللہ تعالیٰ فرمائے گا فیصد ( ننانوے فیصد دوزخمی ایک جنتی ) صحابہ رضوان اللہ علیہم نے عرض کیا یا رسول اللہ ! جب ہم میں سو میں ننانوے نکال دئیے جائیں تو پھر باقی کیا رہ جائیں گے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تمام امتوں میں میری امت اتنی ہی تعداد میں ہو گی جیسے سیاہ بیل کے جسم پر سفید بال ہوتے ہیں ۔",
                "urduNarrator": "ہم سے اسماعیل بن اویس نے بیان کیا ، کہا مجھ سے میرے بھائی نے بیان کیا ، ان سے سلیمان نے ، ان سے ثور نے ، ان سے ابوالغیث نے ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ ثَوْرٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أَوَّلُ مَنْ يُدْعَى يَوْمَ الْقِيَامَةِ آدَمُ، فَتَرَاءَى ذُرِّيَّتُهُ فَيُقَالُ هَذَا أَبُوكُمْ آدَمُ‏.‏ فَيَقُولُ لَبَّيْكَ وَسَعْدَيْكَ‏.‏ فَيَقُولُ أَخْرِجْ بَعْثَ جَهَنَّمَ مِنْ ذُرِّيَّتِكَ‏.‏ فَيَقُولُ يَا رَبِّ كَمْ أُخْرِجُ فَيَقُولُ أَخْرِجْ مِنْ كُلِّ مِائَةٍ تِسْعَةً وَتِسْعِينَ ‏\"‏‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ إِذَا أُخِذَ مِنَّا مِنْ كُلِّ مِائَةٍ تِسْعَةٌ وَتِسْعُونَ، فَمَاذَا يَبْقَى مِنَّا قَالَ ‏\"‏ إِنَّ أُمَّتِي فِي الأُمَمِ كَالشَّعَرَةِ الْبَيْضَاءِ فِي الثَّوْرِ الأَسْوَدِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6267,
                "hadithNumber": "6530",
                "englishNarrator": "Narrated Abu Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Allah will say, 'O Adam!. Adam will reply, 'Labbaik and Sa`daik (I respond to Your Calls, I am obedient to Your orders), wal Khair fi Yadaik (and all the good is in Your Hands)!' Then Allah will say (to Adam), Bring out the people of the Fire.' Adam will say, 'What (how many) are the people of the Fire?' Allah will say, 'Out of every thousand (take out) nine hundred and ninety-nine (persons).' At that time children will become hoary-headed and every pregnant female will drop her load (have an abortion) and you will see the people as if they were drunk, yet not drunk; But Allah's punishment will be very severe.\" That news distressed the companions of the Prophet (ﷺ) too much, and they said, \"O Allah's Messenger (ﷺ)! Who amongst us will be that man (the lucky one out of one-thousand who will be saved from the Fire)?\" He said, \"Have the good news that one-thousand will be from Gog and Magog, and the one (to be saved will be) from you.\" The Prophet (ﷺ) added, \"By Him in Whose Hand my soul is, I Hope that you (Muslims) will be one third of the people of Paradise.\" On that, we glorified and praised Allah and said, \"Allahu Akbar.\" The Prophet (ﷺ) then said, \"By Him in Whose Hand my soul is, I hope that you will be one half of the people of Paradise, as your (Muslims) example in comparison to the other people (non-Muslims), is like that of a white hair on the skin of a black ox, or a round hairless spot on the foreleg of a donkey.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ فرمائے گا اے آدم ! آدم علیہ السلام کہیں گے حاضر ہوں فرماں بردار ہوں اور ہربھلائی تیرے ہاتھ میں ہے ۔ اللہ تعالیٰ فرمائے گا جو لوگ جہنم میں ڈالے جائیں گے انہیں نکال لو ۔ آدم علیہ السلام پوچھیں گے جہنم میں ڈالے جانے والے لوگ کتنے ہیں ؟ اللہ تعالیٰ فرمائے گا کہ ہر ایک ہزار میں سے نو سو ننانوے ۔ یہی وہ وقت ہو گا جب بچے غم سے بوڑھے ہو جائیں گے اور حاملہ عورتیں اپنا حمل گرادیں گی اور تم لوگوں کو نشہ کی حالت میں دیکھوگے ، حالانکہ وہ واقعی نشہ کی حالت میں نہ ہوں گے بلکہ اللہ کا عذاب سخت ہو گا ۔ صحابہ کو یہ بات بہت سخت معلوم ہوئی تو انہوں نے عرض کیا یا رسول اللہ ! پھر ہم میں سے وہ ( خوش نصیب ) شخص کون ہو گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں خوشخبری ہو ، ایک ہزار یاجوج ماجوج کی قوم سے ہوں گے ۔ اور تم میں سے وہ ایک جنتی ہو گا پھر آپ صلی اللہ علیہ وسلم نے فرمایا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ، مجھے امید ہے کہ تم لوگ اہل جنت کا ایک تہائی حصہ ہو گے ۔ راوی نے بیان کیا کہ ہم نے اس پر اللہ کی حمد بیان کی اور اس کی تکبیر کہی ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے مجھے امید ہے کہ آدھا حصہ اہل جنت کا تم لوگ ہو گے ۔ تمہاری مثال دوسری امتوں کے مقابلہ میں ایسی ہے جیسے کسی سیاہ بیل کے جسم پر سفید بالوں کی ( معمولی تعداد ) ہوتی ہے یا وہ سفید داغ جو گدھے کے آگے کے پاؤں پر ہوتا ہے ۔",
                "urduNarrator": "مجھ سے یوسف بن موسیٰ قطان نے بیان کیا ، کہا ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے اعمش نے ، ان سے ابوصالح نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَقُولُ اللَّهُ يَا آدَمُ‏.‏ فَيَقُولُ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ فِي يَدَيْكَ‏.‏ قَالَ يَقُولُ أَخْرِجْ بَعْثَ النَّارِ‏.‏ قَالَ وَمَا بَعْثُ النَّارِ قَالَ مِنْ كُلِّ أَلْفٍ تِسْعَمِائَةٍ وَتِسْعَةً وَتِسْعِينَ‏.‏ فَذَاكَ حِينَ يَشِيبُ الصَّغِيرُ، وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا، وَتَرَى النَّاسَ سَكْرَى وَمَا هُمْ بِسَكْرَى وَلَكِنَّ عَذَابَ اللَّهِ شَدِيدٌ ‏\"‏‏.‏ فَاشْتَدَّ ذَلِكَ عَلَيْهِمْ فَقَالُوا يَا رَسُولُ اللَّهِ أَيُّنَا الرَّجُلُ قَالَ ‏\"‏ أَبْشِرُوا، فَإِنَّ مِنْ يَأْجُوجَ وَمَأْجُوجَ أَلْفٌ وَمِنْكُمْ رَجُلٌ ـ ثُمَّ قَالَ ـ وَالَّذِي نَفْسِي فِي يَدِهِ إِنِّي لأَطْمَعُ أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ ‏\"‏‏.‏ قَالَ فَحَمِدْنَا اللَّهَ وَكَبَّرْنَا، ثُمَّ قَالَ ‏\"‏ وَالَّذِي نَفْسِي فِي يَدِهِ إِنِّي لأَطْمَعُ أَنْ تَكُونُوا شَطْرَ أَهْلِ الْجَنَّةِ، إِنَّ مَثَلَكُمْ فِي الأُمَمِ كَمَثَلِ الشَّعَرَةِ الْبَيْضَاءِ فِي جِلْدِ الثَّوْرِ الأَسْوَدِ أَوِ الرَّقْمَةِ فِي ذِرَاعِ الْحِمَارِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلُهُ عَزَّ وَجَلَّ: {إِنَّ زَلْزَلَةَ السَّاعَةِ شَيْءٌ عَظِيمٌ}",
                "headingUrdu": "جو اللہ کے ساتھ شرک کرتا ہے۔",
                "headingEnglish": "Who associate others in worship with Allah",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6268,
                "hadithNumber": "6531",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said (regarding the Verse), \"A Day when all mankind will stand before the Lord of the Worlds,' (that day) they will stand, drowned in their sweat up to the middle of their ears.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ” یوم یقوم الناس لرب العالمین “ کی تفسیر میں فرمایا کہ تم میں سے ہر کوئی سارے جہانوں کے پروردگار کے آگے کھڑا ہو گا اس حال میں کہ اس کا پسینہ کانوں کی لو تک پہنچاہوا ہو گا ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابان نے بیان کیا ، کہا ہم سے عیسیٰ بن یونس نے بیان کیا ، کہا ہم سے ابن عون نے بیان کیا ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ ‏{‏يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ‏}‏ قَالَ ‏\"‏ يَقُومُ أَحَدُهُمْ فِي رَشْحِهِ إِلَى أَنْصَافِ أُذُنَيْهِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {أَلاَ يَظُنُّ أُولَئِكَ أَنَّهُمْ مَبْعُوثُونَ لِيَوْمٍ عَظِيمٍ يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ}",
                "headingUrdu": "\"انہیں یہ گمان نہیں کہ وہ ایک عظیم دن دوبارہ اٹھائے جائیں گے\"",
                "headingEnglish": "\"Think they not that they will be resurrected on a Great Day\"",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6269,
                "hadithNumber": "6532",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The people will sweat so profusely on the Day of Resurrection that their sweat will sink seventy cubits deep into the earth, and it will rise up till it reaches the people's mouths and ears.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، قیامت کے دن لوگ پسینے میں شرابور ہو جائیں گے اور حالت یہ ہو جائے گی کہ تم میں سے ہر کسی کا پسینہ زمین پر ستر ہاتھ تک پھیل جائے گا اور منہ تک پہنچ کر کانوں کو چھونے لگے گا ۔",
                "urduNarrator": "مجھ سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، انہوں نے کہا کہ مجھ سے سلیمان بن بلال نے بیان کیا ، ان سے ثوربن زید نے بیان کیا ، ان سے ابوالغیث نے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ يَعْرَقُ النَّاسُ يَوْمَ الْقِيَامَةِ حَتَّى يَذْهَبَ عَرَقُهُمْ فِي الأَرْضِ سَبْعِينَ ذِرَاعًا، وَيُلْجِمُهُمْ حَتَّى يَبْلُغَ آذَانَهُمْ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6270,
                "hadithNumber": "6533",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The cases which will be decided first (on the Day of Resurrection) will be the cases of blood-shedding. \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا سب سے پہلے جس چیز کا فیصلہ لوگوں کے درمیان ہو گا وہ ناحق خون کے بدلہ کا ہو گا ۔",
                "urduNarrator": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا مجھ سے شقیق نے بیان کیا ، کہا میں نے عبداللہ بن مسعود رضی اللہ عنہ سے سنا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي شَقِيقٌ، سَمِعْتُ عَبْدَ اللَّهِ ـ رضى الله عنه ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ بِالدِّمَاءِ ‏\"‏‏.‏",
                "headingArabic": "الْقِصَاصِ يَوْمَ الْقِيَامَةِ",
                "headingUrdu": "القصص قیامت کے دن",
                "headingEnglish": "Al-Qisas on the Day of Resurrection",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6271,
                "hadithNumber": "6534",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Whoever has wronged his brother, should ask for his pardon (before his death), as (in the Hereafter) there will be neither a Dinar nor a Dirham. (He should secure pardon in this life) before some of his good deeds are taken and paid to his brother, or, if he has done no good deeds, some of the bad deeds of his brother are taken to be loaded on him (in the Hereafter).",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے اپنے کسی بھائی پر ظلم کیا ہو تو اسے چاہئے کہ اس سے ( اس دنیا میں ) معاف کرا لے ۔ اس لیے کہ آخرت میں روپے پیسے نہیں ہوں گے ۔ اس سے پہلے ( معاف کرا لے ) کہ اس کے بھائی کے لیے اس کی نیکیوں میں سے حق دلایا جائے گا اور اگر اس کے پاس نیکیاں نہ ہوں گی تو اس ( مظلوم ) بھائی کی برائیاں اس پر ڈال دی جائیں گی ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے سعید مقبری نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ كَانَتْ عِنْدَهُ مَظْلَمَةٌ لأَخِيهِ فَلْيَتَحَلَّلْهُ مِنْهَا، فَإِنَّهُ لَيْسَ ثَمَّ دِينَارٌ وَلاَ دِرْهَمٌ مِنْ قَبْلِ أَنْ يُؤْخَذَ لأَخِيهِ مِنْ حَسَنَاتِهِ، فَإِنْ لَمْ يَكُنْ لَهُ حَسَنَاتٌ أُخِذَ مِنْ سَيِّئَاتِ أَخِيهِ، فَطُرِحَتْ عَلَيْهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6272,
                "hadithNumber": "6535",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The believers, after being saved from the (Hell) Fire, will be stopped at a bridge between Paradise and Hell and mutual retaliation will be established among them regarding wrongs they have committed in the world against one another. After they are cleansed and purified (through the retaliation), they will be admitted into Paradise; and by Him in Whose Hand Muhammad's soul is, everyone of them will know his dwelling in Paradise better than he knew his dwelling in this world.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، مومنین جہنم سے چھٹکارا پا جائیں گے لیکن دوزخ و جنت کے درمیان ایک پل پر انہیں روک لیا جائے گا اور پھر ایک کے دوسرے پر ان مظالم کا بدلہ لیا جائے گا جو دنیا میں ان کے درمیان آپس میں ہوئے تھے اور جب کانٹ چھانٹ کر لی جائے گی اور صفائی ہو جائے گی تب انہیں جنت میں داخل ہونے کی اجازت ملے گی ۔ پس اس ذات کی قسم جس کے ہاتھ میں محمد ( صلی اللہ علیہ وسلم ) کی جان ہے ! جنتیوں میں سے ہر کوئی جنت میں اپنے گھر کو دنیا کے اپنے گھر کے مقابلہ میں زیادہ بہتر طریقے پر پہچان لے گا ۔",
                "urduNarrator": "ہم سے صلت بن محمدنے بیان کیا ، انہوں نے کہا ہم سے یزید بن زریع نے بیان کیا اس آیت کے بارے میں و نزعنا مافی صدورہم من غل ( سورۃ الاعراف ) کہا کہ ہم سے سعید نے بیان کیا ، ان سے قتادہ نے بیان کیا ، ان سے ابوالمتوکل ناجی نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي الصَّلْتُ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ‏{‏وَنَزَعْنَا مَا فِي صُدُورِهِمْ مِنْ غِلٍّ‏}‏ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَخْلُصُ الْمُؤْمِنُونَ مِنَ النَّارِ، فَيُحْبَسُونَ عَلَى قَنْطَرَةٍ بَيْنَ الْجَنَّةِ وَالنَّارِ، فَيُقَصُّ لِبَعْضِهِمْ مِنْ بَعْضٍ، مَظَالِمُ كَانَتْ بَيْنَهُمْ فِي الدُّنْيَا، حَتَّى إِذَا هُذِّبُوا وَنُقُّوا أُذِنَ لَهُمْ فِي دُخُولِ الْجَنَّةِ، فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لأَحَدُهُمْ أَهْدَى بِمَنْزِلِهِ فِي الْجَنَّةِ مِنْهُ بِمَنْزِلِهِ كَانَ فِي الدُّنْيَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6273,
                "hadithNumber": "6536",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "\"The Prophet (ﷺ) said, 'Anybody whose account (record) is questioned will surely be punished.' I said, 'Doesn't Allah say: 'He surely will receive an easy reckoning?' (84.8) The Prophet (ﷺ) replied. 'This means only the presentation of the account.\"' Narrated `Aisha: The Prophet (ﷺ) said (as above, 543).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس کے حساب میں کھود کرید کی گئی اس کو ضرور عذاب ہو گا ۔ وہ کہتی ہیں کہ میں نے عرض کیا کیا اللہ تعالیٰ کا یہ فرمان نہیں ہے کہ ” پھر عنقریب ان سے ہلکا حساب لیا جائے گا “ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس سے مراد صرف پیشی ہے ۔",
                "urduNarrator": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا ، ان سے عثمان بن اسود نے بیان کیا ، ان سے ابن ابی ملیکہ نے ، ان سے ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ عُثْمَانَ بْنِ الأَسْوَدِ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ نُوقِشَ الْحِسَابَ عُذِّبَ ‏\"‏‏.‏ قَالَتْ قُلْتُ أَلَيْسَ يَقُولُ اللَّهُ تَعَالَى ‏{‏فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا‏}‏‏.‏ قَالَ ‏\"‏ ذَلِكِ الْعَرْضُ ‏\"‏‏.‏ حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا يَحْيَى، عَنْ عُثْمَانَ بْنِ الأَسْوَدِ، سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، قَالَ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم مِثْلَهُ‏.‏ وَتَابَعَهُ ابْنُ جُرَيْجٍ وَمُحَمَّدُ بْنُ سُلَيْمٍ وَأَيُّوبُ وَصَالِحُ بْنُ رُسْتُمٍ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "مَنْ نُوقِشَ الْحِسَابَ عُذِّبَ",
                "headingUrdu": "جس کے بھی اکاؤنٹ پر سوال اٹھائے جائیں گے اسے سزا ضرور ملے گی۔",
                "headingEnglish": "Anybody whose account is questioned will surely be punished",
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6274,
                "hadithNumber": "6537",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ), said, \"None will be called to account on the Day of Resurrection, but will be ruined.\" I said \"O Allah's Messenger (ﷺ)! Hasn't Allah said: 'Then as for him who will be given his record in his right hand, he surely will receive an easy reckoning? (84.7-8) -- Allah's Messenger (ﷺ) said, \"That (Verse) means only the presentation of the accounts, but anybody whose account (record) is questioned on the Day of Resurrection, will surely be punished.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جس شخص سے بھی قیامت کے دن حساب لیاگیا پس وہ ہلاک ہوا ۔ میں نے عرض کیا یا رسول اللہ ! کیا اللہ تعالیٰ نے خود نہیں فرمایا ہے کہ ” پس جس کا نامہ اعمال اس کے دائیں ہاتھ میں دیا گیا تو عنقریب اس سے ایک آسان حساب لیا جائے گا “ ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ تو صرف پیشی ہو گی ۔ ( اللہ رب العزت کے کہنے کا مطلب یہ ہے کہ ) قیامت کے دن جس کے بھی حساب میں کھود کرید کی گئی اس کو عذاب یقینی ہو گا ۔",
                "urduNarrator": "مجھ سے اسحاق بن منصور نے بیان کیا ، کہا ہم سے روح بن عبادہ نے بیان کیا ، کہا ہم سے حاتم بن ابوصغیرہ نے بیان کیا ، کہا ہم سے عبداللہ بن ابی ملیکہ نے بیان کیا ، کہا مجھ سے قاسم بن محمد نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، حَدَّثَنِي الْقَاسِمُ بْنُ مُحَمَّدٍ، حَدَّثَتْنِي عَائِشَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَيْسَ أَحَدٌ يُحَاسَبُ يَوْمَ الْقِيَامَةِ إِلاَّ هَلَكَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَلَيْسَ قَدْ قَالَ اللَّهُ تَعَالَى ‏{‏فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ * فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا‏}‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا ذَلِكِ الْعَرْضُ، وَلَيْسَ أَحَدٌ يُنَاقَشُ الْحِسَابَ يَوْمَ الْقِيَامَةِ إِلاَّ عُذِّبَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6275,
                "hadithNumber": "6538",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Prophet used to say, \"A disbeliever will be brought on the Day of Resurrection and will be asked. \"Suppose you had as much gold as to fill the earth, would you offer it to ransom yourself?\" He will reply, \"Yes.\" Then it will be said to him, \"You were asked for something easier than that (to join none in worship with Allah (i.e. to accept Islam, but you refused).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم فرماتے تھے کہ قیامت کے دن کافر کو لایا جائے گا اور اس سے پوچھا جائے گا کہ تمہارا کیاخیال ہے کہ اگر زمین بھر کر تمہارے پاس سونا ہو تو کیا سب کو ( اپنی نجات کے لیے ) فدیہ میں دے دو گے ؟ وہ کہے گا کہ ہاں ، تو اس وقت اس سے کہا جائے گا کہ تم سے اس سے بہت آسان چیز کا ( دنیا میں ) مطالبہ کیا گیا تھا ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے معاذ بن ہشام نے بیان کیا ، کہا کہ مجھ سے میرے والد نے بیان کیا ، ان سے قتادہ نے ، ان سے انس رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ( دوسری سند ) اور مجھ سے محمد بن معمر نے بیان کیا ، کہا ہم سے روح بن عبادہ نے بیان کیا ، کہا ہم سے سعید نے بیان کیا ، ان سے قتادہ نے ، کہا ہم سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم وَحَدَّثَنِي مُحَمَّدُ بْنُ مَعْمَرٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ ‏ \"‏ يُجَاءُ بِالْكَافِرِ يَوْمَ الْقِيَامَةِ فَيُقَالُ لَهُ أَرَأَيْتَ لَوْ كَانَ لَكَ مِلْءُ الأَرْضِ ذَهَبًا أَكُنْتَ تَفْتَدِي بِهِ فَيَقُولُ نَعَمْ‏.‏ فَيُقَالُ لَهُ قَدْ كُنْتَ سُئِلْتَ مَا هُوَ أَيْسَرُ مِنْ ذَلِكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6276,
                "hadithNumber": "6539",
                "englishNarrator": "Narrated `Adi bin Hatim رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"There will be none among you but will be talked to by Allah on the Day of Resurrection, without there being an interpreter between him and Him (Allah) . He will look and see nothing ahead of him, and then he will look (again for the second time) in front of him, and the (Hell) Fire will confront him. So, whoever among you can save himself from the Fire, should do so even with one half of a date (to give in charity).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم میں ہر ہر فرد سے اللہ تعالیٰ قیامت کے دن اس طرح کلام کرے گا کہ اللہ کے اور بندے کے درمیان کوئی ترجمان نہیں ہو گا ۔ پھر وہ دیکھے گا تو اس کے آگے کوئی چیز نظر نہیں آئے گی ۔ پھر وہ اپنے سامنے دیکھے گا اور اس کے سامنے آگ ہو گی ۔ پس تم میں سے جو شخص بھی چاہے کہ وہ آگ سے بچے تو وہ راہ خدا میں خیرخیرات کرتا رہے ۔ خواہ کھجور کے ایک ٹکڑے کے ذریعہ ہی ممکن ہو ۔",
                "urduNarrator": "مجھ سے عمر بن حفص نے بیان کیا ، کہا مجھ سے میرے والد نے بیان کیا ، کہا کہ مجھ سے اعمش نے بیان کیا ، کہا کہ مجھ سے خیثمہ نے بیان کیا ، ان سے عدی بن حاتم رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي قَالَ، حَدَّثَنِي الأَعْمَشُ، قَالَ حَدَّثَنِي خَيْثَمَةُ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ وَسَيُكَلِّمُهُ اللَّهُ يَوْمَ الْقِيَامَةِ، لَيْسَ بَيْنَ اللَّهِ وَبَيْنَهُ تُرْجُمَانٌ، ثُمَّ يَنْظُرُ فَلاَ يَرَى شَيْئًا قُدَّامَهُ، ثُمَّ يَنْظُرُ بَيْنَ يَدَيْهِ فَتَسْتَقْبِلُهُ النَّارُ، فَمَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يَتَّقِيَ النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 6277,
                "hadithNumber": "6540",
                "englishNarrator": "Narrated `Adi bin Hatim رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Protect yourself from the Fire.\" He then turned his face aside (as if he were looking at it) and said again, \"Protect yourself from the Fire,\" and then turned his face aside (as if he were looking at it), and he said so for the third time till we thought he was looking at it. He then said, \"Protect yourselves from the Fire, even if with one half of a date and he who hasn't got even this, (should do so) by (saying) a good, pleasant word.'",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جہنم سے بچو ۔ پھر آپ نے چہرہ پھیرلیا ، پھر فرمایا کہ جہنم سے بچو اور پھر اس کے بعد چہرہ مبارک پھیرلیا ، پھر فرمایا جہنم سے بچو ۔ تین مرتبہ آپ نے ایسا ہی کیا ۔ ہم نے اس سے یہ خیال کیا کہ آپ جہنم دیکھ رہے ہیں ۔ پھر فرمایا کہ جہنم سے بچو خواہ کھجور کے ایک ٹکڑے ہی کے ذریعہ ہو سکے اور جسے یہ بھی نہ ملے تو اسے ( لوگوں میں ) کسی اچھی بات کہنے کے ذریعہ سے ہی ( جہنم سے ) بچنے کی کوشش کرنی چاہئے ۔",
                "urduNarrator": "اعمش نے کہا: مجھے عمرو نے خیثمہ کی سند سے اور عدی بن حاتم رضی اللہ عنہ سے ایک اور روایت ہے کہ",
                "hadithArabic": "قَالَ الأَعْمَشُ حَدَّثَنِي عَمْرٌو، عَنْ خَيْثَمَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ اتَّقُوا النَّارَ ‏\"‏‏.‏ ثُمَّ أَعْرَضَ وَأَشَاحَ، ثُمَّ قَالَ ‏\"‏ اتَّقُوا النَّارَ ‏\"‏‏.‏ ثُمَّ أَعْرَضَ وَأَشَاحَ ثَلاَثًا، حَتَّى ظَنَنَّا أَنَّهُ يَنْظُرُ إِلَيْهَا، ثُمَّ قَالَ ‏\"‏ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ، فَمَنْ لَمْ يَجِدْ فَبِكَلِمَةٍ طَيِّبَةٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "82",
                "bookSlug": "sahih-bukhari",
                "volume": "8",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 82,
                    "chapterNumber": "82",
                    "chapterEnglish": "To make the Heart Tender (Ar-Riqaq)",
                    "chapterUrdu": "دل کو نرم کرنے والی باتوں کے بیان میں",
                    "chapterArabic": "كتاب الرقاق",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 6251,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=250",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=248",
                "label": "248",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=249",
                "label": "249",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=250",
                "label": "250",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=251",
                "label": "251",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=252",
                "label": "252",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=253",
                "label": "253",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=254",
                "label": "254",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=252",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=252",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=250",
        "to": 6275,
        "total": 40465
    }
}