{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 112,
        "data": [
            {
                "id": 2778,
                "hadithNumber": "2906, 2907",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) came to my house while two girls were singing beside me the songs of Bu'ath (a story about the war between the two tribes of the Ansar, i.e. Khazraj and Aus, before Islam.) The Prophet (ﷺ) reclined on the bed and turned his face to the other side. Abu Bakr رضی اللہ عنہ came and scolded me and said protestingly, \"Instrument of Satan in the presence of Allah's Messenger (ﷺ)?\" Allah's Messenger (ﷺ) turned his face towards him and said, \"Leave them.\" When Abu Bakr رضی اللہ عنہ became inattentive, I waved the two girls to go away and they left. It was the day of `Id when negroes used to play with leather shields and spears. Either I requested Allah's Messenger (ﷺ) or he himself asked me whether I would like to see the display. I replied in the affirmative. Then he let me stand behind him and my cheek was touching his cheek and he was saying, \"Carry on, O Bani Arfida (i.e. negroes)!\" When I got tired, he asked me if that was enough. I replied in the affirmative and he told me to leave. And  there is \"فَلَمَّا غَفَلَ\" instead of \"فَلَمَّا عمل \" in the narration reported by Ahmad from Ibn-e-Wahb.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم میرے یہاں تشریف لائے تو دو لڑ کیا ں میرے پاس جنگ بعاث کے گیت گا رہی تھیں ۔ آپ صلی اللہ علیہ وسلم بستر پر لیٹ گئے اور چہرہ مبارک دوسری طرف کر لیا اس کے بعد ابوبکر رضی اللہ عنہ آ گئے اور آپ نے مجھے ڈانٹا کہ یہ شیطانی گانا اور رسول اللہ صلی اللہ علیہ وسلم کی موجودگی میں ! لیکن آپ صلی اللہ علیہ وسلم ان کی طرف متوجہ ہوئے اور فرمایا کہ انہیں گانے دو ، پھر جب ابوبکر رضی اللہ عنہ دوسری طرف متوجہ ہو گئے تو میں نے ان لڑکیوں کو اشارہ کیا اور وہ چلی گئیں ۔عائشہ رضی اللہ عنہا نے بیان کیا کہ عید کے دن سوڈان کے کچھ صحابہ ڈھال اور حراب کا کھیل دکھا رہے تھے ، اب یا میں نے خود رسول اللہ صلی اللہ علیہ وسلم سے کہا یا آپ نے ہی فرمایا کہ تم بھی دیکھنا چاہتی ہو ؟ میں نے کہا جی ہاں ۔ آپ صلی اللہ علیہ وسلم نے مجھے اپنے پیچھے کھڑا کر لیا ، میرا چہرہ آپ صلی اللہ علیہ وسلم کے چہرہ پر تھا ( اس طرح میں پیچھے پردے سے کھیل کو بخوبی دیکھ سکتی تھی ) اور آپ صلی اللہ علیہ وسلم فرما رہے تھے خوب بنوارفدہ ! جب میں تھک گئی تو آپ نے فرمایا بس ؟ میں نے کہا جی ہاں ، آپ نے فرمایا تو پھر جاؤ ۔ احمد نے بیان کیا اور ان سے ابن وہب نے ( ابوبکر رضی اللہ عنہ کے آنے کے بعد دوسری طرف متوجہ ہو جانے کے لیے لفظ عمل کے بجائے ) فلما غفل نقل کیا ہے ۔ یعنی جب وہ ذرا غافل ہو گئے ۔",
                "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، کہا کہ مجھ سے ابن وہب نے بیان کیا کہ عمرو نے کہا کہ مجھ سے ابوالاسود نے بیان کیا ، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ عَمْرٌو حَدَّثَنِي أَبُو الأَسْوَدِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعِنْدِي جَارِيَتَانِ تُغَنِّيَانِ بِغِنَاءِ بُعَاثَ، فَاضْطَجَعَ عَلَى الْفِرَاشِ وَحَوَّلَ وَجْهَهُ، فَدَخَلَ أَبُو بَكْرٍ فَانْتَهَرَنِي وَقَالَ مِزْمَارَةُ الشَّيْطَانِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَأَقْبَلَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ دَعْهُمَا ‏\"‏‏.‏ فَلَمَّا غَفَلَ غَمَزْتُهُمَا فَخَرَجَتَا‏.‏ قَالَتْ وَكَانَ يَوْمُ عِيدٍ يَلْعَبُ السُّودَانُ بِالدَّرَقِ وَالْحِرَابِ، فَإِمَّا سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَإِمَّا قَالَ ‏\"‏ تَشْتَهِينَ تَنْظُرِينَ ‏\"‏‏.‏ فَقَالَتْ نَعَمْ‏.‏ فَأَقَامَنِي وَرَاءَهُ خَدِّي عَلَى خَدِّهِ وَيَقُولُ ‏\"‏ دُونَكُمْ بَنِي أَرْفِدَةَ ‏\"‏‏.‏ حَتَّى إِذَا مَلِلْتُ قَالَ ‏\"‏ حَسْبُكِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ فَاذْهَبِي ‏\"‏‏.‏ قَالَ أَحْمَدُ عَنِ ابْنِ وَهْبٍ، فَلَمَّا غَفَلَ‏.‏",
                "headingArabic": "الدَّرَقِ",
                "headingUrdu": "(چمڑے کی) ڈھال",
                "headingEnglish": "The (leather) shield",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2779,
                "hadithNumber": "2908",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The 'Prophet was the best and the bravest amongst the people. Once the people of Medina got terrified at night, so they went in the direction of the noise (that terrified them). The Prophet (ﷺ) met them (on his way back) after he had found out the truth. He was riding an unsaddled horse belonging to Abu Talha رضی اللہ عنہ and a sword was hanging by his neck, and he was saying, \"Don't be afraid! Don't be afraid!\" He further said, \"I found it (i.e. the horse) very fast,\" or said, \"This horse is very fast.\" (Qastala-ni)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم سب سے زیادہ خوب صورت اور سب سے زیادہ بہادر تھے ۔ ایک رات مدینہ پر ( ایک آواز سن کر ) بڑا خوف چھا گیا تھا ، سب لوگ اس آواز کی طرف بڑھے لیکن نبی کریم صلی اللہ علیہ وسلم سب سے آگے تھے اور آپ صلی اللہ علیہ وسلم نے ہی واقعہ کی تحقیق کی ۔ آپ صلی اللہ علیہ وسلم ابوطلحہ رضی اللہ عنہ کے ایک گھوڑے پر سوار تھے جس کی پشت ننگی تھی ۔ آپ صلی اللہ علیہ وسلم کی گردن سے تلوار لٹک رہی تھی اور آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ ڈرو مت ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہم نے تو گھوڑے کو سمندر کی طرح تیز پایا ہے یا ( یہ فرمایا کہ گھوڑا جیسے سمندر ہے ۔",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ثابت نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم أَحْسَنَ النَّاسِ وَأَشْجَعَ النَّاسِ، وَلَقَدْ فَزِعَ أَهْلُ الْمَدِينَةِ لَيْلَةً فَخَرَجُوا نَحْوَ الصَّوْتِ فَاسْتَقْبَلَهُمُ النَّبِيُّ صلى الله عليه وسلم وَقَدِ اسْتَبْرَأَ الْخَبَرَ، وَهْوَ عَلَى فَرَسٍ لأَبِي طَلْحَةَ عُرْىٍ وَفِي عُنُقِهِ السَّيْفُ وَهْوَ يَقُولُ ‏\"‏ لَمْ تُرَاعُوا لَمْ تُرَاعُوا ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ وَجَدْنَاهُ بَحْرًا ‏\"‏‏.‏ أَوْ قَالَ ‏\"‏ إِنَّهُ لَبَحْرٌ ‏\"‏‏.‏",
                "headingArabic": "الْحَمَائِلِ وَتَعْلِيقِ السَّيْفِ بِالْعُنُقِ",
                "headingUrdu": "تلوار کو لٹکانے کے لیے پٹے اور تلوار کا گلے میں لٹکانا",
                "headingEnglish": "The straps for suspending sword and the hanging of the sword by the neck",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2780,
                "hadithNumber": "2909",
                "englishNarrator": "Narrated Abu Umama:",
                "hadithEnglish": "Some people conquered many countries and their swords were decorated neither with gold nor silver, but they were decorated with leather, lead and iron.",
                "hadithUrdu": "ایک قوم ( صحابہ رضوان اللہ علیہم اجمعین ) نے بہت سی فتوحات کیں اور ان کی تلواروں کی آرائش سونے چاندی سے نہیں ہوئی تھی بلکہ اونٹ کی پشت کا چمڑہ ، سیسہ اور لوہا ان کی تلواروں کے زیور تھے ۔",
                "urduNarrator": "ہم سے احمد بن محمد نے بیان کیا ، انہوں نے کہا کہ ہم کو عبداللہ نے خبر دی ، انہوں نے کہا ہم کو اوزاعی نے خبر دی ، انہوں نے کہا کہ میں نے سلیمان بن حبیب سے سنا ، کہا میں نے ابوامامہ باہلی سے سنا وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا الأَوْزَاعِيُّ، قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ حَبِيبٍ، قَالَ سَمِعْتُ أَبَا أُمَامَةَ، يَقُولُ لَقَدْ فَتَحَ الْفُتُوحَ قَوْمٌ مَا كَانَتْ حِلْيَةُ سُيُوفِهِمِ الذَّهَبَ وَلاَ الْفِضَّةَ، إِنَّمَا كَانَتْ حِلْيَتُهُمُ الْعَلاَبِيَّ وَالآنُكَ وَالْحَدِيدَ‏.‏",
                "headingArabic": "حِلْيَةِ السُّيُوفِ",
                "headingUrdu": "تلواروں کی سجاوٹ (سونے اور چاندی وغیرہ سے)",
                "headingEnglish": "The decoration of swords (with gold and silver etc.)",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2781,
                "hadithNumber": "2910",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "He proceeded in the company of Allah's Messenger (ﷺ) towards Najd to participate in a Ghazwa. (Holybattle) When Allah's Messenger (ﷺ) returned, he too returned with him. Midday came upon them while they were in a valley having many thorny trees. Allah's Messenger (ﷺ) and the people dismounted and dispersed to rest in the shade of the trees. Allah's Messenger (ﷺ) rested under a tree and hung his sword on it. We all took a nap and suddenly we heard Allah's Messenger (ﷺ) calling us. (We woke up) to see a bedouin with him. The Prophet (ﷺ) said, \"This bedouin took out my sword while I was sleeping and when I woke up, I found the unsheathed sword in his hand and he challenged me saying, 'Who will save you from me?' I said thrice, 'Allah.' The Prophet (ﷺ) did not punish him but sat down.",
                "hadithUrdu": "وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ نجد کے اطراف میں ایک غزوہ میں شریک تھے ۔ جب حضور اکرم صلی اللہ علیہ وسلم جہاد سے واپس ہوئے تو آپ کے ساتھ یہ بھی واپس ہوئے ۔ راستے میں قیلولہ کا وقت ایک ایسی وادی میں ہوا جس میں ببول کے درخت بکثرت تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس وادی میں پڑاو کیا اور صحابہ پوری وادی میں ( درخت کے سائے کے لیے ) پھیل گئے ۔ آپ صلی اللہ علیہ وسلم نے بھی ایک ببول کے نیچے قیام فرمایا اور اپنی تلوار درخت پر لٹکادی ۔ ہم سب سو گئے تھے کہ آنحضرت صلی اللہ علیہ وسلم کے پکارنے کی آواز سنائی دی ، دیکھا گیا تو ایک بدوی آپ صلی اللہ علیہ وسلم کے پاس تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس نے غفلت میں میری ہی تلوار مجھ پر کھینچ لی تھی اور میں سویا ہوا تھا ، جب بیدار ہوا تو ننگی تلوار اس کے ہاتھ میں تھی ۔ اس نے کہا مجھ سے تمہیں کون بچائے گا ؟ میں نے کہا کہ اللہ ! تین مرتبہ ( میں نے اسی طرح کہا اور تلوار اس کے ہاتھ سے چھوٹ کر گر گئی ) حضور اکرم صلی اللہ علیہ وسلم نے اعرابی کو کوئی سزا نہیں دی بلکہ آپ صلی اللہ علیہ وسلم بیٹھ گئے ۔ ( پھر وہ خود متاثر ہو کر اسلام لائے ) ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا کہ ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، کہا مجھ سے سنان بن ابی سنان الدولی اور ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي سِنَانُ بْنُ أَبِي سِنَانٍ الدُّؤَلِيُّ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَخْبَرَ أَنَّهُ، غَزَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قِبَلَ نَجْدٍ، فَلَمَّا قَفَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَفَلَ مَعَهُ، فَأَدْرَكَتْهُمُ الْقَائِلَةُ فِي وَادٍ كَثِيرِ الْعِضَاهِ، فَنَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَتَفَرَّقَ النَّاسُ يَسْتَظِلُّونَ بِالشَّجَرِ، فَنَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم تَحْتَ سَمُرَةٍ وَعَلَّقَ بِهَا سَيْفَهُ وَنِمْنَا نَوْمَةً، فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْعُونَا وَإِذَا عِنْدَهُ أَعْرَابِيٌّ فَقَالَ ‏\"‏ إِنَّ هَذَا اخْتَرَطَ عَلَىَّ سَيْفِي وَأَنَا نَائِمٌ، فَاسْتَيْقَظْتُ وَهْوَ فِي يَدِهِ صَلْتًا ‏\"‏‏.‏ فَقَالَ مَنْ يَمْنَعُكَ مِنِّي فَقُلْتُ ‏\"‏ اللَّهُ ‏\"‏‏.‏ ثَلاَثًا وَلَمْ يُعَاقِبْهُ وَجَلَسَ‏.‏",
                "headingArabic": "مَنْ عَلَّقَ سَيْفَهُ بِالشَّجَرِ فِي السَّفَرِ عِنْدَ الْقَائِلَةِ",
                "headingUrdu": "جس نے دوپہر کی نیند میں اپنی تلوار درخت پر لٹکا دی۔",
                "headingEnglish": "Whoever hung his sword on a tree at midday nap",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2782,
                "hadithNumber": "2911",
                "englishNarrator": "Narrated Sahl رضی اللہ عنہ :",
                "hadithEnglish": "That he was asked about the wound of the Prophet (ﷺ) on the day (of the battle) of Uhud. He said, \"The face of the Prophet (ﷺ) as wounded and one of his front teeth as broken and the helmet over his head was smashed. Fatima رضی اللہ عنہا washed of the blood while `Ali رضی اللہ عنہ held water. When she saw that bleeding was increasing continuously, she burnt a mat (of date-palm leaves) till it turned into ashes which she put over the wound and thus the bleeding ceased.\"",
                "hadithUrdu": "ان سے احد کی لڑائی میں نبی کریم صلی اللہ علیہ وسلم کے زخمی ہونے کے متعلق پوچھا گیا تو انہوں نے بتلایا آپ صلی اللہ علیہ وسلم کے چہرہ مبارک پر زخم آئے اور آپ صلی اللہ علیہ وسلم کے آگے کے دانت ٹوٹ گئے تھے اور خود آپ صلی اللہ علیہ وسلم کے سرمبارک پر ٹوٹ گئی تھی ۔ ( جس سے سر پر زخم آئے تھے ) حضرت فاطمہ رضی اللہ عنہا خون دھو رہی تھیں اور علی رضی اللہ عنہ پانی ڈال رہے تھے ۔ جب حضرت فاطمہ رضی اللہ عنہا نے دیکھا کہ خون برابر بڑھتا ہی جا رہا ہے تو انہوں نے ایک چٹائی جلائی اور اس کی راکھ کو آپ صلی اللہ علیہ وسلم کے زخموں پر لگا دیا جس سے خون بہنا بند ہو گیا ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے عبدالعزیز بن ابی حازم نے بیان کیا ، ان سے ان کے والد نے اور ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے ،",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ ـ رضى الله عنه ـ أَنَّهُ سُئِلَ عَنْ جُرْحِ النَّبِيِّ، صلى الله عليه وسلم يَوْمَ أُحُدٍ‏.‏ فَقَالَ جُرِحَ وَجْهُ النَّبِيِّ صلى الله عليه وسلم وَكُسِرَتْ رَبَاعِيَتُهُ وَهُشِمَتِ الْبَيْضَةُ عَلَى رَأْسِهِ، فَكَانَتْ فَاطِمَةُ ـ عَلَيْهَا السَّلاَمُ ـ تَغْسِلُ الدَّمَ وَعَلِيٌّ يُمْسِكُ، فَلَمَّا رَأَتْ أَنَّ الدَّمَ لاَ يَزِيدُ إِلاَّ كَثْرَةً أَخَذَتْ حَصِيرًا فَأَحْرَقَتْهُ حَتَّى صَارَ رَمَادًا ثُمَّ أَلْزَقَتْهُ، فَاسْتَمْسَكَ الدَّمُ‏.‏",
                "headingArabic": "لُبْسِ الْبَيْضَةِ",
                "headingUrdu": "ہیلمٹ پہننا",
                "headingEnglish": "The wearing of a helmet",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2783,
                "hadithNumber": "2912",
                "englishNarrator": "Narrated `Amr bin Al-Harith رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) did not leave behind him after his death, anything except his arms, his white mule, and a piece of land at Khaibar which he left to be given in charity .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ( وفات کے بعد ) اپنے ہتھیار ایک سفید خچر اور ایک قطعہ اراضی جسے آپ پہلے ہی صدقہ کر چکے تھے کے سوا اور کوئی چیز نہیں چھوڑی تھی ۔",
                "urduNarrator": "ہم سے عمرو بن عباس نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ، ان سے سفیان ثوری نے ، ان سے ابواسحاق نے اور ان سے عمرو بن حارث رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ الْحَارِثِ، قَالَ مَا تَرَكَ النَّبِيُّ صلى الله عليه وسلم إِلاَّ سِلاَحَهُ وَبَغْلَةً بَيْضَاءَ وَأَرْضًا جَعَلَهَا صَدَقَةً‏.‏",
                "headingArabic": "مَنْ لَمْ يَرَ كَسْرَ السِّلاَحِ عِنْدَ الْمَوْتِ",
                "headingUrdu": "اسلحے کو توڑنا اور مقتول کے جانوروں کو ذبح کرنا",
                "headingEnglish": "To break the weapons and to slaughter the animals of the deceased",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2784,
                "hadithNumber": "2913",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "He participated in a Ghazwa (Holy-Battle) in the company of Allah's Messenger (ﷺ). Midday came upon them while they were in a valley having many thorny trees. The people dispersed to rest in the shade of the trees. The Prophet (ﷺ) rested under a tree, hung his sword on it, and then slept. Then he woke up to find near to him, a man whose presence he had not noticed before. The Prophet (ﷺ) said, \"This (man) took my sword (out of its scabbard) and said, 'Who will save you from me.' I replied, 'Allah.' So, he put the sword back into its scabbard, and you see him sitting here.\" Anyhow, the Prophet (ﷺ) did not punish him. (See Hadith No. 158)",
                "hadithUrdu": "وہ نبی کریم صلی اللہ علیہ وسلم کے ساتھ ایک لڑائی میں شریک تھے ۔ ایک ایسے جنگل میں جہاں ببول کے درخت بکثرت تھے ۔ قیلولہ کا وقت ہو گیا ، تمام صحابہ سائے کی تلاش میں ( پوری وادی میں متفرق درختوں کے نیچے ) پھیل گئے اور نبی کریم صلی اللہ علیہ وسلم نے بھی ایک درخت کے نیچے قیام فرمایا ۔ آپ صلی اللہ علیہ وسلم نے تلوار ( درخت کے تنے سے ) لٹکا دی تھی اور سو گئے تھے ۔ جب آپ صلی اللہ علیہ وسلم بیدار ہوئے تو آپ صلی اللہ علیہ وسلم کے پاس ایک اجنبی موجود تھا ۔ اس اجنبی نے کہا کہ اب تمہیں مجھ سے کون بچائے گا ؟ پھر آنحضرت صلی اللہ علیہ وسلم نے آواز دی اور جب صحابہ رضی اللہ عنہم اجمعین آپ صلی اللہ علیہ وسلم کے قریب پہنچے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس شخص نے میری ہی تلوار مجھ پر کھینچ لی تھی اور مجھ سے کہنے لگا تھا کہ اب تمہیں میرے ہاتھ سے کون بچا سکے گا ؟ میں نے کہا اللہ ( اس پر وہ شخص خود ہی دہشت زدہ ہو گیا ) اور تلوار نیام میں کر لی ، اب یہ بیٹھا ہوا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے کوئی سزا نہیں دی تھی ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا کہ ہم کو شعیب نے خبر دی ، انہیں زہری نے ، ان سے سنان بن ابی سنان اور ابوسلمہ نے بیان کیا اور ان دونوں حضرات کو جابر رضی اللہ عنہ نے خبر دی ۔ اور ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہیں ابراہیم بن سعد نے خبر دی ، انہیں ابن شہاب نے خبر دی ، انہیں سنان بن ابی سنان الدولی نے اور انہیں جابر بن عبداللہ رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنَا سِنَانُ بْنُ أَبِي سِنَانٍ، وَأَبُو سَلَمَةَ أَنَّ جَابِرًا، أَخْبَرَهُ‏.‏ حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، أَخْبَرَنَا ابْنُ شِهَابٍ، عَنْ سِنَانِ بْنِ أَبِي سِنَانٍ الدُّؤَلِيِّ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّهُ، غَزَا مَعَ النَّبِيِّ صلى الله عليه وسلم فَأَدْرَكَتْهُمُ الْقَائِلَةُ فِي وَادٍ كَثِيرِ الْعِضَاهِ، فَتَفَرَّقَ النَّاسُ فِي الْعِضَاهِ يَسْتَظِلُّونَ بِالشَّجَرِ، فَنَزَلَ النَّبِيُّ صلى الله عليه وسلم تَحْتَ شَجَرَةٍ فَعَلَّقَ بِهَا سَيْفَهُ ثُمَّ نَامَ، فَاسْتَيْقَظَ وَعِنْدَهُ رَجُلٌ وَهْوَ لاَ يَشْعُرُ بِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ هَذَا اخْتَرَطَ سَيْفِي ‏\"‏‏.‏ فَقَالَ مَنْ يَمْنَعُكَ قُلْتُ ‏\"‏ اللَّهُ ‏\"‏‏.‏ فَشَامَ السَّيْفَ، فَهَا هُوَ ذَا جَالِسٌ، ثُمَّ لَمْ يُعَاقِبْهُ‏.‏",
                "headingArabic": "تَفَرُّقِ النَّاسِ عَنِ الإِمَامِ، عِنْدَ الْقَائِلَةِ، وَالاِسْتِظْلاَلِ بِالشَّجَرِ",
                "headingUrdu": "منتشر اور لوگوں کو امام سے دور درختوں کے سائے میں آرام کرنے کے لیے",
                "headingEnglish": "The dispersing og the people away from the Imam to rest in the shade of trees",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2785,
                "hadithNumber": "2914",
                "englishNarrator": "Narrated Abu Qatada رضی اللہ عنہ :",
                "hadithEnglish": "He was in the company of Allah's Messenger (ﷺ) and when they had covered a portion of the road to Mecca, he and some of the companions lagged behind. The latter were in a state of Ihram, while he was not. He saw an onager and rode his horse and requested his companions to give him his lash but they refused. Then he asked them to give him his spear but they refused, so he took it himself, attacked the onager, and killed it. Some of the companions of the Prophet (ﷺ) ate of it while some others refused to eat. When they caught up with Allah's Messenger (ﷺ) they asked him about that, and he said, \"That was a meal Allah fed you with.\" A Hadith similar to that of Abu Nadr has also been reported from Zaid bin Aslam, Ataa bin Yasaar, Abu Qatada about an onager. (It also says: ) He (ﷺ) said: Do you have any left-over meat of it with you?",
                "hadithUrdu": "آپ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے ( صلح حدیبیہ کے موقع پر ) مکہ کے راستے میں آپ صلی اللہ علیہ وسلم اپنے چند ساتھیوں کے ساتھ جو احرام باندھے ہوئے تھے ، لشکر سے پیچھے رہ گئے ۔ خود قتادہ رضی اللہ عنہ نے ابھی احرام نہیں باندھا تھا ۔ پھر انہوں نے ایک گورخر دیکھا اور اپنے گھوڑے پر ( شکار کرنے کی نیت سے ) سوار ہو گئے ، اس کے بعد انہوں نے اپنے ساتھیوں سے ( احرام باندھے ہوئے تھے ) کہا کہ کوڑا اٹھا دیں انہوں نے اس سے انکار کیا ، پھر انہوں نے اپنا نیزہ مانگا اس کے دینے سے انہوں نے انکار کیا ، آخر انہوں نے خود اسے اٹھایا اور گورخر پر جھپٹ پڑے اور اسے مار لیا ۔ نبی کریم صلی اللہ علیہ وسلم کے صحابہ میں سے بعض نے تو اس گورخر کا گوشت کھایا اور بعض نے اس کے کھانے سے ( احرام کے عذر کی بنا پر ) انکار کیا ۔ پھر جب یہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں پہنچے تو اس کے متعلق مسئلہ پوچھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ تو ایک کھانے کی چیز تھی جو اللہ نے تمہیں عطا کی ۔ اور زید بن اسلم سے روایت ہے کہ ان سے عطاء بن یسار نے بیان کیا اور ان سے ابوقتادہ رضی اللہ عنہ نے گورخر کے ( شکار سے ) متعلق ابوالنضر ہی کی حدیث کی طرح ( البتہ اس روایت میں یہ زائد ہے ) نبی کریم صلی اللہ علیہ وسلم نے دریافت فرمایا کہ اس کا کچھ بچا ہوا گوشت ابھی تمہارے پاس موجود ہے ؟",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں عمر بن عبیداللہ کے مولیٰ ابوالنضر نے اور انہیں ابوقتادہ انصاری کے مولیٰ نافع نے اور انہیں ابوقتادہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ، مَوْلَى أَبِي قَتَادَةَ الأَنْصَارِيِّ عَنْ أَبِي قَتَادَةَ ـ رضى الله عنه ـ أَنَّهُ كَانَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا كَانَ بِبَعْضِ طَرِيقِ مَكَّةَ تَخَلَّفَ مَعَ أَصْحَابٍ لَهُ مُحْرِمِينَ وَهْوَ غَيْرُ مُحْرِمٍ، فَرَأَى حِمَارًا وَحْشِيًّا فَاسْتَوَى عَلَى فَرَسِهِ، فَسَأَلَ أَصْحَابَهُ أَنْ يُنَاوِلُوهُ سَوْطَهُ فَأَبَوْا، فَسَأَلَهُمْ رُمْحَهُ فَأَبَوْا، فَأَخَذَهُ ثُمَّ شَدَّ عَلَى الْحِمَارِ فَقَتَلَهُ، فَأَكَلَ مِنْهُ بَعْضُ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم، وَأَبَى بَعْضٌ، فَلَمَّا أَدْرَكُوا رَسُولَ اللَّهِ صلى الله عليه وسلم سَأَلُوهُ عَنْ ذَلِكَ قَالَ ‏\"‏ إِنَّمَا هِيَ طُعْمَةٌ أَطْعَمَكُمُوهَا اللَّهُ ‏\"‏‏.‏ وَعَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي قَتَادَةَ فِي الْحِمَارِ الْوَحْشِيِّ مِثْلُ حَدِيثِ أَبِي النَّضْرِ قَالَ ‏\"‏ هَلْ مَعَكُمْ مِنْ لَحْمِهِ شَىْءٌ ‏\"‏‏.‏",
                "headingArabic": "مَا قِيلَ فِي الرِّمَاحِ",
                "headingUrdu": "نیزوں کے بارے میں کیا کہا جاتا ہے۔",
                "headingEnglish": "What is said regarding spears",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2786,
                "hadithNumber": "2915",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) , while in a tent (on the day of the battle of Badr) said, \"O Allah! I ask you the fulfillment of Your Covenant and Promise. O Allah! If You wish (to destroy the believers) You will never be worshipped after today.\" Abu Bakr رضی اللہ عنہ caught him by the hand and said, \"This is sufficient, O Allah's Apostle! You have asked Allah pressingly.\" The Prophet (ﷺ) was clad in his armor at that time. He went out, saying to me: \"There multitude will be put to flight and they will show their backs. Nay, but the Hour is their appointed time (for their full recompense) and that Hour will be more grievous and more bitter (than their worldly failure).\" (54.45-46) Khalid said that was on the day of the battle of Badr.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم ( بدر کے دن ) دعا فرما رہے تھے ، اس وقت آپ صلی اللہ علیہ وسلم ایک خیمہ میں تشریف فرما تھے ، کہ اے اللہ ! میں تیرے عہد اور تیرے وعدے کا واسطہ دے کر فریاد کرتا ہوں ۔ اے اللہ ! اگر تو چاہے تو آج کے بعد تیری عبادت نہ کی جائے گی ۔ اس پر حضرت ابوبکر رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کا ہاتھ پکڑ لیا اور عرض کیا بس کیجئے اے اللہ کے رسول ! آپ صلی اللہ علیہ وسلم نے اپنے رب کے حضور میں دعا کی حد کر دی ہے ۔ آنحضرت اس وقت زرہ پہنے ہوئے تھے ۔ آپ صلی اللہ علیہ وسلم باہر تشریف لائے تو زبان مبارک پر یہ آیت تھی ( ترجمہ ) ” جماعت ( مشرکین ) جلد ہی شکست کھا کر بھاگ جائے گی اور پیٹھ دکھانا اختیار کرے گی اور قیامت کے دن کا ان سے وعدہ ہے اور قیامت کا دن بڑا ہی بھیانک اور تلخ ہو گا “ اور وہیب نے بیان کیا ، ان سے خالد نے بیان کیا کہ بدر کے دن کا ( یہ واقعہ ہے ) ۔",
                "urduNarrator": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے عبدالوہاب ثقفی نے بیان کیا ، کہا ہم سے خالد حذاء نے بیان کیا ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم وَهْوَ فِي قُبَّةٍ ‏\"‏ اللَّهُمَّ إِنِّي أَنْشُدُكَ عَهْدَكَ وَوَعْدَكَ، اللَّهُمَّ إِنْ شِئْتَ لَمْ تُعْبَدْ بَعْدَ الْيَوْمِ ‏\"‏‏.‏ فَأَخَذَ أَبُو بَكْرٍ بِيَدِهِ فَقَالَ حَسْبُكَ يَا رَسُولَ اللَّهِ، فَقَدْ أَلْحَحْتَ عَلَى رَبِّكَ، وَهْوَ فِي الدِّرْعِ، فَخَرَجَ وَهْوَ يَقُولُ ‏{‏سَيُهْزَمُ الْجَمْعُ وَيُوَلُّونَ الدُّبُرَ * بَلِ السَّاعَةُ مَوْعِدُهُمْ وَالسَّاعَةُ أَدْهَى وَأَمَرُّ ‏}‏‏.‏ وَقَالَ وُهَيْبٌ حَدَّثَنَا خَالِدٌ يَوْمَ بَدْرٍ‏.‏",
                "headingArabic": "مَا قِيلَ فِي دِرْعِ النَّبِيِّ صلى الله عليه وسلم وَالْقَمِيصِ فِي الْحَرْبِ",
                "headingUrdu": "نبی صلی اللہ علیہ وسلم کی آری",
                "headingEnglish": "The armour of the Prophet saws",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2787,
                "hadithNumber": "2916",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) died while his (iron) armor was mortgaged to a Jew for thirty Sas of barley. Yala said: A' mash narrated Hadith to us that the armour was made of iron. Moalla said: Abdul Wahid narrated a Hadith it to him and said: He was clad in an iron armour.",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم کی وفات ہوئی تو آپ صلی اللہ علیہ وسلم کی زرہ ایک یہودی کے پاس تیس صاع جو کے بدلے میں رہن رکھی ہوئی تھی ۔ اور یعلیٰ نے بیان کیا کہ ہم سے اعمش نے بیان کیا کہ لوہے کی زرہ ( تھی ) اور معلیٰ نے بیان کیا ، ان سے عبدالواحد نے بیان کیا ، ان سے اعمش نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے لوہے کی ایک زرہ رہن رکھی تھی ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، انہوں نے کہا ہم کو سفیان ثوری نے خبر دی ، انہیں اعمش نے ، انہیں ابراہیم نے ، انہیں اسود نے اور ان سے ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَدِرْعُهُ مَرْهُونَةٌ عِنْدَ يَهُودِيٍّ بِثَلاَثِينَ صَاعًا مِنْ شَعِيرٍ‏.‏ وَقَالَ يَعْلَى حَدَّثَنَا الأَعْمَشُ دِرْعٌ مِنْ حَدِيدٍ‏.‏ وَقَالَ مُعَلًّى حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا الأَعْمَشُ وَقَالَ رَهَنَهُ دِرْعًا مِنْ حَدِيدٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2788,
                "hadithNumber": "2917",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The example of a miser and the one who gives in charity, is like the example of two men wearing iron cloaks so tightly that their arms are raised forcibly towards their collar-bones. So, whenever a charitable person wants to give in charity, his cloak spreads over his body so much so that it wipes out his traces, but whenever the miser wants to give in charity, the rings (of the iron cloak) come closer to each other and press over his body, and his hands gets connected to his collarbones. Abu Huraira رضی اللہ عنہ heard the Prophet (ﷺ) saying. \"The miser then tries to widen it but in vain.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا بخیل ( جو زکوٰۃ نہیں دیتا ) اور زکوٰۃ دینے والے ( سخی ) کی مثال دو آدمیوں جیسی ہے ، دونوں لوہے کے کرتے ( زرہ ) پہنے ہوئے ہیں ، دونوں کے ہاتھ گردن سے بندھے ہوئے ہیں زکوٰۃ دینے والا ( سخی ) جب بھی زکوٰۃ کا ارادہ کرتا ہے تو اس کا کرتہ اتنا کشادہ ہو جاتا ہے کہ زمین پر چلتے میں گھسٹتا جاتا ہے لیکن جب بخیل صدقہ کا ارادہ کرتا ہے تو اس کی زرہ کا ایک ایک حلقہ اس کے بدن پر تنگ ہو جاتا ہے اور اس طرح سکڑ جاتا ہے کہ اس کے ہاتھ اس کی گردن سے جڑ جاتے ہیں ۔ ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم کو یہ فرماتے سنا کہ پھر بخیل اسے ڈھیلا کرنا چاہتا ہے لیکن وہ ڈھیلا نہیں ہوتا ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسمٰعیل نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، کہا ہم سے عبداللہ بن طاوس نے بیان کیا ، ان سے ان کے باپ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَثَلُ الْبَخِيلِ وَالْمُتَصَدِّقِ مَثَلُ رَجُلَيْنِ عَلَيْهِمَا جُبَّتَانِ مِنْ حَدِيدٍ، قَدِ اضْطَرَّتْ أَيْدِيَهُمَا إِلَى تَرَاقِيهِمَا، فَكُلَّمَا هَمَّ الْمُتَصَدِّقُ بِصَدَقَتِهِ اتَّسَعَتْ عَلَيْهِ حَتَّى تُعَفِّيَ أَثَرَهُ، وَكُلَّمَا هَمَّ الْبَخِيلُ بِالصَّدَقَةِ انْقَبَضَتْ كُلُّ حَلْقَةٍ إِلَى صَاحِبَتِهَا وَتَقَلَّصَتْ عَلَيْهِ وَانْضَمَّتْ يَدَاهُ إِلَى تَرَاقِيهِ ‏\"‏‏.‏ فَسَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ فَيَجْتَهِدُ أَنْ يُوَسِّعَهَا فَلاَ تَتَّسِعُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2789,
                "hadithNumber": "2918",
                "englishNarrator": "Narrated Al-Mughira bin Shu`ba رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) went out to answer the call of nature and on his return I brought some water to him. He performed the ablution while he was wearing a Sha'mi cloak. He rinsed his mouth and washed his nose by putting water in it and then blowing it out, and washed his face. Then he tried to take out his hands through his sleeves but they were tight, so he took them out from underneath, washed them and passed wet hands over his head and over his leather socks.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم قضاء حاجت کے لیے تشریف لے گئے ۔ جب آپ صلی اللہ علیہ وسلم واپس ہوئے تو میں پانی لے کر خدمت میں حاضر ہوا ، آپ صلی اللہ علیہ وسلم شامی جبہ پہنے ہوئے تھے ۔ پھر آپ صلی اللہ علیہ وسلم نے کلی کی اور ناک میں پانی ڈالا اور اپنے چہرہ پاک کو دھویا ۔ اس کے بعد ( ہاتھ دھونے کے لیے ) آستین چڑھانے کی کوشش کی لیکن آستین تنگ تھی اس لیے ہاتھوں کو نیچے سے نکالا پھر انہیں دھویا اور سر کا مسح کیا اور دونوں موزوں ہر دو کا بھی مسح کیا ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالواحد نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے ابوالضحیٰ مسلم نے ، جو صبیح کے صاحبزاے ہیں ، ان سے مسروق نے بیان کیا اور ان سے مغیرہ بن شعبہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي الضُّحَى، مُسْلِمٍ ـ هُوَ ابْنُ صُبَيْحٍ ـ عَنْ مَسْرُوقٍ، قَالَ حَدَّثَنِي الْمُغِيرَةُ بْنُ شُعْبَةَ، قَالَ انْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِحَاجَتِهِ ثُمَّ أَقْبَلَ، فَلَقِيتُهُ بِمَاءٍ، وَعَلَيْهِ جُبَّةٌ شَأْمِيَّةٌ، فَمَضْمَضَ وَاسْتَنْشَقَ وَغَسَلَ وَجْهَهُ، فَذَهَبَ يُخْرِجُ يَدَيْهِ مِنْ كُمَّيْهِ فَكَانَا ضَيِّقَيْنِ، فَأَخْرَجَهُمَا مِنْ تَحْتُ، فَغَسَلَهُمَا وَمَسَحَ بِرَأْسِهِ وَعَلَى خُفَّيْهِ‏.‏",
                "headingArabic": "الْجُبَّةِ فِي السَّفَرِ وَالْحَرْبِ",
                "headingUrdu": "سفر اور جنگ میں چادر پہننا",
                "headingEnglish": "The (wearing of a) cloak on journeys and in war",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2790,
                "hadithNumber": "2919",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) allowed `Abdur-Rahman bin `Auf and Az-Zubair رضی اللہ عنہما to wear silken shirts because they had a skin disease causing itching.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے عبدالرحمٰن بن عوف اور زبیر رضی اللہ عنہما کو خارش کے مرض کی وجہ سے ریشمی کرتہ پہننے کی اجازت دے دی تھی ، جو ان دونوں کو لاحق ہو گئی تھی جو اس مرض میں مفید ہے ۔",
                "urduNarrator": "ہم سے احمد بن مقدام نے بیان کیا ، کہا ہم سے خالد بن حارث نے بیان کیا ، کہا ہم سے سعید بن ابی عروبہ نے بیان کیا ، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ الْمِقْدَامِ، حَدَّثَنَا خَالِدٌ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، أَنَّ أَنَسًا، حَدَّثَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَخَّصَ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَالزُّبَيْرِ فِي قَمِيصٍ مِنْ حَرِيرٍ، مِنْ حِكَّةٍ كَانَتْ بِهِمَا‏.‏",
                "headingArabic": "الْحَرِيرِ فِي الْحَرْبِ",
                "headingUrdu": "جنگ میں ریشم کا پہننا",
                "headingEnglish": "The wearing of silk in war",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2791,
                "hadithNumber": "2920",
                "englishNarrator": "Narrated Anas:",
                "hadithEnglish": "`Abdur Rahman bin `Auf and Az-Zubair رضی اللہ عنہما complained to the Prophet, i.e. about the lice (that caused itching) so he allowed them to wear silken clothes. I saw them wearing such clothes in a holy battle.",
                "hadithUrdu": "عبدالرحمٰن بن عوف اور زبیر بن عوام رضی اللہ عنہما نے نبی کریم صلی اللہ علیہ وسلم سے جوؤں کی شکایت کی تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں ریشمی کپڑے کے استعمال کی اجازت دے دی ، پھر میں نے جہاد میں انہیں ریشمی کپڑا پہنے ہوئے دیکھا ۔",
                "urduNarrator": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے ، دوسری سند ہم سے محمد بن سنان نے بیان کیا ان سے قتادۃ نے ان سے انس نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ عَبْدَ، الرَّحْمَنِ بْنَ عَوْفٍ وَالزُّبَيْرَ شَكَوَا إِلَى النَّبِيِّ صلى الله عليه وسلم ـ يَعْنِي الْقَمْلَ ـ فَأَرْخَصَ لَهُمَا فِي الْحَرِيرِ، فَرَأَيْتُهُ عَلَيْهِمَا فِي غَزَاةٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2792,
                "hadithNumber": "2921",
                "englishNarrator": "Narrated Anas  رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) allowed `Abdur-Rahman bin `Auf and Az-Zubair bin Al-`Awwam رضی اللہ عنہما to wear silk.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے عبدالرحمٰن بن عوف اور زبیر بن عوام رضی اللہ عنہما کو ریشمی کپڑے پہننے کی اجازت دے دی تھی ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے شعبہ نے ، انہیں قتادہ نے خبر دی اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، أَخْبَرَنِي قَتَادَةُ، أَنَّ أَنَسًا، حَدَّثَهُمْ قَالَ رَخَّصَ النَّبِيُّ صلى الله عليه وسلم لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَالزُّبَيْرِ بْنِ الْعَوَّامِ فِي حَرِيرٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2793,
                "hadithNumber": "2922",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "(Wearing of silk) was allowed to them (i.e. `AbdurRahman and Az-Zubair) because of the itching they suffered from.",
                "hadithUrdu": "( نبی کریم صلی اللہ علیہ وسلم نے ) رخصت دی تھی یا ( یہ بیان کیا کہ ) رخصت دی گئی تھی ، ان دونوں حضرات کو خارش کی وجہ سے جو ان کو لاحق ہو گئی تھی ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، انہوں نے قتادہ سے سنا اور انہوں نے انس رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، سَمِعْتُ قَتَادَةَ، عَنْ أَنَسٍ، رَخَّصَ أَوْ رُخِّصَ لِحِكَّةٍ بِهِمَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2794,
                "hadithNumber": "2923",
                "englishNarrator": "Narrated Jafar bin Umaiya's father said:",
                "hadithEnglish": "I saw the Prophet (ﷺ) eating of a shoulder (of a sheep) by cutting from it and then he was called to prayer and he prayed without repeating his ablution. There is an addition in Hdrat Abdul Yamam, Shoaib and Zuhri's report: (When he was requested for leading the prayer), he (ﷺ) put down the knife.",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم کو دیکھا کہ آپ صلی اللہ علیہ وسلم شانے کا گوشت ( چھری سے ) کاٹ کر کھا رہے تھے ، پھر نماز کے لیے اذان ہوئی تو آپ صلی اللہ علیہ وسلم نے نماز پڑھی لیکن وضو نہیں کیا ۔ ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی اور انہیں زہری نے ( اس روایت میں ) یہ زیادتی بھی موجود ہے کہ ( جب آپ صلی اللہ علیہ وسلم نماز کے لیے بلائے گئے تو ) آپ صلی اللہ علیہ وسلم نے چھری ڈال دی ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا مجھ سے ابراہیم بن سعد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے جعفر بن عمرو بن امیہ نے اور ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَأْكُلُ مِنْ كَتِفٍ يَحْتَزُّ مِنْهَا، ثُمَّ دُعِيَ إِلَى الصَّلاَةِ فَصَلَّى وَلَمْ يَتَوَضَّأْ‏.‏ حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنِ الزُّهْرِيِّ وَزَادَ فَأَلْقَى السِّكِّينَ‏.‏",
                "headingArabic": "مَا يُذْكَرُ فِي السِّكِّينِ",
                "headingUrdu": "چاقو کے بارے میں کیا کہا جاتا ہے۔",
                "headingEnglish": "What is said about the knife",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2795,
                "hadithNumber": "2924",
                "englishNarrator": "Narrated 'Umair bin Al-Aswad Al-Anasi:",
                "hadithEnglish": "He went to 'Ubada bin As-Samit while he was staying in his house at the sea-shore of Hims with (his wife) Um Haram رضی اللہ عنہا . 'Umair said. Um Haram رضی اللہ عنہا informed us that she heard the Prophet (ﷺ) saying, \"Paradise is granted to the first batch of my followers who will undertake a naval expedition.\" Um Haram رضی اللہ عنہا added, I said, 'O Allah's Messenger (ﷺ)! Will I be amongst them?' He replied, 'You are amongst them.' The Prophet (ﷺ) then said, 'The first army amongst' my followers who will invade Caesar's City will be forgiven their sins.' I asked, 'Will I be one of them, O Allah's Messenger (ﷺ)?' He replied in the negative.\"",
                "hadithUrdu": "وہ عبادہ بن صامت رضی اللہ عنہ کی خدمت میں حاضر ہوئے ۔ آپ کا قیام ساحل حمص پر اپنے ہی ایک مکان میں تھا اور آپ کے ساتھ ( آپ کی بیوی ) ام حرام رضی اللہ عنہا بھی تھیں ۔ عمیر نے بیان کیا کہ ہم سے ام حرام رضی اللہ عنہا نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا تھا کہ میری امت کا سب سے پہلا لشکر جو دریائی سفر کر کے جہاد کے لیے جائے گا ، اس نے ( اپنے لیے اللہ تعالیٰ کی رحمت و مغفرت ) واجب کر لی ۔ ام حرام رضی اللہ عنہا نے بیان کیا کہ میں نے کہا تھا یا رسول اللہ ! کیا میں بھی ان کے ساتھ ہوں گی ؟ آپ نے فرمایا کہ ہاں ، تم بھی ان کے ساتھ ہو گی ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا سب سے پہلا لشکر میری امت کا جو قیصر ( رومیوں کے بادشاہ ) کے شہر ( قسطنطنیہ ) پر چڑھائی کرے گا ان کی مغفرت ہو گی ۔ میں نے کہا میں بھی ان کے ساتھ ہوں گی یا رسول اللہ ! آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ۔",
                "urduNarrator": "ہم سے اسحاق بن یزید دمشقی نے بیان کیا ، کہا ہم سے یحییٰ بن حمزہ نے بیان کیا ، کہا کہ مجھ سے ثوربن یزید نے بیان کیا ، ان سے خالد بن معدان نے اور ان سے عمیر بن اسودعنسی نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ يَزِيدَ الدِّمَشْقِيُّ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، قَالَ حَدَّثَنِي ثَوْرُ بْنُ يَزِيدَ، عَنْ خَالِدِ بْنِ مَعْدَانَ، أَنَّ عُمَيْرَ بْنَ الأَسْوَدِ الْعَنْسِيَّ، حَدَّثَهُ أَنَّهُ، أَتَى عُبَادَةَ بْنَ الصَّامِتِ وَهْوَ نَازِلٌ فِي سَاحِلِ حِمْصَ، وَهْوَ فِي بِنَاءٍ لَهُ وَمَعَهُ أُمُّ حَرَامٍ، قَالَ عُمَيْرٌ فَحَدَّثَتْنَا أُمُّ حَرَامٍ أَنَّهَا سَمِعَتِ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ أَوَّلُ جَيْشٍ مِنْ أُمَّتِي يَغْزُونَ الْبَحْرَ قَدْ أَوْجَبُوا ‏\"‏‏.‏ قَالَتْ أُمُّ حَرَامٍ قُلْتُ يَا رَسُولَ اللَّهِ أَنَا فِيهِمْ‏.‏ قَالَ ‏\"‏ أَنْتِ فِيهِمْ ‏\"‏‏.‏ ثُمَّ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَوَّلُ جَيْشٍ مِنْ أُمَّتِي يَغْزُونَ مَدِينَةَ قَيْصَرَ مَغْفُورٌ لَهُمْ ‏\"‏‏.‏ فَقُلْتُ أَنَا فِيهِمْ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ لاَ ‏\"‏‏.‏",
                "headingArabic": "مَا قِيلَ 8+ \r\n\r\n++++++++++++++++++++++++++\r\n-*+++++++++++++++++-\r\n\r\n+-\r\n\r\n++-\r\n+99** \r\nفِي قِتَالِ الرُّومِ\r\n++5+",
                "headingUrdu": "ار-رم کے خلاف لڑائی (بازنطینی)",
                "headingEnglish": "The fighting against Ar-Rum (the Byzantines)",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2796,
                "hadithNumber": "2925",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"You (i.e. Muslims) will fight with the Jews until some of them will hide behind stones. The stones will (betray them) saying, 'O `Abdullah (i.e. slave of Allah)! There is a Jew hiding behind me; so kill him.'\"",
                "hadithUrdu": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا ( ایک دور آئے گا جب ) تم یہودیوں سے جنگ کرو گے ۔ ( اور وہ شکست کھا کر بھاگتے پھریں گے ) کوئی یہودی اگر پتھر کے پیچھے چھپ جائے گا تو وہ پتھر بھی بول اٹھے گا کہ ” اے اللہ کے بندے ! یہ یہودی میرے پیچھے چھپا بیٹھا ہے اسے قتل کر ڈال ۔ “",
                "urduNarrator": "ہم سے اسحاق بن محمد فروی نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مُحَمَّدٍ الْفَرْوِيُّ، حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ تُقَاتِلُونَ الْيَهُودَ حَتَّى يَخْتَبِيَ أَحَدُهُمْ وَرَاءَ الْحَجَرِ فَيَقُولُ يَا عَبْدَ اللَّهِ هَذَا يَهُودِيٌّ وَرَائِي فَاقْتُلْهُ ‏\"‏‏.‏",
                "headingArabic": "قِتَالِ الْيَهُودِ",
                "headingUrdu": "یہودیوں کے خلاف جنگ",
                "headingEnglish": "Fighting against the Jews",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2797,
                "hadithNumber": "2926",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The Hour will not be established until you fight with the Jews, and the stone behind which a Jew will be hiding will say. \"O Muslim! There is a Jew hiding behind me, so kill him.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا قیامت اس وقت تک قائم نہ ہو گی جب تک یہودی سے تمہاری جنگ نہ ہولے گی اور وہ پتھر بھی اس وقت ( اللہ تعالیٰ کے حکم سے ) بول اٹھیں گے جس کے پیچھے یہودی چھپا ہوا ہو گا کہ اے مسلمان ! یہ یہودی میری آڑ لے کر چھپا ہوا ہے اسے قتل کر ڈالو ۔",
                "urduNarrator": "ہم سے اسحاق بن ابراہیم نے بیان کیا ، کہا کہ ہم کو جریر نے خبر دی عمارہ بن قعقاع سے ، انہیں ابوزرعہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا الْيَهُودَ حَتَّى يَقُولَ الْحَجَرُ وَرَاءَهُ الْيَهُودِيُّ يَا مُسْلِمُ، هَذَا يَهُودِيٌّ وَرَائِي فَاقْتُلْهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2798,
                "hadithNumber": "2927",
                "englishNarrator": "Narrated `Amr bin Taghlib رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"One of the portents of the Hour is that you will fight with people wearing shoes made of hair; and one of the portents of the Hour is that you will fight with broad-faced people whose faces will look like shields coated with leather.\"",
                "hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا کہ قیامت کی نشانیوں میں سے ہے کہ تم ایسی قوم سے جنگ کرو گے جو بالوں کی جوتیاں پہنے ہوں گے ( یا ان کے بال بہت لمبے ہوں گے ) اور قیامت کی ایک نشانی یہ ہے کہ ان لوگوں سے لڑو گے جن کے منہ چوڑے چوڑے ہوں گے گویا ڈھالیں ہیں چمڑا جمی ہوئی ( یعنی بہت موٹے منہ والے ہوں گے ) ۔",
                "urduNarrator": "ہم سے ابوالنعمان نے بیان کیا ، ان سے جریر بن حازم نے بیان کیا ، کہا میں نے حسن سے سنا ، انہوں نے کہا کہ ہم سے عمرو بن تغلب رضی اللہ عنہ نے بیان کیا ، کہا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، قَالَ سَمِعْتُ الْحَسَنَ، يَقُولُ حَدَّثَنَا عَمْرُو بْنُ تَغْلِبَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ تُقَاتِلُوا قَوْمًا يَنْتَعِلُونَ نِعَالَ الشَّعَرِ، وَإِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ تُقَاتِلُوا قَوْمًا عِرَاضَ الْوُجُوهِ، كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطَرَّقَةُ ‏\"‏‏.‏",
                "headingArabic": "قِتَالِ التُّرْكِ",
                "headingUrdu": "ترکوں کے خلاف جنگ",
                "headingEnglish": "Fighting against the Turks",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2799,
                "hadithNumber": "2928",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"The Hour will not be established until you fight with the Turks; people with small eyes, red faces, and flat noses. Their faces will look like shields coated with leather. The Hour will not be established till you fight with people whose shoes are made of hair.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا قیامت اس وقت تک قائم نہیں ہو گی جب تک تم ترکوں سے جنگ نہ کر لو گے ، جن کی آنکھیں چھوٹی ہوں گی ، چہرے سرخ ہوں گے ، ناک موٹی پھیلی ہوئی ہو گی ، ان کے چہرے ایسے ہوں گے جیسے تہ بند چمڑا لگی ہوئی ہوتی ہے اور قیامت اس وقت تک قائم نہ ہو گی جب تک تم ایک ایسی قوم سے جنگ نہ کر لو گے جن کے جوتے بال کے بنے ہوئے ہوں گے ۔",
                "urduNarrator": "ہم سے سعید بن محمد نے بیان کیا ، کہا ہم سے یعقوب بن ابراہیم نے بیان کیا ، کہا مجھ سے میرے باپ ابراہیم بن سعد نے بیان کیا ، ان سے صالح بن کیسان نے ، ان سے اعرج نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَعْقُوبُ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ الأَعْرَجِ، قَالَ قَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا التُّرْكَ صِغَارَ الأَعْيُنِ، حُمْرَ الْوُجُوهِ، ذُلْفَ الأُنُوفِ، كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطَرَّقَةُ، وَلاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا نِعَالُهُمُ الشَّعَرُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2800,
                "hadithNumber": "2929",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The Hour will not be established till you fight with people wearing shoes made of hair. And the Hour will not be established till you fight with people whose faces look like shields coated with leather. \" (Abu Huraira رضی اللہ عنہ added, \"They will be) small-eyed, flat nosed, and their faces will look like shields coated with leather.\")",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا قیامت اس وقت تک قائم نہیں ہو گی جب تک تم ایک ایسی قوم سے لڑائی نہ کر لو گے جن کے جوتے بالوں کے ہوں گے اور قیامت اس وقت تک قائم نہیں ہو گی جب تک تم ایک ایسی قوم سے جنگ نہ کر لو گے جن کے چہرے تہ شدہ ڈھالوں جیسے ہوں گے ۔ سفیان نے بیان کیا کہ اس میں ابوالزناد نے اعرج سے اور انہوں نے ابوہریرہ رضی اللہ عنہ سے یہ زیادہ نقل کیا کہ ان کی آنکھیں چھوٹی ہوں گی ، ناک موٹی ، چہرے ایسے ہوں گے جیسے تہ بتہ چمڑہ لگی ڈھال ہوتی ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے سعید بن مسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ الزُّهْرِيُّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا نِعَالُهُمُ الشَّعَرُ، وَلاَ تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطَرَّقَةُ ‏\"‏‏.‏ قَالَ سُفْيَانُ وَزَادَ فِيهِ أَبُو الزِّنَادِ عَنِ الأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ، رِوَايَةً ‏\"‏ صِغَارَ الأَعْيُنِ، ذُلْفَ الأُنُوفِ، كَأَنَّ وُجُوهَهُمُ الْمَجَانُّ الْمُطْرَقَةُ ‏\"‏‏.‏",
                "headingArabic": "قِتَالِ الَّذِينَ يَنْتَعِلُونَ الشَّعَرَ",
                "headingUrdu": "بالوں سے بنے جوتے پہننے والے لوگوں سے لڑنا",
                "headingEnglish": "Fighting against people wearing shoes made of hair",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2801,
                "hadithNumber": "2930",
                "englishNarrator": "Narrated Al-Bara رضی اللہ عنہ :",
                "hadithEnglish": "\"O Abu '`Umara! Did you all flee on the day (of the battle) of Hunain?\" He replied, \"No, by Allah! Allah's Messenger (ﷺ) did not flee, but his young unarmed companions passed by the archers of the tribe of Hawazin and Bani Nasr whose arrows hardly missed a target, and they threw arrows at them hardly missing a shot. So the Muslims retreated towards the Prophet (ﷺ) while he was riding his white mule which was being led by his cousin Abu Sufyan bin Al-Harith bin `Abdul Muttalib. The Prophet (ﷺ) dismounted and invoked Allah for victory; then he said, 'I am the Prophet, without a lie; I am the son of `Abdul Muttalib, and then he arranged his companions in rows.\"",
                "hadithUrdu": "ابوعمارہ ! کیا آپ لوگوں نے حنین کی لڑائی میں فرار اختیار کیا تھا ؟ براء رضی اللہ عنہ نے کہا نہیں خدا کی قسم ، رسول اللہ صلی اللہ علیہ وسلم نے پشت ہرگز نہیں پھیری تھی ۔ البتہ آپ صلی اللہ علیہ وسلم کے اصحاب میں جو نوجوان تھے بے سروسامان جن کے پاس نہ زرہ تھی ، نہ خود اور کوئی ہتھیار بھی نہیں لے گئے تھے ، انہوں نے ضرور میدان چھوڑ دیا تھا کیونکہ مقابلہ میں ہوازن اور بنو نصر کے بہترین تیرانداز تھے کہ کم ہی ان کا کوئی تیر خطا جاتا ۔ چنانچہ انہوں نے خوب تیر برسائے اور شاید ہی کوئی نشانہ ان کا خطا ہوا ہو ( اس دوران میں مسلمان ) نبی کریم صلی اللہ علیہ وسلم کے پاس آ کر جمع ہو گئے ۔ آپ صلی اللہ علیہ وسلم اپنے سفید خچر پر سوار تھے اور آپ صلی اللہ علیہ وسلم کے چچیرے بھائی ابوسفیان بن حارث ابن عبدالمطلب آپ صلی اللہ علیہ وسلم کی سواری کی لگام تھامے ہوئے تھے ۔ حضور نے سواری سے اتر کر اللہ تعالیٰ سے مدد کی دعا مانگی ۔ پھر فرمایا میں نبی ہوں اس میں غلط بیانی کا کوئی شائبہ نہیں ، میں عبدالمطلب کی اولاد ہوں ۔ اس کے بعد آپ نے اپنے اصحاب کی ( نئے طریقے پر ) صف بندی کی ۔",
                "urduNarrator": "ہم سے عمرو بن خالد نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، ان سے ابواسحاق نے بیان کیا ، کہا کہ میں نے براء بن عازب رضی اللہ عنہ سے سنا ، ان سے ایک صاحب نے پوچھا تھا کہ",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ، وَسَأَلَهُ، رَجُلٌ أَكُنْتُمْ فَرَرْتُمْ يَا أَبَا عُمَارَةَ يَوْمَ حُنَيْنٍ قَالَ لاَ، وَاللَّهِ مَا وَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم، وَلَكِنَّهُ خَرَجَ شُبَّانُ أَصْحَابِهِ وَأَخِفَّاؤُهُمْ حُسَّرًا لَيْسَ بِسِلاَحٍ، فَأَتَوْا قَوْمًا رُمَاةً، جَمْعَ هَوَازِنَ وَبَنِي نَصْرٍ، مَا يَكَادُ يَسْقُطُ لَهُمْ سَهْمٌ، فَرَشَقُوهُمْ رَشْقًا مَا يَكَادُونَ يُخْطِئُونَ، فَأَقْبَلُوا هُنَالِكَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ عَلَى بَغْلَتِهِ الْبَيْضَاءِ، وَابْنُ عَمِّهِ أَبُو سُفْيَانَ بْنُ الْحَارِثِ بْنِ عَبْدِ الْمُطَّلِبِ يَقُودُ بِهِ، فَنَزَلَ وَاسْتَنْصَرَ ثُمَّ قَالَ أَنَا النَّبِيُّ لاَ كَذِبْ أَنَا ابْنُ عَبْدِ الْمُطَّلِبْ ثُمَّ صَفَّ أَصْحَابَهُ‏.‏",
                "headingArabic": "مَنْ صَفَّ أَصْحَابَهُ عِنْدَ الْهَزِيمَةِ وَنَزَلَ عَنْ دَابَّتِهِ، وَاسْتَنْصَرَ",
                "headingUrdu": "جس نے شکست کے وقت اپنے ساتھیوں کا بندوبست کیا اور اپنی سواری سے اتر کر اللہ سے مدد کی درخواست کی۔",
                "headingEnglish": "Whoever arranged his companions at the time of defeat, and got down from his riding animal and requested Allah for help",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2802,
                "hadithNumber": "2931",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "When it was the day of the battle of Al-Ahzab (i.e. the clans), Allah's Messenger (ﷺ) said, \"O Allah! Fill their (i.e. the infidels') houses and graves with fire as they busied us so much that we did not perform the prayer (i.e. `Asr) till the sun set.\"",
                "hadithUrdu": "غزوہ احزاب ( خندق ) کے موقع پر رسول اللہ صلی اللہ علیہ وسلم نے ( مشرکین کو ) یہ بددعا دی کہ اے اللہ ! ان کے گھروں اور قبروں کو آگ سے بھر دے ۔ انہوں نے ہم کو صلوٰۃ وسطیٰ ( عصر کی نماز ) نہیں پڑھنے دی ( یہ آپ نے اس وقت فرمایا ) جب سورج غروب ہو چکا تھا اور عصر کی نماز قضاء ہو گئی تھی ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو عیسیٰ نے خبر دی ، کہا ہم سے ہشام نے بیان کیا ، ان سے محمد نے ، ان سے عبیدہ نے اور ان سے علی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا عِيسَى، حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ عَبِيدَةَ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ لَمَّا كَانَ يَوْمُ الأَحْزَابِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَلأَ اللَّهُ بُيُوتَهُمْ وَقُبُورَهُمْ نَارًا، شَغَلُونَا عَنِ الصَّلاَةِ الْوُسْطَى حِينَ غَابَتِ الشَّمْسُ ‏\"‏‏.‏",
                "headingArabic": "الدُّعَاءِ عَلَى الْمُشْرِكِينَ بِالْهَزِيمَةِ وَالزَّلْزَلَةِ",
                "headingUrdu": "مشرکین کو شکست دینے اور ہلانے کے لیے اللہ سے دعا کرنا",
                "headingEnglish": "To invoke Allah to defeat and shake Al-Mushrikun",
                "chapterId": "57",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 57,
                    "chapterNumber": "57",
                    "chapterEnglish": "Fighting for the Cause of Allah (Jihaad)",
                    "chapterUrdu": "جہاد کا بیان",
                    "chapterArabic": "كتاب الجهاد والسير",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 2776,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=111",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=109",
                "label": "109",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=110",
                "label": "110",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=111",
                "label": "111",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=112",
                "label": "112",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=113",
                "label": "113",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=114",
                "label": "114",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=115",
                "label": "115",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=113",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=113",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=111",
        "to": 2800,
        "total": 40465
    }
}