{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 106,
        "data": [
            {
                "id": 2628,
                "hadithNumber": "2751",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"All of you are guardians and responsible for your charges: the Ruler (i.e. Imam) is a guardian and responsible for his subjects; and a man is a guardian of his family and is responsible for his charges; and a lady is a guardian in the house of her husband and is responsible for her charge; and a servant is a guardian of the property of his master and is responsible for his charge.\" I think he also said, \"And a man is a guardian of the property of his father.\"",
                "hadithUrdu": "میں نے آنحضرت صلی اللہ علیہ وسلم سے سنا ‘ آپ صلی اللہ علیہ وسلم فرماتے تھے تم میں سے ہر کوئی نگہبان ہے اور اپنی رعیت کے بارے میں پوچھا جائے گا ۔ حاکم بھی نگہبان ہے اپنی رعیت کے بارے میں پوچھا جائےگا اور مرد اپنے گھر والوں کا نگہبان ہے اور اپنی رعیت کے بارے میں پوچھا جائے گا اور عورت اپنے خاوند کے گھر کی نگہبان ہے اپنی رعیت کے بارے میں پوچھی جائے گی اور غلام اپنے صاحب کے مال کا نگہبان ہے اور اپنی رعیت کے بارے میں پوچھا جائے گا ۔ ابن عمر رضی اللہ عنہما نے کہا کہ میں سمجھتا ہوں آپ نے یہ بھی فرمایا کہ مرد اپنے باپ کے مال کا نگہبان ہے اور اپنی رعیت کے بارے میں پوچھا جائے گا ۔",
                "urduNarrator": "ہم سے بشربن محمد نے بیان کیا ‘ کہا ہم کو عبداللہ بن مبارک نے خبر دی کہا ہم کو یونس نے ، انہوں نے زہری سے ‘ انہوں نے کہا مجھ کو سالم نے خبر دی ‘ انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ السَّخْتِيَانِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ كُلُّكُمْ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالإِمَامُ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالرَّجُلُ رَاعٍ فِي أَهْلِهِ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالْمَرْأَةُ فِي بَيْتِ زَوْجِهَا رَاعِيَةٌ وَمَسْئُولَةٌ عَنْ رَعِيَّتِهَا، وَالْخَادِمُ فِي مَالِ سَيِّدِهِ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏ قَالَ وَحَسِبْتُ أَنْ قَدْ قَالَ ‏\"‏ وَالرَّجُلُ رَاعٍ فِي مَالِ أَبِيهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2629,
                "hadithNumber": "2752",
                "englishNarrator": "Narrated Anas  رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said to Abu Talha, \"I recommend that you divide (this garden) amongst your relatives.\" Abu Talha said, \"O Allah's Messenger (ﷺ)! I will do the same.\" So Abu Talha divided it among his relatives and cousins. Ibn 'Abbes رضی اللہ عنہما said, \"When the Qur'anic Verse: \"Warn your nearest kinsmen.\" (26.214) Was revealed, the Prophet (ﷺ) started calling the various big families of Quraish, \"O Bani Fihr! O Bani Adi!\". Abu Huraira رضی اللہ عنہ said, \"When the Verse: \"Warn your nearest kinsmen\" was revealed, the Prophet (ﷺ) said (in a loud voice), \"O people of Quraish!\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے ابوطلحہ سے فرمایا ( جب انہوں نے اپنا باغ بیرحاء اللہ کی راہ میں دینا چاہا ) میں مناسب سمجھتا ہوں تو یہ باغ اپنے عزیزوں کو دیدے ۔ ابوطلحہ نے کہا بہت خوب ایسا ہی کروں گا ۔ پھر ابوطلحہ نے وہ باغ اپنے عزیزوں اور چچا کے بیٹوں میں تقسیم کر دیا اور ابن عباس رضی اللہ عنہما نے کہا جب ( سورۃ الشعراء کی ) یہ آیت اتری اور اپنے قریب کے ناطے والوں کو ( خدا کے عذاب سے ) ڈرا تو آنحضرت صلی اللہ علیہ وسلم قریش کے خاندانوں بنی فہر ‘ بنی عدی کو پکار نے لگے ( ان کو ڈرایا ) اور ابوہریرہ رضی اللہ عنہ نے کہا جب یہ آیت اتری » وانذر عشیر تک الاقربین « آنحضرت صلی اللہ علیہ وسلم نے فرمایا اے قریش کے لوگو ! ( اللہ سے ڈرو ) ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ کہا ہم کو امام مالک نے خبر دی ‘ انہوں نے اسحاق بن عبداللہ بن ابی طلحہ سے ، انہوں نے انس رضی اللہ عنہ سے سنا ‘ انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسًا ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لأَبِي طَلْحَةَ ‏\"‏ أَرَى أَنْ تَجْعَلَهَا فِي الأَقْرَبِينَ ‏\"‏‏.‏ قَالَ أَبُو طَلْحَةَ أَفْعَلُ يَا رَسُولَ اللَّهِ‏.‏ فَقَسَمَهَا أَبُو طَلْحَةَ فِي أَقَارِبِهِ وَبَنِي عَمِّهِ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ لَمَّا نَزَلَتْ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}‏ جَعَلَ النَّبِيُّ صلى الله عليه وسلم يُنَادِي ‏\"‏ يَا بَنِي فِهْرٍ، يَا بَنِي عَدِيٍّ ‏\"‏‏.‏ لِبُطُونِ قُرَيْشٍ‏.‏ وَقَالَ أَبُو هُرَيْرَةَ لَمَّا نَزَلَتْ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ يَا مَعْشَرَ قُرَيْشٍ ‏\"‏‏.‏",
                "headingArabic": "إِذَا وَقَفَ أَوْ أَوْصَى لأَقَارِبِهِ وَمَنِ الأَقَارِبُ",
                "headingUrdu": "اگر کسی کو وصیت کے ذریعے اپنے رشتہ داروں کو کوئی وقف ملے (یا وصیت کرے)",
                "headingEnglish": "If somebody founds an endowment (or bequeathes) his relatives by a will",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2630,
                "hadithNumber": "2753",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "When Allah revealed the Verse: \"Warn your nearest kinsmen,\" Allah's Messenger (ﷺ) got up and said, \"O people of Quraish (or said similar words)! Buy (i.e. save) yourselves (from the Hellfire) as I cannot save you from Allah's Punishment; O Bani `Abd Manaf! I cannot save you from Allah's Punishment, O Safiya, the Aunt of Allah's Messenger (ﷺ)! I cannot save you from Allah's Punishment; O Fatima bint Muhammad! Ask me anything from my wealth, but I cannot save you from Allah's Punishment.\" Asbagh corroborated him from Ibn-e-Shihab.",
                "hadithUrdu": "جب ( سورۃ الشعراء کی ) یہ آیت اللہ تعالیٰ نے اتاری اور اپنے نزدیک ناطے والوں کو اللہ کے عذاب سے ڈرا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا قریش کے لوگو ! یا ایسا ہی کوئی اور کلمہ تم لوگ اپنی اپنی جانوں کو ( نیک اعمال کے بدل ) مول لے لو ( بچا لو ) میں اللہ کے سامنے تمہارے کچھ کام نہیں آؤں گا ( یعنی اس کی مرضی کے خلاف میں کچھ نہیں کر سکوں گا ) عبد مناف کے بیٹو ! میں اللہ کے سامنے تمہارے کچھ کام نہیں آؤں گا ۔ عباس عبدالمطلب کے بیٹے ! میں اللہ کے سامنے تمہارے کچھ کام نہیں آؤں گا ۔ صفیہ میری پھوپھی ! اللہ کے سامنے تمہارے کچھ کام نہیں آؤں گا ۔ فاطمہ رضی اللہ عنہا بیٹی تو چاہے میرا مال مانگ لے لیکن اللہ کے سامنے تیرے کچھ کام نہیں آؤں گا ۔ ابو الیمان کے ساتھ حدیث کو اصبغ نے بھی عبداللہ بن وہب سے ‘ انہوں نے یونس سے ‘ انہوں نے ابن شہاب سے روایت کیا ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ‘ انہوں نے زہری سے ‘ کہا مجھ کو سعید بن مسیب اورابوسلمہ بن عبدالرحمٰن نے خبر دی کہ ابوہریرہ رضی اللہ عنہ نے کہا ابوہریرہ رضی اللہ عنہ نے کہا",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ ‏}‏ قَالَ ‏\"‏ يَا مَعْشَرَ قُرَيْشٍ ـ أَوْ كَلِمَةً نَحْوَهَا ـ اشْتَرُوا أَنْفُسَكُمْ، لاَ أُغْنِي عَنْكُمْ مِنَ اللَّهِ شَيْئًا، يَا بَنِي عَبْدِ مَنَافٍ لاَ أُغْنِي عَنْكُمْ مِنَ اللَّهِ شَيْئًا، يَا عَبَّاسُ بْنَ عَبْدِ الْمُطَّلِبِ لاَ أُغْنِي عَنْكَ مِنَ اللَّهِ شَيْئًا، وَيَا صَفِيَّةُ عَمَّةَ رَسُولِ اللَّهِ لاَ أُغْنِي عَنْكِ مِنَ اللَّهِ شَيْئًا، وَيَا فَاطِمَةُ بِنْتَ مُحَمَّدٍ سَلِينِي مَا شِئْتِ مِنْ مَالِي لاَ أُغْنِي عَنْكِ مِنَ اللَّهِ شَيْئًا ‏\"‏‏.‏ تَابَعَهُ أَصْبَغُ عَنِ ابْنِ وَهْبٍ عَنْ يُونُسَ عَنِ ابْنِ شِهَابٍ‏.‏",
                "headingArabic": "هَلْ يَدْخُلُ النِّسَاءُ وَالْوَلَدُ فِي الأَقَارِبِ",
                "headingUrdu": "کیا بچے اور عورتیں رشتہ داروں کی اصطلاح میں شامل ہیں (وصیت سے متعلق)",
                "headingEnglish": "Are children and women included under the term of relatives (concerning wills)",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2631,
                "hadithNumber": "2754",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) saw a man driving a Badana (i.e. camel for sacrifice) and said to him, \"Ride on it.\" The man said, \"O Allah's Messenger (ﷺ)! It is a Bandana.\" (The Prophet (ﷺ) repeated his order) and on the third or fourth time he said, \"Ride it, (woe to you\" or said: \"May Allah be merciful to you).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے دیکھا کہ ایک شخص قربانی کا اونٹ ہانکے لئے جا رہا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس سے فرمایا کہ اس پر سوار ہو جا ۔ اس صاحب نے کہا کہ یا رسول اللہ ! یہ قربانی کا اونٹ ہے ۔ آپ صلی اللہ علیہ وسلم نے تیسری یا چوتھی بار فرمایا افسوس ! سوار بھی ہو جا ( یا آپ نے ویلک کی بجائےویحک فرمایا جس کے معنی بھی وہی ہیں ) ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے ابو عوانہ نے بیان کیا ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى رَجُلاً يَسُوقُ بَدَنَةً، فَقَالَ لَهُ ‏\"‏ ارْكَبْهَا ‏\"‏‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهَا بَدَنَةٌ‏.‏ قَالَ فِي الثَّالِثَةِ أَوِ الرَّابِعَةِ ‏\"‏ ارْكَبْهَا، وَيْلَكَ، أَوْ وَيْحَكَ ‏\"‏‏.‏",
                "headingArabic": "هَلْ يَنْتَفِعُ الْوَاقِفُ بِوَقْفِهِ",
                "headingUrdu": "کیا اوقاف کا بانی اپنی عطا سے فائدہ اٹھا سکتا ہے؟",
                "headingEnglish": "Can the founder of an endowment have the benefit of his endowment?",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2632,
                "hadithNumber": "2755",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) saw a man driving a Badana and said to him, \"Ride on it,\" and on the second or the third time he added, \"Woe to you.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے دیکھا کہ ایک صاحب قربانی کا اونٹ ہانکے لئے جا رہے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس پر سوار ہو جا لیکن انہوں نے معذرت کی کہ یا رسول اللہ ! یہ تو قربانی کا ہے ۔ آپ صلی اللہ علیہ وسلم نے پھر فرمایا کہ سوار بھی ہو جا ۔ افسوس ! یہ کلمہ آپ صلی اللہ علیہ وسلم نے تیسری یا چوتھی مرتبہ فرمایا تھا ۔",
                "urduNarrator": "ہم سے اسمٰعیل بن ابی اویس نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے ابوالزناد نے ، ان نے اعرج سے اور ان ابو ھریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى رَجُلاً يَسُوقُ بَدَنَةً، فَقَالَ ‏\"‏ ارْكَبْهَا ‏\"‏‏.‏ قَالَ يَا رَسُولَ اللَّهِ إِنَّهَا بَدَنَةٌ‏.‏ قَالَ ‏\"‏ ارْكَبْهَا، وَيْلَكَ ‏\"‏‏.‏ فِي الثَّانِيَةِ أَوْ فِي الثَّالِثَةِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2633,
                "hadithNumber": "2756",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The mother of Sa`d bin 'Ubada رضی اللہ عنہ died in his absence. He said, \"O Allah's Messenger (ﷺ)! My mother died in my absence; will it be of any benefit for her if I give Sadaqa on her behalf?\" The Prophet (ﷺ) said, \"Yes,\" Sa`d said, \"I make you a witness that I gave my garden called Al Makhraf in charity on her behalf.\"",
                "hadithUrdu": "سعد بن عبادہ رضی اللہ عنہ کی ماں عمرہ بنت مسعود کا انتقال ہوا تو وہ ان کی خدمت میں موجود نہیں تھے ۔ انہوں نے آ کر رسول اللہ صلی اللہ علیہ وسلم سے پوچھا یا رسول اللہ ! میری والدہ کا جب انتقال ہوا تو میں ان کی خدمت میں حاضر نہیں تھا ۔ کیا اگر میں کوئی چیز صدقہ کروں تو اس سے انہیں فائدہ پہنچ سکتا ہے ؟ آپ صلی اللہ علیہ وسلم نے اثبات میں جواب دیا تو انہوں نے کہا کہ میں آپ کو گواہ بناتا ہوں کہ میرا مخراف نامی باغ ان کی طرف سے صدقہ ہے ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو مخلد بن یزید نے خبر دی ، انہیں ابن جریج نے خبر دی ، کہا کہ مجھے یعلیٰ بن مسلم نے خبر دی ، انہوں نے عکرمہ سے سنا ، وہ بیان کرتے تھے کہ ہمیں ابن عباس رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا مَخْلَدُ بْنُ يَزِيدَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي يَعْلَى، أَنَّهُ سَمِعَ عِكْرِمَةَ، يَقُولُ أَنْبَأَنَا ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ سَعْدَ بْنَ عُبَادَةَ ـ رضى الله عنه ـ تُوُفِّيَتْ أُمُّهُ وَهْوَ غَائِبٌ عَنْهَا، فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي تُوُفِّيَتْ وَأَنَا غَائِبٌ عَنْهَا، أَيَنْفَعُهَا شَىْءٌ إِنْ تَصَدَّقْتُ بِهِ عَنْهَا قَالَ ‏ \"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَإِنِّي أُشْهِدُكَ أَنَّ حَائِطِي الْمِخْرَافَ صَدَقَةٌ عَلَيْهَا‏.‏",
                "headingArabic": "إِذَا قَالَ أَرْضِي أَوْ بُسْتَانِي صَدَقَةٌ عَنْ أُمِّي. فَهُوَ جَائِزٌ، وَإِنْ لَمْ يُبَيِّنْ لِمَنْ ذَلِكَ",
                "headingUrdu": "اگر کوئی کہے کہ میری زمین میری ماں کی طرف سے اللہ کی حفاظت کے لیے صدقہ ہے۔",
                "headingEnglish": "If someone says, \"My land is Sadaqa for Allah's safe on my mother's behalf,\"",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2634,
                "hadithNumber": "2757",
                "englishNarrator": "Narrated Ka`b bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "I said, \"O Allah's Messenger (ﷺ)! For the acceptance of my repentance I wish to give all my property in charity for Allah's sake through His Apostle .\" He said, \"It is better for you to keep some of the property for yourself.\" I said, \"Then I will keep my share in Khaibar.\"",
                "hadithUrdu": "میں نے عرض کیا یا رسول اللہ ! میری توبہ ( غزوہ تبوک میں نہ جانے کی ) قبول ہونے کا شکرانہ یہ ہے کہ میں اپنا مال اللہ اور اس کے رسول صلی اللہ علیہ وسلم کے راستے میں دیدوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر اپنے مال کا ایک حصہ اپنے پاس ہی باقی رکھو تو تمہارے حق میں یہ بہتر ہے ۔ میں نے عرض کیا کہ پھر میں اپنا خیبر کا حصہ اپنے پاس محفوظ رکھتا ہوں ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث نے بیان کیا ‘ ان سے عقیل نے ‘ ان سے ابن شہاب نے کہا کہ مجھے عبدالرحمٰن ابن عبداللہ بن کعب نے خبر دی اور ان سے عبداللہ بن کعب نے بیان کیا کہ میں نے کعب بن مالک رضی اللہ عنہ سے سنا ‘ وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبٍ، أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ، قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ ـ رضى الله عنه‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ صلى الله عليه وسلم‏.‏ قَالَ ‏ \"‏ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَ ‏\"‏‏.‏ قُلْتُ فَإِنِّي أُمْسِكُ سَهْمِي الَّذِي بِخَيْبَرَ‏.‏",
                "headingArabic": "إِذَا تَصَدَّقَ أَوْ أَوْقَفَ بَعْضَ مَالِهِ أَوْ بَعْضَ رَقِيقِهِ أَوْ دَوَابِّهِ، فَهُوَ جَائِزٌ",
                "headingUrdu": "مال یا غلاموں یا جانوروں کا کچھ حصہ صدقہ یا وقف کے طور پر دینا",
                "headingEnglish": "To give part of wealth or slaves or animals in charity or as an endowment",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2635,
                "hadithNumber": "2758",
                "englishNarrator": "Narrated Anas (رضی اللہ عنہ):",
                "hadithEnglish": "When the Holy Verse: 'By no means shall you attain Al-Birr (piety, righteousness, it means here Allah's Reward i.e., Paradise), unless you spend of that which you love..', (V 3:92) was revealed, Abu Talha رضی اللہ عنہ went to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger ! Allah, the Blessed, the Superior stated in His book: 'By no means shall you attain Birr, unless you spend of that which you love....' (V 3:92) and the most beloved property to me is Bairuha' (which was a garden where Allah's Messenger (ﷺ) used to go to sit in its shade and drink from its water). I gave it to the Allah and His Messenger (ﷺ) hoping for Allah's Reward in the Hereafter. So, Ao Allah's Messenger ! Use it as Allah orders you to use it.\" Allah's Messenger (ﷺ) said, \"Bravo! O Abu Talha, it is fruitful property. We have accepted it from you and now we return it to you. Distribute it amongst you relatives.\" So, Abu Talha رضی اللہ عنہ distributed it amongst his relatives, amongst whom were Ubai and Hassan رضی اللہ عنہ . When Hassan رضی اللہ عنہ sold his share of that garden to Mu'awiyya رضی اللہ عنہ  , he was asked, \"How do you see Abu Talha's Sadaqa?\" He replied, \"Who should not I sell a Sa' of date for Sa' of money ?\" The garden was situated on the courtyard of the palace of Bani Jadila built by Mu'awiya رضی اللہ عنہ .",
                "hadithUrdu": "( جب سورۃ آل عمران کی ) یہ آیت نازل ہوئی کہ ” تم نیکی ہرگز نہیں پا سکتے جب تک اس مال میں سے خرچ نہ کرو جو تم کو زیادہ پسند ہے “ تو ابوطلحہ رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا یا رسول اللہ صلی اللہ علیہ وسلم ! اللہ تبارک و تعالیٰ اپنی کتاب میں فرماتا ہے کہ ” تم نیکی ہرگز نہیں پا سکتے جب تک اس مال میں سے خرچ نہ کرو جو تم کو زیادہ پسند ہے اور میرے اموال میں سب سے پسند مجھے بیرحاء ہے ۔ بیان کیا کہ بیرحاء ایک باغ تھا ۔ رسول اللہ صلی اللہ علیہ وسلم بھی اس میں تشریف لے جایا کرتے ‘ اس کے سائے میں بیٹھتے اور اس کا پانی پیتے ( ابوطلحہ نے کہا کہ ) اس لئے وہ اللہ عزوجل کی راہ میں صدقہ اور رسول اللہ صلی اللہ علیہ وسلم کے لئے ہے ۔ میں اس کی نیکی اور اس کے ذخیرہ آخرت ہونے کی امید رکھتا ہوں ۔ پس یا رسول اللہ ! جس طرح اللہ آپ کو بتائے اسے خرچ کیجئے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا واہ واہ شاباش ابوطلحہ یہ تو بڑا نفع بخش مال ہے ‘ ہم تم سے اسے قبول کر کے پھر تمہارے ہی حوالے کر دیتے ہیں اور اب تم اسے اپنے عزیزوں کو دیدو ۔ چنانچہ ابوطلحہ رضی اللہ عنہ نے وہ باغ اپنے عزیزوں کو دے دیا ۔ انس رضی اللہ عنہ نے بیان کیا کہ جن لوگوں کو باغ آپ نے دیا تھا ان میں ابی اور حسان رضی اللہ عنہ تھے ۔ انہوں نے بیان کیا کہ حسان رضی اللہ عنہ نے اپنا حصہ معاویہ رضی اللہ عنہ کو بیچ دیا تو کسی نے ان سے کہا کہ کیا آپ ابوطلحہ رضی اللہ عنہ کا دیا ہوا مال بیچ رہے ہو ؟ حسان رضی اللہ عنہ نے جواب دیا کہ میں کھجور کا ایک صاع روپوں کے ایک صاع کے بدل کیوں نہ بیچوں ۔ انس رضی اللہ عنہ نے کہا یہ باغ بنی حدیلہ کے محلہ کے قریب تھا جسے معاویہ رضی اللہ عنہ نے ( بطور قلعہ کے ) تعمیر کیا تھا ۔",
                "urduNarrator": "اور اسماعیل بن جعفر نے بیان کیا کہ مجھے عبدالعزیز بن عبداللہ بن ابی سلمہ نے خبر دی ‘ انہیں اسحاق بن عبداللہ بن ابی طلحہ نے ( امام بخاری رحمہ اللہ نے کہا کہ ) میں سمجھتا ہوں کہ یہ روایت انہوں نے انس رضی اللہ عنہ سے کی ہے کہ انہوں نے بیان کیا",
                "hadithArabic": "وَقَالَ إِسْمَاعِيلُ أَخْبَرَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ،، لاَ أَعْلَمُهُ إِلاَّ عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتْ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ جَاءَ أَبُو طَلْحَةَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ يَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى فِي كِتَابِهِ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ وَإِنَّ أَحَبَّ أَمْوَالِي إِلَىَّ بِيرُحَاءَ ـ قَالَ وَكَانَتْ حَدِيقَةً كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْخُلُهَا وَيَسْتَظِلُّ بِهَا وَيَشْرَبُ مِنْ مَائِهَا ـ فَهِيَ إِلَى اللَّهِ عَزَّ وَجَلَّ وَإِلَى رَسُولِهِ صلى الله عليه وسلم أَرْجُو بِرَّهُ وَذُخْرَهُ، فَضَعْهَا أَىْ رَسُولَ اللَّهِ حَيْثُ أَرَاكَ اللَّهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَخْ يَا أَبَا طَلْحَةَ، ذَلِكَ مَالٌ رَابِحٌ، قَبِلْنَاهُ مِنْكَ وَرَدَدْنَاهُ عَلَيْكَ، فَاجْعَلْهُ فِي الأَقْرَبِينَ ‏\"‏‏.‏ فَتَصَدَّقَ بِهِ أَبُو طَلْحَةَ عَلَى ذَوِي رَحِمِهِ، قَالَ وَكَانَ مِنْهُمْ أُبَىٌّ وَحَسَّانُ، قَالَ وَبَاعَ حَسَّانُ حِصَّتَهُ مِنْهُ مِنْ مُعَاوِيَةَ، فَقِيلَ لَهُ تَبِيعُ صَدَقَةَ أَبِي طَلْحَةَ فَقَالَ أَلاَ أَبِيعُ صَاعًا مِنْ تَمْرٍ بِصَاعٍ مِنْ دَرَاهِمَ قَالَ وَكَانَتْ تِلْكَ الْحَدِيقَةُ فِي مَوْضِعِ قَصْرِ بَنِي حُدَيْلَةَ الَّذِي بَنَاهُ مُعَاوِيَةُ‏.‏",
                "headingArabic": "مَنْ تَصَدَّقَ إِلَى وَكِيلِهِ ثُمَّ رَدَّ الْوَكِيلُ إِلَيْهِ",
                "headingUrdu": "جس نے اپنے نمائندے کو صدقہ کرنے کے لیے کچھ دیا اور اسے واپس کر دیا۔",
                "headingEnglish": "Whoever gave something to his representative to give in charity and then the latter returned it to him",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2636,
                "hadithNumber": "2759",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Some people claim that the order in the above Verse is cancelled, by Allah, it is not cancelled, but the people have stopped acting on it. There are two kinds of guardians (who are in charge of the inheritance): One is that who inherits; such a person should give (of what he inherits to the relatives, the orphans and the needy, etc.), the other is that who does not inherit (e.g. the guardian of the orphans): such a person should speak kindly and say (to those who are present at the time of distribution), \"I can not give it to you (as the wealth belongs to the orphans).",
                "hadithUrdu": "کچھ لوگ گمان کرنے لگے ہیں کہ یہ آیت ( جس ذکر عنوان میں ہوا ) میراث کی آیت منسوخ ہو گئی ہے ‘ نہیں قسم اللہ کی آیت منسوخ نہیں ہوئی البتہ لوگ اس پر عمل کرنے میں سست ہو گئے ہیں ۔ ترکے کے لینے والے دو طرح کے ہوتے ہیں ایک وہ جو وارث ہوں ان کو حصہ دیا جائے گا دوسرے وہ جو واچٹ نہ ہوں ان کو نرمی سے جواب دینے کا حکم ہے ۔ وہ یوں کہے میاں میں تم کو دینے کا اختیار نہیں رکھتا ۔",
                "urduNarrator": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا ‘ کہا ہم سے ابو عوانہ نے بیان کیا ابو بشر جعفر سے ‘ ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے فرمایا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ أَبُو النُّعْمَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ إِنَّ نَاسًا يَزْعُمُونَ أَنَّ هَذِهِ الآيَةَ نُسِخَتْ، وَلاَ وَاللَّهِ مَا نُسِخَتْ، وَلَكِنَّهَا مِمَّا تَهَاوَنَ النَّاسُ، هُمَا وَالِيَانِ وَالٍ يَرِثُ، وَذَاكَ الَّذِي يَرْزُقُ، وَوَالٍ لاَ يَرِثُ، فَذَاكَ الَّذِي يَقُولُ بِالْمَعْرُوفِ، يَقُولُ لاَ أَمْلِكُ لَكَ أَنْ أُعْطِيَكَ‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَإِذَا حَضَرَ الْقِسْمَةَ أُولُو الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينُ فَارْزُقُوهُمْ مِنْهُ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور جب رشتہ دار اور یتیم اور مساکین تقسیم کے وقت موجود ہوں‘‘۔",
                "headingEnglish": "The Statement of Allah Taa'la: \"And when the relatives and the orphans and Al-Masakin are present at the time of division...\"",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2637,
                "hadithNumber": "2760",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "A man said to the Prophet, \"My mother died suddenly, and I think that if she could speak, she would have given in charity. May I give in charity on her behalf?\" He said, \"Yes! Give in charity on her behalf.\"",
                "hadithUrdu": "ایک صحابی ( سعد بن عبادہ ) نے رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ میری والدہ کی موت اچانک واقع ہو گئی ‘ میرا خیال ہے کہ اگر انہیں گفتگو کا موقع ملتا تو وہ صدقہ کرتیں تو کیا میں ان کی طرف سے خیرات کر سکتا ہوں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ہاں ان کی طرف سے خیرات کر ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا کہ مجھ سے امام مالک نے بیان کیا ‘ ان سے ہشام نے ‘ ان سے ان کے باپ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، رضى الله عنها أَنَّ رَجُلاً، قَالَ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّ أُمِّي افْتُلِتَتْ نَفْسَهَا، وَأُرَاهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ، أَفَأَتَصَدَّقُ عَنْهَا قَالَ ‏ \"‏ نَعَمْ، تَصَدَّقْ عَنْهَا ‏\"‏‏.‏",
                "headingArabic": "مَا يُسْتَحَبُّ لِمَنْ يُتَوَفَّى فَجْأَةً أَنْ يَتَصَدَّقُوا عَنْهُ، وَقَضَاءِ النُّذُورِ عَنِ الْمَيِّتِ",
                "headingUrdu": "اس شخص کی طرف سے صدقہ جو اچانک فوت ہو جائے۔ اور نذروں کی تعمیل۔",
                "headingEnglish": "Charity on behalf of a person who dies suddenly. And the execution of the vows.",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2638,
                "hadithNumber": "2761",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "Sa`d bin Ubada رضی اللہ عنہ  consulted Allah's Messenger (ﷺ) saying, \"My mother died and she had an unfulfilled vow.\" The Prophet (ﷺ) said, \"Fulfill it on her behalf.\"",
                "hadithUrdu": "سعد بن عبادہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے مسئلہ پوچھا ‘ انہوں نے عرض کیا کہ میری ماں کا انتقال ہو گیا ہے اور اس کے ذمہ ایک نذر تھی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان کی طرف سے نذر پوری کر دے ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ‘ کہا کہ ہم کو امام مالک نے خبر دی ابن شہاب سے ‘ انہیں عبیداللہ بن عبداللہ نے اور انہیں ابن عباس رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ سَعْدَ بْنَ عُبَادَةَ ـ رضى الله عنه ـ اسْتَفْتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا نَذْرٌ‏.‏ فَقَالَ ‏ \"‏ اقْضِهِ عَنْهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2639,
                "hadithNumber": "2762",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "That the mother of Sa`d bin Ubada رضی اللہ عنہ the brother of Bani Saida died in Sa`d's absence, so he came to the Prophet saying, \"O Allah's Messenger (ﷺ)! My mother died in my absence, will it benefit her if I give in charity on her behalf?\" The Prophet (ﷺ) said, \"Yes.\" Sa`d رضی اللہ عنہ said, \"I take you as my witness that I give my garden Al-Makhraf in charity on her behalf.\"",
                "hadithUrdu": "قبیلہ بنی ساعدہ کے بھائی سعد بن عبادہ رضی اللہ عنہ کی ماں کا انتقال ہوا تو وہ ان کی خدمت میں حاضر نہیں تھے ( بلکہ رسول اللہ کے ساتھ غزوہ دومۃ الجندل میں شریک تھے ) اس لئے وہ آنحضرت صلی اللہ علیہ وسلم کے پاس آئے اور عرض کیا یا رسول اللہ ! میری والدہ کا انتقال ہو گیا ہے اور میں اس وقت موجود نہیں تھا تو اگر میں ان کی طرف سے خیرات کروں تو انہیں اس کا فائدہ پہنچے گا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ! سعد رضی اللہ عنہ نے اس پر کہا کہ میں آپ کو گواہ بناتا ہوں کہ میرا باغ مخراف نامی ان کی طرف سے خیرات ہے ۔",
                "urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ‘ کہا کہ ہم کو ہشام بن یوسف نے خبر دی ‘ انہیں ابن جریج نے خبر دی کہا کہ مجھے یعلیٰ بن مسلم نے خبر دی ‘ انہوں نے ابن عباس رضی اللہ عنہما کے غلام عکرمہ سے سنا اور انہیں ابن ابن عباس رضی اللہ عنہما نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي يَعْلَى، أَنَّهُ سَمِعَ عِكْرِمَةَ، مَوْلَى ابْنِ عَبَّاسٍ يَقُولُ أَنْبَأَنَا ابْنُ عَبَّاسٍ، أَنَّ سَعْدَ بْنَ عُبَادَةَ ـ رضى الله عنهم ـ أَخَا بَنِي سَاعِدَةَ تُوُفِّيَتْ أُمُّهُ وَهْوَ غَائِبٌ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي تُوُفِّيَتْ وَأَنَا غَائِبٌ عَنْهَا، فَهَلْ يَنْفَعُهَا شَىْءٌ إِنْ تَصَدَّقْتُ بِهِ عَنْهَا قَالَ ‏ \"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَإِنِّي أُشْهِدُكَ أَنَّ حَائِطِي الْمِخْرَافَ صَدَقَةٌ عَلَيْهَا‏.‏",
                "headingArabic": "الإِشْهَادِ فِي الْوَقْفِ وَالصَّدَقَةِ",
                "headingUrdu": "اوقاف کی بنیاد میں یا صدقہ دینے میں گواہ",
                "headingEnglish": "The witnesses in the foundation of an endowment or in giving in charity",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2640,
                "hadithNumber": "2763",
                "englishNarrator": "Narrated `Urwa bin Az-Zubai رضی اللہ عنہ :",
                "hadithEnglish": "`Aisha رضی اللہ عنہا about the meaning of the Qur'anic Verse:-- \"And if you fear that you will not deal fairly with the orphan girls then marry (other) women of your choice.\" (4.2-3) Aisha رضی اللہ عنہا said, \"It is about a female orphan under the guardianship of her guardian who is inclined towards her because of her beauty and wealth, and likes to marry her with a Mahr less than what is given to women of her standard. So they (i.e. guardians) were forbidden to marry the orphans unless they paid them a full appropriate Mahr (otherwise) they were ordered to marry other women instead of them. Later on the people asked Allah's Messenger (ﷺ) about it. So Allah revealed the following Verse:-- \"They ask your instruction (O Muhammad!) regarding women. Say: Allah instructs you regarding them...\" (4.127) and in this Verse Allah indicated that if the orphan girl was beautiful and wealthy, her guardian would have the desire to marry her without giving her an appropriate Mahr equal to what her peers could get, but if she was undesirable for lack of beauty or wealth, then he would not marry her, but seek to marry some other woman instead of her. So, since he did not marry her when he had no inclination towards her, he had not the right to marry her when he had an interest in her, unless he treated her justly by giving her a full Mahr and securing all her rights.",
                "hadithUrdu": "انہوں نے عائشہ رضی اللہ عنہا سے آیت » وان خفتم ان لا تقسطوا فی الیتمی فانکحواماطاب لکم من النساء « ( ترجمہ اوپر گزر چکا ) کا مطلب پوچھا تو عائشہ رضی اللہ عنہا نے فرمایا کہ اس سے مراد وہ یتیم لڑکی ہے جو اپنے ولی کی زیر پرورش ہو ‘ پھر ولی کے دل میں اس کا حسن اور اس کے مال کی طرف سے رغبت نکاح پیدا ہو جائے مگر اس کم مہر پر جو ویسی لڑکیوں کا ہو نا چاہئے تو اس طرح نکاح کرنے سے روکا گیا لیکن یہ کہ ولی ان کے ساتھ پورے مہر کی ادائیگی میں انصاف سے کام لیں ( تو نکاح کر سکتے ہیں ) اور انہیں لڑکیوں کے سوا دوسری عورتوں سے نکاح کرنے کا حکم دیا گیا ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا تو اللہ عزوجل نے یہ آیت نازل فرمائی کہ ” آپ سے لوگ عورتوں کے متعلق پوچھتے ہیں آپ کہہ دیں کہ اللہ تمہیں ان کے بارے میں ہدایت کرتا ہے “ حضرت عائشہ رضی اللہ عنہا نے کہا کہ پھر اللہ تعالیٰ نے اس آیت میں بیان کر دیا کہ یتیم لڑکی اگر جمال اور مال والی ہو اور ( ان کے ولی ) ان سے نکاح کرنے کے خواہشمند ہوں لیکن پورا مہر دینے میں ان کے ( خاندان کے ) طریقوں کی پابندی نہ کر سکیں تو ( وہ ان سے نکاح مت کریں ) جبکہ مال اور حسن کی کمی کی وجہ سے ان کی طرف انہیں کوئی رغبت نہ ہوتی ہو تو انہیں وہ چھوڑ دیتے اور ان کے سوا کسی دوسری عورت کو تلاش کرتے ۔ راوی نے کہا جس طرح ایسے لوگ رغبت نہ ہونے کی صورت میں ان یتیم لڑکیوں کو چھوڑ دیتے ‘ اسی طرح ان کے لئے یہ بھی جائز نہیں کہ جب ان لڑکیوں کی طرف انہیں رغبت ہو تو ان کے پورے مہر کے معاملے میں اور ان کے حقوق ادا کرنے میں انصاف سے کام لئے بغیر ان سے نکاح کریں ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی زہری سے کہ عروہ بن زبیر رضی اللہ عنہ ان سے حدیث بیان کرتے تھے‘",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ كَانَ عُرْوَةُ بْنُ الزُّبَيْرِ يُحَدِّثُ أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها – ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ‏}‏ قَالَتْ هِيَ الْيَتِيمَةُ فِي حَجْرِ وَلِيِّهَا، فَيَرْغَبُ فِي جَمَالِهَا وَمَالِهَا، وَيُرِيدُ أَنْ يَتَزَوَّجَهَا بِأَدْنَى مِنْ سُنَّةِ نِسَائِهَا، فَنُهُوا عَنْ نِكَاحِهِنَّ، إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ فِي إِكْمَالِ الصَّدَاقِ، وَأُمِرُوا بِنِكَاحِ مَنْ سِوَاهُنَّ مِنَ النِّسَاءِ قَالَتْ عَائِشَةُ ثُمَّ اسْتَفْتَى النَّاسُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدُ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ‏}‏ قَالَتْ فَبَيَّنَ اللَّهُ فِي هَذِهِ أَنَّ الْيَتِيمَةَ إِذَا كَانَتْ ذَاتَ جَمَالٍ وَمَالٍ رَغِبُوا فِي نِكَاحِهَا، وَلَمْ يُلْحِقُوهَا بِسُنَّتِهَا بِإِكْمَالِ الصَّدَاقِ، فَإِذَا كَانَتْ مَرْغُوبَةً عَنْهَا فِي قِلَّةِ الْمَالِ وَالْجَمَالِ تَرَكُوهَا وَالْتَمَسُوا غَيْرَهَا مِنَ النِّسَاءِ، قَالَ فَكَمَا يَتْرُكُونَهَا حِينَ يَرْغَبُونَ عَنْهَا فَلَيْسَ لَهُمْ أَنْ يَنْكِحُوهَا إِذَا رَغِبُوا فِيهَا إِلاَّ أَنْ يُقْسِطُوا لَهَا الأَوْفَى مِنَ الصَّدَاقِ وَيُعْطُوهَا حَقَّهَا‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَآتُوا الْيَتَامَى أَمْوَالَهُمْ وَلاَ تَتَبَدَّلُوا الْخَبِيثَ بِالطَّيِّبِ وَلاَ تَأْكُلُوا أَمْوَالَهُمْ إِلَى أَمْوَالِكُمْ إِنَّهُ كَانَ حُوبًا كَبِيرًا وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ}",
                "headingUrdu": "ارشاد باری تعالیٰ ہے: ’’اور اگر تمہیں ڈر ہو کہ تم یتیم بچیوں کے ساتھ انصاف نہ کر سکو گے‘‘۔",
                "headingEnglish": "The Statement of Allah Taa'la: \"And if you fear that you shall not be able to deal justly with the orphan-girls...\"",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2641,
                "hadithNumber": "2764",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "In the lifetime of Allah's Messenger (ﷺ) , `Umar رضی اللہ عنہ gave in charity some of his property, a garden of date-palms called Thamgh. `Umar رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! I have some property which I prize highly and I want to give it in charity.\" The Prophet; said, \"Give it in charity (i.e. as an endowment) with its land and trees on the condition that the land and trees will neither be sold nor given as a present, nor bequeathed, but the fruits are to be spent in charity.\" So `Umar رضی اللہ عنہ gave it in charity, and it was for Allah's Cause, the emancipation of slaves, for the poor, for guests, for travelers, and for kinsmen. The person acting as its administrator could eat from it reasonably and fairly, and could let a friend of his eat from it provided he had no intention of becoming wealthy by its means.",
                "hadithUrdu": "عمر رضی اللہ عنہ نے اپنی ایک جائیداد رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں وقف کر دی ‘ اس جائیداد کا نام ثمغ تھا اور یہ ایک کھجور کا ایک باغ تھا ۔ عمر رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! مجھے ایک جائیداد ملی ہے اور میرے خیال میں نہایت عمدہ ہے ‘ اس لئے میں نے چاہا کہ اسے صدقہ کر دوں تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اصل مال کو صدقہ کر کہ نہ بیچا جا سکے نہ ہبہ کیا جا سکے اور نہ اس کا کوئی وارث بن سکے ‘ صرف اس کا پھل ( اللہ کی راہ میں ) صرف ہو ۔ چنانچہ عمر رضی اللہ عنہ نے اسے صدقہ کر دیا ‘ ان کا یہ صدقہ غازیوں کے لئے ‘ غلام آزاد کرانے کے لئے ، محتاجوں اور کمزوروں کے لئے ‘ مسافروں کے لئے اور رشتہ داروں کے لئے تھا اور یہ کہ اس کے نگراں کے لئے اس میں کوئی مضائقہ نہیں ہو گا کہ وہ دستور کے موافق اس میں سے کھائے یا اپنے کسی دوست کو کھلائے بشرطیکہ اس میں سے مال جمع کرنے کا ارادہ نہ رکھتا ہو ۔",
                "urduNarrator": "ہم سے ہارون بن اشعث نے بیان کیا ‘ کہا کہ ہم سے بنو ہاشم کے غلام ابوسعید نے بیان کیا ‘ ان سے صخر بن جویریہ نے بیان کیا نافع سے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا هَارُونُ، حَدَّثَنَا أَبُو سَعِيدٍ، مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عُمَرَ، تَصَدَّقَ بِمَالٍ لَهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَ يُقَالُ لَهُ ثَمْغٌ، وَكَانَ نَخْلاً، فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ إِنِّي اسْتَفَدْتُ مَالاً وَهُوَ عِنْدِي نَفِيسٌ فَأَرَدْتُ أَنْ أَتَصَدَّقَ بِهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ تَصَدَّقْ بِأَصْلِهِ، لاَ يُبَاعُ وَلاَ يُوهَبُ وَلاَ يُورَثُ، وَلَكِنْ يُنْفَقُ ثَمَرُهُ ‏\"‏‏.‏ فَتَصَدَّقَ بِهِ عُمَرُ، فَصَدَقَتُهُ ذَلِكَ فِي سَبِيلِ اللَّهِ وَفِي الرِّقَابِ وَالْمَسَاكِينِ وَالضَّيْفِ وَابْنِ السَّبِيلِ وَلِذِي الْقُرْبَى، وَلاَ جُنَاحَ عَلَى مَنْ وَلِيَهُ أَنْ يَأْكُلَ مِنْهُ بِالْمَعْرُوفِ، أَوْ يُوكِلَ صَدِيقَهُ غَيْرَ مُتَمَوِّلٍ بِهِ‏.‏",
                "headingArabic": "وَمَا لِلْوَصِيِّ أَنْ يَعْمَلَ فِي مَالِ الْيَتِيمِ، وَمَا يَأْكُلُ مِنْهُ بِقَدْرِ عُمَالَتِهِ",
                "headingUrdu": "ولی کا یتیم کے مال کا معاملہ کیسا ہے؟",
                "headingEnglish": "How a guardian is to deal with an orphan's wealth",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2642,
                "hadithNumber": "2765",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "The following Verse:-- \"If a guardian is well-off, let him claim no remuneration (i.e. wages), but if he is poor, let him have for himself what is just and reasonable.\" (4.6) was revealed in connection with the guardian of an orphan, and it means that if he is poor he can have for himself (from the orphan's wealth) what is just and reasonable according to the orphan's share of the inheritance.",
                "hadithUrdu": "( قرآن مجید کی اس آیت ) ” اور جو شخص مالدار ہو وہ اپنے کو یتیم کے مال سے بالکل روکے رکھے ‘ البتہ جو شخص نادار ہو تو وہ دستور کے مطابق کھا سکتا ہے “ کے بارے میں فرمایا کہ یتیموں کے ولیوں کے بارے میں نازل ہوئی کہ یتیم کے مال میں سے اگر ولی نادار ہو تو دستور کے مطابق اس کے مال میں سے لے سکتا ہے ۔",
                "urduNarrator": "ہم سے عبید بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ہشام سے ‘ ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها – ‏{‏وَمَنْ كَانَ غَنِيًّا فَلْيَسْتَعْفِفْ وَمَنْ كَانَ فَقِيرًا فَلْيَأْكُلْ بِالْمَعْرُوفِ‏}‏‏.‏ قَالَتْ أُنْزِلَتْ فِي وَالِي الْيَتِيمِ أَنْ يُصِيبَ مِنْ مَالِهِ إِذَا كَانَ مُحْتَاجًا بِقَدْرِ مَالِهِ بِالْمَعْرُوفِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2643,
                "hadithNumber": "2766",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Avoid the seven great destructive sins.\" The people enquire, \"O Allah's Messenger (ﷺ)! What are they? \"He said, \"To join others in worship along with Allah, to practice sorcery, to kill the life which Allah has forbidden except for a just cause, (according to Islamic law), to eat up Riba (usury), to eat up an orphan's wealth, to give back to the enemy and fleeing from the battlefield at the time of fighting, and to accuse, chaste women, who never even think of anything touching chastity and are good believers.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ سات گناہوں سے جو تباہ کر دینے والے ہیں ‘ بچتے رہو ۔ صحابہ رضی اللہ عنہم نے پوچھا یا رسول اللہ صلی اللہ علیہ وسلم ! وہ کون سے گناہ ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے ساتھ کسی کو شریک ٹھہرانا ‘ جادو کرنا ‘ کسی کی ناحق جان لینا کہ جسے اللہ تعالیٰ نے حرام قرار دیا ہے ‘ سود کھانا ‘ یتیم کا مال کھانا ‘ لڑائی میں سے بھاگ جانا ‘ پاک دامن بھولی بھالی ایمان والی عورتوں پر تہمت لگانا ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ‘ انہوں نے کہا کہ مجھ سے سلیمان بن بلال نے بیان کیا ‘ ان سے ثور بن زید مدنی نے بیان کیا ‘ ان سے ابو غیث نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الْمَدَنِيِّ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ اجْتَنِبُوا السَّبْعَ الْمُوبِقَاتِ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ، وَمَا هُنَّ قَالَ ‏\"‏ الشِّرْكُ بِاللَّهِ، وَالسِّحْرُ، وَقَتْلُ النَّفْسِ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ، وَأَكْلُ الرِّبَا، وَأَكْلُ مَالِ الْيَتِيمِ، وَالتَّوَلِّي يَوْمَ الزَّحْفِ، وَقَذْفُ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ الْغَافِلاَتِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوَالَ الْيَتَامَى ظُلْمًا إِنَّمَا يَأْكُلُونَ فِي بُطُونِهِمْ نَارًا وَسَيَصْلَوْنَ سَعِيرًا}",
                "headingUrdu": "ارشادِ باری تعالیٰ ہے: ’’وہ لوگ جو یتیموں کا مال ناحق کھاتے ہیں‘‘۔",
                "headingEnglish": "The Statement of Allah Taa'la: \"... those who unjustly eat up the property of orphans...\"",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2644,
                "hadithNumber": "2767",
                "englishNarrator": "Narrated Nafi' said:",
                "hadithEnglish": "\"Ibn 'Umar رضی اللہ عنہما never refused to be appointed as guardian.\" The most beloved thing to Ibn Sirin concerning an orphan's wealth was that the orphan's advisor and guardians would assemble to decide what is best for him. When Tawus was asked about something concerning an orphan's affairs, he would recite: '...And Allah knows him who means mischief from him who means good...' (V 2:220). 'Ata said concerning some orphans, \"The guardian is to provide for the young and the old orphans according to their needs from their shares.\"",
                "hadithUrdu": "ابن عمر رضی اللہ عنہما کو کوئی وصی بناتا تو وہ کبھی انکار نہ کرتے ۔ ابن سیرین تابعی رحمہ اللہ کا محبوب مشغلہ یہ تھا کہ یتیم کے مال و جائیداد کے سلسلے میں ان کے خیر خواہوں اور ولیوں کو جمع کرتے تاکہ ان کے لئے کوئی اچھی صورت پیدا کرنے کے لئے غور کریں ۔ طاؤس تابعی رحمہ اللہ سے جب یتیموں کے بارے میں کوئی سوال کیا جاتا تو آپ یہ آیت پڑھتے کہ ” اور اللہ فساد پیدا کرنے والے اور سنوارنے والے کو خوب جانتا ہے ۔ “ عطاء رحمہ اللہ نے یتیموں کے بارے میں کہا خواہ وہ معمولی قسم کے لوگوں میں ہوں یا بڑے درجے کے ‘ اس کا ولی اس کے حصہ میں سے جیسے اس کے لائق ہو ، ویسا اس پر خرچ کرے ۔",
                "urduNarrator": "اور امام بخاری نے کہا کہ ہم سے سلیمان بن حرب نے بیان کیا ‘ ان سے حماد بن اسامہ نے بیان کیا ‘ ان سے ایوب نے ‘ ان سے نافع نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ لَنَا سُلَيْمَانُ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، قَالَ مَا رَدَّ ابْنُ عُمَرَ عَلَى أَحَدٍ وَصِيَّةً‏.‏ وَكَانَ ابْنُ سِيرِينَ أَحَبَّ الأَشْيَاءِ إِلَيْهِ فِي مَالِ الْيَتِيمِ أَنْ يَجْتَمِعَ إِلَيْهِ نُصَحَاؤُهُ وَأَوْلِيَاؤُهُ فَيَنْظُرُوا الَّذِي هُوَ خَيْرٌ لَهُ‏.‏ وَكَانَ طَاوُسٌ إِذَا سُئِلَ عَنْ شَىْءٍ مِنْ أَمْرِ الْيَتَامَى قَرَأَ ‏{‏وَاللَّهُ يَعْلَمُ الْمُفْسِدَ مِنَ الْمُصْلِحِ‏}‏‏.‏ وَقَالَ عَطَاءٌ فِي يَتَامَى الصَّغِيرُ وَالْكَبِيرُ يُنْفِقُ الْوَلِيُّ عَلَى كُلِّ إِنْسَانٍ بِقَدْرِهِ مِنْ حِصَّتِهِ‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَيَسْأَلُونَكَ عَنِ الْيَتَامَى قُلْ إِصْلاَحٌ لَهُمْ خَيْرٌ وَإِنْ تُخَالِطُوهُمْ فَإِخْوَانُكُمْ وَاللَّهُ يَعْلَمُ الْمُفْسِدَ مِنَ الْمُصْلِحِ وَلَوْ شَاءَ اللَّهُ لأَعْنَتَكُمْ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’بہترین چیز یہ ہے کہ اپنے مال میں دیانتداری سے کام کریں‘‘۔",
                "headingEnglish": "Allah's Statement: \"The best thing is to work honestly in their property...\"",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2645,
                "hadithNumber": "2768",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) came to Medina; he did not have any servant. Abu Talha (Anas' step-father) took me to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! Anas رضی اللہ عنہ is a wise boy, so let him serve you.\" So, I served him at home and on journeys. If I did anything, he never asked me why I did it, and if I refrained from doing anything, he never asked me why I refrained from doing it.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم مدینہ تشریف لائے تو آپ کے ساتھ کوئی خادم نہیں تھا ۔ اس لئے ابوطلحہ ( جو میرے سوتیلے باپ تھے ) میرا ہاتھ پکڑ کر آنحضرت صلی اللہ علیہ وسلم کی خدمت میں لے گئے اور عرض کیا کہ یا رسول اللہ صلی اللہ علیہ وسلم ! انس سمجھ دار بچہ ہے ۔ یہ آپ کی خدمت کیا کرے گا ۔ انس رضی اللہ عنہ کہتے ہیں کہ میں نے آپ کی سفر اور حضر میں خدمت کی ‘ آپ صلی اللہ علیہ وسلم نے مجھ سے کبھی کسی کام کے بارے میں جسے میں نے کر دیا ہو ‘ یہ نہیں فرمایا کہ یہ کام تم نے اس طرح کیوں کیا ‘ اسی طرح کسی ایسے کام کے متعلق جسے میں نہ کر سکا ہوں آپ صلی اللہ علیہ وسلم نے یہ نہیں فرمایا کہ تو نے یہ کام اس طرح کیوں نہیں کیا ۔",
                "urduNarrator": "ہم سے یعقوب بن ابراہیم بن کثیر نے بیان کیا ‘ کہا ہم سے اسماعیل بن علیہ نے بیان کیا ‘ کہا ہم سے عبدالعزیز بن صہیب نے بیان کیا ‘ ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ كَثِيرٍ، حَدَّثَنَا ابْنُ عُلَيَّةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ لَيْسَ لَهُ خَادِمٌ، فَأَخَذَ أَبُو طَلْحَةَ بِيَدِي، فَانْطَلَقَ بِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أَنَسًا غُلاَمٌ كَيِّسٌ، فَلْيَخْدُمْكَ‏.‏ قَالَ فَخَدَمْتُهُ فِي السَّفَرِ وَالْحَضَرِ، مَا قَالَ لِي لِشَىْءٍ صَنَعْتُهُ لِمَ صَنَعْتَ هَذَا هَكَذَا وَلاَ لِشَىْءٍ لَمْ أَصْنَعْهُ لِمَ لَمْ تَصْنَعْ هَذَا هَكَذَا",
                "headingArabic": "اسْتِخْدَامِ الْيَتِيمِ فِي السَّفَرِ وَالْحَضَرِ إِذَا كَانَ صَلاَحًا لَهُ، وَنَظَرِ الأُمِّ وَزَوْجِهَا لِلْيَتِيمِ",
                "headingUrdu": "یتیم کا روزگار",
                "headingEnglish": "The employment of an orphan",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2646,
                "hadithNumber": "2769",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Abu Talha رضی اللہ عنہ had the greatest wealth of date-palms amongst the Ansar in Medina, and he prized above all his wealth (his garden) Bairuha', which was situated opposite the Mosque (of the Prophet (ﷺ) ). The Prophet used to enter It and drink from its fresh water. When the following Divine Verse came:-- \"By no means shall you attain piety until you spend of what you love,\" (3.92) Abu Talha got up saying. \"O Allah's Messenger (ﷺ)! Allah says, 'You will not attain piety until you spend of what you love,' and I prize above al I my wealth, Bairuha' which I want to give in charity for Allah's Sake, hoping for its reward from Allah. So you can use it as Allah directs you.\" On that the Prophet (ﷺ) said, \"Bravo! It is a profitable (or perishable) property. (Ibn Maslama is not sure as to which word is right, i.e. profitable or perishable.) I have heard what you have said, and I recommend that you distribute this amongst your relatives.\" On that Abu Talha said, \"O Allah's Messenger (ﷺ)! I will do (as you have suggested).\" So, Abu Talha distributed that garden amongst his relatives and cousins. Ismaeel, Abdullah bin Yousuf and Yahya bin Yahya reported from Malik that he said: \"‏ رَايِحٌ ‏\".",
                "hadithUrdu": "ابوطلحہ رضی اللہ عنہ کجھور کے باغات کے اعتبار سے مدینہ کے انصار میں سب سے بڑے مالدار تھے اور انہیں اپنے تمام مالوں میں مسجدنبوی کے سامنے بیرحاء کا باغ سب سے زیادہ پسند تھا ۔ خود نبی کریم صلی اللہ علیہ وسلم بھی اس باغ میں تشریف لے جاتے اور اس کا میٹھا پانی پیتے تھے ۔ انس رضی اللہ عنہ نے بیان کیا کہ پھر جب یہ آیت نازل ہوئی ” نیکی تم ہرگز نہیں حاصل کرو گے جب تک اپنے اس مال سے نہ خرچ کرو جو تمہیں پسند ہوں “ تو ابوطلحہ رضی اللہ عنہ اٹھے اور آ کر رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا کہ یا رسول اللہ ! اللہ تعالیٰ فرماتا ہے کہ ” تم نیکی ہرگز نہیں حاصل کر سکو گے جب تک اپنے ان مالوں میں سے نہ خرچ کرو جو تمہیں زیادہ پسند ہوں “ اور میرے اموال میں مجھے سب سے زیادہ پسند بیرحاء ہے اور یہ اللہ کے راستہ میں صدقہ ہے ‘ میں اللہ کی بارگاہ سے اس کی نیکی اور ذخیرہ آخرت ہونے کی امید رکھتا ہوں ‘ آپ کو جہاں اللہ تعالیٰ بتائے اسے خرچ کریں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا شاباش یہ تو بڑا فائدہ بخش مال ہے یا ( آپ نے بجائے رابع کے رائح کہا ) یہ شک عبداللہ بن مسلمہ راوی کو ہوا تھا ۔ ۔ ۔ اور جو کچھ تم نے کہا میں نے سب سن لیا ہے اور میرا خیال ہے کہ تم اسے اپنے ناطے والوں کو دے دو ۔ ابوطلحہ نے عرض کیا یا رسول اللہ ! میں ایسا ہی کروں گا ۔ چنانچہ انہوں نے اپنے عزیزوں اور اپنے چچا کے لڑکوں میں تقسیم کر دیا ۔ اسماعیل ‘ عبداللہ بن یوسف اور یحییٰ بن یحییٰ نے مالک کے واسطہ سے ۔ رابح کے بجائے رائح بیان کیا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ‘ کہا ہم سے امام مالک نے ‘ ان سے اسحاق بن عبداللہ بن ابی طلحہ نے ‘ انہوں نے انس بن مالک رضی اللہ عنہ سے سناآپ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ كَانَ أَبُو طَلْحَةَ أَكْثَرَ أَنْصَارِيٍّ بِالْمَدِينَةِ مَالاً مِنْ نَخْلٍ، وَكَانَ أَحَبُّ مَالِهِ إِلَيْهِ بَيْرَحَاءَ مُسْتَقْبِلَةَ الْمَسْجِدِ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم يَدْخُلُهَا وَيَشْرَبُ مِنْ مَاءٍ فِيهَا طَيِّبٍ‏.‏ قَالَ أَنَسٌ فَلَمَّا نَزَلَتْ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ قَامَ أَبُو طَلْحَةَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ يَقُولُ ‏{‏لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ‏}‏ وَإِنَّ أَحَبَّ أَمْوَالِي إِلَىَّ بِيرُحَاءَ، وَإِنَّهَا صَدَقَةٌ لِلَّهِ أَرْجُو بِرَّهَا وَذُخْرَهَا عِنْدَ اللَّهِ، فَضَعْهَا حَيْثُ أَرَاكَ اللَّهُ‏.‏ فَقَالَ ‏\"‏ بَخْ، ذَلِكَ مَالٌ رَابِحٌ ـ أَوْ رَايِحٌ ـ شَكَّ ابْنُ مَسْلَمَةَ وَقَدْ سَمِعْتُ مَا قُلْتَ، وَإِنِّي أَرَى أَنْ تَجْعَلَهَا فِي الأَقْرَبِينَ ‏\"‏‏.‏ قَالَ أَبُو طَلْحَةَ أَفْعَلُ ذَلِكَ يَا رَسُولَ اللَّهِ‏.‏ فَقَسَمَهَا أَبُو طَلْحَةَ فِي أَقَارِبِهِ وَفِي بَنِي عَمِّهِ‏.‏ وَقَالَ إِسْمَاعِيلُ وَعَبْدُ اللَّهِ بْنُ يُوسُفَ وَيَحْيَى بْنُ يَحْيَى عَنْ مَالِكٍ ‏\"‏ رَايِحٌ ‏\"‏‏.‏",
                "headingArabic": "إِذَا وَقَفَ أَرْضًا وَلَمْ يُبَيِّنِ الْحُدُودَ فَهْوَ جَائِزٌ، وَكَذَلِكَ الصَّدَقَةُ",
                "headingUrdu": "اگر کوئی زمین کا ایک ٹکڑا وقف کے طور پر دے اور اس کی حدود متعین نہ کرے۔",
                "headingEnglish": "If somebody gives a piece of land as an endowment and does not mark its boundaries",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2647,
                "hadithNumber": "2770",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "A man said to Allah's Messenger (ﷺ) , \"My mother died, will it benefit her if I give in charity on her behalf?\" The Prophet (ﷺ) replied in the affirmative. The man said, \"I have a garden and I make you a witness that I give it in charity on her behalf.\"",
                "hadithUrdu": "ایک صحابی سعد بن عبادہ نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ ان کی ماں کا انتقال ہو گیا ہے ۔ کیا اگر وہ ان کی طرف سے خیرات کریں تو انہیں اس کا فائدہ پہنچے گا ؟ آپ صلی اللہ علیہ وسلم نے جواب دیا کہ ہاں ۔ اس پر ان صحابی نے کہا کہ میرا ایک پر میوہ باغ ہے اور میں آپ کو گواہ بناتا ہوں کہ میں نے وہ ان کی طرف سے صدقہ کر دیا ۔",
                "urduNarrator": "ہم سے محمد بن عبدالرحیم نے بیان کیا ‘ کہا ہم کو روح بن عبادہ نے خبر دی ‘ کہا ہم کو زکریابن اسحاق نے بیان کیا کہ مجھ سے عمرو بن دینار نے بیان کیا عکرمہ سے اور انہوں نے ابن عباس رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنِي عَمْرُو بْنُ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما أَنَّ رَجُلاً، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّ أُمَّهُ تُوُفِّيَتْ أَيَنْفَعُهَا إِنْ تَصَدَّقْتُ عَنْهَا قَالَ ‏ \"‏ نَعَمْ ‏\"‏‏.‏ قَالَ فَإِنَّ لِي مِخْرَافًا وَأُشْهِدُكَ أَنِّي قَدْ تَصَدَّقْتُ عَنْهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2648,
                "hadithNumber": "2771",
                "englishNarrator": "Narrated Anas رضی اللہ عنہ :",
                "hadithEnglish": "When the Prophet (ﷺ) ordered that the mosque be built, he said, \"O Bani An-Najjar! Suggest to me a price for this garden of yours.\" They replied, \"By Allah! We will demand its price from none but Allah.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے ( مدینہ میں ) مسجد بنانے کا حکم دیا اور بنی نجار سے فرمایا تم اپنے اس باغ کا مجھ سے مول کر لو ۔ انہوں نے کہا کہ ہرگز نہیں خدا کی قسم ہم تو اللہ ہی سے اس کا مول لیں گے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے عبدالوارث نے بیان کیا ‘ ان سے ابو التیاح یزید بن حمید نے اور ان سے انس رضی اللہ عنہ نے ‘ انہوں نے کہا",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أَمَرَ النَّبِيُّ صلى الله عليه وسلم بِبِنَاءِ الْمَسْجِدِ فَقَالَ ‏ \"‏ يَا بَنِي النَّجَّارِ ثَامِنُونِي بِحَائِطِكُمْ هَذَا ‏\"‏‏.‏ قَالُوا لاَ‏.‏ وَاللَّهِ لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ‏.‏",
                "headingArabic": "إِذَا أَوْقَفَ جَمَاعَةٌ أَرْضًا مُشَاعًا فَهْوَ جَائِزٌ",
                "headingUrdu": "اوقاف کے طور پر زمین کا ایک مشترکہ ملکیتی ٹکڑا",
                "headingEnglish": "A jointly-owned piece of land as an endowment",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2649,
                "hadithNumber": "2772",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When `Umar رضی اللہ عنہ got a piece of land in Khaibar, he came to the Prophet (ﷺ) saying, \"I have got a piece of land, better than which I have never got. So what do you advise me regarding it?\" The Prophet (ﷺ) said, \"If you wish you can keep it as an endowment to be used for charitable purposes.\" So, `Umar رضی اللہ عنہ gave the land in charity (i.e. as an endowments on the condition that the land would neither be sold nor given as a present, nor bequeathed, (and its yield) would be used for the poor, the kinsmen, the emancipation of slaves, Jihad, and for guests and travelers; and its administrator could eat in a reasonable just manner, and he also could feed his friends without intending to be wealthy by its means.\"",
                "hadithUrdu": "عمر رضی اللہ عنہ کو خیبر میں ایک زمین ملی ( جس کا نام ثمغ تھا ) تو آپ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ مجھے ایک زمین ملی ہے اور اس سے عمدہ مال مجھے کبھی نہیں ملا تھا ‘ آپ اس کے بارے میں مجھے کیا مشورہ دیتے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر چاہے تو اصل جائیداد اپنے قبضے میں روک رکھ اور اس کے منافع کو خیرات کر دے ۔ چنانچہ عمر رضی اللہ عنہ نے اسے اس شرط کے ساتھ صدقہ ( وقف ) کیا کہ اصل زمین نہ بیچی جائے ، نہ ہبہ کی جائے اور نہ وراثت میں کسی کو ملے اور فقراء ، رشتہ دار ، غلام آزاد کرانے ‘ اللہ کے راستے ( کے مجاہدوں ) مہمانوں اور مسافروں کے لئے ( وقف ہے ) جو شخص بھی اس کا متولی ہو اگر دستور کے مطابق اس میں سے کھائے یا اپنے کسی دوست کو کھلائے تو کوئی مضائقہ نہیں بشرطیکہ مال جمع کرنے کا ارادہ نہ ہو ۔",
                "urduNarrator": "ہم سے مسدد بن مسرہد نے بیان کیا ‘ کہا ہم سے یزید بن زریع نے بیان کیا ‘ کہا ہم سے عبداللہ بن عون رضی اللہ عنہ نے بیان کیاان سے نافع نے اور ان سے عبداللہ عمر رضی اللہ عنہما نے بیان کیا ،",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ أَصَابَ عُمَرُ بِخَيْبَرَ أَرْضًا فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ أَصَبْتُ أَرْضًا لَمْ أُصِبْ مَالاً قَطُّ أَنْفَسَ مِنْهُ، فَكَيْفَ تَأْمُرُنِي بِهِ قَالَ ‏ \"‏ إِنْ شِئْتَ حَبَّسْتَ أَصْلَهَا، وَتَصَدَّقْتَ بِهَا ‏\"‏‏.‏ فَتَصَدَّقَ عُمَرُ أَنَّهُ لاَ يُبَاعُ أَصْلُهَا وَلاَ يُوهَبُ وَلاَ يُورَثُ، فِي الْفُقَرَاءِ وَالْقُرْبَى وَالرِّقَابِ وَفِي سَبِيلِ اللَّهِ وَالضَّيْفِ وَابْنِ السَّبِيلِ، وَلاَ جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ مِنْهَا بِالْمَعْرُوفِ، أَوْ يُطْعِمَ صَدِيقًا غَيْرَ مُتَمَوِّلٍ فِيهِ‏.‏",
                "headingArabic": "الْوَقْفِ كَيْفَ يُكْتَبُ",
                "headingUrdu": "اوقاف کیسے لکھیں؟",
                "headingEnglish": "How to write the endowment?",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2650,
                "hadithNumber": "2773",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "`Umar رضی اللہ عنہ got some property in Khaibar and he came to the Prophet (ﷺ) and informed him about it. The Prophet said to him, \"If you wish you can give it in charity.\" So `Umar رضی اللہ عنہ gave it in charity (i.e. as an endowment) the yield of which was to be used for the good of the poor, the needy, the kinsmen and the guests.",
                "hadithUrdu": "عمر رضی اللہ عنہ کو خیبر میں ایک جائیداد ملی تو آپ نے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر اس کے متعلق خبر دی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر چاہو تو اسے صدقہ کر دو ۔ چنانچہ آپ نے فقراء ‘ مساکین ‘ رشتہ داروں اور مہمانوں کے لئے اسے صدقہ کر دیا ۔",
                "urduNarrator": "ہم سے ابو عاصم نے بیان کیا ‘ انہوں نے کہا ہم سے عبداللہ بن عون نے بیان کیا ‘ ان سے نافع نے بیان کیا ‘ ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، رضى الله عنه وَجَدَ مَالاً بِخَيْبَرَ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرَهُ، قَالَ ‏ \"‏ إِنْ شِئْتَ تَصَدَّقْتَ بِهَا ‏\"‏‏.‏ فَتَصَدَّقَ بِهَا فِي الْفُقَرَاءِ وَالْمَسَاكِينِ وَذِي الْقُرْبَى وَالضَّيْفِ‏.‏",
                "headingArabic": "الْوَقْفِ لِلْغَنِيِّ وَالْفَقِيرِ وَالضَّيْفِ",
                "headingUrdu": "وقف کا فائدہ",
                "headingEnglish": "The usufruct of an endowment",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2651,
                "hadithNumber": "2774",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "When Allah's Messenger (ﷺ) came to Medina, he ordered that a mosque be built. He said, \"O Bani An- Najjar! Suggest me a price for the garden of yours.\" They replied, \"By Allah, we will not ask its price except from Allah.\"",
                "hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم مدینہ تشریف لائے تو آپ نے مسجد بنانے کے لئے حکم دیا اور فرمایا اے بنو نجار ! اپنے باغ کی مجھ سے قیمت لے لو ۔ انہوں نے کہا کہ نہیں اللہ کی قسم ! ہم تو اس کی قیمت صرف اللہ سے مانگتے ہیں ۔",
                "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا ، کہا ہم سے عبدالصمد نے بیان کیا ، کہا کہ میں نے اپنے والد ( عبدالوارث ) سے سنا ، ان سے ابوالتیاح نے بیان کیا ، کہا کہ مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ، حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ سَمِعْتُ أَبِي، حَدَّثَنَا أَبُو التَّيَّاحِ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ أَمَرَ بِالْمَسْجِدِ وَقَالَ ‏ \"‏ يَا بَنِي النَّجَّارِ ثَامِنُونِي بِحَائِطِكُمْ هَذَا ‏\"‏‏.‏ قَالُوا لاَ وَاللَّهِ لاَ نَطْلُبُ ثَمَنَهُ إِلاَّ إِلَى اللَّهِ‏.‏",
                "headingArabic": "وَقْفِ الأَرْضِ لِلْمَسْجِدِ",
                "headingUrdu": "مسجد کی تعمیر کے لیے وقف کی بنیاد",
                "headingEnglish": "The foundation of an endowment for building a mosque",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 2652,
                "hadithNumber": "2775",
                "englishNarrator": "Narrated Ibn `Umar:",
                "hadithEnglish": "Once `Umar رضی اللہ عنہ gave a horse in charity to be used in holy fighting. It had been given to him by Allah's Apostle . `Umar          رضی اللہ عنہ gave it to another man to ride. Then `Umar رضی اللہ عنہ was informed that the man put the horse for sale, so he asked Allah's Messenger (ﷺ) whether he could buy it. Allah's Messenger (ﷺ) replied, \"You should not buy it, for you should not take back what you have given in charity.\"",
                "hadithUrdu": "عمر رضی اللہ عنہما نے اپنا ایک گھوڑا اللہ کے راستے میں ( جہاد کرنے کے لئے ) ایک آدمی کو دے دیا ۔ یہ گھوڑا آنحضرت صلی اللہ علیہ وسلم کو حضرت عمر رضی اللہ عنہ نے دیا تھا ‘ تاکہ آپ جہاد میں کسی کو اس پر سوار کریں ۔ پھر عمر رضی اللہ عنہ کو معلوم ہوا کہ جس شخص کو یہ گھوڑا ملا تھا ‘ وہ اس گھوڑے کو بازار میں بیچ رہا ہے ۔ اس لئے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ کیا وہ اسے خرید سکتے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہرگز اسے نہ خرید ۔ اپنا دیا ہوا صدقہ واپس نہ لے ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن قطان نے بیان کیا ، کہا ہم سے عبیداللہ بن عمری نے بیان کیا ، کہا کہ مجھ سے نافع نے بیان کیا ، اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا عُبَيْدُ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عُمَرَ، حَمَلَ عَلَى فَرَسٍ لَهُ فِي سَبِيلِ اللَّهِ أَعْطَاهَا رَسُولَ اللَّهِ صلى الله عليه وسلم لِيَحْمِلَ عَلَيْهَا رَجُلاً، فَأُخْبِرَ عُمَرُ أَنَّهُ قَدْ وَقَفَهَا يَبِيعُهَا، فَسَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يَبْتَاعَهَا فَقَالَ ‏ \"‏ لاَ تَبْتَعْهَا، وَلاَ تَرْجِعَنَّ فِي صَدَقَتِكَ ‏\"‏‏.‏",
                "headingArabic": "وَقْفِ الدَّوَابِّ وَالْكُرَاعِ وَالْعُرُوضِ وَالصَّامِتِ",
                "headingUrdu": "جانور، جائیداد، سونا اور چاندی بطور وقف",
                "headingEnglish": "Animals, property, gold and silver as endowments",
                "chapterId": "56",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 56,
                    "chapterNumber": "56",
                    "chapterEnglish": "Wills and Testaments (Wasaayaa)",
                    "chapterUrdu": "وصیتوں کے مسائل کا بیان",
                    "chapterArabic": "كتاب الوصايا",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 2626,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=105",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=103",
                "label": "103",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=104",
                "label": "104",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=105",
                "label": "105",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=106",
                "label": "106",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=107",
                "label": "107",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=108",
                "label": "108",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=109",
                "label": "109",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=107",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=107",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=105",
        "to": 2650,
        "total": 40465
    }
}