{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 131,
        "data": [
            {
                "id": 3253,
                "hadithNumber": "3404",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"(The Prophet) Moses was a shy person and used to cover his body completely because of his extensive shyness. One of the children of Israel hurt him by saying, 'He covers his body in this way only because of some defect in his skin, either leprosy or scrotal hernia, or he has some other defect.' Allah wished to clear Moses of what they said about him, so one day while Moses was in seclusion, he took off his clothes and put them on a stone and started taking a bath. When he had finished the bath, he moved towards his clothes so as to take them, but the stone took his clothes and fled; Moses picked up his stick and ran after the stone saying, 'O stone! Give me my garment!' Till he reached a group of Bani Israel who saw him naked then, and found him the best of what Allah had created, and Allah cleared him of what they had accused him of. The stone stopped there and Moses took and put his garment on and started hitting the stone with his stick. By Allah, the stone still has some traces of the hitting, three, four or five marks. This was what Allah refers to in His Saying:-- \"O you who believe! Be you not like those Who annoyed Moses, But Allah proved his innocence of that which they alleged, And he was honorable In Allah's Sight.\" (33.69)",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ حضرت موسیٰ علیہ السلام بڑے ہی شرم والے اور بدن ڈھانپنے والے تھے ۔ ان کی حیاء کی وجہ سے ان کے بدن کو کوئی حصہ بھی نہیں دیکھا جا سکتا تھا ۔ بنی اسرائیل کے جو لوگ انہیں اذیت پہنچانے کے درپے تھے ‘ وہ کیوں باز رہ سکتے تھے ‘ ان لوگوں نے کہنا شروع کیا کہ اس درجہ بدن چھپانے کا اہتمام صرف اس لئے ہے کہ ان کے جسم میں عیب ہے یا کوڑھ ہے یا ان کے خصیتین بڑھے ہوئے ہیں یا پھر کوئی اور بیماری ہے ۔ ادھر اللہ تعالیٰ کو یہ منظور ہوا کہ موسیٰ علیہ السلام کی ان کی ہفوات سے پاکی دکھلائے ۔ ایک دن حضرت موسیٰ علیہ السلام اکیلے غسل کرنے کے لئے آئے ایک پتھر پر اپنے کپڑے ( اتار کر ) رکھ دیئے ۔ پھر غسل شروع کیا ۔ جب فارغ ہوئے تو کپڑے اٹھانے کے لئے بڑھے لیکن پتھر ان کے کپڑوں سمیت بھاگنے لگا ۔ حضرت موسیٰ علیہ السلام نے اپنا عصا اٹھایا اور پتھر کے پیچھے دوڑے ۔ یہ کہتے ہوئے کہ پتھر ! میرا کپڑا دیدے ۔ آخر نبی اسرائیل کی ایک جماعت تک پہنچ گئے اور ان سب نے آپ کو ننگا دیکھ لیا ‘ اللہ کی مخلوق میں سب سے بہتر حالت میں اور اس طرح اللہ تعالیٰ نے ان کی تہمت سے ان کی برات کر دی ۔ اب پتھر بھی رک گیا اور آپ نے کپڑا اٹھا کر پہنا ۔ پھر پتھر کو اپنے عصا سے مارنے لگے ۔ خدا کی قسم اس پتھر پر حضرت موسیٰ علیہ السلام کے مارنے کی وجہ سے تین یا چار یا پانچ جگہ نشان پڑ گئے تھے ۔ اللہ تعالیٰ کے اس فرمان ” تم ان کی طرح نہ ہو جانا جنہوں نے موسیٰ علیہ السلام کو اذیت دی تھی ‘ پھر ان کی تہمت سے اللہ تعالیٰ نے انہیں بری قرار دیا اور وہ اللہ کی بارگاہ میں بڑی شان والے اور عزت والے تھے ۔ “ میں اسی واقعہ کی طرف اشارہ ہے ۔",
                "urduNarrator": "مجھ سے اسحاق بن ابراہیم نے بیان کیا ‘ کہا ہم سے روح بن عبادہ نے بیان کیا ‘ ان سے عوف بن ابو جمیلہ نے بیان کیا ‘ ان سے امام حسن بصری اور محمد بن سیرین اور خلاس بن عمرو نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا عَوْفٌ، عَنِ الْحَسَنِ، وَمُحَمَّدٍ، وَخِلاَسٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مُوسَى كَانَ رَجُلاً حَيِيًّا سِتِّيرًا، لاَ يُرَى مِنْ جِلْدِهِ شَىْءٌ، اسْتِحْيَاءً مِنْهُ، فَآذَاهُ مَنْ آذَاهُ مِنْ بَنِي إِسْرَائِيلَ، فَقَالُوا مَا يَسْتَتِرُ هَذَا التَّسَتُّرَ إِلاَّ مِنْ عَيْبٍ بِجِلْدِهِ، إِمَّا بَرَصٌ وَإِمَّا أُدْرَةٌ وَإِمَّا آفَةٌ‏.‏ وَإِنَّ اللَّهَ أَرَادَ أَنْ يُبَرِّئَهُ مِمَّا قَالُوا لِمُوسَى فَخَلاَ يَوْمًا وَحْدَهُ فَوَضَعَ ثِيَابَهُ عَلَى الْحَجَرِ ثُمَّ اغْتَسَلَ، فَلَمَّا فَرَغَ أَقْبَلَ إِلَى ثِيَابِهِ لِيَأْخُذَهَا، وَإِنَّ الْحَجَرَ عَدَا بِثَوْبِهِ، فَأَخَذَ مُوسَى عَصَاهُ وَطَلَبَ الْحَجَرَ، فَجَعَلَ يَقُولُ ثَوْبِي حَجَرُ، ثَوْبِي حَجَرُ، حَتَّى انْتَهَى إِلَى مَلإٍ مِنْ بَنِي إِسْرَائِيلَ، فَرَأَوْهُ عُرْيَانًا أَحْسَنَ مَا خَلَقَ اللَّهُ، وَأَبْرَأَهُ مِمَّا يَقُولُونَ، وَقَامَ الْحَجَرُ فَأَخَذَ ثَوْبَهُ فَلَبِسَهُ، وَطَفِقَ بِالْحَجَرِ ضَرْبًا بِعَصَاهُ، فَوَاللَّهِ إِنَّ بِالْحَجَرِ لَنَدَبًا مِنْ أَثَرِ ضَرْبِهِ ثَلاَثًا أَوْ أَرْبَعًا أَوْ خَمْسًا، فَذَلِكَ قَوْلُهُ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَكُونُوا كَالَّذِينَ آذَوْا مُوسَى فَبَرَّأَهُ اللَّهُ مِمَّا قَالُوا وَكَانَ عِنْدَ اللَّهِ وَجِيهًا‏}‏‏.‏‏\"‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3254,
                "hadithNumber": "3405",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "Once the Prophet (ﷺ) distributed something (among his followers. A man said, \"This distribution has not been done (with justice) seeking Allah's Countenance.\" I went to the Prophet (ﷺ) and told him (of that). He became so angry that I saw the signs of anger oh his face. Then he said, \"May Allah bestow His Mercy on Moses, for he was harmed more (in a worse manner) than this; yet he endured patiently.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ایک مرتبہ مال تقسیم کیا ‘ ایک شخص نے کہا کہ یہ ایک ایسی تقسیم ہے جس میں اللہ کی رضا جوئی کا کوئی لحاظ نہیں کیا گیا ۔ میں نے آنحضور صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر آپ کو اس کی خبر دی ۔ آپ غصہ ہوئے اور میں نے آپ کے چہرہ مبارک پر غصے کے آثار دیکھے ۔ پھر فرمایا ‘ اللہ تعالیٰ حضرت موسیٰ علیہ السلام پر رحم فرمائے ‘ ان کو اس سے بھی زیادہ تکلیف دی گئی تھی مگر انہوں نے صبر کیا ۔",
                "urduNarrator": "ہم سے ابو الولید نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے اعمش نے بیان کیا کہ میں نے ابووائل سے سنا‘انہوں نے بیان کیا کہ میں نے حضرت عبداللہ بن مسعود رضی اللہ عنہما سے سنا ‘ وہ کہتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ ـ رضى الله عنه ـ قَالَ قَسَمَ النَّبِيُّ صلى الله عليه وسلم قَسْمًا، فَقَالَ رَجُلٌ إِنَّ هَذِهِ لَقِسْمَةٌ مَا أُرِيدَ بِهَا وَجْهُ اللَّهِ‏.‏ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرْتُهُ، فَغَضِبَ حَتَّى رَأَيْتُ الْغَضَبَ فِي وَجْهِهِ، ثُمَّ قَالَ ‏ \"‏ يَرْحَمُ اللَّهُ مُوسَى قَدْ أُوذِيَ بِأَكْثَرَ مِنْ هَذَا فَصَبَرَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3255,
                "hadithNumber": "3406",
                "englishNarrator": "Narrated Jabir bin `Abdullah:",
                "hadithEnglish": "We were with Allah's Messenger (ﷺ) picking the fruits of the 'Arak trees, and Allah's Messenger (ﷺ) said, \"Pick the black fruit, for it is the best.\" The companions asked, \"Were you a shepherd?\" He replied, \"There was no prophet who was not a shepherd.\"",
                "hadithUrdu": "( ایک مرتبہ ) ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( سفر میں ) پیلو کے پھل توڑنے لگے ۔ آپ نے فرمایا کہ جو سیاہ ہوں انہیں توڑو ‘ کیونکہ وہ زیادہ لذیذ ہوتا ہے ۔ صحابہ رضوان اللہ علیہم اجمعین نے عرض کیا ‘ کیا حضور نے کبھی بکریاں چرائی ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ کوئی نبی ایسا نہیں گزرا جس نے بکریاں نہ چرائی ہوں ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث نے بیان کیا ‘ ان سے یونس نے ‘ ان سے ابن شہاب نے ‘ ان سے ابوسلمہ بن عبدالرحمٰن نے اور ان سے حضرت جابر بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم نَجْنِي الْكَبَاثَ، وَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ عَلَيْكُمْ بِالأَسْوَدِ مِنْهُ، فَإِنَّهُ أَطْيَبُهُ ‏\"‏‏.‏ قَالُوا أَكُنْتَ تَرْعَى الْغَنَمَ قَالَ ‏\"‏ وَهَلْ مِنْ نَبِيٍّ إِلاَّ وَقَدْ رَعَاهَا ‏\"‏‏.‏",
                "headingArabic": "{يَعْكِفُونَ عَلَى أَصْنَامٍ لَهُمْ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور وہ ایک ایسی قوم پر پہنچے جو اپنے بتوں کے لیے وقف تھے۔‘‘",
                "headingEnglish": "Allah's Statement: \"... And they came upon a people devoted to some of their idols...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3256,
                "hadithNumber": "3407",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Angel of Death was sent to Moses when he came to Moses, Moses slapped him on the eye. The angel returned to his Lord and said, \"You have sent me to a Slave who does not want to die.\" Allah said, \"Return to him and tell him to put his hand on the back of an ox and for every hair that will come under it, he will be granted one year of life.\" Moses said, \"O Lord! What will happen after that?\" Allah replied, \"Then death.\" Moses said, \"Let it come now.\" Moses then requested Allah to let him die close to the Sacred Land so much so that he would be at a distance of a stone's throw from it.\" Abu Huraira رضی اللہ عنہ added, \"Allah's Messenger (ﷺ) said, 'If I were there, I would show you his grave below the red sand hill on the side of the road.\" He (Abdur Razzaq) said: Mamar has narrated to us from Hammam, (he said) Hadrat Abu Huraira رضی اللہ عنہ has reported this Hdith likewise from the prophet (ﷺ).",
                "hadithUrdu": "اللہ تعالیٰ نے حضرت موسیٰ علیہ السلام کے پاس ملک الموت کو بھیجا ‘ جب ملک الموت حضرت موسیٰ علیہ السلام کے پاس آئے تو انہوں نے انہیں چانٹا مارا ( کیونکہ وہ انسان کی صورت میں آیا تھا ) ملک الموت ‘ اللہ رب العزت کی بارگاہ میں واپس ہوئے اور عرض کیا کہ تو نے اپنے ایک ایسے بندے کے پاس مجھے بھیجا جو موت کے لئے تیار نہیں ہے ۔ اللہ تعالیٰ نے فرمایا کہ دوبارہ ان کے پاس جاؤ اور کہو کہ اپنا ہا تھ کسی بیل کی پیٹھ پر رکھیں ، ان کے ہاتھ میں جتنے بال اس کے آ جائیں ان میں سے ہر بال کے بدلے ایک سال کی عمر انہیں دی جائے گی ( ملک الموت دوبارہ آئے اور اللہ تعالیٰ کا فیصلہ سنایا ) حضرت موسیٰ علیہ السلام بولے اے رب ! پھر اس کے بعد کیا ہو گا ؟ اللہ تعالیٰ نے فرمایا کہ پھر موت ہے ۔ حضرت موسیٰ علیہ السلام نے عرض کیا کہ پھر ابھی کیوں نہ آ جائے ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ پھر حضرت موسیٰ علیہ السلام نے اللہ تعالیٰ سے دعا کی کہ بیت المقدس سے مجھے اتنا قریب کر دیا جائے کہ ( جہاں ان کی قبر ہو وہاں سے ) اگر کوئی پتھر پھینکے تو وہ بیت المقدس تک پہنچ سکے ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر میں وہاں موجود ہوتا تو بیت المقدس میں ‘ میں تمہیں ان کی قبر دکھاتا جو راستے کے کنارے پر ہے ‘ ریت کے سرخ ٹیلے سے نیچے ۔ عبدالرزاق بن ہمام نے بیان کیا کہ ہمیں معمر نے خبر دی ‘ انہیں ہمام نے اور ان کو ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اسی طرح بیان کیا ۔",
                "urduNarrator": "ہم سے یحییٰ بن موسیٰ نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں عبداللہ بن طاوس نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ أُرْسِلَ مَلَكُ الْمَوْتِ إِلَى مُوسَى ـ عَلَيْهِمَا السَّلاَمُ ـ فَلَمَّا جَاءَهُ صَكَّهُ، فَرَجَعَ إِلَى رَبِّهِ، فَقَالَ أَرْسَلْتَنِي إِلَى عَبْدٍ لاَ يُرِيدُ الْمَوْتَ‏.‏ قَالَ ارْجِعْ إِلَيْهِ، فَقُلْ لَهُ يَضَعُ يَدَهُ عَلَى مَتْنِ ثَوْرٍ، فَلَهُ بِمَا غَطَّتْ يَدُهُ بِكُلِّ شَعَرَةٍ سَنَةٌ‏.‏ قَالَ أَىْ رَبِّ، ثُمَّ مَاذَا قَالَ ثُمَّ الْمَوْتُ‏.‏ قَالَ فَالآنَ‏.‏ قَالَ فَسَأَلَ اللَّهَ أَنْ يُدْنِيَهُ مِنَ الأَرْضِ الْمُقَدَّسَةِ رَمْيَةً بِحَجَرٍ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ كُنْتُ ثَمَّ لأَرَيْتُكُمْ قَبْرَهُ إِلَى جَانِبِ الطَّرِيقِ تَحْتَ الْكَثِيبِ الأَحْمَرِ ‏\"‏‏.‏ قَالَ وَأَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامٍ حَدَّثَنَا أَبُو هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ‏.‏",
                "headingArabic": "وَفَاةِ مُوسَى، وَذِكْرُهُ بَعْدُ",
                "headingUrdu": "حضرت موسیٰ علیہ السلام کی وفات",
                "headingEnglish": "The death of Musa (Moses)",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3257,
                "hadithNumber": "3408",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "A Muslim and a Jew quarreled. The Muslim taking an oath, said, \"By Him Who has preferred Muhammad over all people...!\" The Jew said, \"By Him Who has preferred Moses, over all people.\" The Muslim raised his hand and slapped the Jew who came to the Prophet (ﷺ) to tell him what had happened between him and the Muslim. The Prophet (ﷺ) said, \"Don't give me superiority over Moses, for the people will become unconscious (on the Day of Resurrection) and I will be the first to gain consciousness to see Moses standing and holding a side of Allah's Throne. I will not know if he has been among those people who have become unconscious; and that he has gained consciousness before me, or he has been amongst those whom Allah has exempted.\"",
                "hadithUrdu": "مسلمانوں کی جماعت کے ایک آدمی اور یہودیوں میں سے ایک شخص کا جھگڑا ہوا ۔ مسلمان نے کہا کہ اس ذات کی قسم جس نے محمد صلی اللہ علیہ وسلم کو ساری دنیا میں برگذیدہ بنایا ‘ قسم کھاتے ہوئے انہوں نے یہ کہا ۔ اس پر یہودی نے کہا ‘ قسم ہے اس ذات کی جس نے موسیٰ علیہ السلام کو ساری دنیا میں برگزیدہ بنایا ۔ اس پر مسلمان نے اپنا ہاتھ اٹھا کر یہودی کو تھپڑ مار دیا ۔ وہ یہودی ‘ نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آیا اور اپنے اور مسلمان کے جھگڑے کی آپ کو خبر دی ۔ آپ نے اسی موقع پر فرمایا کہ مجھے حضرت موسیٰ علیہ السلام پر ترجیح نہ دیا کرو ۔ لوگ قیامت کے دن بیہوش کر دئے جائیں گے اور سب سے پہلے میں ہوش میں آؤں گا پھر دیکھوں گا کہ حضرت موسیٰ علیہ السلام عرش کا پایہ پکڑ ے ہوئے کھڑے ہیں ۔ اب مجھے معلوم نہیں کہ وہ بھی بیہوش ہونے والوں میں تھے اور مجھ سے پہلے ہی ہوش میں آ گئے یا انہیں اللہ تعالیٰ نے بیہوش ہونے والوں میں ہی نہیں رکھا تھا ۔",
                "urduNarrator": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ‘ ان سے زہری نے بیان کیا ‘ انہیں ابوسلمہ بن عبدالرحمان اور سعید بن مسیب نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ اسْتَبَّ رَجُلٌ مِنَ الْمُسْلِمِينَ وَرَجُلٌ مِنَ الْيَهُودِ‏.‏ فَقَالَ الْمُسْلِمُ وَالَّذِي اصْطَفَى مُحَمَّدًا صلى الله عليه وسلم عَلَى الْعَالَمِينَ‏.‏ فِي قَسَمٍ يُقْسِمُ بِهِ‏.‏ فَقَالَ الْيَهُودِيُّ وَالَّذِي اصْطَفَى مُوسَى عَلَى الْعَالَمِينَ‏.‏ فَرَفَعَ الْمُسْلِمُ عِنْدَ ذَلِكَ يَدَهُ، فَلَطَمَ الْيَهُودِيَّ، فَذَهَبَ الْيَهُودِيُّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرَهُ الَّذِي كَانَ مِنْ أَمْرِهِ وَأَمْرِ الْمُسْلِمِ فَقَالَ ‏ \"‏ لاَ تُخَيِّرُونِي عَلَى مُوسَى، فَإِنَّ النَّاسَ يَصْعَقُونَ فَأَكُونُ أَوَّلَ مَنْ يُفِيقُ، فَإِذَا مُوسَى بَاطِشٌ بِجَانِبِ الْعَرْشِ، فَلاَ أَدْرِي أَكَانَ فِيمَنْ صَعِقَ فَأَفَاقَ قَبْلِي أَوْ كَانَ مِمَّنِ اسْتَثْنَى اللَّهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3258,
                "hadithNumber": "3409",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Adam and Moses علیہم السلام argued with each other. Moses علیہم السلام said to Adam. 'You are Adam علیہم السلام whose mistake expelled you from Paradise.' Adam علیہم السلام said to him, 'You are Moses          علیہم السلام whom Allah selected as His Messenger and as the one to whom He spoke directly; yet you blame me for a thing which had already been written in my fate before my creation?\"' Allah's Messenger (ﷺ) said twice, \"So, Adam علیہم السلام overpowered Moses علیہم السلام .\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ حضرت موسیٰ اور حضرت آدم علیہم السلام نے آپس میں بحث کی ۔ حضرت موسیٰ علیہ السلام نے ان سے کہا کہ آپ آدم ہیں جنہیں ان کی لغزش نے جنت سے نکالا ۔ حضرت آدم علیہ السلام بولے اور آپ موسیٰ علیہ السلام ہیں کہ جنہیں اللہ تعالیٰ نے اپنی رسالت اور اپنے کلام سے نوازا ‘ پھر بھی آپ مجھے ایک ایسے معاملے پر ملامت کرتے ہیں جو اللہ تعالیٰ نے میری پیدائش سے بھی پہلے مقدر کر دیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ چنانچہ حضرت آدم علیہ السلام حضرت موسیٰ علیہ السلام پر غالب آ گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے یہ جملہ دو مرتبہ فرمایا ۔",
                "urduNarrator": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ‘ کہا ہم سے ابراہیم بن سعد نے بیان کیا ‘ ان سے ابن شہاب نے ‘ ان سے حمید بن عبد الرحمان نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْتَجَّ آدَمُ وَمُوسَى فَقَالَ لَهُ مُوسَى أَنْتَ آدَمُ الَّذِي أَخْرَجَتْكَ خَطِيئَتُكَ مِنَ الْجَنَّةِ‏.‏ فَقَالَ لَهُ آدَمُ أَنْتَ مُوسَى الَّذِي اصْطَفَاكَ اللَّهُ بِرِسَالاَتِهِ وَبِكَلاَمِهِ، ثُمَّ تَلُومُنِي عَلَى أَمْرٍ قُدِّرَ عَلَىَّ قَبْلَ أَنْ أُخْلَقَ ‏\"‏‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَحَجَّ آدَمُ مُوسَى ‏\"‏ مَرَّتَيْنِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3259,
                "hadithNumber": "3410",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) once came to us and said, \"All the nations were displayed in front of me, and I saw a large multitude of people covering the horizon. Somebody said, 'This is Moses and his followers.' \"",
                "hadithUrdu": "ایک دن نبی کریم صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے اور فرمایا کہ میرے سامنے تمام امتیں لائی گئیں اور میں نے دیکھا کہ ایک بہت بڑی جماعت آسمان کے کناروں پر چھائی ہوئی ہے ۔ پھر بتایا گیا کہ یہ اپنی قوم کے ساتھ حضرت موسیٰ علیہ السلام ہیں ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے حصین بن نمیر نے بیان کیا ‘ ان سے حصین بن عبدالرحمٰن نے ‘ ان سے سعید بن جبیر نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حُصَيْنُ بْنُ نُمَيْرٍ، عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ خَرَجَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم يَوْمًا قَالَ ‏ \"‏ عُرِضَتْ عَلَىَّ الأُمَمُ، وَرَأَيْتُ سَوَادًا كَثِيرًا سَدَّ الأُفُقَ فَقِيلَ هَذَا مُوسَى فِي قَوْمِهِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3260,
                "hadithNumber": "3411",
                "englishNarrator": "Narrated Abu Musa رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Many amongst men reached (the level of) perfection but none amongst the women reached this level except Asia, Pharaoh's wife, and Mary, the daughter of `Imran. And no doubt, the superiority of `Aisha رضی اللہ عنہا to other women is like the superiority of Tharid (i.e. a meat and bread dish) to other meals.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مردوں میں تو بہت سے کامل لوگ اٹھے لیکن عورتوں میں فرعون کی بیوی آسیہ اور مریم بنت عمران علیہما السلام کے سوا اور کوئی کامل نہیں پیدا ہوئی ‘ ہاں عورتوں پر حضرت عائشہ رضی اللہ عنہا کی فضیلت ایسی ہے جیسے تمام کھانوں پر ثریدکی فضیلت ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن جعفر نے بیان کیا ‘ انہوں نے کہا ہم سے وکیع نے بیان کیا ‘ ان سے شعبہ نے بیان کیا ‘ ان سے عمرو بن مرہ نے ‘ ان سے مرہ ہمدانی نے اور ان سے حضرت ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ جَعْفَرٍ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ مُرَّةَ الْهَمْدَانِيِّ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كَمَلَ مِنَ الرِّجَالِ كَثِيرٌ، وَلَمْ يَكْمُلْ مِنَ النِّسَاءِ إِلاَّ آسِيَةُ امْرَأَةُ فِرْعَوْنَ، وَمَرْيَمُ بِنْتُ عِمْرَانَ، وَإِنَّ فَضْلَ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَضَرَبَ اللَّهُ مَثَلاً لِلَّذِينَ آمَنُوا امْرَأَةَ فِرْعَوْنَ} إِلَى قَوْلِهِ: {وَكَانَتْ مِنَ الْقَانِتِينَ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور اللہ نے ایمان والوں کے لیے فرعون کی بیوی کی مثال بیان کی ہے۔‘‘",
                "headingEnglish": "The Statement of Allah Taa'la: \"And Allah has set forth an example for those who believe, the wife of Fir'aun...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3261,
                "hadithNumber": "3412",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"None of you should say that I am better than Yunus (i.e. Jonah).\" Musadded added, \"Jonah bin Matta.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کوئی شخص میرے متعلق یہ نہ کہے کہ میں حضرت یونس علیہ السلام سے بہتر ہوں ۔ مسدد نے یونس بن متی علیہ السلام کے لفظ بڑھا کر روایت کیا ۔",
                "urduNarrator": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے یحییٰ نے بیان کیا ‘ ان سے سفیان بن عیینہ نے بیان کیا ‘ کہا کہ مجھ سے اعمش نے بیان کیا ( دوسری سند ) ہم سے ابونعیم نے بیان کیا ‘ کہا ہم سے سفیان نے بیان کیا ‘ ان سے اعمش نے ‘ ان سے ابووائل نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي الأَعْمَشُ،‏.‏ حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَقُولَنَّ أَحَدُكُمْ إِنِّي خَيْرٌ مِنْ يُونُسَ ‏\"‏‏.‏ زَادَ مُسَدَّدٌ ‏\"‏ يُونُسَ بْنِ مَتَّى ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَإِنَّ يُونُسَ لَمِنَ الْمُرْسَلِينَ} إِلَى قَوْلِهِ: {فَمَتَّعْنَاهُمْ إِلَى حِينٍ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان: ’’اور بے شک یونس علیہ السلام رسولوں میں سے تھے‘‘۔",
                "headingEnglish": "The Statement of Allah Taa'la: \"And verily, Yunus was one of the Messengers...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3262,
                "hadithNumber": "3413",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"No slave (of Allah) should say that I am better than Yunus bin Matta.\" So the Prophet mentioned his father's name with his name.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ کسی شخص کے لئے مناسب نہیں کہ مجھے یونس بن متی سے بہتر قرار دے ۔ آپ نے ان کے والد کی طرف منسوب کر کے ان کا نام لیا تھا ۔",
                "urduNarrator": "ہم سے حفص بن عمر نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے قتادہ نے ‘ ان سے ابو العالیہ نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہا",
                "hadithArabic": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ إِنِّي خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏‏.‏ وَنَسَبَهُ إِلَى أَبِيهِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3263,
                "hadithNumber": "3414, 3415",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Once while a Jew was selling something, he was offered a price that he was not pleased with. So, he said, \"No, by Him Who gave Moses superiority over all human beings!\" Hearing him, an Ansari man got up and slapped him on the face and said, \"You say: By Him Who Gave Moses superiority over all human beings although the Prophet (Muhammad) is present amongst us!\" The Jew went to the Prophet and said, \"O Abu-l-Qasim! I am under the assurance and contract of security, so what right does so-and-so have to slap me?\" The Prophet (ﷺ) asked the other, \"Why have you slapped\". He told him the whole story. The Prophet (ﷺ) became angry, till anger appeared on his face, and said, \"Don't give superiority to any prophet amongst Allah's Prophets, for when the trumpet will be blown, everyone on the earth and in the heavens will become unconscious except those whom Allah will exempt. The trumpet will be blown for the second time and I will be the first to be resurrected to see Moses holding Allah's Throne. I will not know whether the unconsciousness which Moses received on the Day of Tur has been sufficient for him, or has he got up before me.\" And I do not say that there is anybody who is better than Yunus bin Matta.\"",
                "hadithUrdu": "ایک مرتبہ لوگوں کو ایک یہودی اپنا سامان دکھا رہا تھا لیکن اسے اس کی جو قیمت لگائی گئی اس پر وہ راضی نہ تھا ۔ اس لئے کہنے لگا کہ ہرگز نہیں ، اس ذات کی قسم جس نے موسیٰ کو تمام انسانوں میں برگزیدہ قرار دیا ۔ یہ لفظ ایک انصاری صحابی نے سن لئے اور کھڑے ہو کر انہوں نے ایک تھپڑ اس کے منہ پر مارا اور کہا کہ نبی کریم صلی اللہ علیہ وسلم ابھی ہم میں موجود ہیں اور تو اس طرح قسم کھاتا ہے کہ اس ذات کی قسم جس نے حضرت موسیٰ علیہ السلام کو تمام انسانوں میں برگزیدہ قرار دیا ۔ اس پر وہ یہودی آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور کہا ‘ اے ابوالقاسم ! میرا مسلمانوں کے ساتھ امن اور صلح کا عہد و پیمان ہے ۔ پھر فلاں شخص کا کیا حال ہو گا جس نے میرے منہ پر چانٹا مارا ہے ‘ آنحضرت صلی اللہ علیہ وسلم نے اس صحابی سے دریافت فرمایا کہ تم نے اس کے منہ پر کیوں چانٹا مارا ؟ انہوں نے وجہ بیان کی تو آپ غصے ہو گئے اس قدر کہ غصے کے آثار چہرہ مبارک پر نمایاں ہو گئے ۔ پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ کے انبیاء میں آپس میں ایک کو دوسرے پر فضیلت نہ دیا کرو ، جب صور پھونکا جائے گا تو آسمان و زمین کی تمام مخلوق پر بے ہوشی طاری ہو جائے گی ‘ سو ان کے جنہیں اللہ تعالیٰ چاہے گا ۔ پھر دوسری مرتبہ صور پھونکا جائے گا اور سب سے پہلے مجھے اٹھایا جائے گا ‘ لیکن میں دیکھوں گا کہ موسیٰ علیہ السلام عرش کو پکڑے ہوئے کھڑے ہوں گے ‘ اب مجھے معلوم نہیں کہ یہ انہیں طور کی بے ہوشی کا بدلا دیا گیا ہو گا یا مجھ سے بھی پہلے ان کی بے ہوشی ختم کر دی گئی ہو گی ۔  اور میں تو یہ بھی نہیں کہہ سکتا کہ کوئی شخص حضرت یونس بن متی سے بہتر ہے ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے ‘ ان سے عبدا لعزیز بن سلمہ نے ‘ ان سے عبداللہ بن فضیل نے ‘ ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، عَنِ اللَّيْثِ، عَنْ عَبْدِ الْعَزِيزِ بْنِ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ بَيْنَمَا يَهُودِيٌّ يَعْرِضُ سِلْعَتَهُ أُعْطِيَ بِهَا شَيْئًا كَرِهَهُ‏.‏ فَقَالَ لاَ وَالَّذِي اصْطَفَى مُوسَى عَلَى الْبَشَرِ، فَسَمِعَهُ رَجُلٌ مِنَ الأَنْصَارِ فَقَامَ، فَلَطَمَ وَجْهَهُ، وَقَالَ تَقُولُ وَالَّذِي اصْطَفَى مُوسَى عَلَى الْبَشَرِ، وَالنَّبِيُّ صلى الله عليه وسلم بَيْنَ أَظْهُرِنَا فَذَهَبَ إِلَيْهِ، فَقَالَ أَبَا الْقَاسِمِ، إِنَّ لِي ذِمَّةً وَعَهْدًا، فَمَا بَالُ فُلاَنٍ لَطَمَ وَجْهِي‏.‏ فَقَالَ ‏\"‏ لِمَ لَطَمْتَ وَجْهَهُ ‏\"‏‏.‏ فَذَكَرَهُ، فَغَضِبَ النَّبِيُّ صلى الله عليه وسلم حَتَّى رُئِيَ فِي وَجْهِهِ، ثُمَّ قَالَ ‏\"‏ لاَ تُفَضِّلُوا بَيْنَ أَنْبِيَاءِ اللَّهِ، فَإِنَّهُ يُنْفَخُ فِي الصُّورِ، فَيَصْعَقُ مَنْ فِي السَّمَوَاتِ وَمَنْ فِي الأَرْضِ، إِلاَّ مَنْ شَاءَ اللَّهُ، ثُمَّ يُنْفَخُ فِيهِ أُخْرَى، فَأَكُونُ أَوَّلَ مَنْ بُعِثَ فَإِذَا مُوسَى آخِذٌ بِالْعَرْشِ، فَلاَ أَدْرِي أَحُوسِبَ بِصَعْقَتِهِ يَوْمَ الطُّورِ أَمْ بُعِثَ قَبْلِي. وَلَا أَقُولُ إِنَّ أَحَدًا أَفْضَلُ مِنْ يُونُسَ بْنِ مَتَّى\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3264,
                "hadithNumber": "3416",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"None should say that I am better than Yunus bin Matta.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ کسی شخص کے لئے یہ کہنا لائق نہیں کہ میں حضرت یونس بن متی سے افضل ہوں ۔",
                "urduNarrator": "ہم سے ابو الولید نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے سعد بن ابراہیم نے ‘ انہوں نے حمید بن عبدالرحمٰن سے سنا اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، سَمِعْتُ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3265,
                "hadithNumber": "3417",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The reciting of the Zabur (i.e. Psalms) was made easy for David. He used to order that his riding animals be saddled, and would finish reciting the Zabur before they were saddled. And he would never eat except from the earnings of his manual work.\" Musa bin Uqbah from Safwaan, Ataa bin Tasaar, Hadrat Abu Hurairah رضی اللہ عنہ reports from the prophet (ﷺ).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ حضرت داؤد علیہ السلام کے لئے قرآن ( یعنی زبور ) کی قرآت بہت آسان کر دی گئی تھی ۔ چنانچہ وہ اپنی سواری پر زین کسنے کا حکم دیتے اور زین کسی جانے سے پہلے ہی پوری زبور پڑھ لیتے تھے اور آپ صرف اپنے ہاتھوں کی کمائی کھاتے تھے ۔ اس کی روایت موسیٰ بن عقبہ نے کی ‘ ان سے صفوان نے ‘ ان سے عطاء بن یسار نے ‘ ان سے حضرت ابوہریرہ رضی اللہ عنہ نے ، نبی کریم صلی اللہ علیہ وسلم سے روایت کیا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ‘ کہا ہم سے عبدالرزاق نے بیان کیا ‘ انہیں معمر نے خبر دی ‘ انہیں ہمام نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ خُفِّفَ عَلَى دَاوُدَ ـ عَلَيْهِ السَّلاَمُ ـ الْقُرْآنُ، فَكَانَ يَأْمُرُ بِدَوَابِّهِ فَتُسْرَجُ، فَيَقْرَأُ الْقُرْآنَ قَبْلَ أَنْ تُسْرَجَ دَوَابُّهُ، وَلاَ يَأْكُلُ إِلاَّ مِنْ عَمَلِ يَدِهِ ‏\"‏‏.‏ رَوَاهُ مُوسَى بْنُ عُقْبَةَ عَنْ صَفْوَانَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى ‏{‏وَآتَيْنَا دَاوُدَ زَبُورًا‏}‏",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"اور ہم نے داؤد کو زبور عطا کی...\"",
                "headingEnglish": "The Statement of Allah Taa'la: \"And to David We gave the Zabur...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3266,
                "hadithNumber": "3418",
                "englishNarrator": "Narrated `Abdullah bin `Amr:",
                "hadithEnglish": "Allah's Messenger (ﷺ) was informed that I have said: \"By Allah, I will fast all the days and pray all the nights as long as I live.\" On that, Allah's Messenger (ﷺ) asked me. \"Are you the one who says: 'I will fast all the days and pray all the nights as long as I live?' \" I said, \"Yes, I have said it.\" He said, \"You cannot do that. So fast (sometimes) and do not fast (sometimes). Pray and sleep. Fast for three days a month, for the reward of a good deed is multiplied by ten time, and so the fasting of three days a month equals the fasting of a year.\" I said, \"O Allah's Messenger (ﷺ)! I can do (fast) more than this.\" He said, \"Fast on every third day. I said: I can do (fast) more than that, He said: \"Fast on alternate days and this was the fasting of David which is the most moderate sort of fasting.\" I said, \"O Allah's Messenger (ﷺ)! I can do (fast) more than that.\" He said, \"There is nothing better than that.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو خبر ملی کہ میں نے کہا ہے کہ اللہ کی قسم ‘ جب تک میں زندہ رہوں گا ‘ دن میں روزے رکھوں گا اور رات بھر عبادت کیا کروں گا ۔ رسول اللہ صلی اللہ علیہ وسلم نے ان سے پوچھا کہ کیا تمہیں نے یہ کہا ہے کہ اللہ کی قسم جب تک زندہ رہوں گا دن بھر روزے رکھوں گا اور رات بھر عبادت کروں گا ؟ میں نے عرض کیا جی ہاں میں نے یہ جملہ کہا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم اسے نبھا نہیں سکو گے ‘ اس لئے روزہ بھی رکھا کرو اور بغیر روزے کے بھی رہا کرو اور رات میں عبادت بھی کیا کرو اور سویا بھی کرو ۔ ہر مہینے میں تین دن روزہ رکھا کرو ‘ کیونکہ ہر نیکی کا بدلہ دس گنا ملتا ہے اس طرح روزہ کا یہ طریقہ بھی ( ثواب کے اعتبار سے ) زندگی بھر کے روزے جیسا ہو جائے گا ۔ میں نے کہا کہ میں اس سے افضل طریقہ کی طاقت رکھتا ہوں ‘ اے اللہ کے رسول صلی اللہ علیہ وسلم ! آپ نے اس پر فرمایا کہ پھر ایک دن روزہ رکھا کرو اور دو دن بغیر روزے کے رہا کرو ۔ انہوں نے بیان کیا کہ میں نے عرض کیا کہ میں اس سے بھی افضل طریقے کی طاقت رکھتا ہوں آپ نے فرمایا کہ پھر ایک دن روزہ رکھا کرو اور ایک دن بغیر روزہ کے رہا کرو ‘ حضرت داؤد علیہ السلام کے روزے کا طریقہ بھی یہی تھا اور یہی سب سے افضل طریقہ ہے ۔ میں نے عرض کیا ‘ یا رسول اللہ ! میں اس سے بھی افضل طریقے کی طاقت رکھتا ہوں ۔ آپ نے فرمایا کہ اس سے افضل اور کوئی طریقہ نہیں ۔",
                "urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے بیان کیا ‘ ان سے عقیل نے ‘ ان سے ابن شہاب نے ‘ انہیں سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے حضرت عبداللہ بن عمرو نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، أَخْبَرَهُ وَأَبَا، سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرٍو ـ رضى الله عنهما ـ قَالَ أُخْبِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنِّي أَقُولُ وَاللَّهِ لأَصُومَنَّ النَّهَارَ وَلأَقُومَنَّ اللَّيْلَ مَا عِشْتُ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَنْتَ الَّذِي تَقُولُ وَاللَّهِ لأَصُومَنَّ النَّهَارَ وَلأَقُومَنَّ اللَّيْلَ مَا عِشْتُ ‏\"‏ قُلْتُ قَدْ قُلْتُهُ‏.‏ قَالَ ‏\"‏ إِنَّكَ لاَ تَسْتَطِيعُ ذَلِكَ، فَصُمْ وَأَفْطِرْ، وَقُمْ وَنَمْ، وَصُمْ مِنَ الشَّهْرِ ثَلاَثَةَ أَيَّامٍ، فَإِنَّ الْحَسَنَةَ بِعَشْرِ أَمْثَالِهَا، وَذَلِكَ مِثْلُ صِيَامِ الدَّهْرِ ‏\"‏‏.‏ فَقُلْتُ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَصُمْ يَوْمًا وَأَفْطِرْ يَوْمَيْنِ ‏\"‏‏.‏ قَالَ قُلْتُ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ‏.‏ قَالَ ‏\"‏ فَصُمْ يَوْمًا وَأَفْطِرْ يَوْمًا، وَذَلِكَ صِيَامُ دَاوُدَ، وَهْوَ عَدْلُ الصِّيَامِ ‏\"‏‏.‏ قُلْتُ إِنِّي أُطِيقُ أَفْضَلَ مِنْهُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ لاَ أَفْضَلَ مِنْ ذَلِكَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3267,
                "hadithNumber": "3419",
                "englishNarrator": "Narrated `Abdullah bin `Amr bin Al-As رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said to me, \"I have been informed that you pray all the nights and observe fast all the days; is this true?\" I replied, \"Yes.\" He said, \"If you do so, your eyes will become weak and you will get bored. So fast three days a month, for this will be the fasting of a whole year, or equal to the fasting of a whole year.\" I said, \"I find myself able to fast more.\" He said, \"Then fast like the fasting of (the Prophet) David who used to fast on alternate days and would not flee on facing the enemy.\"",
                "hadithUrdu": "مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے دریافت فرمایا ‘ کیا میری یہ خبر صحیح ہے کہ تم رات بھر عبادت کرتے ہوں اور دن بھر ( روزانہ ) روزہ رکھتے ہو ؟ میں نے عرض کیا کہ جی ہاں ۔ آپ نے فرمایا لیکن تم اسی طرح کرتے رہے تو تمہاری آنکھیں کمزور ہو جائیں گی اور تمہارا جی اکتا جائے گا ۔ ہر مہینے میں تین روزے رکھا کرو کہ یہی ( ثواب کے اعتبار سے ) زندگی بھر کا روزہ ہے ‘ یا ( آپ صلی اللہ علیہ وسلم نے فرمایا کہ ) زندگی بھر کے روزے کی طرح ہے ۔ میں نے عرض کیا کہ میں اپنے میں محسوس کرتا ہوں ‘ مسعر نے بیان کیا کہ آپ کی مراد قوت سے تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر حضرت داؤد علیہ السلام کے روزے کی طرح روزے رکھا کرو ۔ وہ ایک دن روزے رکھا کرتے اور ایک دن بغیر روزے کے رہا کرتے تھے اور دشمن سے مقابلہ کرتے تو میدان سے بھاگا نہیں کرتے تھے ۔",
                "urduNarrator": "ہم سے خلاد بن یحییٰ نے بیان کیا ‘ کہا ہم سے مسعر نے بیان کیا ‘ کہا ہم سے حبیب بن ابی ثابت نے بیان کیا ‘ ان سے ابو العباس نے اور ان سے حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا مِسْعَرٌ، حَدَّثَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ، عَنْ أَبِي الْعَبَّاسِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلَمْ أُنَبَّأْ أَنَّكَ تَقُومُ اللَّيْلَ وَتَصُومُ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ فَقَالَ ‏\"‏ فَإِنَّكَ إِذَا فَعَلْتَ ذَلِكَ هَجَمَتِ الْعَيْنُ وَنَفِهَتِ النَّفْسُ، صُمْ مِنْ كُلِّ شَهْرٍ ثَلاَثَةَ أَيَّامٍ، فَذَلِكَ صَوْمُ الدَّهْرِ ـ أَوْ كَصَوْمِ الدَّهْرِ ‏\"‏‏.‏ قُلْتُ إِنِّي أَجِدُ بِي ـ قَالَ مِسْعَرٌ يَعْنِي ـ قُوَّةً‏.‏ قَالَ ‏\"‏ فَصُمْ صَوْمَ دَاوُدَ ـ عَلَيْهِ السَّلاَمُ ـ وَكَانَ يَصُومُ يَوْمًا، وَيُفْطِرُ يَوْمًا، وَلاَ يَفِرُّ إِذَا لاَقَى ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3268,
                "hadithNumber": "3420",
                "englishNarrator": "Narrated `Abdullah bin `Amr رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said to me, \"The most beloved fasting to Allah was the fasting of (the Prophet) David who used to fast on alternate days. And the most beloved prayer to Allah was the prayer of David who used to sleep for (the first) half of the night and pray for 1/3 of it and (again) sleep for a sixth of it.\"",
                "hadithUrdu": "مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا ‘ اللہ تعالیٰ کے نزدیک روزے کا سب سے پسندیدہ طریقہ داؤد علیہ السلام کا طریقہ تھا ۔ آپ ایک دن روزہ رکھتے اور ایک دن بغیر روزے کے رہتے تھے ۔ اسی طرح اللہ تعالیٰ کے نزدیک نماز کا سب سے زیادہ پسندیدہ طریقہ حضرت داؤد علیہ السلام کی نماز کا طریقہ تھا ‘ آپ آدھی رات تک سوتے اور ایک تہائی حصے میں عبادت کیا کرتے تھے ‘ پھر بقیہ چھٹے حصے میں بھی سوتے تھے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے ‘ ان سے عمرو بن دینار نے ‘ ان سے عمرو بن اوس ثقفی نے ‘ انہوں نے عبداللہ بن عمرو رضی اللہ عنہما سے سنا ۔ انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَمْرِو بْنِ أَوْسٍ الثَّقَفِيِّ، سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرٍو، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَحَبُّ الصِّيَامِ إِلَى اللَّهِ صِيَامُ دَاوُدَ، كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا، وَأَحَبُّ الصَّلاَةِ إِلَى اللَّهِ صَلاَةُ دَاوُدَ، كَانَ يَنَامُ نِصْفَ اللَّيْلِ وَيَقُومُ ثُلُثَهُ وَيَنَامُ سُدُسَهُ ‏\"‏‏.‏",
                "headingArabic": "أَحَبُّ الصَّلاَةِ إِلَى اللَّهِ صَلاَةُ دَاوُدَ",
                "headingUrdu": "اللہ کے نزدیک سب سے محبوب نماز حضرت داؤد علیہ السلام کی نماز تھی اور سب سے زیادہ محبوب صوم حضرت داؤد علیہ السلام کی نماز تھی۔",
                "headingEnglish": "The most beloved Salat to Allah was the Salat of (the Prophet) Dawud, and the most beloved Saum was the Saum of Dawud",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3269,
                "hadithNumber": "3421",
                "englishNarrator": "Narrated Mujahid:",
                "hadithEnglish": "I asked Ibn `Abbas  رضی اللہ عنہ , \"Should we perform a prostration on reciting Surat-Sa`d?\" He recited (the Sura) including: 'And among his progeny, David, Solomon..(up to)...so follow their guidance (6.84-91) And then he said, \"Your Prophet is amongst those people who have been ordered to follow them (i.e. the preceding apostles).",
                "hadithUrdu": "میں نے حضرت عباس رضی اللہ عنہ سے پوچھا ، کیا میں سورۃ ص میں سجدہ کیا کروں ؟ تو انہوں نے آیت ” » ومن ذریتہ داود وسلیمان « “ تلاوت کی ” » فبھداھم اقتدہ « “ تک نیز انہوں نے کہا کہ تمہارے نبی کریم صلی اللہ علیہ وسلم ان لوگوں میں سے تھے جنہیں انبیاء علیہم السلام کی اقتداء کا حکم تھا ۔",
                "urduNarrator": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے سہل بن یوسف نے بیان کیا ، کہا میں نے عوام سے سنا ، ان سے مجاہد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا سَهْلُ بْنُ يُوسُفَ، قَالَ سَمِعْتُ الْعَوَّامَ، عَنْ مُجَاهِدٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ أَسْجُدُ فِي ‏{‏ص‏}‏ فَقَرَأَ ‏{‏وَمِنْ ذُرِّيَّتِهِ دَاوُدَ وَسُلَيْمَانَ‏}‏ حَتَّى أَتَى ‏{‏فَبِهُدَاهُمُ اقْتَدِهْ‏}‏ فَقَالَ نَبِيُّكُمْ صلى الله عليه وسلم مِمَّنْ أُمِرَ أَنْ يَقْتَدِيَ بِهِمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور ہمارے بندے داؤد کو یاد کرو، جو قدرت والا تھا۔‘‘",
                "headingEnglish": "The Statement of Allah Taa'la: \"... And remember Our slave Dawud, endued with power...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3270,
                "hadithNumber": "3422",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The prostration in Sura-Sa`d is not amongst the compulsory prostrations, though I saw the Prophet (ﷺ) prostrating on reciting it.",
                "hadithUrdu": "سورۃ ص کا سجدہ ضروری نہیں ، لیکن میں نے نبی کریم صلی اللہ علیہ وسلم کو اس سورۃ میں سجدہ کرتے دیکھا ہے ۔",
                "urduNarrator": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے وہب نے بیان کیا ، ان سے ایوب نے بیان کیا ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَيْسَ ‏{‏ص‏}‏ مِنْ عَزَائِمِ السُّجُودِ، وَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَسْجُدُ فِيهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3271,
                "hadithNumber": "3423",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"A strong demon from the Jinns came to me yesterday suddenly, so as to spoil my prayer, but Allah enabled me to overpower him, and so I caught him and intended to tie him to one of the pillars of the Mosque so that all of you might see him, but I remembered the invocation of my brother Solomon: 'And grant me a kingdom such as shall not belong to any other after me.' (38.35) so I let him go cursed.\" ( عِفْرِيتٌ) means refractory whether it is a human being or a jinnee like \" زِبْنِيَةٍ \" whose plural is \"الزَّبَانِيَةُ\" .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، ایک سرکش جن کل رات میرے سامنے آ گیا تاکہ میری نماز خراب کر دے لیکن اللہ تعالیٰ نے مجھے اس پر قدرت دے دی اور میں نے اسے پکڑ لیا ۔ پھر میں نے چاہا کہ اسے مسجد کے کسی ستون سے باندھ دوں کہ تم سب لوگ بھی دیکھ سکو ۔ لیکن مجھے اپنے بھائی سلیمان علیہ السلام کی دعا یاد آ گئی کہ ” یا اللہ ! مجھے ایسی سلطنت دے جو میرے سوا کسی کو میسر نہ ہو ، ، اس لئے میں نے اسے نامراد واپس کر دیا ۔ عفریت سرکش کے معنی میں ہے ، خواہ انسانوں میں سے ہو یا جنوں میں سے ۔",
                "urduNarrator": "ہم سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے محمد بن زیاد نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ إِنَّ عِفْرِيتًا مِنَ الْجِنِّ تَفَلَّتَ الْبَارِحَةَ لِيَقْطَعَ عَلَىَّ صَلاَتِي، فَأَمْكَنَنِي اللَّهُ مِنْهُ، فَأَخَذْتُهُ، فَأَرَدْتُ أَنْ أَرْبُطَهُ عَلَى سَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ حَتَّى تَنْظُرُوا إِلَيْهِ كُلُّكُمْ فَذَكَرْتُ دَعْوَةَ أَخِي سُلَيْمَانَ رَبِّ هَبْ لِي مُلْكًا لاَ يَنْبَغِي لأَحَدٍ مِنْ بَعْدِي‏.‏ فَرَدَدْتُهُ خَاسِئًا ‏\"‏‏.‏ عِفْرِيتٌ مُتَمَرِّدٌ مِنْ إِنْسٍ أَوْ جَانٍّ، مِثْلُ زِبْنِيَةٍ جَمَاعَتُهَا الزَّبَانِيَةُ‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {وَوَهَبْنَا لِدَاوُدَ سُلَيْمَانَ نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: \"اور داؤد کو ہم نے سلیمان (بیٹا) عطا کیا، کتنا اچھا غلام تھا کہ وہ ہمیشہ توبہ کرنے والا تھا۔\" (38.30)",
                "headingEnglish": "The Statement of Allah Taa'la: \"And to Dawud, We gave Sulaiman (for a son). How excellent (a) slave he was ever oft-returning in repentance (to us)\" (38.30)",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3272,
                "hadithNumber": "3424",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Solomon (the son of) David said, 'Tonight I will sleep with seventy ladies each of whom will conceive a child who will be a knight fighting for \"Allah's Cause.' His companion said, 'If Allah will.' But Solomon did not say so; therefore none of those women got pregnant except one who gave birth to a half child.\" The Prophet (ﷺ) further said, \"If the Prophet (ﷺ) Solomon had said it (i.e. 'If Allah will') he would have begotten children who would have fought in Allah's Cause.\" Shuaib and Ibn Abi Az-Zinad said, \"Ninety (women) is more correct (than seventy).",
                "hadithUrdu": "آج رات میں اپنی ستر بیویوں کے پاس جاؤں گا اور ہر بیوی ایک شہسوار جنے گی جو اللہ کے راستے میں جہاد کرے گا ۔ ان کے ساتھی نے کہا انشاءاللہ ، لیکن انہوں نے نہیں کہا ۔ چنانچہ کسی بیوی کے یہاں بھی بچہ پیدا نہیں ہوا ، صرف ایک کے یہاں ہوا اور اس کی بھی ایک جانب بیکار تھی ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر سلیمان علیہ السلام انشاءاللہ کہہ لیتے ( تو سب کے یہاں بچے پیدا ہوتے ) اور اللہ کے راستے میں جہاد کرتے ۔ شعیب اور ابن ابی الزناد نے بجائے ستر کے ) نوے کہا ہے اور یہی بیان زیادہ صحیح ہے ۔",
                "urduNarrator": "ہم سے خالد بن مخلد نے بیان کیا ، کہا ہم سے مغیرہ بن عبدالرحمان نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، سلیمان بن داؤد علیہما السّلام نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا مُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ قَالَ سُلَيْمَانُ بْنُ دَاوُدَ لأَطُوفَنَّ اللَّيْلَةَ عَلَى سَبْعِينَ امْرَأَةً تَحْمِلُ كُلُّ امْرَأَةٍ فَارِسًا يُجَاهِدُ فِي سَبِيلِ اللَّهِ، فَقَالَ لَهُ صَاحِبُهُ إِنْ شَاءَ اللَّهُ‏.‏ فَلَمْ يَقُلْ، وَلَمْ تَحْمِلْ شَيْئًا إِلاَّ وَاحِدًا سَاقِطًا إِحْدَى شِقَّيْهِ ‏\"‏‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ قَالَهَا لَجَاهَدُوا فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏ قَالَ شُعَيْبٌ وَابْنُ أَبِي الزِّنَادِ ‏\"‏ تِسْعِينَ ‏\"‏‏.‏ وَهْوَ أَصَحُّ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3273,
                "hadithNumber": "3425",
                "englishNarrator": "Narrated Abu Dhaar رضی اللہ عنہ :",
                "hadithEnglish": "I said, \"O Allah's Messenger (ﷺ)! Which mosque was built first?\" He replied, \"Al-Masjid-ul-Haram.\" I asked, \"Which (was built) next?\" He replied, \"Al-Masjid-ul-Aqs-a (i.e. Jerusalem).\" I asked, \"What was the period in between them?\" He replied, \"Forty (years).\" He then added, \"Wherever the time for the prayer comes upon you, perform the prayer, for all the earth is a place of worshipping for you.\"",
                "hadithUrdu": "میں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا ، یا رسول اللہ ! سب سے پہلے کون سی مسجد بنائی گئی تھی ؟ فرمایا کہ مسجدالحرام ! میں نے سوال کیا ، اس کے بعد کون سی ؟ فرمایا کہ مسجدالاقصیٰ ۔ میں نے سوال کیا اور ان دونوں کی تعمیر کا درمیانی فاصلہ کتنا تھا ؟ فرمایا کہ چالیس سال ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جس جگہ بھی نماز کا وقت ہو جائے فوراً نماز پڑھ لو ۔ تمہارے لئے تمام روئے زمین مسجد ہے ۔",
                "urduNarrator": "مجھ سے عمر بن حفص نے بیان کیا ، کہا ہم سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا ہم سے ابراہیم تیمی نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت ابوذررضی اللہ عنہ بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا إِبْرَاهِيمُ التَّيْمِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ‏.‏ أَىُّ مَسْجِدٍ وُضِعَ أَوَّلُ قَالَ ‏\"‏ الْمَسْجِدُ الْحَرَامُ ‏\"‏‏.‏ قُلْتُ ثُمَّ أَىٌّ قَالَ ‏\"‏ ثُمَّ الْمَسْجِدُ الأَقْصَى ‏\"‏‏.‏ قُلْتُ كَمْ كَانَ بَيْنَهُمَا قَالَ ‏\"‏ أَرْبَعُونَ ‏\"‏‏.‏ ثُمَّ قَالَ ‏\"‏ حَيْثُمَا أَدْرَكَتْكَ الصَّلاَةُ فَصَلِّ، وَالأَرْضُ لَكَ مَسْجِدٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3274,
                "hadithNumber": "3426, 3427",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"My example and the example o the people is like that of a person who lit a fire and let the moths, butterflies and these insects fall in it.\" He also said, \"There were two women, each of whom had a child with her. A wolf came and took away the child of one of them, whereupon the other said, 'It has taken your child.' The first said, 'But it has taken your child.' So they both carried the case before David who judged that the living child be given to the elder lady. So both of them went to Solomon bin David and informed him (of the case). He said, 'Bring me a knife so as to cut the child into two pieces and distribute it between them.' The younger lady said, 'May Allah be merciful to you! Don't do that, for it is her (i.e. the other lady's) child.' So he gave the child to the younger lady.\" Hadrat Abu Hurairah رضی اللہ عنہ says: I first time heard the word \"سکین\" on that very day; otherwise, we would call a knife \"الْمُدْيَةُ\" .",
                "hadithUrdu": "آپ نے فرمایا کہ میری اور تمام انسانوں کی مثال ایک ایسے شخص کی سی ہے جس نے آگ روشن کی ہو ۔ پھر پروانے اور کیڑے مکوڑے اس میں گرنے لگے ہوں ۔اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ دو عورتیں تھیں اور دونوں کے ساتھ دونوں کے بچے تھے ۔ اتنے میں ایک بھیڑیا آیا اور ایک عورت کے بچے کو اٹھا لے گیا ۔ ان دونوں میں سے ایک عورت نے کہا بھیڑیا تمہارے بیٹے کو لے گیا ہے اور دوسری نے کہا کہ تمہارے بیٹے کو لے گیا ہے ۔ دونوں داؤد علیہ السلام کے یہاں اپنا مقدمہ لے گئیں ۔ آپ نے بڑی عورت کے حق میں فیصلہ کر دیا ۔ اس کے بعد وہ دونوں حضرت سلیمان بن داؤد علیہ السلام کے یہاں آئیں اور انہیں اس جھگڑے کی خبر دی ۔ انہوں نے فرمایا کہ اچھا چھری لاؤ ۔ اس بچے کے دو ٹکڑے کر کے دونوں کے درمیان بانٹ دوں ۔ چھوٹی عورت نے یہ سن کر کہا ، اللہ آپ پر رحم فرمائے ایسا نہ کیجئے ، میں نے مان لیا کہ اسی بڑی کا لڑکا ہے ۔ اس پر سلیمان علیہ السلام نے اس چھوٹی کے حق میں فیصلہ کیا ۔ حضرت ابوہریرہ رضی اللہ عنہ نے کہا کہ میں نے سکین کا لفظ اسی دن سنا ، ورنہ ہم ہمیشہ ( چھری کے لئے ) مدیہ کا لفظ بولا کرتے تھے ۔",
                "urduNarrator": "ہم سے ابواالیمان نے بیان کیا ، کہا ہم کوشعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے عبدالرحمان نے بیان کیا ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا اور انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ،",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَثَلِي وَمَثَلُ النَّاسِ كَمَثَلِ رَجُلٍ اسْتَوْقَدَ نَارًا، فَجَعَلَ الْفَرَاشُ وَهَذِهِ الدَّوَابُّ تَقَعُ فِي النَّارِ ‏\"‏‏.وَقَالَ ‏\"‏ كَانَتِ امْرَأَتَانِ مَعَهُمَا ابْنَاهُمَا جَاءَ الذِّئْبُ فَذَهَبَ بِابْنِ إِحْدَاهُمَا، فَقَالَتْ صَاحِبَتُهَا إِنَّمَا ذَهَبَ بِابْنِكِ‏.‏ وَقَالَتِ الأُخْرَى إِنَّمَا ذَهَبَ بِابْنِكِ‏.‏ فَتَحَاكَمَتَا إِلَى دَاوُدَ، فَقَضَى بِهِ لِلْكُبْرَى فَخَرَجَتَا عَلَى سُلَيْمَانَ بْنِ دَاوُدَ فَأَخْبَرَتَاهُ‏.‏ فَقَالَ ائْتُونِي بِالسِّكِّينِ أَشُقُّهُ بَيْنَهُمَا‏.‏ فَقَالَتِ الصُّغْرَى لاَ تَفْعَلْ يَرْحَمُكَ اللَّهُ، هُوَ ابْنُهَا‏.‏ فَقَضَى بِهِ لِلصُّغْرَى ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ وَاللَّهِ إِنْ سَمِعْتُ بِالسِّكِّينِ إِلاَّ يَوْمَئِذٍ، وَمَا كُنَّا نَقُولُ إِلاَّ الْمُدْيَةُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3275,
                "hadithNumber": "3428",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "When the Verse:-- 'Those who believe and mix not their belief with wrong.\" was revealed, the companions of the Prophet (ﷺ) said, \"Who amongst us has not mixed his belief with wrong?\" Then Allah revealed: \"Join none in worship with Allah, Verily joining others in worship with Allah is a great wrong indeed.\"",
                "hadithUrdu": "جب آیت ” جو لوگ ایمان لائے اور اپنے ایمان میں ظلم کی ملاوٹ نہیں کی “ نازل ہوئی تو نبی کریم صلی اللہ علیہ وسلم کے صحابہ نے عرض کیا ” ہم میں ایسا کون ہو گا جس نے اپنے ایمان میں ظلم نہیں کیا ہو گا “ ۔ اس پر یہ آیت نازل ہوئی ” اللہ کے ساتھ کسی کو شریک نہ ٹھہرا ۔ بیشک شرک ہی ظلم عظیم ہے “ ۔",
                "urduNarrator": "ہم سے ابو الولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے اعمش نے ، ان سے ابراہیم نے ، ان سے علقمہ نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ لَمَّا نَزَلَتِ ‏{‏الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏}‏ قَالَ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم أَيُّنَا لَمْ يَلْبِسْ إِيمَانَهُ بِظُلْمٍ فَنَزَلَتْ ‏{‏لاَ تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ ‏}‏",
                "headingArabic": "قَوْلُ اللَّهِ تَعَالَى: {وَلَقَدْ آتَيْنَا لُقْمَانَ الْحِكْمَةَ أَنِ اشْكُرْ لِلَّهِ} إِلَى قَوْلِهِ: {إِنَّ اللَّهَ لاَ يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: ’’اور ہم نے لقمان کو حکمت عطا کی۔‘‘",
                "headingEnglish": "The Statement of Allah Taa'la: \"And indeed We bestowed upon Luqman Al-Hikmah...\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3276,
                "hadithNumber": "3429",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "When the Verse:-- 'Those who believe and mix not their belief with wrong.' was revealed, the Muslims felt it very hard on them and said, \"O Allah's Messenger (ﷺ)! Who amongst us does not do wrong to himself?\" He replied, \"The Verse does not mean this. But that (wrong) means to associate others in worship to Allah: Don't you listen to what Luqman علیہ السلام said to his son when he was advising him,\" O my son! Join not others in worship with Allah. Verily joining others in worship with Allah is a great wrong indeed.\" (31.13)",
                "hadithUrdu": "جب آیت ” جو لوگ ایمان لائے اور اپنے ایمان کے ساتھ ظلم کی ملاوٹ نہیں کی ، ، نازل ہوئی تو مسلمانوں پر بڑا شاق گزرا اور انہوں نے عرض کیا ہم میں کون ایسا ہو سکتا ہے جس نے اپنے ایمان کے ساتھ ظلم کی ملاوٹ نہ کی ہو گی ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس کا یہ مطلب نہیں ، ظلم سے مراد آیت میں شرک ہے ۔ کیا تم نے نہیں سنا کہ حضرت لقمان علیہ السلام نے اپنے بیٹے سے کہا تھا اسے نصیحت کرتے ہوئے کہ ، ، اے بیٹے ! اللہ تعالیٰ کے ساتھ کسی کو شریک نہ ٹھہرا ، بیشک شرک بڑا ہی ظلم ہے ۔",
                "urduNarrator": "مجھ سے اسحاق بن راہویہ نے بیان کیا ، کہا ہم کو عیسیٰ بن یونس نے خبر دی ، کہا ہم سے اعمش نے بیان کیا ، ان سے ابراہیم نخعی نے ، ان سے علقمہ نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ لَمَّا نَزَلَتِ ‏{‏الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏}‏ شَقَّ ذَلِكَ عَلَى الْمُسْلِمِينَ، فَقَالُوا يَا رَسُولَ اللَّهِ، أَيُّنَا لاَ يَظْلِمُ نَفْسَهُ قَالَ ‏\"‏ لَيْسَ ذَلِكَ، إِنَّمَا هُوَ الشِّرْكُ، أَلَمْ تَسْمَعُوا مَا قَالَ لُقْمَانُ لاِبْنِهِ وَهْوَ يَعِظُهُ ‏{‏يَا بُنَىَّ لاَ تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ ‏}‏‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3277,
                "hadithNumber": "3430",
                "englishNarrator": "Narrated Malik bin Sasaa رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) talked to them about the night of his Ascension to the Heavens. He said, \"(Then Gabriel علیہ السلام took me) and ascended up till he reached the second heaven where he asked for the gate to be opened, but it was asked, 'Who is it?' Gabriel علیہ السلام replied, 'I am Gabriel علیہ السلام.' It was asked, 'Who is accompanying you?' He replied, 'Muhammad.' It was asked, 'Has he been called?' He said, 'Yes.' When we reached over the second heaven, I saw Yahya (i.e. John) and Jesus who were cousins. Gabriel علیہ السلام said, 'These are John (Yahya) and Jesus, so greet them.' I greeted them and they returned the greeting saying, 'Welcome, O Pious Brother and Pious Prophet!;' \"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے شب معراج کے متعلق بیان فرمایا کہ پھر آپ اوپر چڑھے اور دوسرے آسمان پر تشریف لے گئے ۔ پھر دروازہ کھولنے کے لئے کہا ۔ پوچھا گیا ، کون ہیں ؟ کہا کہ جبرائیل علیہ السلام ۔ پوچھا گیا ، آپ کے ساتھ کون ہیں ؟ کہا کہ محمد صلی اللہ علیہ وسلم ۔ پوچھا گیا ، کیا انہیں لانے کے لیے بھیجا ، کہا کہ جی ہاں ۔ پھر جب میں وہاں پہنچا تو عیسیٰ اور یحییٰ علیہماالسلام وہاں موجود تھے ۔ یہ دونوں نبی آپس میں خالہ زاد بھائی ہیں ۔ جبرائیل علیہ السلام نے بتایا کہ یہ یحییٰ اور عیسیٰ علیہما السلام ہیں ۔ انہیں سلام کیجئے ۔ میں نے سلام کیا ، دونوں نے جواب دیا اور کہا خوش آمدید نیک بھائی اور نیک نبی ۔",
                "urduNarrator": "ہم سے ہدبہ بن خالد نے بیان کیا ، انہوں نے کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، انہوں نے کہا ہم سے قتادہ نے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے اور ان سے مالک بن صعصعہ  رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ مَالِكِ بْنِ صَعْصَعَةَ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم حَدَّثَهُمْ عَنْ لَيْلَةَ أُسْرِيَ ‏ \"‏ ثُمَّ صَعِدَ حَتَّى أَتَى السَّمَاءَ الثَّانِيَةَ فَاسْتَفْتَحَ، قِيلَ مَنْ هَذَا قَالَ جِبْرِيلُ‏.‏ قِيلَ وَمَنْ مَعَكَ قَالَ مُحَمَّدٌ‏.‏ قِيلَ وَقَدْ أُرْسِلَ إِلَيْهِ قَالَ نَعَمْ‏.‏ فَلَمَّا خَلَصْتُ، فَإِذَا يَحْيَى وَعِيسَى وَهُمَا ابْنَا خَالَةٍ‏.‏ قَالَ هَذَا يَحْيَى وَعِيسَى فَسَلِّمْ عَلَيْهِمَا‏.‏ فَسَلَّمْتُ فَرَدَّا ثُمَّ قَالاَ مَرْحَبًا بِالأَخِ الصَّالِحِ وَالنَّبِيِّ الصَّالِحِ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {ذِكْرُ رَحْمَةِ رَبِّكَ عَبْدَهُ زَكَرِيَّاءَ إِذْ نَادَى رَبَّهُ نِدَاءً خَفِيًّا قَالَ رَبِّ إِنِّي وَهَنَ الْعَظْمُ مِنِّي وَاشْتَعَلَ الرَّأْسُ شَيْبًا} إِلَى قَوْلِهِ: {لَمْ نَجْعَلْ لَهُ مِنْ قَبْلُ سَمِيًّا}",
                "headingUrdu": "اللہ تعالیٰ کا فرمان ہے: (یہ) تیرے رب کی اس کے بندے زکریا (زکریا) پر رحمت کا ذکر ہے۔",
                "headingEnglish": "The Statement of Allah Taa'la: \"(This is) a mention of the mercy of your Lord to His slave Zakariya (Zachariah)\"",
                "chapterId": "61",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 61,
                    "chapterNumber": "61",
                    "chapterEnglish": "Prophets",
                    "chapterUrdu": "انبیاء علیہم السلام کے بیان میں",
                    "chapterArabic": "كتاب أحاديث الأنبياء",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 3251,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=130",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=128",
                "label": "128",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=129",
                "label": "129",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=130",
                "label": "130",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=131",
                "label": "131",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=132",
                "label": "132",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=133",
                "label": "133",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=134",
                "label": "134",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=132",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=132",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=130",
        "to": 3275,
        "total": 40465
    }
}