{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 222,
        "data": [
            {
                "id": 5528,
                "hadithNumber": "5776",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"No 'Adwa nor Tiyara; but I like Fal.\" They said, \"What is the Fal?\" He said, \"A good word.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا چھوت لگنا کوئی چیز نہیں ہے اور بد شگونی نہیں ہے البتہ نیک فال مجھے پسند ہے ۔ صحابی نے عرض کیا نیک فال کیا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اچھی بات منہ سے نکالنا یا کسی سے سن لینا ۔",
                "urduNarrator": "مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے ابن جعفر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، کہا کہ میں نے قتادہ سے سنا اور انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ عَدْوَى، وَلاَ طِيَرَةَ، وَيُعْجِبُنِي الْفَأْلُ ‏\"‏‏.‏ قَالُوا وَمَا الْفَأْلُ قَالَ ‏\"‏ كَلِمَةٌ طَيِّبَةٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5529,
                "hadithNumber": "5777",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "When Khaibar was conquered, Allah's Messenger (ﷺ) was presented with a poisoned (roasted) sheep. Allah's Apostle said, \"Collect for me all the Jews present in this area.\" (When they were gathered) Allah's Apostle said to them, \"I am going to ask you about something; will you tell me the truth?\" They replied, \"Yes, O Abal-Qasim!\" Allah's Messenger (ﷺ) said to them, \"Who is your father?\" They said, \"Our father is so-and-so.\" Allah's Messenger (ﷺ) said, \"You have told a lie. for your father is so-and-so,\" They said, \"No doubt, you have said the truth and done the correct thing.\" He again said to them, \"If I ask you about something; will you tell me the truth?\" They replied, \"Yes, O Abal-Qasim! And if we should tell a lie you will know it as you have known it regarding our father,\" Allah's Messenger (ﷺ) then asked, \"Who are the people of the (Hell) Fire?\" They replied, \"We will remain in the (Hell) Fire for a while and then you (Muslims) will replace us in it\" Allah's Messenger (ﷺ) said to them. ''You will abide in it with ignominy. By Allah, we shall never replace you in it at all.\" Then he asked them again, \"If I ask you something, will you tell me the truth?\" They replied, \"Yes.\" He asked. \"Have you put the poison in this roasted sheep?\" They replied, \"Yes,\" He asked, \"What made you do that?\" They replied, \"We intended to learn if you were a liar in which case we would be relieved from you, and if you were a prophet then it would not harm you.\"",
                "hadithUrdu": "جب خیبر فتح ہوا تو رسول اللہ صلی اللہ علیہ وسلم کو ایک بکری ہدیہ میں پیش کی گئی ( ایک یہودی عورت زینب بنت حرث نے پیش کی تھی ) جس میں زہر بھرا ہوا تھا ، اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہاں پر جتنے یہودی ہیں انہیں میرے پاس جمع کرو ۔ چنانچہ سب آنحضرت صلی اللہ علیہ وسلم کے پاس جمع کئے گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں تم سے ایک بات پوچھو ں گا کیا تم مجھے صحیح صحیح بات بتا دو گے ؟ انہوں نے کہا کہ ہاں اے ابوالقاسم ! پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا تمہارا پردادا کون ہے ؟ انہوں نے کہا کہ فلاں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم جھوٹ کہتے ہو تمہارا پردادا تو فلاں ہے ۔ اس پر وہ بولے کہ آپ نے سچ فرمایا درست فرمایا پھر آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کیا اگر میں تم سے کوئی بات پوچھوں گا تو تم مجھے سچ سچ بتا دوگے ؟ انہوں نے کہا کہ ہاں اے ابوالقاسم ! اور اگر ہم جھوٹ بولیں بھی تو آپ ہمارا جھوٹ پکڑ لیں گے جیسا کہ ابھی ہمارے پردادا کے متعلق آپ نے ہمارا جھوٹ پکڑ لیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا دوزخ والے کون لوگ ہیں ؟ انہوں نے کہا کہ کچھ دن کے لیے تو ہم اس میں رہیں گے پھر آپ لوگ ہماری جگہ لے لیں گے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تم اس میں ذلت کے ساتھ پڑے رہو گے ، واللہ ! ہم اس میں تمہاری جگہ کبھی نہیں لیں گے ۔ آپ نے پھر ان سے دریافت فرمایا کیا اگر میں تم سے ایک بات پوچھوں تو تم مجھے اس کے متعلق صحیح صحیح بتا دو گے ؟ انہوں نے کہا کہ ہاں ؟ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کیا تم نے اس بکری میں زہر ملایا تھا ، انہوں نے کہا کہ ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کہ تمہیں اس کام پر کس جذبہ نے آمادہ کیا تھا ؟ انہوں نے کہا کہ ہمارا مقصد یہ تھا کہ اگر آپ جھوٹے ہوں گے تو ہمیں آپ سے نجات مل جائے گی اور اگرسچے ہوں گے تو آپ کو نقصان نہیں پہنچا سکے گا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے ، ان سے سعید بن ابی سعید نے اور ان سے ابوہریرہ رضی اللہ عنہ نے ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ لَمَّا فُتِحَتْ خَيْبَرُ أُهْدِيَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم شَاةٌ فِيهَا سَمٌّ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اجْمَعُوا لِي مَنْ كَانَ هَا هُنَا مِنَ الْيَهُودِ ‏\"‏‏.‏ فَجُمِعُوا لَهُ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي سَائِلُكُمْ عَنْ شَىْءٍ فَهَلْ أَنْتُمْ صَادِقِيَّ عَنْهُ ‏\"‏‏.‏ فَقَالُوا نَعَمْ يَا أَبَا الْقَاسِمِ‏.‏ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَبُوكُمْ ‏\"‏‏.‏ قَالُوا أَبُونَا فُلاَنٌ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَذَبْتُمْ بَلْ أَبُوكُمْ فُلاَنٌ ‏\"‏‏.‏ فَقَالُوا صَدَقْتَ وَبَرِرْتَ‏.‏ فَقَالَ ‏\"‏ هَلْ أَنْتُمْ صَادِقِيَّ عَنْ شَىْءٍ إِنْ سَأَلْتُكُمْ عَنْهُ ‏\"‏‏.‏ فَقَالُوا نَعَمْ يَا أَبَا الْقَاسِمِ، وَإِنْ كَذَبْنَاكَ عَرَفْتَ كَذِبَنَا كَمَا عَرَفْتَهُ فِي أَبِينَا‏.‏ قَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَهْلُ النَّارِ ‏\"‏‏.‏ فَقَالُوا نَكُونُ فِيهَا يَسِيرًا، ثُمَّ تَخْلُفُونَنَا فِيهَا‏.‏ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اخْسَئُوا فِيهَا، وَاللَّهِ لاَ نَخْلُفُكُمْ فِيهَا أَبَدًا ‏\"‏‏.‏ ثُمَّ قَالَ لَهُمْ ‏\"‏ فَهَلْ أَنْتُمْ صَادِقِيَّ عَنْ شَىْءٍ إِنْ سَأَلْتُكُمْ عَنْهُ ‏\"‏‏.‏ قَالُوا نَعَمْ‏.‏ فَقَالَ ‏\"‏ هَلْ جَعَلْتُمْ فِي هَذِهِ الشَّاةِ سُمًّا ‏\"‏‏.‏ فَقَالُوا نَعَمْ‏.‏ فَقَالَ ‏\"‏ مَا حَمَلَكُمْ عَلَى ذَلِكَ ‏\"‏‏.‏ فَقَالُوا أَرَدْنَا إِنْ كُنْتَ كَذَّابًا نَسْتَرِيحُ مِنْكَ، وَإِنْ كُنْتَ نَبِيًّا لَمْ يَضُرَّكَ‏.‏",
                "headingArabic": "مَا يُذْكَرُ فِي سَمِّ النَّبِيِّ صلى الله عليه وسلم",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو دیا گیا زہر",
                "headingEnglish": "The poison given to the Prophet (ﷺ)",
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5530,
                "hadithNumber": "5778",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever purposely throws himself from a mountain and kills himself, will be in the (Hell) Fire falling down into it and abiding therein perpetually forever; and whoever drinks poison and kills himself with it, he will be carrying his poison in his hand and drinking it in the (Hell) Fire wherein he will abide eternally forever; and whoever kills himself with an iron weapon, will be carrying that weapon in his hand and stabbing his `Abdomen with it in the (Hell) Fire wherein he will abide eternally forever.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے پہاڑ سے اپنے آپ کو گرا کر خودکشی کر لی وہ جہنم کی آگ میں ہو گا اور اس میں ہمیشہ پڑا رہے گا اور جس نے زہر پی کر خودکشی کر لی وہ زہر اس کے ساتھ میں ہو گا اور جہنم کی آگ میں وہ اسے اسی طرح ہمیشہ پیتا رہے گا اور جس نے لوہے کے کسی ہتھیار سے خودکشی کر لی تو اس کا ہتھیار اس کے ساتھ میں ہو گا اور جہنم کی آگ میں ہمیشہ کے لیے وہ اسے اپنے پیٹ میں مارتا رہے گا ۔",
                "urduNarrator": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، انہوں نے کہا ہم سے خالد بن حارث نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے سلیمان نے بیان کیا ، انہوں نے کہا کہ میں نے ذکوان سے سنا ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے یہ حدیث بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، قَالَ سَمِعْتُ ذَكْوَانَ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ تَرَدَّى مِنْ جَبَلٍ فَقَتَلَ نَفْسَهُ، فَهْوَ فِي نَارِ جَهَنَّمَ، يَتَرَدَّى فِيهِ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا، وَمَنْ تَحَسَّى سَمًّا فَقَتَلَ نَفْسَهُ، فَسَمُّهُ فِي يَدِهِ، يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا، وَمَنْ قَتَلَ نَفْسَهُ بِحَدِيدَةٍ، فَحَدِيدَتُهُ فِي يَدِهِ، يَجَأُ بِهَا فِي بَطْنِهِ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا ‏\"‏‏.‏",
                "headingArabic": "رْبِ السُّمِّ، وَالدَّوَاءِ بِهِ، وَبِمَا يُخَافُ مِنْهُ وَالْخَبِيثِ",
                "headingUrdu": "زہر پینا اور اس سے علاج کرنا",
                "headingEnglish": "The taking of poison and treating with it",
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5531,
                "hadithNumber": "5779",
                "englishNarrator": "Narrated Sa`d:",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"Whoever takes seven 'Ajwa dates in the morning will not be effected by magic or poison on that day.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص صبح کے وقت سات عجوہ کھجوریں کھا لے اسے اس دن زہر نقصان پہنچا سکے گا اور نہ جادو ۔",
                "urduNarrator": "ہم سے محمد بن سلام بیکندی نے بیان کیا ، انہوں نے کہا ہم کو احمد بن بشیر ابوبکرنے خبر دی ، انہوں نے کہا ہم کو ہاشم بن ہاشم نے خبر دی ، کہا کہ مجھے عامر بن سعد نے خبر دی ، انہوں نے کہا کہ میں نے اپنے والد سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَحْمَدُ بْنُ بَشِيرٍ أَبُو بَكْرٍ، أَخْبَرَنَا هَاشِمُ بْنُ هَاشِمٍ، قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدٍ، قَالَ سَمِعْتُ أَبِي يَقُولُ، سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنِ اصْطَبَحَ بِسَبْعِ تَمَرَاتٍ عَجْوَةٍ لَمْ يَضُرَّهُ ذَلِكَ الْيَوْمَ سَمٌّ وَلاَ سِحْرٌ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5532,
                "hadithNumber": "5780",
                "englishNarrator": "Narrated Abu Tha`laba Al-Khushani رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) forbade the eating of wild animals having fangs. (Az-Zuhri said: I did not hear this narration except when I went to Sham.)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے ہر دانت سے کھانے والے درندہ جانور ( کے گوشت ) سے منع فرمایا ۔ زہری نے بیان کیا کہ میں نے یہ حدیث اس وقت تک نہیں سنی جب تک شام نہیں آیا ۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے زہری نے ، ان سے ابو ادریس خولانی نے اور ان سے ابو ثعلبہ خشنی رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، رضى الله عنه قَالَ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنَ السَّبُعِ‏.‏ قَالَ الزُّهْرِيُّ وَلَمْ أَسْمَعْهُ حَتَّى أَتَيْتُ الشَّأْمَ‏.",
                "headingArabic": "أَلْبَانِ الأُتُنِ",
                "headingUrdu": "گدھی کا دودھ",
                "headingEnglish": "The milk of she-asses",
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5533,
                "hadithNumber": "5782",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If a fly falls in the vessel of any of you, let him dip all of it (into the vessel) and then throw it away, for in one of its wings there is a disease and in the other there is healing (antidote for it) i e. the treatment for that disease.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب مکھی تم میں سے کسی کے برتن میں پڑ جائے تو پوری مکھی کو برتن میں ڈبو دے اور پھر اسے نکال کر پھینک دے کیونکہ اس کے ایک پر میں شفاء ہے اور دوسرے میں بیماری ہے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، انہوں نے کہا ہم سے بنی تمیم کے مولیٰ عتبہ بن مسلم نے بیان کیا ، ان سے بنی زریق کے مولیٰ عبید بن حنین نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عُتْبَةَ بْنِ مُسْلِمٍ، مَوْلَى بَنِي تَيْمٍ عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، مَوْلَى بَنِي زُرَيْقٍ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا وَقَعَ الذُّبَابُ فِي إِنَاءِ أَحَدِكُمْ، فَلْيَغْمِسْهُ كُلَّهُ، ثُمَّ لْيَطْرَحْهُ، فَإِنَّ فِي أَحَدِ جَنَاحَيْهِ شِفَاءً وَفِي الآخَرِ دَاءً ‏\"‏‏.‏",
                "headingArabic": "إِذَا وَقَعَ الذُّبَابُ فِي الإِنَاءِ",
                "headingUrdu": "اگر گھر کی مکھی برتن میں گر جائے۔",
                "headingEnglish": "If a housefly falls in a utensil",
                "chapterId": "77",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 77,
                    "chapterNumber": "77",
                    "chapterEnglish": "Medicine",
                    "chapterUrdu": "دوا اور علاج کے بیان میں",
                    "chapterArabic": "كتاب الطب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5534,
                "hadithNumber": "5783",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, 'Allah will not look at the person who drags his garment (behind him) out of conceit.''",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ اس کی طرف قیامت کے دن نظر رحمت نہیں کرے گا جو اپنا کپڑا تکبر و غرور سے زمین پر گھسیٹ کر چلتا ہے ۔",
                "urduNarrator": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا مجھ سے امام مالک نے ، انہوں نے نافع اور عبداللہ بن دینار اور زید بن اسلم سے ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، وَزَيْدِ بْنِ أَسْلَمَ، يُخْبِرُونَهُ عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَنْظُرُ اللَّهُ إِلَى مَنْ جَرَّ ثَوْبَهُ خُيَلاَءَ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ اللَّهِ تَعَالَى: {قُلْ مَنْ حَرَّمَ زِينَةَ اللَّهِ الَّتِي أَخْرَجَ لِعِبَادِهِ}",
                "headingUrdu": "’’کہہ دو کہ اللہ کے دیے ہوئے کپڑوں کی زینت کو کس نے حرام کیا ہے جو اس نے اپنے بندوں کے لیے تیار کیا ہے؟‘‘",
                "headingEnglish": "\"Say: Who has forbidden the adornment with clothes given by Allah which He has produced for His slaves?\"",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5535,
                "hadithNumber": "5784",
                "englishNarrator": "Narrated `Abdullah bin `Umar:",
                "hadithEnglish": "The Prophet (ﷺ) said Allah will not look, on the Day of Resurrection at the person who drags his garment (behind him) out of conceit. On that Abu Bakr رضی اللہ عنہ said, \"O Allah's Messenger (ﷺ)! One side of my Izar hangs low if I do not take care of it.\" The Prophet (ﷺ) said, 'You are not one of those who do that out of conceit.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص تکبر کی وجہ سے تہبند گھسیٹتا ہوا چلے گا تو اللہ پاک اس کی طرف قیامت کے دن نظر بھی نہیں کرے گا ۔ حضرت ابوبکر رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! میرے تہمد کا ایک حصہ کبھی لٹک جاتا ہے مگر یہ کہ خاص طورسے اس کا خیال رکھا کروں ؟ آپ نے فرمایا تم ان لوگوں میں سے نہیں ہو جو ایسا تکبر سے کرتے ہیں ۔",
                "urduNarrator": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے زہیر نے بیان کیا ، کہا ہم سے موسیٰ بن عقبہ نے ، ان سے سالم بن عبداللہ نے اور ان سے ان کے والد نے کہ",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ جَرَّ ثَوْبَهُ خُيَلاَءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ إِنَّ أَحَدَ شِقَّىْ إِزَارِي يَسْتَرْخِي، إِلاَّ أَنْ أَتَعَاهَدَ ذَلِكَ مِنْهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَسْتَ مِمَّنْ يَصْنَعُهُ خُيَلاَءَ ‏\"‏‏.‏",
                "headingArabic": "مَنْ جَرَّ إِزَارَهُ مِنْ غَيْرِ خُيَلاَءَ",
                "headingUrdu": "جس نے اپنے ایثار کو بغیر تکبر کے گھسیٹا",
                "headingEnglish": "Whoever dragged his Izar without conceit",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5536,
                "hadithNumber": "5785",
                "englishNarrator": "Narrated Abu Bakra رضی اللہ عنہ :",
                "hadithEnglish": "The solar eclipse occurred while we were sitting with the Prophet (ﷺ) He got up dragging his garment (on the ground) hurriedly till he reached the mosque The people turned (to the mosque) and he offered a two-rak`at prayer whereupon the eclipse was over and he traced us and said, \"The sun and the moon are two signs among the signs of Allah, so if you see a thing like this (eclipse) then offer the prayer and invoke Allah till He remove that state.\"",
                "hadithUrdu": "سورج گرہن ہوا تو ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے ۔ آپ جلدی میں کپڑا گھسیٹتے ہوئے مسجد میں تشریف لائے لوگ بھی جمع ہو گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے دو رکعت نماز پڑھائی ، گرہن ختم ہو گیا ، تب آپ ہماری طرف متوجہ ہوئے اور فرمایا سورج اور چاند اللہ کی نشانیوں میں سے دو نشانیاں ہیں اس لیے جب تم ان نشانیوں میں سے کوئی نشانی دیکھو تو نماز پڑھو اور اللہ سے دعا کرو یہاں تک کہ وہ ختم ہو جائے ۔",
                "urduNarrator": "مجھ سے بیکندی محمد بن سلام نے بیان کیا ، کہا ہم کو عبدالاعلیٰ نے خبر دی ، انہیں یونس نے ، انہیں امام حسن بصری نے اور ان سے ابوبکرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدٌ، أَخْبَرَنَا عَبْدُ الأَعْلَى، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ ـ رضى الله عنه ـ قَالَ خَسَفَتِ الشَّمْسُ وَنَحْنُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَامَ يَجُرُّ ثَوْبَهُ مُسْتَعْجِلاً، حَتَّى أَتَى الْمَسْجِدَ وَثَابَ النَّاسُ فَصَلَّى رَكْعَتَيْنِ، فَجُلِّيَ عَنْهَا، ثُمَّ أَقْبَلَ عَلَيْنَا وَقَالَ ‏ \"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ، فَإِذَا رَأَيْتُمْ مِنْهَا شَيْئًا فَصَلُّوا وَادْعُوا اللَّهَ حَتَّى يَكْشِفَهَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5537,
                "hadithNumber": "5786",
                "englishNarrator": "Narrated Abu Juhaifa رضی اللہ عنہ :",
                "hadithEnglish": "I saw Bilal رضی اللہ عنہ bringing a short spear (or stick) and fixing it in the ground, and then he proclaimed the Iqama of the prayer, and I saw Allah's Messenger (ﷺ) coming out, wearing a cloak with its sleeves rolled up. He then offered a two-rak`at prayer while facing the stick, and I saw the people and animals passing in front of him beyond the stick.",
                "hadithUrdu": "پھر میں نے دیکھا کہ حضرت بلال رضی اللہ عنہ ایک نیزہ لے کر آئے اور اسے زمین میں گاڑ دیا پھر نماز کے لیے تکبیر کہی گئی ۔ میں نے دیکھا کہ رسول کریم صلی اللہ علیہ وسلم ایک جوڑا پہنے ہوئے باہر تشریف لائے جسے آپ نے سمیٹ رکھا تھا ۔ پھر آپ نے نیزہ کے سامنے کھڑے ہو کر دو رکعت نمازعید پڑھائی اور میں نے دیکھا کہ انسان اور جانور آنحضرت صلی اللہ علیہ وسلم کے سامنے نیزہ کے باہر کی طرف سے گزر رہے تھے ۔",
                "urduNarrator": "مجھ سے اسحاق بن راہویہ نے بیان کیا ، کہا ہم کو ابن شمیل نے خبر دی ، کہا ہم کو عمر بن ابی زائدہ نے خبر دی ، کہا ہم کو عون بن ابی جحیفہ نے خبر دی ، ان سے ان کے والد ابو جحیفہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا ابْنُ شُمَيْلٍ، أَخْبَرَنَا عُمَرُ بْنُ أَبِي زَائِدَةَ، أَخْبَرَنَا عَوْنُ بْنُ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ أَبِي جُحَيْفَةَ، قَالَ فَرَأَيْتُ بِلاَلاً جَاءَ بِعَنَزَةٍ فَرَكَزَهَا، ثُمَّ أَقَامَ الصَّلاَةَ، فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ فِي حُلَّةٍ مُشَمِّرًا، فَصَلَّى رَكْعَتَيْنِ إِلَى الْعَنَزَةِ، وَرَأَيْتُ النَّاسَ وَالدَّوَابَّ يَمُرُّونَ بَيْنَ يَدَيْهِ مِنْ وَرَاءِ الْعَنَزَةِ‏.‏",
                "headingArabic": "التَّشْمِيرِ فِي الثِّيَابِ",
                "headingUrdu": "کپڑوں کو لپیٹنا یا لپیٹنا",
                "headingEnglish": "To tuck up or roll up the clothes",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5538,
                "hadithNumber": "5787",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The part of an Izar which hangs below the ankles is in the Fire.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تہبند کا جو حصہ ٹخنوں سے نیچے لٹکا ہو وہ جہنم میں ہو گا ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، انہوں نے کہا ہم سے سعید بن ابی سعید مقبری نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَا أَسْفَلَ مِنَ الْكَعْبَيْنِ مِنَ الإِزَارِ فَفِي النَّارِ ‏\"‏‏.‏",
                "headingArabic": "مَا أَسْفَلَ مِنَ الْكَعْبَيْنِ فَهْوَ فِي النَّارِ",
                "headingUrdu": "لباس کا وہ حصہ جو ٹخنوں سے نیچے لٹکا ہوا ہے آگ میں ہے۔",
                "headingEnglish": "The part of the garment that hangs below the ankles is in the Fire",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5539,
                "hadithNumber": "5788",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ), \"Allah will not look, on the Day of Resurrection, at a person who drags his Izar (behind him) out of pride and arrogance.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو شخص اپنا تہمد غرور کی وجہ سے گھسیٹتا ہے ، اللہ تعالیٰ قیامت کے دن اس کی طرف دیکھے گا نہیں ۔",
                "urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابوالزناد نے ، انہیں اعرج نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَنْظُرُ اللَّهُ يَوْمَ الْقِيَامَةِ إِلَى مَنْ جَرَّ إِزَارَهُ بَطَرًا ‏\"‏‏.‏",
                "headingArabic": "مَنْ جَرَّ ثَوْبَهُ مِنَ الْخُيَلاَءِ",
                "headingUrdu": "جو غرور اور تکبر سے اپنا لباس کھینچتا ہے۔",
                "headingEnglish": "Whoever drags his garment out of pride and arrogance",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5540,
                "hadithNumber": "5789",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (or 'Abul Qasim) said, \"While a man was walking, clad in a two-piece garment and proud of himself with his hair well-combed, suddenly Allah made him sink into the earth and he will go on sinking into it till the Day of Resurrection.",
                "hadithUrdu": "نبی یا ( یہ بیان کیا کہ ) ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا ( بنی اسرائیل میں ) ایک شخص ایک جوڑا پہن کر تکبر وغرور میں سر مست سرکے بالوں میں کنگھی کئے ہوئے اکڑ کر اتراتا جا رہا تھا کہ اللہ تعالیٰ نے اسے زمین میں دھنسا دیا اب وہ قیامت تک اس میں تڑپتا رہے گا یا دھنستا رہے گا ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے محمد بن زیاد نے بیان کیا ، کہا کہ میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ النَّبِيُّ ـ أَوْ قَالَ أَبُو الْقَاسِمِ ـ صلى الله عليه وسلم ‏ \"‏ بَيْنَمَا رَجُلٌ يَمْشِي فِي حُلَّةٍ، تُعْجِبُهُ نَفْسُهُ مُرَجِّلٌ جُمَّتَهُ، إِذْ خَسَفَ اللَّهُ بِهِ، فَهْوَ يَتَجَلَّلُ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5541,
                "hadithNumber": "5790",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"While a man was dragging his Izar on the ground (behind him), suddenly Allah made him sink into the earth and he will go on sinking into it till the Day of Resurrection.\" Hadrat Jareer bin Zaid narrates that he, accompanied by Saalim bin Abdullah bin Umer, was at his housedoor, so he said: I from Hadrat Abu Huraira رضی اللہ عنہ and that he heard it from the Prophet ﷺ.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ایک شخص غرور میں اپنا تہمد گھسیٹتا ہوا چل رہا تھا کہ اسے زمین میں دھنسا دیا گیا اور وہ اسی طرح قیامت تک زمین میں دھنستا ہی رہے گا ۔ یونس نے زہری کی سند سے اسے شعیب نے روایت نہیں کیا، مجھ سے عبداللہ بن محمد نے بیان کیا، ہم سے وہب بن جریر نے بیان کیا، ہمیں میرے والد نے اپنے چچا جریر کی سند سے خبر دی۔ بن زید کہتے ہیں کہ میں سالم بن عبداللہ بن عمر رضی اللہ عنہما کے ساتھ ان کے گھر کے دروازے پر تھا، انہوں نے کہا: میں نے ابوہریرہ رضی اللہ عنہ کو سنا، آپ صلی اللہ علیہ وسلم نے ایسا ہی کچھ سنا ہے۔",
                "urduNarrator": "ہم سے سعید بن عفیر نے بیان کیا ، کہا کہ مجھ سے لیث بن سعد نے بیان کیا ، کہا کہ مجھ سے عبدالرحمٰن بن خالد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے سالم بن عبداللہ رضی اللہ عنہ ے اور ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بَيْنَا رَجُلٌ يَجُرُّ إِزَارَهُ، خُسِفَ بِهِ، فَهْوَ يَتَجَلَّلُ فِي الأَرْضِ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏ تَابَعَهُ يُونُسُ عَنِ الزُّهْرِيِّ‏.‏ وَلَمْ يَرْفَعْهُ شُعَيْبٌ عَنِ الزُّهْرِيِّ‏.‏ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، أَخْبَرَنَا أَبِي، عَنْ عَمِّهِ، جَرِيرِ بْنِ زَيْدٍ قَالَ كُنْتُ مَعَ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَلَى باب دَارِهِ فَقَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم نَحْوَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5542,
                "hadithNumber": "5791",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Whoever drags his clothes (on the ground) out of pride and arrogance, Allah will not look at him on the Day of Resurrection.\" I asked Muharib: Did he mention wrapper? He said: There is no specifications of wrapper or shirt. Jabalah bin Sohaim, Zaid bin Aslam and Zaid bin Abdullah from Hadrat Ibn-e-Umer and he has reported like-wise from the prophet ﷺ. Laith, Nafi'o has reported like-wise from Hadrat Ibn-e-Umer رضی اللہ عنہما. Hadrat Ibn-e-Umer رضی اللہ عنہما reported from the prophet ﷺ ''Who so drags his garment.''",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو آپ اپنا کپڑا غرور کی وجہ سے گھسیٹتا ہوا چلے گا ، قیامت کے دن اس کی طرف اللہ تعالیٰ نظر نہیں کرے گا ۔ ( شعبہ نے کہا کہ ) میں نے محارب سے پوچھا کیا حضرت ابن عمر رضی اللہ عنہما نے تہمد کا ذکر کیا تھا ؟ انہوں نے فرمایا کہ تہمد یاقمیص کسی کی انہوں نے تخصیص نہیں کی تھی ۔ محارب کے ساتھ اس حدیث کو جبلہ بن سحیم اورزید بن اسلم اور زید بن عبداللہ نے بھی حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت کیا ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے ۔ اورلیث نے نافع سے ، انہوں نے ابن عمر رضی اللہ عنہما سے ایسی ہی روایت کی اورنافع کے ساتھ اس کو موسیٰ بن عقبہ اورعمر بن محمد اور قدامہ بن موسیٰ نے بھی سالم سے ، انہوں نے ابن عمر رضی اللہ عنہما سے ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے روایت کی اس میں یوں ہے کہ جو شخص اپناکپڑا ( ازراہ تکبر ) لٹکائے ۔",
                "urduNarrator": "ہم سے مطر بن فضل نے بیان کیا ، کہا ہم سے شبابہ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہاکہ میں نے محارب بن دثار قاضی سے ملاقات کی ، وہ گھوڑے پر سوار تھے اورمکان عدالت میں آ رہے تھے جس میں وہ فیصلہ کیا کرتے تھے ۔ میں نے ان سے یہی حدیث پوچھی تو انہوں نے مجھ سے بیان کیا ، کہا کہ میں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مَطَرُ بْنُ الْفَضْلِ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، قَالَ لَقِيتُ مُحَارِبَ بْنَ دِثَارٍ عَلَى فَرَسٍ وَهْوَ يَأْتِي مَكَانَهُ الَّذِي يَقْضِي فِيهِ فَسَأَلْتُهُ عَنْ هَذَا الْحَدِيثِ فَحَدَّثَنِي فَقَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ جَرَّ ثَوْبَهُ مَخِيلَةً، لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ فَقُلْتُ لِمُحَارِبٍ أَذَكَرَ إِزَارَهُ قَالَ مَا خَصَّ إِزَارًا وَلاَ قَمِيصًا‏.‏ تَابَعَهُ جَبَلَةُ بْنُ سُحَيْمٍ وَزَيْدُ بْنُ أَسْلَمَ وَزَيْدُ بْنُ عَبْدِ اللَّهِ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ اللَّيْثُ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ مِثْلَهُ‏.‏ وَتَابَعَهُ مُوسَى بْنُ عُقْبَةَ وَعُمَرُ بْنُ مُحَمَّدٍ وَقُدَامَةُ بْنُ مُوسَى عَنْ سَالِمٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ مَنْ جَرَّ ثَوْبَهُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5543,
                "hadithNumber": "5792",
                "englishNarrator": "Narrated `Aisha (the wife of the Prophet) رضی اللہ عنہا :",
                "hadithEnglish": "The wife of Rifa`a Al-Qurazi رضی اللہ عنہ came to Allah's Messenger (ﷺ) while I was sitting, and Abu Bakr رضی اللہ عنہ was also there. She said, 'O Allah s Apostle! I was the wife of Rifa`a and he divorced me irrevocably. Then I married `Abdur Rahman bin Az-Zubair رضی اللہ عنہ who, by Allah, O Allah's Messenger (ﷺ), has only something like a fringe of a garment, Showing the fringe of her veil. Khalid bin Sa`id رضی اللہ عنہ , who was standing at the door, for he had not been admitted, heard her statement and said, \"O Abu Bakr! Why do you not stop this lady from saying such things openly before Allah's Messenger (ﷺ)?\" No, by Allah, Allah's Messenger (ﷺ) did nothing but smiled. Then he said to the lady, \"Perhaps you want to return to Rifa`a? That is impossible unless `Abdur-Rahman رضی اللہ عنہ consummates his marriage with you.\" That became the tradition after him.",
                "hadithUrdu": "رفاعہ قرظی رضی اللہ عنہ کی بیوی رسول اللہ صلی اللہ علیہ وسلم کے پاس آئیں ۔ میں بھی بیٹھی ہوئی تھی اور آنحضرت صلی اللہ علیہ وسلم کے پاس حضرت ابوبکر رضی اللہ عنہ موجود تھے ۔ انہوں نے کہا یا رسول اللہ ! میں رفاعہ کے نکاح میں تھی لیکن انہوں نے مجھے تین طلاق دے دی ہیں ۔ ( مغلظہ ) اس کے بعد میں نے عبدالرحمٰن بن زبیر رضی اللہ عنہ سے نکاح کر لیا اور اللہ کی قسم کہ ان کے ساتھ یا رسول اللہ ( صلی اللہ علیہ وسلم ) ! صرف اس جھالر جیسا ہے ۔ انہوں نے اپنی چادر کے جھالر کو اپنے ہاتھ میں لے کر اشارہ کیا ۔ حضرت خالد بن سعید رضی اللہ عنہ جو دروازے پر کھڑے تھے اور انہیں ابھی اندر آنے کی اجازت نہیں ہوئی تھی ، اس نے بھی ان کی بات سنی ۔ بیان کیا کہ حضرت خالد رضی اللہ عنہ ( وہیں سے ) بولے ۔ ابوبکر ! آپ اس عورت کو روکتے نہیں کہ کس طرح کی بات رسول اللہ صلی اللہ علیہ وسلم کے سامنے کھول کر بیان کرتی ہے لیکن اللہ کی قسم اس بات پر حضور اکرم صلی اللہ علیہ وسلم کا تبسم اور بڑھ گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا غالباً تم دوبارہ رفاعہ کے پاس جانا چاہتی ہو ؟ لیکن ایسا اس وقت تک ممکن نہیں جب تک وہ ( تمہارے دوسرے شوہر عبدالرحمٰن بن زبیر رضی اللہ عنہ ) تمہارا مزا نہ چکھ لیں اور تم ان کا مزا نہ چکھ لو پھر بعد میں یہی قانون بن گیا ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے کہا کہ مجھ کو عروہ بن زبیر اور انہیں نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ جَاءَتِ امْرَأَةُ رِفَاعَةَ الْقُرَظِيِّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَنَا جَالِسَةٌ وَعِنْدَهُ أَبُو بَكْرٍ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ تَحْتَ رِفَاعَةَ فَطَلَّقَنِي فَبَتَّ طَلاَقِي، فَتَزَوَّجْتُ بَعْدَهُ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ، وَإِنَّهُ وَاللَّهِ مَا مَعَهُ يَا رَسُولَ اللَّهِ إِلاَّ مِثْلُ هَذِهِ الْهُدْبَةِ‏.‏ وَأَخَذَتْ هُدْبَةً مِنْ جِلْبَابِهَا، فَسَمِعَ خَالِدُ بْنُ سَعِيدٍ قَوْلَهَا وَهْوَ بِالْبَابِ لَمْ يُؤْذَنْ لَهُ، قَالَتْ فَقَالَ خَالِدٌ يَا أَبَا بَكْرٍ أَلاَ تَنْهَى هَذِهِ عَمَّا تَجْهَرُ بِهِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلاَ وَاللَّهِ مَا يَزِيدُ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى التَّبَسُّمِ، فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَعَلَّكِ تُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ، لاَ، حَتَّى يَذُوقَ عُسَيْلَتَكِ وَتَذُوقِي عُسَيْلَتَهُ ‏\"‏‏.‏ فَصَارَ سُنَّةً بَعْدُ‏.‏",
                "headingArabic": "الإِزَارِ الْمُهَدَّبِ",
                "headingUrdu": "جھالر والا ازار",
                "headingEnglish": "The fringed Izar",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5544,
                "hadithNumber": "5793",
                "englishNarrator": "Narrated `Ali رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) asked for his Rida, put it on and set out walking. Zaid bin Haritha رضی اللہ عنہ and I followed him till he reached the house where Hamza (bin `Abdul Muttalib) was present and asked for permission to enter, and they gave us permission.",
                "hadithUrdu": "علی رضی اللہ عنہ نے بیان کیا ( کہ حمزہ رضی اللہ عنہ نے حرمت شراب سے پہلے شراب کے نشہ میں جب ان کی اونٹنی ذبح کر دی اور انہوں نے آنحضرت صلی اللہ علیہ وسلم سے آ کر اس کی شکایت کی تو ) آنحضرت صلی اللہ علیہ وسلم نے اپنی چادر منگوائی اور اسے اوڑھ کر تشریف لے چلنے لگے ۔ میں اور زید بن حارثہ رضی اللہ عنہ آپ کے پیچھے پیچھے تھے ۔ آخر آپ اس گھر میں پہنچے جس میں حمزہ رضی اللہ عنہ تھے ، آپ نے اندر آنے کی اجازت مانگی اور انہوں نے آپ حضرات کو اجازت دی ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، کہا ہم کو عبداللہ نے خبر دی ، کہا ہم کو یونس نے ، انہیں زہری نے ، انہیں علی بن حسین نے خبر دی ، انہیں حسین بن علی رضی اللہ عنہ نے خبر دی کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ حُسَيْنَ بْنَ عَلِيٍّ، أَخْبَرَهُ أَنَّ عَلِيًّا ـ رضى الله عنه ـ قَالَ فَدَعَا النَّبِيُّ صلى الله عليه وسلم بِرِدَائِهِ، ثُمَّ انْطَلَقَ يَمْشِي، وَاتَّبَعْتُهُ أَنَا وَزَيْدُ بْنُ حَارِثَةَ، حَتَّى جَاءَ الْبَيْتَ الَّذِي فِيهِ حَمْزَةُ، فَاسْتَأْذَنَ فَأَذِنُوا لَهُمْ‏.‏",
                "headingArabic": "الأَرْدِيَةِ",
                "headingUrdu": "ردا",
                "headingEnglish": "The Rida",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5545,
                "hadithNumber": "5794",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "A man asked, \"O Allah s Apostle What kind of clothes should a Muhrim wear?\" The Prophet, said, \"A Muhrim should not wear a shirt, trousers a hooded cloak, or Khuffs (socks made from thick fabric or leather) unless he cannot get sandals, in which case he should cut the part (of the Khuff) that covers the ankles.\"",
                "hadithUrdu": "ایک صاحب نے عرض کیا یا رسول اللہ ! محرم کس طرح کا کپڑا پہنے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ محرم قمیص ، پاجامہ ، برنس ( ٹوپی یا سر پر پہننے کی کوئی چیز ) اور موزے نہیں پہنے گا البتہ اگراسے چپل نہ ملیں تو موزوں ہی کو ٹخنوں تک کاٹ کر پہن لے ۔ وہ ہی جوتی کی طرح ہو جائیں گے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے حماد بن سلمہ نے بیان کیا ، ان سے ایوب سختیانی نے بیان کیا ، ان سے نافع نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ مَا يَلْبَسُ الْمُحْرِمُ مِنَ الثِّيَابِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ يَلْبَسُ الْمُحْرِمُ الْقَمِيصَ، وَلاَ السَّرَاوِيلَ، وَلاَ الْبُرْنُسَ، وَلاَ الْخُفَّيْنِ، إِلاَّ أَنْ لاَ يَجِدَ النَّعْلَيْنِ، فَلْيَلْبَسْ مَا هُوَ أَسْفَلُ مِنَ الْكَعْبَيْنِ ‏\"‏‏.‏",
                "headingArabic": "لُبْسِ الْقَمِيصِ",
                "headingUrdu": "قمیض پہننا",
                "headingEnglish": "Wearing of shirts",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5546,
                "hadithNumber": "5795",
                "englishNarrator": "Narrated Jabir bin `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) came to visit `Abdullah bin Ubai (bin Salul) after he had been put in his grave. The Prophet (ﷺ) ordered that `Abdullah be taken out. He was taken out and was placed on the knees of the Prophet, who blew his (blessed) breath on him and dressed the body with his own shirt. And Allah knows better.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم عبداللہ بن ابی ( منافق ) کے پاس جب اسے قبر میں داخل کیا جا چکا تھا تشریف لائے پھر آپ کے حکم سے اس کی لاش نکالی گئی اور حضور اکرم صلی اللہ علیہ وسلم کے گھٹنوں پر اسے رکھا گیا آنحضرت صلی اللہ علیہ وسلم نے اس پر دم کرتے ہوئے اپنی قمیص پہنائی اور اللہ ہی خوب جاننے والا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، کہا ہم کو ابن عیینہ نے خبر دی ، انہیں عمرو نے اور انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ أَتَى النَّبِيُّ صلى الله عليه وسلم عَبْدَ اللَّهِ بْنَ أُبَىٍّ بَعْدَ مَا أُدْخِلَ قَبْرَهُ، فَأَمَرَ بِهِ فَأُخْرِجَ، وَوُضِعَ عَلَى رُكْبَتَيْهِ، وَنَفَثَ عَلَيْهِ مِنْ رِيقِهِ، وَأَلْبَسَهُ قَمِيصَهُ، وَاللَّهُ أَعْلَمُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5547,
                "hadithNumber": "5796",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "When `Abdullah bin Ubdi (bin Salul) died, his son came to Allah's Messenger (ﷺ) and said ' O Allah's Apostle, give me your shirt so that I may shroud my fathers body in it. And please offer a funeral prayer for him and invoke Allah for his forgiveness.\" The Prophet (ﷺ) gave him his shirt and said to him 'Inform us when you finish (and the funeral procession is ready) call us. When he had finished he told the Prophet (ﷺ) and the Prophet (ﷺ) proceeded to order his funeral prayers but `Umar رضی اللہ عنہ stopped him and said, \"Didn't Allah forbid you to offer the funeral prayer for the hypocrites when He said: \"Whether you (O Muhammad) ask forgiveness for them or ask not forgiveness for them: (and even) if you ask forgiveness for them seventy times. Allah will not forgive them.\" (9.80) Then there was revealed: \"And never (O Muhammad) pray for any of them that dies, nor stand at his grave.\" (9.34) Thenceforth the Prophet (ﷺ) did not offer funeral prayers for the hypocrites.",
                "hadithUrdu": "جب عبداللہ بن ابی کی وفات ہوئی تو اس کے لڑکے ( حضرت عبداللہ ) جو مخلص اور اکابر صحابہ میں تھے رسول اللہ صلی اللہ علیہ وسلم ! کی خدمت میں حاضر ہوئے اور عرض کیا یا رسول اللہ ! اپنی قمیص مجھے عطا فرمایئے تاکہ میں اپنے باپ کو اس کا کفن دوں اور آپ ان کی نماز جنازہ پڑھا دیں اور ان کے لیے دعائے مغفرت کریں چنانچہ آنحضرت صلی اللہ علیہ وسلم نے اپنی قمیص انہیں عطا فرمائی اور فرمایا کہ نہلادھلا کر مجھے اطلاع دینا ۔ چنانچہ جب نہلادھلا لیا تو آنحضرت صلی اللہ علیہ وسلم کواطلاع دی آنحضور صلی اللہ علیہ وسلم تشریف لائے تاکہ اس کی نماز جنازہ پڑھائیں لیکن حضرت عمر رضی اللہ عنہ نے آپ کو پکڑ لیا اور عرض کیایا رسول اللہ ! کیا اللہ تعالیٰ نے آپ کو منافقین پر نماز جنازہ پڑھنے سے منع نہیں فرمایا ہے ؟ اور فرمایا ہے کہ ان کے لیے مغفرت کی دعا کرویا مغفرت کی دعا نہ کرو اگر تم ستر مرتبہ بھی ان کے لیے مغفرت کی دعا کرو گے تب بھی اللہ انہیں ہرگز نہیں بخشے گا ۔ “ پھر یہ آیت نازل ہوئی کہ ” اور ان میں سے کسی پر بھی جو مرگیا ہو ہرگز نماز نہ پڑھئے ۔ “ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے ان کی نماز جنازہ پڑھنی چھوڑ دی ۔",
                "urduNarrator": "ہم سے صدقہ بن فضل نے بیان کیا ، کہا ہم کو یحییٰ بن سعید نے خبر دی ، ان سے عبیداللہ نے بیان کیا ، کہا مجھ کو نافع نے خبر دی ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنْ عَبْدِ اللَّهِ، قَالَ لَمَّا تُوُفِّيَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ جَاءَ ابْنُهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَعْطِنِي قَمِيصَكَ أُكَفِّنْهُ فِيهِ، وَصَلِّ عَلَيْهِ، وَاسْتَغْفِرْ لَهُ، فَأَعْطَاهُ قَمِيصَهُ، وَقَالَ ‏\"‏ إِذَا فَرَغْتَ فَآذِنَّا ‏\"‏‏.‏ فَلَمَّا فَرَغَ آذَنَهُ، فَجَاءَ لِيُصَلِّيَ عَلَيْهِ، فَجَذَبَهُ عُمَرُ فَقَالَ أَلَيْسَ قَدْ نَهَاكَ اللَّهُ أَنْ تُصَلِّيَ عَلَى الْمُنَافِقِينَ فَقَالَ ‏{‏اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ‏}‏‏.‏ فَنَزَلَتْ ‏{‏وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا‏}‏ فَتَرَكَ الصَّلاَةَ عَلَيْهِمْ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5548,
                "hadithNumber": "5797",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) has set forth an example for a miser and a charitable person by comparing them to two men wearing two iron cloaks and their hands are raised to their breasts and necks. Whenever the charitable man tries to give a charitable gift, his iron cloak expands till it becomes so wide that it will cover his fingertips and obliterate his tracks And, whenever the miser wants to give a charitable gift, his cloak becomes very tight over him and every ring gets stuck to its place Abu Huraira رضی اللہ عنہ added; I saw Allah's Messenger (ﷺ) putting his finger in the (chest) pocket of his shirt like that If you but saw him trying to widen (the opening of his shirt) but it did not widen. Abu Zinad reporting from Aaraj said: ''Fill Jubbataan''. Jafar with reference to Aaraj said: ''Jubbataan''.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے بخیل اور صدقہ دینے والے کی مثال بیان کیا کہ دو آدمیوں جیسی ہے جو لوہے کے جبے ہاتھ ، سینہ اور حلق تک پہنے ہوئے ہیں ۔ صدقہ دینے والا جب بھی صدقہ کرتا ہے تو اس کے جبہ میں کشادگی ہو جاتی ہے اور وہ اس کی انگلیوں تک بڑھ جاتا ہے اور قدم کے نشانات کو ڈھک لیتا ہے اور بخیل جب بھی کبھی صدقہ کا ارادہ کرتا ہے تو اس کا جبہ اسے اورچمٹ جاتا ہے اورہر حلقہ اپنی جگہ پر جم جاتا ہے ۔ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ میں نے دیکھا کہ حضور اکرم صلی اللہ علیہ وسلم اس طرح اپنی مبارک انگلیوں سے اپنے گریبان کی طرف اشارہ کر کے بتا رہے تھے کہ تم دیکھو گے کہ وہ اس میں وسعت پیدا کرنا چاہے گا لیکن وسعت پیدا نہیں ہو گی ۔ اس کی متابعت ابن طاؤس نے اپنے والد سے کی ہے اور ابوالزناد نے اعرج سے کی ۔ ” دو جبوں “ کے ذکر کے ساتھ اور حنظلہ نے بیان کیا کہ میں نے طاؤس سے سنا ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے کہا ” جبتان “ اور جعفر نے اعرج کے واسطہ سے ” جنتان “ کا لفظ بیان کیا ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا ہم سے ابوعامر نے بیان کیا ، کہا ہم سے ابراہیم بن نافع نے بیان کیا ، ان سے امام حسن بصری نے ، ان سے طاؤس نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ، عَنِ الْحَسَنِ، عَنْ طَاوُسٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ضَرَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَثَلَ الْبَخِيلِ وَالْمُتَصَدِّقِ، كَمَثَلِ رَجُلَيْنِ عَلَيْهِمَا جُبَّتَانِ مِنْ حَدِيدٍ، قَدِ اضْطُرَّتْ أَيْدِيهِمَا إِلَى ثُدِيِّهِمَا وَتَرَاقِيهِمَا، فَجَعَلَ الْمُتَصَدِّقُ كُلَّمَا تَصَدَّقَ بِصَدَقَةٍ انْبَسَطَتْ عَنْهُ حَتَّى تَغْشَى أَنَامِلَهُ وَتَعْفُوَ أَثَرَهُ، وَجَعَلَ الْبَخِيلُ كُلَّمَا هَمَّ بِصَدَقَةٍ قَلَصَتْ، وَأَخَذَتْ كُلُّ حَلْقَةٍ بِمَكَانِهَا‏.‏ قَالَ أَبُو هُرَيْرَةَ فَأَنَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ بِإِصْبَعِهِ هَكَذَا فِي جَيْبِهِ، فَلَوْ رَأَيْتَهُ يُوَسِّعُهَا وَلاَ تَتَوَسَّعُ‏.‏ تَابَعَهُ ابْنُ طَاوُسٍ عَنْ أَبِيهِ وَأَبُو الزِّنَادِ عَنِ الأَعْرَجِ فِي الْجُبَّتَيْنِ‏.‏ وَقَالَ حَنْظَلَةُ سَمِعْتُ طَاوُسًا سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ جُبَّتَانِ‏.‏ وَقَالَ جَعْفَرٌ عَنِ الأَعْرَجِ جُبَّتَانِ‏.‏",
                "headingArabic": "جَيْبِ الْقَمِيصِ مِنْ عِنْدِ الصَّدْرِ وَغَيْرِهِ",
                "headingUrdu": "جیب (جیب)",
                "headingEnglish": "The Jaib (pocket)",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5549,
                "hadithNumber": "5798",
                "englishNarrator": "Narrated Al-Mughira bin Shu`ba رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) went to answer the call of nature, and when he returned, I met him with water and he performed the ablution while he was wearing a Sham, cloak. He rinsed his mouth, put the water in his nose and blew it out, washed his face and tried to take his hands out of his sleeves, but they were too narrow, so he took out his hands from under his chest and washed them and then passed his wet hands over his head and Khuffs (socks made from thick fabric or leather).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم قضائے حاجت کے لیے باہر تشریف لے گئے پھر واپس آئے تو میں پانی لے کر حاضر تھا ۔ آپ نے وضو کیا آپ شامی جبہ پہنے ہوئے تھے ، آپ نے کلی کی اور ناک میں پانی ڈالا اور اپنا چہرہ دھویا پھر اپنی آستینیں چڑھانے لگے لیکن وہ تنگ تھی اس لیے آپ نے اپنے ہاتھ جبہ کے نیچے سے نکالے اور انہیں دھویا اور سر پر اور موزوں پر مسح کیا ۔",
                "urduNarrator": "ہم سے قیس بن حفص نے بیان کیا ، انہوں نے کہا ہم سے عبدالواحد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابو الضحیٰ نے بیان کیا ، انہوں نے کہا کہ مجھ سے مسروق نے بیان کیا ، انہوں نے کہا کہ مجھ سے مغیرہ بن شعبہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي أَبُو الضُّحَى، قَالَ حَدَّثَنِي مَسْرُوقٌ، قَالَ حَدَّثَنِي الْمُغِيرَةُ بْنُ شُعْبَةَ، قَالَ انْطَلَقَ النَّبِيُّ صلى الله عليه وسلم لِحَاجَتِهِ ثُمَّ أَقْبَلَ، فَتَلَقَّيْتُهُ بِمَاءٍ، فَتَوَضَّأَ وَعَلَيْهِ جُبَّةٌ شَأْمِيَّةٌ، فَمَضْمَضَ وَاسْتَنْشَقَ وَغَسَلَ وَجْهَهُ، فَذَهَبَ يُخْرِجُ يَدَيْهِ مِنْ كُمَّيْهِ فَكَانَا ضَيِّقَيْنِ، فَأَخْرَجَ يَدَيْهِ مِنْ تَحْتِ الْجُبَّةِ، فَغَسَلَهُمَا وَمَسَحَ بِرَأْسِهِ وَعَلَى خُفَّيْهِ‏.‏",
                "headingArabic": "مَنْ لَبِسَ جُبَّةً ضَيِّقَةَ الْكُمَّيْنِ فِي السَّفَرِ",
                "headingUrdu": "سفر کے دوران تنگ آستین کی سفر کے دوران تنگ آستین کی چادر پہننا چادر پہننا",
                "headingEnglish": "Wearing a cloak of narrow sleeves while on a journey",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5550,
                "hadithNumber": "5799",
                "englishNarrator": "Narrated Al-Mughira رضی اللہ عنہ :",
                "hadithEnglish": "One night I was with the Prophet (ﷺ) on a journey. He asked (me), \"Have you got water with you?\" I replied, \"Yes\" So he got down from his she-camel and went away till he disappeared in the darkness of the night. Then he came back and I poured water for him from the pot (for the ablution). He washed his face and hands while he was wearing a woollen cloak (the sleeves of which were narrow), so he could not take his arms out of it. So he took them out from underneath the cloak. Then he washed his forearms and passed his wet hands over his head. Then I tried to take off his Khuffs (socks made from thick fabric or leather), but he said, \"Leave them, for I have performed ablution before putting them on.\" And so he passed his wet hands over them.",
                "hadithUrdu": "میں ایک رات سفر میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھا آپ نے دریافت فرمایا تمہارے پاس پانی ہے ؟ میں نے عرض کیا کہ جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم اپنی سواری سے اترے اور چلتے رہے یہاں تک کہ رات کی تاریکی میں آپ چھپ گئے پھر واپس تشریف لائے تو میں نے برتن کا پانی آپ کو استعمال کرایا آنحضرت صلی اللہ علیہ وسلم نے اپنا چہرہ دھویا ، ہاتھ دھوئے آپ اون کاجبہ پہنے ہوئے تھے جس کی آستین چڑھانی آپ کے لیے دشوار تھی چنانچہ آپ نے اپنے ہاتھ جبہ کے نیچے سے نکالے اور بازوؤ ں کو ( کہنیوں تک ) دھویا ۔ پھر سر پر مسح کیا پھر میں بڑھا کہ آنحضرت صلی اللہ علیہ وسلم کے موزے اتاردوں لیکن آپ نے فرمایا کہ رہنے دو میں نے طہارت کے بعد انہیں پہنا تھا چنانچہ آپ نے ان پر مسح کیا ۔",
                "urduNarrator": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے زکریا نے بیان کیا ، ان سے عامر نے ، ان سے عروہ بن مغیرہ نے اور ان سے ان کے والد حضرت مغیرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فِي سَفَرٍ فَقَالَ ‏\"‏ أَمَعَكَ مَاءٌ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَنَزَلَ عَنْ رَاحِلَتِهِ، فَمَشَى حَتَّى تَوَارَى عَنِّي فِي سَوَادِ اللَّيْلِ، ثُمَّ جَاءَ فَأَفْرَغْتُ عَلَيْهِ الإِدَاوَةَ، فَغَسَلَ وَجْهَهُ وَيَدَيْهِ، وَعَلَيْهِ جُبَّةٌ مِنْ صُوفٍ، فَلَمْ يَسْتَطِعْ أَنْ يُخْرِجَ ذِرَاعَيْهِ مِنْهَا حَتَّى أَخْرَجَهُمَا مِنْ أَسْفَلِ الْجُبَّةِ، فَغَسَلَ ذِرَاعَيْهِ، ثُمَّ مَسَحَ بِرَأْسِهِ، ثُمَّ أَهْوَيْتُ لأَنْزِعَ خُفَّيْهِ فَقَالَ ‏\"‏ دَعْهُمَا، فَإِنِّي أَدْخَلْتُهُمَا طَاهِرَتَيْنِ، فَمَسَحَ عَلَيْهِمَا ‏\"‏‏.‏",
                "headingArabic": "جُبَّةِ الصُّوفِ فِي الْغَزْوِ",
                "headingUrdu": "غزوات کے دوران اونی چادر پہننا",
                "headingEnglish": "To wear a woolen cloak during the Ghazawat",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5551,
                "hadithNumber": "5800",
                "englishNarrator": "Narrated Al-Miswar bin Makhrama رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) distributed some Qaba's but he did not give anything to Makhrama رضی اللہ عنہ . Makhrama رضی اللہ عنہ said (to me), \"O my son! Let us go to Allah's Messenger (ﷺ).\" So I proceeded with him and he said, \"Go in and call him 'or me.\" So I called the Prophet (ﷺ) for him The Prophet (ﷺ) came out to him, wearing one of those Qaba's and said, (to Makhrama رضی اللہ عنہ ), \"I have kept this for you \" Makhrama رضی اللہ عنہ looked at it and said, \"Makhrama is satisfied now.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے چند قبائیں تقسیم کیں اور حضرت مخرمہ رضی اللہ عنہ کو کچھ نہیں دیا تو حضرت مخرمہ رضی اللہ عنہ نے کہا بیٹے ہمیں رسول اللہ صلی اللہ علیہ وسلم کے پاس لے چلو چنانچہ میں اپنے والد کو ساتھ لے کر چلا ، انہوں نے مجھ سے کہا کہ اندر جاؤ اور آنحضرت صلی اللہ علیہ وسلم سے میرا ذکر کر دو ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے حضرت مخرمہ رضی اللہ عنہ کا ذکر کیا تو آپ باہر تشریف لائے آنحضرت صلی اللہ علیہ وسلم انہیں قباؤں میں سے ایک قباء لیے ہوئے تھے ۔ آپ نے فرمایا کہ یہ میں نے تمہارے ہی لیے رکھ چھوڑی تھی ۔ مسور نے بیان کیا کہ مخرمہ رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم کی طرف دیکھا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مخرمہ خوش ہو گئے ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے ابن ابی ملیکہ نے اور ان سے حضرت مسور بن مخرمہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالَ قَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَقْبِيَةً، وَلَمْ يُعْطِ مَخْرَمَةَ شَيْئًا فَقَالَ مَخْرَمَةُ يَا بُنَىَّ انْطَلِقْ بِنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَانْطَلَقْتُ مَعَهُ فَقَالَ ادْخُلْ فَادْعُهُ لِي‏.‏ قَالَ فَدَعَوْتُهُ لَهُ، فَخَرَجَ إِلَيْهِ وَعَلَيْهِ قَبَاءٌ مِنْهَا فَقَالَ ‏ \"‏ خَبَأْتُ هَذَا لَكَ ‏\"‏‏.‏ قَالَ فَنَظَرَ إِلَيْهِ فَقَالَ رَضِيَ مَخْرَمَةُ‏.‏",
                "headingArabic": "الْقَبَاءِ وَفَرُّوجِ حَرِيرٍ",
                "headingUrdu": "القبہ",
                "headingEnglish": "Al-Qaba",
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 5552,
                "hadithNumber": "5801",
                "englishNarrator": "Narrated `Uqba bin 'Amir رضی اللہ عنہ :",
                "hadithEnglish": "A silken Farruj was presented to Allah's Messenger (ﷺ) and he put it on and offered the prayer in it. When he finished the prayer, he took it off violently as if he disliked it and said, \"This (garment) does not befit those who fear Allah!\" Similarly, Obaidullah bin Yousuf has corroborated him from Laith and the other people said: Silken robe.",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم کو ریشم کی فروج ( قباء ) ہدیہ میں دی گئی ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے پہنا ( ریشم مردوں کے لیے حرمت کے حکم سے پہلے ) اور اسی کو پہنے ہوئے نماز پڑھی ۔ پھر آپ نے اسے بڑی تیزی کے ساتھ اتار ڈالا جیسے آپ اس سے ناگواری محسوس کرتے ہوں پھر فرمایا کہ یہ متقیوں کے لیے مناسب نہیں ہے ۔ اس روایت کی متابعت عبداللہ بن یوسف نے کی ان سے لیث نے اور عبداللہ بن یوسف کے علاوہ دوسروں نے کہا کہ ” فروج حریر “ ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے یزید بن ابی حبیب نے ، ان سے ابو الخیر نے اور ان سے حضرت عقبہ بن عامر رضی اللہ عنہ نے کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ ـ رضى الله عنه ـ أَنَّهُ قَالَ أُهْدِيَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَرُّوجُ حَرِيرٍ، فَلَبِسَهُ، ثُمَّ صَلَّى فِيهِ، ثُمَّ انْصَرَفَ فَنَزَعَهُ نَزْعًا شَدِيدًا كَالْكَارِهِ لَهُ ثُمَّ قَالَ ‏ \"‏ لاَ يَنْبَغِي هَذَا لِلْمُتَّقِينَ ‏\"‏‏.‏ تَابَعَهُ عَبْدُ اللَّهِ بْنُ يُوسُفَ عَنِ اللَّيْثِ، وَقَالَ غَيْرُهُ فَرُّوجٌ حَرِيرٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "78",
                "bookSlug": "sahih-bukhari",
                "volume": "7",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 78,
                    "chapterNumber": "78",
                    "chapterEnglish": "Dress",
                    "chapterUrdu": "لباس کے بیان میں",
                    "chapterArabic": "كتاب اللباس",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 5526,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=221",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=219",
                "label": "219",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=220",
                "label": "220",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=221",
                "label": "221",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=222",
                "label": "222",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=223",
                "label": "223",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=224",
                "label": "224",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=225",
                "label": "225",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=223",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=223",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=221",
        "to": 5550,
        "total": 40465
    }
}