{
    "status": 200,
    "message": "Hadiths has been found.",
    "hadiths": {
        "current_page": 140,
        "data": [
            {
                "id": 3478,
                "hadithNumber": "3647",
                "englishNarrator": "Narrated Anas bin Malik رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) reached Khaibar in the early morning and the people of Khaibar came out with their spades, and when they saw the Prophet (ﷺ) they said, \"Muhammad and his army!\" and returned hurriedly to take refuge in the fort. The Prophet (ﷺ) raised his hands and said, \"Allah is Greater! Khaibar is ruined ! If we approach a nation, then miserable is the morning of those who are warned.\"",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم خیبر میں صبح سویرے ہی پہنچ گئے ۔ خیبر کے یہودی اس وقت اپنے پھاوڑے لے کر ( کھیتوں میں کام کرنے کے لیے ) جا رہے تھے کہ انہوں نے آپ کو دیکھا اور یہ کہتے ہوئے کہ محمد لشکر لے کر آ گئے ، وہ قلعہ کی طرف بھاگے ، اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے اپنے ہاتھ اٹھا کر فرمایا : اللہ اکبر خیبر تو برباد ہوا کہ جب ہم کسی قوم کے میدان میں ( جنگ کے لیے ) اتر جاتے ہیں تو پھر ڈرائے ہوئے لوگوں کی صبح بری ہو جاتی ہے ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے ایوب سختیانی نے بیان کیا ، ان سے محمد بن سیرین نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ صَبَّحَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْبَرَ بُكْرَةً وَقَدْ خَرَجُوا بِالْمَسَاحِي، فَلَمَّا رَأَوْهُ قَالُوا مُحَمَّدٌ وَالْخَمِيسُ‏.‏ وَأَحَالُوا إِلَى الْحِصْنِ يَسْعَوْنَ، فَرَفَعَ النَّبِيُّ صلى الله عليه وسلم يَدَيْهِ وَقَالَ ‏ \"‏ اللَّهُ أَكْبَرُ، خَرِبَتْ خَيْبَرُ، إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3479,
                "hadithNumber": "3648",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I said, \"O Allah's Messenger (ﷺ)! I hear many narrations from you but I forget them.\" He said, \"Spread your covering sheet.\" I spread my sheet and he moved both his hands as if scooping something and emptied them in the sheet and said, \"Wrap it.\" I wrapped it round my body, and since then I have never forgotten.",
                "hadithUrdu": "میں نے عرض کیا یا رسول اللہ ! میں نے آپ سے بہت سی احادیث اب تک سنی ہیں لیکن میں انہیں بھول جاتا ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اپنی چادر پھیلاؤ ، میں نے چادر پھیلا دی اور آپ نے اپنے ہاتھ سے اس میں ایک لپ بھر کر ڈال دی اور فرمایا کہ اسے اپنے بدن سے لگا لو ۔ چنانچہ میں نے لگا لیا اور اس کے بعد کبھی کوئی حدیث نہیں بھولا ۔",
                "urduNarrator": "مجھ سے ابراہیم بن المنذر نے بیان کیا ، کہا مجھ سے محمد بن اسماعیل ابن ابی الفدیک نے بیان کیا ، ان سے محمد بن عبدالرحمٰن ابن ابی ذئب نے ، ان سے سعید مقبری نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا ابْنُ أَبِي الْفُدَيْكِ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي سَمِعْتُ مِنْكَ كَثِيرًا فَأَنْسَاهُ‏.‏ قَالَ ‏\"‏ ابْسُطْ رِدَاءَكَ ‏\"‏‏.‏ فَبَسَطْتُ فَغَرَفَ بِيَدِهِ فِيهِ، ثُمَّ قَالَ ‏\"‏ ضُمَّهُ ‏\"‏ فَضَمَمْتُهُ، فَمَا نَسِيتُ حَدِيثًا بَعْدُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "62",
                "bookSlug": "sahih-bukhari",
                "volume": "4",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 62,
                    "chapterNumber": "62",
                    "chapterEnglish": "Virtues and Merits of the Prophet (PBUH) and his Companions",
                    "chapterUrdu": "فضیلتوں کے بیان میں",
                    "chapterArabic": "كتاب المناقب",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3480,
                "hadithNumber": "3649",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) said, \"A time will come upon the people, when a group of people will wage a holy war and it will be said, 'Is there amongst you anyone who has accompanied Allah's Messenger (ﷺ)?' They will say, 'Yes.' And so victory will be bestowed on them. Then a time will come upon the people when a group of people will wage a holy war, and it will be said, \"Is there amongst you anynone who has accompanied the companions of Allah's Messenger (ﷺ)?' They will say, 'Yes.' And so victory will be bestowed on them. Then a time will come upon the people when a group of people will wage a holy war, and it will be said, \"Is there amongst you anyone who has been in the company of the companions of the companions of Allah's Messenger (ﷺ) ?' They will say, 'Yes.' And victory will be bestowed on them.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ایک زمانہ آئے گا کہ اہل اسلام کی جماعتیں جہاد کریں گی تو ان سے پوچھا جائے گا کہ کیا تمہارے ساتھ رسول اللہ صلی اللہ علیہ وسلم کا کوئی صحابی بھی ہے ؟ وہ کہیں گے کہ ہاں ہیں ۔ تب ان کی فتح ہو گی ۔ پھر ایک ایسا زمانہ آئے گا کہ مسلمانوں کی جماعتیں جہاد کریں گی اور اس موقع پر یہ پوچھا جائے گا کہ یہاں رسول اللہ صلی اللہ علیہ وسلم کے صحابی کی صحبت اٹھانے والے ( تابعی ) بھی موجود ہیں ؟ جواب ہو گا کہ ہاں ہیں اور ان کے ذریعہ فتح کی دعامانگی جائے گی ، اس کے بعد ایک زمانہ ایسا آئے گا کہ مسلمانوں کی جماعتیں جہاد کریں گی اور اس وقت سوال اٹھے گا کہ کیا یہاں کوئی بزرگ ایسے ہیں جو رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کے شاگردوں میں سے کسی بزرگ کی صحبت میں رہے ہوں ؟ جواب ہو گا کہ ہاں ہیں ، تو ان کے ذریعہ فتح کی دعا مانگی جائے گی پھر ان کی فتح ہو گی ۔",
                "urduNarrator": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے بیان کیا اور انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ ہم سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ حَدَّثَنَا أَبُو سَعِيدٍ الْخُدْرِيُّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَأْتِي عَلَى النَّاسِ زَمَانٌ فَيَغْزُو فِئَامٌ مِنَ النَّاسِ، فَيَقُولُونَ فِيكُمْ مَنْ صَاحَبَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَيَقُولُونَ نَعَمْ‏.‏ فَيُفْتَحُ لَهُمْ‏.‏ ثُمَّ يَأْتِي عَلَى النَّاسِ زَمَانٌ فَيَغْزُو فِئَامٌ مِنَ النَّاسِ، فَيُقَالُ هَلْ فِيكُمْ مَنْ صَاحَبَ أَصْحَابَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَقُولُونَ نَعَمْ‏.‏ فَيُفْتَحُ لَهُمْ، ثُمَّ يَأْتِي عَلَى النَّاسِ زَمَانٌ فَيَغْزُو فِئَامٌ مِنَ النَّاسِ، فَيُقَالُ هَلْ فِيكُمْ مَنْ صَاحَبَ مَنْ صَاحَبَ أَصْحَابَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَقُولُونَ نَعَمْ‏.‏ فَيُفْتَحُ لَهُمْ ‏\"‏‏.‏",
                "headingArabic": "فَضَائِلِ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم",
                "headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کرام رضی اللہ عنہم",
                "headingEnglish": "The Companions of the Prophet (saws)",
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3481,
                "hadithNumber": "3650",
                "englishNarrator": "Narrated `Imran bin Husain رضی اللہ عنہما :",
                "hadithEnglish": "\"Allah's Messenger (ﷺ) said, 'The best of my followers are those living in my generation (i.e. my contemporaries). and then those who will follow the latter\" `Imran رضی اللہ عنہ added, \"I do not remember whether he mentioned two or three generations after his generation, then the Prophet (ﷺ) added, 'There will come after you, people who will bear witness without being asked to do so, and will be treacherous and untrustworthy, and they will vow and never fulfill their vows, and fatness will appear among them.\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : میری امت کا سب سے بہترین زمانہ میرا زمانہ ہے ، پھر ان لوگوں کا جو اس زمانہ کے بعد آئیں گے ۔ پھر ان لوگوں کا جو اس زمانہ کے بعد آئیں گے ، حضرت عمران رضی اللہ عنہ کہتے ہیں کہ مجھے یاد نہیں ہے کہ آنحضرت صلی اللہ علیہ وسلم نے اپنے دور کے بعد دو زمانوں کا ذکر کیا یا تین کا ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے بعد ایک ایسی قوم پیدا ہو گی جو بغیر کہے گواہی دینے کے لیے تیار ہو جایا کرے گی اور ان میں خیانت اور چوری اتنی عام ہو جائے گی کہ ان پر کسی قسم کا بھروسہ باقی نہیں رہے گا ۔ اور نذریں مانیں گے لیکن انہیں پورا نہیں کریں گے ( حرام مال کھا کھا کر ) ان پر مٹاپا عام ہو جائے گا ۔",
                "urduNarrator": "مجھ سے اسحٰق بن راہویہ نے بیان کیا ، کہا ہم سے نضر نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ، انہیں ابوجمرہ نے ، کہا میں نے زہدم بن مضرب سے سنا ، کہا کہ میں نے حضرت عمران بن حصین رضی اللہ عنہما سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ، حَدَّثَنَا النَّضْرُ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، سَمِعْتُ زَهْدَمَ بْنَ مُضَرِّبٍ، سَمِعْتُ عِمْرَانَ بْنَ حُصَيْنٍ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَيْرُ أُمَّتِي قَرْنِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ‏\"‏‏.‏ قَالَ عِمْرَانُ فَلاَ أَدْرِي أَذَكَرَ بَعْدَ قَرْنِهِ قَرْنَيْنِ أَوْ ثَلاَثًا ‏\"‏ ثُمَّ إِنَّ بَعْدَكُمْ قَوْمًا يَشْهَدُونَ وَلاَ يُسْتَشْهَدُونَ، وَيَخُونُونَ وَلاَ يُؤْتَمَنُونَ، وَيَنْذُرُونَ وَلاَ يَفُونَ، وَيَظْهَرُ فِيهِمُ السِّمَنُ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3482,
                "hadithNumber": "3651",
                "englishNarrator": "Narrated `Abdullah رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"The best people are those living in my generation, and then those who will follow them, and then those who will follow the latter. Then there will come some people who will bear witness before taking oaths, and take oaths before bearing witness.\" (Ibrahim, a sub-narrator said, \"They used to beat us for witnesses and covenants when we were still children.\")",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ بہترین زمانہ میرا ہے ۔ پھر ان لوگوں کا جو اس زمانہ کے بعد آئیں گے پھر ان لوگوں کا جو اس کے بعد آئیں گے ۔ اس کے بعد ایک ایسی قوم پیدا ہو گی کہ گواہی دینے سے پہلے قسم ان کی زبان پر آجایا کرے گی اور قسم کھانے سے پہلے گواہی ان کی زبان پر آجایا کرے گی ۔ ابراہیم نے بیان کیا کہ جب ہم چھوٹے تھے تو گواہی اور عہد ( کے الفاظ زبان پر لانے ) کی وجہ سے ہمارے بڑے بزرگ ہم کو مارا کرتے تھے ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے منصور نے ، ان سے ابراہیم نے ، ان سے عبیدہ بن قیس سلمانی نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ خَيْرُ النَّاسِ قَرْنِي، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ يَجِيءُ قَوْمٌ تَسْبِقُ شَهَادَةُ أَحَدِهِمْ يَمِينَهُ وَيَمِينُهُ شَهَادَتَهُ ‏\"‏‏.‏ قَالَ إِبْرَاهِيمُ وَكَانُوا يَضْرِبُونَا عَلَى الشَّهَادَةِ وَالْعَهْدِ وَنَحْنُ صِغَارٌ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3483,
                "hadithNumber": "3652",
                "englishNarrator": "Narrated Al-Bara' رضی اللہ عنہ :",
                "hadithEnglish": "Abu Bakr رضی اللہ عنہ bought a (camel) saddle from `Azib رضی اللہ عنہ for thirteen Dirhams. Abu Bakr said to `Azib, \"Tell Al- Bara' رضی اللہ عنہ to carry the saddle for me.\" `Azib رضی اللہ عنہ said, \"No, unless you relate to me what happened to you and Allah's Messenger (ﷺ) when you left Mecca while the pagans were in search of you.\" Abu Bakr رضی اللہ عنہ said, \"We left Mecca and we traveled continuously for that night and the following day till it was midday. I looked (around) searching for shade to take as shelter, and suddenly I came across a rock, and found a little shade there. So I cleaned the place and spread a bed for the Prophet (ﷺ) in the shade and said to him, 'Lie down, O Allah's Messenger (ﷺ).' So the Prophet (ﷺ) lay down and I went out, looking around to see if there was any person pursuing us. Suddenly I saw a shepherd driving his sheep towards the rock, seeking what we had already sought from it. I asked him, 'To whom do you belong, O boy?' He said, 'I belong to a man from Quraish.' He named the man and I recognized him. I asked him, 'Is there any milk with your sheep?' He said, 'Yes.' I said, 'Will you then milk (some) for us?' He said, 'Yes.' Then I asked him to tie the legs of one of the sheep and clean its udder, and then ordered him to clean his hands from dust. Then the shepherd cleaned his hands by striking his hands against one another. After doing so, he milked a small amount of milk. I used to keep for Allah's Messenger (ﷺ) a leather water-container, the mouth of which was covered with a piece of cloth. I poured water on the milk container till its lower part was cold. Then I took the milk to the Prophet (ﷺ) whom I found awake. I said to him, 'Drink, O Allah's Messenger (ﷺ).' So he drank till I became pleased. Then I said, 'It is time for us to move, O Allah's Apostle!' He said, 'Yes.' So we set out while the people (i.e. Quraish pagans) were searching for us, but none found us except Suraqah bin Malik bin Ju`shum who was riding his horse. I said, 'These are our pursuers who have found us. O Allah's Messenger (ﷺ)!' He said, 'Do not grieve, for Allah is with us.\"",
                "hadithUrdu": "حضرت ابوبکر رضی اللہ عنہ نے ( ان کے والد ) حضرت عازب رضی اللہ عنہ سے ایک پالان تیرہ درہم میں خریدا ۔ پھر ابوبکر رضی اللہ عنہ نے عازب رضی اللہ عنہ سے کہا کہ براء ( اپنے بیٹے ) سے کہو کہ وہ میرے گھر یہ پالان اٹھا کر پہنچا دیں اس پر حضرت عازب رضی اللہ عنہ نے کہا یہ اس وقت تک نہیں ہو سکتا جب تک آپ وہ واقعہ بیان نہ کریں کہ آپ اور رسول اللہ صلی اللہ علیہ وسلم ( مکہ سے ہجرت کرنے کے لیے ) کس طرح نکلے تھے حالانکہ مشرکین آپ دونوں کو تلاش بھی کر رہے تھے ۔ انہوں نے کہا کہ مکہ سے نکلنے کے بعد ہم رات بھر چلتے رہے اور دن میں بھی سفر جاری رکھا ۔ لیکن جب دوپہر ہو گئی تو میں نے چاروں طرف نظر دوڑائی کہ کہیں کوئی سایہ نظر آ جائے اور ہم اس میں کچھ آرام کر سکیں ۔ آخر ایک چٹان دکھائی دی اور میں نے اس کے پاس پہنچ کر دیکھا کہ سایہ ہے ۔ پھر میں نے نبی کریم صلی اللہ علیہ وسلم کے لیے ایک فرش وہاں بچھا دیا اور عرض کیا کہ یا رسول اللہ ! آپ اب آرام فرمائیں ۔ چنانچہ آپ لیٹ گئے ۔ پھر میں چاروں طرف دیکھتا ہوا نکلا کہ کہیں لوگ ہماری تلاش میں نہ آئے ہوں ۔ پھر مجھ کو بکریوں کا ایک چرواہا دکھائی دیا جو اپنی بکریاں ہانکتا ہوا اسی چٹان کی طرف آ رہا تھا ۔ وہ بھی ہماری طرح سایہ کی تلاش میں تھا ۔ میں نے بڑھ کر اس سے پوچھا کہ لڑکے تم کس کے غلام ہو ۔ اس نے قریش کے ایک شخص کانام لیا تو میں نے اسے پہچان لیا ۔ پھر میں نے اس سے پوچھا : کیا تمہاری بکریوں میں دودھ ہے ۔ اس نے کہا جی ہاں ۔ میں نے کہا : کیا تم دودھ دوہ سکتے ہوں ؟ اس نے کہا کہ ہاں ۔ چنانچہ میں نے اس سے کہا اور اس نے اپنے ریوڑ کی ایک بکری باندھ دی ۔ پھر میرے کہنے پر اس نے اس کے تھن کے غبار کو جھاڑا ۔ اب میں نے کہا کہ اپنا ہاتھ بھی جھاڑ لے ۔ اس نے یوں اپنا ایک ہاتھ دوسرے پر مارا اور میرے لیے تھوڑا سا دودھ دوہا ۔ آنحضرت صلی اللہ علیہ وسلم کے لیے ایک برتن میں نے پہلے ہی سے ساتھ لے لیا تھا اور اس کے منہ کو کپڑے سے بند کر دیا تھا ( اس میں ٹھنڈا پانی تھا ) پھر میں نے دودھ پر وہ پانی ( ٹھنڈا کرنے کے لیے ) ڈالا اتنا کہ وہ نیچے تک ٹھنڈا ہو گیا تو اسے آپ کی خدمت میں لے کر حاضر ہوا ۔ آپ بھی بیدار ہو چکے تھے ۔ میں نے عرض کیا : دودھ پی لیجئے ۔ آپ نے اتنا پیا کہ مجھے خوشی حاصل ہو گئی ، پھر میں نے عرض کیا کہ اب کوچ کا وقت ہو گیا ہے یا رسول اللہ ! آپ صلی اللہ علیہ وسلم نے فرمایا ہاں ٹھیک ہے ، چلو ۔ چنانچہ ہم آگے بڑھے اور مکہ والے ہماری تلاش میں تھے لیکن سراقہ بن مالک بن جعشم کے سوا ہم کو کسی نے نہیں پایا ، وہ اپنے گھوڑے پر سوار تھا ، میں نے اسے دیکھتے ہی کہا کہ یا رسول اللہ ! ہمارا پیچھا کرنے والا دشمن ہمارے قریب آ پہنچا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا : فکر نہ کرو ۔ اللہ تعالیٰ ہمارے ساتھ ہے ۔",
                "urduNarrator": "ہم سے عبداللہ بن رجاء نے بیان کیا ، کہا ہم سے اسرائیل نے بیان کیا ، ان سے ابواسحٰق نے اور ان سے حضرت براء رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ اشْتَرَى أَبُو بَكْرٍ ـ رضى الله عنه ـ مِنْ عَازِبٍ رَحْلاً بِثَلاَثَةَ عَشَرَ دِرْهَمًا فَقَالَ أَبُو بَكْرٍ لِعَازِبٍ مُرِ الْبَرَاءَ فَلْيَحْمِلْ إِلَىَّ رَحْلِي‏.‏ فَقَالَ عَازِبٌ لاَ حَتَّى تُحَدِّثَنَا كَيْفَ صَنَعْتَ أَنْتَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ خَرَجْتُمَا مِنْ مَكَّةَ وَالْمُشْرِكُونَ يَطْلُبُونَكُمْ قَالَ ارْتَحَلْنَا مِنْ مَكَّةَ، فَأَحْيَيْنَا أَوْ سَرَيْنَا لَيْلَتَنَا وَيَوْمَنَا حَتَّى أَظْهَرْنَا وَقَامَ قَائِمُ الظَّهِيرَةِ، فَرَمَيْتُ بِبَصَرِي هَلْ أَرَى مِنْ ظِلٍّ فَآوِيَ إِلَيْهِ، فَإِذَا صَخْرَةٌ أَتَيْتُهَا فَنَظَرْتُ بَقِيَّةَ ظِلٍّ لَهَا فَسَوَّيْتُهُ، ثُمَّ فَرَشْتُ لِلنَّبِيِّ صلى الله عليه وسلم فِيهِ، ثُمَّ قُلْتُ لَهُ اضْطَجِعْ يَا نَبِيَّ اللَّهِ‏.‏ فَاضْطَجَعَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ انْطَلَقْتُ أَنْظُرُ مَا حَوْلِي، هَلْ أَرَى مِنَ الطَّلَبِ أَحَدًا فَإِذَا أَنَا بِرَاعِي غَنَمٍ يَسُوقُ غَنَمَهُ إِلَى الصَّخْرَةِ يُرِيدُ مِنْهَا الَّذِي أَرَدْنَا، فَسَأَلْتُهُ فَقُلْتُ لَهُ لِمَنْ أَنْتَ يَا غُلاَمُ قَالَ لِرَجُلٍ مِنْ قُرَيْشٍ سَمَّاهُ فَعَرَفْتُهُ‏.‏ فَقُلْتُ هَلْ فِي غَنَمِكَ مِنْ لَبَنٍ قَالَ نَعَمْ‏.‏ قُلْتُ فَهَلْ أَنْتَ حَالِبٌ لَبَنًا قَالَ نَعَمْ‏.‏ فَأَمَرْتُهُ فَاعْتَقَلَ شَاةً مِنْ غَنَمِهِ، ثُمَّ أَمَرْتُهُ أَنْ يَنْفُضَ ضَرْعَهَا مِنَ الْغُبَارِ، ثُمَّ أَمَرْتُهُ أَنْ يَنْفُضَ كَفَّيْهِ، فَقَالَ هَكَذَا ضَرَبَ إِحْدَى كَفَّيْهِ بِالأُخْرَى فَحَلَبَ لِي كُثْبَةً مِنْ لَبَنٍ، وَقَدْ جَعَلْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِدَاوَةً عَلَى فَمِهَا خِرْقَةٌ، فَصَبَبْتُ عَلَى اللَّبَنِ حَتَّى بَرَدَ أَسْفَلُهُ، فَانْطَلَقْتُ بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَوَافَقْتُهُ قَدِ اسْتَيْقَظَ، فَقُلْتُ اشْرَبْ يَا رَسُولَ اللَّهِ‏.‏ فَشَرِبَ حَتَّى رَضِيتُ ثُمَّ قُلْتُ قَدْ آنَ الرَّحِيلُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ بَلَى ‏\"‏‏.‏ فَارْتَحَلْنَا وَالْقَوْمُ يَطْلُبُونَا، فَلَمْ يُدْرِكْنَا أَحَدٌ مِنْهُمْ غَيْرُ سُرَاقَةَ بْنِ مَالِكِ بْنِ جُعْشُمٍ عَلَى فَرَسٍ لَهُ‏.‏ فَقُلْتُ هَذَا الطَّلَبُ قَدْ لَحِقَنَا يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ لاَ تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ‏\"‏‏.‏",
                "headingArabic": "مَنَاقِبِ الْمُهَاجِرِينَ وَفَضْلِهِمْ",
                "headingUrdu": "مہاجرین کے فضائل (یعنی مہاجرین)",
                "headingEnglish": "The virtues of the emigrants (i.e., Muhajirin)",
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3484,
                "hadithNumber": "3653",
                "englishNarrator": "Narrated Abu Bakr رضی اللہ عنہ :",
                "hadithEnglish": "I said to the Prophet (ﷺ) while I was in the Cave. \"If any of them should look under his feet, he would see us.\" He said, \"O Abu Bakr! What do you think of two (persons) the third of whom is Allah?\"",
                "hadithUrdu": "جب ہم غار ثور میں چھپے تھے تو میں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا کہ اگر مشرکین کے کسی آدمی نے اپنے قدموں پر نظر ڈالی تو وہ ضرور ہم کو دیکھ لے گا ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا : اے ابوبکر ! ان دوکا کوئی کیا بگاڑ سکتا ہے جن کے ساتھ تیسرا اللہ تعالیٰ ہے ۔",
                "urduNarrator": "ہم سے محمد بن سنان نے بیان کیا ، کہا ہم سے ہمام نے بیان کیا ، ان سے ثابت نے ، ان سے حضرت انس رضی اللہ عنہ نے اور ان سے حضرت ابوبکر رضی اللہ عنہ نے بیان کیاکہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا هَمَّامٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، عَنْ أَبِي بَكْرٍ ـ رضى الله عنه ـ قَالَ قُلْتُ لِلنَّبِيِّ صلى الله عليه وسلم وَأَنَا فِي الْغَارِ لَوْ أَنَّ أَحَدَهُمْ نَظَرَ تَحْتَ قَدَمَيْهِ لأَبْصَرَنَا‏.‏ فَقَالَ ‏ \"‏ مَا ظَنُّكَ يَا أَبَا بَكْرٍ بِاثْنَيْنِ اللَّهُ ثَالِثُهُمَا ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3485,
                "hadithNumber": "3654",
                "englishNarrator": "Narrated Abu Sa`id Al-Khudri رضی اللہ عنہ :",
                "hadithEnglish": "Allah's Messenger (ﷺ) addressed the people saying, \"Allah has given option to a slave to choose this world or what is with Him. The slave has chosen what is with Allah.\" Abu Bakr رضی اللہ عنہ wept, and we were astonished at his weeping caused by what the Prophet (ﷺ) mentioned as to a Slave ( of Allah) who had been offered a choice, (we learned later on) that Allah's Messenger (ﷺ) himself was the person who was given the choice, and that Abu Bakr رضی اللہ عنہ knew best of all of us. Allah's Messenger (ﷺ) added, \"The person who has favored me most of all both with his company and wealth, is Abu Bakr رضی اللہ عنہ . If I were to take a Khalil other than my Lord, I would have taken Abu Bakr رضی اللہ عنہ as such, but (what relates us) is the Islamic brotherhood and friendliness. All the gates of the Mosque should be closed except the gate of Abu Bakr رضی اللہ عنہ .\"",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے خطبہ دیا اور فرمایا کہ اللہ تعالیٰ نے اپنے ایک بندے کودنیا میں اور جو کچھ اللہ کے پاس آخرت میں ہے ان دونوں میں سے کسی ایک کا اختیار دیا تو اس بندے نے وہ اختیار کر لیا جو اللہ کے پاس تھا ۔ انہوں نے بیان کیا کہ اس پر ابوبکر رضی اللہ عنہ رونے لگے ۔ ابوسعید کہتے ہیں کہ ہم کو ان کے رونے پر حیرت ہوئی کہ آنحضرت صلی اللہ علیہ وسلم تو کسی بندے کے متعلق خبردے رہے ہیں جسے اختیار دیا گیا تھا ، لیکن بات یہ تھی کہ خود آنحضرت صلی اللہ علیہ وسلم ہی وہ بندے تھے جنہیں اختیار دیا گیا تھا اور ( واقعتا ) حضرت ابوبکر رضی اللہ عنہ ہم میں سب سے زیادہ جاننے والے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے ایک مرتبہ فرمایا کہ اپنی صحبت اور مال کے ذریعہ مجھ پر ابوبکر کا سب سے زیادہ احسان ہے اور اگر میں اپنے رب کے سوا کسی کو جانی دوست بناسکتاتو ابوبکر کو بناتا ۔ لیکن اسلام کا بھائی چارہ اور اسلام کی محبت ان سے کافی ہے ۔ دیکھو مسجد کی طرف تمام دروازے ( جو صحابہ کے گھروں کی طرف کھلتے تھے ) سب بند کر دیئے جائیں ۔ صرف ابوبکر رضی اللہ عنہ کا دروازہ رہنے دو ۔",
                "urduNarrator": "مجھ سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے ابوعامر نے بیان کیا ، ان سے فلیح بن سلیمان نے بیان کیا ، کہا کہ مجھ سے سالم ابوالنضر نے بیان کیا ، ان سے بسربن سعید نے اور ان سے حضرت ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا فُلَيْحٌ، قَالَ حَدَّثَنِي سَالِمٌ أَبُو النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّاسَ وَقَالَ ‏\"‏ إِنَّ اللَّهَ خَيَّرَ عَبْدًا بَيْنَ الدُّنْيَا وَبَيْنَ مَا عِنْدَهُ فَاخْتَارَ ذَلِكَ الْعَبْدُ مَا عِنْدَ اللَّهِ ‏\"‏‏.‏ قَالَ فَبَكَى أَبُو بَكْرٍ، فَعَجِبْنَا لِبُكَائِهِ أَنْ يُخْبِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ عَبْدٍ خُيِّرَ‏.‏ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم هُوَ الْمُخَيَّرُ وَكَانَ أَبُو بَكْرٍ أَعْلَمَنَا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ أَمَنِّ النَّاسِ عَلَىَّ فِي صُحْبَتِهِ وَمَالِهِ أَبَا بَكْرٍ، وَلَوْ كُنْتُ مُتَّخِذًا خَلِيلاً غَيْرَ رَبِّي لاَتَّخَذْتُ أَبَا بَكْرٍ، وَلَكِنْ أُخُوَّةُ الإِسْلاَمِ وَمَوَدَّتُهُ، لاَ يَبْقَيَنَّ فِي الْمَسْجِد ِباب إِلاَّ سُدَّ، إِلاَّ باب أَبِي بَكْرٍ ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم: «سُدُّوا الأَبْوَابَ إِلاَّ بَابُ أَبِي بَكْرٍ»",
                "headingUrdu": "\"(مسجد میں) دروازے بند کر دو، سوائے ابوبکر کے دروازے کے۔\"",
                "headingEnglish": "\"Close the gates (in the Mosque), except the gate of Abu Bakr.\"",
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3486,
                "hadithNumber": "3655",
                "englishNarrator": "Narrated Ibn `Umar رضی اللہ عنہما :",
                "hadithEnglish": "We used to compare the people as to who was better during the lifetime of Allah's Messenger (ﷺ) . We used to regard Abu Bakr رضی اللہ عنہ as the best, then `Umar رضی اللہ عنہ, and then `Uthman .",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ ہی میں جب ہمیں صحابہ کے درمیان انتخاب کے لیے کہا جاتا تو سب میں افضل اور بہتر ہم ابوبکر رضی اللہ عنہ کو قرار دیتے ، پھر عمر بن خطاب رضی اللہ عنہ کو پھر عثمان بن عفان رضی اللہ عنہ کو ۔",
                "urduNarrator": "ہم سے عبدالعزیزبن عبداللہ نے بیان کیا ، کہا ہم سے سلیمان نے بیان کیا ، ان سے یحییٰ بن سعید نے ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كُنَّا نُخَيِّرُ بَيْنَ النَّاسِ فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم فَنُخَيِّرُ أَبَا بَكْرٍ، ثُمَّ عُمَرَ بْنَ الْخَطَّابِ، ثُمَّ عُثْمَانَ بْنَ عَفَّانَ رضى الله عنهم‏.‏",
                "headingArabic": "فَضْلِ أَبِي بَكْرٍ بَعْدَ النَّبِيِّ صلى الله عليه وسلم",
                "headingUrdu": "ابو بکر رضی اللہ عنہ کی فضیلت",
                "headingEnglish": "The merits of Abu Bakr رضي الله عنه",
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3487,
                "hadithNumber": "3656",
                "englishNarrator": "Narrated Ibn `Abbas رضی اللہ عنہما :",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If I were to take a Khalil, I would have taken Abu Bakr, but he is my brother and my companion (in Islam).",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : اگر میں اپنی امت کے کسی فرد کو اپنا جانی دوست بنا سکتا تو ابوبکر کو بناتا لیکن وہ میرے دینی بھائی اور میرے ساتھی ہیں ۔",
                "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، انہوں نے کہا ہم سے وہیب نے بیان کیا ، ان سے ایوب نے بیان کیا ، ان سے عکرمہ نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ وَلَوْ كُنْتُ مُتَّخِذًا مِنْ أُمَّتِي خَلِيلاً لاَتَّخَذْتُ، أَبَا بَكْرٍ وَلَكِنْ أَخِي وَصَاحِبِي ‏\"‏‏.‏",
                "headingArabic": "قَوْلِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ لَوْ كُنْتُ مُتَّخِذًا خَلِيلاً ‏\"‏ قَالَهُ أَبُو سَعِيدٍ",
                "headingUrdu": "\"اگر میں خلیل کو لے جاؤں...\"",
                "headingEnglish": "\"If I were to take Khalil ...\"",
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3488,
                "hadithNumber": "3657",
                "englishNarrator": "Narrated Aiyub:",
                "hadithEnglish": "The Prophet (ﷺ) said, \"If I were to take a Khalil, I would have taken him (i.e. Abu Bakr) as a Khalil, but the Islamic brotherhood is better.\"",
                "hadithUrdu": "ہم سے معلیٰ بن اسد اور موسیٰ نے بیان کیا ، کہا کہ ہم سے وہیب نے بیان کیا ، ان سے ایوب نے ( یہی روایت ) کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر میں کسی کو جانی دوست بنا سکتا تو ابوبکر کو بناتا ۔ لیکن اسلام کا بھائی چارہ کیا کم ہے ۔ ",
                "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، ان سے عبدالوہاب نے اور ان سے ایوب نے ایسی ہی حدیث بیان کی ۔",
                "hadithArabic": "حَدَّثَنَا مُعَلَّى، وَمُوسَى، قَالاَ حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، وَقَالَ، ‏ \"‏ لَوْ كُنْتُ مُتَّخِذًا خَلِيلاً لاَتَّخَذْتُهُ خَلِيلاً، وَلَكِنْ أُخُوَّةُ الإِسْلاَمِ أَفْضَلُ ‏\"‏‏.‏ حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ أَيُّوبَ، مِثْلَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3489,
                "hadithNumber": "3658",
                "englishNarrator": "Narrated `Abdullah bin Abi Mulaika رضی اللہ عنہما :",
                "hadithEnglish": "The people of Kufa sent a letter to Ibn Az-Zubair رضی اللہ عنہما, asking about (the inheritance of) (paternal) grandfather. He replied that the right of the inheritance of (paternal) grandfather is the same as that of father if the father is dead) and added, \"Allah's Messenger (ﷺ) said, ' If I were to take a Khalil from this nation, I would have taken him (i.e. Abu Bakr رضی اللہ عنہما).",
                "hadithUrdu": "کوفہ والوں نے حضرت عبداللہ بن زبیر رضی اللہ عنہما کو دادا ( کی میراث کے سلسلے میں ) سوال لکھا تو آپ نے انہیں جواب دیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : اگر اس امت میں کسی کو میں اپنا جانی دوست بنا سکتا تو ابوبکر کو بناتا ۔ ( وہی ) ابوبکر رضی اللہ عنہ یہ فرماتے تھے کہ دادا باپ کی طرح ہے ( یعنی جب میت کا باپ زندہ نہ ہو تو باپ کا حصہ دادا کی طرف لوٹ جائے گا ۔ یعنی باپ کی جگہ دادا وارث ہو گا )",
                "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم کو حماد بن زید نے خبر دی ، انہیں ایوب نے ، ان سے عبداللہ بن ابی ملیکہ نے بیان کیا کہ کوفہ والوں نے حضرت عبداللہ بن زبیر رضی اللہ عنہما کو دادا ( کی میراث کے سلسلے میں ) سوال لکھا تو آپ نے انہیں جواب دیا کہ",
                "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ كَتَبَ أَهْلُ الْكُوفَةِ إِلَى ابْنِ الزُّبَيْرِ فِي الْجَدِّ‏.‏ فَقَالَ أَمَّا الَّذِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ كُنْتُ مُتَّخِذًا مِنْ هَذِهِ الأُمَّةِ خَلِيلاً لاَتَّخَذْتُهُ ‏\"‏‏.‏ أَنْزَلَهُ أَبًا يَعْنِي أَبَا بَكْرٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3490,
                "hadithNumber": "3659",
                "englishNarrator": "Narrated Jubair bin Mut`im:",
                "hadithEnglish": "A woman came to the Prophet (ﷺ) who ordered her to return to him again. She said, \"What if I came and did not find you?\" as if she wanted to say, \"If I found you dead?\" The Prophet (ﷺ) said, \"If you should not find me, go to Abu Bakr.\"",
                "hadithUrdu": "ایک عورت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آئی تو آپ صلی اللہ علیہ وسلم نے ان سے فرمایا کہ پھر آئیو ۔ اس نے کہا : اگر میں آؤں اور آپ صلی اللہ علیہ وسلم کو نہ پاؤں تو ؟ گویا وہ وفات کی طرف اشارہ کر رہی تھی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر تم مجھے نہ پا سکو تو ابوبکر رضی اللہ عنہ کے پاس چلی آنا ۔",
                "urduNarrator": "ہم سے حمیدی اور محمد بن عبداللہ نے بیان کیا ، کہا کہ ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے ان کے والد نے ، ان سے محمد بن جبیر بن مطعم نے اور ان سے ان کے والد نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ، قَالَ أَتَتِ امْرَأَةٌ النَّبِيَّ صلى الله عليه وسلم فَأَمَرَهَا أَنْ تَرْجِعَ إِلَيْهِ‏.‏ قَالَتْ أَرَأَيْتَ إِنْ جِئْتُ وَلَمْ أَجِدْكَ كَأَنَّهَا تَقُولُ الْمَوْتَ‏.‏ قَالَ عَلَيْهِ السَّلاَمُ ‏ \"‏ إِنْ لَمْ تَجِدِينِي فَأْتِي أَبَا بَكْرٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3491,
                "hadithNumber": "3660",
                "englishNarrator": "Narrated `Ammar رضی اللہ عنہ :",
                "hadithEnglish": "I saw Allah's Messenger (ﷺ) and there was none with him but five slaves, two women and Abu Bakr (i.e. those were the only converts to Islam then).",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس وقت دیکھا ہے جب آپ صلی اللہ علیہ وسلم کے ساتھ ( اسلام لانے والوں میں صرف ) پانچ غلام ، دو عورتوں اور ابوبکر رضی اللہ عنہم کے سوا اور کوئی نہ تھا ۔",
                "urduNarrator": "ہم سے احمد بن ابی طیب نے بیان کیا ، کہا ہم سے اسماعیل بن ابی مجالد نے بیان کیا ، ان سے بیان بن بشر نے کہا ، ان سے وبرہ بن عبدالرحمٰن نے ، ان سے ہمام نے بیان کیا کہ میں نے حضرت عمار رضی اللہ عنہ سے سنا ، وہ بیان کرتے تھے کہ",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ أَبِي الطَّيِّبِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُجَالِدٍ، حَدَّثَنَا بَيَانُ بْنُ بِشْرٍ، عَنْ وَبَرَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ هَمَّامٍ، قَالَ سَمِعْتُ عَمَّارًا، يَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَمَا مَعَهُ إِلاَّ خَمْسَةُ أَعْبُدٍ وَامْرَأَتَانِ وَأَبُو بَكْرٍ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3492,
                "hadithNumber": "3661",
                "englishNarrator": "Narrated Abu Ad-Darda رضی اللہ عنہ :",
                "hadithEnglish": "While I was sitting with the Prophet, Abu Bakr رضی اللہ عنہ came, lifting up one corner of his garment uncovering his knee. The Prophet (ﷺ) said, \"Your companion has had a quarrel.\" Abu Bakr رضی اللہ عنہ greeted (the Prophet (ﷺ) ) and said, \"O Allah's Messenger (ﷺ)! There was something (i.e. quarrel) between me and the Son of Al-Khattab. I talked to him harshly and then regretted that, and requested him to forgive me, but he refused. This is why I have come to you.\" The Prophet (ﷺ) said thrice, \"O Abu Bakr! May Allah forgive you.\" In the meanwhile, `Umar رضی اللہ عنہ regretted (his refusal of Abu Bakr's excuse) and went to Abu Bakr's house and asked if Abu Bakr رضی اللہ عنہ was there. They replied in the negative. So he came to the Prophet (ﷺ) and greeted him, but signs of displeasure appeared on the face of the Prophet (ﷺ) till Abu Bakr pitied (`Umar رضی اللہ عنہ), so he knelt and said twice, \"O Allah's Messenger (ﷺ)! By Allah! I was more unjust to him (than he to me).\" The Prophet (ﷺ) said, \"Allah sent me (as a Prophet) to you (people) but you said (to me), 'You are telling a lie,' while Abu Bakr said, 'He has said the truth,' and consoled me with himself and his money.\" He then said twice, \"Won't you then give up harming my companion?\" After that nobody harmed Abu Bakr رضی اللہ عنہ.",
                "hadithUrdu": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا کہ حضرت ابوبکر رضی اللہ عنہ اپنے کپڑے کا کنارہ پکڑے ہوئے ، گھٹنا ظاہر کئے ہوئے آئے ۔ آنحضرت صلی اللہ علیہ وسلم نے یہ حالت دیکھ کرفرمایا : معلوم ہوتا ہے تمہارے دوست کسی سے لڑ کر آئے ہیں ۔ پھر حضرت ابوبکر رضی اللہ عنہ نے حاضر ہو کر سلام کیا اور عرض کیا یا رسول اللہ ! میرے اور عمر بن خطاب کے درمیان کچھ تکرار ہو گئی تھی اور اس سلسلے میں میں نے جلدی میں ان کو سخت لفظ کہہ دیئے لیکن بعد میں مجھے سخت ندامت ہوئی تو میں نے ان سے معافی چاہی ، اب وہ مجھے معاف کرنے کے لیے تیار نہیں ہیں ۔ اسی لیے میں آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : اے ابوبکر ! تمہیں اللہ معاف کرے ۔ تین مرتبہ آپ نے یہ جملہ ارشاد فرمایا : حضرت عمر رضی اللہ عنہ کو بھی ندامت ہوئی اور حضرت ابوبکر رضی اللہ عنہ کے گھر پہنچے اور پوچھا کیا ابوبکر گھر پر موجود ہیں ؟ معلوم ہوا کہ نہیں تو آپ بھی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ نے سلام کیا ۔ آنحضرت صلی اللہ علیہ وسلم کا چہرہ مبارک غصہ سے بدل گیا اور ابوبکر رضی اللہ عنہ ڈرگئے اور گھٹنوں کے بل بیٹھ کر عرض کرنے لگے ، یا رسول اللہ ! اللہ کی قسم زیادتی میری ہی طرف سے تھی ۔ دو مرتبہ یہ جملہ کہا ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے فرمایا : اللہ نے مجھے تمہاری طرف نبی بنا کر بھیجا تھا ۔ اور تم لوگوں نے مجھ سے کہا تھا کہ تم جھوٹ بولتے ہو لیکن ابوبکرنے کہا تھا کہ آپ سچے ہیں اور اپنی جان و مال کے ذریعہ انہوں نے میری مدد کی تھی تو کیا تم لوگ میرے دوست کو ستانا چھوڑتے ہو یا نہیں ؟ آپ نے دو دفعہ یہی فرمایا : آپ کے یہ فرمانے کے بعد پھر ابوبکر رضی اللہ عنہ کو کسی نے نہیں ستایا ۔",
                "urduNarrator": "مجھ سے ہشام بن عمار نے بیان کیا ، کہا ہم سے صدقہ بن خالد نے بیان کیا ، ان سے زید بن واقد نے بیان کیا ، ان سے بسر بن عبیداللہ نے ، ان سے عائذ اللہ ابوادریس نے اور ان سے حضرت ابودرداء رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنِي هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ، حَدَّثَنَا زَيْدُ بْنُ وَاقِدٍ، عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ، عَنْ عَائِذِ اللَّهِ أَبِي إِدْرِيسَ، عَنْ أَبِي الدَّرْدَاءِ ـ رضى الله عنه ـ قَالَ كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صلى الله عليه وسلم إِذْ أَقْبَلَ أَبُو بَكْرٍ آخِذًا بِطَرَفِ ثَوْبِهِ حَتَّى أَبْدَى عَنْ رُكْبَتِهِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمَّا صَاحِبُكُمْ فَقَدْ غَامَرَ ‏\"‏‏.‏ فَسَلَّمَ، وَقَالَ إِنِّي كَانَ بَيْنِي وَبَيْنَ ابْنِ الْخَطَّابِ شَىْءٌ فَأَسْرَعْتُ إِلَيْهِ ثُمَّ نَدِمْتُ، فَسَأَلْتُهُ أَنْ يَغْفِرَ لِي فَأَبَى عَلَىَّ، فَأَقْبَلْتُ إِلَيْكَ فَقَالَ ‏\"‏ يَغْفِرُ اللَّهُ لَكَ يَا أَبَا بَكْرٍ ‏\"‏‏.‏ ثَلاَثًا، ثُمَّ إِنَّ عُمَرَ نَدِمَ فَأَتَى مَنْزِلَ أَبِي بَكْرٍ فَسَأَلَ أَثَمَّ أَبُو بَكْرٍ فَقَالُوا لاَ‏.‏ فَأَتَى إِلَى النَّبِيِّ صلى الله عليه وسلم، فَسَلَّمَ فَجَعَلَ وَجْهُ النَّبِيِّ صلى الله عليه وسلم يَتَمَعَّرُ حَتَّى أَشْفَقَ أَبُو بَكْرٍ، فَجَثَا عَلَى رُكْبَتَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ، وَاللَّهِ أَنَا كُنْتُ أَظْلَمَ مَرَّتَيْنِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ بَعَثَنِي إِلَيْكُمْ فَقُلْتُمْ كَذَبْتَ‏.‏ وَقَالَ أَبُو بَكْرٍ صَدَقَ‏.‏ وَوَاسَانِي بِنَفْسِهِ وَمَالِهِ، فَهَلْ أَنْتُمْ تَارِكُو لِي صَاحِبِي ‏\"‏‏.‏ مَرَّتَيْنِ فَمَا أُوذِيَ بَعْدَهَا‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3493,
                "hadithNumber": "3662",
                "englishNarrator": "Narrated `Amr bin Al-As رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ) deputed me to read the Army of Dhat-as-Salasil. I came to him and said, \"Who is the most beloved person to you?\" He said, \" `Aisha رضی اللہ عنہا .\" I asked, \"Among the men?\" He said, \"Her father.\" I said, \"Who then?\" He said, \"Then `Umar bin Al-Khattab رضی اللہ عنہ .\" He then named other men.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے انہیں غزوہ ذات السلاسل کے لیے بھیجا ( عمرو رضی اللہ عنہ نے بیان کیا کہ ) پھر میں آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور میں نے پوچھا کہ سب سے زیادہ محبت آپ صلی اللہ علیہ وسلم کو کس سے ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ عائشہ ( رضی اللہ عنہا ) سے میں نے پوچھا ، اور مردوں میں ؟ فرمایا کہ اس کے باپ سے ، میں نے پوچھا ، اس کے بعد ؟ فرمایا کہ عمر بن خطاب رضی اللہ عنہ سے ۔ اس طرح آپ صلی اللہ علیہ وسلم نے کئی آدمیوں کے نام لیے ۔",
                "urduNarrator": "ہم سے معلی بن اسد نے بیان کیا ، کہا ہم سے عبدالعزیز بن مختار نے بیان کیا ، کہا ہم سے خالد حذاء نے ، کہا ہم سے ابوعثمان نے بیان کیا ، کہا کہ مجھ سے حضرت عمرو بن عاص رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، قَالَ خَالِدٌ الْحَذَّاءُ حَدَّثَنَا عَنْ أَبِي عُثْمَانَ، قَالَ حَدَّثَنِي عَمْرُو بْنُ الْعَاصِ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَهُ عَلَى جَيْشِ ذَاتِ السَّلاَسِلِ، فَأَتَيْتُهُ فَقُلْتُ أَىُّ النَّاسِ أَحَبُّ إِلَيْكَ قَالَ ‏\"‏ عَائِشَةُ ‏\"‏‏.‏ فَقُلْتُ مِنَ الرِّجَالِ فَقَالَ ‏\"‏ أَبُوهَا ‏\"‏‏.‏ قُلْتُ ثُمَّ مَنْ قَالَ ‏\"‏ ثُمَّ عُمَرُ بْنُ الْخَطَّابِ ‏\"‏‏.‏ فَعَدَّ رِجَالاً‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3494,
                "hadithNumber": "3663",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"While a shepherd was amongst his sheep, a wolf attacked them and took away one sheep. When the shepherd chased the wolf, the wolf turned towards him and said, 'Who will be its guard on the day of wild animals when nobody except I will be its shepherd. And while a man was driving a cow with a load on it, it turned towards him and spoke to him saying, 'I have not been created for this purpose, but for ploughing.\" The people said, \"Glorified be Allah.\" The Prophet said, \"But I believe in it and so does Abu Bakr end `Umar.\"",
                "hadithUrdu": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایک چرواہا اپنی بکریاں چرارہا تھا کہ بھیڑیا آ گیا اور ریوڑ سے ایک بکری اٹھا کر لے جانے لگا ۔ چرواہے نے اس سے بکری چھڑانی چاہی تو بھیڑیا بول پڑا ۔ درندوں والے دن میں اس کی رکھوالی کرنے والا کون ہو گا جس دن میرے سوا اور کوئی چرواہا نہ ہو گا ۔ اسی طرح ایک شخص بیل کو اس پر سوار ہو کر لیے جا رہا تھا ، بیل اس کی طرف متوجہ ہو کر کہنے لگا کہ میری پیدائش اس کے لیے نہیں ہوئی ہے ۔ میں تو کھیتی باڑی کے کاموں کے لیے پیدا کیا گیا ہوں ۔ وہ شخص بول پڑا ۔ سبحان اللہ ! ( جانور اور انسانوں کی طرح باتیں کرے ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں ان واقعات پر ایمان لاتا ہوں اور ابوبکر اور عمر بن خطاب بھی ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہوں نے کہا کہ مجھے ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ بَيْنَمَا رَاعٍ فِي غَنَمِهِ عَدَا عَلَيْهِ الذِّئْبُ، فَأَخَذَ مِنْهَا شَاةً، فَطَلَبَهُ الرَّاعِي، فَالْتَفَتَ إِلَيْهِ الذِّئْبُ فَقَالَ مَنْ لَهَا يَوْمَ السَّبُعِ، يَوْمَ لَيْسَ لَهَا رَاعٍ غَيْرِي، وَبَيْنَا رَجُلٌ يَسُوقُ بَقَرَةً قَدْ حَمَلَ عَلَيْهَا، فَالْتَفَتَتْ إِلَيْهِ فَكَلَّمَتْهُ فَقَالَتْ إِنِّي لَمْ أُخْلَقْ لِهَذَا، وَلَكِنِّي خُلِقْتُ لِلْحَرْثِ ‏\"‏‏.‏ قَالَ النَّاسُ سُبْحَانَ اللَّهِ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَإِنِّي أُومِنُ بِذَلِكَ وَأَبُو بَكْرٍ وَعُمَرُ بْنُ الْخَطَّابِ رضى الله عنهما ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3495,
                "hadithNumber": "3664",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"While I was sleeping, I saw myself standing at a well, on it there was a bucket. I drew water from the well as much as Allah wished. Then Ibn Abi Quhafa (i.e. Abu Bakr رضی اللہ عنہ) took the bucket from me and brought out one or two buckets (of water) and there was weakness in his drawing the water. May Allah forgive his weakness for him. Then the bucket turned into a very big one and Ibn Al-Khattab رضی اللہ عنہ took it over and I had never seen such a mighty person amongst the people as him in performing such hard work, till the people drank to their satisfaction and watered their camels that knelt down there.\"",
                "hadithUrdu": "میں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ، ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں سو رہا تھا کہ خواب میں میں نے اپنے آپ کو ایک کنویں پر دیکھا جس پر ڈول تھا ۔ اللہ تعالیٰ نے جتنا چاہا میں نے اس ڈول سے پانی کھینچا ، پھر اسے ابن ابی قحافہ ( حضرت ابوبکر رضی اللہ عنہ ) نے لے لیا اور انہوں نے ایک یا دو ڈول کھینچے ، ان کے کھینچنے میں کچھ کمزوری سی معلوم ہوئی اللہ ان کی اس کمزوری کو معاف فرمائے ۔ پھر اس ڈول نے ایک بہت بڑے ڈول کی صورت اختیار کر لی اور اسے عمر بن خطاب ( رضی اللہ عنہ ) نے اپنے ہاتھ میں لے لیا ۔ میں نے ایسا شہ زور پہلوان آدمی نہیں دیکھا جو عمر ( رضی اللہ عنہ ) کی طرح ڈول کھینچ سکتا ۔ انہوں نے اتنا پانی نکالا کہ لوگوں نے اپنے اونٹوں کو حوض سے سیراب کر لیا ۔",
                "urduNarrator": "ہم سے عبدان نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں یونس نے ، ان سے زہری نے بیان کیا ، کہامجھ کو ابن المسیب نے خبر دی اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ",
                "hadithArabic": "حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي ابْنُ الْمُسَيَّبِ، سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي عَلَى قَلِيبٍ عَلَيْهَا دَلْوٌ، فَنَزَعْتُ مِنْهَا مَا شَاءَ اللَّهُ، ثُمَّ أَخَذَهَا ابْنُ أَبِي قُحَافَةَ، فَنَزَعَ بِهَا ذَنُوبًا أَوْ ذَنُوبَيْنِ، وَفِي نَزْعِهِ ضَعْفٌ، وَاللَّهُ يَغْفِرُ لَهُ ضَعْفَهُ، ثُمَّ اسْتَحَالَتْ غَرْبًا، فَأَخَذَهَا ابْنُ الْخَطَّابِ، فَلَمْ أَرَ عَبْقَرِيًّا مِنَ النَّاسِ يَنْزِعُ نَزْعَ عُمَرَ، حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3496,
                "hadithNumber": "3665",
                "englishNarrator": "Narrated `Abdullah bin `Umar رضی اللہ عنہما :",
                "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Allah will not look on the Day of Judgment at him who drags his robe (behind him) out of pride.\" Abu Bakr رضی اللہ عنہ said \"One side of my robe slacks down unless I get very cautious about it.\" Allah's Messenger (ﷺ) said, \"But you do not do that with a pride.\" Musa bin Uqbah inquired from Saalim whether Hadrat Abdullah bin Umer رضی اللہ عنہ said:  جَرَّ إِزَارَهُ. He replied: No but I have heard \"ثَوْبَهُ‏\".",
                "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو شخص اپنا کپڑا ( پاجامہ یا تہبند وغیرہ ) تکبر اور غرور کی وجہ سے زمین پر گھسیٹتا چلے تو اللہ تعالیٰ قیامت کے دن اس کی طرف نظر رحمت سے دیکھے گا بھی نہیں ، اس پر حضرت ابوبکر صدیق رضی اللہ عنہ نے عرض کیا کہ میرے کپڑے کا ایک حصہ لٹک جایا کرتا ہے ۔ البتہ اگر میں پوری طرح خیال رکھوں تو وہ نہیں لٹک سکے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ آپ تو ایسا تکبر کے خیال سے نہیں کرتے ( اس لیے آپ اس حکم میں داخل نہیں ہیں ) موسیٰ نے کہا کہ میں نے سالم سے پوچھا ، کیا حضرت عبداللہ بن عمر رضی اللہ عنہما نے اس حدیث میں یہ فرمایا تھا کہ جو اپنی ازار کو گھسیٹتے ہوئے چلے ، تو انہوں نے کہا کہ میں نے تو ان سے یہی سنا کہ جو کوئی اپنا کپڑا لٹکائے ۔",
                "urduNarrator": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو موسیٰ بن عقبہ نے خبر دی ، انہیں سالم بن عبداللہ نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ جَرَّ ثَوْبَهُ خُيَلاَءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ إِنَّ أَحَدَ شِقَّىْ ثَوْبِي يَسْتَرْخِي إِلاَّ أَنْ أَتَعَاهَدَ ذَلِكَ مِنْهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكَ لَسْتَ تَصْنَعُ ذَلِكَ خُيَلاَءَ ‏\"‏ قَالَ مُوسَى فَقُلْتُ لِسَالِمٍ أَذَكَرَ عَبْدُ اللَّهِ مَنْ جَرَّ إِزَارَهُ قَالَ لَمْ أَسْمَعْهُ ذَكَرَ إِلاَّ ثَوْبَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3497,
                "hadithNumber": "3666",
                "englishNarrator": "Narrated Abu Huraira رضی اللہ عنہ :",
                "hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"Anybody who spends a pair of something in Allah's Cause will be called from all the gates of Paradise, \"O Allah's slave! This is good.' He who is amongst those who pray will be called from the gate of the prayer (in Paradise) and he who is from the people of Jihad will be called from the gate of Jihad, and he who is from those' who give in charity (i.e. Zakat) will be called from the gate of charity, and he who is amongst those who observe fast will be called from the gate of fasting, the gate of Raiyan.\" Abu Bakr   \r\n رضی اللہ عنہ said, \"He who is called from all those gates will need nothing,\" He added, \"Will anyone be called from all those gates, O Allah's Messenger (ﷺ)?\" He said, \"Yes, and I hope you will be among those, O Abu Bakr.\"",
                "hadithUrdu": "میں نے رسول کریم صلی اللہ علیہ وسلم سے سنا ۔ ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس نے اللہ کے راستے میں کسی چیز کا ایک جوڑا خرچ کیا ( مثلا ًدو روپے ، دو کپڑے ، دو گھوڑے اللہ تعالیٰ کے راستے میں دیے ) تو اسے جنت کے دروازوں سے بلایا جائے گا کہ اے اللہ کے بندے ! ادھر آ ، یہ دروازہ بہتر ہے پس جو شخص نمازی ہو گا اسے نماز کے دروازے سے بلایا جائے گا ، جو شخص مجاہد ہو گا اسے جہاد کے دوازے سے بلایا جائے گا ، جو شخص اہل صدقہ میں سے ہو گا اسے صدقہ کے دروازہ سے بلایا جائے گا اور جو شخص روزہ دار ہو گا اسے صیام اور ریان ( سیرابی ) کے دروازے سے بلایا جائے گا ۔ حضرت ابوبکر رضی اللہ عنہ نے عرض کیا جس شخص کو ان تمام ہی درازوں سے بلایاجائے گا پھر تو اسے کسی قسم کا خوف باقی نہیں رہے گا اور پوچھا کیا کوئی شخص ایسا بھی ہو گا جسے ان تمام دروازوں سے بلایا جائے گا یا رسول اللہ ! آپ صلی اللہ علیہ وسلم نے فرمایا : ہاں اور مجھے امید ہے کہ تم بھی انہیں میں سے ہو گے اے ابوبکر ! ۔",
                "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم سے شعیب نے بیان کیا ، ان سے زہری نے بیان کیا ، انہوں نے کہا کہ مجھے حمید بن عبدالرحمٰن بن عوف نے خبر دی اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ أَنْفَقَ زَوْجَيْنِ مِنْ شَىْءٍ مِنَ الأَشْيَاءِ فِي سَبِيلِ اللَّهِ دُعِيَ مِنْ أَبْوَابِ ـ يَعْنِي الْجَنَّةَ ـ يَا عَبْدَ اللَّهِ هَذَا خَيْرٌ، فَمَنْ كَانَ مِنْ أَهْلِ الصَّلاَةِ دُعِيَ مِنْ باب الصَّلاَةِ، وَمَنْ كَانَ مِنْ أَهْلِ الْجِهَادِ دُعِيَ مِنْ باب الْجِهَادِ، وَمَنْ كَانَ مِنْ أَهْلِ الصَّدَقَةِ دُعِيَ مِنْ باب الصَّدَقَةِ، وَمَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ باب الصِّيَامِ، وَبَابِ الرَّيَّانِ ‏\"‏‏.‏ فَقَالَ أَبُو بَكْرٍ مَا عَلَى هَذَا الَّذِي يُدْعَى مِنْ تِلْكَ الأَبْوَابِ مِنْ ضَرُورَةٍ، وَقَالَ هَلْ يُدْعَى مِنْهَا كُلِّهَا أَحَدٌ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ نَعَمْ، وَأَرْجُو أَنْ تَكُونَ مِنْهُمْ يَا أَبَا بَكْرٍ ‏\"‏‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3498,
                "hadithNumber": "3667, 3668",
                "englishNarrator": "Narrated 'Aisha (the wife of the Prophet) رضی اللہ عنہا :",
                "hadithEnglish": "Allah's Messenger (ﷺ) died while Abu Bakr رضی اللہ عنہ was at a place called As-Sunah (Al-'Aliya). Ismail the transmitter, says: That Madinah heights. So, 'Umar رضی اللہ عنہ stood up and said, \"By Allah! Allah's Messenger (ﷺ) is not dead!\" 'Umar رضی اللہ عنہ (later on) said, \"By Allah! Nothing occurred to my mind except that.\" He said, \"Verily! Allah will resurrect him and he will cut the hands and legs of some men.\" Then Abu Bakr رضی اللہ عنہ came and uncovered the face of Allah's Messenger (ﷺ), kissed him and said, \"Let my mother and father be sacrificed for you, (O Allah's Messenger (ﷺ)), you are good in life and in death. By Allah in Whose Hands my life is, Allah will never make you taste death twice.\" Then he went out and said, \"O oath-taker! Don't be hasty.\" When Abu Bakr رضی اللہ عنہ spoke, 'Umar رضی اللہ عنہ sat down. Abu Bakr رضی اللہ عنہ  praised and glorified Allah and said, No doubt! Whoever worshipped Muhammad, then Muhammad is dead, but whoever worshipped Allah, then Allah is Alive and shall never die.\" Then he recited Allah's Statement.:-- \"(O Muhammad) Verily you will die, and they also will die.\" (39.30) He also recited:--\r\n\"Muhammad is no more than an Apostle; and indeed many Apostles have passed away, before him, If he dies Or is killed, will you then Turn back on your heels? And he who turns back On his heels, not the least Harm will he do to Allah And Allah will give reward to those Who are grateful.\" (3.144)\r\nThe people wept loudly, and the Ansar were assembled with Sad bin 'Ubada in the shed of Bani Saida. They said (to the emigrants). \"There should be one 'Amir from us and one from you.\" Then Abu Bakr رضی اللہ عنہ, Umar bin Al-Khattab رضی اللہ عنہ and Abu 'baida bin Al-Jarrah went to them. 'Umar رضی اللہ عنہ wanted to speak but Abu Bakr رضی اللہ عنہ stopped him. 'Umar رضی اللہ عنہ later on used to say, \"By Allah, I intended only to say something that appealed to me and I was afraid that Abu Bakr رضی اللہ عنہ would not speak so well. Then Abu Bakr رضی اللہ عنہ spoke and his speech was very eloquent. He said in his statement, \"We are the rulers and you (Ansars) are the ministers (i.e. advisers),\" Hubab bin Al-Mundhir said, \"No, by Allah we won't accept this. But there must be a ruler from us and a ruler from you.\" Abu Bakr رضی اللہ عنہ said, \"No, we will be the rulers and you will be the ministers, for they (i.e. Quarish) are the best family amongst the 'Arabs and of best origin. So you should elect either 'Umar رضی اللہ عنہ or Abu 'Ubaida bin Al-Jarrah as your ruler.\" 'Umar رضی اللہ عنہ said (to Abu Bakr), \"No but we elect you, for you are our chief and the best amongst us and the most beloved of all of us to Allah's Messenger (ﷺ).\" So 'Umar took Abu Bakr's hand and gave the pledge of allegiance and the people too gave the pledge of allegiance to Abu Bakr رضی اللہ عنہ . Someone said, \"You have killed Sad bin Ubada.\" 'Umar رضی اللہ عنہ said, \"Allah has killed him.\"",
                "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم کی جب وفات ہوئی تو حضرت ابوبکر رضی اللہ عنہ اس وقت مقام سنح میں تھے ، اسماعیل نے کہا یعنی عوالی کے ایک گاؤں میں ۔ آپ کی خبر سن کر حضرت عمر اٹھ کریہ کہنے لگے کہ اللہ کی قسم رسول اللہ صلی اللہ علیہ وسلم کی وفات نہیں ہوئی ۔ حضرت عائشہ رضی اللہ عنہا نے کہا کہ حضرت عمر رضی اللہ عنہ کہا کرتے تھے اللہ کی قسم اس وقت میرے دل میں یہی خیال آتا تھا اور میں کہتاتھا کہ اللہ آپ کو ضرور اس بیماری سے اچھا کر کے اٹھائے گا اور آپ ان لوگوں کے ہاتھ اور پاؤں کاٹ دیں گے ( جو آپ کی موت کی باتیں کرتے ہیں ) اتنے میں حضرت ابوبکر رضی اللہ عنہ تشریف لے آئے اور اندر جا کر آپ کی نعش مبارک کے اوپر سے کپڑا اٹھایا اور بوسہ دیا اور کہا : میرے ماں باپ آپ پر فدا ہوں ۔ آپ زندگی میں بھی پاکیزہ تھے اور وفات کے بعد بھی اور اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ، اللہ تعالیٰ آپ پر دو مرتبہ موت ہرگز طاری نہیں کرے گا ۔ اس کے بعد آپ باہر آئے اور عمر رضی اللہ عنہ سے کہنے لگے اے قسم کھانے والے ! ذرا تامل کر ۔ پھر جب حضرت ابوبکر رضی اللہ عنہ نے گفتگو شروع کی تو حضرت عمر رضی اللہ عنہ خاموش بیٹھ گئے ۔حضرت ابوبکر رضی اللہ عنہ نے پہلے اللہ کی حمد و ثنا بیان کی ۔ پھر فرمایا : لوگو ! دیکھو اگر کوئی محمد ( صلی اللہ علیہ وسلم ) کو پوجتا تھا ( یعنی یہ سمجھتا تھا کہ وہ آدمی نہیں ہیں ، وہ کبھی نہیں مریں گے ) تو اسے معلوم ہونا چاہیے کہ حضرت محمد صلی اللہ علیہ وسلم کی وفات ہو چکی ہے اور جو شخص اللہ کی پوجا کرتا تھا تو اللہ ہمیشہ زندہ ہے اسے موت کبھی نہیں آئے گی ۔ ( پھر ابوبکر رضی اللہ عنہ نے سورۃ الزمر کی یہ آیت پڑھی ) ” اے پیغبر ! توبھی مرنے والا ہے اور وہ بھی مریں گے “ اور اللہ تعالیٰ نے فرمایا کہ ” محمد صلی اللہ علیہ وسلم صرف ایک رسول ہیں ۔ اس سے پہلے بھی بہت سے رسول گزر چکے ہیں ۔ پس کیا اگر وہ وفات پا جائیں یا انہیں شہید کر دیا جائے تو تم اسلام سے پھر جاؤ گے اور جو شخص اپنی ایڑیوں کے بل پھر جائے تو وہ اللہ کو کوئی نقصان نہیں پہنچا سکے گا اور اللہ عنقریب شکرگزار بندوں کو بدلہ دینے والا ہے “ راوی نے بیان کیا کہ یہ سن کر لوگ پھوٹ پھوٹ کررونے لگے ۔ راوی نے بیان کیا کہ انصار سقیفہ بنی ساعدہ میں سعد بن عبادہ رضی اللہ عنہ کے پاس جمع ہو گئے اور کہنے لگے کہ ایک امیر ہم میں سے ہو گا اور ایک امیر تم ( مہاجرین ) میں سے ہو گا ( دونوں مل کر حکومت کریں گے ) پھر ابوبکر ، عمر بن خطاب اور ابوعبیدہ بن جراح رضی اللہ عنہم ان کی مجلس میں پہنچے ۔ عمر رضی اللہ عنہ نے گفتگو کرنی چاہی لیکن حضرت ابوبکر رضی اللہ عنہ نے ان سے خاموش رہنے کے لیے کہا ۔ عمر رضی اللہ عنہ کہا کرتے تھے کہ اللہ کی قسم میں نے ایسا صرف اس وجہ سے کیا تھا کہ میں نے پہلے ہی سے ایک تقریر تیار کر لی تھی جو مجھے بہت پسند آئی تھی پھر بھی مجھے ڈرتھا کہ ابوبکر رضی اللہ عنہ کی برابری اس سے بھی نہیں ہو سکے گی ۔ پھر حضرت ابوبکر رضی اللہ عنہ نے انتہائی بلاغت کے ساتھ بات شروع کی ۔ انہوں نے اپنی تقریر میں فرمایا کہ ہم ( قریش ) امراء ہیں اور تم ( جماعت انصار ) وزارء ہو ۔ اس پر حضرت حباب بن منذر رضی اللہ عنہ بولے کہ نہیں اللہ کی قسم ہم ایسا نہیں ہونے دیں گے ، ایک امیر ہم میں سے ہو گا اور ایک امیر تم میں سے ہو گا ۔ حضرت ابوبکر رضی اللہ عنہ نے فرمایا کہ نہیں ہم امراء ہیں تم وزارء ہو ( وجہ یہ ہے کہ ) قریش کے لوگ سارے عرب میں شریف خاندان شمار کیے جاتے ہیں اور ان کاملک ( یعنی مکہ ) عرب کے بیچ میں ہے تو اب تم کو اختیار ہے یا تو عمر رضی اللہ عنہ کی بیعت کر لو یا ابوعبیدہ بن جراح کی ۔ حضرت عمر رضی اللہ عنہ نے کہا : نہیں ہم آپ کی ہی بیعت کریں گے ۔ آپ ہمارے سردار ہیں ، ہم میں سب سے بہتر ہیں اور رسول کریم صلی اللہ علیہ وسلم کے نزدیک آپ ہم سب سے زیادہ محبوب ہیں ۔ حضرت عمر رضی اللہ عنہ نے ان کا ہاتھ پکڑ لیا اور ان کے ہاتھ پر بیعت کر لی پھر سب لوگوں نے بیعت کی ۔ اتنے میں کسی کی آواز آئی کہ سعد بن عبادہ رضی اللہ عنہ کو تم لوگوں نے مارڈالا ۔ عمر رضی اللہ عنہ نے کہا : انہیں اللہ نے مارڈالا ۔",
                "urduNarrator": "مجھ سے اسماعیل بن عبداللہ نے بیان کیا ، کہا ہم سے سلیمان بن بلال نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے عروہ بن زبیرنے اور ان سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَاتَ وَأَبُو بَكْرٍ بِالسُّنْحِ ـ قَالَ إِسْمَاعِيلُ يَعْنِي بِالْعَالِيَةِ ـ فَقَامَ عُمَرُ يَقُولُ وَاللَّهِ مَا مَاتَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ قَالَتْ وَقَالَ عُمَرُ وَاللَّهِ مَا كَانَ يَقَعُ فِي نَفْسِي إِلاَّ ذَاكَ وَلَيَبْعَثَنَّهُ اللَّهُ فَلَيَقْطَعَنَّ أَيْدِيَ رِجَالٍ وَأَرْجُلَهُمْ‏.‏ فَجَاءَ أَبُو بَكْرٍ فَكَشَفَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَبَّلَهُ قَالَ بِأَبِي أَنْتَ وَأُمِّي طِبْتَ حَيًّا وَمَيِّتًا، وَالَّذِي نَفْسِي بِيَدِهِ لاَ يُذِيقُكَ اللَّهُ الْمَوْتَتَيْنِ أَبَدًا‏.‏ ثُمَّ خَرَجَ فَقَالَ أَيُّهَا الْحَالِفُ عَلَى رِسْلِكَ‏.‏ فَلَمَّا تَكَلَّمَ أَبُو بَكْرٍ جَلَسَ عُمَرُ‏.‏فَحَمِدَ اللَّهَ أَبُو بَكْرٍ وَأَثْنَى عَلَيْهِ وَقَالَ أَلاَ مَنْ كَانَ يَعْبُدُ مُحَمَّدًا صلى الله عليه وسلم فَإِنَّ مُحَمَّدًا قَدْ مَاتَ، وَمَنْ كَانَ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَىٌّ لاَ يَمُوتُ‏.‏ وَقَالَ ‏{‏إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَيِّتُونَ‏}‏ وَقَالَ ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَفَإِنْ مَاتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلَى أَعْقَابِكُمْ وَمَنْ يَنْقَلِبْ عَلَى عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئًا وَسَيَجْزِي اللَّهُ الشَّاكِرِينَ‏}‏ قَالَ فَنَشَجَ النَّاسُ يَبْكُونَ ـ قَالَ ـ وَاجْتَمَعَتِ الأَنْصَارُ إِلَى سَعْدِ بْنِ عُبَادَةَ فِي سَقِيفَةِ بَنِي سَاعِدَةَ فَقَالُوا مِنَّا أَمِيرٌ وَمِنْكُمْ أَمِيرٌ، فَذَهَبَ إِلَيْهِمْ أَبُو بَكْرٍ وَعُمَرُ بْنُ الْخَطَّابِ وَأَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ، فَذَهَبَ عُمَرُ يَتَكَلَّمُ فَأَسْكَتَهُ أَبُو بَكْرٍ، وَكَانَ عُمَرُ يَقُولُ وَاللَّهِ مَا أَرَدْتُ بِذَلِكَ إِلاَّ أَنِّي قَدْ هَيَّأْتُ كَلاَمًا قَدْ أَعْجَبَنِي خَشِيتُ أَنْ لاَ يَبْلُغَهُ أَبُو بَكْرٍ، ثُمَّ تَكَلَّمَ أَبُو بَكْرٍ فَتَكَلَّمَ أَبْلَغَ النَّاسِ فَقَالَ فِي كَلاَمِهِ نَحْنُ الأُمَرَاءُ وَأَنْتُمُ الْوُزَرَاءُ‏.‏ فَقَالَ حُبَابُ بْنُ الْمُنْذِرِ لاَ وَاللَّهِ لاَ نَفْعَلُ، مِنَّا أَمِيرٌ وَمِنْكُمْ أَمِيرٌ‏.‏ فَقَالَ أَبُو بَكْرٍ لاَ، وَلَكِنَّا الأُمَرَاءُ وَأَنْتُمُ الْوُزَرَاءُ هُمْ أَوْسَطُ الْعَرَبِ دَارًا، وَأَعْرَبُهُمْ أَحْسَابًا فَبَايِعُوا عُمَرَ أَوْ أَبَا عُبَيْدَةَ‏.‏ فَقَالَ عُمَرُ بَلْ نُبَايِعُكَ أَنْتَ، فَأَنْتَ سَيِّدُنَا وَخَيْرُنَا وَأَحَبُّنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ فَأَخَذَ عُمَرُ بِيَدِهِ فَبَايَعَهُ، وَبَايَعَهُ النَّاسُ، فَقَالَ قَائِلٌ قَتَلْتُمْ سَعْدَ بْنَ عُبَادَةَ‏.‏ فَقَالَ عُمَرُ قَتَلَهُ اللَّهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3499,
                "hadithNumber": "3669, 3670",
                "englishNarrator": "Narrator `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "(\"When the Prophet (ﷺ) was on his death-bed) he looked up and said thrice, (Amongst) the Highest Companion (See Qur'an 4.69)' Aisha رضی اللہ عنہ said, Allah benefited the people by their two speeches. 'Umar رضی اللہ عنہ  frightened the people some of whom were hypocrites whom Allah caused to abandon Islam because of 'Umar's speech. Then Abu Bakr رضی اللہ عنہ led the people to True Guidance and acquainted them with the right path they were to follow so that they went out reciting:\r\n-- \"Muhammad is no more than an Apostle and indeed many Apostles have passed away before him..\" (3.144)",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم کی نظر ( وفات سے پہلے ) اٹھی اور آپ نے فرما یا : اے اللہ ! مجھے رفیق اعلیٰ میں ( داخل کر ) آپ نے یہ جملہ تین مرتبہ فرمایا اور راوی نے پوری حدیث بیان کی ۔ عائشہ رضی اللہ عنہا نے کہا کہ حضرت ابوبکراور عمر رضی اللہ عنہما دونوں ہی کے خطبوں سے نفع پہنچا ۔ حضرت عمر رضی اللہ عنہ نے لوگوں کو دھمکایا کیونکہ ان میں بعض منافقین بھی تھے ، اس لیے اللہ تعالیٰ نے اس طرح ( غلط افواہیں پھیلانے سے ) ان کو باز رکھا ۔اور بعد میں حضرت ابوبکر رضی اللہ عنہ نے جو حق اور ہدایت کی بات تھی وہ لوگوں کو سمجھادی اور ان کو بتلادیا جو ان پر لازم تھا ( یعنی اسلام پر قائم رہنا ) اور وہ یہ آیت تلاوت کرتے ہوئے باہر آئے ” محمد صلی اللہ علیہ وسلم ایک رسول ہیں اور ان سے پہلے بھی رسول گزر چکے ہیں ۔ الشاکرین ، تک ۔",
                "urduNarrator": "اور عبداللہ بن سالم نے زبیدی سے نقل کیا کہ عبدالرحمٰن بن قاسم نے بیان کیا ، انہیں قاسم نے خبر دی اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "وَقَالَ عَبْدُ اللَّهِ بْنُ سَالِمٍ عَنِ الزُّبَيْدِيِّ، قَالَ عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ أَخْبَرَنِي الْقَاسِمُ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ شَخَصَ بَصَرُ النَّبِيِّ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ فِي الرَّفِيقِ الأَعْلَى ‏\"‏‏.‏ ثَلاَثًا، وَقَصَّ الْحَدِيثَ، قَالَتْ فَمَا كَانَتْ مِنْ خُطْبَتِهِمَا مِنْ خُطْبَةٍ إِلاَّ نَفَعَ اللَّهُ بِهَا، لَقَدْ خَوَّفَ عُمَرُ النَّاسَ وَإِنَّ فِيهِمْ لَنِفَاقًا، فَرَدَّهُمُ اللَّهُ بِذَلِكَ‏. ثُمَّ لَقَدْ بَصَّرَ أَبُو بَكْرٍ النَّاسَ الْهُدَى وَعَرَّفَهُمُ الْحَقَّ الَّذِي عَلَيْهِمْ وَخَرَجُوا بِهِ يَتْلُونَ ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ‏}‏ إِلَى ‏{‏الشَّاكِرِينَ‏}‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3500,
                "hadithNumber": "3671",
                "englishNarrator": "Narrated Muhammad bin Al-Hanafiya:",
                "hadithEnglish": "I asked my father (`Ali bin Abi Talib رضی اللہ عنہ ), \"Who are the best people after Allah's Messenger (ﷺ) ?\" He said, \"Abu Bakr رضی اللہ عنہ .\" I asked, \"Who then?\" He said, \"Then `Umar رضی اللہ عنہ . \" I was afraid he would say \"Uthman رضی اللہ عنہ , so I said, \"Then you?\" He said, \"I am only an ordinary person.",
                "hadithUrdu": "میں نے اپنے والد ( علی رضی اللہ عنہ ) سے پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم کے بعد سب سے افضل صحابی کون ہیں ؟ انہوں نے بتلایا کہ ابوبکر ( رضی اللہ عنہ ) میں نے پوچھا پھر کون ہیں ؟ انہوں نے بتلایا ، اس کے بعد عمر رضی اللہ عنہ ہیں ۔ مجھے اس کا اندیشہ ہوا کہ اب ( پھر میں نے پوچھا کہ اس کے بعد ؟ تو ) کہہ دیں گے کہ عثمان رضی اللہ عنہ اس لیے میں نے خود کہا ، اس کے بعد آپ ہیں ؟ یہ سن کر وہ بولے کہ میں تو صرف عام مسلمانوں کی جماعت کا ایک شخص ہوں ۔",
                "urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان ثوری نے خبر دی ، کہا ہم سے جامع بن ابی راشد نے بیان کیا ، کہا ہم سے ابویعلیٰ نے بیان کیا ، ان سے محمد بن حنفیہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنَا جَامِعُ بْنُ أَبِي رَاشِدٍ، حَدَّثَنَا أَبُو يَعْلَى، عَنْ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ، قَالَ قُلْتُ لأَبِي أَىُّ النَّاسِ خَيْرٌ بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ أَبُو بَكْرٍ‏.‏ قُلْتُ ثُمَّ مَنْ قَالَ ثُمَّ عُمَرُ‏.‏ وَخَشِيتُ أَنْ يَقُولَ عُثْمَانُ قُلْتُ ثُمَّ أَنْتَ قَالَ مَا أَنَا إِلاَّ رَجُلٌ مِنَ الْمُسْلِمِينَ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3501,
                "hadithNumber": "3672",
                "englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
                "hadithEnglish": "We went out with Allah's Messenger (ﷺ) on one of his journeys till we reached Al-Baida or Dhatul-Jaish where my necklace got broken (and lost). Allah's Messenger (ﷺ) stopped to search for it and the people too stopped with him. There was no water at that place and they had no water with them. So they went to Abu Bakr        رضی اللہ عنہ and said, \"Don't you see what `Aisha رضی اللہ عنہا has done? She has made Allah's Messenger (ﷺ) and the people stop where there is no water and they have no water with them. Abu Bakr رضی اللہ عنہ came while Allah's Apostle was sleeping with his head on my thigh and said, \"You detained Allah Apostle and the people where there is no water and they have no water.\" He then admonished me and said what Allah wished and pinched me at my flanks with his hands, but I did not move because the head of Allah's Messenger (ﷺ) was on my thigh . Allah's Messenger (ﷺ) kept on sleeping till be got up in the morning and found no water. Then Allah revealed the Divine Verse of Tayammum, and the people performed Tayammum. Usaid bin AlHudair رضی اللہ عنہ said. \"O family of Abu Bakr! This is not the first blessings of yours.\" We urged the camel on which I was sitting to get up from its place and the necklace was found under it.",
                "hadithUrdu": "ایک سفر میں ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چلے جب ہم مقام بیداء یا مقام ذات الجیش پر پہنچے تو میرا ایک ہار ٹوٹ کر گر گیا ، اس لیے حضور اکرم صلی اللہ علیہ وسلم اس کی تلاش کے لیے وہاں ٹھہر گئے اور صحابہ بھی آپ کے ساتھ ٹھہرے لیکن نہ اس جگہ پانی تھا اور نہ ان کے پاس پانی تھا ۔ لوگ حضرت ابوبکر رضی اللہ عنہ کے پاس آ کر کہنے لگے کہ آپ ملاحظہ نہیں فرماتے ، عائشہ رضی اللہ عنہا نے کیا کیا ، حضور اکرم صلی اللہ علیہ وسلم کو یہیں روک لیا ہے ۔ اتنے صحابہ آپ کے ساتھ ہیں ۔ نہ تو یہاں پانی ہے اور نہ لوگ اپنے ساتھ ( پانی ) لیے ہوئے ہیں ۔ اس کے بعد حضرت ابوبکر رضی اللہ عنہ اندر آئے ۔ رسول اللہ صلی اللہ علیہ وسلم اس وقت اپنا سرمبارک میری ران پر رکھے ہوئے سورہے تھے ۔ وہ کہنے لگے ، تمہاری وجہ سے آنحضرت صلی اللہ علیہ وسلم کو اور سب لوگوں کو رکنا پڑا ۔ اب نہ یہاں کہیں پانی ہے اور نہ لوگوں کے پاس پانی ہے ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ حضرت ابوبکر رضی اللہ عنہ نے مجھ پر غصہ کیا اور جو کچھ اللہ کو منظور تھا انہوں نے کہا اور اپنے ہاتھ سے میری کوکھ میں کچوکے لگانے لگے ۔ میں ضرور تڑپ اٹھتی مگر آنحضرت صلی اللہ علیہ وسلم کا سرمبارک میری ران پر تھا ۔ آنحضرت صلی اللہ علیہ وسلم سوئے رہے ۔ جب صبح ہوئی تو پانی نہیں تھا اور اسی موقع پر اللہ تعالیٰ نے تیمم کا حکم نازل فرمایا اور سب نے تیمم کیا ۔ اس پر اسید بن حضیر رضی اللہ عنہ نے کہا کہ اے آل ابوبکر ! یہ تمہاری کوئی پہلی برکت نہیں ہے ۔ حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ پھر ہم نے جب اس اونٹ کو اٹھایا جس پر میں سوار تھی تو ہار اسی کے نیچے ہمیں ملا ۔",
                "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، ان سے مالک نے ، ان سے عبدالرحمٰن بن قاسم نے بیان کیا ، ان سے ان کے والد نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ، حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ أَوْ بِذَاتِ الْجَيْشِ انْقَطَعَ عِقْدٌ لِي، فَأَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْتِمَاسِهِ، وَأَقَامَ النَّاسُ مَعَهُ، وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ، فَأَتَى النَّاسُ أَبَا بَكْرٍ، فَقَالُوا أَلاَ تَرَى مَا صَنَعَتْ عَائِشَةُ أَقَامَتْ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَبِالنَّاسِ مَعَهُ، وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ، فَجَاءَ أَبُو بَكْرٍ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَاضِعٌ رَأْسَهُ عَلَى فَخِذِي قَدْ نَامَ، فَقَالَ حَبَسْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالنَّاسَ، وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ قَالَتْ فَعَاتَبَنِي، وَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ، وَجَعَلَ يَطْعُنُنِي بِيَدِهِ فِي خَاصِرَتِي، فَلاَ يَمْنَعُنِي مِنَ التَّحَرُّكِ إِلاَّ مَكَانُ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى فَخِذِي، فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى أَصْبَحَ عَلَى غَيْرِ مَاءٍ فَأَنْزَلَ اللَّهُ آيَةَ التَّيَمُّمِ، فَتَيَمَّمُوا، فَقَالَ أُسَيْدُ بْنُ الْحُضَيْرِ مَا هِيَ بِأَوَّلِ بَرَكَتِكُمْ يَا آلَ أَبِي بَكْرٍ‏.‏ فَقَالَتْ عَائِشَةُ فَبَعَثْنَا الْبَعِيرَ الَّذِي كُنْتُ عَلَيْهِ فَوَجَدْنَا الْعِقْدَ تَحْتَهُ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            },
            {
                "id": 3502,
                "hadithNumber": "3673",
                "englishNarrator": "Narrated Abu Sa`id رضی اللہ عنہ :",
                "hadithEnglish": "The Prophet (ﷺ)said, \"Do not abuse my companions for if any one of you spent gold equal to Uhud (in Allah's Cause) it would not be equal to a Mud or even a half Mud spent by one of them.\" Moreover, Jareer, Abdullah bin Dawood, Abu Moaviyah, Muhadir has corroborated him from Aamash.",
                "hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا : میرے اصحاب کو برا بھلامت کہو ۔ اگر کوئی شخص احد پہاڑ کے برابر بھی سونا ( اللہ کی راہ میں ) خرچ کر ڈالے تو ان کے ایک مد غلہ کے برابر بھی نہیں ہو سکتا اور نہ ان کے آدھے مد کے برابر ۔ شعبہ کے ساتھ اس حدیث کو جریر ، عبداللہ بن داود ، ابومعاویہ اور محاضر نے بھی اعمش سے روایت کیا ہے ۔",
                "urduNarrator": "ہم سے آدم بن ابی ایاس نے بیان کیا ، ہم سے شعبہ نے بیان کیا ، ان سے اعمش نے بیان کیا ، کہا میں نے ذکوان سے سنا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
                "hadithArabic": "حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ ذَكْوَانَ، يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ لاَ تَسُبُّوا أَصْحَابِي، فَلَوْ أَنَّ أَحَدَكُمْ أَنْفَقَ مِثْلَ أُحُدٍ ذَهَبًا مَا بَلَغَ مُدَّ أَحَدِهِمْ وَلاَ نَصِيفَهُ ‏\"‏‏.‏ تَابَعَهُ جَرِيرٌ وَعَبْدُ اللَّهِ بْنُ دَاوُدَ وَأَبُو مُعَاوِيَةَ وَمُحَاضِرٌ عَنِ الأَعْمَشِ‏.‏",
                "headingArabic": null,
                "headingUrdu": null,
                "headingEnglish": null,
                "chapterId": "63",
                "bookSlug": "sahih-bukhari",
                "volume": "5",
                "status": "Sahih",
                "book": {
                    "id": 1,
                    "bookName": "Sahih Bukhari",
                    "writerName": "Imam Bukhari",
                    "aboutWriter": null,
                    "writerDeath": "256 ھ",
                    "bookSlug": "sahih-bukhari"
                },
                "chapter": {
                    "id": 63,
                    "chapterNumber": "63",
                    "chapterEnglish": "Companions of the Prophet",
                    "chapterUrdu": "نبی صلی اللہ علیہ وسلم کے اصحاب کی فضیلت",
                    "chapterArabic": "كتاب فضائل الصحابة",
                    "bookSlug": "sahih-bukhari"
                }
            }
        ],
        "first_page_url": "https://hadithapi.com/api/hadiths?page=1",
        "from": 3476,
        "last_page": 1619,
        "last_page_url": "https://hadithapi.com/api/hadiths?page=1619",
        "links": [
            {
                "url": "https://hadithapi.com/api/hadiths?page=139",
                "label": "&laquo; Previous",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1",
                "label": "1",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=2",
                "label": "2",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=137",
                "label": "137",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=138",
                "label": "138",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=139",
                "label": "139",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=140",
                "label": "140",
                "active": true
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=141",
                "label": "141",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=142",
                "label": "142",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=143",
                "label": "143",
                "active": false
            },
            {
                "url": null,
                "label": "...",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1618",
                "label": "1618",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=1619",
                "label": "1619",
                "active": false
            },
            {
                "url": "https://hadithapi.com/api/hadiths?page=141",
                "label": "Next &raquo;",
                "active": false
            }
        ],
        "next_page_url": "https://hadithapi.com/api/hadiths?page=141",
        "path": "https://hadithapi.com/api/hadiths",
        "per_page": 25,
        "prev_page_url": "https://hadithapi.com/api/hadiths?page=139",
        "to": 3500,
        "total": 40465
    }
}